{
  "source": "https://www.techradar.com/reviews/mindomo",
  "title": "Mindomo mind mapping software review",
  "category": "computing",
  "updated": "2020-07-23T14:08:36Z",
  "author": "katie-horne",
  "summary": "Freemium mind mapping app for users of all types",
  "verdict": "Robust mind mapping app with a solid set of features and functionality",
  "pros": [
    "Offers a free plan",
    "Comes with desktop and mobile apps"
  ],
  "cons": [
    "Limited availability of technical support",
    "Documentation could be better"
  ],
  "article": [
    "Mindomo is a collaboration tool that facilitates the creation of mind maps, concept maps, outlines, Gantt Charts, and other types of non-linear visualization so that you can get your ideas out on “paper” with ease.",
    "It advertises that its product is helpful for teaching and learning, planning out work products, and organizing your personal life. It is a “freemium” product, which means that base usage is free, though premium features can be had with a paid subscription.",
    "Mindomo offers a free plan, as well as two tiers of paid subscription options. The first tier of paid plans is geared toward those using Mindomo for work or personal reasons, while the second tier is geared toward those in education. Each tier comes with three different plans from which you can choose.",
    "Mindomo’s free plan includes support for up to three mind maps and comes with the ability to share, publish, and collaborate on your mind maps.",
    "Prices for these plans begin at $6 per month, and they include the ability to:",
    "If you need more (either in terms of features or to obtain additional user licenses), you can upgrade to either the Professional or Team plans. These plans add features like guest editing, integration support for with Dropbox, OneDrive, and Google Drive for backups, shared team folders, and additional export formats.",
    "If you are in education, there are three Mindomo plans from which you can choose. The education plans are slightly cheaper than the Work and Personal plans, but they also come with the features students and teachers need instead of the business-oriented ones.",
    "For example, you would get access to education instead of business templates, a large number of student accounts, and integrations with educational management platforms like Canvas, Blackboard, and Moodle.",
    "Prices for an education plan begin at $3 per month for a single user.",
    "Mindomo’s bread-and-butter offering is its mind mapping tools. You can create one from scratch, but you can also get started using one of the business or education templates that come with a paid subscription. To edit your mindmap, you have access to a web-based editor that should look familiar if you’ve used productivity tools like Microsoft’s Office suite or Google’s G Suite.",
    "Mindomo also offers an outline mode, which allows you to create content in a linear format. This complements the non-linear mind maps that you can also create with Mindomo. If you want to convert your outline into a mind map (or vice versa), Mindomo allows you to do so.",
    "To share your creations, you can export your files (Mindomo currently supports twelve different export types), or you can invite individuals to collaborate directly on the file itself. Mindomo also offers you the ability to share the file (without allowing collaboration) either with or without password protection.",
    "Mindomo offers a simple, clean, easy-to-use interface. Its UI/UX isn’t the most cutting-edge, but it does not appear overly dated either.",
    "Premium users get access to a desktop version that is similar to the web-based app. Mindomo also offers Android and iOS apps that offer its users a simplified UI. These apps maintain most of the functionality available in the web-based or desktop apps, but manipulating larger graphics can be challenging.",
    "If you have questions or concerns, you can reach out to the Mindomo team via email. Be aware, however, that the Mindomo team is located in Romania, which may affect when you receive a response to your question.",
    "If you prefer to use self-help resources, the Mindomo team has created some simple documentation and video tutorials. The material isn’t extensive, but it is enough for you to get started.",
    "Mindomo is a solid mind mapping tool, but there are alternatives available if Mindomo doesn’t fit into your budget or if you want something with additional features (such as reporting and analytics).",
    "If you want a mind mapping tool that is 100% free, and you don’t mind using something that features a fairly dated and clunky UI/UX and doesn’t come with customer support, consider FreeMind. FreeMind is a powerful tool, but these drawbacks may make the product unappealing to many users. Nevertheless, you can’t beat the fact that FreeMind is free to use.",
    "Lucidchart is a premium mind mapping tool, but it offers some of the best value around in terms of price and features. Its UI/UX is one of the best we’ve seen, and it includes robust collaboration tools, support for analytics integrations, and more. Despite all of the features and functionality included, Lucidchart is fairly simple to learn and get started with.",
    "Mindomo is a mind mapping tool that comes with very interesting features and is offered at a fair price. We found the ability to create both linear outlines and non-linear mind maps (as well as the ability to convert back and forth between the two) useful, and we liked that there are multiple ways you can use the app (e.g., web, desktop/laptop, mobile).",
    "There’s not much we don’t like about Mindomo, but if you want to integrate it with analytics/reporting tools, you may want to look elsewhere."
  ],
  "headers": {
    "2": "Plans and pricing",
    "9": "Features",
    "12": "Interface and In Use",
    "14": "Support",
    "16": "The Competition",
    "19": "Final verdict"
  },
  "links": {}
}