{
  "source": "https://www.techradar.com/reviews/tunnello",
  "title": "Tunnello review",
  "category": "computing",
  "updated": "2020-12-09T19:57:25Z",
  "author": "sead-fadilpasic",
  "summary": "Protects your privacy and unblocks content",
  "verdict": "Tunnello is a solid solution for anyone who wants to preserve their privacy and anonymity online while also being able to access lots of geographically restricted content. That said, its unremarkable speeds may present a problem when trying to retrieve streaming content further away from your physical location.",
  "pros": [
    "Unblocks Netflix, BBC iPlayer",
    "7-day free trial",
    "Very straightforward"
  ],
  "cons": [
    "Unimpressive speeds",
    "Only a Chrome extension for desktop",
    "No iOS app",
    "No money-back guarantee"
  ],
  "article": [
    "Tunnello is a relatively new provider of anonymity services that started its road to success in 2016 when the idea was concocted by three friends. After a year of intense work and improvement, the group released its flagship product.",
    "This isn’t exactly a full VPN platform (yet) as it doesn’t have native apps for various desktop or iOS devices. However, it is a capable Chrome extension and an Android app that comes pretty close to an actual VPN in most matters, except the support for torrenting on desktop and the above-mentioned native apps. It is more of a mix between a VPN and a proxy than a VPN itself.",
    "This provider keeps its pricing options simple - you get to choose between monthly and annual subscription. The monthly will cost you €5.99/month ($7.03), while the annual plan comes with a price tag of €3.75/month ($4.40).",
    "Both options include a 7-day free trial, although you’ll still need to sign up for a subscription and cancel before the seven days are up if you don’t want to be charged for the selected amount. The account can be easily canceled via the provider's online control panel.",
    "That said, make sure you truly test out the platform to the maximum within these 7 days because once you’re charged for a subscription, you won’t be able to get a refund since there's no money-back guarantee.",
    "Accepted payment methods include credit cards, PayPal, Alipay, and Bitcoin. One account will allow you to run a VPN connection on up to 5 devices at the same time.",
    "While Tunnello may be enough for many (modest) users, it still falls short in many areas. It doesn’t have blazing speeds like ExpressVPN, thousands of servers like NordVPN, a generous 45-day money-back guarantee like CyberGhost, or low prices like Surfshark, all of which provide native clients for all major platforms, enveloping your entire household and all of your devices inside a secure VPN bubble.",
    "Providing access to popular streaming services like Netflix and BBC iPlayer that are often blocked in certain regions for various reasons is one of the most sought-after qualities in a VPN provider. As long as you’re viewing this content in Chrome, Tunnello will get you through their geographical blocks and allow you seamless streaming.",
    "The company behind this service, Tunnello SAS, is headquartered in Colombes, France. It provides access to around 110 servers in 14 countries around the world, including in the UK, US, France, Canada, Italy, Germany, Spain, the Netherlands, China, Switzerland, India, Japan, Russia, and Hong Kong. According to the website, you can reach out to the provider on Facebook or Twitter to ask about additional locations.",
    "Tunnello encrypts your connection inside an uncrackable AES-256 tunnel over an RSA-4096 bit certificate (SHA-512) for key exchange, covering any DNS leaks, and efficiently preventing anyone from spying on your online activities. It doesn’t use the traditional OpenVPN or PPTP VPN protocols, but instead deploys “a home-made technology that makes our VPN undetectable,” making it a great option for users in restrictive regimes like China.",
    "The provider’s privacy policy doesn’t provide many details on its no-logging practices, but we can draw some conclusions from this rather large and sometimes technically confusing online document, filled with legal vocabulary. Some of the things we learned include guarantees that Tunnello doesn’t perform deep or shallow packet inspection of your traffic unless requested for firewall purposes.",
    "It also doesn’t “resell nor provide the information that identifies an individual or usage information to investigators, attorneys, or agencies unless required by a competent course of justice. If there is a hearing in court, the member will be notified so they will have the opportunity to contest the surrender of personal information.”",
    "Tunnello for desktop is merely a Chrome extension so you cannot use it for private torrenting. Instead, it will allow you to access the Pirate Bay website in regions where it may be blocked. That said, torrenting is possible on Android devices.",
    "Thanks to its Chrome extension and Android app, customers can use Tunnello on a number of devices, including Windows, Mac, Linux, and Android (although no iOS). Apps for Windows, Mac, and iOS are currently in the works.",
    "More than 90,000 users have installed the Tunnello extension on their Chrome browsers. Out of that number, 2,967 have rated it, giving it a median score of slightly over 4 stars (out of 5). It was last updated on June 2, 2020.",
    "As for its Android app, it has been given 3.3 stars (out of 5) by 339 users. The app was last updated on October 13, 2018, and has so far been installed by over 50,000 people.",
    "If you run into any problems while using Tunnello or you’re simply curious about its platform, you can consult the support center as it has a modest collection of instructions and answers to frequently asked questions. In case this approach fails to give you the information you were looking for, you’re invited to direct your questions to the customer support, which is available via email. That said, our attempts at contacting the support seem to have fallen on deaf ears.",
    "Even though Tunnello claims to be “the only VPN that compresses your data before sending it through the private connection” and thus doesn’t reduce your connection speed, its download speeds were well below average.",
    "We first tested a server in France which delivered 9.20Mbps on a 70.20Mbps testing connection. Then it was Canada’s turn and it performed even more poorly, with only 2.81Mbps. We also tried India, without expecting much and we were correct - the speeds barely reached 2Mbps.",
    "Switching servers required disconnecting from the current one and then connecting again to the desired server location. The Chrome extension itself is very minimalistic, with “Patch WebRTC Leak” being the only option available in the settings. The same goes for its Android app, which has only two options in its Settings menu: Auto-Connect and Hotspot Protection.",
    "If they keep up with the good work, the guys and gals behind Tunnello have a bright future ahead of them. Their small yet handy platform can provide access to today’s popular geographically restricted streaming content, some torrenting, as well as a chance to test it out under a 7-day free trial.",
    "On the other hand, it does have some problems to deal with, such as the poor speeds that may be due to a low number of servers or simply the quality of the infrastructure. It also lacks native clients for major platforms.",
    "While the Chrome extension may be enough for some, more serious users require apps for each of their devices, iOS included. Therefore, Tunnello will need to intensify its efforts if it intends to ever be as well-known as the industry giants such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "13": "Support",
    "17": "Speed and experience",
    "20": "Verdict"
  },
  "links": {
    "Tunnello": "https://tunnello.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "proxy": "https://www.techradar.com/best/proxies",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Facebook": "https://www.facebook.com/tunnello.community",
    "Twitter": "https://twitter.com/Tunnello_VPN",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "privacy policy": "https://tunnello.com/privacy-policy/",
    "firewall": "https://www.techradar.com/best/firewall",
    "Chrome extension": "https://chrome.google.com/webstore/detail/tunnello-vpn-unblock-ultr/hoapmlpnmpaehilehggglehfdlnoegck?hl=en",
    "Android app": "https://play.google.com/store/apps/details?id=tunnello.android",
    "Windows": "https://www.techradar.com/news/best-windows-laptop",
    "Mac": "https://www.techradar.com/best/best-business-mac",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "support center": "https://tunnello.zendesk.com/hc/en-us",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-2491825745457444400"
  }
}