{
  "source": "https://www.techradar.com/reviews/rad-power-radmission-1",
  "title": "Rad Power RadMission 1 review",
  "category": "fitness",
  "updated": "2021-12-07T11:54:28Z",
  "author": "rob-clymo",
  "summary": "The Rad Power RadMission 1 is a low-key no-frills affordable e-bike",
  "verdict": "The RadMission 1 continues Rad Power Bikes' philosophy of producing great value electric cycles. It might come with fewer features than pricier models, but that doesn’t take anything away from its appeal. This is a get-on-and-go bike, which while it doesn’t turn heads will get you from A to B with as much, or as little electric assistance as you want.",
  "pros": [
    "A great ready-to-go e-bike",
    "Good value given the specification",
    "Ideal for all kinds of riders"
  ],
  "cons": [
    "Some compromises on quality of components",
    "A few issues fitting accessories",
    "Base model is just that"
  ],
  "article": [
    "There’s a lot to like about the Rad Power Bikes RadMission 1 and much of that comes from its stripped-back-to-basics design. Fresh out of the box, minus any accessories, this is an electric bike that looks like it’s raring to go.",
    "Backing that up is a beefy battery and hub motor combination that provides gearless single speed thrills for riders of all sizes and skill levels. Performance is more than adequate for most cycling situations, and the dynamic pedalling experience is a deliciously simple one. Variable assistance is there if you want it. Crucially, the RadMission 1 stops as nicely as it accelerates thanks to its powerful disc brakes.",
    "In fact, considering this is a no frills e-bike, the specification feels about right given the reasonable ticket price. While it’s a workhorse that can be used by anyone in your family, the RadMission 1 is low-key enough to not attract the attention of thieves, mainly due to a very understated design. That’s a good thing if you’re commuting, but equally useful during day-to-day casual use too.",
    "Add it all together and the RadMission 1 is a tempting proposition that is pretty much good to go right out of the box.",
    "The Rad Power Bikes RadMission 1 started shipping in October 2020, with an introductory price of €1,099 in Europe and $1,099 in the US (about £1,000 / AU$1,800).",
    "The Rad Power Bikes RadMission 1 is all about simplicity. On first glance, it could be just another non-electric bike, such is the design. Look a bit closer though and there are plenty of features that add value.",
    "However, Rad Power Bikes has also been cultivating its design ethos of late, with older bikes in the range like the RadWagon electric cargo bike also getting a recent makeover.",
    "As such, the RadMission 1 arrives with some neat flourishes. There are two aluminium frames to choose from, mid-step, which comes in either black or white and high-step with black or grey finishes on offer. Our test bike was a white mid-step example. The battery, which is the only real giveway this is an e-bike, is prominently displayed on the downtube, but the styling is a little more aesthetically pleasing than earlier bikes.",
    "The bike also features a new 48V 10.5Ah 504Wh battery. At 3kg, this is nearly 1kg lighter than Rad Power Bikes' standard battery pack, but still offers the same 45-80+ km range. It can be charged in situ using the supplied cable pack, or unlocked and removed.",
    "The wheels are spoked aluminum 27.5\" x 1.95\" rims, and carry Kenda Kontact tyres. Our European model had the reflective sidewalls and the overall effect is great, especially against the white frame of our test bike.",
    "Adding to the slender lines of the RadMission 1 is the way the drive-train is single speed. No derailleur arms or needless gears here, so it’s all pretty minimalist. At the rear, the 250W geared motor hub, resplendent in black, barely registers as you pick your way around the bike for the first time.",
    "The icing on the cake comes from some Rad Power Bikes flourishes, including integrated lights with the rear one acting as a brake light too, flat comfy handlebars and a functional rather than comfy saddle.",
    "Those handlebars feature, on your left as you ride, a no-nonsense LED control panel, which features one push on and one push off power. Assistance can be altered by pressing on the + or – buttons, while LEDs show you the level of help you’re getting from the motor and how much life is left in the battery. You can also switch the lights off and on via this unit. The right-hand side grip offers a twist power assist feature, which we’ll get to shortly.",
    "We were very keen to get on and head off for a spin on the RadMission 1 e-bike. It looks very tempting. Without any of the optional accessories, most notably the full mudguards we got with our example, it almost looks like a bike you could have made yourself. That’s a compliment too, incidentally. However, our first ride was delayed a little trying to fix those mudguards on thanks to a stubborn screw behind the crank that simply wouldn’t budge.",
    "You’ll need to put some more air into the tires and top up the battery before your first run, but aside from that the RadMission 1 will be good to go. This is a great bike if you don’t want to spend any time acquainting yourself with the controls. Simply turn on the battery pack using the ignition key-style assembly on the battery pack, press the power switch on the handlebars, select the level of assistance and away you go.",
    "There’s the twist power assist on the right side of the handlebars, which delivers a handy tweak of power to get you underway, but we didn’t end up using it as much as we’d expected. You can adjust the levels as you go, which is easy enough, but otherwise all you need to do is pedal. Not having any gears, or indeed anything else to worry about means the RadMission 1 gets on down the road very nicely indeed.",
    "This is a rigid frame bike, with forks to match, but those mid-size tyres offer some sanctuary on rough surfaces and make the overall cycling experience quite forgiving all things considered. We were also sufficiently impressed with the Tektro disc brakes, front and rear. They were European specification, which meant the front brake was on the left, but you sit quite upright on this e-bike so you never feel like you’re going to inadvertently get thrown over the handlebars if you forget.",
    "The saddle isn’t one of the comfiest in the Rad Power Bikes portfolio, but it does the job and features a quick-release for on-the-spot adjustment (as does the front wheel).",
    "Doing a good few kilometres for our first run, and on a mix of roads, cycle paths and gravel park cycleways, the RadMission 1 delivered enthusiastic handling. It actually feels like you can throw it around a bit, which adds to the fun factor no end.",
    "As with the other Rad Power Bikes models we’ve tried, battery life never really appears to be an issue. We had plenty of use out of the bike and it still doesn’t need a full charge. Our non-scientific verdict on the power supply is that it’s more than adequate for normal use though Rad Power Bikes official figure is 80+ kilometres on a charge. Start putting in some regular lengthy commutes and that could change, but with commuting going out of fashion like old-school non-powered bikes, is that really an issue?",
    "First reviewed October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "5": "Design",
    "13": "Performance",
    "21": "Don't buy it if"
  },
  "links": {
    "Rad Power Bikes RadMission 1": "https://classic.avantlink.com/click.php?tt=cl&mi=15885&pw=27131&ctc=trd-us-6753033592418115000&url=https%3A%2F%2Fwww.radpowerbikes.com%2Fproducts%2Fradmission-electric-metro-bike",
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "electric cargo bike": "https://www.techradar.com/news/would-you-trade-in-your-car-for-this-e-bike"
  }
}