{
  "source": "https://www.techradar.com/reviews/beevpn-review",
  "title": "BeeVPN review",
  "category": "computing",
  "updated": "2020-12-09T19:37:24Z",
  "author": "sead-fadilpasic",
  "summary": "Might be a decent VPN, but we couldn't access the service",
  "verdict": "Judging by the website, BeeVPN once offered a desirable suite of features. Unfortunately, our account was never activated, leaving us wondering whether the service is still live.",
  "pros": [
    "Very informative website",
    "Operates its own servers",
    "Unlimited simultaneous connections"
  ],
  "cons": [
    "Never activated our account",
    "No response from the customer support",
    "Unsafe and glitchy website",
    "Exorbitant prices"
  ],
  "article": [
    "BeeVPN began its story in 2010 when it launched the first DTLS-based VPN service over the open-source Cisco AnyConnect client.",
    "However, when we attempted to sample the platform, our account was never activated and nor did we receive any feedback from customer support. For this reason, we recommend you stick with the tried-and-tested VPN platforms in our best VPN guide.",
    "BeeVPN offers three subscription plans: the 1-month option at €11.99/month ($14.05), 3-month at €7.99/month ($9.35), and 12-month at €6.59/month ($7.71).",
    "For an additional €1.19/month ($1.43), users were once able to get a mobile add-on that allowed them to use BeeVPN on their phones, iPad, and router. These rates make the provider quite an expensive one, even with unlimited simultaneous VPN connections.",
    "Payment methods accepted when paying for the services include credit cards, PayPal, and Bitcoin. Paying with PayPal incurs an additional fee of €0.89 ($1.05).",
    "There's a 14-day “full money-back-guarantee” if you're not fully happy with the service, but our account was never activated, so we didn't get the chance to see if this is true.",
    "Even though its website may give the impression of a solid VPN service, we aren't sure if BeeVPN is even active anymore. As an alternative, you should consider VPNs that are truly leaders in their field, starting with the top dog ExpressVPN, followed by close rivals NordVPN, Surfshark, and CyberGhost.",
    "All of these are amazing platforms that are focused on providing you with the best possible VPN experience. In fact, they’re so confident of their capabilities that they offer lengthy money-back guarantees with each of their subscription packages.",
    "Not all VPNs are capable of providing you with access to renowned VOD platforms like Netflix, BBC iPlayer, Hulu, etc. that are blocked in certain regions, but BeeVPN claims to.",
    "BeeVPN ApS is a company registered in Denmark, with headquarters in Hørsholm. According to the company, its unique selling point is the fact that it runs and manages its own servers instead of using third-party outsourced servers, giving it full control over how your information is treated.",
    "The servers use Cisco hardware and BeeVPN software and are scattered all over the world, including in the United Kingdom, United States, France, Denmark, and Sweden, but there’s no information about how many of them there actually are.",
    "According to the website, BeeVPN uses 256-bit AES encryption, per-packet encryption, as well as DTLS and IPSec connection protocols. If you manage to get your account activated, the provider also claims to have three types of firewalls you can control in your customer area on the website.",
    "Some organizations may want to limit your use of torrenting and P2P clients by actively blocking them. BeeVPN claims to be able to prevent these entities from blocking your torrenting or ever finding out your true identity.",
    "We couldn't find the provider's Privacy Policy anywhere on the website, so we can't tell if any logs are kept.",
    "BeeVPN doesn’t have its own native clients but instead operates via Cisco AnyConnect Secure Mobility Client for Windows, Mac, and Linux. Other supported platforms used to include iOS, PlayStation, Apple TV, and routers.",
    "The vendor claims to have a “24x7x365” customer support via email for general inquiries or customer support, but we failed to receive any response to our queries.",
    "We had significant problems signing up because most links redirected us back to the homepage, not to mention that the website's security certificate has expired. When we finally succeeded and were charged for a subscription, we realized our account wasn’t even activated and customer support was unresponsive on the matter.",
    "BeeVPN’s website is detailed, informative, and nicely designed, which is why we were convinced that this was still a working VPN platform.",
    "Unfortunately, this no longer seems to be the case as the company failed to activate our account, return our money, or respond to our emails. Instead of risking disappointment, consider opting for an alternative, such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "11": "Privacy and encryption",
    "14": "Support",
    "16": "Speed and experience",
    "17": "Verdict"
  },
  "links": {
    "BeeVPN": "https://www.beevpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "such as ExpressVPN": "https://www.xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-5541824988482401000"
  }
}