{
  "source": "https://www.techradar.com/reviews/razer-blackshark-v2-pro",
  "title": "Razer BlackShark V2 Pro review",
  "category": "computing",
  "updated": "2020-12-03T04:25:54Z",
  "author": "ural-garrett",
  "summary": "Premium wireless gaming headset at a premium price",
  "verdict": "The BlackShark V2 Pro is an exceptional wireless gaming headset matching its premium price point. The build caliber, sound quality and battery life are all praiseworthy despite some small issues. THX Spatial Audio enhances the audio experience significantly, becoming a huge feature. Too bad the required app adds even more to the cost and isn’t readily compatible with major devices.",
  "pros": [
    "Premium build that’s comfortable",
    "Great sound quality",
    "Razer’s THX Spatial audio app allows fine audio customization",
    "Works well as non-gaming headphones",
    "Battery quality"
  ],
  "cons": [
    "Isn’t fully compatible with consoles",
    "Could use a better battery level indicator"
  ],
  "article": [
    "Razer BlackShark gaming headsets focus primarily on three attributes: positional audio, communication clarity and noise cancellation. During pro-level esports play, those characteristics are incredibly important in maintaining a competitive edge.",
    "This new Razer BlackShark V2 improves upon its predecessors through the TriForce Titanium 50mm drivers, removable HyperClear Supercardioid Mic, Ultra-soft FlowKnit memory foam ear cushions, passive noise cancelation and THX Spatial Audio for surround sound. For the feature heavy BlackShark V2 Pro, wireless capabilities are added into the mix alongside a 24 hour battery life. Audio latency also becomes nearly non-existent and sound quality remains consistent thanks to Razer’s HyperSpeed 2.4GHz connection.",
    "The BlackShark V2 Pro is a fantastic wireless headset that’ll work well for general gaming or anyone with esports aspirations. Console support is a bit wonky, so this is for PC gamers through and through. This is due to the THX Spatial Audio app that enhances the sound of games, movies and music. Thankfully this $19.99 (£19.99, AU$34.95) piece of software is included with the $179 (£179, AU$299) entry point. Still, the BlackShark V2 Pro is a premium wireless headset for PC gamers who can care less about price.",
    "Featuring everything included in the standard V2 alongside the added wireless capabilities, the BlackShark V2 Pro weighs only 320g, 58g more than its wired sibling. The added weight isn’t noticeable at all. Wearing the headset feels great due to the adjustable frames that are solid in structure. Moving around with the BlackShark V2 Pro doesn’t require many adjustments as the headset stays glued to your head. The FlowKnit memory foam ear cups and headband cushion allows both short and long gaming sessions to be comfortable experiences.",
    "Set up is fairly easy, too. Once the Razer HyperSpeed 2.4GHz USB dongle is plugged in, just hold the power button until the headset connects. The left cup also features a volume dial that clicks at the halfway point making adjusting loudness more intuitive. A micro-USB port for charging, 3.5 headset jack and microphone switch occupies the left cup as well.",
    "A small status indicator light doubles as notifications for both connection confirmation and battery status. Unfortunately, there isn’t a real way to know how much battery life is left outside of the light turning red at 30 percent and blinking red at 10 percent. Razer’s Synapse app is the only way to get a real idea of how much charge is left. It’s represented by a small graphic that lacks any kind of percentage indicator. Thankfully, the 24 hour battery life under heavy use is fully chargeable in about three hours. There’s also an automatic Power Saving mode that’ll shutdown the headset after various selectable minutes.",
    "From singleplayer to multiplayer and from wired to wireless, the BlackShark V2 Pro shines. The basic stereo headset sonic functions are rich sounding in more single player driven games like Doom Eternal, Last of Us II and Gears 5. Multiplayer games requiring constant communication including Call of Duty: Modern Warfare or Among Us sound just right.",
    "Passive noise cancelling brought by the FlowKnit memory foam ear cushions reduce outside noise specifically. Audio settings can be adjusted through the Synapse app’s audio interface for things like the equalizer and bass boost. General music listening hits all the right notes with clear mids and bass that’ll handle anything listeners throw at it.",
    "Those willing to download the separate THX Spatial app are in for a treat as it’s the only way to utilize the 7.1 surround sound. Games that specifically support the option like Call of Duty: Modern Warfare and Doom Eternal sound even better. The amount of fine tuning that can be done from the customizable equalizer to the surround sound collaboration tool is noteworthy. Offering support for other audio output devices is a huge plus. Too bad it only works on PC. Though the headset’s wireless receiver works on Playstation 4, Xbox One users are going to have to use the audio jack.",
    "A premium cost matching its premium package, the BlackShark V2 Pro is one of the best esports-centered gaming headsets money can buy. The sound quality is outstanding across the board from gaming to general music listening. THX’s Spatial Audio adds much to the listening experience if users are willing to pay the extra cost for it. For a wireless headset, the battery life is more than adequate. PC gamers looking for a quality headset have found their audio champion."
  ],
  "headers": {
    "0": "Two minute review",
    "10": "Don't buy it if..."
  },
  "links": {
    "gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Last of Us II": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "Call of Duty: Modern Warfare": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review"
  }
}