{
  "source": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
  "title": "Assassin's Creed Valhalla review",
  "category": "gaming",
  "updated": "2020-11-10T15:11:26Z",
  "author": "stacey-henley",
  "summary": "An overwhelmingly large open world that only shines in the smaller moments",
  "verdict": "Assassin’s Creed Valhalla can't sustain its own open world and doesn't have a story worth caring about, but Eivor's broad shoulders do just about enough to carry the latest Viking-inspired chapter in the veteran series. Other open-world games deliver the tried and tested formula better, but Valhalla offers an enjoyable experience buoyed by the smaller adventures you have along the way.",
  "pros": [
    "Funniest game in the series",
    "Eivor is brilliant protagonist",
    "Every hub bursts with life",
    "Huge open world"
  ],
  "cons": [
    "Open-world can feel sparse in places",
    "Plot never gets you invested",
    "Combat can feel messy"
  ],
  "article": [
    "Assassin's Creed Valhalla sees the veteran stealth series return after taking a year off from its annual release cycle, but there's not much evidence Ubisoft has benefited from the extra development time.",
    "This time around, the series is set during the Viking invasion of England, with you taking on the role of raider Eivor. And, given the latest Assassin’s Creed chapter is set in a time period synonymous with looting and pillaging, it’s no surprise that Valhalla brings with it much more aggressive and chaotic combat.",
    "At times, Valhalla's gameplay often harkens back to the more classic combat of Assassin's Creed II, and the series rediscovers the sense of humor and rugged silliness which has been missing since Black Flag. The series often takes itself a little bit too seriously, so it's great to see Ubisoft embrace a more jovial tone.",
    "But old habits die hard and Ubisoft still believes that bigger is better, creating a game full of wide-open spaces populated with little more than a handful of scattered collectibles.",
    "Unfortunately, size isn't everything, and cutting down on these sparser areas could have brought more focus to the concentrated experiences of the smaller villages, which we found much more fun than treks across fields or the turgid longboat trips through narrow rivers.",
    "While a too-large and too-empty open world is a traditional issue with the series, Eivor is far from a traditional assassin. They even wear their hidden blade atop their wrist, making it no longer hidden - although stealth still plays a substantial role in the game.",
    "Much like Edward Kenway in Black Flag, they sort of stumble into being an assassin, but the game struggles to make use of this more interesting premise. Instead, Eivor largely has a Viking story, with bits and pieces of Assassin lore and Animus narrative disrupting the pacing sporadically but consistently.",
    "While Valhalla is somewhat of a departure from its predecessors, it holds its own as an open-world action adventure, taking the Assassin's Creed formula and building on it with a brilliant sense of humor, aggressive combat, and a protagonist who adds something new to the lineup of series assassins. But we can’t help but feel it wastes its potential in extremely predictable ways.",
    "Assassin's Creed Valhalla is a very competent game. There's far too much polish and too much content for anyone to have any major problems with it. But when held up against its open-world peers, it finds itself in their shadow in almost every category.",
    "Hunting is far less sophisticated than in Red Dead Redemption 2, and less enjoyable than previous Assassin's Creed titles. Exploring the open world is a bore compared to the likes of Horizon Zero Dawn or The Witcher 3. Combat, while given some depth through a range of weapons, feels too button mashy, and not a patch on Ghost Of Tsushima.",
    "The most frustrating part is it doesn't need to be this way. Modern gaming has a bit of an issue with thinking 'bigger is better', and Assassin’s Creed has long been one of the worst offenders. After taking a break from yearly releases for the first time in over a decade, it’s disheartening to see the problem has still not been addressed.",
    "What's most frustrating is that Assassin's Creed Valhalla shines in the small moments in the village hubs, where you can talk to the colorful cast, engage in drinking contests, or even have a flyting showdown, which is essentially an insult rap battle.",
    "However, it feels like there's a desperation to push you towards the big blockbuster story twists, though we found we were rarely invested enough for them to have an impact, mostly because the central characters of each region lack the development and elevated writing of the minor ones about town.",
    "Thematically, Valhalla is sure to be compared to God Of War, and it would have done much better to move closer to the tight, focused design of Kratos' Midgard. Instead, there’s an eagerness to show off Valhalla’s scale, with connected quests often beginning at opposite points of a region - sometimes even going into a new region - to push you to wander over every blade of grass.",
    "Over time, you unlock enough fast travel points that you can largely avoid traveling, but that’s a solution which shouldn’t need to exist. You can explore on foot, ride a horse, or sail in a longboat, but the game manages to drain the fun out of all of them.",
    "On foot, you get more chances to discover neat little secrets, but it takes far too long. The horse speeds things up, but it feels lacking in personality and, while horseback combat is possible, it often doesn't quite work how it should.",
    "Sailing meanwhile is difficult to navigate, has its rhythm disrupted constantly by bridges, and doesn’t actually seem that much faster than running. We found the biggest issue with both horseback and longboat is that you can set them to automatically to your quest marker, but they don't always take the fastest route and never get there faster, they just leave you waiting while your horse gallops from one end of the map to the other.",
    "And while there's a cinematic camera which is brilliant when sailing, it resembles a student film when on horseback. It shakes and bounces in a vain attempt to convey action, and often centers on the horse's bum rather than the majesty of Saxon-era England.",
    "The reason Valhalla does better in its minor moments is because it's hilarious. Gameplay wise it might fall short of its competition, but its wit and willingness to be silly are second to none.",
    "There's one mission where you need to help a man get an erection by burning his house down, so he and his wife can recreate their first time, which happened during a pillage.",
    "Eivor is perfectly pitched for this tone too; they're dry but occasionally naive, pairing a sharp intellect with a blunt delivery. Edward Kenway, of Assassin's Creed IV: Black Flag, has always been the black sheep of the assassin family, but in Eivor, he has a kindred spirit at last.",
    "The game offers you the choice of playing as male Eivor, female Eivor, or the 'default' setting, where the game will flip between the two choices at set times in line with choices made by the Animus.",
    "The explanation for the automatic switch makes sense - as much as anything in the convoluted Animus lore does - but it feels like Ubisoft is just trying to solve a problem it created itself. Female Eivor has been almost completely absent in the marketing but, having played as both Eivors, it feels like she's a much better fit for the story.",
    "Male Eivor is a very bombastic creature, full of shouting and bloodlust and theatrics. He's a great Viking, but he's not this Viking. Male Eivor arguably blends in too much with his compatriots, while female Eivor stands out from the crowd.",
    "We felt that she fits the game's humor much more, suits the game's subtler lines more, and is a more interesting character to control through conversations. It feels like the game would benefit from female Eivor being the sole protagonist, and it would have been interesting to see an Assassin's Creed Valhalla bold enough to stick with her alone.",
    "Whatever version of Eivor you play as, you will likely find that the game takes a while to get going, but eventually shrugs off the weighty open world and becomes a much more fluid experience.",
    "You still have to travel long distances as the map grows ever larger with each mission, but they feel less cumbersome once you’re in-step with the Valhalla's rhythm.",
    "The main reason it takes so long to get up to speed is that the game's plot struggles to decide exactly where Eivor stands, and why they're even fighting. You leave Norway not because of persecution or tragedy, but because the clans are united and peace is declared, and peace is boring.",
    "You therefore sail to England, where your goal is… to unite the clans and declare peace. Yes, there's a bit more to it than that, and Valhalla confronts the differences between Sigurd - who actually leads the charge to England - and Eivor well enough as the story goes on, but it definitely makes it hard to become invested.",
    "There's a sense of carnage to the pacing too, fitting perhaps for the Viking era, but difficult to keep up with at times, and far too slow at others. In fact, this sense of carnage can be found everywhere in the game.",
    "The battles look fantastic, especially as you unlock special weapons and more varied abilities, but play out in a very repetitive fashion and it can often be confusing to figure out who's actually on your side.",
    "Equally, the graphics and the visuals are gorgeous, but we ran into several bugs too. Twice the game froze and needed to be rebooted, we were once told we were in a forbidden area but were still allowed to explore freely and grab collectibles, and Eivor was once shot in the chest by a wayward, unscripted arrow during a cutscene, but continued unabated.",
    "Much like how Eivor rejects assassin principles while Valhalla embraces the Assassin Creed hallmarks to a fault, this is a game of contradictions.",
    "Assassin's Creed games are very rarely bad, and Valhalla is no exception. It has all the features of a decent open-world game, even if it probably feels better suited to a smaller, more concentrated experience. The world isn't exactly empty, but with a million and one largely repetitive things to do, it often might as well be.",
    "The gameplay and writing in the game's big blockbuster moments is obviously what Ubisoft wants us to care about, but it feels deeply uninteresting when held up against the less consequential but far more enjoyable smaller set pieces.",
    "Chasing lost cats, winning rap battles, and chugging beer is much more fun than completing a string of similar raids in aid of a cynical and hypocritical plot.",
    "If you enjoy open-world games, you will enjoy Assassin’s Creed Valhalla, but it's unlikely to get the 'masterpiece' tag thrown around all too often in this genre. Eivor is the game's high point, especially the female version, and brings back the sillier humor which has been missing since Black Flag.",
    "She still can't do enough to make this game great, but she certainly makes it worth sticking around for, despite the bloated runtime."
  ],
  "headers": {
    "8": "Open-world fatigue",
    "18": "Stop me if you think you've heard this one be-fjord",
    "25": "Baby, we make such a beautiful contradiction",
    "33": "Verdict"
  },
  "links": {}
}