{
  "source": "https://www.techradar.com/reviews/amazfit-bip-s-hands-on",
  "title": "Hands on: Amazfit Bip S review",
  "category": "wearables",
  "updated": "2020-01-09T02:07:49Z",
  "author": "john-mccann",
  "summary": "A cheap and cheerful fitness tracker",
  "verdict": "",
  "pros": [
    "40 day battery life",
    "Low cost",
    "GPS and heart rate monitor"
  ],
  "cons": [
    "Screen is low quality",
    "Feels very cheap",
    "Interface a little slow"
  ],
  "article": [
    "The Amazfit Bip S launched at CES 2020, and promises to offer you a fitness tracker at an extremely low price point.",
    "And the price is indeed low. Huami, the manufacturer behind the Amazfit products, is also responsible for making Xiaomi's incredibly inexpensive Mi Band fitness trackers, so it has strong heritage at the budget end of the market.",
    "Back to the Bip S though, and it boasts a color screen, heart rate monitor and a range of colors.",
    "The Amazfit Bip S release date is set for February, which means there's really not long to wait to get your wrist on this wearable.",
    "As for the Bip S price, you're looking at $69.90 (around £55, AU$100), which comfortably undercuts the Fitbit Charge 3.",
    "The Amazfit Bip S looks and feels cheap... which is okay, because that's exactly what it is.",
    "The plastic body is lightweight at just 31g, and feels durable, while the strap sits comfortably enough around the wrist. It's waterproof up to 5ATM too, which means it can survive a dip in the pool.",
    "There's a single button on the right of the watch - which doesn't rotate, so you can't scroll menus with it - while the display is a touch screen.",
    "Huami says it's increased the range of colors on the screen (versus the original Bip), but it's not the punchy full-color display you get on smartwatches. It looks washed out, and the resolution is low, but it still still readable.",
    "The Bip S may be a cheap fitness tracker, but it does boast a heart rate monitor and GPS, ensuring it's well equipped to track your workouts - even when you don't have your phone with you.",
    "Another big plus is battery life, with Huami claiming the Amazfit Bip S can last up to 40 days on a single charge. That reduces greatly if you use GPS regularly, but it means you'll likely only need to reach for the charger a couple of times a month.",
    "The on-screen interface is simple to use, and it is a little sluggish. The graphics are basic, but there are a range of options including workout tracking, step tracking, heart rate monitoring, phone notifications, stopwatch, compass, weather and music playback controls.",
    "The Amazfit Bip S is a cheap and cheerful fitness tracker for those looking for an inexpensive way to track workouts and steps.",
    "It doesn't offer cutting-edge features, a huge amount of style, or detailed analytics of your health, but considering the price and the fact is packs in both a heart rate monitor and GPS, while also giving excellent battery life, the Bip S could be a budget champion."
  ],
  "headers": {
    "3": "Amazfit Bip S release date and price",
    "5": "Design and display",
    "9": "Features and spec",
    "12": "Early verdict"
  },
  "links": {
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Fitbit Charge 3": "https://www.techradar.com/reviews/fitbit-charge-3"
  }
}