{
  "source": "https://www.techradar.com/reviews/rayvolt-torino",
  "title": "Rayvolt Torino review",
  "category": "appliances",
  "updated": "2020-08-19T12:20:10Z",
  "author": "amy-bonifas",
  "summary": "A head-turning e-bike with serious pedal power",
  "verdict": "The Rayvolt Torino is an intuitive commuter bike with enough presence and pedal power for you to carve your way through the city without breaking a sweat. The clever tech, customizable ride and great range make it a premium e-bike worthy of the price tag, but the hefty 35kg and chunky 26-inch wheels could be a deal-breaker for some.",
  "pros": [
    "Attention-grabbing design",
    "Smooth pedal assist power transfer",
    "Impressive range"
  ],
  "cons": [
    "Weighty (not easy to store)",
    "Stiff ride",
    "Ride settings are only changeable via an app"
  ],
  "article": [
    "The Rayvolt Torino is one of the most high-tech, head-turning e-bikes out there. The intelligent pedal assist system, E-Regenerative braking, electronic torque sensors and an EIVA app that allows you to customise the ride to your liking, all adds up to an impressive and exhilarating experience.",
    "The Torino's standard 48V 504Wh battery pack offers a range of up to 25 miles, or when upgraded to a more powerful 48V 936Wh can breeze along for up to 50 miles, depending on the terrain. Take into account that the average daily driving distance is 25 miles and you’ve got enough juice to get around the city, with no need to charge it on the daily.",
    "Designed in Barcelona, this e-bike has a bold, retro style. The 26-inch tyres, steel frame and combined weight of 35kg make for a sturdy ride (very reassuring for e-bike newbies). The pedal assist helps all this extra weight disappear, but if you’re after something you can lift more easily, try the equally stylish Cruzer (24kg) or Ambassador (20kg).",
    "Best-suited for on-road cruising, the Torino makes light work of hill climbs and glides effortlessly alongside traffic. It’s also great for leisurely rides across town with a handy accelerator mode to help you weave around runners and dog walkers, though venture too far off track and you’ll be in for a bumpy ride as this e-bike has no suspension.",
    "The entry-level Torino will set you back £3,360 (about $4,250 / AU$6060). Increase the battery and customize your design and you’ll be looking north of £3,900. This is a premium e-bike and you get what you pay for, including Rayvolt’s bespoke ‘white-glove’ handover experience – personal delivery of your e-bike and an in-depth rundown of the features.",
    "Overall, the Rayvolt Torino is an intelligently designed e-bike that will bring excitement to your commute. With plenty of zip, it’s agile enough to stand up against city traffic, but not one for a sharp turn or for lugging up stairs. If you’re looking for a statement e-bike with performance to match, then the stylish Torino will suit you very well.",
    "The Torino was launched in Europe last year and came to the UK for summer 2020 – so this is one of the newest rides on the block. The brand’s HQ is in Barcelona and there are hundreds of global dealers.",
    "You can choose from a 200-400w or 250-1000w motor, and a standard 504Wh or upgraded 936Wh lithium-ion battery to give you a range of up to 50 miles. Depending on the power you choose, the price ranges from £3,360 (about $4,250 / AU$6,060) to £3,960 (about $5,010 / AU$7,145).",
    "With hump-backed tubing, retro-style front light and chunky tyres, the Spanish-designed Torino feels more vintage cafe racer than e-bike. The handcrafted steel frame is accented with flashes of copper and leatherwork and you can choose from standard colour ways, or put your own stamp on the design with bespoke colour options and accessories.",
    "It’s easy to set up thanks to the personal delivery service. With all this integrated tech and no gears to worry about, it’s also pretty low maintenance – just a splash of oil on the chain from time to time. Rayvolt recommends an annual check and offers a free first-year check to riders.",
    "The Torino really stands out from the competition because of its lithium-ion battery pack options and its battery management system. Concealed in a leather-bound holder, opt for the larger battery pack and you’ll get a consistent and high power output that lasts for double the range of the average modern plugin-hybrid car.",
    "The charging process is simple, but you’ll need a socket near to where you store the bike as the battery isn’t removable. The Torino comes armed with a 54V 4A Li ion smart charger, which plugs straight into the mains and into the battery compartment on the bike – charging from flat in around six hours.",
    "Dubbed ‘the getaway bike’, the Rayvolt Torino has near-silent power and impressive acceleration, guaranteed to put a smile on your face. One of the best electric bikes for urban commutes and leisurely weekend cruising, it couldn’t have come at a better time as many of our travel and commuting habits are changing.",
    "The sheer power is down to its bespoke brushless three-phase DC motor, which delivers its oomph via a handy thumb throttle (dependent on your country’s legislation) or through a sophisticated pedal assist system. Combining a gyroscopic sensor and a load sensor within the crankset it effortlessly measures your incline, the torque applied through the pedal and the crank’s rotary speed. The result is seamless power delivery, no matter how intense – or lazy – your cycle.",
    "The wide tyres, low centre of gravity and rigid steel forks means you’ll feel the bike biting reassuringly into the tarmac. However, the lack of suspension makes you keen to avoid the potholes and less-established paths. For a more comfortable ride, you can always drop the PSI in the tyres.",
    "When you need to stop in a hurry (hello, rogue pedestrian), the high-quality sealed mineral oil discs with E-Regenerative braking brings you to a smooth and controlled halt. This E-Gen tech – more often seen in electric cars – means that a subtle depression of the brake turns the smart hub motor into a generator that recharges your battery using the kinetic energy lost. Smart stuff.",
    "The EIVA app is a tech lover’s dream, empowering you to fully customize the settings of your ride. Acceleration, top speed, braking power, pedal assist drive mode, throttle usage – you name it, you can tweak it. The only downside is this can be a bit fiddly if you want to switch up the settings mid-ride – you’ll definitely make good use of the solid kickstand."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and release date",
    "8": "Design",
    "12": "Performance",
    "17": "Don't buy it if"
  },
  "links": {
    "Cruzer": "https://www.rayvoltbike.com/product/cruzer/",
    "Ambassador": "https://www.rayvoltbike.com/product/ambassador/",
    "global dealers": "https://www.rayvoltbike.com/dealers/",
    "best electric bikes": "https://www.techradar.com/best/electric-bike"
  }
}