{
  "source": "https://www.techradar.com/reviews/watch-dogs-legion",
  "title": "Watch Dogs: Legion review",
  "category": "gaming",
  "updated": "2020-10-29T16:38:37Z",
  "author": "hirun-cryer",
  "summary": "The hackers assemble a legion to fight back",
  "verdict": "Watch Dogs: Legion is a middling experience. Ubisoft’s sequel manages to pull off some intriguing body-invasion horror with its technological premise, but the forgettable characters, especially within the titular legion itself, leave it a game destitute of feeling.",
  "pros": [
    "Near-endlessly skilled recruits",
    "Multiple paths of experimentation",
    "Technologically-enabled horror"
  ],
  "cons": [
    "Emotionally-stunted allies",
    "A decidedly dull story",
    "Entirely forgettable villains"
  ],
  "article": [
    "Technology is everywhere around us, but that’s nothing new. It was everywhere around us when Watch Dogs began back in 2014, and it’s only more present in our lives six years later. We’ve got an endless list of technology surrounding us in our everyday lives, and Watch Dogs: Legion, like its predecessors, posits that this technology is always being used against us by mysterious assailants.",
    "Watch Dogs: Legion is a game about uniting citizens under the common goal of fighting back against society. The near-future London depicted in Legion has been weaponized against its very citizens by the corporate elite, who use drones, militias, and private information against those inhabiting London. Watch Dogs has always been a series about fighting back against those who would wield technology against the general public, but Legion groups that general public into a force that can capably fight back, making everyday, background characters into meaningful allies.",
    "What Legion doesn’t do so well is provide depth to the citizens making up the faceless army. Each character has their own uses, but Legion instructs you to use them more as tools to overcome problems, and less actual people whose plight you can empathize with. Legion presents plenty of routes to overcoming a challenge, but it’s the people supplying you with these opportunities that ultimately come second to the useful tools they can supply you with.",
    "Like the two games before it, Watch Dogs Legion is a middling experience. There’s genuine fun and experimentation to be had in figuring out how best to assault a stronghold or how to rescue a hostage, but the endless list of auto-generated citizens with their randomized skills and strengths make for an adventure that feels lacking in human emotion and depth.",
    "Watch Dogs has always been about fighting the \"good fight\" against evil corporations, hellbent on bending the population to their will using cutting edge technology. Marcus Holloway fought back against overlords with his friends, and Aiden Pierce was a digital Rambo waging a solo war against corporations. With Watch Dogs: Legion, the key is in the name: you’re leading a literal legion from the streets of London against a technological militia, using anyone and everyone to fight back.",
    "There’s no one “player character” as such in Watch Dogs: Legion. Instead, you’ll need to constantly zip between possessing the bodies of individual members of your insurgents, using whatever skills and weaponry they possess to accomplish the given task. Whether it’s a construction worker with a large construction drone, or a professional spy with a silenced pistol and a sleek spy car, you’ll need to use whichever characters you’ve recruited to your advantage.",
    "At its core, Watch Dogs: Legion is a stealth-action game. In Watch Dogs 2, you’d typically have the option of springing technological traps on foes, or just gunning them down. Legion backs away from the latter option, presenting you with a variety of options for infiltration. If you’re tasked with getting into a police station, you could go out and recruit a cop to join DedSec, which lets you stroll into the police station since you’re one of their own. There’s plenty of options at your disposal here, all of which purposefully give you alternate routes to running in, guns blazing.",
    "Assembling your militia is a lot simpler than it sounds. Simply scan someone with your phone, and in this near-future version of London, you’ll be presented with their personal information, job, weapons, and skills.",
    "Watch Dogs: Legion teaches you that the population around you are your tools, and you can recruit anyone you see on the cold streets of London, with a randomized set of skills, weapons, and abilities. You’re assembling the titular legion by yourself, recruiting them through simple fetch missions before adding them as your very own operative.",
    "This faceless army sacrifices a very personal element of citizens struggling against evil overlords. Watch Dogs: Legion instructs you to recruit the people you brush shoulders with based on their capabilities. You’re not keeping them around for their personality, or for genuine company in your escapades around London. Each ally is there to serve a very dedicated purpose, a small cog in the larger machine of fighting back against Albion, the evil technological corporation intent on bringing London to heel.",
    "We’ve cycled through more characters than we can count in Watch Dogs: Legion, and couldn’t tell you the names, or personal details and habits, of any of them.",
    "On the other hand, there are some memorable moments of technological terror in Watch Dogs Legion’s story. A street gang auctioning off slaves as unwilling organ donors was a tad more horror-inspired than we expected Legion to be, as was a tech billionaire enslaving their own mother by uploading her consciousness to a cloud server.",
    "These moments are shocking, and they actually represent a more bold direction and commentary on technology invading our lives than the previous two Watch Dogs games ever had.",
    "Watch Dogs: Legion has an entirely forgettable story overarching story, however. Like the past two games, we’re fighting back against caricatures of tech villains to reclaim our basic human rights, and the villain this time is a homicidal war criminal named Nigel Cass, in charge of private militia Albion.",
    "The warlord is cruel, unhinged, and referred to as mentally unstable, a tired trope that attempts and fails to give depth to a character’s actions. Aside from the sparse moments of techno-horror, Watch Dogs Legion has very little new to say about technology invading the lives of everyday citizens.",
    "Watch Dogs: Legion’s standout feature is the legion itself, with its citizens uniting to bring a variety of weapons, skills, and puzzle-solving capabilities to your army. There’s a lot of fun to be had in figuring out which skills best work to undo a complex scenario, whether it’s a grenade launcher, a turret drone, explosive traps, or just walking in the front door in disguise.",
    "Unfortunately, it’s the legion itself where the game becomes forgettable. The endless army means no one recruit is ever memorable, because Watch Dogs: Legion teaches you to use characters you recruit as a means to an end, rather than keeping them around for who they are, or interacting with them on a basic human level.",
    "That feeling of forgetfulness is pretty emblematic of Watch Dogs: Legion. You’ll have fun in the moment, experimenting with various recruits and their technological-centric methods of destruction, but these moments become commonplace and repetitive over 30-something hours. The Watch Dogs series has never made strides in assessing the ways technology can invade our lives in different ways, and Legion, for the vast majority, continues that trend."
  ],
  "headers": {
    "4": "Assembling your legion",
    "7": "Tools of the trade",
    "11": "Techno-horror",
    "15": "Verdict"
  },
  "links": {}
}