{
  "source": "https://www.techradar.com/reviews/curve-dental",
  "title": "Curve Dental review",
  "category": "computing",
  "updated": "2020-10-27T18:13:05Z",
  "author": "jonas-p-demuro",
  "summary": "The cloud based dental practice management solution",
  "verdict": "Curve Dental offers a comprehensive cloud software suite that can organize and automate any dental practice, but the drawbacks need to be considered prior to signing up.",
  "pros": [
    "Support available 24/7",
    "Available webinars",
    "Cloud based"
  ],
  "cons": [
    "Opaque pricing",
    "Lack of mobile apps",
    "No support for electronic signatures",
    "Lacks free trial"
  ],
  "article": [
    "From its founding back in 2004, Curve Dental, based in Provo, Utah had a vision of how cloud technology could be transformative for dentistry. After years of R & D, this product launched in 2009, and currently serves over 27,000 practitioners. Along the way, there were several innovations, such as adding custom reporting in 2016, and native imaging in 2011 that enabled the capture of digital images directly to the cloud.",
    "Curve Dental has taken the cloud approach to dental practice management. As such, there is no software to install, and it runs in the Google Chrome browser. By using this SaaS approach, the benefits include integrated backup to the cloud, and no need for a local server. This also means that it can run on either a Windows or Mac computer, and needs a minimal broadband connection of 5 Mbps down, and 1 Mbps up.",
    "In support of the front office, Curve Dental has powerful scheduling tools. Appointments can be changed, either singly, or in groups, with a simple drag and drop functionality. Dates and times can be blocked out for ease of scheduling. It is also simple to move backward and forward in a range of dates with simple mouse clicks.",
    "Billing is another essential piece for dental practice management. Curve Dental supports this with easy to prepare billing statements that can be customized with the practice’s offerings. These professional statements make it easy for patients to follow, with an easy-to-find balance, and detailed payment instructions. Patient engagement is fostered, as the bill also has a list of not only future dental appointments for the patient, but all of the family members to encourage follow ups.",
    "Payment posting is also automated, which gets applied to the insurance part of the patient’s portion of the bill. There is also simplification of eTransactions, with the ability to use the Electronic Remittance Advice (ERA) tool, that can check insurance eligibility in just seconds, and figure out what insurance will pay. In addition, Curve Dental has an eClaim feature that makes it simple to check on a claim’s status.",
    "Curve Dental can also provide business insight and intelligence. It has multiple reports that are ready to be run, that can provide real time actionable intelligence.",
    "A significant drawback of Curve Dental is the lack of support for mobile apps for either the iOS or the Android platforms. Another issue is the lack of an offer of a free trial, although a free demo is available.",
    "The program does have some shortcomings reported by users. One issue identified is the lack of electronic signature (aka: e-signature) on the chart which can be useful to streamline operations, and avoid the need to print out paperwork for a signature, and then rescan it back into the chart. Another shortcoming is the inability to transfer credits between family members, difficulties in scheduling appointments when users are presented with too many options, and no way to track a patient’s annual insurance plan maximum to plan out treatment.",
    "Support is a strong point for Curve Dental, as it is better than most with multiple options. We appreciate the first option of phone support, and also that it is toll free. Furthermore, the Curve Dental website also clearly states that this support is available 24/7, which is the ideal. Also, calls are endeavored to be answered in under a minute, and get the office back to work in less than 10 minutes.",
    "There are also additional support options, which include email. This option can be useful for less time sensitive communications, or to include a screenshot to clarify the issue, although keep in mind that email is not HIPAA compliant so be sure to not include Protected Health Information in any communications. Furthermore, Curve Dental also offers a third option of an online portal, that can create a ‘Trouble ticket’ from within the software.",
    "Finally, there are also some other options with less direct interaction, and more general information. These include the infobase, that can be located in the Curve Community. There are also online webinars, designed to offer complimentary training for new users on such topics as “Patient and Appointment Workflow,” and “Claims Management.” While this is useful, we are left wondering why we need to register for this at a specific time, and would prefer if the topics were available as online videos for completely on demand, ‘Just in time,’ education, as staff need training on these essential topics.",
    "As is too common in this type of software, the pricing for Curve Dental is completely opaque. The information on the plans could not be found anywhere on the site, and even with an online chat we were not given any hint of what the costs and options are without providing our full name and the phone number of the practice, which is a barrier to getting information.",
    "Elsewhere, through searching, we gleaned that the pricing for Curve Dental is based on a monthly software subscription. The pricing is based on the number of dentists in the practice, and costs about $350 (£284) for each provider in the practice.",
    "Running a dental practice can be daunting, but Curve Dental is a useful tool to streamlining the workflow. The pros include custom bills, the range of 24/7 support options, and the support for eTransactions. The cons run the gamut of no mobile apps, the lack of a free trial, and the opaque pricing without company contact. Overall, Curve Dental’s cloud based approach yields benefits to running your dental practice, but be cognizant of the shortcomings before making the commitment to it."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "8": "Support",
    "11": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "Curve Dental": "https://www.curvedental.com/",
    "SaaS": "https://www.techradar.com/news/what-is-saas"
  }
}