{
  "source": "https://www.techradar.com/reviews/ultrasurf",
  "title": "Ultrasurf review",
  "category": "computing",
  "updated": "2021-11-24T13:44:05.301Z",
  "author": "sead-fadilpasic",
  "summary": "Capable yet slow content unblocker",
  "verdict": "Ultrasurf is a free anti-censorship tool that does exactly what it advertises - giving you access to censored or otherwise blocked content, hiding your IP from websites, and encrypting your traffic, but that’s about it. It lacks the power of a full VPN since it doesn’t use advanced protection mechanisms, doesn’t have lots of servers, it’s slow, doesn’t let you choose the server to connect to and doesn’t have the readily available customer support.",
  "pros": [
    "Completely free",
    "Easy to use"
  ],
  "cons": [
    "Slow",
    "Users can’t choose servers",
    "Customer support only reachable via email"
  ],
  "article": [
    "Created by Ultrareach Internet Corporation, Ultrasurf is an anti-censorship tool, originally created to help Internet users in China get access to censored websites. Since then, it has expanded its outreach and increased its user base to millions of people per month, from over 180 countries.",
    "However, this tool does not increase your online privacy so you may want to use one of the best VPN tools in combination with or instead of Ultrasurf.",
    "Ultrasurf is completely free, no subscriptions, hidden charges, ads, fine print, or other strings attached.",
    "As mentioned by the provider itself, Ultrasurf’s primary purpose is to bypass Internet censorship in closed societies like China, Iran, and Russia, encrypt your online communications/browsing data, and hide your IP from the websites you’re visiting.",
    "Privacy isn’t its main concern but if it is for you, then you may want to consider using a full VPN service like CyberGhost or NordVPN instead. If you have the budget for it, ExpressVPN is the best choice. If it’s too expensive for you, then Surfshark is a great alternative that will cost you less than $2 per month.",
    "Ultrasurf says it doesn’t limit access to popular video-on-demand services like Netflix. However, some of those services may block its server IPs and it doesn’t “normally try to evade it since our main purpose is to help users bypass Internet censorship”.",
    "We’d also like to add that, in the case that it does unblock the likes of Netflix, you shouldn’t expect it to be able to stream in high definition and you’ll probably experience buffering and lagging.",
    "Ultrasurf was created by Ultrareach Internet Corp., a company founded in the US in 2001 by a small group of Silicon Valley engineers. They launched Ultrasurf in 2002, originally as a tool for netizens in Mainland China, where the Internet is thoroughly censored and Internet users’ activities monitored in detail.",
    "The provider doesn’t specify the number of servers it has. Instead, we were told that it has “thousands of IPs around the world and we also use cloud services to further increase blocking resilience. However, to minimize the cost, we only use them for incoming traffic, i.e. the connections between users and our server, to keep Ultrasurf unblocked. For outgoing traffic, i.e. connection from our servers to web servers, we only use a few hundred IPs, and we don’t give users the option to choose them.”",
    "Ultrasurf’s encryption takes place between your device and Ultrasurf’s servers. While normal web traffic (HTTP) isn’t encrypted between Ultrasurf’s servers and web servers, secure web traffic (HTTPS) is encrypted end-to-end, from the user's browser to the web server. In layman terms, this means that only HTTPS traffic is routed and encrypted while HTTP traffic is ignored and passes normally through your ISP.",
    "A third party may suspect you’re using Ultrasurf’s platform but they will not be able to decrypt your data or view your browsing activities.",
    "That said, Ultrasurf states it doesn’t manage or modify your data so it cannot increase your online privacy, “and should not be considered or used as an online security tool”.",
    "The company also says it doesn’t log users’ activities, nor does it require its users to provide personal information. However, the privacy policy states that some information may be collected when you’re visiting its websites, including your IP, number of links you click within the site, date and time of your visit, web page you linked to its site from, and pages you viewed on the site.",
    "We were told by the customer support that Ultrasurf doesn’t limit torrenting, but considering its location and the fact that it primarily focuses on unblocking censored content, we strongly suggest caution.",
    "Ultrasurf only has a Windows and Android client, as well as a browser extension for Chrome.",
    "The Android app has been downloaded over 10,000,000 times and given 4.5 stars out of 5 (a very good rating) by 162,000 users. It was last updated on June 20, 2019.",
    "If you get stuck with using the platform and need some assistance, you can try reaching the customer support via email.",
    "Ultrasurf is very easy to get around, just download the app from the website, install it, and it will connect you immediately to a server it finds most suitable for you. Unfortunately, there’s no way to choose a VPN server or location yourself.",
    "The platform automatically connected us to a server in the US and we decided to test its download speeds. We ended up a bit disappointed as the speed test showed only 9.38Mbps on a 70Mbps testing connection. However, the website does state that Ultrasurf is currently experiencing difficulties “due to greatly increased demand in Iran” and its servers being overloaded.",
    "Ultrasurf is a great option for those who just need to access censored websites, mask their IP, and encrypt their communications.",
    "It’s not a good choice if privacy and security are your primary concerns, and its speeds are below average, so instead, you might want to consider getting a full VPN that deploys powerful encryption and protocols to ensure perfect privacy, such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "3": "Alternatives",
    "5": "Streaming",
    "7": "About the company",
    "9": "Privacy and encryption",
    "14": "Support",
    "17": "Speed and experience",
    "19": "Verdict"
  },
  "links": {
    "Ultrasurf": "https://ultrasurf.us/",
    "censored websites": "https://www.techradar.com/best/proxies",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "unblock the likes of Netflix": "https://www.techradar.com/vpn/best-netflix-vpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-8783130693091405000"
  }
}