{
  "source": "https://www.techradar.com/reviews/razer-iskur-gaming-chair-review",
  "title": "Razer Iskur gaming chair review",
  "category": "gaming",
  "updated": "2021-08-03T10:52:25Z",
  "author": "john-loeffler",
  "summary": "The Razer Iskur gaming chair is a solid first effort",
  "verdict": "The Razer Iskur Gaming Chair is a solid first showing from the world's most well-known gamer-specific peripheral maker, but it's cost may put it out of reach for many.",
  "pros": [
    "Premium construction",
    "Firm but comfortable",
    "Quality materials"
  ],
  "cons": [
    "Not great for larger gamers",
    "Can't sit cross-legged",
    "Expensive"
  ],
  "article": [
    "The Razer Iskur gaming chair is the first one produced by the world's foremost gaming peripheral maker and it is a excellent first effort on their part, but it isn't without its faults.",
    "On the plus side, it definitely looks and feels like a premium gaming chair - so long as you're looking for a gaming chair in matte black. Aside from the occasional issue with a squeaky joint - nothing a little bit of oil couldn't fix - there's very little not to like about the chair, but it's not for everyone ultimately.",
    "The Razer logo and ostentatious \"For Gamers. By Gamers.\" emblazoned on the headrest and front of the seat don't scream \"classy,\" but honestly, we're just glad it's not RGB.",
    "Like any piece of furniture, what some find comfortable others won't, and that is definitely going to be the case with the Razer Iskur. The 4D armrest offer some customizability, but nothing to push the armrests themselves further out from the seat, so some might find the chair somewhat constrictive - especially those with a bigger frame or those who like to sit cross-legged in their chairs.",
    "The seat and lumbar support are also on the firm side, so if you're looking for a gaming chair with plush cushioning, this isn't it. That's not to say it isn't comfortable as all get out, but this is definitely a matter of preference.",
    "Finally, this isn't a cheap gaming chair. With a launch price of $499 (£499, AU$729), you're definitely paying for the comfort, but there are worse things to spend your money on and it's not all that out of line with other more premium gaming chairs.",
    "All said, it's surprising that it took this long for Razer to put out a gaming chair, but now that they have, we probably shouldn't be surprised that it'd be an excellent one. The Razer Iskur doesn't skimp on quality but we do wish the armrests were a bit more accommodating of larger frames.",
    "The Razer Iskur is available now at Razer's website and other online retailers for $499 (£499, AU$729).",
    "The Razer Iskur definitely feels like a $500 gaming chair.",
    "It's available in one color: Razer's signature matte black with green detailing. The PVC leather is a cut above the typical pleather material found on most other gaming chairs and the construction is solid throughout, especially the quality of the stitching along the seams.",
    "The cushioning throughout the provides firm support that holds up under prolonged sessions at your desk - we've been sitting in this thing for weeks now and it's still holding up without any noticeable deformation.",
    "The armrests offer eight different configurations to suit your preference, though it doesn't expand outward at all to accommodate larger body types, which is unfortunate. Also, if you're the type who likes to sit cross-legged in your gaming chair, you'll probably find this more constrictive than other options out there.",
    "While you can remove the armrests entirely, this is a rather extreme solution though it is an option.",
    "This is definitely one of the most comfortable chairs we've used in recently memory. The lumbar support on this chair is excellent, so if you're the type who suffers from lower back pain after sitting in a chair for too long, this chair should definitely help with that.",
    "The seat itself is firm and supportive, so if you're looking for a plush seat, you're probably going to want to look elsewhere. That said, if you like a supportive cushion, this chair will hold you up for hours with little trouble.",
    "The seat does an excellent job of fitting an average sized person without a problem, but it is likely not going to be the best fit for those with wider frames, and the construction of the chair doesn't offer many work-arounds beyond removing the armrests.",
    "The chair also has a good amount of lean and recline to it, as well as the ability to lock it upright, but it's pretty standard for gaming chairs and nothing especially notable on that front."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "8": "Design",
    "13": "Comfort",
    "17": "Don't buy it if..."
  },
  "links": {}
}