{
  "source": "https://www.techradar.com/reviews/samsung-hw-n650-soundbar",
  "title": "Samsung HW-N650 soundbar review",
  "category": "audio-visual",
  "updated": "2020-06-04T10:55:47Z",
  "author": "stephen-withers",
  "summary": "The Samsung HW-N650 is a superb all-rounder",
  "verdict": "The N650 delivers a big and immersive soundstage thanks to Samsung’s Acoustic Beam technology, making it ideal for movie fans and gamers alike. It’s also well made and includes a separate subwoofer, but lacks some of the features from last year.",
  "pros": [
    "Wide and immersive soundstage",
    "Wireless sub with well-integrated bass",
    "Great performance with music",
    "Superb build quality"
  ],
  "cons": [
    "Lacks certain features",
    "Pricey"
  ],
  "article": [
    "The Samsung HW-N650 is latest soundbar to emerge from the company's state-of-the-art Audio Lab in California. The company’s investment in audio development has already paid dividends, with a number of very impressive soundbars launched over the last few years – and in 2018 it brought us the N650.",
    "It included many of the same features found on previous models, but added Samsung’s Acoustic Beam technology. Targeted at movie fans and gamers, this is intended to create a bigger and more immersive audio experience. If the N650 can deliver the panoramic soundstage that Samsung promises, then it might be just the ticket.",
    "The N650 uses a very similar design to previous Samsung models, with a simple rectangular shape and an all metal construction. The look is functional rather than eye-catching, but the build quality is excellent, with a solid feel and substantial weight.",
    "This solidity extends to metal grilles at the top and front, along with a brushed metal finish to the edges and sides. The N650 is only available in black, but its stylish finish will match most modern TV designs; given its width of 1100mm, it should also complement larger screens.",
    "However, despite being quite wide, the N650 also has a fairly low form-factor, with a height of just 59mm: this means it should fit in front of most TVs without blocking the screen. You also have the option of wall-mounting the soundbar, and Samsung include a dedicated bracket for that purpose.",
    "On the front of the soundbar, over on the far right, there is a simple LED display. This lights up when you use the controls, and provides information on the volume, inputs and various settings. To the right of this display, on the end plate, are some basic controls for power, input selection and volume.",
    "The provided remote is excellent, and a far cry from the credit card-sized controllers often included with soundbars. It’s well designed and comfortable to hold, with all the necessary buttons sensibly laid out, making controlling the N650 as intuitive as possible.",
    "The connections are located in two recessed sections at the bottom of the soundbar. In the left hand recess you’ll find a USB port, a 3.5mm auxiliary audio jack, and an optical digital audio input. The right hand recess has an HDMI input, an HDMI output with ARC (Audio Return Channel), and a connector for the separate power supply.",
    "Unlike many of Samsung’s recent soundbars, the N650 comes with a separate wireless active subwoofer. It measures 215 x 385 x 304mm (WxHxD), weighs 7kg and is designed to complement the soundbar itself. The two should pair automatically, and there’s a control on the remote to adjust the subwoofer level, ensuring the bass is nicely integrated.",
    "Design TL;DR: The N650’s minimalist design and wide body will complement many large screen TVs, while the superb build quality and wireless subwoofer promise an expansive sound.",
    "The N650 uses a 5.1-channel speaker configuration, with a claimed frequency range of 42Hz to 20kHz and a total claimed power of 360W. There are three forward-firing channels, each composed of a mid-range driver and a tweeter. This configuration means the soundbar has a dedicated centre channel, which is important for dialogue in movies and narration in TV programmes.",
    "Along with the three front channels, there are also two upward-firing channels - but this is where things get interesting. The N650 includes Samsung’s Acoustic Beam technology, so these upward-firing channels are composed of two pipes, each with 28 holes in them. Tweeters fire into these pipes, creating a series of acoustic beams emanating from each hole – a bit like the pipes in a church organ.",
    "These beams head upwards and sideways, bouncing off the ceiling and walls to create a much wider, higher and more immersive soundstage. Although this technology isn’t new, and Yamaha has been doing something similar for years, Samsung’s approach is certainly unique.",
    "As mentioned, the N650 comes with a wireless active subwoofer. This bass-reflex model uses a forward-firing 6.5-inch driver, coupled with a rear port to deliver decent bass extension.",
    "The connectivity of the N650 looks good on paper, especially when you factor in the inclusion of Bluetooth. This not only allows you to stream music from your smartphone or tablet, but also receive wireless sound from a compatible Samsung TV.",
    "On closer inspection, however, the connectivity isn’t quite as impressive, especially when compared to last year’s soundbars or the competition. To start, Samsung has dropped built-in WiFi, which means the N650 doesn’t support Samsung’s multi-room system and thus can’t run wireless rear speakers.",
    "The number of HDMI inputs is also rather stingy considering the price, but you can always use ARC to send audio from the TV to the N650 via HDMI. In reality you’re going to have to do this, if you want to connect more than one HDMI source.",
    "The N650 supports the 5.1-channel versions of both Dolby Digital and DTS, but it can’t decode lossless formats and thus doesn’t support Dolby Atmos or DTS:X. This makes connecting all your sources to your TV, and then sending the audio back using ARC over HDMI, all the more logical.",
    "If you’re a gamer, the N650 has a great little feature designed especially for you. Samsung’s 2018 TVs can detect when you select a connected games console, and automatically go into game mode. This extends to the soundbar, which will also automatically select a dedicated Game sound mode.",
    "The N650 has three sound modes in total: Standard, Surround, and the aforementioned Game. The Standard mode just uses the front three speakers and is best for music and some TV programmes; the Surround mode is designed for movies and TV dramas; while the Game mode is obviously intended for gaming.",
    "Features TL;DR: Samsung’s Acoustic Beam technology promises a larger and more immersive front soundstage, and is designed to enhance movies and games. There’s a decent set of features and connections too, although only one HDMI input.",
    "Samsung has been making some impressive strides in terms of sound quality, with last year’s MS750 being a particularly high watermark. So it was rewarding to discover that the N650 continues that trend, although in a slightly different fashion.",
    "Whilst the MS750 was all about pure sound quality thanks to its front channels and distortion-cancelling technology, the N650 is more about spatial awareness. The Acoustic Beam technology really opens out the front soundstage, creating greater depth, width and height. It essentially generates a wall of sound that perfectly complements movies and games.",
    "However within this immersive sound field, dialogue remains clear and focused, while effects are placed with real precision. The addition of a separate subwoofer gives the audio a solid foundation of bass, and these low frequencies are effectively integrated within the rest of the soundstage.",
    "The sound modes work particularly well, with the Surround mode creating a more cinematic experience, whilst the Game mode allows you to focus on sound effects. So if you stick on a movie like Deepwater Horizon, you’ll find yourself diving for cover as the oil rig blows up. However, if you switch to a session of Star Wars Battlefront, then the N650 will immediately immerse you in a galaxy far, far away.",
    "Thanks to the Standard sound mode, the N650 also sounds great with music. In this mode only the front three speakers are used, creating an excellent stereo experience. Detail retrieval is impressive, whilst the clean mid-range and effective tweeters combine with the subwoofer to deliver plenty of clarity and dynamism. The Samsung proved very capable of delivering the layered guitars and driving beats of Resistance is Futile by Manic Street Preachers.",
    "Performance TL;DR: The N650 produces an impressively big front soundstage, that enhances movies and gaming by immersing the viewer. Dialogue remains clear and focused, whilst the bass is deep and well-integrated. It also sounds great with music, making this an excellent all-round soundbar.",
    "There’s no denying that the N650 sounds fantastic, and it has the size and build quality that goes some way towards justifying its £699 cost. There’s also a decent set of features and a wireless subwoofer, but the limited number of HDMI connections is a shame at this price point.",
    "If you like the look of the N650, then it’s definitely worth considering Samsung’s HW-MS750. This soundbar doesn’t have a separate subwoofer, but includes distortion-cancelling technology, upward-firing drivers, multi-room capabilities and HDR support. It sounds superb and comes in at the same £699 price tag.",
    "Also in the same price bracket is the LG SJ9, which sports a similar level of build quality and comes with a wireless subwoofer. It’s also part of LG’s multi-room system, while including more HDMI inputs and can HDR passthrough. Best of all, it has upward-firing drivers that support Dolby Atmos, making the SJ9 a tough act to beat.",
    "The N650 is an excellent soundbar that boasts a solid build quality and a minimalist design, combined with a decent set of features. Samsung has stripped away some of the features from last year, but the addition of a wireless subwoofer and Acoustic Beam technology helps justify the fairly hefty price tag.",
    "The sound quality is excellent, with an open and immersive front soundstage that lends itself to both movies and music. It’s no slouch with TV programmes either, and the centre channel ensures dialogue remains crystal clear. Music also sounds great, making the N650 a superb all-rounder, and worthy of recommendation if you’re looking for a new soundbar."
  ],
  "headers": {
    "2": "Design",
    "10": "Features",
    "21": "Performance",
    "27": "Value",
    "28": "Other soundbars to consider",
    "30": "Verdict"
  },
  "links": {
    "HW-MS750": "https://www.techradar.com/reviews/samsung-hw-ms750-sound-soundbar",
    "LG SJ9": "https://www.techradar.com/reviews/lg-sj9-soundbar"
  }
}