{
  "source": "https://www.techradar.com/reviews/1more-portable-bt-speaker",
  "title": "1MORE Portable BT Speaker review",
  "category": "audio-visual",
  "updated": "2020-02-10T22:37:37Z",
  "author": "lewis-leong",
  "summary": "A luxurious Bluetooth speaker for the office and the home",
  "verdict": "The 1MORE Portable BT Speaker sounds great for the price. It has an impressive amount of bass at low volumes but drops off at higher volumes. The speaker is good for traveling professionals who want better sound quality, a speakerphone, and some water resistance, but those who want a more rugged speaker should look elsewhere.",
  "pros": [
    "Great sound quality for the size",
    "Impressive bass response at low volume",
    "Understated and compact design"
  ],
  "cons": [
    "Bass response tapers at high volumes",
    "Limited IPX4 rating",
    "Average battery life"
  ],
  "article": [
    "1MORE is known for its excellent in-ear headphones like the 1MORE Triple Driver and 1MORE Quad Driver, which sound excellent for the money. But now the company is moving into wireless speakers with the $99 (€79, about £77, AU$148) 1MORE Portable BT Speaker, which we’ll be taking a listen to today.",
    "Does 1MORE's newest product live up to the company’s reputation for sound? In short, yes... but there are a few limitations that you should be aware of.",
    "One of the biggest limitations of the 1MORE Portable BT Speaker is the fact that it only has an IPX4 rating, which will resist splashes but not submersion. There are plenty of other rugged wireless speakers at its price point, like the UE Wonderboom 2, that can be fully submerged and would be better suited for outdoor adventurers. The second limitation is that while sound quality is good, it sounds best at low to medium volume. The louder the speaker gets, the more the bass drops off, so don’t expect to fill a large room with earth-shaking bass.",
    "However, if you’re looking for a wireless speaker to travel with and value sound quality, the 1MORE Portable BT Speaker is a good choice.",
    "The 1MORE Portable BT Speaker was released in late 2019 at $99 (€79, about £77, AU$148), but 1MORE currently has a deal on its website where you can buy a pair of 1MORE Portable BT Speakers for $150.",
    "At that price point, the 1MORE Portable BT Speaker costs just as much the UE Boom 3 and UE Wonderboom 2, and it's a bit less than the uber-popular Bose SoundLink Mini II. If you're looking to go even cheaper, the Anker Souncore Flare is a great alternative and only costs a paltry $60 (£70, about AU$123).",
    "The 1MORE Portable BT Speaker is shaped like a bowl and while not the most portable or striking design we’ve seen, it’s handsome and understated. The entire speaker is covered in cloth and can withstand splashes.",
    "The physical controls for the speaker are found on the side and they provide nice tactility. There are buttons for controlling volume, playback, a microphone button for taking calls, and power. The USB-C charging port and 3.5mm analog jack are hidden under a rubber flap, helping to seal it from water and dust. The speaker also features a loop that allows you to hang it somewhere like the showerhead. (Again, don't let it sit in water for any period of time, however.)",
    "The speaker has a good heft to it and feels like it can put with the abuses of travel just fine. However, it’s not drop rated so don’t expect to take it outdoors where water, dust, and drop resistance are needed.",
    "One 1MORE’s website, the company boasts the Portable BT Speaker’s “DSP,” or digital signal processing, which allows the speaker to have more bass response.",
    "We found this claim to be accurate, to a point.",
    "At low to medium volumes, bass is excellent for a speaker its size, providing good texture and extension, but not much impact. Obviously a speaker this small can’t move enough air to produce bass with a lot of impact but the quality of the bass is excellent.",
    "Mids and highs are very well represented too, with a slight warm tilt. Highs have good detail and never sound harsh, even with the volume is pushed to the limit. However, bass response tapers off the at a certain point so the highs will eventually overwhelm the mids and bass the louder the speaker plays. The 1MORE Portable BT Speaker sounds its best at low to medium volume, which is sufficient to fill a small room with music.",
    "Like some other wireless speakers, the 1MORE Portable BT Speaker can be paired with another identical speaker for true stereo sound. Alternatively, two speakers can be paired to play mono together to amplify sound across a room. It's a feature we've seen elsewhere before, but its inclusion at this price point is appreciated.",
    "Finally, battery life is rated for 12 hours and we got closer to 10 listening at 60% volume, which is about average. If you're someone who uses Bluetooth speakers' microphones, the Portable BT is great for making calls and friends and family reported hearing us clearly. The fact that the 1MORE Portable BT Speaker has a mic and 3.5mm aux jack is notable as many waterproof speakers have gotten rid of these features.",
    "We love the 1MORE Portable BT Speaker for its sound but wish it had a better IP rating to survive more than splashes. For $99, the Portable BT Speaker is one of the best sounding speakers for the price. Features like the microphone for calls and 3.5mm aux jack to hook up legacy devices make it a great option for travelling professionals who want to take their calls hands-free.",
    "If you’re looking for a speaker that can put up with more abuse while still sounding good, the UE Wonderboom 2 is another excellent choice, but just be aware that it doesn’t have a mic or 3.5mm aux jack."
  ],
  "headers": {
    "4": "Price and release date",
    "6": "Design",
    "9": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "1MORE Triple Driver": "https://www.techradar.com/reviews/1more-triple-driver-in-ear-headphone",
    "1MORE Quad Driver": "https://www.techradar.com/reviews/1more-quad-driver-in-ear-headphones",
    "wireless speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "a pair of 1MORE Portable BT Speakers for $150": "https://onemore.pxf.io/c/221109/306643/4751?subId1=trd-us-5745572517995849000&sharedId=trd-us&u=https%3A%2F%2Fusa.1more.com%2Fproducts%2F1more-portable-bt-speaker",
    "UE Boom 3": "https://www.techradar.com/reviews/ultimate-ears-boom-3",
    "Bose SoundLink Mini II": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Anker Souncore Flare": "https://www.techradar.com/reviews/anker-soundcore-flare"
  }
}