{
  "source": "https://www.techradar.com/reviews/roku-smart-soundbar",
  "title": "Roku Smart Soundbar review",
  "category": "audio-visual",
  "updated": "2020-01-29T14:00:14Z",
  "author": "nick-pino",
  "summary": "The Roku Smart Soundbar will improve your TV’s audio issues and outdated smart platform",
  "verdict": "If you’re trying to stretch your budget as far as it will go, the Roku Smart Soundbar presents a spectacular value by combining a 4K HDR Roku streaming device and decent-sounding soundbar. That said, if you have the budget to buy both separately and devote a bit more cash to a higher-end soundbar, we recommend doing that instead.",
  "pros": [
    "Great value",
    "Surprisingly loud",
    "Built-in 4K Roku player"
  ],
  "cons": [
    "No HDMI-in ports",
    "Narrow soundstage",
    "Don’t lose the remote!"
  ],
  "article": [
    "The Roku Smart Soundbar is an attempt to to fix two of the biggest problems that have long plagued TV owners – awful audio and outdated smart TV interfaces – with one elegant solution.",
    "These are problems other manufacturers like JBL and Anker are trying to solve with products like the JBL Link Bar and Nebula Soundbar, but Roku’s model is the only one to offer Roku TV, which is a definite plus considering how the strengths of the platform.",
    "As great as this all sounds on paper, the problem with the Roku Smart Soundbar doesn’t have anything to do with its ability to stream content – which it actually does quite well – but rather with the soundbar itself that is, unfortunately, pretty mediocre.",
    "The Roku Smart Soundbar came out in late October of 2019. It was first available for $179.99 (around £139, AU$265) in the US, though you can now catch it for $160 (around £120 / AU$230). Considering that each of the main components, the Roku player and a basic 2.0 soundbar, easily set you back over $100 apiece, this feels like a pretty good value.",
    "If you can stretch your budget a bit further to buy a better-sounding soundbar, we’d recommend that, but at this price this combo is hard to beat.",
    "Pulling it out of the box, the Roku Smart Soundbar is a pretty basic 2.0 soundbar. There’s a front mesh that hides the drivers and wraps around the front face of the soundbar, and a plastic matte-black top with a Roku insignia.",
    "The soundbar sits fairly high at 2.8 inches tall, with a 32-inch width, but as long as you have a TV that sits fairly high off the table and has wide legs you shouldn’t have any problems with the soundbar blocking the IR receiver on your TV.",
    "Thankfully, the Roku Smart Soundbar ships with Roku’s awesome Bluetooth voice remote, which comes with a built-in microphone and a volume rocker on the side to raise and lower the sound of the soundbar. You’ll also find four shortcut buttons for Netflix, ESPN+, Hulu and Sling TV – all of which we’ve seen on Roku remotes before and come in handy here.",
    "What could be a problem, however, is losing the remote. There aren't any physical buttons on the Roku Smart Soundbar itself, which means the remote and Roku app are your only means to control the soundbar. Unlike the Roku Ultra, the top-tier Roku streaming player, there’s not a remote finder on the soundbar, so be really careful you don't lose it by accident.",
    "Spin the soundbar around and you’ll find rear inputs: a single HDMI-Out and a digital optical-in port that connects to the TV, plus a USB port for playing local files.",
    "What’s missing here, obviously, is an HDMI-In port that can be used to connect game consoles, Blu-ray players, and the like. You can certainly plug those directly into your TV, but if your only HDMI port is taken up by the Roku Smart Soundbar, you’ll need to get up and connect your console to the TV every time you want to use it.",
    "Depending on where you set the bar, you’ll either walk away impressed with what this $200, 2.0-channel soundbar can do... or feel a bit disappointed.",
    "For its price and its design, we think the soundbar performs decently well. It has no issues with getting loud and filling small and medium-sized rooms, and the volume doesn’t really crackle or distort at any point. It’s surprisingly controlled all the way through.",
    "That said, if you don’t tweak it in the settings, the sound comes out as a flat wall, lacking in clarity or dimensionality. It’s the pinnacle of narrow soundstage and feels like you're listening through a funnel. The amount of bass put out by the soundbar by itself is pretty admirable, but it’s more of a droning bass than anything well-defined.",
    "Thankfully you’re able to tweak that sound a bit through the soundbar’s settings (pressing the asterisk button while streaming content) and we found better clarity by turning off leveling, lowering the bass and turning speech clarity to low. Those settings aren’t the most cinematic – due to the reduction in bass – but we appreciated the additional oomph in the mids and highs that made dialogue easier to hear and music the slightest bit more palatable.",
    "What you make of the sound is entirely dependent on what settings you’re using, what other soundbars you’re comparing it to and your expectations of a 2.0-channel soundbar – and we'd consider Roku's model wholly average in this regard.",
    "Thankfully, what’s not as subjective is the Smart Soundbar’s ability to stream content in 4K HDR from Netflix, YouTube, Vudu and more.",
    "According to Roku, the Smart Soundbar’s internal streaming hardware is super similar to what you’d find in the Roku Ultra – a rock-solid streamer that was last updated in 2019, the same year as the Smart Soundbar.",
    "That means all of what we said about the Roku Ultra applies here: streaming video is consistent in quality and, on a decent network, relatively seamless. It’s not the fastest streaming player on the planet, but it’s not laggy either, and while it doesn’t feature games or a popular smart assistant like Alexa or Google Assistant, neither are really necessary or expected at this price point.",
    "The Roku Smart Soundbar presents an undeniable value: it's a basic 2.0 soundbar plus a streaming player for under $200. It's brilliant for anyone interested in upgrading their basic setup without breaking the bank.",
    "That said, we didn't love the audio output. It has a workman-like performance that's a clear step-up from 10W TV speakers, but it lacks the clarity and dimensionality of soundbars that are just a few hundred dollars more. You can add some of that in by combining the Smart Soundbar with the Roku Smart Subwoofer ($179.99) and Roku TV Wireless Speakers ($199.99) thanks to an upcoming software update, but that's a pretty big investment for a system that doesn't have Dolby Atmos.",
    "If you want to pinch pennies to leave some room in your entertainment budget, the Roku Smart Soundbar is a good solution, but know that there are better-sounding options out there that don't cost much more."
  ],
  "headers": {
    "3": "Price and release date",
    "5": "Design",
    "11": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "smart TV": "https://www.techradar.com/news/best-tv",
    "JBL Link Bar": "https://www.techradar.com/reviews/jbl-link-bar",
    "Nebula Soundbar": "https://www.techradar.com/news/first-look-nebula-soundbar-fire-tv-edition",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra",
    "consoles": "https://www.techradar.com/news/best-consoles",
    "Blu-ray players": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}