{
  "source": "https://www.techradar.com/reviews/winrar",
  "title": "WinRAR review",
  "category": "computing",
  "updated": "2020-09-17T07:06:43.534Z",
  "author": "binay-gupta",
  "summary": "A dependable compression and archiving solution",
  "verdict": "A full-featured program which offers impressive extraction speeds and is ideal for creating RAR and ZIP archives, but isn’t so hot in terms of compression speeds.",
  "pros": [
    "Works fast with huge archives",
    "Saves custom profiles with different settings",
    "Easy-to-use interface"
  ],
  "cons": [
    "Can create just a few types of archives",
    "Compression speeds could be faster"
  ],
  "article": [
    "WinRAR is a file compression and archiving tool for Windows. Developed by Eugene Roshal, a Russian software engineer, and released way back in 1995, it became popular only after the early 2000s. WinRAR can view and create archives in either RAR or ZIP file formats, as well as unpack a range of archive file formats.",
    "This file archiver supports the creation of encrypted, self-extracting, and multipart archives. It is primarily meant for users who require archiving and compression capabilities beyond what is available by default in Windows.",
    "Its ability to split archives over multiple volumes has gained WinRAR a good deal of popularity in some circles, such as systems administrators and people who have to email large files. This software has over 500 million users today, making it the most popular compression tool in the world.",
    "WinRAR has 32-bit and 64-bit editions and is available in over 50 languages. Besides Windows 10, this software is supported by multiple other operating systems.",
    "WinRAR belongs to a class of products that are referred to as trialware. These products include a free trial period to evaluate the software, after which the user can decide to either keep or remove it.",
    "WinRAR has a 40-day trial period within which users can try out the product and see if it meets all their requirements. The tool’s pricing depends on the number of users needed, and it has options for a single-user license or multi-user licenses. For a single-user, the software’s one-time purchase price is $29.",
    "Businesses typically purchase multi-user licenses. Here, the company has to buy user licenses based on the number of computers in the organization where WinRAR is to be installed. In this case, the pricing structure for WinRAR runs from $21 per user (for 2-9 users) up to $6 per user (for 500-999 users). For WinRAR licences for more than 1000 computers, one would have to contact the company for a quote.",
    "All pricing mentioned here is excluding sales tax. The developer also offers a subscription for WinRAR maintenance and support for an additional fee on top of the license cost.",
    "WinRAR licenses are valid for all available platform versions and languages. If the user has purchased multiple licenses, they can even mix versions to meet their requirements.",
    "WinRAR is a robust archiving tool that offers an impressive set of features. It’s a great buy for anyone seeking solutions beyond the native ZIP capabilities of Windows. WinRAR supports a host of file formats and has a comprehensive feature set that provides users with the flexibility to create archives that perfectly meet their needs.",
    "Supported file formats include ZIP and RAR, plus 15 other formats such as BZ2, JAR, ISO, 7Z, XZ, Z, CAB, ARJ, LZH, TAR, GZ, and UUE.",
    "WinRAR benefits from a user-friendly interface that lets you access its diverse functions readily. This software features a wizard that can assist in carrying out multiple tasks, from creating a compressed file to scanning for viruses within any compressed file. The wizard tool is especially advantageous for new and inexperienced users.",
    "Multiple configuration settings are available for creating archives in WinRAR, including maintaining NTFS security settings and spanning multiple archive files. These options are presented in a simple and well-organized manner that doesn’t overwhelm users.",
    "WinRAR has an innovative feature that lets users save a set of archival settings as a “profile”, and subsequently apply them to new archives whenever required. This feature can save a lot of time.",
    "A further point worth noting is that the speed of extraction offered by WinRAR is commendable – but compression speeds aren’t so hot.",
    "WinRAR provides support in both English and German. Anyone losing their product key can send an email to the company and receive an answer typically within 48 hours. The company also maintains a number of useful FAQs on its website.",
    "WinRAR is an easy-to-use compression and archiving app that comes with several advanced features. The software’s simplicity makes it a good choice for less experienced users, too.",
    "WinRAR’s licensing terms are quite attractive, offering a perpetual license and free upgrades for life. However, this software could benefit from the ability to create more types of archives, and faster speeds when it comes to compression."
  ],
  "headers": {
    "4": "Pricing",
    "9": "Features",
    "16": "Final verdict"
  },
  "links": {
    "WinRAR": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5504034844538203000&xs=1&url=https%3A%2F%2Fwww.win-rar.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwinrar",
    "file compression and archiving tool": "https://www.techradar.com/news/the-best-file-compression-software"
  }
}