{
  "source": "https://www.techradar.com/reviews/oppo-reno-4-5g",
  "title": "Oppo Reno 4 5G review",
  "category": "phones",
  "updated": "2020-12-08T09:44:16.229Z",
  "author": "basil-kronfli",
  "summary": "A do-it-all mid-range smartphone with blisteringly fast charging",
  "verdict": "The Oppo Reno 4 5G is a good-looking phone with a big, bright, zingy screen and a fast-charging battery. The camera is good, not best-in-class, and doesn’t feature an optical zoom. What’s more, the screen’s a traditional 60Hz panel, so there’s no silky smooth scrolling as found on the more affordable OnePlus Nord. Despite those points though, with a smooth interface and plenty of battery, RAM, and storage, the Oppo Reno 4 5G impresses.",
  "pros": [
    "Great AMOLED screen",
    "5G data speeds",
    "Charges fully in under 40 minutes"
  ],
  "cons": [
    "High price on launch",
    "Plastic build",
    "No optical zoom"
  ],
  "article": [
    "Despite the Oppo Reno 4 5G’s punchy £499 / AU$799 (approximately $665) price tag, since launching its price has dipped as low as £349 in the UK (approximately $465) and AU$699 in Australia. With that in mind, what might have once been a pricey mid-ranger has in a short space of time turned into a fine-looking option for anyone in need of an across-the-board good Android upgrade.",
    "With its slender frame measuring 7.8mm and its lightweight 183g body, the Reno 4 5G feels manageable despite the fact that it sports an ample sized display. Measuring 6.4 inches with a roughly 90.7% screen-to-body ratio the phone’s AMOLED panel instantly gives it a sense of luxury.",
    "One drawback, however, is its old school 60Hz refresh rate. This means it isn’t quite as smooth as some of the competition.",
    "Powered by the ubiquitous 5G chipset of 2020, the Qualcomm Snapdragon 765G, combined with 8GB of RAM and 128GB of storage, it goes toe-to-toe with the pricier Google Pixel 5 from an internals point of view, and with no fewer than three cameras around the back and two on the front, it almost doubles the Google phone’s overall camera count.",
    "Practically speaking, the imaging experience is powered by a tried and tested 48MP Sony sensor around the back coupled with an 8MP ultra-wide camera. On the front, you can shoot 32MP selfies, with 2MP depth-sensing cameras either side. In turn, despite its extra sensors, Oppo’s mid-ranger doesn’t outperform the Pixel from a utility point of view.",
    "Photo quality is great provided you don’t need to zoom, though can be a touch blunt when shooting in darker scenes. Meanwhile, video is captured at up to 4K resolution.",
    "With 5G data speeds and NFC, connectivity is where it needs to be for a phone of the Reno 4 5G’s price, and thanks to a well-managed 4,000mAh battery and an efficient chipset, getting a full day out of the phone shouldn’t be an issue. Even if you do fall slightly short, with lightning-fast 65W charging, it won’t take long to top it up.",
    "So while the Oppo Reno 4 5G’s design may not wow you at the £499 RRP, and its specs aren’t best-in-class across the board, at the right price, it’s a reliable smartphone that performs like a dream day in, day out, and keeps you going until you’re ready to call it a night.",
    "The Oppo Reno 4 5G launched alongside the Reno 4Z and Reno 4 Pro in October 2020 outside China. The series launched in the UK and Australia, however, it isn’t available in the US.",
    "Despite the whole series sporting punchy prices at launch, with the mid-range Oppo Reno 4 5G costing £499 / AU$799 (approximately $665), since hitting stores its price has dropped as low at times as £349 / AU$699 (approximately $465).",
    "So while the phone’s launch price was lofty, just like the prices of the entire Reno 4 series, now it’s been out for a short while, a much more stomachable asking price is likely a few clicks away.",
    "The Reno 4’s design story is a very familiar 2019 tale with a 2020 twist: a flat Gorilla Glass 3 front meets a flat plastic back, united by a solid, curvy plastic frame. The modern spin comes in the form of the dual-lens selfie camera cut-out, and all said and done, this is a good looking phone.",
    "Despite all that plastic, the back is amongst the most glass-a-like plastic we’ve seen, with our black version sporting an oil-slick-esque shimmer in certain lighting. Meanwhile, the curvy frame is a solid offering feeling robust and secure in the hand.",
    "Weighing 183g and measuring 7.8mm thick, the Reno 4 Pro isn’t too heavy or thick, though with its 6.4-inch screen, neither is it a small phone. For context, it’s slightly bigger than an iPhone 12 Pro, but smaller than an iPhone 12 Pro Max.",
    "At the base is a USB-C port and a mono speaker, to the right there’s a power button, while the volume buttons are on the left. The modest camera bump around the back is a good looker as far as camera bumps go, with its stepped design, and the front is almost all screen.",
    "The Oppo Reno 4 5G ships with a case, which is handy for fending off fingerprints - something this phone’s shiny plastic back loves clinging onto. Given the fact there’s also a pre-fitted screen protector on the front, despite a lack of IP68 water resistance, at least the phone’s relatively well protected from all sides out of the box.",
    "While the Reno 4 5G’s design is fine, the real highlight is its screen. Combining AMOLED display technology with ample resolution and an under-display fingerprint scanner, from the way it looks to how it operates, it’s a flat-screen fan’s dream come true for the most part.",
    "Oppo is great when it comes to loading up its phones with screen options. Eye-saving blue light filters, color temperature controls, screen color mode customizations (with options including Vivid or Gentle) - all these options and more lie in the display settings.",
    "Fundamentally, rich settings wouldn’t amount to much without a quality display, so it’s lucky that’s exactly what the Oppo Reno 4 5G delivers. While there’s a humble 60Hz refresh rate, instantly putting the phone behind more affordable LCD alternatives including the Reno 4Z, the pure quality of picture makes up for it.",
    "Inky blacks and zingy colors combine with a max brightness of 600 nits to deliver a picture that’s easy to see and enjoyable to watch.",
    "There are a few things holding the Reno 4 5G from being a flagship-screened phone. The contrast ratio of 800,000:1 and missing HDR credentials/100% DCI-P3 coverage don’t compete with top-enders like the Oppo Find X2 Pro, but at the price, the Reno 4 5G still delivers a great viewing experience.",
    "The screen showcases broad viewing angles, there’s a welcome, responsive under-display fingerprint scanner which combines with a snappy touchscreen in general, and everything from movies to games look impressive on it.",
    "The Oppo Reno 4 5G’s main camera is a very familiar wide plus ultra-wide setup, with an equally familiar 48MP f/1.7 main camera at the helm. This tried and tested Sony sensor, the IMX586, has been powering smartphone cameras for a couple of years now, but that doesn’t mean it’s outdated.",
    "Detail captured on the Reno 4 5G’s main camera impresses. Oppo’s image processing isn’t abrasively zingy and over-processed, and if you feed the camera good lighting the results can be stunning. Even indoor lighting isn’t too tall an order for the Reno 4, despite the fact that the camera lacks optical image stabilization.",
    "When the lights drop right down, only then does the camera stumble in the face of competition like the Google Pixel 4a 5G, with its superior night mode.",
    "It’s a shame the Reno 4 5G doesn’t sport an optical zoom camera, as pinching and zooming into a scene or cropping a photo leaves less room for maneuver than some of the competition. Phones like the Realme X3 SuperZoom, sporting a 5x optical zoom, may not feature 5G, but its cameras are that bit more versatile.",
    "As for the ultra-wide 8MP f/2.2 camera, while it’s a welcome addition to the mix, its lower detail and poor low-light performance means it’s one for well-lit landscapes and group shots primarily.",
    "The third sensor around the back is a 2MP depth sensor, so it’s little wonder the portrait mode is respectable, with simple subjects sporting clean foreground and background separation. For more challenging bokeh such as glass or transparent objects, it falls behind Apple’s finest and - naturally - larger format cameras with organic depth.",
    "Video shot on the Oppo Reno 4 5G is captured at up to 4K resolution(30fps) or 1080p (60fps) and looks well held together in bright scenes. However, there’s less imaging software wizardry that can save smartphone videos from crumbling in low light than there is for photos.",
    "Oppo’s latest does an admirable job of delivering at least competitive footage which looks steady and crisp for the most part though, just be sure to avoid switching to the ultra-wide lens indoors.",
    "Qualcomm’s Snapdragon 765G chipset powers some pricey phones like the Motorola Razr 2020 and the Google Pixel 5. While it isn’t the most powerful chip around, therefore, it’s been established as being at least good enough to keep day-to-day experiences smooth, and that proves true here.",
    "Despite modest Geekbench benchmark scores: 605 single-core and 1,762 multi-core, the Reno 4 5G is still a capable casual gaming phone, with titles like Genshin Impact playing back at moderate graphics settings glitch-free.",
    "Day-to-day operation is also snappy, and thanks to Oppo’s Color OS, a well-optimized UI that combines with Android 10, everything looks good and app support is plentiful.",
    "Also worth noting, while the Reno’s combination of 128GB of storage and 8GB of RAM means plenty of space, anyone who thinks they might need more storage, however, should look elsewhere. There’s no microSD card slot within this Oppo mid-ranger, just a dual-SIM slot.",
    "Not many mid-range smartphones power up in under 40 minutes - an accolade reserved for the Reno 4 and Realme 7 Pro. That puts the two phones in flagship charging time territory thanks to Oppo’s Super VOOC 2.0 tech found in both.",
    "As with Realme’s 7 Pro, the Reno 4 5G also lasts a full day with no issues. The 4,000mAh battery drains by just 12% when watching a Full HD video at maximum brightness for 90 minutes, making it a great phone for streaming or playing back movies on given its big screen.",
    "With a Power Saving Mode and Super Power Saving Mode, if you need to eke out extra battery life, the Oppo Reno 4 5G has your back, and there’s also a high-performance mode that helps with gaming but drains power faster, giving you a pretty customizable experience for a mid-range mobile.",
    "First reviewed: December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Oppo Reno 4 5G price and release date",
    "11": "Design",
    "16": "Display",
    "22": "Camera",
    "30": "Specs and performance",
    "34": "Battery life",
    "37": "Don't buy it if..."
  },
  "links": {
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Reno 4 Pro": "https://www.techradar.com/reviews/oppo-reno-4-pro-5g-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Oppo Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "Google Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Realme X3 SuperZoom": "https://www.techradar.com/reviews/realme-x3-superzoom",
    "Motorola Razr 2020": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Realme 7 Pro": "https://www.techradar.com/reviews/realme-7-pro-review"
  }
}