{
  "source": "https://www.techradar.com/reviews/synccom",
  "title": "Sync cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T12:19:22Z",
  "author": "mark-pickavance",
  "summary": "Sync.com keeps you in sync... obviously",
  "verdict": "If you don't mind paying for a year at a time, Sync.com offers some competitively priced cloud storage and a rock-solid set of central functions, as well as some excellent security features. If Sync.com has everything you're going to need, then it's an appealing option.",
  "pros": [
    "Strong security features",
    "Good for teams",
    "Simple access and setup"
  ],
  "cons": [
    "Single-folder sync",
    "Basic interface options",
    "Payments billed annually"
  ],
  "article": [
    "Sync.com has been providing cloud storage services for a number of years now, and it's going to appeal if you're looking for something that's simple, speedy and secure. As the name suggests, it syncs a single folder of data between your computers and the cloud.",
    "In a lot of respects, Sync.com is similar to Dropbox, though it doesn't have quite as many features (such as the ability to sync files outside the main folder). What it does offer that Dropbox doesn't have, however, is end-to-end encryption for maximum file security.",
    "The core functionality of Sync.com is to keep a folder on your system in sync with the cloud and any other computers where you've got the client software installed. It's all very simple to set up and use, though you could reasonably point out that Sync.com isn't really offering anything you can't get elsewhere from better-known services – ones that come with office apps, better mobile integration, and so on.",
    "The platform supports versioning, so you can go back to older versions of files if you need to – and in a generous move from Sync.com, these older versions don't count against your storage quota. Once you're a paying customer, these older versions can be kept indefinitely, otherwise they'll automatically be wiped after 30 days.",
    "Basic file and folder sharing is supported on the Sync.com platform too, and there's also support for advanced sharing controls with password protection and expiry dates on links. Mobile apps are available – with automatic photo and video uploading, should you need it – and if you sign up for a team account then you get provision for keeping your data compliant with standards like HIPAA, GDPR and PIPEDA.",
    "Actually, one of Sync.com's features is its lack of features: a focus on the core functionality that matters, keeping your data secure, private and well-managed between multiple computers (and multiple users, if needed). If that appeals, and you want several terabytes of space for not much money per month, it's worth checking out.",
    "Installing Sync.com on Windows or macOS is a relatively painless exercise, and the application places a folder on your hard drive – anything dropped in here then syncs to the cloud and to any other computers where you've got the software installed. Network drives and external drives can't be included, nor can files and folders outside of your main Sync.com folder, so the software is a little bit limited in that way.",
    "The web interface is slick and easy to use, and offers another way of getting your files up to the cloud. If you prefer, you can upload and keep files on the web without having local copies on your synced computers, which is handy if you want to save some space on your desktop machines. Which files get synced to which computers is all nicely handled through the options screen in the desktop client.",
    "There's not all that much to the Sync.com interface on the desktop, besides progress indicators and a recent changes list, and so you need to go to the web interface to access old file versions and for advanced sharing options. The mobile apps, like the web interface, are straightforward and easy to navigate, even if they're rather plain in appearance (aesthetics really aren't the primary consideration for a cloud storage service).",
    "We found the Sync.com tools on the desktop and the web very polished and quick in use, with transfer rates good as well. 1GB of data was uploaded in around half an hour, and that's almost certainly limited by our home broadband connection – we suspect Sync.com can go much faster. You can throttle the upload and download speeds used by sync if you need to give bandwidth priority to other applications on your system.",
    "Security is a very important part of the overall Sync.com experience, with a whole host of features included to give you some extra peace of mind. They include two-factor authentication, end-to-end encryption, AES-256 bit encryption and the use of secure TLS tunnels to protect anyone from snooping on your files while they're being transferred to and from the Sync.com servers.",
    "Unlike some of its rivals, Sync.com doesn't work with a host of third-party applications or make an API available for other people to use – it sees this as an advantage though, reducing the number of ways in which your account can be exposed, and keeping the inner workings of the platform as secret as possible.",
    "You can try out Sync.com with 5GB of storage for free, but you're probably going to need more room than that. If you're an individual, you can sign up for $8 (about £6.40) a month, $12 (about £9.60) a month, or $15 (about £12) a month for 2TB, 3TB or 4TB of storage respectively. You have to pay for a year at a time, so multiply those figures by 12 and that's your up-front cost for the year – there's no monthly payment option with Sync.com.",
    "If you need features for multiple users and teams, you can pay $5 (about £4), $8 (about £6.40), or $15 (about £12) per user per month, billed annually – that gives each user 1TB, 4TB or 10TB respectively. That top tier supports up to 1,000 users as well, while the other two cap you at 100 users for your account. Compared with the other services out there, those prices are very competitive.",
    "Sync.com might not be as polished or as easy to integrate with other services as the likes of Google Drive, Dropbox, iCloud, OneDrive and others, but it covers the basic functions of a syncing system well, and offers you plenty of storage at a very good price, and has some very impressive security features as well. For those looking for secure storage on a budget, it's certainly up there with the best options.",
    "We like a lot of the multi-user features as well, with plenty of control over which team members are able to access which files, and a lot of ways to log and monitor what's happening inside an account. While you might be able to mark down Sync.com for being a bit rudimentary compared with other systems, and lacking a little in the third-party integrations department, the ground that it does cover is covered very well."
  ],
  "headers": {
    "2": "Sync.com features",
    "6": "Sync.com interface",
    "10": "Sync.com security",
    "12": "Sync.com pricing",
    "14": "Sync.com verdict"
  },
  "links": {
    "Sync.com": "https://shareasale.com/r.cfm?b=732848&u=1338591&m=57377&afftrack=trd-us-2683288121537788400&urllink=https%3A%2F%2Fwww.sync.com%2F",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}