{
  "source": "https://www.techradar.com/reviews/domaincom",
  "title": "Domain.com review",
  "category": "computing",
  "updated": "2021-04-27T09:28:06Z",
  "author": "nate-drake",
  "summary": "Simple shared hosting from the big-name domain registrar",
  "verdict": "Domain.com's basic product range and shortage of features left us unimpressed, its excellent speed test results helped rescue the review. Check it out if you're looking for simple but speedy shared hosting (or maybe a web store), but give it a miss for everything else.",
  "pros": [
    "Excellent speeds during testing",
    "Helpful live chat support",
    "Reasonable value",
    "Feature-packed e-commerce plan"
  ],
  "cons": [
    "Signup hassles",
    "No monthly billing on some plans",
    "Limited product range",
    "No cPanel, Softaculous"
  ],
  "article": [
    "Best known as a domain registrar, Domain.com also has a small range of shared hosting and WordPress plans.",
    "These are reasonably well specified, with even starter plan offering unlimited disk space, a free domain, unlimited subdomains, 5 FTP users, 10 databases and a free SSL certificate from Let's Encrypt.",
    "Bandwidth for all plans is described as 'scalable.' According to the company, this means that if your traffic outgrows shared hosting, 'we work with the customer to identify scalable solutions, such as our Virtual Private Servers.'",
    "As the company doesn't appear to offer VPS hosting any more, we're not sure what your options might be. The company states that 'we are able to support more than 99.5% of customers with no issues at all', so it's unlikely to affect most people.",
    "The Basic plan includes all the features we've described above, and is priced at $3.75 a month on the initial one, two and three-year plans, renewing at $4.99. (Yes, that's right, no discount for longer term subscriptions and no monthly billing option.)",
    "The Deluxe plan adds support for unlimited websites, 25 databases and 25 FTP accounts, and is priced at $6.75 a month on the initial one, two and three-year plans, renewing at $8.95.",
    "The top-of-the-range Ultra plan supports unlimited databases and FTP accounts, as well as unlimited websites and storage, and is priced at $13.75 a month on the one, two and three-year plans. (There's no introductory discount on the Ultra plan, so the renewal price is the same.)",
    "These prices look a little expensive, but that's partly because other hosts typically give you a discount on the first term. HostGator’s single site Hatchling plan starts at just $2.75 a month, for instance, a $1 saving on Domain.com's deal, but you'll have to sign up for three years, and it renews at $6.95.",
    "If price is your priority, though, there are cheaper providers around. Namecheap is also a top domain registrar, for instance, but it has a much wider range of products, including some real bargains. Shared hosting starts at with a 20GB storage, 3 website, unlimited bandwidth product for just $1.24 a month on the two-year plan, $2.88 on renewal.",
    "Domain.com's website builder plan offers an easier visual route to creating your site, but with a surprisingly capable feature set: blog support, lead capture forms, Facebook integration, e-commerce tools, free SSL and a library of 550,000 images, free for you to use.",
    "Storage is unlimited, and, surprisingly, bandwidth is, too (no 'scalable' bandwidth here.)",
    "Prices begin at a low $1.99 a month (over one, two or three years) for the Starter plan. Your site is restricted to only six pages, though, there's no e-commerce support, and support is via chat and e-mail only.",
    "The Business plan supports unlimited pages, adds website analytics and phone support, and throws in a Save History feature to enable rolling back your website to a previous state. It's priced at $6.99 a month, again on the one, two- or three-year plans.",
    "The e-commerce hosting plan adds, you guessed it, a pile of e-commerce functionality: online store, digital products, order and inventory management, coupons and discounting, integrated shipping, and the ability to accept payments via Stripe, PayPal and Mollie. Priority supports means your queries jump to the front of the queue, and it's priced from $12.99.",
    "Domain.com's WordPress hosting begins with a couple of very basic shared hosting plans.",
    "WP Starter gives you unlimited storage and bandwidth, a customized control panel, pre-installed themes and plugins, and... No, sorry, there is no 'and': that's it. It looks cheap initially at $3.75 a month billed monthly, or over one or two years, but renews at $7.49 over three years, or $9.49 annually.",
    "WP Essential includes malware scanning and removal, and specialist WordPress support. It's priced at $6.95 a month billed monthly or over one to three years, renewing at $10.49 on the three-year plan, $12.49 annually.",
    "A WP Live range gets you more support, design guidance, even website optimization advice. Prices range from $24 to $118 a month on the annual plan. While that's not cheap, monthly billing is available. If you only need help polishing, optimizing and setting up your site, it could be that a month or two of WP Live will get the job done.",
    "This isn't bad, but the best hosts give you many more options and features. IONOS' WordPress range starts at $3 billed monthly for a very basic single site plan, while its WordPress Pro range offers features like staging, daily backups, intelligent updating, malware protection and a pile of caching and optimization technologies for $18-$120 a month.",
    "The Domain.com signup process seemed straightforward, until we noticed that our shared hosting plan required we bought a domain - we couldn't use one we owned already, as allowed by just about every competitor.",
    "The website told us we could use a DOMFREE code to get the domain free, but our shopping cart page warned this was 'invalid.' Why? It turned out the DOMFREE offer had expired almost three months earlier.",
    "To make life worse, the payment page refused to accept an email address using our own domain (one we'd been using for years, not the new one), warning that it was 'invalid.' What? Why? We've no idea, and the site 'forgot' to tell us.",
    "We tried a Gmail account, and this worked, although we were then warned that \"your purchase is being reviewed by our order verification team\" and \"the review process is typically within 24 hours.\" It's good to see a host working to keep scammers off the site, but not so convenient when it blocks you, too, for the flimsiest of reasons.",
    "Your Domain.com website is managed from a custom control panel of its own, with vDeck on hand for more advanced tasks (MySQL, AWStats/ Webalizer, .htaccess editor, more.) You don't get cPanel.",
    "Domain.com's own panel is very, very basic. Install WordPress; create email accounts; manage domains, DNS and nameservers, and that's the main functionality done.",
    "VDeck looks much like cPanel, only considerably cut down (our setup had just 19 tools.) But again, it covers the basics, and experienced users should quickly find their way around.",
    "One notable problem with Domain.com's custom solution is it allows the company to include lots and lots of ads. Our summary page suggested we purchased domain privacy, for instance. And G Suite. And gave us a list of domains we might want to register. Click any menu item for a feature you haven't purchased, and you'll see a graphic suggesting you do. And sometimes the site would suggest upgrading our account to get more features.",
    "Fight your way past that and it's easy enough to get started. An automated WordPress installer should get you set up in a few minutes, for instance. (There's no Softaculous, though, so no support for automatically installing anything else.)",
    "Alternatively, you can upload a static site via the file manager or FTP, or dive into vDeck, create new databases or whatever else you want to do.",
    "We still missed having access to cPanel and Softaculous, and Domain.com's hosting is notably worse off as a result. But there's enough power here to get by, and you should have most sites up and running without much hassle.",
    "Support is one of the key ingredients when it comes to hosting packages and Domain.com does not disappoint. The live chat is available 24/7/365 and it was perfectly easy to connect to an agent. We posed the question ‘Is the Website Builder included in the hosting plans or does it have to be purchased as an extra?’ via Chat Support and an agent was with us in less than 30 seconds. The agent was very friendly and helpful who patiently explained our initial query and additional questions we posed.",
    "The Knowledgebase is divided into several categories such as account, advanced hosting, domains, email and security amongst others. Articles are easily identifiable and can be found through a simple search. When we typed in ‘Transfer Domain’ we were met with articles like ‘Domain Transfer: How to transfer a domain to your Account?’, ‘How to Transfer your domain to another Company’ and ‘How to Transfer multiple domains to your account?’. You can access all articles whether you are a customer or not.",
    "As a final test we configured Uptime.com to check our server availability and response time every five minutes over a week (that's more than 2,000 samples.) Results were excellent, especially for a basic shared hosting package, with an average response time of 215ms (typical providers manage around 300ms.) Consistency was even better, with a range of 189-362ms, the tightest we've seen in our most recent batch of 30+ hosting reviews.",
    "Domain.com's speedy and reliable performance results are appealing (and it's fair value, too), but the small product range and lack of standard features (cPanel, Softaculous) mean it won't be a smart choice for most people.",
    "The TECHRADAR coupon is good for 25% off the cart total with no minimum purchase. All renewals after the initial discounted period will be charged at the then current standard list price for the selected period. Coupon is not valid with sunrise registrations, landrush registrations, EAP registrations, pre-registrations, premium registrations, renewals, transfers, custom website design, other coupons, or special pricing."
  ],
  "headers": {
    "9": "Website Builder",
    "14": "WordPress hosting",
    "19": "Account setup",
    "23": "Creating a website",
    "30": "Performance",
    "33": "Final verdict"
  },
  "links": {
    "Domain.com": "https://domain.mno8.net/c/221109/577846/9560?subId1=trd-us-1222001581568672800&sharedId=trd-us&u=https%3A%2F%2Fwww.domain.com%2F",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "Namecheap": "https://www.techradar.com/reviews/namecheap",
    "Shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "e-commerce hosting": "https://www.techradar.com/news/best-ecommerce-hosting",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers"
  }
}