{
  "source": "https://www.techradar.com/reviews/lenovo-legion-tower-5i",
  "title": "Lenovo Legion Tower 5i review",
  "category": "computing",
  "updated": "2020-12-16T22:46:01.233Z",
  "author": "john-loeffler",
  "summary": "Plenty of power for the price",
  "verdict": "The Lenovo Legion 5i Tower is a well-powered machine at a fairly reasonable price, making it a fantastic mid-range gaming PC.",
  "pros": [
    "Up to Nvidia GeForce RTX 2080 Super",
    "Great design",
    "Not a lot of bloat"
  ],
  "cons": [
    "No USB Type-C among front ports",
    "Finicky drivers"
  ],
  "article": [
    "The Lenovo Legion Tower 5i is a full-sized desktop gaming PC targeting the mid-range customer and solidly delivers on that expectation. While nothing especially stands out with the Legion Tower 5i, for gamers who want a great gaming PC right out of the box that can start playing the latest AAA titles, you get your money's worth here.",
    "Starting at $1,069 / £1,139 / AU$2,299, you'll have to spend a good bit more to get the best configurations, including the Nvidia GeForce RTX 2070 Super and the Intel Core i7 (the model we reviewed currently sells for $1,599 / £1,399 / AU$3,799), but for the power, this is definitely well-priced and especially the higher end set-ups which make ray traced gaming more accessible.",
    "Even though the base model comes with an Nvidia GeForce GTX 1660 Super, for a budget GPU this is a fantastic bit of hardware so you will definitely get solid gaming performance on even the latest AAA titles (though not on ultra settings, obviously).",
    "Being a full-sized rig, there's plenty of room to build on going forward as well, making it a very upgradable PC that with some investment down the road can last you for a many years.",
    "The design of the system itself is also well done. There's no mistaking this for anything other than a gaming PC and its full of RGB lighting, but it isn't obnoxiously so and you have considerable control over it thanks to the Lenovo Vantage app. We'd love to see some differentiation from vast crowd of similar looking desktops, but apparently we aren't there quite yet. Maybe next year.",
    "In the end, the Lenovo Legion Tower 5i isn't perfect, but it offers consumers a lot of power at a fairly reasonable price while looking pretty good doing it. For an out of the box gaming PC, you can do a lot worse than the Legion Tower 5i.",
    "The Lenovo Legion Tower 5i is available now, starting at $1,199 / £997 / AU$2,299. The \"base\" configuration in the US and UK has changed somewhat since it's release. Now, the cheapest model available in the US and UK comes with a GeForce RTX 2060 Super, a 10th-generation Intel Core i5, 16GB RAM, and 512GB PCIe SSD.",
    "Australia, meanwhile, is still selling the original base configuration with the GeForce GTX 1660 Super at the original AU$2,299 price point.",
    "There are several different configurations you can opt for and some of them - like the current lowest priced configuration in the US and UK - offer an RTX 2060 Super for less than the configurations with the GTX 1660 Super, so definitely shop around a bit to get the best power for the price.",
    "Lenovo says the Legion Tower 5i is meant to have a more \"industrial\" look than your typical gaming PC, and on the front and side without the acrylic window, they largely succeed. The built in handle on the top-rear of the case both makes it look more like a piece of machinery and functionally makes it feel like a freestanding power tool when you carry it around (at least in this reviewer's experience).",
    "Flash around to the windowed side of the case and it's all gaming PC, with prominent graphics card, RGB lit fans, and some sexy cable management, if we do say so ourselves.",
    "The back panel is your fairly standard PC tower case, for the most part. It's good to see a USB Type-C port there, though we'd rather there were at least two.",
    "On the more negative side, we really wish there was a USB Type-C port on the front of the computer, rather than sticking it in the back. USB Type-C is becoming more ubiquitous, and having to go around to the back of the machine to access that particular port is a bit annoying.",
    "The mouse and keyboard that come with the Legion Tower 5i are functional but not exceptional. Some out-of-the-box gaming PCs include a basic gaming mouse, but this one is about as standard as they come, though it is ambidextrous.",
    "Where the Legion Tower 5i really does stand out is where it counts, namely its raw gaming performance. The Nvidia GeForce RTX 2070 Super may be last-gen tech now, but its still a very powerful card that can pump out 60+ fps on any AAA title at 1080p on ultra, and can even hold it's own in 1440p gaming. While it might struggle with Watch Dogs: Legion with ray tracing turned on, so do the RTX 3080 and even the RTX 3090, so you won't be missing out much with this rig.",
    "If you opt for the GTX 1660 Super models, you'll still be getting excellent gaming performance for the price. You might not get ray tracing, but a lot of games don't even have it yet and the Legion Tower 5i is flexible enough that you upgrade the graphics card and motherboard down the road when ray tracing hardware comes down in price.",
    "If you go towards the higher end and opt for the RTX 2070 Super, you can expect excellent gaming performance out of the Legion Tower 5i. In Metro: Exodus, the Legion Tower 5i managed 62 fps at 1080p on ultra settings with ray tracing turned on and 68 fps without ray tracing. On low, it ran even faster, pumping out 157 fps at 1080p.",
    "In Total War: Three Kingdoms, the Legion Tower 5i put out 70 fps at 1080p on ultra settings and 221 fps on low settings at 1080p. It also managed some pretty great 3DMark scores, which isn't surprising considering that its being powered by an RTX 2070 Super.",
    "The Intel Core i7-10700K scored well on Geekbench 5's single-core CPU benchmark, registering a respectable 1,281 points, but it lagged behind a comparable AMD Ryzen 7 on multi-core performance, but as a gaming PC, this is pretty much in line with expectations.",
    "For a lower-cost gaming PC, we're pleased to see that there isn't a whole lot of bloatware. You get the pretty standard Windows 10 bloat and McAfee preinstall, but this isn't a system you'll be spending a lot of time uninstalling a bunch of smaller apps.",
    "The main preinstall on the Legion Tower 5i, the Lenovo Vantage control center, is pretty useful for monitoring system resource utilization and its where you can set up the various RGB lighting settings with support for up to three color profiles.",
    "One of the issues that we did come across with the Legion Tower 5i was when we connected a Bluetooth keyboard and mouse to the PC. It worked perfectly for a time, but at some point the driver for the Bluetooth adapter just stopped working with Windows 10 entirely.",
    "We were never able to track down what spiked our Bluetooth capability – which persisted even after doing a complete system factory reset – and one day our Bluetooth magically returned as if nothing had happened. The issue was either with Intel's wireless drivers or a Windows 10 update, but it's hard to tell which.",
    "We also experienced some issues with loss of connectivity on one of the topside USB ports that came and went without any easily-identifiable cause, so the problem is likely a driver issue. While Lenovo can't be held responsible for driver issues, they do exist, so be aware than some sleuthing might be necessary from time to time.",
    "We have reached out to Lenovo to see if these are known issues, and we'll update this review as soon as we hear more."
  ],
  "headers": {
    "6": "Price and availability",
    "9": "Design",
    "14": "Performance",
    "19": "Software and features",
    "25": "You shouldn't buy it if..."
  },
  "links": {
    "Nvidia GeForce RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "Intel Core i7": "https://www.techradar.com/news/intel-core-i7-10700k-vs-intel-core-i7-9700k-how-does-intels-10th-gen-chip-stack-up",
    "Nvidia GeForce GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "Watch Dogs: Legion": "https://www.techradar.com/reviews/watch-dogs-legion",
    "so do the RTX 3080": "https://www.techradar.com/news/watch-dogs-legion-pc-specs-demand-an-nvidia-rtx-3080-for-4k-ultra-settings",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}