{
  "source": "https://www.techradar.com/reviews/razer-pro-click-review",
  "title": "Razer Pro Click review",
  "category": "computing",
  "updated": "2021-03-31T19:03:50Z",
  "author": "john-loeffler",
  "summary": "Razer goes to work with the Razer Pro Click",
  "verdict": "The Razer Pro Click is a phenomenal wireless mouse with an elegant design and precisely engineered ergonomics so that you barely notice you're using a mouse at all. The lack of a USB Type-C port is really the only knock against it, but with everything else it has going for it, we're more than willing to deal with the somewhat-awkward charging port that you don't need to use very often.",
  "pros": [
    "Gorgeous design",
    "Precise ergonomics",
    "Can connect to multiple devices"
  ],
  "cons": [
    "No USB-C port",
    "Not particularly portable"
  ],
  "article": [
    "The Razer Pro Click is definitely one of the best Bluetooth-capable mice we've seen in quite a while.",
    "Between its beautiful design - we'd go so far as to call it elegant - and its precisely engineered ergonomics, you're going to be hard-pressed to find a better mouse for the home or office for the price.",
    "It has all of the features that you'd typically find in some of the best gaming mice that Razer puts out, but it isn't over the top in the same way as a typical gaming mouse. It has a few programmable buttons for macro use but keeps the thumb-side mostly clear.",
    "Holding up to three separate Bluetooth wireless profiles in the mouse, the Razer Pro Click can be easily switched between different systems around the home or office, which is especially useful to all the multi-boxers out there. The included wireless USB dongle also makes it possible to use the Razer Pro Click with just about any computer out there.",
    "The lack of a USB Type-C is disappointing, and the micro USB connection on the front of the mouse is awkward. It's set in such a way that the micro USB cord that comes with the Razer Pro Click is the only one that will actually fit to charge it.",
    "It's also a full-sized mouse, so it's probably not the most portable wireless mouse for people who do a lot of traveling and need to work while on the road.",
    "Beyond those two minor points though, we're hard-pressed to think of a reason why you shouldn't buy the Razer Pro Click. Esports enthusiasts aren't going to win any tournaments with this thing, but we're perfectly fine with Razer making a high-quality and ergonomically-gifted Bluetooth mouse for the rest of us.",
    "The Razer Pro Click is available now from Razer's website for $100 (about £77/AU$140). Other retailers are expected to start selling the mouse on August 27th.",
    "The Pro Click is just one part of a three-part collection of productivity peripherals. The other two, the Razer Pro Type and the Razer Pro Glide (a mechanical, wireless keyboard and a mousepad, respectively), are sold separately.",
    "But since the Pro Glide is meant to be paired with the Razer Pro Click, you can purchase it for about $10/£8/AU$14 wherever you buy the Pro Click. The Pro Glide is a rather large mousepad, but that's about all that you can say about it.",
    "It's a large, matching mousepad for an extra $10, something that may matter to a number of people who care about the aesthetic unity of their workspaces.",
    "The Razer Pro Click was designed in partnership with Humanscale, one of the world's top manufacturers of ergonomic peripherals for the workplace. The result is one of the most comfortable mice Razer's probably ever put out.",
    "Engineered to keep the user's wrist an optimum angle of 30 degrees, the palm rest curves under your hand in a way that keeps you from anchoring your wrist to the desktop surface and forces you to use muscles in your arm and shoulder which are bigger and less-inclined to tire after a full day's use.",
    "The look of the mouse is one of its most exciting features. It's a mouse meant for an office, so it eschews the garish RGB color lighting and jet black design that is typical of the gaming mice that Razer is best known for.",
    "Instead, it uses a rather dull creme colored top side with textured grips along the thumb side and the pinky side to help give the greatest degree of control possible. The mouse wheel is also made of a textured metal-alloy that both looks and feels amazing to use.",
    "The one major downside to the Razer Pro Click is the charging port on the front of the mouse. It's a micro USB connection, rather than the USB Type-C which we would have preferred.",
    "More of an issue, really, is the way the micro USB charging port is set into the front, which is too deep for other micro USB chargers to reach. That means you'll need the specially-designed micro USB cable that comes with the mouse, or you can forget about charging it for a while if you lose this cable.",
    "Speaking of control, while the Razer Pro Click ditches the gamer chic aesthetic for a more minimalist-but-still-elegant one, it retains all of the performance features found in a modern gaming mouse. This allows it to bring a high level of precision to the office that many workers rarely see.",
    "With a DPI of 16,000 and tracking accuracy of 99.4%, the Razer 5G Optical Sensor in the Pro Click makes it one of the most responsive office mice on the market.",
    "The mechanical switches beneath the left and right mouse buttons are rated for 50 million clicks, and the mouse's battery is rated for 400 hours of use on a single charge.",
    "There are two programmable buttons on the thumb side of the mouse should you be so inclined to use them, with eight programmable buttons for the mouse overall. There is a switch on the underside to activate wireless or Bluetooth connectivity, both of which work very well.",
    "The USB wireless dongle is stored under a plastic cover on the underside of the mouse, so it isn't the easiest thing to lose. There's room on the mouse for 4 different Bluetooth profiles, making it pretty easy to switch the mouse over to another device with the push of a button."
  ],
  "headers": {
    "0": "Two minute review",
    "7": "Price and availability",
    "11": "Design",
    "17": "Performance",
    "22": "Don't buy if..."
  },
  "links": {
    "best gaming mice": "https://www.techradar.com/news/best-gaming-mouse",
    "wireless mouse": "https://www.techradar.com/news/best-wireless-mouse"
  }
}