{
  "source": "https://www.techradar.com/reviews/nvidia-geforce-now",
  "title": "Hands on: Nvidia GeForce Now review",
  "category": "gaming",
  "updated": "2020-06-16T16:31:25Z",
  "author": "jackie-thomas",
  "summary": "GeForce Now is GeForce here",
  "verdict": "Nvidia GeForce Now is probably the best online game streaming service on the market right now, with solid pricing and performance.",
  "pros": [
    "Super accessible",
    "No upfront costs",
    "Play your steam library"
  ],
  "cons": [
    "Messy UI",
    "Can get laggy"
  ],
  "article": [
    "Nvidia GeForce Now is finally out of beta. Finally, after sitting there for such a lengthy period and kind of getting lost in time, it’s now available for everyone with a membership to use, offering a free account as well as a paid Founders membership with added privileges like Priority Access and an extended session length.",
    "Nvidia GeForce Now was kind of a thing before we heard word one about Google Stadia or Mcrosoft xCloud. And, despite its launch delays, hitting the streets a few months after the other two services, it’s the only free game streaming service on the market. That should lead to more folks trying it out.",
    "Now that Nvidia GeForce Now is out in the wild, let’s take a look at what the service offers its members, both free and paid, to see if it’s worth signing up for.",
    "Nvidia GeForce Now is out right now and is available in two different tiers: Free and Founders. The Free plan is, you guessed it, free, and will allow users to play games in their existing PC game library for up to an hour at a time. There's another catch, too: Free users just have \"standard access,\" this means that when the servers are feeling particularly congested - think launch conditions - you'll have to deal with a queue to play your games.",
    "The Founders version gets rid of this server queue, giving paying members \"Priority Access\", four hours to play at a time and, turning on ray tracing in games - something Google Stadia just can't do. This plan will set users back $4.99 a month, though this price will only be in place for 12 months. We're not sure what the price will jump to after the first year, but we can easily see it doubling to $9.99 a month.",
    "When you compare the pricing to Google Stadia, GeForce Now is an extremely attractive offer. Not only does Nvidia's service actually have a free tier that's available now, but you also don't have to drop $129 upfront to get into the service. If you're curious about online streaming and want to try the tech out, GeForce Now is objectively the most accessible way to do it.",
    "One thing that Google Stadia has is a user interface that's easy to use and pleasant to look at, even if it does have some issues. The same can't really be said of Nvidia GeForce Now.",
    "Rather than being able to launch the service from Google Chrome, you're going to have to install the GeForce Now client. From there, you'll have to either pick one of the featured games on display or type in the game you're looking for in the search bar at the top of the UI.",
    "Once you add the game you're looking to play, you can launch it, and it will take you to the store it's located on. However, this can get a little complicated. For instance, when we tried to add Wolfenstein Youngblood to our account, there were two options that came up. The first one that we added to the account took us to the Bethesda launcher, where we did not own the game and therefore couldn't play it. So, we had to quit all the way out and add the game to our library again, but clicked the second option this time, which fortunately was located on Steam.",
    "It's a minor annoyance, to be sure, but if you already own a game on a specific platform and it's available elsewhere, you could be in for some tedium.",
    "And, of course, we can't talk about selecting games without mentioning the games that are incompatible with the service. Many games from huge publishers like Square Enix and Rockstar Games are simply missing. Now, we tried to get around this by launching a different game and launching something like Shadow of the Tomb Raider or Final Fantasy XV from there but it failed. GeForce Now practically yelled at us saying \"You can't play this game right now.\" You can only play the game you launch from the GeForce Now app, even if it sends you to the Steam library UI.",
    "There are some settings you can adjust through the UI, though they aren't super plentiful. You can adjust streaming quality to favor performance, saving data or a balance between the two, enable Discord integration and toggle a network status indicator.",
    "The user interface might be the area where Nvidia GeForce Now could use the most improvement. It's not, like, unusable, but it can be difficult to navigate efficiently.",
    "A hot topic when it comes to game streaming services these days is obviously going to be performance. There are a lot of folks, us included, that are a bit skeptical about streaming's takeover in the world of games, so this is the one thing that Nvidia GeForce Now has to nail if it's going to succeed.",
    "And in our experience, it's fine. Now, full disclosure: so far we've only really played games on the service at home on a gigabit wired internet connection, so if you have a more modest internet connection your experience is definitely going to vary.",
    "While at home on that fast internet connection though, we don't experience any hiccups at all. Playing through The Witcher III: Wild Hunt for the gazillionth time is an excellent experience, with Nvidia's servers easily able to handle the game at 1080p with all the settings maxed out, including the dreaded Nvidia Hairworks. It is a shame that this is the max resolution and aspect ratio that the service supports, but that's not enough to really knock it, especially at this introductory price.",
    "However, once we moved on from a wired internet connection the experience sours a bit. We installed GeForce Now on a 2018 13-inch MacBook Pro and played a bit of Wolfenstein Youngblood. Now, the game absolutely looked amazing, thanks to the enabled RTX features, but something just wasn't right.",
    "We can't put our fingers on it, but the fast-paced shooter doesn't feel quite as quick as it does when it's running on our PC. We don't have a way to scientifically measure the lag, but there was something, though it was pretty minor. It's likely that lag is just something that nascent streaming services like Google Stadia and GeForce Now will have to grow out of as the technology matures, but for now we'd much rather play on our own PC.",
    "After all, GeForce Now uses our existing PC game library, so we don't have much of a reason to use this service when we have a more capable gaming PC at our disposal. However, for folks that have an extensive PC game library but are either in between gaming PCs or can't afford one, this service might be the most affordable way to get your game on for cheap.",
    "Nvidia GeForce Now is the best game streaming service around right now, but only because its competition is so weak. Performance is passable and the UI is messy, but the vast library and the more affordable pricing tiers make it much more appealing.",
    "GeForce Now will likely evolve quite a bit over the next few years and we could see it becoming the de facto way to play your PC games while you're on the road. We can't wait to see what the future of this platform looks like."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design and interface",
    "13": "Performance",
    "19": "Early verdict"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Mcrosoft xCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Nvidia GeForce Now is out right now": "https://www.techradar.com/news/nvidia-geforce-now-will-let-you-play-ray-traced-games-on-a-macbook-air",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "incompatible with the service": "https://www.techradar.com/news/nvidia-geforce-now-is-missing-some-rtx-games-but-still-has-more-than-stadia",
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot",
    "Final Fantasy XV": "https://www.techradar.com/news/final-fantasy-xv-review",
    "2018 13-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-2018-with-touch-bar-13-inch"
  }
}