{
  "source": "https://www.techradar.com/reviews/pure-usenet",
  "title": "Pure Usenet review",
  "category": "computing",
  "updated": "2021-03-12T15:45:15Z",
  "author": "desire-athow",
  "summary": "An affordable and easy-to-use newsgroup service",
  "verdict": "Pure Usenet provides a good, reliable service with affordable plans. A 7 day free trial with unlimited downloads is also included.",
  "pros": [
    "1 week free trial with unlimited GB",
    "Low-priced unlimited plan"
  ],
  "cons": [
    "Some rivals offer more retention",
    "Lower tier plans have less connections"
  ],
  "article": [
    "Looking for a Usenet service that suits modest newsgroup access requirements? The answer could be Pure Usenet. A popular choice for newsgroup access, Pure Usenet is also simple, offering the perfect set of features to anyone new to Usenet or requiring the most basic experience.",
    "Offering an easy to use service, Pure Usenet has been providing affordable access to Usenet for most of the past decade.",
    "Using the service is straightforward, although a third-party client is required. This might be something as simple as Mozilla Thunderbird or a dedicated solution along the lines of NewsLeecher.",
    "Pure Usenet isn't considered to be among the top-performing Usenet services, but it is perfectly weighted if you're dipping your toe into newsgroups and NZB for the first time.",
    "Signing up to Pure Usenet will give you a unique username and password, access to the Pure Usenet servers, 3,800 days of data retention, and free SSL. All packages give you a good deal on data, too, with a choice of 20Mbps, 60Mbps, or Unlimited data.",
    "Importantly, Pure Usenet also offers simultaneous connections. These differ depending on the chosen subscription, but the more connections you have open, the faster your Usenet experience is likely to be. Multiple connections mean you can take advantage of your internet connection's full potential.",
    "You'll also find settings available for the most popular Usenet newsreaders, enabling swift set up.",
    "Reflecting the requirements of the average Usenet subscriber, Pure Usenet offers low prices (see Pricing, below) and boasts excellent customer service. The site features a comprehensive yet brief Support page, which includes a getting started guide and information on billing.",
    "While there is no live chat feature, a web form is provided for support requests. A phone number is provided, while Pure Usenet also lists its email address. Social networks are listed, but these don't appear to have had any activity since 2013.",
    "A key element of Usenet, retention is the time that articles or other content remain on a server. It's such an important aspect of the experience that it can make or break a Usenet service.",
    "Pure Usenet offers 4,100 days of retention, a figure that it has increased repeatedly over the past couple of years.",
    "The retention limit exists because it would be impractical for a Usenet provider to store everything uploaded to the 110,000+ newsgroups forever. It would also be extremely expensive and impact the monthly subscription rate considerably.",
    "3,800 days is around 10.5 years, however, so there is a strong chance that everything you need to access will remain available.",
    "If you're looking for something older, remember that Google Groups provides an archive service of Usenet dating back to 1981.",
    "It is unwise to rely on any service that doesn't offer an SSL option in 2020. All trustworthy websites, online stores, social networks, and other services should provide HTTPS. This is the secure evolution of the protocol for sending website data HTTP, plus TLS/SSL (Transport Layer Security/Secure Socket Layer).",
    "Usenet, however, uses NNTP (Network News Transfer Protocol) and there is a similar secure option provided by TLS/SSL which is sometimes referred to as NNTPS. Usually, however, Usenet service providers simply highlight that they offer SSL.",
    "Pure Usenet features free SSL which you can choose to use in your newsreader app. Otherwise, you can rely on the non-encrypted option. This is useful for less private activities, such as engaging in discussion newsgroups, but SSL should be your preference.",
    "Reliability and speed are just as important as retention and SSL when choosing a Usenet provider. Does Pure Usenet offer good performance? Well, its servers seem up to the task, dropping files at 2000KB/s.",
    "During testing, unlimited data certainly seemed to live up to the description, with no noticeable outages. This makes for a satisfactory Usenet experience. While Pure Usenet might fall short for power users, this level of performance again underlines its suitability for average Joes and noobs.",
    "Three main pricing options are available from Pure Usenet. While there is no free package, each bundle has a 7-day free trial with unlimited data, so if you don't like the service you can cancel without paying for the subscription. However, the trial bundle doesn't allow uploading or posting to newsgroups. This feature is only available with Pure Usenet's paid subscription bundles.",
    "The most affordable option is Pure M at €3,09 (£2.66, $3.40) a month for an annual subscription (€3,87 with the monthly payment). You'll get eight simultaneous connections, 20Mbps downloads, 3,800 days retention, and free SSL.",
    "Pure XL gives you 60Mbps downloads, 12 connections, and the standard retention and SSL levels. This will cost just €4,53 (£3.91, $4.98) a month with an annual subscription (€5,67 on the monthly plan). Trebling the speed for the under €1,50 is a generous package, making this one to seriously consider.",
    "If your Usenet requirements demand as much speed as possible, the Pure XXL bundle with unlimited data speed and a massive 20 simultaneous connections should suffice. It costs just €5,97 (£5.15, $6.56) a month (€7,47 with the monthly plan).",
    "Boasting affordable packages scaled for different levels of use, Pure Usenet has all the basics you need from a Usenet service. With good data speeds, simultaneous connections, SSL as standard, and a simple set up, Pure Usenet seems the ideal solution for anyone interested in using Usenet for the first time. Equally, it's suitable for old hands who don't necessarily need to be downloading regularly. Data retention might not be up to the standard of some other services, but at over 10 years' worth of data, it's not exactly poor, either.",
    "If nothing else, try Pure Usenet with the free 7-day trial at maximum settings and get a taste of the service."
  ],
  "headers": {
    "4": "Features",
    "9": "Retention",
    "14": "Security and privacy",
    "17": "Performance",
    "19": "Pricing",
    "23": "Final verdict"
  },
  "links": {
    "Usenet service": "https://www.techradar.com/best/best-usenet-providers",
    "Pure Usenet": "https://www.pureusenet.nl/?a_aid=58ac3d49df14c&a_bid=98b83a8e&chan=prp",
    "NewsLeecher": "https://www.techradar.com/reviews/newsleecher",
    "SSL": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Pure M": "https://www.pureusenet.nl/?a_aid=58ac3d49df14c&a_bid=98b83a8e&chan=prp",
    "Pure XL": "https://www.pureusenet.nl/?a_aid=58ac3d49df14c&a_bid=98b83a8e&chan=prp",
    "Pure XXL": "https://www.pureusenet.nl/?a_aid=58ac3d49df14c&a_bid=98b83a8e&chan=prp"
  }
}