{
  "source": "https://www.techradar.com/reviews/philips-fidelio-x3-open-back-headphones",
  "title": "Philips Fidelio X3 Open-Back Headphones review",
  "category": "audio-visual",
  "updated": "2020-10-08T20:45:18Z",
  "author": "nick-pino",
  "summary": "Phenomenal open-back headphones that cost half as much as a pair of Sennheisers",
  "verdict": "As an alternative to more expensive open-back headphones out there, the Philips Fidelio X3 combine impeccable sound quality with a comfortable and durable design. The treble and sub-bass might be two minor soft points, the overall clarity and large soundstage on offer here will knock you off your feet.",
  "pros": [
    "Modern cloth design",
    "Both comfortable and durable",
    "Robust mid-range and low-end",
    "Crystal clarity and large soundstage"
  ],
  "cons": [
    "Fidelio X2 are much cheaper",
    "Weak sub-bass response",
    "Can experience sibilance",
    "Wired with sound leakage"
  ],
  "article": [
    "If you’ve never heard a high-end pair of headphones before, the Philips Fidelio X3 is going to blow you away – there’s no doubt about it. We can say that about very few headphones these days and only a handful of those products cost under $500 / £500.",
    "And yet, the Philips Fidelio X3 is among them.",
    "It’s a great buy, not just for first-time critical listeners but also for audiophiles constantly chasing that perfect sound. It offers a robust, full mid-range and low-end sound with vibrant treble that can feel a bit over-excited at times, but nonetheless sounds warm and rich. It’s a serious competitor against the legendary Sennheiser HD600, HD650 and HD6XX, but in a more modern design with plush felt padding that makes it feel luxurious to wear.",
    "In fact, one of the only major flaws with the Fidelio X3 is that its predecessor, the Fidelio X2, offers many of the same features for half the price (around $150/£99), as does the aforementioned Sennheiser HD6XX that can be found exclusively on Drop for $220.",
    "If you can overlook some minor price inflation, and the fact that these open-back wired headphones are more or less only good for critical listening inside your home, the Fidelio X3 can treat you to some of the best sound quality you've ever heard.",
    "The Philips Fidelio X3 was released in September 2020 and is the sequel to the four-year-old Fidelio X2. The Fidelio X3 is a bit on the expensive side at around $300 / £300 (around AU$400), which sounds like a lot but is actually the going rate for a prized pair of open-back, over-ear headphones.",
    "To put the Fidelio X3’s price in perspective, the Sennheiser HD 660S, new for this year, comes in at $499 / £429 while the comparable Beyerdynamic DT 1990 Pro comes in at $599 / £370.",
    "Compared to those, the Fidelio X3’s $300 / £300 price point actually isn’t so bad.",
    "You might think that, with a lower price point than the other models, Philips may have cut some corners with the design of the headphones – and yet, if it did, we’ve yet to see it.",
    "To us, the Fidelio X3 feels absolutely luxurious, with plush velour earpads, a sturdy metal bridge and an adjustable head strap. The hinges on the arms are plastic, but otherwise you’re looking at a mostly metal construction with cloth covering.",
    "We liked how modern the cloth and metal design looked, and how comfortable it felt once we put it on. The braided cable means you'll have less fraying than standard plastic shielding and Philips has figured out the perfect amount of clamping force that helps to keep the headphones stable around your ears, but not so tight that it puts pressure on your skull. It's a perfectly-balanced design.",
    "At the bottom of the headphones are the two left-right jacks that can either be connected to an unbalanced 3.5mm auxiliary cable or a 2.5mm balanced connection, and Philips includes a standard 1/4 inch-to-3.5mm adapter if you plan on connecting these directly to a vinyl player or AV receiver.",
    "To that end, it’s worth pointing out that these are strictly wired headphones and while that’s not a shocker for most audiophiles, it might be worth considering another Hi-Res compatible set of cans if you’re looking for a pair of headphones that can go anywhere and everywhere.",
    "Commuters be warned, though, they’re a bit big on the head and can look a little strange should you decide to take them outside with you. But given their intended purpose as critical listening cans, these critiques are largely moot points.",
    "Describing the Philips Fidelio X3’s performance is a rabbit hole – every time you can think of a way to describe it by listening to your favorite song, you discover something new, something unique, about its tonal quality.",
    "By and large, what you’ll find is exceptional clarity in the midrange with a full robust sound that is spacious and precise. The lower range is nicely detailed and while it’s missing the sub-bass rumble that you might hear on closed-back cans, you don’t get any of that bloat, either.",
    "The treble, however, is a point of contention – we found it to be a tad sharp verging on sibilant in some songs like Walk on Water by Eminem, while other times with other genres it sounded absolutely fine. It’s an interesting quirk of the headphones and, considering it was something we had noticed when reviewing the Philips Fidelio X2, it’s clearly something Philips has baked into its sound signature at this stage.",
    "Testing the X3 with a number of different genres was an exciting experience, yielding varied results that, mostly, were very positive. Listening to The Chain from Fleetwood Mac gave us the chance to test out classic rock where we could pick out individual strings being plucked while reggae staples like One Love by Bob Marley had excellent, driving percussion and great bass response.",
    "Because of its immaculately precise upper limit you’ll most likely want to pair the X3 with a high-end DAC/amp or DAP, but thankfully it doesn’t take much power to drive it, with impedance of only 30 ohms. That means you can use it with your laptop, smartphone or tablet and maybe not get the best performance, but something fairly adequate. That versatility is great for folks just starting out in the audio community.",
    "The other point worth making, and most audio fans will roll their eyes at this, is that these headphones have a lot of sound leakage. Simply by the nature of being open-back headphones the X3 leak lots of noise at an audible level, potentially making them distracting for coworkers or spouses sharing the same space as you. That makes them particularly bad for taking outdoors and while most of you would never dream of that, we still feel obligated to mention it just in case you’re new to open-back designs."
  ],
  "headers": {
    "5": "Price analysis and release date",
    "8": "Design",
    "14": "Performance",
    "20": "Don’t buy them if..."
  },
  "links": {
    "Beyerdynamic DT 1990 Pro": "https://www.techradar.com/reviews/beyerdynamic-dt-1990-pro"
  }
}