{
  "source": "https://www.techradar.com/reviews/birds-of-prey",
  "title": "Birds of Prey review",
  "category": "audio-visual",
  "updated": "2020-02-06T10:29:07Z",
  "author": "samuel-roberts",
  "summary": "Is it worth watching the Harley Quinn-focused spin-off movie?",
  "verdict": "Birds of Prey is a cheeky and colorful team-up movie that has a genuinely different flavor to anything else based on the Marvel and DC universes, but it's not a particularly memorable film in and of itself. Harley Quinn fans will enjoy this much more than Suicide Squad, though.",
  "pros": [
    "Uniquely stylish for a comic book movie",
    "Great action sequences",
    "Genuinely funny in places"
  ],
  "cons": [
    "Team takes too long to assemble",
    "Too many obvious music cues",
    "The plot has no real twists"
  ],
  "article": [
    "Go to any comic con around the world right now, and you'll see that Margot Robbie's version of Harley Quinn from 2016's Suicide Squad is the most popular cosplay choice around. She was the breakout character from a movie that was otherwise a total waste of time, and Birds of Prey is predictably a better vehicle for the DC antihero, despite not being memorable for much more than its visual style.",
    "In fact, Birds of Prey frequently feels more like a Harley Quinn solo movie than a team-up movie, especially since the eponymous group doesn't assemble until deep into the third act. This isn't exactly a bad thing, though it means some members of the ensemble get less focus than others.",
    "With Joker no longer in the picture at the start of the movie, Harley becomes the target of misogynist crime lord Roman Sionis (Ewan McGregor, who's fantastic fun as a fragile rich boy), AKA the Black Mask from the Batman comics. To stay alive, Harley agrees to steal back a diamond, which apparently contains microscopic information that Sionis needs. Unfortunately, that diamond has been taken by young foster kid Cassandra Cain (Ella Jay Basco), who becomes the target of every mercenary in Gotham City.",
    "The other Birds' arcs orbit this main story: Renee Montoya (Rosie Perez) is trying to bring down Sionis but isn't getting the support from the GCPD that she needs. The mysterious Huntress (Mary Elizabeth Winstead) is cruising around Gotham City, putting crossbow bolts in the throats of gangsters with ties to her past. And Dinah Lance (Jurnee Smollett-Bell) is working for Sionis as his singer and driver, with increasing conflict about her boss's way of doing things.",
    "Birds of Prey is refreshing in how different it feels to other comic book movies. It's not structured like an origin movie, thank god, instead using flashbacks to introduce each of its main players, before advancing the diamond McGuffin plot that brings its characters together.",
    "Harley's story feels like one long chase sequence in some ways, and the funniest moments of the movie come when she catalogues her enemies' various grievances with her past actions ('voted for Bernie' is one reason Sionis wants her dead, for example). Director Cathy Yan uses on-screen animations, accompanied by Harley's voiceover, to give the movie a scrapbook-y quality, adding personality and a real sense of style.",
    "It does commit Suicide Squad's sin of having too many obvious music cues, though: 'Barracuda' and 'Black Betty' in the same movie is a bit much.",
    "Birds of Prey's real highlights are in its impressive action sequences. A baseball bat set piece will immediately put you in the mindset of John Wick (director Chad Stahelski worked on reshoots for this movie), and like those films, the action here is coherent, exciting and beautifully choreographed.",
    "It's a criticism you can level at 90% of superhero movies, but Birds of Prey is a little too superficial. There aren't any real twists to its main story, and not every character in the ensemble gets a truly interesting arc, which is a weakness when they're teaming up a bunch of unknown characters with one we already know.",
    "Harley definitely gets a satisfying journey: the way the movie explores the aftermath of her toxic relationship with the Joker and how she recovers her self-worth is handled well, and the movie still doesn't really frame her as a redeemable character, which is to its credit.",
    "The wider cast is mostly great, especially Perez as good-cop-turned-drunk-vigilante Montoya and the bratty performance of Basco's Cain as Harley's charge. Less compelling are Huntress and Dinah Lance, who are played up as cool characters, but aren't really given much life by their abrupt origin stories in the film.",
    "You also don't get nearly enough of the Birds of Prey interacting, which is the lifeblood of any superhero team movie. Maybe a sequel could build on that.",
    "This is the sort of movie that's still likely to speak to a portion of its audience, though – especially younger women. It also deserves credit for committing to being a madcap comedy. While it has sincere moments, particularly in the relationship between Harley and her young charge Cain, this is mostly worth watching for the fights, jokes and eventual team-up.",
    "Harley Quinn's portrayal, here, is much more tastefully handled across the board than it was in Suicide Squad, which is no surprise. The contrast between this movie and its 2016 predecessor illustrates how Warner Bros has been righting the ship with its DC movies: Birds of Prey doesn't feel like a cynical creation.",
    "Instead, it looks like its director and cast are having a lot of fun, and this movie brings a genuinely different flavor to a genre that's ludicrously overpopulated with average product. A better story and more time spent on its supporting cast could've stopped Birds of Prey from feeling as forgettable as it does, but fans of the Harley Quinn character will find plenty to enjoy here."
  ],
  "headers": {
    "13": "Verdict"
  },
  "links": {}
}