{
  "source": "https://www.techradar.com/reviews/nomachine-review",
  "title": "NoMachine review",
  "category": "computing",
  "updated": "2020-04-03T09:55:55Z",
  "author": "daniel-blechynden",
  "summary": "How well does this remote desktop program perform—find out in our NoMachine review",
  "verdict": "Overall, NoMachine is a good remote computer access program, but it certainly doesn’t stand out above its competitors. It does everything it needs to without really excelling on any front.",
  "pros": [
    "Free forever (single license)",
    "Supported on most devices"
  ],
  "cons": [
    "Limited customer support",
    "Can be confusing to begin with"
  ],
  "article": [
    "In our search for the best remote desktop software, we come to our NoMachine review and find a versatile program offering a range of powerful features. In short, it provides screen sharing and remote access solutions for everyone from personal users to large businesses. There’s even a powerful free version that’s suitable for many purposes as long as these aren’t explicitly commercial.",
    "We decided to complete a full NoMachine review to see if this free remote computer access program is as good as it appears. Our analysis includes a detailed look at everything from its included features and setup to its user interface and customer support.",
    "NoMachine is free forever for non-commercial users with its NoMachine for Everybody option. There is no signup required, and you can get started by simply downloading and installing the software. You can use the free version to accomplish some business-related tasks, such as to access business files from your personal computer, but not in direct commercial scenarios.",
    "NoMachine also offers a selection of powerful business and enterprise-level solutions for commercial clients. These are not free, and there are numerous specialized options available. Prices range from $44.50 to tens of thousands per year, so we’d recommend speaking with the NoMachine team to help you identify the right package for your business.",
    "NoMachine includes a great selection of powerful features aimed at a range of users. Among these is the ability to access standard screen sharing and remote access features. All and any files can be transferred between devices, and you can work remotely with any type of content. For example, you could connect remotely to your desktop from a tablet and access a video file stored on your hard drive.",
    "The features included with a paid NoMachine subscription vary according to the plan you sign up for. In general, though, these features are highly specialized to enable businesses of all shapes and sizes to manage and control their IT systems. These include large-scale connection tools and the ability to link thousands of different devices if necessary.",
    "NoMachine is quite easy to set up and doesn’t ask for any personal or payment information. Users simply need to download the correct software for their devices. Linux, Mac, Windows, iOS, and Android versions are available, among others. Follow the prompts to install the software on both the device you want to connect from and the one you want to view remotely. From here, you will be able to configure your remote connection by following the provided instructions.",
    "We tested NoMachine by connecting to a laptop computer from an Android smartphone, and we were more than happy with the results. The user interface is simple and intuitive on both the app and desktop versions, although the desktop client did feel a little outdated.",
    "Fortunately, though, NoMachine performed very well. We were able to view and remotely control our laptop with negligible lag on a 50Mbps internet connection. Additionally, we could record the session and view a range of information about the connected laptop. Mouse tracking was smooth and clicks registered immediately.",
    "On top of this, the NoMachine interface comes with a selection of additional tools. You can zoom in and out, focus on certain aspects of the remotely accessed device, and share audio. File transfer is fast and straightforward, and you can even customize the appearance of your interface.",
    "A wide range of security features protects NoMachine users and their data. All communications are secured with SSL certificates to prevent data breaches. New connections are configured behind a firewall and NAT routers, and two-factor authentication is available to reduce the risk of unauthorized account access. Additionally, users can protect sensitive information on remote devices by blanking their screens. Overall, NoMachine provides more than enough security features to protect your account.",
    "Unfortunately, NoMachine only offers in-person support to paying subscribers. If you do have a subscription, you can get help by submitting a query through the online customer center. Those who are thinking about purchasing the software can contact the sales team via the online contact form.",
    "However, all users can access NoMachine’s knowledge base and community forum. The knowledge base contains a selection of tutorials and detailed documentation to help troubleshoot common issues. More specific questions can be asked in the active community forum.",
    "All things considered, NoMachine is a powerful remote desktop connection manager that enables secure, streamlined remote access. A feature-rich free version is available for non-commercial use, while paid business licenses are available from $44.50 per year.",
    "Meanwhile, we were very impressed with NoMachine’s streamlined user interface and great performance. It’s available on all major operating systems, and all connections are protected by a selection of security features. Note, however, that live customer support is limited to paying subscribers.",
    "NoMachine is a good remote access platform, but some of its competitors are worth considering. For example, TeamViewer is a great alternative for small-to-medium businesses. It includes numerous additional features, such as meeting and presentation tools, which NoMachine just doesn’t have. It also offers a free version for personal use, although its business subscriptions are a little expensive.",
    "Take a look at NoMachine's competitors in our guide to the Best remote desktop software."
  ],
  "headers": {
    "2": "NoMachine: Plans and pricing",
    "4": "NoMachine: Features and utilities",
    "6": "NoMachine: Setup",
    "7": "NoMachine: Interface and performance",
    "10": "NoMachine: Security",
    "11": "NoMachine: Support",
    "13": "NoMachine: Final verdict",
    "15": "The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "TeamViewer": "https://www.techradar.com/reviews/teamviewer",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}