{
  "source": "https://www.techradar.com/reviews/google-home-hub",
  "title": "Google Home Hub review",
  "category": "appliances",
  "updated": "2020-10-19T10:29:45Z",
  "author": "nick-pino",
  "summary": "The Google Home Hub's cheaper than Echo Show and, maybe, even better",
  "verdict": "If you’re more interested in controlling your smart devices than you are watching movies or making video calls, the Google Home Hub makes a compelling claim to be the center of your smart home.",
  "pros": [
    "Cheaper than Echo Show",
    "Google Photos integration",
    "Innovative Home View UI",
    "Music on-demand"
  ],
  "cons": [
    "Smaller screen",
    "Limited video calling",
    "Weak audio"
  ],
  "article": [
    "The Google Home is Google’s flagship smart home offering. It might have arrived later than Amazon’s popular Echo range of connected home devices, but Google’s products are just as good.",
    "Rewind to 2015 and Amazon was the first technology company to create a smart speaker for your smart home with the original Amazon Echo.",
    "Five years later and the Echo range of smart home products has become a driving force in turning smart voice assistants from the stuff of science-fiction into a helping hand in our homes.",
    "But these days, Amazon isn't the only company to make top smart home products. Google's range of smart products is fast becoming just as good and just as popular.",
    "Over the past few years, both companies have launched product after product in an attempt to win us all over. These days the Amazon Echo Show (now in its third generation following the release of the Amazon Echo Show 10 ) and the Google Home Hub are some of the best smart home devices on the market.",
    "[Update: There's a new Google Nest speaker in town – the Google Nest Audio comes with upgraded sound quality, a new design, and costs $99 / £89 / AU$149. It launches officially on October 5 (though you can preorder it now), and was announced alongside the Pixel 5 and a new Chromecast at the company's Launch Night In event on September 30.]",
    "The Amazon Echo Show and Google’s Home Hub share a lot of similarities. Some are a little uncanny, including their form factor, their voice assistants, the range of features on offer and even some of the same voice commands.",
    "Because there are a lot of similarities, the Google Home Hub is a device we almost feel like we’ve used before. Yet we still find unique new features. For example, it has the auto-updating Google Photos gallery and Home View, which shows your entire smart home at a glance and adds Google's touch to things.",
    "All of this is tied together by both the Google Assistant, now smarter than when we saw it last on the Google Home Max and Google Home Mini, as well as the Google Home app on iOS and Android, which you’ll need to pair your smart home devices.",
    "Google has also launched another Google Assistant speaker, the Google Nest Hub Max – the first product to launch under the new converged brand name of Google and smart home device manufacturer Nest. This makes it the natural successor to the Google Home Hub.",
    "Combine the Home Hub’s simplicity and intelligence with the functionality offered by the speaker itself and you have the makings for a must-have smart home ecosystem that has only a couple of shortcomings.",
    "Google Home Hub released on October 22, 2018 for $149, £139 (around AU$210 and R2,999) in the US and UK, with availability for Australia to follow after. However, you're now able to get a sizable discount on the speaker in both regions thanks to Black Friday 2018.",
    "Taken at face value, that sticker price is fairly reasonable - the basic Google Home is $129 (£139, AU$199, R2,299), which means you get a Hub with a screen for an extra $20 (R700).",
    "That’s a massively good deal and if you're in the market, we've rounded up the latest Google Home Hub prices.",
    "Not only is the Google Home Hub relatively inexpensive compared to the Google Home, but it’s also inexpensive compared to its main competitor, the Amazon Echo Show, which will set you back $230 (£220, AU$350).",
    "Why is Amazon’s smart screen $80 / £80 more than Google’s? The Echo Show includes a camera that enables immediate video chat with anyone else who owns an Amazon smart speaker - an area that the Google Home Hub has bowed out of entirely – a louder speaker and a larger screen ... but we’ll cover all that and more in the next sections.",
    "Where we have to start, however, is with the dimensions of the Home Hub. Despite what it may look like in press photos, at just 178.5 x 118 x 67.3mm (L x H x D), the Home Hub is surprisingly small. It’s so small, in fact, that the screen portion is about the size of a large phone or small tablet and the base is so petite that you could easily pick it up and place it in the palm of your hand.",
    "But, while its small stature might have you concerned, it’s a surprisingly well-built product. It feels sturdily made and while the screen could break if something heavy came in contact with it, we felt more than safe with it sitting on our kitchen shelves and dining room table.",
    "Even if you are afraid of what might happen to it, you might not want to put it too far away - the 7-inch HD touchscreen is great up close and, unsurprisingly, much less dramatic when seen from afar.",
    "That said, a screen this small has its advantages.",
    "For one, photos - especially those shot on a phone - look great on the smaller screen. Had Google gone for something larger, say in the the 10- to 12-inch range, photos would not have looked as rich or as clear as they do on the Home Hub.",
    "The screen rests on the aforementioned base that puts the display on a comfortable tilt. The aesthetic is rounded out by a colorful bezel which matches the fabric-covered base and comes in four colors: pink, black, white and baby blue. Around the back you'll find a power input, volume control and mic mute toggle - and nothing else. It’s good old Google minimalism at work.",
    "Speaking of minimalism, the biggest difference between the Home Hub and the Amazon Echo Show is that the former doesn’t have a 5MP camera - in fact, there’s no camera at all. It’s a decision that Google made to eliminate privacy concerns - but comes with some drawbacks in that you won’t be able to make video calls, or at least ones where the other person can see you.",
    "If that sounds like a strange design decision, it’s because Google wants the Home Hub to be as welcome into your bedroom as it is on the kitchen table without you having to worry about it recording your … ahem … more intimate moments. Instead of a camera, therefore, you’ll find a light sensor.",
    "The light sensor enables the device to drop its brightness level when it detects a dark room. Google calls the speaker’s light awareness feature ‘Ambient EQ’ and not only does it adjust brightness to match the level of the room (something that helps the speaker blend in with your home) but it can actually change the color temperature and face of the screen to a clock when it’s time for lights out.",
    "In practice that means the speaker will dial down the blue light output when it’s on your bed stand before bed before automatically turning the display down to near invisible levels when you turn off the lights.",
    "Adversely, if you put it next a window in broad daylight, it’ll dial the brightness back up - though, it will top out around 400 nits. That number is fine for photos but, it does stop videos from looking their best (something we’ll touch on a bit more further in the review).",
    "Right, so before you start your smart home odyssey, you’ll need to setup your new device. For Google Home Hub, that will require downloading - or, for some of you, re-installing - the Google Home app. Once that’s locked and loaded on your mobile device of choice, you can simply tap the plus icon under the Home heading, and the app will search for any nearby Made by Google device. After a short pairing process you’ll need to select which room the Hub is located in as well as add any new smart devices you might have purchased alongside the Home Hub.",
    "The whole setup process takes just a few minutes and, thanks to the great new Google Home app UI, setting up additional devices has never been easier.",
    "That said, if you haven’t yet bought any smart devices or committed to one smart home ecosystem yet, Google makes a compelling case for its Google Assistant and Made by Google platforms which now works with over 5,000 smart devices from 400 companies and a dozen-or-so Google devices.",
    "The list of devices includes a number of popular TV makers like Sony, LG and Vizio, smart light makers such as Philips Hue, LIFX and TP-Link, and smart thermostat manufacturers including but not limited to Ecobee, Honeywell, Lux and others. Those companies and products are just the tip of the iceberg of what’s supported with more makes and models being added to the platform all the time.",
    "Out of the entire library of products, though, what works best with Google Home Hub are the Nest family of products including its smart thermostat, smart security camera and video doorbell system.",
    "The latter two can be streamed to the Google Home Hub via a live feed while the former can be controlled either via voice or the UI on the Hub itself. If you haven’t yet bought any smart home products and are leaning towards the Made by Google ecosystem, give them some serious consideration.",
    "Beyond the tangible products that integrate with Google Assistant, there are a vast number of apps and services that work here, too. This list includes Google mainstays like Google Calendar and Google Play Music, but also apps like Spotify, HBO Now, Uber, NPR, ESPN, Walmart, Target and many, many others.",
    "In fact, one of the biggest changes Google's made since launch is integrating YouTube Music into the device and allowing you to play music on-demand at no additional cost and without a subscription (albeit, with ads).",
    "Oh, and if you’re looking at the Google Home Hub as an Amazon Echo Show competitor, you’ll also be pleased to find YouTube in its full form here - alongside its cable-cutting alternative, YouTube TV. That said, while the Show might have skills in the thousands, Google has opted for quality over quantity with a small number of useful, self-explanatory partners and significantly less shovelware.",
    "Another key differentiator between Amazon and Google’s video hubs are the smart assistants that go into the titular smart hubs: Amazon has Alexa while Google uses the Google Assistant.",
    "One is slightly ahead of the other in terms of overall intelligence and breadth of knowledge (cough, Google Assistant) and from a pure knowledge graph perspective, Google seems to know the answer to a lot more queries. That might sound unimportant but, for curious folks and/or parents of young, inquisitive children, that could impact which assistant you want in your home.",
    "While it’s not a one-to-one translation, the Google Home Hub does borrow a lot of its visual identity from Android TV. Swipe right from the screensaver and you’ll see large information cards that take up the vast majority of the home interface, displaying things like your calendar, local weather, music and video recommendations plus trending news stories.",
    "Ask Google Assistant for help or information, and all these things will disappear. What replaces them will depend on your inquiry.",
    "Asking Google Assistant for location information will bring up a map, contact info, reviews and descriptions of those places while asking about a movie will bring up information on its cast. Click any of these cards and you’ll be drawn deeper down the rabbit hole where you can then see even more information.",
    "It’s hard to believe that Google has found a way to visually represent every search term on the planet and yet, for nearly everything we searched for, there was usually at least an image associated with the search and some basic information to go along with it.",
    "And it’s not just Search to receive the visual update - major Google services, like YouTube, Photos and Maps have been optimized to provide both relevant audio feedback and visual feedback based on your voice search commands.",
    "While we could focus in on any number of these in-depth, trust us when we say that Google handles all of their first-party services with a level of tact and care that’s rare to find in a first-generation product. Even some third-party services work great - though many don’t feel as rich or as natural as Google’s own first-party apps.",
    "If there’s one that’s worth digging into, however, it’s YouTube, as it’s one of the Home Hub’s key services.",
    "Using YouTube on the Home Hub is both good and bad. If you know what you’re looking for, like how to make pasta or the latest video from your favorite streamer, you can simply ask Google Assistant to help you. If your search requires a bit more digging, though, things can get hairy. At most, the Home Hub will display three videos on screen at a time - which can mean it might take a few minutes to find what you’re looking for.",
    "This isn’t a dealbreaker - as YouTube isn’t even available on Amazon’s smart speaker hub without diving into its web browser - but it isn’t as intuitive as simply walking over to your computer and simply searching for it there, either.",
    "That same point can be extended to the Home Hub’s Google Cast functionality that allows you to beam videos to your Google Cast-enabled TV or Chromecast (it’s useful when you know what you’re looking for and easier to just pick up your phone if not) and for cooking directions - most recipes we saw were usually just text-based and required separate searches if we were unsure how to, say, blanch the vegetables or debone a fish fillet.",
    "It’s not that Amazon Echo Show does any of that better - it doesn’t - but given the fact that you can do all these things separately, it’d be nice to have seen one integrated process.",
    "Speaking of integrated processes, it must be said that Home View, the user interface setting that shows every connected device in your home, Ambient EQ and Google Photos screensaver are, by far, the most innovative features from a performance standpoint. They’re clear, fun and functional, and do nothing but add solid functionality to what could’ve been a generic ‘me too’ product.",
    "Where the speaker shines a little less brightly, both figuratively and literally, is in the audiovisual department: YouTube videos don't look quite their best on the Home Hub's 7-inch screen and audio, while powerful enough for a song or two while cleaning the dishes, certainly doesn’t have the clarity or range to do justice to your music collection.",
    "That’s not to say there aren’t ways to make both these problems slightly less of an issue (there’s an EQ slider on both the Home Hub and on the Google Home app to restore some bass to the rather dull-sounding audio, for example) but largely you’re stuck with something that just wasn’t meant to be your primary way to watch shows and listen to songs.",
    "While Amazon’s Echo Show is a buckshot that has both no purpose and every purpose all in the same device, the Google Home Hub has a finite set of what it can - and cannot - do.",
    "Based on our time with the unit, we saw a definite use-case for three types of users: College students, older family members and the smart home enthusiast with way too many devices to keep track of by name.",
    "Students, short on time and full of questions that need answering will love the Home Hub and its prominent focus on Google Calendar. It’s baked right into the main screen of the app and should always keep them on task.",
    "Even better, they don’t need to be concerned about mom and dad dropping by anytime they have company over, and the device powers down nicely at night so that they can get some shuteye at the end of a busy day.",
    "As for older family members, we found that once the device was setup, it made for a great digital photo frame that worked better than any we’d ever seen. Images that we shot in the afternoon on our phones were uploaded immediately to the cloud via Google Photos, and would then appear on the Home Hub within an hour or two. Add to that basic calling functionality through Duo and some of the oldest members of your family can now keep in touch even when you’re far away.",
    "Last but not least, the Home Hub makes a lot of sense for the smart home enthusiast who’s gone a bit overboard on devices.",
    "If you have more lights than you can keep track of or can barely remember the name of all your smart displays (guilty as charged) the Hub’s Home Menu does a wonderful job showing you every connected device, which room it’s in and if it’s on or off right now. This is an important distinction as this enables you to use commands like “turn off the TV in this room” or “turn of the lights in the living room” without having to remember names like TPLINK BULB 7 or Sengled B8EFS.",
    "Who the Home Hub doesn’t work the best for are audiovisual lovers deadset on having the best picture in every room of the house and families connected by weekly video chats and short-but-meaningful drop-ins. If either of those sound like you, Amazon’s speaker costs a bit more but probably has the features you’re looking for.",
    "While the Google Home Hub isn’t missing many features compared to the Amazon Echo Show, the ones it’s missing are relatively important: a screen that's on the small side means most movie watching will need to occur in your living room, and - while it's great for photos - just doesn’t do justice to most video content.",
    "What is certainly the product’s most divisive feature, however, is the Home Hub’s lack of a camera. We certainly appreciated Google’s guised concern for our privacy, some folks will be disappointed that they won’t be able to video chat with loved ones on the Hub.",
    "Thankfully, this is all counterbalanced by some really important features like Home View and the Google Photos integration - plus, even if it isn’t the most magnificent screen we’ve ever laid our eyes on, it is a fine substitute when you’re standing in front of it cooking dinner.",
    "For the audiences listed above, and many more we’ve yet to think of, the Google Home Hub is a surprisingly good value: it’s a smart speaker with a functional touchscreen and places the smarts to run your entire home at the tips of your fingers.",
    "Yes the Echo Show has its advantages (particularly in the audiovisual department) but, for the vast majority of folks just starting to build out their smart home, the Home Hub is what we’d recommend instead."
  ],
  "headers": {
    "11": "Price and availability",
    "16": "Design",
    "27": "Setup and Google Assistant",
    "38": "Performance",
    "52": "Who is it for?",
    "60": "Final verdict"
  },
  "links": {
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "Amazon Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Google Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "a new Chromecast": "https://www.techradar.com/news/google-chromecast-ultra-2-release-date-price-news-and-rumors",
    "Launch Night In event": "https://www.techradar.com/news/google-pixel-5-launch-event-recap",
    "Google Assistant": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "Google Home Max": "https://www.techradar.com/reviews/google-home-max",
    "Google Home Mini": "https://www.techradar.com/reviews/google-home-mini",
    "Google Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max",
    "Google Home Hub prices": "https://www.techradar.com/news/google-home-prices-deals"
  }
}