{
  "source": "https://www.techradar.com/reviews/gladinet-centrestack",
  "title": "Gladinet CentreStack cloud storage review",
  "category": "computing",
  "updated": "2020-10-01T07:41:23Z",
  "author": "mark-pickavance",
  "summary": "Gladinet CentreStack is a cloud service for control freaks",
  "verdict": "Gladinet CentreStack is a hybrid solution that takes existing file server storage and welds it to cloud services in an elegant way. Use cloud storage alongside local file servers and get the advantages of both without the headaches – and you can even sell it on to clients.",
  "pros": [
    "Vast number of configurations",
    "Easy to access support",
    "Can rebrand and sell on"
  ],
  "cons": [
    "Interface is on the plain side",
    "Bring your own cloud storage",
    "Not for individuals"
  ],
  "article": [
    "Gladinet CentreStack is a heavy duty cloud storage service that's one of the most comprehensive and well-known on the market – and its enterprise file synchronisation and sharing (EFSS) solutions are definitely aimed at business rather than consumers.",
    "You're not just limited to using the online storage that CentreStack offers, but you can also merge in local file servers to become part of a hybrid solution, giving your business the option to supplement existing IT infrastructure with custom resources in the cloud.",
    "CentreStack asks you to bring your own virtual server space: it's not an all-in-one solution but it can work with storage services including Amazon S3, OpenStack, Rackspace, Google, Azure, HPCloud and IBM Cloud Storage. Perhaps more importantly, it can work with different combinations of them, so you're not limited to just one provider.",
    "From the end user perspective though, everything is wonderfully simple – users see a straightforward mounted network drive, through which they can access their files as usual. Administration privileges can be set for each other, controlling who has access to what, with separate transfer quotas and storage space for each individual.",
    "Clever touches are spread throughout, from the way existing local file storage is available from the cloud straight away, to easy access from a web browser to every part of the CentreStack interface. The idea behind the service is not to compete with the likes of Amazon S3 or Microsoft Azure, but to allow companies to exploit these and other facilities to their business advantage by on-boarding new clients and so on.",
    "If your company has existing file servers with drive letters, users permissions and all the rest, and needs to move them to the cloud with the minimum of fuss, Gladinet CentreStack is well worth checking out. You can even use CentreStack as a VPN to provide remote access to your local servers, if you need to, and features like versioning and protection against ransomware can be included too.",
    "Gladinet CentreStack software stretches across the web, Windows, macOS, Android and iOS, so whatever device you're using, you're going to be able to get at your files. The actual look of the software is fairly typical for an enterprise-level solution such as this: the focus is on functionality rather than aesthetics or polish, so don't expect anything too fancy from the interface. It works though, which is what counts.",
    "Setting up and installing CentreStack on your devices is all very straightforward, and from what we could tell during our testing, communications with servers both local and cloud is as speedy as you would hope. Local network file servers, remote file servers, and cloud storage (from Google, Amazon and the rest) can all be dropped in with ease.",
    "Most users – fortunately – will be gloriously unaware of CentreStack as it works in the background with existing file servers to merge local and cloud storage into a unified solution, making everything available at once. What administration interfaces and client utilities there are here do their jobs well enough, whether that's setting up new clients or managing access for team members.",
    "We're pleased to say there's plenty of support documentation available inside the various software components that make up the CentreStack experience – if you don't want to look up answers or instructions yourself, you can opt start a live chat with a support technician instead. There are also some helpful support videos that take you through all the different aspects of CentreStack in an impressively short amount of time.",
    "Much of what Gladinet offers is focused on its relationship with local file storage inside the customer business, so its security is aligned with those existing models: full NTFS permissions and Active Directory identities are preserved for any cloud-secured files or structures, avoiding permission issues in the event of a restore. AES-256 bit encryption is applied across the board, and two-factor authentication is deployed too.",
    "The central management console can be easily used to revoke privileges to files to any user or group and encrypt the cache remotely, while all file creations and subsequent modifications are recorded in an audit history – these can be reviewed to determine when a particular user changed a document or deleted a file. With this close integration with existing network security, the IT department won’t need to build a whole new rule set to control cloud access and permissions.",
    "The two main options for CentreStack are self-hosted and hosted, with either your company or CentreStack taking responsibility for most management tasks. If you're doing your own hosting, pricing starts at $3.59 (about £2.82) per month per user for the first 20 users, and costs less per user (but more in total) as you add more accounts; if you want Gladinet CentreStack to provide the hosting as well as everything else, then you're looking at costs of $7.19 (about £5.65) per month for the first 10 users, and again the cost-per-user goes down as you spend more.",
    "If you want to be a partner, and use Gladinet CentreStack as a white label provider that you then sell on to other clients under your own brand, you need to get in touch with CentreStack directly – in this case the pricing is going to depend on what your ideas are for the service and how you want to represent it, and while we can't give you estimates, it's with having a chat with CentreStack.",
    "There are a few different use cases for Gladinet CentreStack: making company file servers available globally while keeping them secure, replacing (or merging) on-premises file storage with cloud storage, and creating a white label cloud storage solution to sell on to others, for example. While we think there's room for improvement in parts of the CentreStack interface and on-boarding processes, in terms of the core features and functions, it excels in all these areas.",
    "When you have a service that's so comprehensive and far-reaching as this is, you can't of course cater for everyone – individual consumers and smaller businesses may find CentreStack overwhelming. If you're already comfortable with enterprise networking and business-level cloud storage though, and you need something to take your company to the next step, then this might well fit the bill perfectly."
  ],
  "headers": {
    "2": "Gladinet CentreStack features",
    "6": "Gladinet CentreStack interface",
    "10": "Gladinet CentreStack security",
    "12": "Gladinet CentreStack pricing",
    "14": "Gladinet CentreStack verdict"
  },
  "links": {
    "Gladinet CentreStack": "https://www.centrestack.com/",
    "cloud storage service": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}