{
  "source": "https://www.techradar.com/reviews/xara-web-designer-premium",
  "title": "Xara Web Designer Premium review",
  "category": "computing",
  "updated": "2020-11-17T09:55:12.955Z",
  "author": "steve-paris",
  "summary": "A powerful app for versatile website creation",
  "verdict": "A powerful program designed to make it easy for you to create websites with pixel perfect precision without ever writing a line of code. Not for complete novices, though.",
  "pros": [
    "Full control over your webpages",
    "Vast library of widget",
    "Supports all modern features"
  ],
  "cons": [
    "PC only",
    "No blogging tool"
  ],
  "article": [
    "Xara Web Designer Premium [XWDP] is a website design software which allows you to create complex sites without needing to know or understand HTML coding. Unlike most of its competition, which offer their services through your web browser, XWDP is a dedicated application which you can only access from a Windows PC. No Mac, tablet or phone access for you (although the pages it creates can be viewed on any device).",
    "This is however a minor inconvenience since Windows still dominates the desktop world, and this software allows you to create impressive designs with ease.",
    "For those who fear staring at a blank page, you can heave a sigh of relief as XWDP comes with numerous templates, many of which are ‘Responsive’ (those are labelled with an “[R]”). A Responsive website is one that repositions and resizes its content depending on which device you’re viewing it from.",
    "When you open such a template, you’ll see two tabs in the main design section. One displays how the site will be seen on a computer, the other, on a portable device. The great thing about this is that the two sections are actually linked: edit text in one, and it’s updated in the other.",
    "This is very convenient and allows you to reposition text boxes or images so they look great no matter which device your site will be viewed on.",
    "Should you wish for a section to be unique to either format, you can sever that link for specific items, offering you greater flexibility.",
    "Yes, it’s not as effortless as the app doing it all for you, but it gives you greater control and helps you create pixel perfect sites to your exact specifications.",
    "And this goes hand in hand with the ability to drag and drop whatever you’re adding to your page, exactly where you want it.",
    "If you check out some competing web-based services, you’ll notice nearly all limit where you can put your content on the page. This restriction does make for a simpler service, but also curtails your creativity. Not so with XWDP. You can for instance sprinkle images throughout your text, wherever you want them to be. By setting an object as “repulsive”, you’ll see text within a text box automatically wrap around that abject as you drag it, so nothing is obstructed.",
    "It’s like working in a desktop publishing application, and helps you make your page look exactly as you want it.",
    "Modern sites take advantage of HTML5’s animation features, and XWDP is fully compliant with these. You can animate your objects so they interact with the viewer. You can for instance have the animation triggered as the cursor moves onto it, or animate you content as the visitor scrolls down the page.",
    "Animations can also be added when moving from page to page, and there’s a host of options for this. Unlike the animations for objects we just discussed, these page animations are site-wide. They work best when the pages are actually of the same dimension (which is a design issue, as when creating websites, one generally doesn’t need to think about such restrictions), and although fun, it feels more like a gimmick which could get pretty tedious if you visit the site often.",
    "These features create a much more dynamic feel to your design and encourages interaction. XWDP makes it really easy to access those features, and apply them to your creation.",
    "XWDP helps you make fully responsive sites, and this also includes intricate options such as resizing photos used as background images. Depending on the size of the browser page or the actual device’s screen, the background image will show more - or less - of its content. This isn’t simply resizing the image to fit the screen, this is actually concealing the edges so as you increase the browser’s page, for instance, more of the image is revealed. It’s a very nice modern effect which XWDP fully supports.",
    "Another welcome feature is the ability to lock certain objects on your screen. You can use this feature to make sure your navigation menu remains at the top of the screen, no matter how far you scroll down, enabling the visitors to always have easy access to other parts of your site, no matter where they find themselves.",
    "One last such feature we’ll explore is the ability to alter theme colours. Those are site-wide colours which give your page a unique look. Thanks to that feature, you aren’t forced with an original decision, or have to change all your pages manually should you change your mind about your site’s colours during the design process.",
    "Instead, you can alter your theme colours at any time and all the pages are updated as you do so. This not only gives you immense design flexibility, it is also a great time saver when you do perform those changes.",
    "XWDP offers you a large selection of stock images to choose from (powered by Pixabay), which you can use throughout your site - it’s not the same as using your own photos of course, but if you’re not a photographer, or can’t get a photo you need for a specific look, it’s great that XWDP’s got your back with its own royalty-free library.",
    "There’s also a host of widgets available to you, which you can use to add more versatility to your site. These range from adding a QR code, to inserting Google AdSense sections, forms, or graphics, for instance.",
    "One we quite liked was the inclusion of Smart Shapes. You can add speech bubbles, arrows, boxes, polygons, etc, to your pages, and those shapes have handles on various locations which you can use to effortlessly resize and reshape them. This is most obvious when working with speech bubbles: where you can easily reposition and resize the tail, for instance, and the end result just looks perfect.",
    "There’s even a whole section dedicated to eCommerce, should you need to sell goods online.",
    "The one thing we couldn’t find was a blogging tool. There is a way to ‘embed a website’, which you could use to embed a blog from somewhere else, but this isn’t an elegant solution, and is the only major downside we could find.",
    "Xara Web Designer Premium is a vast program, filled with useful and modern features, and designed to help you create interactive and dynamic websites without ever having to type in a line of code. This isn’t however something you can use to create a page in minutes - this is for those who want to spend the time to create the best experience for their visitors, with all the tools they need in order to do so."
  ],
  "headers": {
    "2": "Responsive templates",
    "7": "Moving around",
    "10": "Modern compatibility",
    "13": "Resizable images",
    "14": "Sticky bits",
    "15": "Colour control",
    "17": "Take stock",
    "18": "Widgets",
    "22": "Final verdict"
  },
  "links": {
    "Xara Web Designer Premium": "https://www.xara.com/us/web-designer/",
    "website design": "https://www.techradar.com/news/best-web-design-software"
  }
}