{
  "source": "https://www.techradar.com/reviews/flipdrive",
  "title": "FlipDrive cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T12:17:48Z",
  "author": "mark-pickavance",
  "summary": "FlipDrive isn't worth your time",
  "verdict": "FlipDrive doesn't have much going for it at all: the central web interface is reasonably slick and fast, but other components feel tacked on, the mobile apps need a lot of attention, and there are no desktop clients. There isn't much in the way of account security either.",
  "pros": [
    "10GB of space for free",
    "Web dashboard is well designed",
    "Quick to set up"
  ],
  "cons": [
    "Buggy, outdated software",
    "No desktop clients",
    "Lack of serious security"
  ],
  "article": [
    "FlipDrive doesn't have much to recommend it, and we can't really think of any reason why you would pick this over the many superior options out there. It does have quite a polished web interface, and a free tier, but that's largely where the plus points end.",
    "In our time testing FlipDrive, we found bits of the service that didn't really work properly, and other bits that looked like they haven't been updated for decades. This is a cloud storage service that we think is best avoided until it gets a major update and revamp.",
    "FlipDrive is basically just a web portal that you can use as a place to upload files and folders to – there's no clever backing up software, and no file syncing. You just put your files in place, and that's it. There's no option to view documents or images, or play music or video files, while they're stored in the cloud.",
    "File and folder sharing is supported, and you can set whether folders are read only, but there are no advanced features here either: you simply put in the recipient's email address, and that's it (direct links are available on the paid-for plans, we should mention). The people you're sharing files and folders with need a FlipDrive account as well, so it's hardly the most user-friendly of solutions.",
    "FlipDrive does make an effort at trying to split your files up into categories, including photos, contacts and bookmarks, but it's all a bit clunky, and the different elements don't really work very well together – images added to My Drive won't show up in Photos for example, and vice versa. This feels like a service that needs a redesign and a refresh from the ground up, though it does generally work as advertised.",
    "There is a basic undelete feature built into FlipDrive, but you don't get file versioning, so you can't roll back to earlier versions of your files if you need to. Unlike rivals such as Google Drive, iCloud, OneDrive and Dropbox, there are no online productivity tools to make use of, making FlipDrive seem rather bare bones by comparison.",
    "FlipDrive does feel like bits of code from different eras slapped together – the Dashboard and My Drive sections of the site look fairly modern, while the Contacts and Photos components look like they were put together in the previous century (yes we can still remember the 1990s web).",
    "We spotted a few bugs in the system as well when it came to loading pages and transferring files – though they were rare, they were still annoying. Overall the web interface seems to be on the slow side, though to be fair to FlipDrive the files that we uploaded were transferred very speedily.",
    "The interfaces for the sharing mechanisms are on the old-fashioned side too, and again it looks as though some parts of the FlipDrive experience are getting more attention from the developers than others. It's a long way from the sort of slickness and speed you can find from some of FlipDrive's competitors in the cloud storage space.",
    "As for the mobile apps, they appear to offer basic functionality, but the Android app hasn't been touched since 2017 and the iOS app has had one update since 2018 – it hardly fills us with confidence when it comes to the future of FlipDrive or the safety of our files.",
    "A quick browse of the FlipDrive website suggests that security isn't something those behind it consider to be that important, because it hardly gets a mention: the only secure aspect to this facility appears to be the HTTPS connection that the web interface uses. The FAQ does mention \"256-bit encryption\", but we're not sure exactly what that means or where in the system it's deployed.",
    "There isn't any option to deploy two-factor authentication here, and nor are there any alerts when a new device accesses the FlipDrive service using your account. All that's really standing between a hacker and your files is your username and password – it would appear that from a security viewpoint, FlipDrive is for those who are either highly optimistic or inherently lucky.",
    "You can at least give FlipDrive a try without parting with any cash: sign up for a free account and you get 10GB of room to play around with, with a file size limit of 25MB. If you just want a quick and easy, web-based cloud storage service, and you don't have much in the way of data, then you possibly might consider FlipDrive as a decent free option.",
    "The paid plans are $5 (about £3.85) a month for 100GB of storage space (with a 1GB file size limit), $10 (about £7.70) a month for 1TB of storage space (with an unlimited file size limit), and $20 (about £15.40) a month for 2TB of storage space (with an unlimited file size limit). That's relatively expensive, compared with the competition.",
    "When you combine the relatively high cost with the lack of features here – plus the absence of any real stab at security, or the ability to sync files with the desktop – FlipDrive manages to leave all the boxes you want ticked in a cloud storage service very much unticked. If you can’t find a better cloud storage solution than this one, we'd suggest you're not looking very hard.",
    "The central My Drive section of the web interface is relatively well designed, and relatively functional, and you do get 10GB of space for your files for free. That's pretty much par for the course with any cloud storage service out there though, and considering the mobile apps haven't really been updated for years, it looks like FlipDrive isn't really getting the developer attention that it needs."
  ],
  "headers": {
    "2": "FlipDrive features",
    "6": "FlipDrive interface",
    "10": "FlipDrive security",
    "12": "FlipDrive pricing",
    "14": "FlipDrive verdict"
  },
  "links": {
    "FlipDrive": "https://www.flipdrive.com/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}