{
  "source": "https://www.techradar.com/reviews/insta360-one-x2",
  "title": "Hands on: Insta360 One X2 review",
  "category": "cameras",
  "updated": "2020-10-28T14:00:21Z",
  "author": "mark-wilson",
  "summary": "A relatively modest update to our favorite 360 camera",
  "verdict": "The One X2 is a promising 360-degree camera that addresses most of our criticisms of its predecessor. It's now waterproof to 10 meters, has a new display and houses a larger battery. The huge range of shooting modes and effects also make it fun, versatile and ideal for social media video. If Insta360 manages to iron out the pre-release bugs, the One X2 could be one of the best options in its relatively niche field.",
  "pros": [
    "Now fully waterproof",
    "Excellent stabilization",
    "More video tricks than ever"
  ],
  "cons": [
    "Some pre-release bugs to iron out",
    "Non-360 action cams offer superior quality"
  ],
  "article": [
    "The Insta360 One X2 is the successor to the two-year-old Insta360 One X, which currently sits at the top of our guide to the best 360 cameras.",
    "Despite the arrival of rivals like the GoPro Max and Kandao QooCam 8K, we found the One X offered the best blend of features, software and user-friendliness for anyone looking to play with the many video tricks offered by 360-degree cameras.",
    "These include the ability to produce dynamic 'flat' videos where the camera swoops around your frame, plus effects like the time-stopping 'bullet time' look seen in movies like The Matrix. So does the Insta360 One X2 take these to the next level?",
    "On the surface, the One X2 looks like a relatively minor upgrade with what looks like the same image sensor, for 5.7K video and 18MP stills, and a similar pill-like design. But there are quite a few upgrades, including the big bonus of IPX8 water-resistance and a new live touchscreen display to preview your shots, plus several new software features.",
    "Collectively, these still refine rather than revolutionize Insta360's main 360-degree offering, but that's no bad thing considering the pedigree of its predecessor.",
    "As always with 360 cameras, though, the question is how often you'll end up using its undoubtedly fun and technically impressive video tricks...",
    "The Insta360 One X2 became available to order on October 28 2020, the day of its official announcement.",
    "You can buy it right now for $429.99 / £429.99 / AU$749.99. There are also a range of new accessories available for the One X2, including Lens Guards and a new Bullet Time cord, though official pricing isn't available for these yet. We'll update this page when we get these prices from Insta360.",
    "That launch price for the One X2 is slightly higher than its predecessor's original asking price of $399.99 / £409.95 back in 2018, though that increase is no higher than the rate of inflation since then. This model also brings a few notable advantages over its predecessor...",
    "The Insta360 One X2 might look remarkably like its predecessor from 2018, but there have been a few important tweaks.",
    "The most significant is that the camera now has IPX8-rated waterproofing, which means you can take it underwater to 10 meters without needing a case.",
    "This was one of our biggest gripes with the Insta360 One X, particularly as it's something offered by the GoPro Max, so we're pleased to see it's been added.",
    "That said, the One X2 still doesn't feel like a camera that you could throw around or dunk in the sea with carefree abandon. The locked doors on the side for the battery and, in particular, the USB-C port, feel slightly vulnerable to being locked out of place. Combine this with the protruding lenses, and you have a camera that still feels like it needs to be looked after and treated with care.",
    "The One X2 is slightly larger than its predecessor, but this is barely noticeable and the main benefit is that it has room for a larger battery. Inside you get a removable 1,630mAh cell, which promises to keep shooting for around 80 minutes of video (up from the 60 minutes of its predecessor).",
    "Following the lead of recent action cameras like the DJI Osmo Action and GoPro Hero 9 Black, there's also now a color LCD on the front of the One X2. In the absence of a rear screen, this is touch-sensitive and acts as both your viewfinder and mode selector.",
    "This screen is certainly a handy way to frame your shots and is pretty responsive to swipes and touches. The size does inevitably mean that you'll often need to press two or three times to choose the right menu item, though, and it's not particularly glove-friendly. Fortunately, there's a large button on the front to start and stop recordings.",
    "On the base of the One X2 you'll find a standard tripod mount, which screws into accessories like the (optional) Invisible Selfie Stick or any other accessory you have with a 1/4-inch screw. The benefit of using Insta360's stick, though, is that it's nicely optimized for the camera's software, which does a reliably good job of removing it from your videos.",
    "This creates the effect that the camera is hovering around you (particularly if you make sure the arm holding the stick is looking fairly natural), and it remains an impressive, vlogging-friendly effect.",
    "Still, it's probably not something you'll want to hold for a long time during your travels either. After all, real people can still see you're holding a long selfie stick, and it can get in the way in certain situations.",
    "One of the main things that helped set the Insta360 One X apart from its rivals was its polished app and user-friendly software. That continues to be the case on the One X2, although the addition of new editing features can make its 'Shot Lab' initially feel a little overwhelming.",
    "Still, the inclusion of a color touchscreen LCD on the front of the One X2 certainly makes choosing your shooting mode much easier than before – tap the video icon and you can choose between standard, HDR, timelapse, timeshift and bullet time modes. Unfortunately you can't use this screen while using the companion app, but it's handy for quickly starting a video without fishing your phone out of your pocket.",
    "Beyond this, a lot of the One X2's additional functionality, compared to the One X, comes from its companion app. Some of these features are coming to the One X via an app update, while others are only possible on the One X2.",
    "One of the new modes that's exclusive to the One X2 is 'Steady Cam Mode', which effectively lets you use choose one of the two lenses and use the camera as a standard action cam.",
    "It's worth bearing in mind that the maximum video resolution in this mode is 2560x1440 at 50p, so it doesn't trouble the likes of the GoPro Hero 9 Black or Insta360 One R when used as a traditional action cam. But it's nice to have a simple option to shoot in this way, if you want to cut down on editing.",
    "Some other new modes that are exclusive to the One X2 are a few photography-focused ones, including PureShot (which apparently automatically adds extra dynamic range from DNG raw data) and InstaPano (a one-tap panorama with no need to sweep across the scene).",
    "Perhaps the most interesting and potentially useful new software feature, though, is 'Auto Frame'. This aims to solve one of the headaches of 360 cameras, which is deciding exactly where to reframe your 360-degree videos after you've shot them. Hit the new icon in the bottom left-hand corner of the app and it'll analyze your video then suggest several possible highlights that you'll want to include in your final edit.",
    "It's a potentially handy addition that did pick out some useful clips from our 360-degree videos, but the downside is the process takes a while (a few minutes for a one-minute video) and did make our iPhone 11 Pro run quite hot.",
    "This also reflects a broader issue that's worth noting – you'll need a fairly recent phone or tablet to make the most of the Insta360 One X2's app. For iPhones, you need a model with the A11 chip or above (effectively anything from the iPhone 8/8 Plus onwards), while on Android you'll ideally need a phone that has a Qualcomm Snapdragon 845, Exynos 9810 or Kirin 980 chip or above (think Samsung Galaxy S9 or Huawei Mate 20 and up).",
    "You can still use the app with an older phone, but the usability will take a hit and processor-intensive features like 'Auto Frame' will likely be beyond it.",
    "It's a little too early for us to be conclusive about the Insta360 One X2's video and image quality, given our brief time with it and the fact that our sample was running pre-release firmware.",
    "So far, though, we'd say it looks similar to the One X in terms of quality, which is to be expected given that it appears to have an identical image sensor that shoots 5.7K video and 18Mp stills with a maximum bit-rate of 100Mbps.",
    "Insta360 has included some processing refinements, including in-camera color rendering and improved low light performance, and it certainly appears to handle challenging scenes with mixed lighting well, particularly when you shoot in HDR mode. But we'll need a little longer with its final firmware before making any conclusive judgements.",
    "Also, outright image quality is never going to be a strength of 360 cameras – that 5.7K video resolution is there to give you the wiggle room to punch into frames and choose your 1080p highlights. Also, when you're in 'Steady Cam Mode', using only one of the lenses, you can only shoot an equivalent of 2.7K video with a very wide-angle lens, so as a traditional action cam it can't compete with the very best action cams.",
    "What you do get in return is incredible versatility, thanks to the ability to capture everything in a scene simultaneously and re-frame your videos later. Insta360 also seems to have refined some early issues we saw with 360 cameras, such as obvious stitch lines.",
    "One issue we did encounter when cycling with the One X2 was some fairly significant wind noise, but Insta360 says this will be fixed in the camera's final firmware. We'll update this review when we get the chance to test that fully.",
    "The Insta360 One X2 is a relatively modest but solid update to our favorite 360 camera, with the waterproofing, new display and new editing features all adding to its versatility and social media potential.",
    "There's no great leap forward in outright image quality, and traditional action cameras will produce superior 'flat' video and stills. But what the One X2 gives you is the considerable safety net of knowing you're shooting in all directions simultaneously, plus the slickest 360 camera app around to help you make the most of that all-seeing footage.",
    "Of course, the restrictions of the global pandemic mean there probably aren't quite as many situations as usual that scream out for the One X2's video tricks. But the creative options it opens up for homemade videos is huge – as you're as prepared to learn its editing lingo, have a relatively recent smartphone and are happy with 1080p flat videos, it's potentially one of the most fun lockdown companions you can buy. We'll bring you a full review very soon."
  ],
  "headers": {
    "6": "Insta360 One X2 release date and price",
    "9": "Design",
    "19": "Features",
    "29": "Video and image quality",
    "35": "Insta360 One X2 early verdict"
  },
  "links": {
    "Insta360 One X": "https://www.techradar.com/reviews/insta360-one-x",
    "best 360 cameras": "https://www.techradar.com/news/best-360-degree-camera",
    "GoPro Max": "https://www.techradar.com/reviews/gopro-max",
    "Kandao QooCam 8K": "https://www.techradar.com/reviews/kandao-qoocam-8k",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black",
    "Insta360 One R": "https://www.techradar.com/reviews/insta360-one-r",
    "best action cams": "https://www.techradar.com/news/best-action-camera"
  }
}