{
  "source": "https://www.techradar.com/reviews/caldigit-usb-c-pro-dock",
  "title": "Caldigit USB-C Pro Dock review",
  "category": "computing",
  "updated": "2020-01-10T11:43:01Z",
  "author": "mark-pickavance",
  "summary": "Single cable docking to peripherals has never been so slick",
  "verdict": "A fantastic piece of equipment that can walk-the-walk of single-cable docking and delivers the features that laptop owners will truly appreciate. Well made, it comes with a PSU and USB-C cable, what more could you reasonably want?",
  "pros": [
    "USB-C and Thunderbolt 3",
    "All-metal construction",
    "85 watts pass-through charging",
    "Avoids DisplayLink technology"
  ],
  "cons": [
    "None"
  ],
  "article": [
    "Having an Ultrabook that also serves as a desktop system can represent a major cost saving for businesses, and it also avoids the possibility of leaving work without an important file.",
    "But, to complete this circle requires a docking station, so that all the peripheral devices aren’t being connected and reconnected repeatedly.",
    "Ideally, a single cable connects everything, including input devices, storage and displays.",
    "It sounds simple enough, but many hardware makers have stumbled delivering a docking station that achieves those objectives with a single cable.",
    "Today we’ll look at the Caldigit USB-C Pro Dock, an affordable option that claims to offer exactly what laptop owners want at a price that most businesses can afford.",
    "It retails for £169.99 ($199.25) directly from Caldigit making it cheaper than the Caldigit flagship TS3 Plus design that we reviewed a while back.",
    "We like ‘clean’ unfussy designs, and the USB-C Pro Dock by Caldigit is exactly that.",
    "Built into a finely milled aluminium tube, the internal electronics are well protected from accidental abuse in an enclosure that measures just 214 mm wide, 80 mm deep and 25 mm thick.",
    "Using a single USB-C connector to the host, it allows the connection of two DisplayPort monitors, four USB devices, speakers and headphones, Gigabit Ethernet and an SD card with an inbuilt reader.",
    "And, in addition to all this peripheral connectivity, it comes with a 150W power supply that can deliver 85 watts to the connected device to charge it fully in a relatively short time.",
    "That makes it suitable for the more demanding Ultrabook designs, such as the 15-inch Apple MacBook Pro.",
    "The front-facing ports include the audio, card reader and one each of USB-A and USB-C, with all the other connections on the rear, including the USB-C downlink from the host.",
    "This arrangement keeps cabling neat, as all the things you’d want permanently connected are at the back, and those that are likely to be more ad hoc are on the front.",
    "There are docks available with more ports, but the numbers offered by this one make it eminently practical given the limits imposed by running everything through a single USB-C cable.",
    "Apologies in advance, but this is the part where this review might become somewhat technical.",
    "The basic premise of a docking station is that you can plug all the peripherals associated with a desktop system into a laptop using just a single cable.",
    "On the Caldigit USB-C Pro Dock that includes dual display port monitors, three USB-A 3.2 Gen 1 (5Gb/s) USB devices, a single USB-C 3.2 Gen 2 (10Gb/s) device, Gigabit Ethernet port, audio via a 3.5mm jack and an SD card with a card reader.",
    "Even excluding the minor connections like the audio, there is over 25Gb/s of potential connections, and that’s not including potentially two screens. As USB-C 3.2 Gen 2 only has 10Gb/s to share around, something must give to make this solution practical.",
    "One answer is that this hardware will work with a Thunderbolt 3 connection, allowing the available bandwidth up to 40Gb/s, allocating 20Gb/s to the displays and the other 20GB/s to be shared between devices.",
    "If we consider that most users will use two USB-A ports for their mouse and keyboard, then there is easily enough bandwidth left for high-performance external storage on either USB-A or USB-C and also LAN, audio and the card reader without restricting them appreciably.",
    "If you don’t have Thunderbolt 3, only USB-C, what are the options?",
    "Well, Caldigit downgrades the resolution of the two connected monitors to HD (1080p) from 4K, but other than that it should all work much the same.",
    "The dock can even be used with a USB-A system with a conversion cable, sold separately, although with just 5Gb/s of bandwidth available that choice won’t allow for monitors to be connected.",
    "We should point out that Apple in its infinite wisdom, launched MacBook 12-inch models in 2015, 2016 and 2017 have only one single USB-C port. And these machines can only support dual monitors in mirrored mode. This is also true of some PC laptops with Thunderbolt 3 that only support a single 4K 60Hz display or dual 4K 30Hz output.",
    "But later Apple hardware and Windows systems with Thunderbolt 3 or USB 3.1 Gen 2 should be capable of having dual displays.",
    "That includes the Apple iPad Pro. With this device, it can drive a single external 4K monitor, have all the typical peripherals of full computer connected with a single cable and be simultaneously charged.",
    "Docking station aficionados might muse why Caldigit didn’t offer DisplayLink technology with this device, to mitigate the bandwidth reduction on USB-C.",
    "DisplayLink is a means where display data is encapsulated in a regular data stream rather than allocated dedicated bandwidth, and to avoid is consuming all the bandwidth the data is compressed.",
    "In our opinion, Caldigit made the right choice. Because DisplayLink requires software to be installed on the host system to compress the video images, and unless the laptop doing this is very powerful this will have a significant impact on its performance.",
    "There are other issues associated with DisplayLink, and while it does allow a 4K display to be driven over USB-C, we’d heartily recommend that those wishing to do this get a laptop with Thunderbolt 3 and a discrete GPU or connect the monitor directly.",
    "The Caldigit USB-C Pro Dock is easily one of the best docking stations we’ve seen and makes many of the branded solutions offered by PC makers look amateur in comparison.",
    "The metal construction, attention to detail and functionality is all delivered at what appears to be a bargain price when compared with what other brands are asking.",
    "But what makes this device outstanding is that it offers both USB-C and Thunderbolt 3 connectivity in a single solution, enabling all the ports to be fully utilised without running into the bandwidth limitations that can beset USB-C connected docks.",
    "When a user explores this device, they can assume that if he has the peripherals to connect then they can be, without any complicated connection conundrum.",
    "Because of this, and the excellent build quality that Caldigit maintains, we’ve no qualms about recommending this docking station to anyone that wants to create a more desktop experience with their Ultrabook while in the office."
  ],
  "headers": {
    "6": "Design",
    "14": "In use",
    "30": "Final verdict"
  },
  "links": {
    "Caldigit": "https://www.caldigit.com/usb-c-pro-dock/",
    "TS3 Plus": "https://www.techradar.com/reviews/caldigit-ts3-plus-thunderbolt-3-docking-station"
  }
}