{
  "source": "https://www.techradar.com/reviews/seagate-onetouch-1tb-external-ssd",
  "title": "Seagate Onetouch 1TB external SSD review",
  "category": "computing",
  "updated": "2020-02-03T20:41:20Z",
  "author": "desire-athow",
  "summary": "A tiny solid state drive that will go everywhere with you",
  "verdict": "The Onetouch 1TB SSD from Seagate is a product in search of an audience. The software bundle is welcomed but ultimately as a package, the product feels inadequate when compared to the rest of the competition",
  "pros": [
    "Size",
    "Software bundle"
  ],
  "cons": [
    "Average performance",
    "Price",
    "Flat USB port"
  ],
  "article": [
    "Seagate took a few years to position itself in the crowded solid storage drive market where several established players like Crucial, WD or Samsung are already vertically integrated operators, that are producing and selling their own products, something that puts Seagate at a disadvantage.",
    "This explains why Seagate has been rather slow to push products through the door although things have been accelerating lately. The OneTouch 1TB being one which has no legacy hard disk drive equivalent range and aims squarely at the creative professional.",
    "The drive, which carries a suggested retail price of $170, can be had for $148 at Amazon for the 1TB model we’re reviewing today; a 500GB model is also available in black or gray. A camo-clad One Touch SSD Special Edition, can also be purchased at a premium.",
    "The price includes a one-year subscription to an online service called Mylio - more on that later - and two months subscription to Adobe CC Photography.",
    "The Onetouch from Seagate is about the size of an old-fashioned matchbox made out of ABS plastic. At 75x56x10mm for a weight of only 65g, it is small enough to be shoved in a trouser’s pocket without an unwieldy bulge.",
    "What’s more a blend of materials (plastic, fabric and metal) gives it a unique touch although, truth be said, we’re not sure about how the cloth finish will withstand the test of time.",
    "As for most external SSD, there’s a lonely physical connector, which in this case is a flat Type-A USB port, a disappointing choice as a Type-C connector is the defacto standard nowadays. Next to it is a white status LED that informs the user of any activity. There’s a short cable provided with the drive and that’s it.",
    "Seagate rates the drive at up 400MBps on read/write speeds, which is mildly disappointing. The drive is formatted exFAT and doesn’t require any special software to connect to our test device, a Dell Latitude 7490.",
    "It uses a JMicron 500-series USB to SATA bridge controller with Toshiba TLC 3D NAND chips; the combination should easily hit well above 400MBps as we’ve seen similar setups elsewhere reach those numbers.",
    "Crystaldiskmark and ATTO benchmarks both delivered numbers more than 10% higher than Seagate’s own estimates, which goes to prove that they were conservative ones. The bottleneck is the USB 3.0 port that has a top theoretical speed of 5Gbps, although in reality, 75% of that is considered the absolute maximum in real life.",
    "Let’s talk about the Mylio Create software first; this is worth $50 and is essentially a cloud-free photo management storage service, available for free for the first year. It has an upper limit to the number of files it can take (50,000 for that tier) and you can connect up to four computers (but unlimited mobile devices) to it. Hard drives, cloud storage providers and NAS devices do not count toward your device limit. It allows RAW image editing; just bear in mind that the pictures are stored on the drive itself.",
    "Adobe Creative Cloud Photography is also bundled and costs $9.99 per month. It includes Lightroom on desktop and mobile, Lightroom Classic, Photoshop on desktop and iPad, your own portfolio website and social media tools and 20GB of Adobe cloud storage (about 4,000 JPEGs).",
    "Seagate also includes Sync Plus which is a rudimentary backup tool that transparently copies all files in the user area of a device to the SSD on the fly/in real time which means that, any document saved will be automatically copied to the SSD assuming it is connected.",
    "At $148 at Amazon the Onetouch 1TB is one of the dearer Seagate external SSD products with this capacity. That is still cheaper than the Samsung T5 or the Sandisk Extreme portable SSD of similar ilk plus you get the software bundle.",
    "You can save yourself a tenner by opting for the plain vanilla Seagate Expansion 1TB SSD which is essentially the same model without the fabric finish, the software bundle but with a Type-C connector instead. You still get the same components and the three-year warranty.",
    "If you can make do with a slightly lower capacity, then consider the PD400 from Teamgroup which sports a very similar design to the Samsung T5; it has a 960GB capacity but costs only $105. With a chassis made entirely of aluminum, it is IP66 rated which means that it is splash-proof and dust-proof. The other advantage is that it has a Type-C connector, which means that it can connect directly to a compatible Android smartphone.",
    "Slightly more expensive but more rugged is the ADATA SD600Q at $110 for $960GB; it adheres to the MIL-STD-810G 516.6 standard and has a rugged design. It loses out to the PD400 because it uses a flat USB connector but is still up there on our list as an alternative.",
    "As always, in mature markets like external storage, it is primarily about the cost. Given that Seagate’s Onetouch 1TB product doesn’t have any significant USP other than the Mylio Create software, it will have a tough time out there. It is compact, well designed but we are not a big fan of the fabric-led design, its average performance and the use of a very short cable with an old-school flat USB port at one end.",
    "There are significantly cheaper models available if you choose to ignore the software bundle and there are significantly faster storage devices - like the Crucial X8 which is rated at 1GBps - that cost roughly the same."
  ],
  "headers": {
    "4": "Design",
    "7": "Performance and in use",
    "10": "The software",
    "13": "Competition",
    "17": "Final verdict"
  },
  "links": {
    "OneTouch 1TB": "https://www.seagate.com/consumer/backup/one-touch-ssd/",
    "$148 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Touch-External-Solid-Portable%2Fdp%2FB07WZKG9L6%2Fref%3Dsr_1_1%3Fkeywords%3DSeagate%2BOnetouch%2B1TB%26qid%3D1580760736%26sr%3D8-1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1307243059932048100-20",
    "Dell Latitude 7490": "https://www.techradar.com/reviews/dell-latitude-7490",
    "Hard drives": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "NAS devices": "https://www.techradar.com/news/the-10-best-nas-devices-reviewed",
    "Adobe Creative Cloud Photography": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "Lightroom": "https://www.techradar.com/reviews/adobe-photoshop-lightroom-cc",
    "Lightroom Classic": "https://www.techradar.com/news/a-closer-look-at-lightroom-classic-ccs-new-features",
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2019",
    "Adobe cloud storage": "https://www.techradar.com/news/what-is-adobe-cloud-storage",
    "backup tool": "https://www.techradar.com/best/best-free-backup-software",
    "Samsung T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "Sandisk Extreme portable SSD": "https://www.techradar.com/reviews/sandisk-extreme-portable-ssd-1tb",
    "Seagate Expansion 1TB SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Expansion-Solid-State-Drive%2Fdp%2FB07WZPHK9L%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2621603932807395300-20",
    "PD400 from Teamgroup": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FTEAMGROUP-PD400-Waterproof-Dustproof-Shockproof%2Fdp%2FB07T36556V%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3810709780351213600-20",
    "Android smartphone": "https://www.techradar.com/best/best-android-phones",
    "ADATA SD600Q": "https://www.techradar.com/reviews/adata-sd600q-ruggedized-external-ssd",
    "Crucial X8": "https://www.techradar.com/reviews/crucial-x8-1tb-portable-ssd"
  }
}