{
  "source": "https://www.techradar.com/reviews/onfleet",
  "title": "Onfleet fleet management review",
  "category": "computing",
  "updated": "2021-09-09T09:42:00Z",
  "author": "jitendra-soni",
  "summary": "An innovative fleet management solution",
  "verdict": "Onfleet offers a unique value proposition for its clients, and is great for hyperlocal delivery companies, with many strengths in that regard.",
  "pros": [
    "Clearly defined pricing and contract details",
    "Supports smaller as well as large vehicles",
    "Easy on-boarding process"
  ],
  "cons": [
    "Some important telematics features missing",
    "Not listed with Better Business Bureau"
  ],
  "article": [
    "Onfleet is a newer brand that offers fleet tracking services ideal for smaller fleets and startups looking to optimize delivery operations. The company, founded in 2012, has thus far already tracked over 100 million miles while facilitating over 50 million deliveries in 90 countries for over 1,000 customers.",
    "It offers a cloud-based solution that helps streamline delivery operations and maximize efficiency by providing insights that allow businesses to make informed decisions.",
    "Onfleet comes across as a company that wants to keep things straightforward, making its pricing scheme simple, and listing most terms and conditions on its website. There are very few companies in this industry that still offer a free trial, but Onfleet is one of them, offering a 14-day trial that allows you to test its services before signing up.",
    "There are both monthly and yearly payment options for Onfleet, and the annual subscription that needs to be paid upfront is obviously cheaper. The monthly plan gives you the further freedom to continue to test the service after the trial, while not making too much of a commitment.",
    "Unlike other companies, Onfleet’s charges are based on the number of tasks rather than the number of vehicles. It offers four different plans – Starter, Basic, Premium and Professional. The details of these plans follow below:",
    "Starter: As the name suggests, this is the entry-level plan that offers the least amount of features, but is the cheapest. Priced at $149 per month for the annual package and $199 per month for the monthly payment option, this plan offers features like tracking, packaging, dispatch and analysis of the fleet. It has 1,000 tasks bundled with the subscription and additional tasks are billed at $0.15 per task. It also offers the Zapier API for integration.",
    "Basic: Available at $349 per month with the annual contract, and $449 per month under the monthly payment option, the Basic plan comes with 2,500 bundled tasks and charges $0.16 per additional task. As well as the features of the Starter plan, the Basic plan offers two-way communication, route optimization and machine learning-based predictive ETAs.",
    "Premium: The premium tier is priced at $799 monthly for the annual contract, and $999 per month with the monthly plan. It comes with 5,000 tasks bundled and additional tasks cost $0.18 per task. Apart from the features of the Basic plan, the premium tier offers benefits like barcode scanning, age verification, predictive ETA notifications and a dedicated phone number for your customers.",
    "Professional: This will set you back $1,999 per month for the annual payment plan and $2,400 under the monthly payment option. It comes bundled with 12,500 tasks while extra tasks are billed at $0.20 per task. Over and above the features of the Premium plan, Professional tier customers get white label software, multi-brand account support, priority customer support and unlimited analytics and export history.",
    "There is an Enterprise plan as well that offers additional features like a support SLA, concierge on-boarding and a dedicated success team, on top of what's provided with the Professional tier. The pricing, however, is not mentioned online and the company prefers businesses to connect directly with the sales team in this case.",
    "Onfleet is a last-mile delivery management SaaS platform that helps companies to manage fleet operations. It aims to remove the need to keep physical invoices and juggle multiple Excel spreadsheets to manage operations. It benefits from a modern UI that is intuitive and easy to use.",
    "Unlike most other such services, Onfleet doesn’t require installation of hardware to track drivers, relying instead on an app that is installed on the smartphone or tablet that the driver carries.",
    "The app is compatible with most iPhones, iPads and Android phones. Since you do not need additional hardware, the initial investment only comprises of the subscription fee, and all this makes the on-boarding process easier.",
    "Some of the key features of Onfleet’s solution are:",
    "Onfleet offers a host of training options including videos and online guides. Customers can reach out to the support team via email or by raising a ticket online, but there is no telephone helpline.",
    "Its social media accounts like Twitter and Facebook are fairly active and the company keeps adding fresh content to the official blog.",
    "Onfleet is different to most fleet management outfits because it charges based on tasks rather than vehicle count. In terms of services as a full-fledged fleet management company, it may lack a few features, but its solution is tailor-made for companies involved in last-mile deliveries.",
    "The business is not yet listed on the Better Business Bureau website and hence has no user reviews or ratings there."
  ],
  "headers": {
    "2": "Pricing",
    "10": "Features",
    "14": "Support",
    "16": "Final verdict",
    "18": "Further reading"
  },
  "links": {
    "fleet tracking services": "https://www.techradar.com/best/the-best-fleet-management-software-and-services-2020"
  }
}