{
  "source": "https://www.techradar.com/reviews/indinero-accounting",
  "title": "inDinero accounting review",
  "category": "computing",
  "updated": "2020-09-30T08:17:46Z",
  "author": "rob-clymo",
  "summary": "Combine InDinero's cloud-based accounting with real-time professional advice",
  "verdict": "While it comes with quite an expensive price tag InDinero is a great combination of cloud-based software and advice from professional advisors.",
  "pros": [
    "Cloud-based",
    "Great supporting app",
    "Good support"
  ],
  "cons": [
    "Not cheap"
  ],
  "article": [
    "InDinero has been around for a number of years and continues to provide startups with all-in-one accounting solutions, ranging from cloud-based software through to pro-level advice. The good thing about this is that if you’re a fairly small business with little in the way of time to spend on accounts and bookkeeping then InDinero could prove to be a decent investment. This is especially so during the ongoing coronavirus pandemic.",
    "While it's not exactly a cheap service to use, the combination of a cloud-based software dashboard and real-time help from InDinero advisors could soon be paying dividends. The Dashboard area works in harmony with a rock-solid app too, meaning that you can stay on top of your business administration tasks anytime and anywhere.",
    "Similar software on the competitor front includes Sage Business Cloud Accounting, QuickBooks, Xero, FreshBooks, Freeagent, GoSimpleTax, TaxCalc, Nomisma, ABC Self-Assessment, Crunch or Zoho Books.",
    "On face value InDinero’s pricing strategy might look a little expensive, especially if you're one of the start-ups that the business targets with its products. However, anything that can help make your business more efficient is worth considering so either package might be able to justify the outlay fairly quickly.",
    "Both plans come with bookkeeping tools along with the benefit of support from qualified accountants. The Essential package is aimed at startups that need simple cash basis accounting and is available from $300 per month.",
    "The second option is Custom and is aimed at companies that need accrual accounting, plus controller support and fractional CFO services. This doesn't come with a published price, but you can apply for a free estimate via the InDinero website.",
    "Alongside the professional help from inDinero advisors the software service side of things comes with a strong set of features. The headliner is the real-time dashboard, which delivers a comprehensive overview on your spending, revenue and overall cashflow. It works dynamically too, so you’re always going to be getting an up to date picture.",
    "It’s also easy to connect to all of your bank accounts, with unlimited options on that front, allowing you to quickly sync all of your transactions for the bigger accounting picture. InDinero can be used for supplementary tasks, such as reimbursing employee expenses and keeping on top of tax returns.",
    "With its intuitive tools, the inDinero dashboard can be configured to automate transaction categories, meaning you can produce your own tailored business overview. Perhaps the only downside to all this is the slightly limited integration on offer, with only the likes of Gusto, Justworks, Stripe, PayPal, Sitch Labs, Expensify and TriNet being compatible. Some big name integration might improve this.",
    "Although it’s cloud-based, InDinero doesn't have too much in the way of complexity to worry about when you’re using the software part of the service. The overall workflow is managed via a digital dashboard, which can be accessed via a web browser or through the supporting app.",
    "Where the real performance comes into play is when you join this up with the support from professional InDinero advisors. One aspect that does hamper the potential performance of the software though is its lack of integration with other financial products, such as related accounting software.",
    "It’s as much about the support and help you get from InDinero personnel that makes this particular service appealing, although the cloud-based software dashboard is easy to use too. Added to that is the extra benefit of iOS and Android app editions of InDinero, which let account holders carry on with their accounting and bookkeeping chores from pretty much anywhere.",
    "Unsurprisingly for a service that puts a great deal of emphasis on its professional level support, InDinero has plenty of options for getting assistance. There are the more usual routes, such as phone contacts, email and live chat tools too, all of which get highly praised by most who have call to use them.",
    "However, this is boosted with video tutorials, in-software help, lots of FAQs and a blog too. The InDinero website has also been well put together and caters for all sorts of businesses with a wealth of resources. This includes the likes of case studies where you can compare other similar business stories with your own. It's all pretty well thought out and resourced.",
    "InDinero has the potential to work for businesses of all sizes, although it seems to be billed predominantly as a service for startups. While fledgling ventures might not have the financial means to head straight for the Custom package, and might not even need all if its many and varied services, the Essential option is ideally suited to small businesses.",
    "There are certainly plenty of features in either edition, but the real benefit you get from being signed up to InDinero is the added value of real-time professional advice. If you’re constantly tied up in knots with your accounting and bookkeeping chores, or simply want someone else to take the strain, then stumping up the pretty high fees for InDinero could ultimately save you time and, possibly, money too."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "11": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "InDinero": "https://www.indinero.com",
    "accounting solutions": "https://www.techradar.com/best/accounting-software-small-business",
    "bookkeeping": "https://www.techradar.com/best/accounting-software-small-business",
    "Sage Business Cloud Accounting": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-online",
    "Xero": "https://www.techradar.com/reviews/xero",
    "FreshBooks": "https://www.techradar.com/reviews/freshbooks-2020",
    "Freeagent": "https://www.techradar.com/reviews/freeagent",
    "GoSimpleTax": "https://www.techradar.com/reviews/gosimpletax",
    "TaxCalc": "https://www.techradar.com/reviews/taxcalc",
    "Nomisma": "https://www.techradar.com/reviews/nomisma",
    "ABC Self-Assessment": "https://www.techradar.com/reviews/abc-self-assessment",
    "Crunch": "https://www.techradar.com/reviews/crunch",
    "Zoho Books": "https://www.techradar.com/reviews/zoho-books",
    "Essential": "https://www.indinero.com/pricing",
    "Custom": "https://www.indinero.com/pricing",
    "small businesses": "https://www.techradar.com/best/accounting-software-small-business"
  }
}