{
  "source": "https://www.techradar.com/reviews/vpnaccounts",
  "title": "VPNaccounts review",
  "category": "computing",
  "updated": "2020-12-04T18:14:51Z",
  "author": "sead-fadilpasic",
  "summary": "Solid speeds and unblocking capabilities",
  "verdict": "We liked VPNaccounts’ simplicity and capability to provide access to popular VOD services, native clients for all platforms, a chance to try it out for free during a 7-day trial, and on top of it, a month-long refund policy. However, we were slightly disappointed by its small server network, the lack of support for torrenting, and not as many details about the (no) logging policy as we had expected.",
  "pros": [
    "Unblocks Netflix, BBC iPlayer",
    "Apps for all major platforms",
    "7-day free trial",
    "30-day money-back guarantee"
  ],
  "cons": [
    "Torrenting isn’t permitted",
    "Small server network",
    "Unclear logging policy"
  ],
  "article": [
    "VPNaccounts is a provider of VPN services that has been on the market since 2005, so it can be rightfully considered a veteran in this business. Its offering covers strong privacy and access to popular streaming services at solid speeds, but it has certain disadvantages that make it inferior to today’s best VPN solutions, such as the absence of torrenting support, limited server coverage, and the lack of transparency.",
    "There are several options at your disposal. You can purchase a monthly subscription at $7/month, an annual one at $5/month, or a 2-year plan at $4.37/month, all of which aren’t exactly the cheapest in the industry but we’ve seen far worse. The only two accepted payment methods are credit cards and PayPal, so there’s no anonymity offered by, say, Bitcoin.",
    "VPNaccounts offers a 7-day free trial, although this requires signing up for a subscription plan and canceling it before the seven days are up or you’ll be charged for the entire amount. For some reason, you can’t get a free trial if you’re paying via PayPal, but there’s a 30-day money-back guarantee you can use instead. This isn’t as good as the free trial as you’ll need to state a reason for canceling but at least it exists.",
    "Under one account, you’ll be able to connect five devices at the same time.",
    "VPNaccounts performs well, giving speeds that are comparable to some of today’s best performers in the VPN field. However, it has some downsides that separate it from them. For example, despite being more expensive, ExpressVPN provides a complete anonymity service that ranges from rich and nicely designed apps and live chat availability to torrenting support and thousands of servers.",
    "Other competitors are even cheaper than VPNaccounts, like NordVPN, Surfshark, or CyberGhost, and all of them offer access to more servers than you can handle, all the content you wish to torrent, and transparently list all the data they do and don’t log.",
    "Some VPN providers are capable of providing their users with access to popular VOD services like Netflix or BBC iPlayer that are often blocked in certain regions and VPNaccounts is proud to be one of them, as clearly stated on their website.",
    "VPNaccounts is the product of a company called SpiderSilk Ltd., which is headquartered in Hong Kong. The company currently has 400 IP addresses and 47 servers in 32 countries.",
    "VPNaccounts secures your VPN connection using OpenVPN UDP/TCP, IKEv2, L2TP/IPSec, and PPTP protocols. It doesn’t say which encryption it uses, but it’s safe to assume it’s 256-AES, at least for the OpenVPN connections (we asked the customer support about it but they only gave us the above list of protocols).",
    "If you download the vendor’s Windows or Mac client, you’ll be able to activate a kill switch - a nifty tool that shuts off your entire Internet access the moment your VPN connection drops, preventing any data from leaking. The Windows and Mac clients also feature the so-called “stealth mode” which can be used for bypassing restrictions in situations where normal VPNs can’t succeed in this endeavor.",
    "For those of you who were hoping to use this provider for some torrenting or P2P traffic, we have some bad news - VPNaccounts doesn’t allow it and may even actively block torrent sites and P2P/torrent traffic on its network. On top of that, “any users found engaging in P2P risk having their accounts terminated without notice and no refund will be given”. This could mean your activities may be monitored when using this VPN. Something to keep in mind.",
    "VPNaccounts’ privacy policy states that “no individually identifiable information is collected”, but we aren’t given the slightest detail as to what this includes. In fact, logs aren’t even mentioned once here, although the homepage states that it keeps no “connection logs, no usage logs, no logs at all”. An outside opinion of an independent auditor would be a great way to provide more details and assurances to users that their data is truly private when using this provider.",
    "Native clients are offered for Windows, Mac, Linux (in beta stage), iOS, Android, and Fire TV, but you can also install the service manually and rely on your device’s built-in VPN.",
    "The iOS app has so far been rated with 5 stars (out of 5) by 2 users on the App Store, but its Android counterpart is yet to receive any score on the Google Play Store since only one person has downloaded it so far. The app was last updated on September 16, 2020.",
    "The most typical problems and frequently asked questions are addressed in the provider’s support section. Should you require assistance that is beyond the website’s reach, you can get it by contacting the customer support team directly via the contact form. The team is available 24/7 and we received an email response fairly quickly (although not as quickly when we requested account cancellation).",
    "Testing VPNaccounts’ download speeds started with Paris, France, which gave us a very good 20Mbps on our 70Mbps testing connection. We also tried New York City, the US, and we got a very usable 14Mbps. Finally, we wanted to see how Singapore would fare, considering how far away it is from our current physical location. It did just fine, with 7.25Mbps being low yet very acceptable for such a distance and faster than with some VPN services.",
    "The VPNaccounts Windows app is simple as they come, with a big Switch On/Off button in its main interface, as well as some general and advanced settings that allow you to turn on/off the kill switch, an option to re-establish the VPN connection if it drops, change between the protocols (UDP, TCP, Stealth), ports (53, 88, 123), and a few other options. Connecting itself only requires only one tap on the big button, and you can change servers easily, without disconnecting.",
    "VPNaccounts does its job pretty well, as long as you’re not intending to use it for torrenting, which is strictly forbidden. With its help, you’ll be able to access the likes of Netflix and BBC iPlayer from anywhere in the world and you’ll get not one, but two chances to change your mind if the service isn’t to your liking.",
    "That said, it is devoid of the mammoth server network that VPNs such as ExpressVPN have, as well as their feature-rich apps, and not to mention the support for torrenting."
  ],
  "headers": {
    "1": "Price",
    "4": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "12": "Support",
    "15": "Speed and experience",
    "17": "Verdict"
  },
  "links": {
    "VPNaccounts": "https://www.vpn-accounts.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "privacy policy": "https://www.vpn-accounts.com/tos/",
    "support section": "https://www.vpn-accounts.com/support/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-5107836728425750000"
  }
}