{
  "source": "https://www.techradar.com/reviews/blackvpn",
  "title": "BlackVPN review",
  "category": "computing",
  "updated": "2020-11-18T20:06:57Z",
  "author": "sead-fadilpasic",
  "summary": "Barely works - but unblocks Netflix",
  "verdict": "BlackVPN looks like a solid platform at first - it unblocks geo-restricted content, supports torrenting, and provides industry-standard privacy and security. However, its native apps don’t appear to work, and the platform itself is barely usable even when you use third-party software - we found at least half of all the servers will fail to connect.",
  "pros": [
    "Unblocks Netflix and BBC iPlayer",
    "Solid speeds on nearby working servers"
  ],
  "cons": [
    "Lots of connectivity issues",
    "Free trial doesn’t work",
    "No live chat"
  ],
  "article": [
    "Established in 2009, BlackVPN is a provider of VPN services that has tried to show a lot of dedication toward truly free Internet and their user’s privacy, identifying its cause with those of Edward Snowden, PirateBay founders, and Lavabit’s Ladar Levison and quoting the Universal Declaration of Human Rights which states in its Article 12 that privacy is a fundamental human right.",
    "While its devotion to these causes is commendable, its platform really isn’t, which is why we urge you to instead check the best VPN solutions.",
    "Most VPN providers offer several subscription options based on their length but BlackVPN does things slightly differently. It offers different types of subscription packages based on your VPN requirements and available servers under such type. Therefore, you’ll have Global, TV, and Privacy packages, as well as the additional USA and UK packages, all of which can be purchased under 1-month, 3-month, and 12-month plans.",
    "The Global package includes all of the provider’s VPN locations and costs €9.50 ($11.26) for the 1-month access, €27.00 ($32.00) for the 3-month access (equals to $10.67/month), and €99.00 ($117.37) for the 1-year access (equals to $9.78/month), which is considered expensive in the VPN industry.",
    "BlackVPN’s US and UK London VPN locations are included in the TV package, which is ideal for streaming services from the USA and UK. It will cost you €7.50 ($8.89) if you choose the 1-month pricing plan, €20.00 ($23.71 or $7.90/month) if you opt for the 3-month option, or €75.00 ($88.92 or $7.41/month) if the 12-month subscription is your preferred choice.",
    "The Privacy, as well as the separate USA TV, and UK TV packages are all priced the same amount - €5.00 ($5.93) for the 1-month, €13.00 ($15.41 or $5.14/month) for the 3-month, and €49.00 ($58.08 or $4.84/month) for the 12-month access. The Privacy package gives you access to the provider’s Privacy VPN locations, with unrestricted P2P/torrent access.",
    "Under one account, you’ll be able to connect up to 7 devices at the same time, regardless of the chosen plan.",
    "If you decide to buy this provider’s services, you’ll be able to pay using PayPal, Paymentwall (credit/debit cards, gift cards, e-wallet, gift cards, bank transfer, etc.), Bitcoin, and 40 other cryptocurrencies.",
    "Although BlackVPN claims that you have 14 days after the purchase to change your mind and get a full refund, we found this to be false. Namely, we contacted the provider multiple times for a refund and never got a response. It also claims to have a 3-day free trial, albeit only for Android devices. Unfortunately, the trial doesn’t seem to work.",
    "BlackVPN is deeply inferior to many of today’s popular VPN names. These include NordVPN, CyberGhost, and Surfshark, all of which provide excellence at lower rates than BlackVPN. But if you demand true perfection, then ExpressVPN is the only choice.",
    "Although extremely popular, streaming services like Netflix, BBC iPlayer, and Hulu are often unavailable in certain regions, which is why the netizens occupying these areas often resort to VPNs that can provide them with access to this coveted content. BlackVPN is one such VPN and it even has troubleshooting articles to help you circumvent the blocks imposed by these streaming services. However, you may have difficulty finding a working server for these purposes.",
    "BlackVPN is registered in Kowloon, Hong Kong, and provides its customers with access to 31 VPN servers in 20 locations in 18 countries, such as Romania, the USA, Czechia, Brazil, and Australia.",
    "BlackVPN allows you to connect with SSL Tunnels, IPSec/L2TP, PPTP, and OpenVPN protocols, the last of which it uses together with 4096-bit RSA certificates (with SHA51) for server authentication, AES-256 encryption, as well as DHE for perfect forward secrecy. The provider also deploys an NAT firewall which blocks unrequested inbound traffic when you’re connected to the VPN.",
    "All this enables you to not only browse totally anonymously but to also safely download and upload large files via torrenting and P2P clients with no copyright alerts. Do note, however, that torrenting isn’t permitted on the US and UK VPN servers.",
    "In its Terms of Service, BlackVPN states that it doesn’t collect or keep any activity, traffic, connection, bandwidth, or DNS logs, or your real IP address. It does see connection logs with timestamps of when you connected but this information is deleted when you disconnect.",
    "The provider states that “instead of keeping connection logs to deter abuse, we’ll rely on reacting to incoming abuse reports by temporarily blocking access to those sites and services that are being abused.” Connections to the IPs being abused may be monitored so the abuser can be located and banned. Monitoring typically takes place until the abuse stops.",
    "We have no way of verifying these claims until the provider brings out an outside auditor to examine its platform and issue a public report on its findings but we do appreciate this level of honesty. Moreover, BlackVPN is registered in Hong Kong, a place with no mandatory data retention policy, so it's allowed to operate with minimum knowledge about its customers.",
    "The platform should work on Windows, Mac, iOS, Android, Linux, and routers, for all of which it provides config files, native clients (Mac, Android, as well as Windows and iOS in beta), and setup instructions.",
    "BlackVPN’s Android app has been rated 3.5 by 775 users, out of 100,000+ of them that installed it. It was last updated on September 14, 2017. Do note that there are several apps in the Google Play store with the same name - you’ll recognize this one as being developed by BlackVPN. As for its iOS app, the provider states it has been submitted to the App Store but still hasn’t been approved. If you’d really like to use the app before it’s approved, you can send an email to the support and it’ll add you to the TestFlight beta list.",
    "You can also use this email address if you need help or have any questions. Alternatively, you can open a support ticket if you have any questions concerning installation, connection, account issues, etc. or you can fill out the contact form on the website if you have sales or other non-support questions.",
    "Before you reach out to the customer support, though, we recommend checking out the provider’s knowledgebase that contains FAQs, installation guides, troubleshooting articles, and more.",
    "The provider’s Windows app was extremely easy to download and install. However, it was completely unusable. It only connected the first few times, but the speeds were near zero, after which the app stopped connecting at all. We had more luck with the provider’s OpenVPN GUI.",
    "The first server we tested for download speeds was in the Netherlands. It delivered mediocre yet very usable 20Mbps on a 64Mbps testing connection. The server in France also had solid results - hailing 23Mbps. We also tried servers in Luxembourg and Romania, but they wouldn’t connect at all. Australia performed predictably worse, reaching only 3.8Mbps on a 64Mbps testing connection. Brazil was a bit faster, getting to 5.4Mbps.",
    "BlackVPN was probably an excellent VPN platform once. However, it is now a barely working shell of a service that only has a nice website to show off and a bunch of unusable apps and servers that occasionally connect. It may unblock Netflix and BBC iPlayer but what’s the point if you can’t even connect to a server in a country where such services are available?",
    "Due to these reasons, you’ll have a much better experience if you go for a truly capable VPN provider, such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "9": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "12": "Privacy and encryption",
    "17": "Support",
    "21": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "BlackVPN": "https://www.blackvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Terms of Service": "https://www.blackvpn.com/about/terms-of-service/",
    "Android app": "https://play.google.com/store/apps/details?id=com.blackvpn",
    "email": "mailto:support@blackvpn.com",
    "support ticket": "https://support.blackvpn.com/open.php",
    "contact form": "https://www.blackvpn.com/contact/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-4413300169700081700"
  }
}