{
  "source": "https://www.techradar.com/reviews/powervision-poweregg-x",
  "title": "PowerVision PowerEgg X review",
  "category": "cameras",
  "updated": "2020-07-22T16:09:44Z",
  "author": "james-abbott",
  "summary": "A modular, waterproof drone that’s much more than a drone",
  "verdict": "The PowerEgg X Wizard is a surprisingly good drone to fly and provides a great deal of stability in the air thanks to the large propellers. Image quality is good, if not outstanding. The lack of Raw video formats may put off some professional videographers, though photographers will be pleased to know that Raw stills can be captured in DNG format. But it’s the waterproof housing and floats for landing on water that make this unique drone stand out from the crowd.",
  "pros": [
    "Flies in heavy rain",
    "Can land on water",
    "Doubles as a handheld camera"
  ],
  "cons": [
    "Image quality not as good as rivals",
    "No ND filters",
    "Lacks Raw video modes"
  ],
  "article": [
    "In a market dominated by drones that you can't fly in inclement weather, the PowerVision PowerEgg X provides an attractive option for photographers and videographers who want to be able to fly their drone in the rain and land it on water.",
    "But that’s not all the PowerEgg X does. As well as being a drone, it can also be used as a handheld gimbal camera and an autonomous AI camera that can be mounted to a tripod and controlled using hand gestures. There’s even a built-in microphone, for use in the two camera modes.",
    "Despite the unusual design, the PowerEgg X is easy to fly and handles well in the air. The waterproof housing and floats (which come with the PowerEgg X Wizard bundle) do change flight behaviour, but not to such an extent that it makes flying the drone difficult. Still, these accessories do reduce flight time due to the additional weight and drag.",
    "Landing on water is a strange experience at first because it goes against everything you expect from a consumer-level drone, but this quickly subsides and you can enjoy an entirely new way of flying and capturing stills and video.",
    "Naturally, image quality with the waterproof housing isn’t as good as without it, because you are shooting through plastic. This can produce a small amount of distortion depending on the angle of the camera, but being able to shoot stills and video in the rain alongside the ability to land the drone on water when the floats are attached make the PowerEgg X Wizard unique. This opens up a range of creative and operational possibilities for photographers, videographers and commercial drone pilots.",
    "The PowerEgg X is the second PowerEgg model released by PowerVison and was announced at CES 2020 in January.",
    "Whereas the first model featured a folding design, this new edition offers a modular approach with detachable propellers and accessories to use the drone in its three different forms – as a drone, a handheld gimbal camera and an AI camera that can smoothly track subjects.",
    "There are two kit options available. The PowerEgg X Explorer kit costs $899 / £799 / AU$1,845, and includes the drone and detachable propeller arms, handheld camera strap, one battery, a controller, a polystyrene carry case and two spare propellers.",
    "The Wizard kit, which we tested, costs $1,249 / £1,099 / AU$2,599 and includes all of the above, as well as a waterproof housing, floats for water landings, an additional battery, two extra pairs of propellers, a propeller arm case and a mini tripod for AI camera mode. Like most drone bundles with additional accessories, the Wizard kit represents the best value for money.",
    "The design of the PowerEgg X is like no other drone. It's closest to the original PowerEgg, of course, but that drone featured foldable rather than detachable propeller arms.",
    "As the name suggests, the PowerEgg X sports an egg-shaped body with a detachable bottom panel that neatly hides and protects the camera and gimbal, while the top panel is also removable. This is where the battery and memory card live, and there are also accessory sockets on the sides of the device.",
    "The main body is lightweight at just 522g with a battery and microSD card installed. Add the propeller arms and the take-off weight becomes 862g. The arms attach to accessory sockets on either side of the egg-shaped body, which is where you can also attach a hand strap for using it in handheld camera mode, or a tripod mount for securing the camera to a tripod for the AI camera mode.",
    "It’s really quite clever and quickly illustrates why PowerVision has opted for such an interesting and unique design.",
    "If you’ve used a drone before you’ll quickly feel at home with the PowerEgg X because its main features, including the smartphone app, are extremely similar to competitor drones like the DJI Mavic Air 2.",
    "The main difference is that the propeller arms are detachable for storage and transportation, whereas most other drones these days feature a folding design.",
    "The controller is a simple white-and-grey affair, with several buttons and a dial to control the gimbal as well as a programmable Custom/FN button so you can assign your preferred function.",
    "On the top are two comfortable control sticks than can be detached or left on the controller when carried in the supplied polystyrene shell case. Around the control sticks there’s a rubber waterproofing to help keep water away from the internal electronics when used in the rain.",
    "Finally, there’s a foldable phone holder that’s large enough to hold larger smartphones such as the Huawei P30 Pro, but not large enough to hold phablets like the Samsung Galaxy Note.",
    "In drone mode, the PowerEgg X handles well in the sky and the propellers, which are larger than those on the DJI Mavic 2 Pro, keep the drone steady in windy but safe to flying conditions. The PowerEgg is rated to fly in wind speeds up to 23mph/38kph, and it certainly can handle these conditions with ease.",
    "Battery life in drone mode is advertised as being up to 30 minutes. It’s 3.5 hours in the other camera modes, and during testing on a day with 20mph wind gusts it was possible to keep the drone in the air for 23 minutes with 15% of the battery remaining. Wind speed, temperature and, of course, the use of the waterproof housing and floats will always impact battery life.",
    "When using the waterproof housing and floats, handling in the air is impacted and the drone tends to reduce altitude when being flown forwards, although this can be countered by applying a little lift with the controller. When it's windy, the floats also make the drone unstable in the air.",
    "Water landings themselves work well, but it’s best not to land on fast-moving water or too close to a riverbank in case the drone gets flipped over and/or caught in reeds. The floats are also useful for landing on snow, mud and in long grass.",
    "When it’s raining the top of the waterproof housing can suffer from fogging. But during testing, this wasn’t a problem at the front of the housing where the camera is situated, although rain droplets in front of the camera were visible in videos (see below).",
    "In terms of flight technology, the PowerEgg X offers front obstacle avoidance and downward sensors to aid with landing. Rear obstacle avoidance sensors would have been a great advantage, as flying backwards is a popular way of capturing aerial video. But their absence certainly isn’t a deal-breaker.",
    "Intelligent camera modes, which are accessed from within the app by pressing the AI button include Follow Me, Point of Interest, QuickShots and Time Lapse. All of these are easy to use and perform as expected.",
    "In the handheld gimbal camera and AI camera modes, you get the video functionality of the drone either handheld or tripod mounted. The AI camera uses facial recognition and can smoothly follow subjects, which is said to be continually improved through deep learning and firmware updates.",
    "This feature could be useful for vloggers who work alone but want to capture footage that looks like it's been shot by another person behind the camera.",
    "The egg body features a microphone that can be used to pick up sound. When shooting in these modes the internal fan is audible, and is faintly noticeable in video footage, but not to the point where it makes the sound unusable.",
    "There is a noise reduction facility that can be turned on in the app, but like noise reduction on any device, you have to compare with and without, then decide which you prefer. This is because basic noise reduction always changes sound. When flying the drone, sound can be recorded from the controller, allowing the drone pilot to either capture ambient sound or add voice notes to video footage.",
    "Is the PowerEgg X missing any major features? At the time of writing, there are no ND (neutral density) filters available for the drone. This means that reducing shutter speed to achieve a speed that's roughly double the frame rate of the video being shot is impossible in bright conditions.",
    "Still, the app is easy to use and the interface is similar to rival drones, so is comfortably familiar. It works best with iPhones, with some Android users reporting minor issues with elements of the app’s performance.",
    "When used with a Huawei P30 Pro, the only issue we found was that Google Maps didn’t show up, so there was no way of locating the drone on a map or seeing the line of travel from the home point. However, when the connection between the controller and drone was lost, the PowerEgg X returned to home automatically without any issues.",
    "The 12MP 1/2.8-inch CMOS sensor is small, but roughly the size you’d get in a mobile phone and only slightly smaller than the sensor found in the DJI Mavic Air 2. The lens provides the full-frame equivalent focal length of 27mm with a constant f/1.8 aperture and hyperfocal focus to maximise depth-of-field.",
    "This does produce a noticeable amount of vignetting, which is quick and easy to remove during image processing, and subjects closer than around 2m are slightly of focus. Everything beyond this to infinity, though, is sharp.",
    "Stills and video quality can differ slightly between subjects and lighting conditions, but for for the former you'll get the best results if you shoot in Raw (DNG) format and process the files yourself using software like Adobe Lightroom.",
    "Like most consumer drones, image quality is best in brighter conditions where subjects appear sharper and color is more vivid than in dull and cloudy conditions.",
    "In-drone processed JPEGs suffer from heavy sharpening and noise reduction, while the color balance and overall saturation are never as good as when you process Raw files.",
    "Also, shooting through the waterproof housing affects image sharpness and clarity when shooting both stills and video. That said, the ability to fly and shoot in the rain opens up both creative and operational opportunities that aren’t possible with other drones.",
    "Despite the small sensor size, shooting in Raw and manually processing the image can produce good results.",
    "Video quality is good but not great. To some extent, this can be forgiven because you can fly and shoot with the PowerEgg X in the rain.",
    "It's possible to shoot video in frame-rates ranging from 24-60fps in 4K, between 24-120fps in 1080p and between 24-240fps in 720p. Footage can be captured as MP4 or MOV (with options including H.265/H.264/MPEG-4 AVC).",
    "These specs certainly aren’t to be sniffed at and will meet the needs of many videographers, although the absence of Raw video and flat profiles such as D-Log will put off some professionals looking for a drone option that can fit into a professional Raw workflow where footage from different cameras can be color graded to match.",
    "On the other hand, the PowerEgg's price and waterproof powers may be attractive enough to override any concerns you have about video quality."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "PowerVision PowerEgg X release date and price",
    "9": "Design and controller",
    "18": "Features and flight",
    "32": "Photo and video quality",
    "43": "Don't buy it if..."
  },
  "links": {
    "DJI Mavic Air 2": "https://www.techradar.com/reviews/dji-mavic-air-2-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Samsung Galaxy Note": "https://www.techradar.com/reviews/samsung-galaxy-note-10-review-and-specs",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro"
  }
}