{
  "source": "https://www.techradar.com/reviews/degoo",
  "title": "Degoo cloud storage review",
  "category": "computing",
  "updated": "2021-03-17T11:22:35Z",
  "author": "mark-pickavance",
  "summary": "Snappy, simple backup with an emphasis on photos",
  "verdict": "Take Degoo Cloud for what it is – a backup service focused on photo uploads from mobile devices – and it scores relatively highly. If you're in the market for more sophisticated backup tools, however, then you'll probably have to look elsewhere for a solution.",
  "pros": [
    "Available on multiple mobile platforms",
    "Slick and intuitive interface",
    "Free tier with 100GB of storage space"
  ],
  "cons": [
    "Upload speeds can be hit and miss",
    "No desktop application, just a web app",
    "Short on serious backup features"
  ],
  "article": [
    "Degoo is very much a consumer-focused cloud storage solution, and primarily concerned with photos and videos too – it uses some behind-the-scenes artificial intelligence to highlight your best shots, for example. It's the sort of feature that Google Photos and Apple Photos have also been adding to their own services, in direct competition with Degoo Cloud.",
    "With only a web app available on the desktop, it's the apps for Android and iOS that do most of the heavy lifting with Degoo Cloud, and there are even apps for the Samsung and Huawei app stores too (bonus points there). The service isn't overloaded with features, but it's worth considering if you're looking for somewhere to store your photos.",
    "You don't get any kind of desktop client or scheduled computer backups with Degoo Cloud, just the web app as far as Windows and macOS goes – so this is by no means a comprehensive business backup solution. You need to upload files manually if you're working on a computer, though Degoo can take files of any type (up to a size limit of 512MB on the free plan).",
    "It's with the mobile apps that Degoo really starts to shine: here you can upload files automatically (from your camera roll, for example), as well as documents and audio files if needed. Photos can be automatically uploaded for free, but you'll need to pay a subscription fee to auto-upload other files (such as videos).",
    "There's even a photo storage maximizer tool here, so lower-res versions of your pictures are stored on your phone to save space, while the full-res versions are kept safely in the cloud (again, this is only for paying members). On the web, you get some basic photo editing tools to play around with, but they feel like more of an afterthought in Degoo – maybe don't cancel that Photoshop subscription just yet.",
    "Music and videos can be streamed from the internet rather than being downloaded, if needed, so you can create a sort of personal Netflix or Spotify for yourself if there's enough space in your Degoo account. In terms of playback and sharing options though, the service is a little on the limited side.",
    "Degoo Cloud is obviously aiming for intuitive, easy navigation when it comes to the interface of its apps: big text, cartoon images, chunky on-screen elements, and so on. It's not the most sophisticated set of interfaces we've ever seen, but finding your way around is straightforward enough.",
    "You only get simple options for uploading and filtering files, but to be fair that's all that a lot of users are going to want – Degoo Cloud might be right for you if you're looking for something that's as accessible as possible and that requires the minimum of effort to use. If your cloud storage needs are more complex, you might have to look elsewhere.",
    "Degoo's attempts to pick out the highlights of our photo roll were a bit hit and miss, so we can't say that's something you can particularly rely on – but then again we'd rather choose our own highlights rather than have an AI engine pick them out anyway. If you're in a rush and just want to see some best picks, it can be helpful.",
    "Upload and download speeds were mostly fine, though we noticed occasionally sluggishness – more so with the mobile apps than with the desktop interface. On the mobile side, you can set uploads to only happen when you're connected to Wi-Fi and when your phone is charging, if needed.",
    "One interesting security feature Degoo Cloud offers is what it calls zero knowledge storage: supercharged end-to-end encryption, so not even Degoo employees can access your files, and data spread out across multiple servers for extra redundancy. It's something that Degoo seems to take very seriously, and is another point in its favour, though this particular feature is another of those only available to paying members.",
    "Across all tiers you get very decent 256-bit AES encryption that is applied to data in transit and at rest in the storage facility. The service also offers two-factor authentication (2FA) as long as you use a Google account to sign in – we'd prefer it if Degoo had its own 2FA solution in place, but support through Google is better than nothing.",
    "There is a free, ad-supported tier available on Degoo, which you can use if you just want to try the service out or you don't have that many photos to store in the cloud anyway. You get 100GB of storage space, and you can only back up one device. You don't get any encryption with the free tier, and your account will be deleted if its inactive for 90 days.",
    "If you're serious about giving it a go with Degoo, then you can upgrade to 500GB of space for $2.99 or £1.89 a month, or go all the way to 10TB of space for $9.99 or £6.39 a month. Paying for the service removes the ads, lets you back up photos and videos from more devices, and adds encryption too.",
    "Take Degoo Cloud for what it is – a mobile-focused, consumer-focused, photo-focused archive tool – and it's a pretty polished solution, especially if you spend a bit of money a month on a subscription. That expenditure gets you extra features like zero knowledge encryption and more comprehensive auto-upload options.",
    "The big problem that Degoo has is that Apple and Google are already doing a very good job in terms of photo and video cloud storage, and their apps are right there when people set up their phones. If you need something that's out of the clutches of the tech giants though, with a strong focus on security, give Degoo Cloud a look."
  ],
  "headers": {
    "2": "Degoo Cloud features",
    "6": "Degoo Cloud interface",
    "10": "Degoo Cloud security",
    "12": "Degoo Cloud pricing",
    "14": "Degoo Cloud verdict"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Android": "https://play.google.com/store/apps/details?id=com.degoo.android",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3841161894459705300&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fdegoo%2Fid1154082727%3Fmt%3D8",
    "zero knowledge storage": "https://help.degoo.com/support/solutions/articles/77000065516-top-secret-zero-knowledge-storage"
  }
}