{
  "source": "https://www.techradar.com/reviews/oppo-reno-3-pro",
  "title": "Oppo Reno 3 Pro review",
  "category": "phones",
  "updated": "2020-07-31T13:59:13Z",
  "author": "ammara-rounaq",
  "summary": "Good cameras don't justify some of this phone's shortcomings",
  "verdict": "The Oppo Reno 3 Pro has stylish looks, a comfy form factor and competent cameras in an otherwise uninspired package. Performance is fair to middling and battery life is just okay. Factor in better priced rival smartphones, and the Reno 3 Pro becomes a hard phone to recommend.",
  "pros": [
    "Lightweight and comfy in-hand feel",
    "Snappy charging",
    "Capable camera"
  ],
  "cons": [
    "Middling performance",
    "Clunky OS",
    "Expensive for what it offers"
  ],
  "article": [
    "The Oppo Reno family has always stood for a new approach for its designs and cameras. The Reno 3 Pro doubles down on that by bringing a slew of new camera features to a familiar yet svelte body.",
    "However, like many other Oppo phones, it aims to grab a piece of a segment that is usually very specification oriented. Sure, it shares a lot of features with current flagships such as multiple high-megapixel cameras, a punch-hole display, fast charging and more, but in the crazy competitive market of mid-range flagships, some of these features are even trickling down to the budget segment.",
    "In simpler words, the Oppo Reno 3 Pro faces competition from both top-end phones and low priced devices.",
    "Oppo’s done a good job with the Reno 3 Pro's form factor. While it has lost its defining shark fin selfie camera design, this has allowed Oppo to make the phone much lighter.",
    "It features curved edges to give it a great in-hand feel despite packing a tall 6.4-inch Super AMOLED display. You’ll have no trouble wielding and operating the phone with one hand, especially if you use the cameras regularly for selfies.",
    "Watch our Oppo Reno 3 Pro review video below",
    "Oppo’s banking on the camera tech it’s packed in the Reno 3 Pro to attract customers and to that end, they’ve done a decent job. The 64MP quad-camera on the back is versatile enough to produce a wide variety of good-looking shots.",
    "The dual-selfie snappers on the front are decent too once you switch off AI processing. And video recording is better than what you would find on phones in the mid-range market.",
    "Beyond the camera and form factor, the Reno 3 Pro has little else going for it. Users need to note this is not the same Reno 3 Pro that was unveiled in China in February. Ours is the global variant, that skips on the Snapdragon 765G and curved display for more conservative alternatives. Perhaps the most questionable element is the inclusion of the MediaTek Helio P95, which hasn’t been the best performer.",
    "In our time with the Reno3 Pro, the phone could handle moderate tasks such as streaming media or browsing social media without issues. Multi-tasking, productivity apps and gaming on the other hand makes the phone sluggish and you’ll have to close apps to make things run smoothly.",
    "The new and improved ColorOS 7 addresses several gripes we’ve had with previous versions. We like the changes and the direction Oppo is moving in, but the OS still remains clunky and humdrum compared to other snappier Android skins.",
    "Battery life isn’t remarkable either, which sums up our feelings on the phone. We understand that a phone at this price point is going to come with shortcomings, but in the Reno 3 Pro’s case, they can’t be ignored, especially when you know there are better performing phones that cost more or less the same and provide a much better user experience overall.",
    "The Oppo Reno 3 Pro is priced at AED 1,899 (around $500, £400, AU$850) in the UAE and will be available in two colors - Auroral Blue and Midnight Black. It comes in just the one configuration with 8GB of RAM coupled with 256GB of storage.",
    "Oppo has no plans to bring the Reno 3 Pro to the UK or Australia, so these phones won't be readily available in those markets. Oppo doesn't often sell its phones in the US, so we won't expect them to be on sale there either.",
    "The phone is available to purchase across Oppo official retailer stores in the UAE or online at Oppo's official website, Noon and Amazon.",
    "Considering you can get phones with higher-end specs for around the same price such as the OnePlus 7T, it’s hard to justify the value that Reno 3 Pro brings. However, it does have a few things going for it.",
    "At first glance, the Oppo Reno 3 Pro looks like any modern flagship with design cues taken from Huawei’s P30 range. It’s an attractive and glossy design with a quad-camera array on the rear and dual camera punch hole on the front similar to what you'd find on the Samsung Galaxy S10 Plus.",
    "The back, though plastic, looks plush with a deep glossy gradient accentuating the overall look. The other thing you’ll notice when picked up is how light the Reno 3 Pro is. The plastic back allows the phone to shave off a few grams while adding a better grip. It also makes it more shatter-resistant if you plan on using it without a case.",
    "The button placement is standard, too, with the power button on the right and the volume rocker on the left. The phone has a 3.5mm jack for all your wired headphone needs too.",
    "The built-in speakers can emit medium loud yet mediocre sound. Inherently, the speaker gets covered while holding the phone sideways, and the low output doesn’t help either.",
    "Flipping over to the front, the Oppo Reno 3 Pro has a 6.4-inch Super AMOLED panel with Full HD+ (1080 x 2400) resolution. The bezels are slim, and the sides curve to offer a comfortable hold.",
    "The AMOLED display renders blacks perfectly at all brightness levels. The Reno 3 Pro has a very high peak brightness, which honestly, we barely needed to resort to. Similarly, the lowest brightness was also usually adequate.",
    "Where the display falters is with contrast, which is on the higher side with over-sharpened colors. That makes things look crisper than they are, and the color palette seems weaker in general which doesn’t help when watching videos on the Reno 3 Pro.",
    "There’s an in-display fingerprint scanner too, which works very well in terms of both speed and accuracy. We found the face unlock features to be impressive too.",
    "Oppo is aiming for the big leagues with the Reno 3 Pro's cameras. There is a total of six cameras split across the front and the back. On the rear you'll find a camera array featuring four of those cameras, with a 64MP f/1.8 primary shooter, an 8MP ultra-wide lens, a 13MP telephoto and a mono lens.",
    "That final camera, the mono lens, allows you to take pictures in black and white, with the ability to pull in more light for higher contrast, and arty shots.",
    "We found this feature a little irrelevant, as the black and white photos we took from the Oppo Reno 3 Pro didn't look all that different to those we shot on other phones that didn't have a monochrome lens.",
    "The primary camera meanwhile has a pleasing color tone and a respectable dynamic range. Details and sharpness are well-retained, however contrast is lacking within that camera.",
    "The Oppo Reno 3 Pro also does an excellent job of identifying when yellow light should be balanced, and when it should be left warm. If you want a lot more detail in your image, you can shoot at 64MP. It comes at the cost of noise but is genuinely fun to zoom in to.",
    "Through software trickery you can also shoot at 108MP under the Expert mode. The main camera essentially takes multiple frames of a scene then adds more pixels, thereby more detail, and combines all frames into a composite 108MP image.",
    "It brings slight variations in the results, however, that could be due to manual errors while dialing in the settings.",
    "The ultra-wide shooter has the usual dynamic range and detail issue when shooting indoors. Shooting in natural conditions creates a lot of lot disparity when compared to the primary camera, especially in the white balance aspect.",
    "At the other end of the focal length, there’s a 2x telephoto lens. As with most others, it struggles to focus on nearby objects sharply, but the results do hold up for what it’s worth.",
    "You can make out the details thanks to the over-sharpening that tries to compensate for the software. Images at up to 10x are usable with the last bit delivering plain digital zoom. Thankfully, the image stabilization is excellent, which is necessary for shooting at such long focal lengths.",
    "The Oppo Reno 3 Pro also has EIS for shooting videos with software-based stabilization. There is a fair bit of cropping to compensate for the shake. Interestingly, when you crank it up to Max, the camera shoots with the ultra-wide lens and then crops in even further. It’s a smart idea to bring in more stabilization, but the video quality is obviously softer.",
    "On the front, we have a 44MP primary selfie shooter along with a 2MP depth sensor. While it may get Oppo the title of the world’s first with that combo, it’s nothing exceptional. Detail, sharpness, and colors are all above average. Stay away from the beauty mode for more realistic results.",
    "The camera app on the phone can be sluggish. Occasionally taking a fair amount of time to load images, or finish processing. Shooting pictures in night mode also takes a few seconds of processing even when the results may not be all that different from default mode.",
    "The Oppo Reno 3 Pro isn't a powerhouse. It is powered by the MediaTek Helio P95, this phone has AI and camera capabilities in its DNA, but fast performance is too much to expect.",
    "Geekbench 5 scores of 403 (single-core) and 1,522 (multi-core) are underwhelming and well-below what you'd expect from a smartphone at this price range, but benchmarks don’t reflect real-world performance.",
    "You won’t notice the chip’s shortcomings with light usage such as social media or browsing the internet, and we found the responsiveness was up to the mark. Throw in some resource intensive tasks such as Google Sheets or Spotify, and it’s a different story.",
    "Gaming is an okay experience overall. Resource heavy games like Hearthstone take longer than you'd expect to load, and you will have to close apps to make things run more smoothly. PUBG Mobile would run at around the 30fps mark on the lowest settings, far from Oppo's claim of \"PC-like gaming\".",
    "HyperEngine optimizations are said to bring lower GPU latency, but we fathom that the underwhelming performance is more in part due to the processor. Basically, do not get this phone if gaming is a big part of why you want it.",
    "The Reno 3 Pro runs on ColorOS 7 based on Android 10 like most modern Oppo phones. Oppo’s software is a bit of an acquired taste. While ColorOS 7 brings some much-needed improvements, the general user experience remains clunky and uninspired. It’s still nowhere close to stock Android but is moving in the direction.",
    "On the visual front, we get cleaner icons, a better-arranged settings screen, beautiful interactive animations that flow smoothly, and a redesigned quick toggles menu. There’s a system-wide dark mode too for more visual appeal as well as battery savings.",
    "There’s no noticeable lag while using the phone and swiping through apps but that doesn’t mean it couldn’t be more fluid. There is no option to summon the notification tray by swiping down on the home screen, and weirdly, notifications can only be swiped out from one direction.",
    "The Oppo Reno 3 Pro’s 4,025mAh battery is decent enough and will last you a day provided you don’t stress it too much. With more conservative use, you can eke out a little more than a day’s use. But adding gaming to the mix did take a rather large toll on the battery, presumably due to the processor working overtime.",
    "In our standard battery test, which involves playing a Full HD video with brightness cranked to maximum and accounts syncing over Wi-Fi, the Reno 3 Pro lost 14% battery life. It’s an average result, acceptable for most smartphones, but we hoped for more.",
    "The Reno 3 Pro also supports the new 30W VOOC Flash Charge 4.0, which takes the phone from zero to full in around 60 minutes. It’s not at fast as Super VOOC found on Oppo's higher priced flagships, but will take your battery to 65% from empty with just 30 minutes of charge.",
    "First reviewed: April 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Oppo Reno 3 Pro price and availability",
    "16": "Design and display",
    "24": "Camera",
    "37": "Performance",
    "42": "Interface and reliability",
    "45": "Battery life",
    "48": "Don't buy it if..."
  },
  "links": {
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "Huawei’s P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus-uae"
  }
}