{
  "source": "https://www.techradar.com/reviews/optoma-lh200",
  "title": "Optoma LH200 review",
  "category": "audio-visual",
  "updated": "2020-03-02T12:50:07Z",
  "author": "jeremy-laird",
  "summary": "A robust anywhere, anyplace, anytime projection solution",
  "verdict": "Optoma’s new portable LED projector is a robust anywhere, anyplace, anytime projection solution, but lacks a little in terms of flexibility and power.",
  "pros": [
    "Super fast start up",
    "Robust and long-lasting",
    "Battery-powered operation"
  ],
  "cons": [
    "Fixed optics",
    "Adequate image quality",
    "Limited battery life"
  ],
  "article": [
    "Puny in stature, but not performance. That’s the plan for any portable projector. Enter Optoma’s latest offering, the Optoma LH200. It’s a compact LED-powered 2,000 lumens model with a 1080p DLP and numerous features designed to aid usability and flexibility.",
    "The headline grabber is an integrated battery that allows mains-free operation. Combine the LH200 with a laptop and you have the possibility of a fairly powerful almost-anywhere projection solution.",
    "Other extras include Bluetooth and optional WiFi connectivity, plus all the broader benefits of LED rather than conventional incandescent lamp tech, which include physical robustness and speed of operation. It looks like a strong overall package, on paper.",
    "In the UK, the LH200 goes for around £875. That’s decent value given the overall feature set, including the integrated battery. In the US, things are a little more complicated. Optoma doesn’t offer the LH200, but instead the LH150.",
    "That’s rated at 1,300 lumens, but the ANSI type. In practice, that translates to the same 2000 perceived LED lumens which Optoma claims for the LH200. The LH150 is otherwise very similar, right down to the integrated battery.",
    "As the 2,000 lumens LED brightness specification implies, the Optoma LH200 is a proper projector rather than one of those tiny, almost pocketable models with very low brightness. Measuring 280 by 192 by 57mm and weighing in at 2.2kg, it is compact and portable and comes complete with a carry case. But it’s also big enough to provide a rich and full viewing experience.",
    "That’s possible thanks to the combination of compact but powerful LED lighting with a 1080 DLP chip. Optoma also claims 200,000:1 contrast and 30,000 hours of lamp operation. What you don’t get, however, is much by way of optical flexibility. The optics are fixed save for manual focus. There’s no optical zoom or lens shift. The throw ratio is 1.2:1, so the Optoma LH200 will generate a large image even in small rooms and spaces. Indeed, it’s not meant to be positioned more than three meters from the projection surface for best results.",
    "If the optics are limited, that’s not the case elsewhere. For starters, the LH200 has an integrated battery, allowing for mains from operation for up to 2.5 hours. The battery can also be used to charge other devices via USB, if required.",
    "Wireless connectivity via WiFi is available optionally, via a USB dongle, and supports mirroring iOS and Android devices via an app. The same functionality is possible via a wired USB connection. The LH200 has Bluetooth, too, enabling the use of Bluetooth speakers.",
    "While we’re talking audio, the LH200 also sports a 3.5mm output jack, which is handy for devices like Amazon FireSticks and Google Chromecasts, which lack dedicated audio outputs. Otherwise, there are two HDMI inputs with which to drive this projector in the more conventional fashion.",
    "All told, it’s clear that significant thought has gone into the Optoma LH200 in order to make it both a strong performer given the size constraints and a flexible and usable portable device, even if we’d prefer to see a little more in terms of optical adjustment.",
    "Firing the LH200 up is a matter of moments. Without the warm-up period of a conventional lamp, this LED projector is running at full brightness in just a few seconds. It’s configured to take you directly to the home screen menu, from which you can switch directly to a preferred source. You can get up and running very quickly.",
    "Overall brightness is reasonable, but subjectively slightly lower than the 2,000 lumens rating implies. As with other LED projectors, the LH200’s 2,000 LED brightness lumens rating is an implied brightness rather than actual brightness. The justification is that the purer light generated by an LED light source is perceived to be brighter than an equivalent incandescent bulb. In other words, the ANSI brightness of a given LED projector is typically lower than its quality ‘LED brightness’ rating. In this case, the ANSI lumens rating would be approximately 1,300.",
    "Whatever, the Optoma LH200 makes a reasonable fist of burning through poor ambient light conditions. But it does lack the punch and vibrancy of larger, permanent installation projector. It’s also worth noting that the brighter of the two lamp settings is almost always required unless ambient light is very well controlled. That’s significant because the integrated battery is only rated for 1.5 hours of operation with the lamp at full brightness.",
    "In other regards, the LH200 is a decent all-round performer. Contrast performance is adequate rather than spectacular. Some darker tones in video playback can look a little washed out and there’s an overall lack of color saturation and vividness. But that’s by the ever-more impressive standards of today’s projection technology. That you wouldn’t choose this projector as a dedicated home cinema source isn’t a major criticism given its portable business projector remit. For the record, noise levels are fairly low, even at full brightness. Fan whine is not a major distraction.",
    "As for setup, the fixed optics obviously reduce your options. You’ll need to position the LH200 precisely if you are to avoid using digital adjustments for the likes of keystone or zoom, settings which do little for image quality. Yes, the LH200 is a compact unit. But a little optical zoom would go a long way in terms of setup flexibility.",
    "Still, the integrated speakers are reasonably loud, if rather thin. They’re useful combined with the battery operation if you’re improvising a temporary projection solution, which is one of the key attractions of this projector. With the battery operation, fast start up times and relative robustness of the LED light source, it’s a projector with which you can improvise almost anywhere, anyplace, anytime.",
    "In absolute terms, the image quality of the Optoma LH200 is merely middling. You wouldn’t pick it as a dedicated home cinema or installation projector. However, the context here is a portable, compact unit with the added twist of battery operation, albeit for a fairly limited period. So, while the image quality isn’t top notch, it will still provide a remarkably good experience for both presentations and video content. Just note that the optics are fixed, which limits options during setup.",
    "Still, the integrated battery means you can use it just about anywhere in a pinch, including away from mains power, while the LED light source makes for a reasonable viewing experience, even where ambient light is poorly controlled. Yes, a significantly brighter projector would be preferable in scenarios with lots of day time light leakage. But to achieve that requires a much larger permanent installation model.",
    "The Optoma LH200’s connectivity features, meanwhile, including smartphone mirroring and optional wireless connectivity add further appeal and flexibility. It’s also a robust unit thanks again to the LED lamp technology, and is rated at fully 30,000 hours. That’s enough to use it a couple of hours a day, 365 days a year for 40 years. An unlikely scenario, but the point is that this is a much less fragile projector than the incandescent-based models of yesteryear. As a compact and flexible unit that gives a decent DLP experience on the move, the LH200 has a lot going for it."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design and features",
    "11": "Performance",
    "17": "Verdict"
  },
  "links": {}
}