{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-s10-lite-full-review",
  "title": "Samsung Galaxy S10 Lite review",
  "category": "phones",
  "updated": "2020-08-26T13:10:06Z",
  "author": "david-nield",
  "summary": "The Samsung Galaxy S10 Lite is a mid-range champ",
  "verdict": "The Samsung Galaxy S10 Lite does a good job in terms of balancing what you want in a phone with what you actually need – Samsung has been smart in cutting out certain features and lowering certain specs to meet what is a very attractive price point.",
  "pros": [
    "Impressive battery life",
    "Appealing overall design",
    "Excellent, large display"
  ],
  "cons": [
    "No optical camera zoom",
    "No next-gen 5G",
    "No high screen refresh rate"
  ],
  "article": [
    "The Samsung Galaxy S10 Lite sits in a very crowded smartphone market – even if you just limit your search for a phone upgrade to Samsung phones released in a single year, there are still enough of them to cause plenty of confusion. This is the 'Lite' or more basic version of 2019's Samsung Galaxy S10, since succeeded by the Galaxy S20 phones and the Galaxy Note 20 phones already launched in 2020... keeping up so far?",
    "Samsung has pulled this Lite trick before, primarily with the Galaxy Note 10 Lite. It lets the tech giant cover even more price points with more affordable versions of its flagship phones that cut a few corners in terms of specs, features, and design flourishes. If the S10 or S20 are a bit too rich for your blood, then consider the Galaxy S10 Lite.",
    "The phone poses a question that's never been more pertinent – do you need to pay premium prices for flagship smartphones? The mid-rangers now available, including the S10 Lite, offer almost as much quality for a significantly lower price, and for a lot of consumers, that compromise is one that they're willing to make.",
    "If you can live without features that are top-tier but arguably unnecessary – 5G, a high screen refresh rate, waterproofing, wireless charging, optical zoom on the camera – then you can save yourself a chunk of cash by getting the Samsung Galaxy S10 Lite instead of one of the more expensive phones in Samsung's range.",
    "You still get the premium build and design quality, you still get a gorgeous AMOLED screen, you still get a camera that's capable of taking some very decent pictures, you still get plenty of battery life between charges, and you still get stacks of performance – albeit from 2019's best processor, not 2020's. We think the Galaxy S10 Lite is an excellent value-for-money proposition, one that will appeal more than the S20s and Note 20s of this world to a lot of people.",
    "The Samsung Galaxy S10 Lite is available now – SIM-free and without a contract you can get the phone for $649.99 / £499 (around AU$910) at the time of writing, though check the widgets on this page for the latest online deals. As yet there has been no indication that the phone will be launching in Australia.",
    "That puts it in a very similar price bracket to the Galaxy S10e, which you might want to consider if you need something that's a little more pocket-friendly. The phone is also widely available on contract from the usual retailers.",
    "Samsung has years of experience pushing out premium phones, so the S10 Lite is as polished and as refined as you would expect – this is a good-looking phone alright, while not quite reaching the level of polish of the Galaxy S20 or Note 20 handsets (or even the original Galaxy S10 phone).",
    "The display has been flattened off, though it still impresses – you've got a spacious 6.7-inch, 1080 x 2400 pixel, 20:9 aspect ratio AMOLED display here, with HDR10+ support. In fact some people will prefer the flatter display, where the screen isn't overflowing around the edges of the phone. The screen size makes this a relatively big device, but not unusually so for 2020.",
    "Though this is a more affordable flagship phone from Samsung, the price-cutting doesn't really show through in the design of the Galaxy S10 Lite – it feels premium and well-built when you pick it up, nicely judged curves are everywhere, and we really like the shimmering, rainbow-effect on the back of the Prism White model we reviewed (Prism Black and Prism Blue are your other options).",
    "Plastic is used on the back instead of glass, and there's no IP68 protection against water and dust, but otherwise there's little to choose between this and the top-tier handsets.",
    "There's a power button on the right, which doubles as a launch button for Bixby if you want it to, and the volume controls are just above that. At the bottom you've got your USB-C port and your single speaker, and Samsung has gone for an in-screen fingerprint sensor here, so the overall aesthetics of the phone are very clean and elegant.",
    "In terms of appearance, the Samsung Galaxy S10 Lite can definitely hold its own with more expensive Samsung flagships and the phones that OnePlus has put out during 2020. It oozes much more class than phones like the iPhone SE 2020 or the Google Pixel 4a, so you are getting a step up in design quality over those mid-rangers for a little extra money.",
    "We've already referenced the 6.7-inch AMOLED display on the Samsung Galaxy S10 Lite – you get a 1080 x 2400 pixel resolution, which works out as a 20:9 aspect ratio and a 394 pixels-per-inch density – bigger than the Galaxy S10 and the Galaxy S10 Plus, but not quite as sharp (not that you can really tell, even at this extended size).",
    "In use, it's hard to find any major fault with the Galaxy S10 Lite display: from Netflix to photos, from browsing phone reviews on TechRadar to touring around cities on Google Maps, everything is clear and sharp. The deep blacks and bright colors you get with an OLED display are in evidence here, as you would expect given Samsung's long history with the technology.",
    "Gaming looks particularly good on the S10 Lite, with fast action managed well and minimal ghosting. Outdoor viewing is fine as well, and so are viewing angles, so the display is really a case of the S10 Lite not matching the very best flagship phones in terms of raw specs, but offering a very good screen nevertheless.",
    "The usual display tweaks added by Samsung's OneUI software are available here as well, so you can switch between a natural and a more vivid color temperature, and even adjust the warmth of the colors manually via an on-screen slider if you need to. There's also a blue light filter that you can use to reduce the strain on your eyes late at night.",
    "Samsung doesn't mention the refresh rate, so we're assuming it's the standard 60Hz rather than the 90Hz or 120Hz popping up on the newest high-end phones. Like the pixel density though, it's not something you're really going to notice too much, unless you happen to be downgrading from something with a super-smooth display attached.",
    "At this stage in the evolution of the smartphone we're talking about small differences between camera quality on the best mid-range and top-tier phones – anything you pick up that's not a low-end budget phone is going to be able to take decent photos for you, and the Galaxy S10 Lite is no exception.",
    "As far as the camera specs go, the Galaxy S10 Lite comes with a 48MP wide + 12MP ultrawide + 5MP macro triple-lens rear camera, and a 32MP wide single-lens camera on the front (which is a lot more pixels than you normally get for a selfie cam). Perhaps the biggest miss is no optical zoom, but that's not common for phones at this price point.",
    "The ultrawide lens comes in useful of course, for cramming more into a scene, and it manages to work its magic without distorting the angles or the colors in the picture. Samsung's camera app does a little bit of automatic tweaking and enhancing in the background, and on the whole we found that this worked very well.",
    "Overall, this is a very impressive camera. Edges are sharp, colors are bright, and the HDR processing works well (so plenty of detail is retained in the darkest and lightest areas of a picture). The colors are maybe just a little oversaturated compared with the best phone cameras we've seen, but it's not a huge deal and you wouldn't really notice it if you weren't comparing pictures side by side.",
    "In other words, you can get some really nice snaps from the Samsung Galaxy S10 Lite. Shutter speed and focus are fast, and everything from landscapes to close-ups comes out well (the macro lens no doubt helps with those close-ups). These pictures are more than good enough for social media and stand up to detailed scrutiny.",
    "Low light photos are pretty good, but no more than that – you'll get respectable results most of the time, though the less light there is the worse the photos get in terms of muddiness and blurring. There's a night mode here, which takes a bit longer to capture a photo: it does a decent job of brightening up certain areas, but pictures can get noisy (and scenes tend to end up looking unnaturally bright, as with the Pixel Night Sight mode).",
    "In summary, the Galaxy S10 Lite doesn't have the best phone camera on the market, but it does a very respectable job nevertheless – and in good lighting it's hard to distinguish the photos this phone takes from the ones captured by the much more expensive flagships.",
    "Under the hood of the Samsung Galaxy S10 Lite we find ourselves with the Snapdragon 855 processor (the best in the business for Android phones only a year ago), 8GB of RAM, and 128GB of storage (which you can expand via a microSD card). Not at the very cutting edge of phone specs in 2020 then, but not far behind – there's certainly enough power here for most people to be getting on with.",
    "You don't get 5G on this phone, which is another way you can tell it's not a premium-level flagship, but we don't think that's a huge problem. While the next-gen connectivity is now in many major cities, chances are you're not going to be using it all that much – and 4G speeds should do you just fine for the next few years. By the time that 5G is a must-have on a phone, it'll be time to upgrade.",
    "Bear in mind that the components inside the Galaxy S10 Lite would have counted as flagship specs in 2019, so you're really getting plenty of performance for your money, and that's backed up with Geekbench results: 717 for single core, 2521 for multi core, and 2411 for OpenCL. That puts it right up with the S10 and Note 10 phones from 2019 in terms of raw power, as you would expect.",
    "Phone performance isn't all about synthetic benchmarks though of course, and in general use the Galaxy S10 Lite zips along. Even the most demanding apps and dozens of open web tabs aren't able to slow this phone down, and we didn't notice any problems with the handset getting hot under heavy use either. Games load quickly and are fluid to play, even when there's a lot happening on the screen at once.",
    "Jumping between apps, switching camera modes, scrolling through social media at breakneck speeds... the Galaxy S10 Lite handles it all with aplomb, and we didn't notice any stuttering or lag in our time with the phone. Fair enough, something with even higher specs is going to last you longer before it starts slowing down and showing signs of age, but for now this handset gives you all the performance you're likely to need.",
    "This is of course one of the reasons that mid-range phones like the S10 Lite are having a moment – slightly older, slightly inferior components are still able to keep a modern-day phone whizzing along, so it begs the question why you would pay flagship prices for something that's only slightly more powerful.",
    "There's no wireless charging here, but you do get 45W fast charging (more on the battery shortly). There's also Android 10 on board, with Samsung's OneUI on top – it's not our favorite Android variation, but it's better than it used to be, and it's certainly packed with features and customization options. There are a few too many Samsung apps hanging around for our liking, but you might be a big fan of them (and Android being Android, you can hide them easily enough).",
    "Battery life is always a hard call to make, what with review units all having brand new batteries inside and everyone's phone usage being different, but we can at least pass on our experiences with the S10 Lite. In short, we were very impressed – we found plenty left in the tank at the end of each day, sometimes as much as 40-50%, which augurs well for healthy battery performance into the future.",
    "A lot of factors play into battery life of course, but in terms of the phone specification there's a 4,500 mAh capacity battery inside the Samsung Galaxy S10 Lite – that matches up with the same capacity in the Samsung Galaxy S20 Plus, and it's bigger than average (handy when you've got a 6.7-inch display to keep running, though the lower 1080p resolution helps with power draw).",
    "In our two-hour video streaming test at full brightness and a reasonable volume we saw the battery drop from 100 percent to 86 percent, which is a very decent score – it equates to around 14 hours of movie watching between charges, so you'll have no problems on long plane or train journeys if you've got some shows to watch.",
    "Dial the brightness down and you can probably squeeze more battery life out of the Galaxy S10 Lite, though by the same token if you're using the GPS for navigating all the time or doing a lot of gaming you won't get the same number of hours. Assuming that most people have their phones tucked away most of the time, the S10 Lite shouldn't have any trouble getting from the start of the day to the end (and then some).",
    "First reviewed: August 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Samsung Galaxy S10 Lite price and availability",
    "7": "Design",
    "13": "Display",
    "18": "Camera",
    "25": "Specs and performance",
    "32": "Battery life",
    "36": "Don't buy it if..."
  },
  "links": {
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy Note 10 Lite": "https://www.techradar.com/reviews/galaxy-note-10-lite-review",
    "Galaxy S10e": "https://www.techradar.com/reviews/samsung-galaxy-s10e",
    "OnePlus has put out": "https://www.techradar.com/reviews/oneplus-8-pro",
    "iPhone SE 2020": "https://www.techradar.com/reviews/iphone-se",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review"
  }
}