{
  "source": "https://www.techradar.com/reviews/transcribe-by-wreally",
  "title": "Transcribe by Wreally review",
  "category": "computing",
  "updated": "2020-08-06T13:43:07Z",
  "author": "mark-pickavance",
  "summary": "A fast and very accurate online transcribing service",
  "verdict": "A deceptively simple and effective tool that can automatically transcribe audio or video, or help with dictation all via a basic web interface. The cost of processing isn’t low, but volume reductions are available for heavy users.",
  "pros": [
    "Lots of languages",
    "Easy to use",
    "Accurate",
    "Free trial"
  ],
  "cons": [
    "Costly without volume pricing"
  ],
  "article": [
    "Getting computers to understand people isn’t easy, and given how easily confusion exists between humans speaking the same language, this shouldn’t surprise us.",
    "But transcribing a conversation for those that do this as part of their job is difficult and tiring work, and any help they can get is appreciated.",
    "Wreally Transcribe offers both a refined solution for self-transcribing and automatic conversion of existing digital recordings.",
    "Is it worth the ongoing costs of licensing and processing, and could it save significant amounts of time and effect?",
    "There are various approaches to cost that transcribing services take, and Wreally takes the view that you should pay to access the service and also for the processing of recordings that you make.",
    "A year’s access to the service costs $20, and each hour of transcription times costs $6. Therefore, your minimum investment will be $26 to use the service and have a recording transcribed.",
    "A group license is available, but there aren’t any cost savings in choosing this option. Each user still pays $20 to use the service, and each hour is still $6. The advantage is that all the transcribing time is pooled, avoiding a situation where multiple people each have a few minutes of unused transcription credit.",
    "For those that only intend to use the self-transcription option, the solution costs $20 per year to use, irrespective of individual or group licensing.",
    "Volume licensing is available for more than 50 users or 100 hours of credit, should you have those needs.",
    "A free trial is available that allows you to experience automatic and manual transcribing for a short period.",
    "As websites go, the Transcribe portal is very simple indeed, and some might see it as being unsophisticated.",
    "But, having it look pretty or work efficiently over a poor link to a remote country where a journalist might be working, the latter is probably more important.",
    "On selecting Transcribe from the top menu, you have two options; New automatic transcription and New self transcription.",
    "We’ll cover each of these sections in detail later, but you also have listed below the existing transcriptions, with a small logo to identify how they got created.",
    "From here you can delete old transcriptions or start a fresh one.",
    "Our only reservation about this page is that if you have lots of transcriptions, some management might be required here that doesn’t currently exist.",
    "In our testing, we first tried the automatic mode since we had some credit available for this process.",
    "As the name infers, this takes an existing audio file and converts it into text.",
    "To use this facility the user must be connected to the internet and a language selected from the large number supported.",
    "Currently, Wreally has 20 languages that it supports, although some are variations on one language, like the regional versions of French, Spanish and Portuguese. Besides, another seventeen languages are classified as ‘Experimental’, and this list includes Russian, three types of Mandarin, Cantonese, Japanese and two flavours of Arabic.",
    "Once you have chosen a language, you can apply various options that insert timecodes in the contents, trim the audio and even identify different speakers in a conversation.",
    "The final part of the process is uploading the audio, and a wide range of audio formats are available including mp3, wma, wmv, flac, m4a, mp4, wav, ogg, amr, aiff, aif, caf, mov, 3gp, aac and dss. You are advised that wav format provides the best quality sound, but the files sizes are significantly bigger than mp3 for example.",
    "With these requirements completed and sufficient credit on the account, Transcribe will process the sound into text, usually within a few minutes.",
    "The limitations are that the file can be a maximum of 2000 MB or and audio duration of five hours, although it is relatively easy to split up a very long recording into smaller chunks.",
    "Once the processing is completed, the transcription appears on the Transcription page, and you can review what it made of the audio file.",
    "Generally, we found it worked very well, and it even capitalised words that were used with emphasis by the speaker. There is also a subtitling option, for those that quickly need to create subtitles for videos.",
    "We gave it, as an example, a recording of the famous words of Martin Luther King, Jr. at the Lincoln Memorial and it transcribe those flawlessly.",
    "This mode does what most people need from a transcribing service, so why you might wonder would you want to use the self transcription option?",
    "With such a good automatic system, other than avoiding the charges, what is the purpose of self transcribing?",
    "It could be argued that this job could be achieved with a media player and a word processor, but the Wreally solution does have some useful aspects that might make it worthwhile to use.",
    "The first of these is that playback of the audio can be controlled with a foot pedal, leaving the hands entirely free to enter the words, and speeding up the whole process.",
    "But, if the purpose is to input spoken content, this tool also allows for direct dictation using a microphone. And, even if it’s a webpage, it will work without a live internet connection assuming you logged in when you had one.",
    "That makes it much more useful than it initially appeared, and you can have the use of this for just $20 per annum from any computer without any additional expense.",
    "The languages that the dictation mode supports are greater than the automatic processing, and none of them is considered ‘experimental’. Currently, 37 are listed, including four versions of English that includes that spoken by Americans, in the UK, India and Australia.",
    "As with the automatic mode, you can have timecode inserted into the document, and you can also have initials expanded into full names if you provide the mapping.",
    "Depending on the nature of the transcribing job, the sensitivity of the recording and its processed text might be a security concern for some.",
    "One interesting security aspect of Transcribe is that all the data doesn’t flow to the cloud in this service during self-transcribing. And, because of that, those transcriptions on an account are only accessible from the computer they were created.",
    "That method is by design, although it isn’t also true of automatic conversions, where the sound data and processed text are held in the cloud by necessity.",
    "But even if that scenario uploaded audio or video is deleted after five hours once it has been processed, and the transcript created can be deleted by the user.",
    "It might look a little dated from the outside, but Wreally has put the effort it where it counts in Transcribe.",
    "They claim a 90% accuracy for automatic transcription. In our tests, it performed better than that level if the source recording was of reasonable quality.",
    "Being able to dictate directly the more challenging or audibly obscured parts of a recording allows the processing of long speeches relatively painlessly.",
    "A large number of languages supported, custom dictionaries, timecode insertion and being able to selectively trim the audio inside the interface are all great features.",
    "And, new ones, like identifying a speaker, or some of the experimental languages demonstrate that this product is likely to be significantly enhanced in the future.",
    "We were especially impressed with the self transcribing tool, as it provided an ideal platform for that that are taking parts of an existing recording and then augmenting that with their own thoughts and comments.",
    "Overall, for those who perform interviews and need those transcribed for future reference, Transcribe by Wreally is an effective and flexible option that doesn’t require a software install."
  ],
  "headers": {
    "4": "Plans and pricing",
    "10": "Design",
    "17": "Automatic transcription",
    "28": "Self transcription",
    "35": "Security",
    "39": "Final verdict"
  },
  "links": {}
}