{
  "source": "https://www.techradar.com/reviews/xbox-one-s-all-digital-edition",
  "title": "Xbox One S All-Digital Edition review",
  "category": "gaming",
  "updated": "2020-11-05T15:43:16Z",
  "author": "vic-hood",
  "summary": "Xbox One S All-Digital drops the discs",
  "verdict": "The Xbox One S All-Digital looks and performs like its predecessor – minus the disc drive. It's more convenient for those who are happy to do away with physical discs, offering plenty of space for digital downloads, but struggles to live up to its price tag.",
  "pros": [
    "1TB hard drive",
    "Three games included",
    "More convenient",
    "4K & HDR streaming"
  ],
  "cons": [
    "Price tag isn't justifiable",
    "Not for those who prefer discs",
    "Looks the same as the Xbox One S"
  ],
  "article": [
    "The Xbox One S All-Digital was Microsoft's first disc-less console, and represented a grand experiment into the future of how we consume film, TV, entertainment and games. We're using past tense there because, as of July 16 2020, Microsoft will no longer be producing new Xbox One S All-Digital or Xbox One X consoles as it ramps up production for the upcoming Xbox Series X and Xbox Series S.",
    "That said, although it's not in production, we expect the Xbox One S All-Digital will linger awhile on store shelves, so we've left our review up to help anyone who's still on the fence about buying Microsoft's uber-cheap disc-less console.",
    "It's so much cheaper because, rather than trying to compete with Microsoft's more powerful Xbox One X, the Xbox One S All-Digital is essentially a streamlined alternative to the Xbox One S. As far as their design, performance and game libraries are concerned, the One S and the All-Digital are practically the same consoles. The main difference between them is that the All-Digital model doesn't have a disc-drive and can't, therefore, play games or movies from physical discs.",
    "If you're the kind of person who enjoys looking through their physical game collection to pick their next adventure or simply reminisce, then the All-Digital's minimalist approach probably won't suit you. If, however, you're looking to drop physical media from your life to go down a simpler—and potentially more convenient—route then it could hold some appeal. Before you make your final decision, let our review take you through the pros and cons that ought to be considered before you invest in Microsoft's all-digital offering.",
    "Want to know whether to pick up an Xbox Series S instead? Check out our guide to Xbox One S vs Xbox Series S.",
    "Black Friday deals are coming at the end of November followed shortly thereafter by Cyber Monday, meaning we're likely to see some deals on the Xbox One S All-Digital Edition.",
    "With the Xbox Series X and Xbox Series S due to release in November, Microsoft announced in July that it was discontinuing the Xbox One S All-Digital Edition. That means that expecting to see big discounts on what stock is left of the All Digital, as retailers look to shift their stock.",
    "While it's worth taking into account that this is a discontinued console, and Microsoft won't be producing anymore, the All Digital will still play current and upcoming Xbox One games. So, if you're not particularly fussed about having the newest hardware and games - and don't mind a lack of disc drive - then it could still be worth picking one up while you can.",
    "However, it's worth considering that the more powerful (and still digital) Xbox Series S may be better value for money if you're willing to pay a bit extra. Priced at $299.99 / £249.99 / AU$499, the Series S isn't as powerful as the Series X but will at least allow you to play next-gen titles as well as current-gen - but for a more affordable price tag.",
    "While the Series S is unlikely to be on sale in the coming months, Black Friday and Cyber Monday are likely going to be the best time of the year to grab the Xbox One S All-Digital Edition at a discount.",
    "We’ll be showcasing the best Xbox One S All-Digital Edition Black Friday deals and Cyber Monday deals on TechRadar.",
    "The Xbox One S All-Digital Edition's design is the exact same as that of the Xbox One S - except it doesn't have a disc-drive.",
    "The sleek console is conveniently compact, measuring just 11.6 x 8.9 x 2.5 inches (L x W x D) despite its 1TB hard drive and lack of power supply pack. That makes it just a few inches smaller than the Xbox One S.",
    "There is one physical button for power on the face of the console as well as a USB 3.0. Around the back, you'll find an HDMI In port that allows you to pass in a cable box, an HDMI Out, two USB 3.0s, and S/PDIF and Ethernet ports. There's an IR blaster on the front of the console that allows you to turn on other devices, like your TV, audio/video receiver, and cable/satellite box.",
    "However if you like your consoles in loud color schemes – or anything other than white – you're out of luck. Like the Xbox One S, Microsoft's Xbox Design Lab program only allows you to to customize the color of your controllers, so when it comes to the console itself you're limited to white.",
    "Again like the Xbox One S, the All-Digital boasts 4K resolution - but that's upscaled 4K, not native 4K like the Xbox One X. You'll notice a few more details with the latter, but the former still proves pretty capable here.",
    "For example, while playing Forza Horizon 3, we had no issue with dropped frames interrupting our experience, but there's no doubt the game looks better - and runs smoother - on the X.",
    "So far, Netflix, Amazon Video, YouTube and US-exclusives Vudu and Hulu all have 4K versions of their apps available on the Xbox One Store, which should cover most of your streaming needs - and you'll need it without the built-in Blu-ray player.",
    "We had no issue with the All-Digital when it came to streaming shows, downloading games/apps or general functionality. The console doesn't take up much room and doesn't sound like an air plane taking off when its running, while the 1TB hard drive allows you to download plenty of games (but we'll get to that a bit later).",
    "Here's where the Xbox One S All-Digital Edition will divide players. As the console doesn't have a disc-drive, you can't use physical games with it – at all.",
    "So what are your options? For a start, the console comes with three digital codes: Forza Horizon 3, Sea of Thieves and Minecraft. While getting three games straight off the bat is great, arguably Microsoft could have included some newer titles - maybe Forza Horizon 4 instead of 3, for example. Still, Minecraft and Sea of Thieves are still quite popular and all games are family friendly.",
    "Outside of these three games, you can either buy digital versions of Xbox games from the Microsoft Store or take advantage of Xbox Game Pass. We found the Xbox One S All-Digital to be a great companion for Game Pass, with plenty of room to download titles at your will from the services library of over 200 games - including old and new.",
    "Even better, for the last month, Microsoft has been running a deal which gives you one month of the new Xbox Game Pass Ultimate service for $1 / £1 instead of the standard $14.99 / £10.99.",
    "When the Xbox One S arrived three years on from the original Xbox One, it offered smaller, quieter, higher-quality gaming machine. It soon became the de facto Xbox system. But since then we've seen the release of the powerhouse Xbox One X console, which offers 4K HDR gaming and the most premium gaming experience on a console (until the release of Xbox Series X next year).",
    "The release of the Xbox One X raised the bar for gaming consoles and while it didn't make the Xbox One S necessarily redundant, it certainly highlighted the aged system of the Xbox One S.",
    "That's why it's surprising that Microsoft has chosen to release a disc-less version of the S, which is essentially the same console but without a disc drive. The look is the same, the performance is the same and there's nothing that particularly makes it stand out from the pack. The draw of the original S is that it provides a cheaper Xbox alternative to the X and works for those who don't necessary have a 4K compatible screen. However, the All-Digital takes the same console and makes it a tad simpler.",
    "For those who love the idea of disc-less gaming then the All-Digital may be prove appealing, but the issue we had was with the price. While Microsoft is claiming the All-Digital ($249 / £199) is cheaper than the Xbox One S ($299 MSRP / £249 RRP), in reality you can pick up an Xbox One S bundle for around the same price from certain retailers.",
    "For example, at the time of writing, over on our Xbox One deals (UK) page you could pick up a purple 1TB Xbox One S bundled with Fortnite DLC, Tekken 7 and Project Cars 2 for just £209 at Currys. And it's not a rare sight to see the console on its own go for around £190. Over on the Xbox One deals (USA) guide you'll find highlights from just $199 including either Minecraft or Battlefield V."
  ],
  "headers": {
    "5": "Xbox One S All-Digital Edition on Black Friday and Cyber Monday",
    "11": "Xbox One S All-Digital Edition: design",
    "15": "Xbox One S All-Digital Edition: performance",
    "19": "Xbox One S All-Digital Edition: game library",
    "23": "Final verdict"
  },
  "links": {
    "no longer be producing": "https://www.techradar.com/news/xbox-one-x-discontinued-ahead-of-xbox-series-x-release-reports-claim",
    "Xbox One X": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox One S vs Xbox Series S": "https://www.techradar.com/news/xbox-series-s-vs-xbox-one-s-the-cheapest-xbox-consoles-compared",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Amazon Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "Xbox Game Pass Ultimate service": "https://www.techradar.com/news/xbox-game-pass-ultimate-is-now-available",
    "Xbox One deals (UK) page": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "£209 at Currys": "https://www.awin1.com/awclick.php?awinmid=1599&awinaffid=103504&clickref=trd-us-1430548445347001300&p=https%3A%2F%2Fwww.currys.co.uk%2Fgbuk%2Flisting%2F430_3959_31710_xx_xx%2Fxx-criteria.html",
    "Xbox One deals (USA) guide": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales"
  }
}