{
  "source": "https://www.techradar.com/reviews/credit-karma-tax",
  "title": "Credit Karma Tax review",
  "category": "computing",
  "updated": "2020-09-17T12:20:13Z",
  "author": "rob-clymo",
  "summary": "Use Credit Karma Tax to file without any pricey overheads",
  "verdict": "While the free-to-use aspect of Credit Karma Tax is appealing you'll need to register for a Credit Karma account and people filing more complex tax affairs might want to look farther afield.",
  "pros": [
    "No charge",
    "Easy enough to use",
    "Simple layout",
    "Reasonable built-in support"
  ],
  "cons": [
    "You’ll need a Credit Karma account",
    "Navigation can catch you out",
    "No multiple state feature",
    "Weak for investors and real estate filers"
  ],
  "article": [
    "Credit Karma will most likely be a familiar name in the world of tax software as it’s been around for a number of years now, most notably supplying free credit scores. Its range of services now includes Credit Karma Tax, which is another online service for filing personal taxes. It's essentially up against the likes of TaxAct, TaxSlayer, Jackson Hewitt Online, Credit Karma Tax and FreeTaxUSA.",
    "One of the most appealing aspects of Credit Karma Tax is that it’s free to use, although the trade-off to that is the fact you’ll need to sign up for a Credit Karma account. If you’ve already got an account with them though it’s even easier to get started with the step-by-step filing process.",
    "As we pointed out, Credit Karma Tax is a free-to-use online system, which on that basis alone makes it seem like a very good idea. That said, some might not like the idea of having to sign up for a Credit Karma account, which is a stipulation before you can use the system.",
    "If you’re already using Credit Karma though then this makes the process even more straightforward. What’s more, Credit Karma Tax can help you file both Federal and State taxes and if you’re just starting out down the tax filing highway, aren’t self-employed and don't have things like rent from property to factor in then it's a pretty sweet option.",
    "Credit Karma Tax doesn’t do anything particularly innovative but much of that is down to the nature of the online filing service. Preparing to file your taxes is a dry subject at the best of times, so what you get with the Credit Karma Tax interface is a by-numbers exercise in digital form filling. That’s not to talk down the user experience as it features all of the tools and functionality you’d expect.",
    "Credit Karma Tax is much like any of the other online filing services in that it uses a series of progressive screens to take you though the different aspects of filing your states. Thankfully, Credit Karma Tax keeps things minimalistic in terms of layouts, with not much in the way of graphics. This means that once you get into your stride you can pick through the pages in a quite erudite fashion.",
    "The feel is similar to the way you work through your 1040, effectively allowing you to tick off things in a logical order. Performance, both your own and Credit Karma Tax itself does falter a bit if you start trying to dart around as it’s not very forgiving in that respect. Credit Karma Tax is therefore best tackled in page-by-page orderly fashion.",
    "As it’s a step-by-step design, the interface of Credit Karma Tax is really pretty straightforward to work through, even if you’re less than confident at filing your taxes. Once you’ve selected the Start option you're on your way, plus there’s a handy search function within the pages that lets you track down answers to queries along the route.",
    "As is the case with other products in this arena, Credit Karma Tax can handle imported W-2 forms. There are one or two negatives though, with some forms not being supported, which is worth investigating before you sign up. And, if you’ve moved from one state to another in a tax year then you might be best looking farther afield.",
    "Along with help from within the interface itself, including some natty information bubbles that offer quick tips, Credit Karma Tax also benefits from the addition of support staff who are also on hand to help get you out of tricky tax spots. There’s a beefy tax support center too, which delves even more comprehensively into areas that might otherwise have you feeling a little stumped.",
    "All in all, Credit Karma Tax leaves you with the feeling that you’ve got a pretty good handle on things, which is always a bonus with such a crucial process as filing state and federal returns.",
    "Credit Karma Tax is evolving nicely with each successive incarnation. If you have fairly simplistic tax affairs then the free-to-use aspect of this online service is very appealing. There have been improvements to the help side of things too, with plenty to assist you in steering a correct course come tax filing time.",
    "There’s no dedicated app edition of this package, but you do get an optimized version of the site for your phone or tablet, which can be handy if you're not always ready or able to tackle your tax affairs on a desktop machine.",
    "While it’s not got an exhaustive range of features, with some crucial tax forms not being supported for example, Credit Karma Tax is great for anyone with less complex filing arrangements to prepare."
  ],
  "headers": {
    "2": "Pricing",
    "4": "Features",
    "5": "Performance",
    "7": "Ease of use",
    "9": "Support",
    "11": "Final verdict"
  },
  "links": {
    "Credit Karma": "https://credit-karma-tax.pxf.io/c/221109/537307/9112?subId1=trd-us-6912943739636478000&sharedId=trd-us&u=https%3A%2F%2Fwww.creditkarma.com%2Ftax",
    "tax software": "https://www.techradar.com/best/best-tax-software",
    "TaxAct": "https://www.techradar.com/reviews/taxact",
    "TaxSlayer": "https://www.techradar.com/reviews/taxslayer",
    "Jackson Hewitt Online": "https://www.techradar.com/reviews/jackson-hewitt-online",
    "Credit Karma Tax": "https://credit-karma-tax.pxf.io/c/221109/537307/9112?subId1=trd-us-1041357393421034500&sharedId=trd-us&u=https%3A%2F%2Fwww.creditkarma.com%2Ftax",
    "FreeTaxUSA": "https://www.techradar.com/reviews/freetaxusa",
    "filing process": "https://www.techradar.com/best/small-business-tax-software",
    "tax affairs": "https://www.techradar.com/how-to/online-accounting-tools-for-sole-proprietors",
    "tax filing": "https://www.techradar.com/best/best-tax-software"
  }
}