{
  "source": "https://www.techradar.com/reviews/stash",
  "title": "Stash review",
  "category": "computing",
  "updated": "2020-04-15T10:33:12Z",
  "author": "jitendra-soni",
  "summary": "Making investment available for starters",
  "verdict": "Handholds new investors to help them start investing but may turn out to be slightly costly",
  "pros": [
    "Best-in-class support",
    "Option to buy fractional shares",
    "Educational content lets you learn the nuances of investment",
    "Curated investment options"
  ],
  "cons": [
    "The high ETF expense ratio may be a little difficult",
    "Expensive pricing for plans"
  ],
  "article": [
    "Stash is an excellent option for those interested in micro-investing. It lets you buy a fraction of a stock, which should be an exciting opportunity in itself. Imagine you want to buy a share of Walmart, which would need you t shell out $1000 or so, and you do not have that sort of solid financial strength. No worries, with Stash, you can buy a fraction of that share.",
    "Stash is aimed at making investment approachable for the beginners. It can be an excellent option for those of you who do not have enough money to make huge investments or do not really know what to invest in. It, in essence, acts as a hand holder to help you gain entry into the world of investments.",
    "Stash is an investment app and helps you select investments quickly and easily for beginners to investments. It was founded in 2015 and was aimed at simplifying the task of investing in multiple portfolios. Most of us find investing an intimidating and expensive option to grow wealth.",
    "Stash lets you sign up for free, and enables you to choose investment options rather quickly. It follows the concept of robo-advisers, where you have no human investment advisers and lets you begin investing by building a portfolio. However, in sharp contrast to other robo-adviser services, it does not manage your accounts by itself but suggests you the ways to achieve it. From that perspective, it isn’t actually a robo-adviser in the real sense of the word.",
    "Once you've installed the app, you will be asked a few questions to analyze the kind of investor you are. Are you a traditional investor or an aggressive one who does not fear taking risks? You will then need to connect your checking account to fund your investments. Do note that Stash does not accept any other forms of investment funding.",
    "After you have set up your details and linked the checking account, you will be presented with the recommended ETFs you can invest in. The investment options you are suggested would be in tune with the answers you provided during the initial setup.",
    "It will offer you the list of ETFs and individual stocks in an easy to read format. You will have access to every detail related to the stock:",
    "Some of the features that Stash offers includes:",
    "The Stash online platform works in an efficient manner with a mobile device as well. Of course, you do not have access to real-time updates. However, it is a fully featured app and does everything you would do with the online platform.",
    "The customer support is also good enough. You will get access to a phone, and email support Monday to Friday between 8.30 am to 6.30 pm. The support channels will work even on weekends (Saturday and Sunday) between 11 am to 5 pm.",
    "Stash offers you three plans to choose from. In sharp contrast to the earlier AUM fee structure, the platform has now moved to a flat fee structure.",
    "The plans are competitive enough when compared to Acorns, but tend to be a little more expensive.",
    "If you are new to stock investing and are looking for an app to handhold you into learning the tricks of the trade, Stash could be a useful option for you. The educational resources offered by the platform would make it a great choice and assist you in making money-saving moves going forward.",
    "The concept of fractional shares is what should help you make a beginning in the concept of diversifying with little money. Of course, once you have gained enough knowledge in the investment arena, you can then move ahead to make your own plan."
  ],
  "headers": {
    "2": "What does Stash do?",
    "4": "How does it work?",
    "7": "Features",
    "10": "How much does it cost?",
    "12": "Final verdict"
  },
  "links": {
    "Stash": "https://track.flexlinkspro.com/a.ashx?foid=4243.142843694.I5199428&foc=2&fot=9999&fos=1&fobs=trd-us-5632730170565159000&url=https%3A%2F%2Fwww.stashinvest.com%2F"
  }
}