{
  "source": "https://www.techradar.com/reviews/powerarchiver",
  "title": "PowerArchiver review",
  "category": "computing",
  "updated": "2020-09-18T09:22:25Z",
  "author": "binay-gupta",
  "summary": "Feature-rich file compression utility which provides tight security",
  "verdict": "PowerArchiver is a feature-rich yet easy-to-use file compression utility, catering for all users up to the enterprise level. The free trial version, which lets you take the package for a 40-day spin, is also a welcome bonus.",
  "pros": [
    "Streamlined and intuitive interface",
    "Supports more than 60 file formats",
    "Good on the security front",
    "Quality support"
  ],
  "cons": [
    "Batch compression issues"
  ],
  "article": [
    "PowerArchiver is a robust and versatile compression utility for Windows which has been around for over two decades. It initially launched as a piece of freeware, although it soon became shareware. The app’s early name was EasyZip, but it was relaunched in 2018 with the addition of several advanced features. It supports Windows 7, 8, and 10.",
    "PowerArchiver benefits from an intuitive interface, which users will quickly become familiar with – and the good news is there’s help on hand in the form of detailed tutorials in case you run into any issues with the program.",
    "This file compression app supports a large range of formats – over 60 in fact, which includes TAR, 7z, ZIPX, ZIP, ISO, RAR, OpenPGP, and others. It is speedy when extracting files, and make things easy for the user working via a right-click context menu.",
    "On the security front, PowerArchiver can encrypt, decrypt, and verify files in several OpenPGP and AES formats. It is designed based on FIPS 140-2-validated 256-bit AES encryption technology.",
    "Exactly what features you get will depend on which version of PowerArchiver you purchase. There are four different products: PowerArchiver 2019 Standard, PowerArchiver 2019 Toolbox, and PowerArchiver 2019 Professional, as well as an enterprise suite (and note also that there’s a trial version which is free to use for 40 days).",
    "PowerArchiver 2019 Standard comes with a New Advanced Codec Pack that provides enhanced compression. Both International and English-only versions are currently available at $22.95 for one license.",
    "PowerArchiver 2019 Toolbox comes as a bundled package of various utilities like Full PowerArchiver Burner (burns data, audio, ISO and more), and a Secure FTP client with FIPS 140-2 validation and smart archive-handling features. Both International and English-only versions are currently available at $49.95 for one license.",
    "PowerArchiver 2019 Professional is an advanced power-packed edition including all the features of PowerArchiver Standard with Enterprise-grade backup features. It also has an Encryption Suite boasting FIPS 140-2 technology. Both International and English-only versions are priced at $34.95 for one license.",
    "PowerArchiver Enterprise Edition is available as unlimited Gold, Silver, and Platinum plans with many enhanced enterprise features. Both English-only and multilingual versions cost $4,995 each.",
    "All users get the benefit of a batch compression feature, the ability to convert or join together archive files, as well as customizable compression profiles. The app uses very little memory, and can be further customized on a visual level with different skins.",
    "However, one fly in the ointment is that batch compression can be problematic when working with over 100 files in a batch.",
    "PowerArchiver packages also get you a free 12 months of PowerArchiver Select. This plan is a premium support and maintenance package that gives you priority support with call assistance and beta releases. Attractive renewal packages with substantial discounts are also on offer.",
    "All personal licenses are currently permitted free lifetime updates to all future versions.",
    "PowerArchiver comes with an excellent support system. All PowerArchiver users can avail themselves of technical support free of charge. However, only registered users can receive premium support.",
    "The company also offers two online resources, namely the PowerArchiver Forums and PowerArchiver Wiki, for help with troubleshooting or questions, and there’s a contact form on the official website which you can use to get in touch with the company direct.",
    "PowerArchiver is a good solution for users who need a reliable service for everyday file management. It’s a streamlined app which is feature-packed, and provides encryption plus decent support, with a trial version to let you sample the software before you buy."
  ],
  "headers": {
    "1": "Features",
    "13": "Support",
    "15": "Final verdict"
  },
  "links": {
    "PowerArchiver": "https://www.powerarchiver.com/",
    "compression utility": "https://www.techradar.com/news/the-best-file-compression-software",
    "PowerArchiver Forums": "https://forums.powerarchiver.com/",
    "PowerArchiver Wiki": "http://wiki.powerarchiver.com/",
    "form": "https://www.powerarchiver.com/support/"
  }
}