{
  "source": "https://www.techradar.com/reviews/hyperx-cloud-flight-s",
  "title": "HyperX Cloud Flight S review",
  "category": "computing",
  "updated": "2020-04-22T13:50:53.407Z",
  "author": "christian-guyton",
  "summary": "Get your money's worth",
  "verdict": "A comfortable, well-constructed headset with great features overshadowed by a somewhat pointless USP, the Cloud Flight S from HyperX isn’t the cheapest headset around, but you do get your money’s worth.",
  "pros": [
    "Great audio quality",
    "Sturdy design with good buttons",
    "Soft, comfortable earcups"
  ],
  "cons": [
    "Wireless charging is hit and miss",
    "Fairly expensive",
    "Underwhelming mic"
  ],
  "article": [
    "It’s not exactly clear who was clamouring for a gaming headset that uses wireless Qi charging, but HyperX has released one anyway: the HyperX Cloud Flight S. It bears only superficial similarity to the original Cloud Flight, doing away with the red accents and exposed cables for a more professional, reserved look.",
    "The style is effortless, not as in-your-face as much modern gaming hardware, with RGB lighting reserved exclusively for the mic indicator. It might not be for everyone, but we like this new Cloud Flight S. It sits snugly on the head thanks to an adjustable headband and plush earcups.",
    "The HyperX Cloud Flight S is available for $160 (£160, around AU$250), a fairly high asking price even for a high-quality gaming headset. However, we're pleased to report - after a weekend spent playing games with this headset - that the robust construction and excellent performance make it well worth the price.",
    "This physical buttons on the headset feel great, all flush with the black plastic casing. The volume dial is a particular joy, giving a real feeling of solidity when you turn it. A standout here, though, is the four programmable buttons on the left earcup, which appear simply as small indents on the exterior face.",
    "These aren’t touch buttons; they do move ever so slightly when clicked, but they only require a small amount of pressure. They can be adjusted using HyperX’s simple NGenuity software to perform anything from chat/game balance tweaks to lobby muting, which proved very helpful in competitive matches.",
    "The most hotly touted feature here, of course, is the wireless charging aspect. The Cloud Flight S doesn’t come with a Qi charging pad, but it was compatible with a variety that we tested. The problem is that the headset has to be balanced on its left earcup to charge, making it easy to knock over or disrupt unless you have a dedicated charging space. HyperX does sell its own solution separately, the wide ChargePlay Base, which can charge two items at once.",
    "Considering that the largest thing most people want to put on a wireless charging pad is a phone or mouse, it’s an odd choice of gimmick, and one that doesn’t really pay off. Charging the headset via the included USB cable is faster and frankly easier, as the Qi charging would sometimes demand that the Cloud Flight S be shifted around a bit before charging began.",
    "Fortunately, the Cloud Flight S makes up for it with a 30-hour battery life and excellent audio performance, bringing the punchy bass of gunfire and explosions to the fore in games while ensuring dialogue is crisp and clear.",
    "Music (and general use outside of gaming) is good too, although the Cloud Flight S suffers due to NGenuity’s tragic lack of equalization options. The soundscape produced by this headset is rich and defined, we just wish we could customize it a little more. 7.1 surround sound is also a pleasant addition, although many games can’t properly take advantage of it.",
    "If we can squeeze in one last criticism, it’s that the detachable mic isn’t too impressive. It works fine, blocking out background noise like a champ, but we did find that it gave speech a somewhat tinny quality. It’s by no means disastrous, but we expected more from a $160 headset.",
    "On the whole, though, the HyperX Cloud Flight S is an extremely solid choice for anyone looking to buy a new gaming headset. It’s a good upgrade from any headset south of a hundred bucks, and a worthy replacement should your old $150 cans kick the bucket."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don't buy it if..."
  },
  "links": {
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675"
  }
}