{
  "source": "https://www.techradar.com/reviews/audio-technica-ath-awas-asada-sakura",
  "title": "Hands on: Audio-Technica ATH-AWAS (Asada Zakura) review",
  "category": "audio-visual",
  "updated": "2020-02-24T10:40:44Z",
  "author": "olivia-tambini",
  "summary": "Wooden headphones with a warm sound",
  "verdict": "The Audio-Technica ATH-AWAS are the latest in a two decade-long range of wooden-backed headphones. After spending a brief time testing them, we're impressed with how they sound, how they look, and how they feel – although the high price will put off all but the staunchest audiophiles.",
  "pros": [
    "Stunning sound",
    "Comfortable fit",
    "Unique design"
  ],
  "cons": [
    "Expensive",
    "Quite bulky"
  ],
  "article": [
    "Audio-Technica's latest model in its Wooden headphones range, the ATH-AWAS – or the Audio-Technica Asada Zakura, if you prefer – build on two decades of wooden-backed audiophile headphones, alongside the flagship ATH-AWKT.",
    "Crafted using a rare Japanese wood, these over-ear headphones certainly look the part, but how do they sound? We had the chance to test them out briefly at the Bristol Hi-Fi Show 2020, and while they're expensive, there's no denying that the ATH-AWAS sound exceptionally good.",
    "The Audio-Technica ATH-AWAS will be available to buy from March for £1,299.99 – that works out at around $1,680 / AU$2,540, though global pricing is still to be confirmed.",
    "While that price is considerably higher than what you would pay for our current favorite over-ear headphones, the Sony WH-1000XM3, it's important to remember that it's not unusual for audiophile headphones like the Asada Zakuras to cost well into the thousands.",
    "Perhaps a better comparison would be the Focal Stellias, which retail for $3,000 / £2,799 (around AU$4,200), and offer truly sublime audio fidelity for that high price.",
    "The ATH-AWAS Asada Zakuras look incredibly striking, with large, bulbous housings made from a rare and durable Japanese wood called (you guessed it) asada zakura.",
    "With its warm, almost cherry-red color and gorgeous grain, these headphones utilized the wood beautifully standing out from the sea of minimalist black and silver over-ears that dominate the market.",
    "The use of asada zakura also comes down to its acoustic properties, according to Audio-Technica, though it hasn't gone into much detail in this regard, it's true that different types of wood offer different harmonic properties.",
    "Offsetting the wooden finish is the Audio-Technica logo, embossed on the outer-housings in a subtle gold hue – we're suckers for a bit of sparkle, and we felt it added a lovely touch of luxury to these expensive cans.",
    "The headband and ear cups are both kitted out in padded faux leather, and they felt comfortable when we briefly tested them, despite their large size; however, we'll need to put them through a longer listening session to make a true assessment of their fit and feel.",
    "Metal sliders allow you to adjust the size of headband, bringing a little metallic sheen to an otherwise very natural-looking pair of headphones.",
    "These cans come with 6.3mm and balanced XLR cables, which are protected by a braided fabric outer later – don't go looking for mod-cons like wireless connectivity, because you won't find them here (and that will suit most wire-loving audiophiles just fine).",
    "According to Audio-Technica, the ATH-AWAS feature powerful 53mm drivers, which boast \"powerful circuitry and a DLC (diamond-like coating) for improved high frequency response\".",
    "Using such a rigid material in these headphones' drivers should lead to lower distortion levels, keeping your music as true to the original source as possible.",
    "They certainly sounded very clear and detailed when we briefly tested the headphones, and we were blown away by the high level of audio fidelity they offer, with a wise frequency response of 5-42,000Hz.",
    "Listening to Daft Punk's Get Lucky, we were transfixed by the vocals in particular, with every breath and rhythmic nuance handled with outstanding dexterity.",
    "Bass, while lively, sounded tightly controlled, leaving lots of space for the rest of the instrumentation to shine.",
    "While we didn't think these closed-back headphones offered as wide a soundstage as open-back models like the Focal Stellias, we didn't experience the closed-off sensation that over-ear headphones sometimes cause either.",
    "The Audio-Technica ATH-AWAS may not be the most high-spec cans, but they're certainly among the best-sounding headphones we've listened to so far.",
    "Looks-wise, they might not be for everyone, but that unique wooden finish could be highly appealing to those who want their headphones to stand out from the crowd.",
    "We'll need to spend more time with these audiophile over-ear headphones before we can whole heartedly recommend them, but our brief time spent listening with them exposed us to stunning detail, impressive clarity, and a natural-sounding, well-balanced soundstage."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design and features",
    "12": "Audio quality",
    "18": "Early verdict"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Focal Stellias": "https://www.techradar.com/reviews/focal-stellia-review",
    "best-sounding headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340"
  }
}