{
  "source": "https://www.techradar.com/reviews/liveagent",
  "title": "LiveAgent review",
  "category": "computing",
  "updated": "2021-01-21T09:44:07Z",
  "author": "michael-graw",
  "summary": "Live chat, ticketing and automation combined",
  "verdict": "LiveAgent is a reliable helpdesk solution for companies that want to offer phone, email, and live chat support. It’s best if you have numerous support agents since it includes auto-routing and back-end coordination features.",
  "pros": [
    "Free plan available",
    "Automatic ticket routing"
  ],
  "cons": [
    "Doesn’t include chat-to-SMS",
    "Social media support is expensive"
  ],
  "article": [
    "LiveAgent offers one of the best live chat software platforms for small- and medium-sized businesses. LiveAgent combines live chat and email ticketing so you can stay on top of customer support no matter how you connect. It offers a number of useful features, including automated ticket routing and internal coordination tools.",
    "So is LiveAgent right for your business? In our LiveAgent review, we’ll cover everything you need to know about this helpdesk solution.",
    "LiveAgent offers a free plan that’s surprisingly full-featured. You get one live chat button, ticketing for one email address, and call center support for a single phone number. The big catch is that there are few advanced features, and the platform only captures up to seven days of your support history.",
    "Paid plans start at $15 per agent per month for email ticketing only. You can connect an unlimited number of email accounts with a Ticketing plan. The Ticket+Chat plan costs $29 per agent per month and adds live chat and real-time visitor monitoring. You can add social media accounts, but they each cost an extra $39 per month. The All-inclusive Plan costs $39 per agent per month and offers unlimited social media integration, audit logs, and call center support.",
    "You can try out the All-inclusive plan for two weeks before signing up for a subscription.",
    "LiveAgent offers a number of features for connecting with customers and keeping your support team on the same page. The software enables you to place a chat box or email ticketing system on your business’s website or mobile app. Depending on your plan, you can easily create multiple chat boxes or email addresses for different departments.",
    "The ticket system that LiveAgent uses is simple but effective. You can set up auto-routing for tickets so that no support requests are ever missed, as well as limit the number of tickets, chats, and phone calls any one agent is tasked at a time. Tickets can be assigned ownership at the agent or department level and transferred between owners, too. LiveAgent will even auto-route tickets from a returning customer to the same agent that helped them with previous support questions.",
    "We were also impressed by LiveAgent’s live chat options. Agents can easily set up canned responses to speed up service, and basic post-chat customer satisfaction surveys can be sent so you can track the quality of your customer service. While LiveAgent can integrate with Facebook, Instagram, and Twitter for unified messaging, we did notice that the platform doesn’t support chat to SMS like some of its competitors do.",
    "On the back-end, LiveAgent has several tools to help your support team coordinate. The software comes with an internal chat and ticketing mechanism, and LiveAgent will automatically create an alert when two team members are working on the same ticket.",
    "LiveChat’s interface is relatively easy to use and helps your support agents stay on top of customer communications coming from multiple channels. At the top of the web app, three buttons keep you informed about how many support queries there are in your ticket, chat, and phone queues. Tickets and chats are automatically labeled as New, Open, or Answered, and there are simple bulk options for completing or re-assigning multiple tickets at once.",
    "One thing that we especially liked was that you can open multiple tickets and chats in tabs. This makes it easy for a single agent to manage multiple conversations at once. Each tab contains a window with information about the customer, including what page they’re currently visiting on your website if they’re connecting over live chat. The live chat view also shows responses as they are typed in real-time, before the customer hits send on their message.",
    "LiveAgent offers iOS and Android mobile apps in addition to the web app. These enable you to respond to messages just as you would on a desktop, and you can even set up push notifications so you never miss an incoming chat.",
    "LiveAgent offers 24/7 technical support by phone, live chat, and email—just what you’d hope for from a company that builds customer support software. The company’s website also has a detailed online knowledgebase with more than 400 articles and dozens of videos. The tutorials contain numerous annotated screenshots showing you how to tweak LiveAgent’s settings and features.",
    "LiveAgent protects your agents’ accounts by offering two-step verification with Google Authenticator. There are several security settings that enable you to limit what types of files can be sent through live chat and how long cookies are retained for visitors to your site. Administrators also get access to detailed audit logs and can set strong password requirements for individual team members.",
    "LiveAgent competes closely with helpdesk services like LiveChat, which focuses primarily on chat but also offers multi-platform messaging support. LiveChat is slightly cheaper for a typical plan, with a comparable option to LiveAgent’s All-inclusive plan for $33 per agent per month. However, LiveChat doesn’t have a free plan for smaller businesses like LiveAgent does.",
    "LiveChat’s chat functions are somewhat more robust than what LiveAgent offers. For example, it supports chat-to-SMS, customizable post-support surveys, and more advanced real-time monitoring of visitors on your site. However, LiveChat won’t help with phone support and some important administrative features like audit logs are restricted to its Enterprise plan.",
    "LiveAgent is high-quality helpdesk software for businesses that want to integrate phone, email, and live chat customer support. The free plan is impressively outfitted and might be enough for small businesses, while the paid plans aren’t outrageously expensive. We’d like to see cheaper support for social media accounts and the addition of chat-to-SMS, but these aren’t critical flaws for most businesses. In addition, LiveAgent does a nice job with auto-routing tickets across teams and helping your support agents stay on the same page when dealing with an influx of customer requests."
  ],
  "headers": {
    "2": "LiveAgent: Plans and pricing",
    "5": "Features",
    "9": "Interface and in use",
    "12": "Support",
    "13": "Security",
    "14": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "LiveAgent": "https://www.liveagent.com/",
    "best live chat software": "https://www.techradar.com/best/best-helpdesk-software",
    "Ticketing plan": "https://www.liveagent.com/pricing/",
    "Ticket+Chat plan": "https://www.liveagent.com/pricing/",
    "All-inclusive Plan": "https://www.liveagent.com/pricing/"
  }
}