{
  "source": "https://www.techradar.com/reviews/bitira",
  "title": "BitIRA review",
  "category": "computing",
  "updated": "2020-03-23T16:41:42Z",
  "author": "jitendra-soni",
  "summary": "Offers innovative way to diversify your retirement investment",
  "verdict": "Helps to invest your retirement funds in cryptocurrency",
  "pros": [
    "Invest in crytocurrencies",
    "Advanced reporting",
    "Tax-free investing",
    "Flexibility"
  ],
  "cons": [
    "Not all fees clear",
    "Relatively new company"
  ],
  "article": [
    "BitIRA offers an online platform to invest in cryptocurrency for your individual retirement account (IRA). It is a fairly young company that was founded in 2017 by the Birch Gold Group with an aim to help the U.S. citizens to invest in digital currencies. It also aims to help with retirement planning in a tax-efficient way.",
    "The ability to use alternative investments for your IRA has resulted in the company being awarded with prestigious ratings by the Better Business Bureau and the Business Consumer Alliance.",
    "Among the key highlights of BitIRA are the fact that it does not charge a fee for trading cryptocurrencies and offers a detailed history of transactions run through IRA account on its online platform.",
    "BitIRA is basically an IRA that offers you better control over the investments, especially in terms of using crytocurrencies. Even though you can independently decide what assets you should keep in your portfolio, you can accept the help of a Preferred Trust Company to help you manage your account. This qualified custodian can not only help users prepare their documents but also assists in getting the assets rolled over from the old IRA.",
    "BitIRA has dealt with the key players in this field like Fidelity, Merrill Lynch, and Edward Jones, among others.",
    "The company uses some of the top experts from the industry to assist in processes like asset purchasing, custodial management, security protocols, digital currency storage, and real-time trading.",
    "The account opening process is fairly simple. To apply as a new customer, you can head on to the website and choose between the online application or seek support from their helpdesk. While the online process is fast and easy, you can contact the staff online on the website or over the phone in case of complex situations.",
    "The trained staff can quickly guide you through the paperwork and documentation. The paperwork is kept to a minimum, and you might be occasionally bothered only for your signature and any additional documents.",
    "In case you choose the self-help or online option, you need to provide information like the type of your current retirement account and your current custodian etc. You also need to decide between three different choices of configuration:",
    "Remember, to be eligible for an IRA, you must be a valid US citizen with Social Security Number (SSN) or Tax ID, valid US Address and a valid state-issued ID.",
    "During the signup process, you will need to provide your personal details (Name and Date of Birth), address, bank details, beneficiary's details, SSN, and state-issued ID.",
    "This process takes about one to three weeks. The time taken is necessary as the staff has to make sure that your account is secure once it is established and ready to trade in digital currency.",
    "According to the rules and regulations of the partnering service, BitIRA needs a minimum of $20,000 value of funds in your account.",
    "A diverse range of crytocurrencies are available on the BitIRA platform, including:",
    "The types of accounts available on BitIRA are:",
    "BitIRA charges a fee for cryptocurrency purchases based on the amount of the purchase. As a result, the fees may vary. There is a fee of $50 account as an establishment fee and a custodian fees per year range from $300 to $1000 depending on your balance. Apart from these, the charges and fees are not clearly specified on BitIRA’s site",
    "The BitIRA website is very user-friendly and has an intuitive interface. You can navigate quite easily through your account to accomplish your desired actions. You can easily manage your account, get help, understand the fee structure, maintain contribution limits, assess the tax implications, and maintain withdrawals using your account. You have full control of your account, and it is managed by a custodian under your supervision.",
    "BitIRA U: This is a set of blogs and knowledge base which helps users to stay updated on the latest in the cryptocurrency market. There are free-to-sign-up weekly email newsletters as well, which you can be delivered right into your mailbox.",
    "Balance lookup: This gives you a quick update on how your cryptocurrency assets are performing and the current balance of the digital currency. The information provided here is in U.S. dollars.",
    "Exchange: Like a regular crypto exchange, here you can exchange from one currency to the other or go from cryptocurrencies to fiat currencies. The company claims to have mediated over $1 billion in transactions already. This allows users access to a deep pool of liquidity, asset variety and same-day transactions",
    "BitIRA offers an innovative way to invest for your retirement, especially those with a specific interest in crytocurrencies. As of now BitIRA is a market leader and offers offline cold storage for your investment making it hack-proof and secure.",
    "However, the signup process is slightly complicated and long, as well as the pricing structure not being very clearly advertised on the site.",
    "If you are a person who cannot manage the concepts of digital currency, then it is advisable for you to stick to more regular trading platforms."
  ],
  "headers": {
    "3": "What does BitIRA offer?",
    "6": "Signup",
    "13": "Digital currencies offered by BitIRA",
    "14": "Accounts",
    "15": "Charges and fees",
    "16": "Website",
    "17": "BitIRA features",
    "20": "Final verdict"
  },
  "links": {
    "BitIRA": "https://www.bitira.com/"
  }
}