{
  "source": "https://www.techradar.com/reviews/varmilo-keyboard-with-ec-switches-v2",
  "title": "Varmilo Keyboard with EC Switches V2 review",
  "category": "computing",
  "updated": "2020-09-21T15:15:22Z",
  "author": "matt-hanson",
  "summary": "A stylish and dependable mechanical keyboard",
  "verdict": "A stylish and dependable no-nonsense mechanical keyboard that's excellent for typing and working on. Gamers should look elsewhere, however.",
  "pros": [
    "Great build quality",
    "Beautifully designed",
    "Responsive",
    "Comfortable"
  ],
  "cons": [
    "Lack of buttons",
    "No LED backlighting",
    "Not ideal for gaming",
    "Pricey"
  ],
  "article": [
    "The Varmilo Keyboard with EC Switches V2 is a new keyboard from the Chinese manufacturer. While it’s a brand you might not have heard of, Varmilo has been building up an enviable reputation amongst keyboard enthusiasts thanks to its dependable build quality and attractive designs.",
    "In fact, Varmilio styles itself as a ‘keyboard artist’, and from even a cursory look at its products, including the Varmilo Keyboard with EC Switches V2, you can easily see why.",
    "Rather than going all-out in the style stakes, and adding all kinds of extra bells and whistles, like many gaming-focused keyboards do, Varmilo takes the classic keyboard design. And along with its own mechanical switches, this keyboard does something rather different. For connoisseurs, this could be just what you’re looking for.",
    "While Varmilo is a Chinese manufacturer, there is an English language version of the website with prices in US dollars, and the company will ship to most countries – though there are postage costs and local custom fees to consider.",
    "The Varmilo Keyboard with EC Switches V2 model we got sent for review comes with 108 keys and the ‘Moonlight’ theme. This sells for $157 (around £120, AU$215) – but that’s without delivery charges, which could round up the overall price to nearly $200 (around £155, AU$270).",
    "We should note that prices also vary depending on the theme of the keyboard. The ‘Moonlight’ theme is one of the more minimalist designs – and for more elaborate looks, you’re going to pay more.",
    "This puts the Varmilo Keyboard with EC Switches V2 as one of the more expensive keyboards out there.",
    "As ‘keyboard artists,' the design of the Varmilo Keyboard with EC Switches V2 is one of its key selling points, and Varmilo has done a great job. The layout is the familiar 108 key design, with ANSI layout. It’s only available in US Qwerty for English language users. For people in the US, this is fine, but for people in the UK, for example, it means you’ll need to either set your PC to the US layout, and learn the (slightly) new way of typing, or keep the layout in Windows 10 the same, and just remember that certain symbols, such as “ and @, are in different places than where they are indicated on the keyboard.",
    "Not ideal, but not a deal breaker for many, but worth considering anyway.",
    "With the ‘Moonlight’ theme, the frame of the keyboard is black, with a nice wood-like finish, while the keys are a mix of light and dark gray, and turquoise. It’s certainly attractive, and looking on the Varmilo website, there are other designs that are nicely minimalist, while others are more extravagant.",
    "There’s no LED backlighting for all the keys, however, with just the caps lock and num lock keys getting lights (to indicated when they are toggled).",
    "This gives the keyboard a bit of an old-school feel, and for people who haven’t been too impressed with the RGB lighting of gaming keyboards, this is fine. However, if you’re often working late at night in low light conditions, you may miss the per-key lighting that comes with other modern keyboards.",
    "As far as extra buttons go, the Varmilo Keyboard with EC Switches V2 keeps things simple, with four keys above the numpad for opening a media player, email client, calculator or Windows Explorer.",
    "The F7 to F12 keys also double as function keys for media controls. And that’s your lot. For people expecting loads of extra, programable, buttons, look elsewhere – and gamers should check out our best gaming keyboards list for more suitable alternatives.",
    "However, for people who want a solid, dependable keyboard that doesn’t overcomplicate things, this commitment to simplicity will be welcome.",
    "The Varmilo Keyboard with EC Switches V2 comes with Varmilo’s own mechanical switches – the EC Switch V2, which the company claims has a longer lifespan, increased durability, and better typing feeling than the Cherry MX switches found in many keyboards.",
    "As with Cherry MX switches, the EC Switches V2 come in different varieties. Varmilo EC Ivy, which the company claims is ‘clicky and tactile’, has a 50cN force (the higher the cN, the more of a ‘push’ you’ll need to make on the key), with an MX stem, 2.30mm pre travel, and 4.00mm travel.",
    "Then, there’s the Varmilo EC Sakura, which come in the keyboard we’re reviewing, which has 45cN force, is linear, has an MX stem and 2.00mm pre travel, and 4.00mm travel.",
    "There’s also Varmilo EC Rosery, which is also linear, with a 55cN force, MX stem, 2.00mm pre travel, and 4.00mm travel.",
    "While we can’t comment on the other switches, with the Varmilo EC Sakura switch, the Varmilo Keyboard with EC Switches V2 offers a comfortable and responsive typing experience. It gets a good balance of not needing too hard a push on each key to register, while also minimising accidental keystrokes as your fingers brush keys you don’t mean to press.",
    "It also offers that lovely clicky feel that many people love about mechanical keyboards without being too noisy. We wrote thousands of words with the Varmilo Keyboard with EC Switches V2 during our time with it, and it felt great. That solid build quality means you can tell this this a dependable keyboard that’s going to last, as well.",
    "We also did a fair bit of gaming with it, and while the Varmilo Keyboard with EC Switches V2 was perfectly acceptable, it’s clear this is not a keyboard with a primary gaming goal. And, in fact, during some hectic FPS action courtesy of Doom Eternal, we noticed that the relative lack of force needed to register a keypress was a bit of a downfall. We have a habit of resting our fingers on certain keys when playing, especially with the WASD movement keys, and even resting them on the key can sometimes register as a press, making us veer off into a direction we didn’t mean to go.",
    "This may not effect everyone, but it’s clear that for people who are looking for a keyboard to work on, the Varmilo Keyboard with EC Switches V2 is an excellent choice, but there are better suited keyboards for gamers."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design and features",
    "19": "Performance",
    "23": "Don't buy it if..."
  },
  "links": {
    "Varmilio styles itself": "https://www.instagram.com/varmilo/",
    "here is an English language version of the website": "https://en.varmilo.com/keyboardproscenium/"
  }
}