{
  "source": "https://www.techradar.com/reviews/remotepc",
  "title": "RemotePC review",
  "category": "computing",
  "updated": "2020-11-10T15:22:49.607Z",
  "author": "christian-rigg",
  "summary": "Our RemotePC review covers prices, features, and pros and cons",
  "verdict": "RemotePC is fast, secure, and easy-to-use remote desktop software, with lots of features, an affordable price-tag, and easy scale-ability that businesses will appreciate.",
  "pros": [
    "Great performance with low impact on system resources.",
    "Good price points with customizable plans for scaling."
  ],
  "cons": [
    "Mobile apps could use some improvement."
  ],
  "article": [
    "If you’re looking for the best remote desktop software for your business, RemotePC might just be it. Affordable plans that are easy to scale, business-oriented features, and great security all make this software a great choice for any business looking to manage remote desktop connections.",
    "RemotePC ticks a lot of boxes—but is it right for your business? Keep reading our RemotePC review for an in-depth look at its main pros and cons, features, and pricing.",
    "RemotePC offers four pricing plans. The Consumer and SOHO plans, at $29.50 and $69.50 per year, support one user license and two or 10 computers, respectively. The Team plan starts at $249.50 and enables an unlimited number of users to access up to 50 computers, while the Enterprise plan, starting at $499.50, enables access to up to 100 computers. Both plans can be scaled to add additional computers.",
    "Enterprise plans include support for advanced management of computers and users, as well as RemotePC Help Desk for on-demand remote support, great for large and IT support companies.",
    "At the time of writing, prospective subscribers could also get 25% off the first year or 50% off the first year for a 2-year plan. Finally, RemotePC offers a 30-day free trial that enables you to test out all features, up to and including Enterprise.",
    "Let’s take a look at some of the key features that business of all sizes will love. First, RemotePC runs on Windows, Mac, Linux, iOS, and Android devices, which means all your company’s hardware is covered. For collaborations, you can send one-time access invites to colleagues, while the built-in chat and whiteboard are sure to speed up meetings. Unlimited concurrent connections are great for editing projects together. A lack of built-in audio or video chat is regrettable, although this feature is supported by RemotePC HelpDesk for Enterprise clients.",
    "No matter where you are, you can access all your files and programs. Organize things as you like with multi-to-single or multi-to-multi monitor support, access file systems with drag-and-drop file sharing between host and client computers, and print documents to your nearest printer directly from the host.",
    "It's also worth noting that RemotePC was recently updated to include voice chat, which is a much more convenient way of collaborating than on-screen chat.",
    "Installing RemotePC on our test 16” MacBook Pro took just minutes, including setting up system-wide permissions. We had a similarly streamlined experience installing it on a 12.9” iPad Pro, and use in-browser is as easy as logging in.",
    "Depending upon the size of your company, setting up all your computers and user accounts may take some time. However, some clever features help streamline this process. For example, you can enter comma-delimited email addresses to invite multiple users. As each user sets up the RemotePC host, it will appear in the desktop and web apps. Additionally, with Enterprise plans, you can create user groups with permissions.",
    "One thing to note is that if and when you switch to a higher plan, each user will have to reinstall the software. User profiles and user groups remain unaffected.",
    "The interface is modern and easy to use. We had no trouble navigating in both the web and desktop apps to find what was needed. The web app is a bit limited, so you’ll need the desktop app for file transfers, remote sound and printing, and session recording. All the tools can be accessed from the Utilities menu at the top. Desktop, web, and iOS apps did a great job of scaling the screen, with sharp and clear text and images.",
    "The iPad app is a little cumbersome to use, and we sometimes highlighted text or dragged a file without meaning to. Plus, the two-finger scroll was very sensitive: just rolling our fingertips was enough to scroll the length of this review. As a result, we often overshot and had to nudge back.",
    "The latency was nearly flawless. We noticed almost no lag when moving the mouse or highlighting text, while changes made on the host showed up on the viewer with only a very short delay. This was all the more impressive given that RemotePC only used about 7% of our 2.6 GHz 6-Core Intel Core i7 processor, with a lower energy impact than Firefox. To further save on resources, you can choose to disable animations or blank the host’s wallpaper.",
    "Security was obviously given some serious consideration when building RemotePC. We were happy to see TLS v 1.2/AES-256 encryption for both remote computer access and file transfers, plus support for firewall and proxy servers. Access to each computer is protected by a Personal Key, acting like a second password to the host. It can be changed or revoked at any time. When you’re done, you can automatically lock the host after ending the session.",
    "IT managers can provide additional security requirements when setting up multiple users—with one click, you can require two-step verification from employees and limit authorization of new devices. You can set up automatic screen recording for sessions, and logs of events and activities are generated automatically for review in the web or desktop app.",
    "There are a few great support options for RemotePC users. You can contact the user support by telephone (1-888-275-2509) from Monday to Friday, 6:00 AM to 11:30 PM (PST). All plans also include 24/7 chat and email support, although at the time of writing, the Pricing page indicates that it’s restricted to Team and Enterprise accounts. We contacted the online chat to check, and they confirmed that all plans include these support options.",
    "On top of the direct user support, there is also a large FAQ with plenty of step-by-step instructions and screenshots, and a helpful series of video guides.",
    "We were impressed with the great performance of RemotePC, which was light on system resources but provided a smooth experience. Installation and setup was easy, even for multiple devices. We had no trouble navigating the interface, although the mobile version was a bit cumbersome and over-sensitive, and collaboration could be improved with built-in audio or video conferencing.",
    "All in all, RemotePC is fast, secure, and easy-to-use remote desktop software, with lots of features, an affordable price-tag, and easy scalability that businesses will appreciate.",
    "There are, of course, a number of other solutions out there you might consider.",
    "For example, Zoho Assist is one of the few remote desktop connection managers, like RemotePC, that supports voice and video chat. With prices starting at just $10 per month for up to 25 computers, it’s a cheaper option if you’re willing to sacrifice on features such as Linux support or advanced user management.",
    "TeamViewer is another good alternative that includes some interesting features, among them remote access to mobile devices (smartphones and tablets), IoT devices (smart TVs, video doorbells, etc.), and point of sale machines. If these feature prominently in your business, TeamViewer’s $99 per month Multi User plan may be worth considering.",
    "To find out more about RemotePC's competition, read our Best remote desktop software guide."
  ],
  "headers": {
    "2": "RemotePC review: Plans and pricing",
    "5": "RemotePC review: Features and utilities",
    "8": "Remote PC: Setup",
    "11": "RemotePC: Interface and performance",
    "14": "RemotePC: Security",
    "16": "RemotePC: Support",
    "18": "RemotePC: Final verdict",
    "20": "RemotePC: The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}