{
  "source": "https://www.techradar.com/reviews/bitdefender-digital-identity-protection",
  "title": "Bitdefender Digital Identity Protection review",
  "category": "computing",
  "updated": "2020-10-22T03:14:42Z",
  "author": "alex-mcomie",
  "summary": "Basic identity theft protection at an affordable price point",
  "verdict": "Bitdefender is an excellent option for basic identity protection, but Norton LifeLock and other top competitors provide more robust tools for security, recovery, and reimbursement.",
  "pros": [
    "Affordable pricing with 30-day money-back guarantee",
    "Clear, intuitive interface"
  ],
  "cons": [
    "Unreliable support options",
    "No mobile app",
    "No recovery or reimbursement"
  ],
  "article": [
    "Having your identity stolen might sound like a remote possibility, but the truth is that roughly 10% of American adults are affected by identity fraud every year. These cases led to total losses of more than $17 billion in 2016 alone, highlighting the monetary risk of identity theft.",
    "Consumers interested in protecting their identities have many options available today. In our Bitdefender Digital Identity Protection review, we’ll take a close look at the platform’s features and help you determine whether it’s the right option for you. While it’s missing some of the tools available with certain competitors, Bitdefender is one of the most powerful identity theft protection services in 2020.",
    "As of writing, an annual subscription for Bitdefender Digital Identity Protection is priced at $59.99 for the first year, before switching to $79.99. However, there is also a monthly plan which is priced at $7.99 per month.",
    "While Bitdefender doesn’t offer any short-term subscriptions or free trials, you can get your money back within 30 days by contacting the support team. You could also initiate a chargeback, but the website does point out that the chargeback process would likely take significantly longer.",
    "Bitdefender Digital Identity Protection subscriptions support up to three phone numbers and five email addresses. The platform continuously monitors both conventional and dark web databases, so you’ll receive a notification whenever your information shows up online. It can identify a variety of data points, including emails, passwords, social security numbers, credit card numbers, and phone numbers.",
    "The service also has excellent features for monitoring your digital footprint. It’s hard to measure their effectiveness in practice, but basically, the program is designed to help you keep track of all personal information, including your name, phone number, physical and email addresses, photos, and URLs.",
    "Additionally, Bitdefender constantly monitors a total of 25 social media channels to check for impersonation. Unfortunately, the site doesn’t showcase a list of the supported platforms. Presumably, they cover Facebook, Twitter, Instagram, LinkedIn, and other popular channels, but it’s impossible to say for sure without more information. We asked a support agent for clarification, but unfortunately, we did not receive a response after waiting for more than a week.",
    "Bitdefender only needs your phone number and email address to start monitoring for identity theft, making it incredibly easy to set up. The service is only available online; while Bitdefender has mobile apps for both iOS and Android, they don’t appear to include the platform’s identity protection features.",
    "Still, it looks and runs well, giving users all the information they need to keep their identity safe. Assuming that the lack of a mobile app isn’t a deal breaker for you, Bitdefender is an extremely easy service to use.",
    "Like some other identity protection providers, Bitdefender has a relatively thorough support page with answers to common questions about the tool’s features and settings. Check the Support Center first if you need any help with Bitdefender Digital Identity Protection.",
    "Bitdefender offers several other options beyond the answers available in the Support Center. You can ask a question in the Bitdefender Expert Community forums or contact the company’s support team directly via phone, email, or live chat.",
    "There are no listed hours for live chat help, but English language phone support is available 24/7. That said, we never received a response to an extremely straightforward inquiry, so it’s hard to say whether Bitdefender’s support system will be able to solve any problems you encounter.",
    "Bitdefender is significantly more affordable than many other identity protection services, but it’s also more limited with respect to features.",
    "Norton LifeLock, for example, is one of the most popular and well-respected providers in the industry. Subscriptions are available for $149.99, $249.99, and $349.99 per year, depending on your needs, although each plan costs substantially less for the first year.",
    "That’s obviously much higher than Bitdefender’s $79.99 per year, but LifeLock might be worth the extra money for some users. Instead of simply alerting subscribers to potential threats, Norton LifeLock also helps them recover their funds.",
    "Furthermore, the three subscription tiers come with $25,000, $100,000, and $1 million in identity theft insurance, respectively. Bitdefender users, on the other hand, will have to recover any lost funds on their own after receiving a notification from the provider.",
    "Bitdefender has a decent set of features at a relatively low price, and it’s easy to see why so many users trust the platform to protect their identity. That said, those who want more robust protection should consider Norton LifeLock or another provider that offers recovery and/or reimbursement. Of course, whether those features are worth the additional cost ultimately comes down to your needs and budget.",
    "As an established name in cybersecurity services, Bitdefender can quickly identify any threats to your identity."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Interface and in use",
    "9": "Support",
    "12": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "roughly 10%": "https://www.bjs.gov/content/pub/pdf/vit16_sum.pdf",
    "Bitdefender Digital Identity Protection": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trd-us-7382900513421863000&sharedId=trd-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fsolutions%2Fdigital-identity-protection.html",
    "identity theft protection services": "https://www.techradar.com/best/best-identity-theft-protection",
    "annual subscription": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trd-us-1141210098038730400&sharedId=trd-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fsolutions%2Fdigital-identity-protection.html",
    "monthly plan": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trd-us-1174053040036326100&sharedId=trd-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fsolutions%2Fdigital-identity-protection.html",
    "Norton LifeLock": "https://www.techradar.com/reviews/norton-lifelock"
  }
}