{
  "source": "https://www.techradar.com/reviews/xmind",
  "title": "Xmind review",
  "category": "computing",
  "updated": "2020-07-21T13:54:27Z",
  "author": "katie-horne",
  "summary": "Solid mind mapping and brainstorming tool for most users",
  "verdict": "All-around solid mind mapping app with a solid set of features and functionality",
  "pros": [
    "Offers options for both personal/academic users and those in business",
    "Comes with desktop and mobile app options"
  ],
  "cons": [
    "Free plan is more of a trial",
    "Product split means you might have to purchase two subscriptions to get all of XMind’s features"
  ],
  "article": [
    "XMind is a mind mapping and brainstorming tool that is available for users running Windows, macOS, and Linux (Ubuntu). Though XMind Ltd. is the company behind XMind, the product’s code base is publicly available on GitHub, where anyone can go and raise issues or suggest code changes (in the form of Pull Requests) to the software.",
    "XMind allows users to try out the software free of charge, but in this version, select features are inactive and any images or PDFs you export will display XMind watermarks. There are two XMind options from which you can choose: Zen & Mobile or Pro.",
    "XMind: Zen & Mobile gets you access to versions for all platforms (to be clear, XMind Zen is the interface for Windows, macOS, Linux, while XMind mobile is for iOS and Android), as well as use of all features. It is a multi-license product that allows you to run XMind on two Macs/PCs and three iOS/Android devices.",
    "Prices for this version start at $39.99 for six months, but those in academia can request a discounted subscription.",
    "Meanwhile, XMind Pro gets you lifelong use of XMind on up to two Macs/PCs (this version doesn’t come with access to the mobile apps). You get access to all of XMind’s features, and the files you export are not watermarked.",
    "Prices begin at $129, but those working in academia or the government can request a discount. XMind Pro subscribers also get a 30-day money-back guarantee in case they decide that XMind isn’t what they’re looking for.",
    "XMind is geared toward the creation of non-linear documents, but if you need something with a more linear format, the application allows you to convert easily between outlines and mind maps.",
    "XMind offers two different products for desktop/laptop users: Zen and Pro.",
    "The primary differences between the two are that XMind Zen features a more modern UI/UX, while XMind Pro includes more professional-grade features and functionality like the ability to create Gantt Charts and slide-based presentations, access to more export options, and increased control over the aesthetics of your files.",
    "That said, users who opt for XMap Zen will enjoy the following features:",
    "XMind Pro users also enjoy the same abilities to create mind maps. However, instead of being able to manage tasks and goals with Outliner, Pro users can create business charts and Gantt Views, get support for brainstorming, switch into presentation mode, and export to a greater number of file types. The UI/UX is more classic (and less modern when compared to that used for XMind Zen).",
    "Some of the most noticeable differences between XMind Zen and XMind Pro are the UI/UX. XMind Zen boasts a clean, modern UI/UX. Most of the functionality you need can be accessed using the toolbar at the top of the page (note that you can also toggle back and forth between Mind Map and Outliner with ease).",
    "XMind Zen comes with XMind mobile, which offers nearly identical functionality to its desktop/laptop counterpart.",
    "Conversely, XMind Pro has a more classic UI/UX that is professional in appearance. There are toolbars to the top and right, which makes its usage slightly more complex, but not overly difficult.",
    "XMind offers you several ways to get in touch regarding your questions and concerns. The Help Desk features a knowledge base, as well as forums for you to ask your questions and a page for you to provide suggestions for improvements. There’s also the XMind blog, which is a good source for announcements, news, and special offers.",
    "If you want to talk to someone on the XMind team, you can send them an email, make a telephone call, or reach out via Skype. The staff can also be contacted via Twitter and Facebook.",
    "XMind isn’t the only tool on the market supporting idea generation. The following are two options you might consider in addition to XMind.",
    "Wisemapping is a mind mapping/brainstorming tool that offers two different versions (one for individuals and one for business/education users). You can try out the web-based app for free, and the files you create can be imported and exported with ease. Wisemapping offers a download that you can run on your own server.",
    "Meanwhile, MindMeister is a web-based mind mapping tool that features robust collaboration features and allows you to export your files in a number of formats. It has a modern, easy-to-use interface and offers a free plan that allows you to get a feel for the product. However, to access all of the features, you will need to upgrade to a paid subscription.",
    "XMind is a mind mapping/brainstorming tool that offers its users a lot of features and functionality. That said, there seems to be quite a divide between its Zen/Mobile package and its Pro package.",
    "Some users may find that neither package fits their needs, and though the two products are compatible with one another, the pricing scheme means that purchasing both options might not be a viable option for many users."
  ],
  "headers": {
    "1": "Plans and pricing",
    "6": "Features",
    "11": "Interface and In Use",
    "14": "Support",
    "16": "The Competition",
    "19": "Final Verdict"
  },
  "links": {
    "available on GitHub": "https://github.com/xmindltd/xmind",
    "Pull Requests": "https://github.com/xmindltd/xmind/pulls"
  }
}