{
  "source": "https://www.techradar.com/reviews/worldpay",
  "title": "Worldpay review",
  "category": "computing",
  "updated": "2020-09-21T21:03:24Z",
  "author": "rob-clymo",
  "summary": "Worldpay offers mobile card payment services for business",
  "verdict": "If you already use Worldpay for your business transactions then having the additional ability to go mobile with this handy card reader and app combination makes good sense.",
  "pros": [
    "Familiar card reader type",
    "App experience",
    "Expands the appeal of Worldpay",
    "Support seems solid"
  ],
  "cons": [
    "Fees and charges",
    "Requires commitment"
  ],
  "article": [
    "Worldpay is one of the larger companies that offers businesses of all shapes and sizes the ability to accept payments via card, contactless and the increasingly popular digital wallet. This has been exacerbated due to the coronavirus pandemic.",
    "It currently provides those with a need to process mobile transactions the capacity for accepting payments using a combination of a tried and tested card reader matched with a rather good point of sale app.",
    "Worldpay delivers its services for business users via a subscription plan or by offering pay-as-you-go flexibility. Which you choose is largely dependent on how much you need to use them. Other similar products include Square, SumUp, QuickBooks Payments, Shopify, PayAnywhere and iZettle.",
    "Worldpay covers all bases when it comes to what kind of deal you’ll need in order to start processing mobile payments. This is currently divided down the middle with a pay-as-you-go option or a Simplicity package. However, all this is not quite as simple as it might sound and it obviously depends on your global location.",
    "The UK, for example, has the Pay-as-you-go option that requires a £69 plus VAT one-off purchase, while transaction costs are calculated dependent on your monthly turnover. There are additional fees too, such as a premium card charge along with authorization fees for transactions. Watch out for a PCI non-compliance fee of £9.99 per month.",
    "The Simplicity package also has the latter charge too, while its monthly rental charge is £4.99 plus VAT and you’re committed to an 18-month contract. However, there’s a single transaction rate that includes all card fees, which is worked out based on your monthly processing turnover.",
    "Worldpay offers a range of products and services, all of which really depend on what sort of business you have. Naturally, many business owners have premises and a permanent location, so the Worldpay countertop card machine fits the bill for a lot of merchants.",
    "But it also has mobile devices to suit. While Worldpay has portable, rather than desktop mounted card machines that can be used in places like pubs, restaurants and cafes, it also has another model for accepting payment on the go.",
    "The Worldpay mobile card reader is therefore perfect for that task, as it’s a compact device that can be paired with your smartphone or tablet.",
    "Worldpay’s mobile card payment processing format follows the same theme as others in the market. It combines the aforementioned physical card reader, that is conveniently pocket-sized, which works in tandem with a mobile POS app.",
    "As is the case with mobile card readers, you’ll need a reliable 3G or 4G mobile signal or Wi-Fi connectivity for this to work. Processing transactions is a simple enough procedure, with the device actually being the same as that used by PayPal.",
    "With a proven track record for the hardware this means that Chip and PIN, contactless cards and swiping are all available options, as are the processing of digital wallet payments.",
    "The app, incidentally, also lets you take payments if you're offline and process them once you get connected again. There’s a version for both iOS and Android.",
    "The Worldpay mobile card reader and POS app are, as you would expect from a large concern, able to process payments without fuss or bother. The arrangement is able to process the likes of Mastercard, Maestro, Visa, contactless as well as Apple Pay, Google Pay and Samsung Pay too. All bases are essentially covered once you’ve applied for a Worldpay Reader Account online.",
    "Meanwhile, the card reader itself follows a standard theme as seen with other processing companies, but the app adds another interesting touch to proceedings. Indeed, the Worldpay POS app seems to have been nicely though out and engineered.",
    "There’s a simple interface, but as you delve deeper it reveals a raft of useful features such as analytics and, if you sell items of stock, a handy visual overview of said items. It’s great for multitasking and can issue the likes of refunds and voids where necessary too.",
    "Being such a large concern means that Worldpay has the capacity to offer multi-level support, which is a cocktail of 24/7 phone and email options. This offers a pretty universal means of contacting Worldpay, although we’d like to see a little more content on their website in terms of online help, tutorials and community support as none of this is immediately apparent.",
    "Worldpay makes good sense if you’re already an existing customer, and perhaps use their products and processing services in a physical environment. But, if you have a mobile business that requires flexibility then, while it has its merits, Worldpay is up against other rivals who have slightly simpler plans.",
    "Nevertheless, there is a plentiful supply of 24/7 support, the card reader and app combination work nicely together too, but ultimately the fees, charges and contractual complications could prove a little offputting for some."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "13": "Ease of use",
    "16": "Support",
    "17": "Final verdict"
  },
  "links": {
    "Worldpay": "https://www.worldpay.com/global-selector",
    "accept payments": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "digital wallet": "https://www.techradar.com/news/nearly-a-third-of-uk-consumers-are-now-using-digital-and-mobile-wallets-to-pay-for-goods-online",
    "point of sale": "https://www.techradar.com/news/the-best-pos-system",
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "SumUp": "https://www.techradar.com/reviews/sumup-pos",
    "QuickBooks Payments": "https://www.techradar.com/reviews/quickbooks-gopayment",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "PayAnywhere": "https://www.techradar.com/reviews/payanywhere",
    "iZettle": "https://www.techradar.com/reviews/izettle-2",
    "Pay-as-you-go option": "https://www.worldpay.com/en-gb/products/card-reader",
    "Simplicity package": "https://www.worldpay.com/en-gb/products/card-reader",
    "processing services": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}