{
  "source": "https://www.techradar.com/reviews/le-vpn",
  "title": "Le VPN review",
  "category": "computing",
  "updated": "2020-12-04T11:29:21.969Z",
  "author": "sead-fadilpasic",
  "summary": "Servers everywhere",
  "verdict": "Le VPN might not be the fastest or the cheapest player in the VPN field but it does have certain features that make it appealing. These include unblocking of almost any geo-restricted content you want to access, support for torrenting, the deployment of innovative HybridVPN technology, as well as managing servers in every corner of the world, no matter how remote.",
  "pros": [
    "Unblocks Netflix, BBC iPlayer, Amazon Prime Video, etc.",
    "Wide server coverage",
    "Uses HybridVPN technology"
  ],
  "cons": [
    "Some logging",
    "There are cheaper solutions",
    "Some technical issues"
  ],
  "article": [
    "Le VPN is a provider of VPN services that has been on the market since 2010. It was founded in Paris, France “by a team of internet freedom and cybersecurity enthusiasts, excited to bring everyone a solution for personal security and privacy.”",
    "Like many other VPN products, this one too has its positive and negative sides, so if by the end of this review you decide the negatives beat the positives and that you’d like to see what else is on the market, we recommend checking out some of the best VPN providers out there.",
    "However, Le VPN certainly has a lot of positives, that include support for all the major VOD channels and torrenting, as well as large server network and the deployment of innovative technology that combines VPN with SmartDNS.",
    "Available pricing plans start with the 1-month option at $9.95/month, followed by the 6-month plan at $7.50/month (billed $44.99 every six months), and finally, the 12-month subscription at $4.95/month (billed $59.40 every 12 months).",
    "The provider offers a 7-day money-back guarantee on all of its plans, which also serves as a free trial since you aren’t charged for the first seven days after you sign up. You do have to cancel the account before the 7 days are up, as well as remove your credit card details from the website, or you will be charged for the full subscription.",
    "In terms of payment methods, it accepts credit/debit cards, PayPal, Oxxo, Qiwi, Boleto, and even Bitcoin. Under one account, users can cover up to 5 devices at the same time, which is a typical number in this business, although some competitors offer more but some even less.",
    "Even though Le VPN does a solid job of protecting its users’ privacy and unblocking restricted content, it does fall behind some of the major names in the VPN industry. Such names start with the best VPN solution there is - ExpressVPN, followed by a cheaper yet powerful NordVPN, as well as their runner-ups Surfshark and CyberGhost. Out of these four, only ExpressVPN is more expensive but without a shadow of a doubt worth it.",
    "Streaming enthusiasts will be happy to know that Le VPN unblocks a whole list of VOD services and channels that may not be available in certain regions, including Netflix, BBC iPlayer, Amazon Prime Video, Disney+, MTV, and many more thanks to its SmartDNS technology.",
    "Le VPN is headquartered in Hong Kong and provides access to an undisclosed number of servers in 120+ countries all over the world, including in Anguilla, Barbados, Belize, French Guiana, Albania, Iran, Jordan, Madagascar, Sri Lanka, and New Caledonia. Although it isn’t clear how many servers exactly the provider has nor did it want to answer our queries about it, just the sheer number and choice of countries in which it has servers is awe-inspiring.",
    "This VPN deploys the powerful AES-256 encryption and supports the classic list of protocols - OpenVPN, IPSec, IKEv2, L2TP over IPSec, and PPTP, as well as the cutting-edge HybridVPN service. HybridVPN is an innovative “mix of the fastest VPN service and a SmartDNS”, which “provides not only the security and the reliability of a VPN but also the speed and the ease of use of a SmartDNS”.",
    "It also allows secure sharing of large files via P2P/torrenting clients. The apps deploy additional security mechanisms, such as the industry-standard kill switch that terminates your entire Internet access when the VPN connection is interrupted.",
    "In its no-logs policy, Le VPN states that it will store a timestamp and IP address when you connect and disconnect to its service, as well as the amount of data transmitted during your session along with the IP address of the individual VPN server you used. It doesn’t monitor or store the details of the websites visited when using the service but it is impossible to confirm the veracity of these claims until the provider brings in an independent auditing company that will conduct its own investigation and publish a report.",
    "Le VPN has straightforward and intuitive apps for Windows, Mac, Android, iOS, and FireOS, in addition to being compatible with other devices, like smart TVs, game consoles, and routers, that you can cover with this VPN with the help of manual installation guides. Installing it on a router can remove the limitation on simultaneous VPN connections.",
    "The provider’s iOS app has been given 4.4 stars (out of 5) by 161 users, and the app was last updated with minor bug fixes on April 10, 2020. Le VPN’s Android app has a lower score - 3.6 stars as judged by 675 people. It was downloaded more than 100,00 times and last updated on December 12, 2019.",
    "Although the support team isn’t online 24/7, you can leave a message via chat (no 24/7 availability), submit a ticket on the website, or send an email if you have any questions or concerns that aren’t addressed on the website. We had a misfortune to run into a problem with activating our account (multiple times), but the helpful customer service agent stepped in a short time after we opened a ticket and resolved the issue.",
    "Connecting to a server in France gave us mediocre but very usable results - 21Mbps on a 70Mbps testing connection. A server in the Czech Republic had poorer results, but not by a lot - 15Mbps. We also tried connecting to a server in Australia and this time we got much poorer results - 6.73Mbps, somewhat expected considering the distance from our physical location.",
    "The app was very easy to download and set up if we overlook the problems we had in setting up the account in the first place (quickly resolved by the customer support). Switching between servers, however, is impossible without terminating the original VPN connection, choosing the new server and then connecting again.",
    "Le VPN is a great way to access geographically restricted streaming content from wherever you are, be it on Netflix or BBC iPlayer, thanks to combining the VPN and DNS technologies in the form of a HybridVPN. It also supports P2P file sharing and has servers in almost every country in the world.",
    "That said, there’s room for improvement in terms of some technicalities, the logging that takes place during the use of its platform, as well as slightly uncompetitive pricing. If you’d rather have a truly perfect VPN experience, then an industry giant such as ExpressVPN is the way to go, despite costing more."
  ],
  "headers": {
    "3": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "12": "Support",
    "15": "Speed and experience",
    "17": "Verdict"
  },
  "links": {
    "Le VPN": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7299362226022343000&xs=1&url=https%3A%2F%2Fwww.le-vpn.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fle-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-7684835768018444000"
  }
}