{
  "source": "https://www.techradar.com/reviews/the-new-soundboks-2020",
  "title": "The New Soundboks (2020) review",
  "category": "audio-visual",
  "updated": "2020-08-19T17:37:00Z",
  "author": "ted-kritsonis",
  "summary": "The New Soundboks is the ideal party speaker, but it's not cheap",
  "verdict": "The New Soundboks was built to be as loud as it gets, but it manages to do it with impressive sound quality while it’s booming tunes to a crowd. Just be prepared to pay a lot for it.",
  "pros": [
    "Can get incredibly loud",
    "TeamUp to add extra speakers",
    "Ports for mics/instruments"
  ],
  "cons": [
    "Expensive",
    "Limited Bluetooth codecs",
    "No equalizer on app"
  ],
  "article": [
    "Look at most Bluetooth speakers today, and you’ll find a plethora of portable options — some bigger, most smaller. For Danish brand Soundboks, ‘big’ is a relative term and its signature speaker for 2020, The New Soundboks, is monstrous by comparison.",
    "But the rock-stage aesthetic is nothing new for Soundboks, who first started out in a garage in Denmark and a Kickstarter campaign for their first speaker.",
    "With solid credentials in hand, offering something this size with battery power, the company feels $999 (£815, around AU$1,400) is the right price. It’s a lot to ask for, so justifying it all comes down to how much mileage you can get out of it — and just how loud you like your music.",
    "The New Soundboks looks like the kind of speaker you’d pass by in a nightclub. Or maybe even a big amplifier at a bar live music venue. The cabinet-style design weighs in at a not insignificant 34 pounds (15.4 kg) and measures 25.6 x 17 x 12 inches. It’s taller than a small child and probably heavier than a cooler filled with beer and ice.",
    "That would explain why it has handles on either side to enable one strong person to pick it up, or two people to carry it more comfortably. The corners are made of a tough silicone that makes it easy to set the thing down on almost any surface. That’s important because this isn’t a speaker to be taken lightly.",
    "Inside, there are three Class D amplifiers at 72W with two 10-inch 96dB woofers and a 1-inch 104dB compression driver tweeter. The frequency range is 40Hz-20Hz, including a bass-enhanced sound profile and Advanced Bass DSP. The IP65 rating allows it to withstand most weather conditions you would put it in, like bright sunlight, moist evenings or even a drizzle of rain.",
    "Bluetooth 5.0 support is important because it distinctly broadens the range in which it will pick up the signal. That matters when it comes to a speaker like this where more than a few people are likely to crowd around it. There’s even a dedicated app to set it up and install the latest firmware, like we did when we first got the New Soundboks.",
    "We got two 12.8-V/7.8-Ah LiFePO4 Batteryboks with our review unit, though it can also come with just one. (If you get two, the overall price goes up to $1,129.) We’ll get to battery life later, but needless to say, these things are sizeable, like blocks, and they need to be to power the heavy components inside.",
    "There is also some limited customization here, particularly through the front grill, which comes in either black, white or orange. You do have to pay an extra $20 if you want white or orange, by the way.",
    "The Soundboks app isn’t especially deep but it does have a few key features you would need to keep an eye on. The most important would the sound mode, split between Bass+, Power and Indoor. Bass+ is the most taxing on the battery, with a range of up to three hours per charge, but it’s also the loudest with the ability to go up to 126dB. Power prioritizes efficiency to keep the speaker loud, yet manage to eke out an extra two hours of battery. Indoor lowers the max loudness and extends the potential battery life to seven hours.",
    "If you want to play DJ with this speaker, you can by hooking up your equipment directly to the Pro Panel. It has two XLR/6.35mm jack combo inputs, plus one 3.5mm Aux input and one 3.5mm Aux output. The app has a Pro Panel mixer for the two channels in case you want to raise or lower the gain on either one.",
    "It is kind of cool that you can also plug in a microphone or a guitar to it, if you want to get creative in some way. We never tried any kind of karaoke or anything with it, and we’re not so sure it’s made for that anyway.",
    "Regardless, you may be more inclined to really take things to another level by pairing with other Soundboks speakers under the TeamUp feature. This way, up to four of them can connect to each other in a wireless daisy chain, where your speaker can either act as the host or join an existing setup.",
    "It’s almost ironic that Soundboks puts the volume up to 11. Playing music that loud, you’re likely to have someone come by and kindly (or not) ask to dial it down. Even at the beach, the speaker could easily drown out any other music playing within its vicinity. We’re not exaggerating.",
    "But then again, we prefer to have something still sound great at 80% volume. At halfway, it was decent, but not loud enough to disturb anyone unless they were really close. Inching it up from there, we noticed how progressively loud it would get. There is a massive difference from Level 5 to 8, for instance, almost like you cranked it up to full already.",
    "Despite social distancing and other restrictions, the speaker was a hit for most who saw it. Because it’s loud, it already attracts attention, and if you can avoid annoying people from the start, you might be able to attract a crowd and meet new people. What really made the difference was using the Bass+ and Power settings. The rumbling bass felt like being in a club or concert in closer proximity, and was the part that really carried the sound further distances.",
    "There’s no equalizer in the app, and some fine print within it suggests not using one to begin with. You’re certainly free to do so from whichever source you’re playing music from, assuming they offer it, as most music streaming services don’t. The good news is that the New Soundboks sounds great — even better than we expected at louder volumes. Some distortion sets in at 10 and 11, which is to be expected, but we would only go that far if we were outside in more open areas.",
    "The only thing is, if you do plan to go louder over the course of a day at the beach or park, that second battery can be a lifesaver. It’s possible to plug in if you have some way to access an outlet or power source, but more than likely, you’ll be relying on battery power when outdoors. Even if you plan to recharge the battery, it takes at least three hours to get back to full again.",
    "All of Soundboks’ battery ratings are based on cranking the speaker up to 11. Stick to the middle (or less) and you can probably go over 30 hours per charge. It drops precipitously the more you move that dial up, making it hard to approximate how long it lasts at different levels. The Indoor mode also sips the battery far slower at lower volumes, which is one reason why it works quite well when set up in a home. For the price, we expected no less.",
    "A speaker like the New Soundboks may seem out of place while a pandemic is going on, but it’s more versatile than it looks. Whether you’re using it in the backyard or comfort of indoors, or somewhere outside, like the beach or cottage, it’s only cumbersome because of its size. It can play low or loud.",
    "It’s also well-built, so should last a long time, and makes a statement no matter where you take it. If you like to throw parties, you won’t go wrong with this thing. That’s harder to do these days, but we figure that once you hear how it sounds and how far people can hear it, you may be sold and start getting ideas."
  ],
  "headers": {
    "3": "Design",
    "9": "Features",
    "13": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}