{
  "source": "https://www.techradar.com/reviews/google-chat",
  "title": "Google Chat review",
  "category": "computing",
  "updated": "2020-11-09T07:40:02.810Z",
  "author": "annie-beverley",
  "summary": "Instant messaging with app integration to increase team productivity.",
  "verdict": "Google Chat integrates with Google’s productivity software to help teammates within the same business better collaborate on projects. Although in no way innovative, Google Chat does its job well.",
  "pros": [
    "Integrated with Google productivity software",
    "Enhanced cybersecurity"
  ],
  "cons": [
    "No free plan",
    "Equivalent to most other workplace communication’s apps"
  ],
  "article": [
    "Google Hangouts recently rebranded as Google Chat, which suggests Google’s ambition to replace Slack as the world’s leading workplace communication software hasn’t diminished. Hangouts needed a rebrand after killing off the once-loved Gchat in 2017 without ever replicating its popularity. Google Hangouts is still available to personal users, but business users have already migrated onto Google Chat.",
    "The new Google Chat brand is one aspect of Google’s total GSuite rebrand as Google Workspace, first alluded to in Spring 2020 with changes to Hangouts. The rebrand is likely intended to grab Google a bigger slice of the remote working market.",
    "In this Google Chat review, we’ll assess whether this 1:1 and group messaging app is among the best online collaboration tools available today, so you can decide if this is the right workplace communications application for your team.",
    "Every Google Workspace user, on any pricing tier, has access to Google Chat. The Basic and Business versions of GSuite have been rebranded as the Business Starter ($6.00 user/mo) and Business Standard ($12.00 user/mo), respectively. Both are marketed toward businesses with under 300 team members. The Business Standard plan improves upon the Business Starter package, with 67 times more cloud storage and larger meeting sizes accommodated. Google does not entice businesses to subscribe with a first offering of free office software; you’ll have to pay, or you can’t access Google Workspace. The Business Plus package ($18.00 user/mo) is a new plan, aimed at small-to-medium-sized businesses that require larger team meetings and enhanced cybersecurity. Large organizations with complex cloud computing needs must contact Google’s sales department to get a quote for the Enterprise Plan.",
    "The newly launched Google Chat comes with fresh features that should enhance team productivity.",
    "Teams collaborating on projects will love that they don’t have to leave their chat window to create a new document and share it with teammates.",
    "Teams working together on a Google Workspace file can communicate with all file editors in a chat by simply clicking the messaging button in the top right corner.",
    "Take the hard work out of scheduling meetings with Google Workspace’s Meet bot. If you want to schedule a meeting with all members of a chat channel present, the Meet bot will check everyone’s calendar, find the most appropriate time, and send an invite in Chat.",
    "Google applies its search expertise to workplace communication with a search tool to recover critical information from previous messages within Chat channels.",
    "Anyone who has used instant messaging applications before will find Google Chat easy. Dashboard windows on the cloud and mobile are clean, white, and functional, as we’ve come to expect from Google products.",
    "The names of channels and team members are displayed on the left-hand side of the cloud application so you can immediately find who you want to talk to. The niftiest feature on the interface has to be the message bar, which allows you to add emojis (a necessity) and files from Google Drive, schedule meetings, and create documents, with just a click.",
    "Google Workspace users have access to support through their admin console. They must first head to the help window and choose to contact support. After a consultation with a Google customer service representative, you’ll be given a phone number or email address, depending on the severity of the issue.",
    "ISO certified and enterprise grade, Google Chat uses transport encryption to encrypt all communications and content as these move between Google’s data centers. Google insists that its transport encryption is sufficient protection except for all those engaged in “espionage or illegal activities.”",
    "Workspace admins can archive, export, and search all data from Chat to assess communications for indications of insider threats. Admins can decide if they want to enable two-factor authentication for users. They can also remotely restrict access to the account from unknown devices, to protect against insider threats. Google Chat, like the entirety of Google’s enterprise services, is run from the same IT infrastructure as Google’s search engine, in its data centers. These data centers are protected from acts of physical vandalism with metal detectors, perimeter fencing, and staff access cards.",
    "Unlike Google Workspace, Slack’s first pricing tier is free, which may be sufficient for some small organizations. Slack allows unlimited users to be added to a channel on the free plan and 10 free integrations with other applications, but you can only conduct 1:1 calls. Despite the limitations, being able to “try before you buy” incentives many organizations to choose Slack over Google Chat.",
    "You must choose on Slack whether your communication channels are public or private, whereas on Google they’re automatically private, so you don’t have to be so conscientious of ensuring privacy measures are in place. Messaging formatting options are immediately available on Slack chat, but are quite hard to find on Google’s equivalent.",
    "Microsoft Teams’ chat application and Google Chat are entirely analogous in that they’re both business communications platforms integrated with productivity software. They share similar features and facilitate simultaneous collaboration on projects that use their productivity suites. However, one way Microsoft improves on Google is by allowing organizations to customize their chat application to reflect their branding.",
    "Google Chat’s new features are attractive enough that teams using Google’s productivity software may abandon Slack to enhance efficiency. Complete integration with all Google Workspace applications allows business users to automate trivial tasks you’d otherwise waste precious time on, like scheduling meetings, which is very attractive.",
    "However, if your organization is committed to Microsoft applications, Google Chat alone isn’t a strong enough alternative to Microsoft Teams to entice you away. Google Chat serves its purpose and works well with Google Workspace, but isn’t a revolution in instant messaging."
  ],
  "headers": {
    "3": "Google Chat: Plans and pricing",
    "4": "Google Chat: Features",
    "9": "Google Chat: Interface and in use",
    "11": "Google Chat: Support",
    "12": "Google Chat: Security",
    "14": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Google Chat": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-7222769590809962000/https://workspace.google.com/products/chat/",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "free office software": "https://www.techradar.com/best/free-office-software",
    "cybersecurity": "https://www.techradar.com/news/cybersecurity-what-is-it",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "calendar": "https://www.techradar.com/best/best-calendar-apps",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "IT infrastructure": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "alternative to Microsoft": "https://www.techradar.com/news/best-microsoft-office-alternative"
  }
}