{
  "source": "https://www.techradar.com/reviews/oppo-a9-2020",
  "title": "Oppo A9 2020 review",
  "category": "phones",
  "updated": "2020-09-04T12:55:04Z",
  "author": "andrew-williams",
  "summary": "It gets an A from us",
  "verdict": "A big screen, an almost everlasting battery and solid specs make the Oppo A9 2020 one of the best affordable phones for those who stream a lot of video, and a still great option for almost everyone else on a limited budget.",
  "pros": [
    "Superb battery life",
    "Better than average night photos",
    "Good-quality stereo speakers"
  ],
  "cons": [
    "Plastic back",
    "Two of the four rear cameras seem to do very little",
    "Color OS isn't for everyone"
  ],
  "article": [
    "The Oppo A9 2020 is an affordable phone with a huge array of features. It has a big screen, an even bigger battery, four rear cameras, a lot of storage and even one of the better budget chipsets.",
    "On paper the Oppo A9 2020 seems almost bafflingly good, but there are three obvious shortcomings. Its screen is not as advanced as those of the Moto G series and the outer shell is plastic. The only glass sits on the screen and cameras, the only metal around the camera housing.",
    "This is one of the best budget phones for those who tend to hit their phone hard with video streaming and gaming on the way to work. It has the screen inches and battery life to make the most of these jobs.",
    "If that describes you then you can probably safely buy it, while if you're looking for other things from your phone then read on to see if the Oppo A9 2020 fits the bill.",
    "The Oppo A9 launched at £220 / AU$399 (around $250, but with no confirmed availability in the US), which is also slightly cheaper than the Moto G8 Plus.",
    "As we say, there's no clear US release date for the phone and considering it landed in the UK and Australia the end of 2019 we wouldn't expect Oppo to debut it there anytime soon.",
    "The Oppo A9 2020 could pass for a more expensive phone from arm’s length. Its back looks almost like curved glass, and has a finish that reacts to light. A color-shifting ‘S’ snakes across the light’s path like some older Moto G mobiles.",
    "It’s large too, and has a slim screen notch. If you told someone you paid twice the price for the phone, they would probably believe you.",
    "That illusion largely falls apart when you pick the Oppo A9 2020 up. The sides and back are plastic. You can tell the rear isn’t glass just by looking. Plastic tends to distort reflections around areas like the fingerprint scanner and camera housing, as the pressure flexes the rear just slightly. Glass does not bend so easily.",
    "The Oppo A9 2020 has curved sides for comfort, but it doesn’t feel remotely as high-end as Oppo’s own Reno 2. That phone is twice the price, though, and this year even Motorola has reverted to using plastic on the rear instead of glass in the Moto G8 Plus.",
    "Size is the other part to bear in mind. Oppo has made a budget powerhouse here, but the large screen and battery mean the A9 2020 may seem intimidatingly large to some of you. It’s also 9.1mm thick, although the slight curvature of the back does take the edge off this.",
    "The use of plastic ceases to matter if you use the included silicone case, and you probably should probably use a case. However, the bundled one is not as good as those bundled with the Reno 2 Z and Reno 2.",
    "The silicone plastic is stiffer, and a lack of attention to detail in its construction leads to the power button losing its click. This is oddly upsetting, and led us to removing the case - you’ll likely be able to find something better online.",
    "Thankfully, Oppo has not also messed up the screen protector. Like most other Oppo phones, a plastic protector is attached in the factory. It saves the heartbreak of scratching your phone within two days.",
    "The Oppo A9 2020 lacks water resistance, like almost every phone at the price. We did at one point accidentally dip the bottom of the phone in some soya milk and it’s still working fine, but this proves nothing more than that it won’t explode on contact with liquid.",
    "The Oppo A9 2020 has a very large 6.5-inch screen. This is significantly larger even than the Moto G8 Plus’s 6.3-inch screen.",
    "Those looking for problems will notice this is not a Full HD screen. It’s a 720 x 1600-pixel panel. The first limitation we noticed was something else, though.",
    "Fresh out of the box, the Oppo A9 2020’s color temperature is quite cold, which in turn makes the just-okay color saturation look worse. One of the first things we did was to go to the Display part of the Settings menu and switch the temperature to its ‘warmer’ setting.",
    "This doesn’t make its color reproduction a match for a high-end mobile, but does give the screen a more pleasing character.",
    "Does the screen resolution matter? Lower pixel density is more obvious on a huge screen like this than the iPhone 11, which only has around 10% more pixels in each direction. But this usually manifests in a slight softness of text, rather than cruder-looking pixelation.",
    "That's thanks to Android’s excellent resolution scaling and that the panel is advanced enough to avoid making the pixel structure at all visible. We’re truly surprised by how legible tiny fonts are when you zoom out in a browser window.",
    "In old versions of Android, text would become ugly and blocky when made of this few pixels, but it now looks good.",
    "Sure, we’d prefer a Full HD screen, but that is the Oppo Reno Z’s job. And crucially, we would rather a 720p+ LCD (as seen here) than a 720p+ OLED.",
    "OLED displays for phones use a PenTile sub pixel arrangement, in which pixels share subpixels. That means the lower pixel density clarity we see here just isn’t possible in an OLED of the same resolution (yes, an OLED would offer better contrast and color).",
    "It’s also important to appreciate what the Oppo A9 2020 can still do very well. Even a 720p+ screen like this is perfect for YouTube streaming. Video footage still looks excellent at this resolution, and the very large canvas makes watching video more enjoyable. We thought we’d dislike this screen, but we like it, quite a lot in fact.",
    "There’s one other thing to bear in mind too: did you know Netflix doesn’t actually stream at resolutions above 720p on most Android phones? Still, if only the sharpest text will do, consider the Moto G8 Plus.",
    "Disclaimer: an earlier version of this review mistakenly claimed the phone didn't have NFC. It does, so you'll be able to use Google Pay on the handset."
  ],
  "headers": {
    "4": "Oppo A9 2020 price and release date",
    "6": "Design",
    "15": "Screen"
  },
  "links": {
    "Moto G8 Plus": "https://www.techradar.com/reviews/moto-g8-plus-review",
    "Reno 2": "https://www.techradar.com/reviews/oppo-reno-2",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review"
  }
}