{
  "source": "https://www.techradar.com/reviews/adt-health-medical-alert-system-review",
  "title": "ADT Health medical alert system review",
  "category": "pro",
  "updated": "2021-04-23T09:20:56Z",
  "author": "jeph-preece",
  "summary": "In our ADT Health medical alert system review, we test and evaluate the products, services, and emergency response center",
  "verdict": "ADT is one of the most well known home security services in the U.S., so the company’s dive into medical alert systems is a natural fit. And while the pricing is average and the systems are good, there are better options.",
  "pros": [
    "Excellent in-home audio quality",
    "Good fall detection"
  ],
  "cons": [
    "Subpar call quality",
    "Slow call response times"
  ],
  "article": [
    "It’s clear that home security is the priority of ADT, as you'll learn in our ADT Health medical alert system review. After all, ADT is one of the oldest and largest home security companies in the U.S. As such, medical alert systems are a natural fit, as both require emergency calls centers. In fact, ADT is one of the only services we reviewed that owns and operates the monitoring centers used in the service.",
    "As a medical alert service, ADT Health offers the same medical alert systems for seniors that other services use, which is a little disappointing. We’d prefer to see more innovation and imagination from a company of this size and reputation. Nevertheless, the use of the Mobilehelp CBS in-home system and the MobileHelp Solo for the on-the-go option is a good choice, as they are quality medical alert systems.",
    "Get a free quote for a medical alert system.",
    "We’ve reviewed over twenty different medical alert companies over the years. Of these, about 60 percent use the MyTrex MXD and 30 percent use the MobileHelp CBS. There are really only a few exceptions in the industry and very few companies have unique systems.",
    "That said, the MobileHelp CBS, which ADT uses for it’s in-home cellular package, is the best option. While the MyTrex MXD has the louder speaker and can have good audio, the audio quality is too inconsistent. In addition to having consistently excellent audio, the MobileHelp CBS also features a display with the time, cellular signal strength, and temperature.",
    "The pendant range on the MobileHelp CBS isn’t great, averaging roughly 86 feet in our tests despite a 600 foot range in the specifications. That said, we quickly learned that having a long range isn’t as good as you’d think.",
    "The further you get from the base station, the less likely you are to hear the emergency responder if you need help or have accidentally activated a call for help. This can be a real issue. Besides, 86 feet is plenty of range to cover an apartment or home. If you’re venturing beyond your yard, you really should consider a mobile medical alert system.",
    "The fall detection add-on was average in our tests. It’s the same sensor used by many other services and recorded 100 percent on simulated falls, but was also very sensitive, activating on falls of just 6 inches.",
    "As mentioned, ADT is one of the few services to own the monitoring centers used when you call for help. Unfortunately, this didn’t result in faster or better calls. The average call response time during our first round of daily three-week tests was 52 seconds, which was slightly above average.",
    "By comparison, GreatCall averaged 20 seconds. GreatCall also owns their call center, but since they don’t have one of the biggest home security fleets in the U.S. to contend with, the calls aren’t prioritized by a computer, resulting in faster response times.",
    "In the second round of tests, ADT averaged 39 seconds, a significant performance improvement, but still only barely above average. Again, GreatCall improved to 15 seconds.",
    "We were not impressed by the quality of the calls with the emergency responders. While the responders were careful to speak clearly and in a slower pace, many of the operators had regional accents that were too strong to understand. This can make for a difficult experience when you’re trying to communicate in an emergency. Also, they never confirmed our identity, which seems strange for a home security company to overlook.",
    "ADT’s focus is clearly on the home security sector of the business. And there’s nothing wrong with that. They’ve been a leader in the home security industry for decades. However, the medical alert service seems tacked on like an afterthought. Nothing about the service or the systems stands out against the competition. They don’t even offer much in the way of resources to help you maintain your independence or help a caretaker. From the website, you can view and compare packages and read testimonials. The transparency of information is lacking.",
    "Of course, ADT Health is one of the few medical alert services to own and operate the emergency call centers.",
    "While the results of our tests were rather disappointing, this means the company takes more responsibility in the training and quality of the operators it employs. In other words, if you have an issue with the quality of your emergency response operators, ADT can do something about it.",
    "With other services that contract out the monitoring centers to a third-part, if you complain, it has little to no impact on the future of your service.",
    "ADT's pricing structure is average across the board. The basic in-home package is $30 per month. The in-home cellular is $35 per month. And the on-the-go mobile system is $40 per month. Unfortunately, unlike most services where you can save money by paying more up front, you don’t save anything with ADT if you pay annually or semi-annually.",
    "That said, we generally recommend you stay on a month-to-month plan because this gives you the most control over your finances. If you need to cancel, you don’t have to go through the hassle of trying to get a prorated refund, if you’re lucky enough to get one.",
    "By comparison, the best services, like GreatCall, are much better priced with much better performance and systems. It might be more convenient to go with ADT if you have their home security system, but otherwise, there are better, more affordable options.",
    "Despite being the biggest company to offer medical alert systems, ADT's medical alert service doesn't stand out from the others, except in all the wrong ways.",
    "We liked the company's choice for an in-home cellular system, the MobileHelp CBS, because it has the clearest speakerphone and a display, but the pendant's range is just okay and the overly sensitive fall-detection pendant has potential to cause a lot of false alerts.",
    "The most disappointing aspect to ADT is the monitoring center failed to impress. Since ADT has the resources to provide exceptional call response times and call quality, we expected more. But instead, we got average call response times and underwhelming call quality with operators.",
    "Unless you want the convenience of using the same service as your home security system, there are much better medical alert services to choose from."
  ],
  "headers": {
    "3": "Medical alert systems",
    "8": "Emergency response center",
    "12": "Medical alert service",
    "16": "Cost comparison",
    "19": "Final Verdict"
  },
  "links": {
    "medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021",
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system"
  }
}