{
  "source": "https://www.techradar.com/reviews/agm-a10-rugged-smartphone",
  "title": "AGM A10 rugged smartphone review",
  "category": "phones",
  "updated": "2020-10-07T11:03:12Z",
  "author": "mark-pickavance",
  "summary": "A practical and affordable tough phone",
  "verdict": "A design that offers decent durability without looking an accessory from a tank. The specification doesn’t deliver the best performance, but this is a convenient device and great value for money.",
  "pros": [
    "Inexpensive",
    "Minimalist design",
    "Decent specification"
  ],
  "cons": [
    "No Wireless charging",
    "Odd placement of OSB-C port",
    "Lacks USA 4G band support"
  ],
  "article": [
    "At Tech Radar we’ve previously covered the AGM X1, X2 and X3 phones, and have generally considered them to be worthy of inclusion in our best rugged mobiles list.",
    "What made these devices stand out is that they are all built to handle a dusty and wet environment, and plenty of hard knocks, but unexpectedly retain some elegance.",
    "The last model we reviewed was the AGM X3, and it came at what we’d consider being a premium price. Can the AGM A10 deliver much of what made the X3 so good, but at a more affordable cost?",
    "At the time of writing, there is only a single model of the AGM A10 available in the UK, but it can be found with differing amounts of storage from the UK release in other regions.",
    "The review version (4GB of RAM and 64GB of storage) can be got from the UK AGM website for a modest £189.99. The US pricing is $179.99, but not many American retailers carry this brand, and you may need to source it from an Asian online retailer.",
    "AGM makes three regional variants that they class as ‘Global’,’International’, and ‘China’.",
    "However, we’d avoid all variants as a US customer, as it doesn’t support the majority of 4G frequencies (bands 38/39/40) used by American service providers or any of the 5G options in the USA.",
    "Many rugged phones put off potential customers by going with extreme styling that only those in the military or construction industry would appreciate.",
    "The AGM A10 isn’t one of those, and at first glance, it looks remarkably normal.",
    "It’s also slim, lightweight and doesn’t have any knurled buttons or unexpected projections along the underside. In short, this looks like so many $200 phones made these days.",
    "There are subtle rubberised corners attached to a metal banding, and the underside is made of a high impact plastic probably reinforced with glass fibre. This construction makes the whole structure very rigid and unlikely to flex even under extreme duress.",
    "The A10 layout of buttons and ports is pretty standard, with a few interesting exceptions.",
    "Power and the volume rocker are on the right side, and the left has SIM tray access, a user-programmable button, and curiously, the USB-C charging port.",
    "That the charging port isn’t on the bottom is an awkward choice, and effectively negates using any general-purpose USB-C charging dock with this phone.",
    "A fingerprint reader is on the upper rear of the phone, forcing the camera and its associated flash to be offset left. There is no audio jack, but a USB-C converter is included in the box along with a tiny 2A travel charger.",
    "The other critical information about this design is that, according to AGM, the phone is IP68 and MIL-STD-810G certified. We’re curious who is giving out these certificates since the US Military, who created MIL-STD-810G, doesn't certify phones.",
    "AGM hasn’t published details of the exact tests it performed, but these typically involve dropping the devices from various heights on to different surfaces, submersion for limited time periods, and exposure to dusty environments.",
    "Probably the most important part of any modern smartphone is the SoC or System-on-a-Chip, and in the AGM A10, it is a quad-core part made by Chinese semiconductor manufacturer Unisoc.",
    "This chip isn’t the monster octo-core CPU that we’ve seen in many Doogee phones, but a more modest layout that combines two Corex-A75 cores with a couple of Cortex-A55s and a PowerVR Rogue GE8300 GPU.",
    "Using two different cores instead of four the same allows for more power efficiency with the distribution of lower priority tasks to the slower clocked A55 cores, saving battery life.",
    "These combinations are becoming common in cheaper phones, and it serves the A10 reasonably well.",
    "Equally, 4G of RAM isn’t a huge memory, but for most users, its enough, and 64GB of storage is sufficient internal capacity.",
    "These parts define a theme with the A10, everything about it is reasonably good, but nothing here is exceptional.",
    "The 5.7-inch display, for example, is a somewhat odd 2:1 ratio 720x1440 resolution, which we wouldn’t class as ‘low res’, but isn’t as high as some phones are offering at this scale.",
    "Battery life is 4400mAh, making it larger than a typical sub-$200 phone, but nowhere near the 10000mAh capacity that we’ve seen from Blackview and Doogee devices.",
    "However, in a few places, the A10 is slightly further from ideal than just not being the best.",
    "The cameras are mediocre by current standards with the rear being only a 13MP sensor with auto-focus and a flash. You can take acceptable images with it, but the colour gamut is odd, the controls are limited, and it can only capture 1080p resolution video.",
    "The front-facing sensor is 8MP fixed focus, but nowhere in the AGM documentation or firmware does it detail what the chip in either sensor is.",
    "Another weakness is the mobile comms side, as most of the critical 4G bands that are used in the USA aren’t supported. That makes the A10 fine for Europe, but less useful stateside.",
    "And, the A10 is supplied with Android 9. While this is a good and relatively stable version of the Google OS, but most new phones are equipped with Android 10, and a few have Android 11 already.",
    "Given the relatively short lifecycle of Android and of phones that use it, this might not be an issue, but it is something you should be aware of before investing in one.",
    "Overall, the results from the A10 were acceptable, especially in respect of the processor and its number-crunching capabilities.",
    "The scores that weren’t great were the storage tests performed by Androbench, suggesting that the internal NAND memory isn’t the quickest variety. And, the 3DMark results are on the low side, revealing this phone to be unsuitable for gaming or simulations.",
    "We’ve seen the PowerVR Rogue GE8300 before, and it’s not the best mobile GPU, but the A10 manages to get more out of it here than we’ve seen from other devices, like the Caterpillar S42.",
    "For general use, the A10 has enough power and performance. Just don’t expect miracles from it if you use demanding applications like VR.",
    "In use, there is very little to dislike about this phone, as it’s a practical shape to hold and reasonably responsive. It’s also light for a rugged design and at a scale that doesn’t make it impractical to put in a coat pocket.",
    "The one blight on it is the side placement of the USB-C port, and that the rubber cover for this needs to be in place for the water-resistance to function.",
    "These issues might have been mitigated if the A10 supported wireless charging, but sadly it doesn’t. That’s a missed opportunity, and AGM should consider adding this feature to the follow-up product.",
    "They should also consider providing a fast charging adapter, for those that want to get their phone ready for the road pronto.",
    "There are three phones that anyone considering the AGM A10 should also consider, the Doogee S58 Pro, the OUKITEL WP5 Pro and Ulefone Armor X7 Pro.",
    "At just £161.99 in the UK, the Doogee S58 Pro has a better camera, more memory, more battery capacity and an octa-core SoC. But, alas like the A10 it doesn’t have band support for frequencies used in the USA.",
    "An alternative is the OUKITEL WP5 Pro, a phone that will work in Europe and South America, and costs just £139.99 in the UK. For that modest outlay, the WP5 Pro offers a slightly smaller screen, octa-core CPU, the same memory and storage, a better camera, double the battery capacity and Android 10.",
    "The Ulefone option is the cheapest at just $139.99 in the USA and supports bands for most of the US carriers. The Armor X7 Pro has a smaller 5-inch display and only 32GB of storage. But, conversely, it uses Android 10, has a better camera designed to work underwater, and roughly the same battery capacity as the A10.",
    "The AGM A10 is close to being great but slightly misses the big prize with a few poor design choices that dent its finely crafted design ethos.",
    "When we consider the price point, the specification is excellent in most respects, with the exceptions of the cameras and the limited 4G band frequencies it supports.",
    "However, it is entering a highly contested product space were not supporting wireless charging, oddly placed USB ports and using Android 9 might be deal-breakers.",
    "To be clear, we’re not saying they should be or that the A10 isn’t worth considering, but they’re boxes that other competitor devices tick.",
    "If those things aren’t issues for you, then the A10 is a highly practical solution that delivers a convenient ruggedised design at an affordable price."
  ],
  "headers": {
    "3": "Price",
    "7": "Design",
    "17": "Hardware",
    "31": "Performance and in use",
    "39": "Competition",
    "43": "Final verdict"
  },
  "links": {
    "AGM X1": "https://www.techradar.com/reviews/agm-x1",
    "X2": "https://www.techradar.com/reviews/agm-x2",
    "X3 phones": "https://www.techradar.com/reviews/agm-x3-rugged-smartphone",
    "best rugged mobiles list": "https://www.techradar.com/best/best-rugged-smartphones"
  }
}