{
  "source": "https://www.techradar.com/reviews/honor-9x-review",
  "title": "Honor 9X review",
  "category": "phones",
  "updated": "2020-05-18T13:55:35Z",
  "author": "tom-bedford",
  "summary": "Could it be Honor’s swan song?",
  "verdict": "The Honor 9X is a fine phone for its price range, and while it won't blow you away with its performance, cameras or display, it still works perfectly well as your day-to-day smartphone.",
  "pros": [
    "Durable pop-up camera",
    "Has a headphone jack",
    "Long battery life"
  ],
  "cons": [
    "Rather big build",
    "Cameras are okay, not great",
    "Slow charging speeds"
  ],
  "article": [
    "Update: the Honor 9X received a surprise successor in the Honor 9X Pro, a newer version of the X smartphone with upgrades in a few areas.",
    "It has a few new features, but it isn't a hugely different phone to the Honor 9X, so we've amended this review with a section on it. You can find that later in the review.",
    "The well-documented Huawei ban debacle in mid-2019 saw the future of Huawei thrown into question, but a relatively forgotten victim of Google’s ban on Huawei using its apps was Honor, the youthful sub-brand of the Chinese company. Future phones from this brand, including its main range as well as the Honor V and Honor X series, will no longer have Google apps.",
    "The last Honor phone to be confirmed to have Google Mobile Services (GMS) is the Honor 9X, from the affordable X range of handsets, a phone which succeeds the Honor 8X. Affordable certainly is the name of the game here, with a modest camera array (well, at least compared to something like the Honor 20), and a middling chipset and screen.",
    "Although the Honor 9X’s designers likely didn’t know it, the phone could be the last from Honor (outside China, where Google apps aren’t used anyway). So is it a decent final offering, and a reason to jump on the Huawei ship before it crashes, or should you turn down this last opportunity?",
    "In the UK, and many parts of Europe, you can pick up the Honor 9X now for £249.99 (roughly $320, AU$470). That's a decent price for a budget phone, although it's now ineligible for our list of best cheap phones, as the price cap for that is lower.",
    "The Honor 8X could be bought for £229.99 (roughly $310, AU$435) in the UK, although it wasn't available in many other regions. The Honor 9X then is a little pricer, especially since the 8X has seen price cuts over the course of its existence.",
    "For an affordable smartphone, the Honor 9X has a big screen. It’s a 6.6-inch display, which is a little on the large side for a smartphone, so unless you have rather big hands it may be hard for you to properly use the device.",
    "The screen resolution is 1080 x 2340, so it’s a fairly sharp display, but the fact it’s LCD may put some people off. LCD screens are generally considered lower quality than more popular OLED-based displays, as they have relatively poor black reproduction and flatter looking colors. Saying that, the Honor 9X has one of the best-quality LCD screens we’ve seen, with colors that seem to ‘pop’ more than competitors. Max brightness isn’t too high, though.",
    "Thanks to the Honor 9X’s pop-up front-facing camera (which we’ll get to in a second), there’s no notch or ‘punch-hole’ taking up valuable screen space. Sure, there’s a fairly noticeable chin at the bottom of the screen, but generally the 91% screen-to-body ratio is commendable.",
    "The phone has a rather conventional design – it’s quite big, as previously stated, and feels a little heavy too at 197g. It has a Gorilla Glass front, and what feels like a Gorilla Glass back with plastic frame, however Honor hasn’t confirmed its body materials.",
    "There’s a rear-mounted fingerprint sensor quite high on the back of the phone, which we found rather convenient to reach, but this of course depends on hand size, so if you’ve got a smaller hand it may be out of reach. We used a UK release of the Honor 9X, but the device in China had a side-mounted fingerprint sensor, so if you’re importing the device from Asia, you might find it looks a little different.",
    "Just next to the fingerprint sensor is the tri-lens camera array. It’s housed in a bump, but it’s a small bump compared to similar mounts on other phones, and wasn’t as inconvenient as a result.",
    "Back to that front camera – it’s fine, with a square design that’s pretty conventional as pop-ups go. The built-in drop detection system automatically recalls the pop-up camera when the phone is falling, so you’re not at risk of damaging it, but the pop-up takes a little longer than others to fully extend, so it is possible you could damage the camera if you dropped it from a low height.",
    "You’ll find the volume rocker and power button on the right edge of the Honor 9X, and the bottom has a USB-C port. This type of port is industry standard, but some budget phones still use micro USB ports, so the presence of USB-C here is a treat, as it makes charging a lot quicker. There’s also a 3.5mm headphone jack. These are appearing in fewer and fewer phones, so if you still like using wired earphones this is one of the few recent handsets you can pick up that will still have a port for them.",
    "The titular feature here is the rear pattern – when viewed at certain angles, the back of the phone has a 3D gradient ‘X’ pattern, similar to how the Honor View 20 has a ‘V’ pattern on the back. It’s a nice touch, and it makes the Honor 9X look that much more distinct, but the design can easily be concealed by smudges from fingerprints."
  ],
  "headers": {
    "5": "Price and availability",
    "7": "Design and display"
  },
  "links": {
    "Honor 9X Pro": "https://www.techradar.com/reviews/honor-9x-review",
    "Huawei ban": "https://www.techradar.com/news/huawei-ban",
    "Honor 8X": "https://www.techradar.com/reviews/honor-8x",
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review",
    "best cheap phones": "https://www.techradar.com/news/best-budget-smartphone",
    "Honor View 20": "https://www.techradar.com/reviews/honor-view-20-review"
  }
}