{
  "source": "https://www.techradar.com/reviews/alert1-review",
  "title": "Alert1 review",
  "category": "pro",
  "updated": "2020-10-27T16:11:51Z",
  "author": "jeph-preece",
  "summary": "In our Alert1 review, learn why this medical alert company simply doesn't compete with the best",
  "verdict": "With high monthly prices, poor audio quality, and a slow call response time, Alert1 simply isn’t competitive enough to compare to the best medical alert systems on the market.",
  "pros": [
    "Above-average pendant range",
    "Good fall detection"
  ],
  "cons": [
    "Expensive pricing",
    "Slow call response time"
  ],
  "article": [
    "In our Alert1 review, we explore the companies five package options: Home (with optional cellular adapter), Home Fall Detection, Mobile, Mobile Fall Detection, and Mobile + Home Fall Detection. Unlike with most services, the fall detection pendant isn’t an add-on but a separate package that features just the Home system with a fall detection pendant.",
    "While the mobile GPS medical alert system is commonly used among other services, Alert1's in-home system is not. At least, not anymore. When we first started reviewing medical alert systems six years ago, this model was more common. However, most companies have moved on to the MyTrex MXD or the MobileHelp CBS.",
    "Get a free quote for a medical alert system.",
    "The same medical alert system is used for both the in-home landline system and the in-home cellular system. When you order the cellular option, you receive an adapter that plugs into the system to connect to a cellular network rather than relying on a landline. With most services, the cellular system is already set up upon arrival. You just flip a switch. With this system, you have to put it together yourself and the adapter is not a small item. It takes up some space, which can be an issue if you have limited counter space.",
    "The pendant range for the in-home system averaged 100 feet, which was above average. Most of the MyTrex and MobileHelp systems we tested averaged around 77 and 88 feet. Despite having a 1,000 foot rating, 100 feet is actually perfect for a home or apartment. If you roam any further than this, you risk not being able to communicate with the base station in an emergency or a false alert.",
    "In the fall detection tests, the Alert1 fall detection pendant was the bright spot of the service’s performance. It detected fall with accuracy while not being too sensitive that it would result in too many false alerts. That said, it will cause false alerts. Even dropped from 12 inches, it detected falls, which means you can trigger a call for help easier than you might expect.",
    "The fall detection was much better on the mobile GPS device, which is the Kelsi mobile PERS device. The audio quality on the Kelsi isn’t as great as other mobile devices, but it’s certainly better than the audio quality of the in-home base station, which lacks both clarity and volume.",
    "We were quite taken aback by the cellular adapter included with the in-home cellular system. SInce there are no pictures of it on the company’s website, we had no way of expecting it would be so big. It looks like a WiFi modem and takes up a significant amount of space. With most in-home cellular systems, you simply flip a switch to connect to the cellular signal.",
    "Alert1’s poorest performance was with the emergency call response speed. In the first round of three-week daily testing, it averaged 67 seconds per call. This was among the slowest services in the test. In the second round of three-week daily testing, while most services were faster, Alert1 was slower, averaging nearly 120 seconds per call. By comparison, GreatCall averaged 20 seconds and 15 seconds respectively. When you’re in an emergency, the difference in these times feels like a canyon. Even when you’re not in an emergency, it feels like a canyon.",
    "In addition, the quality of the calls was disappointing. While most operators we talked to were professional, we had quite a few calls where the operators ended the call before asking us if we were okay. Our identity was never confirmed. And too often, the operators sounded tired and bored. In several calls, the operators were pressing buttons that made loud beeping to occur over the line. Overall, it did little to alleviate the anxiety associated with calling an emergency call center.",
    "Alert1 is pretty aggressive with their marketing. No matter when you visit the website, you’ll get a barrage of marketing, with a countdown timer to receive free two-day shipping and free equipment, even though this has always been available for as long as we’ve reviewed Alert1.",
    "On a positive note, Alert1 does offer more accessories to help with aging in place than other services. While they have the standard accessories, like lockbox and fall detection pendants, they also have medication reminders, fall protection kits, and more.",
    "At first glance, Alert1 appears to be one of the most affordable medical alert systems on the market. For example, they advertise the in-home landline system as $16 per month, which is $4 less than Bay Alarm Medical $20 per month cost. However, this deal only happens if you lock yourself into a three year plan, paid all at once. By paying for three years in advance, you get six months for free, which significantly lowers the monthly cost.",
    "However, we don’t recommend paying in bulk unless you know you’re going to use the medical alert system for that period. Paying in bulk often means you don’t get the full refund if you cancel early. And while we tried to get an answer about the refund, we’re not sure what the exact policy is if you were to cancel before the three year period.",
    "Alert1’s in-home systems are dated and don’t have the clarity or volume of other widely used systems. And you need both clarity and volume to have an effective medical alert system. That said, the pendant range was excellent and the fall detection sensor was pretty accurate, though a bit sensitive. We like the Kelsi mobile alert system, but it's not amazing. Average is a good way to describe it. And we thought it odd that the in-home system included a modem-like cellular adapter that took up a lot of space.",
    "Still, it’s the slow response time, the indifferent call quality, and the pricing structure that is the biggest concern. To put it simply, there are better, more affordable options on the market."
  ],
  "headers": {
    "3": "Medical alert systems",
    "8": "Emergency response center",
    "10": "Medical alert service",
    "12": "Cost comparison",
    "14": "Final Verdict"
  },
  "links": {
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system"
  }
}