{
  "source": "https://www.techradar.com/reviews/samsung-t7-touch-external-ssd",
  "title": "Samsung T7 Touch external SSD review",
  "category": "computing",
  "updated": "2020-01-21T13:00:45Z",
  "author": "desire-athow",
  "summary": "A well needed update to a much loved external storage device",
  "verdict": "The Samsung T7 Touch is an exquisite piece of technology; no it won’t prevent hacker groups backed by nation states from hacking your storage device but it will allow you to make it safer while significantly accelerating data transfer, all for a price tag that’s very palatable for a top-shelf product",
  "pros": [
    "Very fast",
    "Great construction",
    "Surprisingly affordable",
    "Platform agnostic"
  ],
  "cons": [
    "Cables could be longer",
    "IP68 would be a nice touch",
    "No bundled Samsung Cloud"
  ],
  "article": [
    "It’s been a while. Samsung took more than a year to deliver a viable successor to the very well received T5. The T7, as it is now known, is available in two versions; a plain-vanilla model and one that packs a fingerprint reader and is known as the T7 Touch.",
    "Three different capacities are available (500GB, 1TB, 2TB) and two colour schemes (black and silver). Both the T7 and T7 Touch come with a three-year limited warranty, Samsung’s Portable SSD Plus 1.0 software and AES 256-bit hardware encryption.",
    "Pricing varies from $130 for the 500GB model to $400 for the 2TB one; the 1TB T7 Touch - which we review today - costs $230. Note that the launch date for the T7 is due for later in Spring 2020.",
    "The T7 Touch looks very similar to the T5 but is a tiny bit bigger and heavier. 85 x 57 x 8.0 mm for a weight of 58g for the former and 74 x 57.3 x 10.5 mm for a weight of 51g for the latter. The hardware needed for the biometric feature explains the gain in weight.",
    "Samsung stuck with the solid aluminum unibody construction which fits very snuggly in the palm of your hand.",
    "The LED square also lights up with a cool blue glow to keep the user informed of what the SSD is doing at a glance. There’s a Type-C connector to which either of the two bundled cables can be connected.",
    "All in all, a very clean and straightforward product that is utilitarian while being pleasing on the eye.",
    "This is where the biggest difference between the T5 and the T7 (and the T7 Touch) can be found. Samsung has swapped the SATA-based SSD for an NVMe SSD behind the USB 3.2 Gen 2 bridge to offer up to significantly better performance. It is very likely that the T7 Touch uses sixth-generation 136-layer V-NAND as opposed to the T5’s 64-layer V-NAND.",
    "The T7 Touch came formatted as exFAT with a usable capacity of 931GB. It had three files on it, one of which was the bundled software - the Samsung Portable SSD Plus software - needed to enable fingerprinting capabilities.",
    "You can also download the software as an app to use the drive with your Android smartphone (assuming the latter has a Type-C connector). Setting up the fingerprint capabilities is straightforward, as easy as doing it on a smartphone and so is adding password protection to the T7 Touch.",
    "Note that the device needs to be connected at all times for the fingerprint reader to work. It can be a bit of an issue should you have to move the drive around.",
    "Samsung claims that the drive can achieve read/write speeds of up to 1.05GBps, which it says, is about twice what the T5 could reach. In real life we measured 1032 and 924MBps on CrystalDiskMark which is not that far from Samsung’s own readings",
    "If you want a device that offers seamless encryption, then the T7 Touch is hard to …. touch at this price point but then again, where it misses out on a knockout is that it doesn’t offer any IP68/MIL-STD-810G rating.",
    "If a military-grade security is an absolute must, then you won’t find a fingerprint reader anywhere. Instead, secure storage specialists like Apricorn Aegis or Datashur, will use a numeric keypad. The 1TB Fortress SSD from the former costs nearly twice the price of the equivalent T7 Touch. It is also far bigger and is much slower. On the other hand, it is FIPS 140-2 Level 2 Validated and comes with a number of security features that the T7 Touch doesn’t offer.",
    "If the Samsung brand is compulsory, then the T5 is the obvious choice if you can live without the fingerprint reader. It is a bit slower but retains the same form factor and design. At just under $167 at Amazon, it is far, far cheaper than the T7 Touch, although the price difference with the T7 is likely to be much smaller.",
    "If you don’t care about either and just want an external solid state drive, then the ADATA SD600Q should be high on your list. It is waterproof, shockproof and costs only $102 for the 960GB version. It meets the U.S. Military MIL-STD-810G 516.6 standard but is far slower than the T7.",
    "The T7 Touch can’t be touched (pun intended) when it comes to procuring the right balance between security, speed, portability and pricing. Yes, it doesn’t do IP68 and doesn’t have any of the security certifications most of its more expensive rivals have, but at this price point, nobody really cares.",
    "Indeed, what Samsung has done with the T7 Touch is raising the baseline for securing your data on the move by adding biometrics to password protection; expect others to follow suit swiftly both on external SSD and flash drives as well. Where the latter will struggle to beat the T7 Touch is on performance and on price.",
    "We’re slightly disappointed that Samsung didn’t provide a free trial for its own Samsung Cloud service (similar to what WD does) as it could have provided with a nice reminder to users that they should always backup their files in case of any snafu. Check out our lists of the best cloud storage providers and cloud backup services.",
    "All this doesn’t distract us from the fact that this is a speedy and safe external storage device that fully deserves a best-in-class award from TechRadar Pro. Bravo Samsung!"
  ],
  "headers": {
    "3": "Design",
    "7": "Hardware",
    "8": "In use and performance",
    "12": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "500GB model": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1395574180276436700&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fcomputing%2Fmemory-storage%2Fportable-solid-state-drives%2Fportable-ssd-t7-touch-usb-3-2-500gb-black-mu-pc500k-ww%2F&article_name=Samsung%20T7%20Touch%20external%20SSD%20review&article_url=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsamsung-t7-touch-external-ssd",
    "2TB one": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-2046619517934694400&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fcomputing%2Fmemory-storage%2Fportable-solid-state-drives%2Fportable-ssd-t7-touch-usb-3-2-2tb-black-mu-pc2t0k-ww%2F&article_name=Samsung%20T7%20Touch%20external%20SSD%20review&article_url=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsamsung-t7-touch-external-ssd",
    "1TB T7 Touch": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-4533169145273877000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fcomputing%2Fmemory-storage%2Fportable-solid-state-drives%2Fportable-ssd-t7-touch-usb-3-2-1tb-black-mu-pc1t0k-ww%2F&article_name=Samsung%20T7%20Touch%20external%20SSD%20review&article_url=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsamsung-t7-touch-external-ssd",
    "1TB Fortress SSD": "https://www.techradar.com/reviews/apricorn-aegis-padlock-ssd",
    "ADATA SD600Q": "https://www.techradar.com/reviews/adata-sd600q-ruggedized-external-ssd",
    "Samsung Cloud": "https://www.techradar.com/news/samsung-cloud-storage-everything-you-need-to-know-about-it",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "cloud backup services": "https://www.techradar.com/best/best-cloud-backup"
  }
}