{
  "source": "https://www.techradar.com/reviews/efile",
  "title": "eFile online tax filing service review",
  "category": "computing",
  "updated": "2021-03-05T07:27:09Z",
  "author": "rob-clymo",
  "summary": "Get budget filing from the eFile camp",
  "verdict": "If you’re after a quick-fix online accountancy solution then eFile offers quite a lot for not much in the way of outlay. However, it lacks the refinement of rivals while both support and mobile appeal are key weaknesses currently.",
  "pros": [
    "Low cost solution",
    "Fast and simple"
  ],
  "cons": [
    "No free State options",
    "Limited support",
    "Lacking an app"
  ],
  "article": [
    "eFile is online tax software that gets a lot of attention for being, on face value at least, completely free. While it has free aspects, eFile does require you to pay money if you’re filing a state tax return. Adding to the slightly unusual approach with this service is the way that eFile has quite a lot of limitations, which might reduce its appeal to many potential customers.",
    "Alternatives in the paid-for tax and accounting software world include the likes of H&R Block, TurboTax, TaxAct, TaxSlayer, Jackson Hewitt Online, Credit Karma Tax and FreeTaxUSA.",
    "If you’ve got anything other than super-basic requirements then the chances are eFile might not fit the bill. However, it also sports some useful features and functions, especially if you’re prepared to go down its paid-for services route. The eFile.com strapline is ‘It’s less taxing’, but is it really less expensive?",
    "Quite how much you pay, or don’t pay, will obviously depend on what you have to file in terms of tax documentation. Currently, eFile comes in three different variants, starting out with the base-level Free Basic. This is displayed on the eFile website as originally costing $9.95, but is currently free.",
    "Underneath the File Free button link though, you’ll need to read the State Returns Optional small print, which states: Prepare and eFile multiple State Returns for one low price. The price for unlimited State Returns is only $28.95. No credit card is needed if you are getting a Tax Refund. During checkout, you can choose 'e-Collect' as your payment method to have your fees deducted from your refund.",
    "eFile also has a middle-tier Deluxe option, which did cost $39.95 and currently costs $29.95. You can start for free, while the same State Returns point as outlined above applies too.",
    "The top-tier for eFile is Premium, which did cost $49.95 and now costs $39.95, while the picture for State Returns is the same as above. eFile is known to offer occasional coupon codes for further discounts, which are worth keeping an eye out for.",
    "There are some limitations on the feature front if you’re using eFile in its most basic guise. You can't claim any income except that coming via W-2, while the Deluxe option doesn’t beef things up much either.",
    "Really then you need to head for the Premium tier in order to exploit the full potential of eFile, which does allow you to tackle most of the major tax filing forms that you’ll probably be interested in. It’s also useful if you're self-employed.",
    "The interface works using several sections, where you insert your data covering common ground such as income, expenses and so on. Inside each section there is the capacity to drill down into sub-sections, all of which culminates in arriving at the right forms to complete your filing duties. It’s no-nonsense and generally effective.",
    "You’ll find that getting started with eFile and subsequently using it offers a reasonably brisk experience. Being browser-based it chugs away nicely and the interface doesn't have too much in the way of obstacles to slow it down.",
    "Once you’ve got used to the overall layout, and picked your way through the various progress pages you should find that eFile is as good as many of its rivals in performance terms.",
    "The other bonus is that the interface lets you skip to other sections easily, which might appeal if you’re prone to filling in random sections rather than in an orderly fashion. eFile seems perfectly happy letting you do this, without delivering any performance issues while you keep it guessing.",
    "You’ll find that the eFile interface works reasonably well, although it doesn't have quite the same user-friendliness of other rival products outlined in our guides. The good thing is that eFile can be used in a couple of ways, which depending on your familiarity with both it and the way these online tax tackling services work might make your workflow less stressful.",
    "Indeed, there’s a version that effectively handholds you through the steps, which can be a real boon if you’re a newbie to the world of online tax filing. As you work through the stages of filing your tax return there are handy calculators, though these can be slightly problematical if you’re not up to speed with the subject matter. Adding to this is the fact that pages are quite busy, so there's the need to juggle a lot of balls as you go.",
    "If you get easily rattled by having to tackle your filing without much in the way of help or assistance then you might be put off by eFile’s support structure. It has a fairly limited approach in this respect, with an online ticket filing system that lets you contact eFile support staff with issues.",
    "The Support hub pages on the website are a bit of a mish-mash of links to other locations and the whole thing is a little bit chaotic. While you might be glad that you’re not having to pay a premium for support, some other rivals will charge for human contact and in some cases that can be worth the additional expenditure. This is especially so if you’re not confident with what you're doing.",
    "eFile is authorized by the IRS, which puts it into the recommended pile of online tax preparation packages. And, it also comes with most of the features and functions that you’ll need in order to get your filing done. However, there are a few compromises by going down the budget route.",
    "For a start, if you live in a state with income taxes then you’ll need to pay to use eFile, so the free aspect loses its appeal somewhat. The eFile website is rather frenzied too, support is lacklustre and there’s no app for people who prefer to tackle their taxes on-the-go.",
    "If you’re looking for a ‘Lite’-style package then eFile might well fit the bill, but if you’re easily bamboozled come tax-filing time then it might be prudent to invest in a less chaotic option."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Features",
    "10": "Performance",
    "13": "Ease of use",
    "15": "Support",
    "17": "Final verdict"
  },
  "links": {
    "eFile": "https://www.efile.com",
    "tax software": "https://www.techradar.com/best/best-tax-software",
    "accounting software": "https://www.techradar.com/best/accounting-software-small-business",
    "H&R Block": "https://www.techradar.com/reviews/handr-block",
    "TurboTax": "https://www.techradar.com/reviews/intuit-turbotax",
    "TaxAct": "https://www.techradar.com/reviews/taxact",
    "TaxSlayer": "https://www.techradar.com/reviews/taxslayer",
    "Jackson Hewitt Online": "https://www.techradar.com/reviews/jackson-hewitt-online",
    "Credit Karma Tax": "https://www.techradar.com/reviews/credit-karma-tax",
    "FreeTaxUSA": "https://www.techradar.com/reviews/freetaxusa",
    "Free Basic": "https://www.efile.com/tax-return/",
    "Deluxe": "https://www.efile.com/tax-return/",
    "Premium": "https://www.efile.com/tax-return/",
    "guides": "https://www.techradar.com/best/best-tax-software",
    "income taxes": "https://www.techradar.com/best/best-tax-software"
  }
}