{
  "source": "https://www.techradar.com/reviews/lg-ultragear-34gn850",
  "title": "LG UltraGear 34GN850 review",
  "category": "computing",
  "updated": "2020-07-22T11:01:35Z",
  "author": "jeremy-laird",
  "summary": "Large and luscious",
  "verdict": "LG’s luscious new 34-inch 160Hz NanoIPS monitor is a gamer’s delight. But it comes at a heck of a price",
  "pros": [
    "Luscious IPS visuals",
    "Zappy pixel response",
    "Super all-round performance"
  ],
  "cons": [
    "Only offers HDR400 capability",
    "It’s awfully expensive",
    "No USB-C connectivity"
  ],
  "article": [
    "How much does a full-featured 34-inch curved gaming monitor cost? According to LG, that’ll be a cool $1,000 / £1,000. At least, that’s near enough what the new LG UltraGear 34GN850 goes for, with listings typically around $995 (£969, AU $1,630). That’s a chunk of money by any metric, so this monitor had better be mega.",
    "On paper, it certainly ticks plenty of boxes. The 34-inch curved panel sports 3,440 by 1,440 pixels. If that’s predictable, LG’s Nano IPS screen is a bit special. LG says it’s good for 1ms response, which puts it on a par with the best TN panels. Impressive.",
    "Speaking of speed and slickness, you also get 160Hz refresh, plus both Nvidia G-Sync and AMD FreeSync Premium support. For the record, G-Sync support is G-Sync Compatible Verified rather than one of the fuller featured G-Sync offerings based on Nvidia’s in-monitor image processing chipset.",
    "But what of HDR support, you ask? It’s present, but also an area where the LG UltraGear 34GN850 is a little light on spec given the heady price point. You only get VESA DisplayHDR400 certification. That’s pretty much the very lowest available rung of HDR certification. So the 34GN850 lacks local dimming and tops out at 400 nits.",
    "Another relative disappointment is the omission of USB Type-C connectivity. Now, it’s true that USB-C is arguably not a top priority for gamers, who will mostly be connecting this panel to a beefy desktop rig. But a fair few gamers use portables and, for at least some of them, the ability to drive the display, charge and connect peripherals with a single cable will be missed.",
    "That said, it’s a great looking bit of kit with its Vader-esque glossy black plastic and a few flashes of the obligatory “gamer red” to spice things up without tipping over into adolescent over exuberance. It also offers a good range of height and tilt adjustment.",
    "On the subject of great looking things, the 34GN850’s LG NanoIPS panel certainly falls into that category. It positively zings with colour and vibrancy. Contrast is great too, which isn’t always the case with IPS screens, especially those rated at a mere 1,000:1 for static contrast.",
    "As for the questions of speed and response, the answer is qualified. The 160Hz refresh will be bags for all but the most hair-trigger honed of esports aficionados. Paired with either G-Sync or FreeSync and a powerful graphics card, this monitor is nothing if not buttery smooth.",
    "The pixel response is a little more complicated. LG has included three levels of pixel overdrive in the UltraGear 34GN850’s OSD menu. The top setting is very quick, but also suffers from inverse ghosting. The middle setting is a better compromise. Again, it’ll be good enough for nearly all gamers. But the most sensitive will recognise that the best TN panels are still that little bit more resistant to blur.",
    "It’s a similar story with the HDR capabilities. The 34GN850 is a clear cut above a typical SDR display for brightness and dynamic range. But it doesn’t get close to the eye-pummeling punch of a true HDR screen.",
    "The bottom line? Almost all games look gorgeous on the LG’s UltraGear 34GN850. But improved HDR capability and the addition of USB-C would make it easier to swallow that prodigious price tag. That’s especially true when you consider that 4K HDR high refresh monitors, like the Acer Predator XB3, can now be had for less money."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don't buy it if..."
  },
  "links": {
    "Acer Predator XB3": "https://www.techradar.com/reviews/acer-predator-xb3-xb273k"
  }
}