{
  "source": "https://www.techradar.com/reviews/epyc-video-conferencing",
  "title": "Epyc video conferencing review",
  "category": "computing",
  "updated": "2020-11-10T15:19:17Z",
  "author": "richard-sutherland",
  "summary": "Many neat features but a buggy interface",
  "verdict": "Epyc video conferencing is priced competitively, but performance and usability problems stop it from shining.",
  "pros": [
    "Inexpensive",
    "Easy to share meeting room info"
  ],
  "cons": [
    "User interface quirks",
    "Middling video quality"
  ],
  "article": [
    "Epyc is a video conferencing tool from the developers of RemotePC and IDrive. It’s relatively new on the market, with the Epyc website and mobile apps first appearing in mid-2020. Essentially, it is a standalone version of RemotePC Meeting, which is a video conferencing tool only available as part of a larger software suite.",
    "In our Epyc video conferencing review, we test whether the newcomer can compete with the best video conferencing software on the market.",
    "Epyc has one free plan and one paid plan. The free plan limits the length of your meetings to one hour, and there’s limited recording and no user management features.",
    "The paid price plan is $9.95/host. There are no limits on the number of meetings you can have, the length of the meetings, or the length of any recordings made.",
    "Epyc video conferencing has a long list of features designed to make company video conferencing easier and more effective.",
    "It’s easy to invite people to your meetings: you just send them a URL. Meetings can be scheduled in advance, with support for Google, Yahoo, and Outlook calendars. You can send out batch emails inviting people to your meetings and manage users in the administration console. A Chrome extension makes it possible to join meetings with a single click.",
    "If an employee can’t attend a video conference because of a poor internet connection, they can phone in instead. All they have to do is call the number and enter the right PIN to join your meeting.",
    "Participants in video conferences can exchange messages and share files. You can share your screen or part of it, and there’s a powerful whiteboard for brainstorming ideas with other attendees. Meetings can be recorded, and you can use a virtual greenscreen background to make your presentations more professional.",
    "You can use Epyc video conferencing through your web browser, and there’s a desktop app too. There are basic apps for Epyc on the Apple App Store and Google Play Store, but we found that some features didn’t work on them. For example, when someone shared their screen on Epyc, it didn’t show up on the mobile app. The mobile interface also lacks refinement. Sometimes it’s not clear how to return to the main menu from the submenus, and there’s inconsistency in how some of the submenus are accessed.",
    "We found the quality of videos to be underwhelming and the latency to be quite high. Even with a video camera recording at 30 frames per second, the received video was consistently around two to three frames per second on a 68 Mbps internet connection.",
    "That said, some of the features are praiseworthy just for how easy they are to use. Send someone your Epyc URL, and they can quickly join your meeting. Scheduling is good too, and there are ample tools that you can use to make a presentation engaging. Unfortunately, even the desktop app has its faults. If you enter a meeting ID incorrectly, the application just sits there forever until you restart it.",
    "Support for Epyc is relatively poor at the time of writing. Although there is a technical support line in the USA and UK that’s open Monday to Friday, 6 AM to 11:30 PM PST, when we asked questions about Epyc, the RemotePC agents had no information on the product. Indeed, they weren’t aware of its existence, suggesting that it’s not high on the company’s list of priorities at the moment.",
    "You have a three-page FAQ to get answers to your queries. This includes guides for a few of the key features of the products, but it’s far from comprehensive.",
    "There are a few security features that you can use with Epyc video conferencing. You can enable Trusted Devices, which sends a confirmation to your registered email address when a new device is used to log into your account. Alternatively, you can use two-step authentication, so you need to enter a verification code every time you log in.",
    "For meetings, you can set a password that attendees need to know. You can also require your permission to be granted before anyone joins your meeting.",
    "For a video conferencing solution with better integration with third-party software, we recommend RingCentral Video. You can use it with Slack and Microsoft 365, among others. We also like its high degree of administrator control and how it’s easy to pinpoint any network performance issues.",
    "Zoom has been getting a great deal of press recently, and it’s a solid choice in the video conferencing market. With a paid account, you can have up to 1,000 participants at a time, with up to 49 videos on a single screen.",
    "Epyc has a generous free plan, and at $9.99/host/year, the paid plan is still much cheaper than most leading video conferencing software solutions. It’s also easy to start up a meeting and share it with people. But the software needs refinement before we fully recommend it. In testing, we encountered bugs that required us to restart the software, video quality issues, a lack of documentation, and poor customer support.",
    "If IDrive fixed all the bugs in the software and supported it better, it could be an interesting low-cost video conferencing alternative to the big players in the market. As it stands, there are better options available."
  ],
  "headers": {
    "2": "Epyc video conferencing: Plans and pricing",
    "4": "Epyc video conferencing: Features",
    "8": "Epyc video conferencing: Interface and in use",
    "11": "Epyc video conferencing: Support",
    "13": "Epyc video conferencing: Security",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Epyc": "http://www.epyc.com/",
    "RemotePC": "https://www.techradar.com/reviews/remotepc",
    "IDrive": "https://www.techradar.com/reviews/idrive",
    "best video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "calendars": "https://www.techradar.com/best/best-calendar-apps",
    "share files": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "presentations": "https://www.techradar.com/best/best-presentation-software",
    "Scheduling": "https://www.techradar.com/best/best-employee-scheduling-software",
    "email address": "https://www.techradar.com/best/best-email-clients",
    "two-step authentication": "https://www.techradar.com/news/what-is-2fa",
    "password": "https://www.techradar.com/best/password-manager",
    "RingCentral Video": "https://www.techradar.com/reviews/ringcentral-video",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Zoom": "https://www.techradar.com/reviews/zoom"
  }
}