{
  "source": "https://www.techradar.com/reviews/lg-sn11rg-dolby-atmos-soundbar",
  "title": "LG SN11RG Dolby Atmos Soundbar review",
  "category": "audio-visual",
  "updated": "2020-06-17T18:30:26Z",
  "author": "john-archer",
  "summary": "LG’s most serious and exciting soundbar yet",
  "verdict": "The LG SN11RG is an outstanding soundbar. It produces a huge, detailed sound stage which even includes convincing height effects when listening to Dolby Atmos music and movies. You could potentially cobble together a decent sound system for similar money - but the SN11RG combines its serious performance with easy set up and a space-saving design.",
  "pros": [
    "Well-designed main soundbar",
    "Mostly great sound quality",
    "True rear/upfiring speakers",
    "Clever audio processing"
  ],
  "cons": [
    "It’s not exactly cheap",
    "Bass can lack clarity",
    "Occasional lack of impact",
    "No HDR10+ passthrough"
  ],
  "article": [
    "Without any doubt about it, the LG SN11RG is the company’s flagship soundbar for 2020. In fact, it’s much more than just a soundbar, in that it ships with both a substantial external subwoofer and a pair of heavy duty rear speakers.",
    "With its 7.1.4-channel configuration, it's a complete audio arsenal.",
    "The SN11RG also carries true up-firing rear and front drivers to deliver the height effects of Dolby Atmos and DTS:X soundtracks, and sees LG continuing its so-far impressive collaboration with high-end British AV brand, Meridian.",
    "The main soundbar boasts an attractive, practical design and supports eARC with Dolby Vision. Plus, it has an AI Sound Pro processor that can convert pretty much any incoming sound format - even vanilla stereo - into a full multi-channel output that although not perfect, sounds spectacular. It's not cheap, though.",
    "The LG SN11RG is available now for $1,600 / £1,499 / AU$1,699 - making it one of the best soundbar deals for Australian audiophiles.",
    "If you’re motivated purely by sound quality, you could just about put together an AV receiver/speaker combi for under that amount that could sound even better than the SN11RG does. The whole point of the SN11RG, though, is that it’s designed to make it both easier and more aesthetically appealing to bring big home cinema sound into your living room.",
    "The four separate parts of the LG SN11RG system vary in their attractiveness. Fortunately the main soundbar, which you’ll find yourself looking at the most, is easily the most appealing. It’s slim enough to easily sit under the majority of desktop-mounted TVs, and its top edge boasts a sleek brushed metal-style finish.",
    "Note, though, that it is exceptionally long - nearly 1.5m (around 60 inches), in fact. So you may well find that its ends hang off the edges of your TV furniture.",
    "It’s good to see the soundbar’s front edge sporting a bright, nicely presented LED. This provides such helpful information as the sound format you’re receiving, which input you’ve selected, and which speakers you’re tweaking if you’re adjusting the sound balance. The LED dims after a few sections of inaction, so as not to distract you when you’ve settled down to watch a film.",
    "The subwoofer looks pretty utilitarian compared with the main soundbar; just a chunky black tower, really. But you could potentially hide it behind a bit of carefully positioned furniture.",
    "The rears are more about function than form too, resembling smaller versions of the subwoofer. Their size and weight, though, bodes well for their performance. Plus, all four components connect to each other wirelessly, thankfully, so there’s no need to worry about long, messy cable runs.",
    "The SN11RG’s remote control is small and compact, and most of its key buttons are sensibly located and pleasingly responsive. A little cluster of smaller, less important buttons at the remote’s bottom end are less helpful, but most people won’t need to use these very often.",
    "The star attraction of the LG SN11RG is its ‘true’ 7.1.4-channel configuration. The main soundbar component carries center, left and right drivers on its front, while speakers built into each of its ends angle sound to each side of your room. Plus two upfiring drivers on the top edge bounce sound off your ceiling to create the front half of a Dolby Atmos or DTS:X height effect.",
    "The rears provide both front-firing drivers and upfiring drivers, while the ‘.1’ part of the set up is down to the dedicated subwoofer. This boasts a 7-inch driver, and the whole system claims to be capable of a colossal 770W RMS of audio output.",
    "The LG SN11RG’s connections are decent. They comprise two HDMI inputs, one HDMI output, a USB port for multimedia playback from USB storage devices, and an optical digital audio input. The HDMI output supports Audio Return Channel (ARC/eARC), so that audio - including object-based sound formats - can be passed through compatible TVs to the soundbar.",
    "The HDMI loopthrough passes 4K and HDR - including Dolby Vision - through to suitably capable TVs. It’s a pity, though, that I couldn’t get the soundbar to pass through support for the HDR10+ system (an alternative to Dolby Vision).",
    "The SN11RG system is fairly straightforward to set up. Particularly pleasing is the way all of the speakers automatically connect with each other almost instantly once they’re all plugged in - and they never dropped that connection during the days I spent testing the system out.",
    "You do, though, need to download not one but two apps to your mobile phone to access all of the soundbar’s features and set up tools. The Google Home app is needed to connect the soundbar to your Wi-Fi system, opening up voice control via Google Assistant and streaming from the likes of Deezer, Google Music, Spotify, and YouTube.",
    "LG’s Wi-Fi Speaker app, meanwhile, brings with it features such as channel balance adjustments, audio delay adjustment, and LG’s AI Room Calibration system. This helps the soundbar automatically optimise its sound to suit your room by firing out a series of test sounds.",
    "The SN11RG supports High Resolution audio up to 192kHz sampling and 24-bit depth, and as noted before, can decode both Dolby Atmos and DTS:X soundtracks. As well as Dolby Atmos music, of course.",
    "Finally, there’s an AI Sound Pro processor that can convert pretty much any incoming sound format - even vanilla stereo - into a full multi-channel output.",
    "The LG SN11RG is comfortably the best-sounding soundbar we’ve ever heard from LG, and a genuine rival for the previously peerless (as a ‘true’ Dolby Atmos/DTS:X system, anyway) Samsung HW-Q90R 7.1.4 soundbar.",
    "For starters, the soundstage it produces is immense. It projects its sound far and wide, giving it enough width and height to fill pretty much any size of room. It fills your room with a genuinely three-dimensional sound ‘space’ too - exactly as you’d hope a system that supports the so-called object-based Dolby Atmos and DTS:X sound formats would. This rams home why Dolby Atmos speaker systems that use up-firing speakers at the front of the soundstage benefit so much from also providing up-firing drivers in their rear speakers.",
    "We're not just talking about a vague 3D ambience with the SN11RG, either. In fact, it’s exceptionally good at populating the space it creates with accurately placed and convincingly rendered details - even in the height channels.",
    "In the Invisible Man on 4K Blu-ray, for instance, the sounds of trees creaking and whispering above your head as Cecilia waits for her friend to pick her up sound precise and specific - even to the point where you can hear different branches circle round above you as the camera circles our heroine.",
    "The combination of projection and detail in the soundstage also makes it exceptionally good at portraying differences spaces. For instance, when a film cuts from an interior to an exterior, you really hear the scale of the soundstage open up accordingly.",
    "You can push the system to huge volume levels without it readily succumbing to distortion or harshness, too, and the subwoofer rounds out the spectacularly open and dynamic mid-range with some seriously profound bass.",
    "While the LG SN11RG is at its most flat out-exciting with Dolby Atmos and DTS:X movie soundtracks, it’s also an accomplished music player. In vanilla stereo mode it delivers a rich, clean, well-separated soundstage that sounds detailed without becoming clinical, and ties in bass where it’s needed with more subtlety than I’d expected given its unapologetically grunty movie performance. Vocals - especially female ones - have a really pure, well-rounded quality to them, too.",
    "The SN11RG’s pseudo surround processing is also much cleverer than such systems usually are. The AI Sound Pro setting genuinely mixes the music across the front and rear speakers, rather than simply ‘doubling up’ the sound. And it also raises vocal tracks using the height channels startlingly effectively at times - especially with relatively acoustic or voice-dominated tracks. It won’t suit everyone - or every album- but it’s worth experimenting with, at the very least.",
    "Great though the SN11RG is overall, there are a trio of areas where it could be better still: the biggest issue is that with movie soundtracks vocals can sometimes sound rather ‘narrow’. This means they can sound as if they’re coming from slightly below the screen, rather than from where the actors’ mouths are moving. Male voices can also sometimes sound thick and ‘hummy’.",
    "Next, while the subwoofer delivers an impressive amount of bass, it doesn’t move its air quite as nimbly as the other speakers. This can result in a bit of soupiness and chunking at high volumes. Really extreme bass ‘drops’, such as those in the Blade Runner 2049 soundtrack, can also cause the main soundbar to crackle a bit at volume levels higher than ’20’. Movie soundtracks that push speakers as hard as BR2049, though, are few and far between.",
    "Finally, impact sounds - punches, collisions, even some explosions - can be a little inconsistent, with some not hitting as hard as they should.",
    "The Samsung HW-Q90R is easily the closest current rival to the SN11RG. Its aggressive, punchy approach, more consistent impact, more responsive bass and wider vocal dispersion solve some of the LG’s issues. But the LG is more sensitive and detailed with its rear and height channels. Also, the 2019 Samsung Q90R is likely to disappear from shelves soon ahead of the arrival of the brand’s new Q950T soundbar system.",
    "If you’d rather not clutter your room up with (and can bear to be without) true rear and rear height speakers, the new Sonos Arc soundbar delivers outstanding sound for a single bar product. Plus you can add a subwoofer if you really want to pump up the bass. The Arc isn’t cheap either, though - and the price leaps considerably if you add in the cost of the separate Sonos Sub and two Sonos One rear channels.",
    "LG has seriously upped its soundbar game with the SN11RG. It delivers a true, convincing and powerful Dolby Atmos/DTS:X movie experience, while also sounding compelling with music. Yes, the lack of HDR10+ passthrough is frustrating, and there are a couple of areas where the sound could be even better. There’s no question, though, that thanks to the SN11RG, Samsung is no longer the only name that counts in the quality 7.1.4 soundbar world."
  ],
  "headers": {
    "4": "Price and release date",
    "6": "Design",
    "12": "Features",
    "21": "Performance",
    "32": "Other soundbars to consider...",
    "34": "Final verdict"
  },
  "links": {
    "best soundbar deals": "https://www.techradar.com/news/soundbar-deals",
    "Samsung HW-Q90R": "https://www.techradar.com/reviews/samsung-hw-q90r-soundbar",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "Sonos Sub": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/sonos-sub-1082735/review",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review"
  }
}