{
  "source": "https://www.techradar.com/reviews/xs-usenet",
  "title": "XS Usenet review",
  "category": "computing",
  "updated": "2020-12-01T05:33:01Z",
  "author": "desire-athow",
  "summary": "A powerful Usenet service with a free plan",
  "verdict": "XS Usenet ticks most of the right boxes, offering solid retention and performance, a decent interface, and a free plan.",
  "pros": [
    "User-friendly",
    "Free account"
  ],
  "cons": [
    "Free plan has heavy restrictions",
    "Limited choice of plans"
  ],
  "article": [
    "Choosing a Usenet provider presents you with a wealth of choices. Free bundles are almost always a bonus, as is a provider with long experience in the marketplace. But do these factors always result in a good choice?",
    "Launching back in 2009, XS Usenet was the first and only free Usenet provider for quite some time. Retaining its free package, XS Usenet has grown, now serving Usenet content to \"hundreds of thousands of people.\"",
    "Along with the free account, XS Usenet also has a feature-packed premium bundle. As of 2017, it also offers a VPN service. Like many other Usenet service providers, XS Usenet is registered in the Netherlands.",
    "XS Usenet provides access to Usenet groups for downloading media and engaging in discussion, using a client app. Following the one-step sign-up, with the necessary server name, username, and password, you gain access to fast speeds, up to 50 simultaneous connections, and huge download limits.",
    "Additionally, XS Usenet provides \"super fast\" customer support, with multilingual staff available to answer questions. This support can be accessed via web form or email, and phone and street address are also provided.",
    "This is in addition to a detailed FAQ which helps to overcome some common issues. There's also a live chat function and ticketing system.",
    "One of the most important factors for choosing a Usenet provider is retention. This is the Usenet history available on the provider's servers. Many providers offer around 3,000 days' retention, which is upwards of 8 years.",
    "XS Usenet, despite being around since 2009, offers a paltry 1,100 days. This is just 3 years' worth of Usenet uploads and discussions available for access. While there is an argument that older data isn't required, and much of it is repeatedly uploaded to various newsgroups, it places XS Usenet in a strange position compared to its cheaper competitors.",
    "For the price of the monthly subscription, XS Usenet offers poor retention.",
    "If you're using the free package, retention is also 1,100 days. This is an increase from the previous 10 days offered.",
    "XS Usenet features an SSL option to ensure secure, encrypted, private downloads from Usenet. This adds the same level of security to your newsgroup access as you would get visiting any secure website - online banking or shopping, social networks, etc. SSL is a default feature in the premium package, but unavailable for free users.",
    "The 1-Step Signup feature promises \"quick and easy access… in less than 30 seconds\" but unfortunately this is a bit of a privacy issue as it relies on signup via a Google or Facebook account. During evaluation, the Google account function wasn't operational, which meant relying on a Facebook account.",
    "While the necessary permission is obviously outlined by Facebook, it does mean that XS Usenet has access to more information about you than you might otherwise have entered in a form. Other services provide anonymous sign ups.",
    "With that said, XS Usenet does offer a robust Privacy Policy.",
    "Given the vast sizes of files available for download on Usenet newsgroups, it is vital to find a provider that can deliver your data quickly. A fast ISP is just one side of the coin - you need a Usenet service with fast servers and infrastructure for delivering your chosen downloads.",
    "XS Usenet promises \"blazing fast connections\" with servers worldwide. Further, it gives you up to 50 simultaneous connections. This means that media can be downloaded from newsgroups using XS Usenet and the only real limit is the speed of your ISP or your wireless network.",
    "It's impressive performance, but nothing surprising for the monthly subscription.",
    "Three Usenet subscription bundles are on offer from XS Usenet: Free Usenet, Premium Usenet, and Usenet + VPN. (There is also a VPN bundle which doesn't offer Usenet and is easy to click by mistake.)",
    "Premium Usenet is €7.99 a month (around £7.30 or $9.30), offering unlimited speed and data with a 5TB fair use policy, capping speeds at 40Mbps if this is exceeded. The 1,100 days retention is included, 99%+ completion, 50 connections, SSL, and posting.",
    "A combination bundle is also on offer for €10.99 (around £10.10 or $12.80) which includes all the above and adds XS Usenet's Bandito VPN service at a 15% discount.",
    "(Prices listed with a monthly subscription. XS Usenet offers 10%, 15%, and 20% discounts for quarterly, semi-annual, and annual billing.)",
    "XS Usenet accepts payment via credit card, online methods such as SEPA/iDeal, Paysafecard, and even crypto currencies.",
    "As noted, there is also a free package. The limits of this (2Mbps, 25GB data, 5 connections, no SSL, no posting) are so restrictive that it is barely worth considering. There is simply no way to accurately evaluate what's on offer with XS Usenet if you use this.",
    "Further, the free account must be manually renewed every month, another bizarre inconvenience. If Free Usenet has been conceived to onboard uncertain users, it almost certainly needs tweaking to make it more attractive.",
    "XS Usenet doesn't lock you into a contract, allowing you to choose whether to renew or not. With no contracts or termination fees, you're in control, although if you're paying for several months in one go it seems unlikely you would get a refund for anything other than technical issues.",
    "Despite promising much via its polished website, XS Usenet is overall disappointing. Sign ups are fast, payments are supported across a wide selection, and the privacy policy is robust.",
    "Bit 1,000 days retention simply doesn't cut it when the competition is offering three times as much (or more) for less money. Maxing up on the connections is one thing, but while 50 is useful, it's also a lot to pay for one outstanding feature.",
    "As for the Free Usenet bundle… it's ludicrously feature-free. If you're set on using XS Usenet, go ahead and pay for the basic subscription package and work from there. Stay clear of the free package as this is more likely to just put you off XS Usenet completely."
  ],
  "headers": {
    "3": "Features",
    "6": "Retention",
    "10": "Security and privacy",
    "14": "Performance",
    "17": "Plans and pricing",
    "25": "Final verdict"
  },
  "links": {
    "Usenet provider": "https://www.techradar.com/best/best-usenet-providers",
    "XS Usenet": "https://xsusenet.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "SSL": "https://www.techradar.com/news/best-ssl-certificate-provider",
    "Privacy Policy": "https://xsusenet.com/privacy-policy",
    "Premium Usenet": "https://xsusenet.com/",
    "combination bundle": "https://xsusenet.com/",
    "free package": "https://xsusenet.com/"
  }
}