{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-a71-hands-on",
  "title": "Hands on: Samsung Galaxy A71 review",
  "category": "phones",
  "updated": "2020-10-21T16:35:57.323Z",
  "author": "john-mccann",
  "summary": "Big screen, five cameras, huge battery, great value",
  "verdict": "The Samsung Galaxy A71 packs in a big 6.7-inch display, four rear cameras and a huge 4,500mAh battery at a price point which won't break the bank. It could well be a winning formula.",
  "pros": [
    "Big, colorful screen",
    "Huge battery",
    "Premium camera experience"
  ],
  "cons": [
    "No water resistance",
    "No wireless charging"
  ],
  "article": [
    "Samsung's renewed vigor in the mid-range mobile market continues, and with the arrival of the Samsung Galaxy A71 at CES 2020, it believes it's hit on exactly what consumers want - a big screen, plenty of cameras and long battery life.",
    "It's no secret that this phone is aimed more at the TikTok generation - a younger audience which spends a lot of time online, consuming and creating high volumes of video content.",
    "Having seen success of its re-launched A series in 2019, where the Galaxy A40 became the line's best seller in Europe and the UK, Samsung is looking to double-down in 2020 and the Galaxy A71 sits towards the top of the range, and nudging in just behind the new Galaxy S10 Lite and Galaxy Note 10 Lite.",
    "Since then, Samsung has released more affordable options, namely the Samsung Galaxy S20 Fan Edition, but the Galaxy A71 has still been out long enough to see some decent discounts – and even more price drops likely in the lead up to Black Friday on November 27 and Cyber Monday thereafter.",
    "The screen, cameras, battery combo seems to be a good idea, but how does it all come together? We got hands-on with the new Galaxy A71 to find out.",
    "Pre-orders for the A71 have now lone live in the UK, costing £419. Other countries including the US are now likely to follow soon. It seems that it will be available before the Galaxy S11 launch though in a couple of days, which is taking place on February 11.",
    "The Samsung Galaxy A71 price is £419 (around $550, AU$800), making it competitive in the market for the features it's offering. This should translate into equally strong contract deals as well, but we'll have to wait to find out exactly how much they'll be.",
    "When it comes to the Samsung Galaxy A71 design, it's all about the huge, 6.7-inch display. It dominates the front of the handset, but with minimal bezels around the side it fits in the hand better than you'd imagine.",
    "It uses Samsung's Infinity-O screen technology we've seen on previous devices from the firm, and means you get a punch-hole camera design at the top of the display. It sits in the notification bar, which keeps it nicely out of the way, so not to intrude on general usage.",
    "The front-facing camera takes up more space on the A71 than it does on the cheaper Galaxy A51 - even though they're the same lens. That's down to the fact the Galaxy A71 uses a Super AMOLED Plus panel (vs Super AMOLED on the A51) which is thinner and lighter, but the trade-off is the camera cut-out needs to be a little larger.",
    "It's not an issue, but it's a shame Samsung couldn't get the smaller design in here too.",
    "The Galaxy A71 measures 163.6 x 76 x 7.7mm and weighs 179g, which makes it relatively manageable to use. Those with smaller hands will still find it pretty massive though, and stretching your thumb to the top of the screen is a struggle - especially during one-handed use.",
    "On the right you'll find easy-to-reach power and volume keys, while on the bottom there's a headphone jack alongside the 25W fast-charging USB-C port.",
    "Round the back and Samsung has developed a new Prism effect for the rear of its latest A series devices (the A71 and A51), which provides a little bit of intrigue and individuality.",
    "You'll be able to pick up the Galaxy A71 in a range of colors, including black, silver, blue and pink.",
    "Shifting focus back to the display, and as we mentioned it's 6.7 inches in size with a Super AMOLED Plus panel, which delivers a bright, colorful punch.",
    "It has a Full HD+ resolution (1080 x 2400) which provides a good level of detail on-screen. You can comfortably watch Netflix on this device.",
    "There's a fingerprint scanner embedded into the display as well, plus the option to use face recognition to unlock the phone instead.",
    "One of the big party pieces for the Samsung Galaxy A71 is its cameras. The front-facing, 32MP snapper produces high quality shots, even in the slightly awkward lighting of the Samsung booth, which should satisfy selfie fans.",
    "Round the back and the Galaxy A71 packs four cameras. The main sensor a 64MP, f/1.8 offering and from our brief test it produced well-lit, detailed images.",
    "You can fit more of your surroundings into shot however, by tapping an icon on-screen to switch to the 123 degree, 12MP ultra-wide camera. Plus you also get 5MP macro and 5MP depth cameras for close-up shots and background blur effects (which Samsung calls Live Focus) respectively.",
    "It's a fully featured camera experience, with many flagship modes and additions.",
    "The Samsung Galaxy A71 could also be a bit of a star when it comes to battery life. Samsung has squeezed a sizable 4,500mAh battery into the handset, which is bigger than the battery in the Galaxy S10 Plus (4,100mAh) and Galaxy Note 10 Plus (4,300mAh).",
    "We don't know how long it'll last for a single charge, but our hope is you'll be able to get close to two full days before having to find a power outlet. We'll be sure to put this to the test in our in-depth Galaxy A71 review soon.",
    "There's plenty of power under the hood of the Samsung Galaxy A71, with an octa-core processor and 6GB of RAM (some regions will get 8GB) in the driving seat.",
    "The device comes running Android 10, which felt fluid and fast under-finger, and you also get 128GB of storage to play with which, for many, will be more than enough.",
    "If you do run out of space, the Galaxy A71 also has a microSD slot which supports cards up to 512GB in size.",
    "The Samsung Galaxy A71 has plenty going for it, from its big screen and power to the feature-packed cameras and massive battery - this could well be a winning formula at an attractive price point."
  ],
  "headers": {
    "5": "Samsung Galaxy A71 release date and price",
    "7": "Design and display",
    "18": "Camera and battery",
    "24": "Performance and specs",
    "27": "Early verdict"
  },
  "links": {
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Galaxy A40": "https://www.techradar.com/reviews/samsung-galaxy-a40",
    "Galaxy S10 Lite": "https://www.techradar.com/reviews/samsung-galaxy-s10-lite-full-review",
    "Galaxy Note 10 Lite": "https://www.techradar.com/reviews/galaxy-note-10-lite-review",
    "Samsung Galaxy S20 Fan Edition": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Galaxy S11": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "which is taking place on February 11": "https://www.techradar.com/news/samsung-galaxy-s11-and-fold-2-poised-to-be-announced-february-11",
    "Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs"
  }
}