{
  "source": "https://www.techradar.com/reviews/mattermost",
  "title": "Mattermost review",
  "category": "computing",
  "updated": "2020-05-08T15:30:05Z",
  "author": "john-brandon",
  "summary": "A powerful and secure team messaging app that will make you rethink Microsoft Teams",
  "verdict": "Mattermost is a unique and powerful team messaging app that provides extreme flexibility. You can run your own server installation on Windows, Mac, or Linux. Users can access the app securely through a desktop or mobile app, although it also runs in a browser window. Enterprise features for compliance reporting make it a direct competitor to Microsoft Teams.",
  "pros": [
    "Can run on-premise for better security",
    "Compliance reports meet regulatory needs"
  ],
  "cons": [
    "Daunting for small teams",
    "No free version",
    "No built-in video chat"
  ],
  "article": [
    "In an age when instant-access to any app is preferred by most, there is still a great need for more security. This is even true with team messaging apps like Slack. Yes, you can register in seconds and start chatting using a cloud-based server with your team, but you’re still using the cloud and accessing over the public Internet. That’s why Mattermost is such an interesting alternative. The collaborative app looks and functions like Slack but has the enterprise power of Microsoft Teams - and the ability to run your own internal, on-premise server.",
    "Any discussion about Mattermost has to start with the simple fact that they do not offer a free version. Perhaps it’s because you do have to install a server for on-premise or cloud access, or because it is intended for more security. There’s a reason the U.S. Department of Defense uses it, but be prepared for some initial sticker shock.",
    "The Enterprise E10 version includes most features you’ll need for team communication and costs $3.25 per user per year (and only on an annual plan). The Enterprise E20 plan adds compliance reports, premium support, and unusual features like integrations with electronic discovery tools. It costs $8.50 per user (for annual plan).",
    "Slack costs around $8 per user per month for the paid version but many companies use the free version with limited storage. Microsoft Teams is included with Microsoft 365 but the fees for that comprehensive package - which includes Office 365 - varies according to the plan you select.",
    "Mattermost uses a bright, navy blue color palette on a white background. If you swapped out the blue with purple, it would look even more like Slack. On the upper right corner is a drop-down menu for settings, a list of public and private channels, and direct message chats.",
    "That’s about where the comparisons end, however. Mattermost runs as a server install in your own data center and can be accessed remotely or locked down so that it only runs internally. That’s a major benefit for any company that needs to comply with industry regulations. Hospitals, law firms, and even government agencies will be drawn to the enterprise-level security features that make Mattermost nearly impossible to access over the public Internet. Yet, the app is not overly complex or confusing for users who need to collaborate.",
    "Mattermost is one of those apps that has extensive features but doesn’t bombard you with them or make them required so you have to train users. For example, you might not realize at first that there is an Enterprise version available that can generate compliance reports and link to e-discovery tools, both helpful in case of a data breach. And, it’s only after using the product for a while that you can start relying on the built-in bots that can remind users about discussions and point them to those chats automatically.",
    "All of the basics are here, including extensive collaboration tools. While users can start chatting immediately in a simple and clean interface, whether that is in a public channel or privately, they can also make use of extensive DevOps features such as custom slash commands and webhooks. Mattermost also integrates hundreds of plug-ins and extensions.",
    "Oddly, there isn’t a built-in group video chat, which is a major surprise. (For several years, Slack did not offer group video chats - it is a fairly recent addition.) Meanwhile, Microsoft Teams lets you hold a video webinar with up to 10,000 people attending at the same time.",
    "Mattermost is an interesting team messaging app because it is a blend of Slack and Microsoft Teams - but it is also unlike either of those. As far as Slack, the interface is easy to use and just as fluid. No one will need a training course on how to message other team members. Like Microsoft Teams, you can rely on extensive features for compliance reporting and e-discovery, plus integrations with extensions, bots, and other apps. Mattermost is a highly scalable app that can house all of your team collaboration and files in one place.",
    "Unlike Slack or Microsoft Teams, Mattermost can run as a server console you install in your own data center and run securely without cloud access over the public web. This means hospitals, law firms, large financial companies, and government agencies can use this app without the typical fear about a data security breach due to easy public access. The server install is not overly complicated, however - and you can still provide cloud access if desired.",
    "Mattermost is not for everyone. For small teams chatting about the weather and a new widget, there won’t be a huge need for enterprise-grade security features. It won’t be worth installing and managing the server in your own data center. (You might not even have a data center.)",
    "However, even for small teams, if you expect massive growth, this is a team messaging app that can grow with you and meet the compliance and regulatory demands of your industry. All of this without making the core app complicated or hard to use.",
    "Can it really take on Slack? That depends. Slack offers a capable free version that can help you communicate with your team. Mattermost does not offer a free version. However, as you need more enterprise features, the real target here is Microsoft teams, which is also intended for larger companies. That's why, for team messaging, if you are not taking advantage of all that Microsoft 365 has to offer and are considering moving to another ecosystem (such as Google G-Suite), then Mattermost may be the app that can replace Microsoft Teams."
  ],
  "headers": {
    "1": "Plans and pricing",
    "4": "Interface and performance",
    "6": "Features",
    "9": "The competition",
    "11": "Final verdict"
  },
  "links": {
    "Mattermost": "https://mattermost.com/",
    "Enterprise E10 version": "https://mattermost.com/pricing/",
    "Enterprise E20 plan": "https://mattermost.com/pricing/",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams"
  }
}