{
  "source": "https://www.techradar.com/reviews/supernews",
  "title": "Supernews review",
  "category": "computing",
  "updated": "2020-11-20T05:50:55Z",
  "author": "desire-athow",
  "summary": "Hassle-free Usenet from an experienced provider",
  "verdict": "Supernews isn't a bad Usenet provider, but it's not great, either, and we see no compelling reasons to choose it ahead of the top competition.",
  "pros": [
    "US and European servers",
    "Decent speeds",
    "Free 3-day/10GB trial",
    "Responsive support team"
  ],
  "cons": [
    "No plan flexibility",
    "Poor website",
    "No Bitcoin payments"
  ],
  "article": [
    "Accessing Usenet unlocks the door to a wealth of content. Text newsgroups feature discussions on all subjects under the sun, while those featuring downloadable binaries give you images, audio, and video content, not to mention software - for example, Linux disk images.",
    "Supernews began providing Usenet access in the late 1990s and potentially has experience on its side to set it apart from other Usenet services. But does Supernews live up to its own reputation?",
    "Registered back in 1996, Supernews is a Usenet provider based in the United States and delivering access via a unique-looking website. While other providers sell through cookie-cutter promotional pages, the front end at Supernews has a whimsical comic book/newspaper feel.",
    "Supernews has published a DMCA policy on its site for copyright holders to follow.",
    "You will find the typical Usenet provider features available through Supernews. Unlimited speed ensures the fastest downloads your internet connection can handle, and unlimited access means your activity is not capped.",
    "Multiple connections mean that you can maximise download speeds. Supernews offers 30 simultaneous connections, all with SSL. There is over 3 years of binary retention, a 3-day free trial, and simple subscription options.",
    "Meanwhile, Supernews provides 24/7 customer support, 365 days a year. This is accessible via a contact form, but a detailed FAQ page is also provided to help you to find quick answers to straightforward issues.",
    "One of the most important features to consider with Usenet providers is retention - the period that data is retained on a provider's servers. Data might be text posts from discussion groups, or media files and software, known as binaries.",
    "Many Usenet providers state a single figure for retention, which can be misleading if it does not tell the full story. Supernews offers a stated \"3+ years of binary retention\" which means binaries uploaded to Usenet can be searched for and downloaded from 3 or more years ago. Meanwhile, it also stores \"17+ years of text retention\" from discussion newsgroups.",
    "A Supernews subscription gives you access to over 110,000 newsgroups with a bold \"100% article completion rate.\" Most competitors promise no more than 99%.",
    "One thing to note: while the clarification of the difference between text and binary retention is welcome, other Usenet providers provide retention figures in days. Stating 3+ years or 17+ years is less precise - it also does not tell you whether it is a rolling retention, or one that is increasing day by day. Given the fact Supernews has been operating since the 1990s but does not offer 24+ years of data, rolling retention seems more likely.",
    "As standard with Usenet providers, Supernews includes the option to view and connect to its servers over SSL. This secure, encrypted connection ensures the privacy of your Usenet access in the same way a HTTPS connection in your web browser protects online banking and shopping, as well as access to trusted websites.",
    "Sign up to Supernews requires quite a bit of personal data to be provided. While the initial tranche of data is limited to name and email address, paying for Supernews (which is required even for the 3-day trial) demands your name, address, and banking details. While some Usenet services might rely on a third-party payment service, Supernews appears to manage this with its own software. As per the Supernews Privacy Policy:",
    "\"This Personal Data is associated with your account and can include information such as your name, email address, phone number, payment information and/or physical address.\"",
    "On the other hand, it gives a detailed explanation as to its logging policy:",
    "\"Supernews does not monitor or record your activities online. We do not monitor which newsgroups you post to or download from or what you put in news articles that you post.\"",
    "To test download speeds with Supernews, we connected to the internet via a VPN server in the Netherlands to avoid traffic shaping by the ISP, which can potentially slow data transfer rates.",
    "Following this, the speed was checked at Ookla’s Speedtest, which reported 62.68Mbps.",
    "A 1.9GB video file was selected from Usenet of a 239-day retention. This downloaded at a rate averaging 320Kbps, peaking at 419Kbps. Lower than expected, a second download was tested, this time a 261-day old 368MB audio file. This downloaded with an average speed of 183Kbps and a maximum rate of 232Kbps.",
    "To avoid issues with confusing packages, Supernews offers a simplified approach. The choice is between a monthly plan and an annual plan, both with unlimited speed and 30 SSL connections.",
    "The Monthly Plan is $5.99 (£4.58 or €5.07), 50% off the usual price of $11.99 (£9.16/€10.14) for the first month.",
    "To pay upfront for 12-months access, the Yearly Plan will cost you $74.25 (£56.72 or €62.79) for the first year, a 25% saving.",
    "Both packages have a 3-day free trial (limited to 10GB), so you can get a flavour of the Supernews service before committing to a subscription.",
    "Supernews keeps Usenet simple. With two packages offering the same level of access differing only in subscription length, plus a free 3-day trial, it is extremely accessible. You simply choose your preferred subscription, sign up, pay, click the confirmation email, and access is granted. There is none of the \"umming and ahhing\" that often occurs with selecting a service with multiple options.",
    "Sadly, Supernews did not seem to be as fast as we had expected, although its privacy policy and retention specification were both pleasingly detailed."
  ],
  "headers": {
    "4": "Features",
    "7": "Retention",
    "11": "Security and privacy",
    "16": "Performance",
    "19": "Pricing",
    "23": "Final verdict"
  },
  "links": {
    "Usenet": "https://www.techradar.com/best/best-usenet-providers",
    "Supernews": "https://www.supernews.com/",
    "FAQ page": "https://www.supernews.com/docs/support.html",
    "Privacy Policy": "https://www.supernews.com/docs/privacy.html",
    "Speedtest": "http://www.speedtest.net/",
    "Monthly Plan": "https://www.supernews.com/",
    "Yearly Plan": "https://www.supernews.com/"
  }
}