{
  "source": "https://www.techradar.com/reviews/acer-predator-cg7",
  "title": "Acer Predator CG7 review",
  "category": "computing",
  "updated": "2020-02-21T15:58:22Z",
  "author": "matt-hanson",
  "summary": "An epic screen",
  "verdict": "The Acer Predator CG7 is a huge gaming monitor that brings certain features we'd expect to see in a gaming monitor to a TV-sized screen. It doesn't quite do enough to convince us to clear a space on our desks or ditch our TVs, but for some people it'll be the ideal screen.",
  "pros": [
    "Large",
    "Responsive",
    "G-Sync support",
    "4K support"
  ],
  "cons": [
    "Expensive",
    "Lacks some features",
    "May be too big for some people...",
    "...while not big enough for others"
  ],
  "article": [
    "When it comes to immersion and sheer entertainment, we often think that bigger is better, but while we love the audacity of the Acer Predator CG7, it leads us to think: how big is too big for a gaming monitor?",
    "With a 43-inch screen, this is a monitor that's not going to fit on many people's desks. And, even if you do get it to fit, it's unlikely you'll be comfortable sitting as close to it as you would a normal monitor of around 27-inches.",
    "However, Acer is clearly pitching the Predator CG7 at people who are looking for a TV that brings advanced tech we've come to expect from gaming monitors, like high refresh rates, to a larger screen. But does it succeed?",
    "At $1,199.99 (£1,166.80, around AU$1,800), the Acer Predator CG7 is certainly one of the more expensive gaming monitors you can buy right now – but then it’s also one of the largest (apart from those 65-inch Nvidia Big Format Gaming Display (BFGD) monitors like the HP Omen X Emperium 65).",
    "However, when compared to 43-inch 4K TVs, like the Panasonic GX800, it’s also pretty pricey, and many 40-inch 4K TVs can be had for half the price, and offer comparable visual quality, including HDR support.",
    "What these sets don’t offer, however, is the high refresh rates and gaming-centric features of the Acer Predator CG7. So, it’s clear that this is a monitor that’s aimed at people who want to game on a large TV, while also benefiting from tech usually found in gaming monitors. That’s a tricky – and niche – market to go for, and if you’re not careful, you can end up appealing to no one.",
    "The design of the Acer Predator CG7 is similar to what we’ve come to expect from Acer’s Predator lineup of gaming peripherals, so you get some rather angular corners and RGB lighting that leaves you in no doubt that this is a product aimed at gamers. One rather nice touch is the icons on the stand that encourage you to store your game controllers there. The RGB lighting can be configured with preset lighting patterns, or set up to sync to your music and games, which is a nice touch.",
    "However, the design is also restrained enough that it won’t look out of place in many people’s living rooms or bedrooms. It’s not as stylish as the Alienware 55 OLED Gaming Monitor AW5520QF, but not many TVs or monitors are. The Acer Predator CG7 is also a fair bit cheaper (though also not as large) as Alienware’s monitor.",
    "Built into the Acer Predator CG7 are a pair of 10W speakers, which do the job in a pinch, but we’d recommend using external speakers, or a headset, for the best possible audio quality.",
    "Port-wise, the Acer Predator CG7 comes with three HDMI ports, two DisplayPorts, a USB Type_C port, four standard USB ports (two 2.0 and two 3.0) and a USB input, allowing you to turn the monitor into a USB hub. That’s a good selection of ports, though it doesn’t come with a TV tuner. That means, if you want to use the Acer Predator CG7 as a TV – and considering its size, you probably will – then you’ll need to plug in a separate set-top box.",
    "The Acer Predator CG7 can be wall mounted with VESA fittings, and it comes with a remote control as well, further adding to the television-esque feel of the screen.",
    "When it comes to performance, the Acer Predator CG7 is an impressive beast – though there’d have to be something seriously wrong if it wasn’t at this size. Plugging it into our test machine, Windows 10 discovered and configured itself accordingly, though we did have to pop into the settings to find a level of scaling that works best considering the size of the screen.",
    "Windows 10 at 4K on the Acer Predator CG7 looks good, though not quite as sharp as on smaller 4K monitors – an inevitable consequence of having a screen of this size. We sat in front of the Acer Predator CG7 and used it as a regular monitor for a while – browsing the web, checking emails and working on documents – and while using such a big screen is novel at first, it does wear off a bit and can get uncomfortable if you’re too close.",
    "And in the end, that is not what the Acer Predator CG7 has been built for. What it is built for is gaming, and it’s here where it really excels. Running PC games like Control and Red Dead Redemption 2 at 4K resolution, and with G-Sync’s anti-screen tearing tech and high-refresh rates, these games look – and feel – brilliant.",
    "The low 1ms response time and 144Hz overclocked refresh rates make games feel fast and responsive. Well, Red Dead Redemption 2 remains sluggish to control, but that’s an issue with the game itself, and a monitor isn’t going to fix that.",
    "The Acer Predator CG7 has HDR (High Dynamic Range) support in the form of VESA DisplayHDR 1000. This is a high-end implementation of VESA DisplayHDR which has a peak luminance of 1,000 cd/m2. While it’s not up to the standard of high-end TVs that have HDR10+ and Dolby Vision, it’s one of the better implementations of VESA DisplayHDR – and the fact that it has a very bright peak luminance means it’s capable of vibrant images.",
    "What sets VESA DisplayHDR 1000, which is a type of HDR10, apart from HDR10+ and Dolby vision is that those two latter implementations of HDR use metadata provided from the content creators to tweak presentation and picture settings from scene to scene in movies and TV shows.",
    "So, one could argue that a PC monitor does not need that level of HDR. However, if you’re thinking of using this monitor to watch a lot of movies and TV shows in HDR, then you may want to bear this in mind.",
    "HDR support in Windows 10 and for PC games isn’t as straightforward as on consoles, but on the whole, the games we tested on the Acer Predator CG7 looked very good.",
    "It’s also worth pointing out that to get the most out of playing PC games at 4K resolution with high framerates and graphical settings like ray-tracing turned on, you need a suitably powerful PC.",
    "We’re lucky enough to have a powerful PC Specialist rig with an RTX Titan GPU – one of the most powerful (and expensive) GPUs in the world, and that means we could play graphically-demanding games at high resolutions and frame rates that put the PS4 and Xbox One X to shame. With more modest hardware, you’ll need to make some compromises, but with a bit of tweaking, you’ll still get a very impressive experience.",
    "If it’s doubling up as a TV, then things are not quite as straightforward. The aforementioned lack of a TV tuner and HDR10+ support puts it at a disadvantage compared to cheaper TVs, and the 43-inch size, while impressive for a monitor, is quite small these days for a TV. In larger living rooms it could feel a little dwarfed – which means it’s a better fit for smaller rooms, like bedrooms. If you’re a movie fan that wants a fully cinematic experience, this isn’t it.",
    "However, if you’ve got a powerful gaming PC and you want to really show off your PC games, then this is an impressive gaming monitor that’s a (slightly) more sensible and affordable alternative to the larger 55-inch and 65-inch gaming monitors we’re starting to see."
  ],
  "headers": {
    "0": "Two minute review",
    "23": "Don't buy it if..."
  },
  "links": {
    "gaming monitor": "techradar.com/news/best-gaming-monitor",
    "gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "Panasonic GX800": "https://www.techradar.com/reviews/panasonic-gx800-led-tv",
    "Alienware 55 OLED Gaming Monitor AW5520QF": "https://www.techradar.com/reviews/alienware-55-oled-gaming-monitor-aw5520qf",
    "Control": "https://www.techradar.com/reviews/control-review",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-pc-release-date-news-tips"
  }
}