{
  "source": "https://www.techradar.com/reviews/soundmagic-tws50-true-wireless-in-ear-headphones",
  "title": "SoundMAGIC TWS50 true wireless in-ear headphones review",
  "category": "audio-visual",
  "updated": "2020-02-20T12:05:51Z",
  "author": "simon-lucas",
  "summary": "Can the hero of affordable headphones work its magic wirelessly?",
  "verdict": "SoundMAGIC works its, um, magic on some true wireless in-ear headphones and hits the price/performance sweet-spot in the process, with a light, comfortable design, great sound, and support for Bluetooth 5.0.",
  "pros": [
    "Light, compact, comfortable design",
    "Open, detailed sound",
    "Decent battery life"
  ],
  "cons": [
    "Slightly inhibited dynamics",
    "Rivals last longer"
  ],
  "article": [
    "The SoundMAGIC TWS50 are the logical next step in the affordable audio brand's trajectory. Having enjoyed decent sales success and widespread critical acclaim with its very affordable E11C in-ear headphones, SoundMAGIC made them wireless with the similarly affordable E11BTs neckbuds.",
    "Now it’s cut the remaining cord and served up the new true wireless earbuds, the TWS50. The company may have parked the ‘E11’ nomenclature for now, but don’t be in any doubt – these are designed to continue the E11 story of delivering very acceptable sound and build quality at a price that will have some rival manufacturers wincing.",
    "The SoundMAGIC TWS50 are available to buy for $69 / £79 / AU$155, making them pretty cheap for true wireless earbuds.",
    "For comparison, the Apple AirPods cost upwards of $159 / £159 / AU$249, while our top-performing earbuds, the Sony WF-1000XM3 cost $230 / £220 / AU$400.",
    "Cheaper true wireless earbuds are available, like the fantastic Cambridge Audio Melomania 1, and the cheap (but not great-sounding) JLab Go Airs.",
    "SoundMAGIC has ticked all the right boxes with the design of the TWS50. First off, they’re discreet – no one wants their true wireless in-ears to make them look like they’ve just left the bridge of the Starship Enterprise – and the TWS50 are small, light and, as a consequence, it’s simple to achieve a comfortable fit. The choice of small, medium or large ear-tips provided in the package helps to achieve a satisfactory fit too.",
    "The touch-controls on each earbud are small but simple enough to find and use. The charging case (which holds around 24 hours of power, enough to recharge the TWS50s four times) is a circular puck sort of thing, with a rotating cover to reveal either the earbuds or the super-retro digital display which indicates remaining power.",
    "Neither the case nor the earbuds themselves feel anything special – they’re light (45g for the case, just 4g each for the buds) and made of unapologetically hard, shiny plastic. But both feel sturdy enough, and their relative lack of luxuriousness is only in keeping with their price.",
    "Despite being among the more unobtrusive true wireless designs around, SoundMAGIC has found space for a 6mm neodymium full-range driver in each ear-bud. The TWS50s have an IPX7 rating, too, so getting them briefly wet shouldn’t be a cause for alarm – and there’s a choice of silicone tips in the package, so getting a snug and comfy fit should be straightforward.",
    "Wireless connectivity is via Bluetooth 5.0 - which is more than adequate for enjoying some high-resolution audio from the likes of TIDAL or Amazon Music HD.",
    "The touch controls can be used for answering or rejecting calls as well as controlling playback. If that’s all a bit tiresome and hands-on, the SoundMAGICs are compatible with all Siri, Google Assistant, and Alexa.",
    "The TWS50s pair quickly and without drama to our Sony Xperia 5 and, with a TIDAL Masters file of Tame Impala’s Lost In Yesterday streaming, almost everything that makes SoundMAGIC’s E11 models so enjoyable to listen to, and consequently such good value, is present here.",
    "They’re quite an open, spacious listen, able to establish a stable and well defined soundstage. There’s plenty of width to the presentation, and everything that’s involved in the song’s polite crescendos occupies its own pocket of space. Integration of each individual element is good despite this though, and the song has convincing overall coherence. Some less capable in-ear designs can present music as a collection of separate occurrences, but the TWS50s organize music well.",
    "Bass, while not the out-and-out punchiest you ever heard, is deep and textured, with enough detail to make even small tonal discrepancies apparent. The opposite end of the frequency range is rolled off just a little, which makes sense if you’re listening to low-bitrate streams but is just a tiny bit galling when playing some full-fat Hi-Res files. In the middle of the frequency range there’s sufficient space for a singer to stretch out a little – and, again, sufficient detail to make a vocalist’s character explicit (or, in the case of Tame Impala, lack of character).",
    "Just as the TWS50s are able to convincingly combine the individual instrumental elements of a recording together, so they manage to travel from the top of the frequency range to the bottom smoothly. Beyond that slight sweetening of the highest treble sounds, nothing is overstated and nothing is underplayed.",
    "The SoundMAGICs have no problem dealing with the fervent harmonic dynamics of Anna Meredith’s Nautilus either. The difference between blaring blown bass sounds and their electronic undercurrents is made apparent, and the amount of detail extracted means there’s subtlety in among all the bluster.",
    "However, the same song’s broad dynamics reveal a slight lack of TWS50 headroom – they’re not quite able to make the distance between the recording’s preposterous levels of attack and its brief moments of mercy quite as wide as it should be.",
    "In fact, the TWS50s don’t have the sort of out-and-out volume some alternative designs can summon. Despite an ordinary-looking 107dB sensitivity, the earbuds just don’t have it in them to completely mask the noise of the outside world – which is good news for your hearing in the long term, but bad news if you’re the sort of listener who tries to provoke tinnitus in the name of excitement.",
    "All of the shortcomings mentioned, though – the lack of dynamic potency, the safety-first treble response, the rather hard and unyielding feel of the plastics used, the lack of really oppressive volume – need to be viewed in the context of the price. As it stands, the TWS50s have only two truly realistic rivals: Cambridge Audio’s Melomania 1 and Lypertek’s Tevi. And, the SoundMAGICs are handily cheaper than either of them.",
    "Not perfect, but way better than merely competent, the TWS50 are exactly what you’d hope for from SoundMAGIC. It’s not often that the most affordable option on any given shortlist turns out to be a bit of a bargain, but that’s certainly the case here.",
    "They offer a wide, spacious soundstage, with a good, well balanced presentation, alongside a decent battery life and comfy fit – in short, if you're looking for some cheap AirPod-alternatives, the SoundMAGIC TWS50 are well worth a look."
  ],
  "headers": {
    "2": "Price and availability",
    "5": "Design",
    "8": "Features",
    "11": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "E11C in-ear headphones": "https://www.techradar.com/reviews/soundmagic-e11c",
    "E11BTs": "https://www.techradar.com/reviews/soundmagic-e11bt",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "JLab Go Airs": "https://www.techradar.com/reviews/jlab-go-air-true-wireless-earbuds",
    "high-resolution audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "TIDAL": "https://www.techradar.com/reviews/tidal",
    "Amazon Music HD": "https://www.techradar.com/news/amazon-music-takes-on-tidal-with-hi-res-audio-streaming",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Sony Xperia 5": "https://www.techradar.com/reviews/sony-xperia-5-review",
    "Lypertek’s Tevi": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review"
  }
}