{
  "source": "https://www.techradar.com/reviews/benq-ex2780q",
  "title": "BenQ EX2780Q review",
  "category": "computing",
  "updated": "2020-01-16T18:47:42Z",
  "author": "mark-knapp",
  "summary": "A monitor with oomph",
  "verdict": "The BenQ EX2780Q is a gaming monitor fused with a professional monitor, so it’s geared up for a lot. Its combination of a color-accurate, fast-refresh IPS panel and a strong speaker offer a strong entertainment experience, but some obnoxious HDR behavior is disappointing at this price point.",
  "pros": [
    "10-bit color depth",
    "Worthy speakers",
    "Jack of all trades"
  ],
  "cons": [
    "Wonky HDR on PC",
    "Basic stand"
  ],
  "article": [
    "The BenQ EX2780Q is a $599 (£449, about AU$860), 27-inch gaming monitor that starts with the fundamentals, like a 1440p IPS panel refreshing at 144Hz and offering a 5ms GTG response time, but it expands on that in a number of ways. The first way it goes above and beyond your typical gaming monitor is with its 2.1-channel speaker design.",
    "For most gaming monitors, we’re lucky to even get speakers built in. Even when they’re present, they can feel like an afterthought. That’s not the case with the BenQ EX2780Q monitor. The pairing of two 2W speakers with a 5W subwoofer is surprisingly effective.",
    "While watching The Witcher on Netflix or playing Star Wars Jedi: Fallen Order, the speakers were easily able to fill a 150 sq. ft room with clear and crisp sound. They don’t boom like a proper set of speakers can, but it’s more than enough sound for a large bedroom or even a small (and quiet) living room. It’s loud enough that we wouldn’t leave it at max volume while gaming late at night (the convenient volume wheel makes it easy to dial the volume down.).",
    "The other way the BenQ EX2780Q goes beyond a typical gaming monitor is with its wide color gamut, which covers 95% of the DCI-P3 color space. The display supports 10-bit color depth at 1440p, though we were only able to achieve this while running the monitor over DisplayPort at 120Hz rather than the max 144Hz. We don’t readily see the difference between the 8-bit and 10-bit color depth, but it may be a beneficial feature for anyone doing color sensitive work.",
    "The BenQ EX2780Q has another colorful feature with more mainstream appeal: HDR. The monitor’s typical brightness is 350 nits, but it’s able to achieve a peak of 400 nits, earning it DisplayHDR400 certification. It also offers BenQ’s dynamic HDRi technology to tune the HDR experience. This has several different presets, with a Cinema HDR, Game HDR and Display HDR option.",
    "Each HDR option balances light and dark levels differently, with Game HDR offering up more detail in dark spots on the screen and Cinema HDR going for a more stark contrast with dark areas pushed ever further into darkness. The Game HDR mode has its appeal for gaming, since it offers up more visual detail than the others, but we find turning HDR off entirely to be the best all-around experience.",
    "That’s in part because HDR is just wonky in this implementation. For one, any time we have HDR turned on outside of a game, we see abhorrent color fringing around thin black lines on bright backgrounds (i.e., most text and status icons in Windows). Our text when writing looks like we’re typing in a rainbow font. If the sharpening setting is above 5 in the monitor, we also get the effect regardless of HDR settings.",
    "In games and videos, the HDR experience is a mixed bag. While most of the time the picture does look compelling, with colors that pop and vibrant highlights, it’s offset by the displays handling of overall brightness. As scenes and scenery change, the display suddenly turns up or down the backlight brightness, and it’s not so subtle. That’s with proper HDR enabled in Windows, on the display, and in HDR games or videos. When HDR is disabled in Windows, the emulated HDR modes of the monitor don’t suffer from those same dramatic light shifts.",
    "An ambient light sensor also has a part in the HDR experience, dimming the display when our surroundings are brighter, and brightening when our lights are off - something we find to be counterintuitive. It doesn’t appear to do anything about contrast either, as dark and light sections of the screen are affected together.",
    "The monitor is capable of gaming anyway thanks to its 144Hz refresh rate, FreeSync support and sharp resolution. We find the speaker a great way to enjoy the audio for solo campaigns like Red Dead Redemption 2’s and Star Wars Jedi: Fallen Order when we want to give our ears a rest from headphones.",
    "But it doesn’t exactly nail all the extras that should come at the price. There are many more affordable 1440p/144Hz monitors (albeit usually with TN panels) that cost substantially less while offering similar gaming performance. If the HDR worked better, it might be a stronger selling point, but for now the BenQ EX2780Q’s value hinges on its wide color gamut and speakers being something consumers want."
  ],
  "headers": {
    "0": "Two minute review",
    "11": "Don’t buy it if…"
  },
  "links": {
    "The Witcher": "https://www.techradar.com/news/the-witcher-netflix-release-date",
    "Star Wars Jedi: Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review"
  }
}