{
  "source": "https://www.techradar.com/reviews/cyberlink-u-meeting",
  "title": "CyberLink U Meeting review",
  "category": "computing",
  "updated": "2020-04-21T09:08:20Z",
  "author": "richard-sutherland",
  "summary": "Video chat for small businesses",
  "verdict": "CyberLink U Meeting continues to improve and now includes all the essential video conferencing tools a small- or medium-sized business needs.",
  "pros": [
    "Simple, intuitive interface",
    "Lots of features",
    "Good documentation"
  ],
  "cons": [
    "Video quality not as good as competitors",
    "Pricey phone support"
  ],
  "article": [
    "CyberLink U Meeting is a cloud-based video conferencing tool for online webinars and video meetings. With apps for Windows, macOS, Android, and iOS, and the ability to join a meeting through a web browser without requiring a plug-in to be installed, CyberLink U Meeting aims to be the best video conferencing software for companies working remotely.",
    "In our CyberLink U Meeting review, we help you decide whether it’s the right choice for you.",
    "CyberLink U Meeting has four price plans to choose from. The basic plan is free and allows for up to 30 minutes per meeting, with a maximum of 25 people at a time.",
    "The Pro 50 plan costs $29.99/month/host and you can have a conference of up to 50 people at once. Conference calls can also be up to 24 hours long without being disconnected. With the Pro 100 plan ($49.99/month/host), the maximum number of participants per meeting increases to 100.",
    "Finally, for even larger organizations, bespoke Enterprise plans can be ordered with premium customer support and features customized to your company’s needs.",
    "CyberLink U Meeting goes beyond the basics you get in every video conferencing tool, providing a rich toolset perfect for small- and medium-sized businesses. For example, you can schedule meetings in advance and sync them with Google/Outlook calendars, and the ability to record meetings can be enabled on a per-user basis.",
    "During a meeting, you can easily share your desktop, a single application, or a digital whiteboard, annotating them with a virtual laser pointer. You can even optimize your appearance using the virtual makeup tool. In practice, we found this a bit gimmicky for business use.",
    "Installing CyberLink U Meeting takes a few minutes and is straightforward. It first entails setting up a CyberLink account that will work with all CyberLink software. Having done so, you’ll be able to sign in to the software using your email address, phone number, or Facebook ID.",
    "You then download and install the software from CyberLink, Google Play, or the App Store, depending on where you’ll be using it.",
    "After installing, you can set a profile picture, display name, and user ID that people can use to find you. From there, you’re ready to begin adding contacts, creating groups, and making conference calls.",
    "CyberLink U Meeting has a clean, modern interface with a design that will be familiar to Skype users.",
    "We tested CyberLink U Meeting with PCs, Android, and iOS on internet connections ranging between 20 and 30 Mbps—an average setup for small businesses. While there was no noticeable lag, the video quality was disappointing. Compared to calls made using Microsoft Teams and Facebook Messenger over the same connection, the video was more pixelated, the frame rate was lower, and we experienced more dropouts.",
    "CyberLink U Meeting has a few features that can be enabled to increase privacy and security. Meetings can be password protected, the contact list and chat messages stored on your devices can be encrypted, and you can force the application to verify the server certificate is from CyberLink during calls and meetings.",
    "CyberLink U Meeting’s mobile apps have been certified by the Mobile Application Security Alliance for their security measures, and the servers have passed vulnerability tests from the Open Web Application Security Project and Tenable by Nessus.",
    "For enterprise users, end-to-end encryption (E2EE) can be enabled. With E2EE, all communication between members will be encrypted.",
    "CyberLink U Meeting has great support, with videos, FAQs, user guides, and human support channels you can turn to if you need help.",
    "The five-minute video tutorials get you up to speed on the key features of the software and there’s an 84-page user guide if you need in-depth information on a function. There’s also a support center with a range of helpful FAQs and a blog that discusses how to get the best out of the software.",
    "Finally, if you need human support, you can send CyberLink a query via the support contact form. CyberLink also sells a phone support package for $29.95/60 days. Phone lines are open Monday to Friday, 11:00 AM–8:00 PM (CST).",
    "Microsoft Teams is a better buy if you need more than just video conferencing, as it comes free with an Office 365 Business Essentials plan. Teams offers a similar feature set and visual style to CyberLink U Meeting, including the ability to record video conferences, share your screen, and use it on all modern operating systems and devices.",
    "Zoom is a popular alternative to Cyberlink U Meeting, with a free plan that enables you to host up to 100 people at a time in meetings lasting up to 40 minutes. Cyberlink U Meeting’s free plan, in comparison, allows for just 25 participants and 30-minute meetings. Furthermore, despite being cheaper, Zoom’s paid plans come with features not included in Cyberlink U’s premium offerings. These include cloud recording, custom company branding, and Skype integration.",
    "You should consider CyberLink U Meeting if you want a video conferencing tool for business that’s uncluttered and easy to use.",
    "The basic, free version includes all the key features like call recording, desktop sharing, and a digital whiteboard, so while you’re limited to 30 minutes per meeting and 25 participants at a time, it’s an excellent way to test out the software.",
    "While features like the appearance optimization tool don’t do enough to differentiate this video conferencing software from the pack, CyberLink U Meeting’s core features are implemented well enough to recommend it."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features and utilities",
    "7": "Setup",
    "10": "Interface and performance",
    "12": "Security",
    "15": "Support",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "video conferencing tool": "https://www.techradar.com/best/best-video-conferencing-software",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "Google/Outlook calendars": "https://www.techradar.com/best/best-calendar-apps",
    "email address": "https://www.techradar.com/best/best-email-clients",
    "Skype": "https://www.techradar.com/best/best-alternatives-to-skype",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "privacy and security": "https://www.techradar.com/best/anonymous-browsing",
    "encrypted": "https://www.techradar.com/best/best-encryption-software",
    "videos": "https://www.techradar.com/news/best-video-editing-computer",
    "Zoom": "https://www.techradar.com/reviews/zoom"
  }
}