{
  "source": "https://www.techradar.com/reviews/ultimate-ears-hyperboom",
  "title": "Ultimate Ears Hyperboom review",
  "category": "audio-visual",
  "updated": "2020-10-01T17:26:10Z",
  "author": "truls-steinung",
  "summary": "UE Hyperboom is a party speaker that packs a punch",
  "verdict": "The Ultimate Ears Hyperboom is the brand’s largest speaker to date, and it allows you take your party anywhere, whether that’s indoors or outdoors – although it is a little heavy. In addition, it has a stylish and discreet design, and the ability to pair with two devices at once. It's on the pricier side for Bluetooth speakers, but it delivers excellent sound.",
  "pros": [
    "Excellent sound",
    "Smart dual connection",
    "Stylish design"
  ],
  "cons": [
    "Heavy to carry",
    "Expensive"
  ],
  "article": [
    "The Ultimate Ears Hyperboom is a powerful party speaker that allows you to easily take your music from inside your home to the great outdoors.",
    "Ultimate Ears is one of the market leaders in portable Bluetooth speakers, with models like the UE Boom 3 and the UE Wonderboom 2 making our list of the best Bluetooth speakers of 2020.",
    "Until now, Ultimate Ears speakers have sported compact designs that are small enough to slip into a bag – not so with the new Hyperboom.",
    "This is the largest speaker they have made so far by a good margin, and it’s designed to be used as an all-in-one party speaker that can keep the festivities going well into the night (and the morning, if the party’s really good).",
    "In our experience, the Hyperboom certainly lives up to the reputation Ultimate Ears has established as a reliable maker of good Bluetooth speakers – in fact, it delivers better sound than many of the models we’ve tested before.",
    "With the Hyperboom, you get a very well-balanced soundstage with powerful bass, it can reach high volumes without distorting the sound.",
    "We also liked the multi-point pairing feature, and in practice it allows you to seamlessly switch between DJs at a party without your party being plagued by awkward silences.",
    "Beyond that, the biggest problem with Hyperboom is that it is expensive, but if you are willing to pay (and to carry the 5.9kg / 12lbs speaker with you) then you get lots of great sound, portability, and connectivity for your money.",
    "The Ultimate Ears Hyperboom is available to buy for $399.99 / £359.99 / AU$599.95.",
    "It’s far pricier than any of Ultimate Ears’ previous speakers, as well as most of the Bluetooth speakers we’ve tested this year – aside from high-spec models like the Sonos Move and the Bose Home Portable Speaker.",
    "Ultimate Ears' speakers often boast a sporty design that is characterized by mesh fabric covers and plastic hardware, and the Hyperboom continues in this tradition. At the same time, Ultimate Ears has chosen to make the Hyperboom a little more discreet by opting for a black finish, rather than the many colorful options you can choose from when buying a Boom or Megaboom.",
    "It also differs from similar party speakers from competitors such as JBL and Sony, which are often less subdued and sometimes come equipped with flashing lights in all the colors of the rainbow.",
    "Another thing that distinguishes it from previous models is that it has a square shape. This was explained to us by UE's product manager, Doug Ebert, who said that the company wanted to “deliver the best possible listening experience with a proper stereo image”, rather than ensuring 360-degree sound with a cylindrical build.",
    "The overall impression we get from the construction of the UE Hyperboom is that it’s very solid, and it will probably withstand being transported and used in different environments without being damaged. It also comes in handy that it has IPX4 water-resistance certification, which ensures that it can handle splashes from a pool, while a spilled drink shouldn’t end the party.",
    "More details preserved from previous UE speakers are the large plus and minus signs that allow you to adjust the volume – but in this case these are located on the top, rather than the front of the speaker. There you will also find the on / off button and the controls for Bluetooth connectivity and switching between sources.",
    "On the back is a large rubber handle equipped with an Ultimate Ears logo in capital letters, and below this is a rubber hatch that hides a 3.5mm audio input, an optical input, a USB port that can be used to charge your phone, and a charging port for the speaker itself. The inclusion of an optical input means you could use the Hyperboom in place of a soundbar to boost your TV’s audio.",
    "The controls for the UE Hyperboom are located on the top of the speaker, and the large plus and minus symbols that we have already mentioned, work well to adjust the volume. The rest of the operation consists of an on / off button and the four source buttons, which are placed in a circle with a play / pause button in the middle.",
    "Connecting the speaker to your device wirelessly is made simple by holding down one of the Bluetooth buttons – and here we come to one of the unique functions of Hyperboom. It allows you to pair two Bluetooth devices at once and switch seamlessly between them, preventing awkward silences when one party DJ takes over from another.",
    "When you switch to a new device, the previous music source is automatically faded out, while the new device starts playing from where it last left off.",
    "It’s worth noting that Hyperboom is only equipped with Bluetooth and not WiFi connectivity. This may seem a little limited to some, but Ultimate Ears believes that Bluetooth is easier to use spontaneously at parties – and we tend to agree.",
    "The associated Boom app contains a few more adjustment and control options. Here you get the opportunity to connect several UE speakers and use them together, switch the audio source, and adjust the volume, as well as presetting up to four different playlists in Amazon Music, Deezer or Spotify, which can be started by holding down the Play button for three seconds.",
    "In addition, you also get a five-band EQ that allows you to adjust the sound, and the ability to turn on and off the Adaptive EQ function, which automatically adapts the sound to your surroundings.",
    "When a loudspeaker is placed in a corner, the bass frequencies can sometimes become muddied due to the sound bouncing off of the walls, so the Hyperboom compensates for this by dampening the bass. Similarly, it will do the opposite if you place it in the middle of an open space, so that you don’t miss out on powerful bass frequencies. We found this to work very well, and it’s great to not have to think about where you're placing your speaker for optimum sound.",
    "It’s worth mentioning that the 24-hour battery life is based on playing your music at 50% volume. Still, we expect the battery to last long enough to power your party, as long as you remember to charge the speaker before you leave home.",
    "The most positive thing about the Ultimate Ears Hyperboom is that it boasts a strong audio performance. In fact, this speaker exceeds all expectations, especially considering that UE's speakers have previously delivered slightly harsh treble frequencies to our ears.",
    "The Hyperboom really lives up to its name when it comes to volume level; it simply plays your music really loud, and has no problem filling a large living room or garden with party music.",
    "It also delivers a very well-balanced soundstage. Here you never get the feeling that the bass is overwhelming the other elements of your music, and almost no matter what you listen to, you get an enjoyable, lively experience.",
    "At the same time, there’s no shortage of bass on offer. As we blasted Billie Eilish's Bad Guy, we felt the sound was well-proportioned, with deep bass lines that didn’t muddy the other frequencies. The Weeknd's Blinding Lights also highlighted the great bass performance, with no signs of the lower frequencies bleeding into the other elements, while the 80s-inspired synths sounded clear without being overly sharp.",
    "The Björk classic Army of Me, which also boasts a powerful bass line, leaves a similar impression; the Ultimate Ears Hyperboom capably conveyed the holistic soundscape with its industrial drums and soaring vocals, with no signs of distortion even when we turned the volume up high.",
    "For those of you who like rock music, we can also state that Hyperboom copes well with the more tightly packed soundstage created by electric guitars, drums, and bass, without losing clarity or detail.",
    "On the whole, we would say that most genres can be played adeptly on this speaker, so no matter what kind of musical taste you may have, the Hyperboom should ensure a party atmosphere.",
    "One negative aspect of the audio quality is that the Hyperboom only really ‘opens up’ when you reach a certain sound level. It can therefore sound a touch restrained at a lower volume, but since this speaker was primarily made with a view to playing loudly at parties, it’s not a dealbreaker."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Ultimate Ears Hyperboom price and availability",
    "10": "Design",
    "16": "Controls and connectivity",
    "20": "App and battery life",
    "24": "Audio performance",
    "32": "Don't buy it if..."
  },
  "links": {
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "UE Boom 3": "https://www.techradar.com/reviews/ultimate-ears-boom-3",
    "UE Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "best Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "Bose Home Portable Speaker": "https://www.techradar.com/reviews/bose-portable-home-speaker",
    "JBL": "https://www.techradar.com/reviews/jbl-boombox",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008"
  }
}