{
  "source": "https://www.techradar.com/reviews/chillglobal",
  "title": "ChillGlobal VPN review",
  "category": "computing",
  "updated": "2020-10-20T15:54:29Z",
  "author": "sead-fadilpasic",
  "summary": "VPN browser extension that unblocks 500+ channels",
  "verdict": "Although it lacks complex functionalities and fine details that full-fledged VPN platforms have, ChillGlobal is a good tool if you need access to geographically restricted services and websites, wherever your location may be.",
  "pros": [
    "Unblocks 500+ channels",
    "Solid performance",
    "Very easy to use"
  ],
  "cons": [
    "Isn’t a full VPN platform",
    "Small server network",
    "No privacy policy",
    "Poor customer support"
  ],
  "article": [
    "ChillGlobal is a proxy/VPN browser extension that is focused on providing you access to websites and online streaming services like Netflix and BBC iPlayer without geographical restrictions. It’s primarily a Firefox smart-plugin, although it also has an extension for Chrome without the smart mode feature.",
    "If you’d rather have a full VPN platform and all the superior features that accompany it instead of just a simple browser extension, then make sure you take a look at one of the best VPN performers in the industry.",
    "ChillGlobal can be used for free for 20 hours every month, 30 minutes at a time. Since this is probably not enough time, you can pick a pricing plan - monthly at $7.50/month, 6-month at $3.45/month, or yearly at $5.70/month. Both the monthly and yearly plans include a 7-day money-back guarantee but there is no free trial in the classic sense. Customers can pay for their account using PayPal or credit/debit card.",
    "Although its platform is very good for specific purposes, ChillGlobal isn’t a true VPN service and therefore has limitations such as a very low server count and lack of advanced privacy mechanisms.",
    "This is where a VPN platform with thousands of servers and other features, like NordVPN or ExpressVPN, truly shines. You can also try Surfshark or CyberGhost, as they all provide a full set of VPN tools for total anonymity and ultimate speeds.",
    "ChillGlobal can be used to stream over 500 TV channels and VOD services that may not be accessible in all areas, including Netflix, BBC iPlayer, Amazon Prime Video, ESPN, ABC, CNN, you name it. You can see the full list on the website and even ask the company to add a channel or website it may have overlooked.",
    "The vendor has offices in Spain, Germany, and Sweden, and offers its service on servers in 15 countries, including Canada, Hong Kong, Brazil, the US, the UK, and others. Unfortunately, it doesn’t provide many details about its services on the website, like what encryption it uses, what its privacy policy is, etc., but we do learn a lot about what it can do.",
    "ChillGlobal states it “doesn’t track or log any data so everything you do online when you use our service is 100% anonymous, safe and secure.” That sounds nice but we have no way of checking if this is true until the provider brings in an outside auditor to confirm it. There are also no additional details on the no-logging policy or even privacy policy on the website except for this one sentence.",
    "The platform is browser-only, which means you shouldn’t use it for torrenting/P2P traffic, but it does prevent search engine tracking, website tracking by website owners, tracking of your IP address, as well as protecting you from being spied on (or worse) when using public Wi-Fi connections. Unfortunately, there is no information on the website about which tools it uses to ensure this.",
    "ChillGlobal can be installed on Windows or Mac devices, as an extension to either Firefox or Chrome (with one less capability) browser.",
    "There’s a huge support section on the website, but many of the articles are redundant, be it rewrites of each other or treating all individual streaming channels separately, like “How to stream Netflix”, “How to stream Hulu”, etc. However, there are also useful tips on using a VPN to save money, improving privacy online, staying safe on social media, bypassing the Great Firewall of China, multi-factor authentication, and more.",
    "For any questions, ChillGlobal directs users to send an email to its support team at support@chillglobal.com or create a support ticket, and it “will get back to you ASAP”. We decided to test and see if this is true, but we still haven’t gotten a response. Maybe our general questions weren’t that much of a priority.",
    "We tested the download speeds when connecting to different servers. The server in the US reached a solid 13.91Mbps on a 60Mbps testing connection, while the Hong Kong one sadly didn’t even move from 0Mbps on our speed test. Poland speeds were much better, with a very fast 21.45Mbps.",
    "We had no problem with either installing or using the extension, as it's simple and intuitive - just set it up on your browser and you can connect immediately. The Firefox extension features both a Manual Mode, letting you choose the country you want to browse from, and a Smart Mode which automatically detects the country of the website you’re visiting. The Chrome extension only works in Manual Mode.",
    "ChillGlobal is a good choice if you primarily want to be able to access websites and services that aren’t available in your area, as it is guaranteed to unblock whichever VOD or other channels you set your mind on.",
    "However, it lacks lots of other, privacy-centered features that are only offered by a full VPN platform such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "3": "Alternatives",
    "5": "Streaming",
    "6": "About the company",
    "7": "Privacy and encryption",
    "9": "Support",
    "12": "Speed and experience",
    "14": "Verdict"
  },
  "links": {
    "ChillGlobal": "https://www.chillglobal.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "website": "https://www.chillglobal.com/channels.php",
    "support@chillglobal.com": "mailto:support@chillglobal.com",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-3766470827283870700"
  }
}