{
  "source": "https://www.techradar.com/reviews/anker-soundcore-life-q20",
  "title": "Anker Soundcore Life Q20 review",
  "category": "audio-visual",
  "updated": "2020-12-01T16:37:15Z",
  "author": "lewis-leong",
  "summary": "Good entry-level noise-cancelling headphones",
  "verdict": "The Anker Soundcore Life Q20 ANC is a good starting point for those looking for active noise cancellation. Sound quality, battery life, and its physical controls are all good, but ANC is just average. They're a bit basic compared to the better ANC headphones out there - and don't hold a candle to Bose and Sony's flagship models - but the Soundcore Life Q20 ANC are a good value.",
  "pros": [
    "Excellent battery life",
    "Extremely comfortable",
    "Intuitive controls"
  ],
  "cons": [
    "Average ANC",
    "No app for customization",
    "No multipoint pairing"
  ],
  "article": [
    "If you’re looking for a solid entry-level pair of active noise cancelling headphones, the Anker Soundcore Life Q20 ANC are very compelling. For the low price of $60 / £52 (about AU$94), you get a pair of headphones that has decent sound quality, 40-hours of playback time, and active noise cancellation.",
    "Just temper your expectations, as the Soundcore Life Q20 ANC are not giant killers.",
    "In terms of sound quality, build materials, fit and finish, and most noise cancellation, the Sony WH-1000XM4 and Bose Noise Cancelling Headphones 700 are still the class leaders. Even compared to the older Sony WH-1000XM3 and Bose QC35II, the Anker’s don’t stand a chance and you shouldn’t expect it to for the price.",
    "What the Anker Soundcore Life Q20 ANC offers is a solid pair of headphones for those looking for just the basics and good-enough sound and noise cancellation.",
    "The Anker Soundcore Life Q20 ANC is available worldwide now for $60 / £52 (about AU$94) making it a very affordable pair of active noise cancelling headphones.",
    "For perspective, the Plantronics Backbeat Pro 2 are an excellent budget pair of ANC headphones that cost $140 / £205 (AU$180), which is over twice as expensive. However, you do get what you pay for as the Plantronics has better sound quality and nice-to-have features like auto play/pause and multipoint pairing. However, the Anker has the Plantronics beat in terms of battery life (30 hrs vs 24 hrs).",
    "The Anker Soundcore Life Q20 ANC won’t win any design awards but they’re still handsome and understated. Black is the only color that’s available but it looks more like a slightly metallic dark blue/gray in real life. The plastic build makes them light and comfortable for extended listening but, as a tradeoff, it does feel cheap. Also, weirdly, the buttons especially have a harsh clang when pressed.",
    "Frequent travelers will like the fact that the headphones have rotatable ear cups and can fold up for storage and travel. However, there’s no hard case included but there’s a pouch in the box if you don’t want to scratch them up in your bag.",
    "Each ear cup houses physical buttons that are large and easy to use. On the left side, you have buttons for power/pairing and ANC. On the right side, you have media playback buttons, which includes a multi-function button that activates your phone’s voice assistant and BassUp, Anker’s name for its bass boost function.",
    "Charging is achieved via microUSB instead of the now-common USB-C port, which is a bummer. There’s also a 3.5mm analog jack so you can use the headphones in wired-mode if you run out of juice.",
    "In terms of comfort, the headphone is lightweight because of its plastic build and ultra-plush leatherette ear cups and headband. We wore the Anker Soundcore Life Q20 ANC for hours on end without feeling any fatigue, even with our glasses on, which is very rare.",
    "Let’s talk about the most important features first: Battery life is rated for 30 hours with ANC on and up to 60 hours with ANC off - and we had no problem hitting the rated 30 hours with ANC on during our testing.",
    "Even better, when you’re out of juice, the headphones top up fairly quickly: Anker claims you can get 4 hours of music playback from a 5 minute charge.",
    "Unfortunately though, the noise cancelling of the Anker Soundcore Life Q20 ANC is just OK. While the headphones were able to block out most low-volume background noises, it can’t keep up with low bass or high frequencies. Sony and Bose still set the standard in terms of ANC.",
    "The Ankers also support Bluetooth 5.0 and we had no issues with audio dropouts. We were even able to walk around the apartment without the signal dropping, though it will cut out if the signal has to make it through too many walls.",
    "The sound quality for the Anker Soundcore Life Q20 ANC is good, but nothing to write home about. There’s not much detail and the tonal balance is definitely on the warm side, emphasizing bass. This makes the headphone easy to listen to for extended periods as the sound is non-fatiguing, but those looking for more detail out of their listening experience will be disappointed.",
    "Unfortunately, Anker doesn’t offer an app to tune the EQ to your liking so you’re stuck with Anker’s out-of-the-box tuning, however it does have a BassUp feature, which boosts the bass even more, but we recommend leaving it off because it sounds terrible. The bass is already pretty muddy and the BassUp feature just exacerbates that deficit even more."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and availability",
    "6": "Design",
    "11": "Features",
    "15": "Audio quality",
    "17": "Don't buy them if..."
  },
  "links": {
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Bose QC35II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "Plantronics Backbeat Pro 2": "https://www.techradar.com/reviews/plantronics-backbeat-pro-2"
  }
}