{
  "source": "https://www.techradar.com/reviews/mint",
  "title": "Mint budget management software review",
  "category": "computing",
  "updated": "2020-09-18T21:38:47Z",
  "author": "rob-clymo",
  "summary": "Take control of all your financial affairs with Mint",
  "verdict": "Mint allows you to take control of your finances and manage everything particularly well via its impressive mobile editions. With a very secure design and lots of user-friendly features Mint is one of the better bets for getting your financial picture in focus.",
  "pros": [
    "Free to use",
    "Good user interface",
    "Multi-factor authentication",
    "Great app editions"
  ],
  "cons": [
    "Monetised by affiliate offers"
  ],
  "article": [
    "Mint is software specifically designed for managing your money, which is very useful given the current coronavirus crisis. Keeping tabs on your finances can get complicated if you have numerous bank accounts as well as investments, pension contributions and savings to monitor alongside your daily outgoings. And that’s why money management app Mint is therefore perfect for covering all bases and joining up those dots.",
    "Mint is owned by Intuit, which is also behind TurboTax and Quickbooks, which means security is at the forefront of its appeal. It’s therefore reasonable to expect a well-designed and engineered package and that’s exactly what you get.",
    "Mint generates revenue to cover its free status by delivering affiliate offers, but if you can put up with that aspect of the software then you’ve got a very decent package at your disposal. However, you might also want to try Quicken, Banktree, Money Dashboard or Moneydance.",
    "One of the best things about Mint is that it is absolutely free to use, no matter if you’re signed up to enjoy its charms on iOS, Android or a good old desktop computer or laptop. Considering that Mint comes with a plethora of great features, and delivers a great user experience, the fact that it's free makes the software very appealing.",
    "However, it should be noted that Mint has to earn its keep one way or another and so, as a result, there are affiliate offers to deal with along the way. That’s fine if you’re in the market for another credit card, but it has to be said that some of the offers are less appealing. While we understand the need to turn a profit, this is perhaps the only real downside of the Mint experience.",
    "Mint might sound like a fairly simplistic proposition and it’s certainly not complicated to master, but the options it provides you with are actually many and varied. The action centres on a few main features, with Mint offering the ability to connect to your bank, or banks, and other financial interests along with keeping an eye on your credit score.",
    "The good thing is that you can also ‘unplug’ these as and when you need to, or if you want to block out specific areas of your finances. Doing all this is really easy and involves nothing more than adding in accounts with the odd screen tap or two.",
    "As you’d expect, Mint keeps a firm grip on security and uses 256-bit data encryption, plus VeriSign security scanning. In fact, as you pick through the Mint landscape you’ll find that there are plenty of places where its meticulous authentication procedures safeguard both you and your data.",
    "Fear not; this is most notable on the app editions, which take into consideration what would happen if your phone gets lost or stolen. Mint subsequently allows you to delete your financial data remotely.",
    "Mint is all about connectivity as it taps into your various financial interests and keeps the picture updated in a dynamic fashion. That’s good news, as you should therefore always have an overview that’s bang up to date. We’d heard some reports that earlier incarnations were subject to connectivity issues, with connecting to specific banks proving problematical on occasions.",
    "However, these days Mint seems to be in very good shape, with its carefully honed interface being complemented by its ‘always on’ edge. If you're running it on a mobile device, be it an Apple iPhone, iPad, Watch or on the Android platform you should find that it ticks over just fine. In fact, in most respects the mobile edition of the Mint experience is the best way to be using it. The whole thing just works.",
    "Getting to grips with Mint is very straightforward, with nothing major to get your head around. In fact, due to the way the software has been designed it works in a very intuitive manner.",
    "While it’s easy enough to find your way around the desktop web browser edition, it’s the app route that really bristles with stress-free functionality. Indeed, the Apple Watch version features a crisp and clear interface that gives you all the information you need in a very good-on-the-eyes format. Getting Mint up and running is also wonderfully easy.",
    "You’ll need to sign up with a username and password and once you're past that stage it’s simply a case of hooking up to your different accounts. This starts with banks, but you can add on every other aspect of your financial world in much the same way.",
    "One of the most appealing aspects of the Mint experience is its ease of use and fuss-free functionality. In that respect there is not too much that requires support, although thankfully its creators have produced a sizeable FAQ area within the application.",
    "Dipping into this section of the Mint app lets you find answers to most questions, although it requires persistence if you want to get to the bottom of less commonly asked questions. As a bonus, however, there is a chat option that lets you get in touch with staff around the clock at the Mint headquarters.",
    "If you struggle with keeping your finances in order, and even if you don't for that matter, Mint makes a lot of sense. It’s free, despite the downside of being beefed up to make money using affiliate offers within the software, and is very easy to use. In terms of getting started Mint could not be easier.",
    "With the capacity of adding in some or all of your financial interests, and also removing them where needed, it is super flexible. The mobile editions deliver really good experiences too, with even the Apple Watch option being detailed and delightful to use, with piles of information on your financial status being available at a glance.",
    "Mint also tops it all off with a safe and secure build, one that provides you with the reassurance that your sensitive data is in good hands."
  ],
  "headers": {
    "3": "Pricing",
    "5": "Features",
    "9": "Performance",
    "11": "Ease of use",
    "14": "Support",
    "16": "Final verdict"
  },
  "links": {
    "Mint": "https://www.mint.com",
    "managing your money": "https://www.techradar.com/best/best-budgeting-software",
    "bank accounts": "https://www.techradar.com/best/best-personal-finance-software",
    "TurboTax": "https://www.techradar.com/reviews/intuit-turbotax",
    "Quickbooks": "https://www.techradar.com/reviews/quickbooks",
    "Quicken": "https://www.techradar.com/reviews/quicken",
    "Banktree": "https://www.techradar.com/reviews/banktree-personal-finance",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "financial status": "https://www.techradar.com/best/best-personal-finance-software"
  }
}