{
  "source": "https://www.techradar.com/reviews/casio-g-shock-gbd-h1000",
  "title": "Casio G-Shock GBD-H1000 review",
  "category": "wearables",
  "updated": "2020-06-11T14:15:40Z",
  "author": "chris-rowlands",
  "summary": "Lots of shock, limited awe",
  "verdict": "Massive and distinctive, the Casio G-Shock GBD-H1000 has all the hardware potential to be a winner. Incredible solar-boosted battery life, built-in GPS and reliable heart-rate tracking should tick all the boxes for runners. But a confounding interface and some strange software quirks seriously limit the appeal of what would otherwise be a capable fitness watch.",
  "pros": [
    "Superb battery life",
    "No shortage of sensors",
    "Rugged build"
  ],
  "cons": [
    "Huge and heavy",
    "Frustratingly unintuitive interface",
    "Most faces can’t be customized",
    "Limited options to export data"
  ],
  "article": [
    "Casio is no stranger to chunky sports watches, but the Casio G-Shock GBD-H1000 is a unique beast. Where the Japanese brand’s Pro Trek devices awkwardly shoehorned Android Wear into rugged packaging, the GBD-H1000 has been designed from scratch to combine sturdy G-Shock style with fitness smarts.",
    "On paper, there are several stand-out features. It’s the first G-Shock watch with a heart-rate monitor and, together with built-in GPS and a suite of sensors, it promises to measure all manner of running metrics. It also offers the unusual option of solar-assisted charging, which can harness natural and artificial light to boost battery life.",
    "In practice, though, its potential is only partially realized. The GBD-H1000 is a decent option if you're a fan of the distinctive styling, provided you have the patience to get to grips with its frustrating interface – and room on your wrist for its colossal case.",
    "The Casio G-Shock GBD-H1000 isn’t designed to challenge the likes of an Apple Watch or a Samsung Galaxy Watch: it’s equipped exclusively for outdoor pursuits. As a result, its physical form prioritizes durability over sleek sophistication.",
    "The GBD-H1000 is not subtle. At 63.0 x 55.0 x 20.4mm, its oversized case is one of the biggest you’ll find on any fitness watch. Chunky resin elements form an angular bumper around the bezel, adding vital protection for the mineral glass screen and enhancing the watch’s shock-resistance. They also eliminate any chance of squeezing it under your sleeve.",
    "There’s no escaping the G-Shock’s heft, but it stops just short of being unwieldy. It’s heavy at 100g, but an appropriately thick urethane band and curved resin back pieces ensure a secure, comfortable fit on most wrists.",
    "Those hoping for a full-color touchscreen will be disappointed, but the backlit black-and-white LCD is kind on battery life and provides clear and visible readouts, even in direct sunlight. A splash of color would help to highlight key information, though: the volume of data displayed can make the screen feel cramped.",
    "The GBD-H1000 is controlled using five physical buttons around its circumference. These require a firm press, which prevents accidental inputs, but it can be clumsy finding your way past those sizeable bezel guards. Apart from the larger metal-accented run tracking shortcut, the textured buttons also feel quite plasticky.",
    "There’s a steep learning curve for the watch’s proprietary OS, too. With six faces and seven mode screens to delve through, it takes time to understand the role of each button, which can change depending on the mode. After several weeks of testing, certain inputs still felt unintuitive – and it’s telling that the user manual requires a flow chart to illustrate how to navigate the interface.",
    "There is plenty of data spread across those screens, including heart rate figures, activity totals and a neat face with two time zones, while the main timekeeping display is large and clear. The layout can only be customized for the running mode, though – so if you want to see a step count on the home screen, for example, you’ll need to use the face with a large chart and a small time readout.",
    "As you can only cycle through screens in one direction, you’ll spend a lot of time pressing the same button to reach the desired display – a task made painstaking by software which misses inputs repeated too quickly. This setup is especially strange for the notification screen: you have to scroll through every other mode before reaching a list of your latest updates, and it’s not possible to create a shortcut because the buttons cannot be remapped.",
    "The backlight provides another quirk, defeating its purpose by disabling whenever you switch mode. Many of these niggles can and should be fixed with future software updates, but for now the interface feels flawed in several ways.",
    "Once you’re familiar with the interface, you’ll find no shortage of data gathered by the GBD-H1000. The watch is equipped with a compass, a thermometer, a pressure sensor and an accelerometer for accurate step-tracking, as well as a heart-rate monitor. This can operate constantly for a complete chart of your pulse or, for longer battery life, only during workouts.",
    "There’s also built-in GPS for route logging. While this proved broadly accurate, the watch took around a minute to pick up satellite signal outdoors and regularly underestimated the distance we travelled, by as much as 300m on a 6km run – a significant margin of 5%. On the other hand, the auto-pause function worked well and heart rate data held up consistently against results from a chest strap.",
    "Although it’s waterproof to 200 metres, the GBD-H1000 will only track full stats for running activity – there’s no swimming or multi-sport mode. Though it’s possible to create up to five custom ‘workouts’ for gym exercise in the app, these are essentially sets of countdown timers which don’t have the same value as the full interval or goal-based training modes offered by some competitors.",
    "A whole range of metrics are available on-screen during runs, including splits, pace and heart rate. The volume of data can sometimes feel overwhelming, but the layout can be rearranged through the companion app and it’s all useful once you know what’s where. After you finish, the results can be dissected on the watch itself – except for the route map, for which you’ll need the app.",
    "One area where the Casio G-Shock GBD-H1000 excels is battery life. Officially, a full charge will see the watch last 12 months in timekeeping mode or 66 hours with the heart rate monitor enabled. In reality, it can go much longer courtesy of a solar panel integrated into the display.",
    "The solar charging system is so effective that we only had to charge the GBD-H1000 once during testing. Even when tracking runs with GPS every other day, the battery level never dropped below 80%. It works best when the watch face is in direct sunlight, but it can also recharge indoors – albeit more slowly.",
    "The watch’s power saving function helps, too. Place it in a dark spot between 10pm and 6am and, after an hour, it’ll automatically disable the display and enter sleep mode.",
    "The result is a device that could theoretically run indefinitely without a wall charger. If you do need to use the cable, the proprietary adapter snaps firmly and neatly into an indent on the back of the case and charges the watch from flat to full in 2.5 hours.",
    "The G-Shock GBD-H1000 only works with the dedicated G-Shock Move app. It’s slick in appearance and comes with a number of tools to guide and improve your running. You can create custom training plans, view your recovery status and analyse all kinds of activity data in-depth, including heart rate zones and aerobic effect – as well as graphs of your progress over time.",
    "You can also use the app to adjust watch settings. Some, such as activity goals, can only be programmed using the app. Others, including alarms, can be adjusted on the watch itself, but it’s more straightforward to do so with your smartphone.",
    "Following an update, the app synced reliably with the GBD-H100 via Bluetooth, automatically refreshing the activity log and data cards which make up the home screen. These clear visual tallies of your results can be rearranged and hidden to suit, making it easy and appealing to get at the info that matters – whether that’s your latest running activity, monthly goals or step counts. You can also add shortcuts for quick access to key settings.",
    "The ‘History’ tab allows you to scroll through your workout history, with swathes of statistics to pore over. If you want to export this data, you can either share a stylised image of your running route overlaid with a few key stats, or – thanks to an update – link the app with Strava, Apple Health or Google Fit. This connectivity introduces a welcome dose of flexibility, but those invested in alternative workout platforms, such as MapMyRun or RunKeeper, will still find it restrictive",
    "The Casio G-Shock GBD-H1000 is a distinctive watch with the potential to be a very capable running companion. Its numerous sensors collect a useful range of data, while the solar charging system translates into theoretically endless battery life.",
    "Its big, chunky case won’t be to every taste, but the rugged design is a trademark of the G-Shock brand and should appeal to Casio fans.",
    "Unfortunately, it’s let down by several limitations. The interface is unintuitive, with a cumbersome system that only allows users to scroll one way through readouts. Despite the size of its case, the G-Shock’s screen is a little too small for the amount of data it displays, while the lack of customisation options is a shame.",
    "The app is visually appealing and offers plenty for runners to get their teeth into, but many will be limited by the ability to export data to only a handful of third-party platforms. Further software updates could transform the user experience and unlock the full fitness smarts of the G-Shock package. Until that happens, the GBD-H1000 doesn’t feel quite sorted enough to justify its £379 (about $470, AU$720) price tag."
  ],
  "headers": {
    "3": "Design",
    "7": "Interface",
    "12": "Features and run tracking",
    "16": "Battery life",
    "20": "Companion app",
    "24": "Verdict"
  },
  "links": {
    "Casio G-Shock GBD-H1000": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7644750616496461000&xs=1&url=https%3A%2F%2Fg-shock.co.uk%2Fgbd-h1000-1a7er&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fcasio-g-shock-gbd-h1000",
    "Android Wear": "https://www.techradar.com/news/wearables/google-android-wear-what-you-need-to-know-1235025"
  }
}