{
  "source": "https://www.techradar.com/reviews/hyperx-cloud-core",
  "title": "HyperX Cloud Core review",
  "category": "computing",
  "updated": "2020-09-18T18:00:50Z",
  "author": "ural-garrett",
  "summary": "Better for PC gamers than console gamers",
  "verdict": "The HyperX Cloud Core gives great all around sound quality, 7.1 Dolby support and solid build design for $100 (£89, AU$169). Perfect for those looking for an affordable device for PC gaming though its best features are handicapped on other devices.",
  "pros": [
    "Very versatile usage thanks to detachable mic",
    "Great bang for buck for all around sound",
    "Rigid build matched with comfort"
  ],
  "cons": [
    "Doesn’t work the best on consoles",
    "Volume controls aren’t very accurate"
  ],
  "article": [
    "Kingston has become a serious contender in the gaming headset market since the debut of the HyperX Cloud back in 2014. Since then, its mainline Cloud series headsets continue to deliver quality at an affordable price through the Hyper Cloud Core 7.1. Designed to “fit anyone’s gaming needs,” there’s much to appreciate for a sound device that costs $100 (£89, AU$169).",
    "The aluminum frame is strong and the closed ear cups are comfortable enough for long gaming sessions. Having a detachable mic allows the Hyper Cloud Core 7.1 to also work well for non-gaming usage. None of those attributes mean anything if the sound wasn’t worth its salt.",
    "Thankfully, the Cloud Core 7.1 excels in the audio department when gaming or taking a walk at the park. This is due-in-part to the virtual 7.1 surround sound packed into a USB audio control box with built-in digital signal sound card. From gaming to music and conference calling, the Cloud Core 7.1 is more than capable. Too bad the feature doesn’t carry over to consoles or mobile devices. Though the sound quality works well outside of PCs, don’t expect to utilize the audio control box. For only a Franklin, multi-platform gamers in need of a versatile headset good enough to take outside should look no further.",
    "Wearing the Cloud Core 7.1 never gets uncomfortable due to the memory foam ear cushions and leatherette-padded headbands. During short or long gaming sessions, there’s enough breathable material to negate potential headset sweat. Even the padding on the headband is thick enough for different head shapes. The aluminum frame provides the Cloud Core 7.1 with an almost unbreakable feel. Once set, the headset can handle vigorous movement without falling off.",
    "Both the braided cords for the 3.5 mm plug and audio control box add to the premium design. Tugs, yanks or accidentally forgetting to take the headset off when standing up too fast from a chair means the Cloud Core 7.1 can take plenty of punishment. It has to be, considering how long the 3.5 mm plug and USB audio cords are.",
    "The detachable microphone snaps firmly into the appropriate headset jack located on the left headphone and takes a bit of muscle to remove. Repositioning the mic is easy as well. Be warned, however: the plastic material for the audio control box doesn’t match the headset. Regardless, button presses are tactile for the 7.1 switch alongside the volume and mic controls. Switching the mic on and off on its side is easy thanks to appropriate ridges. A shirt clip located on the back does the job but feels like it could snap if pressed too hard.",
    "Performance wise, the Cloud Core 7.1 sounds exceptional for gaming The headset definitely enhances situational awareness in shooters like Call of Duty: Modern Warfare, Rainbow Six: Siege and Overwatch. Gunfire sounds sharp while hearing footsteps can help lend a tactical advantage. Single Player experiences like Last of Us II and Tell Me Why sound great, creating a convincing atmosphere. With some adjustments, the mic picks up speech well and doesn't hurt communication. Google and Cortana understood vocal commands without too many problems, too.",
    "For general music listening, the Cloud Core 7.1 can compete with non-gaming focused headsets thanks to the detachable mic. Genre doesn’t matter much. It can handle the heavy bass of more popular contemporary music like Cardi B’s “WAP” featuring Megan Thee Stallion like a champ. Considering games like Fortnite have used virtual performances from artists like Travis Scott and Diplo, those who solely indulge in the modern pop lexicon should be more than satisfied. Music featuring more complex instrumentation like classic rock, jazz, R&B and country offer defined and clear mids.",
    "Hitting the 7.1 button does enhance gaming experiences on PC by giving a crossfeed effect so directional audio sounds clearer. In other instances, it just makes everything sound louder. The Cloud Core 7.1 doesn’t come with a software suite which causes some issues with the audio control box. For one, there’s no way to physically see how to adjust volume for the mic. Meanwhile, volume controls drop and raise in increments of four which is a fairly high difference. Because of that, accurate volume control is better suited for keyboards and general windows prompts. If playing on consoles, users are going to need a controller adapter to properly adjust volume or switch the mic on and off quickly.",
    "There’s a lot to like about the Cloud Core 7.1. It’s comfortable, built well and offers great sound. The Cloud Core 7.1 is most definitely an option for a quality gaming headset for the price. However, the far superior Creative Sound BlasterX H7 Tournament Edition offers the exact same package at the same price, and offers better interactivity with consoles. From a purely PC only gaming perspective, though, the Cloud Core 7.1 has a lot to offer."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Don’t buy it if..."
  },
  "links": {
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "Call of Duty: Modern Warfare": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review",
    "Rainbow Six: Siege": "https://www.techradar.com/news/meet-the-new-rainbow-six-siege-operators-coming-in-operation-grim-sky",
    "Overwatch": "https://www.techradar.com/news/overwatch-gets-its-price-permanently-chopped-almost-in-half",
    "Last of Us II": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Creative Sound BlasterX H7 Tournament Edition": "https://us.creative.com/p/gaming-headsets/sound-blasterx-h7-tournament-edition"
  }
}