{
  "source": "https://www.techradar.com/reviews/razer-kraken-ultimate",
  "title": "Razer Kraken Ultimate review",
  "category": "computing",
  "updated": "2020-01-24T12:48:14.323Z",
  "author": "christian-guyton",
  "summary": "Razer refines the Kraken headset with a new model that lives up to its name",
  "verdict": "With an excellent upgrade to an already excellent headset, Razer have made a gaming headset that can keep you comfortable even in the longest gaming binges.",
  "pros": [
    "High sound quality",
    "Comfortable earcups",
    "RGB lighting"
  ],
  "cons": [
    "Lacks chat mix",
    "Software is still truly awful"
  ],
  "article": [
    "The Razer Kraken Ultimate is, as its name suggests, the culmination of Razer’s headset game. Custom-tuned drivers, plush memory foam earcups and the Kraken’s signature extending mic make for an audio experience that is equal parts relaxing and exhilarating.",
    "Yes, we’re aware that sounds like hyperbole, but we played Control for four hours straight wearing the Kraken Ultimate, and we've never felt such luxury.",
    "The original Kraken was a good headset, make no mistake, as was the Kraken X that followed it. But the Ultimate simply feels a cut above, delivering top-notch sound at an admittedly higher price point.",
    "The Kraken Ultimate costs $129.99 (£129.99, AUS$195), putting it at the pricier end of Razer’s headset offerings. The Kraken Pro line are available significantly cheaper, although the Kraken Ultimate isn’t the most expensive; the Tiamat line are even more costly.",
    "Yet the Kraken Ultimate has drawn a few elements of the higher-end headsets down to its level, including a Discord-certified mic and THX Spatial Audio that provides an incredibly detailed 360-degree surround soundscape. This is a headset designed with gaming in mind, and the features mostly live up to that promise.",
    "The design in general feel high-quality, a must-have characteristic for a piece of hardware you’re going to be wearing on your head for extended periods. The Kraken Ultimate is fairly weighty, but only to the point where it feels sturdily constructed; not to the point of discomfort.",
    "No, comfort is the name of the game here. The leatherette-finished cushions are foam padding infused with a cooling gel that keeps your ears cool and helps to isolate external noise for a disturbance-free gaming session. We mean this quite literally; we couldn’t hear someone talking from three feet away.",
    "The underside of the headband is foam too, meaning that the whole headset sits comfortably on your head. If you’ve got a big head (this reviewer does) sometimes headsets feel a bit like they’re squeezing your skull, like the thumb and forefinger of an angry but invisible god. Not so with the Kraken Ultimate, which remains comfortable and sweat-free for hours.",
    "That’s not to say it was too gentle, mind you. The headset never felt in danger of falling off the head, ears remaining squarely ensconced in those rings of soft, plush memory foam. The frame is mostly steel and aluminium, which definitely seems pretty durable, although granted we only had a few days to test the Kraken Ultimate out.",
    "Testing out the microphone, we found the quality of design extended to that as well. The way that some Razer mics coil up inside the headset when not in use is charming, with a tensile but flexible strength that allows you to position it however you choose. Many other gaming headsets have a solid, inflexible arm supporting the mic that you can flip up to a vertical position when not in use. This mic arm is more malleable, and never feels in danger of snapping off.",
    "The sound quality of the cardioid mic itself is great; obviously, if you’re a serious streamer you’ll likely be better off investing in a larger-scale standing microphone, but for gaming this certainly gets the job done. Voice chat and recordings came across clear as day. The only feature we missed was a manual chat mix control on the exterior of the headset, but this can usually be remedied via software.",
    "The THX Spatial Audio genuinely works, enabling us to pinpoint the exact locations of our foes as their footsteps emanated through the roof above us in an Apex Legends match. We’re not usually one to champion the value of supposedly superior hardware in getting ahead of your opponents in online games, but we was surprised to find that this headset actually was making us play a little better.",
    "And of course, this being one of Razer’s ‘Ultimate’ products, there’s RGB lighting. It’s actually surprisingly understated, less the harsh shine of exposed LEDs, more of a gentle glow in a colour of your choosing. In a darkened room, the surrounding aura is never distracting. There’s also a small red LED on the end of the mic, to remind you when you’re muted.",
    "The major failing of the Kraken Ultimate is actually nothing to do with the headset itself; it’s the practically mandatory way that the headset is integrated with Razer’s Synapse software. Synapse is needed to control everything from lighting to audio settings. It’ll appear instantly the moment you plug the Kraken Ultimate into your USB port, too; there’s no escape. ‘Plug and play’ this ain’t.",
    "Synapse itself is slow, can be buggy on older systems, and urges you to install a tonne of other, mostly unnecessary software. The features it offers aren’t even that impressive; noise cancellation for the mic makes basically all input too muffled, and the ‘vocal clarity’ setting doesn’t appear to do much to voice communication. The volume mixing options are useful though, if only to raise the gain on the mic a little (at default, speech comes through a bit quiet).",
    "While Synapse is a frustration, it’s by no means a dealbreaker. The Kraken Ultimate is a genuinely great headset with a lot to offer, providing the ideal audio and comfort experiences to any dedicated gamer.",
    "This isn’t a cheap headset, but it certainly doesn’t feel like one; the buttons and volume control feel well-crafted, the earcups not shifting as you hit mute or turn on the THX surround sound. This is a damn good headset, and we’d recommend it to anyone."
  ],
  "headers": {
    "17": "Don’t buy it if…"
  },
  "links": {}
}