{
  "source": "https://www.techradar.com/reviews/lg-styler-review",
  "title": "LG Styler review",
  "category": "appliances",
  "updated": "2020-03-12T11:22:18Z",
  "author": "rob-clymo",
  "summary": "The LG Styler lets you enjoy fresher, crease-free clothes but for a premium price",
  "verdict": "The monolithic LG Styler is like having a dry-cleaners in your laundry room. It delivers great results by steaming, drying and removing bacteria and allergens. What you get is fantastic crease-free clobber, but an empty wallet to match.",
  "pros": [
    "Impressive results",
    "Hassle free",
    "Quality build"
  ],
  "cons": [
    "High price",
    "Big and heavy",
    "Minimal capacity"
  ],
  "article": [
    "The LG Styler is a smart steam closet and it’s a bit of a monster. Head to Korea and you’ll see whole rows of these appliances in electrical retailers and, to a lesser extent, the US has embraced the steam closet too. But the LG Styler is undeniably niche.",
    "So is it an indulgence that you can do without? Or does this clever upright slab of tech do things for your clothes that the dry-cleaners can’t? It certainly offers convenience, as you can pop in a jacket, shirt and trousers for the night and have them fresh and ready-to-go for work the next day. However, with just three hangers and a trouser holder in the door this is not a high-volume machine.",
    "The LG Styler is out now and is available for £1899/$2099/AU$3299 directly from LG or from John Lewis in the UK. At the time of writing John Lewis had availability on the black door model. If you’re in the US or Australia then the LG website can help you track down stockists. These are high-value items and with the niche appeal you may find they’re slightly harder to get hold of than many everyday items like washing machines and tumble dryers.",
    "As for comparable products then the Samsung AirDresser is a similar style appliance and is another high-priced unit that costs £1999 direct from Samsung in the UK. No pricing is currently available for the US, though it does appear to be available in Australia for AU$3299.",
    "The Styler works by using LG’s TrueSteam technology. The company claims it ‘eliminates over 99.9 percent of the germs and bacteria found in clothing and home furnishings’, which has been certified by the British Allergy Foundation. So there would appear to be merit in the claim. While the appliance does not wash clothes it does have a pretty potent steaming capacity.",
    "It combines the steaming process with movement that comes from a hanging rail at the top of the cabinet that effectively shakes out creases and dislodges dirt and dust into the bargain. Meanwhile, the door houses a fold-out plastic panel that you put trousers in, which is billed rather curiously as Pants Crease Care.",
    "LG’s Styler has four core functions. There’s Refresh, for suits, dresses and sweaters, which can be used to resurrect tired outfits in as little as 20 minutes. Gentle Dry, meanwhile, does a more genteel job of tumble-drying clothes in comparison to your normal spinning appliance. Shrinkage is minimised as a result. Crucially, there’s a Sanitary mode, which is the functionality that eliminates allergens and bacteria. Finally, the Trouser Press option will return your creased trousers to their shop-bought feel.",
    "Things get fairly toasty inside too. Steam generated within the LG Styler tops out at 60 degrees. You can also mate the LG Styler with the LG ThinQ app on your smartphone, which allows you to control it without pressing any buttons on the unit. LG also states that, with the door open, the Styler will double up as a dehumidifier, which adds a little more value to this premium-priced monolith.",
    "The LG Styler doesn't just do the obvious garments either, so alongside suits, shirts and trousers it’s able to take on all sorts of crumpled or musty items. It’ll revitalise bedding and, more usefully, fusty coats that have been at the back of the closet for a while, giving them a whole new lease of life. Pick the right program and you get your garments back feeling fresh, aired and crisp. We even revived some stuffed toys that were going to be passed on to a new owner.",
    "The LG Styler does look the part. Our review sample came with a black glass front door, but there’s a variation in white available too. It’s rather tall (1850mm) and narrow (449mm) with a depth of 585mm, which means that it’s a challenge to get into your preferred position. The LG Styler also weighs over 80 kilos and that too presents you with a problem if you live upstairs and don’t have a lift. In its packaging it’s unwieldy, and out of the cardboard and polystyrene protecting stuff it’s just plain heavy.",
    "LG's promotional images show the Styler looking super-cool in plush apartments, with a dedicated clothes or dressing room proving to be the ideal location for it. You can also wangle it into fitted furniture if you want a seamless design feel. Bear in mind though that the LG Styler generates heat, so it needs room for air to circulate. The manual gives handy guidance on the tolerances.",
    "The appliance comes with a box of feet, which includes levelling options if you’re installing it on hard floors. There’s also a pair of spiky feet for carpet, which are designed to push through the fibres and the backing to hold the unit firmly in place.",
    "There’s a degree of vibration generated by the LG Styler. During our time with it the steam machine seemed to almost oscillate, which is probably down to the hanger mechanism inside that jiggles backwards and forwards while the appliance does its stuff. The Styler is pretty quiet though with an operational volume of 40dB(A), thanks to its inverter motor, which is as good as they come. So, on a hard floor the LG Styler gets a thumbs-up on the operational front.",
    "The LG Styler is actually a breeze to setup after you’ve gone through the rigmarole of getting it into position. You’ll need close proximity to a mains plug socket, but aside from that it’s self-contained. There are two small pull out tanks at the bottom front of the appliance, with the one on the left catching any post-program waste water. The one on the right is for fresh water, which can be straight from the tap rather than needing to be distilled. Easy.",
    "All of the interesting stuff happens on the front of the appliance, with that shiny glass door being home to an array of touch-sensitive LED function buttons. Here you can select your preferred mode (Refresh, Special Care, Sanitary, Gentle Dry), including the intensity of the program selection. These include Normal or Light for a quick once over through to Heavy for a full-works refresh. You can also delay the start.",
    "Program times are displayed in the door, so you know just how long things are going to take. Interestingly, we found that you can open the door mid-cycle, which does allow you the opportunity to see that shaking hanger system doing its thing.",
    "We loved the jaunty tone you get once a program has completed. It’s almost like a low-key fanfare announcing that your laundry is ready to be revealed. However, opening that hefty door for the first time did reveal mixed results. We took things gingerly not wanting to shrink prized suits and shirts by accident.",
    "And this is the thing with the LG Styler: despite the comprehensive user guide it does take a little bit of getting used to. Initial runs left us with creases and a slight air if disappointment. However, with practice we were managing to get some really impressive results.",
    "The heat pump system seems efficient, while that TrueSteam nozzle at the bottom of the unit did a nice job on some stale smelling hats we placed on the rack just above. The LG Styler also seems fairly frugal on water usage, though you do need to replenish the tank from time to time. It’ll tell you when that needs doing though. Energy usage on Refresh Normal mode is 1850W, though the appliance uses less if you’re just drying.",
    "You can boost the appeal of the LG Styler by using filter sheets too. These are smelly paper sheets, impregnated with perfume that fit into a special steam slot at the bottom of the appliance. We had Aroma Sheet by Saffron filters with the demo model.",
    "As the machine aerates and steams your clothing so the aroma gets to permeate your clothes. It’s an acquired taste, with our sample pack of by Saffron leaving things smelling basically fresh, but a little pongy. Think car air freshener here. Doubtless it’ll really appeal to some.",
    "As mentioned earlier, the LG Styler has an RRP of £1899. That’s a lot of money, particularly for the level of capacity on offer within its tall and narrow design. While it hasn’t really been designed for high volume use, it’s therefore easy to imagine issues for anyone with two professionals in the house, both of whom need crisp and dry formal wear for work the next day.",
    "However, if you’ve got a small wardrobe, deep pockets, love cool tech and have the room then it’s definitely one for your wants list."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "LG Styler and \"TrueSteam\" technology",
    "9": "Design",
    "13": "Setup",
    "16": "Performance",
    "21": "Verdict"
  },
  "links": {}
}