{
  "source": "https://www.techradar.com/reviews/urbanista-paris",
  "title": "Urbanista Paris review",
  "category": "audio-visual",
  "updated": "2020-01-21T16:14:35Z",
  "author": "jennifer-allen",
  "summary": "Comfy fit for a budget-friendly price",
  "verdict": "Continuing Urbanista's predilection for delivering good quality at a decent price, the Urbanista Paris are a neat AirPods-style set of true wireless earbuds. The sound quality could be a little better, but they're delightfully comfortable.",
  "pros": [
    "Very comfortable fit",
    "Simple to use",
    "Stylish looking"
  ],
  "cons": [
    "Sound quality could be stronger",
    "Touch controls are fiddly"
  ],
  "article": [
    "Urbanista is steadily becoming a force to be reckoned with in the speaker and headphones market, thanks to its simple Scandinavian designs and budget-friendly prices.",
    "The Urbanista Paris are much the same as previous Urbanista products, like the Stockholm true wireless earbuds. While the sound quality isn't quite up there with the greats, these earphones feel comfortable at all times, take seconds to set up, and look pretty good too – and could be a convincing alternative to the far pricier Apple AirPods.",
    "The Urbanista Paris true wireless earbuds have a recommended retail price of $99 / £99 / AU$169 but discounts aren't hard to find at Amazon. That's pretty easy on the wallet compared to the Apple AirPods, which start at $159 / £159 / AU$249 (unless you can find a great AirPods deal, that is).",
    "There are four colors are available, including Midnight Black, Olive Green, Rose Gold, and the rather quirkily named Fluffy Cloud (white, to you and me).",
    "It doesn't take a genius to realize that the Urbanista Paris are taking a lot of inspiration from Apple's AirPods, with elongated earbuds that hang down slightly outside of your ear. While your mileage will vary depending on the size of your ears, we found them to be some of the comfiest earbuds we've worn in a long time.",
    "The silicone eartips however, are more reminiscent of the newer AirPods Pro, which give a more customizable fit than their plastic-tipped predecessors – so too, the Paris provide a better fit than their predecessors, the Urbanista Stockholm.",
    "Simply put, the design just works. They're lightweight and fit snugly in your ear while not feeling like you're forcing an awkward shape into a similarly awkward hole. Even when jogging and moving about at speed, not once did we feel like they'd fall out easily. Something that sometimes can't be said for much more expensive earbuds.",
    "On the side of each earpiece are the controls, marked by a tiny Urbanista logo. Tap it once to play or pause a song, or double tap to bring up Siri or Google Assistant. A sweeping motion controls the volume, although we did find this was more than a little temperamental.",
    "While trying to pause a track, we increased the sound to a fairly uncomfortable level by mistake. In the end, it was far easier to use the controls on our phone or watch instead.",
    "Unusually, the earbuds don't have left or right markers, so you have to guess which bud goes in which ear.",
    "The Urbanista Paris come with a fairly standard-looking charging case that matches the color of your choice of earbuds. It might look unremarkable but it offers the features you want, namely wireless charging, which means you can place it on any Qi-certified charger to top up its battery. It's a convenient touch for those who have already embraced wireless charging with their phone.",
    "Battery life is about standard for these type of earphones. Expect about five hours from one charge, with the case holding three additional charges. At about 20 hours in all (which we found to be mostly accurate), the battery life of the Urbanista Paris is about right for this price. Supposedly, there's 110 hours of standby time too, which is handy if you want to use them fairly infrequently.",
    "The Urbanista Paris offer an IPX5 water resistance rating, which will keep you covered if you're worried about a bit of rain ruining your buds while you're out and about – just don't count on these if you're diving into a pool. For that you'll want to check out the best swimming headphones of 2020.",
    "Want to take a call with these? Well, you can and refreshingly, calls are directed through both earbuds rather than just one; this addresses a common frustration associated with true wireless earbuds that use a master/puppet setup, only sending call audio to one earbud. Not that we'd rate the microphone quality particularly highly, but it does the job in a pinch.",
    "The Urbanista Paris's 10mm drivers are predictably heavy on the bass. It's something that's common with earphones in this kind of price range, but that's not necessarily a bad thing if you want to use these buds for working out or simply prefer a bassier sound.",
    "For the most part, the bass doesn't overpower the other frequencies and its warmth that means tracks like Macklemore's Can't Hold Us, and Linkin Park's Papercut sounds suitably punchy. We particularly appreciated returning to the old classic, Another One Bites The Dust.",
    "Where the Urbanista Paris falter is when it comes to trebles and mids. They lack detail and strength, with the likes of Under Pressure sounding okay, but lacking the clarity that you'd hear from audiophile earphones.",
    "There are also minor issues with background hiss, particularly when it comes to quieter or live tracks that haven't been treated to the full studio treatment. This is commonly a result of active noise cancellation, but that feature isn't offered by the Urbanista Paris.",
    "As it is, these earbud's passive noise cancellation (i.e, the noise cancellation that comes from the physical barriers provided by the buds themselves) doesn't do much good, and the hiss is a bit of an annoying mystery.",
    "For all their flaws, the Apple AirPods sound better, and the AirPods Pro better still. With the Urbanista Paris, everything sounds fine if not quite as impressive as you know certain songs can and should sound with the right headphones. Having said that, it's mostly forgivable at this price point.",
    "For day to day activities such as commuting or jogging and for listening to podcasts, you'll find the sound quality reasonable enough. If you plan on sitting back and really listening to your music, you'll need to look towards audiophile-friendly true wireless earbuds like the Sony WF-1000XM3 or the Cambridge Audio Melomania 1.",
    "If you can't justify the cost of AirPods and you're not too fussed about the higher sound quality they afford, then the Urbanista Paris could be a good bet.",
    "They're far cheaper and don't require you to buy an extra case to enjoy wireless charging. They fit great too, and are sure to be particularly handy for those planning to exercise while they listen to music.",
    "While things could sound a little crisper at times, the Urbanista Paris are still not bad at all in terms of sound quality, with strong bass that makes these buds suitable for working out. Generally, we feel that they are an improvement on the Urbanista Stockholm true wireless earbuds, and we'd recommend opting for the Paris if you're choosing between the two.",
    "Throw in the ease with which you can find them at a good discounted price, and the Urbanista Paris continue the trend the company is developing a reputation for – solid and dependable audio for a smart price."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "10": "Features",
    "14": "Sound",
    "21": "Final verdict"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Stockholm true wireless earbuds": "https://www.techradar.com/reviews/urbanista-stockholm-true-wireless-headphones-review",
    "earphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "AirPods deal": "https://www.techradar.com/news/cheapest-airpods-prices",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Urbanista Stockholm": "https://www.techradar.com/reviews/urbanista-stockholm-true-wireless-headphones-review",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "best swimming headphones": "https://www.techradar.com/best/best-waterproof-headphones",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1"
  }
}