{
  "source": "https://www.techradar.com/reviews/razer-cynosa-v2-keyboard",
  "title": "Razer Cynosa V2 Keyboard review",
  "category": "computing",
  "updated": "2020-08-01T22:00:51Z",
  "author": "ural-garrett",
  "summary": "Still the best in class",
  "verdict": "The Razer Cynosa V2 continues the hardware maker’s ability to create quality budget friendly gaming keyboards. Not only does it improve upon its predecessor’s design but also adds more functionality through individually lit RGB keys and media controls.",
  "pros": [
    "Meaningful refinements over its predecessor",
    "Inexpensive price remains",
    "2-year warranty"
  ],
  "cons": [
    "Membrane switches"
  ],
  "article": [
    "Though Razer has evolved to developing everything from laptops to phones, gaming mice and keyboards are still the soul of the company. Keyboards like the flagship Razer Huntsman Elite andthe more entry level Razer Cynosa Chroma prove it can provide quality at all price points.",
    "For the Razer Cynosa V2, the gaming manufacturer returns with the same quality that earned its predecessor our coveted “Best Value” award two years ago. The entry-level membrane switch gaming keyboard features enough improvements and added functionality to succeed the original. Razer not only maintains the spill-resistant low profile design but RGB lighting at an affordable $59.99.",
    "Once unwrapped, the Cynosa V2 shares a similar design language as the original, including a compact profile and matte black finish. Between the dual hinged feet on the backside, there are now three grooves allowing users to tuck the keyboard’s USB cable left, right or center. It’s a subtle way of ensuring better cable management and less clutter. Durability also still seems to be a virtue with a solid build quality that doesn’t feel cheap.",
    "The most notable addition to Razer’s new cheap keyboard are the media controls. Located on the upper right corner of the Cynosa V2, the buttons are close enough to the main keys for easy use. They all work well and the volume rocker feels so right. The previous Cynosa received slights for its lack of dedicated macro keys. Having solid media controls makes up for it a little. If using Google Chrome, be mindful to enable media handling through the Chrome experiments menu or they won’t work.",
    "RGB lighting sees the biggest improvements on the Cynosa V2. Each one of the individual keys are now individually backlit and therefore, look a bit brighter. There’s even a cool effect where holding the Fn key singles out backlighting for controlling things like Razer’s GameMode or putting the desktop in sleep mode.",
    "Most importantly, keys are customizable through RGB Chroma Studio on Razer’s Synapse app. Between the highly touted 16.8 million colors and suite of visual keyboard effects to choose from, there’s a lot of possibilities in customization.",
    "First time users may find the software a bit overwhelming at first. However, it’s pretty fun tinkering with settings once individuals eventually get tired of the tons of lighting presets. Those lighting effects can go further through individual lighting sets for over 150 Chroma-integrated titles like Fortnite, Overwatch and Gears 5. Of course, all the key macros are highly customizable through Synapse too.",
    "Performance wise, the Cynosa V2 makes some purposeful improvements. Those who weren’t fans of the membrane switches of the original and hoping for something more mechanical may be a bit disappointed. Regardless, the keystrokes feel exceptional when engaging in general typing and heavy gaming. Besides having a 1000Hz polling rate and N-key rollover, it’s more than sufficient for first-person-shooters or real time strategy games. The Razer Cynosa V2 is also fairly quiet, albeit still audible, during heavy typing. Many would prefer more pricier mechanical switches, but Razer seems to be improving its unique mesh switches substantially.",
    "Alongside the quality build, Razer also backs its keyboard with a two-year warranty besides a 14-day risk-free return if purchased directly from the RazerStore. For the Razer Cynosa V2’s price range, there’s so much to love.",
    "Anyone looking for an entry level gaming keyboard below $60 with this much quality should look no further. The Cynosa V2 doesn’t make the grand entrance as its precursor and it doesn’t need to. It makes purposeful refinements and additions that’ll make one wonder what else can Razer fit into its budget friendly line in the future."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Don’t buy it if..."
  },
  "links": {
    "Razer Huntsman Elite": "https://www.techradar.com/reviews/razer-huntsman-elite",
    "Razer Cynosa Chroma": "https://www.techradar.com/reviews/razer-cynosa-chroma"
  }
}