{
  "source": "https://www.techradar.com/reviews/baseus-gn-18d-dex-compatible-smartphone-docking-station",
  "title": "Baseus GN 18D Dex-compatible smartphone docking station review",
  "category": "phones",
  "updated": "2020-11-19T05:47:09Z",
  "author": "desire-athow",
  "summary": "From an obscure manufacturer comes a product to help you experience something unique",
  "verdict": "The Baseus GN 18D smartphone docking station paves the way to something exciting, the realisation that your powerful smartphone can be transformed into a fully-fledged computer without the need for an expensive peripheral.",
  "pros": [
    "Dex features without the name",
    "Very affordable",
    "Plenty of ports",
    "SD and MicroSD can be used at the same time"
  ],
  "cons": [
    "Triggers error messages",
    "Problematic with smartphone cases",
    "Not universal compatibility",
    "Cheaper options available"
  ],
  "article": [
    "One long-promised paradigm shift that smartphones were expected to bring was being able to replace the desktop PC and Samsung, with Dex, has been the biggest proponent of such a game-changing move since 2017 with the Samsung Galaxy S8.",
    "In a nutshell, it allowed users to switch their Android interface to a traditional desktop akin to Windows 10, complete with a mouse pointer, a start button and everything you’d expect from a desktop OS. The arrival of Android 10 and its desktop mode means that more smartphones can benefit from this experience and products such as the Baseus USB-C smartphone docking station help make the transition far more easier.",
    "Samsung does push Dex as a versatile productivity tool. From an IT perspective, such a solution would seem to be a godsend as it simplifies device management (only one device to be serviced). It does open a Pandora box with regards to app compatibility, potential security issues, performance etc.",
    "The GN 18D smartphone docking station is available from Amazon for $59.99 at the time of writing and Baseus has regular promotions.",
    "The Baseus USB-C smartphone docking station is like a small Bluetooth speaker with a sliding cover that converts into a phone holder - with a ribbed surface - and reveals a longer-than-usual USB Type-C connector.",
    "The whole thing looks like an evolution of the Dex Station. At 100 x 100 x 45mm for a weight of less than 200g, it is reasonably compact to be carried around but don’t be fooled by its size.",
    "There’s a 4K HDMI connector, a 49W Type-C PD charging port, three USB 3.0 Ports, a 3.5mm audio jack and two card readers, one SD and one microSD which can be used at the same time.",
    "The docking station doesn’t come with a charger, you will have to use your phone’s one and the plastic finish might put some off because of its tackiness. Flimsy it isn’t though despite the appearance.",
    "First and foremost, the official list of compatible smartphones include the Samsung Galaxy S10/S9/S8/S10+/S9+/S8+, Note 9/8, Huawei Mate 10/10 Pro/20 Pro, P10/P20. That’s likely to be an incomplete list as it doesn’t include newer models which are almost certainly compatible. Dex works on the Galaxy A90 5G as well, for example and we believe that Google’s Pixel line of mobiles and even recent high-end Honor models - given the common DNA with Huawei - will be compatible.",
    "The process is essentially plug and play without any drivers or software installation; we used a Samsung Galaxy Note9 smartphone and the transition was seamless, well almost. You do need to remove the smartphone from its case - if it has one - and inserting the fixed Type-C plug into the connector can be problematic.",
    "There’s a couple of error messages warning you that you’ve plugged in an unsupported device but swat them away and you’re ready to go. Android desktop via Dex is a mature, enjoyable user experience that delivers what is promised, the ability to be more productive on a single device.",
    "That said, one can see that the fundamental flaw of the GN 18D is that a smartphone is meant to be connected and disconnected several times a day, not something you’d do with your desktop computer. Yes, you can use a Bluetooth headset to mitigate the issue but that would be, for many, a compromise too far.",
    "The Baseus USB-C GN 18D smartphone docking station is a bit of an eye opener. Many won’t mind connecting and disconnecting their phones to the dock but for us, there’s just too many hoops to jump through especially as you have to acknowledge the changes when moving in and out of the Dex environment.",
    "Given how powerful flagship smartphones now are, surely, it’s only a matter of time before someone comes up with an elegant and simple solution that doesn’t require you manually plugging in your smartphone. It might be a mat that combines wireless charging with physical connectors and the ability to mirror your smartphone’s content in a couple of seconds via an automatic handshake.",
    "As for the Baseus, here’s the rub. This smartphone docking station doesn’t have a secret sauce to kickstart the Dex mode. Indeed, any actively-powered (PD-enabled) USB Type-C docking station could potentially pull that trick. We tried it on an IOGear model and it worked. It is more expensive but also offered far more connectors and didn’t require us to remove the Note9 out of its casing.",
    "So, while the GN 18D smartphone docking station is a very good product, whether or not you should buy it depends on (a) whether you want to try Dex (b) whether your smartphone is compatible and (c) how committed you are to make the big jump."
  ],
  "headers": {
    "3": "Availability and price",
    "4": "Design and features",
    "8": "In use",
    "12": "Final verdict"
  },
  "links": {
    "Samsung, with Dex": "https://www.techradar.com/news/samsungs-dex-dock-turns-the-galaxy-s8-into-a-competent-desktop",
    "docking station": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "GN 18D smartphone docking station": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FStation-Baseus-Docking-Adapter-Experience-Updated%2Fdp%2FB07ZR57G7B%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7933358931730267000-20",
    "Dex Station": "https://www.techradar.com/news/samsung-galaxy-s8-dex-station-now-available-to-pre-order-and-its-not-cheap",
    "Galaxy A90 5G": "https://www.techradar.com/reviews/samsung-galaxy-a90-5g-review",
    "Samsung Galaxy Note9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Bluetooth headset": "https://www.techradar.com/news/the-best-bluetooth-headsets"
  }
}