{
  "source": "https://www.techradar.com/reviews/samsung-q6fn-qled-tv-qn65q6fn",
  "title": "Hands on: Samsung Q6FN QLED TV (QN65Q6FN) review",
  "category": "televisions",
  "updated": "2021-05-07T13:38:05Z",
  "author": "michael-hicks",
  "summary": "The Samsung Q6FN comes at a bargain price",
  "verdict": "Samsung's lower-end 2018 QLED brings HDR10+ streaming and 4K gaming but, from what we've seen so far, doesn't quite have the specs to fully unlock their beauty.",
  "pros": [
    "Adds HDR10+ and 4K gaming",
    "Most affordable QLED TV",
    "Ambient mode",
    "Smart home UX looks seamless"
  ],
  "cons": [
    "Edge LEDs mean poor contrast",
    "Low-level brightness",
    "Bad reflectivity at angles",
    "More traditional design"
  ],
  "article": [
    "The Samsung Q6FN QLED TV (QN65Q6FN) was released as part of the brand's 2018 lineup, which included the high-spec Q9FN.",
    "The Q6FN, while at the lowest end of Samsung's 2018 QLED TV family in terms of specs, offers a more budget-friendly option compared to the brand's best QLED TVs . (Looking for a newer TV? Check out our Samsung Q60R QLED TV review, or try our new Samsung TV guide.)",
    "Like other screens in the 2018 range, the Q6FN QLED smart TV uses a metallic quantum dot filter. This enhances color and contrast, boosting the capabilities of HDR and 4K images in comparison to other non-quantum dot LCD-LEDs.",
    "Let's get one thing straight: this QLED TV doesn’t have the same processing power or the beautiful contrast of many of its siblings. That's especially the case now that the tech has been upgraded even more and Samsung has started branching out into 5G 8K TVs.",
    "[Update: It looks like Samsung is developing something quite different: windows that can emit their own light, with the option to control the color temperature, brightness, and even the angle of the light.]",
    "But what the Samsung Q6FN QLED TV (QN65Q6FN) does bring you is access to many of Samsung’s newest connected Smart TV apps and features, which will let you turn your TV into a voice-controlled smart home hub for all your appliances and smart home devices.",
    "What's more, it will fulfil all of your 4K, HDR10+ and full color volume needs, and sells in a wide range of sizes. However, to make them affordable, Samsung cut much of the processing power and color contrast that makes 4K content worth the trouble.",
    "The key question is: can Samsung’s bargain barrel QLED TV fulfill your needs, or are you better off either upgrading to better specs or downgrading to Samsung’s more affordable, non-quantum UHD sets? Here are our thoughts on the matter.",
    "The Q6FN comes in five sizes: 82-inch, 75-inch, 65-inch, 55-inch, and 49-inch. Samsung’s other QLEDs don’t come in 82” or 49”, so you get more versatility at this level – which, in turn, provides more affordability.",
    "The 65” screen is currently $1,301 (about £1,039, AU$1,901), while the 75-inch sells for $3,499 (about £2,500, AU$4,300).",
    "For comparison, the Q6FN's immediate upgrade, the Q7FN, is priced at $2,599 (about £1,900, AU$3,300) for a 65-inch, while the 65-inch NU8000 (Samsung's new 4K UHD TV) is $1,699 (about £1,200, AU$2,200).",
    "Because the Q6FN uses Samsung’s Quantum Dot technology, which transmits LED colors through nano-sized crystal semiconductor particles, it doesn’t suffer from burn-in – the defect most LED TVs suffer when their pixels emit the same pattern for too long (like a news logo) and become permanently tinted.",
    "Why does this matter to you? Because this enables what we think is Samsung’s most innovative use of QLED: Ambient mode.",
    "Take a picture of the wall behind your TV, and the Q6FN will project a pattern that matches the wall, making it blend in almost seamlessly. While in this mode, your TV will play music, display smartphone updates or enable photo collages, all of these appearing to sit on your wall instead of on a bright screen.",
    "One problem: the Q6FN and Q7FN both use bottom edge LED lighting instead of the direct backlight LEDs found in the elite models. Consequently, while the Q8FN and Q9FN have virtually no visible bezels on all four sides, the Q6’s bottom bezel juts out somewhat to accommodate the LEDs, which somewhat undermines its Ambient mode’s camouflage effect by comparison.",
    "Moreover, while the Q6FN sits on four legs and has a standard power cable, the Q7FN uses Samsung’s new One Mount system, which gives your TV interchangeable and easily removable stands, like an easel-like “Studio” stand and computer-like “Gravity” stand. And the Q7FN’s 15 meter-long “Invisible Connection” cord groups power, video and audio into one skinny line. Combined with the removable stand, the Q7FN is a better option if you want to mount your Ambient-enabled TV on a wall.",
    "Still, although it's not equipped with all the features of its siblings, quantum tech and Ambient mode helps the Q6FN make an indelible design impression compared to Samsung’s plain UHD TVs. Still, it’s a bit unfortunate that affordability means some design sacrifices compared to more advanced models.",
    "Samsung’s Q6F TV from a few years ago made quantum TVs affordable, but its specs were definitely underwhelming. And from what we've seen so far, it looks like more of the same this year: the Q6FN doesn’t stack up to its siblings’ power, but it’s still a definite upgrade from last year’s discount model.",
    "The Q6FN upgrades from HDR compatibility to HDR10 and HDR10+ support, from 60 FPS to full 4K gaming support, and from an incomplete color range to 100% DCI-P3 color volume. It hits UHD resolution and supports SD-to-UHD upscaling.",
    "Against the Q9FN, Q8FN and Q7FN, however, the comparison is a lot less flattering. The top two models’ direct backlighting enables a much better color contrast and deeper blacks in specific screen zones than an edge LED model like Q6FN is capable of.",
    "All of the QLED TV models from 2017 had edge LEDs, and even the high-end Q9F couldn’t compensate for the problem with a powerful processor. Our reviewers noticed that they tended to cause backlight clouding and gray banding whenever watching content in the dark.",
    "We also noticed that QLED TVs tended to have problems with color contrast and deep blacks when watching them at odd angles. Samsung solved this problem by adding anti-reflective screens to every 2018 TV... except the Q6FN. And where the other sets have local dimming for HDR10+ content, the Q6FN’s less specialized dimming tech is geared towards UHD content.",
    "So while this year’s set is innovative in terms of adding support for higher-end content, it also spins its wheels in relation to the other QLEDs making huge strides in performance and design.",
    "When we observed the Q6FN in action, we could see a definite drop in quality compared to the power of the other sets. This is partly because its brightness only hits 1000 nits, well below the Q9FN’s 2000 and the Q8FN and Q7FN’s 1500 nits of peak brightness.",
    "But the dimmer backlight didn't ruin the experience entirely: the colors and fast-moving action on display still looked impressive. Due to the reduced brightness, the diminishing returns on deep blacks and color contrast just wasn’t that noticeable. It’s only when stacked against Samsung's brighter sets, where dull colors would be more conspicuous, that the improved specs truly stood out. They’d likely be wasted on 1000 nits, and would make the Q6FN less affordable.",
    "Thankfully, while Samsung skimped on the hardware, the company has made pretty much all of its newest software and interface features available on all of its newest sets, so don't worry too much if you're still leaning toward spending less.",
    "That upgraded experience starts right when you open the TV box, so long as you have their new SmartThings app installed for Android or iOS. When you turn the TV on, it automatically pairs with the app, which will then log the TV into your Wi-Fi network without you having to type out your password.",
    "Then, it’ll troll your phone apps and highlight any that are available on the Q6FN; choose to download Hulu, for example, and it’ll import your username and password and instantly log you into the TV app. In theory, you’ll have your TV all set up with all your favorite streaming options in minutes.",
    "But Samsung doesn’t want you to have to enter each app to search for content. Instead, they’ve added Universal Guide, which curates both your live and on-demand content into simple categories like Comedy or Sports. So your new episodes of Watchmen from HBO GO and Black Mirror from Netflix could sit side-by-side in one Sci-Fi/Fantasy category.",
    "On top of universal search and Samsung SmartThings support, Samsung has also added Bixby voice assistant functionality as well. While 2017's Samsung QLEDs had simple voice commands that only controlled your TV set you’ll be able to answer phone calls or check on the status of integrated devices in Ambient (or live TV) mode. It's a neat future that helps a cheaper TV feel a bit more premium.",
    "You’re getting what you pay for with the Q6FN: a 4K HDR10+ enabled TV set, but one that doesn’t have the power to make HDR10+ content pop, or the versatile design you'll find on the other members of the QLED TV family.",
    "Still, we’re very optimistic about how Samsung’s new features will make its TVs a hub for your smart tech and various streaming apps. Sure, you’ll find all of those features on Samsung’s cheaper UHDs, but they don’t support Ambient mode or full color volume.",
    "Overall, we liked what we saw from the Q6FN. It's a QLED TV at an economy price, and honestly many readers may not feel the need to pay hundreds or thousands more for better brightness and contrast. We're impressed with Samsung's base model, however, it's definitely worth checking out the mid-range Q7FN before going all in on Samsung's most affordable (and least powerfully specced) QLED TV."
  ],
  "headers": {
    "8": "Price and availability",
    "11": "Design",
    "17": "Performance",
    "25": "Features",
    "30": "Early verdict"
  },
  "links": {
    "2018 lineup": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Q9FN": "https://www.techradar.com/reviews/samsung-q9fn-qled-tv-qn65q9fn",
    "QLED TV": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Samsung Q60R QLED TV review": "https://www.techradar.com/reviews/samsung-75-inch-q60r-4k-hdr-tv",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Samsung has started branching out into 5G 8K TVs": "https://www.techradar.com/news/samsungs-5g-8k-tv-promises-to-make-netflix-streaming-faster-than-ever",
    "windows that can emit their own light": "https://www.techradar.com/news/forget-samsung-tvs-its-next-display-could-fill-your-home-with-sunlight",
    "Smart TV apps": "https://www.techradar.com/best/samsung-smart-tv-apps",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "Q9F": "https://www.techradar.com/reviews/samsung-q9-qled-tv",
    "SmartThings": "https://www.techradar.com/news/samsung-smartthings-meet-the-center-of-your-future-smart-home",
    "Android": "https://play.google.com/store/apps/details?id=com.samsung.android.oneconnect&hl=en",
    "iOS": "https://itunes.apple.com/us/app/smartthings-samsung-connect/id1222822904?mt=8&at=1001lnRX&ct=trd-us-1027234705348176000",
    "Watchmen": "https://www.techradar.com/news/watchmen-season-2",
    "Black Mirror": "https://www.techradar.com/news/black-mirror-release-date-cast-episodes-netflix",
    "Netflix": "https://www.techradar.com/best/best-netflix-movies/best/best-netflix-shows",
    "Samsung SmartThings": "https://www.techradar.com/news/samsung-smartthings-meet-the-center-of-your-future-smart-home",
    "Bixby voice assistant": "https://www.techradar.com/news/samsungs-2018-tvs-get-voice-assistant-integrationwith-bixby"
  }
}