{
  "source": "https://www.techradar.com/reviews/chuwi-corebook-pro-laptop",
  "title": "Chuwi Corebook Pro laptop review",
  "category": "computing",
  "updated": "2020-07-22T16:36:59Z",
  "author": "desire-athow",
  "summary": "The up-and-coming laptop vendor tries new things",
  "verdict": "The Chuwi Corebook Pro is a fantastic little laptop at $399. The 3:2 aspect ratio is a literal eye opener and while we can complain about the Skylake-based Intel processor, it does deliver some very solid benchmark numbers.",
  "pros": [
    "3:2 aspect ratio with 3.1 million pixels.",
    "Good value for money",
    "Very well built",
    "Backlit keyboard",
    "Good battery life"
  ],
  "cons": [
    "Old processor",
    "No HDMI connection",
    "Laminated screen"
  ],
  "article": [
    "After the tiny Larkbox PC, the doomed LapBook Plus (with its 4K display), the pocketable Minibook and the Xbox PC wannabe, the Aerobox, Chuwi is looking to excite us once more with a new product called the Corebook Pro with one intriguing unique selling point that will appeal to some but not to others. More on that later.",
    "The CoreBook Pro sample was provided by Chuwi and sells for $399 after a $100 coupon. To get the coupon, you have to add your email address to their subscription list and you will receive an email that contains a $100 coupon code to buy the CoreBook Pro.",
    "Our first impression of the Corebook Pro is that it is “squarer” rather than rectangular. That’s down to the fact that it is a laptop with a rather uncommon 3:2 aspect ratio, one that was made popular in the Apple iPad tablet range.",
    "What that means is that your laptop screen is noticeably higher, allowing for a deeper space for keyboard keys and the touchpad. Staying with the Apple theme, the engineers have stuck with a full metal chassis - likely to be aluminum - with a Space gray colour scheme. At 21.9x 29 x 1.85cm for a weight of 1.33kg, it feels quite compact and chunky.",
    "When it comes to connection options, the Corebook Pro offers the strict minimum; a TF slot, a headphone jack, a Type-A USB port, a Type-C port and a proprietary port for barrel chargers, split between on the left and right sides of the device. There’s no HDMI connector which is a shame.",
    "An “old” Skylake-based Intel Core i3-6157U CPU is at the heart of the Corebook Pro. We don’t know why Chuwi went for such an obscure processor other than the fact that they probably managed to get this stock at a very competitive price.",
    "This is a model unveiled in 2016 with two cores, four threads and a base frequency of 2.4GHz. Its TDP of 28W isn’t at all surprising given that it is built with a 14nm lithography and has an Intel Iris Graphics 550 processor graphics.",
    "While it will pull forward on single thread benchmarks, it should utterly lose out to those that, like the Pentium Silver J5040, have four physical cores and a much, much lower TDP because they have a higher burst frequency and more cache.",
    "8GB of DDR4 memory (non upgradable) and a 256GB removable SATA-based SSD complement the 6157U. Add in a 13-inch IPS display with a 2160 x 1440 pixel display (that’s more than 3.1 million pixels or 50% more than a full HD display), a 46WHr battery, 802.11ac Wi-Fi, Bluetooth 4.2 and a backlit chiclet keyboard and you have a solid entry level laptop.",
    "The laptop is noticeably noisy when under load because the CPU warms up quite a lot, which in turn sends the fan whirring. That said, we were pleasantly surprised by the performance put on by the processor with the GPU being a particular strong one. Its Geekbench Compute performance for example was significantly higher than that of the Intel Core i5-10210U in the PC Specialist Lafité Pro despite the latter’s far higher overall numbers.",
    "The screen opens flat (i.e. 180 degrees) and is covered by a layer of glass that improves contrast but is very reflective and prone to smudges and fingerprints making it a bit of a pain to use in bright sunlight. Out of the box, it delivers punchy, vibrant colours, good consistency with finer details thanks to a higher than average 200dpi.",
    "While there was hardly any flex in the screen - which came as a surprise for us - the same couldn’t be said of the keyboard which displayed some flex, especially in the middle. The power key is located on the top right of the keyboard array, with a red ring.",
    "The keys are well proportioned - with good feedback and decent travel - although we are taken aback by the lack of page up/down, home/end buttons. Note that the keyboard is a backlit one and is an edge-to-edge model.",
    "Last but not least, the battery life of the Chuwi Corebook Pro surprised us at just under five hours. Given the screen, the TDP of the processor and how (relatively) small the battery capacity is, we were expecting far worse.",
    "Having a laptop with a 3:2 aspect ratio comes with its pros and cons. Yes you see more of a webpage but you might have some issues opening it fully when travelling because of the extra height of the screen. It might feel more compact but some applications might not run. There’s only a handful of laptops with 3:2 screen aspect ratio, on top of our head, the Huawei Matebook 13, the Acer Swift 7 and the Microsoft Surface Laptop 3 none of which are anywhere near the Corebook Pro pricewise.",
    "Put it otherwise, you won’t find any laptop with a resolution of full HD or more under $600 (or 50% more). The cheapest we found was the Lenovo IdeaPad 81XA005BUS ($763 at Newegg), an altogether superior laptop and not really in the same category.",
    "The only rival we could source that almost matches it (bar the inferior 14.1-inch full HD monitor and the J4115 CPU) is the KUU K2; it is about $100 cheaper than the Corebook Pro, comes with a free laptop bag, a fingerprint reader and a webcam privacy cover.",
    "The Corebook Pro is a fantastic laptop at $399 and just a good one at $499. We are a proponent of 3:2 aspect ratios not least because you get to see much more content and even on a small 13-inch display this is noticeable (in a good way). Chuwi’s lead into making this aspect ratio more affordable is commendable.",
    "Corners have to be cut and on the whole we believe that the company managed the best within a power and price budget. The Iris 550 GPU on the older Core i3 CPU is the star of the show, powerful enough to drive the 50% extra pixels on the display and competitive with much newer integrated graphics from Intel."
  ],
  "headers": {
    "2": "Design",
    "5": "Hardware",
    "9": "In use",
    "14": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Larkbox PC": "https://www.techradar.com/reviews/chuwi-larkbox-thin-client-mini-pc",
    "LapBook Plus": "https://www.techradar.com/reviews/chuwi-lapbook-plus-laptop",
    "Minibook": "https://www.techradar.com/reviews/chuwi-minibook-2-in-1-laptop",
    "Aerobox": "https://www.techradar.com/news/exclusive-this-pc-uses-an-xbox-one-s-motherboard-and-cpu-but-you-cant-buy-it-now",
    "$399 after a $100 coupon": "https://store.chuwi.com/products/corebook-pro-13ips-intel-core-i3-8gb-ram-256gb-ssd-chuwi",
    "Apple iPad": "https://www.itproportal.com/reviews/hardware/apple-ipad-air-review/",
    "PC Specialist Lafité Pro": "https://www.techradar.com/reviews/pc-specialist-lafite-pro-business-laptop",
    "Huawei Matebook 13": "https://www.techradar.com/reviews/huawei-matebook-13",
    "Acer Swift 7": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/acer-swift-7-1327419/review",
    "Microsoft Surface Laptop 3": "https://www.techradar.com/reviews/microsoft-surface-laptop-3-15-inch",
    "$763 at Newegg": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-8291249212889080000&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2F1TS-000E-0M624%3FItem%3D9SIA24GBGU8784",
    "KUU K2": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-9447095288216787000&p=https%3A%2F%2Fwww.gearbest.com%2Fultrabooks%2Fpp_3007219518406320.html%3Fwid%3D2000001"
  }
}