{
  "source": "https://www.techradar.com/reviews/dell-g5-15-5590",
  "title": "Dell G5 15 5590 review",
  "category": "computing",
  "updated": "2021-07-15T14:44:26Z",
  "author": "jeremy-laird",
  "summary": "Dell’s value gaming laptop delivers a killer combo",
  "verdict": "Dell’s latest laptop delivers a killer combo of in-game frame rates, next-gen features, value and, well, game-changing battery life.",
  "pros": [
    "Perfectly balanced feature set",
    "Strong gaming performance",
    "Great battery life"
  ],
  "cons": [
    "IPS panel is merely OK",
    "Confusing configuration options"
  ],
  "article": [
    "With the Dell G5 15 5590, Dell is aggressively courting gamers who want to game on the go for much less than you’d expect. And, it has done so successfully by skipping all the bells and whistles and focusing on specs and performance.",
    "If you’re a gamer, the Dell G5 15 5590 will certainly come as a shock - in a good way. An asking price of $1,149 shouldn’t be possible, not for a name-brand gaming laptop fitted with a 15.6-inch IPS screen, six-core Intel processor, and Nvidia RTX graphics, much less in a package less than an inch thick. But, here we are.",
    "Of course, thanks to the bigger 90WHr battery our review model came with, it’s a bit pricier than its normal configuration. Still, the Dell G5 15 5590 is affordable as you can get without compromising on performance. While there are plenty of comparable laptops from other reputable companies, like the Gigabyte Aorus 15 2019, Dell has managed to offer better specs at just about every price.",
    "The Dell G5 15 5590 mostly as configured here but with the 60 rather than 90-WHr battery is currently available for Walmart for just $1,149, which is fairy insane.",
    "Specific configurations vary considerably and the config Dell sent us isn’t actually currently available from any of its own websites, but normal pricing would be in the $1,399 ballpark as configured and perhaps £1,350 in the UK and AU$2,124.",
    "As ever with Dell notebooks, configuration availability varies frequently over time and with location. But the good news is that the wide range of options means you can usually spec yours up to deliver on the things you care about and avoid paying for hardware you’re not going to use.",
    "As we’ll see, our review system is missing at least one obvious high-end option and that isn’t necessarily a bad thing.",
    "The usual refrain for hardware reviews often involves out-of-the-box impressions. But the actual packaging in which the new G5 from Dell is delivered makes its own statement. It’s utterly unpretentious brown cardboard with absolutely no aesthetic niceties. It just ensures the system survives transit unscathed.",
    "You won’t find us complaining. Fancy packaging like clever levitating box hinges are all very well. But it only adds to the cost of a product without adding anything to the user experience once you’re up and running.",
    "Anyway, literally out of the box the Dell G5 15 5590 mostly impresses. The chassis is a mix of metal and plastic and feels extremely robust. The monochrome-backlit keyboard, likewise, is absolutely rock solid. Put simply, this is a portable that feels like it can take a beating.",
    "Styling is subjective, of course, but the Dell G5 15 5590 at least ploughs its own furrow with its ribbed chassis sides and strip of polished black plastic. By today’s standards, the bezels are merely moderately slim and the lower chin is pretty fat. But at less than an inch thick, it’s pretty svelte for a system with this much punch.",
    "The port count is another highlight. With three USB A ports, a USB-C with Thunderbolt 3 port, HDMI, Mini DisplayPort, LAN and an SD card reader, you really do have all your bases covered. It’s also worth noting that most of these ports plus the power connector are at the rear of the chassis, ensuring a minimum of cable clutter.",
    "As for specs, the number of options can be bewildering. However, most configs including our review rig come with an Intel six-core Core i7-8750H CPU. It’s an 8th rather than 9th gen chip, but that’s of zero consequence. It’s all the CPU you’re ever going to need in a laptop.",
    "Graphics wise, we’re talking Nvidia RTX 2060, which is the entry-level GPU in Nvidia’s latest ray-tracing capable Turing generation of graphics chips, but very powerful in outright terms. It’s paired with a 15.6-inch 1080p display based on IPS panel technology. Dell optionally offers 144Hz refresh support, but our review rig is limited to 60Hz.",
    "Elsewhere, there’s a storage combo includes a 128GB M.2 SSD with a 1TB HDD and 16GB of RAM. The storage setup is a little unusual, but in theory offers both high performance for a limited number of critical apps, plus plenty of capacity for everything else."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "12": "Specs appeal"
  },
  "links": {
    "gaming lapto": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Gigabyte Aorus 15 2019": "https://www.techradar.com/reviews/gigabyte-aorus-15-sa"
  }
}