{
  "source": "https://www.techradar.com/reviews/samsung-q950r-98-inch-8k-qled-tv",
  "title": "Samsung Q950R 8K QLED TV review",
  "category": "televisions",
  "updated": "2021-05-07T11:58:51Z",
  "author": "stephen-withers",
  "summary": "Samsung’s new flagship 8K offers state-of-the-art performance",
  "verdict": "The Samsung Q950 takes cutting-edge 8K performance to an entirely different level thanks to advanced AI processing and HDR images that have to be seen to be believed. This is easily the best QLED model you can buy, but also a contender for the best TV currently available.",
  "pros": [
    "Awesome picture quality",
    "Standard-setting HDR",
    "Cutting-edge image processing",
    "Wider viewing angles",
    "Comprehensive smart platform"
  ],
  "cons": [
    "No Dolby Vision support",
    "No Dolby Atmos playback",
    "Limited 8K content"
  ],
  "article": [
    "The Samsung Q950 represents the latest 8K TV from the manufacturer, combining all the benefits of last year’s Samsung Q900 8K screen with innovations first introduced the 2019 flagship Samsung Q90 4K TV that hit shelves earlier this year.",
    "Combined in one top-notch QLED TV, the new Samsung Q950 offers an 8K panel and AI-enhanced image processing, plus wider viewing angles, an improved black filter and standard-setting HDR performance. If all that wasn’t enough, Samsung’s smart TV platform is the most comprehensive on the market.",
    "So if you’re looking for a state-of-the-art new Samsung TV – and don't mind paying top-dollar for it – the Q950 should be at the top of your short list.",
    "UPDATE: Samsung has since released the successor to the Q950R – the Samsung Q950TS. The new version of the 8K QLED has a nearly bezel-less design that fills 99% of the front face and comes with Samsung's Health app.",
    "The Samsung Q950R will be available in four different sizes: 65-inches, 75-inches, 82-inches and 98-inches. Samsung sent over the 75-inch version for review purposes, but the technology is largely the same in each screen size.",
    "What's going to be dramatically different between each version, however, is their price. In the UK, the 65-inch QE65Q950R costs £4,999, 75-inch QE75Q950R costs £6,999, and 82-inch QE82Q950R costs £9,999. These prices are competitive for an 8K TV, and in some territories Samsung also offers a 55-inch option.",
    "The Q950's prices have not been announced for the US yet, but the Samsung Q900R currently costs $3,499 for the 55-inch QN55Q900RBFXZA, $4,499 for the 65-inch QN65Q900RBFXZA and $6,499 for the 75-inch QN75Q900RBFXZA.",
    "How much will the 85-inch and 98-inch Q900R set you back? Let’s put it this way – if you have to ask, then you probably can’t afford them.",
    "The Samsung Q950 looks identical to last year’s Q900 with a minimalist appearance that resembles a monolithic rectangular black slab. The screen is bezel-less, there’s an eye-catching brushed metal trim around the outer edge, and the rear of the panel has textured grooves. The only connection on the panel itself is a single proprietary input for the One Connect box.",
    "The Q950 sits on a pair of sturdy feet that match the design simplicity of the panel itself. You can position the feet at either end, or closer together if you want to install the TV on a narrower surface. There are recesses at the rear of the panel where you can store the feet when not in use, making wall-mounting neat and tidy.",
    "The One Connect box is quite large and surprisingly heavy, but it remains a clever idea. The first HDMI input is 2.1 (8K/60p) and the other three use 2.0b. There are also three USB ports (two 2.0 and one 3.0), twin terrestrial and satellite tuners, a CI slot, an optical digital input and a LAN port for a wired connection (although there’s also built-in WiFi and Apple AirPlay).",
    "While three of the HDMI inputs are 2.0b they can, according to Samsung, still support 4K at up to 120Hz, dynamic metadata (HDR10+), variable refresh rate (VRR), and an auto low latency mode (ALLM). The Q950 doesn’t currently support an enhanced audio return channel (eARC), but Samsung may add that via a future firmware update (as it did with its 2019 soundbars).",
    "The included remote control is stylish and ergonomically designed, with an attractive all-metal construction. It’s comfortable to hold, easy to use with one hand, and has a microphone for voice control. Samsung has also added direct access buttons for Netflix, Amazon and Rakuten along the bottom.",
    "Design TL;DR: The design is simple, the remote is stylish, and the One Connect box has everything you’ll need, including an HDMI 2.1 input for those lucky enough to have access to 8K.",
    "The Samsung Q950 boasts the full Samsung smart experience, and is probably the most comprehensive system available, with a launcher bar along the bottom and a second layer that provides easy access to whatever content you happen to be watching. And there’s a lot to watch, because no other smart platform offers as many video streaming services as Samsung.",
    "The system includes Netflix, Amazon, Now TV, Rakuten, YouTube, and all the UK TV catch-up services, but there are plenty of others available. A recent firmware update has now added Apple TV and this feature that is currently exclusive to Samsung, giving its TVs an edge over the competition.",
    "Apple TV works well and is easy to setup and connect with your existing Apple account, providing access to TV shows and movies, as well as your own library. The picture and sound quality are excellent, and the app supports 4K and HDR10. However Apple also supports Dolby Vision which Samsung doesn’t, and there’s currently no support for Dolby Atmos.",
    "Given the amount of content available, it makes sense to collate a user’s favourite shows into a single location, thus making things easier to find. Samsung has called this feature Universal Guide, and it can be tailored to a user’s particular tastes. The Universal Guide also uses AI machine learning to analyse viewing habits and optimise recommendations.",
    "The Universal Guide creates a single ‘For You’ page with personalised content to suit your tastes, and the more time it has to analyse your behaviour, the better the recommendations become. The success of this feature will ultimately depend on how many services sign-up, but obviously the more services the guide can access, the more useful (and universal) it is.",
    "You can use Samsung’s SmartThings app to set-up and control the Q950, and it also acts as a user interface for all your connected devices, smart appliances, and security functions. In addition the smart system can be accessed and controlled from your smartphone, allowing you to watch one thing while searching for other content.",
    "The addition of Bixby is a major plus this year, providing Samsung’s TVs with a built-in voice assistant. You can control interact with this feature by using the remote or simply speaking directly to the TV, and it worked effectively. The Q950 also works with Amazon Alexa, Google Assistant and Apple’s Siri, providing the TV with a full house of voice assistant devices.",
    "Ambient Mode remains a useful feature, and new options provide more choice and better customisation which is sure to prove popular. It serves as a way of making use of your TV, even when you’re not watching it. It also stops the TV from simply being a black rectangle on the wall when not in use, while this mode’s low power usage keeps things energy efficient.",
    "Smart TV TL;DR: You won’t find a more comprehensive smart platform, with Bixby built in and every video streaming service imaginable, including Apple TV.",
    "The Samsung Q950 is a superior picture performer, delivering an impressive image with lower resolution and SDR content. The direct LED backlight, highly effective local dimming, and the new black filter produce exceptional levels of contrast. What’s more, this is achieved without crushing shadow detail, and regardless of the ambient light in the room.",
    "The colours are also excellent, appearing saturated but natural, while the screen uniformity is impressive thanks to a lack of banding or clouding. The wider viewing angles are nothing short of a revelation, with no visible contrast or colour degradation as you move off-axis. This allows the Q950 to compete directly with OLED in an area that had previously been that tech’s strong point.",
    "The Intelligent Mode is an interesting new feature that uses AI machine learning to enhance the image. The results are often incredible, especially when you consider that in order to upscale standard definition content to the match the 8K panel, the processing has to interpolate over 99% of the image. It’s the Q950’s ability to use its additional pixels to deliver superior upscaling that justifies buying an 8K TV despite the lack of native content.",
    "The resulting performance is the best we have seen from a QLED TV, with pictures that can hold their own against any OLED. The Q950’s delivers images that are bursting with bright colours and exceptional detail. The image processing is state-of-the-art, effectively upscaling lower resolution content and applying noise reduction and sharpening when necessary.",
    "The motion handling is also good, and there are plenty of handy settings that can help smooth things out if necessary. These can be particularly useful with fast-paced sports, while the black frame insertion is effective at improving the motion handling for movies. If you’re a gamer the 14ms input lag means the only limiting factor will be your own reactions.",
    "HD/SDR Performance TL;DR: The SDR performance is excellent, with saturated colours, deep blacks, plenty of shadow detail, wider viewing angles, and a 14ms input lag.",
    "The Samsung Q950 is easily the best HDR TV to date, capable of delivering a massive peak brightness of 3,800nits. That basically means this QLED TV can display 1,000nit content without tone mapping, and 4,000nit content with almost no tone mapping. What little tone mapping is required is spot on, and the HDR colour accuracy is exceptional with 100% of DCI-P3.",
    "As a result the HDR performance is quite extraordinary, with Planet Earth II looking staggeringly realistic thanks to natural colours, gorgeous peak highlights, and a huge amount of detail. Despite the use of local dimming, there is virtually no apparent blooming, and even the hyenas at night sequence retains deep blacks and well defined highlights.",
    "At the other end of the scale The Revenant includes numerous brightly lit day scenes with lots of white snow, and these look breath-taking on the Q950. This kind of content is impossible for OLED TVs to reproduce correctly, but on the Samsung it’s perfect. These images are not only brightly rendered, but also free of any banding, clipping or other unwanted artefacts.",
    "The Q950’s ability to handle bright colourful HDR images is evident when watching films like Guardians of the Galaxy Vol.2, Aquaman, and Spider-Man: Into the Spider-Verse. These films all make full use of saturated primaries, and the Q950 is capable of delivering the full colour volume like no other TV currently on the market.",
    "The film Overlord mainly takes place at night, and so is often a very dark film. The Q950 handles this difficult material perfectly, delivering deep blacks, excellent shadow detail, and highlights where necessary. This film can often appear unwatchable on less capable displays. The Q950 also renders all the subtle differences in the film’s primarily green and brown colour design.",
    "First Man generally looks spectacular, but there is a specific scene that highlights this TV’s only real limitation. In the sequence where the Apollo command module goes into the shadow of the Moon, the screen goes completely black and then the surface of the brightly-lit Moon gradually appears through the spaceship’s window.",
    "This is the kind of content that’s incredibly difficult for any local dimming system to deliver effectively, and is the only time the Q950 appears inferior to an OLED TV with HDR content. However in every other aspect of its performance the Samsung Q950 is the superior HDR display.",
    "4K/HDR Performance TL;DR: The HDR performance is simply the best we have ever seen, justifying the purchase of this 8K TV even in absence of any native content.",
    "The sound quality of the Samsung Q950 is particularly impressive, no doubt thanks to the size of the screen and the direct LED backlight allowing for a deeper panel. As a result there’s more room for larger speakers, and these enable the Q950 to deliver excellent sound quality with good stereo separation, well-defined midrange and higher frequencies, clear dialogue and deeper bass.",
    "What is particularly impressive is the Intelligent Sound mode. This feature significantly improves the audio performance, giving the sound more width and depth. It also tailors the sound processing depending on the environment and the content, resulting in an experience that is better defined and more immersive.",
    "When watching football the sense of the crowd is more enveloping, but the commentary remains focused on the screen. With a Hollywood blockbuster the music and effects are more pronounced, filling the front of the room. However dialogue is never lost in the mix and remains clear. When gaming, the effects are placed around the front of the room with precision.",
    "The Q950 doesn’t support Dolby Atmos processing, but it’s debatable how much of an object-based and immersive experience a TV really can deliver using just a pair of built-in speakers. However, the Q950 can send Dolby Atmos from built-in apps like Netflix and Amazon to supporting soundbars via the HDMI audio return channel, which is arguably more important.",
    "Sound TL;DR: The sheer size of the panel and the AI-enhanced processing results in a superior sound performance, and the ability to output Dolby Atmos via HDMI-ARC is sure to please.",
    "The Samsung Q950 represents a significant step forward, not only in terms of 8K TVs but also when it comes to delivering HDR. It simultaneously addresses the limitations of QLED, while pushing the envelope in terms of that technology’s strengths.",
    "This model boasts visibly superior viewing angles, and a new black filter that effectively rejects ambient light. The local dimming system delivers deep blacks without losing shadow detail, while the image processing combines all those pixels with AI learning algorithms to remarkable effect.",
    "The resulting images are boosted by natural colours, bright highlights, deep blacks, and well-defined shadows. When it comes to HDR the performance is even more impressive, with some of the best pictures yet seen thanks to breathtaking detail and dynamic range.",
    "The Q950 isn’t just about picture quality, it also benefits from a comprehensive smart platform, Bixby voice assistant, and Intelligent Sound. The result is one of the most complete TVs that money can buy, with a lack of Dolby Vision as the only real criticism.",
    "However in all other respects the Samsung Q950 is an amazing technological achievement that represents the state of the QLED art."
  ],
  "headers": {
    "4": "Price and availability",
    "8": "Design",
    "14": "Smart TV",
    "23": "HD/SDR Performance",
    "29": "4K/HDR Performance",
    "37": "Sound",
    "42": "Verdict"
  },
  "links": {
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Samsung Q950TS": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "a nearly bezel-less design": "https://www.techradar.com/news/samsungs-bezel-less-8k-qled-tv-will-be-able-to-track-your-health-information",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}