{
  "source": "https://www.techradar.com/reviews/simplesite",
  "title": "SimpleSite website builder review",
  "category": "computing",
  "updated": "2020-11-18T09:36:33Z",
  "author": "mike-williams",
  "summary": "Build and sell in your own website store, for free",
  "verdict": "SimpleSite is a website builder for beginners. There’s not too many design options, so chances are you won’t be overwhelmed. Everything is easy to find and you can create an online store in no time.",
  "pros": [
    "There’s an unlimited free plan",
    "It’s super easy to use",
    "Great for beginners"
  ],
  "cons": [
    "Designs are slightly outdated",
    "Not very many design features"
  ],
  "article": [
    "SimpleSite is one of the best website builder platforms for anyone who’s creating an online store for the first time. You can easily put something together without any previous web building knowledge or experience. This website builder is also helpful if you’re on a budget - there’s a free plan you can use for an unlimited time which includes features for an online store.",
    "There's better news in SimpleSite's Basic plan, which enables building a website with up to 15 pages, entirely for free. This has some of the issues you often see with free website builder plans - limited design features, ads for SimpleSite - but there's also a very unusual plus: you can sell up to five products in your own web store, a feature just about everyone else reserves for their high-end commercial plans.",
    "The best part about SimpleSite is you can use the free version for an unlimited time. It comes with 15 pages, places for up to five online store products, and you can view it easily on a phone, tablet, or laptop. If you want to upgrade to something larger, then there’s two paid plans that offer more features.",
    "The Pro plan costs $15.49 per month. This plan comes with your own domain name, no more SimpleSite advertisements, and access to unlimited pages. You can upload unlimited video minutes to your website and there’s also no restriction on images. This plan works great for both professional or personal websites that need more space and freedom than the free plan.",
    "The Ecommerce plan is a bit pricey for a web hosting option - it costs $30.49 per month. However, it does include a lot of features. There’s the option to sell unlimited products on your site which is a big increase from the last two plans (where the limit is five). The best part about this plan is how ecommerce-friendly it is.",
    "The interface is really well organized and easy to use. A big red 'Get Started' button on the SimpleSite home page makes it very obvious where to begin, and one click later, SimpleSite's Design Wizard began walking us through the process of creating our first site.",
    "You start the process by choosing the purpose of our site (personal, business or other), before moving on to pick a color scheme, a page background, main opening image and site title. We're not sure it makes sense to select all these design elements before you've even begun to work on the site, but you can always accept the default settings and change them later.",
    "The SimpleSite image object is a little short on functionality. You can add pictures from your own system, with a maximum file size of 5MB which should be enough for most photos, and we like the integration with the free image library.",
    "Perhaps the most interesting editor feature is how easily you can add objects side by side. Add a video, for instance, and you might want to insert an image or block of text to one side. That's fiddly in some editors, impossible in a few, but here you simply click the Add Content button alongside the video, and choose the Image object, the Text box, or whatever else you need.",
    "This can be a neat touch in some situations, but there's a problem: it's very inflexible. Your image can only go to the left or right of the video, for instance. Each object gets half the allocated space, with no resize option, and no way to separately align the objects (center the video, maybe, and right-align the text.)",
    "SimpleSite offers some site-wide configuration options in its Design panel. You can switch between five layout options, for example, altering details like the width of your website (does it take all the available space, or sit somewhere in the middle of the browser tab?) and how content is ordered. You also get to choose color schemes and combinations of fonts. The most interesting feature is the background option, which not only allows using static images, but also offers a few video backgrounds (clouds, snow, waves and so on.)",
    "With so many web hosting options available - Bluehost, Hostgator, and Cloudways - what makes SimpleSite unique? It really comes down to the free plan and how easy it is for beginners. SimpleSite deserves a little more credit for including a web store with even its free plan. Okay, it may only support five products, but that could be enough for casual users. When you just want a simple web host to help you get started selling products on a website, it’s rare to find a plan like this for free.",
    "SimpleSite isn’t as updated as other web hosting options on the market. However, the free version is very useful for beginners who want to create their own online store with ease. If you’re looking for a more advanced web hosting option, there’s many others out there. But it’s difficult to find a web host that allows you to sell your products for free. Overall, SimpleSite is a great place to build your first online store and experience creating your own site.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Interface",
    "8": "Features",
    "11": "The competition",
    "12": "Final thoughts"
  },
  "links": {
    "SimpleSite": "https://www.simplesite.com/",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "free version": "https://www.simplesite.com/pages/pricing.aspx",
    "Pro plan": "https://www.simplesite.com/pages/pricing.aspx",
    "Ecommerce plan": "https://www.simplesite.com/pages/pricing.aspx",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Hostgator": "https://www.techradar.com/reviews/gator-website-builder",
    "Cloudways": "https://www.techradar.com/reviews/cloudways#:~:text=Final%20verdict,needs%20without%20breaking%20the%20bank"
  }
}