{
  "source": "https://www.techradar.com/reviews/wasabi",
  "title": "Wasabi cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T15:49:33Z",
  "author": "mark-pickavance",
  "summary": "Wasabi is cloud storage with a bit of spice",
  "verdict": "If you want fast and cheap cloud storage, and are happy to bolt on and manage the necessary extras yourself, Wasabi is going to hold a lot of appeal for you. However, having to manage more software on top of the basic service is going to take the shine off for some.",
  "pros": [
    "Affordable price options",
    "Comprehensive user management",
    "Tight security protection"
  ],
  "cons": [
    "Basic built-in clients",
    "You'll probably need extra software",
    "No mobile apps"
  ],
  "article": [
    "Wasabi is an interestingly named and relatively new entrant in the cloud storage market, and according to the company's marketing blurb, it's \"on a mission to make cloud storage a simple commodity and utility, just like electricity\" – which we can get on board with.",
    "Rather than being a direct competitor to the likes of Dropbox, Google Drive, or even something like Backblaze, Wasabi is challenging Amazon S3 and Microsoft Azure head on, and it's important to bear that in mind as we go through its features and applications.",
    "From the outset it's important to realize that you're buying cloud storage from Wasabi and very little else – you don't get the user-friendly web interface and desktop syncing apps that you do with most other offerings on the market. Wasabi will provide fast and cheap space in the cloud, and it's up to you what you do with it.",
    "After you've created an account, you are invited to create a 'Bucket' – that's the Wasabi term for a controlled data space where files are stored. You can make as many Buckets as you like, control access to them as required, and partition off sections for different purposes or with different security settings. Once you've created a Bucket, you can upload files and folders to them, and control access.",
    "Versioning and logging are supported inside your Buckets, but to a large extent the features of the Wasabi service are determined by the applications that you choose to use (or build for yourself) – see here for an approved list from Wasabi itself. From within the Wasabi app on the web, you can set read and write access for each Bucket, manage groups and users and so on, and then the programs that you use will tap into those blocks of storage with the settings that you've specified.",
    "Wasabi does offer simple desktop clients for Windows and macOS, but there's not much to them – they're basic tools for transferring files to and from your cloud storage, and there isn't much difference between using them and just using the browser app, unless you've got a huge number of files to move over. There aren't any mobile apps available.",
    "Apart from any third-party apps you decide to run on top of Wasabi, you'll be spending most of your time in the web interface. It's clean and tidy, and simple to use, but you don't get the user-facing features you do with the likes of Dropbox, Google Drive and so on – this is a place for storing your files and not much else. The desktop clients that Wasabi provides for Windows and macOS are similarly bare bones.",
    "Everything that is included in the web app is easy to find and configure, from compliance tools to group and policy management options. There's a commendable amount of flexibility here when it comes to managing access to files and keeping certain piles of data separate from one another, even if options for viewing and editing files on the web are pretty much non-existent.",
    "Some users are going to want a more capable set of features included from the off, but for others this kind of flexibility will be exactly what they're looking for. It's taking on the likes of Amazon S3 and Microsoft Azure directly, and you should bear that in mind when comparing it against other cloud storage services.",
    "Uploading and downloading was fine in our testing, on a par with the other cloud storage services we've been testing – in other words, limited by our home network connection rather than anything else. It took us around half an hour to upload a terabyte of data, but of course your connection to the web will be different to ours. As far as we can tell, Wasabi keeps its promise of speedy cloud storage access.",
    "Security is another of the strengths of Wasabi, from two-factor authentication, to data compliance management, to support for user profiles and highly configurable file access. Multiple redundancies and tight physical security on its data centers are used to make sure your data stays safe, and the company promises 99.9% uptime for its servers – a claim we've got no reason to doubt having used the service.",
    "To some extent the data security protections depend on the programs you're plugging into Wasabi, but end-to-end encryption is available if you want to minimize the chance of your data being read (and you're confident you'll never forget your encryption key). As far as security for your files goes, you don't get many better cloud storage deals than the one you get from Wasabi.",
    "The pricing packages that Wasabi has put together are certainly enough to make you take notice: there's a pay-as-you go approach, with cloud storage offered at $5.99 (about £4.85) per TB per month, which is very good indeed when you compare it with Wasabi's direct competition. There are no extra charges for data downloads or API requests either, and a 30-day free trial is available if you want to take advantage.",
    "If you sign up long term – for one, three or five years – then you can get a reduction on that price, but you have to buy at least 50GB from Wasabi if you're going to take that route. Considering some of the expensive and convoluted pricing plans we've seen elsewhere in the cloud storage market, as far as we're concerned it's refreshing to have something as simple as this to turn to.",
    "As we said at the start, you really need to see Wasabi for what it is – a supplier of the fundamental commodity that is cloud storage, in direct competition with Microsoft Azure, Amazon S3 and others. If you come looking for a complete cloud backup and sync service that interfaces neatly with Windows, macOS, Android and iOS, then you're going to come away feeling disappointed.",
    "The price, the speed and the ease of use are where Wasabi excels, though you won't find much in the way of user-facing features beyond the essential Bucket and user management. To complete the circle of connectivity you are forced to install additional apps, and rely on their support for Wasabi to do things that other services offer inherently. Once you’ve got over those hurdles, this is a rapid, secure and highly affordable solution that will appeal to many."
  ],
  "headers": {
    "2": "Wasabi features",
    "6": "Wasabi interface",
    "10": "Wasabi security",
    "12": "Wasabi pricing",
    "14": "Wasabi verdict"
  },
  "links": {
    "Wasabi": "https://wasabi.com/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Backblaze": "https://www.techradar.com/reviews/backblaze",
    "see here": "https://wasabi.com/help/downloads/"
  }
}