{
  "source": "https://www.techradar.com/reviews/banktree-personal-finance",
  "title": "BankTree personal finance review",
  "category": "computing",
  "updated": "2020-11-13T11:12:14Z",
  "author": "rob-clymo",
  "summary": "Manage your money online or on your desktop with BankTree",
  "verdict": "BankTree personal finance software can be downloaded or used online and while it features some cool tools there are elements of it that remain labour-intensive.",
  "pros": [
    "Decent interface",
    "Lots of menu options"
  ],
  "cons": [
    "Labour intensive"
  ],
  "article": [
    "BankTree is another one of numerous personal finance software packages on the market, which allow you to keep tabs on your money with ease. Despite the way that its website doesn't really sell the product quite as well as you might expect, BankTree is powerful, performs well and comes with a wide variety if features that make it appealing to users across the board, especially during the coronavirus crisis.",
    "You can choose from either a desktop downloadable software edition, or an online variation on the theme that is compatible with any system that supports a web browser. There are trial versions of both packages and a good level of security is built into either option. The competition includes Mint, You Need a Budget (YNAB), AceMoneyLite, Money Dashboard or Moneydance if you want to check those out too.",
    "You can get the BankTree download for £35 currently, and for that the company says it will provide you with free email support, free updates along with any bug fixes needed to boost the performance of BankTree Desktop Personal Finance Version 3.0. The price allows you to install the software on one computer, although additional installations are priced at just £5, which seems reasonable enough.",
    "There’s a fully functioning 30-day trial of the software available too, which gives you the ability to road test it first before signing up for the paid-for edition. The other option is to go for the BankTree Online Personal Finance Software package, which is browser-based rather than being downloadable software.",
    "Pricing for BankTree Online can be broken down into three options. There’s a free trial for 7 days. The ‘value’ Starter package comes in at £3.50 per month or £35 per year, while a Premier option is £4.50 per month or £45 per year.",
    "One of the least appealing aspects of BankTree is the supporting website that delivers your initial taster of what to expect. If you can bear with the slightly annoying web pages though you’ll find that there’s plenty of appeal from the service itself. Fans of downloadable desktop software will be happy with its conventional edition.",
    "However, the really good stuff comes from within BankTree Online, the personal finance package that works via any web browser and on any platform. It’s got a stack of features that include the ability to setup cash or investment accounts, plus there’s the capacity for importing bank statements from your online bank or other financial packages, including the likes of Quicken or Microsoft Money. Major UK and US banks are supported along with over 2,500 other financial institutions covering 55 countries.",
    "Once you’ve configured it, BankTree lets you record your income and expenditure, keep an eye on your balances and also budget with precision-level accuracy. There’s also support for multiple currencies, making it appealing to a wider audience.",
    "BankTree Desktop Personal Finance Software can be used on Windows machines, including Windows operating systems including Windows 7, Windows 8, and Windows 10. Version 3.0 has been improved and shouldn't deliver any major surprises, while the accompanying app works on both Android and iOS and is also able to work with both the downloadable software and the online system. BankTree also uses 2048 bit encryption and supports two-factor authentication. Expect dependable performance if you’ve opted to go for the Online edition.",
    "BankTree has a main dashboard area, which might not be the most inspiring of workspaces but does give easy access to all of the features and functions. The menu system is pretty simplistic and allows you to tackle core tasks, such as splitting transactions so you can more accurately file them into suitable categories. When it comes to producing reports then the service is also easy to work with.",
    "If you want to augment the online service with a more mobile option then the app is ideal, which comes with solid capabilities, though requires some time to get to grips with.",
    "Rather like its website, the support that comes from BankTree is a little bit of a hotchpotch of ideas. While there is plenty of tutorial support in the shape of instructional videos and suchlike, the documentation proves rather testing to get through.",
    "The knowledgebase, for example, does have a lot of information lurking inside, it’s just that the delivery is a little bit lacking. The YouTube tutorial videos are rather easier to sit through and there’s one for just about any aspect of the service.",
    "You’ll find a ticketing system too, for anyone needing to drop the support team a line. You can get ahead of the queue with the £10 premium ticket option, otherwise you’ll have to just wait in line by submitting a free ticket instead. At the time of writing there doesn’t appear to be any phone support available.",
    "BankTree is a bit of a mixed bag, with numerous positives going for it along with a few negatives that might put off more casual users. The features and interface are all generally good, but some tweaks to the package might make it more widely appealing. Anyone using BankTree for the first time will find that it takes a while to get setup and running.",
    "If BankTree can do a little bit of fettling to minimize the list of manual intervention needed and spruce up sections of the software then this could become much better than it is currently. It’s worthy of a free trial inspection nonetheless."
  ],
  "headers": {
    "2": "Pricing",
    "5": "Features",
    "8": "Performance",
    "9": "Ease of use",
    "11": "Support",
    "14": "Final verdict"
  },
  "links": {
    "BankTree": "http://www.banktree.co.uk/personal-finance-software.html",
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "AceMoneyLite": "https://www.techradar.com/reviews/acemoney-lite",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance",
    "BankTree download": "http://www.banktree.co.uk/buy.html",
    "30-day trial": "http://www.banktree.co.uk/buy.html",
    "BankTree Online": "http://www.banktree.co.uk/buy.html"
  }
}