{
  "source": "https://www.techradar.com/reviews/fifa-21",
  "title": "FIFA 21 review",
  "category": "gaming",
  "updated": "2020-10-09T10:47:00Z",
  "author": "jordan-middler",
  "summary": "FIFA 21 is a Messi package",
  "verdict": "A lack of innovation in long neglected areas and the lingering specter of microtransactions makes FIFA 21 a good football simulator in a dated package.",
  "pros": [
    "Attacking feels great",
    "Visually authentic",
    "Plenty of modes"
  ],
  "cons": [
    "No substantial changes",
    "Lingering defensive issues",
    "Microtransaction overload"
  ],
  "article": [
    "The FIFA series is facing an identity crisis. While the ludicrously popular Ultimate Team mode has cemented its place as the most popular sports game in the world this generation, a lingering unrest in the community combined with challenges from governments over its loot box mechanics mean it's hard to tell what the mode will look like in a few years.",
    "With that in mind, we had hoped that the other modes in FIFA 21 would get extra attention this year – but it's not really been the case. While FIFA is still a frequently enjoyable football game at its core, with shooting significantly improved this year to exciting effect, it also features persistent issues from previous editions.",
    "Considering that long forgotten modes have only received a few thin improvements, too, FIFA 21 feels like the most skippable entry in the series of this generation.",
    "For someone that buys FIFA purely to play against their mates, this is a fine entry. It’s only when you spend a lot of time with the game, especially online, that you begin to see the cracks form.",
    "You'll see the same types of defensive errors happening repeatedly, as well as the lack of responsiveness on inputs such as skill moves. If your internet connection is not perfect, you’re left playing a game of predictive football, hoping that the challenge you made will actually connect when it reaches the game.",
    "The issue is, though, FIFA can’t decide whether it wants to be a game for the hardcore Ultimate Team eSports player or the pals on the couch that play a few games after the pub. It’s stuck in a limbo of decaying old systems, causing problems when combined with new ones. There are broken animations that have been in the game for half a decade. Online games are hindered by players exploiting broken mechanics.",
    "Attackers comfortably retained possession of the ball, despite a quartet of defenders attempting to dispossess them. Passes will simply refuse to go in the desired direction, no matter how many of the in-game assists you turn off. Switching to a specific player is a lottery of flicking the right stick and hoping that the game doesn’t hand you control of your clueless central midfielder, while your opponent’s nippy striker leaves a player-shaped mound of dust on the edge of your box.",
    "Still, some improvements have definitely been made. Our favourite element of this year's FIFA is by far the shooting, which has undergone sensible changes. Every angle feels like a viable means of attack, opening the possibility for spectacular solo efforts or elegant moments of team play. Being on the attack feels more fun than it has in years.",
    "Crossing has also received a major boost, with a new Trent Alexander-Arnold-style whipped cross being added to the arsenal of the world’s best wingers. Combining one of these with a player of natural heading talent is deadly. While we've certainly scored some unbelievable goals so far in our time with FIFA 21, opponents will frequently respond in kind, confounding your clueless defense despite your best efforts.",
    "Ultimate Team is a big focus of each and every FIFA game, and that's no different this year. The microtransaction-hungry, football-themed sticker book simulator faces its biggest change in years, with the ability to play Division Rivals, Squad Battles and Friendlies in co-op.",
    "While this might seem like a good thing, since the ongoing frustration FUT provides is more tolerable with a friend, the lack of its inclusion in the competitive mode FUT Champions is a missed opportunity. Outside of that, the mode is still entirely focused on opening packs of virtual items. This is how players recruit new members of their dream team and acquire consumable items, both of which can be sold for coins, the in-game transfer market’s virtual currency.",
    "Technically, you don’t have to spend a single penny to play Ultimate Team outside of the price of the game. That said, a player who spends no money is at a disadvantage compared to those willing to spend hundreds of pounds on packs, to the point where it basically feels insurmountable. Even for those willing to invest more than double the price of the game, access to the highest-tier cards and the world’s most popular players is entirely determined by luck.",
    "This mode should not have a place in gaming in 2020 – at least not in this form. There are far better and less frustrating ways to monetize full-price games, and this is still a big caveat in recommending FIFA these days.",
    "Modes such as Career and Pro Clubs have received very minor upgrades. The progression of players via training and development is somewhat more in-depth this time, but it obviously lacks the micromanaging that the Football Manager series excels in.",
    "FIFA's poor homage to FIFA Street, Volta, returns. This mode attempts to play to the (more) casual audience with smaller 3v3, 4v4 and 5v5 games. While some rules are different, such as what counts as a good tackle and what’s closer to physical assault, it doesn’t do nearly enough to differentiate itself from the core football game.",
    "It also completely lacks the swagger of the FIFA Street games – this tone is cringey by 2020's standards, but it did give those games their own flavor, which Volta doesn't really have.",
    "Volta’s narrative mode is mercifully short and substantially less annoying than last year's effort. It features a similar premise: your character journeys across the world to have a kick about with someone of football's living legends.",
    "Pro clubs have received the ability to customize team kits in FIFA 21, too, so now you and your pals can find clever new ways to get past EA’s offensive language filters in outfit form. The mode is still terribly underserved for the loyal following it retains each year, and after similar treatment for half a decade, it feels like an element of the game that EA has almost forgotten.",
    "FIFA 21 has little new going on in this PS4 version, as its development team prepares for the next generation entry in the series. Purchasing a copy of FIFA 21 on either family of console will grant you access to its shinier new signing in November, which is great – but should the content remain the same, then it’s a package that has us thinking about what could be achieved in FIFA 22.",
    "If you’re not as unflinchingly loyal to Ultimate Team’s competitive modes as we are, there’s little here that you don’t already have in FIFA 20. While the attacking gameplay is faster and more enjoyable than it has been in a long time, it’s couched in a package that feels dated and in desperate need of a new signing."
  ],
  "headers": {
    "3": "Striking a chord",
    "9": "The Ultimate Team game",
    "13": "Old familiar",
    "18": "Verdict"
  },
  "links": {
    "challenges from governments": "https://www.sportbible.com/news/gaming-fifa-ultimate-team-could-soon-be-classified-as-gambling-in-the-uk-20200702"
  }
}