{
  "source": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
  "title": "Nvidia GeForce RTX 2070 Super review",
  "category": "components",
  "updated": "2020-09-21T18:38:35Z",
  "author": "jackie-thomas",
  "summary": "The same RTX 2070 – only Super-charged",
  "verdict": "The Nvidia GeForce RTX 2070 Super brings better performance to the table, along with a lower price point, making it a much more compelling purchase for more everyday users.",
  "pros": [
    "Founders Edition cheaper than original 2070",
    "More CUDA cores",
    "1440p gaming with ray tracing"
  ],
  "cons": [
    "Still kind of expensive",
    "Founders Edition card is heavy"
  ],
  "article": [
    "The Nvidia GeForce RTX 2070 Super has taken the power and accessible price that the RTX 2070 had to offer, and added a boost in performance. It takes the same spot in the lineup with the same pricing, only with vastly improved performance, making it an even better value than the at-the-time somewhat underwhelming RTX 2070.",
    "And, that’s even in the shadow of the Nvidia GeForce RTX 2080 Ti. Alongside the RTX 2060 Super, the Nvidia GeForce RTX 2070 Super has given Pascal gamers even more compelling reasons to upgrade. While we wish Nvidia had unlocked this level of performance when the original set of Turing cards were released, it’s nice to see the Nvidia GeForce RTX 2070 Super live up to its super name.",
    "With the next line of cards upon us – Nvidia's mysterious September 1 event just unveiled the RTX 3070, 3080 and 3090 GPUs from the Nvidia RTX 3000 series – the Nvidia GeForce RTX 2070 Super may no longer be the new kid on the block. However, it’s still worth a look, especially for those who want to save a little over the brand new entries coming out.",
    "The Nvidia GeForce RTX 2070 Super also lands in a post-AMD Navi world, where the closest competitor, both in performance and price, is the AMD Radeon RX 5700 XT, which comes in at $399 (about £315, AU$580).",
    "The Nvidia GeForce RTX 2070 originally launched back in October 2018 for $499 (about £395, AU$720), with the Founders Edition costing about $100 more at $599 (£569, AU$899). This was a bit too expensive, especially compared to the previous-generation Nvidia GeForce GTX 1070.",
    "However, the Nvidia GeForce RTX 2070 Super, which launched on July 9, comes in cheaper than the RTX 2070 with the Founders Edition costing $499 (about £395, AU$720), $100 less than the previous iteration. The aftermarket RTX 2070s are currently listed at similar prices ($499-584.99) as the Founders Edition but we’ll see if that pricing sticks as these cards become more readily available.",
    "The Nvidia GeForce RTX 2070 Super takes the successful Nvidia Turing architecture and makes it even more accessible to the masses. It takes the 2,304 CUDA cores in the existing Nvidia GeForce RTX 2070 and bumps it up to 2,560, and also sees higher clocks with a 1,770MHz boost clock.",
    "Right now, we don't know if the Nvidia GeForce RTX 2070 Super features more RT and Tensor Cores than the Nvidia GeForce RTX 2070, but it is rated for better ray tracing performance, at 7 Giga Rays. Both of these architectural improvements, however, comes at the slightly increased power consumption at 215 Watts.",
    "The only thing that really stays the same between the Nvidia Geforce RTX 2070 Super and the original RTX 2070 is the memory, which comes with 8GB of GDDR6 VRAM, clocked at 14Gbps.",
    "We have to talk about the design of the card for a minute, too, however. It still has the same overall profile as the existing Nvidia Turing Founders Edition cards, but it has a chrome design beneath the logo, making for a shinier, prettier card. This will likely be meaningless unless you have a case that lets you see inside, but it's a nice detail.",
    "Unfortunately, the Nvidia GeForce RTX 2070 Super is still on the heftier side, necessitating a motherboard with extra PCIe support.",
    "Because of the increased clock speeds and greater amount of CUDA cores, the Nvidia GeForce RTX 2070 Super should be much more powerful than the vanilla RTX 2070.",
    "For instance, in Metro Exodus, we are able to consistently run above 70 frames per second (fps) for most of the beginning section at 1440p. Turning all the graphics options to Ultra, and switching on ray traced global illumination and DLSS, we still have a smooth gaming experience.",
    "We've also put Shadow of the Tomb Raider through its paces, also with ray tracing and DLSS enabled, and performance didn't quite hit the same marks as much. It's still an absolute improvement over the original card, but it stuck at around 50 fps in our time with it.",
    "The massively improved performance is reflected in our benchmarks, too. For instance, in 3DMark FireStrike Ultra, the Nvidia GeForce RTX 2070 Super shows a massive improvement over the vanilla RTX 2070 – scoring 5,942 vs the latter’s 5,532. And, in TimeSpy, one of the more popular tests, the RTX 2070 Super scores 10,153 vs the RTX 2070’s 8,805.",
    "In fact, there are some instances where the RTX 2070 Super starts to compete with the RTX 2080. For instance, the RTX 2070 Super can run Metro Exodus at 4K on Ultra settings and get 35 fps to the RTX 2080’s 38. That’s getting pretty close to the same performance as the RTX 2080, for $300 (about £230, AU$430) less.",
    "So, while we wouldn’t necessarily recommend this graphics card for 4K gaming, something more suited to the newly released RTX 2080 Superwhich came out July 23 – as 35-40 fps just isn’t worth it – the Nvidia GeForce RTX 2070 Super should make for an excellent graphics card for 1440p gaming. In fact, if the Nvidia GeForce RTX 2070 Super would have made it out when the original 2070 did, Nvidia Turing would have been one of the greatest GPU launches of all time.",
    "At $499 (about £395, AU$720), with much improved performance, the Nvidia GeForce RTX 2070 Super offers a much better value than Nvidia Turing did at launch. You're getting more performance for the money, and that is never a bad thing.",
    "It would have been nice to see this quality of performance at this price point back when Nvidia Turing first hit the streets back in September 2018, but at least we’re getting it now. This is probably one of the best Nvidia graphics cards for anyone that wants to get some high frame rate gaming done at 1440p.",
    "Of course, if you’ve already invested into Nvidia’s ray-traced vision, you might not need to pay any attention to this graphics card. But, anyone that’s been wondering if it’s worth it, waiting for a more reasonably priced graphics card for 1440p, there’s never been a better time to live your life ray-traced."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Features and chipset",
    "11": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "Nvidia GeForce RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review",
    "RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "Nvidia's mysterious September 1 event": "https://www.techradar.com/how-to/how-to-watch-the-nvidia-geforce-rtx-3080-launch-event-online",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "AMD Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "Nvidia GeForce RTX 2070 Super should be much more powerful than the vanilla RTX 2070.": "https://www.techradar.com/news/nvidia-geforce-rtx-2070-super-vs-rtx-2070",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Shadow of the Tomb Raider": "https://store.steampowered.com/app/750920/Shadow_of_the_Tomb_Raider/",
    "RTX 2080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080",
    "RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super"
  }
}