{
  "source": "https://www.techradar.com/reviews/certainsafe-review",
  "title": "CertainSafe cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T14:41:43Z",
  "author": "david-nield",
  "summary": "CertainSafe is all about the encryption",
  "verdict": "There's no doubt that CertainSafe scores highly in terms of encryption, security and secure sharing – but that's about all that it does score highly in. The rest of the experience isn't bad, exactly, but could do with a new lick of paint and some usability improvements.",
  "pros": [
    "Excellent security",
    "Anti-phishing tools",
    "Custom API options"
  ],
  "cons": [
    "Unusual pricing structure",
    "Dated-looking interface",
    "Not many extra features"
  ],
  "article": [
    "CertainSafe calls itself a Digital Safety Deposit Box – it's not so much about file syncing and sharing as about creating a fully secured, fully compliant digital locker in the cloud where you can store your most important files and keep them protected against prying eyes.",
    "The service certainly scores highly in terms of the encryption and the security protection that it offers, but with very little in the way of recent social media activity and quite a dated-looking interface, we do wonder if CertainSafe is being very actively developed as a cloud storage service.",
    "Everything works in the cloud when it comes to CertainSafe, so you don't have any Windows or macOS applications to install, and the service isn't available as a mobile app either (you can access the website from any device, desktop or mobile). Once you've logged into the web browser and set up security for your account, you get to the rather bare bones web interface for loading up your files.",
    "Files up to 2GB in size can be moved to and from the CertainSafe cloud locker as required. You get detailed version control (for rolling back to older versions of the files) and there's a comprehensive audit trail too so you (and your bosses, if applicable) know exactly what's happened to each bit of data.",
    "CertainSafe is certainly committed to keeping your data well protected. As well as manually uploading files, you can use the service's API features to create custom solutions for uploading data automatically – more work on your end obviously, but it gives you the opportunity to create something that's tailored perfectly for your small to medium-sized business. While normal users can take advantage of what CertainSafe has to offer, it's very much aimed at the enterprise market.",
    "The big feature here is the security though: zero-knowledge encryption means not even CertainSafe can look at your files. Through a series of clever security tricks, spreading encryption keys and your files across multiple locations, someone else getting access to your files is pretty much impossible – just make sure you don't forget your password, because you won't be able to get back in without it.",
    "If you're going to sign up for CertainSafe then it probably isn't going to be because of its interface – the simple web-based app that comprises the core of the CertainSafe experience is functional but a little on the clunky side. It certainly doesn't zip along like the modern online interfaces you get with the likes of Dropbox and Google Drive, so the CertainSafe developers could make improvements here.",
    "It's very much up to you how you keep your files and folders organised. With no desktop client and no automatic syncing, it's up to you to keep everything in order. Files can be added to your online locker by selecting them from the local drive or by dragging them into a browser window, though it's worth noting that we had a login problem with Chrome that we had to switch to Firefox to fix.",
    "Sharing is handled at the folder level and again is a very secure process – you choose which specific contacts have access to which specific folders, and you can set upload and download privileges separately. Remember that because CertainSafe only exists on the web, it can very effectively control who has access to what.",
    "Upload speeds are respectable without being blistering (our home internet connection is almost certainly responsible for that), and on the whole CertainSafe makes most actions straightforward and simple. We'd like to see a few more bells and whistles added in terms of the interface, but it works as advertised.",
    "As we've already mentioned, security and encryption is the big selling point of CertainSafe. Using a technique called MicroEncryption, CertainSafe keeps your files split up into sections, which means even if hackers were able to get into the CertainSafe servers – a very tough ask in itself – they wouldn't be able to make sense of any of the data they came across. It's perhaps more likely that you'd be tricked into giving up your username and password to someone else.",
    "On that point though, CertainSafe makes use of some smart anti-phishing measures – whenever you sign in, the site displays a picture and a phrase of your choosing, which means you won't be tricked into logging into a spoof mock-up of the CertainSafe portal. It would be nice to have two-factor authentication here as well for some extra protection, but that's not something CertainSafe offers.",
    "CertainSafe pricing is a bit on the unusual side, but the free trial is along more conventional lines – you get 30 days to put the cloud storage service through its paces, and you don't have to give up any credit card details at the beginning, which we always like to see (it saves some nasty surprises if you forget to cancel your trial on the right date).",
    "After that there's just one main storage tier: 100GB of space for $12 per user per month. CertainSafe says \"if you need more storage add users\", so paying another $48 per month would get you 500GB of room, but it's not the way most cloud storage plans work (and it's expensive). You can also contact CertainSafe directly for a custom quote as well.",
    "If you want somewhere to keep files securely in the cloud, then CertainSafe might be worth a look – the anti-phishing measures, the MicroEncryption technology, and the numerous other safeguards add a lot of peace of mind, whether you're keeping all your files to yourself or sharing them with other people.",
    "That said, the interface is a bit rudimentary, it's relatively expensive when compared to other services, and we came across one or two bugs (like trying to complete a login on Chrome). The lack of recent news and social media activity from CertainSafe makes us wonder how much work is going into it at the moment, but for now at least, we found it to be a reliable and effective cloud storage solution."
  ],
  "headers": {
    "2": "CertainSafe features",
    "6": "CertainSafe interface",
    "10": "CertainSafe security",
    "12": "CertainSafe pricing",
    "14": "CertainSafe verdict"
  },
  "links": {
    "CertainSafe": "https://certainsafe.com/",
    "file syncing": "https://www.techradar.com/best/best-file-syncing-solution",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}