{
  "source": "https://www.techradar.com/reviews/xerox-versalink-b600dn",
  "title": "Xerox VersaLink B600DN review",
  "category": "computing",
  "updated": "2021-03-29T11:47:34Z",
  "author": "jim-hill",
  "summary": "Superfast mono laser printing",
  "verdict": "A pricey mono printer with an astonishing print rate and low running cost.",
  "pros": [
    "Modular upgrades available",
    "High paper capacity",
    "Low running cost",
    "Intuitive touchscreen interface"
  ],
  "cons": [
    "High initial outlay",
    "Wi-Fi module costs extra",
    "Noisy in operation"
  ],
  "article": [
    "For a monochrome print-only device that’s small enough to sit on a desktop, the Xerox VersaLink B600DN might seem a little expensive. Especially when you consider that the price of $471 (around £610, AU$1,137), doesn’t include the optional Wi-Fi module, or 250GB hard drive that we added. It does, however, include some impressive specifications.",
    "With a print speed of 55ppm (pages per minute) it’s one of the fastest laser printers in the business and boasts a combined paper capacity of 700 sheets. And if that’s not enough, Xerox offers a catalogue of cabinet options that adds further capacity.",
    "Consider the luxurious five-inch colour touchscreen, fast duplex printing, not to mention the wealth of modular upgrades available from Xerox and it becomes clear that this is a premium device aimed at servicing the needs of the busiest SMB printer requirements. And while the initial outlay is high, the running cost is actually quite low thanks to the high print yield of the installed toner cartridge. We ran a series of tests to find out if the print quality justifies that considerable price tag.",
    "The Xerox VersaLink B600DN is a conveniently compact design with crisp square corners and a smart appearance. It’s small enough to sit on a desk, but at 22.3kg, it’s surprisingly heavy. Xerox sells a cabinet complete with casters that transforms it into a free-standing design that would suit an open plan office well.",
    "The main paper tray is deep enough to hold 550 sheets of paper while the multipurpose, or bypass tray that folds out from the front can hold another 150 sheets. Alternatively, you can fill the multipurpose tray with a good pile of envelopes, card, or headed paper. The paper bin is also good and deep, holding around 500 sheets of paper and there’s a conveniently located USB port beside it for printing directly from a USB flash drive.",
    "The most distinctive feature, though, has to be the folding touchscreen control panel. It’s generously sized at five-inches and colourful, presenting all of the printer’s functions as apps in the style of a smartphone. This is the Xerox ConnectKey interface which is innovative in the way it allows you to download further apps to add to the touchscreen as you require them.",
    "Aside from printing in black and white, the Xerox VersaLink B600DN offers a draft mode for high speed printing, booklet creation, duplex and the ability to handle envelopes, card and headed paper of various weights and dimensions up to A4 size. There’s a USB port for printing from and scanning to a flash drive and NFC connectivity is built in.",
    "For Wi-Fi, we added the optional Xerox dongle, which clips into the back and costs $73 (£56).",
    "Xerox also sent us the optional Productivity Kit which plugs a 250GB hard drive into another empty panel at the rear. With this $285 (£217) upgrade you can line up many more documents at the printer without filling the inbuilt 2GB of print memory.",
    "Another optional extra is called the Finisher, which is a top-loading document feeder that can automatically staple your pages together. That unit actually costs more than the printer itself but it goes to show how well supported Xerox products are.",
    "There are various security features too. For instance, Secure Print holds your document in the printer’s memory and releases it only when you type your PIN into the touchscreen. You can set it to require the same PIN to make other adjustments, or download additional apps via ConnectKey.",
    "ConnectKey is what Xerox calls the suite of apps that let you access various functions via the touchscreen. Press the Print From USB app and you’ll be presented with only the options for printing via the USB port. Touch the Xerox app gallery and you’ll be taken to the list of other apps that can be installed. This is something that other printer manufacturers are unable to offer, but there aren’t many apps that are relevant to a print-only device like this as a lot of them relate to scanning and copying.",
    "The feature set of a mono printer is always going to be brief. The specifications, on the other hand, make impressive reading. 55 ppm is about as fast as it gets and we confirmed this print rate during our testing. The paper capacity is a very useful 700 sheets and the page yield from the installed toner cartridge is given as 10,300 pages. That’s a standard sized cartridge by the way. If you replace it with an Extra High Capacity cartridge, you’ll get a staggering 46,700 pages.",
    "Setup of the Xerox VersaLink B600DN is made especially easy by the big, bright touchscreen. It’s a simple case of following the prompts in order to join your local Wi-Fi network. You can set your PIN and other security options at this point too.",
    "This interface is as familiar and intuitive as a smartphone, giving you prompt access to the relevant functions. The cogs icon is instantly recognisable as the settings menu for instance. The touchscreen is obviously nowhere near as responsive or as fast as your smartphone, of course, but it’s the best we’ve seen attached to a printer.",
    "The standard sized toner cartridge is pre-loaded, so you don’t need to think about ink. The two optional modules that we were sent simply slotted into two empty panels at the rear and required no skill or even reference to the user manual to install. The Quick Setup Guide is clearly laid out, but the process is so simple, you’re unlikely to need it.",
    "The thing that strikes you first about the Xerox VersaLink B600DN is the speed at which it churns out printed pages. Give it a 30-sheet print job and it will give you stack of finished pages in almost as many seconds. That makes it faster even than the VersaLink C500DN, which is essentially a colour version of this machine. Duplex printing is only fractionally slower at 49.5ppm and photos make little difference to the print time either. The wake-up time is also quicker than most at 6.3 seconds as the first page out time.",
    "In the case of black and white photographs, you might prefer to wait longer for a better quality print and unfortunately that’s not going to happen. Images tend to suffer from banding and streakiness whatever setting you choose. Tet documents, on the other hand, look superb. The optimum print resolution here is 1,200 x 1,200, which is enough to achieve really crisp, well-rounded characters. Feed it some good heavy paper and you’re rewarded with a particularly professional-looking finish. After a hundred printed pages, we found no change in the print quality and experienced no paper jams, or misprints.",
    "This machine is rather loud in operation and it has a tendency to wake itself up noisily throughout the day and night. The bright display presumably draws a little more power than your average printer, but these are small concerns given the excellent overall performance.",
    "The little Xerox VersaLink B600DN justifies its sizable price tag with consistently crisp, dark and handsome printed pages. It’s also the fastest duplex printer we have tested, which makes it well suited to a particularly busy SMB, or a large workgroup. The initial cost is also outweighed by the fairly low running cost. A cost that will only get lower when you replace the fitted standard toner cart with a high-capacity one.",
    "It’s rather noisy in operation and the ConnectKey interface doesn’t really add much to a simple device like this, but all things considered, this printer is among the very best in its class."
  ],
  "headers": {
    "3": "Design",
    "6": "Features and specifications",
    "13": "Setup and operation",
    "16": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "Xerox VersaLink B600DN": "https://www.office.xerox.com/printers/laser-printers/versalink-b600-b610/enus.html",
    "$471": "https://www.printerbase.co.uk/xerox-versalink-b600dn-printer.html",
    "laser printers": "https://www.techradar.com/news/best-laser-printer",
    "SMB printer": "https://www.techradar.com/best/best-small-business-printers",
    "VersaLink C500DN": "https://www.techradar.com/reviews/xerox-versalink-c500dn"
  }
}