{
  "source": "https://www.techradar.com/reviews/happy-scribe",
  "title": "Happy Scribe review",
  "category": "computing",
  "updated": "2020-07-22T10:00:34Z",
  "author": "mark-pickavance",
  "summary": "Transcription that works",
  "verdict": "A transcription service that walks-the-walk, rather than making nebulous claims about how good it is. Tons of languages, efficient processing, good results and sensible pricing makes for a winning combination.",
  "pros": [
    "Impressive accuracy",
    "Huge language selection",
    "Money saving",
    "Automatic punctuation",
    "Multiple speaker identification"
  ],
  "cons": [
    "No live transcription"
  ],
  "article": [
    "Originated in Dublin, the small team behind Happy Scribe hail from the United States, Spain, Ireland, and France, and this business only formed a few years ago.",
    "The service has already achieved an excellent reputation amongst journalists, podcasters and researchers, who now rely on their service to process audio accurately into text.",
    "With a flat pricing model and a proven track record, is Happy Scribe the transcription service by which all others will be judged?",
    "Happy Scribe makes estimating the cost of transcription remarkably straightforward, as it charges purely based on the length of the recording.",
    "The flat rate is €12 per hour, but if you use the service extensively, there is a sliding discount that starts at 25 hours. The purchasing of time is in hour blocks, but time used is calculated by the minute, so you can use it to process multiple shorter recordings without penalty.",
    "Once you hit the last 30 minutes of paid-in-advance time, the system will automatically recharge the balance to a previously agreed amount. Credit left on the system won’t expire, even if you only use the service rarely, and there are no additional hidden fees for noisy audio, odd accents, or anything else.",
    "For volume users or those wishing to use the API, Happy Scribe is willing to consider quoting a tailored price.",
    "Students can also get a 25% discount if they register their student ID.",
    "As transcription goes, Happy Scribe is reasonably priced for the service it offers.",
    "Those familiar with transcription tools won’t be phased by this one, as it follows the same model of uploading audio files and then being subsequently informed when they’ve been processed.",
    "With Happy Scribe, the time between upload and completion is impressively short, with most processing taking less than half the running time of the audio, and 20 minutes for an hour of audio processing isn’t unusual.",
    "Being quick is helpful, but only if the text that’s returned is useful to those that need it.",
    "Where these things often cost extra with other services, here the identification of multiple speakers, timecoding, personalised vocabulary and automatic punctuation are all included by default.",
    "Once the audio is processed, it can be reviewed in the transcript editor, which highlights those parts that Happy Scribe thinks are dubious. And, once you’ve fixed anything wrong the text can then be downloaded in a wide range of file formats, including subtitle files.",
    "Thinking beyond the single or even group users, Happy Scribe also has a published API, enabling its technology to be used by external systems to enhance the workflow or provide seamless transcription of audio communication for accurate record keeping.",
    "The online editor is one of the better solutions we’ve seen for reviewing transcriptions, and by default, it highlights those words that the system isn’t 100% confident.",
    "What we found fascinating is that we’ve seen other systems that did this, where words it didn’t highlight are wrong, but that is rarely the case here.",
    "It’s a relatively painless exercise to review each of the suspect words, listen to the audio of that section and make any changes that are required.",
    "Once the document is sufficiently accurate, you can share it with others, export it in a range of formats or convert it to subtitles.",
    "The subtitle creation isn’t just and export in SRT format. A complete sub-editor exists where you can alter the timecode and alter how the words format on the screen.",
    "In Beta at this time is an additional feature where it can take the transcription and convert it into another language. Only ten languages are supported so far, but this could be a remarkably useful feature if you need subtitles in other tongues.",
    "In reviewing some transcription tools, we’ve seen some abysmal attempts to process the best quality audio into text. But thankfully, Happy Scribe isn’t one of those products.",
    "It smashed through our test files with almost perfect accuracy on some content, and the most modest number of issues even on the more challenging recordings.",
    "Our examples are files that are USA and British accents, but it handled both exceptionally well. We can’t confirm that other languages are processed as accurately, but it does a better job with English than any other transcription service that we’ve seen so far.",
    "We expect good results from the precise and clean recordings created for audiobooks, but Happy Scribe coped very well with live outdoor orators that other systems can’t handle.",
    "As a classic example of this, we processed the MLK speech from the Lincoln memorial, not the best sound quality, but it transcribed it with only a handful of mistakes.",
    "If you are looking for fast and affordable transcription, test Happy Scribe first. Because if this won’t achieve what you want, then the only alternative is to pay the high price of manual transcription by native speakers.",
    "But frankly, we’ve seen lower levels of accuracy from some humans.",
    "According to Happy Scribe, its solution is fully GDPR compliant, all data sent between the customers and Happy Scribe is encrypted using field-standard TLS 1.2.",
    "And, they have a sophisticated DDoS protection model, and a network-level security monitoring and protection scheme.",
    "Our only reservation about this system is that currently it only requires a password to gain access to an account, and we’d prefer that it offered two-factor authentication.",
    "Hopefully, they will consider that at some point.",
    "Yes, it sounds like something Bob Ross would place in his paintings, but it’s not that.",
    "According to those that use it regularly, and supported by our testing, this is a dependable means to convert audio from one of 119 different languages into text.",
    "The accuracy isn’t entirely uniform, with some languages being better than others, but most users appear incredibly pleased with its performance.",
    "In our tests, conducted in English, the results were markedly better than other transcription services, and it was even better than some locally installable apps with voice training performed.",
    "And, it’s also cost-effective when you consider how much time it takes to manually transcribe a podcast or meeting. An hour recording could easily take even an experienced transcriber a day’s work to complete and cost at least ten times as much or more.",
    "What it doesn't offer is live transcription, if you need that.",
    "The strong economic justification for Happy Scribe is undeniable, and when combined with the accuracy of transcription on offer, this has the credentials to become the tool of choice for those that need regular conversions."
  ],
  "headers": {
    "3": "Plans and pricing",
    "9": "Design",
    "15": "Recordings",
    "21": "Accuracy",
    "28": "Security",
    "32": "Final verdict"
  },
  "links": {}
}