{
  "source": "https://www.techradar.com/reviews/sage-3x-bluicer-pro-review",
  "title": "Sage 3X Bluicer Pro review",
  "category": "appliances",
  "updated": "2020-01-31T12:34:56Z",
  "author": "emily-peck",
  "summary": "A great combo appliance idea, but lacking in some areas",
  "verdict": "The dual functions of the Sage 3X Bluicer Pro make it a space saving and flexible design that does well to minimise mess.",
  "pros": [
    "Variety of speeds",
    "Juices and blends in one",
    "5 one-touch programs"
  ],
  "cons": [
    "Fast and a little furious",
    "Bulky parts",
    "Noisy"
  ],
  "article": [
    "Sage sells a range of professionally-inspired kitchen appliances from sleek espresso machines to compact food processors and more.",
    "Its multi-functional Sage X3 Bluicer Pro countertop appliance is the company’s latest launch that has been designed to fill the gap in the market for an appliance that both blends and juices in one. Read on here to find out what we made of this exciting new design as we put it through its paces against the best juicers in the category.",
    "The Sage X3 Bluicer Pro has just been launched and you’ll find it priced £369.95 / $479 / AUS $699 over on the Sage website.",
    "That puts it in line with the Sana EUJ-707 juicer by Omega, which is priced at £369 / $ 483 / AUS $705 online at UK Juicers and Amazon. Though serving slightly different purposes, our money stays on the Omega at this point.",
    "Tapping into a gap in the market for a design that both juices and blends in one, Sage has launched this powerful countertop appliance. It is finished with Sage’s signature stainless-steel styling, and includes a blender with a Kinetix contoured blade and bowl system, an 88mm extra wide chute, five one-touch programs and 10 precision speed controls. The design can be used as a juicer or blender on its own, or the two can be combined so you can extract fresh juice straight into the 1.5litre blender.",
    "It has Cold Spin Technology, which means the juice will flow up and through the stainless steel cutting disc and Italian-made mesh filter so it doesn’t get too hot and keeps your drink fresher for longer.",
    "While many juicer parts aren’t dishwasher safe, we were pleased to find out that some of the components on the Sage Bluicer are. These included tricky to clean parts such as the juicing nozzle, filter bowl surround and stainless-steel filter basket.",
    "You instantly notice how powerful the 1350 watt motor can be on the Sage 3X Bluicer Pro. The design comes with an interlocking safety arm that stops the motor base operating without the cover locked into place. As it is so powerful, when using the machine on its juicing function you’ll need to adhere to the specific speeds that can be adjusted with the dial on the front control panel.",
    "Inside the box you’ll find an instruction manual with advice on set up and a chart that lets you easily see which speeds to use for certain fruits and vegetables. You will need to ensure that the pusher is placed on top of the produce as soon as you insert your food so it doesn’t splash back out - we found this out the hard way as a slice of lime bounced back out of the chute at us.",
    "In juicing mode we found the motor a little too powerful for our liking on leafy greens and softer fruits such as berries – when blending a handful of spinach we were disappointed by how little juice was extracted. While we were able to extract a decent amount of juice from a whole apple - easily fed whole through the chute - it did produce a surprisingly amount of foam on top of the juice extract. What’s more, while you can juice straight into the blender jug, we think the design could do with a smaller jug or cup as part of the package. It does however have a large 3-litre pulp container.",
    "If you want to switch to blending, you can use the five preset functions that include Smoothie, Green Smoothie, Pulse/Ice Crush (which turns ice into snow), Auto Clean and Frozen Cocktail. It also folds and aerates should you wish to make smoothies and soups.",
    "We love the fact that the Bluicer banishes the need for a separate juicer and blender. If you’re keen to enjoy the nutritional benefits of a traditional slow juicer or cold press juicer, this probably isn’t the design for you.",
    "But if you want to whip up fruit juices, slushies, smoothies and cocktails easily and quickly – and have some fun while you’re doing it – then we definitely recommend you take a closer look."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "7": "Performance",
    "11": "Verdict"
  },
  "links": {
    "best juicers": "https://www.techradar.com/news/best-juicer",
    "Sage website.": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1235094941557832700&xs=1&url=https%3A%2F%2Fwww.sageappliances.com%2Fuk%2Fen%2Fproducts%2Fbluicers%2Fbjb815.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fsage-3x-bluicer-pro-review",
    "Sana EUJ-707 juicer by Omega,": "https://www.techradar.com/reviews/sana-euj-707-juicer-by-omega",
    "UK Juicers": "https://www.ukjuicers.com/sana-juicer-by-omega-polished-chrome-euj707c",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FOmega-Sana-Juicer-Chrome-707C%2Fdp%2FB010BJ2K98%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2944034637031482400-21"
  }
}