{
  "source": "https://www.techradar.com/reviews/shure-aonic-50",
  "title": "Shure AONIC 50 review",
  "category": "audio-visual",
  "updated": "2020-06-16T19:27:42Z",
  "author": "simon-lucas",
  "summary": "Shure has finally joined the wireless noise-cancelling party",
  "verdict": "There are some gaps in specification compared to their most obvious rivals like the Sony WH-1000XM3, but where it really counts - sound quality - the Shure AONIC50 need no excuses made for them.",
  "pros": [
    "Expansive, convincing sound",
    "Sturdy construction",
    "Good ANC"
  ],
  "cons": [
    "Humdrum physical interface",
    "No auto-off feature",
    "No touch controls"
  ],
  "article": [
    "Ever since Sidney Shure established his Radio Company in Chicago back in 1925, Shure has been at the forefront of microphone technology, cartridge technology and headphone technology. It’s been associated with the likes of Elvis Presley, The Beatles, Jimi Hendrix and Aretha Franklin. It got in on the ground floor of surround sound in cinemas and theatres. Shure knows exactly what it’s doing.",
    "It took until the 21st century for Shure to begin flexing its muscles in consumer technology markets, but its judicious catalogue of high-performance headphones has made it a major player among more discerning customers. And finally Shure is ready to involve itself in the most hotly contested area of the consumer headphones market: the wireless noise-cancelling category.",
    "The Shure AONIC 50 sports a wireless, active noise-cancelling over-ear design, selling at a premium price to compete with the likes of the Sony WH-1000XM3 and Bose NC 700 Headphones.",
    "This being Shure, though, the AONIC 50 aren’t quite a ‘me too!’ product. In fact, in some ways they’re as notable for the features they omit as those they include. Ultimately, while you won't find every feature under the sun here, the Shure AONIC 50 are laser-focused on delivering the best sound-quality of almost any noise-cancelling headphone. Here's what it's like to use them.",
    "The Shure AONIC 50 are available now for $399 / £359 – that works out at around AU$580, though Australian pricing is still to be confirmed.",
    "That's more expensive than the best headphones of 2020, the Sony WH-1000XM3, which come in at $349 / £300 / AU$499, which offer a few more features than the Shure AONIC 50. We recommend the Sony WH-1000XM3 to pretty much anyone and everyone, but if you're after Shure's time-tested sound quality, the AONIC 50 serves as a worthwhile alternative.",
    "At a glance, of course, the AONIC 50 look pretty much like every other pair of pricey noise-cancelling over-ear headphones around. The detachable leather-and-memory-foam earpads are attached to robust plastic earcups, which in turn are connected to a leather-covered headband via aluminum arms. These articulate through 90 degrees to allow the AONIC 50 to lie flat, and are heftily damped through the hinges.",
    "Each earcup carries the ‘Shure’ logo, and it appears again on the inside of the headband. The look is not quite anonymous, but it’s certainly subtle. No matter whether you choose the black or brown finish (the only options available), it’s debatable whether the Shures look any more expensive than, say, the Sony WH-1000XM3s, at roughly $50 / £50 less than the AONIC 50 asking price.",
    "The sturdy way the earcups articulate and the headband adjusts (plus the 334g weight) are the only real indications, design-wise, of where your extra outlay might have gone.",
    "There’s no articulation in the frame of the AONIC50 beyond the earcups folding flat - so the hard travel-case is, at roughly 15cm diameter, a fair bit bigger than most. Still, at least it offers plenty of room to stow the bundled USB-C charging cable and 2.5mm-3.5mm analogue cable.",
    "While the left-hand earcup has just a 2.5mm socket for use should you run out of battery power (or if you want to indulge in the in-flight entertainment), the right-hand side is all go. There’s a USB-C socket (the AONIC 50 should go from ‘flat’ to ‘full’ in a touch over two hours) that functions as a data port as well as a charging port, and a power on/off button that also readies these noise-cancelling headphones for Bluetooth pairing.",
    "Further along the edge of the earcup are two more sets of controls. The first is a three-button arrangement, with ‘volume up’ and ‘volume down’ handled buy the two outer buttons - the centre button can deal with ‘play/pause’, ‘next track’, ‘previous track’, ‘answer/end/decline call’ and ‘activate Google Assistant’ or, at least, it will do once you’ve familiarized yourself with the required button-presses.",
    "The second control array switches between ‘active noise-cancelling on/off’ and ‘environment mode on’ – this last features amplifies external sounds, so carrying on a conversation while wearing the headphones (or just simply staying safe while out and about) is easier.",
    "Wireless connectivity is via Bluetooth 5, which is more than enough to a) offer a competitive 20 hours of battery life and b) get Hi-Res Audio files like MQA-powered Tidal Masters on board without alarms. Support for every worthwhile codec (including aptX HD, LDAC and aptX Low Latency) is included too.",
    "Control of the AONIC 50 is either physical (with the physical interface arranged on the right-hand earcup, as seems to be the wireless over-ear law) or via the ShurePlus PLAY app (iOS and Android). Unlike any number of nominal rivals, there are no touch-controls here - and only quite limited involvement of Google Assistant voice control. The AONIC 50 go without accelerometers, too, so will continue playing until you explicitly tell them not too - even if you’ve taken them off and folded them flat.",
    "Behind the cloth-covered inner part of each earpad there’s a 50mm dynamic driver backed by a neodymium magnet. Shure is claiming a frequency response from this driver of 20Hz to 22kHz – which is basically ‘whale song’ to ‘dog whistle’.",
    "There’s no audio response from Google Assistant here – but the AONIC 50’s mics ensure your commands are acted upon every time. Thanks to Shure’s microphonic expertise, call quality is about as good as it gets from a product like this, too.",
    "Both ‘environment mode’ and ‘active noise-cancellation’ are adjustable in the ShurePlus PLAY app. There are 10 stages of ‘environment mode’ amplification (the maximum setting is vigorous enough to make your own hand-claps painfully loud), but ‘noise-cancellation’ (once it’s turned on at the earcup) is either ‘normal’ or ‘max’. Noise-cancellation is effective enough to deal with the noise of any kind of transportation, but turning it on does give a noticeable boost to your music’s volume level too.",
    "The app is more than simply for control, though. In fact, it’s fundamentally a hi-res music player - all major file types catered for, up to a maximum 24bit/352kHz where WAV and FLAC files are concerned. Any locally stored music can be arranged into playlists and so on, and can be run through the app’s EQ settings – there are a few presets and the facility to save quite a number of custom settings too.",
    "EQ adjustment is only available through the app – music via streaming services is delivered with the Shures’ default sonic signature.",
    "In the most straightforward terms, the Shure AONIC 50 are a great-sounding pair of headphones. They’re balanced, but they’re not undemonstrative. They’re subtle, but they’re not understated. They’re energetic, but they’re not aggressive.",
    "And they can turn their hand to pretty much any kind of music you care to mention. Streaming from a Sony Xperia 5 via Tidal, they extract the musical fundamentals from everything from Marvin Gaye’s Trouble Man through The Stone Roses’ I am the Resurrection to Kendrick Lamar’s How Much a Dollar Cost. Doesn’t matter if you like Claude Debussy or Kamasi Washington, the AONIC 50 will give you chapter and verse in the most natural, most expressive and most detail-packed manner.",
    "Low frequencies are deep, textured and alive with fine harmonic detail - they start and stop with absolute control, and modulate seamlessly into the frequency information above them. In the midrange, the Shures have complete command of timbre and, again, even the finest of details – Marvin Gaye’s vocal is as characterful via the AONIC 50 as you’ve ever heard it.",
    "At the top of the frequency range, so often an area of real tribulation for headphones at any price, the Shures strike an impeccable balance between attack, substance and brilliance. There’s ample drive and shine to treble sounds, but they stop well short of hardness or grittiness.",
    "The AONIC 50 have no problem dealing with broad-strokes dynamic shifts, just as they have no difficulty with low-level second-order dynamics. The soundstage they describe is spacious, wide and coherently laid out, with more than enough elbow-room for individual elements to stand securely, even on a stage as busy as Kamasi Washington’s.",
    "Even complex arrangements are presented as a unified whole, and cut and paste collages like the Kendrik Lamar tune sound consistent.",
    "Shift from Bluetooth to connection via the PLAY app and there’s a mild, but definite, increase in positivity and insight. Comparing a locally stored 16bit/44.1kHz file of Can’s Moonshake to the Tidal-via-Bluetooth-derived equivalent shows how effective the app is as a music player - the sound is more open, more loaded with fine detail and more straightforwardly musical.",
    "Downsides, in terms of audio performance, are conspicuous only by their absence. Some listeners may conceivably find the Bluetooth sound (where there’s no EQ adjustment available) fractionally lightweight in the bass – the rest of us will just revel in the way the AONIC 50 describe low-end sounds with such straight-edged certainty.",
    "As downsides go, it’s mild in the extreme. But as far as the sound of the AONIC 50 goes, it’s the best we can do.",
    "They’re at the upper end of the market in terms of price, but Shure has given the established class leaders something to worry about at its very first attempt.",
    "That said, there are a few major contenders here, obviously - and they’re mostly more affordable than the Shures.",
    "Sony’s long-time class-leading WH-1000XM3 are the default choice where products of this type are concerned - there isn’t an area of performance where they don’t excel. And with reports of the imminent arrival of the Sony WH-1000XM4 replacements getting louder by the day, there will surely be deals available soon. But as fine as the Sony’s sound, they’re not quite as complete a listen as the AONIC50.",
    "The Bose Noise Cancelling Headphones 700 and Bowers & Wilkins PX Wireless are also very worthwhile alternatives, and there’s very little to be gained by ruling out Sennheiser’s burly Momentum 3 Wireless or the JBL Club One, either. It’s a long shortlist, admittedly...",
    "Overall, if you want great-sounding wireless headphones without a steep learning curve, the AONIC 50 has you covered."
  ],
  "headers": {
    "0": "30-second review",
    "4": "Price and availability",
    "6": "Design",
    "13": "Features",
    "20": "Performance",
    "29": "Final verdict"
  },
  "links": {
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Bose NC 700 Headphones": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "streaming services": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Sony Xperia 5": "https://www.techradar.com/reviews/sony-xperia-5-review",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "Bowers & Wilkins PX Wireless": "https://www.techradar.com/reviews/bowers-and-wilkins-px-wireless-noise-cancelling-headphones",
    "Momentum 3 Wireless": "https://www.techradar.com/reviews/sennheiser-momentum-wireless-2019-review",
    "JBL Club One": "https://www.techradar.com/reviews/jbl-club-one"
  }
}