{
  "source": "https://www.techradar.com/reviews/cat-s52-rugged-smartphone",
  "title": "Cat S52 rugged smartphone review",
  "category": "phones",
  "updated": "2020-03-16T21:31:25Z",
  "author": "kevin-lynch",
  "summary": "A rugged smartphone that does away with rubber flaps in favor of a more modern design",
  "verdict": "With an eye beyond just the building site, the Cat S52 is a good-looking device that’s equally aimed at butter-fingered mainstream users as much as those who work in extreme conditions. It’s easily the most aesthetically pleasing work phone out there, and there are no major corners cut when it comes to durability. However, its middling performance and dated screen will make it a hard sell for regular users at this price point.",
  "pros": [
    "Sleek, modern looks…",
    "Robust protection",
    "Excellent battery life",
    "Headphone jack"
  ],
  "cons": [
    "Mid-range price but budget smartphone performance",
    "Lacks unique features of its older sibling",
    "Dated screen and video performance"
  ],
  "article": [
    "Rugged smartphones have a well-earned perception of being plastic-coated, brick-like devices with feature lists rooted well in the past.",
    "Bullit, who produce smartphones for CAT under license, are looking to change all that with their new S52, a comparatively sleek handset that aims to offer the hard-as-nails durability of their previous tough phones in a casing that screams “Apple”.",
    "With its brushed aluminium frame, the S52 takes most of its cues from arguably the apex of handset design, the iPhone 4 - an interesting choice considering Apple is strongly rumoured to be revisiting the look of that device’s classic chassis with its 2020 phone line up.",
    "Diverging from current smartphone trends by not featuring an edge-to-edge screen or a camera hole notch, the S52 keeps it somewhat old school by sporting 1cm thick bands at either end of the display’s bezel on the phone’s face, which conceal the front-facing camera and speaker at the top.",
    "The shock-absorbing, non-slip rubberized TPU material that covers the back does break the illusion of a premium phone somewhat, but it's thankfully matte black in finish rather than shiny and makes for a comfortable and secure grip when holding the device, with diagonal grooves at the lower half of the device.",
    "Unlike most phones in this category, the charging port and headphone socket aren’t sealed with plastic covers, and are instead reliant upon waterproof coating, helping to further disguise its rugged credentials.",
    "The display, a 5.6-inch full HD model, is protected by the latest Corning Gorilla Glass 6 technology.",
    "Doing away with the built-in thermal imaging camera, laser distance tool and air quality monitor that features on Cat’s current flagship S61 device in the range, the S52 instead focuses on durability. It has a iP68 rating for dust and liquid resistance. In real terms this means it can be completely submerged in up to 1.5 metres of fresh water for 35 minutes. It’s also built to conform to the MIL-STD810G standard, meaning the casing and reinforced display provides fall resistance from 1.5 meters.",
    "While it doesn’t boast the same sort of advanced software image processing, it is still nevertheless impressive to find that the S52 rear camera shares the same Sony IMX363 12.2MP image sensor found on Google’s Pixel 3 and Pixel 4 phones.",
    "Similarly, the Helio P35 CPU may have appeared on many low-to-midrange smartphones last year, within the rugged smartphone sector it’s a chipset that’s comparatively cutting edge. There’s a somewhat limited 64GB of onboard storage, but this can at least be topped up via MicroSD card.",
    "There’s welcome NFC compatibility, (a rarity for this kind of handset), dual SIM card support, a handy led light for notifications, plus a fingerprint reader on the back of the phone.",
    "The device comes preloaded with a thankfully largely unmodified Android 9, the only minor concession to bloatware being a ‘toolbox’ folder of shortcut links to optional apps. These range from barcode readers to outdoor work-focused utilities for farmers, to activity trackers for cycling and hiking from Under Armour. A free upgrade to Android 10 has been promised by Bullit in due course, but as of the time of writing hasn’t yet been rolled out. Swiping through notifications does bring about the occasion hang, but on the whole the Helio P35 CPU coupled with its 4GB onboard RAM delivers a responsive, smooth experience.",
    "The phone’s dual SIM card tray is neatly used for also housing a Micro SD card for increased storage, but the way in which the tray’s cover had a tendency to get accidentally flicked open could likely become an annoyance over time.",
    "The fingerprint reader isn’t the fastest with a noticeable second or so of hesitation before unlocking, but it was consistent and seemed to reassuringly work well even with slightly wet or muddy hands.",
    "The images provided by the S52’s 12mp rear camera are unquestionably a step up from what we’re used to for a rugged phone, with excellent fine detail, low noise and decent colour reproduction in good conditions. However the onboard image processing and camera software isn’t quite up to the same level as the hardware sensor, with the camera slow and sometimes erratic at focusing, while low light results are disappointing.",
    "The camera’s “Portrait” mode is often prone to just smearing the background, but with some careful use it can pull off a convincing bokeh effect in good conditions. The front-facing camera is an 8MP shooter and while a noticeable step down from the rear snapper, should still provide serviceable selfies.",
    "The camera’s 1080p/30fps video recordings are again detailed and with decent audio quality to match, however the slow focusing is again an issue. Video playback across the board is perhaps a bigger issue, with playback of HD sources via YouTube, Netflix and clips taken using the camera prone to noise and slight blocking during fast moving scenes.",
    "The S52’s multimedia credentials are further hindered by the double-glazed IPS panel which means the display isn’t as bright as what we’d expect from a mainstream handset. While the screen isn’t as slippery as a regular phone, there’s no oleophobic treatment on the glass, meaning it’s also particularly prone to lingering fingerprints on its surface.",
    "On the face of it, the S52’s 3500mAh battery seems insufficient for a phone of this type and smacks of being a concession to the handset’s relatively slender dimensions, particularly when matched up to the ridiculous power capacity of its rival rugged phone the Blackview BV9100.",
    "Thankfully in practice, it does far better than expected. Due largely in part to the efficiency of the processor and the handset’s comparatively undemanding display, we found the S52 lasted through a day’s worth of regular usage and well into the following evening during testing. The 16w USB-C charger offers quick rapid juice top ups, however a full 100% replenishment took just under an hour during testing.",
    "The benchmark stats opposite coupled with its single lens photography places the S52 in the same ball park as mid-to budget ranked phones such as the Motorola Moto G7 Power and the Nokia 7.1. Such results are something of a step up for rugged smartphones and will be seen as a big bonus for those in the industrial sector who’ll be primarily concerned about its durability rather than the latest internals.",
    "Nevertheless, those phones mentioned boast far larger displays with higher resolutions, and, crucially, asking prices that are sub £200.",
    "The Doogee S68 Pro is the current best bet for features coupled with affordability for a rugged handset. While you might not feel as comfortable getting it out in a bar or on a date thanks to its unrefined rubberised protective casing, compared to the sleek S52, it offers the same level of shock proofing and water resistance. While it features a slower Mediatek Helio P70 CPUprocessor, it does offer more RAM (6GB) and larger onboard storage (128GB), for a much more inviting asking price ($196/£150/ AU$300).",
    "The Cat S52 certainly goes some way to redefining expectations of what a rugged phone looks like, coupling pocket-friendly dimensions with a classy, mainstream chassis design, yet still maintaining the sort of military grade toughness Cat have become known for. If you’re the type who has a separate hard wearing phone for work and another for regular use, this would certainly bridge the gap between the two.",
    "Nevertheless, when balancing off its rugged feature set against its comparatively hefty £449 price tag, the S52 will probably be a hard sell for the sort of mainstream users Cat are also hoping to entice."
  ],
  "headers": {
    "2": "Design",
    "7": "Hardware",
    "11": "In use and performance",
    "22": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "Rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "S52": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1166193398252075300&xs=1&url=https%3A%2F%2Fwww.catphones.com%2Fen-gb%2Fcat-s52-smartphone%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fcat-s52-rugged-smartphone",
    "S61": "https://www.techradar.com/reviews/cat-s61",
    "Blackview BV9100": "https://www.techradar.com/reviews/blackview-bv9100-rugged-smartphone",
    "Motorola Moto G7 Power": "https://www.techradar.com/reviews/moto-g7-power-review",
    "Nokia 7.1": "https://www.techradar.com/reviews/nokia-71-review",
    "Doogee S68 Pro": "https://www.techradar.com/news/this-is-the-best-value-rugged-smartphone-right-now"
  }
}