{
  "source": "https://www.techradar.com/reviews/quickstarter",
  "title": "Inmotion QuickStarter website builder review",
  "category": "computing",
  "updated": "2020-11-03T05:02:11Z",
  "author": "steve-paris",
  "summary": "Get a webpage ready in next to no time just by filling a form",
  "verdict": "An easy, affordable service that produces an elegant webpage for your business. They’re all pretty similar, but they get the job done elegantly.",
  "pros": [
    "Simple and easy-to-use",
    "Fast results",
    "No coding knowledge required",
    "Helpful team available"
  ],
  "cons": [
    "No preview prior to going live",
    "Extras are expensive"
  ],
  "article": [
    "InMotion provides an array of services, like website design and web hosting. If you want to create a website right away, InMotion has a solution: QuickStarter. Unlike other web hosts that expect you to use their templates and platform to create your own site, QuickStarter works by assembling the information for you and designing your site itself.",
    "The concept is simple: many can’t afford the high end services, and a large percentage don’t have the time to design their own site even if they know how to do it, but what if you could get a designer to create a single page for you, custom-made to suit your business, delivered to you within two business days, and all for less than a hundred dollars?",
    "InMotion has a lot of different plans when it comes to web hosting. For example, if you want something specific like Wordpress hosting then there’s a plan called BoldGrid that you can use. But within the QuickStarter, there are two main plans available. QuickStarter is a service that builds your one-page website for you and works differently from the other hosting plans available on InMotion. Here’s a quick summary of both plans:",
    "The QuickStarter plan costs $99.00 and is a one-time fee. You tell a representative what you want, and they will deliver your website to you in two business days. This plan includes a professional business email, the option to drag-and-drop anything that needs to be changed, and several step-by-step instructional guides.",
    "The QuickStarter Plus plan costs a one-time fee of $159.00. It includes the option to add two additional pages (at $99.00 each). You’ll also have automatic website backups, a gallery powered by Instagram, and more SEO tools.",
    "Even though they don’t use a template per-se, the style and layout is immediately recognizable: you start with the first section which is where the business name goes, then the headline. The next section is the welcome text, followed by up to three services your business offers. Then the page ends with contact information and the footer. When you think about it, you need a standardized method in order to provide an affordable service that quickly.",
    "However, there’s enough versatility there for the designer to get creative: they get to choose the font and styles, and the stock photos that will populate your page, which they think will match your service best. If you want to use your own photos and logo, you’ll have to add them yourself once they finish their work.",
    "It’s important to know that QuickStarter is not a managed website. Once the page is created and launched, customers will be responsible for updating it, as well as the WordPress install, and any plugins used. As its name implies, QuickStarter is just there to give you a quick start. The rest is up to you.",
    "QuickStarter’s service does not include a consultation. The online form is all the designers will use to create your page. Updates aren’t included in the $99. They will of course fix any typos, wrong numbers or broken links if you noticed any such errors once they complete your page. If the information you provide during the on-boarding process isn’t accurate, you can change it yourself later on.",
    "You’re obviously free to customize your page if you like, and InMotion’s launch email even includes a link to help you understand how you can alter the page to suit your needs better. Out of the many website builders out there (like Wix, SmugMug, and Squarespace) QuickStarter is one of the easiest to use website builders that will actually help you each step of the way. Of course, you could choose a do-it-yourself approach with a website builder service, and there are dozens to choose from - in fact, we've reviewed a large number of them - but with QuickStarter you have the added benefit of having your website created for you.",
    "For instance, you can replace the stock images for ones more suited to your service, like actual photos of your team, or your offices, for instance. You can insert your logo and make any other alterations you might like. The WordPress layout they offer you is simple enough for those with even basic understanding of web page design to make minor modifications.",
    "Using the service was exactly as we were expecting. Having given them all the information they required in the initial form, our sample site went live less than two working days later. The great news - the page is designed to look great no matter which device you view it from, be it a computer, tablet or phone. If you’re familiar with WordPress, customizing what you paid for is very straightforward. The advantage here though, is that it’s all done for you, leaving you to focus on your business, and letting your site bring in the customers.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Interface",
    "7": "Features",
    "9": "The competition",
    "11": "Final thoughts"
  },
  "links": {
    "website design": "https://www.techradar.com/news/best-web-design-software",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "QuickStarter": "https://partners.inmotionhosting.com/c/221109/260033/4222?subId1=trd-us-1008372258059098900&sharedId=trd-us&u=https%3A%2F%2Fwww.inmotionhosting.com%2Fone-page-website%23qs-example-sites",
    "BoldGrid": "https://partners.inmotionhosting.com/c/221109/260033/4222?subId1=trd-us-2133185500574120400&sharedId=trd-us&u=https%3A%2F%2Fwww.inmotionhosting.com%2Fwordpress-website-builder",
    "QuickStarter plan": "https://partners.inmotionhosting.com/c/221109/260033/4222?subId1=trd-us-3119187295461988400&sharedId=trd-us&u=https%3A%2F%2Fwww.inmotionhosting.com%2Fone-page-website%23qs-example-sites",
    "QuickStarter Plus plan": "https://partners.inmotionhosting.com/c/221109/260033/4222?subId1=trd-us-5687570804622538000&sharedId=trd-us&u=https%3A%2F%2Fwww.inmotionhosting.com%2Fone-page-website%23qs-example-sites",
    "Wix": "https://www.techradar.com/reviews/wix",
    "SmugMug": "https://www.techradar.com/reviews/smugmug-2018",
    "Squarespace": "https://www.techradar.com/reviews/squarespace"
  }
}