{
  "source": "https://www.techradar.com/reviews/huawei-freebuds-pro",
  "title": "Huawei FreeBuds Pro review",
  "category": "audio-visual",
  "updated": "2020-12-11T12:23:53Z",
  "author": "basil-kronfli",
  "summary": "Excellent noise cancellation, but how do they sound?",
  "verdict": "There’s something to be said for a pair of wireless earbuds that nail clear voice calls and offer up cracking active noise cancellation – two areas the FreeBuds Pro win big. So while sound quality and music playback isn’t the absolute best you can get at the Pro’s price, they could still be the right buy for you. That said, it’s a shame Huawei’s companion app, which controls some of the buds’ core functionality is only available for Android.",
  "pros": [
    "Unique styling",
    "Smart on-device controls",
    "Great for voice calls"
  ],
  "cons": [
    "No iOS app support",
    "Fiddly to get out of the case",
    "Good, not class-leading sound"
  ],
  "article": [
    "Huawei’s done it – made the transition from smartphone maker to electronics giant. It’s got laptops covered, speakers checked off, wearables for days, and a small army of earphones.",
    "Having entered the true wireless earbuds market in 2018 with the original FreeBuds, Huawei’s audio offering has been getting steadily better. By the time it launched the FreeBuds 3 it clearly knew exactly what it was doing.",
    "The FreeBuds 3 was the first set of buds to sport active noise cancellation (ANC) with an open-ear fit, and have been our go-to option for calls, thanks to their excellent voice quality and in-call noise-cancelling. Now, they’re getting an upgrade in the FreeBuds Pro, a set of in-ear buds that clearly has the Apple AirPods Pro in its cross-hairs.",
    "Huawei’s first foray into a more premium bud space, the buds combine a new metallic color option with a comprehensive set of on-device controls, cubist design, and stepped noise cancellation.",
    "Never forgetting its roots in phones, calls on Huawei’s FreeBuds Pro are helped along by dual-Bluetooth antennas, and the buds have even been boosted since launch with wireless high-quality recording for vloggers.",
    "So much tech inside such a dinky package. While not cheap, these wireless earbuds undercut the AirPods Pro and the Sony WF-10000XM3’s RRP (though shop around and prices match), and offer a load of smart, compelling features. The real question is, however, how do they sound?",
    "Where the FreeBuds don’t always deliver is in terms of music consistency. The sound profile when ANC is fired up is pretty different from when it’s off. Additionally, while the buds handle loud volumes without distortion, they can get a smidge pitchy and twangy with certain kinds of music. Very good, but not quite best-in-class.",
    "Saying that, the FreeBuds Pro combine amongst the best in-call audio quality we’ve experienced from in-ear wireless buds with very good noise-cancelling smarts. That all marries beautifully with the bud’s smart, intuitive controls which will save you ever having to reach for your phone again to change track or adjust the volume.",
    "For spoken word, movies, and general music listening, the FreeBuds Pro are still a great choice, especially if you prioritize call quality and noise-cancelling above all else (and you don’t have an iPhone).",
    "The Huawei FreeBuds Pro launched in September 2020, and are available in all the markets you can already buy Huawei kit, so Australia and the UK are covered. Unsurprisingly, if you’re reading this in the US, you’re out of luck. You can pick them up for £169 or AU$329 in all three color options – Carbon Black, Ceramic White, and our choice, Silver Frost.",
    "Available through Huawei’s own website, as well as high street stores like Argos and Curry’s through to third-party online sellers including Amazon in the UK, buying options are plentiful.",
    "The first FreeBuds to feature ANC with a closed in-ear fit, the FreeBuds Pro pack a quirky, ‘Cubic Iconic’ design, with an angular stem. The buds’ in-ear components are however curvy, with comfortable silicone earplugs that do a great job of securely sitting in the ear. In the box, you get three tip fittings: small, medium, and large, as well as a USB-C cable.",
    "You can pick up the FreeBuds Pro in Carbon Black, Ceramic White, and Silver Frost – the latter being a unique, standout option that helps set them apart from the rest of the bloated black and white buds on the market.",
    "The curvy oblong charging case has a matte plastic finish in Silver Frost, or a polished finish in Black or White, and sports a metal hinge with the Huawei insignia on it. There’s a USB-C port at the base for charging, though Qi wireless charging is also supported. Open the case up and there’s an awkward fiddle to get the buds out, and handy magnets that help guide them back in.",
    "Huawei generally gets design right, so we’re not shocked that the FreeBuds look great – a solid choice if style is your priority. Their in-ear fit is also decent. While they aren’t as gym-friendly and lock in as tightly as the FreeBuds 3 (which made it through an entire Insanity workout without budging), they still stay put for the most part and are comfortable even when worn for over an hour.",
    "What sets the FreeBuds apart from the pack is just how much you can control without having to touch your phone. Smart interaction thanks to a force sensor on each stem gives you the power to switch between ANC modes with a long squeeze, play or pause with a short squeeze, and skip music tracks with a double squeeze to go forward, triple squeeze to go back. Slide up or down the top part of either FreeBuds Pro stem, and you can also adjust volume – no phone reaching required.",
    "The FreeBuds Pro pack large 11mm ultra-magnetic dynamic drivers and the sound quality impresses on first listen. Podcasts, audiobooks, and movies are clear, well-rounded, and combined with their noise cancellation (which we’ll come onto), make for an immersive listen.",
    "Call quality continues the trend set by the FreeBuds 3 – it’s very good. Three microphones and bone conduction interplay to deliver precise in-call noise cancelling and voice pick-up. Tested in windy conditions and with the din of background traffic, voice quality is great, so if you’re after a set of buds for calls, these should be at the top of your consideration list.",
    "Thanks to the three sizes of ear tips included with the FreeBuds Pro, there’s a good amount of passive noise-cancelling going on. The 40DB ANC also works across three levels, Cozy, General, and Ultra depending on your environment’s ambient noise. You can either switch between these yourself, or leave the buds to make the decisions, with Dynamic noise cancelling.",
    "Everything from washing machines through to car engines is quietened, though coffee grinders are too tall an order. Nevertheless, there’s no two ways about it – the noise cancellation offered by the FreeBuds Pro is excellent and near enough best-in-class at the price.",
    "Huawei’s also created a mechanical sound stabilization system to reduce distortion at high volumes and ramped to the max, the FreeBuds Pro buds deliver decent fidelity, though depending on what you’re listening to, things can get a touch piercing.",
    "While Huawei beats out more affordable competition from OnePlus and OPPO hands-down, when it comes to sound quality, you can get better sound for less if you shop around, especially given the fact Sony’s flagship true wireless earbuds have come down in price since launch.",
    "Huawei’s sound profile varies depending on whether ANC is fired up. When off, it’s relatively neutral, but switched on and it leans towards a more bass-heavy sounding profile. Day-to-day listening is enjoyable on the FreeBuds Pro–- these are good earbuds.",
    "With noise-canceling fired all the way up, music can sound a bit manufactured – bass is boosted and trebles cap out a tad sharper than the best out there. That said, deeper tones are rounded off very well generally. Trick Me by Kelis illustrates what’s good and bad about the buds, with decent bass reproduction enjoyed against occasional pitchy twangs.",
    "Layered music does have decent sound separation and breadth to it, though it just falls short of going all the way when it comes to range. High-pitch and high-volume opera holds onto an enjoyable delicacy though, orchestral music delivers respectable sound separation and spoken word content is clear and rich.",
    "As for battery life, you get a quoted 30 hours with the case, which supports Qi wireless charging – a fair estimation. We were getting six to seven hours of battery life per charge case-free when noise-cancelling was fired up to the max in our week with them. The FreeBuds Pro earbuds charge quickly too – powering up from 0-100% in 23 minutes.",
    "The worst thing about the FreeBuds Pro is the fact that the companion app, AI Life, which unlocks the three degrees of noise-cancelling as well as software updates isn’t available for iOS. While you can pick them up for your iPhone or iPad, therefore — they do pair with them, you’ll be enjoying limited functionality which is not cool."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Huawei FreeBuds Pro price and availability",
    "11": "Design and controls",
    "16": "Audio and noise cancellation",
    "25": "Battery and app support",
    "27": "Don't buy them if..."
  },
  "links": {
    "laptops": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2020",
    "speakers": "https://www.techradar.com/reviews/huawei-sound-x-wireless-speaker",
    "wearables": "https://www.techradar.com/reviews/huawei-watch-gt-2-pro-review",
    "earphones": "https://www.techradar.com/reviews/huawei-freelace-pro",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "FreeBuds 3": "https://www.techradar.com/reviews/huawei-freebuds-3-review",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-10000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}