{
  "source": "https://www.techradar.com/reviews/core-master",
  "title": "Core Master review",
  "category": "appliances",
  "updated": "2020-12-17T16:23:03.318Z",
  "author": "suzanne-baum",
  "summary": "A great product to have at home if you want an all-over body workout to enhance your core",
  "verdict": "The Core Master is a welcome addition to your at-home fitness regime. Like every other ab-centric fitness gadget out there, it promises to be unique and offer a way to work your abdominals unlike anything else. And we have to say, look beyond the marketing hype, and it does in fact provide an intense and thorough workout that ticks all the boxes. The Core Master has a super compact design that's extremely sturdy. It doesn't need any assembly (apart from two handles easily swivelled in to notches), is easy to store, and very simple to use. This is no gimmick – there really is nothing to dislike about it, and the fact you can feel the burn proves it's working.",
  "pros": [
    "Comes ready to use",
    "Good variety of exercises",
    "Classy looking design"
  ],
  "cons": [
    "Needs a sturdy mat",
    "Quite expensive"
  ],
  "article": [
    "The Core Master is a balance board that’s designed for following a group of exercises available on the brand's app and website.",
    "The beautifully engineered product features a black and orange board with a centrally located ball which allows the user to control their body through hundreds of moves that support the core and help work the outer, middle and deep inner muscles. It doesn’t come with a list of exercises – you have to log on to the website or app to be guided through them, but both are super easy to access.",
    "With a choice of three instructors and hundreds of different classes, this product is suitable for all fitness levels and will certainly work you through your paces. Most exercises can be done in a full plank or kneeling plank position, so it's best used on a rubber gym mat to stop you from skidding or your knees hurting.",
    "We liked the fact that each instructor does the exercises alongside you, with a full warm up and cool down. A super seamless exercise product that's the perfect addition to any home gym.",
    "The app is super easy to use and, alongside the website, offers a large choice of exercises and classes with three different instructors. I tried all three and everything ran super smoothly, with no glitches.",
    "The Core Master is priced at £149.95 (about $200 / AU$270) and includes access to the app and website, where you'll find all the exercises and classes.",
    "There are plenty of other abdominal fitness products on the market that are cheaper, but this offers great value for money because it's so hard-wearing and durable, will last a very long time.",
    "The Core Master is a ready-to-go fitness product that, once removed from the box, only needs two handles screwing in place before it's ready to use. If you're used to balance boards and ab machines, it's pretty simple to use and, provided you have a good gym mat, can be taken with you anywhere. The product weighs only 1.5 kilos, and can therefore be moved around easily.",
    "The rubber handle grips provide plenty of hold. Although we preferred to do the classes with the handles attached, you can use the board without them, which provides a much more intense workout as the ball rolls so you need to work your core muscles even harder to keep it in place.",
    "Before you use the Core Master, you’ll need to log on to the website or download the app. Both are very easy to do and provide the same easy-to-access instructions that guide you through the product and offer a large variety of exercises. We found it useful to look through all the different classes the three personal instructors offer to get a sense of their styles and teaching methods. It also meant we were able to thoroughly understand the benefits of how the board works.",
    "The teachers include TV presenter and fitness professional Marvin Ambrosius, PT Honey Fine and Dean Varga, who invented the Core Master. All three teachers are super motivational and as they are working out alongside you, it's easy to perfect your form as each provides very accessible instructions to follow. We liked their teaching style, and the way they count you down the exercises if you need encouragement.",
    "We found it easier to use the phone app than the website, as the exercises require you to be either in a full plank or kneeling plank position, so it's helpful to have the classes at eye-level. From a connectivity point of view, it was a seamless experience. Everything worked to perfection and there were no technical faults.",
    "Classes last between 15 to 30 minutes, and each one takes you through a warm up and warm down (which are very useful if your rarely focus on ab-only exercises). As beginners, we only managed to get through a 15-minute class, but that in itself was intense. We focused on Honey’s class as we liked her enthusiasm, but the other instructors are just as excellent.",
    "We kicked off with a beginner’s class as a way of getting an understanding of the product. The 1o-second blasts of exercise followed by a rest period are really useful, even if you're lacking upper body strength. We were able to maximize each exercise to the full, knowing that each one would be followed by some quick down time.",
    "The exercises include holding on to the handles and letting the ball roll out and in, the whole time using your body in a plank position to manoeuvre the board. It looks a lot easier than it is, and we felt instantly our stomach muscles being forced to work harder than we had used them before.",
    "Many of the exercises required us to try and hold the board still while balancing in a plank position, and the sense of instability and movement the Core Master creates forced us to use our whole core to keep it stable.",
    "There are some techniques you really need to master when moving through the exercises, so we advise taking your time to ensure you are doing them properly to get the benefits of each. It took us some time to get to grips with, for example, the ‘around the world’ exercise that basically requires you to form a high plank and then attempt to tilt the board forwards and around in a circular motion. After a few attempts, we was able to grasp the concept and could certainly feel our forearms and obliques working hard.",
    "All the exercises can be done at a lower intensity if they prove to hard. In one class we had to do a kneeling low plank several times to decrease the gravity and lessen the demand placed on our core. Even so, we could still feel so many muscles working at the same time, making it a great cardiovascular workout.",
    "Learning how to do press-ups on the board was quite tricky as it requires a lot of focus and strength but we can see, as with all exercise, practice will make perfect. The more we did, the greater stamina we had. And the fact our stomach muscles ached the day after each class (we did three a week), is an excellent sign."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "7": "Design and setup",
    "9": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "Core Master": "https://www.thecoremaster.co.uk/",
    "app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8518455101669975000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fcore-master%2Fid1530296426",
    "website": "https://www.thecoremaster.co.uk/exercises"
  }
}