{
  "source": "https://www.techradar.com/reviews/moto-g8-plus-review",
  "title": "Moto G8 Plus review",
  "category": "phones",
  "updated": "2020-08-12T09:54:21Z",
  "author": "siddharth-chauhan",
  "summary": "Moto G8 Plus brings more value to the table",
  "verdict": "The Moto G8 Plus brings more power to the table with a versatile camera system array, stereo speakers, minimal bezels and an efficient battery management system. It's a competent budget device, although it's got a few problems.",
  "pros": [
    "Versatile triple camera system",
    "Stereo speakers",
    "Impressive battery system"
  ],
  "cons": [
    "Average performance",
    "Cameras need further tuning",
    "Can't take wide-angle pictures"
  ],
  "article": [
    "The Moto G8 Plus follows on from the Moto G7 Plus, which arrived just eight months earlier in 2019. The company's popular G-series phones focus on providing the best possible experience at a budget price point, spearheaded by a neat, stock Android interface. They've been among our best cheap phones for a number of years now.",
    "The Moto G8 Plus brings more value to the table with a versatile camera system, stereo speakers, minimal bezel and efficient battery management.",
    "Due to the recent developments in the budget smartphone segment, we're seeing an influx of features trickling down from the high-end phones, and as a result, there's much more to experience with low-cost phones today.",
    "Motorola's latest Plus phone goes forward with the same principle, bringing in a 48MP triple camera setup to the roster and fast charging tech. But is it powerful enough to make a dent in the most populous smartphone segment?",
    "Plus now it's flanked by a full Moto G8 series of devices including the standard phone, the Moto G8 Power and a variety of other phones. So is there reason to go for the Plus?",
    "The Moto G8 Plus release date was October 25 2019, just a day after it was officially announced to the world. The rest of the Moto G8 series was announced in 2020, so the Plus model came much earlier.",
    "The Moto G8 Plus price comes in at £239 / AU$499 (roughly $310). That makes it cheaper than the Moto G7 Plus in the UK, but the same price in Australia.",
    "In terms of US pricing or release information, we don't know right now, but don't hold your breath – the G7 Plus didn't come to the States and there's no clear sign of the Moto G8 Plus landing there either.",
    "Moto G8 Plus has a plastic build and comes in two color options - Cosmic Blue and Crystal Pink. The back panel has a gradient-like glossy finish with the camera modules tucked into the top left corner, and the iconic Motorola batwing logo aligned in the middle.",
    "The logo area doubles up as a fingerprint sensor, which is rather intuitive and unlocks the phone in a jiffy. While in-display fingerprint sensors have started making an appearance on mid-range phones, those applications still aren’t as fast as a traditional fingerprint sensor.",
    "The Moto G8 Plus measures 9.09mm at its thickest and weigh 188g, which is more than the G7 Plus. The right edge houses volume rocker and an unlock button, which is textured for better identification, while the left edge is home to a hybrid SIM card slot.",
    "This means it has a SIM slot, then another slot that can house either a second SIM or a microSD card.",
    "On the top edge, there's a microphone and a 3.5mm headphone jack, which can be used to connect earphones/headphones for people who haven't converted to wireless headphones yet. The bottom edge has a microphone, USB-C port, and a speaker grill.",
    "Motorola claims that the body of the G8 Plus is water repellent, and the company has implemented little rubber gaskets throughout the build of the phone to back that claim up. However, it's still not the same as an IP67/68 rated phone, so anything other than usual splashes of water may do some damage.",
    "A soft protective plastic case is provided in the box for added protection against regular wear and tear, which is useful, especially if you're prone to dropping your phone a lot.",
    "Overall, there's nothing out of the extraordinary about the design of the Moto G8 Plus, and if anything, it's only made more ergonomic with the inclusion of a plastic build instead of a glass-metal sandwich design on the G7 Plus.",
    "The design of the Moto G8 Plus resembles more closely to the company's latest One series handsets with a pinch of good-ol' Moto G goodness.",
    "The Moto G8 Plus has a slightly bigger screen than the G7 Plus at 6.3-inches. It is an IPS LCD panel with a Full HD+ (2280 x 1080 pixels) resolution and a U-shaped notch up top.",
    "The screen has 19:9 aspect ratio, which is decent for watching videos, as they're often in that ratio. The screen is topped with a layer of Panda Glass which is similar to the popular Corning glass solution for protection against drops.",
    "There are narrow bezels on three sides except for the chin area, which has a more distinct black border. There’s a speaker grill just above the notch, which works in tandem with the bottom speaker, making up the phone’s stereo system.",
    "A slightly wider design complements the overall profile of the phone when in hand. Due to the 19:9 aspect ratio, videos resize automatically, but without additional cropping. The screen tilts towards the cooler color spectrum by default, but users can change it according to their preference from the given three options - natural, booster, and saturated.",
    "The display on the phone is suitable for casual viewing and gaming, especially if you’re traveling and are always on-the-go, but we still can't call it the best display as there are FHD+ AMOLED options available at this price point.",
    "Colors are a little dimmer than we'd like, with a max brightness that can be topped by many competing phones, but it's still fine if you're not used to high-quality displays on handsets.",
    "Additionally, the phone has Peek Display and Attentive Display features as part of the more extensive Moto customization suite, which allows notifications and more on the screen when the phone is locked and keeps the screen on while you’re looking at it, respectively."
  ],
  "headers": {
    "5": "Moto G8 Plus price and release date",
    "8": "Design",
    "17": "Display"
  },
  "links": {
    "Moto G7 Plus": "https://www.techradar.com/reviews/moto-g7-plus",
    "best cheap phones": "https://www.techradar.com/news/best-budget-smartphone",
    "Moto G8": "https://www.techradar.com/reviews/moto-g8-review",
    "Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power"
  }
}