{
  "source": "https://www.techradar.com/reviews/audio-technica-ath-anc300tw-review",
  "title": "Audio-Technica ATH-ANC300TW review",
  "category": "reviews",
  "updated": "2020-10-22T00:41:24Z",
  "author": "harry-domanski",
  "summary": "Ace audio quality and ANC in a compact package",
  "verdict": "The ATH-ANC300TW's are more compact and suitable for exercise than Sony’s WF-1000XM3, but don’t quite compete in the battery life or ANC departments. For those looking for a less bass-heavy alternative though, they’re the perfect set of cans.",
  "pros": [
    "Compact, comfortable and stable",
    "Excellent, clear audio",
    "ANC is almost as good as Sony’s"
  ],
  "cons": [
    "Relatively lacking in bass",
    "Case could pack more charge"
  ],
  "article": [
    "Audio-Technica has made somewhat of a name for itself with its studio-grade headphones over the years, but how does the company stack up when it tackles the world of noise-cancelling, true wireless ‘buds?",
    "The short answer is that the ATH-ANC300TW do remarkably well, however they’re not a pair that will suit everyone, especially given that their price pits them directly against the existing market leader.",
    "The ATH-ANC300TW are available now and carry an official price of $229 (£220 / AU$299). If that figure seems familiar, it’s because it’s the same price that Sony is asking for its WF-1000XM3 in-ears, Audio-Technica’s most obvious competition with these buds.",
    "It's worth keeping this mind as we step through this review, along with the fact that both pairs of in-ears see frequent discounts these days, so their relative value is likely to shift with their fluid pricing.",
    "Considering that these are true wireless noise-cancelling earbuds, they manage to be impressively compact. While they’re not the smallest buds around, they are definitely more discreet than the competing Sony ‘buds, and don’t look or feel overly bulky.",
    "The black and grey palette doubles down on this discreet aesthetic and it does look tidy, although it would be nice to see another color option (or two) available for those that want that extra degree of expression.",
    "The ATH-ANC300TW sport little more than the Audio-Technica logo and embossed circles in the way of markings, and the case is similarly minimal with its two-tone black/grey design and low-contrast branding.",
    "Their moderate size and rounded interior helps them sit comfortably and securely in the ear, and with the medium tips fitted we found it took a fairly significant jolt of the head to even feel their presence, let alone raise concerns of them losing their snug fit and falling out.",
    "Included in the box is another three sizes of silicon tips in case the default ones don’t quite fit, as well as a pair of Comply Foam eartips that mold to your ear cavities each time you insert them.",
    "Adding to their comfort, the buttons found on each bud are sensibly located on their top (when in the ear) so you won’t be pressing the units further into your canals when trying to activate any commands. This also means you can adjust or accidentally knock the earbuds without them registering unwanted button presses.",
    "While we’re fans of their design and placement, we would like to see a little more customizability in these buttons. By default, the right-hand button handles playback transport controls while the left manages noise-cancelling and playback volume – flipping this orientation is the only option to alter these controls at the time of writing.",
    "Speaking of noise-cancelling, it’s one of the flagship features of these Audio-Technica in-ears, and deservedly so. We haven’t come across ANC of this caliber in true wireless in-ears outside of the WF-1000XM3, which this pair only narrowly falls behind.",
    "On the buds themselves, you can switch between noise-cancelling or social modes, but you’ll need to dive into Audio-Technica’s Connect app if you want to simply disable ANC without simultaneously enabling the aforementioned ambience-amplifying social mode (dubbed Hear-Through in this case).",
    "In the app, you’ll also find options for three different intensity levels of ambient noise in Hear-Through mode, as well as three different situational algorithms for ANC – Airplane, On The Go, or Office/Study.",
    "We tested the latter two and they worked remarkably well in their respective circumstances, although the difference was certainly nuanced. Understandably, we didn’t get a chance to test out the Airplane ANC option due to the current global circumstances surrounding air travel.",
    "For most users, choosing between either ANC or Hear-Through modes will be sufficient, but it’s a shame the option to have neither enabled isn’t readily accessible outside of the app. What’s more, we found a significant drop in volume (around 20-30%) when neither mode was active.",
    "While the ANC in these Audio-Technica’s is almost on par with Sony’s competition, we did notice it suffered more than its rivals in windy conditions, producing unwanted noise in slight breezes.",
    "Impressively, the ATH-ANC300TW are somewhat rugged when it comes to inclement weather, with an official rating of IPX2 ensuring they can withstand at least “dripping water such as rain and sweat”.",
    "While this obviously doesn’t mean that they’re submergible, it offers more of a promise of protection than having no rating at all, which is the case for a lot of the competition, and makes them considerably more viable as workout and everyday buds than Sony’s WF-1000XM3, for instance.",
    "All things considered, the battery life for these buds could be stronger, but is decent enough. You’ll get 4.5 hours out of the buds themselves – which is fine given their diminutive size and ANC – but the charging case only has an extra 13.5 hours, which we think is too little for its relatively bulky build.",
    "For comparison, both the Jaybird Vista and Sony WF-1000XM3 boast 6 hours battery life in the buds, but the former lacks ANC and the latter has a bulkier design than the other two. The Sony’s charging case, however, offers an extra 18 hours of battery life and is a similar size to that of the Audio-Technica’s.",
    "Compared to most other true wireless buds, the most notably different aspect of the ATH-ANC300TW is their sound signature. While Sony (and many other manufacturers with them) generally opt for a warmer, more bass-forward sound, Audio-Technica is known for its neutrality.",
    "The flat frequency response the brand has always championed is definitely present here. This means that you won’t necessarily be blown away by any music that relies on its low-end to make an impact, and for music lovers who've adjusted to the thumpier sound that most other brands’ produce, this may come across as underwhelming.",
    "Generally speaking however, a more neutral reproduction of the source audio material will actually end up suiting a greater variety of genres than one that’s had certain frequencies enhanced or tailored, so these buds shine if your musical taste is diverse.",
    "The overall clarity and sense of space produced by the buds is impressive as well, despite the tiny drivers (5.8mm) and smaller volume of air that the in-ear form factor entails.",
    "While the merits of different frequency responses in audio products is certainly a matter of taste, it’s one that is often mitigated by the ability to adjust them via an equalizer in the corresponding app. Unfortunately, that isn’t possible for the ATH-ANC300TW.",
    "Hopefully this is something that can be added down the line, because we predict that the ANC300TW’s relative lack of bass when compared to the competition will be a deciding factor for many listeners.",
    "The app does allow you to choose the audio codec that the buds will connect with – either aptX, AAC, SBC or an auto option that simply uses the device’s system default. It also contains options to adjust auto power on, voice prompt, and device locator settings.",
    "It’s also worth mentioning that we found no issue with the Bluetooth 5.0 connection, experiencing no dropouts or stuttering during testing, even in environments that they would otherwise occur in.",
    "The Audio-Technica ATH-ANC300TW offers top-notch noise-cancelling and brilliant audio quality in a compact form factor. When compared with Sony’s flagship competition, they’re a great alternative if you find bass generally overwhelming and are after something a little more suited to exercising.",
    "While the battery life is fine and the noise-cancelling is excellent, neither is quite up to Sony’s standards, and with a retail price to match the WF-1000XM3, we’d recommend hanging out for a discount, but we’re sure you won’t be disappointed either way."
  ],
  "headers": {
    "2": "ATH-ANC300TW price and release date",
    "4": "Design",
    "11": "Features",
    "21": "Performance",
    "29": "Final verdict",
    "31": "Don't buy if..."
  },
  "links": {
    "studio-grade headphones": "https://www.techradar.com/reviews/audio-technica-ath-m50xbt-headphones",
    "WF-1000XM3 in-ears": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Jaybird Vista": "https://www.techradar.com/reviews/jaybird-vista"
  }
}