{
  "source": "https://www.techradar.com/reviews/connectwise-control",
  "title": "ConnectWise Control review",
  "category": "computing",
  "updated": "2020-04-03T15:53:57Z",
  "author": "daniel-blechynden",
  "summary": "In our ConnectWise Control review we uncover powerful remote access software backed by great security",
  "verdict": "ConnectWise Control is a powerful remote access program that enables users to access and control a selection of devices, offer real-time support, and manage team meetings.",
  "pros": [
    "Great security features",
    "Easy setup process"
  ],
  "cons": [
    "Slightly expensive",
    "Performance is an issue"
  ],
  "article": [
    "Gaining remote computer access to a desktop, laptop, or other device can be useful for a range of reasons. Those with remote access can assist with technical troubleshooting, remote management, and the installation and configuration of new software programs.",
    "In this ConnectWise Control review, we’ve uncovered everything you need to know about this program. As one of the best remote desktop software providers available, it offers remote customer support services as well as unattended access and machine management capabilities.",
    "Along with this, ConnectWise Control is backed by industry-standard security features, great customer support, and impressive screen sharing tools. However, its user interface is more than a little confusing to begin with.",
    "ConnectWise Control comes in Support and Access formats. ConnectWise Control Support is designed for technicians and IT staff who need remote access to other devices. On the other hand, ConnectWise Control Access comes with a selection of remote network management tools. All plans come with a seven-day free trial that enables users to test the software before committing to a subscription.",
    "On the one hand, ConnectWise Control Support is available with three subscriptions. A One plan costs $19/month and gives one technician access to the software. With the Standard ($35/month) and Premium ($45 per month) plans, unlimited technicians can be licensed to use simultaneous sessions, the exact number of which depends on the plan. All three plans come with screen sharing, meeting, and remote management features.",
    "On the other hand, ConnectWise Control Access is available from $30 per month. This allows you to connect up to 25 remote devices. More devices can be connected with an additional fee. Note that this plan doesn’t include remote support or meeting features.",
    "ConnectWise Control’s remote desktop connection manager enables users to perform numerous actions. On the most basic end, you can view the screen of one device on another device and provide remote support. More complex issues can be solved with unattended remote access and monitoring.",
    "Along with this, ConnectWise Control Support includes a selection of remote meeting tools. In short, simple screen sharing enables one person to present their computer to a group of connected members.",
    "In addition, you can transfer files between yourself and other connected members. There’s also a range of easily-installable extensions and integrations available to enhance your experience.",
    "Setting up a new ConnectWise Control account is quite straightforward. You can register for a free trial with minimal personal and no payment information. Once you’ve registered, you will be taken directly to a web client.",
    "From here, it’s as simple as creating a ConnectWise session with a unique URL and passcode. The device you want to access will need to navigate to this URL and connect with the provided code. You may be asked to download a desktop or mobile app, depending on your operating system.",
    "To set up a remote access session or meeting you simply need to navigate to the relevant tab on the left of the screen and follow the prompts.",
    "Starting a ConnectWise Control session is quite straightforward, but the user interface certainly isn’t the most intuitive around. One thing that stands out about the web client is its cluttered, text-heavy design. The necessary tools are there, but it can be quite confusing to get started with.",
    "Fortunately, the actual screen share interface is much more beginner-friendly. You will be able to see the device you’re connected to and, depending on permissions, may be able to access it. Additionally, numerous tools, including a chat feature, are available via the icons at the top of the screen.",
    "However, the ConnectWise Control user interface is very slow and laggy. Actions made on the connected device can take seconds to appear on screen, which can be frustrating.",
    "If you decide to use ConnectWise Control, you will benefit from a selection of different security features. All data transfer between devices is protected by AES-256 encryption. And what’s more, the ConnectWise Control application is fully self-hosted, providing full security control.",
    "Additionally, ConnectWise Control offers a selection of different tools to prevent unauthorized logins. These include two-factor authentication, brute-force attack prevention, and session timeout.",
    "If you need help setting up or managing your new remote access, you will benefit from ConnectWise Control’s great support resources. Unlike many small software providers, ConnectWise offers 24/7 live chat support. It is a little slow, but the agents are friendly and knowledgeable. Email ticket submission is also available.",
    "Overall, ConnectWise Control is a solid remote computer access program with a few flaws. Its pricing structure is clear, but with the cheapest plan starting at $19 per month, it’s certainly not the most economical option around.",
    "Fortunately, though, ConnectWise Control provides a range of additional features for remote access, support, and team meetings. However, the web user interface is quite cluttered and considerable lag can be a problem at times. Ultimately, ConnectWise Control’s decent customer support and great security features mean that it gets the thumbs up from us, but be aware of its flaws.",
    "There are numerous great alternatives to ConnectWise Control that are worth considering. For example, TeamViewer is more expensive but offers significantly better performance and a more user-friendly interface.",
    "Remote Utilities for Windows is a great alternative for those looking for a free remote access tool. It comes with a range of premium features and enables the connection of up to 10 devices. Unfortunately, though, it doesn’t work on Mac computers.",
    "Find out more about ConnectWise Control's competitors in our Best remote desktop software guide."
  ],
  "headers": {
    "3": "ConnectWise Control: Plans and pricing",
    "6": "ConnectWise Control: Features and utilities",
    "9": "ConnectWise Control: Setup",
    "12": "ConnectWise Control: Interface and performance",
    "15": "ConnectWise Control: Security",
    "17": "ConnectWise Control: Support",
    "18": "ConnectWise Control: Final verdict",
    "20": "The competition"
  },
  "links": {
    "Remote Utilities for Windows": "https://www.techradar.com/reviews/remote-utilities-for-windows-review",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}