{
  "source": "https://www.techradar.com/reviews/microsoft-visio",
  "title": "Microsoft Visio review",
  "category": "computing",
  "updated": "2020-07-20T15:35:00Z",
  "author": "daniel-blechynden",
  "summary": "Powerful diagramming tools for businesses of all sizes",
  "verdict": "Microsoft Visio isn’t the cheapest visualization software available, but the features it offers are up there with the best in the world.",
  "pros": [
    "Comprehensive template library available",
    "Great integrations with other Microsoft products"
  ],
  "cons": [
    "No live chat or phone support",
    "Prices are on the high side"
  ],
  "article": [
    "Visio is a powerful diagramming and flowchart creation program that’s up there with the most popular in the world. Originally released in 1992, it was bought by Microsoft in 2000 and has been regularly updated in the years since.",
    "Even the most cursory glance shows why Visio is used by business owners and marketers across the world. It offers great tools, comes with a beginner-friendly interface, is affordable, and even includes a 30-day free trial.",
    "Microsoft Visio comes with a range of different pricing options suited to everyone from individual users to large businesses. New users have the choice of two monthly plans, two permanent licences, and a 30-day free trial. There isn’t a free version, but that’s not unusual with software like this.",
    "Monthly subscriptions",
    "Visio’s two monthly subscriptions are both based on a per user model, with a range of useful tools and no lock-in contracts. Visio Plan 1 costs just $5.00 per user per month if you pay annually or $6.00 with monthly payments. It includes access to the Visio web app and 2 GB of OneDrive storage, and allows users to create simple diagrams directly with their internet browser.",
    "Alternatively, signing up for Visio Plan 2 costs $15.00 per user per month ($18.00 with monthly payments) and adds access to the Visio desktop app. It comes with a much wider selection of tools and is a better choice for larger businesses and those who want to create more advanced diagrams and flowcharts.",
    "Permanent licenses",
    "Along with its two monthly subscriptions, Visio offers two permanent licences for those who want to buy the software outright.",
    "Buying a Visio Standard 2019 licence will cost you $280 and provide you access to the program’s basic features. It allows you to work on both your desktop or your touch-enabled device and includes enough tools for most users.",
    "Alternatively, you could go for the pricier Visio Professional 2019, which costs $530. It comes with more advanced features for larger businesses, including powerful collaboration tools.",
    "It’s worth noting that both the Standard and Professional licence are only valid for one computer.",
    "Visio comes with an impressive range of native features that back its reputation as an industry-leading diagramming and flowcharting program.",
    "Professional templates",
    "For starters, Visio allows users to easily create professional flowchart diagrams. You can base your design on any one of a range of powerful templates or start with a blank canvas.",
    "Collaboration tools",
    "Visio’s collaboration tools are up there with the best we’ve seen. They allow team members to work on the same document from different devices, increasing productivity and eliminating the need for third-party messaging apps.",
    "Real-time data connection",
    "Another of our favorite things about Visio is its ability to integrate with real-time data sources. This means that you can set your flowcharts and diagrams to automatically update when new information becomes available. A few of the things you can link to include Microsoft Excel workbooks, SQL Server databases, and Access databases.",
    "Web app",
    "Visio also offers impressive flexibility, with both desktop and web versions available. The web app is a great tool for those who regularly work from different devices, as it doesn’t require a PC-specific licence.",
    "Microsoft 365 integrations",
    "Finally, Microsoft Visio also comes with complete Office 365 integrations, allowing you to easily connect your project to programs like Excel and Word to further streamline workflow processes.",
    "Visio supports desktop and browser-based use. Both interfaces are extremely intuitive and beginner friendly.",
    "The web version is the simplest, but it’s also a great option for those who want to work on the go. It’s very easy to navigate and comes with the core features Visio is known for.",
    "Visio’s desktop app is even more impressive, allowing you to perform advanced actions and create high-quality diagrams at the touch of a button. Its collaboration features are up there with the best, and its integrations with other Microsoft software will help you streamline numerous processes.",
    "Microsoft Visio’s support services certainly aren’t the best, with no live chat or phone help. However, there are a few other options available to users.",
    "For starters, the Visio help center contains a wide range of articles, video tutorials, and how-to guides. It’s a great first choice when you’re having trouble understanding how to do something.",
    "Alternatively, users can also make use of the Visio community forum or reach out to the Microsoft team via an online contact form.",
    "Although Microsoft Visio is a powerful tool for those who need to create top-quality diagrams and visualize workplace processes or data, there are numerous alternatives out there.",
    "For example, Lucidchart is a popular option due to its affordability and the slightly different features it offers.",
    "SimpleDiagrams is also a good alternative to Visio. It’s extremely beginner-friendly and a much more affordable option",
    "Microsoft Visio has developed a reputation as one of the best diagramming and visualization programs in the world, and for good reason. It comes with an impressive range of tools, great collaboration features, four different payment options, and a 30-day free trial.",
    "However, Visio does fall down slightly on the customer service front, and some of its competitors offer significantly cheaper subscription options. All things considered, it’s certainly worth considering Visio as an option if you’re looking for a powerful program to streamline workflow processes."
  ],
  "headers": {
    "2": "Plans and pricing",
    "11": "Features",
    "22": "Interface and in use",
    "25": "Support",
    "28": "The competition",
    "31": "Final verdict"
  },
  "links": {
    "flowchart creation": "https://www.techradar.com/best/best-flowchart-software",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft Excel": "https://www.techradar.com/best/excel-online-courses",
    "visualization programs": "https://www.techradar.com/best/best-data-visualization-tools"
  }
}