{
  "source": "https://www.techradar.com/reviews/aftershokz-openmove",
  "title": "Aftershokz OpenMove review",
  "category": "audio-visual",
  "updated": "2021-11-10T13:55:34Z",
  "author": "cat-ellis",
  "summary": "An affordable bone-conduction headset for a competitive price, but there's a drawback",
  "verdict": "The Aftershokz OpenMove is a great-sounding Bluetooth bone-conduction headset that allows you to work out with music while remaining aware of your environment. It's well priced too, but unfortunately the changes to its design aren't all for the better, and it's less comfortable to wear for long periods than its predecessors.",
  "pros": [
    "Greatly improved sound quality",
    "Effective earplug mode",
    "Affordable price tag"
  ],
  "cons": [
    "Uncomfortable earhook design",
    "Awkward magnetized earpieces"
  ],
  "article": [
    "Some runners like to block out external sounds with a pair of noise-cancelling headphones, but if prefer to be aware of your surroundings, bone conduction headphones is the way to go. As the name implies, these work by using vibrations to transmit sound to your auditory nerve, leaving your ear canals free so you can still hear what’s happening around you.",
    "Aftershokz is the biggest name in bone conduction running headphones, and each iteration of its headsets has been a noticeable improvement on the last in terms of comfort, sound quality, sound leakage (or lack therefore), weight, and battery life – along with an increase in price.",
    "The OpenMove is therefore an interesting proposition: a new entry-level headset that offers the benefits of the company’s more mature technology with a simplified design and a smaller battery.",
    "On the audio front, it’s a winning formula. Despite their modest asking price, the OpenMove sound every bit as good as the premium Aftershokz Aeropex. Unfortunately the new design sacrifices comfort for cleaner lines and less expensive materials. The redesigned ear hooks seem to suffer from uneven weight distribution, which leads to pressure on the left side.",
    "It’s a shame, because the OpenMove would otherwise be a no-brainer – a great-sounding headset that will let you stay aware of your surroundings for safer workouts.",
    "The Aftershokz Openmove were released on September 14 2020. Positioned as an entry-level headset.were priced at $99.95 / £79.95 (about AU$140) at launch.",
    "The Aftershokz OpenMove are similar in style to the company's other bone conduction headphones: two earpieces provide the vibrations, and sit on your temporal bones, just in front of your ears rather than inside them. These are connected by a thin band that hooks over your ears and curves around the back of your head.",
    "The Aftershokz Trekz Titanium (released back in 2017) came with an optional rubber band to secure the headset firmly against your head, but this wasn't really necessary and was abandoned for later releases, including the OpenMove. The headset doesn’t bounce or budge, no matter how much you move.",
    "Whereas the ear hooks of the Aftershokz Trekz Air and Aeropex are flexible metal with a silicone coating, those of the OpenMove are harder polycarbon, with a less curved shape. This gives the headset a more streamlined look, but we found it noticeably less comfortable than earlier designs. We could wear the Aeropex and Air all day quite happily, but after about an hour wearing the OpenMove, we felt discomfort behind our left ear (two members of the TechRadar team reported the same experience).",
    "The OpenMove headset is symmetrical in design, with the only visible difference being the volume buttons and charging socket on one side, and the multi-purpose power button on the other. These weren't the source of the problem, so we suspect that this discomfort might be down to a slightly uneven weight distribution.",
    "Another difference between the OpenMove and other Aftershokz headsets is that its earpieces are equipped with magnets, which cause them to snap together neatly when you remove it. It’s a nice idea that keeps things looking tidy, but smaller wearers may find that the magnets click together when they unhook the headset and rest it around their neck. It’s an uncomfortable thing to happen over your throat.",
    "Aftershokz quotes a battery life of around six hours for the OpenMove (the same as the Air, and two hours less than the Aeropex. In our tests, this seemed to hold true – and is perhaps a modest estimate. A full charge lasted us closer to seven hours.",
    "They are charged via USB-C . This is a welcome change from older headsets’ micro-USB charging, as it means you don’t need to carry separate cables for your phone and headset.",
    "Switching between the Aftershokz Air and OpenMove, the difference in sound quality is noticeable – the OpenMove’s sound is much richer and more detailed.",
    "The OpenMove are supplied with a pair of earplugs so that you can block out the sound of the great outdoors if you wish to. These are quite standard foam plugs, supplied in a neat little carry case to keep them clean, but you could use others if you have a custom or preferred set.",
    "These are best used with the headphones’ earplug mode, which lowers the volume reduces the bass significantly, compensating for the effect of closing your ear canals (sounds transmitted through bone conduction always sound deeper, and with earplugs you’re not hearing any ‘leaking’). Vocal booster mode, on the other hand, boosts the higher frequencies.",
    "Another improvement is the reduction in the tickling vibration that afflicted older Aftershokz headsets. This could be a real problem at high volumes, but is now barely noticeable.",
    "The OpenMove are equipped with Bluetooth 5.0, and we had no issues connecting our phone and maintaining an uninterrupted signal (even near a major railway station where some wireless headphones tend to suffer from Bluetooth interference).",
    "Nevertheless, if you're looking for a set of bone conduction headphones for longer runs and rides, we'd seriously recommend considering the older Trekz Air over the OpenMove. If you’ll mostly be wearing them while running and won’t have the volume cranked too high, the vibration of the older headset is unlikely to be an issue and we've found its softer, more ergonomic design comfortable enough to wear all day long.",
    "First reviewed September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and release date",
    "6": "Design",
    "11": "Battery life",
    "13": "Audio quality",
    "20": "Don't buy it if"
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones",
    "running headphones": "https://www.techradar.com/best/best-running-headphones",
    "Aftershokz Aeropex": "https://www.techradar.com/reviews/aftershokz-aeropex",
    "Aftershokz Trekz Titanium": "https://www.techradar.com/reviews/aftershokz-trekz-titanium-wireless-headphones",
    "Aftershokz Trekz Air": "https://www.techradar.com/reviews/aftershokz-trekz-air-headphones"
  }
}