{
  "source": "https://www.techradar.com/reviews/denticon",
  "title": "Denticon review",
  "category": "computing",
  "updated": "2020-05-12T08:30:37Z",
  "author": "jonas-p-demuro",
  "summary": "A leading cloud-based dental software provider",
  "verdict": "Denticon is a powerful, cloud based dental practice management provider, with tools better suited for larger, multispecialty dental practices.",
  "pros": [
    "Available video webinars",
    "Perio charting through speech",
    "In-house business services team",
    "Advanced macro charting with pick lists"
  ],
  "cons": [
    "No option for chat for support",
    "Lacks mobile apps",
    "Opaque pricing",
    "Windows only"
  ],
  "article": [
    "Denticon is a software as a service (SaaS) from Planet DDS for cloud-based enterprise practice management software in the dental market. It was founded in 2003, and is based in Newport, California. Growth has been strong over the years, with Planet DDS impressively making the Inc. 5000’s list of “America’s Fastest Growing Private Companies.”",
    "Denticon is strong at its clinical approach, showing the benefit of a cloud-based architecture, as it allows for a single patient record, which is dubbed a ‘Concept of one.’ This allows for several providers, across multiple office locations to be able to access the record. This is ideal for multispecialty practices that combine both general dentistry with specialty providers. Access is controlled via security access, and users with a high enough level of access, from within the same browser window can access multiple office locations, without the cumbersome need for a remote login process. Also, the operations team can do updates, such as the fee schedule or updating the participating insurance plans just once, and it will apply to all the locations, rather than having to keep multiple desktop versions of the program updated.",
    "Also, entering data into the patient record electronically is frequently a challenge when chairside due to infection control issues. Denticon fosters this activity by staying a step ahead of the clinician, with appropriate and helpful prompts, and “Context-specific tools and menus,” that ease the process along. Also, for perio measurements that can be difficult to input with the multiple measurements of the gum pockets along all the surfaces of the teeth, Denticon has a ‘Voice-activated perio’ function to capture the data accurately and quickly without slowing down the exam.",
    "Workflow also gets streamlined, for efficiency and less burden on the clinician. Advanced macros can be created for repetitive tasks, such as treatment plans and progress notes. There are also available drop down menus that then provide a ‘Pick list’ to make it easier to input the commonly used fields.",
    "Denticon also incorporates an in-house business services team into the software, and claims to be the only software provider to do so. While it can certainly be done locally if the practice prefers. Denticon includes “Access to an expert team of agents.” This can be used for a variety of tasks, for example, verifying insurance eligibility, entering fee schedules, updating insurance plans and submitting claims.",
    "The first major drawback is that Denticon does not have any mobile apps, for neither iOS, nor the Android platforms. Mobile apps are increasingly popular with users to access data when out of the office, such as for accessing patient records when providing off hours coverage. This lack of apps is particularly surprising given the cloud based architecture.",
    "Another limitation is the choice of browser. While the Denticon minimal system requirements states that “IE (latest), Chrome, Firefox,” as the requirement, some users indicate issues with using anything other than their Chrome browser.",
    "Another system requirement designated is Windows 7 or higher, which leaves out users of Apple computer systems. Also the processor is designated as “Intel i3 or higher,” which while not particularly steep, is somewhat vague, and it should be designated as to what generation of processor, and if that is a mobile or desktop chip.",
    "Other criticisms indicate that Denticon could be easier to use. There are indications that it takes extra button clicks to accomplish some tasks compared to competing solutions. There are also situations where a problem gets submitted, and there is a delay in waiting for the company to call back. Finally, the learning curve for Denticon is indicated by some to be too steep, and take a while to get up and running.",
    "Support for Denticon is offered through a variety of methods. For calls in the US, a toll free number is offered, although the hours and days for support are not specified. Next, an email address, specifically for support is designated, although we caution against sending patient information via this method as email is not considered secure for Protected Health Information (PHI). The final method is via an online portal, which can include other members on the request via the “CC:” field, and it can also include attachments to further clarify the issue.",
    "There are also detailed articles and videos that are listed as the issue is entered into the online portal, which can either be helpful, or annoying as the issue is more specific than the references provided that do not solve the issue.",
    "There is no available option for chat.",
    "There are also webinars available on multiple topics, including “Navigating the Patient Journey Through COVID-19,” and “Making Teledentistry Profitable,” among other timely and relevant topics.",
    "The pricing for Denticon is opaque, with no information found on their website. Rather, company contact is a requisite in order to price out a custom quote.",
    "Elsewhere, we found out that Denticon starts at $300 (£242) per month, with no details as to how many providers or locations this covers, or how much any optional extras may cost.",
    "Denticon provides a powerful cloud-based approach to dental practice software. The varied strengths include the choice of support methods, the incorporated business services, and the included video webinars to get your team up and running in no time. The weaknesses include the opaque pricing model, the lack of mobile apps, and that only the Windows platform is supported. In summary, Denticon represents a powerful solution for dental practice management, that is especially suited for more complex practices with multiple providers across several locations."
  ],
  "headers": {
    "1": "Features",
    "5": "Drawbacks",
    "9": "Support",
    "13": "Pricing",
    "15": "Final verdict"
  },
  "links": {
    "Denticon": "https://www.planetdds.com/",
    "SaaS": "https://www.techradar.com/news/what-is-saas"
  }
}