{
  "source": "https://www.techradar.com/reviews/vpnprivacy",
  "title": "VPNPrivacy review",
  "category": "computing",
  "updated": "2020-12-04T10:05:04Z",
  "author": "sead-fadilpasic",
  "summary": "Severely limited and preposterously expensive",
  "verdict": "VPNPrivacy is just an okay VPN service that provides anonymity online and allows torrenting but is highly inferior to the industry leaders. It doesn’t have any native clients, customers get only one server to connect to, and even its website lacks decent security. Also, hardly any other VPN service is as expensive as this one, with even its annual package costing an arm and a leg.",
  "pros": [
    "Enables torrenting/P2P",
    "Has a weekly subscription option",
    "Industry-standard security"
  ],
  "cons": [
    "Only 1 server location accessible",
    "Ridiculously expensive",
    "Slow",
    "No native clients",
    "Website lacks security certificate",
    "Doesn’t unblock Netflix or BBC iPlayer"
  ],
  "article": [
    "VPNPrivacy is a Canadian- and US-based VPN platform that has been in the business since 2007 and has since grown to offer its services to thousands of customers, including individuals and small and medium businesses.",
    "That said, the first thing you’ll notice about it is the fact that it only offers access to one VPN server location, unlike the competition that typically offers, well, more (in many cases hundreds of server locations with thousands of servers).",
    "This review will show that VPNPrivacy has lots of other disadvantages, despite some rare good sides, so we recommend that you also check out today’s best VPN providers before making any final decisions.",
    "This provider has more pricing plans that we’re used to - as many as five, starting with the 1-week plan at $3.50, billed weekly (which is equal to $14/month). This plan also includes a free trial during the first week, after which it automatically renews under the regular price.",
    "The weekly option is followed by the monthly plan at $10 for the first month, after which the price increases to $15/month. There’s also a 3-month subscription at $9.30/month during the first billing cycle, after which the regular price is $13.33/month. The 6-month package costs $8.67/month during the first term, after which it renews at $12.5/month. Finally, the cheapest is the 1-year option that starts at $8.16/month and renews at a ridiculous $11.67/month, more expensive than almost any other VPN service we’ve encountered.",
    "Regardless of the plan, you’ll be able to fire up this VPN on up to 3 devices at the same time.",
    "Accepted payment methods include credit/debit cards, PayPal, Alipay, WebMoney, UnionPay, Western Union, and others. The provider has a 3-day money-back policy but ONLY in case you can’t connect to your selected VPN server and its tech support confirms the issue.",
    "You can also get yourself a free VPNPrivacy service for one week if you write a review about the platform and publish it on your blog, website, or social media account.",
    "Virtually any more well-known VPN service is a better choice than this one, and this includes the industry leader ExpressVPN, followed by its close competitors NordVPN, CyberGhost, and even the cheap Surfshark, all of which will get you thousands of servers (and not just one like with VPNPrivacy!), user-friendly apps for almost any major platform, and more reasonable rates.",
    "The reason why many people seek a VPN service, to begin with, is to have access to popular streaming services like Netflix or BBC iPlayer, which may not be available in all regions. Unfortunately, VPNPrivacy can’t guarantee you access to such platforms.",
    "VPNPrivacy is a privately owned company located in Canada and founded in 2007. It has offices in Montreal, Canada, and Pennsylvania, US. The website doesn’t seem to have a security certificate which is a bit concerning considering we’re talking about a service that is supposed to offer you privacy and security online. Also, this means you’re entering your credit card details onto an unsecure website, so use caution.",
    "The company has servers in only four locations - in the USA (Louisiana, California), Singapore, Canada (Montreal), and Europe (Luxembourg) and users can choose only one of these locations when purchasing the service.",
    "To protect your privacy and sensitive data when surfing or sharing large files via P2P/torrenting clients (which it openly supports but not on the US servers), VPNPrivacy uses PPTP, SSTP, L2TP, and OpenVPN protocols, along with the classic 256-AES encryption algorithm.",
    "The provider keeps log files on its service for 5 days, after which the logs are deleted from its servers. According to the Terms of Service, these logs “are only used for monitoring server performance, identifying software bugs, identifying any potential security breaches, and for the purpose of identifying abusive users. The log files are not used for monitoring or censoring your internet activities. We respect your privacy. We are not interested in what you do on the internet.”",
    "Although this sounds somewhat convincing, bringing an independent auditor to check whether it is true would be a lot more persuasive. After all, a lot of its competitors have done this already.",
    "This VPN can be enabled and used on Windows, Mac, Android, iOS, and routers. Unfortunately, there are no native apps to make your job easier, so you’ll have to carefully read the manual installation instructions and download third-party software like OpenVPN Connect in some cases, to be able to connect to the one server you’re getting.",
    "If you need any help, assistance is available in the form of an FAQ page on the website but it doesn’t offer a whole lot of details on anything except what to when you can’t connect, how to cancel your subscription, and general information about VPN. If you’d rather talk to someone on the team, you can do so via email or Skype. For any financial questions, you can reach the support at phone numbers for US/Canada and the rest of the world. That said, no one has responded to our email message.",
    "Testing the service at different locations is impossible because you’re only allowed to choose one during the checkout. For the sake of better performance, we picked out the server in Luxembourg, which is not only close to our physical location but also recommended for torrenting.",
    "However, the download speeds were disappointing, to say the least. The Luxembourg server, even though close to us, delivered a pathetic 2.36Mbps on a 70Mbps testing connection. Besides, setting it up was more complex than necessary, with only an email from “VPN Account” in which we got our sign-in credentials and a .pbk file which created an Internet connection for us.",
    "VPNPrivacy may be good enough for some browsing and perhaps even torrenting if you can get the speed (we couldn’t). However, it is overpriced for such basic functionality and doesn’t offer much else. There’s no guaranteed support for geo-blocked streaming services, there’s only a handful of servers available (and you can use only one), and no native clients, which is unacceptable considering the price. If you’re willing to spend that much money on a VPN service, then you should go for the one that truly deserves it, such as ExpressVPN."
  ],
  "headers": {
    "3": "Price",
    "8": "Alternatives",
    "9": "Streaming",
    "10": "About the company",
    "12": "Privacy and encryption",
    "15": "Support",
    "17": "Speed and experience",
    "19": "Verdict"
  },
  "links": {
    "VPNPrivacy": "http://vpnprivacy.services/",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "FAQ page": "http://vpnprivacy.services/faq.html",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-8678742171103669000"
  }
}