{
  "source": "https://www.techradar.com/reviews/msi-prestige-ps341wu",
  "title": "MSI Prestige PS341WU review",
  "category": "computing",
  "updated": "2020-03-09T16:17:34Z",
  "author": "jeremy-laird",
  "summary": "When 4K just doesn't cut it...",
  "verdict": "MSI’s new premium 34-inch PC monitor serves up a sumptuous 5K2K experience, HDR support and USB-C, but pairs it with dubious build quality.",
  "pros": [
    "Glorious 5K2K resolution",
    "Superb Nano IPS panel",
    "Great feature set"
  ],
  "cons": [
    "Patchy build quality",
    "Mediocre HDR performance",
    "Expensive"
  ],
  "article": [
    "Looking for a monitor that’s a cut above the 4K norm? The new MSI Prestige PS341WU could be the panel for you. Its main claim to fame? The huge 5K2K native resolution from a luscious 34-inch IPS screen.",
    "That’s 5,120 by 2,160 pixels and fully three million more than a standard 4K or UHD monitor. Packed into a 34-inch 21:9 ultrawide display, the upshot is a pixel density of 163DPI. For reference, the likes of a 38-inch ultrawide with 3,840 by 1,600 pixels, such as the Asus Designo Curve MX38VC, works out to just 109DPI.",
    "Admittedly, the MSI Prestige PS341WU still comes up short compared to, say, Apple Retina displays for its Mac computers, which generally clock in above 200DPI. But compared to the vast majority of PC monitors, this is a high DPI display.",
    "Of course, you’ll pay for that privilege. You’re looking at around $1,210 (£929, around AU$1,800) to get in on that 5K2K action.",
    "However, the MSI Prestige PS341WU isn’t just about pixel counts. It sports a Nano IPS panel from master LCD maker LG. The upshot is high fidelity image quality. MSI claims 98% coverage of the demanding DCI-P3 color gamut, plus 100 per cent coverage of sRGB.",
    "Both are available as presets in the comprehensive OSD, along with Adobe RGB. It’s also good for 1,200:1 static contrast, which is a cut above the IPS norm.",
    "Adding further to its content creation capabilities, not to mention all-round image quality prowess, is HDR support. The MSI Prestige PS341WU comes with VESA DisplayHDR 600 certification. It achieves that with fairly rudimentary 12-zone local dimming and typical brightness of 450cd/m2 (peak brightness is 600cd/m2).",
    "So this arguably isn’t a true HDR display. But it will process an HDR signal and display the correct colors with HDR content, which is very useful from a content creation perspective.",
    "Rounding out the feature set, the MSI Prestige PS341WU offers comprehensive connectivity, including HDMI, DisplayPort and USB Type-C with charging. We can confirm it is possible to drive the MSI Prestige PS341WU at the full 5,120 by 2,160 resolution at 60Hz over the USB-C connection.",
    "You will, of course, need a PC or laptop that supports DisplayPort 1.4 over USB-C alternate mode to achieve that. Note that the HDMI interface is limited to 3,840 by 2,160 at 60Hz.",
    "As for the MSI Prestige PS341WU’s actual image quality, it’s superb. The colors absolutely pop, the contrast is fantastic, the viewing angles are about as good as they get. This is one glorious looking panel straight out of the box at default settings.",
    "If you’re looking for downsides, well, they mostly involve build quality and the subjectives of style.",
    "The chassis feels cheap and plasticky, while the white aesthetic, including details like the MSI badge on the rear of the enclosure, is dubious. Overall, the style MSI Prestige PS341WU feels like a confused combination of gaming and professional cues.",
    "It doesn’t detract from the panel quality. But at this price point, you have every right to expect quality and consistency in every department."
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Don't buy it if..."
  },
  "links": {
    "Asus Designo Curve MX38VC": "https://www.techradar.com/reviews/asus-designo-curve-mx38vc"
  }
}