{
  "source": "https://www.techradar.com/reviews/rha-trueconnect",
  "title": "RHA TrueConnect review",
  "category": "audio-visual",
  "updated": "2020-02-26T11:17:00Z",
  "author": "lewis-leong",
  "summary": "One of the best true wireless headphones",
  "verdict": "The RHA TrueConnect are still one of the best true wireless headphones you can buy thanks to their stellar sound, reliable connection, and build quality. While they lack nice-to-have features of other true wireless headphones, the RHA TrueConnect’s core experience is one of the best.",
  "pros": [
    "Balanced, detailed sound",
    "Excellent build quality",
    "Reliable connection"
  ],
  "cons": [
    "Fingerprint magnet",
    "Mushy buttons",
    "No app to tailor sound"
  ],
  "article": [
    "Back in 2018, the Jabra Elite 65t earbuds owned the top of our best true wireless earbuds list for months, but they met their match with the RHA TrueConnect – and while both models have been well and truly eclipsed by the Sony WF-1000XM3, the RHA True Connect are still worth a look.",
    "We loved the Jabra for its long battery life, comfort, and ambient noise mode but RHA wowed us with the TrueConnect's superior sound quality, more reliable connection, and an even more comfortable fit.",
    "The RHA TrueConnect is the company’s first foray into the true wireless headphone market but the brand has created an instant win.",
    "All said, if you’re shopping for a pair of true wireless headphones, the $170 (£150, about AU$265) RHA TrueConnect should be on your list of models to check out.",
    "The RHA TrueConnect feature an understated design with its matte-black-everything approach. The earbuds and case are coated in a soft touch rubber coating, making them feel warm to the touch against our ears.",
    "Similar to the Apple AirPods, the TrueConnect feature stems that jut out from the bottom of each bud.",
    "All of the headphone’s controls are activated via the single button on each earbud. You can control play/pause from either side, but only the left controls music playback while the right handles volume.",
    "You double click the right earbud to increase volume one step and a triple press lowers it. This control scheme isn’t very intuitive when you first use the headphones but we got used to it quickly.",
    "The case of the TrueConnects features a unique swivel design that reveals the earbuds when pushed back. It’s a little annoying not being able to tell which way the case swivels since the design is symmetrical but that’s hardly a deal breaker.",
    "The case itself is extremely well built with an aluminum cover that’s PVD coated black. We found that the PVD coating began wearing off slightly on the edges after a couple months of use and, because the case body is covered in the same matte black soft-touch rubber as the earbuds, it attracts fingerprints really easily.",
    "You’ll find a single USB-C charging port on the bottom of the case, which means the earbuds top off more quickly than headphones using the outdated microUSB port.",
    "After a couple months of testing, we came away extremely impressed by the wireless strength of the RHA TrueConnect.",
    "The headphones connected with our phone and to each other every single time we took them out of the case and we rarely experienced an audio dropout.",
    "We also didn’t experience any of the lip sync issues common with true wireless earbuds like the Bose SoundSport Wireless.",
    "The Jabra Elite 65t headphones are also reliable but there were several times we had to reset the headphones because the stopped pairing to each other.",
    "Not only were they reliable, but the RHA TrueConnect also impressed with its sound quality. There was no hiss when music wasn't playing, which is an issue common with true wireless headphones and, tonally speaking, they had a great balance.",
    "Bass is deep without being overbearing, mids are lush with nice texture, and highs are exciting without sounding sibilant. The overall tonality of the TrueConnect is warm, but pleasant to listen to for hours at a time.",
    "Even better, you’ll be able to listen to the RHA TrueConnect for hours as the earbuds last 5 hours on a charge and the battery case provides another 20 hours for a combined playtime of 25 hours.",
    "This easily matches the Jabra Elite 65t’s earbud battery life and bests its charging case capacity, and with USB-C quick charging, the RHA TrueConnect can be a pair of headphones you rely on.",
    "Although the TrueConnect is RHA”s first true wireless headphone, the company showed they did their research and development by making it one of the best true wireless headphones on the market today.",
    "The combination of sound quality, battery life, and wireless reliability means these are a pair of headphones you can rely on everyday.",
    "The Jabra Elite 65t set the standard for what true wireless headphones should be and, regardless of what RHA has done here with the TrueConnect, they’re still great headphones.",
    "Compared to the RHA TrueConnect, the Jabra set has more features with its useful ambient noise mode to help with situational awareness and an app that lets you tailor sound.",
    "The TrueConnect headphones don't have either of those features but we didn’t miss them, thanks to better sound quality and wireless reliability. The RHA also feels more like a premium product than the all-plastic Jabra.",
    "This means the RHA TrueConnect should be at the top of your list if you’re looking for a pair of true wireless headphones that won’t break the bank.",
    "RHA may have kept us waiting for its first true wireless headphone, but it was worth the wait."
  ],
  "headers": {
    "4": "Design",
    "11": "Performance",
    "19": "Verdict"
  },
  "links": {
    "Jabra Elite 65t": "https://www.techradar.com/reviews/jabra-elite-65t-true-wireless-earbuds",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Bose SoundSport Wireless": "https://www.techradar.com/reviews/bose-soundsport-free-true-wireless-earbuds-review"
  }
}