{
  "source": "https://www.techradar.com/reviews/amwell",
  "title": "Amwell review",
  "category": "computing",
  "updated": "2020-02-12T19:00:34Z",
  "author": "jonas-p-demuro",
  "summary": "Online doctor visits with your tablet, computer or smartphone",
  "verdict": "While we appreciate Amwell’s upfront pricing, the user reviews give us pause in signing up.",
  "pros": [
    "Transparent pricing",
    "Covered by many insurance providers",
    "Choice of available support options",
    "Mobile app support"
  ],
  "cons": [
    "Poor user reviews for more complex conditions",
    "Billing issues",
    "Video visits required for prescriptions"
  ],
  "article": [
    "Amwell, a subsidiary of American Well, a privately held firm, is a Boston, Massachusetts based virtual medical provider that offers urgent care visits across all 50 states. It works via computers, and has offered its services over mobile apps since 2013. This company goes back to 2006, when it was founded by brothers Drs. Ido and Roy Schoenberg. Originally, the services were provided directly to subscribers of specific insurance companies, and this subsequently transitioned to direct to consumer offerings.",
    "Amwell certainly makes it simple to access medical care, anywhere, and whenever you need it. Providers are available on a 24/7 basis, literally every day of the year. Also, this makes appointments a thing of the past, as well as wasting time sitting in the waiting room with the other sick patients. Additionally, be assured that the doctors used on their panel are all board certified to ensure the highest care.",
    "The process to receive care is fairly simple. It begins with starting an account, and information is saved for future use. Next, you get to choose a physician, from a list of doctors that are available, and you get to see their experience and rating to make an informed choice among the providers. Finally, the visit gets conducted over the internet. This can be done either through a web interface on a computer, or through a mobile app, and either way it provides secure, streaming video.",
    "Mobile apps are available for both the iOS and Android platforms, which can be used on both smartphones and tablets. Also, for times this is not convenient, the visit can be done over a traditional telephone voice call (although keep in mind that many states require a video visit, and not just a phone call for the physician to prescribe). Speaking of prescriptions, if one is needed after your virtual visit, your physician can send it via ePrescribe to the pharmacy of your choice, along with any over the counter medication recommendations for your condition.",
    "User reviews for Amwell give insight into a mixed bag of medical care received. For some users, in general those with the simpler conditions such as a basic upper respiratory infection, the visit was satisfactory, without further incident.",
    "However, user complaints and dissatisfaction seem to focus on two areas. The first would be with more complex medical issues. For example, there was a user with a pink eye, which the Amwell doctor diagnosed as viral in origin, that subsequently was seen in an Emergency Department for bacterial conjunctivitis, which antibiotics were prescribed for. In another case, a patient was diagnosed through Amwell with an upper respiratory infection, and was later diagnosed with bacterial sinusitis. While we fully acknowledge that both conditions may have simply progressed from the original issue, it does raise the issue if these patients were better off receiving more hands on medical care at the outset.",
    "The other area where complaints clustered is in inaccurate billing. Clients of Amwell indicate in some cases they were billed twice, or their insurance provider was not billed at all for the service, and they incurred the full charge. Also concerning, when they tried to rectify the charges, in some cases it could be corrected, but users complained that the reversal of the charges was not immediate, and they were waiting for the overcharges to be returned.",
    "Amwell acknowledges that many patients have all sorts of questions after their visit with their provider, just as in traditional visits, where patients call the office for additional interactions, and seek to address concerns.",
    "Amwell offers three methods of support. The first is a comprehensive FAQ, with answers to questions like “Can I add my spouse to my account?,” “Will my primary care provider be notified about my visit on Amwell?,” and “Is my online doctor visit private and secure?” (in case you are wondering, the short answers, in order, are no, optionally and yes). The other options for support are an email address, and a toll free number that can be called 24/7 rounding out a full range of choices for assistance.",
    "Unlike most of their competition, Amwell is quite upfront with their pricing, including the cash prices for a variety of their popular services. It starts with an urgent care visit, for common conditions such as a headache, or a sinus infection, and this costs a reasonable $69 (£53). There is also pricing for mental health services, such as a therapy session with a licensed professional, which costs $85 (£65) for a therapist with a master’s degree, and $99 (£76) if they have a PhD. Finally, a psychiatrist costs $199 (£153) for the initial assessment, with follow up visits running $95 (£73).",
    "Another useful feature is that while the above prices are the full, cash cost, Amwell also is covered by many insurance providers, to make this even more affordable. It is stated that these visits are covered for “Over 80 million people,” and a list is provided of the insurance plans that Amwell works with, including many Blue Cross Blue Shield plans, Highmark, and United Healthcare, among others.",
    "Amwell is an approachable entry into the telemedicine space. The highs include the upfront costs, the relationship to participate in many healthcare plans, and the available mobile apps. The lows to be mentioned are the inaccurate billing practices, and that patients had to turn to other providers for management of their more complicated illnesses. In the end, balance these factors out, and decide if Amwell is well suited for your health needs."
  ],
  "headers": {
    "1": "Features",
    "4": "Drawbacks",
    "7": "Support",
    "9": "Pricing",
    "11": "Final verdict"
  },
  "links": {
    "Amwell": "https://amwell.com/cm/"
  }
}