{
  "source": "https://www.techradar.com/reviews/arsys",
  "title": "Arsys review",
  "category": "computing",
  "updated": "2020-10-13T13:34:05Z",
  "author": "mike-williams",
  "summary": "Great bang for your buck from a well-established hosting company",
  "verdict": "Arsys offers a decent array of features and attractive prices, especially for Spanish speakers.",
  "pros": [
    "Cheap",
    "Free domain included",
    "Decent performance"
  ],
  "cons": [
    "Not completely translated",
    "Hidden fees",
    "Website building costs extra"
  ],
  "article": [
    "Arsys is a Spain-based web hosting provider that’s been in the business since 1996 and was the pioneer in the development of the first European Cloud Hosting platform. The company has been operating as a subsidiary of United Internet AG since 2013. They offer a wide selection of hosting services like shared hosting, WordPress hosting, VPS, and others - all for pretty low prices.",
    "According to United Internet AG, Arsys is “among the most innovative and leading companies in the technology sector in Europe.” The company has a main computer centre, commissioned in 2009, sprawling over an area of 6,000 m², a sixth of which is server space. All of this uses the “latest innovations in Green IT,” which in reality means they have reduced their energy consumption by 20% since the implementation of these measures as part of their commitment to the environment.",
    "The team is made up of over 300 people, 36% of which is customer service, claiming to resolve more than 2,700 queries a day, received through “various media,” according to the website. The company is a leader in the Spanish market, with more than 266,000 clients and more than 1.5 million active services.",
    "When it comes to Arsys, one of the biggest advantages is the pricing.",
    "The prices, which include a free domain for a year, unlimited data transfer, and a 30-day money back guarantee start from €3 per month for its Professional Hosting plan (but the prices do increase on renewal after a year). However, adding services like an email antivirus filter or a Domain Protection service, even SSL, are all free for a while (usually between three months and a year), but add a significant sum to your invoice later.",
    "Arsys accepts card payments and bank transfers, although they recommend the former. There is no PayPal or cryptocurrency support.",
    "Creating an account is relatively straightforward, and if you haven’t done so before purchasing a plan, you will be prompted to fill in your details after you’ve chosen your plan. If you need to register a new domain, Arsys offers you this feature for free for the first year (don’t forget to check how much it’s going to cost you in the future through your Client Area later). Interestingly, with the cheapest plan, you can untick the box which gives you an SSL certificate - because once the free year is over, it’s going to cost you an additional €29 per year. You’ll also have to switch from Spanish to English several times, and even then, not every part of the website is translated to English (but you can still derive the meaning from the context if necessary).",
    "A website builder is included in a specific plan, as is WordPress, so be prepared to build your website by hand if you don’t pay for either of those. The cheapest plan also has a basic WebFTP access point in the Control Panel, so uploading your website is pretty straightforward.",
    "Arsys also has a sandbox testing environment for your website, which can help when you’re looking to update it by hand without taking it down. What it does is create a sandbox folder with a copy of your all website’s data, allowing you to test changes without immediately having them go live. However, enabling this option also goes towards your total hosting plan space usage, which should be kept in mind, especially if you’ve gone with the cheapest plan.",
    "When it comes to loading speed, Arsys receives mixed reviews. Its main website is slightly slow to fully load (8.6 seconds, when the average is 8), but it takes significantly fewer requests than average (38 for Arsys, 88 is average).",
    "According to a blog post by the company, Arsys has received a Tier III certification from the Uptime Institute, which allows for some downtime, mostly when it comes to maintenance. In other words, they allow no more than 1.6 hours of downtime per year. Our test, which lasted two weeks, was not able to determine otherwise - their main website recorded no downtimes during this period.",
    "Arsys has no support forum whatsoever. In fact, the only way to contact them is through email (although they do promise they’re available 24/7, 365 days a year). They do, however, have a number of email addresses you can try, depending on the type of problem you’re experiencing. The contact form also tells you to use the Client Area if you already have an account, as apparently it can “help with the most common queries,” but once there, you’ll still only find a contact form, as well as any previous tickets you may have submitted. But if you’re desperate for help, you can choose to have customer support phone you and tackle your problem that way.",
    "Price-wise, Bluehost and Arsys are pretty close, but the former’s servers are located in North America, while the latter is in Europe, so it mostly comes down to a geographical difference. However, Bluehost also offers a customer support forum and video guides, both of which would make a world of difference for Arsys too.",
    "The similarities between Arsys and Aruba are obvious: both are European, both are cheap, and neither has an excellent customer service approach. However, Arsys includes a domain in the initial price (although renewing it will cost you once the first year is over), while Aruba adds the domain cost (depending on the choice) to their advertised price.",
    "Hostgator is another viable alternative to Arsys, also beating it in the customer support section because it offers a 24/7 live chat. Hostgator also has a cPanel, which can be more intuitive to use, especially compared to Arsys’ basic Control Panel / Client Area.",
    "Hetzner is significantly more popular among users than Arsys, but it’s also more expensive, especially since it includes a once-off setup fee (that gets more expensive the cheaper your plan is, so it levels out any price advantage, at least initially). Generally speaking, almost everything Hetzner’s basic plans get you, you can get at Arsys for cheaper.",
    "Arsys is a decent solution for anyone looking for a budget hosting provider, but may pose some issues with the incomplete translation and lack of customer support live chat, as well as the hidden costs lurking beneath the surface. If any of those issues make you turn away, both Bluehost and Hostgator are viable alternatives."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Ease of use",
    "9": "Speed and experience",
    "11": "Support",
    "12": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "Arsys": "https://www.arsys.net/hosting",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Cloud Hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Aruba": "https://www.techradar.com/reviews/aruba",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Hetzner": "https://www.techradar.com/reviews/hetzner-online"
  }
}