{
  "source": "https://www.techradar.com/reviews/tefal-perfectmix-tritan-blender-bl82ad40-review",
  "title": "Tefal PerfectMix+ Tritan blender (BL82AD40) review",
  "category": "appliances",
  "updated": "2021-05-25T11:14:34Z",
  "author": "emily-peck",
  "summary": "A powerful blender that gets straight to the task in hand",
  "verdict": "With its ergonomic Powerlix blade that is up to 30% faster than previous models, Tefal’s BL82AD40 PerfectMix+ Tritan blender will save you time in the kitchen.",
  "pros": [
    "Silky smoothies",
    "Alerts you when locked and ready to use",
    "Lightweight 2-litre Tritan jar"
  ],
  "cons": [
    "Noisy",
    "Basic features",
    "No heat mode"
  ],
  "article": [
    "Tefal was founded over 60 years ago and while the brand is probably best known for its range of tried and trusted non-stick cookware, it also produces a large selection of small kitchen appliances. It also prides itself on having invented the first cordless iron. The company’s countertop collection features pressure cookers, healthy fryers, grills, food processors, and blenders – both hand and stand blenders – including the PerfectMix+ Tritan BL82AD40.",
    "As the latest blender design to join the Tefal portfolio, the PerfectMix+ Tritan BL82AD40 claims to last up to two times longer and 30% faster than previous models. Want to know if it's worthy of a place among the best blenders? Read on for our full review here.",
    "Launched in January 2020, the Tefal PerfectMix+ Tritan can currently be found for around £119 / $148 / AUS $240 at both Argos and Amazon.",
    "This price is around £50 more than Tefal’s previous model – the Perfect Mix+ - which is similar, but you’re paying more for the updated design and the new jug made from unbreakable Tritan. Tefal also stocks the Blendforce II glass blender, which you can pick up for a very reasonable £52.50 / $ 68 / AU $ 102, although its offering isn’t half as ample as that of the Tefal Perfect Mix+ Tritan.",
    "The USPs for the Tefal Perfect Mix+ Tritan include its light and resistant unbreakable Tritan jar and its titanium Powelix Life blade technology, which lets you blend up to 30% faster than previous models and lasts up to twice as long.",
    "On first inspection, the stainless steel gold-tinted titanium coated blades stand out for their impressive design. They are set at the perfect cutting angle to slice through ingredients and pulverise foods to a velvety finish, and they certainly look razor sharp. We couldn’t help feel a little intimidated when it came to washing up the jar – although you can make use of its ‘auto clean’ mode and there are dishwasher safe parts, you will need to take a little care if you’re set to hand clean the bowl yourself or indeed want to dry it off after use.",
    "The promise that the 2-litre Tritan jug is breakproof, even if you drop it on the floor, is impressive, so we thought we’d give it a try. With eyes winced, we held it two feet from a ceramic kitchen floor and dropped the jug. Much to our satisfaction it didn’t smash, crack or scuff. Result!",
    "The jug is also very light to hold compared to other blender jugs we have tested, especially those made from glass. The Tritan finish is resistant to odours and stains, which - no matter how varied the ingredients you include - makes it easier to keep clean and fresh.",
    "This is a point you’d mostly appreciate if you are keen to use the blender to liquidize warm soups – and the jug is built for both hot and cold liquids, which is a bonus. It also comes with a removable opening at the top of the lid, which is good for when you want to insert ingredients between blending as it means you don’t have to take the complete lid off.",
    "An added extra is the spatula you can use to decant your blends into a glass, but we couldn’t help feel that a little inspiration manual included in the box, which could have provided recipe inspiration, wouldn’t go a miss.",
    "In terms of aesthetics, the Tefal Perfect Mix+ Tritan is on the sleek side and has a fuss-free and modern finish. The variable speed dial that enables you to speed up or slow down the blend, and a jug spout that doesn’t drip too much when you pour, are both good design qualities.",
    "With razor-sharp Powelix Life blades, 1200 watts of power and speeds of up to 28,000rpm, the Tefal Perfect Mix+ Tritan doesn’t scrimp on power, making it a time-saving purchase.",
    "But these features combined does make it a rather noisy machine to use. When we used it to make a banana, avocado and spinach smoothie with the dedicated ‘Smoothie’ button, we were pleased with how quickly the spinach combined with the other ingredients – ice included - to produce a very smooth finish.",
    "We recorded the sound levels using a decibel meter app and - at an average of 104 decibels - it did come out as one of the noisiest blenders we’ve tested. As well as the preset smoothie button, the Perfect Mix+ Tritan has an ‘ice crushing’ setting and this was particularly effective at creating a satisfying ‘snow’ for a cocktail, without melting quickly.",
    "The blender beeps to alert you when the lid is locked in place, which is a useful design feature as it avoids you having to faff around trying to lock it in place and turn it on only to realise you haven’t set it up correctly.",
    "The Tefal Perfect Mix+ Tritan has all the basics you would need to make velvety smoothies, lump-free pancakes and liquidize hot soups. It is quite noisy, but if you’re looking for power over peace and quiet, it is worth your consideration."
  ],
  "headers": {
    "2": "Price and availability",
    "4": "Design",
    "11": "Performance",
    "15": "Verdict"
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders"
  }
}