{
  "source": "https://www.techradar.com/reviews/wally-personal-finance",
  "title": "Wally personal finance review",
  "category": "computing",
  "updated": "2020-09-29T10:35:52Z",
  "author": "rob-clymo",
  "summary": "Make your money work smarter with Wally",
  "verdict": "We love Wally for the same reasons everyone else does thanks to its intuitive interface and powerful iOS-friendly feature set, which you can use for free.",
  "pros": [
    "Free to use",
    "Looks a treat",
    "Super intuitive"
  ],
  "cons": [
    "iOS only",
    "In-app purchases"
  ],
  "article": [
    "Wally might have one of the most unusual software monikers out there but this funky personal finance app is smarter than you might think. Available for iOS, it's already enjoying a sizeable following and has garnered lots of praise in the media too.",
    "That’s hardly surprising as it’s a great way to keep on top of your finances, especially if you’re on the go and even more so with the arrival of coronavirus. Wally can turn its hand to tracking all of your accounts and payments, it’ll sync with them all for good measure and on top of that Wally is available in 70 countries. Wally is compatible with 15,000 banks and can handle 60 different currencies too. Little wonder then that it’s become a bit of a hit with iOS users.",
    "Other similar personal finance packages include Mint, You Need a Budget (YNAB), AceMoneyLite, Money Dashboard or Moneydance.",
    "Even though Wally packs a high-quality veneer it’s actually free, although does offer in app purchases as a means to keeping itself looking good and expanding its range of features. So, if you’re in the market for Wally Gold then this optional subscription-based edition of the app comes with much more functionality.",
    "It currently comes in various pricing editions, including the Wally Gold with Trial Annual edition for $24.99 a year or $1.99 a month and includes many more advanced tools and functions designed to help you manage your money even more efficiently.",
    "If you think you’ll be a long-time user then Wally Gold Lifetime costs $39.99. There are various other in-app purchase options, including Custom budgets for $5.99 and Multiple Currencies for $7.99. You can essentially factor in these add-ons when and if you actually need them.",
    "Although Wally is billed as a personal finance app it's actually multi-faceted and the functionality it has on-board means it can be used by all sort of people. While it's great for families and households, along with individuals, Wally is also a practical solution for workers or employees who have to keep an eye on their spending.",
    "That's why the Wally Gold subscription edition is an option worth thinking about as there are more advanced tools on offer, including the likes of advanced budgeting, currency conversion, the ability to handle foreign accounts and the ability to work with unlimited teams.",
    "However, even in its basic guise, Wally comes with the options of managing accounts, joint and individual, automatic syncing, budget sharing and boasts lots of reminders, lists, note-taking and comments tools.",
    "Wally has quite a lot of features that’ll mean you get to put it through its paces, such as setting up and managing budgets, on-the-go updates of your financial picture and the ability to scan and upload bills, receipts and warranties. You can even start and manage groups, with lots of different monetary interests gathered together in one place.",
    "Considering all of that, Wally seems more than able to handle the workload. For a finance-focused app you’ll be glad to know that Wally has been engineered to be both secure and private. It’s got end-to-end encryption, is PCI compliant as well as being able to work with around 15,000 banks globally.",
    "If you’re familiar with iOS and the way that works then Wally is merely a continuation of that user-friendly environment. Although it comes with lots of features and functions, finding your way around its various menus is a doddle. Even more supposedly complex tasks, such as syncing with your bank can be set up and completed in mere moments.",
    "Adding to the appeal is the way that the app works dynamically, meaning that you should get bang-up-to-date views of all your financial data, which means no nasty surprises later on down the line. If you’re running your finances close to the wire on a regular basis then that’s reassuring to say the least.",
    "Even though there’s not much obvious support available from Wally the app is so straightforward to use that it seems unlikely you’ll encounter too many issues. Even syncing to bank accounts seems to be reasonably easy. There is a chat-bot style option within the website though.",
    "Wally is a great little app that lets you manage all of your accounts, sync with your banks and track all of your spending, all within the confines of one very neat and tidy interface.",
    "You’ll want to upgrade to Wally Gold if you need more power tools, but that in itself is pretty good value. However, even in its most basic incarnation Wally is a really practical solution for people who need a little bit of assistance with their spending.",
    "And, even if you're super organized, there’s no denying that its dynamic performance doesn't prove handy, especially if you’re in the habit of going dangerously near overdraft territory towards the end of the month."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "11": "Ease of use",
    "13": "Support",
    "14": "Final verdict"
  },
  "links": {
    "Wally": "https://www.wally.me",
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "accounts": "https://www.techradar.com/best/accounting-software-small-business",
    "payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "AceMoneyLite": "https://www.techradar.com/reviews/acemoney-lite",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance",
    "spending": "https://www.techradar.com/best/best-personal-finance-software"
  }
}