{
  "source": "https://www.techradar.com/reviews/splashtop-review",
  "title": "Splashtop review",
  "category": "computing",
  "updated": "2021-01-05T08:12:34Z",
  "author": "daniel-blechynden",
  "summary": "In our Splashtop review, we analyze one of the world’s most popular remote access programs",
  "verdict": "Splashtop is a powerful remote desktop access program backed by a range of features. It comes in four highly-specialized forms, with options for everyone from company IT managers to teachers.",
  "pros": [
    "Highly specialized plans",
    "Seven-day free trial"
  ],
  "cons": [
    "No free forever plan",
    "Not all features are available on all devices"
  ],
  "article": [
    "In this Splashtop review, we’ve analyzed some of the best remote desktop software available. Splashtop offers a range of remote access solutions for everyone from business IT managers to support teams and personal users.",
    "Additionally, Splashtop easily enables users to connect numerous devices with different operating systems. Windows, Mac, Android, iOS, and more are supported, and all versions are backed by powerful security features. Finally, its worldwide server infrastructure and reliable network mean you can be confident in its long-term performance.",
    "Splashtop offers a selection of plans aimed at users with different needs. For starters, Splashtop Business Access enables computer access from anywhere. Prices range from $60 to $99 per user per year. Meanwhile, Splashtop Remote Support starts at $299 per year for 25 computers. It basically enables unattended remote access to a specified number of Mac and Windows computers by an unlimited number of licensed technicians.",
    "Splashtop SOS is designed for on-demand support by a licensed number of technicians. It starts at $199 per technician per year, and more expensive plans include unattended remote computer access. Finally, Splashtop Education costs $29.99 per teacher per year and includes screen share tools designed for educational settings. All plans come with a seven-day free trial.",
    "Splashtop provides highly targeted remote access solutions that come with their own specific features. However, there are a few global features that are worth mentioning. These include a simple interface and the ability to remotely access a client’s computer without them having to install any software.",
    "At the same time, Splashtop enables you to access and manage unattended computers from any device with its intuitive app. You can connect numerous unattended computers to ensure you always have access to important information.",
    "Splashtop also comes with a selection of additional features that vary according to the plan you’re using. For example, all subscriptions come with file transfer tools. Session recording is available where applicable, and support packages include a built-in chat module.",
    "New users can trial Splashtop’s software for seven days without providing payment information. Getting started involves signing up for a new account, providing a few personal details, and installing the required apps on the devices you plan to use.",
    "Once you’ve created your account, you will be guided through a straightforward setup process, which will vary according to the plan you use. We trialed the Remote Support plan, which involved installing the Splashtop app on the device we wanted to connect from. A streamer package then needed to be downloaded onto the devices we wanted to access. This done, the devices could be connected at the click of a button.",
    "We tested Splashtop by connecting to a Windows computer from an Android smartphone. Overall, the user interface is simple and intuitive, but don’t expect any fancy features.You can screen share and access different devices remotely, and both the desktop and smartphone apps are attractive and work well. It’s important to note that your exact user interface will depend on the subscription you’re using. Different devices also use slightly different interfaces, as to be expected.",
    "Overall, Splashtop performs well. We tested it with an approximately 50 Mbps internet connection and in general, the software was fast and responsive. At times, there was a small lag (less than one second) with the screen share features, but mouse tracking and clicks registered almost instantaneously. The file transfer feature was also fast and efficient.",
    "Splashtop’s software is backed by a selection of powerful security integrations. For example, its cloud services are hosted on Amazon Web Services, a platform secured by firewalls, encryption, DDoS protection, and more. Similarly, intrusion detection and defense mechanisms are in place to provide an extra layer of protection.",
    "All devices used with Splashtop must be authenticated and two-factor protection is available. All data transfers are backed by 256-bit AES encryption and TLS. Technicians can also remotely blank the screen of a connected device, securing sensitive information.",
    "Splashtop provides online ticket submission and chat support for all users. Staff are friendly and knowledgeable, but wait times can be lengthy. Fortunately, you will also have access to a large, beginner-friendly knowledge base containing a wealth of information. Guides and how-to articles are cleverly categorized by category and the built-in search engine works well. A community forum is also available for more complex questions.",
    "Overall, Splashtop is a powerful remote desktop connection manager backed by highly targeted plans and great security. New users will benefit from a seven-day trial with the software package of their choice, but payments are only available on an annual basis.",
    "Splashtop is a great choice for those without much tech experience. It’s easy to set up and the user interface is responsive and beginner-friendly. The software also comes with some great extra features, powerful security on all levels, and a detailed knowledge base.",
    "Although Splashtop is a great remote desktop access and screen sharing tool, there are numerous competitors that should be considered. For example, TeamViewer offers a huge selection of additional management tools such as a built-in meeting tab and IoT device control—but it is a little expensive. Meanwhile, Remote Access for Windows is a great free alternative, but it can only be used with Windows devices.",
    "Find out about the best alternatives to Splashtop in our guide to the Best remote desktop software."
  ],
  "headers": {
    "2": "Splashtop: Plans and pricing",
    "4": "Splashtop: Features and utilities",
    "7": "Splashtop: Setup",
    "9": "Splashtop: Interface and performance",
    "11": "Splashtop: Security",
    "13": "Splashtop: Support",
    "14": "Splashtop: Final verdict",
    "16": "The competition"
  },
  "links": {
    "best remote desktop": "https://www.techradar.com/news/best-remote-desktop-software",
    "TeamViewer": "https://www.techradar.com/reviews/teamviewer",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}