{
  "source": "https://www.techradar.com/reviews/benq-tk850-4k-projector-review",
  "title": "BenQ TK850 4K projector review",
  "category": "audio-visual",
  "updated": "2020-03-12T17:14:17.524Z",
  "author": "henry-st-leger",
  "summary": "The BenQ TK850 is a seriously bright HDR projector",
  "verdict": "The BenQ TK850 is a stunning example of a 4K HDR projector with the brightness to do its picture justice. You’ll have to make do without many smart features but, if that’s not an issue, you should have little reason not to enjoy what the TK850 offers.",
  "pros": [
    "So, so bright",
    "Excellent HDR",
    "Sports Mode"
  ],
  "cons": [
    "No streaming apps",
    "No Dolby Vision or HDR10+",
    "Minimal video noise"
  ],
  "article": [
    "The BenQ TK850 is a 4K projector for your living room, with boosted audio, intense 3,000 lumens brightness, and a focus on sports broadcasts to help it stand out from the piles of other projectors out there.",
    "It’s not the first BenQ projector that’s caught our eye: we gave a glowing review to the BenQ HT3550 last year, even if that model is more angled towards die-hard cinephiles than the TK850.",
    "So is the BenQ TK850 worth a look? We set it up and put it through its paces to see how it fared.",
    "The Ben TK850 retails at $1,699 in the US, which converts to around £1,300 / AU$2,600. The projector has just launched in the UK, and can be found on eBuyer for just over £1,340.",
    "Even before you’ve turned on the projector, the TK850 is pretty easy on the eyes. It features soft, rounded edges in a largely white design, all of which helps to prevent this rather bulky (13cm x 38cm x 26cm) piece of hardware from dominating the room – that’s one of the perks of not opting for a television set, after all.",
    "The ports are all at the rear, meaning they’ll likely be facing the viewer, which is much simpler for navigating connections and linking up the right cables during use. You’ll find two HDMI 2.0 inputs, which means you can have two sources connected at one time (an Xbox One and a 4K Blu-ray player, say). There are also ports for SPDIF, audio out, RS232, and USB 3.0, with a 12V trigger to automatically turn on the projector when a live device is connected.",
    "On the upper side of the projector you’ll find buttons for power and the D-pad, as well as ‘OK’, ‘Back’, ‘Menu’, and ‘Source’. There are also LED indicators for the power, lamp, and temperature (in case a long viewing session causes the projector to overheat).",
    "The remote is brilliantly made, even if it doesn’t look particularly flashy. Its simple two-tone silver coloring is great for visibility in the dark, thanks to its reflective finish. The pinkish backlight is also great at illuminating buttons from underneath, and there’s a button for turning this light on and off too.",
    "The TK850 projector does seem to get slightly warm at times, even on standby, so we recommend unplugging it completely when it’s not in use for long periods.",
    "Given the BenQ TK850 is only a short-throw projector – rather than the kind of ultra short-throw model you can push right up against a wall – you’re going to need to have it somewhat out in the open. We placed it on a coffee table, but any surface in your living room from where it can face the wall square-on will do the job.",
    "The TK850 isn’t a miracle worker, of course. You’ll need to have it at a height conducive to projecting the whole image onto the wall, however large you decide to set the display. There are overhead mounts for these things, though we found a waist-level table was high enough to get the picture at eye level. The 10-degree vertical lens shift – basically, that’s how much you can angle the projector up or down without distorting the image – helps in this regard too.",
    "You may not want the projector much in view during use, but keep in mind that viewers can end up blocking projection from behind you, depending on where the projector is positioned.",
    "There are a few things on the projector that you’ll need to adjust manually during setup, before you get onto the software part (in addition to removing the lens cap, naturally).",
    "The first is for the zooming and focus functions, which you adjust from above – there’s a small hatch covering these moving parts, though it slides open automatically if the projector is even slightly tilted.",
    "When the projector is on, simply pull back the small hatch on the upper side of the projector, and adjust the lens left and right to zoom to adjust the size of the picture – up to a maximum size of 100 inches at 8.2 feet away – and then push it forward or backwards to bring the image into focus. You can then use the ‘lens shift’ wheel to elevate or lower the image; all in all it’s a simple and intuitive process then enables you to achieve the perfect picture.",
    "There’s also a manual elevation stand at the lower-front edge of the TK850. Simply push in the clasp above the front foot, and pull the foot down to adjust the projector to whatever height is required.",
    "The auto-keystone feature can be a little overzealous, and we had to spend a good few minutes correcting the keystoning ourselves in the menu settings. (The response time when doing this manually is very slow, too.)",
    "There’s not much in the way of a smart platform here, which is both a good and a bad thing. It’s good because there’s little to get in the way of the action, as you only have to contend with a single menu that shows up over the projection. The bad news is that there aren’t any built-in apps such as Netflix or YouTube, and you’ll need a physical source such as a games console, set-top box, or 4K Blu-ray player to watch… well, anything.",
    "Simply plug in your source via USB or HDMI, hit the power button on either the projector or remote, and away you go!",
    "The most notable thing about the BenQ TK850 is its brightness. At 3,000 lumens – substantially more than the 2,000 lumens of the BenQ HT3550 – it can project an exceedingly bright picture, meaning we could watch movies comfortably even with a moderate amount of light in the room.",
    "You’ll still get an optimum picture in a really dark environment, though you won’t be overly punished for wanting a lamp on to see the furniture (or your loved ones) too.",
    "That light has big consequences for HDR viewing in particular. High dynamic range offers enhanced contrast and richer colors than standard SDR (standard dynamic range), and the powerful bulb in the TK850 means that HDR makes a startling difference.",
    "When watching 2015’s The Martian, we found that switching on HDR gave it the appearance of an entirely different movie. Flat desert browns became intense, textured colors on the red planet, while even the small and easily-missed flashing of blue lights in the midst of a howling gray storm came through brilliantly clearly. This is a projector that does HDR right – while still having the chops to make SDR look good on its own terms.",
    "HDR gaming is a real sight, too. The Witcher III was recreated on our Xbox One X in vivid detail, with excellent contrast that helped the game’s environments to truly stand out. Lag seemed minimal too.",
    "You won’t get Dolby Vision or HDR10+ here – or on any projector – but the standard HDR format still offers dividends on the TK850. There’s support for HLG and even 3D video (for some reason) too.",
    "The BenQ TK850 projector is marketed as a device for watching sports programmes, though – so how does it fare there? We flicked between some football and rugby matches, and found the motion handling very capable – while the upped contrast of the dedicated Sports mode helped players to show up against the green of the pitch behind them, as well as giving the audio a slight boost to better hear the roar of the crowd.",
    "It’s worth using the projector’s dedicated Cinema or Sports settings for whatever content you’re watching – with a Bright mode for (you guessed it) bright environments, or a Living Room setting for more everyday use. You can also create a custom User picture mode for your own personal requirements.",
    "There is some slight video noise that appears, whatever source we used, from low-res YouTube videos to sparkling 4K Blu-rays – but the impact is small, and hard to avoid on a projector that can’t avoid shining through every pixel of the video it’s showing. This projector is generally better at showing deep colors and bright scenes, and worse at showing shadows or distinguishing between gray tones.",
    "The audio isn’t slight, for what it is – and will certainly cover the sound of the TK850’s fans whirring away – though if you want more than 10W speakers you may want to plug in a separate soundbar or hi-fi setup too.",
    "The BenQ TK850 is a stunning example of a 4K HDR projector with the brightness to do its picture justice. You’ll have to make do without many smart features but, if that’s not an issue, you should have little reason not to enjoy what the TK850 offers.",
    "HDR, particularly, is exceptional – while the manual zooming, lens shift, and focus tools mean you’ll be able to calibrate your projector precisely for the needs and dimensions of your living room."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "9": "Setup and software",
    "19": "Performance",
    "29": "Verdict"
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "projector": "https://www.techradar.com/best/4k-projector",
    "BenQ HT3550": "https://www.techradar.com/reviews/benq-ht3550-4k-hdr-projector",
    "eBuyer": "https://track.webgains.com/click.html?wgcampaignid=162949&wgprogramid=267255&clickref=trd-us-3435051631073783000&wgtarget=https%3A%2F%2Fwww.ebuyer.com%2F959595-benq-tk850-dlp-data-projector-9h-jlh77-37e"
  }
}