{
  "source": "https://www.techradar.com/reviews/cat-s62-pro-rugged-smartphone",
  "title": "Cat S62 Pro Rugged Smartphone review",
  "category": "phones",
  "updated": "2020-08-19T15:42:31Z",
  "author": "mark-pickavance",
  "summary": "A new Cat flagship with thermal vision",
  "verdict": "This device offers an excellent user experience and has features that could be especially useful in some sectors. The only caveats are a relatively low-resolution camera for a flagship design and the curious lack of wireless charging.",
  "pros": [
    "Built to last",
    "Android 10",
    "Thermal imaging",
    "128GB storage"
  ],
  "cons": [
    "12MP rear camera",
    "No wireless charging"
  ],
  "article": [
    "Made under licence by the UK-based Bullitt Group, the new Cat S62 Pro replaces the excellent S61 as the flagship rugged phone with Caterpillar branding.",
    "With a high-end price tag but an attractive specification, is the S62 Pro the go-anywhere communications device that the world of construction desperately needs?",
    "Picking up the S62 Pro for the first time it feels substantial, although at just 248g it is surprisingly light.",
    "Instead of rubber bumpers on the corners, the designers of this device went with a metal band that encompasses all four sides that divide the glass front face from the rubberised rear. Visible countersunk bolt heads are a stylish reminder that this equipment was built to handle more abuse than most, and a textured surface on the back helps you avoid dropping it anyway.",
    "But what many owners of this device will soon appreciate is that it is tough, but without the design trying to emulate a piece of farm machinery.",
    "The buttons, for example, are the standard power and volume controls on the right, and a user programable extra button on the left.",
    "Our only reservation about this placement is that in the S62 Pro the power button is at the top and volume buttons at the bottom, the reverse of how they are on the Cat S42 that we recently reviewed. Bullitt designers need to decide their preference and stick to it.",
    "The bottom edge has a centrally mounted Type-C port that manages to be water-resistant without the need for an annoying rubber plug, and in the middle of the back is a fingerprint sensor.",
    "As with many phones that use that location for the fingerprint sensor, that has forced the rear camera to the top left, and oddly on this design, the camera and Lepton sensor is housed in a raised projection so that the phone doesn’t lay flat when placed down.",
    "There is probably a particularly good reason the camera sticks out like this, but it tends to ruin the sleek styling of the S62 Pro for those who like the elegance of Samsung and Apple designs.",
    "Rugged phones are often either all functionality with no concept of style or vice versa, but the S62 Pro is a balanced blend of modest styling and reliable construction.",
    "The specification of this phone is in part excellent and yet mildly disappointing at the same time.",
    "Where it’s all thumbs-up from us in in the choice of the eight-core Qualcomm Snapdragon 660, a monster SoC (system-on-chip) that in this configuration comes with the Adreno 512 GPU, 6GB of RAM and a whopping 128GB of flash storage.",
    "Those parts combine to make the S62 Pro a powerful platform that can handle the installation of many apps and run them with ruthless efficiency.",
    "And, the screen isn’t the highest resolution we’ve seen, but a resolution of 1080 x 2160 and IPS technology make this a bright and well-saturated input device.",
    "Where it doesn’t strike-a-pose is in respect of the rear camera, which at just 12MP isn’t close to the resolution that the flagship designs by UleFone, Blackview or Doogee. Many of the competition devices are using the Sony IMX230 rear sensor, and others have other extreme options up to 64MP.",
    "That said, the 12MP sensor on this phone did take some particularly useful images the HDR mode produced some impressive results. Megapixels aren’t everything, and the camera can record 4K video recording, even if the screen can’t play that back pixel-for-pixel.",
    "More of an issue is the battery capacity, as the 4000mAh isn’t large by rugged phone standards, and this isn’t a design that allows for the battery to be replaced.",
    "This capacity limits the general use recharging cycle at a maximum of two days, and if you use the processing power and special features of this design, it might be reduced even more.",
    "The S61 that this phone partly replaces has a laser-assisted distance measure inbuilt, and sadly that feature isn’t included in the S62 Pro. But another S61 feature is included; the thermal imaging system.",
    "It is a Lepton 3.5 professional-grade camera that can generate 1440 x 1080 HD output with VividIR, uses an MSX linear overlay from the visible light camera and can differential a thermal scope from -20°C to 400°C.",
    "This sensor is superior to the FLIR Lepton 2.5 that was previously used on the Cat S61, and also on the UleFone Armor 9 and Blackview BV9800 Pro. The Lepton 3.5 has four times the number of thermal pixels as the 2.5 sensor, and the technology is further enhanced with the MyFLIR™ Pro app installed and the inclusion of VividIR™ image processing.",
    "In use, you can get numeric averages for the scene or pick out specific highlights with a numeric value of that spot. This one feature could be incredibly useful for those working with electronic fault finding, automotive issues or attempting to track water heating services.",
    "But, in 2020, this also has the potential to check the body temperature of an employee.",
    "To be clear, while a sensor like the one on this phone could be useful for detecting elevated body temperature associated with Covid-19, Bullitt themselves say, “This is a preliminary screening tool, not a medical diagnostic instrument. Thermal imaging sensor should not be used as a substitute for a medically certified thermometer.”",
    "But, the ability to provide a quick means to check temperature has taken on an increased significance in the current global pandemic.",
    "Compared with the much cheaper Cat S42, the Cat S62 Pro blitzes all these tests and delivers some excellent scores overall.",
    "The highlights of its performance parade are the 3DMark Slingshot results, revealing a phone that doesn’t make these presentations a slide show. And, the Androbench numbers reveals that the flash memory in the S62 Pro is of high quality and performs well.",
    "For comparison, the Passmark for the Blackview BV9800 Pro is only 4,698, and the performance of the S62 Pro is much closer to the Samsung Galaxy S10e and Sony Xperia XZ1 Compact.",
    "It is outperformed by the Doogee S90 on Passmark and HWBot, but not 3DMark.",
    "These scores place the S62 Pro in a category of the better performers in the rugged phone market, but not the fastest in all categories.",
    "The products that directly compete with the Cat S62 Pro are mostly made by Chinese companies. These include the Blackview BV9800 Pro, UleFone Armor 9 and Doogee S88Pro.",
    "The Blackview BV9800 Pro sports a lower quality FLIR Lepton (2.5) thermal imaging sensor but has 48MP+5MP Rear and 16MP Front Cameras, a larger battery, bigger screen and wireless charging all for $499.99. But, the OS on that phone is Android 9.",
    "A similar design to the BV9800 is the UleFone Armor 9. It also has the older Lepton 2.5 thermal sensor, a 64MB rear camera, more battery capacity, the excellent Helio P90 core, options for an endoscope and 8GB of RAM. This impressively specified device costs $549.99 and comes with Android 10 pre-installed.",
    "Our final alternative is the new design from Doogee. The S88Pro has a whopping 10000nAh battery, Helio P70 Octa-Core Processor, a Sony rear camera with a 21MP +8MP +8MP arrangement and wireless charging. Doogee is asking only $249.99 for this Android 10 phone, even if it doesn’t include any thermal imaging.",
    "By comparison, the Cat S62 Pro looks a little overpriced, but the Bullitt Group offers aftersales customer service in over 50 countries worldwide, and that’s significantly better than what any Chinese phone brand is providing.",
    "There are lots of things to admire in the Cat S62 Pro, as it lives up to the professional billing in a good number of useful ways.",
    "It’s easy to use, packed full of features, delivers excellent performance, can take some abuse and keep functioning.",
    "Beyond the features you might see elsewhere, the FLIR thermal imaging works amazingly well, considering the small size of the sensor.",
    "And, it’s Android 10 out of the box, with an assurance from Bullitt that it will be upgraded to Android 11 when that is available.",
    "The more we used this phone, the better it seemed to get and the more useful we found it.",
    "If it has a problem, it’s the price, which is more money than would be signed off without some discussion in most companies.",
    "For businesses where staying connected is essential and the environment is unforgiving, making a justification for this device might be less problematic.",
    "Individuals might be more difficult to convince, as it is more than the Blackview BV9800 Pro, and UleFone Armor 9, both of which also have thermal imaging.",
    "We’d contest that the Cat S62 Pro has superior construction, even if both of those competitor devices have better cameras and greater battery capacities.",
    "What tips the balance back towards the S62 Pro is that it will receive Android 11, and security updates for at least three years. A level of commitment you’re unlikely to see from Asian phone makers."
  ],
  "headers": {
    "2": "Design",
    "11": "Hardware",
    "26": "Performance and in use",
    "31": "Competition",
    "36": "Final verdict"
  },
  "links": {
    "Cat S42": "https://www.techradar.com/reviews/cat-s42-rugged-smartphone",
    "Blackview BV9800 Pro": "https://www.techradar.com/reviews/blackview-bv9800-pro-rugged-smartphone",
    "Doogee S90": "https://www.techradar.com/reviews/doogee-s90-rugged-smartphone"
  }
}