{
  "source": "https://www.techradar.com/reviews/usaip",
  "title": "USAIP VPN review",
  "category": "computing",
  "updated": "2020-11-10T19:11:08Z",
  "author": "sead-fadilpasic",
  "summary": "Just doesn’t work",
  "verdict": "If you could get it to work, USAIP would probably be a solid VPN service, with support for Netflix and BBC iPlayer, as well as some excellent security mechanisms. But chances are, you won’t be able to run it and the customer support doesn’t even seem to exist anymore.",
  "pros": [
    "N/A"
  ],
  "cons": [
    "Doesn’t work",
    "No native clients"
  ],
  "article": [
    "USAIP may look a bit obsolete, especially when you look at its website, and the truth is, it is. We may never know for sure because it wouldn’t run on our devices but since the website has no setup instructions for platforms beyond Windows 8 or Android 4, it seems like the support ended sometime after those operating systems came out.",
    "If you want an actual working VPN, literally any solution from our best VPN buyers guide would be fine.",
    "On its website, USAIP lists four options you’d have at your disposal if you wanted to spend money on something like this. The options differ depending on the subscription length, with the shortest one lasting only one day and costing $1.49. Users are also given a choice to purchase one week of the VPN service for $3.99, while one month would have cost you $7.99. If you rather would’ve gone for the 1-year subscription, you would’ve needed to pay $74.99 (equal to $6.25/month). We’ve certainly witnessed more expensive VPN providers but many more that are cheaper and actually working.",
    "Customers were able (and still are, it seems!) to make their purchases using a wide array of methods, including credit/debit cards, PayPal, Skrill Payza, AlertPay, Perfect Money, WebMoney, and more (no cryptocurrencies though).",
    "There’s no clear money-back guarantee, although the website does state “you may request a refund at any time while your subscription is active” if you’re unsatisfied with the service. The refund request has to be sent by email. Since we’re still to receive a response from the support concerning their non-working platform, we highly doubt you’d get your refund if you made the mistake of paying.",
    "The website states that you can get a feel of this service before making a definite commitment by trying it out for free with some limitations. For instance, the free trial doesn’t (didn’t?) offer access to all of USAIP’s servers (only 11 instead of 35), your speed would’ve been throttled, and you wouldn’t be able to use it for sending emails. However, the free trial doesn’t seem to work at all and the customer service is not responding to our emails.",
    "Since USAIP is a non-working VPN service, you should consider purchasing a tried-and-tested platform such as NordVPN, Surfshark, or CyberGhost, all of which are great VPN vendors, but if you truly want the best solution money can buy, then you should look no further than ExpressVPN.",
    "USAIP claims that it is able to provide for its customers the access to popular streaming services that otherwise might not be available in their regions, including Netflix, Hulu, BBC iPlayer, and many more. However, since we couldn’t get it to work, we may never know.",
    "Signing up for an account with this provider would’ve gotten you access to 35 VPN locations/servers in 20 countries around the world, in places such as Pakistan, China, Russia, Estonia, Luxembourg, USA, and more, but this is of no use as none of the servers work.",
    "USAIP claims it can help you use public WiFi hotspots without fear of your personal information being stolen as well as retain total anonymity online, thanks to the use of the high-grade 2048bit encryption, along with OpenVPN, PPTP, SSTP, and L2TP protocols.",
    "It isn’t clear whether it supports sharing of large files via P2P/torrenting clients, and this is only mentioned once, in its Terms of Service, where it states that it may limit your use of the services in case of a “copyright infringement (via p2p, bittorrent or otherwise)”. So it seems that torrenting, while not strictly forbidden, isn’t a recommended activity, either.",
    "The provider’s privacy policy states it “does not hold any personal information on our customers that could result in compromising their privacy and security.” However, it also says that it discloses personal information if it is required to do so by law or to “comply with legal process, respond to any netiquette claims, or protect the rights, property or personal safety of USAIP.EU, our customers, or the public.” Your information may also be shared with third-party agents who provide services for USAIP’s internal business operations. That said, this only refers to the information collected on the website, such as when signing up for an account. It says nothing about collecting logs when you actually use its VPN.",
    "USAIP doesn’t have any native clients but it claims it can be used on Windows, Mac, Linux, iOS devices, and routers (we beg to differ). Detailed setup guides and configuration files for all of them are available on the website. The website also contains a list of error codes you may encounter, along with their solutions, but they’re not very helpful, at least not in our case(s) - multiple error codes, most of which aren’t even addressed by the website.",
    "If the website isn’t helpful in addressing your issues or questions, you may contact the provider’s customer support directly using email, WLive, ICQ, Yahoo messenger, and even a telephone line that is active Monday-Friday, between 9 am - 5 pm GMT, but don’t hope for a response through any of those - we didn’t get one.",
    "Although the provider doesn’t have any native apps, we had no problems installing it as it had provided its VPN autoconnect app and a VPN dialer file. However, we couldn’t get any of them to actually connect to a server.",
    "Regardless of how many chances we gave it, USAIP just wouldn’t work on any of our devices, and customer support seemed to ignore our emails. This is sad because, if it worked, it would’ve been a really good VPN, with support for Netflix and BBC iPlayer.",
    "That said, there are plenty of other fish in the sea that provide not just working, but flawless VPN service, such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "12": "Support",
    "14": "Speed and experience",
    "15": "Verdict"
  },
  "links": {
    "USAIP": "https://www.usaip.eu/en/index.php",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "email": "mailto:info@usaip.eu",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-3643277313619947000"
  }
}