{
  "source": "https://www.techradar.com/reviews/acer-aspire-3-a317-32-c20m",
  "title": "Acer Aspire 3 A317-32-C20M review",
  "category": "computing",
  "updated": "2020-08-12T10:33:31Z",
  "author": "jeremy-laird",
  "summary": "The new Acer Aspire 3 gives you a very big LCD panel for a relatively puny price",
  "verdict": "Acer’s new 17-inch Aspire 3 gives you a very big LCD panel on a very tight budget, but the price is weak CPU performance and disappointing screen quality.",
  "pros": [
    "Huge laptop for the money",
    "Plenty of RAM",
    "Decent storage performance"
  ],
  "cons": [
    "Celeron CPU is pretty woeful",
    "Screen quality disappoints",
    "Bezels are big and ugly"
  ],
  "article": [
    "Do not adjust your screen. Yes, that is the thick end of three-quarters of an inch of bezel all the way around the edges of the new Acer Aspire 3’s 17-inch LCD display. It’s as if the slim-bezel bandwagon sailed straight on by Acer’s latest affordable laptop.",
    "Is that necessarily a problem? This is a 17-inch model, so portability clearly isn’t the primary concern. What’s more, with the Acer Aspire 3’s budget pricing, perhaps it’s better the limited funds went on functionality rather than frills.",
    "So what exactly do you get for your not-a-lot of money? Physically, a whole lot of laptop with a 17-inch LCD panel that clocks in at 1,600 by 900 pixels (and thus not full 1080p HD). The screen panel itself is also TN where IPS technology has become virtually standard, even on cheaper devices. The result is a distinct lack of contrast and brightness, not to mention poor viewing angles.",
    "Next up is the Intel Celeron N4000 processor. In CPU terms, this is pretty much at the bottom of Intel’s pile. It uses low power Atom cores, rather than full fat Core, er, cores. What’s more, there are just two of them, they don’t support Hyperthreading and they clock in at just 1.1GHz with burst speeds up to 2.6GHz. They’re about as low performing as modern PC processors get.",
    "There’s better news elsewhere in the form of 8GB of DDR4 RAM, plus a 128GB SSD and 1TB HDD. So the storage and memory side of the equation is actually pretty decent. Ditto the Intel UHD 600 graphics. Be clear, this is no gaming device. But it does offer hardware H.264 and H.265 decode support. The weak CPU is therefore no impediment to video streaming. It’ll even stream 4K content effortlessly, though the screen obviously can’t resolve that many pixels.",
    "For connectivity, Acer provides AC Wi-FI, Bluetooth 4.2 and gigabit ethernet. There’s also HDMI, two USB 2.0 ports and a single USB 3.1 Gen 1 Type-A socket. Notably, therefore, you don’t get USB Type-C or any kind of card reader. Rounding out the details is a mere 0.3MP webcam and a 36.7Wh battery.",
    "The latter feature results in just three hours and 11 minutes of battery life in PCMark 10. If that’s pretty poor, PC Mark with its heavy multitasking is a relatively unrealistic test for this kind of portable. More relevant is video playback where you’ll achieve well over double the PCMark 10 result, depending on conditions. In simple terms, this is a three-to-four movie laptop, should you lug it onto a plane.",
    "As for broader performance, in day-to-day usage, the Acer Aspire 3 in this configuration feels pretty sluggish. Apps are slow to load, which is somewhat forgivable. Harder to swallow is the laggy performance when opening web pages. The YouT",
    "ube homepage, for instance, takes an age to fully render.",
    "Thus, this is physically a lot of laptop for the money. But the computing experience, whether it’s the dingy screen or the sluggish performance, is pretty low rent.",
    "For now, Acer isn’t offering this 17-inch Atom-powered variant of the Aspire 3 in either the US or Australia.",
    "In the UK, it’s yours for £399, which is either great value for a 17-inch laptop PC running windows, or a false economy if you’re sensitive to the screen quality and weak performance.",
    "The Acer Aspire 3’s fat bezels are hard to ignore in an age where slim is king. Get past that single aspect, however, and there’s a solid, well-constructed if all plastic, portable PC to be appreciated.",
    "In portability terms, the Aspire 3 is marginal. At a little under three kilos and actually over 16 inches wide, if you’ll forgive the mix of metric and imperial, it’s a bit of a beast. At least the weedy Atom processor means the power supply is almost comically small given the scale of the laptop itself.",
    "The keyboard has plenty of throw, albeit with a pretty soft action, only suffers from a little bounce - the bed is pretty firm. It’s also generously proportioned with a full number pad. As for the trackpad, it’s not as large as we’d ideally like - there’s plenty of space for a larger pad - but at this price point, a huge Apple-style glass trackpad was never going to happen.",
    "Likewise, the all-black design may be plain, but it also lacks the kind of detailing that’s prone to dating, those big bezels aside. In short, while the Acer Aspire 3 doesn’t exactly look like a million bucks, it also avoids an overtly bargain-basement vibe. It’s functional and robust.",
    "All ports are situated on the side of the device. That includes the power socket. For most portable, that’s acceptable. However, the Aspire 3 is a large 17-inch device that’s likely to spend most of its life in a single location. In that context, a rear power port would be preferable.",
    "The range of ports is adequate but no more than just one of the three USB sockets is high speed and there’s no USB-C at all. Again, that’s not a shock at this price point. But it still feels a little wrong here in 2020 to buy a new laptop without a USB-C port.",
    "Ever wondered whether Intel’s Atom serves up a full featured PC experience? A mere 30 minutes with the Acer Aspire 3 makes it clear that’s a negative. Some apps are so slow to launch, you’ll find yourself doubling back to check you actually opened them.",
    "Arguably this type of device isn’t designed for launching heavy duty apps, but you certainly would want it to open web pages pretty swifty, which sadly isn’t the case. The reality is that a cheap tablet will be more pleasant for web browsing than this beefy laptop.",
    "Unsurprisingly, it really struggles in our benchmarks. Watching it labour through Cinebench R20 and record a result that represents about one sixth of the performance registered by something like a low-end Intel Core i5 quad-core mobile processor is pretty painful, even if it does serve as a timely reminder that mainstream laptops will full featured if more affordable CPUs like the Core i5 now offer remarkable performance.",
    "In mitigation, the Aspire 3’s 12GB SSD offers reasonable performance, notching up 900MB/s reads and 600MB/s writes. Five or six years ago, that would have been cutting edge for a desktop PC. The 8GB of RAM means that performance is also not likely to be further slowed by running out of system memory. Put simply, it’s that Celeron N4000 that is the performance bottleneck.",
    "The huge 17-inch screen disappoints a little, too. The TN panel lacks punch and pizzazz courtesy of poor contrast, brightness and viewing angles. Thanks to its generous proportions, it’s not entirely without merit for consuming content or viewing web pages. But screen technology has improved dramatically in recent years, even in cheap devices, and the Aspire 3 is off the pace.",
    "The Aspire 3’s 36.7Wh battery does not bode well for a large 17-inch system. Sure enough, it conks out after an unimpressive 3 hours and 11 minutes in the PCMark 10 Battery Life test. However, the news when it comes to video playback is much better.",
    "Over seven hours decoding 1080p content with the screen at half brightness isn’t actually that bad. It’ll get you through a long flight of movie watching. You can expect similar longevity with a little light web browsing, too. At this price point, that’s actually better than we were expecting."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price and availability",
    "12": "Design",
    "18": "Performance",
    "23": "Battery life",
    "25": "Don't buy it if..."
  },
  "links": {}
}