{
  "source": "https://www.techradar.com/reviews/tcl-10l-review",
  "title": "TCL 10L review",
  "category": "phones",
  "updated": "2020-09-06T09:00:49.968Z",
  "author": "david-lumb",
  "summary": "The TCL 10L is a new budget contender",
  "verdict": "The TCL 10L is a good all-around phone at a budget price, with a well-rounded camera array that can take respectable photos. The screen is great for playing media, and the speaker sound isn’t bad, either, making it a great handset for watching shows or gaming. While there are some performance hiccups, and while the device has a bit less polish than phones from brands who have been in the game longer, the 10L’s value is clear, and it’s a welcome new contender in the budget (but not bargain) space.",
  "pros": [
    "Great display",
    "Impressive camera array",
    "Slim bezel, good looks"
  ],
  "cons": [
    "Occasional performance hiccups",
    "No telephoto lens",
    "No stereo speakers"
  ],
  "article": [
    "The TCL 10L may not be the company’s showstopper – that’s the TCL 10 Pro – but it is a crucial stepping stone in TCL’s bid to progress from merely dallying in smartphones to contending with the established brands.",
    "TCL has sold cheap phones through its sub-brand Alcatel for years, but it’s finally putting its name on a range of mid- and high-quality handsets. The TCL 10L is the middleground between the Alcatel handsets and the 10 Pro statement phone, a workhorse that could end up in more hands by nature of being more affordable.",
    "Cheap phones in 2020 come with more features, better cameras and a greater level of polish than in previous years – and the 10L is no exception, despite being more or less a debut effort for TCL.",
    "The 6.53-inch display is the phone’s standout feature – it’s an LCD screen that offers punchier colors, better contrast and sharper detail than some OLED smartphone screens we’ve seen. With a punch-hole for the selfie camera and thin bezels, the front of the phone looks sleek, with a touch of flagship polish, and the combination of the screen, an impressive (though solitary) speaker, and 3.5mm headphone jack, makes this a great device for consuming media.",
    "The cameras are the other highlight here, with three rear cameras plus a depth sensor making for a robust array, at least on paper. There’s a 48MP main shooter capable of shooting 4K video at 30fps, accompanied by an 8MP ultrawide lens and a 2MP macro camera for up-close shots. A 16MP front-facing shooter rounds out the package.",
    "TCL has added its own touches here, with perks like two camera flashes (which also gives you a flashlight brighter than on any other phone we tried) and an extreme battery-saving mode. There’s even a completely customizable function button on the left of the phone that you can set as a shortcut to whatever you desire, be it turning on the flashlight or turning on split screen in order to use two apps at once.",
    "The cuts had to come somewhere, however, and in the case of the 10L, they’re mostly in the performance. A software update has fixed some of the phone’s lagginess, but there are still some quirks to iron out. Whether it’s the Snapdragon 665 chipset or just TCL getting accustomed to smartphones, the device isn’t quite as polished as its competitors.",
    "Altogether, the TCL 10L is a good value for the price, though it faces stiff competition in a year when so many budget phones are launching with improved designs and camera arrays. Still, it’s worth considering if you’re looking for a cheaper phone on which you plan to consume a lot of media.",
    "The TCL 10L was unveiled at CES 2020, where TCL unveiled its first branded phones – including the TCL 10 5G, which we still haven’t seen since. We got our hands on the 10L then, too, for a first look before the phone was released on May 19 in the US.",
    "The 10L retails for $249 / £199 / AU$499. In the US, it’s available at major retailers like Best Buy and Walmart, though we don’t have any information about carrier support yet. It’s also available in the UK and now Australia at JB Hi-Fi and Officeworks, per 7 News.",
    "As one of the first phones TCL has released, it’s nice to see that the TCL 10L looks higher-quality than many other similarly-priced handsets. Its 6.53-inch screen is large for a budget phone, yet the bezels are pretty thin, and the punch-hole housing the selfie lens in the top-left corner is modestly small. At 8.4mm thick and 180g, it’s a bit lighter and thinner than comparative budget phones like the 9.2mm thick and 192g Moto G Stylus.",
    "The phone feels sleek, with an aluminum frame and a dense plastic back cover that feels less cheap than those on other budget phones, all covered in a glossy finish. On the back there’s a small TCL logo in the middle, a square fingerprint sensor above it (which works well enough), and towards the top, the camera block.",
    "This block contains the three cameras and the depth sensor, flanked by a pair of flashes. Most phones have just one, but TCL has included two here, to produce more even lighting when taking photos with flash – and, as mentioned, both turn on when you activate the flashlight, which actually produces brighter illumination than any other phone in our current rotation (including the iPhone 11 Pro Max).",
    "The rest of the design is fairly perfunctory, with a USB-C port at the bottom and the single speaker to the right of this, which can pump out respectable sound, although there’s no getting around its mono-directional limitations – even some other budget phones, such as the Moto G8 Power, have a second speaker near the top (typically in the earpiece) for stereo sound, which the TCL 10L can’t quite imitate. At least it has a 3.5mm headphone jack at the top for those who like to use wired headphones for listening to movies or for gaming.",
    "On the right side are the volume rocker and the power/lock button. On the left side is the SIM and microSD slot along with the aforementioned shortcut button – TCL calls this the Smart Key, and you can configure it to perform custom actions with single, double, and long-presses – for example quickly launching the camera or turning on the flashlight.",
    "As mentioned, the display is another strength of the TCL 10L, which shouldn’t be surprising given that the brand is known for its TV screens and monitors, but it’s nice to see that expertise applied to a much smaller display. The large 6.53-inch LCD screen has a Full HD+ (2340 x 1080) resolution.",
    "Simply put, it’s the best LCD we’ve seen in a year of strong budget contenders. The Moto G8 line upped its resolution from HD to Full HD, for instance, but in side-by-side testing watching 4K video, the TCL 10L edges out it and other rivals with a sharper picture.",
    "This is especially apparent in the clear details the TCL 10L renders in shadows and other dark areas, which is something that OLED displays typically do better than LCD screens. OLED screens also tend to have a greenish hue, leading us to prefer the 10L’s display even over the TCL 10 Pro’s OLED panel when watching the same media, for its more true-to-life color palette.",
    "The 10L lacks its pricier sibling’s in-screen fingerprint sensor, however, requiring users to rely on the more traditional scanner on the phone’s rear. On the plus side, the modestly-sized punch-hole for the selfie camera is, in our opinion, less obtrusive than a notch (like the one on the TCL 10 Pro), and is a generally classier-looking solution.",
    "The TCL 10L packs an impressive array of cameras for a budget phone: between the 48MP main shooter, 8MP ultrawide lens, and 2MP macro lens (plus a 2MP depth sensor.) and the 16MP front-facing camera, the 10L has a wide-ranging and versatile suite.",
    "You may miss having a telephoto lens, but the high resolution of that main camera allows for a decent degree of digital zoom. The depth sensor does a respectable job of adding blur to photos, although we suspect the software is doing some of the heavy lifting, too, as the front-facing camera pulls off some good portrait effects without one.",
    "If the camera array has a weakness, it’s the macro camera – although we’ve struggled to capture good close-up photos with the macro lenses on other phones that have come out this year. For regular snaps, the phone’s main camera does well, although you’ll want to select ‘High Pixel’ mode to shoot photos at 48MP settings (the default is 12MP).",
    "The 10L isn’t too shabby when it comes to night photography, provided there’s at least some light. It’s a shame the phone doesn’t get the pricer TCL 10 Pro’s ‘Super Night’ mode, though: without a dedicated night mode, the 10L is entirely reliant on external illumination, and while its dual rear flashes do provide a lot more light than those on other phones, and can cast it further (15-20 feet instead of the more typical 5-10), the camera software doesn’t merge the areas it illuminates with background darkness that well. What’s lit up by the flash comes out clearly, but everything beyond that is lost in shadow. Contrarily, since you can’t alter the flashes’ brightness, you might have to keep a little distance to ensure you’re not over-exposing your subjects.",
    "The 16MP front-facing camera is adequate, capturing decent colors and contrast but failing to pick out some of the finer details of hair and wrinkles, or detail in shadows, that other phones’ selfie cameras can capture. But, as mentioned, even without a depth sensor the 10L’s selfie camera manages decent depth effects that look cleaner than other budget phones’ front-facing shots, which tend to produce masking errors.",
    "The TCL 10L packs a Snapdragon 665 chipset and 6GB of RAM, a combo that we found was to handle everything from intense gaming to media watching reasonably well. We did encounter some slowdown initially, experiencing slight but noticeable delays between input and response when swiping around the interface.",
    "A software update appeared to fix the issue, although we still experience some occasional performance hiccups – for instance during marathon sessions of Call of Duty: Mobile when the phone heated up noticeably.",
    "We’d chalk this up to the 10L being one of the first phones TCL has released in its new range – or, given its experience with the budget Alcatel line, one of the first phones that’s required to perform above the level of those cheap handsets.",
    "The 10L is running Android 10, which brings Dark mode and other upgrades with it.",
    "The Android overlay TCL has fashioned is pretty spartan, with an app tray divided into half a dozen broad categories. It includes some handy advanced settings, like notification-blocking driving and gaming modes, as well as the aforementioned ability to customize shortcuts for the Smart Key on the left side of the phone.",
    "With 64GB of storage, the TCL 10L has a bit of an edge over other budget phones that start at 32GB, but if that’s too meager for folks who take masses of photos or download lots of apps, the storage is expandable by up to 256GB via microSD card.",
    "The TCL 10L packs a 4,000mAh battery, a welcome capacity for a budget phone. We found that this comfortably powered the phone for over a day with typical use, though graphically-intensive activities like gaming or binging media drained it faster.",
    "If you want to extend the battery life, the phone has a standard Android battery saver mode, accessible in the shortcut menu, which dims the screen and reduces background processes. TCL also provides a Super Saver mode, which switches the home screen background to pure black and limits you to just a few usable apps in order to keep your phone going for as long as possible – this mode can only be accessed by going to Settings > Smart Manager > Battery.",
    "The TCL 10L comes with an 18W charger, which is serviceable, though not speedy: it recharged around 26% battery after 30min of charge."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "TCL 10L price and release date",
    "10": "Design",
    "15": "Display",
    "19": "Cameras",
    "24": "Performance",
    "30": "Battery",
    "33": "Don’t buy it if…"
  },
  "links": {
    "TCL 10 Pro": "https://www.techradar.com/reviews/tcl-10-pro-review",
    "7 News": "https://7news.com.au/technology/tcl-releases-new-smartphones-10-pro-and-10l-in-australia-c-1214682#:~:text=Both%20the%20TCL%2010%20Pro%20and%2010L%20will%20be%20available,Arctic%20White%20and%20Mariana%20Blue.",
    "Moto G Stylus": "https://www.techradar.com/reviews/moto-g-pro-review",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "Moto G8 Power": "https://www.techradar.com/news/moto-g8-and-moto-g8-power-specs-and-renders-leaked/reviews/moto-g8-power",
    "Moto G8": "https://www.techradar.com/news/motorolas-moto-g8-line-is-confusing-heres-how-the-nine-phones-compare"
  }
}