{
  "source": "https://www.techradar.com/reviews/huawei-mate-30-pro-review",
  "title": "Huawei Mate 30 Pro review",
  "category": "phones",
  "updated": "2020-06-02T13:04:31Z",
  "author": "basil-kronfli",
  "summary": "When excellent isn’t enough",
  "verdict": "The Huawei Mate 30 Pro is a victim of circumstance, but at the end of the day, it’s still an incomplete smartphone until it gets access to Google Play services. As it stands, therefore, while the phone features class-leading everything, we can’t in good faith recommend anyone outside China buy it unless you’re comfortable with the idea of sideloading apps, or are actively seeking a Google-free experience.",
  "pros": [
    "Stunning, true edge-to-edge display",
    "Excellent battery life",
    "Class-leading low light camera"
  ],
  "cons": [
    "No Play Store (as of Oct 2019)",
    "Screen curve creates vignetting",
    "No screen-off volume control"
  ],
  "article": [
    "In 2018, Huawei ‘arrived’, with its fantastic P20 Pro, an imaging whizz that took reviewers by surprise. Then, the Mate 20 Pro outperformed it in virtually every way, and finally, the P30 Pro lifted the lid on smartphone imaging with its incredible zoom.",
    "We, like many, thought Huawei was bordering on untouchable; we were wrong. Huawei has been blocked from working with Google, and in turn, the Mate 30 Pro doesn’t have access to the Google Play Store, making it virtually impossible to recommend to anyone outside China. That said, if we forget about that for a moment and focus on the phone’s specs, this is clearly a top-tier smartphone.",
    "It has a huge 4,500mAh battery, 8GB of RAM, 256GB of storage, a brand new Kirin 990 chipset, and 6.53 inches of virtually wraparound OLED screen, all packaged in a rich glass and metal design.",
    "It’s also bold; there’s no volume button here, and advanced sensors in the notch enable gesture controls.",
    "In a world of conjecture, should Huawei’s partnership with Google resume, and the Huawei Mate 30 Pro gain access to the Google Play Store officially, it would be excellent. In fact, we’ve been using it with successfully sideloaded Google Play services for a week and a half, so will relay our experiences, but also cover the reality of life without Google.",
    "The Huawei Mate 30 Pro was originally just available in China, but you can now buy it in the UK and Australia. Carphone Warehouse is the only retailer offering the phone in the UK, and the company offers specific device as the phone doesn't come with Google Mobile Services.",
    "At times, it has also been hard to find the phone in stock in Australia but you are able to buy it there.",
    "Huawei smartphones are currently not available through US carriers or major retailers, though it's still possible to buy them; however, this usually means a higher cost, or relying on unverified online retailers, and software may not be optimized for US networks.",
    "As for price, the Huawei Mate 30 Pro is £899.99 / AU$1,599 (around $1,200), which gets you 8GB of RAM and 256GB of storage. That's for the 4G version of the phone, so you'll be spending more for the 5G variant but we've found that isn't on sale in the UK or Australia.",
    "The Huawei Mate 30 Pro is big, but not quite Galaxy Note 10 Plus big, with its smaller 6.53-inch screen. Its design is standout though with a true edge-to-edge curved screen that, when viewed head-on, looks like it wraps around the phone.",
    "The Mate 20 Pro weighs 198g, vs the 226g of the iPhone 11 Pro Max and the 196g Samsung Galaxy Note 10 Plus. Just like those phones, the Mate is made of glass and metal, though doesn’t feature a matte finish on the back like the iPhone and OnePlus 7T do.",
    "With curved Gorilla Glass 6 either side, the Huawei Mate 30 Pro doesn’t just feel rich and comfortable, it has got a healthy dose of scratch-resistance to it, which coupled with IP68 water and dust resistance makes sure the elements won’t get the better of it.",
    "Having said that, the phone doesn’t include a pre-fitted screen protector, and there’s a lot of glass here, so we wouldn’t recommend dropping it anytime soon.",
    "The only port is a USB-C one at the base, there’s no headphone jack, which will irk many potential buyers, and there’s a mono bottom-firing speaker too - not ideal audio credentials from a flagship. That said, it sounds good, and on the top of the phone there's an IR blaster - small mercies eh?",
    "As for buttons, there’s just one - a power button. Yep, that’s right, no volume rocker; what was Huawei thinking? The company has devised a simple screen-centric way of increasing and reducing the volume - double-tap the side of the display and slide up or down. This worked every time for us, but you categorically can’t control the volume when the screen’s off, which is frankly a bit ridiculous.",
    "With its 18.5:9 aspect ratio, the Huawei Mate 30 Pro is a bit wider than 19.5:9 phones like the Asus ROG Phone 2, but it’s significantly slimmer at 8.8mm, and feels much more like a traditional highly-polished flagship with smatterings of ‘tomorrow’s tech today’ thrown in.",
    "The Mate 30 Pro’s curved OLED screen spills over the side of the device at an almost 90-degree angle, features a resolution of 1176 x 2400 pixels, and support for the full DCI-P3 color space as well as HDR10.",
    "While it isn’t OnePlus 7T Pro sharp, the Mate 30 Pro’s pixel density of 409 pixels-per-inch still looks incredible, falling just behind the new iPhone 11 Pro-series, but bettering the iPhone 11.",
    "The phone’s max brightness is excellent indoors and out, though in bright light it doesn’t climb quite as high as the Samsung Galaxy Note 10 Plus.",
    "While viewing angles are respectable for an OLED screen, thanks to the extreme curve either side, vignetting is more noticeable than on any other smartphone around. Image integrity purists may take issue with that fact, but there are some fixes in the settings.",
    "For starters, you can customize the screen color vibrancy and temperature, and there’s also a Dark Mode as well as an always-on-display (AOD). You can also hide the notch on the Mate 30 Pro, and in response to the earlier vignetting issue you can hide the edges. That means with a quick toggle, you can reduce the curved edge to appear much subtler, comparable to the Samsung Galaxy S10 Plus 5G.",
    "One thing we were incredibly impressed with was palm/edge rejection. The touch sensitivity of the edge fires up when it needs to - in gaming, for example, when the edge is used as L and R triggers, but we didn’t find ourselves accidentally triggering things."
  ],
  "headers": {
    "5": "Huawei Mate 30 Pro release date and price",
    "9": "Design and display"
  },
  "links": {
    "P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Mate 20 Pro": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
    "P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "Huawei has been blocked from working with Google": "https://www.techradar.com/news/huawei-ban",
    "Kirin 990": "https://www.techradar.com/news/kirin-990-chipset-announced-at-ifa-2019-and-itll-probably-power-the-huawei-mate-30",
    "Galaxy Note 10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-note-10-plus-review-and-specs",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "Asus ROG Phone 2": "https://www.techradar.com/reviews/asus-rog-phone-2-review",
    "OnePlus 7T Pro": "https://www.techradar.com/reviews/oneplus-7t-pro-review",
    "iPhone 11 Pro-series": "https://www.techradar.com/news/iphone-11-vs-iphone-11-pro-vs-iphone-11-pro-max",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Samsung Galaxy S10 Plus 5G": "https://www.techradar.com/reviews/samsung-galaxy-s10-5g-review"
  }
}