{
  "source": "https://www.techradar.com/reviews/scribie",
  "title": "Scribie review",
  "category": "computing",
  "updated": "2020-07-15T08:44:05Z",
  "author": "mark-pickavance",
  "summary": "English-only transcription service",
  "verdict": "It’s easy to use and if you’re American it is relatively cheap. But, it only transcribes English and the ai service isn't the most accurate For those wondering if they can make money transcribing for Scribie, think again.",
  "pros": [
    "Can be inexpensive",
    "Easy to use"
  ],
  "cons": [
    "No live transcription",
    "Additional charges for accents other than American",
    "Only English-speaking transcription",
    "Not a way to make money"
  ],
  "article": [
    "Those that need transcription services regularly are often looking for a probably impractical combination of high accuracy and low cost.",
    "Scribie teases that possibility with a service that potentially offers a high degree of accuracy and one that is remarkably cost-effective.",
    "Is Scribe just too good to be true?",
    "Scribie offers two transcribing options; one that’s delivered by AI and another where people are involved, and each is priced accordingly.",
    "The AI automated service costs 10 cents per minute, and for good audio quality promises between 80% and 95% accuracy. However, it downgrades that accuracy to 80% for accented speakers, 60% for noisy audio or poor quality recordings.",
    "The minimum bill is 1$ even if your recording is less than 10 minutes long and transcribed via AI.",
    "Recordings are processed within 30 minutes, do not include speaker tracking or time coding.",
    "The alternative is the manual process that predictably takes much longer, up to 36 hours, and costs $0.80 per minute.",
    "For eight times the cost they predict 99% accuracy, but you get slammed for an extra $0.50 each for strict verbatim, accented speakers, noisy audio, poor audio and subtitles files.",
    "And, critically, both services only process English speakers.",
    "All processing requires prior payment, and this uses a credit system that you must pre-load with funds beforehand. Credit can be added to the account from $10 to $15,000, and a common fund can be managed between multiple team members.",
    "The mechanism for uploading audio files and retrieving the transcribed results is a simple web page linked to the user account for billing.",
    "Files can either be directly loaded from a computer or sourced from a wide range of cloud storage providers and Video sites, like YouTube and Vimeo.",
    "Once the files are uploaded or transferred to Scribie, then you are given a quote of the costs for transcribing a file.",
    "As part of our testing, we uploaded the start of a famous book spoken by an English actor and comedian. The clip ran for 2 minutes and 3 seconds, and the cost of transcribing this using AI was just $1, and to have it done manually was $1.64.",
    "AI processing was much faster than the 30 minutes that the system had allocated, and once the file is processed, Scribie provides an estimated accuracy.",
    "You can download the text in a wide range of formats, or you can use a web-based editor to hear the audio back alongside the transcription.",
    "This online editor isn’t an impressive part of Scribie. The web page it spawns on has no horizontal scroll bar, and leave vast amounts of unused white space either side of the work area.",
    "For manual operations Scribie uses a four-step process to take raw recordings and transcribe them using home-based freelancers to perform the transcription and review stages, followed by an in-house quality assurance team to proofread and quality assure the work.",
    "The mechanisms for handling the work are identical to the AI pathway. The only differences being that it takes longer to happen, and it costs more to have it done that way.",
    "Assessing the accuracy of an AI system is one thing, but a solution that involves multiple humans is inherently flawed by definition. That said, Scribie has clearly created a tight loop mechanism in their workflow to get the best possible accuracy within the limitations of the audio provided.",
    "And, Scribie is sufficiently confident in this process that at no additional cost to the customer, they will re-review the transcript if the results are found to be unsatisfactory on delivery.",
    "That might not help someone working to tight timescales, but it demonstrates a high level of commitment to getting things right within the vagaries of human communication.",
    "If being accurate is important to you we’d use the manual service, since in our tests the AI transcription was overly optimistic about its accuracy.",
    "How it couldn’t interpret the dulcet tones of Mr Stephen Fry, we don’t comprehend, and it made a mess of his reading of a famous novel. For those curious, the book in question wasn’t called ‘Are potter and the philosophers stone by JK roding’, as Scribe interpreted it.",
    "What we find odd is that for AI processing there is no way of indicating to the system that the content is from a particular country, which would surely help the software process it more easily and accurately.",
    "Depending on the recording, irrespective of its clarity, results may vary.",
    "One of the aspects of Scribie that’s different from many vendors is that those with English grammar and typing skills can sign up to transcribe with them and make some money.",
    "How much money?",
    "The payment rates range from $5 to $25 per audio hour. And, depending on where you live in the world, the lower remuneration would be considered below the minimum wage, and the upper amount hardly a king’s ransom.",
    "On the upside for those that stick with the service for more than a few hours, they pay some bonuses.",
    "However, what’s important to realise is that you can’t realistically transcribe an hour of audio in one actual hour. Transcription is performed in 6-minute-long blocks, and Scribie’s estimation is that the average speed is 45 minutes for that 6-minute section of audio.",
    "That speed correlates to 7.5 hours to complete an audio hour, or 66 cents an hour at the low rate, and $3.33 for those earning the most. Some freelancers working for Scribie can achieve 18 minutes per 6-minute block if they use the automated transcript, and then fix the problems afterwards.",
    "However it is that you achieve these tasks, employment isn’t guaranteed, and pay is low for work that requires not insignificant skills. Unless you are working in a criminally run business, jobs in natively English-speaking countries, however basic, pay more than this.",
    "Cash earned is paid via PayPal, and you must compete with others for the average 492 new files that are on average added to the system for transcription each day.",
    "In short, unless you have infinite amounts of spare time and wish to develop carpal tunnel issues rapidly, this isn’t a career path we’d recommend.",
    "Scribie uses industry-standard 256-bit SSL encryption on its website, making all the communication between servers and browsers encrypted.",
    "In addition, all transcribers are bound by a confidentiality clause about what they transcribe, and as they only get 6-minute chunks of the audio, they never have enough content to see the entirety of what they are transcribing.",
    "Files that are deleted by users are permanently removed from the servers, and the account can also be purged if deleted.",
    "The business will also enter into business-specific confidentiality agreements if required, but the service isn’t HIPAA compliant.",
    "Scribie is a service that initially seems cheap, and it is if you exclusively use the AI options. But for those wanting more accurate transcriptions, the manual option could be less of a bargain if they have a poor recording of an Australian giving an open-air presentation at an airport.",
    "The American focused nature of this solution demonstrates that most of those who are employed to transcribe for Scribie are from North America, and as such find the regional accents of English speakers from other nations, including England ironically, a challenge.",
    "While Scribie claims to have expertise in British, Australian, Indian, African, various European and Asian accents, there are additional costs and longer timescales for those.",
    "Because of the extra cost and time, we’d suggest that the service is probably only appropriate for those based in the US. UK residents, for example, should be able to find local transcription services that don’t add additional charges for their local dialects.",
    "For those in the USA, this solution seems highly affordable, especially if you have good enough recordings to achieve acceptable accuracy from its AI solution.",
    "Those that require the highest levels of accuracy can use the manual service, which is again relatively inexpensive if you don’t incur any additional charges.",
    "There are better services, but not many this cheap."
  ],
  "headers": {
    "3": "Plans and pricing",
    "11": "Design",
    "20": "Accuracy",
    "27": "Making money with Scribie",
    "36": "Security",
    "40": "Final verdict"
  },
  "links": {}
}