{
  "source": "https://www.techradar.com/reviews/siteground",
  "title": "SiteGround review",
  "category": "computing",
  "updated": "2021-06-18T10:52:06Z",
  "author": "mike-williams",
  "summary": "Feature-packed hosting for the more demanding user",
  "verdict": "It may look expensive, but SiteGround's shared hosting in particular is good value if you'll use its many features.",
  "pros": [
    "Feature-packed products",
    "Five data center locations",
    "Speedy support response times",
    "Some unusual control panel extras"
  ],
  "cons": [
    "Above-average prices",
    "Non-standard control panel",
    "Limited storage space",
    "No free domain"
  ],
  "article": [
    "There are two directions web hosting services can take with their low-end shared hosting. One is to sell on a spectacular headline price, and hope users don't notice the cuts you've made to reach it. SiteGround takes the other route, charging a little more, but delivering a capable product with far more features than you might expect.",
    "The Startup account - $6.99 a month initially, $14.99 on renewal - 'only' has 10GB of storage, but gets you unmetered traffic and unlimited sub and parked domains, email accounts and databases. There's easy installation of WordPress and other apps, the free edition of Weebly's website builder and free SSL to secure your site.",
    "The plan also includes integrated Cloudflare CDN, SPAM Experts spam filtering and automated daily backups, features that are often paid extras elsewhere.",
    "The GrowBig account – $9.99 per month initially, $24.99 per month on renewal – bumps up the available disk space to 20GB, and supports as many domains as you can host within that limit. There's free transfer of one existing website, a Nginx and Memcached-based SuperCacher scheme to accelerate performance on busy sites and a staging site for WordPress (test changes to your site in a separate environment, without affecting the production site.) Staging is a very useful feature, often only available in specialist managed WordPress hosting plans.",
    "The top-of-the-range GoGeek plan – $14.99 a month initially, a chunky $39.99 on renewal – gets you priority support, more resources for improved performance and one-click Git Repo creation. White label support allows you to design sites for others and give them access to their own site management console, without seeing the SiteGround name or logo.",
    "One small potential catch is that, unlike most of the competition, none of the SiteGround plans include a free domain.",
    "The shared hosting plans don't include cPanel, either. Management tasks are carried out via SiteGround's own Site Tools console.",
    "The company clearly isn't even trying to compete with the budget providers. If price is your top priority, you may be better off with someone like Namecheap, whose Stellar plan gives you 20GB storage and supports three websites for just $1.44 a month in year one, $2.88 on renewal.",
    "SiteGround’s plans are more comparable with the best managed WordPress plans, where if anything they give you more features than many competitors (free site migration, custom WordPress speed optimizations, automatic updates of WordPress and plugins, on-demand backups, staging, and support for adding collaborators.)",
    "Look at the packages in those terms, and SiteGround is far more competitive. IONOS' WordPress Pro One plan also offers 10GB storage and supports one website, but it's already more expensive at $18 billed monthly, and the Advanced plan (with caching and a CDN) costs a monthly $48.",
    "If you're after high-end share or WordPress hosting in particular, then, SiteGround is a must for your shortlist.",
    "SiteGround’s cloud hosting follows the same pattern as its shared plans; the starting price of $80 a month is high, but check the small print and the product looks much more competitive.",
    "The company doesn't waste your time by offering underpowered products just so it can hit a low headline price, for instance. Even the bottom tier cloud hosting plan gets you 3 CPU cores, 6GB RAM, 40GB storage space and 5TB bandwidth, a spec that would qualify as a mid-range VPS hosting product anywhere else.",
    "You get a choice of data centers in North America, Europe and Asia, too. (We're quoting the North American prices here; if you're looking for hosting in Asia, beware, it can be much more expensive. Check the site to find out more.)",
    "The company doesn't try to tempt you in with low headline prices which jump up later. That '$80 a month' server is a monthly billing price, there's no long-term contract.",
    "Finally, keep in mind that these are managed plans, which means SiteGround looks after the running on your server and you'll get the maximum level of support.",
    "If you're still after the cheapest possible option, a company like Hostwinds has VPS plans from $5 a month. But that's a much lower spec (1 core, 1GB RAM, 30GB storage, 1TB bandwidth.) Matching SiteGround’s hardware lifts the price to $35-$45. Oh, and this is unmanaged-- opt for the same level of support and you'll pay $80-$90, and this still doesn't include everything you'll get with SiteGround (no spam filtering, backups are extra, and so on.)",
    "As with shared hosting, SiteGround isn't a good choice if you're looking for a basic product or the lowest possible price. If you're more interested in functionality, though, there's a lot to like here, and overall, the plans are decent value for what you get.",
    "Getting started with SiteGround works much the same as any host. Choose a plan, hand over your personal details (name, physical and email address, phone number), provide your payment details (card only) and the company activates your account within seconds.",
    "SiteGround's web dashboard is bulkier than usual, with multiple tabs and some less-than-essential elements (do you really need SiteGround blog posts on the front page?), but once you figure out the basics, it's relatively easy to use.",
    "Most of the dashboard covers regular account management tasks (changing billing methods, adding new plans or canceling any you have already.)",
    "A Referral panel gives you a unique referral link. For every friend or colleague you persuade to sign up, you'll get free hosting (three months on the Startup plan, two months on GrowBig plan, one month for GoGeek - you can the idea.)",
    "What's most interesting is the setup wizard, which offers three ways to create your first site: Migrate Website (import an existing WordPress instance), Start New Website (install WordPress or another supported app) or Create Empty Site (manually upload whatever website files or data you like.)",
    "We didn't test the Migrate option as it's difficult to do so in a meaningful way (successfully importing our site doesn't mean the process would work for yours.) But we noticed that the plugin was rated 5/5 by 62 out of 72 voters on the WordPress site, though, suggesting it works well for most people.",
    "The auto-installer and 'empty site' options are more interesting, though, so we were keen to try out both.",
    "Clicking SiteGround's 'Start New Website' option gave us prompts to install WordPress, WooCommerce and Weebly SiteBuilder.",
    "An 'Other' button presented us with a list of around 30 other apps, including Drupal, Magento, MediaWiki, Moodle, phpBB, PrestaShop, SugarCRM, Typo3 and Zen Cart.",
    "We opted to install WordPress, and the site prompted us to enter an admin email address and password. After offering us an optional SG Site Scanner to scan our website for malware, SiteGround automatically installed WordPress in a little under two minutes.",
    "That's good, but it's just the start. Unlike most budget web hosts, SiteGround doesn't leave you alone after the WordPress installation - it also gives you some handy management tools.",
    "For example, SiteGround's website dashboard includes options to open the admin page, update your admin password, reset file permissions, move or delete the application.",
    "A smart AutoUpdate feature optionally updates WordPress and your plugins. There are risks in that - what if a bug breaks your site? - but SiteGround does its best to help. Major release updates are delayed by 24 hours, for instance, and before any update SiteGround runs a full backup of your website. This is a very useful feature, and something we'd expect to be reserved for a specialist managed WordPress plan, not regular shared hosting.",
    "While most web hosts provide a standard platform like cPanel to help manage your website, SiteGround goes its own way with a custom Site Tools panel.",
    "This gets off to a positive start with basic details about your site status (IP address, nameservers, unique visitors, page views), and quick launch icons for common tools (File Manager, Email Accounts, Cloudflare CDN, more.)",
    "A host of other tools are neatly organized in a sidebar: FTP accounts, backups, site metrics, domain management, MySQL (including phpMyAdmin), PostgresSQL, SSL management, HTTPS enforce, password-protected URLs, IP blocking and more.",
    "It's a lengthy list of features, but that's not all. The individual modules are mostly very well designed, and deliver more than you might expect.",
    "Web-based File Managers often struggle with drag and drop, for instance, maybe forcing you to open a separate panel before you can upload your files. But not here: choose a folder, drag and drop the files onto the browser page and they're uploaded, just as easy as Windows' own file manager.",
    "The File Manager scores with its Edit feature, too. This isn't just some basic plain text box: it's React's full-featured Monaco Editor with syntax highlighting, a thumbnail view of the document for easier scrolling, and the ability to have multiple files open at the same time.",
    "The Backups panel lists all your recent automatic backups (that's up to 30 days with shared hosting, 7 for cloud), and enables creating on-demand backups, too. If necessary, you're able to restore the entire backup, or choose files, databases or emails.",
    "On balance, we'd still prefer to have cPanel. There are more features and if you're familiar with the interface, there's less to learn. But there's also a lot to like about SiteGround's own control panel, and you should definitely give it a chance.",
    "SiteGround claims to offer 'super-fast website performance' via 'the best data centers in the world.' Marketing spin, or simple truth? It was time to find out.",
    "After publishing a simple site on our test account, we set up Uptime.com to monitor its availability and response times for two weeks.",
    "Our review site had no outages, as far as we could see (our test might miss outages of less than 5 minutes.)",
    "Average response time was a fair 300ms, right in the middle of the 200-400ms we typically see from shared hosting products.",
    "SiteGround's response time range was poor, with a peak of 1.32s. The best we can say is that most of its issues came in a single 24-hour period, so it's possible we were unlucky. For the rest of the week our server response times were relatively stable.",
    "These results still don't live up to the 'super-fast' marketing, but, to be fair, they're only comparing basic shared hosting plans. They don't tell us anything about the speeds you might see from the higher shared hosting plans, VPS or dedicated products.",
    "SiteGround markets itself as having ‘extremely fast’ support from a 'fast, multi-skilled and helpful team' who are 'among the highest-rated support squads online.' Sounds great – but how does the company perform in real life?",
    "SiteGround's knowledgebase could be a good place to start looking for help, especially with less urgent or more general queries.",
    "There's certainly no shortage of content, for example with 43 articles in the 'Email Configuration' section alone. We've seen some hosts provide less than that in total for all topics.",
    "Although some of these are very short, SiteGround also provides many more detailed tutorials. A section on WordPress, for instance, covers installation, creating a post, installing themes, transferring WordPress sites and more. These aren't going to turn you into a hosting expert, but there's enough to help newbies start to find their way around.",
    "SiteGround offers 24/7 support via live chat, ticket and phone, too, although it's a little more awkward to access than usual. While other hosts often provide buttons to open a ticket or launch the chat window direct from their account dashboard, SiteGround required us to go to the support site, then the contact page; choose the general question type; select a specific category; enter a summary of our issue; bypass recommendations for Knowledgebase articles, click a Contact button, and choose our preferred contact method.",
    "(Annoyingly, this route doesn't always get you to a Contact form. When we chose Contact Us > Advanced Technical Help > Website Security, for instance, the site just displayed an ad recommending we spend $199 a year on Sucuri's website antivirus and website firewall.)",
    "Chat delays can be longer than you might expected - we were given a predicted 14-minute wait - and so we chose the ticket option, where the site claimed we would 'get an answer within minutes.' How many minutes? Under 15, it turned out, before we got a friendly and helpful reply to our question. With tickets answered that quickly, maybe live chat really isn't so important.",
    "We followed up by trying the support line, a toll-free UK number. Again, response times were excellent, and the agent answered our simple question accurately and with no hassles at all.",
    "Overall, while SiteGround's support could be a little better, it's vastly improved in the past few years, and the company now provides a capable knowledgebase and quick and genuinely helpful live assistance for all levels of user.",
    "The prices may look relatively high, particularly with the server products, and the custom management control panel can't match cPanel. SiteGround gives you loads of features and functionality for your money, though, and it could be a smart choice for the more technical home and small business users."
  ],
  "headers": {
    "11": "Servers",
    "18": "Account setup",
    "25": "WordPress",
    "31": "Site management",
    "39": "Performance",
    "45": "Support",
    "54": "Final verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "SiteGround": "https://www.siteground.co.uk/",
    "Startup account": "https://www.siteground.co.uk/wordpress-hosting.htm",
    "GrowBig account": "https://www.siteground.co.uk/wordpress-hosting.htm",
    "GoGeek plan": "https://www.siteground.co.uk/wordpress-hosting.htm",
    "Namecheap": "https://www.techradar.com/reviews/namecheap",
    "best managed WordPress plans": "https://www.techradar.com/news/best-managed-wordpress-hosting",
    "WordPress Pro One plan": "https://www.techradar.com/reviews/11",
    "CDN": "https://www.techradar.com/news/best-cdn-providers",
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "VPS hosting": "https://www.techradar.com/news/best-vps-hosting",
    "Hostwinds": "https://www.techradar.com/reviews/hostwinds",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "knowledgebase": "https://www.siteground.com/kb?afcode=1c79852fbcf20e5afab6f6e910f93ef3",
    "section on WordPress": "https://my.siteground.com/support/tutorials/wordpress?afcode=1c79852fbcf20e5afab6f6e910f93ef3"
  }
}