{
  "source": "https://www.techradar.com/reviews/integral-memory-960gb-type-c-external-ssd",
  "title": "Integral Memory 960GB Type-C external SSD review",
  "category": "computing",
  "updated": "2020-03-16T11:38:54Z",
  "author": "desire-athow",
  "summary": "A newcomer in the crowded world of portable storage",
  "verdict": "The Integral Memory 960GB Type-C external SSD feels like a premium product and is priced like one. Despite its average performance, it remains a good choice especially at this price; we’d love to have a smaller product and one with a longer warranty.",
  "pros": [
    "Nice design",
    "Good price"
  ],
  "cons": [
    "Bigger than its competitors",
    "Shorter warranty",
    "Average performance"
  ],
  "article": [
    "It’s been nearly a decade now since external SSD (solid state drives) have appeared on the market and since then they have managed to dislodge hard disk drives for all but the largest of capacities thanks to a significant drop in price per unit storage and due to the fact that they are more portable, far more rugged and tend to have a lower power consumption.",
    "The last quarter of 2019 and beginning of 2020, however, have witnessed gradual increases in average selling prices as NAND manufacturers - the basic component of any SSD - have reduced production to push up prices. It is in this context that Integral Memory has launched a new 960GB SSD which is currently available at just under £120 at Amazon, that’s about 12.4p per GB.",
    "The design embraced by this storage device is a common one, pioneered by Samsung (as seen with the T7 Touch and the T5), the Teamgroup PD400 and PNY Pro Elite range. In a nutshell, it is a metal enclosure with silver edges, a Type-C connector, a brushed metal finish and a status light.",
    "At 52 x 92 x 9mm at its thickest for a weight of just 50g, it is bigger than the competition not that it matters that much to be honest. It is shockproof but neither waterproof nor dustproof like some of its competitors. The box contains two short cables, one with a Type-A end and the other with a Type-C one.",
    "Our attempt to determine what sort of controller the device used were fruitless; Integral Memory told us that the controller and the NAND flash used vary. A spokesperson told us that “Our ultimate aim is to ensure that the specification and performance is consistent for each build even though we use different 3D NAND.”",
    "The Integral Memory 960GB SSD didn’t warm up under use; that was expected given how mature the technology used is and how effective the metal enclosure is at dissipating heat. The two cables provided were long enough for every day usage.",
    "The 960GB storage size translated into a usable capacity of 894GB which was to be expected. Integral Memory says that the device has read speeds of 500MBps and 400MBps in read and write respectively which we found in line with expectations.",
    "CrystalDiskMark is usually the most optimistic of our benchmark software and it delivered R/W speeds of 464 and 453MBps respectively while AS SSD hit 426 and 400MBps. A 10GB file was transferred in 32 seconds which equates to a 310MBps in a real life use case.",
    "That is average for a drive that is still stuck on USB 3.2 (Gen 2) and doesn’t therefore benefit from any of the speed improvements brought about by the newer USB 3.2 Gen 2x2 or Thunderbolt 3. Just bear in mind that your performance could vary slightly if your drive packs different components.",
    "Integral Memory products are not available outside the UK yet which seriously limits its appeal elsewhere. Even then, there’s plenty of competition especially as the drive carries a premium pricing.",
    "If you’re daring, you can buy the untested TCSunbow external SSD at £95.99 at Amazon for a 1TB model, a significantly cheaper model with a slightly bigger capacity and Type-C connectivity. As a bonus, it is about a third smaller than the Integral drive.",
    "Ready for an even riskier bet? Then consider the PD400 from Teamgroup, the cheapest high capacity external SSD at the time of writing. It costs $99.99 with an extra $4.58 shipping to the UK but you can get 5% off with a coupon. Even with 20% Tax, you end up with a device that costs around £92. Your mileage will vary depending on how you pay for the product.",
    "Alternatively, the previous iteration of the Integral 960GB SSD is still on sale for a penny under £100. It doesn’t have a USB Type-C connector but should be as quick as its successor plus it comes with the same manufacturer warranty protection for peace of mind.",
    "You could also try building your own external SSD but the savings are likely to be marginal. The cheapest internal SSD with a capacity around 1TB costs about £84, which means that you would be looking at a total cost of around £95 once the external enclosure is factored in. You’ll end up with a product that will be bigger, less sturdy and potentially slower because of the lack of tweaks to the firmware.",
    "The Integral Memory 90GB Type-C external SSD comes with a two-year warranty which is shorter than the competition and a bit of a disappointment. Performance wise, there’s not much that can be done given the limitations of the connector.",
    "That said, it operates in a market that is very competitive and doesn’t have enough margin to deliver meaningful differentiators, so not much leeway for price cuts.",
    "Unfortunately, the likes of Samsung or Sandisk have the ability to squeeze out smaller players because of their respective sizes and the fact that they actually manufacture the building blocks, the NAND chips. Samsung added a fingerprint reader to its T7 Touch drive and we would have loved to see Integral do something similar.",
    "The only potential “easy” addition to the feature list is bundling an “exclusive” cloud storage service. Degoo for example offers 200GB free cloud storage for a year to TechRadar readers and it wouldn’t be far-fetched to imagine these two companies striking an agreement."
  ],
  "headers": {
    "2": "Design",
    "5": "In use and performance",
    "9": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "just under £120 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07Q8NQ2TB%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1036964113257645200-21",
    "T7 Touch": "https://www.techradar.com/reviews/samsung-t7-touch-external-ssd",
    "T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "PNY": "https://www.techradar.com/reviews/pny-pro-elite-1tb-external-ssd",
    "TCSunbow external SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FTCSUNBOW-External-Solid-Drives-Portable%2Fdp%2FB0828JP62H%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-9905441771561441000-21",
    "PD400 from Teamgroup": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07T36556V%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2044960340782397200-20",
    "Integral 960GB SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FIntegral-960GB-Portable-Drive-External%2Fdp%2FB075F3KVJW%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1035214566636235600-21",
    "cloud storage service": "https://www.techradar.com/news/the-best-cloud-storage",
    "200GB free cloud storage": "https://degoo.com/techradar"
  }
}