{
  "source": "https://www.techradar.com/reviews/zoho-books",
  "title": "Zoho Books review",
  "category": "computing",
  "updated": "2020-09-23T11:04:12.673Z",
  "author": "nate-drake",
  "summary": "Zoho Books is cloud-based accounting software for all",
  "verdict": "Zoho Books delivers an extensive suite of cloud-based accounting tools that will appeal to a wide variety of business users. Despite some minor shortcomings it is currently one of the better value packages of its type.",
  "pros": [
    "Easy to use",
    "Many features and functions",
    "Impressive apps",
    "Good support"
  ],
  "cons": [
    "Lack of payroll",
    "Limited for larger organisations"
  ],
  "article": [
    "Zoho Books is just one small part of a much greater business concern based in India that offers all manner of software for anyone and everyone. With its clean and simple cloud-based interface Zoho Books makes a great cost-effective accounting option if you’re a freelancer, sole trader or someone running a small business.",
    "The benefit with Zoho Books is that it’s also quite scalable, so therefore offers beefier versions for those with larger business concerns, or anyone intent on expanding their operations. While the desktop route is a solid one Zoho Books also has an impressive app presence, making it a good mobile bet too, especially during the coronavirus crisis.",
    "It's a tax and accountancy software package that sits alongside the likes of competitors FreshBooks, QuickBooks, Xero, Sage Business Cloud Accounting, Kashoo and Kashflow.",
    "Zoho Books has, it explains, a pricing plan for everyone and the service has actually become a little cheaper than it used to be for each of the current packages. There’s also a free 14-day trial available.",
    "Basic now costs $9/£6 per organization, per month. For that you get up to 50 contacts (as in the maximum amount of customers or vendors you can create transactions for), 2 users (as in yourself and your accountant) and 5 automated workflows.",
    "The most popular package is Standard, which is $19/£12 per month and comes with up to 500 contacts, 3 users and 10 automated workflows. Professional, meanwhile, is a full bells-and-whistles experience that offers 500 contacts, 10 users and 10 automated workflows for $29/£18.",
    "Incidentally, sign up for a yearly package and you get 2 months off. Zoho does offer additional add-ons, more about which you can glean from its website.",
    "Zoho Books might be an affordable cloud-based accountancy solution, but that doesn't make it any less feature-laden. In fact, taking a tour of the package we found that it has a pretty formidable arsenal of tools and options. That includes invoicing estimating, a client portal, the ability to track expenses, carry out billing, track your banking movements, manage projects and keep an eye on your levels of inventory.",
    "Sales orders, purchase orders, VAT and online payments are all in there too, making Zoho Books fully featured by anyone's standards. Adding additional value is a solid reporting area, the ability to automate your workflow and, finally, enjoy the convenience of having all your documents stored in one place.",
    "Zoho Books also comes in app form for iOS, Android and Windows. Similarly, you can configure online payments for the likes of Stripe, PayPal, Square and more.",
    "During our time using Zoho Books we found the software-as-a-service solution excellent. There are a lot of tabs, menus and other options available and, with a decent internet connection, we could zip around the site without any issues whatsoever. Connecting to financial institutions, which you’ll want to do to bulk up the appeal of your accountancy package, is fast and efficient.",
    "There’s also the capacity for using any one of many Zoho add-ons to increase the potential of your package. These can be found via the Integrations menu. Performance is further boosted if you choose to dip into the Automation area of the interface, which Zoho Books provides to streamline workflow more efficiently. It’s very worthy of inspection.",
    "In addition, items called Web Tabs add extra usability within the interface if you want to create and use them to access frequently called-upon features and functions.",
    "Setting up Zoho Books could not be simpler. As with all cloud-based services you’ll need to create an account, pick a password and then work your way through the steps. Input your organization’s details, opt in or out of VAT and then pick down through the features checklist. These can be enabled either on or off depending on what suits your needs.",
    "Usefully, Invoices, Credit Notes, Expenses, Bills, Recurring Invoices and more are available by default in Zoho Books. Press the ‘Get Started’ button and you’ll be read to go. Once you’re inside the dashboard area everything is very self-explanatory, with core menus down the left-hand side and more along the top. Another bonus with Zoho Books is the extensive list of available templates for creating everything from invoices through to customer statements and all points in-between.",
    "Zoho Books comes complete with its own free support infrastructure, which arrives via numerous avenues. There’s 24-hour unlimited support 5 days a week and this can be accessed via email, or by using the built-in live chat options. Failing that, Zoho Books issues can be tackled over the phone via a toll free hotline.",
    "We’re also impressed with the beefy selection of supporting options that can be found via the website. There’s help documentation, FAQs, business guides and forums too, which all add extra weight to the overall support structure.",
    "Zoho Books is a fine pay-as-you-go cloud-based accounting option that provides you with many if not all of the tools you’ll need to keep your business accounts in good shape. While the cloud-based desktop route is a great one to take we’re also really impressed with the level of detail applied to Zoho Books range of apps. These have been nicely put together and deliver everything you need to keep tabs on your accounts on the move.",
    "We also like the way that Zoho seems more than amenable to helping you scale your accounting package too, with larger users being encouraged to contact the company in order to get a solution more accurately tailored to their needs. However, as it stands in any of the more off-the-shelf guises Zoho Books still has plenty to commend."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Features",
    "10": "Performance",
    "13": "Ease of use",
    "15": "Support",
    "17": "Final verdict"
  },
  "links": {
    "Zoho Books": "https://www.zoho.com/uk/books/",
    "software": "https://www.techradar.com/news/software",
    "accounting": "https://www.techradar.com/best/best-uk-tax-software",
    "freelancer": "https://www.techradar.com/how-to/how-to-become-a-freelancer",
    "small business": "https://www.techradar.com/best/best-apps-for-small-business",
    "mobile": "https://www.techradar.com/phones",
    "accountancy software": "https://www.techradar.com/best/accounting-software-small-business",
    "FreshBooks": "https://www.techradar.com/reviews/freshbooks-2020",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks",
    "Xero": "https://www.techradar.com/reviews/xero",
    "Sage Business Cloud Accounting": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "Kashoo": "https://www.techradar.com/reviews/kashoo",
    "Kashflow": "https://www.techradar.com/reviews/kashflow-accounting-service",
    "Basic": "https://www.zoho.com/uk/books/pricing/",
    "Standard": "https://www.zoho.com/uk/books/pricing/",
    "Professional": "https://www.zoho.com/uk/books/pricing/",
    "app form": "https://www.zoho.com/books/mobile-apps/",
    "cloud-based accounting": "https://www.techradar.com/best/accounting-software-small-business",
    "accounting package": "https://www.techradar.com/how-to/online-accounting-tools-for-sole-proprietors"
  }
}