{
  "source": "https://www.techradar.com/reviews/acadian-on-call-review",
  "title": "Acadian On Call review",
  "category": "pro",
  "updated": "2020-10-27T16:09:59Z",
  "author": "jeph-preece",
  "summary": "If average is what you want, then our Acadian On Call review explains why it might be the best medical alert system for you",
  "verdict": "Acadian On Call offers the same packages as most medical alert services we’ve reviewed. With an average call response time, call quality, and pricing, there isn’t much about Acadian On Call that stands out, for better or worse.",
  "pros": [
    "Excellent speakerphone",
    "Fall detection sensor accurately detects real falls"
  ],
  "cons": [
    "Limited pendant range",
    "Fall detection pendant also mistakes small bumps for falls"
  ],
  "article": [
    "In our Acadian On Call review, we examine why this medical alert service does little to separate itself from the rest. As the medical alert service brand of Acadian Total Security, a home security company, this company follows the same formula as most medical alert services on the market, offering a tiered package system of two in-home systems and a mobile system, each with add-ons like fall detection pendants to drive up the monthly cost.",
    "There is nothing wrong with this business model. It certainly works, as evidenced by the many copy cats. The issue with it is you need to provide something exceptional to stand out from the pack of copy cats. And with Acadian On Call, this simply isn’t the case. Average performance and average pricing don’t equal anything other than average value.",
    "Get a free quote for a medical alert system.",
    "For the in-home landline system, Acadian On Call uses the MyTrex MXD system known for its loud speakerphone, yet simple design. And while the MyTrex MXD is easily adapted to become a cellular model, Acadian On Call decided to use the MobileHelp CBS, which is our favorite in-home medical alert system. Both systems are widely used in the industry. While the MyTrex is much louder, the MobileHelp CBS has far better audio. It also features a display that shows the cellular signal strength, the time, and the temperature.",
    "Both have similar wireless pendant ranges. In our tests, they were separated by only a few feet. Both are easily capable of allowing you to roam your house and yard with ease. However, at average ranges under 100 feet, it’s far below the 600 foot range listed in the specifications.",
    "The fall detection pendant, a $10 per month add-on, proved to be 100-percent accurate at detecting falls. That’s the good news. The bad news is it also detected 100 percent of falls when dropped from a height of just 12 inches and 75-percent of drops of 6 inches. This means that it will call for help if you fall and are unable to press the help button, but it will also call for help if you bump into someone or place the pendant on your nightstand a little too hard. These false alerts aren’t a big deal, until they are. If you’re aren’t near the base station and you don’t know a false alert has been placed, then the operator will send an ambulance to your home.",
    "If you want to avoid a false alert mistake, choose the bundled package, which includes a MobileHelp in-home cellular base station and a MobileHelp Mobile PERS device. The mobile GPS medical alert system allows you to talk directly to the operator wherever you are, so you can always clear up a false alert caused by a sensitive fall detection pendant. Mobile medical alert systems are also just safer. They allow the emergency operator to locate your exact location, saving precious time for EMTs, and you don’t have to worry about being beyond the range of a base station.",
    "In our emergency response tests, Acadian On Call was average. There it is again. Average. In the first round of three-week daily tests, the calls were answered in 53 seconds, on average. This was only slightly faster than the overall average. In the second round of three-week daily tests, the average call response time was 47 seconds, which was slightly over the overall average. By comparison, GreatCall averaged 20 and 15 seconds.",
    "Despite partnering with a Five Diamond monitoring center, which requires strict certifications, the quality of the calls was also just average. The operators were often too bored and robotic in their responses. While you can expect a certain level of that in a call center, it really stands out when you’re testing and comparing operators across over a dozen medical alert services. We never had one operator confirm our identity and were often never asked if we were okay.",
    "There isn’t much to say about Acadian On Call that isn’t a retread of an alsoran. While the company has been around for nearly three decades, it hasn’t done much to push the senior care and medical alert system industry forward. It seems rather complacent to offer its three packages like everyone else with very little else aside from the staple of add-ons, like fall detection pendants, wall buttons, and lock boxes. There isn’t even much to the learning center.",
    "A FAQs page offers some answers, but it's sparse in comparison to other services. In over six years of reviewing medical alert services, very little has changed on the company’s website.",
    "Our experience with customer service was positive. There really isn’t really anything to complain of. The cancellation process is easy and painless. And since you’re not locked into a contract (like pretty much all medical alert companies except for Life Alert), you can cancel any time you want, though you have to return the system.",
    "When comparing the pricing with all the medical alert services we reviewed, Acadian On Call is right there in the middle where you’d find the average cost. The in-home landline system costs about $29.99 per month. The in-home cellular costs roughly $35 per month. The mobile system costs nearly $42 per month. Each of these is right on the average cost for comparable systems. By comparison, Bay Alarm Medical costs roughly $20 per month for the same MyTrex landline system. MobileHelp costs around $25 for the same in-home cellular system. And GreatCall costs $25 per month for the best mobile medical alert system on the market.",
    "You can save up to $5 per month if you pay in annual or semi-annual payments. This helps make the cost more competitive. But then, most services also offer a similar discount on bulk payments, which means you could potentially save even more with other services.",
    "The best aspect of Acadian On Call is the choice of either the MyTrex and MobileHelp systems. Both are widely used in the industry because they provide clearer communication than older medical alert systems. Of course, our tests have shown the MyTrex to be louder, but with inconsistent audio quality.",
    "That said, featuring two popular medical alert systems is unoriginal and does nothing to distract from the average performance of the monitoring center's emergency response time and quality of calls. And when you consider the average overall pricing, Acadian On Call does nothing to separate itself from all the other mediocre medical alert services."
  ],
  "headers": {
    "3": "Medical alert systems",
    "7": "Emergency response center",
    "9": "Medical alert service",
    "12": "Cost comparison",
    "14": "Final Verdict"
  },
  "links": {
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system"
  }
}