{
  "source": "https://www.techradar.com/reviews/surveygizmo",
  "title": "Alchemer review",
  "category": "computing",
  "updated": "2020-10-26T10:05:13Z",
  "author": "michael-graw",
  "summary": "Alchemer is an advanced data collection software, with support for survey logic and data export to R and SPSS.",
  "verdict": "Alchemer is one of the most advanced data collection tools available. It features a massive trove of question types, customizable survey logic, and in-depth data analytics features.",
  "pros": [
    "Survey logic can be customized with code",
    "Huge variety of question types",
    "User interface is well-organized"
  ],
  "cons": [
    "Free plan is very restricted",
    "Expensive, especially for advanced analytics",
    "Most advanced features require Javascript coding"
  ],
  "article": [
    "Alchemer is a comprehensive survey and data collection software with few limitations. The platform allows you to place surveys just about anywhere, including on social media, and to link to them with QR codes for simple access. On top of that, Alchemer offers extensive tools for crafting your surveys, such as branching questions that automatically adapt to the respondent.",
    "The platform isn’t perfect, though. Paid plans are expensive, and the software’s advanced analytics features are limited to the priciest options.",
    "So, is this the right data collection tool for you? Let’s dive into a full Alchemer review to find out.",
    "Alchemer does have a free account, although it leaves out most of the functionality that makes the software so attractive. You only get three surveys and a maximum of 100 responses. There are almost no analytics tools, only a few available question types, and no survey logic.",
    "The paid Collaborator plan costs $49 per month or $300 per year. This plan gives you a lot of features, including unlimited surveys and responses, custom branding on your surveys, logic tools, and all but a few advanced question types. Notably, though, the analytics tools won’t allow you to track survey responses over time, segment reports, or export responses for R or SPSS.",
    "The Professional plan entails a big jump in price—it costs $149 per month or $1,020 per year. For that, you get more advanced survey logic options and significantly more analytics tools, such as segmented PDF reports. However, you still don’t get all question types or Alchemer’s full analytic capabilities. Full access to Alchemer costs $249 per month or $1,800 per year.",
    "Note that all of these plans are designed for teams of 10 people or less. Enterprise-scale versions of Alchemer are available, but you’ll need to contact the company for pricing details.",
    "Most of Alchemer’s best features are centered around survey design and construction. However, don’t discount the data analytics tools built into this software.",
    "The heart of Alchemer is survey logic, which allows your surveys to automatically serve questions based on a respondent’s answers to previous questions. This is a major plus because it not only increases survey engagement, but also ensures that you are getting relevant information from the people filling out your forms.",
    "Survey logic in Alchemer is a bit different than in competing platforms. You can define whether to skip or insert a question using merge codes derived from previous survey questions, using Alchemer’s custom coding language, or by using Javascript. The software does a nice job of identifying when questions have conflicting logic codes and alerting you to the problem, so you don’t have to wait until the testing stage to deal with mistakes.",
    "The variety of question types available in Alchemer is somewhat astounding. Users on the Collaborator plan get access to all of the question types that surveys commonly use, including multiple choice and free-form response questions.",
    "The advanced question types, though, offer insights that simply aren’t possible otherwise. For example, you can ask respondents to highlight text, provide feedback about images by clicking anywhere on them, or give highly detailed answers by clicking through hierarchical response menus.",
    "Since Alchemer is designed to do such a thorough job of collecting data, it should come as little surprise that the platform also has numerous capabilities for analyzing and reporting that data. Paid users are able to filter respondents based on their answers to specific questions, as well as to export raw data to Excel for further analysis. Even better, it’s possible to look at survey responses over time, which can be helpful for before and after surveys, or to segment reports to drill down into a specific subset of respondents.",
    "Advanced users will be happy about the fact that Alchemer is compatible with R and SPSS, two of the most popular statistics coding languages. The software comes with a set of custom analytics packages for R, and you can clean data to remove partial or potentially biased responses before export.",
    "Alchemer does take some getting used to, as you might expect for a software with this much data power. However, the creators did a nice job of organizing the platform in a straightforward way so that the learning curve isn’t too steep.",
    "Most of the tools you need for creating a simple survey are under the platform’s Build tab. It’s there that you can add and layout questions, edit logic settings for individual questions, and set validation requirements for free-form entries. The Style tab is also helpful during the survey creation phase, as this is where you’ll find a handful of themes you can apply and add custom branding to your survey.",
    "It’s worth talking about the Test tab as well, since this has some great features for ease of use. Alchemer’s test function will automatically highlight mishaps with your survey logic, as well as call out any questions that it thinks are poorly designed for survey engagement. You can also automatically generate survey data, which gives you an idea of whether the responses you may get will be as helpful as you intend.",
    "Alchemer’s team provides phone support during business hours and email support 24/7. You have the option to grant the technical support team access to your account, which makes it much easier and faster to resolve problems. There is also a comprehensive documentation library and a user forum on the company’s website, so there’s no shortage of ways to work through issues with Alchemer.",
    "Alchemer’s main competition is Qualtrics, which is similarly built for comprehensive survey questioning, advanced data analytics, and unlimited flexibility. Qualtrics actually has a bit more functionality if you’re comfortable with coding, but the software’s pricing also makes Alchemer look affordable. If you need survey logic, but not advanced question types or Javascript support, you may find that Typeform offers a better value than Alchemer.",
    "Alchemer is one of the most powerful survey design platforms available. The software has a very advanced suite of survey logic tools, which can be further customized with Javascript code. The question types available in Alchemer are nearly unrivaled, while its data analytics capabilities allow this software to work seamlessly with R and SPSS. The only downside to Alchemer is its price, although it’s fairly inexpensive compared to competitors like Qualtrics."
  ],
  "headers": {
    "3": "Plans and pricing",
    "7": "Features",
    "14": "Interface and in use",
    "17": "Support",
    "18": "The competition",
    "19": "Final verdict"
  },
  "links": {}
}