{
  "source": "https://www.techradar.com/reviews/bubblus",
  "title": "Bubbl.us review",
  "category": "computing",
  "updated": "2020-05-11T08:54:42Z",
  "author": "saad-mohammad",
  "summary": "A useful tool for teams, students, and teachers to collaborate, brainstorm, and break down new topics",
  "verdict": "Bubbl.us is great for creating visual aids for students and small teams and is a useful, low-cost solution.",
  "pros": [
    "Great price point",
    "Easy to use",
    "Simple and intuitive UI"
  ],
  "cons": [
    "Limited options for customization",
    "Not ideal for advanced users"
  ],
  "article": [
    "Bubbl.us allows you to create colorful and engaging mind maps - graphical representations of concepts and ideas and the relationships between them. It is great for planning projects, collaborating with others, and brainstorming with your team. It can also be used as a teaching tool in the classroom.",
    "With Bubbl.us, you and your audience can better understand and process concepts as well as generate new ideas. Also, since it is browser-based, it does not require the installation of any client software, which lowers costs and any barriers to getting started with the service.",
    "With the free version, you can create up to three mind maps. This plan would suit users who need the service as a one-off for a specific project or assignment. The premium plan costs $4.91 per user per month, and a team plan that supports three users can be purchased at a cost of $59 per person.",
    "The premium and team plans both come with a 30-day free trial, unlimited mind maps, the ability to add files and images, and options for real-time collaboration. They also come with guest editing and priority support.",
    "The premium plan is a great choice for small businesses that want to benefit from the visual aid of a mind map without having to pay for an enterprise solution.",
    "As for the team plan, it has a number of additional features beyond those found in the premium plan. These include custom sign-in domain branding, multiple licenses, advanced user management, and a dedicated administrator account.",
    "These features make the team plan the perfect application for businesses that rely heavily on collaboration, brainstorming, and innovation and who want unfettered access to a performant mind mapping solution.",
    "Mind maps created with Bubbl.us are essentially flowcharts or diagrams made of bubbles of information. The maps use a clever color scheme that allows users to easily see how different bubbles and branches of a given mind map are related to each other. Below are some of the features that are built into the system.",
    "Colorful Bubbles",
    "Using the Custom button, you can personalize the bubbles in your mind map to highlight different relationships or emphasize contrasts and differences between various sets of information. The Hue, Saturation, and Palette buttons can also be used to further customize the colors of your mind map bubbles.",
    "Many users, especially teachers, have raved about how well their students take to Bubbl.us’s color-coded map representations. The tool gives students the freedom they need to customize things without giving them so much freedom that they get lost in the process.",
    "Save, Export, and Share",
    "Your mind maps will be automatically saved every two minutes, but you need to register for an account to store them online. The export option allows you to save your maps in JPG, PNG, and HTML formats.",
    "With the premium version, you can even share your maps via email, add files and images, enjoy real-time collaboration, see your revision history, and allow anyone with a link to edit your mind map.",
    "Online Brainstorming for Classes",
    "With Bubbl.us, you can collaborate with others over the Internet. This feature is particularly useful for teachers who can use it to engage with their students and have them collaborate on projects.",
    "Bubbl.us’s UI is pretty clean and easy to understand. You start with a large canvas on which you can draw shapes and bubbles and populate them with information. The app works pretty much the same way on different devices, with the only difference being the actual size of the canvas you start with.",
    "You can edit the size of your text and the connection arrows in your diagrams with an interactive pop-up menu. Once your mind map is ready, you can save it as an image and share it with others.",
    "You can also resize and manipulate the objects themselves on your canvas. All you have to do is create a new shape or object, give it a name, and connect it to other shapes on the canvas based on how they are affiliated. In this way, you can create visually striking maps without spending too much time or money to do so.",
    "Bubbl.us is cloud-based and runs on Linux, Windows, and macOS. It runs Macromedia Flash in your browser, so all you need to use it is a device (mobile, tablet, laptop, or desktop) and an Internet connection. It works on Google Chrome, Mozilla Firefox, Safari, Microsoft Edge, and Internet Explorer.",
    "In terms of support, you can reach the tech team via email, phone, and online helpdesk tickets if you have any issues with the service. There are a few online guides and tutorials as well, but they are very basic in nature and only cover the core features of the platform.",
    "Here’s how Bubbl.us stacks up against two mind mapping rivals:",
    "Budget",
    "Bubbl.us is competitively priced compared to alternative tools such as XMind or MindManager, whose premium plans cost $79 and $349 respectively.",
    "Ease of Use",
    "When it comes to students and small business teams, an intuitive UI and ease of use are critical for quick onboarding. Bubbl.us is easy to get started with, and you can learn how to use all of its various features very quickly. XMind and MindManager both have many advanced features that take a little longer to become accustomed to.",
    "Functionality",
    "If all you need is the most basic of features, then Bubbl.us does the trick. You can use it to make flowcharts and diagrams and plan projects and assignments. However, if you need to perform advanced tasks, such as work prioritization or conditional decision-making, XMind or MindManager would be a better fit for you.",
    "Bubbl.us is a good service for beginners to consider because it is easy to use and has a low learning curve. It can also be used on most smart devices, and it is great for online brainstorming, visualizing problems and solutions, and for use in the classroom.",
    "However, Bubbl.us is also a bare-bones app that’s a little difficult to customize. Also, elements or assets in your mind map may overlap, making it difficult to click on them, and bubbles cannot be moved in groups, so you have to move bubbles one at a time."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "16": "Interface and in use",
    "19": "Support",
    "21": "The competition",
    "28": "Final verdict"
  },
  "links": {
    "mind maps": "https://www.techradar.com/best/best-mind-map-software",
    "collaborating": "https://www.techradar.com/best/best-online-collaboration-tools",
    "flowcharts": "https://www.techradar.com/best/best-flowchart-software",
    "MindManager": "https://www.techradar.com/reviews/mindmanager"
  }
}