{
  "source": "https://www.techradar.com/reviews/seo-spider",
  "title": "SEO Spider review",
  "category": "computing",
  "updated": "2020-03-09T13:05:56Z",
  "author": "jacob-parker",
  "summary": "Extract advanced, actionable data about your site’s SEO performance.",
  "verdict": "It might confuse beginners but experts are sure to appreciate SEO Spider’s advanced page crawling and site analysis tools.",
  "pros": [
    "Lets you access plenty of useful data about your website",
    "Works with unpublished sites",
    "Syncs with third-party apps like Google Analytics"
  ],
  "cons": [
    "No cloud-based service available",
    "Interface could be confusing for first-time users",
    "Limited search results and features with the free edition"
  ],
  "article": [
    "SEO Spider is a Search Engine Optimization (SEO) tool developed by a UK-based website search agency called Screaming Frog. With SEO Spider, you can evaluate different website pages and extract key bits of information to analyze for their SEO qualities.",
    "As you’ll find out during this SEO Spider review, this software stands out because it manages to present complex SEO data in an easy-to-understand format. However, there are a few issues worth mentioning such as a lack of cloud-based access and hefty feature restrictions placed on the free version of the package.",
    "Although you don’t have to upgrade to uncover broken links or analyze site metadata, when it comes to more advanced features, there are some more serious downsides to sticking with the unpaid edition of this platform. Key tools such as Google Analytics integration and PageSpeed insights are only available with the premium version, for example. Also, a paid license is required to save search crawls and set advanced configuration options.",
    "There are two versions of Screaming Frog’s SEO Spider tool. One is free and the other costs £149 (approximately $195) per year. If you run a large organization and need to purchase multiple licenses so that everyone in your team can use the software, Screaming Frog will give you a discount if you bulk buy more than five licenses at once.",
    "The main difference between the free and paid editions of SEO Spider is that the free version can only be used to scan 500 URLs at once, while the paid edition works for an unlimited number. Unless you need to frequently investigate the SEO properties of a large website with hundreds of different subdomains, this restriction alone shouldn’t put you off using the free version of SEO Spider.",
    "During our review, SEO Spider stood out for the efficiency of its searches and broad feature set. If you need to schedule regular search crawls for specific URLs, evaluate unpublished websites that can only be accessed through a login, or extract databases for use in another program, this could well be the right tool for you.",
    "Google and other major search engines don’t look kindly on duplicate content, so having copies of the same pages on your site can quickly lead to lowered page rankings. But, of course, if you run a large site it’s nearly impossible to manually check for cloned pages. SEO Spider can solve this problem with an advanced algorithmic search that locates any pages on your site with the same headings, titles or descriptions.",
    "Using SEO Spider, you can create crawl diagrams and tree graphs, both of which are really useful for understanding your site’s architecture. With either, you can display up to 10,000 URLs at once. While tree graphs are split into “layers of depth”, crawl diagrams use color-coded nodes to give you a holistic overview of your site’s page index system.",
    "One common problem with other SEO website crawling services is that there’s no way to tell how a program found a specific URL. If a particular URL should be hidden from public searches, this can obviously be a major headache. With SEO Spider you can simply right-click on a URL and hit “Crawl Path Report” to see exactly how it was discovered.",
    "SEO Spider works on any computer running Windows, Mac, or Ubuntu. No matter which edition you’re working with, installation is a relatively quick and pain-free experience.",
    "Overall, the SEO Spider interface may feel a little daunting to users who have never worked with an SEO analysis tool before. However, despite the volume of information presented, everything is well-laid out and even beginners should feel comfortable with this software after a couple of hours.",
    "As soon as the installation is finished, you should be ready to perform your first crawl search.",
    "Below the top menu bar, you’ll see a URL address area. Once you’ve plugged in your website here, simply hit “Start”. The tool will then look for every link it can find on your homepage and open up them up for analysis. As long as your site is set up correctly, SEO Spider should find all of your public pages.",
    "The SEO Spider home screen is set up to easily let you see the key results that have been brought up by your website crawl. For example, under the tab titled “H1”, you’ll be able to see a list of main headings used on each of your website’s pages. At a glance, this can reveal if you are missing H1 tags or have duplicate headings, both of which could harm your website’s SEO performance.",
    "Technical support is only available for paid-up users of the SEO Spider program. However, Screaming Frog’s User Guide ought to address most, if not all, problems you encounter with the software. Further assistance through email and a support ticket system is also available.",
    "At £149, SEO Spider is notably cheaper than some alternative SEO analysis programs such as SerpStat, which costs $69 per month. However, it’s worth noting that SEO Spider has a more technical interface than some SEO tools such as Yoast SEO, and is harder to configure if you want to get automatic alerts for dropped page rankings.",
    "It might not have the most user-friendly interface, but SEO Spider is an excellent option for generating in-depth data about the SEO design and performance of your website. Thanks to advanced features like form-based authentication, you’re sure to get your money’s worth with this neat little program from Screaming Frog."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "5": "Features",
    "6": "Uncover Duplicate Content",
    "7": "Visualize Sitemaps",
    "8": "View Crawl Path Reports",
    "9": "Interface and In Use",
    "14": "Support",
    "15": "The Competition",
    "16": "Final Verdict"
  },
  "links": {
    "Search Engine Optimization (SEO) tool": "https://www.techradar.com/news/best-seo-tool",
    "Screaming Frog": "http://www.screamingfrog.co.uk",
    "User Guide": "https://www.screamingfrog.co.uk/seo-spider/user-guide/"
  }
}