{
  "source": "https://www.techradar.com/reviews/gpstrackit",
  "title": "GPSTrackit review",
  "category": "computing",
  "updated": "2021-09-09T07:39:34Z",
  "author": "jitendra-soni",
  "summary": "Low cost telematics platform",
  "verdict": "A no-strings-attached fleet monitoring service which isn't overly expensive.",
  "pros": [
    "Low cost",
    "No contracts",
    "Free training",
    "Free hardware"
  ],
  "cons": [
    "Separate plan for ELD"
  ],
  "article": [
    "GPSTrackit is a 17-year-old company that offers full-fledged fleet management solutions. Among the pioneers of the industry, the Roswell, GA-headquartered company has served over 12,000 fleets to date and is listed in Deloitte's Technology Fast-500 list.",
    "Despite being a low-cost telematics provider, GPSTrackit offers services like ELD compliance, safety features, and vehicle diagnostics. Unlike many in the market, GPSTrackit is among the few companies that offer customers a transparent pricing and package structure. Features like a 30-day money-back guarantee, free training and hardware, monthly billing, and more, make this one of the most favored fleet management services in the market.",
    "The company takes pride in its support and that is reflected in the number of positive reviews given by users on various platforms (including TrustPilot).",
    "GPSTrackit lists its basic fleet management plan at $23.95 per vehicle per month, making it one of the cheapest services in the business. Other selling points include monthly billing, no contract, no limitation on the minimum number of devices, and free GPS hardware with free installation. All this makes it one of the most favored fleet management services for small companies.",
    "But that's not all. The company also offers a 30-day money-back guarantee. Although GPSTrackit does not offer a free trial, it does provide users with a free demo which can be accessed by getting in touch with a sales representative (or Fleet Advisor, as the company prefers to call them).",
    "The base plan comes with live vehicle tracking, time and driver management, asset protection and management, maintenance planning and alerts, along with free hardware and training.",
    "Additional features - like video telematics which include video footage, asset tracking, ELD compliance and more - are available with different plans that can be bought separately. The company also has a plan where it offers a custom solution based on specific requirements, and to go this route, you'll need to get in touch to discuss pricing.",
    "GPSTrackit offers a robust tracking solution at an affordable price. The fact that the company offers its services at an affordable cost doesn’t mean that it cuts corners either. These are similar to the other telematics solutions that most premium-priced products offer, though GPSTrackit keeps the prices well below what others charge.",
    "GPSTrackit’s cloud-based software creates optimized routes automatically thus simplifying and reducing the time spent on vehicle scheduling and mapping. With the help of the insights offered by the system, businesses can drastically decrease the miles driven by fleet drivers, shorten idling periods, serve more customers in less time and even limit vehicle wear and tear.",
    "Some of the features of the software are:",
    "Apart from the cloud-based software, the company also has native applications on Android and iOS mobile platforms to manage the fleet on the go.",
    "GPSTrackit’s software has Google Maps integrated for precise vehicle tracking and with the lower upfront cost, flexible customization options, and having no contract, it is ideal for large fleets as well as for organizations with smaller fleets. The integrated fuel tracking facility lets admins track fuel spend with the help of fuel cards.",
    "The software updates with the vehicle's location every 30 seconds or 60 seconds depending on the plan that you've chosen, and also offers alerts based on incidents like speeding, harsh braking, a geofencing breach, and even unauthorized use.",
    "It also offers various reports like driver scorecards that cover speed, reports for identifying speed patterns, fuel usage, distance traveled, real-time temperature, and more. There is also an option to customize a report and have it automatically delivered to the desired inbox based on preset triggers.",
    "Since GPSTrackit offers an economical base package, businesses that need ELD compliance solutions must opt for a separate plan that is slightly costlier, but also lets drivers digitize their HoS (Hours of Service) reporting. The company has a separate mobile application for drivers who need ELD compliance to file their reports on the go.",
    "While most other companies prefer a DIY approach to support by offering an online knowledgebase or tutorial videos, GPSTrackit offers unlimited training without any extra cost. The live training approach takes the customer support experience several notches higher, although there are also online video guides to boot.",
    "The free training, voice and email support are available between 8am and 8pm ET on workdays. The technical help desk is available throughout the week, though over the weekend availability is patchy compared to weekdays. A dedicated sales team is also available between 8am and 5pm ET on weekdays.",
    "GPSTrackit is one of the very few companies that offer low-cost GPS tracking solutions without compromising on quality. The feature-rich reports prepared with a vast amount of vehicular and route data collected by the software provide the business with a vast amount of insight whenever required.",
    "The number of positive reviews on various user business review websites suggests that customers are happy with the service, and especially with the support offered. However, it is of course always advisable to compare different services based on your exact requirements rather than purely going with subjective reviews posted by other users."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Features",
    "15": "Support",
    "17": "Final verdict",
    "19": "Further reading"
  },
  "links": {
    "fl": "https://www.techradar.com/best/the-best-fleet-management-software-and-services-2020",
    "eet management solutions": "https://www.techradar.com/best/the-best-fleet-management-software-and-services-2020"
  }
}