{
  "source": "https://www.techradar.com/reviews/vipre-antivirus-solutions",
  "title": "VIPRE Antivirus solutions review",
  "category": "computing",
  "updated": "2021-01-29T16:48:17Z",
  "author": "mike-williams",
  "summary": "You get antivirus, privacy tools and a full VPN for a bargain price with the top-end suite",
  "verdict": "VIPRE gets high scores for malware protection with some (though not all) independent testing labs, but its other features are mostly underpowered, and can't compete with the best of the rest. If price is top of your priority list, though, the steep first year discounts make it worth a look.",
  "pros": [
    "Easy to use",
    "Highly rated for accuracy at AV-Test",
    "Big introductory discount",
    "Unlimited VPN with the top-level suite"
  ],
  "cons": [
    "Few features",
    "Firewall and spam filter don't match the competition",
    "Windows versions can be disabled by malware",
    "Big price hike when the initial discount ends"
  ],
  "article": [
    "It may not have the profile of the big-name antivirus competition, but VIPRE's security expertise stretches way back to its anti-spyware beginnings as Sunbelt Software in 1994.",
    "The firm's current range begins with VIPRE Antivirus Plus for Windows, which, despite the 'Plus' of the name, is essentially just an antivirus.",
    "VIPRE Advanced Security adds a firewall, spam filter and automated updates for browsers and other apps.",
    "VIPRE Ultimate Security, the high-end suite, goes further with a VPN. Not the cut-down data-limited version you'll see with competitors like Bitdefender – this VPN offers unlimited usage. And it also throws in webcam and microphone protection, anti-tracking and document auditing, while a dark web scanner monitors the internet and raises an alert if your details appear in a data breach.",
    "Decent introductory discounts make for appealing headline prices, but the renewal fees look reasonable too. VIPRE Antivirus Plus is $10 for a 1-device, 1-year license, for instance, $35 on renewal; Bitdefender Antivirus Plus is more powerful but also fractionally more expensive at $15 initially, $40 on renewal.",
    "It's a similar story with VIPRE Advanced Security, which is a low $20 in year one for a single device, $55 on renewal.",
    "There are big savings to be made if you add devices and extend your subscription. A 10-device, 4-year Advanced Security license is priced at $399.99 for instance, just $10 per device per year (that's the standard price, too, so it won't jump up at renewal time).",
    "The high-end VIPRE Ultimate Security covers up to 5 devices for $40 in year one, $140 on renewal. If you're looking for a VPN, that'll probably cost you more than $40 all on its own, making Ultimate look like a particularly good deal.",
    "Even better, there are 30-day free trials available of VIPRE Antivirus Plus and Advanced Security; no payment details required, just hand over your email address, download and go. Works for us.",
    "VIPRE Antivirus Plus installed quickly, adding around 750MB of code (and definitions) to our hard drive, along with only four background processes.",
    "Checking the installed files, we found VIPRE using the Bitdefender engine as well as its own.",
    "Running PCMark Professional before and after installation, we found our performance score dropped by 2.6%. That's more of an impact than we've seen with antivirus products from Kaspersky (0.6%), Bitdefender (1%), Adaware (1.4%) or Avira (1.7%), but it's unlikely you'll notice any difference in real-world use.",
    "Malware often tries to disable any security products it recognizes, so a good antivirus must be able to protect itself from external tinkering. Unfortunately, VIPRE doesn't do this very well, and our tests revealed various weak spots.",
    "Key files can be edited. For example, we replaced the default 'malicious website detected' web page with one of our own, preventing the user seeing important alerts.",
    "VIPRE's Windows services couldn't be stopped, but we were able to change their startup type to 'Disabled'. After rebooting the app didn't load, and we saw no alerts or warnings.",
    "We noticed VIPRE has a command line scanner. Could this do anything useful? Yes – it can disable real-time protection from something as simple as a batch file. Windows raised the alarm by warning that both VIPRE and Defender were turned off, so there's a good chance the user would notice, but that doesn't excuse VIPRE's poor self-defense.",
    "These weaknesses can only be exploited if malware is able to run on your system without detection. That shouldn't happen very often, and even if it does, most threats won't make specific efforts to kill VIPRE products. Still, these are security holes we don't see with Bitdefender, Kaspersky or other top providers, and that has to be a concern.",
    "(Please note, our self-protection tests applied to VIPRE Antivirus Plus Windows edition only. There may be some Mac issues – if the company missed problems on one platform, that might indicate it'll do the same on another – but Macs are more difficult to attack in this way, and any risks are likely to be much smaller.)",
    "VIPRE Antivirus Plus has a plain and very simple interface, with just a little status information, a handful of scan options and a small group of settings.",
    "It's looks very basic, but there's no doubt it's easy to use. Move your mouse cursor over the dashboard Scan button, a dropdown menu of Scan options appears (Quick, Full, Custom), and you can click whatever you need. Very straightforward.",
    "You can scan files, folders or drives from Explorer's right-click menu, too. The engine can't handle simultaneous scans, though, so if it's already running a scheduled scan, you're told 'the scanner is currently busy – would you like to cancel the current scan to scan your folder?'",
    "That probably won't happen often, if ever, but it's still a small usability minus (competitors like Kaspersky enable running as many simultaneous scans as you need).",
    "Sensible interface design reduces the need to hunt around VIPRE's menus. 'Last scan was 12 hours ago', a status line told us. With some apps we'd need to go look at the logs to remind ourselves what the scan found, but here, VIPRE's text is also a link, and clicking it opened the previous scan report with all its findings.",
    "One reason for this simplicity is that there are barely any extras. The only one we noticed is a Secure File Eraser, turned off by default, which enables securely wiping confidential files from your device.",
    "VIPRE Antivirus Plus more than covers the basics, though, with on-demand and real-time malware protection, and URL filtering to keep you from suffering at the hands of malicious links.",
    "There are more settings than we expected, too. You can define the types of files the antivirus engine will automatically scan, for instance; automatically scan removable drives as they're inserted; save power by delaying updates and scheduled scans when you're not plugged in; and run a quick scan as soon as possible if a scheduled scan is missed.",
    "While none of this is particularly outstanding, it'll be enough for most users. And if you're tired of overcomplicated security products, weighed down by a host of extras you'll never use, VIPRE's more back-to-basics approach should appeal.",
    "AV-Comparatives' Real-World Protection test is an in-depth benchmark which measures how the top antivirus products handle all the very latest malware.",
    "The July-October 2020 summary report placed VIPRE in a mid-range equal 7th out of 17, with a protection rate of 99.6%. Panda, F-Secure and Trend Micro excelled by blocking 100% of threats, but VIPRE still beat big names like NortonLifeLock (99.5%), ESET and Avira (both 99.3%).",
    "Although VIPRE wasn't top of the detection rate charts, it's worth noting that it had minimal false alarms, only four across all tests. Panda, F-Secure and Trend Micro may have blocked 100% of threats, but they also raised 33, 44 and 63 false alarms respectively, a potential usability hassle.",
    "AV-Test's October 2020 Windows 10 test showed better results, with VIPRE blocking 100% of test threats. Both labs found VIPRE's products had fewer than average false positives, and AV-Test found VIPRE had less of an impact on system speed than most.",
    "That's good news, but as usual, we like to try to confirm these results, and maybe get a little extra detail, with some further tests of our own.",
    "Simple file detection tests worked just as they should, with Antivirus Plus spotting all our test samples and handling them sensibly. (There is no 'let's ask the user what to do', at least by default – threats are quarantined automatically.)",
    "Scan times are a little longer than average, though not so much that you're likely to notice. VIPRE took 46 minutes to scan our 50GB of test data, then 3 minutes 44 seconds on the second run. Bitdefender managed 39 minutes on the first scan, falling to 27 seconds next time. Kaspersky was initially faster at 19 minutes 14 seconds, but then took 2 minutes 50 seconds next time.",
    "To test behavior monitoring, we make use of various scripting tricks (run a standard Windows app, which launches PowerShell, then uses it to download and run a malicious file). VIPRE didn't stop as many of these at the behavior level as Bitdefender or Kaspersky, but it did better than others, and all malicious downloads were detected as soon as they reached our hard drive.",
    "There wasn't such good news with our custom ransomware, though. Bitdefender and Kaspersky both spotted this within a fraction of a second, killed its process and recovered the very few files our test threat managed to encrypt. VIPRE did precisely nothing, allowing it to encrypt more than 11,000 test files.",
    "This doesn't mean VIPRE can't protect against ransomware, or even brand-new ransomware; it's 100% result at AV-Test shows it mostly performs very well. The company could even argue that because our sample wasn't 'real' malware, it made the right decision by allowing it to run.",
    "What this does suggest, though, is that Bitdefender and Kaspersky are more cautious in how they handle suspect behavior, and more likely to raise the alarm than allow a potential threat to continue. And when you're thinking about ransomware, that's the approach we prefer to see.",
    "VIPRE Antivirus Plus is stripped back, easy to use and has some decent independent lab test results. However, it doesn't really stand out in any area, and the lack of self-protection against malware attacks makes it difficult to recommend.",
    "VIPRE Advanced Security extends the basic functionality of Antivirus Plus by adding a firewall, a spam filter, and the ability to automatically download and apply updates for various applications.",
    "Despite these extras, there's little change to the interface. VIPRE Advanced Security looks and feels almost identical to Antivirus Plus, with just the addition of a Firewall option in the left-hand sidebar, and additional Firewall, Updates and Email pages in the Settings area.",
    "It's still a little basic. If you like your internet security suites to be stuffed with features, this one might seem a little lightweight. But if you're happy with the essentials, and tired of suites which come weighed down with junk you'll never use, VIPRE's approach just might work for you.",
    "VIPRE Advanced Security includes a firewall to protect you from network attacks, and control what your various apps can do online.",
    "There are plenty of expert-level settings, including the ability to set firewall rules covering applications, services, ports, gateways, traffic types and more.",
    "The firewall doesn't have the intelligence you'll get with Bitdefender or NortonLifeLock, though. The best firewalls monitor your process network traffic from the start, automatically making decisions on what to block, and what to allow. By default, VIPRE just uses its standard ruleset; even if you switch it to Learning mode, the firewall asks you what to do for each unknown process. Figuring that out can be a challenge, even for experienced users, and it's easy to start approving every request without really thinking about it.",
    "The default settings could be an issue, too. The firewall includes a Host Intrusion Prevention System to stop attacks against processes on your system, for instance, while an Intrusion Detection System (IDS) protects you from attacks on the local network. Sounds great, except they're turned off by default.",
    "You could just turn them on, assuming you notice, but there are more decisions to make. By default, the IDS blocks high priority intrusions, but allows any flagged as medium or low priority. Is that a problem? What might be the consequences of blocking medium and low priority intrusions, too? Good question: we don't know, either.",
    "There is some power here. The firewall will make you safer, out of the box, and experts can tweak it to enhance their security further. But if you just want something that works, immediately, with no manual tweakery required, this probably isn't the best choice.",
    "VIPRE Advanced Security includes a spam filter which scans POP3 and SMTP traffic for junk mail. There's direct support for Outlook via an add-in, although it should work with any other local email clients.",
    "It's a very basic setup, even by security suite standards. The Outlook add-in doesn't seem to have any interface, and SSL connections aren't supported (VIPRE's website tells us these will 'cause mail to stop flowing'), plus there are no real settings beyond simple blacklists and whitelists and an On/Off switch.",
    "The filter detected 75% of our test junk emails, suggesting it has some value. But quality spam filters can block 90% or higher, and VIPRE's offering doesn't have any 'sensitivity' or other tweaks to adjust performance. If you really need a local spam filter, you'll be better off elsewhere.",
    "VIPRE's 'Manage Patches' tool is a simple feature which automatically detects, downloads and installs updates for common applications.",
    "The official list of supported apps is short and outdated (it still includes Yahoo Messenger, shut down in July 2018), but does include some important products: Chrome, Opera, Firefox, Adobe Reader, and freeware tools including VLC Media Player, Paint.Net and more.",
    "This worked as advertised for us, with the patch manager detecting updates for Firefox, Opera, VirtualBox, FileZilla and PDFCreator.",
    "Updates happen automatically by default, but if you're the hands-on type, you can configure VIPRE to ask for your approval first.",
    "Whatever approach you take, we found our updates were successfully installed in the background, with no further hassles from setup tools or anything else.",
    "Overall, the patch manager does a basic job, but we're not sure we'd want to pay for it. Most of the supported apps handle their own updates without any issue. If you do want to do everything from a single tool, Avira's Software Updater covers more applications, or you can use Ninite's one-stop installer and updater for free.",
    "VIPRE Advanced Security scores well with some testing labs, and isn't a bad suite at all, but just doesn't offer any compelling reason to choose it ahead of the top competition.",
    "VIPRE Ultimate Security is a bundle of three applications. VIPRE Advanced Security provides antivirus, firewall and a spam filter, as we’ve seen above. VIPRE Privacy Shield enables taking control over your digital tracks, both locally and online. Finally, VIPRE Internet Shield is a full and unlimited VPN.",
    "The VPN is the real bonus here, especially in the first year, where a steep introductory discount means you get everything for just $40. You'd probably spend more than that elsewhere for the VPN alone (ExpressVPN charges $100 for its 1-year license).",
    "It's a different story at renewal time, when the discount expires and the price jumps to $140. Still, if you're happy with VIPRE antivirus, VIPRE Ultimate Security might be worth a try, if only for the cheap first year.",
    "VIPRE Internet Shield is a simple VPN which isn't exactly leading-edge, but more than covers the basics. We're giving the service a quick evaluation here as part of this suite review, but do note that for the complete lowdown, we already have a full review of VIPRE Internet Shield which you'll find here.",
    "Internet Shield gives you 80+ locations across 50+ countries, which is not the largest VPN network we've ever seen, but should be more than enough for most users. (We're unsure why the website talks of 'hundreds' of locations, though; they weren't visible from our Windows client.)",
    "Internet Shield doesn't support WireGuard or have any other speedy custom protocols. But there is OpenVPN and IKEv2 (on Windows), and a kill switch to protect you if the VPN drops, and that's also probably enough.",
    "You can use the service on up to 5 or 10 devices (depending on your Ultimate Security license), and there are apps for Windows, Mac, iOS and Android.",
    "And if you're wondering why you should trust an antivirus company to supply you with a VPN, relax; Internet Shield is powered by WLVPN, a white label VPN company used by companies like Namecheap to deliver a branded VPN. We've found from previous reviews that WLVPN provides a reasonable mid-range service, not the best, but as we've said above, enough for most users.",
    "Internet Shield's Windows offering is a simple and very generic VPN app, but there's no doubt it's easy to use.",
    "Tap Connect on the opening page and it'll connect you to the nearest server, for instance, or you can choose another from the location list. There's no favorites system, so you must find your preferred locations each time, but a search box might speed that up, and server load figures help you make the right decision.",
    "A decent group of settings cover what happens when the app starts (whether it automatically connects, and if it should use the last connected or the fastest server), your preferred protocol (IKEv2 vs OpenVPN), and whether to disable internet access and attempt to reconnect if the VPN drops (the kill switch).",
    "OpenVPN settings include a Scramble option which might help you bypass VPN blocking, and the ability to choose your preferred encryption method (AES-256-CBC or AES-128-CBC.)",
    "The most unusual feature is probably the app's support for keyboard shortcuts, where for instance pressing Alt+C connects to the default server, and Alt+D disconnects. It's a small usability plus for some people, and we're happy to see it here.",
    "Internet Shield's lack of a favorites system is an issue, and switching servers is more awkward than it needs to be (you must close the current connection before you start another), but it's otherwise simple to use.",
    "Connection times were normal during testing at an average 2 seconds for IKEv2, 10 seconds for OpenVPN.",
    "We checked Internet Shield's OpenVPN and IKEv2 configurations for issues, and found none; they were set up securely and using the promised level of encryption.",
    "The app did a good job of handling connects and disconnects. Desktop notifications told us when we were protected and when we weren't, and when we forced the VPN to drop, the app noticed and raised the alarm.",
    "The kill switch worked perfectly. Whether we used OpenVPN or IKEv2, and whatever we did to close the connection, the app immediately blocked our internet access and didn't restore it until the VPN was back up.",
    "Internet Shield's unblocking performance was mixed; it got us into US Netflix, but failed with BBC iPlayer and Amazon Prime, and delivered inconclusive results with Disney+ (we couldn't stream while connected, but there were no location-related errors, so it's possible there was some other issue involved).",
    "VIPRE Privacy Shield is an interesting standalone application which provides various ways to identify and fix privacy issues.",
    "The Login Credentials tool scans your browsers for stored passwords, for instance. Even if you use a password manager right now, it's possible you have some old credentials saved in a browser somewhere. If you do, Privacy Shield finds, displays and allows you to delete them.",
    "The Browsing Tracks panel displays details of Chrome, Firefox, Edge and IE browsing histories, and enables wiping them. You can do this from each browser individually, of course, but it's easier from one central dashboard.",
    "The Documents tool scans Office, text, PDF and other files, analyzes them and warns you of any it thinks contain sensitive information. You can then check the file yourself, and if you think it's confidential, move it into an encrypted vault.",
    "This is a good idea, and did pick up one or two relevant documents on our test system, but these were swamped by false alarms. A text list of Canadian Prime Ministers was listed as an 'Insurance/ Medical' document, for instance; an old PDF history of an English village was tagged as 'Financial'. We couldn't even double-click a file to check it, making the tool awkward to use.",
    "The Dark Web module searches major data breaches for any email address or password you specify, then displays the results. That's useful, but VIPRE gets this information by running a search at haveibeenpwned.com, which you could do for free right now.",
    "Privacy Shield also includes tools to defend your system in more active ways, including webcam and microphone protection, and advert plus tracker-blocking extensions for Chrome, Firefox and Edge.",
    "Our tests showed the webcam and microphone protection was unusually aggressive, with our media-grabbing apps closed as soon as they tried to access the devices. That could be an issue, especially as there's no VIPRE alert to explain what's happened. If the app is legitimate, you won't know why it's closed; if it's not, you won't know it's tried to capture audio or video. We would prefer this functionality in the antivirus, where you're routinely informed of process actions and can review them in the logs.",
    "Put it all together and Privacy Shield is difficult to judge. It deserves some credit for trying to do things differently, with features you won't often see elsewhere, but most of these aren't nearly as effective as we'd like. We might use some Privacy Shield features because it's bundled with the suite, but it's not an app we'd buy standalone.",
    "We wouldn't buy VIPRE Ultimate Security for its so-so antivirus and privacy tools, but if you're looking for a simple VPN and price is your top priority, that discounted first-year price of $40 could be very tempting."
  ],
  "headers": {
    "18": "Antivirus",
    "27": "Protection",
    "38": "Final verdict",
    "42": "Firewall",
    "48": "Spam filter",
    "51": "Manage Patches",
    "57": "Final verdict",
    "61": "VIPRE Internet Shield",
    "71": "Using Internet Shield",
    "77": "VIPRE Privacy Shield",
    "86": "Final verdict"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "VIPRE Antivirus Plus": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5373658464098289000/https://www.vipre.com/vipre-home-protection-products/",
    "list": "https://homesupport.VIPRE.com/support/solutions/articles/1000070639-what-third-party-applications-does-auto-patch-work",
    "Ninite's": "https://ninite.com",
    "here": "https://www.techradar.com/reviews/vipre-internet-shield-vpn"
  }
}