{
  "source": "https://www.techradar.com/reviews/cleer-next",
  "title": "Cleer Next review",
  "category": "audio-visual",
  "updated": "2021-11-24T13:41:42Z",
  "author": "olivia-tambini",
  "summary": "Clarity is the name of the game with the Cleer Next",
  "verdict": "The Cleer Next over-ear headphones are aimed squarely at audiophiles, and they don't disappoint. With innovative drivers and a premium design, they look and sound the part, although they aren't the most dynamic headphones we've ever heard – or the cheapest for that matter.",
  "pros": [
    "Fantastic clarity",
    "Wide soundstage",
    "Sturdy build"
  ],
  "cons": [
    "Very expensive",
    "A little heavy",
    "Sound could be more dynamic"
  ],
  "article": [
    "You may not have heard of Cleer Audio, but the San Diego audio company made a big impression at CES 2020 in Las Vegas with its latest range of speakers and headphones, including the Cleer Next.",
    "Billed as audiophile headphones by the company, these high-spec cans feature Cleer’s patented motor design, which uses “20 strategically layered rare earth magnets” in place of the usual iron magnets.",
    "According to Cleer, this leads to “enhanced efficiency and lower distortion”, which should make your music sound fantastic. But are the Cleer Next worth the high price? We put the wired over-ear headphones to the test to find out.",
    "The Cleer Next headphones are available to buy now for $699 / £699; that works out at around AU$1040, but we’re yet to receive official Australian pricing.",
    "That’s pretty expensive when you compare them to our top headphones for 2020, the Sony WH-1000XM3 Wireless, which cost about half the price at $349 / £300 / AU$499.",
    "It’s not unusual for audiophile headphones to cost well over $500, though; the Focal Stellias are among our favorite headphones, and to buy them you’d need to part with an eye-watering $3000 / £2,799 (around AU$4,200).",
    "It’s not often that we pay much attention to packaging, but everything about the presentation of the Cleer Next feels very luxurious – it seems as though a lot of care has been taken, from the presentation-style box, to the faux-leather carrying case that comes with these open-back headphones.",
    "The headphones themselves certainly look striking, with a metallic purple and black color scheme, and an architectural design that accents hardware like hinges and screws – the overall effect is somewhat industrial, in stark contrast with the clean lines of the Sony WH-1000XM3. It’s not a look that will appeal to everyone, but it’s not unusual for audiophile headphones to be a little bulkier than less high-spec models.",
    "The earcups and headband are padded with thick leather, which means they’re not suitable for those who avoid using animal products. The generous padding, as well as the roomy feel of the earcups mean that they feel quite comfortable during long listening sessions – although the weight of the headphones does take some getting used to, and you may find that the top of your head feels a little sore after a while.",
    "You’ll find an audio plug at the bottom of each earcup, so you can have your cable feeding into both the left and right sides of these balanced headphones. This should reduce any electromagnetic interference from producing unwanted noise thatt can be a problem for unbalanced headphones, making your audio sound truer to the original source.",
    "This audio cable ends in a 3.5mm stereo jack, but you also get a 6.5mm adapter, which is useful if you want to use the Cleer Next with other audio components like AV receivers or music streamers.",
    "The Cleer Next come with a faux leather carrying pouch, with a compartment for the headphones themselves and a zipped compartment for your cables. The inside of the pouch is lined with a soft fur-like material, which should keep your cans safe from scrapes.",
    "If you’re looking for mod-cons like wireless connectivity, noise cancellation, or built-in support for your voice assistant, you won’t find them in the Cleer Next headphones. These are made purely for sitting back and enjoying your music, and as such, Cleer has largely focused on the audio tech inside the cans rather than additional features.",
    "As we mentioned earlier, the Cleer Next feature 40mm Ironless drivers with magnesium diaphragms, designed to lower distortion while providing a vivid sound.",
    "Listening with our Denon PMA-60 amplifier, we were struck by how much detail these headphones provide, with a clear, expansive sound and a good separation between the left and right channels.",
    "We put them to the test with the chaotic sound of Death Grips’ Giving Bad People Good Ideas, and even as the track descended into riotous distorted guitars, pounding drums, and digital interference, we could pick out each element with ease. Vocals were prominent without sounding harsh, while bass is tightly controlled and lively.",
    "That theme continued as we listened to Bruno Mars’ 24K Magic, with bounding synths and bouncing bass lines handled with dexterity and musicality. The people around us noted that they could easily heard what we were listening to; this is normal for open back headphones, which allow air to pass in and out of the earcups. While this provides a more ‘open’ sound, it does mean that these cans won’t be suitable for listening with in public (unless you want everyone to hear your cheesy music tastes).",
    "Moving onto the clear, bright tones of Hoppípolla by Sigur Rós, there’s still a good level of detail, with dreamlike panned vocals and grand orchestral motifs adding a sense of space to the mix.",
    "Are these the most dynamic headphones we’ve ever heard? No, and we sometimes craved a little more vibrance, and perhaps a little more warmth from the soundstage. Everything’s very accurate-sounding, and while that’s no bad thing from audiophile headphones, the Cleer Next don’t have the unusually wide soundstage that makes the Focal Stellias as immersive as they are detailed (although it’s worth noting that the Stellias are far, far more expensive).",
    "They fare better on the next Sigur Rós track, though; in Gobbledigook, thumping drums, claps, and sliding guitar chords provide the perfect backdrop to angelic falsetto voices in tongue-twisting harmony.",
    "It’s impossible not to be impressed by the sound quality offered by the Cleer Next headphones; they sound incredibly detailed, with all the clarity (and then some) you’d expect from cans with such a high price tag.",
    "The design is an acquired taste, and they do feel a little heavy at times – saying that, the Cleer Next feel well built, with lots of attention to detail in their construction and presentation.",
    "Feature-wise, the Cleer Next can’t compete with the likes of the Sony WH-1000XM3 – but they don’t intend to. These are headphones for plugging into your amp, sitting back, and enjoying your music in crisp high fidelity – and for that purpose, they’re very good indeed."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "12": "Features and audio quality",
    "20": "Final verdict"
  },
  "links": {
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "audiophile headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Sony WH-1000XM3 Wireless": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Focal Stellias": "https://www.techradar.com/reviews/focal-stellia-review",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "AV receivers": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy",
    "music streamers": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "wireless": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Denon PMA-60": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4232626719083143700&xs=1&url=https%3A%2F%2Fusa.denon.com%2Fus%2Fproduct%2Fhifi%2Famplifiers%2Fpma60&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fcleer-next"
  }
}