{
  "source": "https://www.techradar.com/reviews/alienware-m17-r3-2020",
  "title": "Alienware M17 R3 (2020) review",
  "category": "computing",
  "updated": "2021-11-11T01:16:44Z",
  "author": "jeremy-laird",
  "summary": "Alienware’s 17-inch gaming beast get updates for 2020 including a 300Hz display",
  "verdict": "Alienware’s gorgeous 17-inch gaming beast get updates for 2020 including a 300Hz display and improved cooling, but tragic battery life remains",
  "pros": [
    "Great build quality",
    "Nice features and components",
    "Good cooling maximises GPU performance"
  ],
  "cons": [
    "1080p panel not very vibrant",
    "Keyboard a tiny bit disappointing",
    "Tragic battery life"
  ],
  "article": [
    "The newly revised Alienware M17 R3 has the latest in everything - CPUs from Intel, GPUs from Nvidia, a 300Hz display - basically, all the good stuff.",
    "On the outside, it’s Alienware’s now familiar ‘Legend’ design, which also happens to be not only Alienware’s best looking series of gaming portables, but also its slimmest. For 2020, a few details have changed, including a new stain and smear-resistant coating for the chassis and a keyboard with increased 1.7mm travel.",
    "It’s on the inside, however, where Alienware has worked hardest to up the gaming ante. Alienware has put more effort into improved heat dissipation for 2020 than any previous laptop series. Highlights include re-engineered ‘cryotech’ cooling with 39 per cent more copper, a brand vapor chamber solution for the CPU and 25 per cent more fan blades for both CPU and GPU.",
    "Long story short, all that effort with cooling in this relatively slim 17-inch chassis pays dividends. Fitted with an Nvidia GeForce RTX 2070 Super Max-P, the Alienware M17 cranks out similar numbers in the most demanding games to its smaller 15-inch M15 brother, when the latter is powered by the RTX 2080 Super Max-Q.",
    "That’s because the superior cooling allows for better clockspeeds. The 2070 Super in the M17 boosts to 1,380MHz where the 2080 Super Max-Q in the M15 tops out at 1,230MHz. The gap in memory clocks is even bigger. There the M17 rocks 1,750MHz graphics memory to the M15’s 1,375MHz. Together, those frequency advantages make up for the fact that the 2070 Super makes do with 2,560 CUDA cores the the 2080’s 3,072.",
    "Anywho, the graphics performance is a great match for the M17 as specified here. Specifically, that means a 1080p display with an epic 300Hz refresh rate. OK, you’re not going to hit 300fps in the latest and most graphically demanding titles, as our benchmarks demonstrate. But this laptop will absolutely excel in esports games like CS: Go.",
    "Unfortunately, while the screen is fast, it’s not terribly impressive in other regards. Brightness, contrast, colors; they’re all a little disappointing. It’s not a bad panel. But it is a weak point and disappointing given the price. There is a much brighter (on paper) 4K option. But we’d prefer to see a 1440p (2,560 by 1,440 pixels) option. That would be a better fit with the real-world performance from today’s mobile graphics chips.",
    "Elsewhere, you get a fast 512GB M.2 SSD, 32GB of RAM (note that the memory is soldered and not upgradable) and Intel’s top eight-core mobile CPU. All very impressive, bar battery life which is even worse than we expected, but no less than you’d hope for given the price. Add it all up and the revised Alienware M17 R3 for 2020 is really just an improved display and maybe a few more hours of battery life away from greatness.",
    "Pricing for the revised Alienware M17 for 2020 kicks off at $1,600 / £1,849 (around AU$2,200), which is surprisingly affordable for Alienware’s flagship 17-inch portable gaming machine. But that’s equipped with a weedy AMD Radeon RX 5500M GPU with limited gaming grunt. As configured for review and much better specified for serious fun, you’re looking at a far heftier $3,299 / £2,999 (around AU$5,750).",
    "For your money you get some pretty choice components, including Intel’s finest eight-core mobile CPU, a 512GB M.2 SSD and a 300Hz 1080p display. The graphics subsystem is the Nvidia GeForce RTX 2070 Super, which isn’t quite the best currently available. However, thanks to the M17 large form factor and improved cooling, you get graphics performance on about a par with a 2080 Super Max-Q. That said, you can get the M17 with the 2080 Super Max-P. If you’re spending $3,000 / £3,000-plus already, you may as well go all the way to the 2080.",
    "Of course, you can get similar components for less money in laptops from brands like Gigabyte and MSI. But not with the same quality of build and design. The latest M17 is a fine looking device with a premium feel that previous Alienware rigs have arguably lacked.",
    "Alienware’s latest ‘Legend’ design aesthetic debuted early last year in the monumental Area-51M 17-inch beast. It’s since filtered down to the relatively thinner and lighter M15 and M17 models.",
    "For 2020, it’s been given a very mild makeover. At a glance, the Alienware M17 R3 for 2020 looks near identical to the 2019 model.",
    "However, on closer inspection you’ll find the soft-touch chassis finish has been superseded by a harder-wearing coating that Alienware says is more resistant to marks and stains.",
    "The keyboard also benefits from a longer 1.7mm travel, though the bed of the M17’s keyboard isn’t quite as firm as we would like. There’s a little bounce from which the smaller M15 doesn’t suffer. Still, the per-key RGB lighting will keep you busy, if you like that kind of thing.",
    "Other detailed improvements include upgraded speakers. The four-way (two woofers and two tweeters) speakers are claimed to deliver a 2.5x bass and 2x treble improvement over the M17 R2, plus 30% more loudness over the full audio range.",
    "The overall physical proportions of the M17 remain largely the same. It ranges from 2.5 to 2.97kg depending on specification and clocks in at 22mm or 0.86 inches. So, it’s pretty slim for an out-and-out 17-inch gaming beast. But not something you’d want to lug about, especially given the heft of the power supply.",
    "However, it’s really on the inside where the big changes have been made to the M17. The ‘Cryotech’ cooling system is heavily revised. Alienware reckons the heat sinks and pipes now contain 39% more copper than before, which the number of fan blades have increased by 25%.",
    "What’s more, the CPU now has a vapour chamber solution for even better heat dissipation. That’s welcome if not critical given that cooling Intel’s 14nm CPUs has become an increasing problem for all laptop makers.",
    "Elsewhere, our M17 review unit was specified for high speed gaming courtesy of a 300Hz 1080p display. There is a 4K option, but that resolution remains arguably too demanding for mobile graphics chips. A 1440p or 2,560 by 1,440 pixel option would be nice, but unfortunately remains rare in portable PCs.",
    "Ports-wise, you get three high-speed USB-A sockets, one USB-C with Thunderbolt 3 support, HDMI, ethernet and MicroSD.",
    "All your bases are therefore pretty much covered and our only complaint is the Mini rather than full DisplayPort socket. Given the size of the chassis, a full-sized port would fit just fine and minimise the chances of cable-related frustration.",
    "The real-world benefits of the improved cooling of the M17 are clear enough in our benchmark numbers. When it comes to in-game performance, this Nvidia GeForce RTX 2020 Super-powered laptop delivers very similar frame rates to its M15 cousin with a 2080 Super Max-Q. That’s thanks to the higher GPU core and particularly memory clockspeeds the large and more heat efficient chassis can sustain.",
    "Generally, the 2070 Super in this implementation has plenty of performance in even the most demanding games, like Metro Exodus and Total War: Three Kingdoms. Even at the very highest image settings, you’re getting over 60fps average at 1080p.",
    "It makes for a good match with the 300Hz 17-inch display, which is of course 1080p native. Most esports titles will absolutely fly on this laptop and feel insanely responsive thanks to ample GPU power and that crazy high refresh rate. The only pity is that the LCD panel is pretty dingy.",
    "It’s rated at 300nits, which is fairly pedestrian, subjectively doesn’t even feel that bright. The colors also lack vibrancy and the contrast is nothing special, either. In this age of near-ubiquitous HDR support, the M17’s screen feels very old school SDR.",
    "Elsewhere, the M17’s performance is hard to fault. The eight-core Intel chip is all the CPU you’ll ever need for gaming and - critically - doesn’t throttle under heavy loads, while the M.2 SSD ensures fully contemporary storage performance, even if 512GB isn’t enough for a really decent game library.",
    "There’s space inside for another M.2 drive, however, along with Thunderbolt 3 connectivity to external drives. So you have plenty of options for adding space for a really huge library while maintaining decent performance.",
    "Our expectations for mains-free operation were pretty modest given the gaming remit and 17-inch form factor.",
    "The Alienware M17 still managed to undershoot them with just over two and a half hours of undemanding video playback with the screen set to half of its underwhelming peak brightness.",
    "Nobody sensible buys this kind of system assuming great battery life. But you’d be justifying in expecting a bit better than a couple of hours."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "11": "Design",
    "22": "Performance",
    "28": "Battery life",
    "31": "Don't buy it if..."
  },
  "links": {
    "cooling": "https://www.techradar.com/news/best-laptop-cooling-pad",
    "M15": "https://www.techradar.com/reviews/alienware-m15-r3-2020"
  }
}