{
  "source": "https://www.techradar.com/reviews/edraw-max",
  "title": "Edraw Max review",
  "category": "computing",
  "updated": "2020-07-31T16:22:23Z",
  "author": "john-faulds",
  "summary": "There’s no diagram or chart that Edraw Max can’t handle",
  "verdict": "Edraw Max is a powerful, fully-featured drawing app that will suit experienced users and organizations with varied drawing requirements. However, it may overwhelm inexperienced users and be overkill for smaller organizations.",
  "pros": [
    "Creates more than 280 types of diagram",
    "Huge library of templates and examples",
    "Works on Windows, macOS, and Linux"
  ],
  "cons": [
    "Overwhelming for beginners and those less tech-savvy"
  ],
  "article": [
    "Edraw Max is a diagram software program that will work on Windows, macOS, or Linux. It is produced by Edraw, which also makes software products for creating mind maps, Gantt, org and flow charts, infographics, floor plans, and network and industry diagrams.",
    "Edraw Max combines the capabilities of all those products into one, so if your requirements are more limited, you may be better off purchasing the software specific to your use case.",
    "Edraw Max has three categories of pricing—Individual, Business, and Academic/Non-Profit – with each of those having three licenses—Subscription, Perpetual, and Lifetime.",
    "Full access to all software functions and 280 types of diagrams is available for all the licenses across all three categories, as is 1GB of cloud storage space. And in each case, the license can be used for two devices.",
    "For each category, the Subscription license is paid monthly, and the software will only work on Windows. You’re also guaranteed one year of upgrades and support. The Perpetual license will work on Windows and macOs and is a one-off purchase with three years of free upgrades and support. The Lifetime license is also a one-off purchase, but will also work on Linux and comes with a lifetime of free upgrades and support.",
    "The subscription license is $99, which works out at $8.25/month for the first year. Pricing is then reduced to $5.75/month if you renew. The Perpetual license will cost $116.40 and the Lifetime license $159.30.",
    "The subscription license is $69.30, with the price remaining the same for both the first year and subsequent years. The Perpetual license is $125.30 and the Lifetime license $171.50.",
    "Pricing for the Business category is per user, and everything produced with the software can be used for commercial purposes.",
    "The subscription license pricing is the same as for the Individual plan but is for a single user. Pricing goes up to $1,299 for 20 users. The Perpetual license starts at $179 for a single user and goes up to $1,999 for 20, and the Lifetime license goes from $245 up to $2,999.",
    "Edraw Max is an all-in-one diagram-making tool that can be used for flowcharts, mind maps, fishbone, network and UML diagrams, floor plans, office layouts, Gantt charts, business cards and flyers, wireframes, infographics, and presentations.",
    "There are thousands of templates to choose from, all designed by professionals. Edraw Max also boasts extensive file compatibility, which will allow you to import files from Visio or export your own drawings to Visio, Word, Powerpoint, HTML, PDF, and image formats like JPEG and PNG.",
    "Each type of diagram has pre-existing libraries of industry-standard symbols. Although they strictly follow the standards, all the symbols are also easy to customize, allowing you to change color and line styles.",
    "For those who work or learn more quickly by copying existing examples, each type of diagram comes with a large collection of real-world examples which you can use as your starting point, simply replacing the content with your own.",
    "Because Edraw Max is based on cloud storage, you and your team will also be able to work on the same project at the same time on any device.",
    "To start using Edraw Max, download it from the company’s site and run the installer. When you first open the app you’ll be presented with a list of available template categories. You can either choose a template or a pre-existing example.",
    "After you’ve chosen a template, you’ll move to the workspace. There are toolbars on top and to the left and right of the canvas on which you do the drawing. If you’ve chosen a particular type of diagram, the left menu will present you with a library of associated shapes. If you choose a pre-existing example, the canvas will be filled with that, and you can then click on elements to edit or remove them.",
    "Unlike many graphic design or desktop publishing apps, there’s no file menu with Edraw Max. The button in the top left corner that says ‘File’ actually takes you back to the template-browsing interface, and from there, the arrow in the top left corner will return you to the workspace.",
    "People who are familiar with graphic design and desktop publishing apps will get the hang of Edraw Max relatively quickly, but there is a lot going on in terms of different toolbars, and it may be a bit overwhelming for those not used to this sort of interface.",
    "The Help menu in the app has buttons for Dynamic Help, Tutorial, and FAQ. The latter two both link to pages on the Edraw Max website, while Tutorial presents a series of videos. However, there is no search feature, and there’s quite a bit of clicking and scrolling required to find what you’re looking for.",
    "Dynamic Help opens a sidebar in the app which presents a list of guides on how to accomplish different tasks, but again, it isn’t searchable, and it may be easier to view the PDF user manual (linked from Dynamic Help) and use your browser’s search function to more quickly find answers.",
    "If you have a technical issue, you can visit the Edraw Max Support Center and send a message via email.",
    "Edraw Max has many competitors, including Microsoft Visio, Lucidchart, SmartDraw, Cacoo, and Creately.",
    "Unlike most, Edraw Max can only be installed on a computer, and it doesn’t offer an online version. Possibly for that reason, the interface for Edraw Max is much more complicated than the others, because recreating that type of interface for the web would be too difficult.",
    "Edraw Max is a powerful, fully-featured drawing app that has more than enough features, templates, and examples for its users to accomplish any task they set out to achieve.",
    "But while that abundance of functionality may be attractive to experienced power users and organizations that need to create a large variety of diagrams, it may also be off-putting to people who are less familiar with these sorts of apps or organizations whose needs are less extensive."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "9": "Features",
    "14": "Interface and In Use",
    "18": "Support",
    "21": "The Competition",
    "23": "Final Verdict"
  },
  "links": {
    "diagram software program": "https://www.techradar.com/best/best-flowchart-software",
    "mind maps": "https://www.techradar.com/best/best-mind-map-software",
    "business cards": "https://www.techradar.com/best/best-online-business-card-printing-service",
    "presentations": "https://www.techradar.com/best/best-presentation-software",
    "HTML": "https://www.techradar.com/best/html-online-courses",
    "PDF": "https://www.techradar.com/news/the-best-free-pdf-reader",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "graphic design": "https://www.techradar.com/best/best-graphic-design-software",
    "desktop publishing apps": "https://www.techradar.com/best/best-dtp-software",
    "email": "https://www.techradar.com/best/best-email-clients",
    "Microsoft Visio": "https://www.techradar.com/reviews/microsoft-visio",
    "Lucidchart": "https://www.techradar.com/reviews/lucidchart",
    "SmartDraw": "https://www.techradar.com/reviews/smartdraw",
    "Cacoo": "https://www.techradar.com/reviews/cacoo",
    "Creately": "https://www.techradar.com/reviews/creately"
  }
}