{
  "source": "https://www.techradar.com/reviews/ibm-tealeaf",
  "title": "IBM Tealeaf review",
  "category": "computing",
  "updated": "2020-05-18T10:22:12Z",
  "author": "saad-mohammad",
  "summary": "Use Tealeaf to understand your customers, improve marketing ROI, and drive sales",
  "verdict": "Tealeaf is an up-and-coming player in the digital marketing CRM space and benefits from integrations with IBM’s Watson to deliver accurate analytics and business insights.",
  "pros": [
    "Wide range of features",
    "Understand your customers on a granular level",
    "Extract insights from large datasets in seconds"
  ],
  "cons": [
    "Unclear pricing",
    "Advanced features may be too complex to use",
    "Not meant for a wide audience"
  ],
  "article": [
    "Tealeaf is a digital marketing customer experience management (CEM) solution owned by IBM. It runs on an advanced behavioral analytics engine that allows you to record data from customer visits, including web interactions, from the perspective of customers themselves.",
    "Tealeaf allows you to pinpoint errors, understand how your customers use your solutions, and build faster, more performant web and mobile experiences for your clients. It can help your design, compliance, IT, and even legal teams build a 360-degree view of your online customers. This allows you to design better mobile experiences, address customer issues in using your applications, improve engagement and, ultimately, increase sales.",
    "Tealeaf works as a web application on desktop and mobile. It also comes with flexible deployment models, including cloud, on-premises, and hybrid cloud/on-premises. For pricing, you must contact the sales team with information about your business, needs, and how you intend to use the application before you are given a quote.",
    "Software-as-a-Service (SaaS) applications like this one often use perpetual or commercial licenses, but Tealeaf uses a subscription model that is charged per user per month. In this way, the cost of customizing Tealeaf to your requirements is less than the cost of using a perpetual license, but recurring costs are higher. Also, for access to premium support, training, and data migrations, additional fees may apply.",
    "With regards to these additional fees, estimates vary, but you can expect to pay about $500 for a training session, $2,500 for migrating 10,000 records, and $10,000 for standard customization with three to five existing systems. These figures scale up or down depending on the types of training, migrations, and customizations you need. However, for more training, migrations, and integrations, your per-unit cost will fall.",
    "There are a number of limited-time deals available now, depending on when you intend to set up and install the application. Current deals include managing unstructured data starting at $18.55 per terabyte, improving requirements management workflows at $850 per five users per month, and access to personalized AI-powered analytics at $15 per user per month.",
    "Tealeaf comes with a rich array of features that power the analysis of customer data and the customization of mobile apps for a wide range of industries. Here are some of the key features of the software.",
    "AI-Powered Analytics",
    "Tealeaf gathers and analyzes customer data to improve engagement and conversion rates. Integrations with Watson Marketing, a proprietary AI tool from IBM, can be used to improve the performance of other solutions your business uses. You can even visualize customer journeys so that you can see exactly how customers use your sites and applications.",
    "Detect and Combat Fraud",
    "With digital records of online transactions, you can more effectively identify and fight fraud, to which the insurance industry, for example, loses about $80 billion annually.",
    "Because Tealeaf captures and saves customer interactions in real-time, anyone suspected of fraud can be automatically blocked from accessing sites, and companies can hold off on fulfilling online orders or completing other important tasks until an investigation can be conducted.",
    "Integrate Data, Track Effectiveness, and Overcome Abandonment",
    "You can transfer customer data between Tealeaf and other software solutions you have to extract customer insights from multiple sources. These insights can then be used to power your data-driven marketing initiatives. They can also help you overcome issues of customer abandonment, which happens when customers struggle to use your apps.",
    "Work Smarter",
    "If you have a question, need a specific metric or report, or want to deep-dive into a given area of your business, all you need to do is ask Watson, just as you would ask a teammate. It will give you an answer within seconds.",
    "The competitive edge of Tealeaf over other players in this space is the integration of Watson with all of Tealeaf’s functions. It is what powers anomaly detection, helps you optimize design and usability, and lowers customer service response times.",
    "Tealeaf has a great UI that provides you with all of the functions and features you need to understand and manage your data within a few clicks. For example, there is a dashboard for mindset analysis, through which you can identify users who are in the discovery, comparison, acquiring, use, or advocacy stages of their purchasing journey.",
    "You can also see where your customers are coming from – whether mobile sites or desktop/laptop sites. You can easily isolate customer data based on device, type of interaction (social mention, customer query, cart purchases), how long they took on a given page or step, and how much you are generating per customer on a given platform.",
    "For some users, the mobile buttons may be a little hard to use, and the sheer functionality of the application as a whole may make it clunky for some. However, given the type of analysis Tealeaf is expected to conduct, the buttons, functions, and dashboards are quite user-friendly.",
    "Tealeaf provides support in English via an online contact form and a toll-free helpline. There are also detailed videos, PDF instructional manuals, and community forums available in case you run into any trouble and need answers on how to use the software.",
    "The IBM Global Directory can also be used by businesses that run operations in multiple countries. Finally, Tealeaf provides access to open-source code repositories, developer conferences, installation and implementation documentation via Redbooks, and an online ticket system for issues with hardware, software, deployments, invoices, and contracts.",
    "We compared Tealeaf with Qualtrics and Appcues, two of the leading data analytics and CRM software solutions on the market, focusing on cost and UI.",
    "Budget",
    "Qualtrics uses a subscription model that requires annual renewal of your plan. Subscriptions start at $1,500 per year and go up to $5,000 a year depending on the features you need, the number of active users that will use the software, and the size of your business.",
    "Meanwhile, Appcues has an Essentials package at $249 per month for three users. This plan gives you access to analytics only. The Growth package costs $879 per month for ten users and gives you access to all integrations.",
    "Qualtrics is best suited to businesses that are established or are growing rapidly and need to perform advanced behavior analytics to continue doing so. Both Tealeaf and Appcues are great for small businesses or startups that want a few basic CEM features that are quick to deploy and easy to understand.",
    "UI",
    "The UIs of all three platforms are comparable. Based on your needs and the package you choose, your dashboard will feature the tools and functions you have access to. Tealeaf has the advantage in terms of the ease with which features and buttons can be used, but all three products provide their users with a friendly and seamless UI.",
    "Tealeaf is an advanced CRM solution that benefits heavily from innovative integrations with Watson, IBM’s AI application. Whether you want to tackle customer drop-off issues, understand how and where your marketing initiatives are working or lagging, or want to design a new ad campaign, Tealeaf can provide you with the insights needed to do so.",
    "In terms of shortcomings, the only notable issue is that it can be somewhat difficult to understand how to use the various features Tealeaf comes with. Unless you really know what you need the software to do, you may find yourself somewhat lost. However, for savvy adtech and martech professionals who are looking to up their marketing game with a great piece of analytical software, Tealeaf is a real winner."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "17": "Interface and in use",
    "20": "Support",
    "22": "The competition",
    "29": "Final verdict"
  },
  "links": {
    "customer experience management": "https://www.techradar.com/best/cx-tools",
    "CRM software": "https://www.techradar.com/best/the-best-crm-software"
  }
}