{
  "source": "https://www.techradar.com/reviews/pc-inspector-file-recovery-review",
  "title": "PC Inspector File Recovery review",
  "category": "computing",
  "updated": "2020-04-21T09:17:06Z",
  "author": "daniel-blechynden",
  "summary": "In our PC Inspector File Recovery review, we show why you should reconsider using this software",
  "verdict": "Although the free PC Inspector File Recovery tool might seem like a good choice, its poor performance and inability to retrieve deleted files suggest you should think twice about using it.",
  "pros": [
    "Freeware",
    "Easy to download and set up"
  ],
  "cons": [
    "Confusing user interface",
    "Couldn’t retrieve files from an external hard drive"
  ],
  "article": [
    "We’ve been searching for the best data recovery software on the market, and during our search, we came across the PC Inspector File Recovery program. It’s completely free, forever, and it enables the recovery of all file types from hard drives and external storage devices. In the rest of this PC Inspector File Recovery review, you will discover whether or not this is the right data recovery software for you.",
    "PC Inspector File Recovery is a freeware program distributed by Convar. It doesn’t cost anything, and even commercial clients can use it for free, forever. It can be run in the background and is designed to recover a range of deleted or lost files, including those with missing header entries.",
    "Unfortunately, though, the software is only compatible with Windows computers. On top of this, it can’t be installed on the drive you want to scan. This could make it difficult if you’re using a computer with only one drive set up.",
    "The PC Inspector File Recovery program certainly doesn’t come with the most powerful features we’ve ever seen, but it’s not bad for a free program. For starters, it supports both the FAT 12/16/32 and NTFS file systems. It’s designed to recover files with as much original data as possible, including names and time and date stamps.",
    "In addition, partitions can be found automatically when you’re using PC Inspector File Recovery, even if information is missing. Recovered files can be saved on network drives, and the program is compatible with external hard drives and USB sticks.",
    "Downloading and installing the PC Inspector File recovery software took no more than a few minutes. Since the program is free, no personal or payment information was required, which was a nice change. There was no setup necessary other than following the installation prompts.",
    "Unfortunately, the PC Inspector File Recovery client is quite outdated and confusing. Really, it looks like something from the early 2000s, and it took some time for us to figure out what was where. It will be confusing for beginner uses, so be prepared to spend some time understanding the program if you decide to use it.",
    "We installed PC Inspector File Recovery on a Windows 10 test laptop with 8GB of RAM. Then, we ran the program on a 500GB external hard drive which contained intentionally deleted files, and the results were as expected.",
    "For starters, the scan ran comfortably in the background, using, on average, less than 20% CPU and around 20MB of memory. It didn’t visibly affect other programs or the performance of our computer in any way. The entire process took less than a minute and delivered a clear list of recovered files.",
    "At first glance, it appeared that the PC Inspector File Recovery program had done a great job. Over 700 files were retrieved, including those we deleted for testing purposes.",
    "However, every one of the retrieved files proved to be corrupted, and we ran the test multiple times with the same results. It does appear like the program hasn’t been updated for some time, and the website still claims that it’s compatible with Windows 98 through Windows XP. Because of this, we would suggest that it could be a useful tool with older operating systems, although it doesn’t seem to work with the current version of Windows 10.",
    "PC Inspector File Recovery is a free hard drive data recovery program, so support services are naturally limited. Surprisingly, a German phone number is listed, which could be useful for those in Europe or with the ability to make international calls.",
    "Fortunately, there is a built-in help library that is directly accessible from the software itself. It contains clear documentation about exactly how to use PC Inspector File Recovery for best results. There is also a simple getting started guide on the program’s website.",
    "Most aspects of the PC Inspector File Recovery program are great, except for the fact that we couldn’t actually get it to work. At first glance, it appears to offer a selection of powerful data recovery tools, but a deeper analysis suggests that the software has been neglected for some time.",
    "We were able to install and set up PC Inspector File Recovery without any issues. The user interface took some time to get used to, but the biggest problem was that we weren’t able to actually restore any recovered files. Ultimately, we can’t recommend using this program, although it could be a useful option for older operating systems.",
    "Happily, there are numerous quality alternatives to PC Inspector File Recovery. If you’re looking for a cheap option for simple deleted data recovery, the Ashampoo Undeleter is a great choice. It’s beginner-friendly and costs just $14.99 for a lifetime license. Alternatively, you could consider purchasing a more powerful application like Stellar Data Recovery. Prices start from $49.99 per year, and it includes a selection of tools for advanced users.",
    "For more, free, alternatives to PC Inspector File Recovery, read our guide to the Best data recovery software."
  ],
  "headers": {
    "1": "PC Inspector File Recovery: Plans and pricing",
    "3": "PC Inspector File Recovery: Features",
    "5": "PC Inspector File Recovery: Client and client setup",
    "7": "PC Inspector File Recovery: Performance",
    "9": "PC Inspector File Recovery: Efficiency",
    "11": "PC Inspector File Recovery: Support",
    "13": "PC Inspector File Recovery: Final verdict",
    "15": "PC Inspector File Recovery: The competition"
  },
  "links": {
    "best data recovery software": "https://www.techradar.com/best/best-data-recovery-software",
    "Ashampoo Undeleter": "https://www.techradar.com/reviews/ashampoo-undeleter-review",
    "Stellar Data Recovery": "https://www.techradar.com/reviews/stellar-data-recovery-review",
    "Best data recovery software": "https://www.techradar.com/best/best-data-recovery-software"
  }
}