{
  "source": "https://www.techradar.com/reviews/edge-diagrammer",
  "title": "EDGE Diagrammer review",
  "category": "computing",
  "updated": "2020-07-28T15:48:14Z",
  "author": "jacob-parker",
  "summary": "An intelligent design tool with a slightly dated interface",
  "verdict": "EDGE Diagrammer has some excellent features such as customizable design styles, but it’s expensive and let down by a user interface that sorely needs an update.",
  "pros": [
    "Lots of premade diagrams included",
    "Comes with license-free diagram reader",
    "Even beginners find it easy to use",
    "Intelligent diagram organization system"
  ],
  "cons": [
    "Very limited technical support",
    "Expensive compared to some competitors",
    "Doesn’t support UML designs"
  ],
  "article": [
    "EDGE Diagrammer is a diagramming software platform created by Pacestar Software, an Arizona-based company that’s been in business since 1990. You can use EDGE Diagrammer to present data and concepts clearly, no matter what kind of project you’re working on. Only Windows machines are supported by EDGE Diagrammer, but fortunately there are plenty of other great diagramming solutions out there for Mac and Linux users.",
    "Over the course of this EDGE Diagrammer review, you’ll see why this is a good option for creating family trees, technical documents, detailed designs, and presentations. Although it might not be the most modern-looking design tool, EDGE Diagrammer won’t let you down when it comes to producing high-quality documents and images.",
    "Edge Diagrammer is intended for use in a professional environment, and the pricing of the platform entirely depends on how many users you wish to purchase a license for. Unlike many competitor diagramming tools, there’s no need to sign up for a subscription to access this software, all you need to do is buy a one-off license.",
    "For a single-user, a license costs $149, and per user price falls with the number of licenses you buy. For example, a two-user licence costs $279 ($140 per user), for five users the price is $619 ($124 per user), and a 10-user license is $999 ($100 per user). If you wish to purchase more than 50 licenses, you’ll need to contact Pacestar Software directly.",
    "No free version of EDGE Diagrammer is available. However, if you want to test out the software before purchasing it, you can download a 30-day free trial with restricted functionality.",
    "EDGE Diagrammer is chiefly focused on making it easy for someone who’s never used diagramming software before to instantly pick up the software and immediately create the diagram, flowchart or technical document they need. To help that happen, the software remembers the relationship between different objects and the labels, arrows, and lines attached to them. This means that when you adjust your project’s layout, connections and key properties are preserved.",
    "When you first install EDGE Diagrammer, you’ll get access to a wide variety of diagram templates that you can base your projects on. Even more are accessible via a free extension pack available for download on the EDGE Diagrammer website.",
    "Within the extension folder, you’ll find all manner of interesting niche layouts to enhance your work. There are logic circuits for programmers, RF block designs for circuit board manufacturers, and systems ecology diagrams for environmental scientists. In total, the extension pack grants access to eight unique types of diagram, so you’re sure to find a relevant option.",
    "If you work with EDGE Diagrammer frequently, to save time and achieve visual consistency, you can define your own diagram style. EDGE Diagrammer styles are made up of default shapes, colors, and line arrowheads (there are hundreds to choose from). After selecting the options that work for you, just save your style as a diagram template.",
    "From the Pacestar Software site, you can download a free version of EDGE Diagrammer called Diagram Reader. This tool lets you open EDGE Diagrammer designs but not edit them. It’s a handy application if you’d like to share your unfinished work with clients or colleagues who don’t have a full license for the EDGE Diagrammer software.",
    "EDGE Diagrammer doesn’t look as modern as some alternative diagramming solutions such as draw.io or SmartDraw. All the same, the interface is straightforward with shapes and figures appearing in a panel on the left hand side of the screen, and a selection of commonly used tools available at the top.",
    "One of the nice things about creating a diagram with EDGE Diagrammer is that the program doesn’t simply offer basic spacing and alignment functions. Instead, the position of your objects will be subtly monitored from behind the scenes, and EDGE Diagrammer will automatically snap items into place so that your diagram looks as organized as possible. You can also use a visible or invisible “snap grid” to achieve a pixel-perfect layout.",
    "When editing a diagram in EDGE Diagrammer, you’ll find that the options available to you change with context depending on the kind of object you’re working with. For example, many in-built figures come with different reshaping handles, and lines can be attached to circuit symbols at relevant connection points.",
    "Unfortunately, Pacestar is quite old-school when it comes to providing support for its products. To work out how to get around the EDGE Diagrammer interface, you’ll need to refer to a 50-page PDF user guide. If you need more direct assistance, the only option is to send the Pacestar team an email.",
    "In the past, EDGE Diagrammer would have had no trouble keeping up competing diagramming software. However, over the last few years the industry has moved forward while updates for EDGE Diagrammer have failed to revitalize the program’s tired-looking interface or add much new functionality.",
    "For example, both draw.io and SmartDraw have nicer user interfaces and support Unified Modelling Language (UML). By contrast, you have to purchase an entirely separate license to use UML in EDGE Diagrammer.",
    "The truth is that EDGE Diagrammer isn’t our favorite piece of diagramming software with its high price-point and lack of support for alternative operating systems or UML. All the same, if you’re looking for a new way to create professional diagrams, it’s worth experimenting with the free trial version of this program to see if you feel the same."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "5": "Features",
    "10": "Interface and In Use",
    "13": "Support",
    "14": "The Competition",
    "16": "Final Verdict"
  },
  "links": {
    "diagramming software platform": "https://www.techradar.com/best/best-flowchart-software",
    "presentations": "https://www.techradar.com/best/best-presentation-software",
    "draw.io": "https://www.techradar.com/reviews/drawio",
    "SmartDraw": "https://www.techradar.com/reviews/smartdraw"
  }
}