{
  "source": "https://www.techradar.com/reviews/upright-go-2-review",
  "title": "Upright Go 2 review",
  "category": "wearables",
  "updated": "2020-05-13T03:45:06Z",
  "author": "nick-rego",
  "summary": "Straighten up",
  "verdict": "The Upright Go 2 is an interesting device, which certainly will remind you when you’re slouching in your chair. Through regular use you’ll be conditioned to sit up straight, but it will take you a good number of weeks to retrain your brain and posture.",
  "pros": [
    "Discreet to wear",
    "Decent battery life"
  ],
  "cons": [
    "Temperamental tracking",
    "Data could be presented better"
  ],
  "article": [
    "UPDATE (May 13, 2020): A new necklace accessory is now available for the Upright Go and Upright Go 2 posture training devices, making them easier to wear than sticking onto your back with the provided doubled-sided adhesive strip. We have updated the Design and Setup sections in the review below with more information on the new accessory.",
    "If there’s one thing that was constantly screamed at us when we were younger, it was to sit up straight. It didn’t matter if you were on a picnic bench, or a pew, or a classroom chair – you had to sit upright and avoid slouching.",
    "During adulthood, there’s no one standing behind you to remind you to stop slouching. In an age where we’re hunched over staring at our phones, or slouching in our chairs at work while we scroll through endless websites, our posture is beginning to suffer.",
    "Naturally, there is a modern-day equivalent to help with posture correction, in the form of the Upright Go 2. This tiny device promises to improve your posture in as little as 14 days, but after using it for a month, we can say that it’s going to take a lot more than that to rewire your brain.",
    "The Upright Go 2 is available for $99.95 / £84.99 / AU$149.95 directly from Upright’s website and major retailers.",
    "That’s priced similar to a normal fitness tracker – say the Fitbit Inspire HR - but we do think that the price tag for the Upright Go 2 could be a tad lower, given its limited abilities when compared to other products.",
    "A necklace accessory is also available for the Upright Go 2, which makes the device easier to wear and remove, and it will set you back $19.95 / £15.99 / AU$29.95.",
    "This newer version of the previously released Upright Go is a lot smaller, and is discreet enough to wear under most clothing. The tracker itself consists of a small, white plastic shell - there’s a small button to turn it off and on, an LED to show connectivity and charging, and a USB-C port to charge the device.",
    "On the back you attach one of the included double-sided adhesive strips, which is how you attach the Go 2 to your back.",
    "Don’t worry – the adhesive is skin-friendly and isn’t uncomfortable to remove, and each strip will see around 10 uses or so before you have to change them. There are a number of adhesive strips included in the box, and you can buy more from the company for a negligible fee.",
    "That said, there is now a new necklace accessory available to buy for the Upright Go, which might be a more economical option than purchasing new strips to attach the device to your back. The accessory is only available in black (at least for now) and is made of high-grade silicone. It has a magnetic clasp at the two thicker, angled ends. Once worn, the clasp will be in front, looking like a simple black necklace, while the USB-C connector plugs into the device to hold it on your back. Unfortunately, being made of silicone means the accessory picks up dust and fibre very easily and the dirt is visible on the black surface.",
    "Where you attach the Go 2 will determine how accurate your tracking is – too high or too low and it won’t give you the best results, so we found that just a few inches from our shoulder blades was the best spot.",
    "Setting up the Go 2 is very easy – charge it up, turn it on, and affix it to your back. You can then download the accompanying app and sync it via Bluetooth. Once synced, the app talks you through a few steps to input your height and weight, before showing you how your posture will be tracked.",
    "The Go 2 will first ask you to set your posture, which gives it a benchmark to measure against so it knows when you’re slouching. Once your posture has been set, the Go 2 will gently vibrate when it detects that you’ve started slouching.",
    "The vibrations are subtle enough to get you to almost immediately straighten your posture, and can be configured in a number of different ways to whatever works best for you. We found the gentle ‘knocking’ vibration to work best, but you can choose one of the stronger variants if you prefer.",
    "The app shows a little red dot that is the threshold for when the Go 2 determines that you’re actually slouching. Go beyond this red dot and the Go 2 instantly vibrates as a reminder to straighten up.",
    "Initially this was very frequent and mildly annoying, especially if you’re doing tasks that require you to frequently bend over. We adjusted the sensitivity to be a bit more lenient, and also changed the Go 2 to only buzz after 15 seconds of detecting us slouched over.",
    "In order to truly change your posture, the app functions in two modes – Training and Tracking. In Training mode, the app requires you to maintain perfect posture for a set number of minutes each day, gradually increasing in length as time goes by. Each time you slouch, the Go 2 will vibrate as a reminder, and completing your daily Training sessions is key to improving both your posture and the Go 2’s sensitivity to your lifestyle.",
    "Once your training sessions are complete, you can switch to Tracking mode. In this mode, the Go 2 will not vibrate if you’re slouching, but will still track your posture. It’s a harsh lesson to learn when at the end of the day you look back at your stats and see just how long you actually had bad posture.",
    "There’s no harm in keeping the Go 2 in Training mode for longer than required, if you feel that you need the constant vibrations to keep you in check. Initially this is what we did, and after a week of use we found that we were mostly able to keep our posture correct while in Tracking mode.",
    "The unfortunate downside of the Go 2 is that the data it collects is quite – arbitrary. It’s not really an accurate depiction of your posture throughout the day, as there are often times when the Go 2 will detect you as slouching, but in fact you were simply reclining in a chair or on a sofa during a break.",
    "In other times we could be slouched deep into a chair which would put pressure on our lower back, but if we kept our upper back fairly straight, the tracker would register us as having correct posture, even though technically we didn’t.",
    "There’s also no sort of map of how your posture has improved over time. While you can individually go through each day and see how much time you were slouched over, it would be handy if this data was presented as a line graph or something similar, just to give it a bit more meaning.",
    "If you unfortunately find yourself exposed to hot weather and sweat a lot, then you will most likely find the Go 2 slips off your back too. The adhesive doesn’t behave well with sweaty skin, so eventually it will slide into another position or fall off completely, which is what happened to us on a particularly sweaty day.",
    "If you're using the necklace accessory, rest assured the device will not get dislodged if you're just going about your work. The silicone band doesn't slip and moving around while wearing the device on the necklace hardly shifts it out of place. However, if you are wearing it during vigorous movements, like exercising for example, then you will need to adjust the necklace to pull the necklace forward a little to bring the Upright Go back into place, although the device really isn't necessary while you're out on a run or in the gym.",
    "Another slight annoyance was the occasional times when the Go 2 wouldn’t connect or sync properly to the app. On two separate occasions we thought we had finished our training for the day and had switched over to Tracking mode, only to check the app at the end of the day and find that the device was still stuck in Training mode for some reason, effectively losing that entire day of tracking our posture.",
    "Battery life for the Go 2 is quoted at around 30 hours, but we got to around 25 hours (over three days of wearing it only during office hours) before needing to give it a recharge.",
    "You won't need to wear the Go 2 all the time - just in situations when you're most likely to need posture correction, for example while sitting at your desk. It's not restricted to seated positions either - if you're mostly standing throughout the day, you can still configure the Go 2 to track your posture properly.",
    "It’s been a month since we’ve stopped using the Upright Go 2, and after religiously using it we can definitely say that there are moments where we now catch ourselves slouching and immediately straighten up. Sitting on a bar stool or a seat with no back support rarely results in us slouching like we did before, so in a nutshell the Upright Go 2 really does deliver on its promise.",
    "You’ll definitely appreciate its discreet appearance versus wearing any kind of back-harness that’s meant to contort your body into the correct posture. There really is nothing else on the market like it yet, so that’s certainly an advantage.",
    "In the end, the Upright Go 2 is merely conditioning you to have better posture, and if you truly stick with it, you’ll see the results for yourself.",
    "First reviewed: July 2019"
  ],
  "headers": {
    "4": "Upright Go 2 price and availability",
    "7": "Design",
    "12": "Setup and tracking",
    "28": "Final verdict"
  },
  "links": {
    "Upright’s website": "https://store.uprightpose.com/products/upright-go2",
    "Fitbit Inspire HR": "https://www.techradar.com/reviews/fitbit-inspire-hr-review"
  }
}