{
  "source": "https://www.techradar.com/reviews/pebble-gear-mickey-and-friends-kids-tablet",
  "title": "Pebble Gear Mickey and Friends kids tablet review",
  "category": "tablets",
  "updated": "2020-12-21T16:58:12Z",
  "author": "desire-athow",
  "summary": "In a galaxy not too far away, comes an Android tablet blessed by Disney",
  "verdict": "The Pebble Gear Mickey and Friends kids tablet is an enjoyable bundle that delivers what it promises: plenty of apps, ebooks and games for young Disney fans. If you want a safe, controlled environment for your kids to indulge in hundreds of carefully curated apps, then this is the gift to get for them this Christmas.",
  "pros": [
    "Good value for money",
    "Solidly built",
    "2-year warranty",
    "Curated app store"
  ],
  "cons": [
    "Slow",
    "No Google Play",
    "Proprietary app store is free for only 12 months",
    "No HDMI port"
  ],
  "article": [
    "This is the time of the year when Father Christmas is supposed to be giving away gifts to boys and girls that have been well behaved throughout the year. On the wishlist of many will be something from the expansive universe of Disney and the Mickey and Friends tablet from Pebble Gear will be one of many products aimed at pleasing that audience, a perfect complement of its streaming service, Disney Plus.",
    "The Pebble Gear Mickey and Friends kids tablet costs £99.99 direct. Buyers can opt to pay later, without fees, via credit provider Klarna in three tranches of £33.33 each.",
    "It is the first time we’ve seen a 7-inch tablet in years. The arrival of smartphones with large screens caused the format to almost go out of fashion with the notable exception of the Amazon Fire 7 tablet with whom the Pebble Gear tablet shares a number of features.",
    "The only sign of Disney on the product is the blue bumper that can be removed. This triples the thickness of the tablet providing much needed protection against pretty much any bumps and falls. We like the smooth texture which looks like a cross between rubber and expanded polystyrene and it earns extra points for how comfortable it is to hold. The back is textured and contains the words “Disney Mickey and Friends”. The bare tablet is the only thing common across the other Disney products sold by Pebble Gear; these include Toy Story 4, Frozen 2 and Disney Cars themed tablets.",
    "On the front, there’s a 0.3-megapixel selfie camera and the back houses a 2-megapixel camera. All the ports are located on the right hand side of the tablet. A card reader, a microUSB port, the power button and a volume rocker. Note that there’s no HDMI connector. Other than the tablet and the blue bumper, there’s a 7.5W charger, a USB cable and a user manual.",
    "You will not buy this tablet for its hardware prowess, far from that. The components that make up this tablet are roughly what you’d find in an Android tablet from 2013: a quad-core processor, 1GB RAM, 16GB onboard storage and a 7-inch display with a very low 1024 x 600 pixel resolution. Note that only 12.38GB (out of 16GB) of disk space is actually available.",
    "The screen has a polarising filter built-in as standard to, according to the vendor, “protect young eyes from prolonged exposure to harsh blue light”. There’s Wi-Fi, mono audio and a 2700mAh battery as well. In case you wondered, that’s very much what can be found inside the Amazon Fire 7 tablet, which costs £44.99 but doesn’t come with all the mod cons.",
    "This is not a normal review so don’t expect a performance rating; the value of the Pebble Gear Mickey and Friends kids tablet resides more in the overall package than in its individual hardware components. In other words, it is all about the exclusive bundle on offer.",
    "There’s three games (Mickey and Friends: Tap, Mickey and Friends: Search, Mickey and Friends: Pop), 10 interactive eBooks and access to Gamestore Junior, Pebble Gear’s own app store that doesn’t need Wi-Fi to work, contains curated child-friendly app, doesn’t show adverts and has no pesky in-app purchases.",
    "The store contains some well known names like Rayman and Pacman but just bear in mind that the tablet only comes with 12-months access to Gamestore Junior. After that, you have to pay £39.99 for another year’s worth of access. There’s actually no mention of that on the purchase page at the time of writing.",
    "The tablet is unsurprisingly quite slow given the hardware requirements of the preloaded operating system, Android 8.1. You do need to activate the tablet (a confirmation email will be sent to you) to get your free 12-month subscription and the eBooks need to be downloaded first.",
    "Other than the basic parental controls, there’s hardly any other features you’d find on a normal Android tablet. No Google Play, no YouTube and therefore, no Disney Plus app which is a shame. Setting it up requires a bit more focus than your usual Android registration as it includes deciding on how strict (or lax) parental controls should be.",
    "You also get a lifetime subscription to a so-called safe browser called Kiddoware and the ability to see at a glance how long your little one has been playing, reading, watching and learning.",
    "As a parent, you could buy an Android tablet and try to load it up with Disney content. The issue is that you will end up with a half-baked solution that will neither fit your budget nor your child’s dream of having a Disney-branded tablet.",
    "The Pebble Gear is, from that angle, a good product aimed at fulfilling a lucrative niche. Yes, it is limited and yes you don’t get as much flexibility as a normal Android tablet but that was never its original aim and the relatively low price point proves it.",
    "The curated app store and the exclusive (but limited) Disney bundle is what sets it apart from, well, everyone else. Just bear in mind though that there’s a 12-month subscription that may bump the price up in the future. We just wished there could be a way to stream Disney Plus content on the tablet."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Design",
    "5": "Hardware",
    "7": "In use",
    "13": "Final verdict"
  },
  "links": {
    "£99.99 direct": "https://uk.pebble-gear.com/products/mickey-and-friends-kids-tablet",
    "Amazon Fire 7": "https://www.techradar.com/reviews/amazon-fire-7-2019"
  }
}