{
  "source": "https://www.techradar.com/reviews/bmax-y13-pro-windows-10-pro-2-in-1-convertible-laptop",
  "title": "BMax Y13 Pro Windows 10 Pro 2-in-1 convertible laptop review",
  "category": "computing",
  "updated": "2020-11-06T10:10:20.997Z",
  "author": "desire-athow",
  "summary": "A business notebook without much expectations",
  "verdict": "The BMax Y13 Pro is a tale of compromises and balance and while it is not a bad product, it suffers from comparison with the Y13 which, in our view, offers much better value for money. We would go as far as saying that there’s no compelling reason for the Y13 Pro to exist.",
  "pros": [
    "Good value for money",
    "Surprisingly portable",
    "Solidly built with premium quality",
    "Backlit keyboard with larger than average keys"
  ],
  "cons": [
    "BMax Y13 is better and cheaper",
    "Battery life is poor",
    "Performance is below average",
    "Quite toasty under heavy load"
  ],
  "article": [
    "2020 is the year when BMax, a relative newcomer to the Chinese PC scene, has rapidly grown in stature and two of its products that we reviewed, the BMax Y11 convertible 11.6-inch laptop and the Bmax B1 thin client mini PC, stood out thanks to some solid USPs. This time around, we’re testing the BMax Y13 Pro, a 2-in-1 convertible laptop that is aimed at a slightly different audience; one that wants to use Windows 10 Pro, a business-focused operating system.",
    "You can buy the BMax Y13 Pro from online Chinese retailer Banggood where it is currently on sale for as little as $449.99. Note that a different model called the BMax Y13 retails for $360 and swaps the Core M CPU for a Celeron one, a much better deal in our view.",
    "Lenovo gave us the first Yoga more than eight years ago and ever since, this elegant design has been the inspiration for countless products including the BMax Y13 Pro. Two hinges allow the screen to rotate 360 degrees to transform the laptop into a tablet.",
    "At 308 ×208 ×14.7mm, it is just a bit thicker than 150 A4 sheets of paper (a bit less than a third of a ream). It weighs 1.25kg , not as light as the 14-inch, sub-1kg LG Gram 14 2-in-1 convertible laptop but then the latter costs three times more than the BMax’s candidate.",
    "The Y13 Pro oozes quality thanks to an aluminum alloy metal chassis that adopted the popular space grey colour scheme and a brushed metal finish. Its base has curves in the right places and rightly shies away from tapering the edges in order to make it look thinner. As such it follows the footsteps of the MacBook proper.",
    "There’s no vents to facilitate air circulation and that’s because of the low power dissipation of the Intel processor used by the Bmax Y13 Pro. The laptop acts like a giant heatsink to conduct the heat out; the base of the laptop houses a flap that hides a removable M.2 SSD.",
    "The display is a bit of a fingerprint magnet as BMax opted for a glossy glass. It is a full HD IPS touchscreen model with bezel on both sides that are as small as 5mm. The webcam can be found on the top edge while the bottom edge - the one nearer to the keyboard - is far thicker, acting as the “holding edge”.",
    "While It uses a 24W (12V2A) brick power supply unit that connects to a tiny proprietary barrel type connector, owners will be able to plug in a compatible laptop charger or laptop power bank into a Type-C port found on the left of the device. On the right is an audio jack, a microSD card slot and another Type-C connector plus the power switch.",
    "Let’s start by the biggest surprise; the use of an Intel Core m5-6Y54 processor, a dual-core model that was launched back in 2015 and was chosen, according to a BMax spokesperson because of its “low power consumption” which stands at 4.5W. It doesn’t support LPDDR4 though, only older (and more power hungry) LPDDR3 plus its HD Graphics 515 video subsystem is long in the tooth.",
    "The rest of the specification is far more appealing though: 8GB system memory, a 256GB SATA SSD from Foresee, a 13.3-inch 1080p 10-point touchscreen IPS LCD with full lamination technology and - no surprise here - Intel’s ubiquitous Wireless-AC 3165 radio chip that delivers Wi-Fi 5 and Bluetooth 4.2.",
    "The Core m processor is the Achilles’ heel of the Y13 Pro. There, we said it. Swap it for anything recent and watch it fly with honors. We cannot wait to see a quad-core AMD Ryzen processor fitted into this form factor. Bear in mind that this laptop uses parts that are four years old or more, which means that it lacks newer features like energy sipping LPDDR4 or faster PCIe NVMe SSD. Long story short, compared to the N4120, the Core M is faster on single core but much slower on multi-core tasks.",
    "Colors are bright and vivid as you’d expect from an IPS display with excellent viewing angle; a highly reflective display means that outdoor usage can be an issue. The 2-cell 36.5Whr battery only managed 3hr13min on our gruelling Youtube playback video which is quite disappointing. The backlit keyboard has larger than average keys with slightly concave surfaces. We love the big Esc key as well as generously proportioned, single-function arrow keys. The keyboard has shorter travel compared to premium laptops but is still full of personality and responsive enough for any ardent touchtypers.",
    "The touchpad was an easy going model without any physical buttons but with a decent surface area and plenty of feedback.",
    "You’re looking for a thin-and-light 2-in-1 convertible laptop. The Y13 Pro is eminently portable and great fun to use, using the sort of form factor that made the original Lenovo Ideapad Yoga such an iconic laptop design.",
    "You’re after an affordable laptop with premium built quality. Thanks to use of metal through and through (aluminum alloy) and a distinct, understated colour scheme, BMax’s convertible notebook sets itself apart from flashier, less chic rivals.",
    "You want a quiet laptop. It doesn’t have any fans to cool it so runs silent; however the flip side is that it can be quite warm when under load.",
    "You want Windows 10 Pro on a budget. This is one of the cheapest laptops on the market right now to feature Microsoft’s business operating system.",
    "You want to work all day. At just under 200 minutes, the Y13 Pro has a shockingly low battery life given its battery capacity, 36.5Whr. Sadly, you will probably have to pay more, much more in order to get something better although that may well depend on when you’re buying.",
    "You want the best value for money. On paper, the Y13, another BMax convertible, is a much better option. It features an Intel Celeron N4120 processor and Bluetooth 5.0 plus costs significantly less and has an identical feature set and chassis. The N4120 is faster than the Core M thanks to its four physical cores and a newer graphics sub-system.",
    "You want to use full-size USB ports. It has only two Type-C USB ports, one of which is for data only."
  ],
  "headers": {
    "1": "Price and availability",
    "2": "Design and features",
    "8": "Hardware specs",
    "10": "Performance and In use",
    "13": "Buy it if",
    "17": "Don't buy it if"
  },
  "links": {
    "BMax,": "https://www.bmaxit.com",
    "BMax Y11 convertible 11.6-inch laptop": "https://www.techradar.com/reviews/bmax-y11-convertible-116-inch-laptop",
    "Bmax B1 thin client mini PC": "https://www.techradar.com/reviews/bmax-b1-thin-client-mini-pc",
    "BMax Y13 Pro": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-3928656751096503300&ulp=https%3A%2F%2Fwww.banggood.com%2FNew-EditionBMAX-Y13-Pro-YUGA-Laptop-13_3-inch-360-degree-Touchscreen-Intel-Core-m5-6Y54-8GB-RAM-256GB-SSD-38Wh-Battery-Full-featured-Type-C-Backlight-5mm-Narrow-Bezel-Notebook-p-1735635.html%3Frmmds%3Dsearch%26cur_warehouse%3DCN",
    "BMax Y13": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-5366044961648760000&ulp=https%3A%2F%2Fwww.banggood.com%2FBMAX-Y13-Laptop-13_3-inch-360-degree-Touchscreen-Intel-N4120-8GB-256GB-SSD-5mm-Narrow-Bezel-Backlight-Notebook-p-1578390.html%3Frmmds%3Dsearch%26cur_warehouse%3DCN",
    "LG Gram 14 2-in-1 convertible laptop": "https://www.techradar.com/reviews/lg-gram-14-2-in-1",
    "MacBook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-1287806/review",
    "laptop power bank": "https://www.techradar.com/news/best-portable-laptop-battery-chargers-and-power-banks",
    "Lenovo Ideapad Yoga": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/lenovo-ideapad-yoga-1094131/review/1#articleContent"
  }
}