{
  "source": "https://www.techradar.com/reviews/sony-wi-sp510",
  "title": "Sony WI-SP510 review",
  "category": "reviews",
  "updated": "2020-08-21T06:53:35Z",
  "author": "harry-domanski",
  "summary": "Affordable workout buds, but a bit noisy",
  "verdict": "While the WI-SP510 offers decent-enough audio, great comfort, reasonable battery life and everything you need for pumping bass on a workout, the competition is fierce and its noise issue lets it down.",
  "pros": [
    "Lightweight, snug, comfortable fit",
    "Solidly bassy audio",
    "Strong battery life"
  ],
  "cons": [
    "Noise floor far too high",
    "Strong competitors"
  ],
  "article": [
    "There’s a few different product lines running simultaneously in Sony’s headphone department, and this particular pair of wireless in-ears sits both in its ‘sports’ lineup and its Extra Bass range. With the WI-SP510 come a lot of promises, especially considering its price, but thankfully these buds mostly deliver on them.",
    "Typically, Sony’s sports range of personal audio products aims to include features like sweat resistance, comfortable and snug fits, lightweight yet solid construction, and extended battery life. Impressively, the WI-SP510 delivers on all these fronts.",
    "It also manages to pack in the punchy low-end that its Extra Bass range is known for, and offers solid audio for the price. However, it’s worth mentioning that the noise floor – the volume of white noise produced by the headphones themselves – is inexplicably quite high, so listeners of more subtle and nuanced material such as audiobooks, podcasts, and softer genres like folk, may be disappointed.",
    "Sony launched its WI-SP510 wireless sports headphones in April, 2020 in the US, UK and Australia, presenting an update on its existing WI-SP500 in-ears.",
    "Coming in at a price of $79 (£70, AU$179), the Sony WI-SP510 is in the same price range as some pretty hot competition in the sports-centric wireless earbud space, including the likes of the Jaybird Tarah and JBL Reflect range.",
    "The price hike for the Australian market doesn’t make them quite as appealing as they would be in the other territories, so it’s worth factoring that in when considering your purchase.",
    "The WI-SP510 is considerably different from the WI-SP500, moving from a design where two relatively bulky earbuds were just connected by a cable, to a neckband design that features rather compact driver housings, but still manages to keep its bulk on the band itself.",
    "While this did add to the overall weight of the unit (shifting up from 18g to a similarly featherweight 30g), it also almost doubled the battery life, upgrading the previous model's 8 hours to a rather impressive 15 hours of play time.",
    "This style of neckband design – with its thin flexible band between two larger, hard plastic sections – put us off at first and may be a point of contention for some, but with continued usage we found it suited the sporty approach of the headphones rather well.",
    "The design allowed the unit’s rather tiny weight to be largely biased towards the front, meaning they would keep themselves snugly around the user's neck, even during some of the more rigorous movements.",
    "To assist even further with this security, the driver housings themselves are also magnetic, allowing them to clasp together when worn around your neck so you won’t lose them when not in use.",
    "Considering the above points alongside the WI-SP500's array of fitting options (four pairs of deep silicon tips in various sizes and three pairs of fins), its design is certainly suitable for the more active user and we found it easy to find a comfortable, secure fit.",
    "The control interface is also mercifully simple to use, with large buttons that are easy to find in a pinch and little else to distract from that.",
    "Next to the controls is the USB-C port (a delight to see on tech this affordable) covered by a relatively dinky piece of plastic that helps maintain the unit’s IPX5 water- and sweat - resistance.",
    "Via this port, it should take you three hours to fully top up the unit’s battery, at which point you’ll have around 15 hours of playback before it’s drained again. This is pretty decent battery life for a unit this size.",
    "In Australia, you can get the WI-SP510 in black, white, blue or orange (our favorite), but the color variety may vary region to region.",
    "The biggest issue that the WI-SP510 presents is its noise floor. Whenever the unit detects that audio is playing or about to be played, it produces an underlying white noise. When audio stops, it still sounds for a few seconds before it detects that no media is playing and silences again.",
    "While a small amount of noise is unavoidable in most headphone designs, the noise present in these earbuds is extremely loud and conspicuous relative to any other modern wireless audio device we’ve tested.",
    "This noise is particularly noticeable when you pause music, first open media (such as a video) on your connected device, and even during the 'power on' and 'battery level' spoken messages that the unit itself produces, even when the device isn’t paired to anything.",
    "This suggests that the issue is with the actual unit rather than its connectivity or with the source device. We’ve reached out to Sony about this but have yet to receive solid confirmation on whether the issue is something that can be addressed with a firmware update or if it’s inherent in the device itself.",
    "As mentioned briefly earlier, this isn’t a huge issue if you’re playing louder, more active music as it becomes considerably less noticeable, but it’s worth considering if you typically listen to podcasts, audiobooks or softer, more isolated sound sources where the noise will be more of a distraction.",
    "With that out of the way, the WI-SP510 and its relatively tiny 12mm drivers do offer great audio reproduction, as Sony has been doing considerably well with in recent years.",
    "The Extra Bass moniker here is fitting, as the low end is punchy, rich and satisfying, and while the overall profile was pleasing for most genres we sampled, we found the high frequencies to be a little too boosted and occasionally distorting.",
    "The same positive comments about clarity and separation that most other Sony headphones earn don’t come as easily here unfortunately, and this is most likely due to the aforementioned noise issues.",
    "As for connectivity, we found the Bluetooth 5.0 connection (upgraded from 4.2 in the SP500 predecessors) to be entirely stable without any sign of a dropout or stutter."
  ],
  "headers": {
    "0": "One-minute review",
    "3": "Sony WI-SP510 release date and price",
    "6": "Design",
    "16": "Performance",
    "25": "Don't buy it if..."
  },
  "links": {
    "Jaybird Tarah": "https://www.techradar.com/reviews/jaybird-tarah"
  }
}