{
  "source": "https://www.techradar.com/reviews/hola-free-vpn",
  "title": "Hola Free VPN review",
  "category": "computing",
  "updated": "2020-07-20T11:35:37Z",
  "author": "mike-williams",
  "summary": "Dead easy site unblocking – but there's a price to pay",
  "verdict": "Hola is worth a try for site unblocking, but if you're looking for features, power or privacy, it's no substitute for a full-strength commercial VPN.",
  "pros": [
    "Free",
    "Massive network of Hola nodes",
    "Can easily unblock some sites",
    "Fast enough to stream 4K video"
  ],
  "cons": [
    "Free plan limits Netflix time to one hour a day",
    "Shares a little of your bandwidth and CPU time",
    "Logging concerns",
    "Not a 'real' VPN – works with browsers only"
  ],
  "article": [
    "Hola is an interesting free VPN-like service which takes an unconventional approach to preserving your online privacy.",
    "Unlike the competition, Hola doesn't rely on a fixed network of managed servers. The company describes itself as more of a \"peer to peer\" VPN, where browser traffic is routed through its users. Your traffic passes through the computers of others who've installed the service, and some of their traffic might pass through your devices.",
    "This has some advantages. There are no fixed routes or destination servers, making it more difficult for sites to detect that you're using a VPN. It also keeps costs down, as there are no servers or bandwidth bills, allowing the basic service to be offered for free.",
    "Disadvantages are that Hola only protects browser traffic, and even that isn't encrypted in the way you'll see with other VPNs. The service is great for unblocking websites, but not much use for anything else.",
    "Hola runs almost everywhere, with browser extensions available for Chrome, Firefox, Opera and Edge; custom browsers available on Android, iOS, Windows and Mac, and the ability to set up the service on many other platforms.",
    "One potential issue is if you install one of the apps (not the browser extensions), you're allowing Hola to use some of your system and network resources, as other users access the sites they need via your connection. But the company says it only uses devices when they're idle, and connected to an electricity source. Even then, it claims to use no more than 3MB a day from mobile devices, 100MB from desktops.",
    "Maybe a more significant concern is that any Hola user could effectively become an exit server for someone else. If they're sending spam, hacking or doing anything else dubious, your IP address could become the one associated with that action.",
    "You can avoid many of these problems by upgrading to Hola Premium, which doesn't share your bandwidth with other users, works on more platforms, and enables using a network of Hola's own servers. It's priced from $7.69 a month on the annual plan.",
    "If you can live with its basic principles, though, Hola's core service is free for non-commercial use, and that's the product we're reviewing here.",
    "Most VPNs route your traffic through their own servers, providing at least the possibility that they can log what you're doing. Hola's model of routing data through its users might seem a better way to protect your privacy, but it's not quite that simple.",
    "Here's an interesting section from Hola's FAQ:",
    "\"Hola VPN regularly monitors the consumer network for traces of misuse or security breaches. In addition, architecture modifications allow Hola VPN to see the origin of each request, thus if a cybercriminal were to use the Hola VPN network, the cybercriminal’s information may be passed on to the authorities. This makes Hola VPN un-attractive to abusers. Some VPN networks don't see both ends of the connection, and are therefore much more attractive for these uses.\"",
    "The company says it monitors what users are doing on the network, to some degree, and that it can track back to identify the origin of any request it considers as 'misuse' or part of a 'security breach.' This is great for catching hackers, but it also requires more monitoring and logging than you'll see with standard VPNs.",
    "There's some support for this in the Privacy Policy, too. The company says it may collect log data, which can include 'browser type, web pages you visit, time spent on those pages, access times and dates.'",
    "Personal data Hola 'may collect and retain includes your IP address, your name and email address, screen name, payment and billing information or other information we may ask from time to time as will be required for the on-boarding process and services provisioning.'",
    "It also collects 'details of applications that are installed on the user’s device', which you might not expect.",
    "As usual, if you sign up with a social network account, this gives Hola access to details 'such as your full name, home address, email address, birth date, profile picture, friends list, personal description, as well as any other information you made publicly available on such account or agreed to share with us.'",
    "There are plenty of logging possibilities here, then, and when you factor in the lack of detail about other crucial areas of the service - how is your traffic encrypted and protected? We've no idea - this has to be a concern. If anonymity is your top priority and you're looking to reduce even the possibility of monitoring, Hola absolutely is not for you.",
    "Installing Hola on our Windows 10 system got us the Hola app (a custom version of the Chromium browser) and a prompt to install the Chrome extension. We opted for both.",
    "Once the Chrome extension is active, it monitors the sites you're visiting, and then displays alternative countries for anything it thinks you might want to unblock.",
    "If you're visiting a US streaming site from the UK, for instance, you might be asked if you want to connect as normal (without Hola), using Hola with a US IP, or using Hola with an IP from another country (there's usually more than 150 on offer.)",
    "This worked for us with US Netflix, Amazon Prime Video, Disney+ and more. The free version only allows an hour per day on some of the most popular sites, though, including Netflix - you'll need to upgrade to the paid plan to get unlimited time.",
    "Hola won't always notice when you need assistance. When we visited one YouTube channel, for instance, we were served only the couple of videos approved for our UK location, and not the full selection available in the US.",
    "In these situations, you're able to use Hola much like any other VPN; tap the address bar icon, choose your preferred location, the web page refreshes and hopefully you're able to view your content. (This worked instantly with our YouTube channel, although that's not much of an achievement; YouTube has no significant VPN protection, and just about everything can unblock it with ease.)",
    "If you're uncomfortable with Hola monitoring every URL you visit, you can refuse to install the extension and use its custom browser app, instead. The down side is this will share some of your bandwidth and resources with other Hola users; the advantage is it encourages you to use Hola only when absolutely necessary. You can open the app when you need to unblock something, and close it when you're done.",
    "The browser opens with a standard landing page with buttons for popular sites: Netflix, Hulu, Comedy Central, MTV, NBC, Amazon and more. Click one of these, the site opens with the usual Hola choice of locations, and you carry on as you would with the browser extension.",
    "You're not restricted to this, though. The app is based on Chromium, so you're able to set your own home page, add bookmarks or otherwise set it up to do whatever you need. Just keep in mind that if you want to reduce your exposure to Hola monitoring, you shouldn't try to make the app a comfortable place where you do all your regular browsing; it should be for unblocking only.",
    "Whatever option we chose, Hola worked well and unblocked everything we tried, proving itself every bit as capable as the likes of NordVPN and ExpressVPN. Not bad at all for a free product.",
    "It's always difficult to get a useful measure of VPN performance, but Hola takes this to a whole new level. There's no fixed network of servers to assess, the route your traffic takes will change every time – and your hardware, browser type and setup could influence the results in unexpected ways. Hola works so differently that synthetic benchmarks may not give you meaningful information about the service, anyway.",
    "For this review, we replaced our regular benchmarks with a more straightforward task: streaming 4K video from YouTube and other sites. Playback ran smoothly at all times, without any buffering, quality or other issues. Routing your traffic through other users' devices will bring some degree of performance penalty, but from what we can see, it doesn't make a noticeable difference to normal browsing or streaming sites.",
    "Hola describes itself as a 'free VPN', but it doesn't protect your traffic or offer the privacy or anonymity of a conventional VPN service, and there are logging concerns, too. It's still an excellent tool for unblocking websites, but don't even think about using it for anything serious."
  ],
  "headers": {
    "9": "Privacy and logging",
    "18": "Apps",
    "28": "Performance",
    "30": "Final verdict"
  },
  "links": {
    "Hola": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3626905412823777300&xs=1&url=http%3A%2F%2Fhola.org%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhola-free-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Hola Premium": "https://www.techradar.com/reviews/hola-vpn",
    "annual plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1253818179538627600&xs=1&url=https%3A%2F%2Fhola.org%2Fplus%3Fref%3Dhomepage_free&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhola-free-vpn",
    "Hola's FAQ": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9176058974777101000&xs=1&url=https%3A%2F%2Fhola.org%2Ffaq&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhola-free-vpn",
    "Privacy Policy": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3578893001851076000&xs=1&url=https%3A%2F%2Fhola.org%2Flegal%2Fprivacy&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhola-free-vpn",
    "standard landing page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8928632364677906000&xs=1&url=https%3A%2F%2Fhola.org%2Fbrowser_welcome&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhola-free-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "'free VPN": "https://www.techradar.com/vpn/best-free-vpn"
  }
}