{
  "source": "https://www.techradar.com/reviews/dynabook-portege-x30l-g-business-laptop",
  "title": "Dynabook Portégé X30L-G business laptop review",
  "category": "computing",
  "updated": "2020-05-13T18:52:27Z",
  "author": "desire-athow",
  "summary": "One of the lightest laptops we’ve ever tested",
  "verdict": "The Dynabook Portégé X30L-G is a well rounded, attractive business laptop but it suffers from too many small flaws to make it to our shortlist. We'd perhaps be too harsh to call it a one-dimensional laptop but it sums up our feeling.",
  "pros": [
    "Very light",
    "The IGZO screen",
    "Plenty of connectors",
    "MIL-STD 810G testing"
  ],
  "cons": [
    "Noisy under load",
    "Upgrades are poor",
    "No Thunderbolt 3",
    "Expensive compared to the competition",
    "Battery life could be better",
    "Keys could have been a tad bigger"
  ],
  "article": [
    "Earlier this year, Dynabook, the subsidiary of Sharp Electronics that took over Toshiba’s PC operations, unveiled a new laptop that it called the “world’s lightest 13.3in notebook with Intel 10th gen CPUs”. The Portégé X30L-G comes from a family of laptops that hails back from 1994, back when colour screens were optional and plasma displays, still around.",
    "The Portégé range always prided itself on its ability to travel light, sometimes very light. The X30L-G follows that trend and is one of the very few models that weighs (far) less than 1Kg. A real feat for a laptop that comes with an Ethernet port and a 13.3-inch display.",
    "Not much has changed externally between the Toshiba Portégé R700 we reviewed nearly 10 years ago and the X30L-G. The same design language permeates throughout; from the soft edges, the two silver strips next to the hinges, to the Onyx Blue colour scheme and the Rubenesque shape.",
    "The Portégé is neither the thinnest laptop or the one with the smallest footprint around, it does strike a near-perfect balance, helped by the fact that it weighs only 837g without its charger. At 308.8 x 211.6 x 17.9 mm, it is a tad bigger than a 200-page A4 copybook.",
    "Dynabook managed to hit that number by using a magnesium chassis which makes it strong and light. So much so that this laptop has been successfully subjected to rigorous MIL-STD-810G testing. Focusing on making the laptop light rather than small or thin means that there’s ample space for all the rest.",
    "By that we mean, the connectors: there’s a Type-C connector connector (USB 3.2 Gen 2), two USB 3.0 ones, one card reader, one HDMI port, an audio jack and a GbE LAN port. Curiously, Dynabook left a proprietary connector to accommodate legacy chargers.",
    "At the heart of the Dynabook is Intel’s 10th generation Core i7 processor; there’s actually three different types of Core i7; the low power 10510Y, the normal 10510U and the 10nm 1065G7. The 10510x CPUs are still on Intel’s mature but advanced 14nm lithography.",
    "The 510U which powers our laptop has four cores, eight threads, a 1.8GHz base frequency and a Turbo frequency of 4.9GHz. With a TDP of 15W and 8MB cache, it features Intel’s UHD Graphics but doesn’t support low-power DDR4 memory. So there’s 8GB (soldered) SODIMM DDR4 memory with an additional 8GB. You can upgrade the device to 24GB with another 16GB.",
    "Other than the Samsung 512GB PCIe NVMe SSD (PM991) is a 4-cell 43WHr battery, a Sharp IGZO full HD matte non-touch display, Wi-Fi 6 and Bluetooth 5.0 connectivity courtesy of Intel. As expected there’s also a fingerprint reader (on the touchpad) plus an IR camera for face authentication and advanced encryption via a TPM 2.0 chip.",
    "When we started to run benchmarks on the X30L-G, the true nature of the 10510U raised its head; its noisy head. That processor can be found in the Vostro 14 5490 so it is a known quantity. Under load, this processor heats up and the fan kicks in and it is marginally faster than 8th generation models (like the Core i7-8565U).",
    "The performance of the rest of the sub-system is wholesome without being exceptional: the Intel UHD Graphics won’t perform miracles while the PM991 offers data transfer rates that are very decent without being cutting edge.",
    "The IGZO screen is bright and the matte finish is spot on. Dynabook is owned by Sharp and engineers have been able to finetune the display which offers good viewing angles, with a claimed peak brightness of 470cd/m2, which we haven’t verified. Most importantly though, IGZO technology is supposed to improve battery life; that, we didn’t see.",
    "“Get up to 14.5 hours of power with quick charge” says the marketing blurb. We got just over four and a half hours on our grueling test (playing a count-up Youtube Video on best performance without any power saving feature and at full brightness). Expect the battery life to be far better than 4.5 hours but we’d be very surprised if you could squeeze nearly 15 hours out of it.",
    "The keyboard keys are a bit small for our liking and felt a tad mushy. We found ourselves struggling sometimes to touch type. Given the real estate available, we’d argue that the designers could have done a better job. As for the touchpad, we found that it lacked firmness on the lower two corners, a common weakness amongst laptops that don’t have physical buttons.",
    "The X30L retails for as little as £1,386 ex VAT in the UK or $2,079 in the US where it comes with a four year onsite warranty (only one year standard warranty everywhere else). How does that compare to the rest of the competition?",
    "The Dell XPS 13 7390 retails for $2,009 (at the time of writing) and features almost the same set of components with two notable differences. The CPU is a Core i7-10710U model - a six-core rather than four-core version - and Dell’s model comes with a 4K touchscreen display. It also has a bigger battery and its warranty includes accidental damage, “keep your hard drive” and next business day onsite service plus Small Business Security 12-month subscription.",
    "Even lighter and cheaper than the XPS 13 is the HP Envy Laptop 13t (currently at less than $1,480). While it offers the same CPU, amount of RAM and SSD storage, it pips the X30L-G thanks to a dedicated graphics card (Geforce MX250) and 32GB Intel Optane memory; the warranty is shorter but includes theft protection.",
    "As for Lenovo, the ThinkPad T490 is the closest in terms of specifications and costs $1,640 at the time of writing with an eCoupon. It comes with a 3-year depot or carry-in warranty and on paper is the weakest of all three competitors.",
    "There’s also a big unknown; AMD unveiled the new Ryzen Pro range of processors in May 2020 and the consensus is that it could be a real game changer with HP and Lenovo having committed to releasing models based on AMD’s new CPU family.",
    "The Dynabook Portégé X30L-G will appeal to those looking for the lightest laptop on the block while accepting any compromise that goes with it. The X30L-G is not the fastest, the thinnest, the cheapest or the laptop with the longest battery life. We love the fact that it comes with a four-year warranty in the US but cringe at the fact that it is not available in the UK.",
    "Although we appreciate the plethora of ports, the lack of Thunderbolt ports at this price point is simply not acceptable. Battery life could and should be much better and the keys could have been a tad bigger as there’s plenty of space around the keyboard itself.",
    "Ultimately, we can’t help but imagine what it would be like if Toshiba engineers swapped the Intel CPU for one of the latest Ryzen processors, which is faster and sips power as it is built on a much smaller manufacturing process."
  ],
  "headers": {
    "2": "Design",
    "6": "Hardware",
    "9": "In use",
    "14": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Toshiba Portégé R700": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/toshiba-portege-r700-706074/review",
    "Vostro 14 5490": "https://www.techradar.com/reviews/dell-vostro-14-5490-business-laptop",
    "£1,386 ex VAT in the UK": "https://www.athema.co.uk/port-x30l-10j-i7-16gb-512gb-w10p-puz20e-00s007en-wc01-p-1840679.html",
    "Dell XPS 13 7390 retails for $2,009": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2360915295929208000/https://www.dell.com/en-us/work/shop/dell-laptops-and-notebooks/xps-13-laptop/spd/xps-13-7390-laptop/cax13w10p1c606cv2",
    "HP Envy Laptop 13t": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1140180744412196100&p=https%3A%2F%2Fstore.hp.com%2Fus%2Fen%2FConfigureView%3FlangId%3D-1%26storeId%3D10151%26catalogId%3D10051%26catEntryId%3D3074457345619343820%26urlLangId%3D%26quantity%3D1%26color%3Dnatural%2Bsilver",
    "ThinkPad T490": "https://lenovo.7eer.net/c/221109/218864/3808?subId1=trd-us-6965003303980095000&sharedId=trd-us&u=https%3A%2F%2Fwww.lenovo.com%2Fus%2Fen%2Fp%2F20RY0002US"
  }
}