{
  "source": "https://www.techradar.com/reviews/fastcomet",
  "title": "FastComet review",
  "category": "computing",
  "updated": "2020-10-15T10:20:35Z",
  "author": "mike-williams",
  "summary": "Fast and feature-packed hosting for more demanding users",
  "verdict": "FastComet isn't the cheapest web host in the long term and it has some strict bandwidth limits, but even the most basic plans are stuffed with features, shared hosting performance is excellent, and helpful 24/7 support is just a click or two away. Take a look.",
  "pros": [
    "Vast product range",
    "Loads of features",
    "cPanel, Softaculous and a quality custom control panel",
    "Great results in our speed tests"
  ],
  "cons": [
    "Above average prices",
    "Very basic support knowledgebase",
    "Storage and bandwidth limits on some plans"
  ],
  "article": [
    "Some web hosting companies market themselves on features, others on power, price, or ease of use, but San Francisco-based FastComet aims to win in just about every department.",
    "Want a wide range of products to choose from? FastComet offers shared hosting, VPS, dedicated servers, WordPress hosting, a graphical website builder, WooCommerce, Magento and more.",
    "Features? Even the most basic shared hosting product includes SSD only storage, a free CDN, Let's Encrypt SSL, SpamExperts spam filtering, malware scanning, free daily backups, cPanel site management, Softaculous for easy installation of WordPress and hundreds of other apps, and live chat support.",
    "Power? The company says all its shared hosting plans include guaranteed resources, including at least two available CPU cores and 2GB RAM.",
    "Unusual extras? Try eleven data centers around the world: North America, Europe, India, Singapore, Japan and Australia. Or the ability to try out the website builder's templates in a browser before you sign up (there's an example here).",
    "Honesty? FastComet doesn't pretend you can have 'unlimited' storage and traffic, but it does at least spell out what it considers 'acceptable use' to be. The baseline hosting plan gives you 15GB web space and allows around 30GB traffic a month, for instance, equivalent to an average 500 page views a day.",
    "(The company explains that this isn't some hard limit where it shuts down your site if you break the rules. The official policy is that 'if your website requires more resources, our team will send you a notice with a detailed report and suggestions on how to optimize your website for better resource utilization or possible upgrade options.')",
    "FastComet's pricing isn't quite all it seems. Sure, shared hosting plans look great value, starting at just $2.95 a month billed monthly or over one to three years. But that's more down to the steep introductory discount, and the plan renews at $9.95.",
    "It's a similar story with VPS plans, where even the baseline Cloud 1 product starts at $35.97 billed monthly, $59.95 on renewal. That looks expensive, especially when some providers have headline prices of $10 a month or less, but check out the specs and the reasons become clear. You're getting 2GB RAM, 50GB storage, 2TB bandwidth, twice what you'll see with some starter VPN plans. This is a fully managed product, where FastComet looks after the low-level technology for you. CPanel, Softaculous and WHM are included (they're often costly extras elsewhere), and premium features like daily backups and spam filtering are also included in the price.",
    "FastComet may not be the best provider if you're looking for unlimited resources at the absolute lowest price, then, but if you're more interested in features and functionality, there's a lot to like. Especially as the generous money-back guarantee gives you 45 days to decide if FastComet is the provider for you.",
    "Many web hosts give only the most basic information on what's included in their various plans. You might have to spend time browsing the support site to find any low-level technical details, if they're available at all.",
    "FastComet is refreshingly different. Its shared hosting comparison table is absolutely stuffed with information, and for example even the Email section has 16 separate items listed.",
    "Although there's a lot of technical detail here, it's not just for geeks. The Mail Quotas panel explains that FastComet supports 50MB attachments, for instance, and inbox size range from 500MB to 2GB on the shared hosting plans. That's the kind of information which should be easily available before you sign up for a hosting plan, but rarely is.",
    "Pick a plan, and signing up works much the same as usual: choose a domain, select a data center and subscription length, choose a payment method (card or PayPal) and hand over your cash.",
    "This all ran smoothly for us. The purchase page highlighted the renewal price, as well as the special deal, making it clear that there would be price hike, down the line. There are a handful of optional extras - search engine submission, SEO audit - but FastComet doesn't add any of these by default. Payment went as expected, and the company didn't hit us with demands to verify our identity, or other hassles: it just sent an email with our account details, and we were ready to go immediately.",
    "FastComet accounts are managed from the company's own custom dashboard. That's normally bad news - most providers only use a custom control panel because they don't want to buy a WHMCS license - but, surprisingly, FastComet's panel works very well. It covers all the core areas of the service, including plan summaries, domain management, billing and support. There are handy shortcuts to common tasks, and a smartly designed Observer dashboard shows detailed site resource use and keeps you up to date with any alerts.",
    "If you're not interested in any of that, no problem. Much like any other hosting dashboard, view your account and you can fire up a standard cPanel installation with a click.",
    "'Standard' is maybe a little unfair, because FastComet has taken more opportunity to customize cPanel than usual. Scroll down to the Software section, for instance, and you can use Softaculous to automate the installation of WordPress and hundreds of other top apps. But you can also launch FastComet's graphical website builder; browse its themes; maybe install and manage a Ghost blog.",
    "If you prefer the DIY approach, there are plenty of manual options, from uploading files via the File Manager, creating and using FTP accounts, or creating and managing databases for phpMyAdmin and more.",
    "Immediate help is on hand on the company's support site. This has a disappointing knowledgebase with minimal content (just five articles to cover cPanel and WHM), but that seems to be because FastComet has devoted all its time to the Tutorials section. This has plenty of useful advice which goes way beyond the basics.",
    "The WordPress section, for instance, starts by explaining how you can install the app from Softaculous. But then it goes on to discuss manual installation, configuring WordPress settings, installing a custom theme, managing posts, importing and exporting content, even discusses useful plugins you might want to try.",
    "If that doesn't help, you're able to open a chat window or a support ticket in a click or two. We were speaking to an agent within a couple of minutes, and he answered our test questions quickly and clearly.",
    "Speed matters, even with simple shared hosting - an unresponsive website will drive many of your visitors elsewhere.",
    "We check performance by using Uptime.com to measure the availability and response time of our test site. This involves downloading a page from our site every 5 minutes, giving us more than 2,000 data points in total.",
    "Average response time was a mere 231ms, good news when the industry average for shared plans is closer to 300ms. In fact, in our most recent tests, several big-name providers never managed a 231ms response time in a single one of our checks (DreamHost, Hostwinds, Bluehost, more.)",
    "Keep in mind that this is a test based on a provider's most basic shared hosting plan, though. Upgrade to a plan with more resources, or opt for a cloud hosting, VPS or dedicated product and the results may be very different.",
    "FastComet's prices can seem high, but that's mostly because they're full of high-end features which are normally paid extras elsewhere (and the great results in our speed tests deserve a small price premium, too.) If hosting power is your top priority, give the company a try."
  ],
  "headers": {
    "10": "Signing up",
    "15": "Creating a site",
    "22": "Performance",
    "26": "Final verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "FastComet": "https://www.fastcomet.com/",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated servers": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "there's an example here": "https://themesdemo.fastcomet.com/templates/Endearing_Green",
    "shared hosting plans": "https://www.fastcomet.com/pricing",
    "VPS plans": "https://www.fastcomet.com/vps-pricing",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Tutorials section": "https://www.fastcomet.com/tutorials"
  }
}