{
  "source": "https://www.techradar.com/reviews/hitfilm-pro-15",
  "title": "HitFilm Pro 15 review",
  "category": "computing",
  "updated": "2020-10-23T15:50:45.508Z",
  "author": "steve-paris",
  "summary": "A professional video editor with powerful compositing tools",
  "verdict": "HitFilm Pro is a remarkable piece of software. It can chug along unless you have a truly powerful computer, but what it offers in terms of effects creation is truly impressive, making it hard to beat.",
  "pros": [
    "Impressive list of compositing tools",
    "Great new features",
    "Customisable workspace",
    "Mac and PC compatible"
  ],
  "cons": [
    "Basic transitions and audio effects",
    "Needs a powerful computer to make full use of it"
  ],
  "article": [
    "FXhome’s HitFilm Pro is one of many video editing software apps for Mac or PC fighting for your attention, and between the free software, and the behemoths used for professional video editing, it’s a hard segment to wedge yourself in. And wedge itself, it has.",
    "In a time where some software companies are considering going subscription only, and others have already embraced that business model wholeheartedly, it’s a pleasure to see a developer sticking to the traditional approach that you are actually purchasing a tool.",
    "With that in mind, what do you get for HitFilm Pro’s original purchase price of $359 (£308.86)? Well for one thing, you have the ability to install the software on up to three computers, and free updates for a year. If you would like additional updates after that, you’ll have to pay for another year, but contrary to subscription software, if you choose not to, you can still use the tool you already paid for, for as long as you please, without giving the developer another penny.",
    "HitFilm Pro is an advanced video editing tool and compositor, which means you can cut a movie and apply effects to it (like colour correction or green screen), all within the same software package.",
    "The workspace on display is versatile enough so you can easily change the layout to suit your needs, adding, removing or reordering panels as you see fit. This kind of functionality is exactly the same as its smaller sibling, HitFilm Express, except the interface is black, instead of Express’ white.",
    "With HitFilm Pro, you’re able to edit and composite (ie add effects, titles, etc), all in one place. You can apply most effects directly onto a clip, or by creating a composite shot. This prepares it for all manner of alterations that will be applied to it, and is the only way to work with effects labeled “layer only”.",
    "It’s easy to import your media, preview it, set in and out points, and insert clips into your project. Depending on your computer’s power, HitFilm has support for up to 8K video (by contrast, HitFilm Express, is limited to 4K). The editing side has everything you’d expect, from standard tools like blade, slip, slide and roll, to navigating along your timeline, either by mouse, or keyboard (thanks to JKL shortcuts).",
    "You can animate pretty much any clip’s value, be it its basic properties (like size, position, opacity), or any effect you apply to it (or to the layer as a whole). There’s even a supplemental timeline section you can open up in the Controls panel to manually interact with all the keyframes you’ve created, allowing you to move them around, change their values, delete them, and even add new ones with ease.",
    "It’s possible to manipulate the clips’ audio layers, and even apply some effects to them, but contrary to what HitFilm Pro offers in the way of visuals, your options there are pretty limited. The same also applies to transitions. Yes, you have the basic ones at your disposal, and can control a few of the parameters, but you’re offered little beyond that.",
    "Where HitFilm Pro truly shines however, is in the visual special effects department. This is this app’s biggest selling point, as it offers a myriad of effects and presets. You have access to masks, blue/green screen keying, particle simulators, distortion effects, powerful colour correction tools - the list is impressive.",
    "If you work in 3D, you can import 3D models into your scene, have access to tracking features, and there’s even a dedicated 360 degree viewer for those with the right recording equipment.",
    "Granted, these effects aren't as advanced as After Effects, but on the plus side, HitFilm Pro is easier to use.",
    "In fact, FXhome is so invested with the compositing side of its software that the interface’s Home tab (the section that opens up when you launch HitFilm Pro) is dedicated to highlighting some of the tutorials they regularly publish, teaching you how to create a vast array of effects with its program.",
    "Fantastic though this is, there is a drawback: you need a powerful computer to be able to render these effects - there are options to lower the quality of your creations during playback but if you want to truly see how everything looks in real time, you’ll have to render it first, and any changes you make after that will mean having to render it all over again. Each time.",
    "We’ve already explored some of the new features for version 15, in our review of HitFilm Express, however, as always, the developers have kept the best ones for their “Pro” software.",
    "These include, a new auto-stabiliser function which attempts to smooth out the motion of a handheld camera. The effectiveness of this tool will greatly depend on the quality of the footage - don’t expect miracles. However if will remove to great effect very gentle wobbles that are unavoidable when trying to keep a camera steady.",
    "As you’d expect even though it’s called ‘auto’, you also have control over its parameters and can manually change them should you want to.",
    "A fun new addition is the Motion Tracking effect. Yes it was possible to create such effects beforehand, but this new addition make it almost effortless: create a composite shot, add an item to it, use the effect to link it to the clip, select the area to track and you’re pretty much done. Hitfilm Pro will track that area over time and move the object to match it.",
    "The third new feature we’d like to talk about here is the Colour Adjustment. It’s an easy way to make visual changes to your clip. You use the colour picker to select the colour you want, extend its range as required, and after that you just need increase of decrease the saturation of that colour, or alter its hue, using a smoothness setting to avoid unwanted artefacts. It works exactly as advertised.",
    "The Export tab is there, when it’s time to share your work with others. You have a series of presets to choose from (the default one is YouTube in HD).",
    "Exporting means saving it to your hard drive. Once done it’s up to you to upload it to social media or anywhere else you’d like to share your creation with.",
    "Best of all, these exports happen in the background, allowing you to keep on working on other parts of your project at the same time.",
    "HitFilm Pro is a complex, full featured video editing and compositing application. You can create quite complex projects with it, as shown by the numerous tutorials on offer. Its price puts it in the professional range of the market, and there is no reason why it shouldn’t be there.",
    "You are able to download a free trial whose only apparent limitation is a huge watermark applied to your export. If you’re looking for a powerful and versatile editing app, you should definitely check it out."
  ],
  "headers": {
    "3": "Interface and workflow",
    "9": "Special effects",
    "14": "New for 15",
    "19": "Export",
    "22": "Final verdict"
  },
  "links": {
    "HitFilm Pro": "https://fxhome.com/hitfilm-pro",
    "video editing software": "https://www.techradar.com/best/free-video-editing-software",
    "HitFilm Express": "https://www.techradar.com/reviews/hitfilm-express-151"
  }
}