{
  "source": "https://www.techradar.com/reviews/lg-gram-14-2020-core-i7-10th-gen-laptop",
  "title": "LG Gram 14 2020 Core i7 (10th gen) laptop review",
  "category": "computing",
  "updated": "2020-07-24T13:25:35Z",
  "author": "desire-athow",
  "summary": "This is the lightest big-screen laptop on the market but is it good for businesses?",
  "verdict": "The LG Gram 14 2020 laptop is very close to perfection (although that’s a subjective stance). It may not be as compact as some of its rivals but it does offer way more features. That said the overall performance of the device feels like a slight let down.",
  "pros": [
    "Pros",
    "Great Battery life",
    "IP68 rating",
    "Removable memory and SSD",
    "Plenty of expansion ports",
    "Weight",
    "Clever fingerprint reader placement",
    "Spacious keyboard"
  ],
  "cons": [
    "Very glossy display",
    "Average performance",
    "Soldered memory",
    "Not as compact as we’d expect",
    "Slightly disappointing write speeds",
    "Noisy"
  ],
  "article": [
    "Like its archrival Samsung, the Korean chaebol is not exactly known for its PC business although it does produce thin clients, all-in-one PCs, projectors, monitors and, of course, laptops. So the LG Gram 14 (2020) laptop, which we are reviewing today, might seem a bit of an oddity. The LG Gram range is known first and foremost for its ability to deliver a lot of hardware in an unbelievably light package and the 14Z90N ticks all the right boxes but will it be enough to wow us?",
    "You can buy the LG Gram 14 2020 (14Z90N-N.APS7U1, Core i7, 16GB and 512GB) for less than $1,290 in the US from Provantage.",
    "The LG Gram 14 laptop owes a lot of its properties to its magnesium alloy chassis, giving it that matte grey finish (LG calls it dark silver) that whispers classy quality rather than the usual silver colour scheme.",
    "Despite having a 14-inch inch display, the Gram 14 weighs less than 1kg while the 15-inch version pushes the scale up to 1.15kg, and the 17-inch version is jaw droppingly light at just 1.35kg. Truth be said, we expected something far more compact and its dimensions - 323 x 209 x 16.8mm - means that it has plenty of space and usable real estate.",
    "It has twice the number of ports/slots compared to its nearest competitor, the Dell XPS 13: there’s two USB ports, one Thunderbolt 3 connector, one audio jack, a microSD card slot and even an HDMI output. It even packs a spare Gigabit Ethernet adaptor plus its fingerprint reader is even integrated with the power button.",
    "Underneath the laptop are four big round rubber feet that slightly elevate the device, just enough for sound from a pair of speakers located there to come out.",
    "Inside the LG Gram 14 2020 is a 10th generation Core CPU, the i7-1065G7 with a 16GB LPDDR4X RAM and a 512GB SkHynix HFS512GD9 SED (Self-encrypted Drive) NVMe solid state drive as well as an industry-leading (at least in this category) battery size of 72WHr.",
    "The processor is one of the first mobile processors to come out from Intel’s 10nm fabs. As such, it is expected to dissipate less heat, clock to higher speeds, pack more transistors per unit area and, at least for Intel, cost less to build. Compared to its other Core i7 contemporary, the i7-10510U, it has a much lower base frequency and a faster Iris Plus graphics.",
    "The rest of the specification list includes support for DTS:X Ultra (an alternative immersive 3D audio format to Dolby’s Atmos), Wi-Fi 6 and Bluetooth 5, courtesy of the Intel AX201 and a 14-inch IPS LG display.",
    "The power supply unit is, disappointingly, a traditional brick one that connects via a proprietary power port. We hope that one day, a vendor will produce a PSU that can double as a docking station. Note that you can upgrade the SSD and the memory as well. Sadly, while there is one available memory slot, there’s also 8GB of memory that’s soldered and therefore not upgradable.",
    "The lid of the LG Gram 14 flexes a bit but should be fine. What we didn’t like though was the glossy reflective screen which works great for contrast but not exactly ideal in brightly lit environments. Nevertheless, in optimal lightning conditions, the contrast was excellent with great colour reproduction and viewing angles.",
    "Opting for a 14-inch form factor might have seemed like a bad idea to some but it does provide the Gram 14 with an undeniable advantage; that of not having to worry about a cramped keyboard. The backlit keyboard lacks the depth of the Dell Latitude range for example but it is not as noisy and still retains all the elements of a good typing experience. Unsurprisingly, touch typing was a treat.",
    "The palm rest is generous but we frown at the extra stickers that sully the aesthetics of such an engineering marvel. As for the touchpad, it is equally generous in size but lacks the physical buttons that some business users linger for.",
    "And just because it is featherweight doesn’t mean that this laptop is a pushover; it adheres to the stringent MIL-STD-810G certification which should make it more resistant than most laptops on the market (but not splashproof).",
    "When it comes to performance, its write speed was lower than we’d expect, the processor performance was also lower, somewhere between a traditional Core i5 and a Core i7. Battery life - as expected - was one of the best we’ve seen on a laptop, comparable to the (slightly heavier) PC Specialist Lafité Pro with a 74WHr battery.",
    "If you are considering the LG Gram 14, it means that you are interested in a premium laptop that weighs less than 1Kg and doesn’t cost the Earth.",
    "The Apple MacBook Air was the one that kickstarted the ultrabook, thin-and-light revolution more than a decade ago thanks to Intel’s first Core CPUs. A fully loaded model with a Core i7 CPU, 16GB memory and half a Terabyte onboard storage costs about $1,700. It has two ports only, weighs 300g more and has a 50WHr battery capacity. But this is an Apple model so expect plenty of bundle Mac applications and a long battery life despite a much higher screen resolution..",
    "The Dell XPS 13 has the other Core i7 CPU (the 14nm one) and costs less ($1150 at the time of writing). It lacks the versatility of the LG Gram 14 but does offer three USB Type-C ports (well, two as Thunderbolt 3). It has no HDMI connector, a smaller battery and weighs more despite having a more compact body. On the flip side, Dell also has a more extensive after sales support network which makes it a better fit for some.",
    "The Lenovo Thinkpad X390 is your archetypal business laptop. Available for as little as $1100, it features an older but still very capable 8th generation Core i7 CPU with support for Intel’s vPro technology and Windows 10 Pro. It is heavier than the Gram 14 but has one extra USB connector and can even accommodate an embedded 4G LTE modem.",
    "The LG Gram 14 2020 laptop was one of the most anticipated laptops of the year and it didn’t disappoint."
  ],
  "headers": {
    "1": "Price",
    "2": "Design",
    "6": "Hardware",
    "10": "Performance and in use",
    "15": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Provantage": "https://www.provantage.com/lg-electronics-14z90n-aps7u1~7LGE9199.htm",
    "docking station": "https://www.techradar.com/deals/best-usb-c-adapters",
    "PC Specialist Lafité Pro": "https://www.techradar.com/reviews/pc-specialist-lafite-pro-business-laptop",
    "Apple MacBook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-2020",
    "Lenovo Thinkpad X390": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/lenovo-thinkpad-x300-318679/review"
  }
}