{
  "source": "https://www.techradar.com/reviews/oneplus-7-pro",
  "title": "OnePlus 7 Pro review",
  "category": "phones",
  "updated": "2020-06-05T20:17:49Z",
  "author": "matt-swider",
  "summary": "Still a powerful phone with a pop-up selfie camera and sharp 90Hz display",
  "verdict": "The OnePlus 7 Pro has a few surprises behind its stunning all-screen front, unblemished by a notch cutout or punch-hole camera. It hides a novel pop-up selfie camera and offers a 90Hz screen refresh rate that makes games and movie-watching look extremely fluid. Even if it doesn't have the best camera phone, it has features that Apple and Samsung aren’t giving you in 2019, and performance to match. One more surprise, though: this new OnePlus phone now costs almost as much as the iPhone XR and Galaxy S10e.",
  "pros": [
    "Brilliant true all-screen display",
    "Pop-up camera has wow factor",
    "Fast performance and charging"
  ],
  "cons": [
    "Camera is good, but not great",
    "Costs more than the OnePlus 6T",
    "Tall display isn't for smaller hands"
  ],
  "article": [
    "Update: In order to find out just how good the OnePlus 7 Pro camera is, we've put it head-to-head with the Huawei P30.",
    "Which phone picks up color better? Which has more detailed zoomed snaps? And which did we use to take a pigeon pic with? To see the results of our test, head over to our OnePlus 7 Pro vs Huawei P30 camera comparison piece.",
    "The OnePlus 7 Pro is ready to take your portrait with its novel pop-up front-facing camera and then dazzle you with its silky-smooth, truly unblemished all-screen display – two features Apple and Samsung can’t claim with their market-leading flagship phones.",
    "The flagship phone still outmaneuvers its top-shelf competition, offering similarly high-end power and features at a consumer-friendly (meaning lower) cost. In sum, OnePlus has done it again.",
    "But brace yourselves, long-time fans: this new model is more expensive than last year’s OnePlus 6T, the lower-featured regular OnePlus 7, and its competition, the Honor 20 Pro.",
    "Yet compared to the OnePlus 8 Pro that launched in early 2020 with an even higher pricetag, the 7 Pro remains a powerful phone that can still compete with the best phones on the market.",
    "What do you get from the OnePlus 7 Pro in exchange for the extra cost? An upgrade deserving of the ‘Pro’ name: this smartphone has an immersive 6.67-inch screen that challenges Samsung’s display crown by ditching the ugly bezel outline and gaining a 90Hz refresh rate for a more fluid gaming and scrolling experience.",
    "Its 19.5:9 aspect ratio is fairly tall, so don't expect small hands to reach all corners of the stretched-out display. We wish there was a OnePlus 7 Pro mini, but we still appreciate the curved edges for an overall thinner profile. The second-gen in-screen fingerprint sensor has also been improved to help you more reliably access the phone the first time you press your thumb to the glass.",
    "Underneath the HDR10+ screen are Qualcomm’s top-of-the-line Snapdragon 855 chipset, a hefty 4,000mAh battery that powered us through a day (but not any longer than that), and up to 256GB of storage and 12GB of RAM – that latter spec is actually more than you need from a phone, so the 8GB version is just fine.",
    "The OnePlus 7 Pro triple-lens rear camera array is spearheaded by a 48MP sensor, new 3x telephoto and ultra-wide lenses, and low-light-ready Nightscape mode. It's closer to Google Pixel 3 and Huawei P30 Pro quality, but not the best camera phone. OnePlus has already issued several software updates focusing on the camera, and we've updated our review to offer an in-depth OnePlus 7 Pro vs the Huawei P30 Pro camera comparison to see just how far apart they are.",
    "Missing OnePlus 7 Pro features include a 3.5mm headphone jack, microSD card slot and wireless charging, which will be a headache but not a deal break for some folks. Good news, it offers the fastest charging rates we’ve tested via an included oversized Warp Charge 30 adapter, while there’s also a new stereo speaker system.",
    "The OnePlus 7 Pro is closer to delivering everything you want from a flagship phone than any previous OnePlus handset – but for this reason it also no longer fits into the budget or mid-range categories. Once hailed a ‘flagship killer’, the OnePlus series is now a flagship to be killed.",
    "For those tempted to dip their toes into the brave new world of 5G, OnePlus also has you covered with the OnePlus 7 Pro 5G. It's an identical handset with the only difference being the addition of 5G connectivity. It will, of course, cost you more though.",
    "The OnePlus 7 Pro release date was Friday, May 17, 2019 although die-hard fans in the US were able to purchase it after May 14's launch event T-Mobile promotion. They waited in a long line to be the first to buy this phone.",
    "The OnePlus 7 Pro price starts at $669 (£649 / AED 2,849) for its entry-level configuration with 6GB of RAM and 128GB of storage, an option only available in Mirror Gray, and goes up to $749 (£799 / AED 3,249) for 256GB / 12GB of RAM, with this version only available in the more appealing Nebula Blue finish.",
    "We think the sweet spot for most OnePlus 7 Pro buyers will be $699 (£699 / AED 2,999) for the 256GB / 8GB configuration – which is also what T-Mobile happens to be pushing to all of its consumers in the US – and this is also the only option to come in both Mirror Gray and Nebula Blue.",
    "If you've got some extra money burning a hole in your pocket, you can spend a bit more and pick up the OnePlus 7 Pro 5G, giving you access to the latest network connectivity with even faster data speeds.",
    "Is OnePlus 7 Pro too expensive for you? A cheaper, less flashy OnePlus 7 will be sold eventually in the UK and Europe, while the OnePlus 6T will continue to be sold in the US, which won’t get the OnePlus 7 at all.",
    "Not expensive enough? There's a pricier OnePlus 7 Pro 5G version of the phone with super-faster internet speeds, though it's exclusive to certain carriers (for instance, Sprint in the US and EE in the UK).",
    "This is where OnePlus has put the most work into its new phone, and it shows. There’s more screen, and more fluidity, here than on almost any phone we’ve tested to date.",
    "The OnePlus 7 Pro will be the first true all-screen phone that most of the world will be able to buy – there’s no notch and no punch-hole blemishes. Its novel pop-up front camera doesn’t eat into the display real estate, and it’s an idea we’ve already seen in Vivo, Oppo and Xiaomi devices launched in China. But this phone has worldwide appeal.",
    "Its bezelless 6.67-inch display is only half the story. OnePlus calls its display ‘Fluid AMOLED’, touting a refresh rate of 90Hz instead of the usual 60Hz. We experienced smoother motion when watching TV and playing games, and also found that simply scrolling web pages looked better. It’s hard to go back to 60Hz after experiencing the OnePlus 7 Pro at 90Hz – every phone should have this.",
    "We’ve tested, and appreciate, the gamer-focused Razer Phone 2 at 120Hz and the Asus ROG Phone, which sits at a OnePlus-tying 90Hz. But the 7 Pro offers a more mainstream design and appeal, and it has faster specs, a better camera and superior software to boot.",
    "The OnePlus 7 Pro has a 19.5:9 aspect ratio that stretches from top to bottom, making it easier to get sucked into a fast-paced racing game on this screen. But, as mentioned, its tall proportions mean it’s not ideal for anyone who’s looking for a smaller phone.",
    "The OnePlus 7 Pro design is almost everything you want from a smartphone in 2019. It looks like an ever-so-slightly taller version of the Galaxy S10 Plus – without the punch-hole camera.",
    "It has the same thin black bezel screen outline, same curved edges, and same glass build, with the tapered edges coming to a fine point, making it easy to grasp the thin frame. It’s hard not to like holding this big phone, even if it does take two hands to operate it comfortably. And if you’re afraid of dropping it, OnePlus has included a clear plastic no-frills case in the box.",
    "OnePlus 7 Pro’s colors are glossy Mirror Gray and the more appealing Nebula Blue gradient in a matte finish, although, as mentioned, your choice of color is dependent on which storage/RAM combination you opt for. Later this year, the company will also introduce a glossy golden Almond color that also looked like a standout hue when we got to see it.",
    "Not everything mirrors Samsung’s design, and that’s both good and bad news. We love the psychical alert slider on the right side – why the iPhone continues to be the only other smartphone line with an easy-to-blindly-access mute switch is beyond us. There’s also no Bixby button to mistake for a volume-down button on the left side; OnePlus sticks an on-screen Google Assistant shortcut in the bottom-left corner of the lock screen, and that’s just fine for us.",
    "What the OnePlus 7 Pro lacks is a 3.5mm headphone port – the company axed it from last year’s 6T, and it was hardly going to bring the feature back when it has improved Bullet Wireless 2 earbuds to sell you. It’s also 0-for-10 on adding wireless charging and a microSD card slot. And it's not officially IP-certified water-resistant, though the theory is that this is just a way to save money and it’ll do fine with a normal dunk. These omissions are either a big deal for you, or they’re not – we do think the internal storage options are generous enough for most people.",
    "We’re not sure if pop-up selfie cameras are the future of our self-indulgent smartphone photos, but it’s a wow-inducing idea for 2019 – and they leave phone screen completely unblemished.",
    "The camera pops out of the top of the OnePlus 7 Pro’s body with a faint mechanical whir, but only when the camera app is active and in selfie mode. Otherwise, it remains hidden.",
    "Concerned that introducing new mechanical parts would leave this phone prone to damage? Us too. What’s neat is that if you drop it – or pretend to drop it like we did to trigger the gyro sensor – the pop-up camera actually retreats back into its protective shell while in free-fall.",
    "It’s still a part that can break, but this is a well-thought-out safety measure to minimize risk.",
    "However, in an attempt to provide customers with some assurance as to the durability of its pop-up camera, OnePlus has posted a 12 hour long, stress-test video of the selfie snapper. If you're got literally nothing going on today, you can watch it below.",
    "The actual photo quality matches the camera’s spring-loaded sophistication – sometimes.",
    "It thrives in well-lit environments, smooths skin way too aggressively in dim lighting, and overall has superior HDR compared to the front camera in other phones in this price range, though the Google Pixel 3 and Huawei P30 Pro took far better selfies in our side-by-side tests.",
    "It’s a step up from the more ghostly, often blown-out selfie photos we got using the OnePlus 6T and its teardrop-shaped front camera, though be aware that the OnePlus 7 Pro’s pop-up camera exhibits some barrel distortion due to its wide field of view.",
    "You may have a long face for more than one reason if you hold this handset below your chin.",
    "This main camera has consistently been OnePlus’ biggest weakness. Good news: we found that the OnePlus 7 Pro triple-lens rear camera captures vastly better photos than its predecessors, even if it isn’t always close to being the best camera phone.",
    "Its 48MP camera with an f/1.6 aperture leads the charge, exhibiting more texture, less shadow, and slightly warmer colors than last year’s OnePlus phones. Gone are the occasionally ghostly and often muddy looking pictures in favor of brighter, sharper images, especially in ample light.",
    "Here’s why still isn’t the best: in dim light, it’s often too warm and amps up skin smoothing to compensate for noise – no one wants an airbrushed face with a red glow in a restaurant photos. Side-by-side comparisons show that the Pixel 3 (and the Pixel 3a) have more color pop when appropriate, and better portrait bokeh. The portrait mode here is uncomfortably tight, a lot more so than the OnePlus 6T, and lacks clarity in low light.",
    "Night Sight mode is back for low-light shots, and it’s been improved. Specifically, it’s tempered to not blow out white lights in mixed-lightning night shots. But you’re going to have to put the OnePlus 7 Pro on a tripod to really do this mode justice; even a slightly shaky hand on a cold night makes a scene look as if it’s melting all around you, and any movement causes light streaks and blurriness.",
    "The 8MP f/2.4 telephoto lens offers 3x zoom with optical image stabilization (OIS), capturing far off subjects. Note: it's really a 13MP lens with a 2.2x optical zoom, according to a Reddit sleuth, and some tricky cropping to get it to the 3x finish line. It still gets you closer without digital distortion, though Huawei P30 Pro 5x telephoto lens reigns supreme. OnePlus 7 Pro 16MP f/2.2 ultra-wide lens does the opposite with a 117-degree field of view we found ideal for landscape photos, but soft edges.",
    "With the OnePlus 7 Pro we have a good but not flawless smartphone camera. Its triple-lens configuration offers shot variety, but its biggest attribute is the fact that it fixes the problems experienced with last year’s OnePlus cameras. The best cheap camera phone is the Pixel 3a and Pixel 3a XL, but this does an admirable job in most conditions.",
    "In order to properly understand how good the OnePlus 7 Pro camera is we put it head-to-head with the Huawei P30 – read our full analysis of the two smartphone snappers and how they compare in our camera comparison article here.",
    "The OnePlus 7 Pro tagline ‘Go beyond speed’ means this phone focuses on more than just clock speed, but raw performance certainly isn’t neglected. It’s among the fastest Android phones we’ve tested, tied with the LG G8 and nearly as fast as the Samsung Galaxy S10 series.",
    "It’s the mighty Snapdragon 855 chipset that delivers a nice boost in clock speed, and up to 12GB of RAM that offers a high ceiling. We had no problem running apps, while downloading games, and watching a video all at the same time. That said, most people should be fine with the 8GB version of this phone. The OnePlus 7 Pro is built for performance.",
    "Extending its horsepower, there’s a 10-layer liquid cooling system underneath the glass hood to prevent the phone from getting too hot, while there’s also a new haptic vibration motor to provide instant feedback with new levels of granularity. The RAM boost, cooling system and enhanced vibrations combine to make this a solid gaming phone.",
    "There’s one more secret weapon in the OnePlus 7 Pro specs: it’s the world’s first phone with UFS 3.0 storage. This means it has faster read and write speeds, so while OnePlus persists with not including a microSD slot, the transfer speeds from the beefy internal storage options are 20x faster than those from the external card format that’s popular among other Android phones.",
    "Oxygen OS is OnePlus’ software skin running on top of Android 9.0 Pie. It offers a light amount of alterations to Google’s operating system ethos, with a minimalistic flat design – and the extras that are here are really likable changes.",
    "New with the OnePlus 7 Pro software suite is a built-in screen recorder. You can capture everything that’s happening on your display if you want to, for example, create a play-by-play video tutorial. You can even choose to record internal or external audio.",
    "Google thinks full-length screenshots are ‘infeasible’ for stock Android, but OnePlus has you covered with its returning Extended Screenshot tool, and it’s reintroduced with more scrolling screen fluidity thanks to the OnePlus 7 Pro’s 90Hz refresh rate – gone is the jerky motion of stitching and moving down a long web page.",
    "Zen Mode is a new software perk along the lines of Google’s Digital Wellbeing, encouraging you to put down your phone more often. Entering this mode restricts your phone usage for 20 minutes – no texts, no checking the news and no social media whatsoever. You can still make and receive calls and take photos, but the point is to give yourself a 20-minute digital break.",
    "The OnePlus 7 Pro is close to pure Android, it has fun software extras, and it’s easy to use. Best of all, the company has been quick to update to new versions of Android – it’s even beta-testing the OnePlus 6T with Android 10 Q, whereas Samsung takes forever with updates.",
    "There’s a hefty 4,000mAh battery inside the OnePlus 7 Pro, and it’s been solid enough to get us through a full day of normal use. It matched our experience with the OnePlus 6T, which has a slightly smaller 3,700mAh battery, but also a less impressive screen at 60Hz.",
    "We never found ourselves frantically hunting for a power socket over the course of a day, but we did need to make sure we had the Warp Charge 30 charger with us overnight – and that’s where the real OnePlus 7 Pro news is, battery-wise: it’s the fastest-charging phone we’ve tested, hitting over 90% after an hour’s charge in multiple tests.",
    "The oversized Warp Charge 30 adapter and cable that are included in the box took us from 0% to 34% in just 15 minutes, then to 60% after 30 minutes, and we reached 100% in 1 hour and 23 minutes. We found that regular USB-C adapters provided much less impressive speeds.",
    "WarpCharge 30 is noticeably faster than Samsung’s aging Adaptive Fast Charge technology; however, with no wireless charging and slower speeds with USB-C adapters, you’ll want to remember to pack this specific charger when you’re on your travels.",
    "First reviewed: February 2019"
  ],
  "headers": {},
  "links": {
    "Huawei P30": "https://www.techradar.com/reviews/huawei-p30-review",
    "OnePlus 7 Pro vs Huawei P30 camera comparison": "https://www.techradar.com/news/oneplus-7-pro-vs-huawei-p30-the-ultimate-camera-test",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "Honor 20 Pro": "https://www.techradar.com/reviews/honor-20-pro",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "OnePlus 7 Pro vs the Huawei P30 Pro": "https://www.techradar.com/news/oneplus-7-pro-vs-huawei-p30-the-ultimate-camera-test",
    "waited in a long line": "https://www.techradar.com/news/this-launch-line-belongs-to-the-oneplus-7-pro-not-a-new-apple-iphone",
    "OnePlus 7 Pro 5G": "https://www.techradar.com/news/oneplus-7-pro-5g-is-the-companys-first-super-fast-internet-phone-but-its-not-out-yet",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Reddit sleuth": "https://www.reddit.com/r/oneplus/comments/brxs28/oneplus_7_pros_telephoto_camera_is_not_3x/",
    "Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "camera comparison article": "https://www.techradar.com/news/oneplus-7-pro-vs-huawei-p30-the-ultimate-camera-test",
    "‘infeasible’ for stock Android": "https://www.techradar.com/news/google-brands-scrolling-screenshot-feature-for-android-infeasible",
    "Android 10 Q": "https://www.techradar.com/news/android-q"
  }
}