{
  "source": "https://www.techradar.com/reviews/crysis-remastered",
  "title": "Crysis Remastered review",
  "category": "computing",
  "updated": "2020-09-24T18:52:52Z",
  "author": "ural-garrett",
  "summary": "A bumpy return to Lingshan Island",
  "verdict": "Performance may be all over the place but Crytek’s remaster can push high-end gaming PCs to the limit. Beyond updated visuals is the same shooter about technologically advanced special forces fighting North Korean soldiers and mysterious aliens. From stalking enemies like prey or rushing in guns blazing, the single player campaign for Crysis has aged well. But poor optimization and missing features prevent Crysis Remastered from being the definitive version.",
  "pros": [
    "Improved CryEngine hitting some new PC Gaming benchmarks",
    "Mostly complete single player campaign with light refinements",
    "Only $30 bucks"
  ],
  "cons": [
    "Not optimized well",
    "Ascension chapter from the original release is absent",
    "No multiplayer or expansion packs included",
    "No quick save/load"
  ],
  "article": [
    "Far Cry might have put German developer Crytek on the map in 2004, but 2007’s PC exclusive Crysis solidified it as a studio that pushed technological boundaries. CryEngine showcased what high-end gaming PCs were capable of as seventh-generation consoles found itselves limited by one and two years old hardware. Crytek’s opus set standards for PC gaming visuals enough for “But can it run Crysis” to still be a meme years later.",
    "By the time a port made it to Xbox 360 and Playstation 3 in 2011, hardware limitations meant some unflattering compromises still had to be made. It makes sense, considering how considerably scaled back the respective sequels felt when released simultaneously on consoles. This makes the priced Crysis Remastered a curious case.",
    "More in line with the seventh-gen console ports than the original PC version, there are some significant visual enhancements to the single player campaign along with some light gameplay refinements. However, it still comes at the cost of missing the jaw-dropping Ascension chapter and multiplayer. Gamers who missed the original game in the late 2000s will find a lot to love in Crysis Remastered. Just don’t consider this a full representation or ultimate edition of the original.",
    "At the time, Crysis’ large sandbox environment featured beautifully rendered jungles that were incredibly lush, fantastic lighting and some of the most realistic character models one had seen at that point. The remaster doesn’t provide the same visual splendor of the original but still looks pretty good due to high resolution textures that can reach 8K levels, improved art, better water effects, some redone lighting and support for ray tracing. There’s even a “Can it Run Crysis” graphics preset to push gaming PCs in the same way the original game did back in 2007.",
    "According to Crysis Remastered project lead Steffen Halbig, there isn’t a card available that can hit 30 FPS at 4K with this quality preset – but he did say that before the RTX 3090 came out. Running “Can it Run Crysis” mode at 1080p does deliver some fairly decent results on an Nvidia GeForce RTX 2080 Super. Though dipping occasionally, Crysis Remastered normally runs between 40 and 50 fps. If you want to hit a stable 60 fps consistently, you’re probably going to have to tweak the graphics settings. Even if you do, the frame rate is still a bit rocky – Crysis Remastered is hindered by poor optimization – we even ran into several crashes in our time with the game.",
    "And even though this is a visually enhanced remaster, there are still some problems with textures like foliage that look muddy when you get too close. Meanwhile, ray tracing looks spectacular despite some odd glitches including the player model’s gun disappearing in reflections.",
    "The visual splendor also played into the game mechanics. For instance, the long draw distance even allows players to tactically assess how they want to handle combat encounters ahead of time.",
    "Players control special forces operator Nomad who utilizes a highly advanced Nanosuit to combat North Korean forces and aliens on the mysterious Lingshan Island. Transitioning between being stealthy and bursting into a full-on assault is still quite the experience. Part of that is due to intelligent enemy AI which will employ different tactics to take players down. Creating a distraction with C4 on one side of the base, mowing down some soldiers, hiding out with camo and firing upon the remaining enemies with Armor Mode enabled is still a blast. The ability to fully customize weapons on the fly adds even more to the free form combat allows players to really measure their approach.",
    "An impressive amount of creativity is made possible by the suit’s ability to transition between Speed Mode, Strength Mode, Stealth Mode and Armor Mode. However, similar to the Xbox 360 and PS3 ports, the default controls are similar to Crysis 2. This means that pressing the sprint key automatically allows players to use Speed Mode at the cost of energy and holding the spacebar grants the Strength Mode jump while armor and camo are given separate buttons. Those who want to play Crysis Remastered with the original’s nanosuit control scheme can enable that in the settings, though.",
    "Crysis’ single player campaign remains one of the greatest shooters of all time, but it feels somewhat dated. The game is relatively short at under 10 hours and there isn’t much to do between core mission objectives and the odd collectables. Missing the late game Ascension chapter is incredibly disappointing considering how much of a visual feast it could have been with the modern graphics tweaks. Since the multiplayer and Crysis Warhead are missing, there isn’t much to do besides playing it at harder difficulties. Outside of buying better PC components in the future in order to eventually play “Can it Run Crysis” mode at 8K, there isn’t much of a reason to come back.",
    "Crysis Remastered reminds us of a time when AAA PC games weren’t hindered by console ports. By itself, the single player is still a great semi-open world shooter that allows great levels of freedom. But, lacking the well received multiplayer, the Ascension chapter and Warhead expansion means that it doesn’t feel like a complete package. Anyone who missed out on Crysis the first time around may have a good time despite not receiving the full original game. Longtime fans may be left disappointed with a somewhat better console port."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Can “Barely” Run Crysis",
    "7": "Almost The Same Crysis With Some Improvements",
    "9": "Verdict"
  },
  "links": {
    "CryEngine": "https://www.techradar.com/gaming",
    "Crysis Remastered": "https://www.techradar.com/news/crysis-remastered-looks-glorious-in-8k-on-pc-in-new-trailer",
    "“Can it Run Crysis”": "https://www.techradar.com/news/crysis-remastered-has-a-can-it-run-crysis-graphics-setting-the-ultimate-test-for-your-gaming-pc",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Nvidia GeForce RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "Xbox 360": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-360-703247/review"
  }
}