{
  "source": "https://www.techradar.com/reviews/paysimple-credit-card-processing",
  "title": "PaySimple credit card processing review",
  "category": "computing",
  "updated": "2021-09-03T14:23:52Z",
  "author": "rob-clymo",
  "summary": "PaySimple credit card processing delivers quick and easy transactions",
  "verdict": "PaySimple is a sensible option for service-based businesses that don't have the means to utilize a high-volume card processing service but who also need to be flexible and adaptable to the needs of customers. Simple to sign up for and use, PaySimple is everything its name suggests.",
  "pros": [
    "No contract",
    "A complete solution",
    "Solid customer support",
    "Free trial"
  ],
  "cons": [
    "Less useful for high-volume users",
    "You need to keep an eye on tiered pricing",
    "Apps a bit lacking"
  ],
  "article": [
    "PaySimple credit card processing is based out of Denver, Colorado, and offers a suite of products and services that are well-suited to the smaller business owner, especially during the ongoing coronavirus pandemic.",
    "Having been in existence for around 15 years PaySimple has refined its business and now offers the ability for companies to process payments in flexible ways, as well as automated billing and adding in customer marketing options to complete the picture.",
    "PaySimple is a practical solution because it delivers options for accepting payments online, in-person and via mobile, which means if you’ve got a small business it covers all bases within one package. A free 14-day trial certainly makes it worthy of inspection. Similar products are also available from the likes of Sage Pay, Stripe, Authorize.net, Worldpay, PayPal, Helcim and Clover.",
    "PaySimple states on its website that it has no contracts and no cancellation fees, which is always a bonus if you’re a small business that has to be careful with its cashflow. Also on its website, PaySimple highlights that credit card processing is 2.49% per transaction plus monthly fees along with $0.60 + .20% ACH / eCheck processing costs.",
    "It’s worth noting though that there are other charges such as a monthly maintenance fee of $29.95 and numerous other fees for different back-end aspects of the site. It’s a good idea to head to the PaySimple website and look up their Starter pricing page, as well as the more expensive Standard pricing pages.",
    "While it’s not immediately obvious that there are two different payment plan options, you will want to examine these in detail as they can change the expected overheads you’ll need to pay by quite a lot.",
    "PaySimple has been suitably named as it lets smaller business get up and running with a suite of payment processing tools without too much in the way of fuss or bother. What you therefore get is a merchant account, which lets you process payments, plus a physical card reader for carrying out transactions when the card is present.",
    "You’ll also be able to process payments using a virtual terminal although it’s worth noting that PaySimple only works if you’re based in the USA. As well as offering the convenience of card processing, the service can also be used to set up recurring credit card payments, alongside those one-off transactions, so automated billing schedules are within reach of anyone.",
    "PaySimple is predominantly a cloud-based service, which aside from using the physical card reader, is well suited to businesses who might be in less visible or more remote locations. If you’re using the mobile card reader then it’s not currently chip card-friendly, although that is said to be in the pipeline. The system works well, however, with help from the PaySimple mobile app.",
    "PaySimple is as its name suggests is a pretty straightforward service to operate and at its core is the merchant account, which is aided and abetted by the administration panel. This cloud-based setup means that you can control everything in one handy location, and offers all of the tools to configure regularly-used features, such as the implementation of recurring billing.",
    "PaySimple also has a solid presence on the app front, with both iOS and Android editions present. The iPad version in particular bristles with features while remaining reasonably easy to navigate, although the desktop edition is perhaps the best of the bunch.",
    "Seeing as PaySimple seems to be largely aimed at smaller businesses then the good news is that its support structure is nicely crafted. The people behind PaySimple seem perfectly in tune with the fact that not everyone running a business is on top of every facet of its running. And, crucially, that can often mean taking care of the financial aspect is tough going.",
    "PaySimple therefore delivers a beefy backbone of support, with its 9-7 EST live chat option proving particularly useful. There’s also phone support and a useful e-ticketing arrangement for filing more complex issues. More basic enquires can be easily tackled via the FAQ area while there’s also an online help center, comprehensive user guide and blog pages to also enjoy. It’s comprehensive.",
    "PaySimple’s US-based operation is slick, stylish and, for its users, wonderfully straightforward. With a raft of options at your disposal, including the ability to carry out one-off and also recurring credit card payments, PaySimple is a great little system for many smaller businesses.",
    "The flexibility of being able to process payments online, using a point of sale system and also with a card reader means it’ll tick a lot of boxes for many. In addition, PaySimple receives a lot of praise for its impressive range of customer support options, including lots of opportunities to speak to real people on the phone, which is always a bonus.",
    "That 14-day trial is perhaps the best way to see if PaySimple ticks all the boxes for you."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "8": "Performance",
    "9": "Ease of use",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "PaySimple credit card processing": "https://paysimple.com/accept-payments/credit-card-processing",
    "smaller business": "https://www.techradar.com/best/best-credit-card-processing-service",
    "process payments": "https://www.techradar.com/how-to/how-to-take-card-payments-contactless-or-pin-based",
    "Sage Pay": "https://www.techradar.com/reviews/sage-pay-credit-card-processing",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "Authorize.net": "https://www.techradar.com/reviews/authorizenet",
    "Worldpay": "https://www.techradar.com/reviews/worldpay",
    "PayPal": "https://www.techradar.com/reviews/paypal-credit-card-processing",
    "Helcim": "https://www.techradar.com/reviews/helcim-credit-card-processing",
    "Clover": "https://www.techradar.com/reviews/clover-pos-point-of-sale-review",
    "Starter pricing": "https://paysimple.com/pricing/starter-pricing-details",
    "Standard pricing": "https://paysimple.com/pricing/pricing-details",
    "PaySimple’s": "https://paysimple.com",
    "credit card payments": "https://www.techradar.com/best/best-credit-card-processing-service",
    "point of sale": "https://www.techradar.com/news/the-best-pos-system",
    "card reader": "https://www.techradar.com/best/best-mobile-card-payment-reader"
  }
}