{
  "source": "https://www.techradar.com/reviews/raise3d-e2",
  "title": "Raise3D E2 review",
  "category": "computing",
  "updated": "2020-05-22T09:30:08Z",
  "author": "ali-jennings",
  "summary": "The perfect 3D printer for education and small business",
  "verdict": "The Raise3D E2 is a reliable workhorse of a 3D printer with speed, quality and reliability at its heart.",
  "pros": [
    "Dual extruder",
    "Enclosed print environment with HEPA filter",
    "Innovative interface"
  ],
  "cons": [
    "Large and heavy",
    "Manual assistance for filament loading",
    "Careful placement of bed required"
  ],
  "article": [
    "In recent times desktop 3D printing has evolved, it's no longer the preserve of the home DIY enthusiast, but instead, printers can be found in almost every product design agency, workshop and school.",
    "Used for iterative design, prototyping, bespoke manufacturer and of course education, today it's easy to see the value of owning a 3D printer.",
    "When you take the step from enthusiast to professional use, the design and features of 3D printers have to adapt. Greater safety and networking need to be built in, and reliability and ease of use are essential.",
    "The Raise3D E2 is a culmination of desirable specifications and features packed within a stylish ready-to-go box. It's size, weight and price all show that this is a 3D printer designed for today's demands.",
    "Dual extruders, touchscreen interface, wifi, and Raise3Ds own powerful software ideaMaker make the Raise3D E2 an appealing solution for any classroom or workplace.",
    "Its size and weight mean that this is a big leap up from smaller desktop printers and it wouldn't look out of place next to traditional pillar drills and lathes. However, the finish and design are sleek and modern.",
    "The E2 is designed as a workhorse, building on the companies reputation for making reliable 3D printers and supplying features that will appeal to small to medium-sized business and education.",
    "The Raise3D E2 packs in features that have been tuned to those wanting a professional 3D printer that can sit and work alongside traditional workshop tooling.",
    "While I have seen many of these features before, here, Raise3D has looked at how those features are integrated into the workflow and ensured that they work for any level of user.",
    "IDEX (Independent Dual Extruders)",
    "First up is the dual extruder system which utilises two individual heads mounted on the same horizontal beam.",
    "The system is known as IDEX and enables the two heads to work independently or together. While the system is smart, essentially splitting the print bed in half, it will only allow you to mirror or duplicate a print rather than print two separate models at the same time.",
    "However, this will significantly speed up production if you have multiple prints of the same model to get through.",
    "As with other dual extrusion systems it can print with two filaments to create a dual colour or dual material model.",
    "Auto Bed Leveling",
    "An essential feature that is migrating across all decent 3D printers. The Raise3D E2 is all about reliability and accuracy and has two different levelling options.",
    "The standard 9 point which it checks before each print or a more in-depth 63 step leveling. This is one of the more advanced systems that I've seen and worked faultlessly.",
    "The BuildTak print platform provided a good base for the prints. This platform is magnetic and can be easily removed and flexed for easy model removal.",
    "When placing the platform back in the printer, you need to ensure that it is properly seated, as it's quite easy to misplace, causing a slightly raised edge which will cause printing issues.",
    "Industry First Video-Assisted Offset Calibration System",
    "3D printer calibration is usually something of an art, placing pieces of paper under nozzles, printing a variety of calibration charts and spot-checking against images in the manual.",
    "The Raise3D E2 runs you through the process and is one of the smoothest calibration processes of any printer I've used.",
    "A 3mm gauge is provided to check the Z-axis and charts are printed to check the X and Y, but it's the clear video instructions on the large full-colour LCD screen that makes it so easy to use.",
    "Safety Features",
    "Designed for use in education and the workplace, the E2 has several safety features:",
    "To reduce fumes from filaments such as ABS, there's a HEPA filter built into the back of the printer which will block anything harmful escaping.",
    "There's an auto-pause that kicks in if the doors are open, but this can be disabled if you're printing PLA which requires a cooler build area.",
    "As some models can take a long time to print all lights on the machine can be switched off to save power.",
    "There's also power loss recovery, which means if there is a power cut, then the printer can resume the print once power is restored. Checking this feature out and it worked well.",
    "Intuitive User Experience",
    "One area that stood out was the user interface and the ideaMaker software. Both are beautifully designed and intuitive in the most part to use.",
    "The on printer display is vast and detailed, and through the touch screen interface, you can quickly access all of the printers settings and options, including calibration. You can also print directly from a USB key, wired connection, network or wifi, which makes it ideal if several people are utilising the printer.",
    "The touch screen interface is fast and responsive and features step-by-step videos for many of the printers features. It also previews the models on the screen with a red overlay showing print progress.",
    "All print information before and during a print is easy to see, and this is by far the best interface of any 3D printer I've used.",
    "ideaMaker is Raise3D's slicing engine and printer management software, and like the printer, the interface is slick and fast to use.",
    "There are a few oddities that do take some getting used to.",
    "For instance, once the model has been positioned, and print quality settings have been selected; you can then slice the model. Once done, you have the option to upload to the printer, through wifi if connected. This is where the workflow isn't as straight forward as it should be.",
    "Once uploaded you then need to close the upload window, click connect and then select print local files and then select the model you want.",
    "It's a little convoluted, but once you know the way it works, it's okay but does feel like a bit more thought needs to be put into the workflow.",
    "The Raise3D E2 is almost ready to go directly from the box; two people are needed to unpack and move the printer due to the size and weight. Once in the position it's just a case of unbolting the retainers, switch on and follow the on-screen instructions. The entire process takes around 20 minutes for basic set-up and around an hour for all calibration.",
    "Once all packaging is removed, the on-screen instructions guide you through the entire process, from inserting the filament rollers to calibration.",
    "For all the technology and features, the filament loading feels a little backward with the Bowden tube to the extruder needing to be removed as the filament is fed through and pushed directly into the extruder. Once the gears lock on to the filament, the Bowden tube is then reinserted and secured.",
    "When the filament is in place, the calibration process is initiated. The first is the full bed levelling, and this takes around 10 minutes, then it's the X, Y and Z calibration, and that takes another 10-20 minutes."
  ],
  "headers": {
    "4": "Design",
    "7": "Features",
    "39": "Setup"
  },
  "links": {
    "3D printer": "https://www.techradar.com/best/best-3d-printers",
    "Raise3D E2": "https://www.raise3d.com/products/e2/"
  }
}