{
  "source": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/audio-technica-ath-sr5bt-1328458/review",
  "title": "Audio-Technica ATH-SR5BT review",
  "category": "audio-visual",
  "updated": "2020-02-10T11:13:26Z",
  "author": "lewis-leong",
  "summary": "The ATH-SR5BT make a compelling case for Hi-Res Audio",
  "verdict": "The Audio-Technica ATH-SR5BTs are a stellar-sounding pair of wireless headphones that sound even better wired. If you're looking for a well balanced pair of Bluetooth headphones that plays nicely with all types of music, they're a solid option.",
  "pros": [
    "Stellar battery life",
    "Balanced sound",
    "Wired mode sounds even better"
  ],
  "cons": [
    "Highs can be too energetic",
    "No noise cancellation"
  ],
  "article": [
    "Not so long ago, the mere mention of wireless headphones would make hi-fi nerds shudder - and with good reason. But as the technology has improved, premium wireless headphones are now more than a match for their wired counterparts.",
    "That Hi-Res Audio label you might see on your new pair of headphones means they meet certain criteria to be able to play higher than CD-quality music. This means a headphone must be able to decode and playback music that's 24 bit/96 kHz and above. (That's actually a cut above CDs, which are recorded at 16 bit/44.1 kHz.)",
    "The Audio-Technica ATH-SR5BTs are an impressive pair of wireless headphones with a frequency response of 5-40,000 Hz, meaning you'll hear every note with crystal clear clarity. They also last 38 hours on a single charge, which means you can go days, if not weeks, without charging them depending on your listening habits.",
    "We spent some time with the ATH-SR5BT and we can say that these headphones live up to their impressive specs. They offer a great design, balanced sound, and revealed details in the tracks we listened to that we didn't think was possible for a pair of headphones that cost $199 / £149 / AU$369.",
    "The design of the Audio-Technica ATH-SR5BT is understated with an all black finish and some silver accents, though there's a white-on-silver version as well if you're into the clean sci-fi look. The headphones feature metal earcups with soft leather earpads and headband that are the definition of comfortable. That said, they're an on-ear design, but they do a good job of passively blocking outside noise.",
    "On the head, the ATH-SR5BT are extremely comfortable, mostly due to their light weight. The earpads are made of soft memory foam and feel excellent, even after long listening sessions. There's very little clamping force, which is great for long listening sessions but they can be a little loose for users who want to exercise with them.",
    "All controls are located on the back of each earcup. The right earcup has a toggle switch for power while the left earcup features playback controls, the microUSB charging port and the 3.5mm jack for using in wired mode.",
    "Inside the earcups are 45mm drivers that are capable of an incredible frequency response of 5-40,000 Hz. The headphones have a 45 ohm impedance, which means you won't need an amp to properly drive them.",
    "Included in the box are a microUSB charging cable, a 3.9 ft (1.2 m) wired headphone cable and a soft carrying case. The wired headphone cable comes with a microphone and a single-button remote for controlling playback and answering calls.",
    "Pairing the ATH-SR5BTs with our OnePlus 3 couldn't have been easier with the inclusion of NFC – one tap on the back of your NFC-enabled phone to the left headband quickly pairs the headphones with your device.",
    "While Audio-Technica brags that these headphones can remember up to eight devices, you'll have to disconnect and connect to devices in your Bluetooth settings as they can't connect to multiple device simultaneously. There are headphones that do support multiple devices at once, like the Plantronics Backbeat Pro, and it'd be great to see Audio-Technica include this feature in the future, as it's a pain to hunt around in the settings to switch devices.",
    "There's support for aptX and AAC codecs, which means wireless audio via Bluetooth 4.1 will sound great with either Android smartphones or iPhones. Note that using the headphones in Bluetooth mode will only give you frequency response of 20-20,000 Hz while using them in wired mode will get you the full 5-40,000 Hz required for Hi-Res Audio.",
    "Controlling playback with the earcup controls is relatively simple, but will take some getting used to since it's both a toggle and button. Toggling up and down will change the volume, but you can hold up to skip forward and hold down to skip back. Pressing on the toggle will play/pause music or answer/reject a call.",
    "Speaking of phone calls, friends and family reported clear sounding audio on their end during our conversations, and noted that it sounded much better than using the built-in mic on our OnePlus 3.",
    "Enough about features. How do the ATH-SR5BTs sound? In short, phenomenal. Sound is well-balanced across the entire frequency range, though there is a slight treble and mid-bass boost. This means highs can sound a little bit fatiguing for those who are treble sensitive, and we found them to be right on the edge of being too energetic.",
    "All of that high frequency energy means the ATH-SR5BT have great resolution for well recorded music. You'll hear musicians breathe or tap their feet, something other wireless headphones can't reproduce. Soundstage is well rendered – but could stand to be a bit wider.",
    "Bass is taut with good impact but low-end enthusiasts will likely want headphones that can dig deeper. Bassheads should check out the Marshall Major II Bluetooth to satisfy the urge for EDM and rap, but expect muddier bass and far less resolution.",
    "While most people will use the ATH-SR5BT in wireless mode most of the time, it's worth plugging them in just to experience what Hi-Res Audio is capable of. We plugged in the headphones with the included cable and was blown away by how much better everything sounded; bass had more impact, especially when used with an amp like my Fiio E18 and WooAudio 3. We were addicted to wired mode for days.",
    "Audio-Technica's claims of 38 hours of playback are spot on. We struggled to drain the battery within the week I spent with the headphone. They have some serious stamina. They take quite a bit of time (around five hours) to charge to full from dead, however, so you'll want to leave them on the charger overnight.",
    "The Audio-Technica ATH-SR5BT feature some of the best wired and wireless sound quality for headphones under $200 / £150. They play well with all music genres and offer a near-flat response curve. They're extremely comfortable for long listening sessions and are well-built. Battery life is equally impressive with nearly 40 hours of playback from a charge.",
    "While the ATH-SR5BT do a good job of isolating outside noise, it would have been nice to have active noise-cancelling, though it's an understandable omission at this price point. Some listeners may find the headphones a little bright and fatiguing. Lastly, it would have been nice if the headphones could pair to multiple devices simultaneously.",
    "The Audio-Technica ATH-SR5BT strike an amazing balance between portability and serious listening. Sound over Bluetooth is great for commuting or when you're less interested in absolute fidelity. Then, once you've safely arrived back home or find yourself in a quiet environment, it's super easy to switch to wired mode to get Hi-Res Audio sound.",
    "At their $199 / £149 / AU$369)price point, the ATH-SR5BT offer great value for audiophiles who want the convenience of going wireless. Sure, they lack the features of more expensive wireless headphones like active noise cancelling and multi-device pairing, but these are tradeoffs worth making for phenomenal sound."
  ],
  "headers": {
    "4": "Design",
    "9": "Features",
    "14": "Performance",
    "19": "We liked",
    "20": "We disliked",
    "21": "Final verdict"
  },
  "links": {
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "OnePlus 3": "https://www.techradar.com/reviews/phones/mobile-phones/oneplus-3-1323353/review",
    "Plantronics Backbeat Pro": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/plantronics-backbeat-pro-1272486/review",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "iPhones": "https://www.techradar.com/news/best-iphone",
    "Marshall Major II Bluetooth": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/marshall-major-ii-bluetooth-1324909/review"
  }
}