{
  "source": "https://www.techradar.com/reviews/vizio-p-series-quantum-x-px65-g1",
  "title": "Vizio P-Series Quantum X (PX65-G1) review",
  "category": "televisions",
  "updated": "2020-01-22T03:59:13Z",
  "author": "christian-de-looper",
  "summary": "Big, beautiful, and jam-packed with features",
  "verdict": "The Vizio P-Series Quantum X may not offer a great sound-quality, and the SmartCast interface needs a bit of work, but it still delivers arguably the best image quality in its price range, plus a host of smart features.",
  "pros": [
    "Excellent image",
    "Super bright",
    "Nice smart features",
    "Well-designed remote"
  ],
  "cons": [
    "Lackluster sound",
    "SmartCast interface"
  ],
  "article": [
    "Everyone knows that great TVs are getting cheaper and, at this point, we would argue that a large portion of new TV buyers don’t really need to spend much more than $500 or $600 on a good screen thanks to models like the new Hisense H8F or TCL 6-Series which offer incredible value for money.",
    "Those TVs are great for the price, but what if you want something better. What if you want features like better local dimming and higher contrast? What then?",
    "That’s the segment of the market that Vizio is making a play for with the new Vizio P-Series Quantum X, which includes 65-inch and 75-inch models, and is jam-packed with features for smart home users. Here's what we thought of it.",
    "[Update: Vizio has just debuted the 2020 version of the P-Series Quantum X at CES 2020. The updated series will include a new 85-inch screen size with 792(!) local dimming zones and comes stocked with SmartCast 4.0. Vizio has not announced pricing or a release date for the 2020 P-Series Quantum X, however, so for now the PX65-G1 is still the most recent model.]",
    "In case you've never had one, 65 inches is a whole lot of TV, and you’ll definitely want to make sure that you have a TV stand or entertainment center big enough to even support it in the first place. The legs themselves sit a little over 50 inches apart, which is almost the width of the whole TV - so at the bare minimum we recommend only buying this TV if you have a space to put it.",
    "That said, the Vizio P-Series Quantum X 65 is a beautifully designed TV. It’s much thinner than you might expect, coming in at around 2 inches at its thickest, which is surprisingly thin for an LCD TV in the first place.",
    "The TV also has stunningly thin bezels, with sleek metallic legs, and it should look right at home in any living room that’s big enough. Ins and outs are found on the right side, with some being right-facing and some bottom-facing. You’ll get a total of a hefty five HDMI ports, an optical port, an Ethernet port, and a USB port for powering your streaming devices. There are also analog audio out ports.",
    "The remote is well-designed, and simple, too. It offers basic channel controls at the bottom, along with standard volume controls. Above that, you’ll get a direction pad, and software buttons - including six app access buttons for apps like Netflix, Amazon Prime Video, and Vudu. The big thing missing from the remote is a microphone - so you'll have to use an external smart speaker if you want voice controls.",
    "The Vizio P-Series Quantum X is a smart TV, but that goes beyond simply offering a smart platform for streaming: This is one of the first TVs out there to offer Apple AirPlay 2 functionality, opening it up to the entire Apple ecosystem. That's a game-changer if you're an iPhone user.",
    "We'll cover the Apple features in more detail below, but the Quantum X also has direct access to Netflix, Amazon Prime Video, Hulu, and more, all from the home screen. While the overall selection of apps isn’t massive, and there’s no real app marketplace to get more, but most of the big ones are there, plus you can cast with Vizio’s SmartCast platform, which is handy.",
    "One notable exception to Vizio's app lineup is YouTube - so if you watch a lot of YouTube you’ll be stuck casting or using another streaming device.",
    "On the flip side, if you're a cord-cutter, perhaps most notable app here is the Vizio WatchFree app, which is essentially a re-purposing of Pluto TVs streaming channels with a few Vizio-exclusive channels thrown in. With WatchFree, you’ll get access to a pretty huge range of live TV channels, which is pretty impressive, and WatchFree also has its own dedicated input on the TV, so you don’t necessarily need to navigate through the smart interface to get to it.",
    "One of the headline features of the Vizio P-Series is the fact that Apple users can stream content to the TVs through AirPlay 2 and see the TV in HomeKit, which, in-turn, will enable Siri support. Unfortunately, it’s a feature that wasn’t yet ready in time for this review, however both of the features will be arriving in the summer.",
    "One of the things we found that the Vizio P-Series Quantum X did excellently is HDMI switching. It seems like a small issue, but the TV quickly and easily switched automatically to the right input as needed, and we found that we only really had to scroll through inputs when we wanted to switch to the TV’s built-in inputs, rather than because it had picked the wrong HDMI source.",
    "Overall, the Vizio P-Series Quantum X 65 offers some nice smart features, and for those that don’t have another streaming device that they like, the features on offer here should do the job just fine.",
    "All things considered, the TV is pretty great at handling HD and standard dynamic range content too. Thankfully, there’s now a wide range of 4K and HDR content available at a moment’s notice, but even if there wasn’t this TV makes watching SD content significantly more enjoyable than it would be on a 1080p TV. Most of this is thanks to the high brightness and 384 dimming zones.",
    "Even better, you have complete control over judder and motion blur, rather than any presets - so you’ll want to experiment with the settings a little yourself. It’s all driven by Vizio’s Clear Action 960, and we found that generally speaking worked pretty well. Thanks to the tech, you’ll also get a 240Hz effective refresh rate, and it makes for clear and precise action scenes. That’s not to say there’s no motion blur whatsoever, but it’s no distracting by any means - and isn’t noticeable to the untrained eye.",
    "Nothing’s perfect, unfortunately. In some darker HD/SDR scenes you will get some graininess, which is only amplified by such a large screen.",
    "Of course, the main event is the TV’s 4K HDR performance - and it’s beautiful. As the name suggests, the TV leverages a technology called quantum dots. We’re not going to get into the nitty-gritty of what the tech actually is - you can read our guide here for that - but the gist of things is that you’ll get brighter colors and deeper blacks than you would on a standard LED TV. Sure, it’s not quite on the same level as an OLED TV, but as we found during testing, it comes pretty damn close.",
    "The Vizio P-Series Quantum X delivers a super-bright viewing experience, with brilliantly vivid colors and deep, dark black levels. The brightness really is taken to the next level here - Vizio claims the TV outputs up to 3000 nits of peak brightness, which is absolutely huge. The TV effortlessly breathes life into the already-beautiful One Planet (Dolby Vision) on Netflix, while on movies like Thor: Ragnarok, you’ll get immersive action sequences and deep-black space scenes.",
    "Spec-wise, the TV has a lot going for it. Part of the reason the TV is able to deliver such good contrast is that it boasts a whopping 384 local dimming zones, with that number growing up 480 zones on the larger 75-inch TV. That seriously helps ensure that the blacks are truly black. But local dimming alone isn’t what makes the TV so colorful. It’s also pretty precise. While we did find some color-bleed with ultra-bright content on a dark background, in general it wasn’t too bad, and not something you’ll be distracted by in day-to-day viewing.",
    "There are a number of viewing modes to enjoy too: There’s Vivid, Game, Computer, Standard, and Calibrated, all of which can be tweaked to your liking.",
    "Vivid is the default viewing mode out of the box, and while it works in some settings it’s a little over the top. We personally liked Standard, though some will find that the Calibrated Dark mode is better for your living room. The takeaway? Experiment. Your needs will vary depending on your environment and personal tests.",
    "If you’re spending this much on a TV, it’s worth shelling out at least a few hundred for a decent soundbar or pair of speakers too. That said, if you do want to stick with the speakers in the TV, you won’t get a terrible experience - but you won’t get a great one either.",
    "In general, the bass is lacking on TV speakers, and the Vizio P-Series Quantum X is no exception to that rule. Bass extension is almost non-existent, with a much heavier emphasis on the mid-range. The high-end is fine, but again, there’s not much in the way of extension, and as such there isn’t a ton of clarity or detail.",
    "The Vizio P-Series Quantum X 65 is a home run for Vizio. Sure, the SmartCast interface isn’t all the great, and the speakers are worth bypassing, but the TV is packed with awesome features and backed up by an excellent image quality. We’re looking forward to AirPlay 2 and HomeKit support, but even without those features the TV is still one of the best options in its price range.",
    "If you truly have deep pockets and want the best image quality out there, then it’s still worth going for an OLED TV - but in the absence of a six-figure salary, the $2,199 Vizio P-Series Quantum X PX-65G1 is clearly an excellent option for those that want quantum dot tech in a smart TV at Vizio-level prices."
  ],
  "headers": {
    "4": "Design",
    "8": "Smart TV (SmartCast 3.0)",
    "15": "HD/SDR Performance",
    "18": "4K/HDR Performance",
    "23": "Sound",
    "25": "Final Verdict"
  },
  "links": {
    "Hisense H8F": "https://www.techradar.com/reviews/hisense-h8f-55h8f-4k-hdr-tv",
    "TCL 6-Series": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "2020 version of the P-Series Quantum X": "https://www.techradar.com/news/vizio-is-introducing-its-first-oled-tv-at-ces-2020",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "read our guide here for that": "https://www.techradar.com/news/oled-vs-qled"
  }
}