{
  "source": "https://www.techradar.com/reviews/ninja-foodi-max-health-grill-and-air-fryer-ag551uk",
  "title": "Ninja Foodi MAX Health Grill & Air Fryer (AG551UK) review",
  "category": "appliances",
  "updated": "2020-11-24T09:14:52Z",
  "author": "emily-peck",
  "summary": "Create healthy air-fried dishes and authentic chargrilled recipes with ease",
  "verdict": "If you love the taste of fried food and are keen to experiment in the kitchen with a range of sweet and savory dishes, the Ninja Foodi MAX Health Grill & Air Fryer AG551UK is worth considering. And you can enjoy them (almost) guilt-free as, since foods can be made with up to 75% less fat than classic cooking methods, with little to no oil at all. The AG551UK is unique in its offering in that it also features a health grill that you can use to create al-fresco style chargrilled foods, without having to faff around with actual charcoal. In short, it’s a great buy if you’re looking for a compact cooking appliance to accompany your standard oven and hob setup. Note that you’ll need ample space on your worktop to house it, though.",
  "pros": [
    "Dual function",
    "Great for chargrilled and air-fried foods",
    "Fast and compact design"
  ],
  "cons": [
    "Bulky",
    "Best set on spacious worktops",
    "The grill doesn’t close like a regular sandwich grill"
  ],
  "article": [
    "Want to create chargrilled foods without having to light the barbecue? Or perhaps you love nothing more than a fry-up breakfast to start the day? Either way, the Ninja Foodi MAX Health Grill & Air Fryer AG551UK will help you do that and more. Capable of producing both healthy grilled and fried foods using little to no oil, the AG551UK can also bake, roast, dehydrate and reheat foods. You may even surprise yourself with just how adventurous a cook you can become with such a nifty appliance, serving up dishes such as Cajun grilled chicken and pepper kebabs in just 10 minutes, or a beef wellington in under 20, for example.",
    "A time-saving countertop appliance, the AG551UK makes preparing meals simple and fast, offering up tech that takes the guesswork out of cooking. Simply pop in your food, press the function you desire – be it bake, air-fry, grill and so on – and the device will suggest the ideal cooking time at the touch of a button. For added convenience, the grill plate, crisper basket, cooking pot and splatter guard are all dishwasher-safe.",
    "Continuing to grow its collection of countertop appliances, Ninja is fast-becoming a household name. The Foodi MAX Health Grill & Air Fryer AG551UK joins Ninja’s large portfolio of handy and high-tech kitchen appliances, which includes a range of blenders, multi-cookers, food processors, air fryers and grills.",
    "The Ninja Foodi MAX Health Grill & Air Fryer AG551UK is the latest addition to the company’s air fryer collection, and unlike the Ninja Foodi Dual Zone Air Fryer AF300UK, which is also new, the former can be used as an air fryer and a health grill. You’ll currently find the Ninja Foodi MAX Health Grill & Air Fryer AG551UK available on the Ninja website and at John Lewis priced at £179.99 (around $240 / AU$325).",
    "The AG551UK is the latest appliance to join Ninja’s collection of combi air fryers and grills, which also includes two previous models – the Ninja Foodi Health Grill & Air Fryer AG301UK and the Ninja Foodi Health Grill & Air Fryer AG301UKDB. Unlike the two existing models, however, the AG551UK sports a more contemporary and streamlined style, with its control panel discreetly hidden on a touch-screen display along the bottom edge of the appliance.",
    "The Foodi MAX Health Grill & Air Fryer is relatively wide at 35.6cm and 45cm deep, so you’ll need ample space to store it. At 8.1kg, it’s also quite heavy, so it isn’t the kind of appliance you’ll be wanting to put in and take out of a kitchen cupboard every time you want to use it. Much like a countertop microwave, it’s likely to become a permanent fixture on your worktop.",
    "In the box you get a digital cooking probe, which is useful when you’re trying to cook meat to varying specifications – be it rare, medium rare or well done, for example. A handy ‘how to place the probe’ quick start guide means you’ll be able to get cooking straight away. This probe plugs into the side of the appliance and can be neatly stored to the side of the machine when it isn’t in use.",
    "This model also includes a grill plate, which is great for cooking a fry-up in under 12 minutes. There’s also a crisper basket and cooking pot, both of which offer flexible use for air frying, baking, roasting, reheating and dehydrating. A baking sheet isn’t included, so you can use your own, but the cooking pot worked just fine with the foods we cooked in the appliance.",
    "Since the Ninja’s body is smooth, lacking any knobs with fiddly nooks, the appliance proved easy to keep clean. The splatter guard that takes the brunt of the grilling mess can be easily removed and washed either by hand or in the dishwasher.",
    "Any decent air fryer should cope with producing a portion of crispy on the outside, soft in the middle chips – so we made this our first task with the Ninja. You can cook frozen fries in the AG551UK, but we attempted to make them from scratch, chopping potatoes and sprayed them with a little oil. The air fryer requires preheating, which takes a few minutes, so it’s best to choose your desired setting on the digital display before you begin your prep; the machine will beep when it’s ready for the ingredients to be placed inside.",
    "While the AG551UK comes with a number of preset programs, in our experience we found the suggested 20 minutes at 200 degrees on the Air Fry setting to be a little too long and high temperature for chips – they came out darker and crispier than we’d like. However, it’s easy to alter the temperature and timings using the manual mode, so be aware that there will be some trial and error involved as you try to get the best results. We also recommend that you cast an eye over your chips midway through cooking, giving them a little shake, so you can ensure the end results aren’t overcooked.",
    "We also used the Ninja Foodi MAX Health Grill & Air Fryer AG551UK to bake bread and cookies using dough prepared in the Ninja 3-in-1 Food Processor with Auto-iQ [LINK]. We opted for the ‘Bake’ setting at 180 degrees for 15 minutes. At the end of this time, the resulting bread was well cooked but pretty pale in color. Nor was its texture as spongy as you’d expect, but it did taste good. The cookies were nicely baked, although we did use the manual override to set the cooking time to 8 minutes and the temperature to 180 degrees to ensure they weren’t overcooked.",
    "Cooking a lamb steak was next on the list. Inserting the meat probe was simple enough, after which we manually adjusted the settings from high to low and selected the cooking time and chosen protein. Opting for medium rare, we achieved satisfying results with the preset. To ensure minimal smoke when grilling, it’s recommended that you clean the splatter guard after every use."
  ],
  "headers": {
    "2": "Ninja Foodi MAX Health Grill & Air Fryer AG551UK price and availability",
    "4": "Design and functionality",
    "9": "Performance and ease of use",
    "13": "Don't buy it if..."
  },
  "links": {
    "Ninja website": "https://www.awin1.com/awclick.php?awinmid=8059&awinaffid=103504&clickref=trd-us-1346001442958742300&p=https%3A%2F%2Fninjakitchen.co.uk%2Fproduct%2Fninja-foodi-max-health-grill-air-fryer-ag551uk-zidAG551UK",
    "John Lewis": "https://john-lewis-and-partners.pxf.io/c/221109/871855/12148?subId1=trd-us-5158704091117285000&sharedId=trd-us&u=https%3A%2F%2Fwww.johnlewis.com%2Fninja-foodi-max-health-grill-air-fryer%2Fp5136707%3Fsku%3D239004004%26s_ppc%3D2dx92700057854781731%26tmad%3Dc%26tmcampid%3D2%26gclid%3DCj0KCQiAy579BRCPARIsAB6QoIaks3ixuxeGYHfRBVOPVMZWxxwmt2iMm80p-G5KgPM2cVRSfQZ67cIaAjzaEALw_wcB%26gclsrc%3Daw.ds"
  }
}