{
  "source": "https://www.techradar.com/reviews/minecraft-dungeons",
  "title": "Minecraft Dungeons review",
  "category": "gaming",
  "updated": "2020-05-22T07:01:28Z",
  "author": "stacey-henley",
  "summary": "It’s hip to be cube",
  "verdict": "Minecraft Dungeons is a neat little dungeon crawler which Minecraft fans will love, though dungeon-crawler fans shouldn’t get too excited. The exploration is fun, the tone feels just right, and it’s your typical ‘short but sweet’ fare. Combat can get a little repetitive and the game’s variety blurs into chaos by the end, but we enjoyed the ride.",
  "pros": [
    "Varied settings",
    "Enjoyable exploration",
    "Co-op adds depth"
  ],
  "cons": [
    "Too repetitive",
    "Bare bones combat",
    "Runs out of steam",
    "Very short"
  ],
  "article": [
    "Minecraft Dungeons feels like a day at Legoland, and not just because of the blocky aesthetic. It feels like a day at Legoland because it starts off as great fun and looks like a world of endless possibilities, but you quickly realize that it’s pretty much the same thing repeated over and over again. After a couple of levels, it just doesn’t seem to do anything with its ideas, and while it will definitely please Minecraft fans, it’s doomed to be a fairly decent spin off rather than a credible next step for the franchise.",
    "The game casts you as a silent hero, flat in every way bar your blocky dimensions, as you make your way through various dungeons to defeat the evil Illager and the minions he has summoned. With a modest array of melee, ranged and magical weapons at your disposal, you must fight through swarms of enemies while exploring the twisting dungeons. Some of these dungeons are actual caves/mines etc, but there’s also snowy tundras, murky swamps and scorching deserts. The basic task, however, is the same: get to the end of the level.",
    "On a surface level, there is a lot of variety to be had. The nine levels are clearly distinct from each other, and the enemies increase in both intensity and creativity as the game goes on. Early game baddies will just run up to you and try and punch you, while later you face archers, golems, wizards and arena traps, forcing you to change your strategy from basic hack-and-slash button mashing to a more tactical approach, involving healing, ranged weaponry and artefact bonuses.",
    "Even here, we found a couple of niggles. You can’t upgrade your weapons, meaning you may lose attacks as you get stronger and outgrow them, and you can’t use ranged weapons at all while holding a projectile. With how chaotic the battles can get, these little issues can really drag you down.",
    "Plus, if you look a little closer, you’ll notice the levels are essentially the same thing, just wearing different clothing. You can get most of the weapons early on, they just have better stats further in. And while the enemies do show some growth - later enemies can cast spells that block your escape - the game itself doesn’t. It’s a bit like that scene in Inception when Tom Hardy tells Joseph Gordon-Levitt “you mustn’t be afraid to dream a little bigger, darling,” and then it turns out his bigger dream is… a slightly more powerful gun. The game just throws more enemies at you in one go and calls it progression; this is even more apparent when you play on a higher difficulty.",
    "On that note, the game features a sliding difficulty scale, where it suggests a default level based on your current power, then offers you difficulties slightly above or below. As you get further through the game however, the easiest difficulties become locked out, forcing you to play against tougher enemies. We played on whatever the game suggested throughout, but it’s worth pointing out that for a game built on fun, it won’t let you take things too easy.",
    "Co-op is especially useful when the going gets tough, and the game can be played in local or online, though as of right now, not both. Cross platform has been promised by Microsoft for launch, but was not available when we wrote this review.",
    "Each level ends in a ridiculously similar way too. You either fight a big boss, fight a big wave swarm, or occasionally, fight both together. That’s a standard convention of the dungeon-crawler genre, but Minecraft Dungeons’ issue is that even inside just nine levels, it reuses bosses.",
    "Redstone Golem is overused in the final stretch, the waves have mostly the same tactics and aside from a few bosses who think outside of the box, winning very similar battles over and over again feels less like an accomplishment and more like a chore. Nobody enjoys grinding at the best of times, so it’s some feat for Minecraft Dungeons to make you feel like you’re grinding the first time around.",
    "It isn’t the best dungeon crawler out there, but it’s undeniably a Minecraft game, and for some players, that’s going to be the make or break factor. Though we only get light characterization and brief narration, it brilliantly captures the essence of Minecraft. The exploration feels authentic, the tone is pitch perfect and it’s crammed with references and classic Minecraft staples.",
    "One of these is Enderman, a riff on Slenderman who will attack you in Minecraft if you look directly at him. He’s back as a sporadic boss who pops up throughout most of the levels at the mid way point. He screeches, the screen blurs and he teleports around you, the game fully committed to selling his aesthetic. He pops up far too frequently for non-fans to put up with, but it highlights the fact that while the game is a little rough around the edges, it’s certainly been made with love.",
    "The problems can be boiled down to this being a short game that goes on too long. That’s not to say that it should be shorter - you’re looking at four to five hours to beat it, probably less in co-op - but that the structure of the game feels flawed.",
    "The later game has some impressive platforming, where you must dodge rotating blades, slamming doors and hop on springboards, and leaning into this a bit more might have been more successful. Rather than one winding desert level which feels only marginally distinct from the swamp level, having two or three much shorter desert levels might have felt fresher. There are a few side caves you can discover by finding maps in the main levels, and playing through these always felt refreshing and new, even as the main quests ran out of steam.",
    "Minecraft Dungeons is a solid game, although disappointingly for a franchise built on creativity, there’s not too much variety to be found, especially towards the end. Even as the levels keep their inventiveness, the enemies all start to blur into one.",
    "There’s fun to be had here, and at a five hour run time, it’s never going to drag too much. With friends, Minecraft Dungeons has enough to offer for you to overlook the repetition and the cracks which have been papered over. At the end of the day, it’s a Minecraft dungeon crawler. If you’re buying it for the first part, go nuts. If you’re buying it for the second, maybe wait for the sale."
  ],
  "headers": {
    "2": "Lather, rinse, repeat",
    "9": "It's definitely Minecraft",
    "13": "Verdict"
  },
  "links": {}
}