{
  "source": "https://www.techradar.com/reviews/oppo-find-x2-review",
  "title": "Oppo Find X2 review",
  "category": "phones",
  "updated": "2020-08-13T13:37:19Z",
  "author": "basil-kronfli",
  "summary": "A refined take on the OnePlus 8 Pro formula",
  "verdict": "The Oppo Find X2 is a premium phone with a flagship screen and plenty of power, storage, and RAM. It doesn’t pack the mightiest camera around, and there’s no wireless charging either, but the inclusion of incredibly nippy 65W fast charging and all-day battery makes it a fine alternative to the identically-priced OnePlus 8 Pro.",
  "pros": [
    "Best-in-class screen",
    "Charges in as little as 38 minutes",
    "Premium glass and metal design"
  ],
  "cons": [
    "No wireless charging",
    "Limited optical zoom",
    "Good, not class-leading camera"
  ],
  "article": [
    "The Oppo Find X2 packs the same screen specs and ports as the OnePlus 8 Pro, though the design switches out a matte finish for a high-gloss glass back.",
    "There's very little to dislike about the Find X2's look and feel other than the fact that its reflective back clings onto fingerprints, but it's hardly unique on that front. The phone also ships with a pre-fitted screen protector, and a soft plastic case in the box, saving you having to buy either.",
    "The best thing about the Oppo Find X2 is probably its screen. Measuring 6.7-inches, with a 1440 x 3168 resolution and packing AMOLED screen tech, it’s among the best you can get for the price. DCI-P3 and HDR10+ credentials also join forces with a 120Hz refresh rate and 800-nit brightness to hit the point home - this is a seriously good screen.",
    "Thanks to its 48MP main camera, optical image stabilization, phase detection, and laser autofocus, not to mention a wide-open f/1.7 lens, the Find X2 is also a very good camera phone - but it isn’t best-in-class.",
    "With a 13MP 2x optical zoom 52mm telephoto camera, and a 12MP ultra-wide, the Oppo Find X2 loses out from a resolution and/or zoom power footing compared to much of the competition. Those caveats aside, all three cameras can take good-looking photos in well-lit conditions, and even in middling light.",
    "With a Snapdragon 865 chipset, it’s little wonder the Oppo Find X2 flies, whether day-to-day UI swiping or 3D gaming. With benchmarks putting it roughly on par with the Samsung Galaxy S20 Ultra. It also keeps its cool, climbing up to around 38°C when wrapping up a 65W charge - a perfectly respectable temperature.",
    "The Find X2’s 12GB of RAM combined with 256GB of storage as standard puts it at the top of the pile on both storage and multi-tasking fronts for a £799 (roughly $1,045 / AU$1,465) phone, and when combined with that high refresh-rate, 120Hz screen, it feels as powerful as it is in day-to-day use.",
    "While there’s no microSD card slot, we doubt you’ll be left wanting, given the 256GB of internal storage as standard. That said, the lack of a headphone jack might turn some wired audio fans cold.",
    "Despite the Oppo Find X2's high refresh rate and big, bright screen, with its 4,200mAh battery it packs enough capacity to last a full day comfortably.",
    "Also impressive is how quickly the Find X2 charges. 65W charging speeds deliver best-in-class wired charging times - zero to 100% in just 38 minutes when you use the high-speed charger the phone ships with.",
    "The Find X2 doesn't support wireless charging though - so despite its class-leading wired speeds, the phone isn't without compromise.",
    "Despite the fact that it was announced in March 2020, the Find X2 and Oppo Find X2 Pro only started hitting shelves in the summer of the same year.",
    "You can’t buy Oppo phones in the US, but you can pick up most of the X2-series in the UK and Australia - including the excellent X2 Pro, X2 Neo, and X2 Lite. That said, the X2 itself is only available in the UK at the time of writing this review, and it will set you back a cool £799 (roughly $1,045 / AU$1,465).",
    "As it stands, while you might struggle to find the Oppo Find X2 SIM-free, it can be picked up on O2 with an upfront fee of £30 and a monthly cost of around £40 per month.",
    "The Oppo Find X2 is a more classic take on the OnePlus 8 Pro when it comes to styling. While it packs the same screen specs and ports, it sheds some of the OnePlus's girth in favor of a more svelte body, with dimensions clocking in at 164.9 x 74.5 x 8mm.",
    "The X2 is a big phone given its screen size, but there's no denying that it's also incredibly elegant, as is the entire Find X2-series - more so than the OnePlus 8 and 8 Pro.",
    "On the front is Gorilla Glass 6, while around the back, Gorilla Glass 5, with both sides curved to create a comfortable in-hand feel, and a tiny-bezel look.",
    "The phone's volume buttons are on the left side, and the power button on the right - all easy to feel when blindly dragging a finger across either side.",
    "However, there's no headphone jack in sight - on the bottom side of the Find X2 there's a USB-C port and a SIM slot, whilst up top there are no ports.",
    "There's very little to dislike about the Oppo Find X2's look and feel. Yes, its reflective back clings onto fingerprints, but it's hardly unique on that front. Additionally, the phone ships with a pre-fitted screen protector, and a soft plastic case in the box, which is a great value-add.",
    "The best things about the Oppo Find X2 Pro are its screen, design, fast charging, and camera. The vanilla Find X2 benefits from the first three, making its 6.7-inch 1440 x 3168 pixel AMOLED screen amongst the best you can get for the price.",
    "The X2 packs the same color profile as the X2 Pro, which means DCI-P3 and HDR10+ credentials, as well as eye-care with an implementation that’s significantly more noticeable than on other phones.",
    "The screens of these two Oppo phones are markedly warmer than most other phones by default, with more noticeable blue light filtering than the competition. The AMOLED’s brightness climbs up to 800 nits and gets very dim for comfortable low-light viewing.",
    "A 120Hz refresh rate puts the Oppo Find X2 at the top of the pack when it comes to screen smoothness, significantly bettering pricier phones like the iPhone 11 Pro and Sony Xperia 1 II. Within the settings, you can switch between refresh rates of 120Hz, 60Hz, or Auto. What’s smart about Auto is that it switches between 60Hz, 90Hz and 120Hz, depending on what the app or interface element is optimized to run at.",
    "Even more eye-saving tools buried in the display settings really hit the point home - Oppo's Find X2 is a seriously considered phone, with anti-flicker and multiple ways to control the color temperature.",
    "It’s also one of the few devices with a monochrome option that couples with a blue-light filter for a noticeably warm black and white mode that keeps eye-strain at bay.",
    "While on paper you might be mistaken for thinking that the main cameras of the Oppo Find X2, the Find X2 Pro, and the OnePlus 8 Pro, are identical, with their 48MP sensors, they aren’t.",
    "The other phones pack Sony’s latest IMX 689 sensor with its bigger pixel size and 2020 performance, while the vanilla Find X2 packs the IMX 586, the same base sensor as found on some budget phones, including the Redmi Note 9 and the Samsung Galaxy A51.",
    "That isn’t to say the Oppo Find X2 has budget-phone camera performance. Thanks to the inclusion of optical image stabilization, phase detection, and laser autofocus, not to mention a wide-open f/1.7 lens, the X2 is a very good camera phone - but it isn’t best-in-class.",
    "Additionally, the primary camera is matched with a 13MP, 52mm telephoto camera with 2x optical zoom, and a 12MP ultra-wide, which, on paper, lose out from a resolution and zoom power footing when compared to much of the competition.",
    "All those caveats aside, all three cameras can take good-looking photos in well-lit conditions, and even middling light, with impressive dynamic range outdoors, rich colors, and high-detail when it manages to lock-on to subjects.",
    "The Find X2 does tend to overexpose and can fail on focus, with artificial background defocus missing the mark - even in auto mode. This extends to portrait mode, which can be clumsy for non-human subjects and in dimly-lit conditions.",
    "Where the Oppo Find X2 does excel is in pinchable detail. Provided it focuses correctly, photos are sharp and look rich, and can be cropped with confidence. This is especially true across the primary and telephoto cameras, while the ultra-wide is a touch softer, offering less scope for post-capture crops.",
    "Low light photos across the main camera and telephoto camera look pretty good. The automatic mode captures usable photos with curtailed noise in most scenes, but when the lights drop way down, the night mode takes it from there and works across all three of the phone’s cameras. Again, the weakest performer is the ultra-wide camera, with much more visible image noise, especially around the edges.",
    "Video shot on the Find X2 looks very good, and is captured at up to 4K 60fps resolution, with both optical image stabilization and electronic image stabilization keeping everything shake-free even at the highest quality.",
    "Naturally, noise creeps in for video when the lights go down, and the phone’s zoom can’t compete with the likes of the Find X2 Pro and Huawei P40 Pro Plus for video, but it still manages to hold its own at its price.",
    "With a Snapdragon 865 chipset, it’s little wonder the OPPO Find X2 flies, whether day-to-day UI swiping or 3D gaming. With benchmarks putting it roughly on par with the Samsung Galaxy S20 Ultra, scoring a Geekbench multi-core rating of 3261.",
    "It also keeps its cool, climbing up to around 38°C when wrapping up a 65W charge - a perfectly respectable temperature.",
    "The 12GB of RAM combined with 256GB of storage as standard puts it at the top of the pile on both storage and multi-tasking fronts for a £799 (around $1,045 / AU$1,465) phone, and when combined with that high refresh rate, 120Hz screen, it feels as powerful as it is in day-to-day use.",
    "While there’s no microSD card slot, we doubt you’ll be left wanting given the 256GB of internal storage. That said, the lack of a headphone jack might turn some wired audio fans cold.",
    "Despite the OPPO Find X2's high refresh rate and big, bright screen, with its 4,200mAh battery it packs enough capacity to last a full day comfortably.",
    "A Full HD 90-minute video (60fps) only took the Find X2's battery down by 8%, which compares very well to the flagship competition. Day-to-day use when photo taking, Spotify listening, YouTube watching, and WhatsApp messaging left us with about 30 percent battery at the end of the day.",
    "Also impressive is how quickly the Find X2 charges. 65W charging speeds deliver best-in-class wired charging times - zero to 100% in just 38 minutes when you use the high-speed charger the phone ships with.",
    "The Oppo Find X2 doesn't support wireless charging though - so despite its class-leading wired speeds, the phone isn't without compromise.",
    "First reviewed: August 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Oppo Find X2 price and release date",
    "14": "Design",
    "20": "Display",
    "26": "Camera",
    "36": "Specs and performance",
    "40": "Battery life",
    "44": "Don't buy it if..."
  },
  "links": {
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Oppo Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Samsung Galaxy A51": "https://www.techradar.com/reviews/samsung-galaxy-a51-review",
    "Huawei P40 Pro Plus": "https://www.techradar.com/reviews/huawei-p40-pro-plus"
  }
}