{
  "source": "https://www.techradar.com/reviews/acemoney-lite",
  "title": "AceMoney Lite finance manager review",
  "category": "computing",
  "updated": "2020-09-25T15:22:42Z",
  "author": "rob-clymo",
  "summary": "Simplify your finances with AceMoney Lite",
  "verdict": "Novice users might find using the budget AceMoney Lite a bit of a struggle. While the software has a decent level of features the functionality is challenging to master.",
  "pros": [
    "Reasonable feature set",
    "Decent Android app"
  ],
  "cons": [
    "Tired interface",
    "Labour intensive",
    "No iOS app"
  ],
  "article": [
    "AceMoney Lite is often referred to as an alternative to Quicken, which is good news if you’re looking for a reasonably potent personal finance software package minus the price tag, especially during the coronavirus crisis.",
    "While it’s not quite as fully featured as something like Quicken, or Microsoft Money, this software solution is ideal for anyone with fairly basic requirements who wants a program with a plentiful supply of money management options.",
    "It’ll help you tackle home finances, but there are also enough toolbar options inside AceMoney Lite to make it appealing for small business users. However, there are challenges to tackle as you work your way around its rather jaded interface. The competition includes Mint, You Need a Budget (YNAB), Banktree, Money Dashboard or Moneydance if you want to check those out too.",
    "It’s possible to try AceMoney for 30 days free of charge, which involves downloading the software and installing it. You then have the capacity to license your copy later on should you wish to do so. If you like what you see then it’s also possible to opt for the non-Lite edition of the software, which can be purchased for $44.95. There’s also information on uninstalling the software, which might prove useful if you’re not to enamored with what you see.",
    "In its Lite incarnation you can use AceMoney for up to two accounts, which makes it handy if you’re a couple for example, but want to manage your finances separately. The program does favor US users in the respect that control options are often better tailored to suit that geographical region.",
    "On top of that, the main dashboard of AceMoney Lite is in need of a makeover. It's got a rather tired feel, which compared to others in this space, leaves you feeling rather deflated after struggling with its functionality for a while. Master the controls and you’ll be able to manage transactions and tracking, but it’s not an easy ride.",
    "It’s possible to import investment data too, although like many other features in the program, this isn't quite as easy as it could be. There is also the provision for producing limited reports, with the resulting charts coming across as okay but rather basic.",
    "AceMoney Lite is available for Windows machines, while there’s also a version of the non-Lite software for Mac OS. MechCAD Software, the publishers, also have uninstall instructions on their download page, just in case you don't want to keep the software.",
    "Overall, the software chunters along but taking on complex tasks proves quite laborious and there’s no ability to automatically integrate with your bank accounts either, making the overall effect feel even more clunky. Non-US users will also have to battle against its American-focused controls.",
    "The Android-only accompanying app isn’t bad at all though, even if it lacks the full compliment of features found inside the main program. A lack of an iOS version will be disappointing to many however.",
    "There is usually a reason for things being cheap and it's generally about what you get in return. While AceMoney Lite ticks a lot of feature boxes, it’s not the easiest of software programs to get to grips with. Even if you’ve got simple financial affairs there's still quite a lot of legwork involved in using the program. This is mainly because there is quite a lot of manual intervention required to get up and running.",
    "The interface presents you with a plentiful supply of dialog boxes and other user-based challenges just to get your data into the application. Although the initial setup does seem overly complicated things do improve once you’ve got your figures into position. The Android app, while also seeming quite tired, is straightforward, but it too suffers from an outdated feel.",
    "If you give AceMoney Lite a whirl then it’s entirely likely you might have to end up stopping by its help hub. There’s quite a lot of online assistance available to users, plus the ability to raise a ticket if the information online can’t resolve your issues. While it appears you can also email the company too, there doesn’t seem to be any phone support on hand.",
    "Chances are you may find the answers you’re looking for within the help documentation, but not having instant access to live support is possibly one of the reasons why AceMoney Lite is initially free to use.",
    "AceMoney Lite doesn’t seem like a bad proposition prior to downloading it and makes an ideal introduction to the full paid-for version thereafter. Having a downloadable desktop-based finance management package still suits a lot of people, and being able to use one that is so cheap and cheerful might well appeal.",
    "However, AceMoney Light is not the easiest of programs to navigate and use on a daily basis, even if your financial affairs are quite straightforward. With a rather tired interface, a lack of modern features such as automatic syncing with your bank accounts, plus uncertainty on just how secure it is, AceMoney could do with a refresh. It works, but just how well it works remains to be seen."
  ],
  "headers": {
    "3": "Pricing",
    "4": "Features",
    "7": "Performance",
    "10": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "AceMoney Lite": "https://www.mechcad.net",
    "Quicken": "https://www.techradar.com/reviews/quicken",
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "Microsoft Money": "https://www.techradar.com/news/microsofts-new-money-in-excel-offers-dynamic-management-of-your-finances",
    "home finances": "https://www.techradar.com/best/best-personal-finance-software",
    "small business": "https://www.techradar.com/best/best-small-business-software",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "Banktree": "https://www.techradar.com/reviews/banktree-personal-finance",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance",
    "finance management": "https://www.techradar.com/best/best-personal-finance-software"
  }
}