{
  "source": "https://www.techradar.com/reviews/smartydns",
  "title": "SmartyDNS review",
  "category": "computing",
  "updated": "2020-10-28T18:03:23Z",
  "author": "sead-fadilpasic",
  "summary": "Primarily a DNS service with mediocre VPN capabilities",
  "verdict": "SmartyDNS performs best when focused on its DNS capabilities, as it can unlock all sorts of censored and geo-blocked content, Netflix and BBC iPlayer included. Switching on its VPN, however, brings with it a bunch of problems, starting from failure to connect and continuing with very low speeds.",
  "pros": [
    "Inexpensive",
    "Unblocks Netflix, BBC iPlayer",
    "Free trial",
    "30-day money-back guarantee"
  ],
  "cons": [
    "Poor speeds",
    "Unreliable connectivity at times"
  ],
  "article": [
    "Founded in August 2013, SmartyDNS aimed to provide “online freedom to people so they can access contents and services they missed”, later developing into a VPN service that offers online anonymity and access to all sorts of blocked or censored content - currently counting over 300 geo-blocked websites",
    "However, this VPN platform has some shortcomings and isn’t as great a performer as today’s best VPN products.",
    "Payment plans include: 1-month at $5.56 (renews at $7.95), 3-month at $13.26 ($4.42/month, renews at $18.95), 1-year at $34.96 (equal to $2.91/month, renews at $49.95), and 2-year at $55.96 (around $2.33/month, renews at $79.95), which is pretty cheap even after the initial discounted billing cycle.",
    "It even offers free lifetime service to bloggers that write a 500+ word review on it and features monthly giveaways on social media. And it doesn’t stop there - referring a friend will get both you and your friend one month of free SmartyDNS services.",
    "There’s a 30-day money-back guarantee if the service is not to your liking and SmartyDNS also gives you a chance to try its platform during a 3-day free trial, with no limitations on speed or server access.",
    "Users can make their purchase with PayPal, Webmoney, Yandex Money, Alipay, Qiwi, Boleto Bancario, credit/debit cards, and cryptocurrencies - Bitcoin, Ethereum, and Litecoin.",
    "As can be deduced from its name, SmartyDNS’s focus is on providing DNS services, (i.e. unblocking content otherwise unavailable to you). It lacks some VPN features, so if you need a full VPN, we strongly advise you consider industry-leading providers like ExpressVPN, NordVPN, CyberGhost, or Surfshark.",
    "SmartyDNS unblocks a lot of popular VOD platforms that may not be available at your location for any reason, including Netflix US, BBC iPlayer, Amazon Prime Video, Hulu, Disney+, and many, many more.",
    "The company was founded in August 2013 in Bucharest, Romania and it offers access to ultra-fast servers in 17 locations around the world, including in countries like India, Russia, Canada, Poland, Australia, and so on.",
    "The website states that the provider uses 256-bit AES encryption - “the strongest encryption which makes impossible [sic] to decrypt your traffic and keeps you secure as long as you are connected to our VPN servers,” as well as DNS leak protection.",
    "When you go to its support site, you’ll be given more detail: the AES-256 encryption is used with L2TP/IPSec, SSTP, OpenVPN, IKEv2, and SoftEther protocols, while the PPTP protocol uses 128-bit MPPE.",
    "In addition to hiding your IP address to allow you to bypass firewalls and geo-restrictions to unblock any site, the website claims that its VPN encrypts your traffic end-to-end so that cybercriminals, ISPs, and government surveillance agencies cannot see what you do online. This also means your traffic is safe from hackers when using public WiFi networks.",
    "Additionally, SmartyDNS prevents websites from learning your preferences and associating them with your online identity to bombard you with personalized ads, and masks your torrent traffic to help you avoid copyright notices or other “angry ISP letters”. However, not all of its servers are P2P-optimized.",
    "The provider claims not to keep any connection or activity logs, nor does it record, log, or store “any data relating to your activities while using our VPN, ensuring no user can be matched to specific network activity or behavior”.",
    "It does, however, add that “in order to provide the service we have to collect some data from our clients, but we keep the data collected to a minimum.” We are not told what constitutes this “minimum” and we only have the provider’s word that no meaningful logs are collected.",
    "This vendor’s services can be used on a wide array of devices and operating systems.",
    "You can download its apps for Windows, Mac, Android, iOS, Fire OS, as well as extensions for Chrome and Firefox, through the download links provided on the website.",
    "Other platforms, including Apple TV, Roku, Samsung Smart TV, LG TV, Xbox, PlayStation, and Now TV Box, can be manually equipped with the service using configuration files.",
    "SmartyDNS’s Android app has been installed over 10,000 times and has been given a very solid rating of 4.0 (out of 5) by 90 users. It was last updated on July 28, 2020. The iOS app has a slightly lower score: 3.7 as rated by 18 people. It was last updated on July 2, 2020.",
    "If you run into any issues you need help with, you can consult the provider’s blog and help center which features step-by-step tutorials (with images), FAQs, articles about VPN, and more.",
    "You can also contact its customer support using live chat, submit a support ticket on the website, or send an email directly.",
    "We easily downloaded the Windows app and immediately started using it.",
    "The fastest server for our location was Nuremberg, Germany. It connected in a few seconds, but only gave us 5.76Mbps on our 70Mbps testing connection.",
    "We then switched to a server in Kansas City, US, but that also delivered an underwhelming 2.77Mbps.",
    "SmartyDNS has nice and straightforward apps for quite a few platforms, unblocks more than 300 websites and services across the internet, and is available at very reasonable rates.",
    "That said, it cannot offer you thousands of servers, blazing speeds, advanced controls, or the substantiated no-logging guarantees that some of the leading VPN platforms such as ExpressVPN can and have offered by exposing its service to outside auditors."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "15": "Support",
    "21": "Speed and experience",
    "24": "Verdict"
  },
  "links": {
    "SmartyDNS": "https://www.smartydns.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1082222280966511500"
  }
}