{
  "source": "https://www.techradar.com/reviews/dashlane-vpn",
  "title": "Dashlane VPN review",
  "category": "computing",
  "updated": "2020-12-04T11:30:15Z",
  "author": "sead-fadilpasic",
  "summary": "Password manager meets fast VPN",
  "verdict": "Dashlane is primarily a password manager so it’s no surprise that its VPN service is very basic - offering essential privacy protection at high speeds but not much else.",
  "pros": [
    "Two services at the price of one",
    "Blazing speeds for nearby servers",
    "Speedy customer support",
    "30-day money-back guarantee"
  ],
  "cons": [
    "Doesn’t unblock Netflix, BBC iPlayer",
    "Third-party technology",
    "No VPN trial",
    "No monthly pricing option"
  ],
  "article": [
    "Dashlane is an advanced password-management platform that comes with a complimentary built-in VPN. Like a lot of other security products, it provides this VPN through a third-party’s technology, in this case Pango’s Hotspot Shield. In this review, we’re analyzing the VPN separately from the password management feature, which in itself is among the best in the field. If such a platform isn’t what you need and you’d rather just have the VPN alone, then you should check out one of the best VPN services that offer high-quality standalone products.",
    "The entire Dashlane platform can be purchased at $3.33/month ($39.99 billed annually) for an Individual account or $4.99/month ($59.99 billed annually) for a Family account, which is rather cheap considering you’re getting both a password manager service and a VPN. The only subscription option available is the annual one. Payments are done using PayPal or a credit/debit card. Dashlane doesn’t limit the number of devices on which you can connect the VPN simultaneously.",
    "There’s also a free tier that doesn’t come with the VPN service but offers a 30-day free trial of the Premium account. Unfortunately, this free trial doesn’t include the VPN. Premium users get a 30-day money-back guarantee if they’re not happy with their purchase for any reason.",
    "If you don’t feel like the Dashlane password management platform is the right for you and you’d like to have a stand-alone VPN service, then we suggest you take a look at NordVPN, CyberGhost, or Surfshark, all of which are robust platforms for all sorts of VPN users. However, if you want the ultimate VPN experience that money can buy, then ExpressVPN is the way to go.",
    "Although Hotspot Shield itself easily provides access to major streaming services like Netflix, BBC iPlayer, Hulu, Disney+, and others that are often blocked in certain regions, Dashlane’s VPN service doesn’t since it’s only the addition to the main platform - the password manager.",
    "Dashlane is a Paris-based startup but Pango, the company whose technology it uses to provide VPN services to its users, is based in Silicon Valley, with offices in Ukraine and Russia. Pango’s Hotspot Shield has 3,200+ servers in 80+ countries but we couldn’t get information on how many of those servers are at disposal to Dashlane’s clients due to, as we were told by the customer support, “security purposes”. We only learned that these servers are located in 26 countries, including Mexico, Australia, Hong Kong, Russia, and Singapore.",
    "Dashlane’s VPN can be used for peer-to-peer sharing, although port forwarding isn’t supported. The VPN protocols it deploys depend on the platform you’re using it on, therefore OpenVPN is used on Windows and Android, IPSec on Mac, while Catapult Hydra - Pango’s proprietary protocol - is used on iOS. There are no extra features often seen in other services, like split tunneling or kill switch.",
    "The company claims it doesn’t keep any history of your browsing through the VPN, nor does it provide any identifiable information about its users to Pango. Pango, on its side, doesn’t collect or keep any personal information from Dashlane’s users, so there’s no data to share with third parties either. According to Dashlane, “the only information tracked is technical information related to your VPN connection, in order to maintain performance and stability.”",
    "We have no other choice but to trust both these providers since neither of them has exposed their VPN platforms to independent auditors who would verify these claims and issue a report on their findings.",
    "Dashlane has apps you can download and install on Windows, Mac, Android, and iOS devices. The Android app has received 4.5 stars (out of 5) from 112,029 users. It has been downloaded over 1,000,000 times and was last updated on August 10, 2020. As for its iOS app, it’s got a slightly better score - 4.7 from as judged by 36,400 people. The app was last updated on August 7, 2020.",
    "A pretty decent amount of information is available on Dashlane’s website about its platform and VPN, divided into several thematic categories, such as Installing & Getting Started, Account & Security, and Passwords & Data.",
    "If you don’t manage to find the answer you’re looking for, then you can contact customer support directly. The fast and responsive customer support agents are available via live chat or email.",
    "The Dashlane app is easily downloaded from the website and installed in a few seconds. It is also very user-friendly and easy to navigate and the VPN can be activated in the app’s toolbar. This is also where switching between servers is done. That said, you’ll first need to disconnect from the VPN server you’re running before you can switch to a different one.",
    "Once we turned on the VPN, we were amazed at how fast the download speeds were, at least for the server in Germany - 45Mbps on a 70Mbps testing connection, which isn’t often seen in the VPN industry. This was the server that was automatically chosen for us on the basis of our current physical location. A server in the UK was slower but still good, hailing 21.30Mbps.",
    "Next, we decided to see how the VPN would handle more distant places, like Mexico. Unfortunately, the results were much poorer for this location - only 6.77Mbps (we’ve seen worse though). We also tried out a server in Australia, which had a similar result - 6.73Mbps. Finally, it was the turn for the US, delivering a usable 13.72Mbps.",
    "Just like all other services of its kind, Dashlane’s VPN allows you to hide your identity on the Internet, increase your privacy online, and safely browse and torrent from an unsecure network. However, that’s as far as its offering goes since it doesn’t unblock popular VOD services and has no advanced features save for Pango’s proprietary and innovative Catapult Hydra protocol. This makes sense because Dashlane is primarily a (very good) password manager and its VPN is just an extra feature that completes the platform. If you’d rather have the best stand-alone VPN service money can buy, then one of the top names in the business, such as ExpressVPN, is for you."
  ],
  "headers": {
    "1": "Price",
    "3": "Alternatives",
    "4": "Streaming",
    "5": "About the company",
    "6": "Privacy and encryption",
    "9": "Support",
    "12": "Speed and experience",
    "15": "Verdict"
  },
  "links": {
    "built-in VPN": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2721406945935768600&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Ffeatures%2Fvpn&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fdashlane-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "password manager": "https://www.techradar.com/best/password-manager",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-8794692680631808000"
  }
}