{
  "source": "https://www.techradar.com/reviews/sendspace",
  "title": "Sendspace file sharing review",
  "category": "computing",
  "updated": "2021-11-23T12:37:05Z",
  "author": "mayank-sharma",
  "summary": "Share files for cheap",
  "verdict": "A good option for anyone looking for a file storage and sharing service with the explicit purpose of sharing large files with a large number of people. All its features are designed with that goal in mind including the fact that instead of restricting accounts by disk space, it caps accounts by bandwidth.",
  "pros": [
    "Unlimited disk space",
    "Desktop and mobile apps",
    "Free uploads"
  ],
  "cons": [
    "No encryption",
    "No file previews",
    "No sync",
    "No virus scanner"
  ],
  "article": [
    "Sendspace has been in the file hosting and file sharing game since 2005. The service pitches itself as a medium to send files that are too large to include as email attachments and offers an interesting bunch of features that make it usable for all kinds of users.",
    "Sendspace is one of the few file sharing services (1fichier is another) that you can start using without even registering an account, although creating an account does offer several benefits.",
    "For starters, registered users can create and organize files inside folders. This is also useful for sharing multiple files with ease, since the service enables you to share a complete folder in addition to individual files. Note however that while you can’t upload a complete folder from your computer, you can create a folder in your account and upload multiple files into it in one go.",
    "In addition to uploading files from your computer, Sendspace also equips you with the remote uploading facility using which you can transfer files hosted elsewhere on the Internet into your Sendspace account.",
    "In terms of security, the service offers its paid members the ability to protect their files with a password. The lack of encryption as it is available on some of its competition like Mega is a downer, though you can use the service to transfer files over an encrypted https channel.",
    "Another way to restrict distribution is to cap the number of downloads, either by the number of times (such as 15), or by a certain period of time (such as 5 days). You can also specify both limits and the downloads will cease as soon as either of them is triggered.",
    "For Free users, download links lead to a download page. However you can buy download bandwidth for a file, which will automatically convert the link into a direct download link. In this case even if the recipients are free users, they are not restricted in any way, and can download the file as if they were premium users. You’ll also be able to monitor the bandwidth activity of your files from the Sendspace interface. Besides the web interface the service also has apps for the desktop as well as for Android smartphones.",
    "Like we mentioned earlier, you can use Sendspace without registering with the service. However you’ll not be able to interact with the service through its apps without registering. The service supports Single Sign-On and you can register with it using your Facebook, Twitter, Google, or Yahoo account.",
    "Uploading a file using the web interface is fairly straightforward. You can either use your file manager or drag and drop files into the Upload area to transfer the files into your account. You can also optionally add a brief description and lock the files with a password. Also, by default the service will send you the download link for the files on your registered email address. If you want to share the files with someone else, you can specify their email address and the service will email them the download link automatically once the file has been uploaded.",
    "Once a file has been uploaded, the service will display the URL to download the file. The uploaded files are also listed in your account, from where you can add a description and set a password. By default, all folders are created as Private but can be changed to Shared. Doing so will generate a URL that’ll display the contents of the folder to anyone with the URL.",
    "In addition to the web interface, you can also interact with the service using its desktop and Android app. The desktop app is available for Windows, Mac, and Linux and looks like a traditional FTP client. You can use it to upload single or multiple files and even manage your online account. The desktop client has a built-in download accelerator and also allows you to download multiple files at once.",
    "Similarly, the Android app allows you to upload single or multiple files from your Android device. Furthermore, it can also capture and upload pictures, audio, and video directly from the device to your Sendspace account. The app also has the option to compress files before uploading them.",
    "As we’ve said earlier, you can share files with Sendspace using a Free account. Users of this account can only upload files that don’t exceed 300 MB each. They also get limited bandwidth statistics and none of the more useful features like password protecting files and direct download links.",
    "If you want these features you’ll have to subscribe to one of its two Premium accounts. The Pro Base account costs $8.99/month and allows you to upload single files of up to 5 GB and allots 100 GB/month of download bandwidth. The Pro Plus account costs $19.99/month and increases the single file size to 10 GB and download bandwidth to 300 GB. Optionally, even Free users can buy direct download bandwidth, which costs from $2/10 GB to $49.99/1 TB.",
    "Besides the file size and download bandwidth, both Premium accounts offer the same set of features.",
    "It’s also important to note that downloads speeds of Free users are also restricted and they are limited to a maximum of 1 GB of downloads a day. Free users also can’t download multiple files concurrently like Premium users, who also get the ability to resume broken downloads. Furthermore, downloads of Premium users aren’t capped with a daily limit.",
    "One of the good things about Sendspace is that it doesn’t delete active files for any kind of user. Even in the case of Free users, Sendspace will only remove a file if it hasn’t been downloaded for 30 days. This limit doesn’t apply if Free users have purchased bandwidth for a file. Similarly, files of Premium users will never be zapped, no matter when it was last downloaded.",
    "Perhaps one of the biggest key differences between Sendspace and many of the other file sharing services is that instead of restricting accounts by disk space, Sendspace caps accounts by download bandwidth. Also, unlike some services, Sendspace is designed primarily for sharing large files with others instead of being used as a personal file sync service. However we think the lack of an integrated antivirus is a major omission, especially when it is a pretty standard feature on many of its peers like Keep2Share.",
    "One of the unique features of the service is the Sendspace dropbox, which you can use to allow non-Sendspace users to upload files directly into your account. The facility is available to Premium users and involves pasting some HTML code for the dropbox widget into your web page. Unlike a regular upload, once a file is uploaded using the dropbox widget on your website, the uploader doesn’t get the URL to download the file, but you’ll receive an email instead.",
    "All files uploaded through a Sendspace dropbox go into the folder you’ve earmarked. Remember however that if the folder is Shared, then everyone who has the URL to the folder can view and download the file. The feature is designed to help you create a file sharing network for sharing files easily between members of a small group like a classroom. It’s also important to remember that a Sendspace dropbox is linked to the creator’s account and all uploads and downloads must adhere to the same size and bandwidth limits as applicable on the linked account.",
    "One of the best features of the Sendspace service is that it doesn’t restrict accounts by space. Furthermore, unlike other services, it doesn’t count upload bandwidth, which is another positive. Although the service has a simple user interface and is pretty intuitive to operate, it also provides a free detailed user guide.",
    "All things considered, the service is primarily designed to share files that are too large or inconvenient to send via other means. We can’t recommend it as a personal backup solution since it’s priced to reward multiple downloads. The feature set of the service also best suits this use case. Also, if you plan to use it to share encrypted files, make sure you encrypt them yourself, since the service lacks this feature."
  ],
  "headers": {
    "2": "Features",
    "7": "Interface and apps",
    "12": "Plans and Pricing",
    "17": "The competition",
    "20": "Final Verdict"
  },
  "links": {
    "file sharing": "https://www.techradar.com/best/best-apps-to-share-files-securely",
    "email": "https://www.techradar.com/news/best-email-provider",
    "1fichier": "https://www.techradar.com/reviews/1fichier",
    "transfer files": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "password": "https://www.techradar.com/best/password-manager",
    "Mega": "https://www.techradar.com/reviews/mega",
    "download": "https://www.techradar.com/best/free-download-manager",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "Single Sign-On": "https://www.techradar.com/best/best-identity-management-software",
    "file manager": "https://www.techradar.com/best/the-best-file-manager",
    "email address": "https://www.techradar.com/best/best-email-clients",
    "desktop": "https://www.techradar.com/news/best-business-desktop-pcs",
    "Android app": "https://www.techradar.com/best/best-android-apps-2021",
    "Windows": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "Mac": "https://www.techradar.com/best/best-business-mac",
    "Linux": "https://www.techradar.com/best/linux-laptops",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "Keep2Share": "https://www.techradar.com/reviews/keep2share",
    "encrypted": "https://www.techradar.com/best/best-encryption-software"
  }
}