{
  "source": "https://www.techradar.com/reviews/campaigner",
  "title": "Campaigner email marketing software review",
  "category": "computing",
  "updated": "2020-10-29T21:52:51Z",
  "author": "michael-graw",
  "summary": "Flexible and affordable email marketing",
  "verdict": "Campaigner is a good choice for eCommerce owners who want to tailor marketing campaigns based on customers’ purchasing history. But, workflow automation is expensive and the platform isn’t seamless.",
  "pros": [
    "Segment online store customers",
    "24/7 phone support"
  ],
  "cons": [
    "Limited email templates",
    "Clunky user interface"
  ],
  "article": [
    "Finding the best email marketing software for your business is key to making sales. Campaigner is a straightforward yet capable email marketing platform that covers all the essentials. It provides autoresponders, flexible email design, and tight integration with eCommerce shops to maximize conversions. In our Campaigner email marketing services review, we’ll cover everything you need to know about this platform.",
    "Campaigner’s least expensive offering is a limited version of the Starter plan that allows you to have 1,000 subscribers for $19.95 per month. The Starter plan itself costs $49.95 per month and offers up to 5,000 subscribers. Notably, these plans don’t allow you to remove Campaigner branding from your emails and don’t include automated workflows.",
    "The Essential plan costs $149.95 per month and includes up to 25,000 subscribers and includes eCommerce integrations, but not automated workflows. For automation, you’ll need the Advanced plan, which starts at $549.95 per month for 100,000 subscribers.",
    "Campaigner also offer eCommerce plans that start at $79.95. These don’t limit you by subscriber count, but rather by the number of emails you can send each month. eCommerce plans do not come with automated workflows.",
    "One of the more exciting features within Campaigner is the email designer. This is a drag-and-drop builder that lets you add content elements like images and text to your emails to create a fully custom design. That said, we were a bit disappointed by the template selection, as most of Campaigner’s options look alike if you ignore the color palette.",
    "Another important thing to note about Campaigner’s email design is that you have access to an HTML editor and the ability to import HTML files. So, advanced creators can design emails in software like Dreamweaver and then launch a campaign using Campaigner.",
    "In addition, Campaigner includes integrations for eCommerce platforms like Shopify, Magento, and WooCommerce that can be a major help for shop owners. You can use the integrations to segment contacts based on their past orders from your online store, using data such as how much they spent or which products they purchased. Of course, you can also trigger autoresponders when a cart is abandoned.",
    "Setting up Campaigner for the first time is fast and easy. You can create new contacts manually, or import an existing database as an Excel file. When you import data, you’ll have a chance to map fields to make sure your headers are being transferred correctly.",
    "You can also add additional users to your Campaigner account and assign them roles. These roles vary in what degree of access users have to Campaigner’s features, making this software more flexible for businesses with several employees involved in coordinating email campaigns.",
    "We found Campaigner to be a little more clunky than we anticipated. The email designer, for example, requires that you click through multiple screens before you can start editing an email. While we liked having the ability to drag and drop content, the editing menu was also somewhat outdated and a little bit difficult to navigate.",
    "The workflow automation builder, which uses a visual designer similar to what competitors offer, was also less than perfectly smooth. You have a significant degree of freedom to build triggers and conditional responses. But, trigger, response, and filter options are found on a different page from the workflow you’re in the process of building.",
    "Another place we ran into trouble was with managing email lists. If you have your contacts split into multiple lists, you can’t seamlessly send targeted campaigns to contacts across those lists. You’ll have to either coordinate multiple campaigns or merge your lists.",
    "Campaigner is light on security measures compared to some of its peers. The platform doesn’t support two-factor authentication for user accounts and there is no tracking log to look back on if you have multiple users on your account.",
    "While Campaigner is GDPR-compliant, we also didn’t find many explicit tools for managing EU subscribers. For example, you’ll need to create your own header tag to note whether subscribers have consented to your marketing campaigns. You can enable double opt-in, but you’re left to create the opt-in email on your own.",
    "Campaigner provides 24/7 support by phone, email, and live chat. The company’s website also includes a detailed knowledgebase. Most tutorials don’t include videos or screenshots, but they’re complete enough to walk you through the process they describe.",
    "If you want marketing automation at a lower price point, consider ConvertKit. This platform is built around a visual automation designer that makes it easy to customize triggers, responses, and conditionals. ConvertKit can be pricey if you have a large subscriber base—5,000 contacts costs $79 per month—but workflow automation is standard with every paid plan.",
    "Campaigner is a good choice for email marketers who need eCommerce integration, but not custom workflow automation. The platform makes the latter feature extremely expensive to access. We found that Campaigner is somewhat clunky to use, but it can be especially versatile if you have multiple employees involved in email marketing."
  ],
  "headers": {
    "1": "Plans and pricing",
    "4": "Features",
    "7": "Setup",
    "9": "Performance",
    "12": "Security",
    "14": "Support",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "best email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "emails": "https://www.techradar.com/best/best-email-clients",
    "eCommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "workflows": "https://www.techradar.com/best/best-flowchart-software",
    "HTML": "https://www.techradar.com/best/html-online-courses",
    "Dreamweaver": "https://www.techradar.com/reviews/adobe-dreamweaver-cc-2020",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "WooCommerce": "https://www.techradar.com/reviews/woocommerce",
    "database": "https://www.techradar.com/best/best-database-software",
    "Excel": "https://www.techradar.com/best/excel-online-courses",
    "employees": "https://www.techradar.com/best/best-hr-software",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "marketing campaigns": "https://www.techradar.com/best/best-online-marketing-services",
    "ConvertKit": "https://www.techradar.com/reviews/convertkit"
  }
}