{
  "source": "https://www.techradar.com/reviews/epson-ecotank-et-7750",
  "title": "Epson EcoTank ET-7750 refillable ink tank printer review",
  "category": "computing",
  "updated": "2021-03-03T17:31:47Z",
  "author": "jim-hill",
  "summary": "Epson’s expensive EcoTank promises affordable five-colour inkjet printing",
  "verdict": "Epson’s EcoTank system may look a little clunky and it certainly adds cost, but in terms of print quality and ink economy, the ET-7750 is hard to beat.",
  "pros": [
    "Cost-effective printing",
    "Can handle A3/tabloid size media",
    "Five-colour ink system works well with photos",
    "Includes enough ink for 3,400 photos"
  ],
  "cons": [
    "Small, non-touchscreen interface",
    "Expensive initial cost",
    "Limited paper tray capacity",
    "No ADF, NFC or fax"
  ],
  "article": [
    "The Epson EcoTank ET-7750 multi-function printer sits at the top of the EcoTank product tree and although price is alarming, this machine is a far cry from the disappointing Epson ET-4500.",
    "The five-colour refillable ink tank system is a huge improvement in image quality thanks to the addition of a dedicated photo black pigment ink, and the build quality is streets ahead. This machine can also handle A3/tabloid-sized paper and boasts fast duplex print speeds and high-resolution photo printing.",
    "But the attention grabbing feature that’s plastered all over the box and brochure is the fact that includes enough ink in the ten bundled bottles to print 3,600 photos. That’s 10x15cm photo paper, not A4, but it’s still way more than any other inkjet can offer.",
    "Epson’s EcoTank printers are a little larger than their cartridge-based equivalents and that’s especially true when you compare the ET-7750 with the lozenge-shaped XP-960, which can also handle A3 paper. The ink tanks themselves bulge from the front panel whereas they used to appear at the rear on earlier models and there’s something satisfying about being able to see how much ink you have remaining.",
    "Waiting for a cartridge itself to tell you when it needs replacing can leave you dry, or suspicious that you’re spending more than you are actually using. The refueling system itself is well designed with bottles that correspond only with the correct colour tank, so you cannot pour the wrong one, while an automatic shut-off valve prevents you from overfilling the tanks.",
    "With all the flaps and trays pushed in, the ET-7750 is compact enough, but the various extending trays feel flimsy and one can only wonder how long the many moving plastic parts will last.",
    "The 2.7-inch (6.8cm) display is smaller than that of the XP-90 and not touchscreen, but it is easy enough to read on its tilting flap. You have to raise the flap and extend the front delivery tray to print anything, which extends the footprint of this printer somewhat.",
    "We were happy to find an SD card slot alongside the front USB port and a square USB input beside the Ethernet port at the rear, although the package doesn’t include a USB data cable, sadly.",
    "The Epson EcoTank ET-7750 is a 3-in-1 multifunction device, so that means it can print, scan and photocopy, but not fax. Does anyone still do that? And being a premium model, it offers key features such as duplex printing. Most notable though, is the EcoTank system that replaces sealed cartridges with compartments you fill with ink from a bottle.",
    "5 bottles of ink are included in the box, which Epson reckons might last you for up to two years, or 2,300 photos, or 9,300 black and white pages. Each additional 140ml colour ink bottle costs $13.99 (£11.99/AU$22.99).",
    "There are three input paper trays, one that will accept one hundred sheets of plain paper and another for envelopes and photo paper, or a tray that allows you to print directly onto printable compact discs.",
    "The rear tray is able to cope with A3 or tabloid-sized paper, which puts the ET-7750 in a very useful category. It’s worth noting that while it can print colour documents at that size, it cannot print photos onto glossy A3 paper and the scanner bed is smaller than A3 too.",
    "You can scan up to A4-sized documents at 1,200 x 2,400 dpi. That’s a reasonable resolution for most purposes, but it’s half as much as the more affordable Epson XP-960.",
    "We recorded print speeds in line with Epson’s claimed 28ppm for basic mono printing and while photo printing is slow, it is very impressive. There’s no NFC for one-touch communication with a mobile device, but the printer did connect readily enough using the office Wi-Fi network and via Wi-Fi Direct.",
    "Epson’s Windows software comes in the box and the Epson iConnect app is a free download for Android/Apple devices. It’s not an especially advanced app and doesn’t, for instance, join your printer with your Wi-Fi network for you at the installation stage.",
    "Since launch, Epson has also come out with a handful of new drivers that should mean your scanning and printing experience is as smooth as possible.",
    "The user manual in this case is a mere leaflet, which is always a good sign. All you really need is the mobile app in order to follow the setup procedure and get the Epson EcoTank ET-7750 online and calibrated. Four test sheets are churned out for your approval, so it’s just as well you have so much ink included. Disappointingly, the app does not log the printer with your Wi-Fi network, so you have to type in your password via the cramped LCD and the buttons beside it. This makes the setup procedure rather longer than it needs to be.",
    "Filling the ink tanks, when prompted, is rather fun. The tops of the bottles have specific shapes so you can’t pour the cyan into the magenta tank for example. Presumably that would have caused a real headache. What’s more, they automatically stop dispensing ink when the tank is full, so you can simply invert the bottle with no fear of it running over. We put down newspaper for this job, but didn’t spill a drop and we needn’t have worn the included rubber gloves.",
    "In operation, the Epson is logical and easy to use, especially via the Epson iConnect app and it prints fairly quietly at 37dB when using photo paper.",
    "The Epson EcoTank ET-7750 passed all of our tests easily and although it would occasionally spit out two pieces of photo paper at the same time, the quality of every print was high.",
    "Very small text was always clearly legible, while larger letters appeared well defined and consistent. Laser printers tend to manage finer lines, but there was certainly no smearing, or over inking going on.",
    "The four dyes are applied evenly and quickly to produce vivid colour documents on up to A3 sized paper in moments. But the Epson EcoTank ET-7750 is most impressive when turning out photos onto glossy photo paper at their highest quality. The amount of detail on show is remarkable and the advantage of using a separate photo black pigment in addition to the black dye is apparent in every shot.",
    "It’s fairly fast too, with print speeds that measure up to Epson’s quoted 5.5 pages per minute for mono duplex printing, or possibly 28ppm when flat out. It’s not as fast as a laser printer, nor is it the fastest inkjet, and with the paper tray limited to one hundred sheets, it cannot compete with a Xerox machine for efficiency. It performed reliably in the test however, and it certainly didn’t run out of ink.",
    "The potential savings that can be made with the latest iteration of Epson’s EcoTank system easily outweigh that hefty initial outlay. By any measurement, it works out far less expensive than cartridges, while the five-colour system works especially well with photos on photo paper.",
    "Mono duplex printing is fairly fast and reliable on A4 paper, but don’t forget that you can also A3-sized documents in colour, not to mention envelopes and CD labels.",
    "There’s denying that at a recommended retail price of $649.99 (£699.99/AU$999.00), this is an expensive printer and it’s a pity you don’t have the option of buying a bundle with only one set of refills for less. Given the price and the large capacity of the ink tanks, it only really makes sense if you know you will be doing quite a lot of printing. And given the high price, it’s a pity there’s no NFC connectivity, a higher scanning resolution, A3 photo printing, or at least a USB data cable in the box.",
    "Epson’s EcoTank system has come a long way since the clunky Epson ET-4500 and the range-topping EcoTank ET-7750 feels and prints like a premium inkjet machine. Photos on glossy photo paper evidently benefit from the fifth photo black pigment.",
    "If you can get past that prohibitive initial cost, this ink system really does work out far more cost effective than any cartridge-based system. With rapid duplex mono printing and the ability to handle A3 paper, this multifunction model is something of an all-rounder. Given that high cost, however, and the high capacity of the ink tanks, it makes more sense in an office that prints in colour often."
  ],
  "headers": {
    "3": "Design",
    "8": "Features",
    "16": "Setup and operation",
    "19": "Performance",
    "23": "Final verdict"
  },
  "links": {
    "Epson EcoTank ET-7750": "https://www.epson.co.uk/products/printers/inkjet-printers/consumer/ecotank-et-7750?productfinder=EPSON+EcoTank+ET-7750+",
    "Epson ET-4500": "https://www.techradar.com/reviews/epson-ecotank-et-4500",
    "XP-960": "https://www.techradar.com/reviews/epson-expression-photo-xp-960/2"
  }
}