{
  "source": "https://www.techradar.com/reviews/bose-soundsport-free-true-wireless-earbuds",
  "title": "Bose SoundSport Free True Wireless Earbuds review",
  "category": "audio-visual",
  "updated": "2020-06-26T15:30:47Z",
  "author": "lewis-leong",
  "summary": "Wireless earbuds built for quiet environments",
  "verdict": "The Bose SoundSport Free are an excellent sounding pair of wireless headphones with an ultra-reliable connection. They can an easily withstand the abuses of working out, however, their poor fit and open design will turn many casual listeners away.",
  "pros": [
    "Excellent, balanced sound",
    "Built for abuse",
    "Good battery life"
  ],
  "cons": [
    "Awful ambient noise isolation",
    "Earbuds fit loosely and stick out",
    "Comparatively expensive"
  ],
  "article": [
    "The Bose Soundsport Free may be a little older now, but they're still worth considering if you're looking for a pair of running headphones that cut out the wire.",
    "True wireless earbuds have come a long way in terms of build quality, reliability, and battery life, and today’s offering of truly wireless headphones have become so good that we can finally recommend them for a majority of people who value the convenience and compact size that these headphones offer.",
    "However, while there has been some major improvements to the form factor, some true wireless headphones are still a mixed bag of compromises, excelling at certain things while failing at others. The Bose SoundSport Free wireless earbuds fall into that latter category, offering great sound and build quality, with a few flaws that you should take into serious consideration.",
    "Wearing them for an extended period of time, you'll likely feel conflicted about the Bose SoundSport Free. You'll enjoy the sound quality one minute (usually in a quiet environment) and the next you'll find yourself unable to enjoy the music. If you can contend with the highs and the lows of these headphones, they're worth considering. If not, there's no shame on passing these up for models like the Sony WF-1000XM3 or the Apple AirPods Pro.",
    "There’s no getting around the fact that the Bose SoundSport Free are big earbuds The driver housings are the largest we’ve ever seen from a truly wireless pair of earbuds. Compound this with the fact that they stick out quite a bit and the result is a frustrating user experience.",
    "While the wing tips included in the box help with keeping the Bose SoundSport Free in our ears, they also sit loosely so they’re easily knocked out if we weren’t careful. To give you an idea of how bad this can get, on more than one occasion we nearly lost an earbud on the train simply because we were taking off our scarf or messenger bag.",
    "This loose fit is the result of Bose’s decision to make the SoundSport Free an open pair of earphones, meaning they let outside noise in. This makes the Bose SoundSport Free a great pair of workout headphones, especially if you’re running in the street and want to be aware of your surroundings.",
    "However, this also makes the SoundSport Free terrible headphones for commuters hoping to drown out the noise of a bus or train. If you must have noise isolation because you're a frequent traveler, or get easily distracted when you overhear chatter around you, you’ll have to look elsewhere.",
    "The charging case features magnetic seats for the earbuds so they stay securely in the case when you’re taking them out. Additionally, you can check the battery life of the charging case by pressing the release button in the front.",
    "All that said, sound quality from the Bose SoundSport Free is excellent. There’s a slight warm tilt and the overall presentation is relaxed and laid back. Bass extends low and offers nice impact without bleeding into the mids. Highs are slightly rolled off to make long listening sessions a breeze and there’s never sibilance.",
    "These are simply great-sounding headphones... at least when you wear them in a quiet environment.",
    "Unfortunately, the sound quality doesn’t matter once you go outside as the open design allows so much external noise in that you’ll never get to appreciate the detail and warmth of the SoundSport Free’s sound. There is literally no noise isolation, so you can carry a full conversation with these headphones in your ears. We wished Bose would allow listeners the option to let outside noise like the Sony WF-1000X or Libratone Q-Adapt In-Ear but, for now, no such luck.",
    "The included charging case is a bit bulker than we’d like, but gives the SoundSport Free a combined battery life of about 15 hours. The earbuds themselves last about 4 to 5 hours in our testing, which is quite good compared to competitors.",
    "Finally, call quality is excellent, with our friends and family reporting that they didn’t even realize that we were wearing wireless headphones. Audio comes in loud and clear, and our voice was able to be picked up outside without problem.",
    "For those looking for wireless headphones that can withstand the abuses of working out, the SoundSport Free are an excellent option, assuming they fit your ears.",
    "However, if you’re not working out and value any sort of noise isolation, you’ll need to look elsewhere as the open design of the SoundSport Free means you’ll hear everything from the outside environment.",
    "It'd be an easier recommendation if they were a bit less expensive but, for $200 / £180 / AU$300, the Bose SoundSport Free are not cheap, and its rivals offer fewer compromises – the Cambridge Audio Melomania 1, for example, offer outstanding sound quality and battery life for less.",
    "The Sony WF-1000X cost less and offer adjustable noise cancellation, allowing users to choose when and how much sound they want to let in – although we'd recommend checking out the latest in the range, the WF-1000XM3.",
    "They may not last as long on a charge as the SoundSport Free but their flexibility and fit make it a better trade off.",
    "If you're after a pair of great sounding in-ear headphones and don't mind the ambient noise coming in, these headphones might work out. If not, there's no shame in seeking out some of the competition."
  ],
  "headers": {
    "4": "Design",
    "9": "Performance",
    "14": "Verdict"
  },
  "links": {
    "running headphones": "https://www.techradar.com/best/best-running-headphones",
    "True wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000X": "https://www.techradar.com/reviews/sony-wf-1000x-true-wireless-earbuds",
    "Libratone Q-Adapt In-Ear": "https://www.techradar.com/reviews/libratone-q-adapt-in-ears",
    "WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}