{
  "source": "https://www.techradar.com/reviews/hp-envy-pro-6420",
  "title": "HP Envy Pro 6420 review",
  "category": "computing",
  "updated": "2021-12-03T08:04:29Z",
  "author": "jim-hill",
  "summary": "Plenty of printer for your money, but not much ink",
  "verdict": "HP’s slick AIO packs every feature, including auto duplex and Bluetooth, but there’s not much ink in the box and refills are pricey without an Instant Ink subscription",
  "pros": [
    "Sleek space-saving design",
    "Useful 35-page ADF",
    "Strong app support",
    "Great wireless connectivity"
  ],
  "cons": [
    "Slow print speeds",
    "Limited paper capacity",
    "Wasteful tri-clour cartridge",
    "Expensive ink"
  ],
  "article": [
    "HP’s latest all-in-one Envy printers look sleek enough for home use, while offering all the features you might need in the office. The HP Envy Pro 6420 is competitively priced at about £90 (around US$117, AU$165) even though it is the premium model of the two recently released Envy printers and includes a 35-page automatic document scanner that its sibling lacks. So in addition to printing in colour, it can photocopy multiple pages and fax via your smartphone.",
    "In other words, it’s a stylish four-in-one for the home office to rival the Canon Pixma TR8550 which it comfortably undercuts in terms of price. It even offers duplex printing, which the Canon lacks. But as with all surprisingly affordable printers the catch comes with the cost of the cartridges, so please read this review before locking yourself into a lifetime of overpriced ink.",
    "We’ve seen lots of clever small-in-one designs with printing, scanning, copying and faxing rolled into a device that can fit into a drawer, but HP has done well to build in a 35-page ADF without adding too much bulk. With its gently illuminated output slot, you wouldn’t begrudge this printer space on your desk. It prints quietly and rather than beeping impatiently when a print job is complete, it makes a more tuneful sound. The downside of being only 13cm high is that there’s not much room for paper. The capacity of the main input tray is somewhat limited at 100 sheets of A4, or forty sheets of photo paper, or ten envelopes. The output capacity is even more limited at just twenty-five sheets, or ten photos.",
    "If you lift the ADF you will see the A4-sized glass scanner bed beneath and if you lift this, the whole printer hinges open to reveal the two inkjet cartridges. That’s right, instead of four separate carts, it combines three colours into one tri-colour cartridge, which is a convenient but rather wasteful way of printing, especially if you happen to use a lot of one particular colour.",
    "HP has saved space and cost by ditching the LCD screen, which you would usually expect to find on an AOI device. It is replaced by a simple backlit control panel with six illuminating icons and buttons. Be careful not to press the i-button, unless you want to print out an information page.",
    "At the back of the HP Envy Pro 6420, you’ll find the power button, Wi-Fi button and a port for a USB data cable (not included). There’s no Ethernet port and no fax modem port because it utilises your smartphone for mobile faxing. There’s no front USB port for walk-up printing from a thumb drive, which is a pity.",
    "For the money, the HP Envy Pro 6420 is remarkably well featured with colour printing and scanning at 1200dpi, a 35-page ADF, a mobile fax facility and an auto duplex mode. That ability to print both sides of the page is essential for saving paper (and trees), but it’s amazing how many all-in-one devices still can’t manage it. In this compact design, duplex printing looks a little laborious and it’s the slowest duplex, but it’s certainly preferable to turning over every sheet by hand.",
    "There’s no duplex scanning, but the ADF is happy to accept and scan up to 35 pages at a time, which is better than most. It also has great wireless connectivity with self-healing dual-band Wi-Fi, Wi-Fi Direct and Bluetooth built in. The addition of Bluetooth is helpful in using your smart device to find the printer and then use HP’s companion app to make it join your Wi-Fi network.",
    "The companion app is excellent, by the way, and it works on your PC/Mac desktop as well as your iOS/Android device. It adds a lot of functionality such as scanning and printing to and from the cloud, or mobile fax messaging. The app makes up for the lack of a display panel on the device itself.",
    "The brochure suggests a print speed of 10ppm in non-duplex mode, which we found to be about right. It also claims to reach 20ppm in draft mode, which we didn’t reach and wouldn’t recommend because of the compromise in quality. Print speed is not a strong suit for this model, but the resolution is good at 1200x1200dpi, which matches the scanner resolution. You can print on a variety of media from envelopes to photo paper of any size up to A4 and plain paper of any weight up to 300g/m2 in weight.",
    "Setting up the HP Envy Pro 6420 is a simple case of inserting the two cartridges, loading your paper and turning on the power. The HP Smart companion app will do the rest for you. Just run the app on your desktop or smart device and it will make a Bluetooth connection and get the printer onto your Wi-Fi network. To get the Wi-Fi Direct password, press the i-button on the printer and you’ll find it on the printed information page.",
    "The lack of a display on the printer didn’t prove much of a problem. It just means you’ll be doing things like selecting the media type using the app, rather than at the printer. Tasks such as photocopying and using the ADF to scan multiple documents caused no problems during the test. The app makes it easy to set up Smart Tasks, which means you can have one button to scan documents to a particular email for example. You can even use voice commands because, like most of HP’s printers, it is compatible with Google Assistant, Amazon Alexa and Apple Siri.",
    "On the whole, the print quality of the HP Envy Pro 6420 is surprisingly strong for this price point, especially when it comes to glossy photographs. The print resolution is 1200x1200dpi in black and white and optimised to 4800x1200dpi in colour. That means the resolution is still 1200dpi, but the paper moves more slowly in optimised mode so that more dots hit the page along its longest side. By applying more ink in this way, you get sharper edges that don’t show the dots. The dye-based colours look especially vibrant on glossy paper, but you should avoid printing in optimised mode on plain paper as it’s too absorptive and you’ll end up with saturated paper and no ink.",
    "We found that photocopies always looked faithful to the original in terms of detail and only slightly lighter in terms of colour. The ADF worked steadily and quite quickly in scanning multiple documents. We experienced no paper jams during the test and would say that the HP Envy Pro 6420 prints quietly and reliably, if a little slowly.",
    "One thing that did surprise us, however, was receiving a low ink warning after printing just twelve pages. Of course you get more ink than that in a standard cartridge and the two bundled in the box are only ‘setup cartridges’ but this seems very stingy. It certainly doesn’t compare well with printers like the Canon Pixma G4510, which costs more at around £250 (US$326), but gives you enough bottled enough ink for 7,000 colour photos. After the twelfth A4 test photo, the quality of colour prints declined sharply as the coloured ink ran out.",
    "A standard replacement tri-colour cartridge cost £10 and apparently yields 100 photos. That’s a pretty terrible per-page cost, but you’re also left wondering about the quality that 100th photo. Prompts by the companion app and the prohibitive pricing of the cartridges nudge you towards signing up for HP’s Instant Ink subscription, which mails refills to your door as you need them. The current offer on the packaging even includes three free months of Instant Ink when you sign up, so if you’re not afraid of the commitment, such a subscription will bring the per-page cost down to a competitive level. However, it will never rival laser or cartridge-less inkjet systems.",
    "If your print demands are not heavy, but you do require flexibility, the HP Envy Pro 6420 offers all the key features, including duplex printing in a very competent all-in-one device, with a price tag that’s as attractive as its design. We were impressed by its ease of use and overall print quality, while its lack of an LCD display, the limited paper capacity and slow print speed can all be overlooked if you’re printing on a small scale. However, the meagre amount of ink included in the box and the cost of replacement cartridges make it something of a false economy. We would recommend this printer for occasional printing in a home office to anyone prepared to take up an Instant Ink subscription.",
    "You might also want to check out the best HP printers."
  ],
  "headers": {
    "2": "Design and build",
    "6": "Features and specifications",
    "10": "Setup and operation",
    "12": "Performance",
    "16": "Final verdict"
  },
  "links": {
    "HP Envy Pro 6420": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-1021501161983388400&p=https%3A%2F%2Fstore.hp.com%2Fsg-en%2Fdefault%2Fhp-envy-pro-6420-all-in-one-printer-5se46a.html",
    "Canon Pixma TR8550": "https://www.techradar.com/reviews/canon-pixma-tr8550",
    "Canon Pixma G4510": "https://www.techradar.com/reviews/canon-pixma-g4510",
    "HP printers": "https://www.techradar.com/best/best-hp-printers"
  }
}