{
  "source": "https://www.techradar.com/reviews/kobo-nia",
  "title": "Kobo Nia review",
  "category": "tablets",
  "updated": "2020-07-15T04:01:30Z",
  "author": "sharmishta-sarkar",
  "summary": "Kobo takes on the Amazon Kindle",
  "verdict": "If you’re looking for an affordable ereader that won’t tie you up within the Amazon ecosystem, then the Kobo Nia is a compelling option, particularly since its 212ppi screen is a step-up from its rival, the basic Amazon Kindle’s 167ppi display. While the Nia lacks Bluetooth support (which the 10th-gen Kindle boasts), the Kobo has wider file support and a more streamlined user interface.",
  "pros": [
    "Affordable",
    "Sharp, responsive display",
    "Comfortable to hold in one hand"
  ],
  "cons": [
    "No USB-C charging",
    "Not waterproof",
    "Lacks audiobook support"
  ],
  "article": [
    "The Kobo Nia is a no-frills ereader aimed at those who want a Kindle alternative. It’s marginally more expensive than the current 10th-generation Amazon Kindle, but the Nia boasts a better 6-inch 212ppi screen.",
    "However, there doesn’t seem to be anything new about Kobo’s latest entry-level ereader. In fact it appears to be physically identical to the Tolino Page 2 (which was released in 2019 and is only available in some markets). This shouldn’t be very surprising as Rakuten, the makers of the Kobo range, bought Tolina back in 2017.",
    "The Nia also shares plenty of similarities with the now-discontinued Kobo Aura, the company’s previous entry-level ereader. They both have the same screen resolution of 1024x758 and screen size of six inches. The display advantage the Nia has over its older sibling is that it uses the latest E Ink Carta technology that makes the screen more responsive and sharper than the Aura. The screen resolution is also a boost over the current Amazon Kindle (2019) model, whose 6-inch E Ink display is just 167ppi.",
    "But where the Kobo Aura had just 4GB of internal memory, the new Nia boasts 8GB of storage, putting it on par with the rest of the current Kobo ereaders, like the Clara HD, Aura One, Libra H2O and Forma. However, the Aura had a microSD slot to expand storage, which is not an option on any current Kobo or Amazon device.",
    "Thanks to a newer processor (1GHz i.MX 6 CPU) and a more streamlined interface than before, the Nia is definitely a far superior ereader to what the Aura was, and can give the Kindle a run for its money.",
    "Alongside a shared screen size, both the Nia and the Kindle lack waterproofing, and both boast front-lit displays. Kobo’s patented ComfortLight technology makes its way to the Nia, meaning you can easily adjust the brightness of the front light by just swiping up or down the left edge of the screen for a more comfortable reading experience at night. However, unlike the Clara HD and the more premium Kobo ereaders, there’s no blue-light filter on the Nia (or the Kindle), meaning the hue of the light cannot be adjusted to warmer tones at night.",
    "Like all other Kobo ereaders, the Nia comes with OverDrive support in many countries, so borrowing ebooks from a public library is seamless. And you can switch from reading on the device to the Kobo app on your smartphone or tablet (in case you’ve left the house without your ereader) without losing your place.",
    "The Nia might not have Bluetooth like the Kindle (used for the VoiceView feature, a text-to-speech screen reader, as well as for audiobooks), but it offers wider file support and the ability to sideload different fonts, including Amazon’s own Bookerly or Ember. We’re also a little partial to Kobo’s more streamlined interface.",
    "All in all, Kobo’s new Nia is a very compelling alternative to the Kindle, particularly for anyone who’s not keen on getting locked into Amazon’s ecosystem.",
    "Compared to Amazon’s Kindle range, Kobo’s ereaders have always been a tad more expensive and the Nia is no exception. At $99.99 / £89.99 / AU$149.95 / €99.99 apiece (with the sleep cover sold separately), the Kobo Nia is quite affordable, although you can get the latest generation Kindle for just $89.99 / £69.99 / AU$139.",
    "However, the Kobo Clara HD, which boasts a higher resolution 300ppi 6-inch screen and a blue-light filter, costs a little more – available for $129 / £109 / AU$179 – and does seem to be the obvious choice if you’ve got the extra cash.",
    "The Nia is available to buy now directly from Kobo or from select retailers in the US, UK, Australia, New Zealand, Canada and some European countries.",
    "The Kobo Nia doesn’t bring anything new to the table in terms of design. It looks remarkably like the older Aura, the newer Clara HD and Amazon’s Kindle. In fact, it’s practically identical to Rakuten’s Tolino Page 2, with the exception of the branding on the lower bezel. The Kobo brand name is etched into the plastic of the chassis and that’s the only design embellishment on the top surface.",
    "The underside, like the Clara HD, bears the Rakuten branding on the top right corner of the housing, while most of the rear surface is textured that makes the Nia feel a lot more secure in the hand than the Amazon Kindle (which has a smooth finish on the rear).",
    "The only button on the Nia is on the bottom edge of the device and serves as both the sleep and the power button. Beside it is a microUSB charging port that, today, does seem antiquated when USB-C is fast becoming standard.",
    "The Nia weighs almost as much as the Kindle (172g compared to the Kindle’s 174g) but is slightly heavier than the Clara HD (which weighs 166g), and shares similar dimensions to both older ereaders, making it a very portable device that easily slips into any bag.",
    "But where the Nia outshines the Kindle is screen resolution. The Nia’s 6-inch display has a resolution of 1024x758 (translating to 212ppi) as opposed to the Kindle’s 800x600 pixels (or 167ppi). While that doesn’t match the Clara HD’s 300ppi screen, the Nia’s display is sharper than the Kindle.",
    "In some markets, a 4GB capacity Kindle is still available, although the Nia only comes in one flavour – 8GB internal storage – that’s twice the capacity of the Kobo Aura it’s replacing.",
    "And that’s about where its advantages over the Kindle stop. Many of the other factors are on par with its Amazon competition – there’s no waterproofing or blue-light filter in either, for instance – but the Kindle does have Bluetooth support that the Kobo lacks.",
    "So which cheap ereader you decide to go for will depend on other factors, like user interface, your preference for Amazon’s Kindle Store or whether you’d like to borrow ebooks from your local public library.",
    "Kobo has previously not divulged battery specifications for its entry-level ereaders; instead the company has only claimed that you’ll get weeks of reading from a single charge (depending on use). This time, though, Kobo has specified that there’s a 1,000mAh battery under the hood of the Nia.",
    "It’s hard to quantify exactly how long a single charge will last you as it depends on how long you read each day, what brightness your screen is set at and how long you spend browsing the Kobo Store on the device.",
    "During our time testing the new ereader, we had the device set at 25% brightness, had Wi-Fi switched off most of the time, and read for about an hour and a half each day, and only managed to drain the battery by about 20% by the end of a week. That means you should be able to get up to four weeks of use per full charge if you read for a couple of hours every day with Wi-Fi on at all times.",
    "The Nia’s screen is quite responsive, on par with the Clara HD but a touch slower than the Libra H2O. Things like text selection for dictionary look-up (or highlighting and note-taking) are less hit-and-miss than on the Kindle or the older Kobo Aura range, with markers falling accurately where your finger touches. Moving those same markers around is also easy. However, we found that you need to be very precise where you place your finger while typing (either a Wi-Fi password or in the search bar) as even the slightest shift to the left or right would select the adjacent key even though they’re all well spaced out on the 6-inch screen.",
    "Kobo has been progressively improving its user interface and, we have to admit, has made it a lot more streamlined than the clunky UX you’ll find on any of the Kindles. The interface is easy to understand and very intuitive, offering excellent organization even for books that weren’t purchased directly from the Kobo Store. This is something you can’t do on a Kindle as only books purchased from the Kindle Store can be organized into folders.",
    "The latest Kobo OS updates came last year when the Libra H2O launched in September, adding a new ebook navigation system that uses a slider and shows you a preview of the selected page instead of taking you there directly. This, of course, has made its way to the Nia and it’s good to see it hasn’t come at the cost of the ‘rapid page turn’ engine – which allows you to quickly move forward in an ebook by holding down on the bottom-left corner of the screen – that was introduced with the Clara HD.",
    "Even adjusting screen brightness is simple on the Nia – all you have to do is slide a finger up or down the left edge of the display to increase or decrease the brightness. You can, of course, adjust brightness by using the slider presented when tapping on the ‘light’ icon on the top toolbar but this way allows you to continue reading while you make adjustments.",
    "Another advantage of using a Kobo device is the ability to sideload fonts. The Nia comes with 12 preloaded fonts, but it’s easy enough to add more by just downloading the ones you want to your computer and transferring them to the Kobo’s fonts folder when the device is plugged in via the microUSB cable.",
    "Moreover, all Kobo devices offer better file support than a Kindle. Whether you want to read comics, look at images or read text files, you’ll be able to view EPUB, MOBI, PDF, PNG, JPG, GIF, BMP, TIFF, TXT, HTML, CBR and CBZ files on the Nia.",
    "Kobo’s partnership with OverDrive means users in supported countries will be able to borrow ebooks from their local public library, thus saving money on buying new reads. There’s also support for Pocket – a website and browser plugin that lets you save articles for reading later – as well Dropbox integration that allows you to transfer books wirelessly if you happen to have your library saved to the cloud.",
    "Amazon’s Kindle Store is unrivaled, with way more books available as compared to the Kobo Store. That said, there are over six million books available on Kobo right now, which includes practically all top-selling titles. What keeps the Kindle Store a step ahead for readers is Amazon’s self-publishing option that ties authors down to the e-commerce giant’s Kindle platform.",
    "Moreover, titles on the Kobo Store can cost more as compared to the Kindle Store, although Kobo allows you to earn what it calls Super Points with each purchase. Once you’ve accumulated a sufficient amount of points, you can use them to buy ebooks on the Kobo Store. However, these points have an expiration date and must be used up within a certain period.",
    "Audiobooks are also available on the Kobo Store but, unlike the current Kindles, none of Kobo’s ereaders have audiobook support.",
    "First reviewed: July 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Kobo Nia price and availability",
    "12": "Design and display",
    "20": "Battery life",
    "23": "Reading experience",
    "30": "Kobo Store",
    "33": "Don't buy it if"
  },
  "links": {
    "Amazon Kindle": "https://www.techradar.com/reviews/amazon-kindle-review",
    "Clara HD": "https://www.techradar.com/reviews/kobo-clara-hd-review",
    "Aura One": "https://www.techradar.com/reviews/kobo-aura-one-review",
    "Libra H2O": "https://www.techradar.com/reviews/kobo-libra-h2o",
    "Forma": "https://www.techradar.com/reviews/kobo-forma-review"
  }
}