{
  "source": "https://www.techradar.com/reviews/mesa-3-rugged-tablet",
  "title": "Mesa 3 Rugged Tablet review",
  "category": "tablets",
  "updated": "2020-08-25T10:18:54Z",
  "author": "mark-pickavance",
  "summary": "A tablet PC that shrugs at abuse",
  "verdict": "It's durable and has an impressive battery life, but lacks the performance to do much more than basic office tasks and data collection. For the specification it is also eye-wateringly expensive.",
  "pros": [
    "Super-tough",
    "Hot swap batteries",
    "Plenty of customisations"
  ],
  "cons": [
    "Small screen",
    "8MP and 2.1MP cameras",
    "Windows 10",
    "Expensive"
  ],
  "article": [
    "Juniper Systems, based in Utah, makes a wide range of computer hardware designed for harsh environments common in the industrial, survey and logistical sectors.",
    "Of these devices, the Mesa tablets have a notable reputation for being ultra-rugged platforms that can handle a long working day in the sun, rain, or whatever extreme climate the owner finds themselves.",
    "Joining the popular Mesa 2, the new Mesa 3 offers either Windows or Android OS, and are ideal for data collection with a wide range of accessories than include pistol grips, vehicle mounting kits, and even survey pole mounts.",
    "This might be a truly go-anywhere platform, but is it worth what Juniper Systems is asking for it?",
    "With the Mesa 3, Juniper Systems has taken a very different approach to robust tablets that we’ve previously seen from other makers.",
    "It’s very thick, though the curved sides make it reasonably comfortable to hold, and there are solid connection points at each corner that can be used either for an included hand strap or body harness.",
    "On the rear are three threaded inserts, enabling the Mesa 3 to be properly connected to a support frame in a vehicle or permanent location.",
    "First impressions are of a chunky, and a little bit heavy 7-inch Windows 10 tablet with an inbuilt stylus with a seven-button function strip on the right-hand vertical edge.",
    "In this strip are the power button, a cursor cluster, Windows key, return and three user-programmable functions P1, P2 and P3.",
    "The case is a two-tone orange and grey design of glass-reinforced plastic that is rated by Juniper to handle multiple drops from four feet on to concrete, and the screen is protected by chemically-strengthened Dragontrail High Ion-Exchange (HIE) cover glass.",
    "We must give Juniper Systems some credit in respect of the robustness specification because most rugged hardware makers throw the MIL-STD-810G tag in their promotional material without actually attempting to outline which parts of this military definition they used to test their hardware. Where all the tests that the Mesa 3 went through are documented, and they put it through the full gamut of temperature, pressure, humidity, rain, immersion, sand and dust, vibration and shock tests.",
    "In short, this is probably the most robust Windows PC we’ve ever covered.",
    "As part of the strategy to keep unwanted things out of the Mesa 3, the designers limited the external ports to a single USB 3.1 Gen 1 (Type-A), the power input and a 3.5mm audio jack.",
    "If you want more ports, they also include a docking connector that with an additional cradle can charge the device, while adding USB 2.0, HDMI and ethernet.",
    "But the standout feature of this design is that you can open up the back and gain access to a removable 43.2 Whr Li-Ion battery. This ability could be a less useful feature if it wasn’t for another internal 21.6 Whr battery, allowing the bigger battery to be swapped without shutting the system down.",
    "With extra batteries to hand, it should be possible to extend the operational time of this device to multiple days, if not weeks.",
    "Hidden under the battery is a Micro SD card slot and on our review hardware another tray for a Nano-SIM, designed to give LTE connectivity.",
    "Overall, the Mesa 3 is remarkably well constructed and finished, and some considerable thought has gone into making it resistant to accidental abuse and the rigours of an unforgiving working environment.",
    "What’s critical to understand about the Mesa 3 is that there are many options on this hardware given the particular needs of the customer.",
    "These include the GEO model, focused on high the GPS/GNSS accuracy needed for surveying, a Barcode reading model, a UHF RFID capable version, and Juniper Systems will build unique customisation on request.",
    "Our review model was a GEO model, but the internal processor and memory are consistent across all the variants.",
    "At the core of this computer is the underwhelming Intel Mobile Pentium N4020 that offers four cores and four threads. On a desktop system, four cores is more than enough power, but here at 1.1GHz (2.5GHz Turbo mode on a single core) it doesn’t take an exceptionally challenging task to occupy it fully.",
    "Where 8GB of LPDDDR4 memory is more than enough for most tasks, the internal 128GB ECC storage looks sparse once Windows 10 has consumed more than half the capacity with its installation and recovery files.",
    "As a customer option, the storage capacity can be expanded to 256GB, and there is an internal Micro SD card slot. Using either or both of these might be necessary if you need to capture plenty of data between each network access.",
    "There are front and rear cameras, and neither is especially impressive. The rear camera is quoted as 8MP, but can only take 5.8MP images. And, it can only record video in 1080p at 30fps. The front-facing camera is 2.1MP and is only useful for basic facetime.",
    "Both have digital image stabilisation, but we didn’t notice a huge difference when using it.",
    "The last part of this hardware we wish to discuss is the 7” screen that has a WXGA (1280 x 800) resolution. The pixel density isn’t exceptionally high, but with such a relatively small display its practical for general use, if you set the Windows 10 display scaling correctly.",
    "It's also bright and colourful, even in sunlight for those that work outdoors.",
    "Our only reservations about it are the touch sensor that is defined as a capacitive multi-touch interface for use with gloves, small tip stylus, and in wet conditions.",
    "Except it regularly ignored our fingertips in testing, so much that we resorted to using the stylus to get positive responses. Initially, we assumed that this was a problem with the capacitive sensor, but we eventually concluded that it is likely that sensor sees the finger, it’s the computer that fails to act on that stimulus.",
    "The likely culprit is the size of interface elements in Windows 10, and how the scale of a fingertip dwarfs them. Switching to Windows 10 tablet mode helps, but the only proper answer is to use the stylus to avoid frustration.",
    "Some of the numbers in our benchmarks are so small that we repeated the test assuming that we’d had some erroneous errors or Windows update had thrown its typical spanner in the works. Neither of these excuses is valid, as the hardware at the core of the Mesa 3 is a mobile Pentium quad-core CPU that lives to consume 6 watts of power, and sacrifices everything else to achieve that objective.",
    "To put this in perspective, on the 3DMark tests this device was firmly in the bottom 1% of all tests performed, and it even managed to turn the normally undemanding Sky Diver test into a veritable slideshow.",
    "If there is a glimmer of light at the end of this dark performance tunnel, it is the battery performance. Although given the mAh available to it, we guess that the Android version of this machine with an ARM SoC might last substantially longer than the Windows model.",
    "Whatever that truth, this model managed an amazing 9 hours and 39 minutes using both its batteries when running the PCMark10 Battery test in Office mode.",
    "As that test is continuous operation, we’d estimate that this machine would, in the normal pattern of usage, almost certainly last two full working days for those that work 8 hours shifts.",
    "In short, if you need extended battery life then get the Mesa 3 and some additional batteries, and if you want to compute or design in 3D, then choose something else.",
    "With the starting price of the Mesa 3 Tablet running Windows 10 starting at $2375, the number of competitors in this price range is limited.",
    "Two that stand out as direct opposition are the Dell Latitude 7212 and the Panasonic Toughpad FZ G1, as they both offer Windows 10 on Intel hardware in a rugged tablet format.",
    "The Dell Latitude 7212 Rugged Extreme Tablet Laptop has an 11.6inch FHD (1920X1080) Touchscreen, Intel Core 7th Gen i5-7300 and starts at around $1,900. A typical model with an Intel i7-8650U CPU (Quad-Core, 8M Cache, 1.9GHz,15W, vPro), 256 GB SSD, 16 GB LPDDR3 Memory and 4G LTE, is around $2,719 making it more expensive than the Mesa 3, but with a better performance specification.",
    "For around $2,000 the Panasonic Toughpad FZ G1 has a 10.1” screen, Intel Core i5-7300U vPro Processor, 256GB SSD, 8GB of RAM, 11-hour battery life and hot-swappable batteries. More performance for less money. And, the FZ G1 also has a wide selection of optional accessories, including RFID, a 2D Barcode Reader, Dual Lock Smart Card Reader and a serial port.",
    "With the Mesa 3, there needs to be an acceptance that the cost of this device is at complete odds with the hardware inside it. Because many computers that attach to the rear of monitors have similar internal equipment to this system, and those cost a tiny fraction of the Mesa 3 asking price.",
    "The developments of this Mesa 3 was clearly focused on battery life rather than performance, to the determent of almost everything else. In this configuration, the designers managed great battery life, but only by providing vast amounts of battery capacity.",
    "If it is planning a Mesa 4, we’d strongly advise its designers to look at an AMD APU platform, since Intel is still working on 14nm chip fabrication in this Pentium, and AMD is sampling 5nm.",
    "With such modest performance under the hood, what makes the Mesa 3 still relevant?",
    "There are some niches in the industrial sector where the raw performance and sophistication of the hardware is much less important. And, what the Mesa 3 delivers is a massively hardened exterior and alongside less impressive insides, and a gargantuan battery.",
    "If that’s of interest, and you’re not put off by the excessive price tag, then this machine might have a place.",
    "But we've massive reservations about Windows as a tablet operating system since the Microsoft Store is a disappointing collection when compared with that of Google or Apple.",
    "The advantage of being able to run Windows desktop applications is undermined by the challenges that using them on such a small screen and with fingers represents. It can be made to work, but it will require some adaptation on the part of the user.",
    "Even if they get over those hurdles, don’t expect this tablet to be as remotely responsive as an iPad or suitable for processing data it has captured in any substantial ways."
  ],
  "headers": {
    "4": "Design",
    "18": "Hardware",
    "31": "Performance and in use",
    "37": "Competition",
    "41": "Final verdict"
  },
  "links": {}
}