{
  "source": "https://www.techradar.com/reviews/frostvpn",
  "title": "FrostVPN review",
  "category": "computing",
  "updated": "2021-01-21T11:33:35Z",
  "author": "sead-fadilpasic",
  "summary": "Affordable VPN with low speeds and mediocre capabilities",
  "verdict": "FrostVPN is a VPN provider that fully justifies the saying “you get what you pay for”. It may be exceptionally cheap but it seems it has made some compromises to make this pricing model possible. The compromises include low download speeds, a lack of ability to unblock Netflix or BBC iPlayer, non-existence of mobile apps, as well as a small number of servers.",
  "pros": [
    "Very budget-friendly",
    "Simple desktop apps",
    "Built-in speed test",
    "Supports torrenting"
  ],
  "cons": [
    "Poor speeds",
    "Doesn’t unblock Netflix, BBC iPlayer",
    "No mobile clients",
    "Server network is a bit small"
  ],
  "article": [
    "FrostVPN is a provider of virtual private network (VPN) services that aims to offer “premium VPN access at an affordable price”. We analyzed and tested its platform to see whether the claims of an “unrestricted, unfiltered, secure VPN access” were true and discovered that they were, but we found some disadvantages as well.",
    "This VPN has some of the lowest prices we’ve seen in the industry, including for the monthly subscription that is typically the priciest option on the table. FrostVPN’s monthly plan costs $5.99/month, followed by the 3-month option at $3.99/month (a 35% discount), and the annual subscription at $2.99/month (a 50% discount).",
    "There’s no free trial, but all new FrostVPN orders are covered with a 3-day money-back guarantee unless you have used more than 5GB of bandwidth or exceeded 25 sessions (whichever comes first). This may sound a bit strict, but we found it was enough to test the platform’s capabilities. We tested the money-back guarantee and were refunded quickly, no questions asked.",
    "Under one account, users can protect up to 5 devices at the same time. Accepted payment methods include credit/debit cards and PayPal, which is a bit restricting considering many other providers also support cryptocurrencies, Alipay, and other forms of payment.",
    "FrostVPN is a far cry from today’s VPN giants like ExpressVPN, NordVPN, Surfshark, or CyberGhost, all of which give out an impression of much more capable solutions, almost at a first glance. They may be more expensive, but what you’re getting for the price beats FrostVPN’s offer by a long shot in many areas - speeds, availability of geo-restricted content, native apps, number of servers, customer support, as well as their physical location.",
    "Although being able to unblock streaming services like Netflix or BBC iPlayer has become one of the most desirable features in a VPN, not all providers are successful in this effort. FrostVPN is one of those less successful platforms.",
    "The provider is headquartered in the USA and is currently operating 130+ servers in 44 countries, including Chile, Iceland, Israel, Latvia, New Zealand, South Africa, Turkey, and more.",
    "FrostVPN’s apps have a handy built-in speed test that allows you to choose the best server at the moment for your physical location.",
    "This VPN vendor allows P2P traffic, which is interesting considering the location of its headquarters (the US). To protect your privacy during browsing, torrenting, and other (allowed) activities, it deploys PPTP, IPSec, and OpenVPN (TCP/UDP) connection protocols. There’s no information on what encryption is used and we’re still waiting for a response from the customer support.",
    "Its Privacy Policy has a paragraph devoted to VPN logging, where we are told that “FrostVPN does not monitor, record or store logs for any VPN user” nor does it “log or store web traffic data including websites visited, files downloaded, etc.”",
    "Admittedly, it does state that it logs “time, date and location VPN connection was made” in order to protect itself from “abusive users, spammers and crimes” but that “this information is cycled every 24 hours”. We are also assured that all of its servers “utilize shared public IP address, which does not allow us to pinpoint a single activity to a single user.” The provider also claims it doesn’t “give your personal information to any third parties or cooperate with any requests for information unless ordered by a court of competent jurisdiction”.",
    "Although this all sounds reassuring, we would love to see it independently verified by a third-party audit, as some of the more famous VPN services have already done.",
    "The provider has no other native clients except for Windows and Mac, but it supports manual installation and use on Android, iOS, and Linux devices, as well as on routers and Synology NAS.",
    "Manual installation is also supported on Windows and Mac, should you prefer that road instead of the native apps. The installation is possible using third-party software (e.g. OpenVPN, TunnelBlick, etc.), device’s in-built VPNs, and configuration files provided on the website.",
    "The manual installation instructions are available in the provider’s knowledgebase, which isn’t a very large collection of material, but it does answer some basic questions. If you can’t find an adequate answer on the website, you can try getting in touch with customer support directly, by sending an email or by opening a ticket in your client area. Unfortunately, there’s no live chat option.",
    "We found FrostVPN very easy to use, at least on desktop devices for which it has native clients. However, connecting for the first time took quite some time as the app refused to acknowledge our account or list any available servers when we first opened it.",
    "When we finally managed to connect, we used a 50Mbps testing connection to check out this provider’s performance. Unfortunately, we didn’t see any impressive results. The first server we tested was in Amsterdam, the Netherlands, which is relatively near our physical location as it is on the same continent as us. However, regardless of the proximity, it hailed a very slow 6.1Mbps.",
    "The next server we put to the test was across the Atlantic ocean - in Washington, DC - and it also hailed poor results, although not much slower than in Europe - only 4Mbps. Finally, it was time for a location much further away - Tokyo, Japan. Expectedly, it did worse, with a miserable 620Kbps, after the speed test refused to even start the first time.",
    "FrostVPN is far from an impressive VPN provider such as ExpressVPN. Its speeds are low, it doesn’t unblock today’s popular VOD services, it doesn’t have a large server network nor clients for platforms that aren’t Windows or Mac. It is, however, very inexpensive, allows P2P traffic, and its existing clients are simple and boast a built-in speed test."
  ],
  "headers": {
    "1": "Price",
    "4": "Alternatives",
    "5": "Streaming",
    "6": "About the company",
    "8": "Privacy and encryption",
    "12": "Support",
    "15": "Speed and experience",
    "18": "Verdict"
  },
  "links": {
    "FrostVPN": "https://www.frostvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "Privacy Policy": "https://www.frostvpn.com/clients/privacy-policy.htm",
    "NAS": "https://www.techradar.com/best/best-nas-and-media-server-distros",
    "knowledgebase": "https://www.frostvpn.com/clients/knowledgebase.php",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-3124345431176949000"
  }
}