{
  "source": "https://www.techradar.com/reviews/makemkv",
  "title": "MakeMKV review",
  "category": "computing",
  "updated": "2021-11-23T07:35:40Z",
  "author": "cat-ellis",
  "summary": "DVD and Blu-ray ripping make easy",
  "verdict": "It's not flashy, but MakeMKV delivers where it matters most. This DVD and Blu-ray ripper is thoughtfully designed, and makes backing up your movie collection as fast and straightforward as possible.",
  "pros": [
    "Simple to use",
    "Completely free (for now)",
    "Rips encrypted discs"
  ],
  "cons": [
    "No hardware acceleration"
  ],
  "article": [
    "MakeMKV is a refreshingly frill-free DVD ripper. It’s available for Windows, macOS and Linux, and is completely free to use while it’s in public beta. That’s likely to change with the final release (the developer suggests that Blu-ray decryption may well become a paid-for feature), but for the time being there are no restrictions and the ability to read DVDs will always remain free.",
    "Streaming is rapidly overtaking DVDs and Blu-rays as the preferred way of watching movies and TV from a comfy couch, but many of us have expansive collections of physical discs gathering dust on shelves. It’d be so much easier to watch them",
    "Unfortunately, Windows doesn’t come with its own dedicated DVD ripping tool, so you’ll need to look elsewhere for a tool to do the job. That’s where Make MKV comes in. It’s not flashy and certainly isn’t packed with options, but it gets the job done with the minimum of fuss.",
    "First, however, a word of warning: copyright laws vary greatly between countries, and even backing up your physical media for private use is illegal in some territories. Make sure you check the law where you live before using a DVD ripper, and don’t use them to rip rented discs, or to make copies to sell.",
    "It might look simple, but MakeMKV can handle both DVDs and Blu-ray discs with aplomb, and is packed with thoughtful touches to make your life easier when backing up your movies.",
    "Although it can’t rip all encrypted discs, it can handle Blu-rays and DVDs protected with AACS and BD+ encryption without any additional software.",
    "All metadata (such as track titles, chapter information and track language) is kept intact when your discs are ripped, and conversion is pretty speedy. MakeMKV doesn’t benefit from the GPU acceleration of tools like WinX DVD Ripper Platinum, but the speed is perfectly respectable for everyday tasks.",
    "Just pop your disc into your computer, allow MakeMKV to analyze it, select which tracks to rip and where to save them, and the software will handle the rest."
  ],
  "headers": {
    "4": "User experience",
    "8": "You might also like"
  },
  "links": {
    "MakeMKV": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3215193048948835300&xs=1&url=http%3A%2F%2Fmakemkv.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmakemkv",
    "DVD ripper": "https://www.techradar.com/news/the-best-free-dvd-ripper",
    "Windows": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "TV": "https://www.techradar.com/news/best-tv"
  }
}