{
  "source": "https://www.techradar.com/reviews/dentrix-ascend",
  "title": "Dentrix Ascend review",
  "category": "computing",
  "updated": "2020-04-16T18:00:10Z",
  "author": "jonas-p-demuro",
  "summary": "Cloud dental software designed for your practice",
  "verdict": "Dentrix Ascend offers plenty but the lack of pricing information and missing features frustrate some users.",
  "pros": [
    "No long term commitments",
    "Toll free phone support",
    "Popular choice"
  ],
  "cons": [
    "Opaque pricing",
    "Limited hours and weekdays only for support",
    "No free trial",
    "Lack of mobile apps"
  ],
  "article": [
    "Dentrix Ascend is a cloud-based dental practice management tool, by Henry Schein One which is based in American Fork, Utah in the tech heavy, mountainous region known as the ‘Silicon Slopes.’ It is sold as a subscription, as a SaaS (software as a service), that provides support for both the front and back office, along with clinical tools for practice.",
    "The cloud-based architecture is ideal for situations such as a dentist needing to be able to access records when out of the office, or busy, multi-site practices that need to coordinate office hours among several providers based in different locations. This service has about a quarter of the dental market, with around 35,000 users.",
    "A crucial part of a dental practice is the front end of the office, where patients are checked in and out. Having this run smoothly is an excellent start to any well run office. Here Dentrix Ascend provides a strong feature set, as patient check-in gets streamlined, with a single screen that organizes all the crucial patient information in one place, and further detail on this information is just a click away. Checkout also is an efficient process, with a Ledger view to help keep patient accounts current. Also, today’s patients don’t want to wait around, and need to be on their way, and Dentrix Ascend can reduce checkout times, and quickly print walkout statements.",
    "Scheduling is another critical activity, and appointments can be easily scheduled and confirmed from the Appointment Book. In this screen, treatment plans can also be entered, and you can also view an entire day of appointments at a glance for what the day coming up will be like. Dentrix Ascend also offers Online Booking, so patients can schedule their own appointments, even with the office closed. Another bonus is that patients will be automatically reminded when it is time to return for a followup appointment making sending out postcard reminders an activity of the past.",
    "Business activities are also supported by Dentrix Ascend. The Insurance Manager can be used for tracking the patient’s insurance plan, and their eligibility; plans can be archived as they expire, and it can keep track of up to ten insurance plans for each patient. Business Metric can also be monitored as Dentrix Ascend can create custom performance reports to give insight into a practice’s financial health. Security is assured as the Location Access Restrictions function enables controlling who has permission by the level of access, including who is allowed to log onto the account remotely.",
    "First off, Dentrix Ascend lacks support for mobile apps, so there is no support for either the iOS, nor Android platforms.",
    "Users complain about a number of shortcomings that are common in their workflow. For example, being able to print out route slips up to three days in advance cannot be done. Also, preauthorizations cannot be sent to a secondary insurer. There is also no new patient intake form online that can collect a patient’s past medical history, forcing offices to resort to a paper form, and scanning the completed document in.",
    "Support for Dentrix Ascend is included as part of the subscription, with no additional cost. The first is phone support, via toll free number, which can be accessed by calling the main number, and hitting ‘Option 2.’ The hours of support are limited to 6:00 AM to 5:00 PM, Mountain Standard Time, and only on weekdays. Curiously, this phone option is not indicated on the Support Page that encourages the second option, email, which we caution is not a HIPAA compliant method of communication.",
    "The site lacks some other support options, such as an online portal, and a chat option. There are also some additional support materials, such as a Resource Center, and multiple online videos including “Accessing Patient Records,” and “Searching for Appointment Openings by Provider.”",
    "Dentrix Ascend gets sold as a monthly subscription. There is no contract, hence no long term commitment, as a “Pay-As-You-Go, Love It or Leave It,” per the company. The website provides an area to input your contact information including name, email, phone number and practice name, for a representative to get in touch. It also notably inquires if the number of practice locations are six or more.",
    "We also appreciate that in addition to no long term contract, Dentrix Ascend does not lock away your practice’s data with the service, thereby forcing you to continue. Rather, it is stated that “Simply send us a request for your information, and we’ll deliver it in a standard format that makes it easy to move to another practice management solution.”",
    "Unfortunately, there is no pricing information on the site. Elsewhere, we found an initial setup cost of $995 (£799), and then $500 (£402) per month for up to 10 users, which would make this a lousy deal for solo practitioners, and a better deal for practices with multiple dentists. There is also no additional charge for billing with electronic claims submissions.",
    "Dentrix Ascend is a popular dental practice management solution for a number of good reasons which include the support that is available via a number of methods, the potential to streamline front end processes like check in and check out, and the custom performance reports that can be run to give direct insight into a practice’s success and areas for improvement. The misses include the lack of a free trial, the opaque pricing, and the limited hours of support. In the end, Dentrix Ascend is a mixed bag, so be sure it offers the features your practice needs before signing up for it."
  ],
  "headers": {
    "2": "Features",
    "5": "Drawbacks",
    "7": "Support",
    "9": "Pricing",
    "12": "Final verdict"
  },
  "links": {
    "Dentrix Ascend": "https://www.dentrixascend.com/",
    "dental practice management": "https://www.techradar.com/best/best-dental-practice-management-software",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "Support Page": "https://www.dentrixascend.com/support",
    "Resource Center": "https://support.dentrixascend.com/hc/en-us"
  }
}