{
  "source": "https://www.techradar.com/reviews/masv",
  "title": "MASV cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T15:52:36Z",
  "author": "mark-pickavance",
  "summary": "MASV offers colossal sharing at a massive price",
  "verdict": "MASV certainly isn't for everyone, but we can't think of too many people that it would actually be for. Its pricing is flexible but potentially very expensive, and while there are a few nice and well-presented touches, you've got a lot of potentially better alternatives.",
  "pros": [
    "Pay-as-you go structure",
    "Create custom portals",
    "Polished app interfaces"
  ],
  "cons": [
    "Can get very pricey",
    "No mobile apps",
    "Security is on you"
  ],
  "article": [
    "MASV (which seems to be short for \"massive\") is more about cloud transfer than cloud storage, but if you think about it, a lot of us use cloud storage primarily for sending files to others – and if that description fits you, then you might find MASV is worth investigating.",
    "Another benefit of choosing MASV is the flexible pricing, as you pay by the gigabyte. It's a pay-as-you-go system that means you're not locked into a subscription, and you only have to pay for what you use. Built primarily for creatives, could MASV work for your sector?",
    "MASV focuses on sharing large video files between businesses, but you can really use the file transfer service for anything you like. Both web and desktop apps are available (mobile apps are coming soon), so take your pick – you just drop your files into your browser or desktop client and the recipient picks it up at the other end. It's certainly simple, and doesn't require the other party to sign up for another account or install another app.",
    "If you like you can turn the scenario around the other way, and have people send files to you while you pick up the cost. They get given a web portal they can use, and you pay for the cost of the file transfer. Transfers can be downloaded by a maximum of 30 (invited) recipients, and password-protected, and time-limited (all files uploaded to MASV expire automatically after ten days, unless you pay extra).",
    "It's easy to operate, and it's also speedy and reliable, two areas where MASV promises to be ahead of the competition. There are no limits on file transfer sizes, and the technology that MASV uses is smart enough to enable downloads to resume from particular points, if they get broken off for whatever reason. Assuming you can live with the parameters of MASV, it does have plenty to recommend it.",
    "MASV scores highly on integrations with other apps as well, plugging straight into platforms like Slack and apps like Adobe Premiere Pro, plus other cloud storage services such as Dropbox, Google Drive and Backblaze. It even offers an API, if you and your company want to build a bespoke software solution around it.",
    "Both on the web and on the desktop, MASV presents you with a clean and elegant interface that you'll have no problems getting around. Files and folders can be added through drag and drop or by picking them out from your computer, and you can then customize your shares as required – you can send recipients emails from MASV, or generate a custom URL that can then be shared around to everyone who needs the download.",
    "You can customise the sharing interface that your customers will encounter when you send them a link, giving the impression that they're using a branded facility, if that's important to you. These individual portals can each have their own branding if required, and you can monitor access to them easily using the administrative web interface.",
    "Meanwhile, being able to keep track of which files have been sent where (and when) works really well and is easy to access – it's one of the biggest strengths of MASV, and given that you're charged based on data downloads, being able to see this activity is critical. There are even some user management features for teams thrown in as well.",
    "MASV promises up to 1Gbps upload and download speeds using the service, but we're sorry to report that our home broadband connection didn't allow us to get anywhere near that. What we can say is that it seemed to make the most of the bandwidth available, and considering how many professional customers MASV appears to have, it looks like a service you can rely on in terms of speed and stability.",
    "Besides giving you password protection for your files, they're encrypted both in the transfer and at rest: MASV runs on the back-end technology provided by Amazon Web Services, so we're talking about some of the best security measures in the industry when it comes to keeping your data safe.",
    "Much of the security is down to you though – it's on you to keep the passwords to your accounts and to your packages safe from other people, and doubly so as you're being charged by the download. There's no two-factor authentication to offer an extra layer of security on top of your user account either.",
    "The MASV pricing structure is actually very straightforward: $0.25 (about £0.20) for every gigabyte of data that gets downloaded from your account. The good news is that if you upload a file that no one touches, you don't pay anything; the bad news is that a 1TB file will cost you $250 (about £195) even if just one person downloads it. That's an awful lot more than a standard 1TB cloud storage package.",
    "You can pay extra, to the tune of $0.10 (about £0.08) per gigabyte per month, to keep your data in the cloud for longer than 10 days. Keeping that same 1TB of data in the cloud for 180 days, if it was downloaded by one person, would set you back $816.67 (about £640). This is definitely a solution that's just for those with bigger budgets to work with.",
    "MASV is a bit of a head-scratcher because of that high price, and unless you specifically need fast, hassle-free file transfers for very large files – and have the money to be able to pay for it – it's hard to see exactly why you'd pick this service over any standard cloud storage service. Okay, the pricing is flexible with no monthly subscription, but it's high.",
    "The way that you can create customized upload and download portals for your clients might appeal to some, and you do get some very useful tools for tracking how often your files are getting downloaded, but on the whole we'd say that MASV is only going to end up with niche appeal. The interface is lovely and slick though, at least."
  ],
  "headers": {
    "2": "MASV features",
    "6": "MASV interface",
    "10": "MASV security",
    "12": "MASV pricing",
    "14": "MASV verdict"
  },
  "links": {
    "MASV": "https://massive.io/",
    "cloud transfer": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Backblaze": "https://www.techradar.com/reviews/backblaze"
  }
}