{
  "source": "https://www.techradar.com/reviews/e-trends-fly",
  "title": "E-Trends Fly review",
  "category": "appliances",
  "updated": "2021-07-15T11:52:30Z",
  "author": "rob-clymo",
  "summary": "The E-Trends Fly is a foldable and portable budget electric bike",
  "verdict": "With its compact, folding appeal the little E-Trends Fly is ideal for commuting or days out. Adding on the decent assistance you get from the battery and motor combination makes it even more tempting, although the quality of some components suffers as a result of its lower asking price.",
  "pros": [
    "Compact and folds up",
    "Respectable electric power",
    "Basic but comfy enough"
  ],
  "cons": [
    "Looks a little cheap",
    "Questionmark over durability",
    "Feels quite heavy"
  ],
  "article": [
    "With many of us re-evaluating our daily commutes and, in many cases, dispensing with them altogether the release of the E-Trends Fly electric bike might seem at odds with the current trend for working from home. However, e-bikes are increasingly popular and this one is compact, folds up for storage and still gets you down the road with a simple blend of pedal power and battery-powered assistance.",
    "Made in China, and offered at a discount price, the E-Trends Fly does look and indeed ride like a cheaper folding e-bike, but it’s worth considering if you’re a casual cyclist who wants a bike that is quick-ish when it needs to be, and convenient to use as it doesn’t require lots of space to store.",
    "It has an official range of up to 19 miles thanks to a chunky 250w motor and a comfy saddle and ride stance that makes short excursions a breeze. While we’re not sure just how durable an e-bike the E-Trends Fly will prove to be over time there’s no denying the basic appeal of this folding model.",
    "E-Trends Fly was released in October 2020, and is available to buy direct from E-Trends. The launch price was £899 (about $1,200 / AU$1,600) but at the time of writing the e-bike is reduced to £699 (about $3,400 / AU$1,300).",
    "Think of a classic folding bike design and the great British Brompton brand tends to spring to mind. The E-Trends Fly is certainly nowhere near the iconic folding commuter bike in terms of looks or build quality, but it delivers a similar experience for a lot less money compared to their foldaway e-bike.",
    "The design of the E-Trends Fly doesn’t quite flow in the same way though, and from some angles looks more like a compendium of components rather than something that’s grown organically in the mind of a designer. Of course, much of that is to do with the sacrifices that have had to be made to keep the pricing down.",
    "The Fly, with its 16-inch steel frame feels quite heavy too and with the battery in place it is, at 23.5kg, but folded up it’s certainly easy to store with dimensions of 86cm x 33cm x 63cm.",
    "That removable and lockable power pack is vital though as this is a single speed bike, so having the 36V 7.5AH lithium-ion battery on board to provide electric assistance is essential, which feeds power to the 250W rear hub motor.",
    "The Fly is no slouch though, and can accommodate riders weighing up to 120kg. The design is actually quite amenable to different shapes and sizes of rider, thanks to the adjustable handlebars and saddle. The latter is very good on the posterior by the way, and more than capable of keeping you comfy if you manage to cover the full 19-mile range suggested by the bike’s creators.",
    "However, the handlebars feel less reassuring as they’re essentially a straight metal tube with grips at each end, where on one side you’ll find the twist grip power control and battery indicator. On the other side are buttons for the lights and an amusing buzzer-style horn. On the rear of the lower frame a kickstand rounds it out in practical fashion.",
    "Saddling up for the first time, the E-Trends Fly offers an upright riding position, which can be tweaked slightly thanks to the quick release saddle control. It’s certainly easy to get on and off, with the low step-through frame proving handy if you’re running errands or visiting the shops.",
    "Head off on your first jaunt and it’s perhaps the handlebar construction that’ll make you feel slightly cautious as the tubular design looks, rather than is, like the weakest link in the construction chain. As long as you’ve tightened the core folding clamps in the downtube you’ll be fine of course, but it did take a couple of runs around the block to feel fully confident.",
    "There are the small 20-inch wheels to contend with too, which are perfectly serviceable but they remind you that this isn’t really a bike to cover vast distances with. The E-Trends Fly stops well enough though, thanks to front and rear alloy V-brakes, which get the job done without fuss. You also get front and rear mudguards, which are a necessity even on a bike with dinky wheels.",
    "Meanwhile, there are built-in lights front and rear for good measure. E-Trends reckons the Fly is good for power assist up the standard 15mph and it’ll also help you home with your shopping at up to 6km/h in pushing mode",
    "On a related note, there’s a rear pannier included for resting bags and other bits on, which is a neat touch. Given the general weightiness of the Fly we found it necessary to squeeze out the power more frequently than we expected to given the easy-to-ride characteristics of this e-bike. As a result our battery dwindled quite a lot as the speed sensor did its job.",
    "However, E-Trends' estimate of four hours for a full recharge meant that the bike was ready to go the next day and the battery is easily replenished either on or off the bike. It actually seemed to charge quicker than the official figure. The battery container has even got a natty little folding handle on the top for carrying convenience.",
    "Given our feelings on some of the component parts on the Fly, we’re also reassured by the two-year warranty that comes with the bike. We’ll be keen to see how it fares over time, especially where some of the more frequently fiddled with areas of the design come into play, most notably on the clamp screws that let you fold and unfold it.",
    "Overall then the E-Trends Fly is a workmanlike machine, which is a little more comfortable to ride than the design suggests. We haven’t managed 19 miles in one sitting as yet, but as a pop-to-the-shops machine it’s perfectly respectable.",
    "The weight aspect doesn’t make it something you’d want to have to carry too far, but we remember the admittedly lighter Brompton folding e-bike leaving us with the same feeling when we rode that a while back. So that’s one thing the two electric cycles have in common, despite sitting at opposite ends of the pricing spectrum."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and release date",
    "4": "Design",
    "10": "Performance",
    "19": "Don't buy it if"
  },
  "links": {
    "E-Trends Fly": "https://e-trends.co.uk/products/fly?variant=35417817022630",
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "folding e-bike": "https://www.techradar.com/best/best-folding-e-bikes",
    "direct from E-Trends": "https://e-trends.co.uk/products/fly?variant=35417817022630"
  }
}