{
  "source": "https://www.techradar.com/reviews/creatio-crm-review",
  "title": "Creatio CRM review",
  "category": "computing",
  "updated": "2020-10-29T21:27:30Z",
  "author": "daniel-blechynden",
  "summary": "Powerful customer relationship management (CRM) and business process management (BPM) software with industry-leading features",
  "verdict": "Although Creatio is quite expensive, it offers some of the best customer relationship management (CRM) and business process management (BPM) software programs we’ve seen.",
  "pros": [
    "Beginner-friendly dashboard and interface",
    "Comprehensive free trial available",
    "Great email marketing tools"
  ],
  "cons": [
    "Very expensive",
    "Limited social media integrations"
  ],
  "article": [
    "Creatio is a versatile customer relationship management (CRM) and business process management (BPM) program with a range of solutions for businesses of all sizes. Designed to streamline everyday marketing and workflow processes, it comes with an impressive selection of tools and features.",
    "However, Creatio is one of the more expensive management platforms available, and it can be complicated to set up. Additionally, it comes with no social media integrations to speak of.",
    "Creatio offers four different software packages. Unfortunately, some users will have to purchase two or more packages to get the tools they need, which can become very expensive.",
    "On top of this, Creatio’s fine-print states that the minimum purchase volume is $5000 per year, although there is a 14-day, unlimited-licence free trial available.",
    "Sales Creatio",
    "The most popular CRM package, Sales Creatio, comes with a tiered pricing structure. Costs start at just $25 per user per month for a self-hosted Team subscription, increasing to $60 per month for a more advanced Enterprise plan.",
    "Marketing Creatio",
    "Marketing Creatio is designed to help businesses drive more leads and convert more customers. Prices start at $995 per year for a single user with 1000 active contacts and increase rapidly for more users and more contacts.",
    "Service Creatio",
    "If you’re looking for a program to streamline business-client communications, Service Creatio could be a good choice. It costs anywhere between $35 and $60 per user per month, depending on the features you need.",
    "Studio Creatio",
    "Creatio’s final product, Studio Creatio, is slightly different to the other three. Rather than focusing on CRM, it’s designed to streamline business management processes. It offers both a free version and an Enterprise plan which costs $25 per user per month.",
    "Each of Creatio’s four software packages comes with significantly different features. We’ve outlined the most noteworthy things about each below.",
    "Sales Creatio",
    "Sales Creatio comes with a wide range of powerful tools to help you streamline sales processes and drive more conversions. Its out-of-the-box process management features are based on industry best practices. They include predefined lead, order, invoice, quote, and opportunity management strategies.",
    "Additionally, Creatio’s Sales software comes with an attractive management interface that clearly outlines the relationship between marketing campaigns, customer service, and eventual sales. This allows users to make decisions based on real-time performance data.",
    "Marketing Creatio",
    "Like Sales Creatio, Marketing Creatio comes with an impressive selection of out-of-the-box solutions for lead and marketing management. These are designed to help businesses improve their conversion rate, and Creatio’s great reputation suggests that they work.",
    "Additionally, Marketing Creatio comes with comprehensive analytics tools and bulk-management features to help you improve your efficiency.",
    "Service Creatio",
    "Once again, Service Creatio has a selection of predefined processes to help you manage and, where possible, automate customer service. These are based on industry best practices and years of fine tuning.",
    "On top of this, we love Service Creatio’s impressive management dashboard. It allows users to take care of everything from phone, email, live chat, and social network communication in one central hub.",
    "Studio Creatio",
    "Studio Creatio markets itself as a “low code platform” that allows users to build apps and workflow processes without special tech knowledge. It’s designed for those who want to create custom workflow management solutions.",
    "The main things that make Studio Creatio stand out are its comprehensive template library, beginner-friendly interface, and clever AI assistant.",
    "Creatio CRM (Sales, Marketing, and Service) and Creatio BPM (Studio) have quite different management interfaces. We tested all four, and to say we were impressed would be an understatement.",
    "Getting started did take quite a while, but once everything is set up very little tech experience is needed. In addition, you can customize your dashboard to show the main tools and features you need for your business.",
    "Creatio offers a range of support options, including online live chat, phone, and email. Users can also take advantage of the Creatio Academy, which contains extensive documentation and a great selection of training content. On top of this, we found the community forum to be a great resource for more technical problems.",
    "However, we weren’t all that impressed in our test of Creatio’s live chat support. While we were connected to an agent within seconds, they couldn’t answer even the simplest questions about the packages on offer.",
    "Creatio offers powerful CRM and BPM solutions, but it’s quite expensive. If you’re running a small business, it could be worth considering a more affordable alternative.",
    "Two of our favorite Creatio alternatives are Nimble and Zoho CRM. They both offer significantly better value for money and include more powerful social media marketing features.",
    "Each of Creatio’s four platforms is among the best in its field. Although it’s expensive, using a combination of the four programs will almost certainly help you grow your business through better marketing, improved workplace efficiency, and an increased conversion rate.",
    "On top of this, Creatio’s management interface is quite beginner-friendly and easy to navigate once you get the hang of it. Ultimately, if you’re looking for powerful CRM or BPM software, we’d recommend giving the free trial a go to see if it works for you and your business."
  ],
  "headers": {
    "2": "Plans and pricing",
    "12": "Features",
    "25": "Interface an in-use",
    "27": "Support",
    "29": "The competition",
    "31": "Final verdict"
  },
  "links": {
    "customer relationship management": "https://www.techradar.com/best/the-best-crm-software",
    "business process management": "https://www.techradar.com/news/what-is-business-process-management",
    "sales processes": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "email": "https://www.techradar.com/news/best-email-provider",
    "Nimble": "https://www.techradar.com/reviews/nimble",
    "Zoho CRM": "https://www.techradar.com/reviews/zoho-crm-review"
  }
}