{
  "source": "https://www.techradar.com/reviews/dyson-corrale-review",
  "title": "Dyson Corrale review",
  "category": "reviews",
  "updated": "2021-07-16T09:13:40Z",
  "author": "vicky-woollaston",
  "summary": "The Dyson Corrale swaps style for substance at an extortionate price",
  "verdict": "The Dyson Corrale performs like no hair styler we’ve ever used, with an incredible freedom that comes from being cordless. But this precision-engineered performance comes at a price – both figuratively and literally. We could almost forgive its heavy and industrial design for how well it styled and protected our hair, if it was cheaper, but at such a high cost this is a sacrifice we just can’t make.",
  "pros": [
    "High performance and protection",
    "Fast styling speeds",
    "Shiny, smooth and strong hair every time"
  ],
  "cons": [
    "Heavy and unattractive",
    "Expensive"
  ],
  "article": [
    "Since Dyson made a surprise entry into beauty in 2016, with the launch of its Supersonic hair dryer, the British firm has established itself as a market-leader. It now sells two models of the Supersonic, which is one of the best hair dryers we've tested, five versions of its Airwrap styling tool and more recently launched its first flat-iron-style straighteners, the Dyson Corrale.",
    "Getting its name from the word corral, which means to gather things into one place, the Corrale straighteners use so-called “flexing plates” to collect strands of hair together. Small panels along these plates flex in order to apply even pressure across the whole hair segment.",
    "While sensors inside the Corrale regulate the heat of these plates, up to a reported 100 times a second, allowing the straighteners to maintain a constant temperature. Both features are said to reduce the amount of heat needed to straighten your hair, which Dyson claims also reduces the damage such heat styling causes by 50 percent. A bold claim.",
    "Other features include three temperature settings (165℃, 185℃ and 210℃), a cord-free design; a flight-safe mode; a safety latch that keeps the Corrale’s plates closed and out of harm’s way; a magnetic charger; a heat mat that can be used as a carry case and a 4.3-metre cable for when you want to use the Corrale corded. All for the staggering, albeit unsurprising for Dyson, price of £399.99 / $499.99",
    "Given the claims being made by Dyson, and its huge price, we’ve spent the past month putting the Corrale through a series of tests to establish if it’s worth the hefty investment.",
    "Dyson is renowned for two superior technologies, found across its range of vacuums, dryers and fans – the efficiency of its motors and the effectiveness of its batteries. Both the Supersonic and Airwrap get their competitive edge from the former, and the cordless Corrale is hoping to set itself apart by taking advantage of the latter.",
    "Powered by a four-cell Lithium ion battery, the Corrale’s cordless nature makes it highly versatile. Once we’re allowed to leave our houses again, it will undoubtedly become a firm favourite at festivals and on weekends away. It’s a game-changer, and not just in terms of where in, or out, of the house you can use it. Without the restrictions of a cord, you’re free to move the straighteners around your head and style your hair with few limitations.",
    "The trade-off for this versatility, however, is a noticeable increase in weight. At 561g (cordless) – and a staggering 1.03kg with the cable and power pack – the Dyson Corrale is substantially heavier than the 302g GHD Platinum Plus styler. Even when the cable and plug is added to the weight of the GHD model, it still comes in at 100g lighter than the cordless Corrale.",
    "The battery on the Corrale also increases its overall size. A difference shown in the photo above when placed side-by-side with the GHD Platinum Plus.",
    "In addition to its battery, the Corrale gets the rest of its extra heft from the use of an OLED screen on its side, which shows the battery status and the straighteners’ temperature, and three buttons – a power button, two temperature controls and a safety switch that is used to lock, and unlock, the plates. Not to mention the plates themselves, the flexing panels, the circuit boards and sensors that sit beneath them, pulling everything together.",
    "We tested the grey and fuschia model for this review, a colour scheme that is now synonymous with Dyson products, and from a distance it looks attractive. The images on Dyson’s website, and our photos, show the Corrale in an elegant light. Yet this is misleading, and the reality is somewhat different. The harsh metal of the plates – made up of a complex manganese copper alloy designed “to provide the optimum flexibility, strength and thermal conduction” – reminds us of the keys on a Stylophone. They don’t scream precision engineering, instead they look unfinished.",
    "The smooth plastic casing does little to enhance the Corrale’s feel, either. It feels cheap, which is galling considering it’s not. The combination of the metal and plastic together make a weird collection of clicks and creaks as you close the Corrale and pass it around your head. So much so, we kept thinking it would break. This is likely due to the many moving parts but such noises are hugely disconcerting.",
    "In fact, the most elegant part of the whole Corrale setup is the magnetic charging point and the base of its charging station. When not being used, the Corrale can be stored, and charged, via a fuschia pink stand which works effortlessly and looks and feels luxurious. This isn’t the first time Dyson has used magnets in its products – the remote controls for its fans are stored via magnets, as are the attachments on the Supersonic – and there’s something smooth and reassuringly sophisticated about such a simple feature.",
    "On the whole though, for a company known for being so precise and particular about design in the past we feel it’s missed the mark with the Corrale.",
    "What the Corrale lacks in any sort of style it more than makes up for in performance, though. We can barely fault it. Over the past four weeks, we’ve used the Corrale for styling – either straightening, curling or waving – our fine, mid-length hair every morning. It also got a run out on a couple of evenings when we attended a Zoom wedding reception and a virtual pub quiz. Each time, we were consistently impressed by the results.",
    "To put its performance into context we should explain how it differs from its rivals.",
    "Solid plates on traditional straighteners work by clamping your hair together and applying heat to break down hydrogen bonds. This changes its texture, making it mouldable. When hydrogen bonds are broken, natural oils and proteins are also removed and this is why excessive heat dries out your hair, leaving it damaged and prone to breakages. In particular, because the only tension control is managed by how hard you squeeze the plates together, this often leads to too much tension being applied at the delicate ends, causing you to inadvertently pull and snap them.",
    "At first, we believed that the Corrale was performing similarly. During the initial uses, the creaks and clicks of the straighteners were joined by what sounded like our hair breaking. This sound is difficult to describe but anyone who has used straighteners before will know, it’s the rough, high-pitched sound you get when you reach the end of a section of hair and only one or two strands remain between the clamped plates. A sound that is typically accompanied by a pop as the caught ends snap.",
    "Yet rather than breaking our hair, this noise is seemingly to do with how the Corrale protects it.",
    "Instead of clamping hair in one place and forcing it through, like its rivals, the Corrale’s plates flex and move around the hair to provide more tension where it’s needed (the shaft), and less where it’s not (the ends). That’s not to say the Corrale drags the hair either, it just doesn’t slide over it in the way we’re used to.",
    "As a result, the high-pitched noise we were hearing was caused by these flexing plates gathering and straightening single, rogue strands of hair. Instead of snapping them, the Corrale uses its plates to apply even tension before releasing the hair gently at the ends. This helped tame flyaways and create a smoother overall look, with fewer visible, and audible, breakages. A smooth finish that was boosted by the reduction in static caused by the ionising properties of the plates’ tourmaline edges.",
    "The Corrale still uses heat, of course, to mould the hair but because this is combined with greater tension, less heat is required. Fewer oils are stripped out and fewer ends are snapped. What’s more, by pulling the hair together, the Dyson Corrale completes the job much quicker and efficiently than its rivals, reducing exposure to heat even further. We achieved our desired looks with the Corrale on the lowest temperature setting but having the choice of higher options was welcomed, and it makes the Corrale ideal for a wide range of hair types and thicknesses.",
    "Straightening our hair after rough drying typically takes about five minutes, on average, with the GHD Platinum Plus. This dropped to just two minutes with the Corrale. Running the straighteners over our hair after a blow-dry, to smooth flyaways, was equally faster – 30 seconds with the Corrale versus around a minute with the Platinum Plus. This increase in speed almost counteracts the Corrale’s extra weight.",
    "Due to its large size and weight, however, the act of curling and creating waves in our hair was less comfortable. Trying to twist and turn such a hefty appliance hurt our wrists and gave us cramps in our hands, but the results were amazing. The lack of cable was a plus here, though, and it gave us more freedom of movement.",
    "If we were nitpicking, it’s a little tedious to have to manually select a temperature each time – we’d like the Corrale to remember our last choice – but this is a very minor complaint.",
    "It’s difficult to quantify Dyson’s 50 percent less damage claim, but anecdotally our hair has never looked so good and seemed in such great condition. This is despite us styling it much more regularly than we would do normally in the pursuit of fully testing it. It feels softer and smoother to the touch and we’re seeing fewer snapped ends falling on our shoulders and legs, compared to using the GHD mode.",
    "One of the reasons why we believe these results are so great is because the Corrale doesn’t force hair into submission. Given the choice, and the time, we’d always opt for blow drying our hair to create bounce and volume; something straightening largely gets rid of. Even running traditional straighteners over blow-dried hair, to add a level of smoothness, can cause it to drop and become flat. This isn’t the case the Corrale. It gives us the smooth shine we’re after without impacting on the bounce.",
    "Dyson claims the battery on the Corrale will run for 30 minutes at a time. We regularly achieved closer to 40 minutes meaning we can get a week’s worth of use out of it before it needs charging again. This will be perfect for a weekend trip or similar.",
    "Plus, by removing the flight-safe connector – positioned on the side of the Corrale – you’ll be able to take it in the hold on flights. Be warned though, this clip is delicate and fiddly and we almost snapped it off a couple of times.",
    "When not in use, you can store and charge the Corrale on its stand. It takes an hour and 10 minutes to charge to full capacity, or a 40-minute charge will give you 90 percent. This means there’s a strong chance you’ll never run the battery down completely while at home anyway. And even if/when you do, you can just plug it into the mains via the cable. The latter similarly applies for longer styling sessions.",
    "Despite having the corded option we barely used it, beyond testing it for the purposes of this review. There was no noticeable difference in the Corrale’s results when used corded or cordless and, in fact, the cable makes it much more difficult to use. Mainly because it’s so long. In our small room, this length – coupled with the chunky power pack located around halfway along – is more of a hindrance than a help and makes it difficult to store.",
    "We’d imagine this would be a benefit to hair salons or similar, but even then we can’t see why they wouldn’t simply use it as a cordless styler and place it on the stand between clients.",
    "The Dyson Corrale is heavy, unattractive and, at times, difficult to use but it performs like nothing we’ve used before. What you sacrifice in style you get back in substance, through strong and shiny, well-styled hair. What you occasionally swap in comfort you get back through freedom of cordless movement.",
    "If the Corrale was cheaper, we’d go as far as being willing to forgive its flaws. Yet, at nearly £400 / $500 we shouldn’t have to make these sacrifices; we shouldn’t have to make swaps.",
    "The GHD Platinum Plus has long set the benchmark for how good a pair of straighteners can be and although using the Corrale has actually highlighted areas where the GHD falls short, we’d opt for the latter every time."
  ],
  "headers": {
    "5": "Design",
    "14": "Performance",
    "22": "Speed and ease of use",
    "25": "Hair damage",
    "27": "Battery life",
    "32": "Verdict"
  },
  "links": {
    "Supersonic hair dryer": "https://www.techradar.com/reviews/dyson-supersonic-uk",
    "best hair dryers": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles"
  }
}