{
  "source": "https://www.techradar.com/reviews/drawio",
  "title": "draw.io review",
  "category": "computing",
  "updated": "2020-07-28T09:05:20Z",
  "author": "jacob-parker",
  "summary": "A collaborative vector graphics editor",
  "verdict": "With good collaboration features and a beginner-friendly interface, draw.io is probably the best vector graphics editor for anyone who needs to produce professional diagrams for free.",
  "pros": [
    "Free for most users",
    "Plenty of ready-to-go layouts",
    "Collaborate on designs through Google Apps",
    "Works with plenty of image formats"
  ],
  "cons": [
    "No technical support service",
    "Design interface could be more refined"
  ],
  "article": [
    "The draw.io platform is a free-to-use online diagram app and editor. With this software package, you can create high-quality designs, custom flow charts, complex network diagrams, and Unified Modelling Language (UML) system layouts.",
    "In this draw.io review, we’ll cover the full pros and cons of using this software package. As you’ll find out, although draw.io is slightly let down by a lackluster selection of default design templates, it’s still an excellent option for creating professional visual aids on a tight budget.",
    "The fantastic thing about draw.io is that, in most use cases, it’s completely free to use. All you need to do to start using this software is head over to the draw.io website, choose where to store your creations (locally, Google Drive, GitHub, GitLab, or Microsoft OneDrive), and start designing.",
    "There are numerous different ways to access the free draw.io package. For example, if you want to sync draw.io data to your Google Drive cloud storage, you can access the platform through a Google Apps domain as well as via the main draw.io website. There are also unpaid versions of draw.io that integrate with Dropbox and Google Chrome.",
    "However, if you are already running a Confluence or Jira server in an enterprise context, then you may wish to purchase a premium draw.io integration license to give your users access to the software. These paid versions of draw.io don’t come with any additional collaboration or design features but do allow you to take complete control over your team’s data.",
    "Confluence and Jira draw.io integrations are sold for Atlassian hosting products and are priced identically, with costs varying depending on the number of users you want support for. A single server integration package can support between 10 and 250 users and costs $10 to $1,800 per year. Meanwhile, Atlassian data center product integrations are priced between $120 to $1,800 per year and can work for more than 1,000 users.",
    "Alternatively, if you want to use draw.io in a Confluence or Jira environment but don’t care about having complete control over your data storage, you can purchase a cheaper draw.io integration for Atlassian cloud server systems. For less than 10 users, this costs $1 per month, for over 10 users the price is or $0.1 per user per month.",
    "draw.io offers a beginner-friendly vector graphics processing environment. The big advantage of vector graphics over traditional image processing is that you won’t lose any quality if you re-open and edit a vector file. If you’ve ever tried to re-size a heavily compressed JPG file, you’ll know exactly how what a difference using vector graphics can make.",
    "Vector graphics are useful in all sorts of different professional settings, from creating building blueprints to designing project workflows to share with your team. The draw.io package comes with dozens of different pre-made layouts that you can pick from when working on a new design. Not having to start your projects from scratch will make your design process more efficient.",
    "However, there are some notable absences in draw.io’s layout catalog. For example, there aren’t any map layouts or templates for floor plans. This problem can be solved by searching for a third-party draw.io template that has been posted online and adding it to your draw.io project.",
    "As long as you connect draw.io to your Google account, you’ll get access to all the same collaborative tools you can use when editing any other document in Google Drive. In other words, you can share the file with colleagues so that you can both work on the same copy of the file. But, even better, this collaboration can occur simultaneously. When you and another user are both working on the same project, you’ll see their cursor and edits live.",
    "With draw.io, you can drag-and-drop image files directly into your projects from your computer. Supported file types include standard ones like SVG, JPEG, and PNG but draw.io also works with VSDX, Lucidchart, and Gliffy diagram objects. You can export your projects in various formats including SVG, XML, HTML, PDF.",
    "The draw.io interface is nicely laid out with helpful shortcuts that will help you quickly locate popular shapes, functions, and settings. By default, on the left-hand side of the draw.io edit screen, you’ll see a panel of useful shapes. One nice feature that speeds up the editing process is that when you put your cursor over a shape (but don’t click it), a larger version will appear on your screen, letting you decide whether the shape is suitable for your project.",
    "Over on the right-hand side of the screen, you’ll see a panel populated by contextual menus. At first, in this space, you’ll see generic options such as changing your diagram size or adding a grid. However, when you select an object, the content changes. For example, if some text is highlighted, you’ll see font options, and selecting a shape causes a menu with color options to appear.",
    "Some elements of the draw.io design experience aren’t as well thought out, though. A good illustration of this is that when you initially decide to connect two objects with an arrow, everything is relatively straightforward. However, if you later decide to move one of the boxes, the connecting arrow will behave unpredictably, forcing you to replace it with another or put up with a somewhat messy image.",
    "Because draw.io is freeware, technical support is fairly limited. When starting out with the program, you can learn about its features by checking out a directory of support articles. However, should you need a more specific question answered, the only place to turn is draw.io’s user forum.",
    "There’s no question that draw.io lacks some important features that are available with alternative diagramming software packages. SmartDraw, for example, has a larger range of pre-made layouts and adapts its shape and tool menus based on the type of diagram you’re working on. The difference, of course, is that SmartDraw costs $297 for a license, whereas draw.io is completely free.",
    "Although draw.io isn’t the perfect diagramming tool, it’s the best you’re likely to get without having to sign up for a subscription platform or purchase a software license. Collaborating with this toolkit is straightforward thanks to native Google Apps integration and even users who have never worked with a vector graphics editor before will find its intuitive interface layout easy to get to grips with."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "7": "Features",
    "12": "Interface and In Use",
    "15": "Support",
    "16": "The Competition",
    "17": "Final Verdict"
  },
  "links": {
    "diagram app": "https://www.techradar.com/best/best-flowchart-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "": "https://groups.google.com/forum/#!forum/drawio",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Lucidchart": "https://www.techradar.com/reviews/lucidchart",
    "Gliffy": "https://www.techradar.com/reviews/gliffy-diagramming-tool",
    "SmartDraw": "https://www.techradar.com/reviews/smartdraw"
  }
}