{
  "source": "https://www.techradar.com/reviews/western-union",
  "title": "Western Union review",
  "category": "computing",
  "updated": "2020-11-01T10:06:22Z",
  "author": "rob-clymo",
  "summary": "Use Western Union to make money transfers anywhere and anytime",
  "verdict": "Western Union is one of the oldest money transfer operations with a huge network of outlets and the latest tech for carrying out any kind of transaction.",
  "pros": [
    "Well established",
    "Good infrastructure"
  ],
  "cons": [
    "Not always a cheap option",
    "Costs can be tricky to work out"
  ],
  "article": [
    "Western Union has been around for a long time with origins that date back to the mid-1800s and has developed its range of money transfer options over the years to move with the times. While it’s still got plenty of the old-style infrastructure that made it appealing to many people in days gone by, the latest incarnation of Western Union is bang-up-to-date.",
    "With more of us needing to move and monitor our money on the go then the Western Union app is going to be of particular interest. At the same time, you can still make good use of its desktop website to do the same thing if you're not bothered about mobile convenience. Topping out the lasting appeal of Western Union is its many physical locations around the world too, which for many makes it a go-to solution no matter where they happen to be.",
    "Similar products worthy of investigation include WorldRemit, Venmo, PayPal and Zelle.",
    "There’s a useful tool on the Western Union website called the Price Estimator, which is, as it sounds, a practical way of finding out how much a transfer will cost you. Enter a destination for the money, the amount and currency.",
    "You can then choose from online, in-store or mobile app as your chosen means of transfer. The different options adjust their settings depending on which country is chosen, allowing recipients to pick the money up at Western Union branches or get it straight to their bank account.",
    "We tried an example sending $500 to Jamaica and got quoted a fee of $7 for debit card, $21.50 for credit card, $5 for a bank account option and $9 for an in-store payment. The transfer, we were told, would take minutes and could also be picked up at a Western Union location.",
    "We also tried the bank account option, and this offered a $2.99 transfer fee and the arrival of funds would take up to 1 business day. In other words, there are numerous variables involved in working out individual costs, although the estimator tool is great for helping navigate those costs.",
    "Flexibility is the key feature with Western Union offering an array of ways to transfer money, albeit for wildly varying fees depending the means of moving the funds and location you’re sending cash to. You can do everything online if needed, sending money directly to bank accounts using the Western Union app.",
    "Cash pickup is also an option favored by many, while increasing numbers of users are opting to use the mobile wallet feature that is available in selected countries. Using the Western Union app comes with added functionality and convenience features too, such as one-touch fingerprint login, instant access to contacts that you regularly send money to, as well as being able to dynamically track your transfers.",
    "With a company as big as Western Union it is reasonable to expect the money transfer service to work quickly and efficiently, although there is often more expense involved compared to others in the market. The online experience via web browser is fine, but it's the app where Western Union currently excels, with a slick mobile experience offering plenty of tools to ensure swift and seamless transfers.",
    "When you use Western Union you do at least have the benefit of a huge company, with countless physical outlets around the globe. Add to that the extensive range of currencies it can handle, in excess of 125 and you’ve got a service that’s quick and convenient. The other bonus is the raft of different methods for sending money, from online and using the app through to bank accounts, mobile wallets and those worldwide outlets.",
    "With something the size of the Western Union operation you’d be right to expect a rock-solid support structure. Therefore, the array of help options available are numerous. If its basic information and frequently asked questions you’re after then the Western Union help center makes an obvious first point of call.",
    "However, it’s also possible to chat with a representative, email Western Union with a query and, naturally, call them on the phone if you'd prefer to speak to someone in person. There’s even a mailing address for postal enquires and correspondence. It’s also possible to track the status of transfers, which is often the first thing many of us want to do if we’re concerned about the whereabouts of our funds. The app comes into its own for this sort of thing.",
    "Western Union is a very large global concern, which means that it can help you with money transfer tasks pretty much wherever you are and whatever currency you want to move. There’s also the flexibility of being able to transfer money both domestically and internationally.",
    "There are some downsides however, with one key issue being that pricing can be rather bewildering, with the Price Estimator being a useful tool on the Western Union website to gauge costs. As with any money transfer tool, you’ll also need to keep an eye on your security settings, but having the benefit of speedy transfers as well as being able to let someone pick up physical cash at the other end might appeal to many.",
    "Western Union’s main benefit is that it can let you get money to pretty much anywhere. There are other money transfer services that maintain lower overheads though. In that respect, if you’re sending cash to a fairly common destination then the best advice would be to see what the competition is offering alongside Western Union."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Features",
    "9": "Performance",
    "10": "Ease of use",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "Western Union": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1218065508549125000&xs=1&url=https%3A%2F%2Fwww.westernunion.com%2Fus%2Fen%2Fhome.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwestern-union",
    "money transfer": "https://www.techradar.com/best/best-money-transfer-apps",
    "Venmo": "https://www.techradar.com/news/venmo-targets-small-and-micro-businesses-with-new-payment-service",
    "Zelle": "https://www.techradar.com/reviews/zelle-money-transfer",
    "Price Estimator": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1072206955668067500&xs=1&url=https%3A%2F%2Fwww.westernunion.com%2Fus%2Fen%2Fsend-money%2Fapp%2Fprice-estimator&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fwestern-union"
  }
}