{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-s9-plus-review",
  "title": "Samsung Galaxy S9 Plus review",
  "category": "phones",
  "updated": "2020-06-05T13:41:42.790Z",
  "author": "matt-swider",
  "summary": "The Samsung Galaxy S9 Plus is still solid with a big screen and superb camera",
  "verdict": "You won't find a bigger and better Android phone than the Samsung Galaxy S9 Plus, thanks to its oversized 6.2-inch curved screen and low-light-defeating dual-lens camera. Sure, it looks exactly like last year's S8 Plus, but it does fix the fingerprint sensor location (it's now center-aligned on the back) and speakers (now stereo). The new AR Emoji mode is overrated, though, and its higher price is tough to justify. This is for people who want the biggest screen and the best camera on one phone.",
  "pros": [
    "Impressive low-light camera",
    "Better-placed fingerprint sensor",
    "Loud stereo speakers"
  ],
  "cons": [
    "Not all that different to S8 Plus",
    "AR Emoji mode is overrated",
    "Pricey for 0.4 in of extra screen"
  ],
  "article": [
    "The Samsung Galaxy S9 Plus is a few years old now, but it's much cheaper than newer Samsung phones and still holds its own against the newest Galaxy S20 devices.",
    "Despite newer competitors, the Samsung Galaxy S9 Plus remains one of the company's most advanced big phone thanks to its oversized screen and superb cameras.",
    "The S9 Plus didn't improve much on the S8 Plus – but it’s an iterative update to an Android phone that sat near the top of our best phones list for around a year. It was that good in its prime, and continues to be a solid lower-cost pick.",
    "In our years of testing the Galaxy S9 Plus, its low-light photos and big screen are the two most obvious highlights. It’s still Samsung’s grandiose 6.2-inch curved ‘Infinity’ display that will sell you on this more expensive phone over the 5.8-inch Galaxy S9, but both handsets have an improved 12MP camera that boasts a f/1.5 maximum aperture.",
    "This was the first camera phone with such a wide aperture, giving the S9 and S9 Plus low-light and noise-defeating powers that sometimes outshone the Google Pixel 2, which reigned as our best camera phone for several months. That said, the newer Google Pixel 4, Huawei P30 Pro, and iPhone 11 have all of them beat in 2020.",
    "The S9 Plus benefits from a rear dual-lens camera, too, giving it the same telephoto capabilities as the previous year’s Note 8 (the S9 has one lens on the back). Its primary lens can also capture super-slow-motion video at 960 frames per second if you’re serious about video and, if you’re not, uses its 8MP front-facing camera to paint your face with AR Emoji props and masks. It's Samsung's spin on Apple's Animoji, but don't get too excited about it. It's rather unimpressive, unlike the rest of the phone.",
    "Samsung has listened to the negative feedback regarding last year’s handsets, and has wisely moved its offset rear fingerprint sensor to a center-aligned position. It’s a more natural location, although you may not even need it thanks to the face unlock and iris scanning onboard and working at the same time. Addressing another shortcoming of the S8 Plus, Samsung finally gives its flagship phones stereo speakers for superior sound.",
    "If you’re thinking a sudden emphasis on stereo speakers, face unlock, AR Emoji and vertically stacked 12MP dual cameras sounds as if these are Samsung’s take on iPhone X features, you're right.",
    "The S9 Plus tries to match everything Apple can do, but at a larger screen size (at least until the iPhone XS Max and now iPhone 11 Pro Max arrived) and with a 3.5mm headphone jack – and it also bests the Google Pixel 2 XL’s low-light photography in some (but not all) scenarios.",
    "What’s interesting is that Apple’s and Google’s handsets aren’t the fiercest competition for the S9 Plus – it’s Samsung’s own phones. The now-cheaper Galaxy S8 Plus is an incremental downgrade, while the S10 Plus is ideal if you want a slightly bigger screen with only a small punch-hole notch in the top right corner.",
    "The S9 Plus remains on our best Samsung phone list, and is still a solid choice if you don't want to spend a lot of money, don't need a stylus, but still want a phone with a big Samsung colorful screen.",
    "The official Samsung Galaxy S9 Plus release date was Friday, March 16, 2018, two weeks after pre-orders opened on February 25 (UK and Europe), and March 2 (in the US).",
    "Its price was more expensive at launch than the S8 Plus in the US and UK. In the US, it cost $839.99 for the S9 Plus unlocked through Samsung's official website. That was only $10 more expensive than the S8 Plus at launch, but it was initially $120 more expensive than the normal-sized S9. The gap had widened between the two sizes.",
    "Of course, US carriers like Verizon, AT&T, T-Mobile and Sprint broke this full price into digestible monthly fees, though Verizon and AT&T charge $100 more in the long run. But just about all American carriers offer $350 for recent phone trade-ins.",
    "In the UK, the Galaxy S9 Plus cost £869 at launch. That was a big price hike over the S8 Plus, which cost £779 initially - you can check out the best Galaxy S9 Plus deals here. That was £90 more in one year. Ouch. In Australia it cost AU$1,349.",
    "Those are launch prices though and if you shop around you can now get it cheaper. In the UK we've seen it from around £620 for example, while in the US you can pick it up from roughly $700.",
    "The Galaxy S9 Plus is the most stylish-looking smartphone you can buy thanks to Samsung continuing its design ethos of melding two glass panels with a metal frame. It doesn’t look very different from the S8 Plus, but that doesn’t matter unless you’re upgrading every year and demand annual newness.",
    "Samsung has made small, but meaningful, changes on the back of its new phones. You’ll find the fingerprint sensor on the rear again, but now it’s aligned in the center, below the camera. The S8 Plus had a much-maligned offset scanner adjacent to the camera, and it was hard to blindly unlock your phone without smudging the camera lens. This is an improvement, although we found the fingerprint sensor pad smaller than the ones on most other Android phones.",
    "You can choose one of five colors, including this year's standout Lilac Purple. Other S9 color options at launch included Midnight Black and Coral Blue in the US, UK, and Europe; there’s also a Titanium Gray hue available in other countries, and the new Sunrise Gold color just launched in the US.",
    "Our Midnight Black review unit has been a mess with fingerprints, even though we wiped it down between photos. It’s another reason to invest in a stylish Samsung Galaxy S9 Plus case.",
    "And that’s it design-wise – you won’t readily notice anything else that’s new on the outside of the S9 Plus. The dimensions have changed by a few millimeters to reduce the top and bottom bezels, making the phone a tiny bit shorter than the S8 Plus, but it’s still a really big phone.",
    "You’re still going to have to stretch your fingers to touch the corners of the screen furthest from your grip – navigating Google Maps on the go, for example, can be a cumbersome affair – so if you’ve been hesitant to buy into big-screen phones your best option is the smaller Galaxy S9. This is a big phone meant for big mitts.",
    "Unlike many of its rivals, Samsung is standing by both the 3.5mm headphone jack and the microSD card slot. It’s also giving us a second year of the Bixby button on the left side of the phone to call up its digital assistant. No, you still can’t remap this button to your liking without third-party software and, yes, you’ll still hit it thinking it’s the nearby volume-down key.",
    "Samsung’s 6.2-inch display on the Galaxy S9 Plus is as expansive as it is impressive. It’s unchanged from the company’s previous Infinity Display – but that's held up to be a fantastic screen, so that’s okay with us, too.",
    "Its tall 18.5:9 aspect ratio has set the standard for all-screen smartphones. It can display a Quad HD+ resolution, yet it still looks outstanding at the default Full HD 1080p. It’s the combination of the futuristic-looking curved edges, vibrant colors, and high contrast ratio that make it pop.",
    "We also appreciate the fact that Samsung has created a screen that fills 90% of the front of the S9 Plus. There’s very little bezel here, and no notch whatsoever, which makes it feel like you’re holding one large, beautiful light beam in your hand.",
    "That beautiful beam of light is prone to occasional false touches, which we experienced due to a combination of the curved screen and our firm grasp of such a big phone. It’s no fun watching text messages disappear only because our pinky finger glanced the backspace key (which happens to be right near the edge) while we tried to clutch this massive 6.2-inch display.",
    "There’s no in-screen fingerprint sensor. That highlight may be saved for the Galaxy S10, but if you can't wait that long some other handsets such as the OnePlus 6T already have one."
  ],
  "headers": {
    "11": "Samsung Galaxy S9 Plus release date and price",
    "16": "Design",
    "23": "Display"
  },
  "links": {
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S8 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s8-plus-review",
    "best phones list": "https://www.techradar.com/news/best-phone",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Google Pixel 2": "https://www.techradar.com/reviews/google-pixel-2-review",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-3-review/reviews/google-pixel-4-review",
    "Huawei P30 Pro": "https://www.techradar.com/reviews/huawei-p30-pro",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Note 8": "https://www.techradar.com/reviews/samsung-galaxy-note-8-review",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "iPhone 11 Pro Max": "https://www.techradar.com/reviews/iphone-11-pro-max-review",
    "Google Pixel 2 XL": "https://www.techradar.com/reviews/google-pixel-2-xl-review",
    "best Samsung phone": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy S9 Plus deals": "https://www.techradar.com/deals/mobile-phone-deals",
    "Sunrise Gold color": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "Samsung Galaxy S9 Plus case": "https://www.techradar.com/news/best-samsung-galaxy-s9-case",
    "OnePlus 6T": "https://www.techradar.com/reviews/oneplus-6t-review"
  }
}