{
  "source": "https://www.techradar.com/reviews/hisense-r8f-4k-ultra-hd-roku-tv",
  "title": "Hisense R8F 4K ULED Roku TV (55R8F, 65R8F) review",
  "category": "televisions",
  "updated": "2020-03-06T20:25:34Z",
  "author": "christian-de-looper",
  "summary": "The budget TV market continues to heat up with the Hisense R8F",
  "verdict": "Hisense adds its proprietary ULED technology to a Roku TV, offering boosted brightness, contrast, color and motion handling. The only downside is that the bass response isn't all that powerful, and might mean you need to invest in a soundbar.",
  "pros": [
    "Full-Array Backlighting",
    "Great image quality",
    "Roku is easy to use",
    "Very inexpensive"
  ],
  "cons": [
    "Audio is only fine",
    "Weak bass response",
    "ULED is a confusing acronym"
  ],
  "article": [
    "Hisense has been killing the budget TV game over the past few years. Thanks to the company’s relatively new ULED technology, Hisense’s panels are able to deliver deep blacks and vivid colors at a fraction of the price. Now, the company is back with another update to its much-loved R8 series, in the form of the new Hisense R8F.",
    "On paper, the Hisense R8F delivers a ton of premium features at a relatively low price: You’ll get Dolby Atmos, Roku TV, a sleek design that includes full array backlighting, and more for $499 or $699, depending on whether you want the 55-inch or 65-inch version of the R8F.",
    "But competition is stiff in the sub-$1,000 price range, especially in a world with the likes of Vizio and TCL. Can the Hisense R8F compete? We’ve been testing the 65-inch model for a few weeks now to find out.",
    "The R8F Series comes in both 55” and 65” screen sizes at the impressive introductory MSRP pricing of $500 and $700, respectively, and are new for 2020.",
    "The Hisense R8F is well-designed, sleek, and will look great in any living room. Sure, it doesn’t have all the design details that a more premium TV from Samsung or Sony would have, but you wouldn’t expect it too - and ultimately, design simply isn’t as important as things like image quality and features.",
    "That said, we do feel this needs a bit of qualification: the Hisense R8F simply is not as sleek and stylish as it appears in press shots. That’s not to say it’s ugly, but the first thing we noticed when we saw the press shots was how slim the bezels were and, unfortunately, they're not as thin in real life. They're slim, but not that slim.",
    "At its thickest point, the TV sits in at three inches, which is fine but not groundbreaking by any means. The TV is thicker towards the bottom of the display, and tapers off at the top, but you likely won’t marvel at its thinness (or thickness) at any point. It’s the same thickness as the previous-generation R7E, and while it would have been nice to see Hisense slim things down a little this time around, it’s really not a big deal, especially considering the full array lighting.",
    "Setting up the TV is relatively easy, and Hisense has thankfully included options for both a narrow and wide footprint, depending on your preferences and furniture. They can be installed closer to the middle of the display, or out towards the edges, depending on the size of your TV stand or entertainment center. The legs themselves are unassuming and have a black color, so they’ll blend into their environment, and don’t look out of place with the rest of the TVs design.",
    "On the back of the TV is where you’ll get all your connectivity, and there’s a solid selection on offer. You’ll get four HDMI ports with the first one supporting ARC, along with an Ethernet port, a USB port, an optical output, and a 3.5mm audio output. It’s a solid selection of ports, however a second USB port might have been nice for those who want to power a streaming device and access local media.",
    "If you’re ever used a Roku TV before, you’ll immediately recognize the remote - it’s the standard Roku remote that comes with pretty much every other Roku TV. You’ll get buttons to control the Roku software, including home and back buttons, along with quick-access controls for services like Netflix, ESPN, Hulu, and the Roku channel, which we'll cover in more detail in a minute.",
    "Design TL;DR: The Hisense R8F isn't going to break any records, and it’s not as slim as more expensive TVs, but for under $700 it's a good-looking TV.",
    "The Hisense R8F, like the R7E before it, comes with Roku pre-installed, and that’s good news for those who don’t otherwise own a smart streaming stick or box. Roku may not be the fanciest smart TV platform out there, but it’s easy to use, works great, and should offer pretty much everything that most users will want.",
    "As you would expect in 2020, Roku is compatible with the vast majority of streaming platforms out there, including the likes of YouTube, Netflix, Amazon, Disney Plus, and Apple TV Plus. There's also The Roku Channel, Roku's free ad-supported streaming service that comes built-in and offers something to watch right out of the box.",
    "In terms of smart assistants, it only has Roku's ultra-basic assistant built-in, but it can interact with Google Assistant or Amazon Alexa, if you so choose.",
    "Perhaps the main downside to Roku is that it lacks some of the smarter features on offer by some other smart platforms, like voice controls, artificial intelligence, and so on. You can voice search through the Roku app, but not everyone will want to use the app in the first place.",
    "Smart TV TL;DR: Roku is easy to use and works great, but lacks some of the smarter features on offer by other smart TV platforms.",
    "The Hisense R8F offers good HD video quality, including generally good upscaling and color depth, even in SDR. That said, it’s worth playing around with the image settings on offer here, because some are definitely better than others.",
    "When viewing SDR content, you’ll get five modes in total, including Movie, Normal, Sports, Vivid, and Low Power. Most of these picture modes could use some tweaking - for example, Movie mode resulted in a slightly over-the-top yellow tint.",
    "For the uninitiated, we recommend heading to Normal mode and sticking with it - though if you’re feeling adventurous, tweaking the other settings may be worth it. There are a ton of settings that you can tweak, if you so choose.",
    "Black levels in SDR are pretty good too, especially for a TV in this price range. The TV offers 60 local dimming zones (or 55 for the 55-inch model), which is far more than the majority of other TVs in this price range, including the Vizio M-Series Quantum, which comes with 12 zones. The result is natural-looking blacks, and while they’re not quite as deep or crisp as what you would get on an OLED panel, Hisense still seems to be leading the pack with deep blacks in this price range.",
    "As mentioned, upscaling on the TV is pretty good, and while there is still some graininess on upscaled content, you’ll forget it's there if you’re not looking for it.",
    "HD/SDR Performance TL;DR: The Hisense R8F offers good upscaling and relatively bright colors, even without HDR.",
    "The Hisense R7 offered vivid colors and deep blacks in 4K and HDR, and the same is true for the R8F. In fact, Hisense has gone a step further for this TV with the welcome addition of Dolby Vision - so if you’ll be able to take advantage of the growing catalog of Dolby Vision content. Apart from Dolby Vision, the TV also supports HDR10, too, so you should be covered for the majority of HDR content available today.",
    "When you watch 4K content, you’ll get excellent clarity with a good amount of detail. Streaming platforms like Netflix and Hulu are increasingly offering 4K content, and when you watch that content, you’ll enjoy the level of detail on offer here - especially when viewing head-on. Some dynamic range is lost at different viewing angles, but the TV still performed better than the majority of its competition in this price range.",
    "In both HDR and Dolby Vision, you’ll get three image modes - Dark, Normal, and Bright. Dark especially seemed to offer another yellow tint - and we recommend keeping settings at Normal, or changing the color temperature if you prefer Dark or Bright modes.",
    "In a breath of fresh air, motion smoothing is disabled by default on the Hisense R8F - and we recommend keeping it that way for most viewing.",
    "Gaming in HDR produced good results too. Playing Assassin’s Creed: Origins on PlayStation 4 resulted in vivid colors with plenty of contrast.",
    "4K/HDR Performance TL;DR: Details are crisp, blacks are deep, and colors are bright in 4K and HDR. The fact that the TV supports Dolby Vision puts it ahead of most of the competition in this price range.",
    "According to Hisense, the R8F supports Dolby Atmos, and the audio quality in general generally does seem to be better than some others. Generally speaking, the audio quality on the Hisense R8F is fine, but it's not going to blow you away.",
    "That said, you might want to invest in a soundbar or higher-end sound system if your budget allows it. The areas in which the built-in speakers are seriously lacking, like bass response and detail in the high-end, result in things like explosions and car engines not having as much depth as they should.",
    "Thankfully speakers can get pretty loud to compensate some. We don’t think users will need to use the speakers at more than 50% volume, and even that was a bit loud. Most of the time we sat around the 20% range.",
    "Sound TL;DR: The speakers aren’t great, so it's worth upgrading to better speakers if you can, but if you can’t then you’ll still get a generally decent audio experience.",
    "No surprises here, the Hisense R8F is an excellent option, and a serious contender for the best TV in the sub-$700 price range. In fact, we think the TV could go head to head with plenty of much more expensive TV options out there. Sure, it’s not perfect - the audio quality isn’t the best, and while the blacks on offer are deep, they’re not quite as deep as what you would find on an OLED panel - but in this price range, this is easily one of the best options.",
    "Of course, the budget TV market isn’t without its competition. The Vizio M-Series Quantum is perhaps the main competitor here, and there’s no clear winner between then. They both offer a stellar image quality in their price range, however while the Hisense R8F offers the easy-to-use Roku operating system, the Vizio M-Series Quantum offers the slightly smarter, but way more complicated SmartCast.",
    "If you want a high-end TV that’s easy to use and relatively well-designed, this is the way to go - but if you want some of the smarter features, like AirPlay and HomeKit support, the Vizio M-Series Quantum is absolutely the way to go."
  ],
  "headers": {
    "3": "Hisense R8F price and release date",
    "4": "Design",
    "11": "Smart TV (Roku TV)",
    "16": "HD/SDR Performance",
    "22": "4K/HDR Performance",
    "28": "Sound",
    "32": "Final verdict"
  },
  "links": {
    "previous-generation R7E": "https://www.techradar.com/reviews/hisense-r7e-50r7e-4k-uhd-roku-tv",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Vizio M-Series Quantum": "https://www.techradar.com/reviews/vizio-m-series-quantum-m658-g1"
  }
}