{
  "source": "https://www.techradar.com/reviews/ticwatch-c2-plus",
  "title": "TicWatch C2 Plus review",
  "category": "wearables",
  "updated": "2020-08-24T11:30:49Z",
  "author": "michael-sawh",
  "summary": "A new TicWatch that doesn’t feel all that new",
  "verdict": "The TicWatch C2 Plus is essentially the TicWatch C2 given a bump in performance and an additional sporty strap to make better use of its fitness features. That means the same design and the same Wear OS experience, which has its strengths and obvious weaknesses. There’s nothing horribly wrong with this smartwatch, but there isn’t anything to get you really excited about it either.",
  "pros": [
    "Minimalist look",
    "Zippy performance",
    "Additional sporty strap included"
  ],
  "cons": [
    "Minor upgrades on C2",
    "Still uses old processor tech",
    "Poor screen visibility outdoors"
  ],
  "article": [
    "The TicWatch C2 Plus is a smartwatch for anyone who wants something that looks good and gives you all of those core features you’d expect to find on a connected wearable.",
    "It’s an update to the TicWatch C2 which launched in 2018, and once again runs on Google’s Wear OS operating system. Compatible with Android phones and iPhones, it will let you view phone notifications, make payments, and download apps and watch faces.",
    "The TicWatch C2 Plus retains the same classic watch-style look of the C2, but adds a new silicone strap to swap in when you want to make use of the wearable’s fitness features, like run tracking or swimming. Improvements have also been made in the performance department, with 1GB of RAM now included to help Google’s software run more smoothly.",
    "In all, the TicWatch C2 Plus is a smartwatch that delivers a solid overall experience and offers good value for money. It just doesn’t do a great deal to stand out from the crowd in any really exciting way.",
    "The TicWatch C2 Plus launched on the June 23, 2020, and is priced at $209.99 / £189.99 / AU$314.99. Additional leather straps are also available at $15.99 / £14.99 / AU$23.99.",
    "That price puts the TicWatch C2 Plus in competition with the likes of the Huawei Watch GT 2e and Honor Magic Watch 2. Importantly though it makes it cheaper than most recent wearables.",
    "The TicWatch C2 Plus is basically the TicWatch C2, so don’t expect much new on the looks front. Once again, you’re getting a circular stainless steel watch case flanked by two crown-style buttons. The rear of the case is still plastic and hosts the heart rate sensor and your charging point. That case is partnered up with a leather strap that is removable via a small pin mechanism.",
    "There are three color options (Rose Gold, Onxy, and Platinum) that all measure in at 42.8 x 42.8 x 12.7mm. If you go for Rose Gold, that comes with a smaller 18mm strap clearly aimed at those with slender wrists. Go for Onyx or Platinum looks and you’ll get a 20mm strap.",
    "Whichever model you go for, all adopt a similar minimalist-style look and the same 1.3-inch 360 x 360 AMOLED touchscreen display as found on the C2. It’s a display that doesn’t break new ground in terms of quality, falling in line with what you’d find on a lot of other Wear OS watches.",
    "It’s sharp, bright and gives you accurate colors, but outdoor visibility can be a struggle at times, particularly when you’re out in bright sunlight.",
    "Aside from those buttons on the side, The TicWatch C2 Pro has a very streamlined look. If you like to keep things simple, then it certainly fits the bill and it pleases on that front. It’s clean, simple and feels like a well-built smartwatch. It’s just a watch that doesn’t stir a lot of excitement from a design point of view.",
    "To make better use of some of the sportier features that lie beneath that stainless steel case, Mobvoi also chucks in a silicone strap with the TicWatch C2 Plus.",
    "You don’t get a second strap included with the standard TicWatch C2, so this is one of the key changes. And like the main leather strap it’s easy to attach, comfortable to wear, and didn’t cause us any issues or irritations.",
    "Like all TicWatches, Mobvoi has turned to Google’s Wear OS to deliver the software experience here. That means you can pair it up with an Android phone or an iPhone, but you’ll get the more complete experience using it with the former.",
    "Wear OS brings all the usual features like notifications, fitness tracking, managing incoming calls, giving you access to Google Assistant (and now Amazon Alexa) and payment support via Google Pay. If you want LTE, you’ll need to direct your attention to the TicWatch Pro LTE instead, which does cost more than the C2 Plus.",
    "Mobvoi makes its presence felt in the software by offering some additional apps to track health and fitness and through its own watch faces. The included watch face selection is dominated by analog faces, but there are some digital watch face options there too including the Google Fit face, and you can of course venture into the Google Play Store to download more.",
    "One of the big changes on the TicWatch C2 Plus compared to the standard C2 is in how well it runs, as while it still uses the same Snapdragon Wear 2100 chipset that featured in the C2, it’s now paired with 1GB of RAM instead of 512MB.",
    "The C2 wasn’t exactly a bad performing watch, but any performance bump can only be a good thing and there’s a nice zip when you swipe through your list of apps or launch applications.",
    "While RAM has been given a boost, it does rely on a processor that’s now two generations old with the recent arrival of Qualcomm’s Snapdragon Wear 4100 and 4100 Plus. That means it misses out on additional battery saving modes and general optimizations and power boosts that are designed to improve the Wear OS experience.",
    "Overall, Wear OS on the TicWatch C2 Plus will feel very familiar if you’ve used the C2 or other TicWatches, it’s just a little bit snappier here than on the C2 Plus’s predecessor.",
    "The TicWatch C2 Plus gives you all of the same health and fitness features you’ll find on the C2, albeit you now have a strap more suitable for getting sweaty with.",
    "In terms of sensors, you’re getting a heart rate monitor for continuous and workout-based data, while GPS, GLONASS and BeiDou satellite support means it’s got mapping outdoor activities well covered too.",
    "If you want to go swimming with it, well, you’re in luck as the water resistance rating deems it suitable for taking a dip in shallow waters. Except there’s no preloaded swim tracking profile like you’ll find on the sportier TicWatch S2 and TicWatch E2.",
    "While you can opt for Google’s own Fit health and fitness apps, or download third-party options from the Google Play Store, you can also look to Mobvoi’s own suite of apps.",
    "There’s TicPulse to measure heart rate on the spot or continuously, while TicExercise will track workouts including running, cycling and indoor rowing. There’s also TicMotion to automatically detect workouts. Though, based on our experience, you’re better off taking the manual tracking route.",
    "TicHealth is Mobvoi’s answer to Google’s fitness tracking features where you can quickly glance at your progress during the day. That doesn’t cover sleep monitoring however, despite Mobvoi recently launching its own sleep app, as that’s currently only available on the TicWatch Pro.",
    "In terms of performance and turning to these apps instead of Google’s, we’d say they make for a much nicer experience on the watch. Particularly for workout tracking. From an accuracy point of view, those key sports sensors hold up okay in most scenarios.",
    "The heart rate sensor tended to be 1-2bpm off of a chest strap during a run, but struggled to keep up during more high intensity workouts. We had issues with the GPS too, where it at times suggested a signal was locked on, but showed no mapping data post-workout. It can also be a little slow to pick up a signal.",
    "Despite the boost in RAM, the battery life numbers touted for the TicWatch C2 Plus remain the same as the base C2. You’ve got the same 400mAh battery promising one day of battery with heavy usage and two days with light usage.",
    "We’d say those numbers pretty much add up based on our experience. If you’re using more power-intensive features like GPS or you switch on continuous heart rate monitoring, then expect to get a day from it. A 40-minute outdoor run for example knocked the battery by 15%.",
    "Unlike the TicWatch Pro, there’s no dual-display setup here to push the battery to as much as 30 days. The absence of a newer Snapdragon Wear processor means it misses out on new power saving modes too.",
    "Whatever way you slice it, one or two days of battery life on a Wear OS smartwatch certainly isn’t breaking the mold. It’s average, so you can get more life elsewhere.",
    "When it comes to charging, there’s a proprietary charging disc that sits on the back of the watch and will power it up from 0-100% in just shy of two hours, so it’s not a super snappy charger.",
    "First reviewed: August 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "TicWatch C2 Plus release date and price",
    "6": "Design and display",
    "13": "Performance and software",
    "20": "Fitness",
    "28": "Battery life",
    "33": "Don't buy it if..."
  },
  "links": {
    "TicWatch C2": "https://www.techradar.com/reviews/ticwatch-c2-review",
    "Huawei Watch GT 2e": "https://www.techradar.com/reviews/huawei-watch-gt-2e-review",
    "Honor Magic Watch 2": "https://www.techradar.com/reviews/honor-magic-watch-2",
    "Snapdragon Wear 4100 and 4100 Plus": "https://www.techradar.com/news/new-smartwatches-could-gain-many-more-functions-from-smartphones-very-soon",
    "TicWatch S2": "https://www.techradar.com/reviews/ticwatch-s2-review",
    "TicWatch E2": "https://www.techradar.com/reviews/ticwatch-e2-review",
    "Google’s own Fit health": "https://www.techradar.com/news/google-fit-all-about-the-smartwatch-and-phone-fitness-app-and-what-sports-it-tracks",
    "TicWatch Pro": "https://www.techradar.com/reviews/ticwatch-pro-review"
  }
}