{
  "source": "https://www.techradar.com/reviews/etrade",
  "title": "E*TRADE review",
  "category": "computing",
  "updated": "2020-03-04T12:13:45Z",
  "author": "jitendra-soni",
  "summary": "Offers multiple tools and resources",
  "verdict": "Best suited for active traders, E*TRADE offers a wide variety of tools and learning resources.",
  "pros": [
    "Bonus for new accounts",
    "Physical store available for help",
    "OptionsHouse integration",
    "Easy to use mobile app"
  ],
  "cons": [
    "High margin rates"
  ],
  "article": [
    "E*TRADE is a New York-based financial corporation which was founded in 1982 and is one of the first firms to set up online trading.",
    "E*TRADE offers multiple platforms for quick and easy trading. It lets you trade in a wide variety of financial assets including common stocks, preferred stocks, futures contracts, exchange-traded funds, options, mutual funds, and fixed-income investments. There are Android and iOS apps as well as a fully featured website, too.",
    "Morgan Stanley has announced that it is acquiring E*TRADE for an amount of $13 billion by the end of the year 2020. While the deal is subject to regulatory approvals, E*TRADE will continue to serve new and existing users in the interim.",
    "E*TRADE gives several choices after logging into their website. It offers you a variety of options, such as to launch Power E*TRADE or download the E*TRADE Pro app, among other things.",
    "The main website is aimed at users who are just getting started, whereas E*TRADE Pro is designed for experienced traders. The website offers real-time streaming data, as well as chart and track your investments.",
    "E*TRADE also offers a library of helpful educational resources for investors of all levels to reference. There are also advanced tools to manage risk expectations.",
    "Also, E*TRADE doesn't charge any commission for all company stock, ETFs and other options trades performed through the platform.",
    "Users based in the U.S. open an account with E*TRADE directly via the website. However, users from Australia, China or Western Europe must open the account via a paper-based application form.",
    "E*TRADE offers three different trading platforms on the web. Namely:",
    "The users who maintain an account balance of $250,000 or more or place at least 30 stock/options trades each quarter, are eligible to get upgraded to E*TRADE Pro. The PRO version rewards active users with timely bonuses as well.",
    "E*TRADE does not have a minimum amount to open an account. However, once opened, you need to fund your account within 30 days.",
    "E*TRADE has a great and robust trading platform for active trading. It offers a full-featured web-based trading dashboard, as well as iOS and Android mobile applications, in case you prefer trading on the go.",
    "The website may be slightly tricky at times when it comes to searching basic information, and FAQ's are not always so easy to find.",
    "The mobile app offers a simple yet a clean layout. It lets you quickly, manage the account, get stock quotes, place trades, view charts and trade while you're on the move. There are multiple apps .i.e. E*TRADE Mobile and Power E*TRADE, each offering a customized trading experience based on your account type",
    "E*TRADE offers you a zero commission model for line stock, options and ETF trades. It does charge for Options, where the user is billed at $.065 per contract. There is a discount for volume traders, and this fee can come down to $0.50 per contract.",
    "It also doesn't charge a management fee or an annual charge. Unlike other platforms, it doesn't even penalize users for inactivity. However, they do bill you $25 for a partial transfer and $75 in the case of an account transfer.",
    "The company has 30 support branches where staff can help users with their queries. Apart from these brick and mortar offices, it offers multiple point of contacts for customers which include 24/7 phone, email and live chat support.",
    "E*TRADE is an industry-leading trading service brand in its mobile and options trading offerings. Power E*TRADE is rich in features for almost all kinds of traders, and the mobile apps are easy to use. The lack of a minimum opening balance is welcome, as is the 24/7 support."
  ],
  "headers": {
    "3": "What to expect",
    "8": "Trading platforms",
    "11": "Platforms",
    "14": "Charges",
    "16": "Support",
    "17": "Final verdict"
  },
  "links": {
    "E*TRADE": "https://www.etrade.com/"
  }
}