{
  "source": "https://www.techradar.com/reviews/tsohost",
  "title": "Tsohost review",
  "category": "computing",
  "updated": "2020-11-11T06:12:07Z",
  "author": "mike-williams",
  "summary": "A value-for-money UK host that's also eco-friendly",
  "verdict": "Tsohost is a quite capable web host with flexible and budget-friendly plans, honest pricing policy and beginner-friendly approach.",
  "pros": [
    "A 30-day money-back guarantee",
    "Transparent pricing",
    "First domain is free",
    "Toll free daily backup system",
    "Customizable plans and options",
    "One-click app installation",
    "Eco-friendly data center"
  ],
  "cons": [
    "Doesn’t offer a 24/7 customer support",
    "Storage and bandwidth limits on VPS hosting and all Economy plans",
    "A lack of official support forum",
    "Not a fully managed WordPress hosting"
  ],
  "article": [
    "Tsohost was founded more than 15 years ago in the UK and they take pride in their aim to make web hosting simple, scalable and secure, and all at affordable prices. In 2009, they launched an innovative backup system which secures all customer data on a daily basis, making themselves pioneers in the industry. At present, they are considered to be one of the largest hosting providers in the country.",
    "In the beginning, their main data center was situated in the UK. They’ve decided to expand their borders in 2015 and open their first data center outside the UK, with a dedicated server in Singapore. However, those who choose to buy cPanel web hosting from Tsohost are able to choose from four different data centers: one of them in Singapore, followed by Amsterdam (the Netherlands), the third one at an unspecified location in North America and the final and the recommended center located in Strasbourg, France. It seems clear that Tsohost is targeting the international market in addition to its customer base in the UK and Northern Europe. They claim to be trusted by more than 250,000 customers, providing them with everything from the domain names and WordPress hosting to customizable server solutions.",
    "Their web page is visually appealing and easy to navigate. It offers, among other things, a blog filled with the latest news, product announcements and tips and tricks for those who need it, and it seems to be updated on a weekly basis at the very least.",
    "Additionally, in 2019 Tsohost launched a new-generation training program with the aim to further develop customer service and make it, as they stated, second to none.",
    "For the more environmentally-minded among its customers, Tsohost’s eco-friendly attitude is worthy of note, since they claim their UK center is powered by renewable energy, generated from hydroelectric and wind sources.",
    "Tsohost offers basic web, WordPress and VPS hosting, all packed with various options depending on your business needs and how much are you willing to invest.",
    "The basic Economy web hosting plan starts at £3.99 ($5.16) a month for over a year and £4.99 ($6.45) for a single month. This plan will get you one hosted website, a free domain, 100 GB storage, unlimited bandwidth, 100 (1GB) premium mailboxes, which is a novelty, 512MB memory, 50% of standard SSL and one basic migration, which is suitable for smaller businesses.",
    "Along with that, they offer a Deluxe, Ultimate and Maximum plan, of which the Ultimate is highlighted as the most popular. The Maximum plan, which costs £14.99 ($19.39) a month for a year or £16.99 ($21.97) for a single month, offers additional 200 hosted websites, unlimited storage, 2GB memory, standard SSL, 5 basic and 3 e-Commerce migrations. Tsohost also now provides Business hosting plans which are not quite budget-friendly, but will provide you with everything required for a larger business.",
    "It’s important to note that no matter which plan you decide to go with, at minimum you’ll get a free domain, unlimited bandwidth, one free migration and 50% off standard SSL.",
    "As for servers, they offer VPS, dedicated servers and complex hosting, all of which follow a similar pricing pattern and options for Windows and Linux.",
    "As it usually is with payment methods, the preferred options are PayPal and credit/debit cards and if you decide that Tsohost isn’t the right provider for you, there is a money-back guarantee available for the first 30 days of your annual plan, or for the first 48 hours if the plan covers a month.",
    "The installation of a website on Tsohost is quite simple. After choosing a plan, you can create an account while providing them with your personal data and a preferred payment method. After a verification via email or webmail, a newly created account will be activated in a matter of seconds.",
    "By simply clicking on any offered plan, you will be presented with a rather modest FAQ section but some plans offer video tutorials on related subjects, which is always handy.",
    "The site you created should appear within a day, and since cPanel is included in the original cost, at the very beginning you are given the necessary tools to manage your site with ease. Tsohost uses a customized version of the cPanel, however, it is quite similar to the more standard cPanels and if you are at least somewhat familiar with them, you won’t have trouble navigating. Even if you are a complete newbie, everything is visually appealing, well organized, intuitive and easy to adjust.",
    "Even though Tsohost has its section on the website advertised as “Fully managed WordPress Hosting”, not everything is as it is presented. On the feature page for WordPress hosting there is no mention of optimization, automatized backup or update settings or other extras, which suggests that it isn’t offering a specialized managed hosting, but rather regular shared hosting plans. If you have humble needs, this shouldn’t present a problem, since all plans cover the basics with a free domain, decent amount of storage, quick and easy WordPress installation and daily backup. The free migration is a welcome bonus, since it will save you both time and money.",
    "When it comes to speed, Tsohost passed the test with flying colors. The GTmetrix test on their main site reveals they are taking 4.6 second to fully load, which is well above the average result of 8.2 seconds and the number of requests was 57 in comparison to the average of 89.",
    "Since Tsohost guarantees an uptime of 99.9%, we decided to put it to the test. After more the two-week testing of their main site’s uptime, we recorded no downtime at all, but with quite a few response time oscillations which could be attributed to immoderate amount of website traffic.",
    "Ultimately, although two or three weeks are not indicative of a whole year, they show that they are likely to keep their promises.",
    "When it comes to support services, Tsohost offers access to a frequently updated blog, a knowledgebase which has not been updated since the April of 2018 but still manages to offer a decent amount of information. The platform offers 24/7 customer support via ticket, live chat and a telephone support, which are available 07:00 - 24:00 GMT. The live chat was originally available from 9:00, but they’ve extended the chat hours due to high demand, as they state.",
    "We were most impressed with the live chat, since the connection was instant, the agents responded immediately and offered a clearly presented and suitable solution to our issues. Tsohost also provides the live chat option which pops up on main page in the far right end of the screen to easily steal a reader’s attention. Although live chat and telephone options are not conveniently available at all times, there is certainly a valid reason they decided to describe their customer service as superior.",
    "What they lack in that department is an official support forum where users could present their concerns and problems in the hope of being able to brainstorm on the solutions together.",
    "Catalyst2 is a fellow UK-based provider with slightly more affordable plans and free SSL provided with every plan. In comparison, Tsohost offers 50% of standard SSL on Economy plans, but includes a free domain, daily backup system and more beginner-friendly approach.",
    "When the approach to newcomers is concerned, both Tsohost and Hostgator are very much user-friendly and all plans from Hostgator include a free website builder. However, since the latter’s data centers are located in the US, it could be less convenient for the UK-based customers.",
    "Certa Hosting is another UK-based provider with a wide array of features, and it offers plans that don’t impose the bandwidth restrictions. In addition, their customer support is available 24/7 via telephone, email or live chat.",
    "The main difference between Bluehost and Tsohost is that one is US-based while the other one hails from the UK. Bluehost offers less expensive options, but their subscription fee increases after three years, which is not the case with Tsohost. However, Bluehost offers a free SSL certificate with even the cheapest plans and their customer support is available 24/7.",
    "Tsohost is without a doubt a competent host who offers a variety of hosting types to choose from and a helpful (although somewhat limited) customer support. So, no matter how big or small your business is, you will be able to find a satisfactory solution for your needs. If you are not strictly looking for a UK provider or you want a truly managed WordPress hosting, Hostgator and Bluehost could be better suited to your needs."
  ],
  "headers": {
    "5": "Plans and pricing",
    "11": "Ease of use",
    "15": "Speed and experience",
    "18": "Support",
    "21": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "Tsohost": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6388111930717861000/https://www.tsohost.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Economy": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5149854557586181000/https://www.tsohost.com/web-hosting",
    "Maximum plan": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2114916857339825400/https://www.tsohost.com/web-hosting",
    "Business hosting plans": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1028335476533163400/https://www.tsohost.com/business-hosting",
    "Catalyst2": "https://www.techradar.com/reviews/catalyst2",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Certa Hosting": "https://www.techradar.com/reviews/certa-hosting",
    "Bluehost": "https://www.techradar.com/reviews/bluehost"
  }
}