{
  "source": "https://www.techradar.com/reviews/origin-pc-neuron-carbide",
  "title": "Origin PC Neuron Carbide review",
  "category": "computing",
  "updated": "2020-02-07T15:14:32Z",
  "author": "bill-thomas",
  "summary": "A solid PC we can't recommend",
  "verdict": "The Origin PC Neuron Carbide is a powerful PC with good build quality. However, with such a high price bump, the lack of wireless and more robust RGB makes it difficult to recommend.",
  "pros": [
    "Solid performance",
    "Plenty of room for future upgrades"
  ],
  "cons": [
    "Very expensive",
    "Not fancy enough for the price",
    "No wireless functionality"
  ],
  "article": [
    "When we sit down and imagine the purpose of boutique PC builders in 2020, it's to create some of the most gorgeous custom PC builds that you can't do yourself. The Origin Neuron Carbide arrives in a time where building your own PC is easier than ever before and other custom PC manufacturers are creating unique chassis and custom cables that are a sight to behold - you only need to take a look at the Falcon Northwest Talon to see that.",
    "So the Origin Neuron Carbide is basically a complicated case, and while it is genuinely a pretty decent gaming PC, you're paying a huge premium for what amounts to a pretty nice build. For instance, the configuration listed to the right will set you back $2,505 (about £1,930, AU$3,750). When you compare that to the $1,821 (about £1,400, AU$2,700) we got on PC Part Picker for the same parts, you're paying a premium of $684 (about £530, AU$1,023) to have the computer built for you. That's a huge chunk of change.",
    "Now, sure, there are more expensive custom built PCs out there, but the fact is that a lot of those are using custom-built PC cases that you legitimately can't get anywhere else. The Origin Neuron uses the Corsair Carbide 175R, a case you can likely find in your local Best Buy.",
    "The case does get the job done, though, even if it's nothing really to write home about. It has a nice tempered glass side panel, and plenty of room for future expansion. The only problem the case might run into is the completely closed front, which could cause issues with airflow further on down the line. Aesthetically it's basically just a big black box, with the only branding being the Origin 'O' on the front of the chassis.",
    "The Origin Neuron we received was packed with an AMD Ryzen 9 3900X, 16GB of RAM and an Nvidia GeForce RTX 2070 Super. These are respectable specs these days, to be sure, and are more than capable of playing the best PC games at 1440p without issue. Playing Red Dead Redemption 2 is a breeze even on our 3,400 x 1,400 display, as is Doom (2016). In fact, even at that high ultrawide resolution, this PC is capable of reaching more than 150 fps in Doom on the highest quality settings.",
    "The benchmarks largely tell the same story, too. In Cinebench R20, the Origin Neuron scored a nice score of 7,199, which is actually slightly higher than the 7,101 we got on our test bench equipped with the same processor. Then, in Geekbench 4.3, it scored a single-core number of 5,429 and a multi-core of 46,195, which is about what we'd expect from the CPU in here.",
    "Then in game, this is a solid performer, too, with the PC hitting an average of 64 fps in Metro Exodus at 1080p, which is higher than the 61 fps that the 2070 Super in our test bench received with equivalent hardware. The differences in performance aren't super high, but they do indicate that performance definitely isn't being crippled by the case or cooling.",
    "But, the configuration isn't all sunshine and roses. The motherboard chosen for this build simply shouldn't be in a PC that costs nearly three grand. There's nothing wrong with the MSI X570 Gaming Plus, of course, it's an excellent mid-range board after all.",
    "However not only does it lack any RGB - and who wants a non-RGB motherboard in 2020 - but it's missing Wi-Fi and Bluetooth. Now, obviously a more luxe motherboard with these features is going to be more expensive but you're paying that $866 extra. A PC that is this expensive that's sold as a whole product needs Wi-Fi and Bluetooth these days. There's nothing wrong with picking a motherboard like this for your own build, as you're likely going to understand the features you'll be missing, but folks that aren't familiar with PC hardware don't have that same knowledge - and those are the people who will be buying this machine.",
    "At the end of the day, the Origin Neuron is fine. If you don't take price or the current gaming PC market into consideration, it's actually a pretty capable gaming rig. However, we simply can't ignore these things. Not only can you save a huge wad of cash by building your own rig with the same hardware, but you can find the same hardware from more prestigious builders for less - you can get the Maingear Vybe with equivalent hardware for $2,406. It's simply difficult for us to recommend this system to anyone."
  ],
  "headers": {
    "0": "Two minute review",
    "10": "Don't buy it if..."
  },
  "links": {
    "boutique PC builders": "https://www.techradar.com/news/boutique-pc-builders-best-work-the-experts-top-custom-case-builds",
    "Falcon Northwest Talon": "https://preview.vanilla.tools/fte/techradar/7bc5de88-42b5-11ea-97b3-be5e7c301081/reviews/falcon-northwest-talon",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Corsair Carbide 175R": "https://go.corsair.com/c/221109/490888/8513?subId1=trd-us-7229358810055975000&sharedId=trd-us&u=https%3A%2F%2Fwww.corsair.com%2Fus%2Fen%2FCategories%2FProducts%2FCases%2FMid-Tower-ATX-Cases%2FCarbide-Series-175R-RGB-Tempered-Glass-Mid-Tower-ATX-Gaming-Case-%25E2%2580%2594-Black%2Fp%2FCC-9011171-WW",
    "AMD Ryzen 9 3900X": "https://www.techradar.com/reviews/amd-ryzen-9-3900x",
    "Nvidia GeForce RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-online",
    "Doom (2016)": "https://www.techradar.com/news/gaming/doom-review-1321626",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Maingear Vybe": "https://maingear.com/product/maingear-custom-vybe/"
  }
}