{
  "source": "https://www.techradar.com/reviews/lifefone-review",
  "title": "LifeFone review",
  "category": "pro",
  "updated": "2020-10-27T16:13:50Z",
  "author": "jeph-preece",
  "summary": "Our LifeFone review explains why a good medical alert service is not good enough",
  "verdict": "LifeFone offers good medical alert systems with an excellent call quality and their emergency call center performed really well, but it doesn't do enough to stand out enough from the rest.",
  "pros": [
    "Good call response time",
    "Excellent call quality"
  ],
  "cons": [
    "Fall detection sensor causes false alerts",
    "Lacking additional options"
  ],
  "article": [
    "In our LifeFone review, this medical alert company does everything well, from the systems it sells to the pricing. But sometimes doing everything well is not good enough. Not when better, more innovative and affordable options are available. In other words, LifeFone doesn’t do enough to separate itself from the top tier of companies in this industry.",
    "As with most medical alert services, you have the choice between a basic in-home landline, a midrange in-home cellular, and premium Numera Libris GPS mobile device. LifeFone includes a fourth package that includes an in-home MobileHelp CBS-02 system and a mobile device without fall detection. Typically, we recommend you don’t go for the in-home and mobile packages because they tend to be more expensive and provide little additional value, as you should use your mobile medical alert device in the house. That said, LifeFone’s package is actually cheaper than their premium Numera Libris GPS mobile system, which includes fall detection.",
    "Get a free quote for a medical alert system.",
    "For the in-home landline and in-home cellular, LifeFone uses the same medical alert system used by Medical Guardian’s landline system. In our tests, this particular system (we were unable to trace the manufacturer) had the longest wireless pendant range by a significant margin. It tested out at 2,000 feet, which was 400 feet longer than its specifications list. That said, while a long range means you can roam around your yard and neighborhood, it doesn’t necessarily mean you should. If your mobility doesn’t limit you to your home, then a mobile medical alert system is safer – if you have a false alert with a fall detection pendant (a common occurrence) when you’re out in your yard, then you will get an ambulance sent to your home for no reason.",
    "The On-the-Go and At-home package features the MobileHelp CBS2-01 device and the MobileHelp GPS mobile system. Both are widely used and very popular. Five of the services we reviewed use it. And it's easy to understand why – the audio quality of the speakerphone is superb and while it’s not as loud as the MyTrex MXG, you’ll have a better, more effective conversation with the emergency operator. It also features a display that shows the cellular signal strength, allowing you to place it in your home where the signal is strongest. The display also shows the time and the temperature.",
    "We were unimpressed with the fall detection pendant, which adds $5 to your monthly fee. In our tests, it proved to be too sensitive, causing many false alerts. Again, this is why having a long range may not be the best idea, at least with a fall detection pendant. If the sensitive sensor calls for help and you’re too far from the base station to tell the operator that it was a false alert, you’ll be going for an ambulance ride. (In the US, as a precaution against lawsuits, most EMTs are required or pressured to take seniors to the hospital for an evaluation even if there was no emergency.)",
    "That said, the fall detection sensor on the Numeris Libris mobile device is much better. It’s not perfect, but it does detect falls with relative accuracy. And while we’ve tested some Numera Libris devices that have been too sensitive, since it’s a mobile device, you can easily tell the operator that you aren’t having an emergency.",
    "In our first round of three-week daily tests, LifeFone answered calls for help in an average of 45 seconds, which was 25 seconds faster than the overall average. In fact, it was second only to GreatCall, which averaged 20 seconds per call. In the second round of three-week daily tests, LifeFone improved to 37 seconds per call. However, other services also improved, like Medical Guardian and GreatCall. So while it wasn’t the fastest, LifeFone certainly is among the fastest at answering calls.",
    "We also rated the call quality as above average. The operators always spoke clearly and at a pace ideal for seniors, who typically have a hard time hearing phone conversations. The operators asked if we were okay in nearly every call and confirmed our identity, a potential security risk. Also, we liked when they signaled that the call would end. With too many other services, the calls ended too quickly and without any real indication that the operator was ending the call. It’s reassuring to know they aren’t still listening or connected.",
    "The only downside was the few calls where operators seemed bored and uninterested. While one can expect to find a few bored and tired operators at the end of their shift, it’s still a little jarring when compared to other calls where operators sound interested and speak with a reassuring, calming voice.",
    "As with many medical alert services, LifeFone can be quite aggressive with its marketing. There are plenty of pop-up ads and attempts to funnel you into a sale. This is all pretty standard, however. The good news when medical alert services are aggressive marketers is that they usually offer more coupons and deals than other services. And LifeFone is no different. You can expect to find pop-up deals every time you visit the website.",
    "The customer service, however, isn’t a bunch of sales people, so you can easily get help without feeling pressured to add unnecessary items to your account, like wall buttons and expensive lockboxes. In addition, we didn’t have any issue with the cancellation process. We simply called in to cancel and received instructions on returning the equipment.",
    "LifeFone’s pricing is competitive. The in-home landline costs roughly $25 per month, which is about $5 cheaper than the average for the same type of system. The in-home cellular costs $30 per month, which is also $5 cheaper. And the premium mobile package with fall detection costs about $40 per month, which is a few dollars cheaper than average.",
    "The best value is the in-home and On-the-go package of the MobileHelp systems. At about $37 per month, it’s an affordable mobile system with the best in-home system. While the mobile system doesn’t have fall detection, it’s a great value for a mobile system. Of course, it still doesn’t compare to GreatCall’s Lively Mobile, which is $10 cheaper per month and features a better speaker and more robust construction.",
    "LifeFone is a solid medical alert service that offers good systems, great performance, and excellent customer service. You really can't go wrong by choosing LifeFone for your medical alert service. The systems they offer are effective with excellent audio and the emergency response was above avearge.",
    "That said, LifeFone isn't really that different from most medical alert services and while the performance and quality of service is good, it’s not great enough to separate this service from the pack. In other words, you can’t go wrong choosing LifeFone, but there are better, more affordable options with greater value too."
  ],
  "headers": {
    "3": "Medical alert systems",
    "7": "Emergency response center",
    "10": "Medical alert service",
    "12": "Cost comparison",
    "14": "Final Verdict"
  },
  "links": {
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system"
  }
}