{
  "source": "https://www.techradar.com/reviews/msi-gm30-clutch-gaming-mouse",
  "title": "MSI GM30 Clutch Gaming Mouse review",
  "category": "computing",
  "updated": "2020-06-09T20:22:33Z",
  "author": "taylor-clemons",
  "summary": "An affordable gaming mouse that blends form and function",
  "verdict": "The MSI GM30 Clutch is a balanced mid-range gaming mouse that can handle a variety of situations.",
  "pros": [
    "Lightweight",
    "Customizable buttons and RGB lighting",
    "Comfortable for palm and claw grips"
  ],
  "cons": [
    "Button remapping is confusing",
    "Not ambidextrous",
    "No on-board profile selector button"
  ],
  "article": [
    "When you’re on the market for a mid-tier gaming mouse like the MSI GM30 Clutch, it’s usually an exercise in compromise. Whether you’re choosing between performance, style and price or sacrificing functionality like DPI switches and RGB lighting, you rarely get a mouse that can do it all without a high price tag – the MSI GM30 Clutch, however, tries to buck that trend.",
    "With its lightweight build and extra features, it's designed with both amateur and professional gaming in mind.",
    "The MSI GM30 Clutch retails for $49.98 (£40/AU$78), putting it on the level with other mid-tier gaming mice like the Razer Basilisk Essential ($49.99/£40/AU$78) and the Corsair IronClaw ($59.99/£48/AU$93). It features a narrow, low profile body design that is comfortable to use in both a palm and claw grip. The sides have raised dragonscale detailing to enhance your grip even during the most intense gaming sessions. The size of the mouse isn't much smaller than a normal business-oriented model, but those with larger hands may find it a bit uncomfortable to use, even in a claw grip.",
    "With five programmable buttons, you can configure up to three separate profiles in MSI's DragonCenter app to suit almost any game. The left-side thumb buttons are easy to access when you need them in a hurry, and can be programmed to perform a variety of tasks like mouse button or keyboard inputs.",
    "However, setting up keyboard macro inputs can be confusing and unintuitive with the DragonCenter app. You have to actually \"record\" what you want the thumb buttons to do, and when you're finished the app just labels it \"macro\" rather than the specific key function. So if you have both thumb buttons set to keyboard functions, it's up to you to remember what each \"macro\" label means.",
    "The mouse also doesn't have an on-body profile selector button to switch configurations on-the-fly. You have to access the DragonCenter app and choose a profile from the drop-down menu every time you want to change configurations. This may work for multiple users on the same computer, but it's a pain when a single user wants to switch layouts for specific games.",
    "The GM30 Clutch allows you to create custom DPI settings from as little as 200 all the way up to 6200 DPI. The on-body selector button is recessed between the main L and R buttons. Having the selector button recessed makes it almost impossible to accidentally change settings when adjusting your grip or moving the mouse during fast-paced gaming sessions. The scroll wheel features a rubberized coating that feels great to the touch and provides extra grip when your hands get clammy. The only drawback to the scroll wheel is that it doesn't have a tensioner to adjust how \"clicky\" the wheel feels when you move it. It may be a minor complaint, but a more ratcheted scroll wheel has its advantages when using certain programs and games.",
    "The MSI dragon logo, scroll wheel, and U-shaped area around the DPI switch are capable of RGB lighting. You can choose between 9 different effects and millions of colors in the DragonCenter app. The colors are vivid and well-defined, allowing you to enjoy truly customized lighting configurations. You can also adjust the brightness of your RGB lighting to suit your space; turn the brightness all the way up if you prefer to game in dim or dark rooms, and turn it down when sharing a space with others or doing everyday work. With the MysticLight menu in the DragonCenter app, you can sync the lighting effects and colors with other MSI hardware and peripherals like keyboards, motherboards, and CPU fans to have an effect or color stretch across your entire setup.",
    "We tested out the GM30 Clutch in both friendly and ranked competitive matches in Overwatch to see how it could hold up to repeated inputs and fast-paced gameplay. The L and R buttons use Omron mechanical switches which give you a satisfying, solid click. Clicking feels heavier than in similar mice, requiring slightly more force to push down the L and R buttons, but it isn't uncomfortable or tiring during long play sessions. The switches are rated for 20 million clicks, ensuring durability and longevity. With as solid as each button press feels, you'll be sure to get your 20 million clicks.",
    "The body of the mouse weighs just 98 grams, making it a breeze to zoom around a mousepad or desktop when you need to quickly change your aim or camera angle to see around a corner. The lightweight body reduces fatigue during day-to-day work as well as gameplay sessions. The bottom of the mouse features smooth plastic feet to reduce friction and further reduce movement fatigue.",
    "We chose to remap sniper aiming inputs, ultimate attacks, and crouching to the thumb buttons for quick access when needed, making frenetic firefights feel slightly less overwhelming and more accessible. While playing as Widowmaker, we really felt the lack of a DPI thumb switch throttle for pixel-precise aiming, but that's a matter of personal preference and can easily be remedied with a thumb button being remapped for a DPI setting.",
    "All in all, the MSI GM30 Clutch is a reliable and efficient gaming mouse that can also handle simple, everyday work in between rounds of blasting enemies. With a price point that will fit just about any budget and a solid, quality build that you can literally feel, the GM30 Clutch is a worthy addition to any gaming setup or a great option as a backup mouse."
  ],
  "headers": {
    "0": "Two minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "Corsair IronClaw": "techradar.com/reviews/corsair-ironclaw-rgb"
  }
}