{
  "source": "https://www.techradar.com/reviews/mdconnection",
  "title": "MDConnection review",
  "category": "computing",
  "updated": "2020-04-14T18:00:30Z",
  "author": "jonas-p-demuro",
  "summary": "Simple software to uncomplicate your medical practice",
  "verdict": "MDConnection has plenty to offer, but the major drawback of a lack of an EHR holds us back from a higher recommendation.",
  "pros": [
    "Choice of support methods, including toll free number",
    "Included training videos",
    "Upfront pricing",
    "No long term commitment"
  ],
  "cons": [
    "Lacks mobile apps",
    "Lacks free trial",
    "No native EHR",
    "Difficult to run reports"
  ],
  "article": [
    "Based in Frisco, Texas, MDConnection is a top tier cloud-based medical practice management solution that is fully HIPAA compliant. The goal is to achieve complete workflow automation, for medical practices large and small, as well as urgent care facilities. MDConnection claims over 20,000 users, with in excess of 99% uptime.",
    "MDConnection offers cloud based practice management, targeted at medical practices for automation of day-to-day tasks. The workflow of both the front, and the back office are both streamlined.",
    "A crucial feature of any medical practice management software tool is scheduling. Here, the appointment scheduler has an intuitive interface. It also allows for ‘enterprise level customization,’ with instant access to the critical information that both the front and back office staff need constantly and repeatedly. There is also a quick menu that is available from the screen for commonly used actions, like patient check in, thereby saving valuable office time.",
    "A secure, online patient portal is also part of the package, and is designed for patient engagement. From this portal, patients can view their statements online, make online payments for outstanding balances, download documents ahead of their appointments, and to check appointment availability.",
    "MDConnection also is strong on the business side of things as it offers electronic claim processing and management and built-in claim management tools. Billing is streamlined via reusable ICD/CPT code templates that can be fully customized. Also, claim denials can be minimized, with insurance verification that can assess deductibles, co-payment and co-insurance. Financial analytics are also integrated into the MDConnection package, for easy financial analysis into the medical practice’s health.",
    "Security is also an essential feature, and goes a step beyond what HIPAA requires. A crucial piece of this is the enhanced security settings that enables the practice administrator to assign roles and permissions on a custom basis.",
    "A significant shortcoming is that MDConnection does not offer any mobile apps, for neither the iOS nor Android platform. Also, a free demo is offered, but we would prefer a free trial.",
    "User reviews indicate that the software can be difficult to use to run reports. More specifically, the reports have a tendency to get cluttered with other information that is extraneous. Also, another user has issues with trying to get the software to work, and concerningly support leaves the issue unresolved as it works “On their end.”",
    "Another shortcoming is that MDConnection does not have a native EHR. The workaround provided is that it has partnered with other EHR’s, and a practice can choose from two- Elation Health, and Nexus Clinical- although neither is a popular platform. Also keep in mind that there will be an additional separate charge for this EHR on another platform.",
    "MDConnection offers support for its products via an assortment of methods. We appreciate that a toll free number is offered, and find this best when trying to explain a more complicated issue. The next option is for email, but we caution that email is not HIPAA compliant, so Protected Health Information should not be exchanged via this route, but this can still be useful for other problems, and an annotated screenshot can be attached if needed to clarify the problem. Finally, there is an online portal that can be used, which MDConnection terms their “Support Web Form,” and this is a useful way to create a trouble ticket online, and efficiently. MDConnection indicates that support is available during “Normal business hours,” and representatives can “Access... a 24-hour alert system.”",
    "Training is handled via the GoToMeeting platform, and up to a maximum of 25 folks can login simultaneously for the session, but be cognizant of the $100 (£81) nominal charge for the one hour session. There are also piles of videos that range from “Charts,” “Claim Details,” and “Patient Payments” to name but a few, which are free.",
    "Unlike much of the medical practice software segment, almost refreshingly, MDConnection is quite upfront with its pricing. There are essentially four plans, two for physicians, and two for mid-level providers (MLP’s, also known as Nurse Practitioners and Physician Assistants). All the plans include 24/7 access to the software, and unlimited support.",
    "Among the plans for each of the tiers of providers, there is an unlimited plan, and a fee based plan. For example, for the physicians, the fee plan has a monthly cost of $199 (£161) per month per provider, but has a $0.25 (£0.20) charge for “Claims, Eligibility & ERA,” while the unlimited plan, suitable for busier practitioners, commands a higher cost of $299 (£242) per month per provider, but has no additional fees. Similarly for the MLP, the unlimited plan costs $199 (£161) per month per provider with the same additional $0.25 (£0.20) charge for each claim, and $99 (£80) per month per provider for the fee based plan.",
    "Another plus is that there is no long term commitment nor contract, and the plan can be canceled at any time.",
    "MDConnection is a bit of dichotomy in the final analysis. On the one hand, we dig the program overall, which has refreshingly upfront pricing, a choice of support methods, and a high level of security. However, it is hard to get past some major issues that include the lack of mobile apps, that there is no native EHR which would be an additional expense, the missing free trial, and that support leaves some problems unresolved. Smaller practices should take a good look at this software to decide if it meets their needs."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "9": "Support",
    "11": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "MDConnection": "https://www.mdconnection.com/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}