{
  "source": "https://www.techradar.com/reviews/lenovo-yl27gq-20-gaming-monitor",
  "title": "Lenovo Y27gq-20 gaming monitor review",
  "category": "computing",
  "updated": "2021-11-23T07:44:16Z",
  "author": "john-loeffler",
  "summary": "The Lenovo Y27GQ-20 gets you 1440p gaming at a nigh-unreasonable price",
  "verdict": "A sharp, lightning fast display that delivers high-quality 1440p gaming performance, The Lenovo Y27GQ-20 gaming monitor's price tag will likely put it out of reach for many. It has an l",
  "pros": [
    "Super fast refresh rate",
    "1ms response time",
    "Nearly bezel-less design",
    "Nvidia G-Sync compatible"
  ],
  "cons": [
    "Expensive",
    "Limited number of inputs",
    "Monitor stand eats up desk space",
    "Not compatible with AMD FreeSync"
  ],
  "article": [
    "Looking at the 27-inch 1440p Lenovo Y27GQ-20 gaming monitor is an absolute pleasure, but you'll have to pay handsomely for the privilege.",
    "As far as gaming monitors go, it's got about as fast a refresh rate as rival gaming monitors with its 1ms response time, making it perfect for competitive gaming where lightning fast reflexes and split-second clicks means the difference between a match-winning headshot and a miss that reveals your carefully chosen sniper's perch.",
    "The monitor uses Nvidia G-Sync technology, so it's at it's best when paired with an Nvidia GeForce graphics card so you can eliminate screen tearing. If you have an AMD Radeon card, the monitor's tech isn't compatible – so even though it will technically work with AMD cards, we really do recommend you get a monitor with FreeSync compatibility instead. It makes no sense to spend this much and not be able to take full advantage of the monitor's best features.",
    "The nearly bezel-less design also makes it an attractive option for multimonitor setups as well, but at this price, it doesn't make much sense to buy two of them if you're gaming on one screen with a Discord chat open on the other. It's better paired with a more standard monitor for a lot less money.",
    "It has a limited number of ports as well - one DisplayPort and one HDMI 2.0 input - so it's not going to be easy to set this up as a main display for a couple of consoles and your gaming PC.",
    "All of this comes at a price point that is noticeably higher than competing 1440p gaming monitors on the market, and while those others might have a slightly lower refresh or a 3ms response time, for many gamers there won't be enough of an advantage to justify the extra cost.",
    "If you're willing to spend the roughly $100 / £100 / AU$150 extra to get the best performance out of your gaming monitor, though, the Lenovo Y27GQ-20 definitely holds its own against all but the very best gaming monitors out there.",
    "Gaming monitors tend to be more expensive than standard monitors with the same resolution, thanks to the added factors of refresh rates, response times, and that all-important G-Sync/FreeSync technology.",
    "Even with those caveats, the Lenovo YL27GQ-20 is on the pricey side of the 1440p spectrum. Its MSRP is $629.99 / £499 / AU$1,099, though you can pick it up for less than that right now on Lenovo's site and at several retailers.",
    "Even with those discounts, it's still an expensive gaming monitor and the specs barely justify the extra cost. Lower-priced competitors might max out at 144Hz but sell for $100 / £100 / AU$150 less. You've really gotta want that overclocked 165Hz here.",
    "As for the design of the Lenovo YL27GQ-20, it's really a tale of two parts. The display itself is excellent. The ultra narrow bezels on the top and sides make the display a pleasure to look at, while the tilt and rotation are easily adjustable and lets you get the perfect viewing angle.",
    "The stand is a somewhat different story, however. The wide footprint of the monitor takes up a decent amount of space on your desk and extends a couple of inches beyond the vertical plane of the display.",
    "If you don't plan on putting anything in front of it or have a lot of depth to your desktop, this shouldn't be a problem. If you've got a tight working space that also needs to fit a keyboard, mouse, and then some, those legs might get in the way and require some desktop rearrangement to make it all fit.",
    "There are also a limited number of ports on the back as well. With just a single DisplayPort and an HDMI 2.0 input, you'll need to get used to switching out cables or buy yourself a switcher if you plan on using this monitor for three or more systems at once.",
    "So, now that we got all those criticisms out of the way, let's talk about how gorgeous, quick, and buttery smooth this monitor is in practice.",
    "The 1440p panel is just gorgeous to look at even when set to the default 60Hz refresh rate, but bumping it up to 165Hz in Windows' display settings really makes it all feel worth it. It's simply a beautiful, vibrant display that makes it almost impossible to go back to a 1080p 60Hz monitor.",
    "With the default 3ms response time - boostable to 1ms by turning on \"extreme mode\" in the monitors settings - this monitor very viable for competitive multiplayer gaming. If eSports is your thing, this monitor will serve you well against nearly all but the most elite gaming monitors out there.",
    "The other feature of note is Nvidia G-Sync tech, which syncs up the monitor's refresh rate with that of an Nvidia graphics card. This eliminates – or nearly eliminates – screen tearing, which is essential to a smooth, crisp picture.",
    "Unfortunately, G-Sync is not compatible with AMD Radeon graphics cards, so if you have a Radeon RX or similar, you'll need a monitor with FreeSync technology instead. You can obviously still use this monitor with an AMD graphics card, but you're much better off getting a FreeSync-compatible monitor instead."
  ],
  "headers": {
    "0": "Two minute review",
    "7": "Price and availability",
    "10": "Design",
    "14": "Performance",
    "19": "Don't buy it if..."
  },
  "links": {
    "gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "stand": "https://www.techradar.com/best/monitor-stands"
  }
}