{
  "source": "https://www.techradar.com/reviews/switchvpn",
  "title": "SwitchVPN review",
  "category": "computing",
  "updated": "2020-07-21T08:10:29Z",
  "author": "mike-williams",
  "summary": "Will SwitchVPN turn you on – or off?",
  "verdict": "There's the core of a good VPN here, but SwitchVPN’s many issues make it difficult to recommend.",
  "pros": [
    "Servers in 43 countries",
    "Unblocks Netflix, iPlayer",
    "P2P support",
    "Easy to use"
  ],
  "cons": [
    "Only 250+ servers",
    "Underpowered mobile apps",
    "Windows kill switch only works with OpenVPN",
    "Several small technical and privacy issues"
  ],
  "article": [
    "It's not easy for small providers to make an impression in the VPN crowd, but US SwitchVPN does a better job than most.",
    "The company may only have a modest 250+ servers, for instance, but they're well distributed across 43 locations across North America, Europe, Asia and Oceania.",
    "The service seems to score well on the privacy fundamentals with 256-bit encryption and support for PPTP, L2TP, OpenVPN, SSTP, and IKEv2 protocols; the company's own secure DNS servers, and a kill switch to protect you if the VPN drops.",
    "P2P and port forwarding support is available everywhere; apps for Windows, Mac, Android and iOS make it easy to get started, and 24/7 live chat is on hand if you need help.",
    "Monthly billed plans are decent value at only $6.99 to cover up to 3 devices, $9.99 to cover up to 6.",
    "Annual plans don't compare quite so well at $3.99 a month for up to 3 devices, $5.99 to cover 6. Elsewhere, Private Internet Access' annual account protects up to 10 devices for $2.85 in year one, $3.33 on renewal; Surfshark has no limit on simultaneous connections, and it gives users two years of protection for less than SwitchVPN charges for one ($1.99 a month, $47.78 total, vs $3.99 and $47.88.)",
    "If you're intrigued, SwitchVPN offers users three days to sample the full service for just $1. We would prefer a free trial, but with most VPNs dropping these due to abuse, SwitchVPN's approach seems like a fair compromise.",
    "The SwitchVPN website makes familiar promises how it 'will never collect your activity or Internet connection logs', but we've learned not to take VPN zero-log claims at face value, and headed off to the privacy policy to find out more.",
    "Unfortunately, there's no real logging policy detail at all, with the only relevant clause being a single sentence: 'Company does not collect or log any traffic or use of its Virtual Private Network (\"VPN\") service or Proxy.'",
    "Vagueness about logging is commonplace with VPNs, but there are some exceptions. NordVPN, ExpressVPN, TunnelBear and a few others have put their systems through public audits, showing real transparency and providing potential customers with solid evidence to back up their claims. It's a much better approach than making vague promises in a privacy policy, and we hope more VPNs will take the audit route in future.",
    "The SwitchVPN signup process looks like it should be straightforward, but a couple of issues caught our eye.",
    "The website begins by asking you to choose a username and password. We allowed our password manager, Dashlane, to automatically generate a secure password, and... SwitchVPN complained 'VPN Password value is not valid.' We repeated the process with the same result.",
    "This kind of issue usually means you haven't followed the site's password rules ('must use a mix of upper and lower case letters', 'can't use any of these symbols'), but, unfortunately, SwitchVPN doesn't tell users what these rules are or what the specific problem is. We manually entered a password with a single symbol, same issue; no symbols, it finally worked. A security company which required us to use a less secure password? Not a good start.",
    "We reached the payment screen, chose the PayPal option (cards are also supported), and found SwitchVPN still required entering our country as well as email address, as well as prompting for our full name and postcodes. The last fields were marked as optional, but anyone not paying full attention might easily fill them in (our Dashlane installation did so automatically), and we're struggling to see why they're necessary in the first place.",
    "At the very bottom of the screen, where you might never see unless you keep scrolling down, a 'Join our mailing list' is set to 'Receive Emails' by default. A VPN is supposed to help us avoid marketing trickery, not use it itself.",
    "The service picked up after we'd paid: an email arrived with links to setup guides for all platforms; we chose the Windows option, downloaded and installed the client and were ready to go in barely a minute.",
    "The SwitchVPN client has a familiar and straightforward interface, and if you've used another VPN you'll feel at home immediately. Location list is here; Connect button is there, and there's a Settings panel if you feel the need to tweak.",
    "The client does stand out for its visual style, though. The Connect button is animated, with a gradient fill; the interface makes an appealing use of color; Settings panels scroll smoothly across the screen as you click their tabs.",
    "There's plenty of functionality here, too. While some VPN location lists are little more than a plain text menu, SwitchVPN sorts its servers into Recommended and All panels, with filters to display specialist Streaming, P2P or China Optimized locations, icons indicating server load, and a Search box and simple Favorites system to easily find whatever you need.",
    "Unfortunately, the servers listed here change significantly depending on your choice of protocol. Use OpenVPN and you'll see everything; we chose L2TP, and the Streaming, China Optimized and P2P Optimized filters disappeared. The client warns users that changing protocol might reduce the server selection, but this is a much more extreme result than we expected.",
    "The Settings panel has only a handful of options, with simple 'start with Windows' options, a kill switch, a wide choice of protocols (OpenVPN UDP and TCP, L2TP, IKEv2, SSTP, PPTP), and the ability to define MTU size and proxy (HTTP and SOCKS5.)",
    "Disappointingly, the kill switch works with OpenVPN only, something SwitchVPN forgot to mention on the website. That's very much the easy option, as the client can mostly leave the OpenVPN executable to handle this itself, and indicates the developer may not be as good at low-level Windows networking tech (WFP, maybe) as he is with interface work.",
    "The client protected our OpenVPN connections using strong AES-256-GCM encryption. It wasn't as careful with IKEv2, L2TP or other native Windows connection types, though, setting up encryption as optional: 'connect even if no encryption.' This may have little or even no impact on real-world privacy as the client and server should always negotiate protection, but it's a concern because it shows a lack of attention to detail, and it's not even slightly difficult to fix. All the developer has to do is change the initial encryption setting to 'Require: disconnect if the server declines', like the vast majority of other VPNs, and even the theoretical possibility of connecting 'even if no encryption' is removed.",
    "We noticed other minor issues as we explored the client, including its downloading of configuration files via HTTP, rather than HTTPS. Again, there's very little chance of this having any real-world impact, but users shouldn't have to cross their fingers and hope; it's the job of a VPN provider to pay attention to these details and eliminate all unnecessary risk.",
    "SwitchVPN's other apps have an almost identical interface. The Android app, for instance, has the same look and feel as the Windows client, and once you've looked at one, you'll instantly know how to use the other.",
    "The mobile apps are distinctly short on features, though. The Android version isn't just lacking the more advanced features you'll get with some of the competition (auto-connect when you access insecure networks, split tunneling to define apps which won't use the tunnel), it doesn't even have the options you get with the Windows client: no auto-start feature, no proxy support, no option to change the protocol-- it's OpenVPN only.",
    "Despite all these hassles and concerns, the core experience of using the apps isn't bad at all. They're easy to use, connection times are quick, and they didn't get in our way as we used our devices. They still don't match the top competition in functionality, though, and there's plenty of room for improvement.",
    "SwitchVPN got off to a reasonable start in our website unblocking tests, with its specialist streaming servers getting us into BBC iPlayer and US Netflix.",
    "There's an odd usability issue with this, though, which may catch out some users. As we pointed out above, when we changed our protocol from OpenVPN to L2TP, the streaming servers weren't listed separately, and our fastest local UK server didn't unblock BBC iPlayer. In theory there's an easy fix, just change the protocol back, but in practice we suspect many users won't expect not to be able to unblock a platform because they switched to IKEv2, so they'll accept the failure and never look further.",
    "Our problems increased when the service failed to get us into Amazon Prime Video, though. And when we tried Disney+, we were surprised to see Chrome and Edge block access, warning about site certificate errors.",
    "A temporary Disney+ issue? No; turn the VPN off and the site worked as usual, turn it on and it wasn't even accessible.",
    "An issue with a specific SwitchVPN server? No, we tried two more with the identical result.",
    "We can't come to any definitive conclusion about this as we've absolutely no idea why we had this issue, but it makes us more wary than usual about SwitchVPN's unblocking abilities. If you're interested in the service and unblocking is a priority, we'd recommend you take the 3-day $1 trial and check all the sites you need, several times, at different times of day, to confirm it works properly for you.",
    "Performance looked reasonable in our first tests, with local UK connections managing excellent download speeds of 68-69Mbps on a 75Mbps test line. Longer distance connections from the UK were relatively disappointing, though, with UK to US speeds often as low as 10-20Mbps.",
    "We tried again, connecting from a European data center. This time, our connection reached 330-340Mbps with the VPN turned off, and averaged a reasonable 140Mbps once we connected to our nearest location. It looks like SwitchVPN is capable of decent speeds, but they depend very much on where you are and the locations you choose, and there's no substitute for trying it out for yourself.",
    "We rounded off our review with some privacy tests, and they raised more problems. Although DNS leaks were prevented when using the OpenVPN protocol (probably because the OpenVPN process was handling the low-level technicalities), our original DNS servers were used when we switched to other protocols, such as IKEv2.",
    "The issue here isn't just the technical failure, it's the lack of transparency to the user. SwitchVPN's website claims the service protects you with a kill switch and by blocking DNS leaks, but it doesn't tell you that these features only work on some protocols. Choose the 'wrong' protocol and you'll reduce your level of protection, probably without even realizing.",
    "SwitchVPN looks good and is easy to use. But digging deeper revealed several privacy and technical issues, leaving us concerned about whether it can deliver the level of protection we would expect. The service could still work as a simple website unblocker, but be careful before using it for anything privacy critical."
  ],
  "headers": {
    "7": "Privacy",
    "10": "Setup",
    "16": "Apps",
    "27": "Performance",
    "37": "Final verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "SwitchVPN": "https://switchvpn.net/",
    "well distributed": "https://switchvpn.net/servers",
    "Monthly billed plans": "https://switchvpn.net/order",
    "Annual plans": "https://switchvpn.net/order",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "privacy policy": "https://switchvpn.net/privacy-policy",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn"
  }
}