{
  "source": "https://www.techradar.com/reviews/owc-envoy-pro-ex-thunderbolt-3-1tb-portable-ssd-2019",
  "title": "OWC Envoy Pro EX Thunderbolt 3 1TB portable SSD review",
  "category": "computing",
  "updated": "2020-05-20T15:12:09Z",
  "author": "desire-athow",
  "summary": "The OWC Envoy Pro SSD just might surprise you",
  "verdict": "If you happen to have a Thunderbolt 3 laptop and want a nimble-yet-fast storage device that can take full advantage of that technology, then you can’t go wrong with the OWC Envoy Pro EX. We found there was much to enthuse about here, and little on the complaints front.",
  "pros": [
    "Long warranty",
    "Excellent price",
    "Superb read performance",
    "MIL-STD810G drop test certified"
  ],
  "cons": [
    "Non-replaceable integrated cable",
    "Bright LED"
  ],
  "article": [
    "Update (May 2020): OWC has cut the price of its 1TB drive to only $299.79, making for an ever better bargain.",
    "Thunderbolt 3 is quietly establishing itself as the preferred interface for top-of-the-range devices (although we hope it doesn’t suffer the same fate as Firewire). Its physical compatibility with USB Type-C means that we’re seeing more storage devices using Thunderbolt 3 (TB3), as the user base of compatible host devices increases.",
    "OWC (Other World Computing) has just introduced the new Envoy Pro EX 2019, a rugged portable NVMe bus-powered SSD with a Thunderbolt 3 connector. It is available in 480GB, 1TB, 2TB and 4TB versions for $229, $299, $529 and $1179 respectively – but we only tested the 1TB model.",
    "The OWC Envoy Pro EX is protected by a removable rubber sleeve, and the components are housed in what OWC describes as a “strong, slim and stylish” anodized black aluminum enclosure. Choosing this material means that the case doubles as a giant heat-sink, with heat dissipation improved thanks to the fins that run around the edges.",
    "At 145 x 74 x 23mm, with a weight of 300g, this drive is small enough to be carried around easily. OWC, however, felt it was necessary to integrate the TB3 cable with the SSD. We don’t agree with that decision especially as the drive comes with MIL-STD810G drop test certification and a three-year warranty. OWC sells bare enclosures but sadly no NVMe Thunderbolt 3 models – what a shame.",
    "The issue here is what happens if the cable is damaged, and the answer is anyone’s guess, as it’s not covered by the warranty. Given its length – only 15cm – it might be too short for many users, as well.",
    "A pluggable TB3 cable plus a rubber flap to cover the TB3 connector would have been preferred, especially as it would allow the Envoy Pro EX to be fully IP68 compliant. There’s a definite missed opportunity here.",
    "The other notable feature is a bright white LED that lights up when connected to a host computer. That LED can’t be turned off or customized via software – maybe that could be another improvement for the next iteration of the product.",
    "The previous version of the OWC Envoy Pro EX was rated at 1.8GBps while the one we tested rocks a maximum quoted speed of 2.5GBps, a massive 39% increase. That’s due to a new unnamed SSD powered by a Phison E12 controller, rather than the slower (and older) OWC Mercury M.2 SSD. The new drive is likely to be very similar to this MyDigitalSSD NVMe model which uses the same controller.",
    "Indeed, the drive was recognized by CrystalDiskInfo as the OWC Aura P12. In synthetic tests, the drive hit 2.84GBps in read speeds in CrystalDiskMark 6.0.2. Oddly enough, write speeds were far below our expectations at just under 600MBps – less than a third of what the Samsung X5 achieved.",
    "A single 100GB file took 181 seconds to transfer, which translates into an average speed of 552MBps. The below average write performance was not observed in Atto and AS SSD benchmarks where the Envoy Pro hit 1.33GBps and 1.16GBps respectively.",
    "We have reviewed two other passively-powered Thunderbolt 3 storage devices in the recent past: The Patriot Evlvr, a 1TB model that retails for $274 at the time of writing, while the Samsung X5 is priced at an eye-watering $399. The premium that the X5 attracts can be justified by its absolutely staggering performance – the best from a non-RAID external storage solution. Note that all prices are from Amazon (US) and exclude fees and shipping.",
    "Other portable 1TB SSD products with a Thunderbolt 3 connector include Glyph Technologies' 1TB Atom Pro ($399), the Transcend StoreJet 500 ($269), the G-Technology G-Drive Mobile Pro SSD ($379) and the VisionTek Portable 1TB Thunderbolt 3 SSD ($599). A more comprehensive list of Thunderbolt 3 storage devices can be found on the official Thunderbolt 3 website.",
    "OWC also sells a special edition of this drive called the VE (Video Edition) which is “performance tuned” for video production, and that translates into a 12% increase in the write speed. The price premium for that, though, is significant at 80% and 40% for the 1TB and 2TB models respectively.",
    "Because of its physical compatibility with USB Type-C, Thunderbolt 3 is likely to avoid the fate of Firewire, another heavily promoted Apple interface that served a niche very well, but failed to appeal to a mass audience.",
    "OWC’s Envoy Pro EX has managed to carve a niche in the crowded portable SSD market. This is the sixth iteration of a product that started its life back in 2013! The 2019 version doesn’t disappoint; it is rugged, speedy and affordable. The only complaint we have is the integrated cable which could get damaged, potentially leaving you in a pickle.",
    "At $299, this drive is more than three times the price of the Silicon Power 1TB SSD bundled with an external SATA casing, and just over twice the cost of a DIY portable NVMe USB drive using the HP EX900. What you gain in terms of savings, though, you lose when it comes to performance and ruggedness – although in the case of the EX900, the performance gap is likely to be much smaller should you opt for a USB 3.1 Gen 2 adapter enclosure."
  ],
  "headers": {
    "3": "Design",
    "8": "Hardware and performance",
    "11": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "OWC has cut the price of its 1TB drive to only $299.79": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1029550953762053000/https://eshop.macsales.com/item/OWC/TB3ENVP10/",
    "480GB": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2530796818057932300/https://eshop.macsales.com/shop/add/48032/OWCTB3ENVP05/",
    "1TB": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7763969894528188000/https://eshop.macsales.com/shop/add/48033/OWCTB3ENVP10/",
    "2TB": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5669623612364157000/https://eshop.macsales.com/shop/add/48034/OWCTB3ENVP20/",
    "4TB": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6179328596075486000/https://eshop.macsales.com/item/OWC/TB3ENVP40/",
    "MyDigitalSSD NVMe": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07H11QGFM%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6790246434138346000-20",
    "Samsung X5": "https://www.techradar.com/reviews/samsung-x5-portable-ssd",
    "Patriot Evlvr": "https://www.techradar.com/reviews/patriot-evlvr-thunderbolt-3-external-ssd-1tb",
    "Glyph Technologies' 1TB Atom Pro": "https://www.bhphotovideo.com/c/product/1456989-REG/glyph_technologies_a1000pro_glyph_atom_pro_1tb.html?BI=20811&KBID=16572&SID=trd-us-4959560311845659000",
    "Transcend StoreJet 500": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FTranscend-Thunderbolt-Solid-StoreJet-TS1TSJM500%2Fdp%2FB00NV9LTFW%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6537830671944008000-20",
    "G-Technology G-Drive Mobile Pro SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FG-Technology-G-DRIVE-mobile-Pro-0G10311%2Fdp%2FB07CTJN2PV%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9739441090406482000-20",
    "VisionTek Portable 1TB Thunderbolt 3 SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FVisionTek-Portable-1TB-Thunderbolt-SSD%2Fdp%2FB07DHDBSSJ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1136690277403539500-20",
    "official Thunderbolt 3 website": "https://thunderbolttechnology.net/products?tid=1&field_company_nid=All&field_prod_os_value_many_to_one=All&field_prod_tb_version_value_many_to_one=tbv3",
    "Silicon Power 1TB SSD": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSilicon-Power-Performance-Internal-SP001TBSS3A55S25%2Fdp%2FB07B4G19X3%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1417418454978655500-20",
    "HP EX900": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FHP-EX900-Internal-Solid-5XM46AA%2Fdp%2FB07MFBNMF1%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8037695567096972000-20"
  }
}