{
  "source": "https://www.techradar.com/reviews/panasonic-g100",
  "title": "Panasonic G100 review",
  "category": "cameras",
  "updated": "2021-07-02T11:38:30.669Z",
  "author": "amy-davies",
  "summary": "Is this the perfect camera for vloggers?",
  "verdict": "For vloggers and YouTubers, the G100 is an excellent choice. With a good range of video options, including a world-first when it comes to audio, it’s one of the most versatile and well-specced cameras in its price and weight category. Its small size, shape and weight also makes it a good option for travel photographers looking for something small and discreet. With an excellent array of Micro Four Thirds lenses available, particularly small and travel-friendly optics, this is a fun option to suit a wide audience.",
  "pros": [
    "Compact, travel-friendly design",
    "Well priced",
    "Useful optional tripod grip"
  ],
  "cons": [
    "Smaller sensor than some rivals",
    "Video crop when shooting 4K",
    "Better options for stills shooters",
    "Older autofocus system"
  ],
  "article": [
    "Being touted by Panasonic as “the ultimate\" vlogging camera, it’s quite clear what kind of person the company is aiming its new G100 at.",
    "Although the camera follows on from the Panasonic G95 / G90, it’s quite a departure from that model, using a smaller body and with more video-centric specifications to appeal to budding YouTubers.",
    "Thanks to that small body, though, it could also be considered by stills photographers as the ideal travel camera. Pair this up with some of the smaller Micro Four Thirds lenses on the market, and you’ve got a neat little portable bundle.",
    "Still, it’s those video specs which are the headline grabbers here. Most notable is the addition of an Nokia Ozo Audio-equipped microphone system, making it the first mirrorless camera to include such a set up.",
    "What that means is that you get three microphones picking up sound depending on the direction it’s coming from – and that includes from the rear of the camera if you’re walking and talking to make a vlog. Panasonic is so confident of this sound set up that it claims an external microphone simply isn’t necessary.",
    "Of course, you’ve also got 4K video recording (albeit with a crop) as well as a fully articulating screen. The G100 is in fact the world’s smallest camera with an articulating screen, another nod to just how miniature it is. The sensor is a 20.3MP Four Thirds device, making it smaller than those found in APS-C or full-frame cameras, but still larger than the one-inch sensor found in the recently announced Sony ZV-1 vlogging camera.",
    "We’ve managed to spend a few days with the G100 ahead of its global release and have been shooting a variety of stills and video. Here’s what we think of it so far.",
    "Panasonic seems to have aggressively priced the G100, perhaps in a bid to take the ‘vlogging’ crown from other competitors already in the market.",
    "As a result, you can pick up the G100 body only for £589/AU$1099, with a 12-32mm kit lens for £679/US$749/AU$1299 and with both the kit lens and the grip for £719/US$799/AU$1399. For a limited time only (until 31 August), UK customers can get a free grip when you buy the body only or kit lens variant.",
    "It compares well against other popular vlogging cameras, being slightly cheaper than the recently launched Sony ZV-1, which has a smaller sensor and doesn’t give you the option to change lenses.",
    "It’s even roughly the same price as the Canon EOS M50, a camera which has been on the market for a number of years – making the G100 something of a bargain when it comes to new cameras.",
    "Panasonic has long been a strong player in the video market, and while its focus might have been on the more 'serious' videographer in the past, the G100 has its sights firmly on the vlogging space.",
    "This means it's got a generous helping of video-centric specs that are designed to appeal to YouTubers. Naturally, there’s 4K/30p video recording, albeit with a crop, but there’s also a range of other frame rates and resolutions.",
    "There’s also social media-friendly specs, like a video selfie mode, a social media frame marker (to help you make sure you’re framing up correctly for the social media network of your choice), and a dedicated button for transferring your videos and shots directly to your smartphone ready for uploading.",
    "The big news, though, comes in the shape of the new audio system – Ozo Audio by Nokia. While we've seen this appear in smartphones, this is a first for cameras, and it helps the G100's three internal microphones pick up clear sound no matter where it’s coming from.",
    "Vloggers may also find the fact that there’s a rear microphone for picking up sound as you’re walking and talking a particular bonus. Panasonic is so confident that this microphone system will do a good job that it says you shouldn’t need to invest in an external one, though that's slightly contradicted by the inclusion of a 3.5mm mic input.",
    "Other specs include a 20.3MP MOS sensor, five-axis hybrid image stabilization, a fully-articulating touch-sensitive screen, an electronic viewfinder and a single SD-card slot.",
    "Sold as part of a kit bundle, or as an optional extra, the new Tripod Grip (SHGR1) is also aimed at the traveling YouTuber. It has inbuilt buttons for triggering either a still image or a video and can be used to hold the camera steady while walking and talking, used like a selfie stick to film yourself, or used as traditional tripod if you’re presenting to camera.",
    "One of the advantages of the Micro Four Thirds system is that its cameras can be much smaller than its APS-C or full-frame equivalents. Panasonic has taken that to the extreme with the G100, producing something incredibly small and light, in a bid to lure vloggers who want something ultra-portable to capture their everyday lives.",
    "Although this is a follow-on from the Panasonic G95/G90, the outward appearance is quite different, with the much smaller body being the most notable difference. It also means you lose the chunky handgrip, but the small grip that’s left still gives you a good purchase on the camera, so it feels like a worthy sacrifice.",
    "There’s also a reduction in the number of direct access buttons and dials on the G100, but you’re still left with a decent array which will allow you to quickly jump to the setting you need. The mode dial has stayed, along with a dial for adjusting aperture and shutter speed, but you’ll no longer find a secondary dial, or another for adjusting the drive mode.",
    "Dedicated buttons for white balance and ISO are gone, but the G100 does have one for sending your videos and images directly to your smartphone – again, a nod to those who are coming from smartphones.",
    "Overall, Panasonic has done a good job here of balancing the desire for a smaller body with keeping a good degree of control buttons. If you have larger hands, or you like that more tactile approach a bigger camera can give you, this might not be the one for you, but if it’s more important to you to have a smaller device, it’s likely to be very appealing.",
    "As this is targeted at vloggers, it was important to keep the articulating screen. You’ll need it when recording pieces to camera, as well as photographing from awkward angles. Like other Panasonic models, it’s touch-sensitive and works well in conjunction with the physical buttons to make the changes you need.",
    "Naturally, the viewfinder is on the small side, but again, it’s still very usable. It’s nice that Panasonic has kept this here – despite it being aimed at the vlogger who might not use it all that often, it gives it another tick in the box for those intending to use the G100 as a secondary or travel camera.",
    "We’ve been able to carry out a few real world tests with the G100 to get an understanding of how well the Ozo Audio internal microphone system works.",
    "It’s a bold claim when a manufacturer says you don’t need to purchase an additional microphone, but early indications suggest that they might not be wrong.",
    "We’ve used the G100 in a number of different audio conditions to see how well the microphones cope with blocking out background noise. In relatively quiet conditions we wouldn't expect any problems, and naturally the camera does well there. With some background noise present – such as crowds and other people talking – it does an excellent job of prioritizing the sound of the speaker to give clear sound.",
    "Particularly useful is the rear microphone, intended to pick up sound when creating walking videos with you narrating from behind the camera. There was one occasion where the microphone didn’t automatically switch from the front to the rear microphone when turning the camera around – that’s something we’d like to test further to see if this was just a one-off incident, or something that happens more frequently.",
    "Otherwise, even when the background noise is very loud (for example, in heavy traffic), the microphones did a good job of producing clear sound.",
    "We were also able to test the microphone during strong winds. It did a great job picking out the voice against the sound of the strong wind - and while perhaps you might get slightly better sound from a dedicated microphone, it’s certainly much better than other in-built camera microphones.",
    "One of Panasonic’s claims is that the G100 can pick out your voice when in a densely populated crowd – obviously this is not something we’re going to be able to test for a while, but if the results match its performance in heavy traffic, then it's likely to be pretty impressive.",
    "There’s a marked and good difference between switching the in-built image stabilization on for video, and switching it off. Panasonic says that it has tuned its algorithms to make it particularly adept when filming while walking.",
    "The results are pretty good, but it’s not as smooth as you’d get while using a dedicated video gimbal, or even the results we’ve seen from action cameras like the GoPro Hero 8 Black.",
    "Overall, we’d say that if you’re a vlogger who likes to record a lot of “walking and talking” videos, you might be better to look into a dedicated video gimbal, but for vloggers who like to like to create a bit of everything, the stabilization is suitable enough.",
    "The specs sheet promises up to 90 minutes of HD video recording with a fully charged battery, or 80 minutes for 4K. That’s a continuous recording figure, and the 'actual' figure (accounting for things like switching the camera on and off, stopping and starting the recording), is closer to 40 or 45 minutes.",
    "That might not seem like a lot, but for recording a number of short clips it should be fine – and further good news comes from the fact that you can give the G100 power bursts on the go via USB charging, so dedicated vloggers might find it useful to bring along a portable battery pack.",
    "Another useful feature, which is not new for the G100 and has been around on Panasonic cameras for some time, is the 4K Photo functionality. With this, you can essentially record short video clips, from which you can extract stills which capture a split-second moment.",
    "It’s great for photographing kids, pets and other fast-moving action, making the G100 a sensible choice for a family camera. The downside of 4K Photo is that images are output at 8MP only – if you need higher resolution, you can shoot at up to 10fps at full resolution (and in raw format).",
    "On the whole, the G100 does a good job of keeping up with moving subjects – especially those that move in a reasonably predictable fashion. It’s probably not a camera dedicated sports photographers will turn towards, but again, for those who like to capture the odd moving subject, it’s a good all-rounder.",
    "We weren’t expecting any surprises when it came to image and video quality with the G100, as it uses the same sensor as its predecessor.",
    "What that means is that, on the whole, you get a well-performing sensor that produces good imagery in a good range of different conditions. Colors directly from the camera show a good degree of vibrance, while the overall impression detail is also very good when looking at images at A4 or below (in other words, normal printing and web sizes).",
    "Where the G100 falls down somewhat is in very low light situations. Here, the smaller sensor shows its limitations, with a loss of detail and smudging of details. Images are still usable at relatively small sizes at high ISO speeds up to 12800, but if at all possible, it’s recommended that you keep to below ISO 6400. The top speed of ISO 25,600 is best avoided unless absolutely necessary.",
    "Other than that, exposures are generally well-balanced when using the all-purpose metering system, while the automatic white balance setting produces accurate colors in most conditions. Under artificial lighting, the G100 errs ever so slightly on the yellow side, but using a specific white balance setting (or shooting in raw format and correcting after the fact) eliminates this problem.",
    "Video quality – as we’d expect for a camera strictly aimed at vloggers – is also very good. On the whole, footage is smooth, with good colors and plenty of detail. Sound quality has already been mentioned in the 'performance' section, but stands above other in-built microphones by quite some way.",
    "It’s not all good news, though – a crop is applied when shooting 4K video. That’s bad news for vloggers who like to record videos of themselves – with the standard kit lens at its widest (12-24mm equivalent thanks to the Four Thirds Sensor), you’ll need to shoot at quite a distance to frame your head suitably.",
    "If you’ve only got your arm to do that, then it’s not ideal. Vloggers who like to shoot this kind of content frequently might be better suited to cameras such as the Canon EOS M6 Mark II, which doesn’t suffer from the same problem (but in fairness is also more expensive). It’s worth noting that a crop doesn’t apply when recording in Full HD, which is one way to get around the problem if you don’t require ultra high resolution footage."
  ],
  "headers": {
    "7": "Panasonic G100 release date and price",
    "11": "Panasonic G100 specs and features",
    "18": "Panasonic G100 design and handling",
    "25": "Panasonic G100 performance",
    "40": "Image and video quality",
    "47": "Don't buy it if..."
  },
  "links": {
    "vlogging camera": "https://www.techradar.com/news/best-vlogging-camera",
    "Panasonic G95 / G90": "https://www.techradar.com/reviews/panasonic-g95-g90",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "Canon EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Panasonic G95/G90": "https://www.techradar.com/reviews/panasonic-g95-g90",
    "GoPro Hero 8 Black": "https://www.techradar.com/reviews/gopro-hero-8-black",
    "Canon EOS M6 Mark II": "https://www.techradar.com/reviews/canon-eos-m6-mark-ii-review"
  }
}