{
  "source": "https://www.techradar.com/reviews/vpnasia-review",
  "title": "VPN.asia review",
  "category": "computing",
  "updated": "2020-10-16T15:37:15Z",
  "author": "sead-fadilpasic",
  "summary": "An okay VPN, but it has a fair few issues",
  "verdict": "VPN.asia is a decent enough VPN provider if your standards aren’t high. Its apps are exceptionally basic, it has a small server network, and you won’t find any useful material in its support centre, but it will give you privacy, torrenting capabilities, and access to popular streaming services like Netflix, Hulu, and BBC iPlayer.",
  "pros": [
    "Unblocks Netflix, BBC iPlayer, etc.",
    "Allows torrenting"
  ],
  "cons": [
    "Problematic apps",
    "Minimal customer support",
    "Only 40+ servers"
  ],
  "article": [
    "VPN.asia is a small VPN platform that relies on only about 40 servers and struggles at times with its apps and customer support.",
    "Nevertheless, it provides privacy online, torrenting capabilities and access to streaming channels, albeit at average or below-average speeds.",
    "The provider allows you to judge its capabilities during a 7-day money-back guarantee period but if you end up not liking it, there’s plenty of other (and much better) fish in the sea, among the best VPN services.",
    "This VPN vendor’s services are available under three subscription packages: one month at $5.99/month, 6 months at $5/month ($29.99 billed up front), and one year at $4.15/month ($49.99 billed annually). Payment options include credit cards, PayPal, Paymentwall and Bitcoin.",
    "It doesn’t have a free trial but you can still take it for a spin and see how you like it during the no-questions-asked 7-day money-back guarantee period.",
    "VPN.asia states that you can “use a single subscription to connect all your personal devices.” Although this sounds like it means “unlimited use”, it may only refer to routers.",
    "The provider makes it clearer in the Software section, which reads: “Just one subscription to VPN.asia can be used simultaneously on one computer, one streaming media console, one wireless router and one mobile device.”",
    "So, if you have two mobile devices and you want to run the VPN on both, you can forget about it. This clearly isn’t “all your personal devices”, so a bit of clarity from the provider’s side on its homepage would’ve been appreciated.",
    "VPN.asia will give you privacy online and access to Netflix and BBC iPlayer, but it’s miles away from some of the VPN industry’s major names, like ExpressVPN.",
    "Some major players even cost less, including NordVPN, CyberGhost and Surfshark, all of which offer robust, user-friendly clients, thousands of servers all over the world, responsive customer support and solid proofs of no-logging claims.",
    "Signing up for VPN.asia will give you access to popular streaming services often unavailable in specific regions. With it, you will be able to watch content on Netflix, BBC iPlayer, Hulu, Spotify and plenty of other services and websites.",
    "Despite its name and the fact that the website states that VPN.asia is part of SpiderSilk Limited located in Central Hong Kong, the provider claims to have positioned itself in the privacy-friendly land of Belize.",
    "VPN.asia offers a network with over 40 servers in 32 countries, including in Israel, Russia, Turkey, Thailand, India and others. However, we noticed that some of the advertised servers aren't available.",
    "To offer you complete privacy and make your data invisible, VPN.asia uses the military-grade 256-bit encryption with SHA-256 hash authentication and PPTP, L2TP and OpenVPN (TCP/UDP) connection protocols.",
    "It is configured with Stealth VPN by default and, on top of this, promises to never log your information.",
    "A kill switch can be turned on as an additional safety mechanism, which will jump in and block your entire internet access if the VPN connection is compromised.",
    "The vendor’s privacy policy lists all the details it collects, doesn’t collect, and what it does with information collected. Specifically, it “does not collect or log any traffic or use of its Virtual Private Network service”.",
    "That said, there’s no way to confirm the veracity of these claims as the provider hasn’t brought in an independent auditor to verify its no logging practices.",
    "VPN.asia states that it has apps available for Windows, iOS, Android and Mac, as well as OpenVPN configuration files for Linux that you can generate on the website with your desired server location and port settings.",
    "It also supports installation on Chromebooks, KindleFire, Nook HD, SurfaceRT, Apple TV, PlayStation, Xbox and certain routers. The provider claims to have step-by-step tutorials for enabling the platform on all of them, but we couldn't find them.",
    "The Android app was last updated on January 17 2020 and has so far been installed by 5,000+ users. It has received an average rating of 3.9/5 from 94 people, although a lot (if not most) of the reviews look a little suspicious.",
    "As for the iOS app, the link provided on the website did not work and manual search only gave us a different app of a similar name.",
    "The provider’s support centre is ridiculously tiny, containing only three articles: installation on Windows, Android, and Mac. This really isn’t helpful if you’re trying to install the service on a router or an Xbox.",
    "Instead, you could try contacting the customer support through several communication options: website contact form, direct email at support@vpn.asia, as well as live chat, but the latter only seems to be available to paying customers.",
    "The first problem we ran into after downloading and trying to connect was that the app asked for our credentials but gave us no option to enter them. We quickly found it in the settings but this is truly a strange place for it - bundled together with the app’s options and tools.",
    "On top of this, the Windows app didn’t hide the password as we were typing it and it remained visible on the screen, which is far from ideal security-wise.",
    "As we proceeded, we realized the app is very basic - there were no advanced options except turning on/off the kill switch and switching between the UDP and TCP protocol. However, it did connect with just a single click (or tap, if on mobile).",
    "The download speeds were average, delivering around 18Mbps on a 55Mbps test connection for the server location it picked for us (in the Netherlands).",
    "Problems continued when we tried switching servers in the Windows app. Although we selected a different server from the dropdown menu, our IP remained the same. To truly change the server, we had to turn off the VPN connection and reconnect.",
    "The Android app, on the other hand, simply stopped responding whenever we tried switching the servers and we had to restart the app each time.",
    "Connecting to a server in Miami delivered only 8Mbps but, considering the distance, some losses in speed are expected. A server in Dubai performed well for such a far-flung locale, with 16Mbps. We also tried connecting to a server in Bangkok, Thailand, but for some reason it kept giving us an IP address in Germany.",
    "VPN.asia starts off flashy, but its apps are disappointing, website knowledge base virtually non-existent and there are only 40 servers available. The only positive aspect is that it allows you to safely and privately torrent and stream. If, however, you’d rather pay more to receive a much more advanced VPN service, with top speeds, 24/7 responsive customer support, thousands of servers across the world, proven no-logging policy, and a 30-day money-back guarantee, then you should give superior performers such as ExpressVPN a shot."
  ],
  "headers": {
    "3": "Price",
    "8": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "13": "Privacy and encryption",
    "18": "Support",
    "24": "Speed and experience",
    "31": "Verdict"
  },
  "links": {
    "VPN.asia": "https://vpn.asia/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-7676898488609151000"
  }
}