{
  "source": "https://www.techradar.com/reviews/intel-nuc-9-extreme-ghost-canyon",
  "title": "Intel NUC 9 Extreme (Ghost Canyon) review",
  "category": "computing",
  "updated": "2020-05-27T09:00:04Z",
  "author": "matt-hanson",
  "summary": "Tiny yet mighty",
  "verdict": "The Intel NUC 9 is in many ways a stunning bit of kit. It’s impressively small, while also giving you plenty of configuration options. It’s also the first NUC that can have a GPU installed, allowing it to handle games and graphically-intensive tasks. However, it comes at an incredibly high price.",
  "pros": [
    "Great design",
    "Compact",
    "Good performance",
    "Upgradable"
  ],
  "cons": [
    "Very expensive",
    "Gaming performance isn’t all that",
    "Large compared to previous NUCs"
  ],
  "article": [
    "The Intel NUC 9 Extreme (Ghost Canyon) is a compact small form factor PC that combines some of Intel’s latest tech, and can even pack a Nvidia graphics card, which means this formidable machine can compete with games consoles – and even possibly the upcoming PS5 and Xbox Series X.",
    "We’re big fans of Intel’s previous NUC (Next Unit of Computing) devices, which have continuously pushed our expectations of what small PCs can do, and the new Intel Ghost Canyon NUC promises to be an even bigger leap.",
    "And, while ealy NUCs were aimed more at businesses that wanted discrete PCs that could be hidden away in offices and used as desktop PCs – or to power information kiosks or digital advertising billboards – the Intel NUC 9 Extreme also aims to win over gamers and enthusiasts who want a powerful PC for the living room.",
    "The Intel Ghost Canyon NUC (also known as the NUC 9) is a bare-bones unit that can be configured in a number of ways. This means you can configure the NUC 9 depending on your needs and budget, but it also means if you want certain features or level of performance, things can get expensive – quickly.",
    "For example, you can get a base version with an Intel Core i5-9300H processor (NUC9i5QNX) for around $1,050 (about £900, AU$1,600). There’s also a version with an Intel Core i7-9750H processor (NUC9i7QNX) for around $1,250 (about £1,000, AU$2,000) and a version with an Intel Core i9-9980HK processor (NUC9i9QNX) for around $1,700 (about £1,400, AU$2,600).",
    "These bare-bones systems don’t come with storage, an operating system or RAM, so you’ll need to source those yourselves. However, some retailers are selling more fleshed-out kits with the essentials included.",
    "Simply NUC, for example, is selling the 9i5QNX with 8GB RAM and a 128GB SSD for £911 excluding VAT (around $1,100, AU$1,700). This is still without an operating system, but you can have Ubuntu installed on it for no extra cost, or Windows 10 Home for £90 (around $110, AU$170).",
    "So, there’s definitely flexibility with the NUC, and if you already have an SSD and RAM lying around, then that can save you a bit of cash. However, it also means buying one can be quite complex, and the price starts climbing rapidly when you begin adding components – many of which usually come with standard PCs. Buying the bare-bones kit, where you need to install some of the components yourself, isn’t for beginners.",
    "The review unit Intel sent us was the fully-specced out version, which comes with the eight-core, 16-thread Core i9-9980HK processor, an Asus Dual RTX 2070 8GB Mini graphics card, 16GB RAM, 380GB Intel Optane 905p SSD and a 1TB M.2 NVMe SSD, along with Windows 10. All these extra bells and whistles push the price of the Intel NUC 9 Extreme kit that we review here to an astonishing $3,000 (around £2,400, AU$4,550).",
    "That’s a hugely expensive PC, but while the specs are good, they’re not that good. You could buy a standard desktop PC that matches or exceeds those specifications for around a third of the price.",
    "How can the price be justified? It’s all down to the size of the thing. This is an impressively small PC, after all. However, if you want something small and compact, and still powerful, there are plenty of gaming laptops and mobile workstations that fit the bill, and again they can be a lot less expensive – though less upgradable.",
    "As an alternative to the upcoming PS5 and Xbox Series X, then the price rules this out as well. While performance could well be similar to the next-gen consoles – it was recently revealed that the impressive Unreal Engine 5 demo shown on PS5 hardware could be run on a PC with an RTX 2070 GPU – the next-gen consoles will likely be a heck of a lot cheaper.",
    "If so much of the high price of the Intel NUC 9 is down to its design, then it’d better have one heck of an aesthetic – and the good news is that this is indeed a stunningly small PC that looks fantastic.",
    "With dimensions of 9.4 x 8.5 x 3.8 inches (238 x 216 x 96mm), this is an incredibly small PC that can fit pretty much anywhere, and it’s one of a few PCs that wouldn’t look out of place in a living room. It certainly looks smaller and more attractive than Microsoft’s bulky Xbox Series X.",
    "However, for anyone who’s used a previous NUC, you might not be so impressed – this is a lot larger than other models. For example the Intel NUC 8 (Hades Canyon) measures 8.7 x 5.6 x 1.54 inches (221 x 142 x 39mm).",
    "This increase in size is primarily to do with the fact that you can now install a discrete GPU into the NUC 9. The NUC 8, for example, used onboard Radeon RX Vega M GL graphics.",
    "You’re limited with the GPU you can fit in the small chassis of the NUC 9 – the one we have installed is the Asus Dual GeForce RTX 2070 MINI.",
    "For anyone who wanted the NUC to be able to handle games and graphic-intensive workloads, then the increase in size will be worth it. If you’re not interested in adding a GPU, however, then you may be less impressed.",
    "Still, we really liked the design, being somehow both understated (its minimalist black look is stylish without being boring), while also a bit brash as well (the images of a skull on either side of the NUC 9, and the metal flight case it comes in are obviously appealing to enthusiasts and gamers).",
    "The fact that it packs so much hardware into such a small body is certainly impressive, and goes some way to justifying the high price tag.",
    "Being a modular PC with a strong emphasis on upgradability and customisation, it’s perhaps not too surprising to find that the NUC 9 is easy to open up, and while compact, most of the components are easily accessible for adding and upgrading.",
    "Back on the outside, there are plenty of ports. At the front, there’s two USB 3.1 ports, a memory card reader and audio jack. On the back, there are four USB 3.1 ports, two USB Type-C ports, optical audio out and a HDMI port. If you get a NUC 9 with a GPU, you’ll get additional video outputs, including DisplayPort.",
    "Overall, Intel is really relying on the design of the NUC 9 to do a lot of heavy lifting when it comes to justifying its price. With a compact, and attractive, look, plus an impressively easy to upgrade and modular design, it does go some way. But as we mentioned before, if you want something powerful and compact, there are laptops out there these days that will do just as good a job (bar the upgradability) for a lot less money. However, the ability to upgrade and tweak the hardware within the NUC 9 to some degree is certainly an attractive proposition.",
    "With a powerful 9th generation Intel processor, and for the first time the ability to install a discrete GPU, the NUC 9 Extreme Kit is a formidable bit of kit. Of course, because it’s a modular bare-bones PC, the performance of the NUC 9 will vary greatly depending on what you have installed.",
    "So, we can only really focus on the performance of the NUC 9 we got in for review, and as it’s the fully specced out version that costs over three grand, it’s also a model that very few people will actually buy.",
    "It’s a shame, as the performance is excellent. As a desktop PC, it runs Windows 10 with ease, and even the most intensive apps load quickly and run smoothly. If you do pop an RTX 2070 GPU in there, then you’ll have yourself a powerful workstation PC that can rival the likes of the iMac or Mac Pro when it comes to video editing and 3D rendering. The memory card reader at the front of the chassis is a nice touch for photographers and creatives who want to use this as a compact workstation. In fact, as a workstation PC, the price is a bit more understandable.",
    "However, with the RTX 2070 GPU, the NUC 9 can be an excellent gaming PC as well, and the compact size means that you could quite happily have it hooked up to your TV in your lounge.",
    "As you can see from our benchmarks, the NUC 9 does a decent job at gaming, though for the price you’d have hoped for more than 34fps on Metro, even at Ultra settings.",
    "On playing Metro Exodus, we found that the NUC 9 wasn’t up to running it at 4K or 1080p with all the graphical bells and whistles going. However, with a few tweaks, which included dropping the graphical settings to ‘medium’, while still keeping advanced lighting effects from ray tracing on, and enabling DLSS, we managed to get a very good experience at 4K.",
    "We also played Bioshock Infinite, an old game, but one that still looks lovely. This time, the NUC 9 had no problem at all running it at 4K with everything set to ‘max’.",
    "So, you’ll have to compromise with the latest AAA games, but slightly older games run brilliantly.",
    "Thanks to its size and performance, it’s arguably the closest a small form factor PC has come to challenging games consoles – apart from two rather major points. The first is that while it will offer gaming experiences comparable with the PS4 Pro and Xbox One X, it could struggle with the next-gen PS5 and Xbox Series X, which are aiming for 4K 60fps with modern games.",
    "The other major thing is that game consoles sell for around a tenth of the price of the version of the NUC 9 we reviewed. Plus, the upcoming consoles will also likely be a tiny fraction of the cost of the NUC 9.",
    "Add the fact that you could build a more powerful (though larger) gaming PC for less money, and it rules out the NUC 9 as a gaming device, quite frankly."
  ],
  "headers": {
    "3": "Price and availability",
    "12": "Design",
    "23": "Performance",
    "34": "Don't buy it if..."
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Simply NUC": "https://simplynuc.co.uk/",
    "selling the 9i5QNX": "https://simplynuc.co.uk/9i5qnx-full/",
    "recently revealed": "https://www.techradar.com/news/has-the-ps5-already-been-bested-by-a-mid-range-gaming-pc",
    "Intel NUC 8 (Hades Canyon)": "https://www.techradar.com/reviews/intel-hades-canyon-nuc",
    "Asus Dual GeForce RTX 2070 MINI": "https://www.techradar.com/news/asus-dual-geforce-rtx-2070-mini-is-a-powerful-gpu-for-intels-tiny-nuc-9-pc"
  }
}