{
  "source": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
  "title": "Ghost of Tsushima review",
  "category": "gaming",
  "updated": "2021-10-12T10:52:08Z",
  "author": "gerald-lynch",
  "summary": "Killer katana action, as Ghost of Tsushima sunsets the PS4",
  "verdict": "Ghost of Tsushima is an engrossing, blood-soaked and beautiful open world game, and a fitting swan-song for the PS4, even if it's lacking in some places in originality.",
  "pros": [
    "A beautiful world to explore",
    "Exciting and engaging combat",
    "Great variety in gameplay"
  ],
  "cons": [
    "Sticks to open-world staples",
    "Lead character is a bit dull"
  ],
  "article": [
    "Voted Game of the Year at the TechRadar Choice Awards 2021",
    "I’ve never played a game before that rewards you for writing a haiku poem, but that’s exactly what Ghost of Tsushima does.",
    "The long-awaited PS4 exclusive not only lets you live out your samurai dreams, slicing and dicing bandits and invaders alike, but also lets you fully inhabit the feudal Japanese setting that acts as its stage.",
    "What the game lacks in originality overall it makes up for with an impeccable commitment to respectfully rendering this historical era, resulting in a stylish smorgasbord of the best ideas seen in open-world gaming this generation, and a fitting swan-song to the PlayStation 4.",
    "Set in the year 1274, Ghost of Tsushima puts you in control of Jin Sakai, the only samurai to survive a brutal attack from an invading Mongol horde, led by Khotun Khan, grandson of Ghengis. The island of Tsushima has been ravaged by the invaders – farms are left burning, bodies lay strewn across the countryside, bandits take advantage of villages’ battered defences, and Lord Shimura (Jin’s uncle and the governor of the island) has been captured. As Jin, it’s up to you to recruit a rag-tag bunch of allies to force the Mongols back, and use both your samurai training and ninja-like stealth to conduct a guerrilla war against the aggressors.",
    "If you’ve played any open-world games in the wake of The Witcher 3, be that Assassin’s Creed: Odyssey or The Legend of Zelda: Breath of the Wild, you’ll know exactly what to expect from Ghost of Tsushima. Starting with just the most basic of weaponry and attacks, Jin will become a more accomplished samurai as he explores the map, earning better weapons and armor, and improved powers by exploring shrines, finding rejuvenating hot springs, and liberating encampments from Mongol troops, as well as navigating the twist-laden main story.",
    "It’s a huge game, with more activities and distractions than can be succinctly listed here. Ghost of Tsushima is filled with tasks at every turn, but does well to hide the box-ticking map icon checklist that other games in the genre fall foul of.",
    "This is in huge part down to its innovative exploration tools. Though you have access to a fog-of-war obscured world map, there’s no minimap or compass when you’re outside of menus. Instead, you have to make use of visual clues around the landscape to find points of interest, and make use of a ‘Guiding Wind’ that can direct you to tracked locations as you clamber up mountainsides and wade through sodden rice fields.",
    "It’s a great feature – mark an objective or spot on the map, and when you’re in the game the direction of the wind instead acts as a visual compass. If trees sway left, your destination lies to the west, for instance, while a column of smoke blowing towards you would indicate you need to make an about turn, whether on foot or on your trusty horse that accompanies you throughout the game.",
    "With long grass abundant, smoke plentiful and leaves kicking up in a bluster, it’s a great way to maintain a minimal HUD and keep you immersed in the action without making you feel lost. And, when no obvious destination presents itself, the wildlife of the island comes into play – golden birds fly towards the vicinity of secret locations, while foxes leave their dens to guide you to the location of buff-rewarding Inari Shrines. And, yes, you can pet the fox.",
    "If exploration is one core pillar of the game, the second would be combat. It’s swift, articulate, blood-thirsty, and challenging, but also empowering. As a weak Jin early in the game, even a lowly rag-wearing bandit can make mincemeat of you, but familiarity with its systems and the enhancements unlocked across the course of your adventure will have you wielding a katana like a master swordsman.",
    "As you’d expect then, swordplay is a major component of combat, and it’s pulled off incredibly satisfyingly here. Many encounters kick off with a ‘Stand Off’ – a bit like a do-or-die game of sword-swinging chicken, where you’ll eye up an opponent and wait for the exact moment when to make a deadly first strike, just like in classic samurai films.",
    "Once surrounded, however, you’ll have to be more methodical in your approach. Jin will gain access to heavy and light attacks, dodges, blocks and parries, and each of these can be modified by one of a number of different fighting stances, accessed by holding down R2 and hitting a corresponding face button, and each vital to taking on different sorts of opponents. Breaking the guard of a heavy-hitting giant foe requires a different stance to sizing up against a swift spearman for instance, and learning each enemy’s strength or weakness is vital to winning a fight.",
    "Successful actions in combat build a ‘Resolve’ meter that can be spent to heal Jin, or pull off powerful attacks unlocked later in the game, while completing missions and taking on exploration challenges around the map can also unlock charms which can be added to your weapons to improve your stats and skills. There’s a lot of combat in Ghost of Tsushima, so it’s a relief to say it remains fun throughout.",
    "An alternative approach, however, is always available, and Jin is just as adept at being the stealthy, sneaky ‘Ghost’ ninja that the game’s title alludes to. There’s the de rigueur detection meters and now-standard ‘enhanced listening’ view that lets you track and spot enemies with a red outline even when obscured by obstacles, as well as one-hit assassinations if you creep up on an unsuspecting enemy.",
    "Ghost of Tsushima’s stealth sections are almost always optional, but always enjoyable too – there are plenty of hiding spaces from which to plan an attack, lots of verticality to camps from which to survey enemy patrols, and a good arsenal of ranged weapons to use to distract or dismember, from explosive arrows shot from your bow to wind chimes and smoke bombs.",
    "With stealthy moves a ‘dishonorable’ approach based on his samurai code, Jin often despairingly narrates these attacks – though they are sometimes vital. Hostage situations, for instance, quickly turn sour if Jin doesn’t remain undetected.",
    "Defeating enemies in combat or taking on story missions will eventually award you with a ‘Technique Point’ which can be spent in a skill tree. It’s relatively expansive, but not overwhelming, and it’s great that every unlocked skill feels like it has a meaningful impact on the way you can play the game. It’s worth noting too that you’re never forced down a samurai or ninja path – you can mix and match skills to your preferred play style.",
    "The roads of Tsushima are dangerous and surprisingly busy, but very few encounters are merely for the sake of more combat. Often, coming across a group of wandering bandits or Mongols will be accompanied by the rescue of a civilian prisoner – freeing them and having a quick chat will open up new points of interest on the map, from collectibles to stat-increasing shrines, side-missions and Mongol camps. They’re all varied and enjoyable diversions.",
    "You can build your Resolve, for instance, by slicing bamboo training sticks with a quick-tapping-button-order memory game, find high-powered charms by navigating treacherous paths to Shinto Shrines like in a platform game, or unlock cosmetic items by taking a moment to write a haiku at points of natural beauty across the map. The world is littered with collectibles throughout, from resources that can be exchanged for upgrades at merchants, to records and artifacts that reveal more about the cultures and traditions of the two warring factions.",
    "Some of the best moments of all, aside from the show-stopping main quest battles, come in the form of Mythic Quests – multi-part missions hidden across the map that reward you with high-powered goodies such as rare armor or special moves. They’re tied to legendary warriors from Tsushima’s past that you can find out about by listening to musicians and storytellers on your travels (presented with lovely calligraphy-style animations).",
    "Each is distinct and worth tracking down, and could have you pitted against master warriors in boss-battle duels, scouring the island with a landmark-guiding treasure map, or infiltrating heavily guarded encampments. They’re not to be missed, not least of all because the rewards are often incredibly powerful.",
    "Much has been written about the influence of Akira Kurosawa’s classic samurai films on Ghost of Tsushima, and even beyond the black-and-white ‘Kurosawa Mode’ in-game filter, which recasts the colourful landscapes in monochrome shades and film-grain noise, it’s plain to see. From tense one-slice-kill standoffs to the smokey, burned-out ruins of destroyed castles and temples, the game plays like an interactive Kurosawa film. It’s breathtakingly realized – you’ll truly feel like a samurai as you play.",
    "What’s a shame then is that, in terms of the human elements of the tale, developers Sucker Punch seem to have drawn from Kurosawa’s more dour films like ‘Ran’ than the energetic and madcap gallery of characters found in, say, ‘Seven Samurai.’",
    "With a couple of exceptions, notable for the glint of comic relief they bring, everyone in Ghost of Tshushima is just so serious, all the time. Yes, horrible atrocities are going on around them, but without a little levity as contrast it becomes hard to care about the plight of Jin and his associates.",
    "Jin, for instance, will divide players. He’s every inch the classic samurai – stoic, honorable, but... a little bit humorless. He’s more Altair than Ezio. Torn between his samurai tradition, requiring him to face opponents head-on, and a ruthless new enemy that obliterates all but the most stealthy and cunning of adversaries, Jin must decide whether honoring the past is more important than saving the lives of those in the present. As a result, he’s always very serious, if not serene, and his tale of redemption and revenge is carried more excitingly by the theming and set pieces than his personality.",
    "But what phenomenal world-building this is to be had here. The ‘Assassin’s Creed: Japan Edition’ jibes do ring true as you play, but, that’s no bad thing at all – Ubisoft games are applauded for their attention to historic detail, and Ghost of Tsushima is every bit their equal when it comes to presentation. From the plucks of the Koto to the twang of the Shamisen, Tsushima is lushly orchestrated and beautifully rendered, with red and golden maple leaves cascading around Jin from fort to shrine, hot spring to temple. Tsushima is constantly in motion, rolls of grass bending with the swish of a katana and fireflies lighting canopy-covered, stoney forest paths. Playing on a PS4 Pro, performance is consistently solid, with no sign of slowdown or stutter, even with 4K HDR visuals in play. Mileage may vary with the base console, however.",
    "Familiarity with the open-world genre may breed contempt here, though. We’re truly spoiled.",
    "Ghost of Tsushima’s individual components build to a satisfying whole, and its historical world is a wonder to explore and among the best we’ve ever seen visually.",
    "But its side stories aren’t quite as compelling as The Witcher 3, its systems less playful and experimental than Breath of the Wild, its world less convincingly alive than Red Dead Redemption 2 and its scale less ambitious than Assassin’s Creed: Odyssey.",
    "Each of these contemporaries had their own failings, of course, and Ghost of Tsushima is admirable and attractive for being consistent and fun to play throughout. You can, and will, lose dozens upon dozens of hours to its engaging, blood-soaked combat and wondrous, mystery-filled landscape. Just don’t expect Ghost of Tsushima to break the open-world mold."
  ],
  "headers": {
    "4": "Tsushima island is a joy",
    "10": "Killer katanas and smoke bomb stealth",
    "18": "Samurai side quests and lore-filled locations",
    "22": "Kurosawa style, but not so much soul",
    "27": "Verdict"
  },
  "links": {
    "TechRadar Choice Awards 2021": "https://www.techradar.com/news/dell-g15-ryzen-edition-voted-best-budget-laptop-at-techradar-choice-awards-2021",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "The Witcher 3": "https://www.techradar.com/news/gaming/consoles-held-the-witcher-3-s-graphics-back-but-pc-gaming-is-far-from-cursed-1294818",
    "Assassin’s Creed: Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-release-date-news-and-rumors"
  }
}