{
  "source": "https://www.techradar.com/reviews/asus-rt-ax86u",
  "title": "Asus RT-AX86U review",
  "category": "computing",
  "updated": "2020-08-21T12:13:16Z",
  "author": "cliff-joseph",
  "summary": "Not just for gamers - Asus’ latest Wi-Fi 6 router is an impressive all-round upgrade",
  "verdict": "The Asus RT-AX86U provides great Wi-Fi 6 performance, with many features that will appeal to hard-core gamers. However, it’s versatile enough to appeal to other users too, offering good range and signal strength, and an impressive set of security features and parental controls.",
  "pros": [
    "Fast Wi-Fi 6 performance",
    "Strong gaming features",
    "Good parental controls",
    "Good wired connectivity"
  ],
  "cons": [
    "It’s not cheap"
  ],
  "article": [
    "The new Asus RT-AX86U is an attempt to provide a high-performance router suitable for gaming and other demanding tasks at a more mainstream price.",
    "Asus already has a range of specialist routers, called Rapture, that are designed purely for gaming. The Rapture routers are super-fast, but they’re also big, bulky and expensive, which makes the Asus RT-AX86U a compelling offering.",
    "It’s still not cheap, costing £229.99 ($249.99; AU$536.00), but that’s actually a competitive price for a high-performance dual-band router that supports the latest Wi-Fi 6 technology. There’s also a top-of-the range model, called the Asus RT-AX88U, which is even faster, and packed with additional ports for wired connections, but that costs over £350 (around $460/AU$640).",
    "The matte-black Asus RT-AX86U is more compact than many gaming routers, measuring just 242mm wide and 100mm deep. However, its upright design and the three large antennae that stick straight up from the top panel mean that it stands a full 320mm high, so you’ll need a fair bit of space if you want to give those antennae room to breathe (and there’s a sneaky fourth antenna hidden inside the router as well).",
    "It’s a dual-band router, supporting Wi-Fi 6 - aka 802.11ax - on the 2.4GHz and 5.0GHz bands, with a top speed of 5700Mbps, which should be more than fast enough to handle gaming, video and music streaming on most home broadband services. As well as providing really high speed, Wi-Fi 6 also uses new technologies such as OFDMA (orthogonal frequency division multiple access) to improve reliability when transmitting data to lots of devices all at the same time.",
    "Your computers and mobile devices will also need to support Wi-Fi 6 to get the full benefit of those advanced features, but Wi-Fi 6 routers are still compatible with existing devices that use 802.11ac Wi-Fi as well, so you don’t need to worry about compatibility problems when buying a new Wi-Fi 6 router such as this.",
    "The Asus RT-AX86U is future-proof too, as it includes two WAN ports for Internet connections - a standard Gigabit Ethernet port, and a faster 2.5 Gigabit port as well (for high-speed connections that most UK homes can only dream of…). There are also four additional Gigabit Ethernet ports for devices that need a wired connection, and two USB 3.2 ports for connecting USB storage devices that can be shared on your home network.",
    "Like many routers, the Asus RT-AX86U has a ‘quality of service’ (QoS) feature in its mobile app, which can prioritise performance for specific tasks, such as gaming or streaming video.",
    "However, the router itself also assigns one of its Ethernet ports to be a dedicated ‘gaming port’ and automatically gives priority to any device that has a wired connection to that port.",
    "The app also has a Mobile Gaming mode that can give priority to up to four mobile devices for gaming via Wi-Fi. And, if you’re brave enough to delve into the router’s web browser interface, there’s a special GeForce Now option that Asus has developed in conjunction with Nvidia.",
    "This is designed to improve performance when using streaming games services such as Nvidia's GeForce Now game streaming service, and it gives ‘hyper-prioritisation’ to selected devices, allocating up to 90% of the router’s available bandwidth in order to provide the best gaming performance possible.",
    "It’s not all about gaming though. The Asus app also includes plenty of other useful features, including a simple set-up process that starts by giving you the option of creating a single network that combines the 2.4GHz and 5.0GHz bands, or splitting the two bands into separate networks with different passwords.",
    "More advanced users also have the option of fine-tuning their network set-up by using a web browser interface on a Mac or PC, rather than using the simpler Asus app for iOS or Android.",
    "There’s malware protection provided by Trend Micro, and a good selection of parental controls, including content filters for unsuitable material, and a scheduling option to restrict Internet access to specific times. These security features and parental controls are better than those offered by some of Asus’ router rivals, and we’re glad to see that Asus doesn’t try to charge extra subscription fees for these features either.",
    "The Asus RT-AX86U doesn’t disappoint when it comes to performance either. It was able to push our 50Mbps Internet connection to the limit, actually squeezing a little extra speed out of it to hit 59.3Mbps for devices in the same room as our main broadband router.",
    "We also have an office at the back of the building that suffers from very poor Wi-Fi reception, but the RT-AX86U didn’t struggle at all there, holding steady at a healthy 58.9Mbps. That makes the Asus RT-AX86U a good all-round Wi-Fi upgrade offering good range and coverage, as well as high speeds for gaming, video and other demanding online tasks."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Design and features",
    "11": "Set-up and performance",
    "16": "Don’t buy it if…"
  },
  "links": {
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "gaming routers": "https://www.techradar.com/news/the-best-gaming-routers",
    "GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now"
  }
}