{
  "source": "https://www.techradar.com/reviews/typeform",
  "title": "Typeform review",
  "category": "computing",
  "updated": "2021-11-25T09:07:28Z",
  "author": "michael-graw",
  "summary": "Typeform is a great tool for creating engaging and highly customized surveys, but its paid plans can be very pricey.",
  "verdict": "Typeform is hard to beat if you want to get more respondents to engage with your surveys. But, the platform is pricey and may be too complex for short, simple surveys.",
  "pros": [
    "Logic jumps enable automatic customization",
    "Plenty of integrations for organizing data",
    "Questions can be paired with images and videos"
  ],
  "cons": [
    "Free plan is very restricted",
    "Paid plans are expensive",
    "Customization is too much for simple surveys"
  ],
  "article": [
    "Typeform is an extremely versatile data collection software. The platform offers quite a bit of flexibility in creating surveys, forms, and questionnaires. Templates and an interactive designer make the design process fast and easy. While Typeform offers a free plan, you’ll pay handsomely for most of the software’s best tools.",
    "So, is Typeform the right data collection tool for you? Let’s dive deep into a review of this software to find out.",
    "Typeform has a free plan that’s useful, but very restricted compared to the software’s paid plans. You can only create 3 forms and they’re limited to 10 questions per form, with no ‘logic jumps’—customized routing for respondents based on their answers to previous questions. In addition, you can only receive up to 100 responses per month.",
    "Typeform paid plans start with the Essentials plan for $35 per month, which unlocks most of the software’s functionality. You get an unlimited number of forms and questions, the ability to collect payments through Typeform, custom form branding, and up to 3 logic jumps per form.",
    "The Professional plan, for $50 per month, upgrades you to 5,000 responses per month and an unlimited number of logic jumps per form. If you need an even higher response limit, there’s the Premium plan for $70 per month.",
    "Typeform is impressively versatile and offers good tools both for designing forms and crunching the data you collect.",
    "Logic jumps are what set Typeform apart from other online survey tools. With a logic jump, you can create multiple forms in one. Depending on how a respondent answers a question, they’ll be taken down one of two alternative paths for the remainder of the survey. You can have multiple logic jumps per form, allowing you to automatically tailor your questions to the individual answering.",
    "It’s hard to overstate how useful this tool is. It allows you to collect high-level data for some respondents, while diving deep into the weeds for others. Or, for businesses, Typeform’s logic jumps let you offer multiple services to clients from a single form—simplifying the process to boost your conversion rate.",
    "Typeform helps you jumpstart the survey design process with a wide range of templates. These are built around different business-centric purposes, such as lead generation or customer feedback. Even if you can’t find a template that exactly matches the goals of your survey, it’s very simple to customize any template as if you were starting from scratch.",
    "Typeform offers a huge array of extensions that you can use to improve your question design or crunch survey data. Some example integrations include Google Docs, Airtable, Slack, and Salesforce, so there’s a good chance that Typeform will be compatible with any other software you’re using.",
    "Typeform’s browser-based form designer is intended to work like a notebook. It feels intuitive right from the get-go, since you can simply type out questions and add multiple choice options using bullet points. The designer is slightly overkill if you just want a basic survey with little customization, but it excels at helping you create surveys that stand out.",
    "One way it does this is with customizable blocks. You can pull in responses from any earlier question, such as the respondent’s name or email, into the text of another question. Alternatively, you can use those earlier responses as multiple choice options. For example, it’s easy to ask a survey respondent how they’d like to be contacted based on the information they’ve already entered.",
    "Questions are displayed as slides rather than all on one page, which can get a little repetitive for long surveys. But, this style is highly engaging and allows you to easily add images, videos, or other visual content to go with each question. You can also change basic stylistic elements like font and color to match your brand.",
    "A neat aspect of Typeform is that you’re not limited to multiple choice or open-ended responses. You can create multiple choice questions that use images rather than text, yes/no questions, or contact information entry fields that automatically check whether you’re being given a valid email or phone number. Of course, it’s easy to decide whether a question is required or not as well.",
    "Typeform only offers support via email, and getting help can be frustrating since you need to go through a form describing your problem first. That said, the company responds within a day or two to most inquiries. It’s also relatively easy to find answers to most questions thanks to an extensive and searchable documentation library on the Typeform website.",
    "Typeform places a lot of emphasis on making surveys engaging in hopes of increasing your response rates. However, the service is significantly more expensive than competitors like Jotform and SurveyMonkey. You lose out on features like logic jumps with these platforms, but they might be worth looking into if you just need basic forms that can handle a high volume of responses.",
    "Typeform is a sophisticated data collection tool that makes it fast and easy to design highly interactive surveys. The platform’s support for logic jumps is a huge advantage if you need to make a single form that can cater to a wide range of respondents. On top of that, the ability to customize almost every aspect of your questions and integrate with a number of other software platforms means that it’s easy to fit Typeform into your existing workflow.",
    "However, you can expect to pay quite a bit for Typeform’s capabilities. The software is more expensive than many of its competitors, and it’s likely overkill if you just need to make a few, less customized forms."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "10": "Interface and in use",
    "14": "Support",
    "15": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "custom form": "https://www.techradar.com/best/best-online-form-builder"
  }
}