{
  "source": "https://www.techradar.com/reviews/chuwi-hi10-xr-2-in-1-convertible-tablet",
  "title": "Chuwi Hi10 XR 2-in-1 convertible tablet review",
  "category": "computing",
  "updated": "2020-12-24T10:41:58.560Z",
  "author": "desire-athow",
  "summary": "The new netbook refreshed for 2020",
  "verdict": "The Chuwi Hi10 XR is a bargain despite some clear flaws. Its exceptional value for money combined with a good hardware combination make it a very worthy rival to the more popular Surface Go tablet.",
  "pros": [
    "Great if you like small packages",
    "Exceptional value for money, especially as a bundle",
    "Good performance"
  ],
  "cons": [
    "Keyboard is too cramped",
    "Storage performance could have been better",
    "Poor battery life",
    "The touch pad is tiny"
  ],
  "article": [
    "We are surprised that Chuwi decided to bring back an old form factor, the 10.1-inch WIndows tablet. The company has an Android equivalent called the Hipad, a veiled reference to Apple’s iPad, but hasn’t dabbled with this size since 2016, when we reviewed our first Chuwi product, the Hi10, which we said back then “The Chuwi Hi10 is a capable tablet which hits a sweet spot delivering the sort of performance that will suit the average Joe without breaking the bank”. Fast forward almost five years later and let’s see how its spiritual successor performs on a very different landscape.",
    "You can buy the Hi10 XR from Chuwi directly for $249. Add in the keyboard and the stylus pen for $20 each. A fully kitted Hi10 XR would therefore cost $289. In comparison, the Surface Go retails for $399.99 by its own.",
    "We received the tablet and the keyboard bundle and shall look at the duo together. Clearly, the target seems to be the Microsoft Surface Go tablet (and to a lesser extent the Surface Go 2) but the Hi10 XR is close enough to the original Hi10 to wonder whether Chuwi isn’t just looking for new ideas from an old playbook.",
    "The similarities with its predecessors are troubling: same screen size (10.1-inch), same screen resolution and aspect ratio (16:10, 1920 x 1200 pixels) and almost the same size/weight (262 x 167 x 8.8mm, just under 600g). The Hi10 XR also has a rear 5-megapixel camera and a front-facing 2-megapixel one. It feels and looks solid thanks to a CNC full metal body and what Chuwi coins “anodic sandblast oxidation processes” to give it that smooth finish. The screen is glossy - as expected - and has thick bezels (between 15mm and 22mm), an indication of the use cases intended for the tablet.",
    "It connects via two connectors on the base to a physical docking keyboard in stark contrast to the lighter but also less capable keyboard cover of the Hi10 or the Surface Go.",
    "That peripheral adds two USB Type-A ports to the four ports found on the tablet (two USB Type-C, one microHDMI and one audio port) all found on the left edge of the tablet, next to a microSD card. The power button and a volume rocker are located on the top edge.",
    "The keyboard is not perfect though; it is thicker than the tablet, doesn’t contain an additional battery and once docked, the tablet-turned-screen has limited folding ability.",
    "Inside the Hi10 XR is a new favourite of models targeted at the entry level market, the Celeron N4120, which is based on the Gemini Lake architecture, comes with four threads, four cores and 4MB of cache. It has a 9th gen UHD Graphics 600 GPU and can turbo boost to 2.6GHz. Perhaps more importantly, despite still using an “old” 14nm manufacturing process, it was launched in 2020, which means that Intel has had years of experience and expertise on that technology when building the N4120.",
    "Paired with it are 6GB of LPDDR4 and 128GB eMMC 5.1 onboard storage (S0J59X), the same as the one used by the Chuwi Larkbox mini PC. We’d preferred 8GB for better WIndows performance and a true SSD rather than eMMC. Elsewhere there is a rare Intel Wireless-AC 9461 radio card (one that supports Wi-Fi 5 and Bluetooth 5.1) and a 26.6WHr battery.",
    "Let’s talk about the keyboard dock first; it is slightly tapered at one end and therefore presents the typing surface at a slight angle. Since you can’t break the laws of nature, the available surface area is simply too small to lay out the keys in an optimal way. Chuwi engineers had to sacrifice the surface area of the keys and the distance between them and ended up with a compromise too far in our opinion. They could have gone for an edge-to-edge keyboard, pushing it up nearer to the hinge and freeing more space for the touchpad. But we can’t be too critical given this $20 keyboard is essentially a freebie.",
    "The gorgeous IPS display has a higher-than-expected resolution and together with a small diagonal, provides one of the highest pixel densities (and therefore sharpness) of any Windows PC or tablets we’ve seen lately at 224dpi. Even out of the box, colours pop out of the screen with good enough contrast to provide a great picture quality thanks partly to the full lamination. Oh and it does support the Hi Pen, a 4096 pressure-level stylus.",
    "Performance wise, it is good without being exceptional. The N4120 is speedy but the entire device is pulled down by the poor eMMC storage. At just under 3hr48 (228 minutes), the Hi10 XR achieves an excellent 0.114Whr per minute. This metric gives a rough idea how energy efficient (or inefficient) the device is on this particular platform. Energy sipping components (the CPU, fewer RAM, eMMC and a smaller screen) explains why the Hi10 XR lasted nearly four hours despite having a comparably tiny battery.",
    "You want the smallest possible footprint. The Hi10 XR is competitive with the Microsoft Surface Go when it comes to size but it is slightly heavier. The weight gap between the two increases once the keyboard is taken into consideration.",
    "You want a convertible laptop/tablet on bargain. For all its faults, one needs to consider that the Hi10 XR is faster, has more system memory and more storage than its Microsoft rival and yet costs far less even with the bundled keyboard and pen.",
    "If you think you will like small laptops and have never tried one before. It might sound preposterous but do try out working on such a small keyboard before committing to buying the Chuwi Hi10 XR (or indeed, any laptop with a small keyboard and touchpad). Either get an old second hand keyboard for 10.1-inch tablets from your favourite online auction site or even cheaper, do a print out to scale to appreciate its dimensions. You might save yourself a sore disappointment.",
    "You want a long battery life. The Hi10 XR lags behind the competition at just under four hours despite having a slightly bigger battery. Microsoft however has the expertise to tweak power consumption on its tablet.",
    "If you want business features. There’s no fingerprint reader, Windows Hello compatibility or hardware-based TPM 2.0 functionality."
  ],
  "headers": {
    "1": "Price and availability",
    "2": "Design and features",
    "7": "Hardware specs",
    "9": "Performance and In use",
    "12": "Buy it if",
    "14": "Don’t buy it"
  },
  "links": {
    "Hi10": "https://www.techradar.com/reviews/pc-mac/tablets/chuwi-hi10-windows-tablet-1315022/review",
    "Hi10 XR from Chuwi": "https://store.chuwi.com/products/hi10-xr",
    "Microsoft Surface Go": "https://www.techradar.com/reviews/microsoft-surface-go",
    "Surface Go 2": "https://www.techradar.com/reviews/microsoft-surface-go-2",
    "Chuwi Larkbox mini PC": "https://www.techradar.com/reviews/chuwi-larkbox-thin-client-mini-pc"
  }
}