{
  "source": "https://www.techradar.com/reviews/anyburn",
  "title": "AnyBurn DVD burner review",
  "category": "computing",
  "updated": "2020-09-09T14:53:32Z",
  "author": "binay-gupta",
  "summary": "A complete and free solution for disc burning",
  "verdict": "Those looking for an easy-to-use, free, and powerful disc burning application with all the essential tools will find AnyBurn 5.0 is a great choice – particularly for older PCs given its minimal system requirements.",
  "pros": [
    "Flexibility and ease of use",
    "Minimal hardware requirements",
    "Impressively fast performance",
    "Decent online tutorials provided"
  ],
  "cons": [
    "Does not support drag and drop for files",
    "Does not copy multisession discs"
  ],
  "article": [
    "AnyBurn 5.0 is a robust disc burning app that’s flexible and easy to use, not to mention well-supported (running on Windows XP or better – not that you should still be using that particular version of Windows, as it’s a long way out of support now).",
    "AnyBurn is freeware, and proof of the old adage that good things come in small packages – another plus point here is that the app is light on system resources. It also benefits from an intuitive interface.",
    "AnyBurn 5.0 benefits from a well-designed interface: a simple yet engaging traditional Windows-based UI that does not require the user to have any special tech knowledge. The software installation procedure is easy and hassle-free.",
    "AnyBurn presents all of its features in a separate pane, from which you can select and perform disc burning tasks. You can easily select the burning speed and the target drive. The settings allow you to verify the written data, finalize the disc, and eject it after burning.",
    "You can use the AnyBurn software to burn files to a disc, copy a disc, or erase a rewritable disc, or even to create an image file from other files or discs. You can also easily convert images to ISO or BIN/CUE and view the disc or drive properties. Ripping an audio CD is also available for MP3, FLAC, APE, WAM, and WAV formats.",
    "The ability to create backups to discs – whether CD, DVD or Blu-ray – is also provided.",
    "As we’ve already touched on, one of the best features of this application is that it doesn’t demand much in the way of your PC’s resources, using up little of your CPU’s precious power, and consuming hardly anything in the way of memory either. The system requirements are extremely low, and AnyBurn is capable of running on an old Intel Pentium 166MHz with only 64MB of memory.",
    "The program is generally responsive and tasks are completed swiftly.",
    "The application comes with support for eight languages: English, French, Polish, Chinese, Italian, Japanese, German and Spanish.",
    "These are a series of tutorials in text form on the AnyBurn website describing the application’s standard functions in detail. These include text-based tutorials on burning audio CDs from various file formats, ripping audio CDs to multiple formats, and even creating bootable USB drives for Windows 7/8/10. You can also get information on the AnyBurn command line functions and their use from these tutorials.",
    "For any software-related complaints or queries, users can send a message to support@anyburn.com. There’s also a contact form on the official website, and the AnyBurn team promises to reply via email as soon as possible.",
    "AnyBurn 5.0 is a robust CD/DVD burner which is free and commendably user-friendly. It allows you to perform a host of CD and DVD burning functions, with detailed tutorials provided online. AnyBurn’s developers seem vigilant enough to work on any user grievances and to modify the app and interface as necessary in respect to the feedback they receive.",
    "The best free DVD burner apps"
  ],
  "headers": {
    "2": "Features",
    "8": "Support",
    "11": "Final verdict"
  },
  "links": {
    "AnyBurn 5.0": "http://www.anyburn.com/",
    "best free DVD burner": "https://www.techradar.com/best/the-best-free-dvd-burner"
  }
}