{
  "source": "https://www.techradar.com/reviews/corsair-dark-core-rgb-pro-wireless",
  "title": "Corsair Dark Core RGB Pro Wireless review",
  "category": "computing",
  "updated": "2021-03-31T19:05:54Z",
  "author": "michelle-rae-uy",
  "summary": "Wireless at its finest",
  "verdict": "For a wireless gaming mouse, the Corsair Dark Core RGB Pro delivers incredible performance with no noticeable latency and plenty of versatility.",
  "pros": [
    "Low latency",
    "Very robust software",
    "Comfortable to use"
  ],
  "cons": [
    "Not cheap",
    "Not for claw grip gamers",
    "More difficult to use when wired"
  ],
  "article": [
    "The Corsair Dark Core RGB Pro’s mission statement is to “win without wires,” and it succeeds. The Corsair Dark Core RGB Pro isn’t just an excellent wireless mouse for gaming, it’s one of the best gaming mice, full stop.",
    "While other gaming mice out there, wireless or otherwise, have you fumbling about in your game, the Corsair Dark Core RGB Pro certainly earned its “Pro” moniker, despite a couple of limitations that have reared their ugly heads during our testing.",
    "In terms of performance, the Dark Core RGB Pro is impeccable – fast, accurate and extremely responsive. Design-wise, it’s practically a dream with that dynamic and customizable RGB lighting, eight fully programmable buttons and a textured rubber palm rest.",
    "The Corsair Dark Core RGB Pro will get you through the most intense fights you can imagine, and will look and feel good doing it. Even though a couple of foibles – namely its stiff charging cable that makes wired gaming more difficult and its obtuse customization software – may hold it back from becoming a perfect gaming peripheral, they won’t really affect your overall gaming experience.",
    "The best part is that while other wireless gaming mice of its caliber may cost you a pretty penny, this one has a mid-range price tag, making it pretty darn affordable for everyone.",
    "The Corsair Dark Core RGB Pro comes in at $79 (£89, about AU$125) so it’s not exactly in the budget sphere. While it may not be as cheap as the Corsair Harpoon RGB Wireless, which will only set you back $49 (about £40, AU$70), the added price is worth it, considering what the Dark Core RGB Pro brings to the table.",
    "Next to the SteelSeries Rival 650, which costs $119 (£119, AU$169) and has inaccessible thumb buttons, and the high performing yet flawed Roccat Kain 202 AIMO, which retails at $99.99 (£89.99, AU$218) for the white model, this mouse is a great deal. It’s certainly a bargain compared to the Logitech G903, which could have been the perfect gaming mouse if it wasn’t held back by its exorbitant $149 (£149, AU$249) price and the fact that you need to spend even more to purchase its charging mouse pad and unlock its full potential.",
    "Unfortunately to Australian gamers, this mouse is readily available in the US and the UK, but you’ll have to import it if you want it in Australia.",
    "Many gaming mice take the gaming aesthetic to a whole new level while others try to keep it subtle. The Corsair Dark Core RGB Pro sits somewhere in the middle. While it has all the makings of a gaming mouse, with its 9-zone RGB lighting and generous share of buttons, it doesn’t get too extreme. For instance, if the RGB zones aren’t lit up, you might mistake the Dark Core RGB Pro for a regular mouse.",
    "Of course, this is nothing like a regular mouse – unless you need eight fully programmable buttons for getting your work done and sharing a vacation’s worth of badly-shot photos on Facebook. In addition to the left and right buttons, as well as the middle scroll wheel, it has DPI up and down buttons so you can adjust DPI on the fly, a profile switch button and forward and back buttons.",
    "Again, they’re all customizable via Corsair’s iCUE software for setting up your macros or alternately remapping it to your preference. If you need a whole lot of macros for gaming, you’ll probably feel like there aren’t enough buttons on this mouse for you, especially because you’d want to keep the DPI up and down buttons for their intended purpose.",
    "Also, we would prefer the forward and back buttons to be positioned further back for easier access. But, that’s just personal preference, and their location has little impact on our gaming during our tests.",
    "Each of the nine RGB zones are customizable via the software. That’s typical of many gaming mice, but it’s still worth mentioning as you can honestly do a lot with them. You have the entire color wheel to choose from, and there’s also a plethora of effects on hand. That’s not to mention that the zones are impressively bright and vivid. If you’re a fan of immersive RGB lighting, you’ll appreciate how Corsair pulled it off here.",
    "The Corsair Dark Core RGB Pro fits in our hand comfortably enough, though if you’ve got a claw grip, like us, you’ll certainly feel that extra space between your palm and the palm rest. Not that it makes it harder to game on, but if you’ve been using a mouse with a raised palm rest, it will take some adjusting.",
    "On the upside, if you have a palm grip, this mouse will feel extremely comfortable, especially with that textured rubber finish over the palm and thumb rests, which help keep your hand in place while gaming.",
    "If you like some bells and whistles, you’ll appreciate this mouse’s extra features, especially because they contribute to its versatility. The mouse has a removable right panel so you can switch between a normal smooth side grip or a textured one with a ring and pinkie finger rest. And behind this removable panel is a space to store the USB wireless receiver, so you won’t have to worry about losing it when you’re on the go.",
    "What really makes the Corsair Dark Core RGB Pro more versatile than its rivals, however, is its connectivity, of which it has three modes: Slipstream, Bluetooth and USB wired.",
    "The Slipstream, which is what Corsair calls its own wireless connection via a USB wireless receiver, might just be the best of the three. When connected via the Slipstream wireless receiver, you can actually use the mouse up to 60 feet away from your computer. It’s useful when you’re gaming on a bigger screen from the comfort of your couch or even presenting at a meeting or conference. We tested this up to 25 feet away, and it worked without issue.",
    "As for the USB wired mode, it’s actually the least favorable in our experience. The cable is nice and sturdy enough, but it’s also a bit stiff, which made using it more difficult. This mouse is clearly meant to be used wirelessly, and both the Bluetooth and Slipstream modes are impressive enough that you’ll even forget it’s a wireless mouse.",
    "Nearly impeccable performance and blazing fast speeds await you with the Corsair Dark Core RGB Pro. It delivers such power you’ll actually forget that you’re using a wireless mouse. There was no discernable latency, thanks to its sub-1ms speed, during our tests. And with 18,000 DPI and up to a 2,000Hz hyper polling rate, it gives you a massive advantage in gaming, whether or not you’re doing it competitively. The fact that it’s got extra sliding pads on the bottom for extra smooth performance makes it even more game-worthy, even when you’re not using a mouse pad and working with a slightly bumpy desk.",
    "We decided to test this mouse on a number of AAA games: Doom Eternal, Sekiro: Shadows Die Twice, A Plague Tale: Innocence, and Assassin's Creed Odyssey. And its performance is so good, it actually feels like an extension of our hand.",
    "It’s in Doom Eternal where we find this mouse’s performance most impressive. In the game, you always have monsters coming at you from all sides. So, not only are you constantly running at a target while shooting at it, but you also often have to quickly turn your field of view up to 180 degrees to check for more. And the Corsair Dark Core RGB Pro is able to keep up with those fast movements accurately.",
    "The sniper button might take you a second to figure out, but it definitely comes in handy, even in one or two situations in Doom Eternal. For example, there's one monster in the game that's a spider-cum-scorpion hybrid whose tail you have to shoot off, and the sniper function – which is essentially the profile switch button held down – works very well for that purpose.",
    "Comparing the Bluetooth and the Slipstream connections by playing Sekiro: Shadows Die Twice, we honestly couldn't tell a difference. Button responses on both have consistently been quick and accurate, especially when trying to block an onslaught of katana slashes. As for how useful the remapping function is, in Assassin's Creed Odyssey, we have remapped the forward and back buttons to unleash special abilities. And, doing so has allowed us to access them just slightly faster."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "8": "Design",
    "19": "Performance",
    "24": "Don’t buy it if..."
  },
  "links": {
    "wireless mouse": "https://www.techradar.com/news/best-wireless-mouse",
    "Corsair Harpoon RGB Wireless": "https://www.techradar.com/reviews/corsair-harpoon-rgb-wireless",
    "SteelSeries Rival 650": "https://www.techradar.com/reviews/steelseries-rival-650",
    "Roccat Kain 202 AIMO": "https://www.techradar.com/reviews/roccat-kain-202-aimo",
    "Logitech G903": "https://www.techradar.com/reviews/logitech-g903"
  }
}