{
  "source": "https://www.techradar.com/reviews/faxplus",
  "title": "Fax.plus review",
  "category": "computing",
  "updated": "2020-08-25T04:58:23.143Z",
  "author": "alex-mcomie",
  "summary": "Unmatched efficiency on desktop and mobile",
  "verdict": "Fax.plus provides an unmatched user experience on all devices at five price points for businesses of all sizes.",
  "pros": [
    "Modern, sleek design compared to other online fax services",
    "Convenient integrations with apps like Zapier and Slack"
  ],
  "cons": [
    "Doesn’t provide live support",
    "Slightly more expensive than some competitors"
  ],
  "article": [
    "While a fax machine may no longer be a practical investment, some industries and businesses still rely on faxes for certain types of communication. In this case, an online fax service is often the easiest way to send and receive faxes using your existing hardware.",
    "Fax.plus is one of the best online fax services. It comes with a modern design, robust security features, and integrations with productivity tools like Slack and Google Drive. In our Fax.plus online fax review, we’ll take a close look at the platform’s features along with its pros and cons compared to other electronic fax services.",
    "Users can subscribe to Fax.plus at one of four price points. A free trial is also available for up to ten pages. From there, additional pages cost 20 cents each. All subscriptions are discounted when billed annually rather than monthly.",
    "The Basic plan costs $5.99 per month and supports up to 100 pages, with additional pages available for ten cents each.",
    "Upgrading to Premium ($11.99/month) or Business ($19.99/month), increases the limit to 300 or 800 pages while reducing the cost of additional pages to five cents each. Business contains additional features like multiple fax numbers and Slack integration.",
    "Finally, Enterprise costs $59.99 per month for up to 3,000 pages, while additional pages cost just three cents each. Enterprise users gain access to the full Fax.plus toolkit, including features like priority support, data residency, and a Fax.plus API.",
    "Fax.plus also provides custom high-volume pricing for businesses that need more than the standard subscriptions offer.",
    "Fax.plus makes it easy to send faxes online or through your existing email client (email to fax). In addition to the web app and mobile app, you can download Fax.plus for a wide range of platforms including add-ons for Chrome, Word, and Google Drive.",
    "With Fax.plus, you’ll also have access to features like contacts and groups, image optimization for higher-quality faxes, and online signatures on DOC, PDF, TIF, and JPG files. Enterprise accounts support multiple fax numbers and centralized team management with an unlimited number of users.",
    "You can create a Fax.plus account through Google or Facebook or by entering your email address and creating a password. You’ll have the opportunity to select a fax number during setup from over 40 countries. Users at the Premium tier and above can also port an existing number to Fax.plus.",
    "The setup process only takes a few minutes. Once you’ve finished signing up, you’ll be able to send and receive faxes. The Fax.plus Help Center has all the information you need to get started.",
    "Fax.plus provides an excellent set of features and tools, but its interface truly differentiates the service from the competition.",
    "While many online fax services have dated or basic designs, Fax.plus has the interface you expect from a productivity tool in 2020. Whether you’re on a desktop or mobile device, it’s simple to send and view faxes, manage teams, access support, and more.",
    "When you send a fax through Fax.plus, it should arrive at the destination in just a few minutes. Fax.plus provides a confirmation page for every fax sent, along with a unique QR code that can be used to validate the transmission.",
    "Fax.plus protects data using a variety of powerful security measures. Documents are encrypted both during the transmission and while being stored. The service is also HIPAA compliant. Enterprise users can view access logs, including each user’s device and IP address.",
    "You can add another layer of protection to your account by enabling two-factor authentication under Security in the Profile tab. With Fax.plus, Enterprise subscribers can manage a variety of advanced security features such as two-factor authentication enforcement, data residency, and even the option to keep data off of Fax.plus servers. The service is also compatible with most authenticator apps.",
    "With Fax.plus, you’ll have access to a comprehensive Help Center along with additional support resources. The Help Center contains guides for different features as well as answers to common questions.",
    "Both free and paid users can also contact Fax.plus directly through a dedicated web form. Priority support is available for Enterprise subscribers. This is the only option for one-on-one help—there’s no phone or live chat support, and the contact form doesn’t provide hours or an estimated turnaround time.",
    "The main disadvantage of Fax.plus is its pricing. Some platforms are even more expensive, but others charge slightly or significantly less for the same number of pages.",
    "MetroFax, for example, charges just $12.95 per month for 1,000 combined sent and received pages. Fax.plus, on the other hand, offers 800 pages for $19.95 per month through the Business subscription. This works out to nearly twice as much money per page.",
    "That said, Fax.plus provides several advantages compared to MetroFax and other cheaper programs. Fax.plus has a more professional design, and MetroFax doesn’t offer two-factor authentication or the same integrations with other tools.",
    "With robust security and support as well as a sleek interface, Fax.plus is clearly one of the best online fax services currently available. It’s a particularly good option for large businesses that need to manage multiple users within the same account.",
    "Furthermore, Fax.plus is compatible with the most common devices and productivity tools, making it easy to integrate into your existing practices. While it isn’t the cheapest email to fax platform, it offers more than enough benefits to be worth considering for any business."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features and utilities",
    "9": "Setup",
    "11": "Interface and performance",
    "14": "Security",
    "16": "Support",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "fax machine": "https://www.techradar.com/news/best-fax-machines",
    "online fax service": "https://www.techradar.com/best/best-online-fax-service",
    "Fax.plus": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1332270086434188800&xs=1&url=https%3A%2F%2Fwww.fax.plus%2F%235e6a39c24a139&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffaxplus",
    "Basic plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9251793161031617000&xs=1&url=https%3A%2F%2Fwww.fax.plus%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffaxplus",
    "Premium": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6863673664234218000&xs=1&url=https%3A%2F%2Fwww.fax.plus%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffaxplus",
    "Enterprise": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1372381802931585800&xs=1&url=https%3A%2F%2Fwww.fax.plus%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ffaxplus",
    "MetroFax": "https://www.techradar.com/reviews/metrofax"
  }
}