{
  "source": "https://www.techradar.com/reviews/marshall-emberton",
  "title": "Marshall Emberton review",
  "category": "audio-visual",
  "updated": "2020-09-04T16:06:44Z",
  "author": "jennifer-allen",
  "summary": "A classy looking and a fairly practical speaker",
  "verdict": "The Marshall Emberton is a stylish looking speaker, looking like a mini guitar amp. It lacks some power in its audio performance, but a strong battery life and waterproofing makes it an appealing portable speaker.",
  "pros": [
    "Looks cool",
    "Great battery life",
    "Durable design"
  ],
  "cons": [
    "No microphone",
    "Not particularly powerful at high volume",
    "No voice assistant"
  ],
  "article": [
    "The Marshall Emberton Bluetooth speaker almost looks like a novelty gift you get for someone when you couldn't afford the full and 'real' thing. It's effectively a miniaturized version of a Marshall guitar amp, and that immediately makes it look stylish and cool.",
    "Underneath that classy exterior is a competent portable speaker in its own right that might lack a bit of power and extra functionality for its price of $149.99 / £129.99 / AU$249.99, but it's still appealing stuff thanks to being super portable and roadworthy.",
    "While many Bluetooth speakers in this price range bundle in many features, the Marshall Emberton keeps things pretty simple. It's a fairly rugged and immensely portable speaker that you can easily toss in your bag and take wherever you're going. It only weighs 0.7kg and it's small enough to hold in one hand. It also has IPX7 water resistance so you won't have to worry about this waterproof speaker falling in the pool or getting wet.",
    "However, while the Marshall Emberton looks great and has the basics covered, it lacks some key features we'd normally expect to see. That includes a microphone for receiving calls through the speaker and – connected to that – a lack of voice assistant support, though the latter isn’t necessarily to be expected from a portable speaker. There's no app support either so you can't tweak the equalizer like you can with many other Bluetooth speakers. It doesn't even have a 3.5mm AUX input.",
    "Design-wise though, we can't fault the Marshall Emberton's looks. It genuinely does look like a mini version of a Marshall amp which means it looks great on a desk, living room side, or mostly anywhere else.",
    "At the top of the speaker is a gold four-directional joystick of sorts that's embedded in to look suitably stylish. Besides being a power button, it allows you to adjust volume as well as skip tracks. A glowing red light indicates remaining battery life to the side of it while there's a subtly placed Bluetooth pairing button too. It's all well designed and attractive looking.",
    "Perhaps understandably given the size of the Marshall Emberton, it sounds great up until a point. Keep the volume low-ish and you'll be impressed by the bassy sounds that emanate as you listen to your favorite tracks.",
    "That's not to the detriment of the mids or lows either with a fairly balanced sound whether you're relaxing with Childish Gambino's bouncy Feels Like Summer, or switching it up to more aggressive music like a walk down memory lane with Linkin Park's Points of Authority. It's ideal for placing in a room where you're taking some time out, or in need of quality background listening.",
    "Where things falter is if you whack up the volume too high. The music doesn't distort. It just seems to fade away a little, losing its powerful sense of bass, albeit without losing any clarity. It's not always an issue but we could see it being an annoyance in a party atmosphere where it may get lost in the mix of voices and other noises. Small occasions are where the Marshall Emberton shines through the most.",
    "Looking good and sounding mostly good, the Marshall Emberton is certainly appealing. It's hard not to be instantly beguiled by its looks the moment you pull it out of the box, even if it is style over substance.",
    "We'd have appreciated it if it had a bit more to offer for the price, such as voice assistant support or even simply a 3.5mm port for extra connectivity, but if you're simply in need of a good quality portable Bluetooth speaker that you can take with you wherever you go, this one's rather nice.",
    "Its 20-hour battery life and fast recharge time means you won't be stuck reliant on a power source too often, and it's rugged enough to withstand the odd knock and any issues with water, meaning it'll easily keep up with you and your travels. It's just a shame it doesn't offer a bit more for the price.",
    "The Marshall Emberton is quite widely available already, having launched in July this year. Priced at $149.99 / £129.99 / AU$249.99, there's no sign of discounts by third-party retailers yet and we suspect that won't be the case for a little while yet – though it may be worth keeping an eye out for Black Friday deals.",
    "There's also only one color scheme to choose from – black – but at least it means you won't have to spend time figuring out what suits your aesthetic most.",
    "As mentioned, the Marshall Emberton only comes available in one color, but that's not to its detriment because the speaker is irresistibly designed. It looks exactly like a shrunken down version of a regular Marshall amp meaning it's immediately endearing towards anyone with a penchant for rocking out and embracing the iconic look of Marshall gear.",
    "It's also suitably small in every way. You can easily hold it in one hand, even if you have quite small hands, and it only weighs 0.7kg so you'll barely notice it in your bag.",
    "While small, it's rugged enough to withstand a few knocks and its IPX7 water resistance means you can feel confident that it'll survive a trip to the pool, next to the bathtub, or when out hiking in poor weather. Often, stylish speakers lack the ruggedness that's needed from something so portable, but Marshall seems to have it covered here.",
    "Control-wise, everything is fairly straightforward. There's a button for Bluetooth pairing, along with a gold four-directional joystick that dictates power, volume adjustments, and the ability to skip tracks. It's a neat touch that has a kind of retro feeling to it. While other manufacturers are keen to embrace touch-sensitive technology, we appreciated the reliability that comes from this button that requires pressure. It also saves you the need to remember potentially complex gestures, just to perform a simple action. It's embedded into the top of the speaker so it's not like it's intrusive anyhow.",
    "To the right of the joystick is a glowing red light, which indicates how much battery life is remaining. More on how well the battery performs later, but it's useful to have a constant reminder of how it's doing rather than having to switch over to your phone to see what's going on.",
    "The only thing we found a little tacky about the Marshall Emberton is its startup noise. It sounds like every time you open a new menu in a Guitar Hero game, and it immediately grates. It's not the worst thing ever but it's out of place in an otherwise stylish device.",
    "Utilizing two 10-watt drivers and two class-D amplifiers, the Marshall Emberton accomplishes a fair bit for its size. It promises 360-degree sound which doesn't entirely work out but it sounds close enough to ensure a sense of a wide soundstage while you listen.",
    "The speaker offers consistently smooth mids whether you're listening to a heavily instrumental piece of classical music or feeling romantic with a dose of John Legend's All Of Me. In a similar vein, we also appreciated the crispness of the trebles exhibited when we went down a path of rediscovering David Bowie's discography. Turning a little more modern, the likes of Childish Gambino's Feels like Summer felt suitably balanced each step of the way.",
    "Where the Marshall Emberton falters a bit is when you crank up the volume. It still sounds good and you don't lose clarity, but any sense of powerful bass fades away. To be fair, this was at its highest volume, which we wouldn’t expect to sound perfect for a speaker like this – but it’s worth considering if you like your music bassy.",
    "It's only really going to be an issue if you expect it to hold its own in a large social gathering, which is a bit ambitious given the size of this speaker.",
    "Mileage will always vary when it comes to battery life depending on how high you crank up the volume, but the Marshall Emberton performed pretty well in our tests. It promised about 20 hours and we easily achieved that at a middling volume, although we'd expect it to dip a bit at higher volumes.",
    "That will matter less so though when you consider how quickly the Marshall Emberton recharges. Thanks to its USB-C connectivity, 20 minutes of charging gives you about five hours of playtime, which is great if you're in a rush and want to quickly give it a boost. We certainly found it very useful.",
    "The Marshall Emberton uses Bluetooth 5 for connectivity and we didn't run into any issues here. It took seconds to hook up and the extended range that comes from the specification is sure to come in handy if you're using the Marshall Emberton across a large area."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Marshall Emberton price and release date",
    "14": "Design",
    "20": "Audio performance",
    "24": "Battery life and connectivity",
    "27": "Don't buy it if..."
  },
  "links": {
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "waterproof speaker": "https://www.techradar.com/news/best-waterproof-speaker",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}