{
  "source": "https://www.techradar.com/reviews/glyph-atom-pro",
  "title": "Glyph Atom Pro review",
  "category": "computing",
  "updated": "2020-09-28T07:02:08Z",
  "author": "mark-pickavance",
  "summary": "Blindingly fast external storage",
  "verdict": "The exceptional quality of the construction and excellent performance doesn’t quite justify the high cost, but the Glyph Atom Pro is a classy solution. If only it worked on USB ports alongside Thunderbolt it would have a wider appeal.",
  "pros": [
    "Fast",
    "Durable",
    "Cable storage in bumper"
  ],
  "cons": [
    "Expensive",
    "No USB connections",
    "2TB maximum capacity"
  ],
  "article": [
    "Glyph Production Storage is a New York based business that describes itself as a digital data storage company, although its product range contains more than storage devices.",
    "It focuses on high-quality solutions that are assembled in the USA, using technologies that are standard for most Apple Macs and PC workstations.",
    "Over the past year, we’ve seen a slew of affordable external drives that use NVMe NAND modules inside for maximum performance.",
    "Most of these use the USB 3.2 Gen 2 interface to enable speeds of up to 1,000Mb/s to be achieved. But it is possible to go quicker than that using Thunderbolt 3 connections.",
    "The new Glyph Atom Pro SSD does exactly that, promising to make the USB connected drives look like they’re stuck in the slow lane.",
    "Is it as rapid as Glyph promises, and is that extra speed worth the cost difference to a USB solution?",
    "Glyph isn’t a business looking to stack them high and sell them cheap, so the relatively high pricing of the Glyph Atom Pro series won’t surprise those who are familiar with its products.",
    "The Atom Pro is manufactured in three capacities: 500GB, 1TB and 2TB.",
    "Glyph doesn’t sell them directly but through a global reseller channel, making exact pricing difficult to pin down for any region.",
    "At the time of writing the US costs on Amazon are $249.95, $399.95 and $699.95 respectively. And, in the UK those costs translate to £265.00, £388.06 and £805.89.",
    "Calculating the cost per GB, the larger capacities offer the best deal, in general.",
    "These costs are very much in line with the comparable G-Technology G-DRIVE mobile Pro, but more expensive than the Sabrent ROCKET XTRM and Plugable Thunderbolt 3 External SSD.",
    "And, we’re not talking a small difference, Plugable offers its 2TB drive for a little more than the 1TB version of the Atom Pro, and Sabrent has a 4TB model at Glyph’s 2TB pricing.",
    "We’re sure that that Glyph would argue that the Atom Pro is better engineered and comes with a superior warranty. But in terms of pure value for money, the Glyph Atom Pro wouldn’t be our first choice.",
    "The size of many NVMe-based external drives is restricted by the internal electronics since most of these are made using the M.2 2280 form factor.",
    "But the Atom is about the same size as the classic WD My Passport, or rather it is when cocooned inside its rubberised protective bumper.",
    "While we appreciate that this cover does afford significant protection from drops, it also obscures the more elegant form of the Atom Pro held inside.",
    "If you want to see the drive undressed, so to speak, getting it out isn’t that easy an exercise, but it’s a doddle compared with the reverse procedure.",
    "Other than the physical protection that the cover provides it is also the temporary home of the short Type-C cable that slots into a grove around the outside.",
    "The cable fit is snug, and we’d be careful when you pull it out because breaking a nail is a potential hazard. It’s about 20cm long, sufficient for laptop use, but on the short side for connecting to a desktop PC.",
    "When attached to the computer a small blue LED light flashes on the top to indicate activity, but as this is solid-state technology, there is no sound, and it didn’t get appreciably warm in use.",
    "Often external drive makers are coy about what is actually inside their devices, as they might want to change that specification at some point.",
    "But we’re pretty confident that inside the Atom Pro is a WD Black SN750 NVMe SSD, not that the owner could get it out and replace it with something else, or a bigger version.",
    "If that is the case, then it explains why the largest capacity available in only 2TB, and it also reveals the performance impact of connecting a PCIe device externally via Thunderbolt 3.",
    "The quoted speeds of the WD Black 1TB are 3,430MB/s reads, and 3,000MB/s writes, making the externally connected Atom Pro about 20% slower than an internally connected NVMe drive.",
    "The other extra piece of information available is the TBW values of 300TB, 600TB and 1,200TB for the 500GB, 1TB and 2TB capacities respectively. Based on this, those that want to use the drive to offload 4K video might want to consider the larger drive sizes for their greater TBW along with the expanded space.",
    "For Apple Mac owners that have a Thunderbolt 3 port, the Atom Pro can be directly attached out of the box and be ready to secure using Time Machine, as it is pre-formatted HFS+ with Journaling.",
    "Evidently, Glyph perceives its core audience as being Apple owners, and those that use a PC with Thunderbolt, like your reviewer, must reformat the drive before they can use it.",
    "Unlike some competitors, Glyph doesn’t provide any software to make better use of the drive, although Apple users have their backup tool of choice inherently.",
    "For PC users, they need to find a general-purpose application that will copy files across to the Atom Pro on a regular basis, ideally immediately after the files are written to the host system.",
    "Or, you can simply drag and drop files using the standard file management tools on your computer, irrespective of what OS it is running.",
    "The Atom Pro is sold on speed, and it certainly trounces any USB connected drive we’ve tested so far. And, until USB 4.0 arrives, and the drives designed to exploit the extra bandwidth that will bring, Thunderbolt 3 drives like the Glyph Atom are going to rule.",
    "Our testing was done on the 1TB version, but Glyph doesn’t differentiate each size as having significantly different performance. Though, from our experience, the larger drives will have a great TBW (Total Bytes Written) than the smaller capacities.",
    "Glyph quotes read speeds of up to 2,800 MB/s and write speeds around 2,600MB/s that are consistent with the internal NVMe drives performance, showing how efficient the Thunderbolt 3 interface can be.",
    "Irrespective of what benchmark we used, the performance was marginally less the quoted numbers to varying degrees. The optimistic ones, like CrystalDiskMark 7.0a saw default profiles scores of 2,721 MB/s reads and 2,501 MB/s writes, where AS SSD only achieved 2,340 MB/s reads and 2,021MB/s writes.",
    "We’d classify the AS SSD numbers are closer to genuine performance, and the CrystalDiskMark real-world profile delivered even lower numbers.",
    "But, however you test the Atom Pro, it’s at least twice the speed of any USB connected drive at this time.",
    "We should also say that the high-performance levels you can experience aren’t sustained, because the underlying NVMe drives can’t keep pumping data into the buffers at these speeds indefinitely.",
    "Write a big enough file, and it will eventually choke, and the speed will drop to around 700MB/s or whatever value the NAND modules can inherently accept data changes.",
    "And, ironically at that point, this drive will perform identically to a USB connected one built around the same NVMe technology.",
    "In conclusion, the Atom Pro is very quick for external storage, but it can’t rewrite the inherent limitations of current NAND technology.",
    "It might be eye-wateringly expensive, but the Atom Pro delivers on its speed promise and portability. The protective rubber shoe looks something of an afterthought by the designers, but it protects the drive when it is unceremoniously slung into a laptop bag along with other peripherals.",
    "If you are a photographer and want to secure media dumped on to a host computer efficiently the Atom Pro is undoubtedly the way to go, assuming you are not using the Thunderbolt 3 ports for another purpose.",
    "It might also be useful for videographers, but 1TB doesn’t seem a big enough capacity for those working with 4K, or higher, resolution files. They need at least 2TB, and the Atom Pro offers that much space if their pockets are deep enough.",
    "However, some makers are offering 4TB drives, and Glyph hasn’t got that yet in this product.",
    "Other than the price, the biggest reservation we have is that the drive won’t work at all with USB, even slowly.",
    "That design choice assumes that every machine that the owner uses has a Thunderbolt 3 port, and even with Apple Mac users, that’s not a guarantee.",
    "This connection limitation along with the pricing makes the Atom Pro a bit niche, though an attractive option for those with the desired ports and the justification to own one."
  ],
  "headers": {
    "6": "Pricing",
    "14": "Design",
    "21": "Hardware",
    "26": "Performance and in use",
    "41": "Final verdict"
  },
  "links": {}
}