{
  "source": "https://www.techradar.com/reviews/dyson-v11-absolute",
  "title": "Dyson V11 Absolute review",
  "category": "reviews",
  "updated": "2020-04-01T14:25:09Z",
  "author": "lauren-mulville",
  "summary": "The best cordless vacuum you can buy?",
  "verdict": "The Dyson V11 Absolute is a fantastic cordless cleaner that can tackle both hard floors and carpets with ease. Even in Eco mode if offers powerful suction, enabling you to make the most of the 60-minute run-time. The LCD screen is easy to navigate, and is handy for letting you know if there’s a blockage and how much run-time is left.",
  "pros": [
    "Powerful suction",
    "Lightweight and maneuverable",
    "Useful LCD screen"
  ],
  "cons": [
    "Expensive"
  ],
  "article": [
    "Dyson is the number one floorcare brand in the UK and many of the 65 countries in which it operates. We've followed the progress of the company's flagship V series over the last decade, and power, run-times, features and usability have taken a leap with each new generation, so we're fully expecting the Dyson V11 Absolute to be the brand's best yet.",
    "The V11 Absolute builds on the design of the V10 range with some new headline features. It adds a substantial 45AirWatts extra oomph on its highest power setting (now a class leading 185AW) and extends run-time to over 60 minutes on its lowest.",
    "The High-Torque floor head promises to be the only tool you ever need, and a new color LCD display adds a touch of class with in-depth information and helpful graphic guides.",
    "Upgrades to the battery have made it a smidge heavier than its predecessor, now tipping our scales just over the 3kg mark. So is the extra cleaning potential worth the extra weight? And does the overall package justify the high price tag? We took the Dyson V11 Absolute for a spin to find out.",
    "As you might expect, as Dyson's flagship machine the V11 Absolute doesn't come cheap. At £599 / $699.99 / AU$1,199, it's one of the most expensive cordless cleaners on the market.",
    "If that's a little rich for your blood, you do have some alternative options. You could drop down to the V11 Animal (Torque Drive in Australia), which has a different main head and one less tool, and which is priced at £499.99 / $599.99 / AU$1,099, or one of the V10 models, which now start at £399.99 / $499.99 / AU$799.",
    "There aren't many cordless vacuums from other brands that come close to the price of the V11 Absolute. One of its closest rivals is Shark’s priciest cordless stick cleaner, the IZ251UKT, which costs £479.99 in the UK. Meanwhile, German appliance specialist Miele has just launched a new range of cordless vacuums, with its top-of-the-range model, the Triflex HX1 Pro, making the V11 Absolute look a relative steal with its eye-watering £679 price tag.",
    "Alternatively, Vax, another big name in floorcare, has recently released the Vax Blade 4, which at only £219.99 is close to a third of the price of the top-specced V11.",
    "The Dyson V11 Absolute is a stylish-looking vacuum, with the electric blue wand nicely complementing the nickel (dark gray) of the accessories and main body, while the LCD screen is bright and easy to read.",
    "It’s also worth noting that the design is completely symmetrical, so the V11 Absolute is just as easy to use whether you’re left- or right-handed. There’s also a handy wand storage clip, which makes it easy to carry a couple of extra tools around with you.",
    "There are three power settings to choose from via a single mode button: Eco, Auto/Medium – effectively the ‘standard’ setting, and Boost. Pairing the Auto/Medium mode with the High Torque cleaner head enables the V11 to automatically adapt the power for the floor type. Other tools include the soft roller cleaner head, mini motorized tool, crevice tool and quick-release mini soft dusting brush. There's also a docking station and charger.",
    "A new, higher-capacity lithium-ion battery means the runtime of up to 60 minutes matches the V10 models, despite the V11’s extra power, and the trigger switch means no wasted battery caused by the motor running when you’re not actually cleaning. The filter and floor heads can be removed for cleaning, and there’s no need to get your hands dirty emptying the V11 – just push the lever down and the 0.76-liter bin pops open, dropping the dirt straight in the bin.",
    "The Dyson V11 has an LCD screen, a first for a Dyson, that lets you know how much runtime you have left in the selected cleaning mode and tells you if the filter is due a clean, and alerts you to blockages. One of the first things you'll notice when you unbox the Dyson V11 Absolute was a handy ‘What you need to know’ guide, stuck to the bin so as not to be missed – it's great for those who want to get right straight down to cleaning, as it quickly goes over the three different cleaning modes and how to empty the bin.",
    "Weighing in at 3.3kg with the wand and soft roller cleaner attached, the Dyson V11 Absolute feels light in use, despite weighing a little more than the V10 models – the position of the battery means the cleaner feels perfectly balanced when you’re using it, and the extra weight is barely noticeable. The V11 moves around easily on both carpets and hard floors, whether you're using the High Torque cleaner head or the soft roller cleaner head, and the articulated design of the heads makes cleaning under furniture a breeze.",
    "We started with the oats test, using the soft roller cleaner head, which is designed for hard floors, with soft bristles and a velvet-like material covering the roller, on the Auto/Medium power setting. Just one slow pass picked up 100% of the oats, and the V11 repeated the feat on the Eco setting. For the carpet test, we used the High Torque cleaner head on the Auto/Medium setting, and one slow forward and back pass cleared all the carpet freshener and talc.",
    "Pet hair was the next test, and again the V11 Absolute performed impeccably, cleaning the hair from the rug with little effort – the results were equally evident from looking at the amount of hair collected in the bin, highlighting its useful size for a cordless cleaner.",
    "Switching out the High Torque head and wand for the mini motorized tool we tackled the sofas; while this configuration looks a little ungainly with the tool connected directly to the cylinder, it feels well balanced and light at just over 2kg, and again it picked up the pet hairs with ease. Changing the heads also highlighted the smarts of the timer, with the displayed remaining runtime changing to reflect the changed power requirements.",
    "The V11 Absolute also makes light work of the normally onerous task of cleaning stairs, with the mini motorized tool powering up our test flight with ease, and cleaning right into the corners",
    "Runtime on the Med setting was a touch short of 41 minutes with the soft roller cleaner head and 60 minutes on the Eco setting giving us plenty of time to get the cleaning don, notwithstanding just how good the suction is even on the lowest setting. The LCD screen displays a warning if there’s a blockage, and even shows you how to clear it, which is especially handy.",
    "Bin emptying is as easy as it initially appears, with all the dirt and debris coming out without the need to poke around and get your fingers dirty.",
    "The Dyson V11 Absolute packs in a host of handy features, such as the easy-empty bin and informative LCD screen, and delivers superb cleaning results. It’s easy on the arm, and delivers powerful suction even on the lowest power mode, and the generous runtime means you can get plenty done before you need to put it on charge. It’s easy to switch between the power settings (and in Auto/Medium mode the V11 Absolute automatically adjusts the suction for different floor types for optimal performance) and the LCD screen makes it easy to see how much cleaning time you have left. It's one of the priciest cordless vacuums out there, but if you want one of the most effective and user-friendly cleaners money can buy, and can stretch to the price tag, it’s money well spent."
  ],
  "headers": {
    "4": "Price and availability",
    "8": "Design and key features",
    "13": "Performance",
    "20": "Verdict"
  },
  "links": {}
}