{
  "source": "https://www.techradar.com/reviews/asus-vivobook-flip-14-2020-review",
  "title": "Asus Vivobook Flip 14 (2020) review",
  "category": "computing",
  "updated": "2021-09-14T11:18:04Z",
  "author": "john-loeffler",
  "summary": "The Asus Vivobook Flip 14 brings performance back to school",
  "verdict": "A surpringly powerful 2-in-1, the Asus Vivobook Flip 14 is an excellent multitasker with some surprisingly good graphics performance for a hybrid laptop. Though the 8GB RAM slows it down a bit when working with a lot of multimedia data or Chrome tabs, its more than enough for school or workplace productivity tasks.",
  "pros": [
    "Lightweight and portable",
    "Multitasking champ",
    "Great GPU performance",
    "Stylus included"
  ],
  "cons": [
    "Stylus holder not very secure",
    "8GB RAM limits its multimedia performance",
    "Lackluster single-core CPU performance"
  ],
  "article": [
    "The Asus Vivobook Flip 14 is this year's refresh of company's budget 2-in-1 hybrid laptop, featuring an updated chassis design and AMD's Ryzen CPUs over last year's Intel processors. The result is a stylish and powerful 2-in-1 that is very hard to beat for the price.",
    "The switch to the AMD Ryzen CPU adds a good bit of power to the Flip 14 as it outperforms many rival Intel systems on most benchmarks. The integrated Radeon graphics also takes a considerable lead over Intel's integrated graphics systems.",
    "On the downside, the Flip 14 doesn't have the best battery life out there, falling well short of its rivals. Still, it can get six to seven hours of charge, which is enough to get you through most of the day.",
    "The included stylus is fully featured with programmable buttons and powered by a single AAA alkaline battery. It's also much easier to lose, since the included stylus holder is magnetic and is meant to attach to the lid of the laptop. While it works, a good, strong pull is going to peel it right off, taking your stylus with it.",
    "Still, despite these issues, for the performance and the price, the Asus Vivibook Flip 14 is very tough to beat.",
    "The Asus Vivobook Flip 14 sent to TechRadar for review is available now and retails for $699 (about £540/AU$980). The base model, with a Ryzen 5 CPU, retails for $599 (about £455/AU$840).",
    "The Flip 14 has a redesigned chassis, producing a lighter, more sexy look than last year's model. With its new aluminum-alloy construction, the lid and chassis body feature an ultra-smooth bespoke black finish with a stylish diamond-cut Asus Vivobook logo etched into the surface.",
    "The standard laptop chicklet-style keyboard is responsive with decent key travel, though the keys do feel a slight bit cramped for our tastes. It's not that egregious though, especially considering the size of the laptop overall.",
    "The trackpad is also responsive without being exceptional and the switches for mouse clicks give good tactile feedback during us, though clicks do get stiffer as you move away from the bottom corners of the trackpad.",
    "The included pen-sized stylus, powered by a single AAA alkaline battery, features two programmable buttons and is works pretty well as far as styluses go. We didn't notice any appreciable lag in input while using it.",
    "The one major issue we had with it was the magnetic fob Asus included to keep the stylus attached to the Flip 14. Connecting to the lid surface, the magnetic connection isn't the strongest out there, so it isn't all that helpful as a storage solution for the stylus. Be careful that you don't lose it.",
    "The portrait mode for the Flip 14 is certainly functional, but it does suffer from the cramped feel that all 16:9 2-in-1 laptops have to deal with (except for rarities like the Acer Spin 5, that is).",
    "The 360-degree hinges turn the laptop into a tablet and are rated for 20,000 open/close cycles. They are also stepped rather than directly flat, which tilts the keyboard slightly toward the users hands while typing.",
    "There are a good number of ports including a USB-C 3.2, though it isn't for charging, unfortunately. There is also a cooling vent that takes up about half of the left side of the chassis.",
    "There are no back or front ports, but there are the downward facing speakers on the sides towards the front of the laptop that unfortunately seems to be standard for ultrabooks.",
    "The Asus Vivobook Flip 14 performed rather well on our performance benchmarks, handily beating out most of its Intel Comet-Lake rivals pretty handily on all but a few benchmarks.",
    "While it loses out to the Acer Spin 5 on GeekBench 5's single-core CPU benchmark, 1,224 to 674, it's multi-core performance just edges out the Spin 5's 3,824 to 3,798.",
    "It does even better on our CineBench20 test, with it's score of 2,536 nearly doubling the 1,333 result for the Spin 5. The Flip 14 also beat the Spin 5 on the PCMark10 Home test, 4,989 to 4,413.",
    "The Flip 14's integrated AMD Radeon Vega GPU outperforms the Spin 5's Intel Iris GPU as well, sometimes by a significant margin. In our 3DMark Skydiver test, for example, the Flip 14 turns in a very respectable score of 10,259 against the 7,896 for the Spin 5.",
    "The results narrow somewhat during the more demanding GPU benchmarks (2,604 to 2,267 on Firestrike and 937 to 814 on Time Spy, Flip 14 to Spin 5, respectively), but the Flip 14's Radeon GPU clearly comes out ahead.",
    "Where the Flip 14 does end up lagging a good bit behind the Spin 5 is in its battery life, which isn't surprising, given the Flip 14's 43WHr battery to the Spin 5's much larger 56WHr.",
    "In practice, this difference means the Flip 14 lasted an average of 8 hours and 49 minutes during our PCMark 10 battery test against the Spin 5's 11 hours and 5 minutes. The Flip 14 does even worse on our movie test, lasting an average of 6 hours and 19 minutes to the Spin 5's 11 hours and 19 minutes.",
    "Asus does say that the Flip charges from one percent to 60 percent in as little as 49 minutes (when powered off), and our experience reflects similar. Whether that compensates for the lower battery life will depend on your particular need, however.",
    "Considering the price, we aren't surprised that there'd be some bloatware on the Flip 14. The biggest culprit is the preinstalled McAfee virus software that included some very obnoxious pop-up adds by the taskbar's notification center.",
    "There is a software utility called MyAsus that allows you to check on system updates, change different system settings, and even diagnose certain system issues like blue screen errors and similar issues."
  ],
  "headers": {
    "0": "Two minute review",
    "5": "Price and availability",
    "6": "Design",
    "15": "Performance",
    "23": "Software",
    "25": "Don't buy it if..."
  },
  "links": {
    "Acer Spin 5": "https://www.techradar.com/reviews/acer-spin-5-2020"
  }
}