{
  "source": "https://www.techradar.com/reviews/icliniq",
  "title": "iCliniq review",
  "category": "computing",
  "updated": "2020-02-14T19:00:10Z",
  "author": "jonas-p-demuro",
  "summary": "The virtual hospital",
  "verdict": "iCliniq offers an attractive service, but the user reviews indicate plenty of hassle to use it.",
  "pros": [
    "Array of options for support",
    "Free initial query",
    "Supports multiple mobile platforms",
    "Available Symptom Checker"
  ],
  "cons": [
    "Lacks toll free contact number",
    "High cost per individual query",
    "Poor user reviews"
  ],
  "article": [
    "Born out of necessity, iCliniq started out of the experience from Dhruv Suyamprakasam, the current CEO and founder of iCliniq. A mechanical engineer by education, Dhruv was abroad in Dubai with an issue with his knee, and without travel insurance found it frustrating to receive his medical care, which he ultimately accomplished via telemedicine. He then started iCliniq in 2010, as a domestic, telemedicine platform for India. Subsequent growth has been exponential, with over 3,500 doctors on their panel across over 80 specialties, located in over 190 countries handling over 600 queries daily.",
    "iCliniq starts its feature set with support for a variety of mobile platforms. Certainly, it is not surprising that there are apps for both the iOS and Android platforms. However, we were impressed that iCliniq takes this a step further, and supports interaction through two additional platforms, namely Telegram Messenger, and Slack.",
    "There are a number of methods to be able to ask the physician a question. A popular one is to use the online portal, and ask the question in a text format, with the option to upload images such as radiology, or the pathology, for example an image of the wound or a skin rash. Another more interactive option is to have a conversation via telephone. Still another option is an online chat with the physician, and yet another possibility is a video chat for the most interaction. For even more complex issues, there is an option for a second opinion, such as when surgery is contemplated, and for this there is a dedicated module.",
    "The iCliniq site also offers some additional options to facilitate healthcare. Not all patients may be able to articulate their symptoms, without being interviewed by a physician. In a situation such as that, the Symptom Checker can be useful, as you just need to provide an age and gender, then click on the body part that has an issue, and then related symptoms appear. For example, clicking on the chest brings up the common symptoms of chest pain, wheezing and difficulty breathing. After clicking on the positive symptoms, this can be submitted as a query for the iCliniq physician to work on a diagnosis.",
    "User reviews of the service, more specifically on the Google Play store of the Android app are less than kind, where the iCliniq app only garners a little more than a three star rating. Some users, as well as on some other sites, complain that the quality of medical advice is low, to the point that it was questioned if it was actually from doctors, although in the comments, a representative from iCliniq was reassuring that all answers provided were from practicing professionals. Still another complaint was that the user was not able to choose the practitioner of their choice",
    "Another issue that arose in the reviews is the issue of being charged. While iCliniq’s website does clearly state that the first query is no charge to try the service, there seems to be some gotcha’s that are irking users. One person complained that they were charged for even the initial query, but apparently they had uploaded an image, and under those circumstances then they are to be charged, and this was not clear to the user. Others complained that they did not receive the answer to their query.",
    "Support for iCliniq starts with the creation of a trouble ticket, via an online portal, as seen in the screenshot above. Once created, the ticket gets assigned a number, which can subsequently be tracked to resolution.",
    "Elsewhere on the site, we were able to find a phone number to call, although it was located in India with no available toll free option. In addition, there is an email address which is likely a better option for most folks located in the US. However, we would have appreciated the phone and email contact options to be more prominently located in the support section of the iCliniq website.",
    "The initial query to an iCliniq doctor is completely free to be able to take the service out for a test drive. If the initial query needs an image uploaded, such as an X-ray, or to use iCliniq and pay for each query, the cost runs $19.99 (£16) for each inquiry that is text based, and for a phone or video consultation, the price increases to $29.99 (£23).",
    "Beyond that, the service is more affordably used around a monthly subscription. Taking it one month at a time is an option at $99 (£77) each month, and includes up to 50 hours of chat, with access to physicians in over 80 specialties. Signing up for a longer term commitment offers a better deal, running a cost of $49 (£38) per month for a six month contract, and an even more affordable $29 (£22) monthly, for a full year. Each of these longer plans also includes 50 hours of chat.",
    "There is also an option for a 100% refund if not satisfied.",
    "iCliniq is a worldwide phenomenon in telemedicine, with thousands of doctors available to patients around the world. The pluses include support for a wide variety of platforms, the choice of subscription or a la carte payment plans, the option to upload images, and the initial free inquiry. Misses include the lack of a toll free support number, and the overall poor user reviews. For folks that need an option for telemedicine, it does appear that iCliniq fulfills that need, but overall the company needs to work on improving their customer service."
  ],
  "headers": {
    "1": "Features",
    "4": "Drawbacks",
    "6": "Support",
    "8": "Pricing",
    "11": "Final verdict"
  },
  "links": {
    "iCliniq": "https://www.icliniq.com/en_US/",
    "telemedicine": "https://www.techradar.com/best/best-telemedicine-software",
    "Android app": "https://play.google.com/store/apps/details?id=com.orane.icliniq&hl=en_US"
  }
}