{
  "source": "https://www.techradar.com/reviews/movie-maker-online",
  "title": "Movie Maker Online review",
  "category": "computing",
  "updated": "2020-01-22T15:28:07Z",
  "author": "cat-ellis",
  "summary": "Browser-based video editing",
  "verdict": "A surprisingly capable browser-based video editor, with a lot of tools and options to offer once you get used to its unconventional interface.",
  "pros": [
    "Completely free to use",
    "No registration required",
    "No watermarks"
  ],
  "cons": [
    "Confusing layout",
    "Only exports in MP4 format",
    "Lots of ads"
  ],
  "article": [
    "Online free video editors are hard to come by, and those available are typically very simple tools that do little more than apply filters to your clips unless you upgrade to a premium account.",
    "Movie Maker Online is the exception. Unlike other browser-based tools, it offers proper timeline-based editing with titles and effects, plus a catalog of royalty-free music and stock images to help complete your projects.",
    "We wouldn't recommend it for particularly long projects, partly because uploading and downloading the necessary files is a time and bandwidth-consuming process, and partly because the various editing tools on offer aren't quite up to the standard of desktop software.",
    "Its interface takes some getting used to as well, mostly because its timeline is aligned vertically rather than horizontally, as it is in video editors like Adobe Premiere Pro and Lightworks.",
    "That said, if you need a tool for quickly trimming, combining and adjusting video clips without any unsightly watermarks, Movie Maker Online could be the perfect tool for you.",
    "First, a word of warning: Movie Maker Online is funded by ads that you might find distracting, and you'll have to deactivate any ad-blocking plugins you have installed before you can use it.",
    "If you can look past that, Movie Maker Online is an excellent tool (and it's only fair that its developers are reimbursed for their work). Movie Maker Online lets you upload video, images and music, and combine them into a project by dragging and dropping them onto a timeline. The page layout is a little strange, so you'll need to scroll down a little way to find it.",
    "Drag your media files onto the page to upload them, and accept the cookies when prompted. You can then begin editing them, stitching clips together and combining them with audio and still images.",
    "You can crop uploaded videos, and there are numerous filters available to give them a new look. Movie Maker Online provides fade options for audio and video too, as well as text overlays, transitions and more.",
    "There's even a selection of royalty-free images and music files that you can use to help complete your project (though bear in mind these are only free for non-commercial use). Music is provided by Jamendo, a platform for independent musicians to share their work online.",
    "It just might take you a while to find your way around the system of menus and learn which parts of the page are ads, and you can only export your finished projects in MP4 format, but this is a minor complaint. Movie Maker Online is the best for your browser."
  ],
  "headers": {
    "5": "User experience",
    "11": "You might also like"
  },
  "links": {
    "free video editors": "https://www.techradar.com/best/free-video-editing-software",
    "Movie Maker Online": "https://moviemakeronline.com/",
    "Adobe Premiere Pro": "https://www.techradar.com/reviews/adobe-premiere-pro-cc",
    "Lightworks": "https://www.techradar.com/reviews/lightworks",
    "Jamendo": "https://www.jamendo.com/?language=en"
  }
}