{
  "source": "https://www.techradar.com/reviews/fujifilm-x100v",
  "title": "Fujifilm X100V review",
  "category": "cameras",
  "updated": "2020-03-27T07:29:13Z",
  "author": "mark-wilson",
  "summary": "A special camera that's the best of its kind",
  "verdict": "The perfect compact camera for the smartphone age, the X100V is a great street photography sidekick that takes the series to new heights. Its tilting screen brings some welcome versatility, while the new sensor, autofocus system and viewfinder make it a fun, engaging travel camera. The fixed focal length won't be for everyone and it's relatively pricey, but the X100V is the best premium compact you can buy.",
  "pros": [
    "Useful new tilting touchscreen",
    "Improved sensor and autofocus",
    "Higher-resolution EVF than before",
    "Lens produces good sharpness",
    "Now shoots 4K video"
  ],
  "cons": [
    "Needs filter for full weather-sealing",
    "Pricey for a fixed lens camera"
  ],
  "article": [
    "The Fujifilm X100V is a premium compact camera with some great genes – it's the fifth member of a family that stretches back to the original X100 from 2011, with a design that’s inspired by 1950s film cameras.",
    "The series has long been considered camera royalty. Why? It comes down to a combination of four factors: its stylish, pocketable form factor, large APS-C sensor, unique hybrid viewfinder, and a fixed 23mm f/2 lens. Together, these four things make the X100 series a deservedly popular choice among street and travel snappers.",
    "It’s a tradition that the Fujifilm X100V continues, with a few significant new twists. The X100V brings a new tilting touchscreen (a first for the series) and a redesigned lens. Inside, there are big changes too, with a new 26.1MP APS-C X Trans CMOS 4 sensor, improved autofocus system and the ability to shoot 4K/30p video.",
    "But is this all enough to make the X100V as popular as its predecessors? And do you really need one when smartphone cameras are so good? The answer to both questions is yes, as long as you know what you’re letting yourself in for...",
    "The Fujifilm X100V is available in two versions, Silver and Black. Both cost $1399 / £1299 / AU$2,349, which is around the same price that the X100F originally went on sale for in 2017, if it's adjusted for inflation.",
    "Some retailers are offering the X100V with a 'Weather Resistance' kit, which includes an AR-X100 adapter ring and PRF-49 protection filter. The X100V's body is weather-sealed, but these accessories make it completely resistant to inclement weather.",
    "This 'Weather Resistance' kit costs £99 (about $130 / AU$190), although in the UK Fujifilm says the kit will initially be be sold at £49.50 (about $60 / AU$100) when you buy it with the camera.",
    "The X100V looks just as good in the hand as it does in pictures – it’s expensive, but feels very premium. In fact, it has few rivals in the looks department, aside from minimalist rangefinders like the Leica Monochrom M.",
    "If you’re new to photography, it might even look a little intimidating, with its unusual ISO-shutter speed dial and generous helping of buttons. But one of the X100V’s charms is the creative flexibility it gives you in a pocketable form factor. Sure, you can use it as a point-and-shoot, but that would be like buying a Gibson Les Paul to only play power chords.",
    "The great thing about the X100V is that it adds useful physical features without compromising on its size or looks. The main example of this is its tilting touchscreen. This sits so flush to the back of the camera that it’s easy to miss that you can pull it up by 90 degrees and down by around 30 degrees.",
    "This is very useful for street photography, allowing you to shoot from the hip or above your head to get angles that aren’t possible on previous X100 cameras or smartphones. A tilting screen may make you feel slightly more nervous about its durability when chucked into a backpack, but we didn’t encounter any worrying incidents on this front.",
    "Slightly more divisive is Fujifilm's decision to remove the D-pad on the X100V. On its predecessors, these buttons acted as useful physical shortcuts to functions like film simulations or the AF mode. What made them particularly handy was the fact that you could use them while looking through the viewfinder.",
    "The X100V supports Fujifilm's touchscreen gestures – which let you swipe in one of four directions to bring up menus – but you can't do this while wearing gloves. Still, the ‘Q’ button does compensate to an extent, and more personal preference than anything close to a deal-breaker.",
    "In the hand, the X100V feels not unlike the much more affordable Fujifilm X-A7, in terms of size and weight. The main differences are that the latter uses interchangeable lenses and lacks a viewfinder. The X-A7 certainly offers better value and is more suitable for beginners. But its plastic build lacks the premium feel of X100V, which uses aluminium plates that are built around a magnesium alloy frame. It’s a lovely object that you’ll just want to keep picking up and shooting with.",
    "One final design decision that’s worthy of mention is the new ISO ring mechanism. To change your ISO settings, you still lift the outer ring that surrounds the shutter speed dial – only now, it remains in position when you lift it, rather than snapping back into place like on the Fujifilm X-Pro3. It’s a small thing, but makes it more user-friendly if you like to shoot regularly in full manual mode.",
    "The X100V’s two biggest shooting improvements over its X100F predecessor are its redesigned 23mm f/2 lens and snappier autofocus, which comes courtesy of the new X-Processor 4.",
    "The lens has an identical focal length and aperture to the X100F, but Fujifilm says the one on this camera has two aspherical elements (rather than one). In theory, this helps improve resolution and reduce distortion.",
    "What about in practice? While we didn’t have an X100F to compare it to, the X100V certainly offers great sharpness in the centre of its images, even when you shoot wide open. One of our main complaints with the X100F was that its photos tended to be a touch soft when shooting at f/2, particularly if you were close to your subject. This often meant stopping down to f/2.8 or f/4.",
    "But the good news on the X100V is that shooting wide open feels much less like a compromise. The minimum focusing distance is still 10cm, but you can now feel more confident about leaving it set to f/2 to achieve some lovely shallow depth of field.",
    "This flexibility is supported by the strong autofocus performance. We tested it side-by-side with a Fujifilm X-T3 fronted by a 23mm f/2 lens, and it’s certainly not quite up to the level of that combination – the X100V was noticeably slower and noisier, particularly in low light situations.",
    "The difference wasn’t drastic, though, and the X100V rarely missed focus or resulted in missed shots. The Face/Eye detection is confident and reliable when shooting people, while in tracking autofocus mode it tenaciously follows objects if you flick it into continuous AF using the switch on the side.",
    "For a pocketable camera with an f/2 lens, autofocus performance is overall very good. And while the X100V certainly isn’t a sports camera, there is decent burst performance to help you capture fleeting moments. Using an SDHC UHS-II card with 250MB/s write speeds we managed to get slightly under the claimed 11fps maximum burst rate (around 10fps), with the buffer filling up after around 40 JPEGs and 20 Raws.",
    "The other big practical improvement on the X100V is weather-sealing. Now, this isn’t full weather-sealing, because the lens moves in and out by a few millimetres to focus, making this part of the camera impossible to fully seal. But the rest of the body is weather-sealed and some retailers are offering the camera with a weather-resistance kit that includes an AR-X100 adaptor ring and PRF-49 filter.",
    "We certainly felt comfortable taking it out in light rain without those accessories, though, and simply kept the included lens cap close to hand.",
    "Two more minor, but still very welcome, improvements over the X100F are the X100V’s viewfinder and battery life. Like the Fujifilm X-Pro3, this camera has a hybrid viewfinder – this means you can use it as a modern EVF or, with the a flick of the switch on the front, a more old-fashioned optical viewfinder.",
    "In both modes you get exposure information shown around the edges of your view, which can be turned on or off using the ‘disp/back’ button. While there have been improvements to the optical viewfinder mode (a boosted 0.52x magnification), it’s the electronic viewfinder that really impresses – its sharp, 3.69 million-dot resolution and 0.66x magnification is excellent for a camera of this size. Particularly when some rivals, like the Ricoh GR III, don’t even have a viewfinder.",
    "Lastly, the X100V’s battery life has been given a boost over its predecessor. The industry standard CIPA rating, which is usually a pretty conservative estimate, is 350 shots per charge, up 270 on the X100F. In the real world, this equated to almost exactly five hours of fairly intense street shooting during our tests. This means it’s well worth carrying a spare battery (it takes the Fujifilm NP-W126S) or an external power delivery charger, which can charge X100V directly via the USB-C port. If you’re planning a long day of shooting, it might even be worth having both.",
    "The X100V has Fujifilm’s latest 26.1MP X-Trans IV APS-C sensor, which is the same as the one in the X-Pro3 and X-T4 – and it produces similarly excellent results.",
    "One of Fujifilm’s strengths has long been the quality of its out-of-camera JPEGs and it’s the same with the X100V – shots have pleasing, accurate color rendition and reliable exposure. You also get the full array of ‘Film Simulations’, which simulate the look of the company’s range of analogue films.",
    "These include the new ‘Classic Neg’, which has a punchy, vintage look that works particularly well when shooting metallic objects, and the collection as a whole makes a great starting point for those who want to give their photos an extra dash of atmosphere without doing much post-processing. We mainly shot with the X100V in ‘Fine + Raw’ mode, which gives you the option of playing with JPEG ‘Film simulations’ while having the uncompressed Raw as a backup.",
    "Those Raw files also show that the X100V’s performance at higher ISO sensitivities is impressive. Shots are nice and clean all the way up to ISO 3200, where they still have very good detail and dynamic range. Even shots at ISO 6400 and ISO 12800 are certainly usable, despite a gradual increase in color noise, which means you have a good safety net in low-light situations.",
    "The X100V, though, is one of those cameras where it doesn’t really make sense to separate image quality from the shooting experience as a whole. That’s because the shots you take are informed as much by its fixed focal length as they are the sensor quality and processing. If you haven’t bought an X100 series camera before, it’s important to make sure you’re happy with shooting for extended periods with only a 23mm focal length – we love the creativity it inspires, but at times it can feel neither wide enough nor tight enough for certain scenes.",
    "That said, the tilting screen makes a huge difference to the kinds of photos you can take and is a really big bonus – a big portion of the shots we took wouldn’t have been possible on previous X100 cameras, and it’s particularly handy for shooting from the hip.",
    "The X100V isn’t the obvious choice for a video camera, but how does it fare with moving pictures? Well, it’s actually very capable for video, both in terms of quality and features, though this is counterbalanced by some inevitable practical limitations.",
    "On the plus side, you get 4K/30p recording (albeit with a maximum recording time of ten minutes per clip) and Fujifilm’s lovely Eterna simulation, which is great for video. Its ports also give you some options, with an adaptor (not included) able to turn the 2.5mm jack into a more standard 3.5mm one for microphones.",
    "But without any video stabilization in either the lens or body, this is not a walkaround vlogging camera – which means you’ll need to use either a gimbal or a tripod to get footage that lets its quality shine.",
    "If you’re prepared to do that you can even send a 10-bit 4:2:2 signal out to an external recorder, but realistically not many X100V owners will be doing that. It’s also a slight shame that the built-in ND filter, which you can use in stills mode to help get shots in bright sunlight when you hit the upper 1/4000 limit of its mechanical shutter, doesn’t seem to be available in video mode.",
    "The Fujifilm X100V is the best compact camera of its kind and a brilliant street photography sidekick, but it’s important to know what you’re letting yourself in for.",
    "This isn’t a travel all-rounder or point-and-shoot king, because the X100V’s fixed focal length and emphasis on manual shooting make it much more niche than that. Instead, it’s the ideal walkaround camera for keen photographers who see that 23mm f/2 lens as liberating rather than a frustrating limitation.",
    "If that sounds like you, then there’s a lot to love here. The X100V’s tilting screen makes it more versatile than any of its predecessors, its new lens and sensor combination produces excellent images, and it’s weather-proof if you’re either careful or use it with a filter. Beyond all of this, it’s just incredibly fun to shoot with.",
    "Many X100 owners find that this camera gets more use than their supposedly ‘better’ main camera, simply because its pocketable size outweighs its limitations. The price of admission is certainly high, but the X100V pulls off this trick better than any other fixed lens compact camera so far."
  ],
  "headers": {
    "4": "Fujifilm X100V release date and price",
    "7": "Build and handling",
    "15": "Performance",
    "27": "Image and video quality",
    "37": "Fujifilm X100V verdict",
    "41": "The competition"
  },
  "links": {
    "Leica Monochrom M": "https://www.techradar.com/news/leica-m10-monochrom-is-a-black-and-white-camera-that-costs-more-than-your-car"
  }
}