{
  "source": "https://www.techradar.com/reviews/fossil-hybrid-hr-hands-on",
  "title": "Hands on: Fossil Hybrid HR review",
  "category": "wearables",
  "updated": "2020-01-08T19:28:15Z",
  "author": "john-mccann",
  "summary": "A smartwatch that's closer to a traditional timepiece",
  "verdict": "The Fossil Hybrid HR is a relatively inexpensive smartwatch which gives you the basic features, plus a whole lot of battery life.",
  "pros": [
    "2-week-plus battery life",
    "Traditional watch design",
    "Heart rate monitor"
  ],
  "cons": [
    "Limited functions"
  ],
  "article": [
    "The Fossil Hybrid HR was initially launched in November 2019, and during CES 2020 the line was given a visual boost with the addition of some new designs.",
    "We managed to get one of the new-look Fossil Hybrid HR smartwatches – which blend smart features with traditional analogue watch hands – on our write to find out what it's like.",
    "The Fossil Hybrid HR has been on sale since November 2019, but the new designs launched at CES 2020 will be available from January 26, 2020.",
    "Prices for the Hybrid HR range from $195 / £189 to $215 depending on the body/strap material combo you opt for.",
    "As smartwatches go, the Fossil Hybrid HR is one that closely resembles a traditional timepiece, with the new designs even more 'watch-like'. We're talking chunky bezels and metal bodies.",
    "However, what really sets hybrids apart from standard smartwatches is the inclusion of manual clock hands, which sit in front of the e-paper display on the Hybrid HR.",
    "Behind the hands you get a watch face which can display a variety of things, including fitness goals, weather, date and phone notifications. You can even set a background picture if you prefer, but note that this will be displayed in grayscale and the resolution won't be particularly good.",
    "It's also not a touchscreen device, with all control done via the trio of buttons on the right of the body. The central crown doesn't rotate – it's just a simple button – while the other two keys can be customized to quick-launch your favorite apps.",
    "The watch can display more detail fitness information and messages you receive via your smartphone, and when you're reading message or viewing other date the watch hands move into a horizontal position, with information display above and below them.",
    "Return to the main watch face and the hands will automatically return to showing the current time.",
    "With the screen being e-paper, it's easy to view in bright light, giving the Fossil Hybrid HR an advantage over standard smartwatches.",
    "As we've mentioned, the Fossil Hybrid HR comes with a variety of features including fitness tracking, music playback control, and the ability to show smartphone notifications on your wrist.",
    "As the 'HR' in the name suggests, there's a heart rate monitor on the rear of the watch as well, allowing you to keep track of your beats per minute.",
    "Due to the low-energy nature of the display, and the more limited feature set, the Fossil Hybrid HR boasts over two weeks of battery life from a single charge, which is significantly longer than the two-day average you get with standard smartwatches.",
    "It works with both Android phones (version 5 and above) and iPhones (iOS 10 and above).",
    "The Fossil Hybrid HR is a relatively inexpensive smartwatch that gives you the basic features and a whole lot of battery life.",
    "If you don't want to constantly have to charge your watch, and are happy with a device which does basic fitness tracking and phone notifications, then the HR may be for you."
  ],
  "headers": {
    "2": "Fossil Hybrid HR release date and price",
    "4": "Design and display",
    "11": "Performance and features",
    "15": "Early verdict"
  },
  "links": {
    "initially launched in November 2019": "https://www.techradar.com/news/new-fossil-hybrid-hr-brings-a-heart-rate-sensor-to-a-classic-watch-design",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets"
  }
}