{
  "source": "https://www.techradar.com/reviews/gotfreefax",
  "title": "GotFreeFax review",
  "category": "computing",
  "updated": "2020-04-17T14:39:43Z",
  "author": "michael-graw",
  "summary": "Electronic fax for small businesses",
  "verdict": "GotFreeFax stands out for enabling small business users to create prepaid accounts. While we’d like to see more file types supported, we also like that you can upload up to 10 files per fax.",
  "pros": [
    "Supports prepaid accounts for businesses",
    "Ad-free cover sheet for free faxes"
  ],
  "cons": [
    "Only Word documents, JPGs, and PDFs supported",
    "Security around business accounts isn’t great"
  ],
  "article": [
    "GotFreeFax stands out as one of the best online fax services around. This electronic fax provider only handles outgoing faxes, but it’s unique in offering prepaid accounts for businesses. This reduces the administrative headache around enabling multiple people to send faxes whenever needed. Plus, GotFreeFax doesn’t add any ads or branding to your cover page, even when sending free faxes.",
    "GotFreeFax offers a few different pricing options. First, you can send up to two faxes per day absolutely free as long as they’re less than three pages each. Note that free faxes are limited to recipients in the US and Canada.",
    "If you need to send more documents, you can pay for a higher page limit. Faxes up to 10 pages cost $0.98 each, faxes up to 20 pages cost $1.98 each, and faxes up to 30 pages cost $2.98 each. Pricing varies if you’re sending electronic faxes internationally, but the rates typically aren’t much higher.",
    "Finally, business users can opt to open prepaid accounts and buy page credits on an as-needed basis. You can buy 100-page credits for $9.95, 300-page credits for $19.95, or 1,000-page credits for $49.95.",
    "Like many other free and paid online fax services, GotFreeFax enables you to create a cover page for any fax. The text editor for the cover page is fairly simplistic, as you can’t easily add images or a brand logo. But, we appreciated that you can remove the cover page, even for free faxes. This means you’re able to create your own custom cover page, although it will count against your page limit in this case.",
    "One thing that we particularly liked about GotFreeFax is that you’re able to upload up to 10 files as part of a single fax. Considering that you pay for a page limit rather than per page for premium faxes, that’s a major advantage.",
    "That said, we were less excited to find that GotFreeFax only supports a narrow range of file types. You can upload Word documents, JPG images, and PDFs, and that’s it. Other Internet fax providers enable sending Excel files and a wider variety of image formats.",
    "Since GotFreeFax is a send-only service, there’s almost no setup required. You only need to input your name and email and your recipient’s name and fax number in order to send documents. All of the steps for sending an online fax are found on the same web page, which further simplifies the process.",
    "The only hold-up is that you do need to verify your email before your fax can be sent. This is common practice among free online fax services that don’t require accounts, to help prevent spam faxes.",
    "The GotFreeFax website is extremely easy to navigate. Everything you need to fill out in order to send a fax is on a single web page. Pricing information is also included on that same page, so you know before you get started how much a particular fax will cost you.",
    "We tried sending a free fax with GotFreeFax, and the system started dialing within 30 seconds. As part of your confirmation email, the service provides a web page on which you can check on the status of your fax, a feature we loved. GotFreeFax will also send an email to confirm that your fax was delivered or to let you know if it wasn’t possible to connect to the number you sent a fax to.",
    "GotFreeFax doesn’t provide much information about how it secures your data, other than to say that the service takes security seriously. It specifies that all paid faxes are sent via encrypted connections, but it’s not clear whether free faxes are also encrypted during data transfer. We were happy to find that GotFreeFax automatically deletes all uploaded files, as well as sender and recipient data, after a period of five days.",
    "Security around business accounts is also not great. All you need to use the account are the account number and PIN number. It’s fairly easy to reset the PIN number, too, since there’s no two-factor authentication.",
    "GotFreeFax provides technical support by email only. The company’s website has a very detailed FAQ page that answers the majority of common questions, though. There’s also a short video that walks users through the process of sending an online fax with GotFreeFax.",
    "GotFreeFax functions a lot like FaxZero, another free online fax provider. FaxZero is a better option for sending faxes only very occasionally, as it lacks an option to create a prepaid business account. We like that FaxZero includes up to five free faxes per day, but beware that every free fax with this service comes with a branded cover sheet. So, even for sending a one-time online fax, GotFreeFax has some advantages.",
    "GotFreeFax is a good service for small businesses that only need to send online faxes, not receive them. The most unique part of this online fax provider is that it offers prepaid business accounts, which are inexpensive and can be used by anyone with the account number. While the types of files you can send with GotFreeFax are limited, we appreciated that you can attach up to 10 documents per fax and that the cover page is free of branding for all faxes."
  ],
  "headers": {
    "1": "Plans and pricing",
    "4": "Features and utilities",
    "7": "Setup",
    "9": "Interface and performance",
    "11": "Security",
    "13": "Support",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "best online fax services": "https://www.techradar.com/best/best-online-fax-service",
    "GotFreeFax": "https://www.gotfreefax.com/",
    "documents": "https://www.techradar.com/best/best-document-management-software",
    "text editor": "https://www.techradar.com/best/best-text-editors",
    "Excel files": "https://www.techradar.com/best/best-pdf-to-excel-converters",
    "email": "https://www.techradar.com/news/best-email-provider",
    "encrypted": "https://www.techradar.com/best/best-encryption-software",
    "FaxZero": "https://www.techradar.com/reviews/faxzero"
  }
}