{
  "source": "https://www.techradar.com/reviews/acer-aspire-5-15-inch-a515-54-30bq",
  "title": "Acer Aspire 5 15-inch (A515-54-30BQ) review",
  "category": "computing",
  "updated": "2020-03-24T17:36:57.828Z",
  "author": "mark-knapp",
  "summary": "Ready for simplicity",
  "verdict": "The Acer Aspire 5 (2019) is good for docs and light browsing, but a dim display and simple design don’t make it worth going with a high-end configuration.",
  "pros": [
    "Windows 10S limits bloatware",
    "Plenty of ports",
    "User upgradeable"
  ],
  "cons": [
    "Frustrating trackpad",
    "Dim display",
    "Uninspired keyboard"
  ],
  "article": [
    "Acer has a contender in the battle of cheap laptops with the Acer Aspire 5 15-inch. The model we’re testing, the Acer Aspire A515-54-30B, is at the low end of the spec range with an 8th-Gen Whiskey Lake Intel Core i3 processor and 4GB of RAM while costing just $399 (about £305, AU$600). The most expensive version of this laptop costs twice as much, while there are also Aspire 5 models that include basic Nvidia graphics to bring prices even higher.",
    "Despite coming in at a low price, the Acer Aspire 5 doesn’t come across with an immediately cheap impression. There’s a sandblasted aluminum lid and a clean aesthetic to the design. It even includes helpful keyboard backlights.",
    "Most of the laptop frame is plastic, but it all comes together well enough and with just enough rigidity to feel like a solidly built machine. We do notice that the base of the laptop is touch wider than the display, giving it an unrefined if not unforgivable design. Just a bit of excess keyboard deck flex and the plain-to-see plastic bezels around the display are the only signs the whole laptop isn’t just a soft aluminum like Acer’s Chromebook 715.",
    "Still, it’s not overly thick for a 15-inch laptop, and manages to stay just a hair under 4 pounds for a decent level of portability. It’s utility on the go is also decent when it comes to connectivity. The Acer Aspire 5 is packed with ports on the left side with two USB-A and one USB-C port, all three high-speed, along with an HDMI port and a Gigabit Ethernet jack. An extra USB 2.0 port and headphone jack round things out on the right side. Even wirelessly, the Acer Aspire offers 802.11ac wireless and Bluetooth 5.0. All it’s missing is a media card reader.",
    "The display is a bit of a tossup. On the one hand, 1080p at 15.6 inches is palatable as far as sharpness is concerned, and the anti-glare coating helps keep the display usable in bright conditions. But, the panel is dim even at its brightest setting. Working with documents is no trouble, but watching videos in a bright room doesn’t go well. The speakers are also underwhelming, which hurts the Acer Aspire 5’s appeal as a media device.",
    "With low-end specs, the Aspire 5 has modest potential as a simple work machine. Thanks to an eMMC drive and DDR4 RAM, the Aspire 5 can be fairly snappy when it’s dealing with just a couple programs or a small set of tabs. It comes running Windows 10S, so there’s not a lot of bloatware hogging resources.",
    "We find the dual-core processor in this model and 4GB of RAM is enough to write up a document with a couple other browser tabs open or handle email.",
    "But, things can quickly take a turn for the worse. With four product pages, one twitter tab, one TechRadar article and one light Google Doc open in Edge, we use 85% of system memory. It only takes 10 tabs to see the system start dumping things from memory. When we add a YouTube video to the mix, each action slows the system to a crawl. It consistently takes over two seconds to switch a YouTube video to theater mode and back. This can trick us into hitting the same button twice, which can then immediately undo whatever we try to do.",
    "Worst of all, the trackpad frequently becomes unresponsive. Actions like closing a tab, hovering over a video to bring up menus, or just about anything will then prevent whatever we then try doing on the trackpad from registering.",
    "There are some bright sides to this situation. Through all of our workloads, the Aspire 5 stayed quiet and didn’t get hot. The battery also holds up well. It managed over 9 hours in our video test at 50% brightness, and it ended a work session with 30% remaining after about 5 hours with the display at full brightness. For users that find themselves in need of more memory, the RAM and storage inside the Acer Aspire 5 are upgradeable, albeit at the risk of losing warranty coverage.",
    "The Acer Aspire 5 has some clear value on the budget side, but high-end models don’t feel like they’ll offer as much appeal. The fact is the design is basic and not incredibly appealing. The keyboard and trackpad for higher-spec models won’t get upgraded to match their price tags. But, as a low-power device with some room for affordable upgrades down the road, there’s some promise here."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don’t buy it if..."
  },
  "links": {
    "cheap laptops": "https://www.techradar.com/news/the-best-laptop-deals",
    "Whiskey Lake": "https://www.techradar.com/news/intel-whiskey-lake",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}