{
  "source": "https://www.techradar.com/reviews/rescue-alert-review",
  "title": "Rescue Alert review",
  "category": "pro",
  "updated": "2020-10-27T16:51:45Z",
  "author": "jeph-preece",
  "summary": "Learn about the loudest medical alert system in our Rescue Alert review",
  "verdict": "While the packages aren’t the most affordable, Rescue Alert manufactures the very popular MyTrex MXD system, making this service one of the few manufacturers of medical alert systems. That said, the overall performance and pricing is lacking.",
  "pros": [
    "Loud speakerphone",
    "Excellent range"
  ],
  "cons": [
    "Slow call response time",
    "Expensive pricing"
  ],
  "article": [
    "In this Rescue Alert review, we look at the MyTrex MXD, an in-home medical alert system for seniors featuring cellular and landline options, that is manufacturered by Rescue Alert. This medical alert system is widely used by other medical alert services, making Rescue Alert and MobileHelp the two main manufacturers of medical alert systems in the US market. That said, we prefer the MobileHelp CBS in-home system, as Rescue Alert’s MyTrex system doesn't match up with audio quality or pricing.",
    "Get a free quote for a medical alert system.",
    "Rescue Alert doesn’t have the widest range of products, with just teh MXD in-home system and a mobile GPS medical alert system (currently listed as out of stock). As mentioned, the MyTrex MXD is a very popular system and has been used for decades, both as a landline system and a cellular system. The greatest strength of the MyTrex MXD is the volume of the speaker and it’s compatibility with VoIP systems, cable, and cellular adapters.",
    "The volume of the MyTrex was the loudest in our tests. It’s impressively loud, allowing your senior loved one to hear the emergency operator even if they are several rooms away. The downside to being so loud is the quality of the speakers tends to suffer. Often, the audio quality was excellent, but occasionally, the audio was distorted.",
    "When volume pushes the limits of a speaker’s capabilities, it often distorts, resulting in a conversation that is more like placing an order at a fast-food drive-thru than a proper phone call. This can be an issue when communication is key to receiving help in an emergency. Since medical alert systems are typically returned upon cancellation and repackaged for new customers, you might be getting a system that is old, with speakers that are worn out. If your speakers sound terrible during test calls, we recommend returning the device and get asking for a new one.",
    "Rescue Alert also manufactures one of the most commonly used fall detection pendants, the myActive Alert. However, our tests of the pendant were disappointing, as the myActive Alert received a failing grade because it failed to detect falls. In fact, we tested a handful of the myActive Alert pendants and found them to lack sufficient sensitivity. They only detected falls when literally throwing the device into the ground. That said, nearly every fall detection pendant we tested failed because it was either too sensitive or not sensitive enough. It seems as though the technology still has a ways to go before it provides reliable results.",
    "Rescue Alert’s emergency call response time was below average in our tests. While it wasn’t the slowest to answer emergency response times (three services had slower average response times), Rescue Touch was six times slower than GreatCall, which averaged about 15 seconds per call.",
    "The quality of the calls were also subpar. Each call started by asking for the address of the emergency. By immediately assuming the call is an emergency before assessing the situation, we found it elevated the anxiety already prevalent amongst seniors who avoid pressing the help button. Since we recommend seniors test their medical alert system weekly, it’s better to have an emergency response call that is calm, reassuring, and sincere. In addition, the operators never asked to confirm our identity or address. And with a few calls, the operators seemed eager to end the call once they learned it was just a test rather than making sure we were okay and not in need of help.",
    "Rescue Alert has been around for nearly forty years, making them one of the first medical alert services to hit the market. And as a manufacturer of medical alert systems, they have a big impact on the rest of the industry. We like that they aren’t aggressive with their marketing and they are transparent about their pricing structure and product information.",
    "The customer service is great. The calls we had with representatives were always positive and we never felt pressured into a sale, which is relatively uncommon. The representatives were very good about answering questions and never tried to dodge questions. The return policy is standard and the process is easy.",
    "Unlike MobileHelp (another manufacturer of medical alert systems), Rescue Alert's prices for each package tend to be more expensive than the same system sold by a different medical alert service. For example, the landline system starts at about $32 per month while the same system is offered by Medical Care Alert for $29.95 per month.",
    "In addition, the Rescue Alert GPS, a mobile medical alert system, costs about $45 per month, which increases to $54 per month if you add fall detection. These are all very average based on other services. However, you can get a better mobile GPS medical alert system and a faster call response time with GreatCall for $25 per month.",
    "We give a lot of credit to Rescue Alert for manufacturing the MyTrex MXD, which has been one of the most popular in-home medical alert systems on the market since 2011. It’s the loudest medical alert system on the market, though this sometimes hindes the quality of the communication because the speaker can distort. The range of the pendant for the MyTrex is excellent, but the fall detection pendant was a disappointment.",
    "We were not impressed by the emergency call center’s response time or call quality. With a below-average call response time that averaged around a minute, we feel like there are plenty of services that provide quicker responses. In addition, the operators lacked the calming responses necessary to give seniors the confidence to make the call when it matters."
  ],
  "headers": {
    "2": "Medical alert systems",
    "6": "Emergency response center",
    "8": "Medical alert service",
    "10": "Cost Comparison",
    "12": "Final Verdict"
  },
  "links": {
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system"
  }
}