{
  "source": "https://www.techradar.com/reviews/vava-portable-ssd-touch-500gb-secure-solid-state-drive",
  "title": "VAVA Portable SSD Touch 500GB secure solid state drive review",
  "category": "computing",
  "updated": "2020-09-23T16:57:56Z",
  "author": "desire-athow",
  "summary": "Security at your fingertips, literally",
  "verdict": "The VAVA Portable SSD Touch, without doubt, challenges the Samsung T7 Touch and offers a compelling alternative to those looking for a more affordable secure storage option, especially for very high capacities.",
  "pros": [
    "Up to four year warranty",
    "Great price",
    "Fingerprint reader",
    "Very stylish",
    "Surprisingly small"
  ],
  "cons": [
    "OK performance",
    "We’re not a big fan of that form factor",
    "No mobile app"
  ],
  "article": [
    "VAVA is a brand that made a name for itself on Amazon thanks to its plethora of consumer products such as dashcams, projectors, baby monitors, USB hubs, laptop docking stations and lately external SSDs. The Portable SSD Touch is presented as an external secure drive that can be protected either using a password or a fingerprint, the latter removing the need for a password manager.",
    "Three versions of the VAVA portable SSD will be available and at the time of writing, they can only be purchased from Indiegogo. $89 for the 500GB version (the one we’re testing today), $139 for the 1TB model and $259 for the 2TB iteration. The drives will be shipped in October 2020.",
    "Expect them to be sold on Amazon and via VAVA’s own website later this year; given that the crowdfunding was oversubscribed by 17x, it is likely that the drive will sell very well. Although Indiegogo can usually be a bit of a gamble, VAVA is a known quantity and unlikely to disappear overnight with your hard-earned money.",
    "We’re not big fans of the form factor of this portable SSD but do understand that the chewing gum pack form factor will appeal to most because it is small enough. The chassis is made of aluminum and zinc alloys with a plastic middle frame, making it shock resistant; it looks and feels the part with the only disruption to its smooth surface being Type-C connector (USB 3.1 Gen 2) on one of the end edges.",
    "There’s a large fingerprint sensor on the top, one that is surrounded by a square that glows in metallic blue when waiting to be unlocked, blinks in blue when transferring data and red when it encounters an issue.",
    "At 102 x 29 x 9mm for a weight of 39g, the VAVA Portable SSD Touch is easily pocketable. Bear in mind though that unlike a proper USB drive, you will need a Type-C cable to connect it to any device. It is available in cobalt blue and space gray colour schemes.",
    "The fingerprint scanner keeps blinking when you connect it to your host computer; the drive is formatted by default as an exFAT device.",
    "You need to install the bundled application, aptly called VAVA SSD Touch on Windows or Mac. The device offers AES 256-bit hardware encryption and one can argue that there’s a speed penalty that is incurred during data transfer.",
    "When you plug in the encrypted device, it only shows two folders containing the necessary files for Mac and Windows platform and a total capacity of just over 37MB. Once you unlock it either with a password or your fingerprint, the entire content of the drive is visible.",
    "Setting the fingerprint unlock mode takes a few seconds with the application walking you through an intuitive process; up to 10 fingerprints can be recorded. You can disable the security mode at will but doing so will delete all registered fingerprints.",
    "We had no issue unlocking the device using the fingerprint although we wouldn’t vouch for its long term reliability. It was mildly warm to the touch during our benchmarks. Note that there’s no app for Android or iOS and as such you will need to set it up on a desktop PC.",
    "The VAVA Portable SSD touch uses a Silicon Motion SM2258XT controller with a JMicron JMS580 bridge chip and Micron TLC NAND while the fingerprint module is a Silead ZU300. There’s also two USB cables (around 30cm long) with a nice pouch to carry it around.",
    "VAVA claims speeds of up to 540MBps and 480MBps on read/write speeds. We recorded speeds of 416MBps and 420MBps on CrystalDiskMark respectively which is OK but not spectacular. The real life test on the other hand (transferring a 10GB file) was more promising with the VAVA hitting a healthy 270MBps, which is on par with the Teamgroup PD400.",
    "Rivals to the VAVA Portable SSD touch will be secure drives with a fingerprint scanner.",
    "The first obvious competitor is the Samsung T7 Touch which comes in 500GB, 1TB and 2TB versions as well. Crucially though, at $110, $190 and $350, they are significantly more expensive than VAVA’s models. Just bear in mind though that the T7 Touch is far faster (around 2x) and can withstand drops of more than 180cm.",
    "If military-grade security is a must, then a fingerprint reader won’t fit the bill and the VAVA SSD can be - in theory - cracked open without much of an issue. Instead, niche specialists like Kingston, Apricorn Aegis or Datashur, will use a numeric keypad. They tend to be much bigger but also slower while offering FIPS 140-2 Level 2 validation.",
    "If you don’t care about either and just want an external solid state drive that is solidly built, then the Adata SD600Q should be high on your list. It is waterproof, shockproof and costs only $94.99 for the 960GB version. It meets the U.S. Military MIL-STD-810G 516.6 standard and comes with a three year warranty. Just bear in mind that there’s no encryption or fingerprint reader.",
    "One thing that surprised us is the fact that it has a four-year warranty if you register with the manufacturer. Such a long warranty period is unheard of in the storage market; only high end enterprise or NAS drives carry up to five year warranty.",
    "We also liked the fact that VAVA promotes the eco-friendliness of the Portable SSD touch. The tin, they say, is renewed while the aluminum case is 100% recyclable.",
    "So what can VAVA do to deliver the perfect secure drive? Work on speed (Gen 3.2 Gen 2 please!), work on the form factor (ideally something with a smaller footprint and a tad thicker) and add in a mobile app."
  ],
  "headers": {
    "1": "Price",
    "3": "Design",
    "6": "In use",
    "11": "Performance",
    "13": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "laptop docking stations": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "external SSDs": "https://www.techradar.com/news/best-portable-ssd",
    "secure drive": "https://www.techradar.com/news/best-secure-drives",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Indiegogo": "https://www.indiegogo.com/projects/vava-portable-ssd-touch#/",
    "USB drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "desktop PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Teamgroup PD400": "https://www.techradar.com/reviews/teamgroup-pd400-960gb-external-ssd",
    "Samsung T7 Touch": "https://www.techradar.com/reviews/samsung-t7-touch-external-ssd",
    "Adata SD600Q": "https://www.techradar.com/reviews/adata-sd600q-ruggedized-external-ssd",
    "NAS drives": "https://www.techradar.com/best/best-nas-hard-drives"
  }
}