{
  "source": "https://www.techradar.com/reviews/vipre-internet-shield-vpn",
  "title": "Vipre Internet Shield VPN review",
  "category": "computing",
  "updated": "2020-12-04T09:39:02Z",
  "author": "sead-fadilpasic",
  "summary": "A fast and secure VPN, but without many other perks",
  "verdict": "Vipre Internet Shield is a decent VPN service, with top speeds and industry-standard privacy protection mechanisms. However, if you’re looking for a way to anonymously share large files via torrenting clients or access to geo-blocked streaming services, you’re going to be disappointed. It also doesn’t offer monthly subscriptions, but at least there’s a 30-day money-back guarantee you can count on.",
  "pros": [
    "Excellent speeds",
    "30-day money-back guarantee",
    "Simple and user-friendly apps",
    "Up to 10 simultaneous connections"
  ],
  "cons": [
    "No monthly subscriptions",
    "Doesn’t unblock Netflix or BBC iPlayer",
    "No torrenting allowed"
  ],
  "article": [
    "Vipre is a cybersecurity firm that provides a wide range of software solutions for various security requirements. One of these products is its VPN service called Vipre Internet Shield VPN which can be purchased as a standalone solution or as part of its Ultimate Security bundle.",
    "Unlike most VPNs that you can purchase as monthly subscriptions, Vipre doesn’t offer such an option for its Internet Shield. You can only choose between the 1-year subscription at $60 (equals to $5/month), the 2-year one at $114 (equals to $4.75/month), and the 3-year plan at $162 (an equivalent of $4.5/month). Regardless of the subscription, you can decide whether you want recurring or non-recurring payments.",
    "One Vipre Internet Shield VPN account is enough to cover up to 10 devices at the same time, which is just enough for a household or small office. Accepted payment methods include credit cards, PayPal, and wire transfer.",
    "While a free trial is offered for most of its security products, Vipre doesn’t have one for its VPN. Instead, you may be able to get a refund under the 30-day money-back guarantee if you’re not fully satisfied with the product. We tested this claim and got our refund quickly, no questions asked.",
    "Although Vipre’s VPN product can provide you with online privacy, it is still just a side gig to its main antivirus/internet security event. This is why it may feel unpolished at times and like some important features are missing. You won’t get such a feeling with the elite platform that is ExpressVPN, nor will Vipre provide you with access to thousands of servers like NordVPN does.",
    "And let’s not forget Surfshark or CyberGhost, both of which offer a more advanced platform and lower prices. On top of everything, all of these major industry players also provide access to popular geo-restricted streaming platforms, in addition to supporting torrenting.",
    "An ability to provide access to localized libraries of popular streaming services like Netflix and BBC iPlayer in regions where such content is unavailable is a feature held in high esteem in the VPN business. Vipre Internet Shield VPN is mainly focused on protecting your privacy online so, unfortunately, it cannot unblock either Netflix or BBC iPlayer.",
    "Vipre operates from Florida, the US, and offers access to 80 servers in more than 50 countries worldwide. Although this is a small number of servers, they are well spread across the world, even in places such as Nigeria, United Arab Emirates, South Africa, Peru, Colombia, and more, where not many VPNs have servers.",
    "Vipre’s VPN service deploys PPTP, L2TP/IPSec, OpenVPN (UDP and TCP), IPSec, and IKEv2 connection protocols, depending on the used device. For example, its Windows and Mac apps use the OpenVPN protocol, its Android version utilizes the IKEv2 protocol, while its iOS counterpart relies on IKEv2 and IPSec. All use the 128-bit SSL encryption and an NAT firewall is deployed on all of its servers.",
    "As an additional security mechanism in case its VPN connection fails, Vipre provides a so-called kill switch, albeit only on Windows and Mac devices. In case the connection is interrupted, a kill switch will step in and block your entire Internet access, so no sensitive information can leak into the wrong hands.",
    "You can even enable the Block LAN Traffic feature to block all local network traffic in addition to Internet traffic once you’re disconnected from the VPN. Users can also select different automatic options for various types of connections - Unsecured WiFi connection, Any Internet connection, and Never - activate manually.",
    "We aren’t told much about the VPN’s no-logging policy on the web page, other than that “Internet Shield VPN by VIPRE does not track, store, or spy on your browsing data while you’re connected to our VPN. Your browsing activity remains secure and private on our VPN.”",
    "The same sentiment is echoed in the provider’s Privacy Policy. So far, there’s been no independent audit of these claims, so we have no other choice but to trust Vipre not to log any sensitive information, which might be difficult considering its location (the US).",
    "We also don’t recommend any torrenting either as no information about it exists on the website and customer support was non-responsive upon the inquiry.",
    "Internet Shield VPN by Vipre has native apps for iOS, Windows, Mac, and Android. The Android app was rated by only five users so far and has 3 stars (out of 5). It was last updated on November 18, 2019, and installed by over 1,000 users. As for its iOS counterpart, it has a solid score of 4.2 stars, as rated by six users.",
    "Vipre has a section of its customer support site dedicated entirely to Internet Shield VPN, organized into five categories: Get Started, Basics, Manage, Resources, and What’s New. There’s also a small FAQ page.",
    "If you fail to find a satisfying response to your question on the website, the next logical step is to contact customer support directly via web form or email. There’s no live chat option, unfortunately, so you’ll have to arm yourself with a lot of patience. We’re still waiting for an answer to our inquiry.",
    "Using Vipre Internet Shield VPN is easy as they come, with nicely designed apps, an intuitive interface, and straightforward settings. Connections are established within seconds, by double-clicking the server of your choice.",
    "We tested these servers on a 75Mbps connection. Our first choice was the server marked as “Best Available”, which at that moment was Belgrade, Serbia. The download speeds were amazing - 48.67Mbps. London, UK gave us an excellent 28.06Mbps.",
    "We then decided to move a bit further away, to the North American continent, where a server in Denver, US hailed a lower, yet very acceptable 8.15Mbps. Finally, we wanted to see how a more exotic location would fare, so we connected to a server in Mumbai, India. Surprisingly, it didn’t do much worse than the US, with a solid 7.97Mbps.",
    "Vipre’s Internet Shield VPN is good for protecting your privacy in the online world as it allows you to browse with perfect anonymity. However, it doesn’t allow torrenting, nor can it be used to access the regionally locked content of today’s popular streaming services, which is why an industry leader such as ExpressVPN may be a better choice, even if at a higher price."
  ],
  "headers": {
    "1": "Price",
    "4": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "14": "Support",
    "17": "Speed and experience",
    "20": "Verdict"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/news/cybersecurity-what-is-it",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Vipre Internet Shield VPN": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4637488750997004000/https://www.vipre.com/products/home-protection/internet-shield-vpn-by-vipre/",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "internet security": "https://www.techradar.com/news/best-internet-security-suites",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "Privacy Policy": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1075852955818147300/https://www.vipre.com/privacy/",
    "Android app": "https://play.google.com/store/apps/details?id=com.viprevpn&hl=en_US",
    "iOS counterpart": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8694344633371913000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Finternet-shield-vpn-by-vipre%2Fid1481251559",
    "FAQ page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2200400615784266000&xs=1&url=https%3A%2F%2Fsupport.threattracksecurity.com%2Fsupport%2Fsolutions%2Ffolders%2F1000234068&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fvipre-internet-shield-vpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1359956506029010000"
  }
}