{
  "source": "https://www.techradar.com/reviews/kuu-k1-laptop",
  "title": "Kuu K1 laptop review",
  "category": "computing",
  "updated": "2020-06-09T17:16:54Z",
  "author": "desire-athow",
  "summary": "Plenty of features that will attract small and medium businesses",
  "verdict": "The Kuu K1 has some interesting features that we almost never see at this price point; backlit keyboard, a fingerprint scanner and the ability to take a second disk drive but that doesn’t hide the fact that it is quite overpriced.",
  "pros": [
    "Fingerprint reader",
    "Backlit keyboard",
    "Removable memory",
    "GPU performance is great"
  ],
  "cons": [
    "Bad touchpad placement",
    "Poor battery life",
    "No Type-C connector",
    "Average value for money",
    "Storage subsystem speed is atrocious"
  ],
  "article": [
    "It is the first time that we’re reviewing a Kuu laptop but the brand, which hails from China, is just one of the many tech companies that use ODM or OEMs. The design of its K1, for example, is reminiscent of the Lhmzniy A9 14.1-inch laptop which we reviewed earlier this year with the giveaway being the unique placement of the webcam.",
    "So in a world of identikits, how does the newcomer fare and what other surprises await us? Let’s find out.",
    "The Kuu K1 embraces a common design theme that we’ve seen in almost every other laptop that hailed from China; an all-metal magnesium aluminum alloy chassis with a brushed finish which makes it positively good looking.",
    "At 36 x 24 x 2.5cm for a weight of 1.8Kg, it is a fairly big notebook and since this is a 15.6-inch model, there’s a dedicated numeric keypad, great for bean counters and anyone who needs to have access to ASCII codes.",
    "There’s also plenty of ports though none of them Type-C; which is a shame. There’s two USB 3.0 ports, a headphone jack, a microSD card slot, a proprietary power port plus a HDMI one. We’d love to have an extra USB 3.0 port and a dedicated LAN port but every component counts when it comes to keeping prices low.",
    "Elsewhere, the touchpad - which has a fingerprint reader on the top left coner - is reasonably big but we don’t like the fact that it is placed bang in the middle of the palm rest area; more on that later. The webcam is located on the hinge but unlike the one on the A9, this one doesn’t have a privacy cover, a wasted opportunity.",
    "The bottom of the device hides four rubber feet, two speaker grills and a rectangular vented surface. Removing the bottom cover is a bit of a pain as four screws are hidden under two rubber feet and the screws themselves are of different sizes.",
    "Powering the Kuu K1 is the Core i5-5257U processor, a Broadwell-based processor that was launched five years ago and built on a 14nm manufacturing process. It has two cores, four threads and 3MB cache and a rather higher base frequency which translates into a relatively high power consumption/dissipation. Interestingly, it comes with Intel’s Iris Graphics 6100, a reasonably “powerful” GPU.",
    "It still runs on slower and more power hungry DDR3 (8GB Winston/UMAX, removable) with SATA rather than PCIe NVMe SSD, a ShanDianZhe/Lhmzniy M2 model. As expected, there’s an Intel WirelessAC-3165 WI-Fi combo for connectivity with a 15.6-inch full HD IPS screen, with a tiny, tiny bezel, in charge of the display. To cap it all off, there’s a 38Whr battery.",
    "In one popular synthetic benchmark (Passmark), the Intel Core i5-5257U is about 6% faster than the fastest mobile Celeron on the market, the Intel Celeron J4205. Which is to say that it is reasonably speedy but won’t set the world alight and it comes as no surprise that the performance of the K1 falls between the entry level Celeron-powered laptops we’ve tested recently and the high end Core models.",
    "While the GPU performance is more than decent (i.e. it should be able to play games reasonably well at medium settings), the storage subsystem scores were, let’s put it bluntly, atrocious scoring about half what one would expect from an SSD and more on par with what a lowly eMMC would deliver.",
    "To avoid any confusion, this laptop, unlike what the description alludes to, doesn’t come with “dual hard drive”. There’s no space to add another drive; someone, somewhere made a typo.",
    "Touchpads on laptops with a numeric keypad are usually symmetrically placed below the keyboard but that’s not the case for the K1 and you end up with a rather jarring typing experience with the palm of your right hand covering most of the touchpad. Not ideal at all.",
    "As for battery life, we found it to be disappointing at 175 minutes which is less than half what the Teclast F15, a recently reviewed 15-inch laptop, managed to achieve. Any positive points then? Well, we liked the IPS display which we found to be above average and the keyboard experience which was uninspiring but decent for the price; snappy, with good travel and feedback.",
    "The Kuu K1 has barely any competition; no one out there can pack 8GB of RAM, 256GB SSD, a full HD display and a decent processor for just over $400. You usually get a far more powerful CPU but lose out on everything else.",
    "This is the case for the $429.99 Dell Inspiron 15 3593 which comes with a Intel Core i3-1005G1 which is about 60% more powerful than the Core i5 that comes with the K1. You do get faster memory and Wi-Fi connectivity. The same model with a 1TB hard disk drive and Windows 10 Pro costs $10 more.",
    "From Lenovo via Best Buy comes the best reason NOT to buy the Kuu K1. The Ideapad 81UT00EAUS outperforms the K1 on the sheer metrics; the Ryzen 3 3200U obliterates the 5257U, the memory and SSD are likely to be far faster and, cherries on the cake, it costs only $349.99 and comes from one of the most popular US retailers around.",
    "There was a time where buying entry level laptops direct from Chinese retailers would guarantee the best value for money. It seems to no longer be the case. If you don’t need a fingerprint scanner, space for a second spare hard drive or SSD and backlit keyboard, there’s very little impetus for you to buy the Kuu K1. There are better laptops on sale in the US at the time of writing.",
    "A resurgent AMD combined with a more price-aggressive Intel means that second-tier manufacturers that have old laptop stock suddenly find themselves with products that were competitive a few months ago but are woefully overpriced a quarter later, with or without the pandemic.",
    "There’s really not much that the K1 can do to improve; it is not intrinsically a bad device. It performed well during our tests and has some interesting features but in the grand scheme of things, it - and most of the other laptops in this price range from China - is simply too expensive for what it offers."
  ],
  "headers": {
    "2": "Design",
    "7": "Hardware",
    "9": "In use and performance",
    "14": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "L": "https://www.techradar.com/reviews/lhmzniy-a9-141-inch-laptop",
    "hmzniy A9 14.1-inch laptop": "https://www.techradar.com/reviews/lhmzniy-a9-141-inch-laptop",
    "Teclast F15": "https://www.techradar.com/reviews/teclast-f15-laptop",
    "Dell Inspiron 15": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-inspiron-15-7000-1313374/review",
    "Ideapad 81UT00EAUS": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-6250139323623365000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Flenovo-ideapad-15-6-laptop-amd-ryzen-3-8gb-memory-256gb-solid-state-drive-platinum-gray-imr%2F6398120.p&article_name=Kuu%20K1%20laptop%20review&article_url=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fkuu-k1-laptop"
  }
}