{
  "source": "https://www.techradar.com/reviews/cat-s42-rugged-smartphone",
  "title": "Cat S42 Rugged Smartphone review",
  "category": "phones",
  "updated": "2020-08-12T16:20:23Z",
  "author": "mark-pickavance",
  "summary": "A tough phone for unforgiving environments",
  "verdict": "Despite looking the part and being suitably robust, the S42 doesn’t sport the hardware to justify its price point. It’s short on memory, storage and video resolution. But the screen is decent quality, and the Cat applications are well designed.",
  "pros": [
    "Android 10",
    "IP68 rated",
    "Crisp screen"
  ],
  "cons": [
    "Poor storage performance",
    "Only 3GB of RAM",
    "No wireless charging",
    "Lacks fingerprint sensor"
  ],
  "article": [
    "To clarify; this phone isn’t made in the same factory as giant earth-moving equipment, and probably not on the same continent as the Caterpillar Tractor Company originated.",
    "Since 2012 the global license for phones and accessories for Caterpillar Inc. has been held by the Bullitt Group, and this is the business that made this Caterpillar branded smartphone.",
    "The price of the Cat S42 is £229 in the UK. It has yet to be released in the USA, but equivalent dollar pricing would make it around $300. We’d expect it to be closer to $250, but currency fluctuations may vary those numbers.",
    "That makes the S42 more expensive than many of the comparable rugged phone options from Ulefone, Doogee and Oukitel, which start at around $150.",
    "But even if it wasn’t assembled by Rosie the Riveter, is the S42 a worthy device to carry the branding and survive the demanding environments associated with heavy construction?",
    "The S42 has the vibe of a more costly device, even if it isn’t especially cheap.",
    "Bullitt used a rubberised surface to coat the frame, and it makes this design pleasing to handle even when it gets wet.",
    "On the back is a nice touch where they created a relief in the covering that’s like caterpillar tracks, that has the added benefit of stopping the phone from sliding easily out of a pocket in the event of sudden movement.",
    "There are three buttons on the right edge and one on the left. The right has the power on/off control and individual buttons for up and down volume.",
    "Following the familiar pattern for Android phones, the power button is at the bottom and is touch differentiated with a knurled surface.",
    "The left mounted button was designed for a walkie-talkie press-to-speak function you can add through software, but you can configure it to other jobs like launching the photo application.",
    "Next to that is another rubber plug, this one protecting a card tray that can take two Nano SIMs and a 128GB Micro SD card. That’s very useful if you wish to use the S42 for both home and work, or you need different SIMs for alternative locations.",
    "One feature that could have been better was the recharging port, an old-style Micro USB variety. This port is hidden under a rubber plug that looks like a strong candidate as the first part of this hardware that becomes detached through use.",
    "Unfortunately, you can’t avoid using the port, since this phone doesn’t offer wireless recharging.",
    "On the very top is a 3.5mm audio jack, also hidden behind a rubber plug.",
    "The 5.5-inch display is bright and clear, protected with Corning Gorilla Glass 5 and the touch sensor has been calibrated to work with gloved hands.",
    "Once the phone is powered up, you are greeted with an almost vanilla version of Android 10 that doesn’t have a unique interface or icons. Bullitt is also promising to upgrade this phone to Android 11 in time.",
    "There are some special applications that might be very useful to those in the construction industry that are Cat branded. Some of these can be downloaded by any Android phone from the Google Play store, but some are exclusive to Cat phones.",
    "These apps are nicely designed, make use of specific features of the phone and provide genuinely useful functionality that those in the construction industry might appreciate.",
    "The only downside to their pre-installation is that they do take up a good chunk of the 32GB of internal storage if you find you don’t use them.",
    "Overall, as rugged designs go, this is one of the more elegant we’ve seen, and definitely looks tough enough to warrant its IP68 and 810H ratings.",
    "Being kind, the hardware inside the S42 is modest.",
    "The quad-core Mediatek Helio A20 can cope well enough with a few concurrent applications, but it could bog down with more challenging situations.",
    "Another limiting factor is the limited amounts of RAM and storage, both on the light side for heavy application users. Many phones are coming with 4GB or 6GB these days, and 32GB is the minimum we see for rugged designs.",
    "Another aspect that looks paired to the bone is the two cameras. The 13MP rear camera takes reasonable still pictures given sufficient light, but can only capture 1080p resolution video, the same as the fixed-focus 5MP selfie sensor.",
    "If the intended recipient takes many photos, they’d probably appreciate a phone that can take better images and video than this one can.",
    "To be clear, it’s not bad. But, camera technology moved on from when these sensor options were considered groundbreaking a long time ago.",
    "On the positive side of the S42 equation, Bullitt chose a good quality display that’s bright and colourful, even if it isn’t exceptionally high resolution. And, at just 220g this is a relatively lightweight design that won’t immediately dive to the bottom of any bag its placed.",
    "As you can’t replace the battery on the S42, the 4200mAh capacity will either be sufficient for your needs or not. It’s not a battery that will last multiple days, but with the relatively low power of the CPU and GPU combination, it should last more than one day of consistent use.",
    "We need to mention a couple of features that aren’t included that modern users might expect. The first of these is that the only security on this phone is a pin number or pattern, as there is no fingerprint sensor and camera identification isn’t available.",
    "And, wireless charging is also AWOL, forcing the use of the USB port to charge.",
    "This last point was a mistake in our opinion. Because the rubber cover on the USB port is a weak point for water and dust ingress and the Micro USB receptacle can easily become damaged through the cable being forcibly inserted upsidedown. Wireless charging could have easily averted the port being used, making the device more resistant to the environment and less likely to get damaged.",
    "Depending on the test chosen, the S42 is either on the slow side or painfully slow. But we must admit that in normal use, it doesn’t feel ponderous.",
    "Where it truly suffered was in the 3DMark testing, where the PowerVR Rogue GE8300 made a slideshow out of both versions of the Slingshot benchmark. In vanilla Slingshot, it placed the S42 in the bottom 8% of all devices tested, and in Slingshot Extreme it was even lower.",
    "Another low point is the Sequential reads at 282MB/s is less than the average we’ve seen from a selection of recent rugged review devices.",
    "But it isn’t all doom and gloom.",
    "The Passmark score on the S42 is a bit better than the Ulefone Armour 7, but not massively.",
    "It’s difficult to see any light at the end of the performance tunnel for the S42, as it's just not a powerful phone, whatever way you look at the numbers.",
    "In a direct comparison with other rugged designs we’ve seen recently, the S42 lacks the better camera, memory size and screen of the Ulefone Armor 7E. It’s not as cheap as the Oukitel WP6, and it also has a fraction of the battery capacity of that option.",
    "Probably it’s most problematic rival is the Doogee S68 Pro, and for only $210 that has a better CPU, Sony sensor camera, 50% more battery, wireless charging, a fingerprint sensor and twice as much RAM.",
    "What none of these devices can offer currently is Android 10, or the special Cat suite of applications.",
    "However, for an almost identical price, Doogee has the Android 10 running S88Pro, with a10000mAh battery, an impressive 21mp+8mp+8mp Sony sensor camera and a host of features not in the S42. Based on these alternative options unless you need those Cat branded apps, it is difficult to conclude that the Cat S42 offers good value for money is a remarkably competitive space.",
    "It would be easy to dismiss the S42 as a lower specification smartphone with a Caterpillar branded exterior if it weren’t for some impressive software and above-average ruggedisation.",
    "The S42 isn’t massively powerful or blindingly quick, but for most users, it will run the Android apps they need effectively enough.",
    "And the promised upgrade to Android 11 is worth something since many cheaper phones often don't see security updates after their first year is over.",
    "That this design lacks is a Type-C connector and wireless charging is a disappointment, but they exceeded the budget for this device. Where this design exceeded our expectation is the IP68 rating, making it one of the more abuse-resistant designs around, and a notch better than the typical IP67 offerings.",
    "If you strip away the branding and software, a phone using the same SoC would be less from a Chinese branded manufacturer, but the build quality of the S42 is a notch or two higher.",
    "The S42 is an admirable device for those that need a basic smartphone that they’re likely to take into dusty and wet environments, but unlike the S61 and new S62 Pro, it is nothing special."
  ],
  "headers": {
    "5": "Design",
    "21": "Hardware",
    "32": "Performance and in use",
    "38": "Competition",
    "42": "Final verdict"
  },
  "links": {
    "Cat S42": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1162636631538107400&xs=1&url=https%3A%2F%2Fwww.catphones.com%2Fen-gb%2Fcat-s42-smartphone%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fcat-s42-rugged-smartphone"
  }
}