{
  "source": "https://www.techradar.com/reviews/easeus-video-editor",
  "title": "EaseUS Video Editor review",
  "category": "computing",
  "updated": "2020-08-19T08:32:57.312Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Applying EaseUS's familiar ease of use to the often intimidating world of video editing",
  "verdict": "An accessible video editor that doesn't fall into the 'professional' category by any means, but still produces some impressive results.",
  "pros": [
    "Simple, accessible interface",
    "Good range of effects and transitions",
    "Decent selection of overlays"
  ],
  "cons": [
    "Limited footage editing options",
    "A little on the expensive side",
    "Some ugly text effects"
  ],
  "article": [
    "EaseUS is a company best known for its file utilities, dealing with things such as a data recovery, backing up and partitioning, so it might come as something of a surprise to see a video editing tool coming from the same stable. Nevertheless, EaseUS Video Editor is here, helping you make the most of footage shot on your phone, GoPro, or other digital camera.",
    "The claim by EaseUS that this is a \"pro-level video editor software for beginners and pros\" is a little bold, but it's certainly impressive. Working with whatever media files you add to the library, you can drop videos, music, voiceover tracks, text and endless effects and transitions on to the timeline, splicing, mixing editing and more. Finished results can be exported as audio, video or even animated GIF files, with each format being highly customizable in terms of encoders, bitrate and more.",
    "As is becoming increasingly common, EaseUS has decided to offer a variety of plans for EaseUS Video Editor; the one you choose will determine whether the price is 'quite expensive' or 'very expensive'.",
    "One option is a monthly subscription model at $29.95 (about £20, AU$45) per month. If you only intend to use the software for a month, this might be a good option, otherwise it will prove extraordinarily expensive. Next up, you can buy a year-long license for $49.95 (about £40, AU$75), which is rather more reasonable.",
    "EaseUS pitches the Lifetime Upgrades option as the 'best value' package, but at $79.95 (about £60, AU$115) it may seem like too much of an outlay for some people – particularly as your needs may outgrow the software before too long.",
    "From the moment you launch the program, EaseUS Video Editor has your back. The very first screen you see asks whether your want to create a 9:16 video for smartphones, or a 16:9 or 4:3 for TVs and computer screens. This pop-up screen is useful, but it appears every time you start the program, until you head into settings to set a default aspect ratio that will be used every time; it's a shame that a check box to enable this was not included on the aspect ratio selection screen. Within the program itself, the 'File > New project' menu offers two additional aspect ratios to choose from – 3:4 and 1:1.",
    "Next up, you need to get the files you're going to work with into the app. You can do this by dragging and dropping files and folders into the library, or by using the import option. This done, you can then set about the task of arranging video and audio clips on the timeline of your project. Longer clips can be easily split up, and there are numerous transition effects to insert between them by simply dragging and dropping into place.",
    "Unfortunately, not all of the transitions are installed by default (as is the case with Effects and Music), so you'll have to download each one as you need it, or opt to download them all in one fell swoop.",
    "Most of the effects, transitions and overlays are of a high quality and you'll probably not want to tweak them at all – and this is just as well, as very few of them have any configuration options at all beyond changing their length. Overlays give you the ability to add fun cartoony elements to your projects, and this is a nice diversion from the serious business of video editing.",
    "While there are lots of options when it comes to working with clips and scenes, there are actually very limited editing options when it comes to raw footage. You can adjust color levels, speed, brightness and the like, but anyone hoping for more advanced options is going to be disappointed."
  ],
  "headers": {
    "5": "User experience",
    "10": "You might also like"
  },
  "links": {
    "video editing tool": "https://www.techradar.com/best/free-video-editing-software",
    "EaseUS Video Editor": "https://www.prf.hn/click/camref:1101l8pQR/pubref:trd-us-8475040939633778000/destination:https%3A%2F%2Fwww.easeus.com%2Fmultimedia%2Fvideo-editor.html"
  }
}