{
  "source": "https://www.techradar.com/reviews/ahrefs",
  "title": "Ahrefs SEO platform review",
  "category": "computing",
  "updated": "2020-07-13T13:51:37Z",
  "author": "christian-rigg",
  "summary": "A full SEO suite with good price points and great web index",
  "verdict": "Ahrefs ticks all the boxes for managing and growing your online presence, with an industry-leading link index, powerful features, and a wealth of resources to get you started.",
  "pros": [
    "Largest and fastest commercial web link index",
    "Documentation, free tutorials, and knowledgeable user support",
    "Advanced filtering tools for power users"
  ],
  "cons": [
    "No desktop or mobile apps",
    "API integration needs improvement"
  ],
  "article": [
    "Since its initial release in 2011, Ahrefs has quickly become one of the most popular SEO tools on the market, and it is used by web developers and content creators around the world to grow their online presence.",
    "Ahrefs boasts the largest backlink index of top SEO tools, with over 295 billion indexed pages and more than 16 trillion backlinks. Throw in an upgraded keywords explorer, tools for monitoring the competition, plus a serious amount of user documentation, and Ahrefs may be the tool you need to rank better and increase traffic.",
    "Ahrefs offers four plans with monthly and annual billing. Ahrefs Lite is the least expensive option, and costs $99 per month. Standard and Advanced profiles come in at $177 and $399 respectively, while Agency subscriptions cost $999 per month. Annual billing comes with a 16% discount (two months free), while a $7 seven-day trial is available for Lite and Standard plans.",
    "Plans progress in the number of users and projects, access to features, reports per month, frequency of updates, and depth of analysis. More expensive plans allow for a greater number of SERP updates per month, plus increasingly frequent alerts for new and lost links, web mentions, and keyword movements. All plans give access to the entire Ahrefs product suite.",
    "Ahrefs comes with all the tools you need to explore and grow your online presence. A central dashboard gives you an overview of your projects’ ranking, traffic, and backlinking. From the landing page, you can easily access each of the five core Ahrefs elements, outlined below.",
    "Before moving into keyword analysis, Ahrefs started with Site Explorer. As a result, it’s one of their most robust and useful tools. On one page, you can see information for organic traffic, backlinks, and relevant keywords. You can also check out competitors’ ad strategies and ranking per keyword with paid traffic and organic keywords research. In sum, Site Explorer is all about understanding your position relative to others and capitalizing on opportunities.",
    "Knowing which keywords are important to your domain is essential to driving growth. To this end, Ahrefs offers a complete suite of keyword research tools. They’ve also included innovative metrics that can help you make better decisions. Clickstream data, for example, allows you to better understand how users interact with relevant search engine results pages. To top it all off, Ahrefs’ data comes from 10 major search engines, including Google, Yahoo, and Amazon.",
    "Useful for beginners looking for direction and agencies that manage multiple sites, Site Audit performs a real-time crawl of your domains to find errors and opportunities. It’s cloud-based, so it won’t use up computer resources. Site Audit lets you quickly locate broken links, 404s and redirect chains, as well as get detailed information on page speed or social tags. Plus, by leveraging powerful filters, you can target specific problems and see recommended solutions.",
    "Rank Tracker lets you track changes in keyword visibility and traffic, and compare your performance to competitors. You can also easily monitor how your content is shown to users. For example, search elements like Google’s featured snippets show relevant content from your site at the top of a search page. Rank Tracker will let you know which elements you feature in so you can optimize your content and which elements represent an opportunity for better visibility.",
    "Content Explorer gives you access to Ahrefs’ massive web index, second only to Google with over 1.1 billion indexed sites. Its powerful filters let you explore the web’s content and find opportunities for growth. For example, you can target high-performing pages and analyze similarities between them, or find topics with little to no competition but high potential. In a nutshell, Content Explorer helps you leverage the web’s content to help your site stay relevant.",
    "Ahrefs has a robust online interface, but no dedicated desktop program or smartphone app. The web app packs a tonne of information into each page, with explanations for most features available in convenient info-bubbles. The Dashboard gives you an overview of your projects, while each of the five core components has its own landing page. Finally, most elements are clickable or interactive for greater insights into the many graphs, charts, and metrics.",
    "Users of Ahrefs have found its customer service to be friendly, prompt, and knowledgeable. This is important for a product with high information density like Ahrefs, especially for beginners and small businesses. While no telephone number is listed, in-app chat and email support are both available 24 hours a day, from Monday to Friday.",
    "No in-person or online training is offered, but a wealth of useful documentation is available for both beginners and power users. A help center features over 300 articles on a wide range of topics, grouped into categories. The Ahrefs YouTube channel and on-site blog include video tutorials and guides on SEO best practices. Finally, the ‘Ahrefs Academy’ has online video courses for marketing and blogging.",
    "Ahrefs is similar in functionality to other major SEO tools like SEMrush and Moz, and they all offer similar price points for basic plans. While Ahrefs has historically been the more expensive option, recent pricing updates have brought it in line with the competition.",
    "You’ll need to carefully consider which features and data limits work best for your budget, because different products prioritize different features at different price points. For example, SEMrush’s basic plan offers 10 times the page crawls as Ahrefs’, but no API access or historical data, unlike the latter.",
    "Ahrefs boasts a number of powerful features that help set it apart, including a proprietary web crawler second only to Google in size and speed. While price points are broadly aligned with those of similar products, best-in-class link analysis, powerful research tools, and knowledgeable user support help make Ahrefs one of the best options for understanding and improving your domain’s online presence."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "4": "Features",
    "5": "Site Explorer",
    "6": "Keywords Explorer",
    "7": "Site Audit",
    "8": "Rank Tracker",
    "9": "Content Explorer",
    "10": "Interface and In Use",
    "11": "Support",
    "13": "The Competition",
    "15": "Final Verdict"
  },
  "links": {
    "Ahrefs": "https://ahrefs.com/",
    "SEO tools": "https://www.techradar.com/news/best-seo-tool"
  }
}