{
  "source": "https://www.techradar.com/reviews/sfax",
  "title": "Sfax review",
  "category": "computing",
  "updated": "2020-05-27T14:20:33Z",
  "author": "alex-mcomie",
  "summary": "How it compares to one of the top online fax services",
  "verdict": "Sfax gets the job done for online faxing, but its inflated pricing and mediocre interface prevent the service from surpassing the competition.",
  "pros": [
    "HIPAA-compliant with available BAAs",
    "Thorough user management tools for team admins"
  ],
  "cons": [
    "Dated interface",
    "No desktop or Android app"
  ],
  "article": [
    "Fax machines used to be standard office equipment, but they may no longer be a practical investment. Online fax services have helped businesses lower costs while sending faxes online or through fax via email.",
    "In our Sfax review, we’ll take a close look at the platform’s features and overall value. We’ll also see how it compares to Fax.plus, one of the best online fax services. While Sfax is a convenient way to send and receive electronic faxes, it’s significantly more expensive than many competitors.",
    "Sfax is available at three price points. Users with large-scale needs can also contact Sfax directly for information about a customizable Enterprise plan. All subscriptions come with one month free when a full year is paid in advance.",
    "Standard costs $29 per month and includes up to 350 combined sent and received pages, with extra pages available for ten cents each. At $49 per month, Plus comes with 700 pages and an available BAA. Finally, Contender costs $99 per month for 1,500 total pages, a fax download service, and access to the Sfax API.",
    "Sfax provides a variety of tools that make it a great option for businesses of all sizes.",
    "First, subscribers at all price points can add unlimited users to their accounts and manage contacts for convenient faxing. Business associate agreements (BAAs) are also available for users at the Plus tier or higher. With Sfax, team leaders can add users, adjust permissions for each individual, and monitor account activity from the admin dashboard.",
    "Sfax also comes with convenient features for both personal and business users. Both incoming and outgoing faxes are automatically stored for a full year. Furthermore, Contender and Enterprise users can download faxes to their computers as PDF or TIF files, enabling users to access files locally rather than having to access the website.",
    "On the other hand, there are also a few features missing from Sfax. There’s no option to schedule faxes, and there doesn’t appear to be a way to expand online storage beyond the one-year limit.",
    "Furthermore, Sfax doesn’t have an Android app, and the iOS version has notable flaws. For example, it doesn’t support adding contacts or adjusting profile settings. While we only experienced a few minor graphical glitches during our test, other users report more serious issues, and the app has a rating of just 1.3 stars on the App Store.",
    "It’s easy to create an Sfax account in just a few steps. After verifying your email address and entering payment information, you’ll be asked to create a username and password.",
    "Unlike many other internet fax platforms, Sfax doesn’t send new users a plain-text password via email. Furthermore, the verification link expires after 72 hours to protect your security. Keep in mind that you will need to enter payment information to sign up, even if you’re starting with a free trial.",
    "Sfax has everything you need to send and receive faxes, but the design is slightly dated compared to many competitors. Without a desktop app or mobile app for Android, you’ll have to access the website unless you’re using an iOS device.",
    "That said, Sfax is relatively easy to use once you get used to the interface. The dashboard is separated into five tabs: Faxes, Contacts, Cover Pages, Documents, and Settings. In general, faxes sent through Sfax should arrive at their destination within one minute per page.",
    "Sfax provides excellent security for everyone from individuals to large businesses and healthcare organizations. The platform is HIPAA-compliant, and BAAs are available upon request.",
    "Sfax protects sent documents with 256-bit TLS encryption with AES algorithms, and documents are stored in SSAE16 Type 2-compliant data centers. You can also add an extra layer of security to your account with one-time and 30-day PINs via two-factor authentication. All things considered, Sfax is an extremely secure internet fax client.",
    "Sfax provides informative videos and guides to help you get the most out of the platform. Videos cover topics such as exporting faxes, editing documents within Sfax, and organizing existing faxes. You can find articles on a variety of additional subjects in the Help Desk section.",
    "If the Help Desk doesn’t have what you’re looking for, you can also contact Sfax directly for a response within one business day. Along with a web form for support tickets, Sfax provides help via phone and email. Unfortunately, there are no listed hours for the support team.",
    "Sfax doesn’t offer a free plan, and its paid subscriptions are surprisingly expensive compared to other options. Fax.plus, for example, provides excellent online fax tools for a fraction of the price. Its Business plan comes with 800 monthly free pages and costs only $19.99 per month.",
    "In contrast, Sfax charges $49 per month for just 700 pages through the Plus plan. Fax.plus also provides a sleek mobile app along with a desktop app, Chrome extension, and integrations with Microsoft programs like Word and Outlook. While BAAs are only available through the Fax.plus Enterprise plan ($49 per month), the platform comes with most of the same features at a much lower price.",
    "While Sfax is a reliable way to send faxes online, it doesn’t provide any unique features or benefits compared to the best online fax services. Furthermore, Sfax subscriptions are more expensive than those of many competitors for the same number of pages.",
    "With a relatively basic design and no direct integrations with third-party applications, Sfax simply doesn’t offer enough to stand out. There are more electronic fax services than ever, and you’ll likely get more for your money from another platform."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features and utilities",
    "9": "Setup",
    "11": "Interface and performance",
    "13": "Security",
    "15": "Support",
    "17": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "Fax machines": "https://www.techradar.com/news/best-fax-machines",
    "Online fax services": "https://www.techradar.com/best/best-online-fax-service",
    "Sfax": "https://www.scrypt.com/sfax/",
    "PDF": "https://www.techradar.com/news/the-best-free-pdf-reader",
    "online storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "email": "https://www.techradar.com/news/best-email-hosting-providers",
    "Fax.plus": "https://www.techradar.com/reviews/faxplus"
  }
}