{
  "source": "https://www.techradar.com/reviews/anyplace-control-review",
  "title": "Anyplace Control review",
  "category": "computing",
  "updated": "2020-03-30T15:23:02Z",
  "author": "michael-graw",
  "summary": "Read our Anyplace Control review to discover an inexpensive remote desktop for Windows",
  "verdict": "Anyplace Control is a budget-friendly option for businesses relying on Windows computers. You just need to be willing to overlook the outdated design.",
  "pros": [
    "Extremely inexpensive pricing",
    "Connect via download link and auto-generated access ID"
  ],
  "cons": [
    "No dragging and dropping files between connected computers",
    "Doesn’t support two-factor authentication to protect online accounts"
  ],
  "article": [
    "If you want the best remote desktop software but don’t want to spend a fortune, it’s worth taking a closer look at Anyplace Control. This remote desktop connection manager is free to use for up to four computers on a local network and inexpensive for larger teams. While it’s not the most modern-looking remote computer access software, Anyplace Control has most of the basic features covered.",
    "In our Anyplace Control review, we’ll take a look at whether this budget remote desktop software has what you need.",
    "Anyplace Control offers a Basic plan that’s free to use with up to four host computers. However, you don’t get access to the company’s server, which you need to easily connect to a remote host over the internet. This means the Basic plan is most suitable for local area networks or IT teams who are comfortable configuring router settings.",
    "The Premium plan starts at $48.95 per year for one host computer, but the per-host price drops off as you add more licenses. If you need two to four hosts, it costs $31.95 per host per year, and five hosts or more costs $21.95 per host per year.",
    "Anyplace Control also has a HelpDesk plan for businesses that want to connect an unlimited number of hosts. You’ll need to contact the company for pricing options.",
    "Anyplace Control is designed to give you a remote desktop on Windows 10 computers. Unfortunately, the software won’t work with Mac or Linux computers, and there is no mobile app available, either.",
    "That said, the software does a nice job of covering the basic functions of remote access. You can completely control the keyboard, mouse, and power of a host computer. The software supports Wake-on-LAN, so you don’t have to worry about the host computer being turned off. You can also send chat messages, share audio with the host computer via Voice over IP, and easily record connection sessions.",
    "One minor ding against Anyplace Control is that you can’t drag and drop files between connected computers with the software. However, it does come with a file transfer module that closely resembles Windows File Explorer and lets you drag files across panels.",
    "Perhaps the best thing about Anyplace Control is how easy the software is to set up. Someone needs to be physically present at the host computer to download the remote access software the first time you use it. But, helpdesk teams will be happy to know that you can send users a download link to the host software.",
    "This means that even if the remote user doesn’t know how to use the Anyplace Control software, all they have to do is click a link and read off their computer ID to give you remote access.",
    "Premium users can also connect to a host remotely over the Internet. Setting this up is slightly more complicated, as you need to create an online account and log into it to add the host computer to your connection address book.",
    "The Anyplace Control software isn’t all that pretty. It looks like it was designed in Windows Vista and hasn’t been updated since. But, we will say that the interface is functional. When you first open up the program, there are three panels corresponding to the different connection options. For host users in need of help, the computer ID and access code are immediately apparent.",
    "Once you connect to a host PC, your control options are displayed clearly across the top of the screen. Helpfully, you’re free to change the size of your Anyplace Control window, so you can manage multiple remote connections or programs at once.",
    "We tested Anyplace Control over a local network and it worked seamlessly. There was no lag, and the file transfer module even paused and restarted without a hitch when the control computer’s connection was temporarily turned off.",
    "Anyplace Control has a few important security measures to help keep your PCs safe. First and foremost, host computer users can turn on notifications when a connection is initiated. They can also require permission for connections or for a remote user to take full control of their keyboard and mouse.",
    "If you connect over the Anyplace Control server, you’re protected by 128-bit encryption as well as two passwords—one for your online account and one for the remote computer being accessed. However, beware that Anyplace Control doesn’t support two-factor authentication for logins to your online account.",
    "Anyplace Control has an online documentation center with tutorials, demo videos, and PDF manuals. If you can’t find an answer to your question, you can create a support ticket or email the support team.",
    "The company does have a phone number listed, but it’s supposed to be used only for urgent questions. Tech support is available 10 AM to 6 PM Eastern European Time (GMT +2), Monday to Friday.",
    "Anyplace Control is an extremely affordable remote desktop solution if your business runs entirely on Windows computers. The budget price does come with some compromises, including an out-of-date aesthetic and a lack of two-factor authentication to protect online accounts. But, for small teams and helpdesk services, the simplicity of this software can be a major advantage.",
    "Anyplace Control isn’t the only budget remote desktop software for Windows. RemoteUtilities has a similar offering with a one-time pricing structure which can end up being cheaper for long-term use by medium-sized teams. RemoteUtilities also has Mac and Linux clients in beta testing, which can be an advantage if your business has a few non-Windows machines in use.",
    "To see how Anyplace Control compares to the competition, read our Best remote desktop software guide."
  ],
  "headers": {
    "2": "Anyplace Control: Plans and pricing",
    "5": "Anyplace Control: Features and utilities",
    "8": "Anyplace Control: Setup",
    "11": "Anyplace Control: Interface and performance",
    "14": "Anyplace Control: Security",
    "16": "Anyplace Control: Support",
    "18": "Anyplace Control: Final verdict",
    "19": "The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "Anyplace Control": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6496537488067279000&xs=1&url=http%3A%2F%2Fwww.anyplace-control.com%2Fbuy.shtml%23.XoIMWIhKguU&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fanyplace-control-review",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}