{
  "source": "https://www.techradar.com/reviews/philips-telehealth",
  "title": "Philips Telehealth review",
  "category": "computing",
  "updated": "2020-06-15T20:30:04Z",
  "author": "jonas-p-demuro",
  "summary": "Connected and patient centered care throughout the health continuum",
  "verdict": "Philips Telehealth offers an array of services to help with staffing a facility, and improving patient and economic outcomes.",
  "pros": [
    "24/7 Helpdesk with toll free phone support",
    "Peer benchmarking",
    "Use of proprietary algorithms to improve outcomes",
    "Outpatient and inpatient offerings"
  ],
  "cons": [
    "Limited support options",
    "Opaque pricing",
    "eICU requires additional staff"
  ],
  "article": [
    "The history of Philips reaches back to 1891, with father and son, Frederik and Gerard Philips from the Netherlands founded Philips & Co for the manufacturing of incandescent light bulbs and other related electrical devices; Gerard’s brother Anton joined the company a few years later in 1895. The Philips interest in healthcare came some years later with such products as X-ray devices in 1918, and the Synchrocyclotron (for the treatment of malignant tumors) in 1949, along with a global operation.",
    "Today, Philips remains involved in many consumer products, as well as an emphasis on enterprise healthcare including CT scanners and Philips Azurion for interventional radiology.",
    "The Philips Enterprise Telehealth portfolio covers a full range of connected health services. Philips also supports this with related offerings with a patient monitoring portfolio, consulting services, and clinical informatics. A full spectrum of healthcare needs gets covered, including both outpatient and inpatient offerings.",
    "There are three offerings for the ambulatory setting. The first is eIAC, which stands for electronic Intensive Ambulatory Care. The next is eCAC, electronic Chronic Ambulatory Care, and the last is eTrAC, which is an electronic Transition to Ambulatory Care. These programs are accomplished via multi-disciplinary teams at the Telehealth Center.",
    "The other half focuses on Critical and Acute Care programs, which also has three programs. For the most critically ill patients, eICU (electronic Intensive Care Unit) can supply intensivists as needed for patient management. The eAcute program is designed for coverage of both medical and surgical needs. Finally, there is the eConsultant program designed to bring in expertise through electronic telehealth technology when needed, such as tele-neurology to support stroke care.",
    "The use of Philips Telehealth does provide some benefits. An important one is that each patient gets the same care, regardless of their location, so that even remote or rural areas can have access to qualified specialists. When the right care gets provided in a timely fashion, there is published data that it can lower the cost of care, as well as decrease utilization, and increase retention of clinicians.",
    "With Critical Care specialists in short supply, the eICU program is a popular one. This allows for remote surveillance of critically ill patients from a central location. For consistent care, these clinicians use proprietary algorithms for support in the clinical decision making. Philips has a predictive algorithm that uses “a proprietary database of anonymous clinical data,” with the goal of identifying and prioritizing patients for earlier intervention for improved results.",
    "Speaking of results, with the Philips Telehealth eICU offering, a large amount of data gets collected, including vital signs, labs, diagnoses and outcomes. Philips then can provide peer benchmarking, allowing for comparison of this clinical data against other facilities, with actionable intelligence generated to identify areas for improvement.",
    "eICU’s in general are not without their controversies. The general view of them has been favorable, with advantages of improved clinical outcomes, and favorable economic costs cited in the literature.",
    "However, there are inherent limitations to a telehealth approach to patient care. While patient interviews, and interaction with staff can certainly happen through a video platform, especially now with the ubiquity of high speed broadband connections, not everything that a clinician does can be done remotely. This includes directly examining the patient, such as feeling directly for tenderness on an abdominal exam, and assessing for peritoneal signs. Furthermore, any procedures that would be required for the patient’s care, such as in the case of eICU, an endotracheal intubation, or placement of an invasive monitor, both commonly needed, would have to be performed by another clinician physically present. This relegates the eICU to more of a supplemental service, and while it can certainly bring needed expertise to the bedside of the critically ill, it cannot stand alone as a clinician in the hospital would still be required.",
    "Support for Philips Telehealth services is offered through an online support area. It was at first a little concerning to see that the healthcare offerings are supported right alongside the consumer products. First, you choose the product that you need support with, and then a toll free number specific to the product line is given.",
    "There is also an Incenter, that offers “24x7 access to the most up-to-date product service information,” along with a searchable library of technical documents and user manuals for the offering.",
    "In the case of the eICU, there is 24/7 Helpdesk availability, along with diagnostics. There is also clinical training and workshops provided to support the program.",
    "There is no indication that other support options are available, such as chat or email.",
    "As these are enterprise offerings, the pricing is opaque. Company contact, along with providing your contact details is required for a custom quote.",
    "Philips Telehealth offers a full range of connected services, that span the most critically ill with their eICU offering, to the other end of the spectrum for the ambulatory care setting. The pros include 24/7 support via a toll free number, integrated peer benchmarking for comparison of results, and proprietary algorithms for care for more consistent outcomes. The cons include the opaque pricing that requires company contact, the limited support options such as no direct chat, and the other limitations integral to telehealth such as the inability to perform procedures. Overall, Phillips is a market leader in the area of telehealth with a strong reputation."
  ],
  "headers": {
    "2": "Features",
    "8": "Drawbacks",
    "10": "Support",
    "14": "Pricing",
    "15": "Final verdict"
  },
  "links": {
    "Philips Enterprise Telehealth portfolio": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2114622846539686400&xs=1&url=https%3A%2F%2Fwww.usa.philips.com%2Fhealthcare%2Fsolutions%2Fenterprise-telehealth%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fphilips-telehealth",
    "improved clinical outcomes, and favorable economic costs": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1297635/",
    "assessing for peritoneal signs": "https://www.wikilectures.eu/w/Signs_of_Peritoneal_Irritation"
  }
}