{
  "source": "https://www.techradar.com/reviews/aweber",
  "title": "AWeber email marketing software review",
  "category": "computing",
  "updated": "2020-10-29T21:52:21Z",
  "author": "john-faulds",
  "summary": "Email marketing software aimed at small businesses",
  "verdict": "AWeber provides excellent customer support but its pricing is at the upper end of the scale, it lacks advanced automations, its selection of templates isn’t great, and unsubscribes count towards your plan total.",
  "pros": [
    "Good list management tools",
    "Excellent customer support"
  ],
  "cons": [
    "Lack of advanced automations",
    "Have to manually delete unsubcribes"
  ],
  "article": [
    "AWeber is almost as old as the Internet itself and has evolved into one of the best email marketing services for small businesses and entrepreneurs available. AWeber promises to do most of the work required to run an email marketing campaign for you, leaving you free to concentrate on growing your business.",
    "To find out how well these claims stack up and whether you should be using it for your business, in our AWeber email marketing services review, we’ll be looking at its plans and pricing, features, security, ease of use, and support.",
    "AWeber has five plans based on how many subscribers you have. Plans can be paid for monthly, quarterly, or annually. If you choose to pay quarterly, there is a 14% price reduction, and 14.9% if you pay annually.",
    "The cost scales according to the number of subscribers you’re sending to. Up to 500 subscribers will cost $19/month, while 10,000–25,000 subscribers will set you back $149/month.",
    "There are no setup fees, and all plans come with all of the service’s features included, even the 30-day free trial. One thing you need to be aware of, though, is that people who unsubscribe from your lists are still counted on the total number of subscribers. To avoid being charged extra, you’ll need to manually delete unsubscribed users.",
    "AWeber’s aim is to simplify email marketing, and there is a good selection of features designed for that purpose. The AI-powered template designer, a large library of pre-existing, free templates, and the drag-and-drop editor mean you can make professional-looking emails with no coding knowledge required.",
    "AWeber can also be used to create landing pages without the need to have a website if you need to get a business online quickly. And, email content creation can be automated by sending an email whenever you publish a blog post.",
    "Marketing emails ending up in junk or spam folders is often a problem, but AWeber claims to lead the industry in ensuring that email campaigns reach the intended recipient’s inbox.",
    "To analyze how your campaigns are performing, AWeber produces reports with all the key performance indicators. And you can do split testing on subject lines and messages to see what works best.",
    "To get started with AWeber, you first have to sign up for a free trial. You will need to provide your credit card details too, which means if you decide not to continue with the service, you’ll have to remember to cancel your account before the end of the 30-day trial.",
    "The form will be set to subscribe you to the quarterly plan by default, but if you want to take advantage of the free trial, you’ll need to change it to monthly.",
    "You’ll then be sent an email to verify your email address and after having done that, you will be asked to create a password, add company information, and set up your first subscriber list.",
    "Once you’ve completed the setup phase, AWeber makes it easy for you to find the key functions of the service: adding subscribers and creating emails.",
    "Adding subscribers is an easy-to-follow, five-step process that begins by importing a file or copying and pasting your data, mapping that data to AWeber fields, confirming the opt-in message, adding tags, and then providing information about how the people came to be on your list.",
    "Creating an email was a bit less intuitive, though. There are three options for creating emails: the drag-and-drop email builder, plain text message, and HTML editor. When choosing the drag-and-drop builder, we were presented with a blank canvas with a list of elements that could be added on the left and templates on the right.",
    "The thumbnails for the templates are quite small, so to get a proper look at them, you have to apply them to your email. To start with, things didn’t seem to be working properly. Only part of the template seemed to be applied. It wasn’t until we unchecked a small box at the top that says “Keep My Message Content” that the whole template, including content and images, were applied. This is confusing and makes for a less than ideal user experience.",
    "When you actually begin working on your own content, though, you’ll want to keep that box ticked.",
    "Unlike some email marketing services, AWeber doesn’t make a big deal about its security measures on its website. The information is hidden away in its Data Processing document, which we had to use a search engine to find.",
    "The page does say that the company uses encryption, automated and manual monitoring, backups, and regular risk assessments. It also claims that its data centers have DDoS detection and mitigation in place.",
    "All accounts are continuously monitored for fraud or abuse, and sensitive account information notifications are sent securely. In addition, all staff are subject to background checks prior to being employed and undergo regular security awareness training.",
    "AWeber has an impressive track record in support, having won several customer service awards in recent years. You can receive direct support either by live chat, which is available 24/7, by phone, which is available 8 AM to 8 PM ET, or by email.",
    "For those wanting to learn themselves, there is a knowledge base with articles, a video tutorial library, live and on-demand webinars, and a certified experts program which connects you with experienced marketing and design professionals who can help you with copywriting, graphic design, or marketing strategy.",
    "AWeber may be one of the oldest players in the email marketing services space, but there’s no shortage of alternatives.",
    "For a cheaper option, for instance, MailerLite will cost $10/month for 1000 subscribers and unlimited emails, or it’s free for the same number of subscribers with a limit of 12,000 emails.",
    "Mailchimp also offers 24/7 support, an excellent template editor, and a free plan with limited features for up to 2000 contacts. For more features, its cheapest plan starts at $9.99/month for 500 contacts.",
    "If having 24/7 support options available is important to you, then AWeber is worth considering, as it does provide a high level of customer support. But it’s certainly not the cheapest option available, the user interface of its email builder isn’t as intuitive as it could be, and the design of its templates didn’t impress us much.",
    "Having to manually keep on top of your unsubscribes to avoid being bumped up to more expensive plans is also not something busy business owners should be expected to do. And aside from useful list management tools, AWeber lacks in the automations department."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "9": "Setup",
    "12": "Performance",
    "17": "Security",
    "20": "Support",
    "22": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "best email marketing services": "https://www.techradar.com/best/best-email-marketing-software",
    "landing pages": "https://www.techradar.com/best/landing-page-creator",
    "email": "https://www.techradar.com/best/best-email-clients",
    "password": "https://www.techradar.com/best/password-manager",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "backups": "https://www.techradar.com/best/best-backup-software",
    "background checks": "https://www.techradar.com/best/background-check-services-sites-online",
    "graphic design": "https://www.techradar.com/best/best-graphic-design-software",
    "MailerLite": "https://www.techradar.com/reviews/mailerlite",
    "Mailchimp": "https://www.techradar.com/reviews/mailchimp"
  }
}