{
  "source": "https://www.techradar.com/reviews/wifi-map-vpn",
  "title": "WiFi Map VPN review",
  "category": "computing",
  "updated": "2020-12-21T19:11:44Z",
  "author": "sead-fadilpasic",
  "summary": "Free Wi-Fi finder meets VPN",
  "verdict": "Despite being part of a totally different platform, WiFi Map’s VPN service is a good one, offering most of the features you’d expect from a decent VPN solution: superb speeds, strong privacy, acceptable pricing, and support for torrenting.",
  "pros": [
    "Excellent VPN performance",
    "P2P-friendly",
    "Unblocks geo-restricted content",
    "Isn’t expensive"
  ],
  "cons": [
    "Not much in the way of extras",
    "Limited in accepted payment methods"
  ],
  "article": [
    "WiFi Map is a crowdsourcing project that helps mobile users all over the world locate a free WiFi hotspot near them. It also navigates you toward these hotspots, shows their passwords, and lets you connect to them in just a few taps.",
    "Since accessing these hotspots might make you vulnerable to hackers, this solution also includes a VPN, which aims to protect you from any potential data theft through unsecured connections, unreliable infrastructure, hacks, geo-tracking, and other problems.",
    "The basic, ad-supported Wifi Map service is free, but if you want to remove the annoying ads and get perks like offline maps and VPN servers in a range of locations, then you can upgrade to the Pro version for $29.99/year, currently available at a discounted price of $19.99/year, which equates to $1.66/month.",
    "Under one account, you’ll be able to run up to 5 concurrent VPN connections. There’s also a 3-day free trial of this service, after which the full amount is charged.",
    "You can also purchase an eSIM - an electronic SIM card that lets you connect to the internet when there’s no Wi-Fi around. The eSIM service can be purchased through different plans.",
    "The “Europe” plan covers 31 European countries and costs €4.99 ($6.05). The “Europe +” plan covers 13 additional countries and also costs €4.99. The “Australia & New Zealand” package costs €9.99 ($12.99), while the “USA, Mexico & Canada” package €16.99 ($20.60). The “Asia” plan will get you online in 12 countries for €22.99 ($27.83), while the “Latin America” package covers 16 countries in the Latin American region and costs €32.99 ($40). The “Africa” plan includes 16 countries and also costs €32.99. Finally, the “World” package covers 116 countries and will cost you €99.99 ($121).",
    "Each plan includes 1GB of data, 500,000 instant messages, 5,000 sent and received emails, 2,000 photos for social media, 300 voice calls, 10 hours of web browsing, 50 hours of map navigation, and is valid for 30 days. Do note that eSIM doesn’t come with a phone number.",
    "Payments for all parts of WiFi Map’s offering can be made via credit/debit cards only.",
    "WiFi Map’s VPN service differs greatly from leading solutions like ExpressVPN, NordVPN, Surfshark, or CyberGhost that are exclusively designed to offer VPN only.",
    "This makes Wifi Map a unique online platform with advantages on multiple levels. It will not only protect your privacy online but will also give you access to free WiFi and ensure you always have access to a connection.",
    "This VPN will let you connect to a server in whichever country you want and will also allow you to access all of the streaming content you desire, specific to those countries, such as from popular platforms like BBC iPlayer and Netflix.",
    "This solution is offered by the company WiFi Map LLC, registered in New York. It is available in more than 200 countries around the world, including Grenada, Bahamas, Suriname, Montenegro, Gibraltar, Uzbekistan, New Caledonia, Syria, Bahrain, Tanzania, and many, many more, while also offering access to over 2,000 VPN servers in these places.",
    "Wifi Map supports P2P/torrenting and will grant you double privacy protection, including IKEv2 encryption, DNS Leak Protection, and IP Address Leak Protection. The network also supports OpenVPN and IPsec protocols.",
    "The company’s Privacy Policy states that it may share the information it collects, “including WiFi hotspot information, precise location data, and user information and including personally identifiable information, with third parties under licensing or other arrangements.” As it further explains, this sharing is for research and commercial purposes, “including interest-based advertising and mobile network and hotspot performance testing.” You can opt out of this in your device’s settings.",
    "Under “WiFi VPN Data Collection”, the same document also states that when you use this VPN service, the only data collected is the total amount of bytes transferred in a 30-day period and the timestamp of your last activity. This data is used to enforce free tier limitations, prevent abuse, and remove inactive accounts. On the other hand, it doesn’t store your source IP, sites you visited, or the historical record of VPN sessions.",
    "When connected to a VPN server, certain information will be stored in the server’s memory, such as the OpenVPN/IKEv2 username, connection time, and amount of data transferred.",
    "Nothing else is recorded, as according to the provider, “our bespoke system eliminates the need to store data entirely. This data resides only in server’s memory while you’re connected, and is immediately discarded by the VPN server when you disconnect. Since it doesn’t get logged into a permanent database, there is nothing to delete.”",
    "It also adds that, “as we do not store any historical logs on who used which IP address, and since IPs are shared by dozens/hundreds of people at any given moment, so we cannot tie any activity to a specific account.”",
    "All of this sounds pretty reassuring, but we would love to see independent confirmation of these claims by a third-party auditor.",
    "WiFi Map with its VPN functionality is available as an iOS and Android app. Its map of free WiFi locations can also be viewed in your PC browser, listing the WiFi’s location, name, number of active connections, as well as its download/upload speed and ping. However, the passwords are only visible inside the mobile apps and the VPN can only be used on mobile devices.",
    "At the time of writing, the iOS app has a rating of 4.6 stars (out of 5), as rated by 4.8K people. Its Android app has been rated by 805,185 users and currently has a score of 4.0 stars. It has been installed by over 50 million people.",
    "If you need help, you can get it via email, but you can also try the provider’s social media profiles on Facebook, YouTube, or Instagram. There isn’t any sort of an FAQ on the website, but we got our questions answered via email rather quickly.",
    "We had no trouble using this platform and installation was very simple. Immediately upon confirming our payment details, we were able to test the provider’s download speeds for various locations on a 38Mbps testing connection. In short, the performance was excellent.",
    "A server in Belgium delivered an impressive 21.8Mbps. The USA didn’t perform as well (7.35 Mbps), but this is to be expected considering the distance from our physical location. As we moved to the other side of the world, to a server in Hong Kong, we recorded speeds of 4.74Mbps.",
    "WiFi Map’s VPN does a great job of protecting your privacy when accessing unsecured networks and even offers some perks you’ll see among the industry’s finest: support for torrenting, access to geo-restricted content, thousands of servers, and excellent download speeds.",
    "That said, it is a bit limited in terms of features, it functions on mobile devices only and only accepts payments made via credit cards."
  ],
  "headers": {
    "2": "Price",
    "8": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "12": "Privacy and encryption",
    "19": "Support",
    "22": "Speed and experience",
    "24": "Verdict"
  },
  "links": {
    "WiFi Map": "https://www.wifimap.io/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://www.wifimap.io/privacy",
    "iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2701192454654391300&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fid548925969%3Fmt%3D8",
    "Android app": "https://play.google.com/store/apps/details?id=io.wifimap.wifimap&hl=en&gl=US",
    "email": "mailto:support@wifimap.io",
    "Facebook": "https://www.facebook.com/wifimap.io/",
    "YouTube": "https://www.youtube.com/channel/UCiFOf0buPLOZEQkNA7ghe9Q",
    "Instagram": "https://www.instagram.com/wifimap/"
  }
}