{
  "source": "https://www.techradar.com/reviews/hp-elite-dragonfly",
  "title": "HP Elite Dragonfly business laptop review",
  "category": "computing",
  "updated": "2020-01-22T17:34:14Z",
  "author": "jackie-thomas",
  "summary": "A dream come true for the traveling professional",
  "verdict": "The HP Elite Dragonfly is easily the best laptop out there for traveling professionals and executives. It's thin, light, powerful and is one of the most stylish laptops on the market. If you have the cash, you can't go wrong with this laptop.",
  "pros": [
    "Impeccable design",
    "Excellent battery life",
    "That keyboard",
    "LTE compatible"
  ],
  "cons": [
    "Pretty expensive"
  ],
  "article": [
    "Most of the time, when a business laptop like the HP Elite Dragonfly crosses our desk, we kind of roll our eyes and get on with testing it. Laptops for professionals never tend to be too terribly exciting or much to look at, after all, as they're designed to get a job done rather than be shiny consumer products. But what if there was a laptop that could do both?",
    "Well, there finally is. The HP Elite Dragonfly is packed not only with the security and IT features that businesses demand, but it also includes speedy hardware, plenty of ports, and most importantly: an aesthetic to die for.",
    "The HP Elite Dragonfly is, without a doubt, one of the most beautiful 2-in-1 laptops we've tested in a long time, and it's so thin and light that we took an entire month to review it – just so we had an excuse to travel with it over the holidays and through CES 2020.",
    "Now, you should keep in mind that the HP Elite Dragonfly definitely isn't cheap. This thing will run you $1,629 (£1,618, AU$2,770) just to get you on the ground floor. The fact that this laptop is targeted almost exclusively to traveling professionals makes this price point make a little more sense, but this is definitely a laptop that has major crossover appeal.",
    "What makes this laptop indispensible for the traveling professional, though, is the LTE integration. Some driver issues stopped us from having a totally seamless experience with having an \"online anywhere\" experience, but for the most part it's become a feature that we're having trouble imagining life without.",
    "Essentially, as traveling professionals ourselves, the HP Elite Dragonfly has been a dream come true. If you're constantly on the road, the lightweight design, always-connected LTE coverage and the speedy internals make the Elite Dragonfly one of the best laptops out there.",
    "Right now, you can pick up the HP Elite Dragonfly for $1,629 (£1,618, AU$2,770) to start. That'll net you an 8th-generation Intel Core i5 U-Series processor, 16GB of RAM and a 256GB SSD – though the SSD gets doubled in the UK entry configuration.",
    "For the hardware on offer, that's a pretty penny to be sure, but it starts to make sense once you take the LTE and the 2-in-1 design into consideration.",
    "If that doesn't sound like enough horsepower for the work you need to do, you can of course pack the HP Elite Dragonfly with more powerful hardware. At the top end, you'll get an 8th-generation Core i7 processor, 16GB of RAM, and a 256GB SSD - which is a weird place to stop.",
    "But that's just for the pre-built configurations. You're able to create your own configuration in the US with much more storage and a better display. If you absolutely max it out with an Intel Core i7 processor, a 4K display and a 2TB SSD, the cost tops out at $3,258.",
    "If you're in the UK, you can still get up to a 1TB SSD and a 4K display, though that will run you £1,950. Australians max out with the same configuration as the UK, and that runs AU$4,210.",
    "If the HP Elite Dragonfly didn't have the word \"Elitebook\" printed below the keyboard, there's no way we'd know it's a laptop aimed at professionals. Simply put, this laptop is absolutely stunning. It comes in a gorgeous Iridescent Dragonfly Blue color option that simply stands out wherever you plop it down.",
    "Thanks to the magnesium chassis, it's extremely light, too. The Dragonfly comes in at just 2.2 lb (0.99kg) to start, though it will be a bit heavier if you go for the optional larger battery. The laptop has a small footprint, too, measuring just 11.98 inches wide and 0.63 inches thick. HP managed to do this by making a display with obnoxiously thin bezels, resulting in an 86% screen to body ratio. We've definitely seen thinner bezels out there, but this is a 2-in-1 laptop, so we're suitably impressed.",
    "As a bonus, an oleophobic coating keeps the laptop looking fresh no matter how many fingerprints or stains make their way onto the chassis. It's super easy to just wipe it clean without having to wrestle with a bunch of chemicals. Trust us, we put this laptop through its paces, traveling from New York to Colorado, back to New York, then to CES 2020 and on back to the big city again. Our review unit has definitely seen its fair share of dirt, and it still looks amazing – albeit with a couple of scratches on the chrome HP logo on the lid.",
    "Because this is a professional-oriented device, ports are super important. on the right side of the laptop, you get an HDMI, 3.5mm audio and two Thunderbolt 3 ports – either of which can be used for charging. Over on the left, you'll find a solitary USB 3.1 Type-A port, the power button and a Nano SIM slot.",
    "You can find the Dragonfly with a 1,000 nit 1080p display with Sure View or opt for a 550 nit 4K display, and we're sure both of those look absolutely phenomenal. The model HP sent us for review, however, was a 1080p display at 400 nits, and while it's not as good as we imagine the other display options are, it's definitely bright enough and colorful enough to keep up with our show floor Photoshop needs.",
    "The speakers are a winner here, too. HP continues to lead the pack when it comes to Windows laptops in the speaker department as far as we're concerned. Rather than tucking them them under the laptop to fire sound impotently into the table, they instead project sound upwards. We don't imagine a lot of people are going to use the Elite Dragonfly for jamming out to their music, but that's totally what we did with it, and will continue to do so until HP demands the laptop back from us.",
    "Think about it: no matter how hard you're working during the day, you're going to need some downtime watching Netflix or listening to music at the end of the day, and the Dragonfly definitely delivers.",
    "And the keyboard - oh, the HP Elite Dragonfly's keyboard is sublime. With how thin this laptop is, HP could have easily got away with putting a shallow clicky affair in here (think Apple Butterfly keyboard), but it didn't. Instead, this keyboard feels like you're literally typing on a cloud, and it's just about as loud as you'd imagine that simile going. Even when we're furiously typing up a last-minute CES 2020 opinion piece, we can barely hear the keyboard.",
    "Because the HP Elite Dragonfly is only packed with 8th-Generation Whiskey Lake processors with vPro, it's not the fastest Ultrabook out there. But it's not exactly far behind, either.",
    "We could go on at length about the lack of serious improvement generation-on-generation with Intel's processors, but the fact is that this laptop is more than fast enough for everything you'd reasonably throw at it.",
    "Our benchmarks totally reflect this, too. In Cinebench R20, the Dragonfly was able to get a respectable 1,059 points, which is great for such a portable device. What's more impressive, is that in the Geekbench4 single-core test, the Dragonfly actually out-performs a lot of gaming laptops. It scored 5,266 points in this test, compared to the Alienware M15's 4,995. That's not a giant difference, of course, but we're still impressed that the HP Elite Dragonfly is able to keep up in this way.",
    "With 16GB of RAM, the HP Elite Dragonfly is more than fast enough to keep up with our manic Chrome tab habits, even during an event like CES. We swear at one point we had like 100 tabs open on this thing and it just kept chugging along.",
    "In fact, we can't get it to slow down with our normal workloads, no matter how many things we try to do at once. It's not until we try to load up a game (wouldn't recommend, by the way) that the laptop starts to meet its maker.",
    "Where this laptop particularly impresses us is in its battery life. Now, we lived with this device longer than we typically do with a laptop, mostly thanks to the holidays and the hectic CES season, but we never really have to worry about this laptop not lasting through whatever project we're working on.",
    "Any laptop that we're able to take to the CES show floor with half battery and have it survive throughout the day deserves bragging rights. Taking it out of our backpack again and again, jotting down notes, banging out quick news articles in the press room and even taking notes using the touchscreen. This is all stuff that puts strain on the laptop's battery, and we're pleased as punch to report that the HP Elite Dragonfly holds up.",
    "This isn't necessarily reflected in our battery benchmarks, however. In the TechRadar battery test, where we loop 1080p video until the laptop dies, the Elite Dragonfly lasts 8 hours and 11 minutes. But in the PCMark8 Home battery test, it only lasts 4 hours and 42 minutes. Anecdotally, however, we experienced the laptop lasting much longer than either of these tests let on.",
    "Because the HP Elite Dragonfly is a professional device meant to play nice with IT departments, this is a very secure laptop. The boot sector is protected by HP Sure Start, which means even if the computer gets compromised, you'll always be able to recover it - something that's definitely not a given these days. Even if an attacker deletes the BIOS, this feature will overwrite whatever the attack did.",
    "But, that's just the tip of the security iceberg. HP is calling the camera the \"HP Privacy Camera\", which means there's a little physical shutter that covers the lens, so that even if someone gets access to your webcam, they can't actually see through it unless you physically move the shutter with your finger.",
    "If you get a model with HP Sure View, you'll also be able to protect your screen from anyone glancing over your shoulder and trying to read what you're working on.",
    "Security is critically important, especially if you're looking for a device to get a bunch of important work done on the go, so it's a relief that the HP Elite Dragonfly nails it so thoroughly."
  ],
  "headers": {
    "0": "Two minute review",
    "6": "Price and availability",
    "11": "Design",
    "19": "Performance",
    "24": "Battery life",
    "27": "Software and features",
    "31": "Don't buy it if..."
  },
  "links": {
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Alienware M15": "https://www.techradar.com/reviews/alienware-m15-review"
  }
}