{
  "source": "https://www.techradar.com/reviews/identalsoft",
  "title": "iDentalSoft review",
  "category": "computing",
  "updated": "2020-10-27T18:13:41Z",
  "author": "jonas-p-demuro",
  "summary": "The well supported, comprehensive feature based dental practice software",
  "verdict": "iDentalSoft has plenty of features for managing a dental practice, but we wish that the pricing was more upfront.",
  "pros": [
    "Choice of support methods",
    "Enhanced credit card processing",
    "Robust patient portal",
    "Automated patient reminders"
  ],
  "cons": [
    "Opaque pricing",
    "Lacks mobile apps",
    "No refunds for partial months if canceled",
    "No toll free support number"
  ],
  "article": [
    "iDentalSoft has been around a decade, after being founded in 2010 with the goal of becoming a leading cloud-based dental practice management solution. Its mailing address indicates Milpitas, California, better known as part of Silicon Valley, and there is also an office in Kansas City, Kansas. The plan was to unburden dentists from running software via a local server, with the inherent IT difficulties that this incurs, and to offer a superior cloud solution to streamline practice management for the modern dentist.",
    "There is truly no shortage of features that iDentalSoft encompasses, for both the clinical, and the business side of things.",
    "The front office has support for their common tasks, such as registration forms, as iDentalSoft allows for paperless registration. The forms can be completed from either a kiosk or tablet from within the waiting room, or through the online patient portal- at the patient’s convenience, and from the convenience of home. Either way, once the paperwork is finished, the office staff gets an alert so they know to review it.",
    "There is also an emphasis on patient engagement. Single, one off emails can be sent from within the program right within the patient’s profile, and then tracked. There are also integrated automated reminders with patient e-confirmations that can be sent- via email or SMS- to bring patients in for their services. Recall lists can also be easily generated.",
    "Payment also is enhanced as credit card processing is integrated as well. Staff at the front desk can take payments in person and over the phone. Payments can also be accepted in an automated fashion through the patient portal from wherever the patient happens to be.",
    "On the clinical side, charting is quite intuitive, with an interactive odontogram, and periodontal charts. These can even be overlayed over time, which can track a patient’s progress as their treatment proceeds. Navigation is enhanced with simple to use autocoding, and easy keyword searches. With this information charted, it is also easy to convert this to a treatment plan with a single click, for an easy to understand plan. Patients can easily see what their insurance provider will pay for, and what their financial responsibility will be. There is also an eSign feature for patients to provide a signature with a mouse or fingertip for consent for the treatment to proceed.",
    "There are also tools for the administration of dental practice. This includes a feature that can assign user roles for each person: front office, provider, billing, admin, owner. Then, each user will have a level of access that then controls what the user can access, and restricts them from accessing more than their role. Also, employees can be blocked from logging in when away from the office.",
    "It’s too bad that iDentalSoft does not have any app support for mobile platforms. This is increasingly popular, both for use in the office, and perhaps even more important for use when taking calls. However, it is stated that iDentalSoft can be used via “Any internet-enabled device,” including via a tablet, and the company does encourage this option.",
    "Another issue to point out is that while there is an offer of a free demo, we would prefer a free trial, which iDentalSoft does not provide.",
    "Users point out that iDentalSoft is English only, so users outside the US market are not supported. Another limitation is some users want more options to advance the X-rays automatically, and also to have more capability for on screen adjustments of radiological images.",
    "iDentalSoft gets supported through a variety of methods. The first is via phone support, although it is not toll free. Furthermore, the hours are limited, from 9 AM to 8 PM Eastern Standard Time, and it is not specified if it is closed for weekends or holidays.",
    "There is also support via email, but we caution that this is not HIPAA compliant, and patient information should not be transmitted via this method. There is also an online portal to submit tickets directly. iDentalSoft indicates that support via email and the ticket portal does happen as the incoming issues are reviewed on the off hours.",
    "There is also a lack of other methods, such as online chat. We also did not find any onboarding videos for on demand education, webinars, ebooks, or a community forum to support users of the platform.",
    "What is quite common for software these days, and in particular cloud software, iDentalSoft is sold as a subscription model. The pricing is opaque, and there is no further information throughout the company’s website, other than that company contact is a requisite for a custom quote to the practice.",
    "There is an additional charge for data migration for users who have an existing dental practice software provider looking to change.",
    "Looking elsewhere, we discovered that the cost of the software starts at $250 (£204) each month, with no indication how many dentists that covers, nor at how many locations. Payment is via credit card, and there are no refunds or credits for partial months of service.",
    "iDentalSoft brings plenty of functions to optimize the running of your dental practice. The pros include the enhanced charting, the choice of support methods, and the robust patient portal that allows for patient bill pay. The downsides range from the opaque pricing, the lack of mobile apps, and the additional charge for data migration. Overall, iDentalSoft has a compelling offering via its cloud-based software."
  ],
  "headers": {
    "1": "Features",
    "7": "Drawbacks",
    "10": "Support",
    "13": "Pricing",
    "16": "Final verdict"
  },
  "links": {
    "iDentalSoft": "https://www.identalsoft.com/",
    "dental practice management": "https://www.techradar.com/best/best-dental-practice-management-software"
  }
}