{
  "source": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
  "title": "Bose QuietComfort Earbuds review",
  "category": "audio-visual",
  "updated": "2021-01-08T01:15:41Z",
  "author": "sharmishta-sarkar",
  "summary": "Noise cancellation in the true wireless market just got serious",
  "verdict": "It’s Bose’s second attempt at a set of true wireless headphones, and the QuietComfort Earbuds are leaps and bounds better than the older SoundSport Free. Not only is the design a lot better, the noise cancellation is exemplary. Sound quality is also really very good – albeit a touch less bassy as compared to Sony – with superb clarity. They’re incredibly comfortable and well balanced too, despite their bulky form factor.",
  "pros": [
    "Best-in-class ANC",
    "Rich, clear sound",
    "Secure, comfortable fit",
    "Wireless charging"
  ],
  "cons": [
    "Lacks on-board volume control",
    "Bulky charging case",
    "Case could offer more charge"
  ],
  "article": [
    "UPDATE (Dec 2020): Our only complaint about the Bose QuietComfort Earbuds was the lack of volume control via touch – that has now been fixed. The Bose Music app has been updated to add touch controls for volume and we've updated our original review (Design section) to reflect that change.",
    "Bose isn’t known for its true wireless earphones, with the QuietComfort Earbuds only the second model released by the big audio brand. In the three years between the Bose SoundSport Free and the QC ‘Buds, Apple and Sony have outpaced Bose, releasing the AirPods Pro and WF-1000XM3 that quickly became the best true wireless headphones to feature active noise cancelling.",
    "Those three years, though, were spent really well. The new Bose QuietComfort Earbuds are one of the best true wireless ‘buds we’ve tested, with what is arguably the best noise cancelling performance from any device in this class.",
    "Bose has taken a leaf out of its Noise Cancelling Headphones 700 playbook and added 10 levels of ANC to the QC ‘Buds as well. And at maximum, you’re practically cut off from the rest of the world, encased in a cocoon of sound that’s made entirely up of your favourite tunes. You’ll only be able to hear some high frequency sounds like sirens (and even they’re muted to a large degree).",
    "This kind of powerful ANC doesn’t come at the cost of comfort or sound quality. The QC ‘Buds have a much improved design that’s similar to the Sony WF-1000XM3 in bulkiness, but far and away better balanced than the SoundSport Free. There’s more accessories in the box to ensure a better fit – so whether you’re walking, running or doing jumping jacks, the QC Earbuds sit firmly and very comfortably in the ear.",
    "No matter what genre of music you enjoy, the sound is absolutely enjoyable. You’re not going to get the pleasantly warm bass that Sony is known for, but the Bose QC Earbuds have just enough thrum at the low end to make the double bass in jazz sound ethereal. The QC ‘Buds definitely sound better at mid to higher volumes though, and no matter how loud you get, there’s no distortion and every layer within the music is perfectly clear. Vocals are crisp and every instrument in the background can be heard beautifully.",
    "Battery life is competitive enough, with up to six hours of playback from the ‘buds alone. The charging case though, which is pretty bulky, only offers two more full charges, whereas you’ll get three extra charges from the Sony WF-1000XM3 case. This is a little disappointing, especially considering the premium price tag the Bose QC ‘Buds come with.",
    "However, the Bose ‘buds are slightly more weather-ready than their Sony counterparts. Where the WF-1000XM3 has no IP certification, the Bose has an IPX4 rating. That means the Bose set is sweatproof and will survive a light drizzle, but that’s about it.",
    "So if you’re after a slightly more secure, slightly more treble-heavy, and slightly more weatherproof ANC in-ear ‘buds than Sony can offer right now, then the Bose QuietComfort Earbuds are the best alternative.",
    "[Update: Bose seems to be on the verge of releasing a new version of its Sport Earbuds – and they look like the lovechild of the Samsung Galaxy Buds Live and the Powerbeats Pro.",
    "As spotted by The Verge, photos of the Bose Sport Open Earbuds were included in an FCC filing (Federal Communications Commission), which usually indicates a release is on the horizon – though it doesn't necessarily mean the wireless earbuds will ever go into production.]",
    "Bose announced the launch of its new QuietComfort Earbuds in September this year, and the ‘buds went on sale soon after in early October. At launch, they cost a very premium $279 / £249 / AU$399 – similar to the launch price of the Sony WF-1000XM3. However, the price of the latter has since dropped, making the Bose option a lot more expensive at the time of writing. That said, if you wait for a major sale, there’s a good chance you’ll be able to get a set for less.",
    "Like Bose’s other QuietComfort headphones, the ‘Buds also come in a couple of different color options – there’s the usual Triple Black and, instead of the Luxe Silver, there’s a Soapstone model (which has been reviewed here).",
    "Unlike the SoundSport Free, which has a very chunky design, the Bose QC ‘Buds look a lot sleeker. It’s a similar aesthetic to the Bose 700 over-ears, but the in-ear headphones aren’t what we’d call small. Each ‘Bud measures 3.9cm x 2.6cm x 2.7cm and weighs 8.9g – that’s almost as bulky as the Sony WF-1000XM3 (which tips the scales at 8.5g each) and sticks out of the ear just as much.",
    "Despite the bulk, the QC ‘Buds are extremely comfortable to wear for hours on end (although we wouldn’t recommend you do so). They ship with three different sets of ear tips, which also feature fins for a more secure fit. We would have liked to see the ear tips come separate to the fins so listeners could choose different sizes of each to best suit both their ear canal and general shape. With that said, the very soft and squishy silicone makes it easy enough to find the right fit with the choices available without any discomfort whatsoever.",
    "Even the design of the ear tips has been well thought out – each has a conical shape that flares outward. This means you won’t need to shove the ‘buds deep into your ear to achieve a good fit and passive noise cancellation like you would with some other true wireless earphones.",
    "The outer panel of each ‘Bud is touch sensitive and offers limited control over your music and calls. At launch, in October 2020, there was no volume control, although as of early December 2020, Bose began rolling out the functionality to the 'Buds.",
    "At the time of writing this updated review, only iOS users have received the updated Bose Music app. To enable touch control for volume, you'll need to connect the 'Buds to your phone, tap on the settings icon (the gear wheel) and toggle on the button for 'Volume' listed under 'Control'.",
    "Presumably Android users will receive the functionality soon, until then though, there are only two other controls per ‘Bud. Double tapping the right will play/pause tracks, while a touch-and-hold gesture will bring up a voice assistant (either Google Assistant or Siri, depending on your device).",
    "Double taps on the left Earbud cycles through three levels of noise cancellation that you can set as your Favorites in the Bose Music app, while a touch-and-hold will perform a ‘Shortcut’. This is the only customizable control and your choices are between skipping forward to the next track or finding out the QC Earbuds’ battery level. We set our Shortcut to skipping tracks as battery levels are available on the Bose Music app (which you will need to use the ‘Buds).",
    "Big ‘buds means the charging case will also be big. Where Sony and Apple both offer sleek-looking charging cases (although Sony’s is definitely quite big), Bose seems to want to outdo its competition. The QC Earbuds’ charging case measures 8.9cm x 5.1cm x 3.2cm and weighs over 76g – that’s over twice as thick as Apple’s AirPods Pro case that weighs just 45g.",
    "Another feature that detracts from the overall design of the case is the button to open the top. It’s not the most convenient to use single-handed as you need to press it completely for the case to pop open, which it does without you needing to raise the lid yourself.",
    "The light-colored Soapstone model also manages to get dirty real quick – just an hour in a bag and the case picked up smudges from the other items it was in contact with. This may not be as much of an issue with the black version, but worth noting if you prefer the lighter color.",
    "The case’s functionality does make up a little for its obvious flaws – there’s a Bluetooth button on the inside, giving you an alternate way to pair devices manually, and there’s wireless charging that works with any Qi-supported device. A USB-C port is also available if you want to plug the case to a cable.",
    "Bose is known for its noise cancellation technology and we had high expectations from the QC ‘Buds. What we weren’t expecting was to be blown away by the ANC on these little earphones. The noise cancellation is best in class as far as we’re concerned, with the Sony WF-1000XM3 coming in a very close second.",
    "Just fitting the QC ‘Buds in the ear achieves a high amount of passive noise cancellation, but bump it up to level 10 and it blocks out pretty much everything except high frequency sounds. The hum of a ferry engine, revving motorcycle engines, screaming children – it all got drowned out when ANC was set at maximum during our testing. Even halfway through – at level 5 – you’ll be hard pressed to hear much of what’s happening around you.",
    "If you really need to hear what’s happening around you, you’ll need to drop down to level zero, which is the transparency/ambient mode on the QC ‘Buds. It matches the AirPods Pro by making ambient sound seem almost natural when ANC is switched off.",
    "We haven’t been traveling lately, so it’s hard to say how the QC ‘Buds will handle aircraft engine hums, but we’re confident that they’ll do very well.",
    "Another thing that impressed us was the stable connectivity between the ‘Buds and the devices we paired them with. The connection never once faltered between the individual ‘buds or between the ‘buds and the phone or laptop. That’s likely down to the fact that the ‘buds protrude a little out of the ear and also that Bose has upgraded to using the Bluetooth 5.1 standard. That’s a huge improvement from the SoundSport Free, which suffered from major connectivity issues. It’s also worth noting that the upgrade to Bluetooth 5.1 also means you get better range which, for us, was about 40 feet/12 meters.",
    "Not only is wireless charging available onboard, there’s also the possibility of fast charging. If you find that you’re running low on juice, a quick 15-minute charge will give you up to two extra hours of listening time.",
    "Bose says you’ll have access to the default voice assistant that’s available on your device. That, in theory, should allow Bixby to be brought up on Samsung phones, but for now it seems only Google Assistant and Siri are the only two on call. It should also, in theory, bring up Cortana if you’ve paired the ‘Buds to a Windows machine, but we weren’t able to test that option.",
    "Unlike the Bose 700 cans, you can only pair the QC ‘Buds to a single device at a time as Bose engineers haven’t been able to use the company’s multipoint technology here. That said, pairing and re-pairing to devices is remarkably quick and easy – easier than the Bose 700s, which had trouble in its initial setup with both our phone and MacBook Pro.",
    "Thanks to the excellent noise cancellation on these ‘Buds, you can truly enjoy your favorite tunes without being disturbed by anything else around you. Like the other QC-branded headphones, the ‘Buds also offer an excellent soundstage.",
    "Even at very high volume, every single layer within a track is clear – vocals are crisp and every instrument is given pride of place. For example, while listening to Mumford & Sons’ Delta, not only were the instruments layered wonderfully with the vocals, we could even hear the child’s voice in the background in a way that made them seem eerily present. If you’re a jazz or blues fan, then you’ll be able to enjoy every instrument without the horn section drowning out the melodies of the guitar.",
    "That’s the thing about the QC ‘Buds – listening to any genre of music feels like it’s playing around you, not directly into your ear. That makes it a pleasure to listen to.",
    "Admittedly, Bose’s audio is not quite as bass-heavy as Sony, but there is a great balance of frequencies here. Bose’s Active EQ tech boosts bass or treble automatically depending on volume levels, so music feels quite dynamic at any volume, with highs never sounding sharp or shrill and lows thrumming pleasantly. Sound is always well-balanced and enjoyable.",
    "If you aren’t a fan of the sound quality right out of the box, there’s unfortunately no equalizer to tweak the audio, which is a bit of an oversight in today’s audio industry.",
    "When it comes to phone calls, the Bose QC ‘Buds excel again. They offer arguably the best call quality of the true wireless headphones we’ve tested. Family members we called during our testing period told us voices sounded clear and were better than what they’d heard when we made similar calls with other ‘buds. With a four-mic array, is it any wonder? In fact, Bose claims that the mics on the right ‘bud focus on your voice, reducing ambient sounds, and this was confirmed by the people we called. While talking when out on a walk, seagull squawks were muted, machinery droning was softer and fan hums were completely eliminated.",
    "Like the Sony WF-1000XM3, the Bose QC ‘Buds offer up to six hours of listening time. That may not seem like much, but it should be noted that true wireless headphones that offer more don’t feature ANC.",
    "When we tested the Bose, with ANC set at maximum, we got about 5 hours 45 minutes – that’s including making a few calls, as well as calling up the voice assistant a few times, all through touch controls. It’s likely we could squeeze out over six hours if we had ANC set at, say 5.",
    "The case, however, is disappointing, with just 12 hours of extra battery life available, although it does have a quick charge feature which will see you get two hours of listening time with a 15-minute stint on the cradles. That’s less than what the Sony competition offers – up to 90 minutes of playback after a 10-minute quick charge.",
    "If the case is drained, USB-C charging ensures it’s topped up to 100% in about two hours.",
    "First reviewed October 2020"
  ],
  "headers": {
    "1": "Two-minute review",
    "11": "Price and availability",
    "13": "Design",
    "24": "Features",
    "32": "Audio performance",
    "38": "Battery life",
    "42": "Don't buy if..."
  },
  "links": {
    "Bose SoundSport Free": "https://www.techradar.com/reviews/bose-soundsport-free-true-wireless-earbuds",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "the best true wireless headphones": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Bose seems to be on the verge of releasing a new version of its Sport Earbuds": "https://www.techradar.com/news/new-bose-wireless-earbuds-leak-and-they-look-like-the-samsung-galaxy-buds-live",
    "Samsung Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "The Verge": "https://www.theverge.com/2020/12/3/22150405/bose-sport-open-earbuds-fcc-leak-photos",
    "FCC filing": "https://fccid.io/A94109R",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}