{
  "source": "https://www.techradar.com/reviews/ryver",
  "title": "Ryver review",
  "category": "computing",
  "updated": "2020-05-11T14:30:47Z",
  "author": "john-brandon",
  "summary": "A middle-of-the-road messaging app that emphasizes productivity",
  "verdict": "When it comes to team messaging apps, you could do a lot worse than Ryver. The interface is slightly clunky in how it separates discussions by both teams and channels, but it’s functional. Emphasizing productivity by making it easy to assign tasks (and view task lists with a click) means your team might actually get more done in the course of the day. The real debate, though, is about the price, since there isn’t a free version and the costs can be high.",
  "pros": [
    "Emphasizes productivity",
    "Simple to start using"
  ],
  "cons": [
    "Breaks team chats and channels into two streams",
    "No free version"
  ],
  "article": [
    "If checking off tasks on a list is the most important goal for your team, you might want to consider Ryver. A team messaging app that emphasizes productivity over all other features, this collaborative tool for teams of any size provides an easy way to not only assign tasks, but also for team members to review them with just a few clicks. Every task can be split into a team task or a personal task, which makes communication more about end results than endless discussions.",
    "Ask anyone what they hate about Slack and they will say it’s hard to keep up with the conversations. With Ryver, you might not be current on the convos, but you can likely still figure out what you’re supposed to do and when. The only real issue with this approach is that not every company is 100% focused on task completion. Even more important, you are likely already using project management or task management apps.",
    "Assuming you are attracted to the task management features, another hurdle to overcome with Ryver is that there isn’t a free version. That said, the Starter version is quite affordable. For $49 per month you can add up to 12 users, which might be just about right for a smaller company or team. The Starter version includes all of the task management features and provides unlimited messaging and unlimited storage. (Many team messaging apps force you to upgrade once you send a specific number of messages and run out of cloud storage.)",
    "If you need more users, the poorly named Unlimited version costs $99 per month (currently set at $79 per month) for an unlimited number of users. It’s poorly named only because there is also an Enterprise version for $199 per month (currently $149 per month) that adds premium support and a single-sign-on, so obviously the Unlimited version is somewhat limited.",
    "With Ryver, there’s the good, the bad, and the worse. The good news is that the interface is clean and open, using a dark blue color palette on a white background that’s easy on the eyes. Most of the admin functions and advanced features are easy to find but don’t create confusion or clutter in the main window. You'll find that the basic chat functions are intuitive and easy to locate.",
    "The main issue with Ryver is the way it organizes conversations. There are sections for Forums, Teams, and People. Forums are essentially the same as channels in Slack. The People section is for direct messaging. Teams is meant for conversations only for those who are part of a set team. This makes it possible to have a Forum to discuss marketing projects and a team for those who are in the Marketing department, for example, and hold completely different chats.",
    "This isn’t really how people discuss projects, though. If you are in Marketing, you would likely not discuss projects only with your given department. In fact, if you do, it might create division within the company. Most of us don’t just chat with those on our specific team. You can imagine a new user thinking -- was this conversation I’m supposed to join only meant for my department or was it open and public, involving people who don’t ever work here?",
    "The most troubling issue with Rvyer is that all of this conversation isn’t even the main point. The app is trying to combine Slack and Trello in one tool. If you really do use it to replace your task management app, chatting should be even easier and more straightforward. No team messaging app should have to start with a training session about why there are both forums and teams.",
    "Ryver is not as rich and deep in terms of features as Microsoft Teams or Mattermost, nor does it offer the same immediate accessibility and intuitiveness of Slack. Some of the competitors to Microsoft Teams and Slack, such as Glip and Flock, are a bit lost in the same middle ground. To compete, any competitor to Slack needs to be even easier to use. Otherwise, if the goal is to add extensive features, then good luck competing with Microsoft.",
    "That said, Ryver does provide all of the basics you’d expect. There’s a video and voice chat component, although it maxes out at five users. (By comparison, Microsoft Teams let you chat with a group of 10,000 people in a webinar format.) Integrations are readily available, so you can add Trello tasks and many other apps within the messaging channels.",
    "One interesting feature has to do with keeping track of news and social media. You can add a news stream by way of an RSS feed so users can see news updates. You can also add a social media stream so employees can keep track of company social media posts.",
    "The Enterprise version adds single-sign-on capability and premium support, although all versions of Ryver already include unlimited storage and messaging.",
    "Ryver can’t quite match the power or advanced features of Microsoft Teams, so the debate is whether you should start paying $49 per month for an app that doesn’t seem that much more extensive than apps that are free, like Slack. Because conversations are split into forums and teams, there could be some confusion about how to communicate, which means other apps like Glip or Flock might be better options if you just need to pump up your convos. Even Mattermost, which can be a bit unwieldy and expensive, offers more streamlining when it comes to clearly understanding how to chat within various teams.",
    "Ryver falls somewhere in the middle of the team messaging pack. On first glance, the interface is intuitive enough to start chatting with coworkers easily, but having both forums and teams split into two chat streams could lead to confusion. More than anything, the fact that you have to decide to start paying for Ryver after a 14-day trial period is the biggest hurdle. Other team messaging apps are free to use forever. If Ryver had more power, it would be worth paying a monthly fee. As it stands, there are several paid apps that are more appealing."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Interface and performance",
    "8": "Features",
    "12": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "Ryver": "https://ryver.com/",
    "Starter version": "https://ryver.com/pricing/",
    "Unlimited version": "https://ryver.com/pricing/",
    "Enterprise version": "https://ryver.com/pricing/",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Slack": "https://www.techradar.com/reviews/slack",
    "Glip": "https://www.techradar.com/reviews/ringcentral-glip",
    "Flock": "https://www.techradar.com/reviews/flock",
    "Mattermost": "https://www.techradar.com/reviews/mattermost"
  }
}