{
  "source": "https://www.techradar.com/reviews/zorrovpn",
  "title": "ZorroVPN review",
  "category": "computing",
  "updated": "2020-10-16T14:47:12Z",
  "author": "sead-fadilpasic",
  "summary": "An expert VPN with advanced privacy-focused mechanisms",
  "verdict": "ZorroVPN is an expensive, expert-level VPN provider that will get you top anonymity online, allow torrenting, as well as provide excellent speeds thanks to servers scattered all over the planet, all accompanied by dedicated customer support via TeamViewer that will guide you through every step of the setup process. However, it isn’t very easy to master and if you were hoping to unblock Netflix, BBC iPlayer, or Amazon Prime Video with a VPN, you should look elsewhere.",
  "pros": [
    "Advanced privacy protection mechanisms",
    "Excellent selection of server locations",
    "TeamViewer assistance"
  ],
  "cons": [
    "Expensive",
    "Doesn’t unblock Netflix, BBC iPlayer, Hulu, or Amazon Prime Video",
    "No website live chat"
  ],
  "article": [
    "A Virtual Private Network (VPN) is the buzzword these days as, due to various circumstances, more and more people turn to their desktop and mobile devices for work and entertainment. To learn which are today’s top services to help you stay anonymous online and access blocked content, check out our best VPN buyers guide.",
    "One of the VPNs that it catching our attention right now is ZorroVPN. It is a professional VPN service fully dedicated to providing its customers with the best possible privacy protection, to which end it deploys state-of-the-art advances in the security area.",
    "ZorroVPN has several subscription options according to their length. The 1-month period will cost you $15/month, while the 2-month subscription comes with a 17% discount - $25 paid every two months (or $12.5/month). As always, bigger discounts are available with longer options, so the 3-month costs an equivalent of $12/month (paid $36 every three months), and the 6-month period $11.33/month ($68 paid every six months). Finally, the longest subscription is the cheapest, at $120/year ($10/month).",
    "Although these prices may seem a bit high, ZorroVPN offers ways to reduce them. One is its affiliate program - if you recommend the service to your friends, you can get yourself an exclusive discount and earn 20% with each payment they make. Also, it often provides discount coupons for occasions like Black Friday or New Year.",
    "All the plans are covered by a 7-day money-back guarantee that states, “if you are not satisfied with our service or our service is not suitable for you”. This isn’t very long, considering some of the competitors will give you 45 days to change your mind. One account will allow you to connect up to five devices.",
    "That said, ZorroVPN is ahead of its competition in its support for a wide variety of payment methods, including credit cards (Visa and Mastercard), cryptocurrencies (Bitcoin, Litecoin, Dash, Zcash, Monero, and Ethereum), PayPal, PerfectMoney, QIWI Wallet, Yandex.Money, OKPay, Mint, Sofort, Web Money, W1, LiqPay, and Paymentwall. Do note, however, that when we tried paying with a credit card, we were automatically redirected to Mint website.",
    "ZorroVPN’s prices are quite high, so you might want to consider one of the cheaper, yet equally good alternatives.",
    "For instance, ExpressVPN’s annual plan at $8.32/month comes with a 30-day money-back guarantee and all the advanced features and extras that even the perfectionists will love. NordVPN also has a powerful anonymity platform and is even cheaper - at $3.49/month if you go for its 3-year subscription.",
    "Want something even less expensive? Why not opt for CyberGhost’s 3-year subscription at only $2.75/month (plus a 45-day refund guarantee) or Surfshark’s attractive pricing that will get you an excellent VPN solution for two years at the equivalent of $1.99/month and is fully refundable for the 30 days after the payment.",
    "It is also important to note that all four of these providers will let you stream Netflix and BBC iPlayer, which isn’t something ZorroVPN can boast with. On top of that, they are much easier to set up and use thanks to the user-friendly clients for all the major platforms, and then some.",
    "ZorroVPN provider supports streaming certain content thanks to servers located in many countries around the world. The media resources that you can access include FOX, Pandora, Hulu, ivi.ru, Yandex Music, and Spotify, although there’s no mention of the main players in the field - Netflix, BBC iPlayer, and Amazon Prime Video.",
    "We contacted the support to find out more and were told that ZorroVPN cannot guarantee access to these services.",
    "ZorroVPN is registered in Belize City, Belize and offers its users access to around 250 IP addresses and 80 servers in more than 40 countries including places like Kazakhstan, Hong Kong, Moldova, Russia, Vietnam, Israel, UAE, and South Africa. Users can suggest additional locations via the website.",
    "Every month, the company publishes a “warrant canary” in the form of a cryptographically signed message containing “a declaration that, up to that point, ZorroVPN has no direct or indirect knowledge of any backdoors, or potential backdoors,” and “headlines from a major new source demonstrating that the update could not have been created prior to that date”. This doesn’t carry the same weight as an independent audit that some of the competitors are implementing, but it’s a good start.",
    "ZorroVPN proudly displays its list of sophisticated features deployed to protect your privacy, some of which aren’t often seen in this business. They include the strong AES-256 encryption, 4096-RSA authentication keys, its own DNS, and port forwarding. It also enables forwarding all traffic from the VPN servers to Tor.",
    "As for the unusual features, these include the multiple VPN chains. Whereas some of the competitors feature only DoubleVPN (some don’t even offer that), ZorroVPN goes a step further and introduces TripleVPN and QuadroVPN, raising security and anonymity to a higher level. This basically means that encrypted traffic goes through the first server, then through the second, and so on, until it reaches the fourth server in a chain.",
    "You won’t have any trouble with torrenting and P2P sharing, as the provider openly states it provides “full access to the Internet, P2P, VoIP, and Torrent”, without any speed or traffic limitations.",
    "To connect to its VPN servers, users have at their disposal ports 443 and 53 over TCP and UDP. It also provides transparent access to .onion and .bit resources while connected to the VPN.",
    "ZorroVPN states it doesn’t collect any “logs of IP address, bandwidth, connections, DNS requests and etc”. That’s as much detail on the no-logs policy you’re going to get. We have no choice but to trust it, as so far there have been no outside confirmations of these claims.",
    "You can use ZorroVPN on a wide array of devices and operating systems, including Windows, Linux, Mac, iOS, Android, and routers. However, installing it won’t be easy, as ZorroVPN doesn’t have its own clients but instead operates via apps including OpenVPN GUI, OpenVPN Connect, Viscosity, Tunnelblick, or built-in device network/firewall managers (depending on the platform).",
    "The customer support is available via web form, email (support@zorrovpn.com) and IMs, as well as through remote assistance apps like TeamViewer through which it can assist you in setting up your VPN. That said, if you’re using email and web form, you should arm yourself with patience as the customer support is a bit slow in responding (it took us almost 17 hours to receive an email response to a common query but perhaps messages are sorted by priority).",
    "First and foremost, ZorroVPN isn’t intended for beginners. Once your payment goes through, you’ll receive access to your area on the ZorroVPN website. Here you’ll get all the information you need about installing the platform but it’s not as simple as with other providers that have their own clients for download. Instead, this VPN vendor requires that you first download and set up the OpenVPN or Viscosity application on your device (if you’re using Windows, other options are available for other platforms), for which it provides download links and detailed instructions.",
    "After installing OpenVPN GUI or Viscosity, you’ll have to download a configuration file for any VPN server you want to use (or all of them at the same time). Then, run the chosen app, import the specified server file, and connect via the icon from the tray. Our first attempt at connecting to either of the two Vienna servers via OpenVPN GUI failed (even though the network status on the website showed them as “OK”). Then we tried some of the more exotic locations like South Africa and Novosibirsk in Russia, but we failed again. The results weren’t any better for New York, Budapest, Prague, or Dusseldorf. We finally managed to connect to a server in Bulgaria. The download speeds were quite good - ranging from 17-25Mbps on our 50-60Mbps testing connection. However, the connection crashed after about 20 minutes and wouldn’t reconnect.",
    "We had way more luck using Viscosity to connect. Specifically, it immediately connected us to a server in Dubai, although the speeds were rather low - only 3.98Mbps, but perhaps it had something to do with it being too far away. We also managed to connect to the previously failed location in Cape Town, South Africa in a matter of seconds, and the speeds reached a solid 8.01Mbps, considering the distance. Sofia, Bulgaria delivered a very strong 19.28Mbps.",
    "ZorroVPN offers excellent performance and military-grade protection thanks to its advanced mechanisms, as well as providing remote assistance via TeamViewer, but it lacks in other important areas.",
    "For instance, its money-back guarantee is very short, there’s limited information available on its website, there’s no direct communication via live chat on the website, and you have to wait for quite a while to get an email response. Also, setting it up takes a bit of work as there are no native clients.",
    "Therefore, you should consider a provider such as ExpressVPN as an alternative since it outperforms ZorroVPN in these areas (and others) while costing less."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "10": "Streaming",
    "12": "About the company",
    "14": "Privacy and encryption",
    "19": "Support",
    "21": "Speed and experience",
    "24": "Verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ZorroVPN": "https://zorrovpn.com/?lang=en",
    "ExpressVPN’s": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost’s": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark’s": "https://www.techradar.com/reviews/surfshark",
    "“warrant canary”": "https://zorrovpn.com/canary.txt",
    "support@zorrovpn.com": "mailto:support@zorrovpn.com",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1431399487180592400"
  }
}