{
  "source": "https://www.techradar.com/reviews/lg-ultragear-38gn950",
  "title": "LG UltraGear 38GN950 review",
  "category": "computing",
  "updated": "2020-09-01T16:08:08Z",
  "author": "matt-hanson",
  "summary": "A killer ultra-wide gaming monitor",
  "verdict": "If you’re looking for the ultimate gaming monitor, the LG UltraGear 38GN950 is it. Combining a generous size, with super speed and fantastic image quality, this G-Sync-enabled ultra-wide screen is expensive – but it proves why the PC is the best platform to play on.",
  "pros": [
    "160Hz refresh rate",
    "Super-responsive",
    "Large screen",
    "Looks fantastic"
  ],
  "cons": [
    "Expensive",
    "May be a bit too large for some",
    "HDR can’t compete with high-end TVs"
  ],
  "article": [
    "The UltraGear 38GN950 is LG’s latest ultra-wide gaming monitor, and with a huge 38-inch screen, QHD+ (3840 x 1600) resolution, G-Sync support, 144Hz refresh rate and plenty of other features, one of the best gaming monitors you can buy right now.",
    "With the PS5 and Xbox Series X dropping soon, gaming at 4K is likely to become more popular than ever before. However, for PC gamers, there’s another alternative: ultra-wide 21:9 aspect ratios. For many (us included), the ultra-wide aspect ratio offers a more immersive experience than a 16:9 4K panel.",
    "And, while the 3840 x 1600 resolution of the UltraGear 38GN950 doesn’t quite match that of 4K (3840 x 2160), it’s not too far off – and this actually means you can get better gaming performance, especially with lower-end cards.",
    "That extra breathing room allows you to take better advantage of the 144Hz refresh rate, and implement demanding graphics options and settings, without sacrificing too much in the way of pure image quality.",
    "An ultra-wide monitor with a huge screen, packed full of gaming-specific features may sound right up your street, but it comes at a price. The UltraGear 38GN950 is a very expensive monitor: at £1,499 (around $2,000 / AU$2,700), it’s a huge investment. You could make some serious upgrades to your gaming PC with that sort of money.",
    "That means no matter how good the LG UltraGear 38GN950 is, it will simply be out of the question for many people. It also means LG has its work cut out to justify that high price tag.",
    "The good news is that for the most part, it does. This really is a very impressive gaming monitor. As you'd expect from LG, the design of the UltraGear 38GN950 is eye-catching, and similar to other UltraGear models. It comes with ‘virtually borderless’ bezels, which are very thin indeed. This is a big monitor, which is likely to dominate even the largest of desks, but those thin bezels ensure that it’s the actual screen that draws you in, rather than a cumbersome build. Those thin bezels also help to give the 38GN950 a modern look.",
    "On the rear of the UltraGear 38GN950 you’ll find a series of lights that can sync with music or visual effects. Known as Sphere Lighting 2.0, LG’s system is similar to the Ambilight feature on Philips TVs. It’s a welcome addition; we found it made using the LG UltraGear 38GN950 in the dark more comfortable, as light was thrown onto the wall behind the monitor.",
    "You can tweak the settings using the LG UltraGear Control Center software – although you’ll need to have the monitor plugged in to your PC via USB. This is advisable, since it also turns the UltraGear 38GN950 into a USB hub, allowing you to plug USB peripherals into the monitor.",
    "In terms of ports, the UltraGear 38GN950 comes with two USB (plus an upstream USB port for plugging into your PC), two HDMI, a DisplayPort and an audio jack, which are all easily accessible on the rear of the monitor – we found this a much more convenient location than on the bottom.",
    "Overall, this is an incredibly good-looking monitor – before you’ve even turned it on. When in action, though, the LG UltraGear 38GN950 impresses further.",
    "Its 3840 x 1600 resolution is high for an ultra-wide unit, and alongside the 21:9 aspect ratio and 38-inch screen size, it delivers generous space in which to work. For day-to-day use in Windows 10, you’re able to have multiple windows and apps open at once, and the subtle curve of the screen results in less strain when looking towards its edges.",
    "Of course, productivity is unlikely to be your main reason for investing in the LG UltraGear 38GN950 – it is a gaming monitor, after all. And in that regard, it doesn’t disappoint. That 21:9 ultra-wide aspect ratio certainly delivers the ‘wow’ factor. It makes games feel more cinematic, and by spanning almost the entire field of view of a player, you’ll enjoy super-immersive experiences – as well as a tactical advantage.",
    "One game that benefited greatly from the UltraGear 38GN950’s aspect ratio was the fantastic Microsoft Flight Simulator. The 21:9 ratio allowed us to see more of the cockpit, as well as some of the window on the left-hand side. Not only did this increase realism – something simulator games strive to achieve – but it also had a practical use. It allowed us to keep an eye on landmarks and runways from the window without having to press a button to switch views, making it easier to fly.",
    "The LG UltraGear 38GN950 has a few more tricks up its sleeves to ensure it excels for gaming. A 1ms response time, G-Sync and AMD FreeSync Premium Pro compatibility, and a fast refresh rate of 144Hz – which can be easily overclocked to 160Hz – all elevate this monitor above others in this category.",
    "Collectively, these features are – forgive the pun – a gamechanger, and have a huge impact when gaming, especially when playing frantic, fast-paced titles. Doom Eternal is the perfect example. Playing at 144Hz and 160Hz results in an engrossing and enjoyable experience, as you rip and tear your way through hordes of demons with silky-smooth action, without a hint of screen tearing. It’s seriously impressive, and will make it difficult to revert to 60Hz monitors.",
    "A monitor’s image quality is of utmost importance, and once again, the LG UltraGear 38GN950 does a fantastic job. As mentioned earlier, this isn’t really a monitor you’d buy solely for work purposes; but with DCI-P3 98% color gamut support, it’s a good option for photographers and video editors, for whom accurate color reproduction is vital.",
    "The UltraGear 38GN950 comes with a nano IPS panel, whose nanometer-sized pixels deliver colors with great intensity, according to Samsung. This was certainly true in Doom Eternal, which looks splendid on the monitor – but then so too does Microsoft Flight Simulator’s more realistic palette.",
    "The UltraGear 38GN950 is also HDR-enabled; however, it’s just the mid-range DisplayHDR 600. While this is a better implementation than DisplayHDR400 and DisplayHDR500, for example, it’s still a middling version of HDR, with a peak brightness of only 600 nits. It’s the one area of the UltraGear 38GN950 that doesn’t quite feel premium. It will still display a decent HDR image, but it can’t compare to OLEDs in particular.",
    "Overall, though, the LG UltraGear 38GN950 is a phenomenal gaming monitor, delivering an excellent combination of speed, responsiveness, an immersive aspect ratio and great image quality. It’s expensive, but if you’ve built a killer gaming rig and want a monitor to match, you may find this a worthy investment."
  ],
  "headers": {
    "20": "Don't buy it if..."
  },
  "links": {
    "best gaming monitors": "https://www.techradar.com/news/best-gaming-monitor",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}