{
  "source": "https://www.techradar.com/reviews/creative-t100",
  "title": "Creative T100 review",
  "category": "computing",
  "updated": "2020-10-07T14:02:45Z",
  "author": "matt-hanson",
  "summary": "Ideal for smaller desks",
  "verdict": "The Creative T100 computer speakers are a 2.0 set that is perfect for people who don't have the space for larger 2.1 or 5.1 speaker setups. It offers very good sound quality for the price.",
  "pros": [
    "Compact design",
    "Easy setup",
    "Good sound quality",
    "Bluetooth 5.0"
  ],
  "cons": [
    "Won't blow you away",
    "Limited ports"
  ],
  "article": [
    "If you’ve got limited space on your desk, but you still want speakers that deliver punchy sounds, then the Creative T100 set could be ideal.",
    "They are a pair of 2.0 speakers – which means you get a left speaker and a right speaker… and nothing else. No extra speakers for surround sound, and no sub woofer for floor-shaking bass. While that means that people looking for immersive cinema-like audio should look elsewhere, this pared-down setup will be very appealing to many people where space is at a premium.",
    "It also means at $99/£99 (around AU$180) it’s one of the more affordable PC speakers on the market. It’s over half the price of audiophile-grade 2.0 setups like the Audioengine A2+ (which currently sits at the top of our best computer speakers list), and is much cheaper than Logitech’s (perhaps Creative’s biggest competitor) 2.1 offerings like the Logitech Z625 and Logitech G560.",
    "Of course, there are much cheaper 2.0 speakers out there as well, but what Creative is attempting to do with the T100 is offer superior sound quality despite the lower price and limited tech.",
    "The Creative T100 is made up of two compact speakers which measure 208 x 93 x 130 mm (8.2 x 3.7 x 5.1 inches) each. This allows them to sit unobtrusively on almost any desk, and they are connected by a lengthy cable which offers a decent amount of flexibility with how far apart you place the speakers.",
    "On the top of the right-hand speaker are four buttons – a power button, volume controls and source switcher. A small remote is also included for these functions, which is nice, but no batteries come with it, so you need to buy your own.",
    "The source you select, and whether the speaker is on or in standby, is indicated via a colored LED light behind the speaker grille of the right-hand unit. Remembering which color refers to which source may take a little getting used to, but it’s simple and does the job – which appears to be the T100’s raison d'etre.",
    "Around the back of the right-hand speaker, is an AUX-in for connecting devices via a 3.5mm audio cable, an optical-in port and a USB port. There is also port for plugging in power – unlike some budget 2.0 speakers, the Creative T100 requires external power. This means it’s not an ideal portable laptop speaker set, as you’ll always need to have a power socket nearby – but that’s the price you pay for better audio quality – which we’ll get to in a moment. There’s also a port for connecting the left-hand speaker.",
    "Creative has definitely kept things simple here. One thing to note is that the USB port isn’t for connecting to your PC – it’s for inserting a USB flash drive to play songs, and the T100 supports FLAC, WAV and MP3 files. It’s a bit of an archaic addition, to be honest, with most people content with streaming services like Spotify these days.",
    "This means you connect your PC to the T100 via either AUX or optical (the latter is what we used). Speaking of the optical connection, while this used to be one of the best methods of transmitting digital audio, it’s been superseded in many ways by HDMI, which can handle audio formats like Dolby TrueHD. Many in the audio world are therefore moving away from optical – both the upcoming PS5 and Xbox Series X don’t include the ports, which could make this port one day obsolete.",
    "However that isn’t too much of a concern for most PC users, as these days almost all motherboards come with an optical out for audio – though most laptops don’t.",
    "One connection that certainly is forward-thinking, however, is the Bluetooth 5.0 wireless connection. This allows you to connect wireless devices, like smartphones, to the T100 using the latest Bluetooth tech – which offers greater range and audio quality. You can also connect two devices at once.",
    "While the Creative T100 does a good job of keeping the design and features simple, what really matters is sound quality, and here the speakers do an excellent job. With a peak power of 80W and a built-in digital amplifier, these speakers can get nice and loud without distorting the audio. There’s also a 2.75-inch full-range driver in each of the speakers, and for high-end sounds and vocals, the T100 offers excellent quality.",
    "As you’d expect from a 2.0 setup without a subwoofer, bass isn’t quite as impactful, but with the BasXPort tech that Creative claims to help boost bass and low frequencies, the T100 avoids sounding tinny or weak. It's an impressively full sound, and while the T100 won't blow away people who demand the very finest audio quality, that's not who these are aimed at. Instead, it offers very good audio quality via two speakers, and means if you need to have a 2.0 setup either because of space or budget concerns, you won't feel like you're having to make do with sub-par sound quality.",
    "The Creative T100 is an excellent set of speakers for people who want a simple design that will easily fit on a desk with the minimum of fuss, while also providing very good sound quality."
  ],
  "headers": {
    "0": "Two-minute review",
    "15": "Don't buy it if..."
  },
  "links": {
    "best computer speakers": "https://www.techradar.com/news/best-computer-speakers"
  }
}