{
  "source": "https://www.techradar.com/reviews/chrome-remote-desktop-review",
  "title": "Chrome Remote Desktop review",
  "category": "computing",
  "updated": "2020-03-27T15:13:08Z",
  "author": "alex-mcomie",
  "summary": "Check out our Chrome Remote Desktop review to learn more the program can do for businesses and IT departments",
  "verdict": "Chrome Remote Desktop is easy to set up, but it’s also limited to relatively basic features. Paid solutions offer better functionality for some business contexts.",
  "pros": [
    "Completely free",
    "Available on Windows, Mac, Linux, iOS, and Android"
  ],
  "cons": [
    "No remote printing, file transfer, or chat",
    "Requires Chrome on all hosting devices"
  ],
  "article": [
    "Remote desktop access can be extremely helpful for a variety of businesses, and Chrome Remote Desktop is one of the most popular applications out there. That said, due to its limitations, it’s better suited for personal than business use. Nonetheless, it’s worth considering if you’re looking for the best remote desktop software that’s free.",
    "In our Chrome Remote Desktop review, we take a close look at the program’s features and compare it to the competition. While a few paid options provide some additional features, Chrome’s convenience and accessibility probably make it the best free tool for remote desktop access.",
    "Chrome Remote Desktop is entirely free to use, and there aren’t any perks, subscriptions, or other types of premium content. You’ll simply be asked to sign into your Google account to set up remote desktop access.",
    "The program is available as a Chrome extension, so it can be used on any computer that supports Chrome. You can pair the target computer with another computer or with a mobile device running iOS or Android.",
    "Chrome Remote Desktop provides several helpful features that streamline the experience and enable cross-device functionality. While using a desktop from another location can introduce some logistical problems, Chrome Remote Desktop makes it easy to avoid most common issues.",
    "For example, if you’re using a mobile device, you can switch to keyboard or trackpad mode through the menu button on the lower-left corner. The app also includes dedicated menu options for Ctrl-Alt-Del and Print Screen.",
    "We tested Chrome Remote Desktop by accessing a 2015 iMac through an iPhone SE. Unfortunately, the app was missing critical keys like Command, Control, and Option, so many important keyboard shortcuts were simply unavailable.",
    "On the other hand, you should be able to use your computer remotely without any issues on another desktop or laptop. You can reconfigure key mappings as long as both devices have a physical keyboard. That said, Chrome Remote Desktop doesn’t let you transfer files between devices.",
    "There’s also an option for Remote Support, which gives remote users a one-time code to access a desktop in order to troubleshoot any issues. This enables IT professionals to quickly fix problems without being physically present or receiving ongoing access",
    "To set up Chrome Remote Desktop, start by downloading the browser extension on the computer you want to access. You can find the extension in the Chrome Web Store. After installation, you’ll be able to use remote desktop features through a button in the top-right corner (next to the favorites icon).",
    "Once the extension is installed, you’ll only have to enter the name of the desktop along with a PIN to start accessing the computer remotely. Keep in mind that you may need to adjust permissions to give access to remote devices.",
    "Of course, you should install Chrome Remote Desktop on any devices you want to use to access your desktop. You’ll be able to view all remote devices from the desktop or mobile app as long as every device is signed into the same account.",
    "Chrome Remote Desktop is highly responsive, with only a small delay as long as you’re using a strong internet connection. In our tests, the remote device was consistently within one-quarter of a second of the original display. The entire experience is extremely smooth, and videos look nearly identical on both screens.",
    "The program itself has a minimalist feel, with just a few functions and menus. In the desktop app, for example, the only options are to edit your computer’s name and PIN, connect to remote support, and ask for help. Since it runs on Google Chrome, you won’t be able to use it through any other browser.",
    "Chrome Remote Desktop requires a PIN every time you try to access a device remotely. You can set and change PINs for each individual device. PINs have to be at least six characters long, but they only need to contain numbers.",
    "For Remote Support, the app provides a one-time access code which expires after the first connection. Users are asked to confirm that they still want to share their screen once every 30 minutes.",
    "To access the Help Center, just click “Help” in the desktop or mobile app. This page offers a simple guide for setting up remote access, sharing your computer, or removing the application.",
    "If you’re still having trouble, you can also search the Help Community for similar issues or post your own question. While there’s an option to send feedback about the Help Center itself, there’s no way to contact Google directly for one-on-one support. Fortunately, most community posts get at least a few helpful replies.",
    "Chrome Remote Desktop offers excellent performance and accessibility, and it works well for accessing a remote desktop on Mac, Windows, and Linux. While the mobile app doesn’t provide quite the same functionality, it’s still a decent way to access a desktop remotely. The Remote Support tool perfectly adapts Chrome Remote Desktop for support contexts.",
    "On the other hand, the lack of features such as drag-and-drop file transfers, remote printing, and live chat between devices makes the application substantially less efficient in some use cases. Furthermore, you won’t be able to access live support if you run into any issues. Overall, Chrome Remote Desktop is a simple and straightforward option, but it’s missing several features that are critical in a variety of business contexts.",
    "The main advantage of Chrome Remote Desktop over comparable alternatives is its free cost and convenience. You can share your desktop in a few seconds through Chrome and access it on a wide range of devices using your existing Google account. That said, it’s missing a few key features that are available with paid solutions.",
    "RemotePC, for example, offers plans for businesses at $187 and $374 per year. It allows drag-and-drop file transfers between host and client computers, and users can print documents stored on the remote desktop without transferring them to the computer they’re physically using. Like many other paid solutions, RemotePC also provides 24/7 support to help troubleshoot the application and resolve any issues.",
    "To find our more about Chrome Remote Desktop's competition, read our Best remote desktop software guide."
  ],
  "headers": {
    "2": "Chrome Remote Desktop: Plans and pricing",
    "4": "Chrome Remote Desktop: Features and utilities",
    "9": "Chrome Remote Desktop: Setup",
    "12": "Chrome Remote Desktop: Interface and performance",
    "14": "Chrome Remote Desktop: Security",
    "16": "Chrome Remote Desktop: Support",
    "18": "Chrome Remote Desktop: Final verdict",
    "20": "Chrome Remote Desktop: The competition"
  },
  "links": {
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}