{
  "source": "https://www.techradar.com/reviews/wau-x",
  "title": "WAU Bike review",
  "category": "fitness",
  "updated": "2020-09-29T14:04:07Z",
  "author": "amy-bonifas",
  "summary": "The WAU Bike is a smooth-running e-bike with incredible range",
  "verdict": "An exciting e-bike with one of the longest potential ranges out there (215 miles). The integrated lights include bright brake lights and indicators, while the anti-tamper alarm and GPS tracking app (though still in beta development), offer sophisticated security features. It’s all topped off with a handy throttle, making this one of the most neatly packaged e-bikes set to push the industry forward.",
  "pros": [
    "Innovative integrated lights",
    "Smart security features",
    "Impressive potential range"
  ],
  "cons": [
    "One-size fits all (smaller or larger riders may struggle)",
    "Uncomfortable standard saddle",
    "Only rear indicator lights"
  ],
  "article": [
    "The WAU Bike is all about the tech. A smart display empowers you with all the info you’ll need during your ride – from current range, speed and motor output to arising servicing updates. The unique smart lights include rear red running lights, clear amber indicators and bright red brake lights. These help you stand out on the road and look epic at night. Plus, the security features – from an alarm system to GPS tracking – make this bike pretty tough to steal (and get away with it).",
    "Then there’s the power. This electric bike is good for taking off in traffic. There are eight gears operated by a Shimano S-HG41-8 derailleur, five pedal assist modes depending on how much extra oomph you want, and the acceleration throttle on the handle bar can zip you away smoothly up to 15-20mph when the roads are clearer.",
    "The range is down to the removable Samsung battery – 378W for the 40-mile and 886W for the 100-mile range. For avid riders worried about running out of juice, WAU throws in a rear power pack to give 1980W and up to 215 miles of range.",
    "With a sleek design and black aluminium frame, the bike has an understated look – until your rear amber indicators start to blink that is! The lightweight frame with front fork suspension and 29-inch road tyres, mean the bike alone weighs 21kg; 22.8kg with the 40-mile battery and 25.3kg with the 100-mile one.",
    "The standard 40-mile range bike starts at £1,677 (about $2,200 / AU$3,020). Add accessories and upgrades via the online WAU shop, including a full-colour display (£129.95 – about $170 / AU$240) and a specialized bike rack (£89.95 – about $120 / AU$160). The order process is speedy, as WAU usually ship in under 48 hours to the UK. It’s also easy to get started and maintain, as a lot of the tech is contained and the saddle can be simply adjusted.",
    "The bike is a potential game-changer in this Covid world. It’s a solid city rider with more than enough power for your commute. It’s also handy for mini adventures as the range and smooth pedal assist make it a great way to see more of your local area, without getting too puffed.",
    "WAU is a UK start-up, and through this e-bike is currently built in Hong Kong, there are plans to move the manufacturing line to Nottingham.",
    "The price of the WAU Bike depends on the range you want. The initial 40-mile range starts at £1,677 (about $2,200 / AU$3,020). If you’re looking for a commuter e-bike, then we’d suggest the 100-mile range model at £1,997 (about ($2,600 / AU$3,600), which should be enough for most riders.",
    "For colossal range, the 215-miler at £2,981 (about $3,800 / AU$5,400) includes an additional rear battery.",
    "We rode the 2020 flagship WAU Bike, and the stand-out design feature is the two red strip LED lights on the back. A switch on the handlebars allows you to effortlessly indicate left or right, and when you brake, these light up brighter, which is perfect for evening rides. The one we reviewed didn’t come with an integrated front light, however all bikes now come with a standalone rechargeable front light and in the future, WAU will add an integrated one.",
    "The aluminium frame and classic commuter bike profile make it sleek and light-weight. As a smaller rider I found it relatively easy to lift and manoeuvre. The battery is encased in a tamper-proof ABS hard shell casing, etched with a running logo light. It’s removable, making it easy to charge wherever, whenever – you just need to unlock the casing with the bike key. Using the smart charger, you can fully charge the 40-mile range from flat in three hours, and the 100-mile takes only 4.5 hours.",
    "WAU has ensured the maintenance of the bike is low-key. The 29-inch Vee City Cruz tyres have an anti-puncture feature. All parts such as the hydraulic brakes, gearing, suspension, tyres and bearings are easily and quickly serviced nationwide, and spare parts are readily available.",
    "One of the bike’s weaker points is the standard sport saddle. This was uncomfortable after a day of commuting, so invest in the padded saddle with dual suspension springs.",
    "The WAU team handed the bike over with what looked like a set of car keys, consisting of two keys and an alarm fob. It would have been more slick to incorporate this into one with an alarm button, but it does make this e-bike feel full of tech.",
    "To start your ride, simply unlock the bike and turn on the power switch on the bike display. Just watch your hand on the throttle when stationary! Arriving at your destination, you can activate the anti-tamper alarm. The alarm is set with a reassuringly loud chirp when you lock the bike with the key.",
    "Handily, the computer, battery and GPS are all enclosed in an impenetrable hardened plastic enclosure that fits within the bike frame.",
    "WAU still recommends locking the bike to a secure bike rack with a highly rated D-lock, so the bike can’t be picked up and put in a van by any organised thieves. You can track its location with in-built 24/7 GPS and there’s a geo-fence function, enabling you to set your own virtual parameter, triggering an alert to your phone if your bike leaves that boundary, so you can take action quickly.",
    "The bike’s power is delivered by a 250w rear hub motor, which is smooth in the pick up and fairly responsive on the throttle after a couple of pedals. The motor ensures all power goes to turning the rear wheel, without putting strain on your chain or crankset, like mid motors can do.",
    "The acceleration is comfortable – there’s no jolt when the motor kicks in, helping you safely navigate traffic and pedestrians, and the bike comes equipped with Shimano hydraulic brakes.",
    "A slightly more responsive throttle would help when track-standing at traffic lights, but other than that, it’s clear that the WAU Bike was built for the commute, reaching up to 20mph with minimal pedal effort and we only needed to charge every couple of days.",
    "The bike is equipped with five power pedal-assist modes, controlled via the handlebars. We found that the fourth setting was the optimum level for maximum speed, minimum effort and it allowed us to switch to PAS 5 when on an incline.",
    "There’s also an eight-speed cassette on the rear, which provides just the right amount of adjustment to prevent your legs free spinning when travelling at speed.",
    "You can adjust the suspension as you ride. This is thanks to the lockout via the front fork suspension (SR Suntour SF18-NEX-E25), enabling you to turn it off when riding on smooth roads or uphill to improve the bike’s efficiency. You can then turn the suspension back on when going off-track for a smoother ride. Having said that, cycling through south London’s numerous potholes was still a bit stiff on the rear.",
    "The tires are durable classic road tyres but for me felt a little narrow. You might want something chunkier if you’re new to bike commuting or looking for a bit more road presence – like the feisty Rayvolt Torino. Despite that, the ingenious mechanical and electronic design makes the WAU X one of the smoothest and enjoyable e-bikes to ride right now.",
    "First reviewed September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and release date",
    "9": "Design",
    "13": "Performance",
    "25": "Don't buy it if"
  },
  "links": {
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "WAU shop": "https://www.waubike.com/accessories",
    "padded saddle": "https://www.waubike.com/accessories/bike-seat",
    "Rayvolt Torino": "https://www.techradar.com/reviews/rayvolt-torino"
  }
}