{
  "source": "https://www.techradar.com/reviews/unblock-us",
  "title": "Unblock-Us review",
  "category": "computing",
  "updated": "2020-10-28T17:42:46Z",
  "author": "sead-fadilpasic",
  "summary": "Proxy service with some extras",
  "verdict": "Unblock-Us is a good choice if you only need a proxy service. It doesn’t have any native apps but successfully unblocks almost any censored or geographically restricted content with no speed losses.",
  "pros": [
    "Free trial",
    "Top speeds",
    "Unblocks Netflix",
    "30-day money-back guarantee"
  ],
  "cons": [
    "Not a full VPN",
    "No native apps",
    "Only accepts credit card payments"
  ],
  "article": [
    "Unblock-US is not a typical VPN service. Instead, it routes your DNS queries through its servers, changing your location based on the sites you visit. This allows you to access any type of blocked content, without any buffering or throttling.",
    "If such a platform won’t work for you and you’re looking for a full VPN with all its advantages, then we strongly advise you to consider one of the best VPN solutions.",
    "There are two subscription plans on the table: monthly and annual. The former will set you back by $4.99/month, while the annual includes a $10 discount and costs $49.90/year (equal to $4.16/month).",
    "This is a bit expensive considering we are not talking about a full VPN service here - and Unblock-Us can only be connected on one device at a time.",
    "If you don’t think Unblock-Us is the right choice for you, the provider offers a one-week free trial, no credit card required. Full refunds are also issued to users who cancel their annual subscription within the first thirty days after the purchase.",
    "A full VPN service can provide all the features Unblock-Us doesn’t, especially a top-of-the-range offering like ExpressVPN, NordVPN, CyberGhost or Surfshark.",
    "Unblock-Us can provide access to the likes of Netflix, Hulu, BBC iPlayer, Amazon Prime Video, and other streaming services that might be unavailable in certain regions due to geographical restrictions.",
    "Unblock-Us is owned by the company NetProtect Ltd, headquartered in Nicosia, Cyprus. It operates with the help of 100 servers in 17 countries.",
    "To provide you with access to all sorts of content on the internet privately, Unblock-Us uses its SmartVPN. Unlike its SmartDNS technology, where it deploys a proxy to conceal the source of your IP address to the domains that request it, SmartVPN adds a layer of security to your connection.",
    "However, it doesn’t encrypt user data, but “simply seals the contents of your data for transport so that the information within cannot be tampered with. That means no more snooping on your DNS traffic by your cellular carrier, and no more spying on behalf of Google”.",
    "We were surprised to see that the provider’s website didn’t have an HTTPS certificate and it asked us to disable our ad-blocker, which isn’t very encouraging in terms of security. That said, at least its sign-up page, where you leave your personal information, is secure and protected by Trustwave’s Trusted Commerce program.",
    "The company claims in its Privacy Policy that it doesn’t collect or log any traffic or use of its services, nor does it store “any of your data that passes through our servers, and we never manipulate the content you access.” It adds that it doesn’t “provide information that we do have unless we are legally required to”.",
    "In other words, some data does seem to be collected and if an authority asks it to hand over any information about you, it will comply. But since Unblock-Us states it doesn’t collect any traffic data, sensitive information about your online activities should be safe.",
    "Unfortunately, we have no choice but to trust its word, because an external expert has not yet been brought in to verify the service's no-logging claims.",
    "Unblock-Us can be configured on all major computers and mobile devices, as well as various other devices, including Apple TV, PlayStation 4, Xbox One, Wii, Amazon Fire TV, routers, and so on.",
    "However, there are no native apps for its SmartVPN service, so you’ll have to make do with third-party software like OpenVPN or Tunnelblick, which can be a bit confusing for a beginner.",
    "Setup guides are available on the website and they’re very detailed. Besides the setup walkthroughs, Unblock-Us’ website also includes a support center with useful articles on various topics, such as billing, sites and channels, announcements, etc. If the website can’t help with your problem, then you can contact human customer support via web form or phone.",
    "We tested the download speeds of the provider’s service and were quite pleased. Since Unblock-Us doesn’t route your traffic through any servers but just assigns you a new IP address, this means there were no losses in download or upload speeds during our testing. However, picking a server manually is impossible as the provider chooses the server closest to you automatically.",
    "Unfortunately, there are no native clients so if you’re not used to such a system, you might feel overwhelmed and if you run into any problems, reading the log files might be overly complicated and confusing. Also, some may not be comfortable with tampering with their adapter options, which Unblock-US’s DNS service requires.",
    "Unblock-Us has some strong unblocking capabilities, but that’s as far as it goes. It’s not a full VPN platform, so you shouldn’t expect any fancy privacy features and options, thousands of servers, nor full identity protection, as you would with the industry’s greatest performers such as ExpressVPN.",
    "It’s great that Unblock-Us offers a free trial and 30-day money-back guarantee but the lack of native apps makes it less appealing to beginners."
  ],
  "headers": {
    "2": "Price",
    "5": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "14": "Support",
    "17": "Speed and experience",
    "19": "Verdict"
  },
  "links": {
    "Unblock-US": "http://www.unblock-us.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Privacy Policy": "http://www.unblock-us.com/privacy-policy/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-4085625088125151000"
  }
}