{
  "source": "https://www.techradar.com/reviews/creative-sound-blaster-x3",
  "title": "Creative Sound Blaster X3 review",
  "category": "audio-visual",
  "updated": "2020-01-16T19:48:19Z",
  "author": "ted-kritsonis",
  "summary": "The Creative Sound Blaster X3 tries to tackle multiple audio concerns at the same time",
  "verdict": "Creative delivers a bevy of different sound options worth listening to with its latest external sound card that's worth it if you're tired of bad-sounding computer speakers.",
  "pros": [
    "Works with PC, Mac and consoles",
    "Great sound quality and Super X-FI",
    "Lots of configuration options"
  ],
  "cons": [
    "Not especially portable",
    "Won’t work with Xbox One",
    "Super X-Fi needs custom settings"
  ],
  "article": [
    "Chances are, your Windows PC or Mac speakers come with middling, if not terrible audio quality. Or maybe they’re decent, but not quite good enough to truly enjoy what the music or games you spend time listening to.",
    "Cue the Creative Sound Blaster X3, a USB DAC (digital-to-analog converter) with a headphone amplifier that can produce virtual 7.1 surround sound, and offers a variety of ways to enhance the audio coming out of your computer or game console.",
    "It's like an external sound card that's compatible with PS4, PC and Mac and has the added bonus of harboring SXFI, Creative's audio technology that simulates 3D sound in a pair of stereo headphones.",
    "It's a solid audio upgrade - but is it worth $119 (£109, AU$179)? Yes and no.",
    "The Creative Sound Blaster X3 came out in 2019 at $119 (£109, AU$179) - right around the cost of an internal sound card, but with the added bonus of being compatible with most major game consoles.",
    "Creative found a way to keep things simple, yet provide different avenues to pursue all at once. The primary input is the large knob in the middle that controls a couple of different things, depending on setup. The three buttons laid out in front of it mute the microphone, change audio modes and toggle Super X-Fi on or off.",
    "On the rear, there are no less than seven ports. USB-C is the power port, whereas the rest are all about audio variety. The Toslink optical output is there if you want to set up your TV or game console that way. A 3.5mm line-in port is perhaps the easiest and most common of them all. Then you have four line-outs for sound systems.",
    "There is no power brick in the box, so the idea is for the connected device to power the X3. Plug it into a computer or console and it will draw power from there. It does work with power adapters plugged into the wall, though sound would have to then come in from the line-in port.",
    "On the front are separate microphone and headphone jacks, which can work independently, or together, if you’ve plugged in a gaming headset that uses both plugs.",
    "The crowning feature above all these is Creative’s own Super X-Fi audio holography, the company’s impressive virtual surround sound technology.",
    "We didn’t find the Sound Blaster X3 difficult to set up, though we should also note that there are several different configurations and settings to note. You also need Creative’s Sound Blaster Command app on iOS or Android to help facilitate some of the features, especially Super X-Fi. For example, if you’ve never used Super X-Fi before, you would need to download that app to map your face and ears and create a personalized audio profile. If you already have a profile, it’s easy to link it to the Sound Blaster Command app, which then applies it to the X3.",
    "There’s also a Sound Blaster Command desktop program to manage the PC or Mac connection. The key there is that the X3 has to be plugged into the computer. Not a big deal if you have spare ports, but a nuisance if you have limited ports, like on any recent MacBook you can think of. Creative packs in more settings and features in the desktop app compared to the mobile app, but much of what you really need is in both.",
    "When first testing out the X3, we plugged it into a PS4 through one of the USB ports, where the console recognized it as a discrete USB headset. That meant we could plug in whatever wired headphones we wanted into the X3’s headphone jack and listen to the action of whatever game we played.",
    "There were caveats, though. While we could run through the different EQ modes and run Super X-Fi anytime on a console, the 5.1 and 7.1 surround modes weren’t available. In the app, we tapped on the sound experience slide-down menu, and found we could select from over 30 presets. Some of them were specific to popular games, like Fortnite, Call of Duty, Counter-Strike, Overwatch and Arena of Valor, while others were general to types of games or musical genres.",
    "The EQ is customizable, so if you’ve finagled your own masterpiece, you can save it and use it as a default every time you turn on the X3. We tried it and found a couple of custom presets we liked using for games and movies. The desktop app takes it further with more intricate ways to dial some audio elements up or down.",
    "We also found that we could save multiple Super X-Fi profiles to the device, meaning that family members could switch to their own, assuming they recognize the date they set up their account. There is no way to name a profile, otherwise.",
    "From an audio perspective, the X3 can handle up to 32-bit at 192KHz, putting it above just about any pair of headphones you probably own (audiophile gear, notwithstanding). The amplifier inside is a nod to more discerning audio listeners, where Creative says the DAC and Super X-Fi are able to push out great sound to them.",
    "We like Super X-Fi for the simple reason that it makes audio sound like nothing else does. Everything resonates and the wider soundstage is easy to appreciate. Sure, there is extra reverb that does sometimes make a studio track sound like it’s live, but we dig it anyway. Mind you, that’s not necessarily Creative’s intention. They want to emulate what a room sounds like, not a concert hall, and in that regard, we would say that results are entirely subjective.",
    "The headphone profiles are slowly growing, but at least popular ones from Apple, Beats, Sennheiser, Bose, AKG and Sony are in there. We’d love to see way more, but at least it’s not a barren list. We tried at least eight different headphones, from over-ears to in-ears, to gauge how consistent the X3 could be under varying conditions.",
    "The one thing we’d like to see is that Creative open up Super X-Fi to more personalized preferences, or at least custom presets. If the effect is already mapped to the user, then it shouldn’t be a tall ask to be able to adjust certain details, rather than just a basic EQ. It’s hard to lower the reverb effect, for example, which we think may not suit everyone for music, specifically.",
    "For movies or shows, we didn’t have a full home theater receiver and 5.1-channel setup to test out the surround sound quality in a room. What we do know is that the X3 only does 5.1 with Dolby Digital Live. There’s no Dolby Atmos 7.1, nor DTS support. Fortunately, 5.1 surround is common, and so, we tried it with the limited setup we had while watching Season 4 of The Man in the High Castle, and came away feeling like we were clearly missing the full gamut.",
    "We noticed some nuances when comparing music playback with gaming. For reasons we’re unaware of, the music preset dials back treble significantly. We get trying to limit sibilance, but the effect was overzealous, so we raised it closer to the neutral point in the EQ and found a nice balance with some increased bass.",
    "We didn’t do that with gaming, though. We tried various presets, like the Footsteps Enhancer when playing Wolfenstein: Youngblood, and the Call of Duty one while shooting our way through the latest Modern Warfare title, and liked the results.",
    "On a PC, the 7.1 virtual surround delivers as advertised. When we were being ambushed or shot at from behind, the sound made it feel like that’s exactly where it was coming from. It’s the kind of startling sound effect we crave when playing in a tight situation. We never got to try it, but atmospheric games, like The Last of Us or Alien: Isolation, would really come alive with Super X-Fi and 7.1 surround capturing all the soft and distant sounds.",
    "If only we could experience the same thing on a console. Not that it was bad — we really liked the Super X-Fi effect on PS4 games — just that it would’ve been different with that as an option.",
    "Gamers who like recording voiceovers while playing can easily do that with the X3 by using the microphone jack. We did some tests and came away surprised with the resulting clarity. We’re not entirely sure how low you can go on mic quality, but if you have something decent, you should be able to get something good enough to post online.",
    "The Sound Blaster X3 is an external sound card built to work in stationary situations, where you’ve parked yourself in front of a computer, console or TV, and wanted to capture the essence of the content tuned to your own ears. As subjective as sound often is, we figure the company got it mostly right here.",
    "More alignment between the desktop and mobile apps would be nice, and Super X-Fi, great as it is, would only get better if users could fine-tune it how they want.",
    "Still, if you're in dire need of an upgraded audio experience on your PC or Mac with Super-XFI, or want to get better sound from your PS4 and Nintendo Switch, this DAC/Amp combo is a solid choice."
  ],
  "headers": {
    "4": "Price and release date",
    "5": "Design",
    "10": "Setup",
    "16": "Performance",
    "26": "Final verdict"
  },
  "links": {
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066"
  }
}