{
  "source": "https://www.techradar.com/reviews/citizenvpn",
  "title": "CitizenVPN review",
  "category": "computing",
  "updated": "2020-12-04T11:31:24Z",
  "author": "sead-fadilpasic",
  "summary": "Outstanding speeds and other perks",
  "verdict": "CitizenVPN has a lot to like - super-fast performance, support for more simultaneous connections than you need, and a generous free trial period. Beginners may experience a steep learning curve, its server network should be larger, and there still hasn’t been independent confirmation of its no-logging claims, but the overall impression is of one very capable and worthwhile VPN platform.",
  "pros": [
    "Blazing speeds",
    "10 simultaneous connections",
    "Unblocks Netflix",
    "30-day free trial",
    "Speedy customer support"
  ],
  "cons": [
    "A bit complicated to set up",
    "Doesn’t unblock BBC iPlayer",
    "Server network could be larger"
  ],
  "article": [
    "CitizenVPN has been around since 2010, so it has had enough time to develop an advanced and secure VPN platform with some pretty high speeds. Its website may not look like much, but it hides some very powerful capabilities, attractive pricing options, and other perks.",
    "This vendor has several types of subscription to offer - a monthly subscription, a one-time prepaid account, and a pay-as-you-go model that allows you to buy different packages of GBs.",
    "The monthly option will cost you €5 or around $5.93 each month, making it one of the cheapest monthly subscriptions in the industry. It may not have the discounts that are typically entailed in longer-term subscriptions, but this price is still in the middle price range even when compared to those options.",
    "On the other hand, the prepaid account can be purchased as a monthly option at €9 ($10.67), 6-month at €48 ($56.90), or 12-month at €84 ($99.56).",
    "Finally, the pay-as-you-go option can get you 10GB of VPN traffic for €9 ($10.67), 60GB for €48 ($56.90), and 120GB for €62 ($73.50).",
    "Regardless of the chosen subscription option, all users can run up to 10 simultaneous VPN connections.",
    "CitizenVPN also has a completely free Android app that provides premium service depending on how many short video ads you view. If you watch 3-4 ads, you can get 1.5-2 hours of free VPN instantly.",
    "Unlike most of its competitors, this VPN provider offers a very generous 30-day free trial, under one condition: you have to give your payment details and cancel the account before the 30 days are up if you don’t want to be charged for a full subscription. This is still a much more convenient situation than having to pay first and then contact customer support begging for a refund that may or may not be issued.",
    "On top of this, all users are also given a no-questions-asked 3-month money-back guarantee, which is another extremely generous offer rarely seen in this business and shows utmost confidence the people behind CitizenVPN have in their platform.",
    "CitizenVPN does a great job of preserving your privacy while not dramatically reducing your Internet speeds. However, it lacks the simplicity of NordVPN’s native clients, CyberGhost and Surfshark’s low prices, and the overall perfectionist feel of ExpressVPN.",
    "Being able to unblock popular streaming services such as Netflix and BBC iPlayer that have marked these past few years, is the goal that a lot of VPN companies strive for, but not many can achieve. CitizenVPN can provide you with access to Netflix, but not to BBC iPlayer.",
    "This provider develops its VPN service in Denmark but delivers it from the neutral land of Bahamas, in order to avoid the requirement of the EU and USA to log your sensitive data.",
    "It offers access to an undisclosed number of servers in 12 countries, including Singapore, Russia, the US, and more. We counted 48 server options in terms of configuration files, but this shouldn’t be taken as a definitive number.",
    "To fully protect your privacy online, CitizenVPN relies on the super-strong, industry-standard AES-256 encryption, as well as the OpenVPN and PPTP connection protocols. It also deploys additional protection in the form of NAT Firewall. All these defense mechanisms are strong enough to hide your identity during various online activities, such as torrenting/P2P file exchange, which the provider fully supports.",
    "CitizenVPN’s Privacy Policy details its (no)logging practices, which state that its VPN servers log information about connections for the purpose of troubleshooting problems and optimizing the service. It adds that “whenever a log normally includes the IP address or hardware-address of a Clients (sic) computer these logs are automatically and continually (sic) ‘anonymized’ (the IP or hardware-address is immediately anonymized).”",
    "We are also made aware that “the only time an IP address is logged is upon purchase of your account, but this can only ever be used to prove that an account was purchased by someone using your IP address (i.e. potentially multiple people in a household or business etc), not if or when you have actually used it (the reason we keep it is to avoid fraud).”",
    "These statements sound good enough for us, but it would’ve been even better if they were confirmed by an independent source.",
    "CitizenVPN has no native desktop clients, but it does offer a completely free (albeit ad-supported) Android app that has gotten some pretty nice reviews on Google Play Store. It has been rated by 913 users so far (among 50,000+ that have installed it), and its score at the moment is 4.5 stars (out of 5). The app was last updated on August 24, 2020.",
    "This VPN service can also be installed manually on Windows, Mac, and iOS via third-party software like OpenVPN GUI and Tunnelblick. Linux and routers are also listed on the website as supported platforms, but we couldn’t find the information about their installation. If you’re an expert in this area, however, you shouldn’t have trouble equipping them as well.",
    "The support section on the website covers frequently asked questions, but if you need to speak with someone in the support team instead, you can do so by contacting them via email, web form, or phone, Mon-Fri 09:00-17:00. The customer support is available in English and Danish.",
    "Interested in the provider’s download speeds, we conducted some tests on a 38Mbps testing connection and were amazed by the results. The first VPN server we connected to was located in Germany. We connected quickly and got a very fast 20Mbps. Then we tried Norway, with even better results - a blazing 32.30Mbps. Upload speeds recorded no significant losses either.",
    "Then it was time to move further away from our physical location and into the US. Expectedly, the speeds were somewhat lower than for those in Europe but still hailed a very useful 14.16Mbps. Finally, we wanted to check how Singapore would fare, and it did very well, with 10.58Mbps, which is considered fast for such a distant location.",
    "We initially encountered some problems setting up the Windows app but installing the OpenVPN GUI via its own website and copy-pasting the CitizenVPN configuration files in the installation folder solved them. Not having native clients isn’t ideal for VPN beginners but the Android app is simple enough for anyone.",
    "CitizenVPN was quite a discovery for us. Its use started out with some hiccups as it had no customized desktop clients, unlike the famous VPNs such as ExpressVPN, so we had to tinker a bit with it. However, when we started running connections, we were left in awe by its sheer power.",
    "Not only does it provide some of the best speeds we’ve ever witnessed, but it also supports up to 10 simultaneous connections and is so confident in its capabilities that it offers a 1-month free trial AND a 3-month money-back guarantee. You might need some expert help with the service on desktop (not on mobile, though), but it’s absolutely worth it."
  ],
  "headers": {
    "1": "Price",
    "9": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "13": "Privacy and encryption",
    "17": "Support",
    "20": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "CitizenVPN": "https://www.citizenvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "Firewall": "https://www.techradar.com/best/firewall",
    "Privacy Policy": "https://www.citizenvpn.com/main/privacy",
    "Android app": "https://play.google.com/store/apps/details?id=com.citizenvpn.android",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    ",": "https://www.citizenvpn.com/main/index.php?route=information/contact",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1114461770194904700"
  }
}