{
  "source": "https://www.techradar.com/reviews/pc-mac/peripherals/speakers-and-headphones/microphones/blue-microphones-yeti-905163/review",
  "title": "Blue Yeti Microphone review",
  "category": "audio-visual",
  "updated": "2021-09-06T10:52:02Z",
  "author": "alex-cox",
  "summary": "Plug in and play",
  "verdict": "The Blue Yeti is a great a option for anyone who just wants to plug in and play without spending hours tweaking audio settings.",
  "pros": [
    "Tremendous sound quality",
    "Multiple recording patterns",
    "Plug and play – no installation",
    "Fantastic for the price"
  ],
  "cons": [
    "No multi-head setup"
  ],
  "article": [
    "Forget what you think you know about sound recording: the traditional home microphone is dead. Never again should a mini-jack plug have to run its awful buzzing signal into your Mac's mic socket to record podcasts, dialogue, or music.",
    "The digital domain of USB is here – and it's better. Blue's Yeti, the beastly sequel to its groundbreaking Snowball USB mic, exudes a retro charm completely at odds with its next-gen makeup.",
    "The heavy 50s-style metal construction – complete with a brilliantly designed large-footprint table stand – lends it an air of seriousness that its little brother (a white plastic orb) missed.",
    "The Blue Yeti microphone is available to buy for $129.99 (around £100 / AU$180), which is pretty reasonable for a high quality mic, considering you can spend upwards of $1000 for very high end models.",
    "You can also buy the smaller Nano version for $99.99 (£89.99 / AU$159) if you are looking to save money - but bear in mind the smaller version doesn't doesn’t support stereo or bidirectional modes (so you won’t be able to sit across the table from a guest on your podcast.)",
    "One advantage of its 5v-powered USB makeup is that the Yeti is able to put many of the most important recording controls on board. There's a built-in gain dial, essential if you're recording quiet or distant sounds and useful for preventing later processing.",
    "It also features a volume knob for the live-monitoring headphone amp, a mute button to pause recording, and the most important control of all: the pattern switch, which selects between the four operating modes of its triple-capsule array.",
    "The Yeti's quality was clear and full in every test we gave its multiple patterns, though you may want to invest in a pop-shield for the best possible results. Its omni-directional mode captured a room full of chatting people clearly and loudly, the cardioid and bi-directional patterns were pleasingly precise (although you'll need to lean close to the mic to get the best from them), and its stereo pattern is perfect for podcasting, neatly separating multiple voices gathered around a table.",
    "Whether that range of functionality does enough to counter the Yeti's one obvious disadvantage – the fact that you're tethered to a single mic rather than a multi-head setup – is a matter of taste.",
    "But bear in mind that an external mixer and the relevant microphones to replace its stereo function will cost a lot more than the Yeti, and this is an unquestionably high-quality mic (THX certified, no less) at a ridiculously reasonable price."
  ],
  "headers": {
    "3": "How much does it cost?",
    "5": "Gains for days"
  },
  "links": {}
}