{
  "source": "https://www.techradar.com/reviews/xiaomi-m365-pro-electric-scooter-review",
  "title": "Xiaomi M365 Pro electric scooter review",
  "category": "fitness",
  "updated": "2021-06-07T13:24:35Z",
  "author": "tom-bedford",
  "summary": "A tank of a scooter",
  "verdict": "The Xiaomi M365 Pro may be a big scooter, but it's also perfect for travelling on the road – if the relatively limited battery life doesn't get in the way.",
  "pros": [
    "Big design",
    "Useful speed modes"
  ],
  "cons": [
    "Low battery capacity",
    "Hard to reach control button"
  ],
  "article": [
    "Electric scooters are becoming a bigger and bigger part of transport, and so it makes sense that Chinese electronic company Xiaomi, most known for its smartphone and smart home tech, is entering the race. That’s what it did with the Xiaomi M365, and now there’s a bigger and better Pro variant.",
    "The Xiaomi M365 Pro has an expanded display so you can see your speed and modes better, a bigger design, and longer battery life, so on paper it seems like an all-around plus-sized improvement.",
    "It's a competent piece of tech, so it's no wonder we added it to our list of the best electric scooters. If you're tempted to buy it, we'd recommend you check out our guide on what you need to know before riding an electric scooter",
    "The Xiaomi M365 Pro isn’t available in most regions, including the US, but in the UK you can pick it up for around £550 - £600 depending on the retailer.",
    "Bear in mind electric scooters aren't legal everywhere, so check our guide to find out if electric scooters are legal where you are. Of course, you shouldn't buy such a pricey piece of tech if you can't legally drive it, although it's worth pointing out some countries let you own one if you're only going to use it on private land.",
    "As with most Xiaomi products, such as its smartphones, the Xiaomi M365's price places it firmly in the mid-range tier of the competition – at roughly $600/£500 depending on retailer, you’re paying more than the low-range Micro scooters which often sit at around $300/£300, but you’re also not paying a four-figure sum for one of the high-end scooters.",
    "The Xiaomi M365 Pro is a bulky beast, there’s no question about it. With a weight of 14.2kg it’s not exactly easy to pick up and carry, and it’s fairly heavy compared to most other electric scooters, which vary between 8kg and 12kg.",
    "The scooter’s weight is matched in its size – with a 45cm x 15cm deck to stand on, and a handlebar that rises 99cm above the deck, it’s clearly distinct from a non-electric scooter, and you definitely feel the power of the M365 Pro when you’re standing on it.",
    "Between the handlebars is a display which tells you your speed, or the battery percent while you’re charging, as well as the speed mode you’re in. It looks like there are more options on the screen, but we never figured out how to actually toggle these.",
    "A button below the display turns the scooter on when you press it, toggles the headlight with a single press, changes speed mode with a double press, and turns the scooter off with a hold. Due to the size of the handlebars it’s quite a stretch to press, unless you’ve got big hands.",
    "These handlebars had good grip, and felt comfortable to grip even when held tight for long periods of time or in the rain.",
    "There’s a kickstand on the left side of the deck near the back, which we found easy to open with just one nimble kick, and it’s easy to get used to doing so absentmindedly.",
    "In general aesthetic terms, the Xiaomi M365 Pro is a fairly good-looking scooter, with its black body and red trim. The large Pure logo on our review unit spoils this a bit, but won't be present on scooters from other retailers.",
    "As befits a chunky scooter like the Xiaomi M365 Pro, it’s not exactly the most portable device in the world (unless you’re riding it), but that isn’t helped by the lack of features for the scooter itself.",
    "You can collapse the handlebars of the scooter down into the deck, and then lock it using a hook by the bell which attaches to a hook on the back wheel – it's a little fiddly the first time you try and do it, but afterwards becomes easy, and it makes the scooter a lot easier to carry.",
    "There’s also nowhere on the body of the scooter you can attach a lock, so if you want to chain your ride to a bike parking space, you’re out of luck.",
    "Using the Xiaomi Home app on your smartphone you can digitally lock the scooter, so it sets off an alarm if someone tries to move it and won’t let them scoot, but this doesn’t stop them picking it up and walking away with it anyway – if they can pick it up in the first place, due to its weight.",
    "During our testing of the Xiaomi M365 Pro electric scooter, we found it’d last roughly four 7km (4.3 mile) 30-minute commutes, so we’d estimate you can drive it about 30km on a full charge. We were driving at the scooter’s full speed for the majority of this distance though, so if you were to drive in Eco Mode, which lowers the max speed, we’d imagine the scooter would reach the 45km maximum range that Xiaomi states.",
    "You can charge the scooter through a power cable provided, which plugs into a port near the front wheel.",
    "This charging seemed quite slow – after roughly half an hour of charge the battery was up 8%, which suggests the battery actually drains quicker than it charges. If you plug in every time you’re at home this is no problem, but you’ll need to make sure you’ve got sufficient time to charge the scooter regularly if you use it a lot.",
    "The actual capacity of the Xiaomi M365 Pro is 474Wh, which is considerably higher than the 280Wh of the non-Pro variant, so unless you can charge regularly we’d recommend sticking with the Pro.",
    "The Xiaomi M365 Pro has three riding modes – Eco, Driving, and a third cryptically referred to as ‘S’, which we took to referring to as 'Speed Mode!'. You can change between them by double-pressing the button between the handlebars, which is a little challenging to do while you’re driving, so we found ourselves stopping or slowing when we wanted to change speed.",
    "Eco Mode caps out at 15kmph (9.3mph), which was good for navigating busy roads and weaving through cars queuing in traffic, and didn’t burn through battery as much as other modes. However it did feel a little too slow for all but the busiest or quietest roads, and Driving mode was often better for these situations.",
    "Driving mode lets you drive up to 20kmph (12.4mph), and is a perfect speed for keeping pace with cyclists. We found ourselves using this a lot when there were a lot of cyclists or motorists about, as it’s slow enough to be safe but fast enough that we didn’t feel like we were getting in the way at all.",
    "When it was possible though, we engaged Speed Mode!, which let us enjoy the scooter’s true max speed of 25kmph (15.5mph). This isn’t exactly lighting speed for an electric scooter, as the high-end models can reach up to 50kmph (30mph), but there’s no need to go that fast on most roads.",
    "The motor doesn’t kick in when you hold the accelerator button – instead you have to actually be moving for it to work, so you have to kick off like a normal scooter then hold the button. Acceleration for all modes felt great – you shoot off rapidly, and we found ourselves overtaking cyclists and other scooters upon setting off.",
    "Whether we were meandering through traffic in Eco Mode or burning rubber in Speed Mode!, the motor always felt reasonably quiet, and amongst the honking and shouting of a busy city, we could barely hear it most of the time. At higher speeds, and on hills, the sound did become noticable, but never unbearable.",
    "There were a few things that didn’t feel great while driving, though. The tyres didn’t have a whole lot of grip, so if we didn’t slow down before braking, there was a fair bit of stopping distance, especially in wet conditions. In addition the handlebars don’t turn all that much, so when we were navigating tight corners at a slow speed we often had to make wide turns – of course this didn’t matter much when actually driving, as you use your body to do most of the turning then.",
    "The Xiaomi M365 Pro is a big and bulky scooter, with one of the biggest frames you can get for its mid-range price, but you’re getting a lot of power behind the handlebars too.",
    "The electric scooter feels particularly great for roads, as you’ll always go the right speed to keep pace with traffic, without feeling like you’re a small and frail imposter.",
    "Battery capacity does feel a little low though, in particular charging speeds, so people with certain lifestyles might have trouble keeping the scooter charged enough at all times."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Design",
    "13": "Portability",
    "17": "Battery",
    "21": "Riding",
    "28": "Verdict"
  },
  "links": {
    "best electric scooters": "https://www.techradar.com/best/best-electric-scooters",
    "what you need to know before riding an electric scooter": "https://www.techradar.com/news/are-electric-scooters-safe-what-you-need-to-know-before-riding",
    "guide to find out if electric scooters are legal where you are": "https://www.techradar.com/news/are-electric-scooters-legal-in-the-uk-everything-you-need-to-know"
  }
}