{
  "source": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
  "title": "Huawei Mate 40 Pro review",
  "category": "phones",
  "updated": "2020-12-11T11:32:17Z",
  "author": "tom-bedford",
  "summary": "An incredible phone, but one that’s hard to recommend",
  "verdict": "The Huawei Mate 40 Pro is one of the best phones around in terms of hardware – its cameras take incredible pictures, its screen looks great, and it feels wonderful in the hand thanks to its curved display and slender build. It’s just a shame that the software lets the phone down so badly. The lack of Google apps, particularly the Play Store, means there’s lots you can’t do on this device – you can’t use most social media platforms, or play many of the games you’d like, or handily navigate around a city. The price is a little high too.",
  "pros": [
    "Fantastic cameras",
    "Great design",
    "Long-lasting battery"
  ],
  "cons": [
    "Limited apps list",
    "High price",
    "Large selfie camera cut-out"
  ],
  "article": [
    "One day we’ll be able to begin a Huawei phone review without bringing up the ‘app problem’ – but this Huawei Mate 40 Pro review doesn’t mark that day.",
    "The Huawei ban of mid-2019, which resulted in Google apps – most significantly the Play Store, where you get your apps – being unavailable on future phones from the company, has hung like a dark cloud over every Huawei phone launch since.",
    "A year and a half since the ban was imposed, Huawei has made strides with its own AppGallery, but it’s certainly not enough – and our time with the Mate 40 Pro testifies to this fact.",
    "The Huawei Mate 40 Pro is second to none when it comes to hardware, but you’ll have a hard time using it as your day-to-day smartphone given the lack of useful apps the AppGallery offers – there are virtually none of the social media platforms you’re used to, the majority of the top games are absent, and instead of the household-name services many of us use all the time – Netflix, Spotify, Adobe editing apps, and more – you get Huawei’s less-useful alternatives.",
    "Huawei’s AppGallery does have a fair few apps, and some you might even recognize – Tiktok, Snapchat, Amazon Shopping, Tinder and Telegram among them – but it doesn’t come close to matching the vastness of the Play Store. There are some attempts at replacements – TomTom GO is the recommended mapping app, for example, but it only has driving navigation, costs money after a free trial, and is just really slow to use.",
    "If you can look past the big app problem with the phone, you might reach the second stumbling block: its price. The Huawei Mate 40 Pro costs the same as the smallest-storage iPhone 12 Pro Max or highest-storage Samsung Galaxy S20 Plus in the UK, yet the lack of apps makes it much less enticing than either.",
    "It’s a shame the phone has these two issues, because if you were able to look past both, you’d find possibly the best phone of the year in terms of straight-up hardware.",
    "The Huawei Mate 40 Pro feels great in the hand. Its glass-sandwich-with-aluminum-filling design feels premium to the touch, and the feeling is enhanced by the smooth curve of the screen at its edges. The side buttons are in easy-to-reach positions, and given the size of its screen, the phone feels lighter and thinner than we’d expect (though it’s certainly not a compact phone).",
    "In terms of processing, it’s a beast, and it handled games (the ones we could play), and photo and video editing, very well.",
    "Given that this is a Huawei phone, there’s probably something you’re particularly interested in: and yes, the camera performance here is fantastic. Head on down to our ‘Cameras’ section for a more detailed breakdown, but, long story short, the phone takes great pictures, especially portrait shots, zoomed-in images and low-light snaps. If this camera performance came from a phone with a bigger and better selection of apps, it would be a five-star device.",
    "But that fantasy Huawei Mate 40 Pro isn’t the one we got; instead, we’ve got more of a mixed bag, where the strong hardware and troubled software clash on multiple fronts.",
    "After an October 22 launch, the Huawei Mate 40 Pro release date was November 13. That put it as one of the last major phones released in 2020.",
    "The Huawei Mate 40 Pro price is £1,099 / AU$1,999 (roughly $1,400), and that gets you 8GB RAM and 256GB storage.",
    "For some comparison, as we’ve mentioned, in the UK that’s the same price as the lowest-spec iPhone 12 Pro Max (undisclosed RAM, 128GB storage) or the top-spec Samsung Galaxy S20 Plus (12GB RAM, 512GB storage), while in Australia both those phones are at least AU$100 cheaper than the Mate 40 Pro.",
    "The Huawei Mate 40 Pro price is actually quite a bit more than the Mate 30 Pro, which sold for £899.99 / AU$1,599 (around $1,200) – if you’re wondering why we’re not comparing it to other Mate 40 phones, it’s because as with the Mate 30 line, the Pro is the only version that Huawei has released in most countries outside China.",
    "The Huawei Mate 40 Pro feels great in the hand, with- its glass back and glass screen sandwiching an aluminum frame. The dimensions are 162.9 x 75.5 x 9.1mm and it weighs 212g, and while those measurements make it seem pretty big, for a phone of its screen size, the Mate 40 Pro doesn’t feel overly huge; the curved-edge display, which helps the phone fit snugly in your palm, adds to this impression.",
    "We found the power button and volume rocker, both on the right edge of the phone, easy to reach – people with smaller hands might find it a little trickier to hit the higher-up rocker, but most will be able to reach the power button easily enough. The Mate 30 Pro didn’t actually have a volume rocker, as on that phone Huawei debuted tech that allowed you to slide your finger up and down the curved screen edge to change the volume – given that the rocker has returned here, we’d guess that particular novelty didn’t catch on.",
    "There’s no 3.5mm headphone jack here, so fans of wired audio will have to use a converter with the USB-C port in order to use their existing wired headphones, or look for USB-C wired headphones, although there are few options around at the moment.",
    "The back of the phone feels sleek, but you might find that its appearance detracts from the overall impression of elegance, as our review unit quickly became a canvas of fingerprint marks. This was on the black version of the phone, and it’s also available in silver, which might not show off finger smudges as much. At launch green, yellow and white versions of the Mate 40 Pro were also unveiled, and we’d say these look a lot more striking than the black model, although we haven’t seen them on sale anywhere yet.",
    "You might find the camera bump pretty eye-catching – it’s a big circle, with the lenses mounted within, as well as the flash module. It doesn’t stick out too much, and gives the phone a distinct and commanding look, as if telling the subject of your photo ‘you’re being snapped by one of the best camera phones out there’.",
    "The Huawei Mate 40 Pro display looks pretty great, though the paucity of streaming service apps means that opportunities for enoying it are somewhat limited.",
    "This screen is 6.76 inches diagonally, which is pretty big, but as we’ve mentioned the design goes some way in mitigating any issues with this. It has a 2772 x 1344 resolution, which is higher than that of many other phones (most stick with 1080p) and as a result images look sharp.",
    "The OLED HDR10 tech makes colors pop – Huawei claims that the display shows off 16.7 million colors, although we didn’t stop to count. The high max brightness helps with this too.",
    "Fast screen refresh rates are the latest battleground in the smartphone spec wars, but the Huawei Mate 40 Pro caps out at 90Hz, which some might find a little low for a premium smartphone (others hit 120Hz or 144Hz). You can dial this down to 60Hz if you like, which saves battery, but we went with the dynamic mode option, which automatically switched between the two depending on what you’re doing.",
    "If we have one issue with the Mate 40 Pro display, it’s the pill-shaped cut-out that houses the two front-facing cameras at the top-left of the screen. It’s not exactly small, with quite some distance between the two lenses, so it cuts a fair amount out of your viewable area.",
    "The Huawei Mate 40 Pro is one of the best camera phones out there – while its snaps are roughly on par with its top-tier competition, and which is the ‘best’ phone largely comes down to personal preference, the sheer number of modes and options on offer here outstrips most of the competition.",
    "The main snapper is the same 50MP f/1.9 camera we also saw on the Huawei P40 series and Mate 40 – this has a RYYB sensor (red, yellow, yellow, blue) as opposed to the ‘standard’ RGB (red, green, blue), which allows it to take in more light. This is joined by a 20MP f/1.8 ultra-wide camera and a 12MP f/3.4 periscope telephoto (for 5x optical zoom) snapper.",
    "On paper that might make the phone look a little worse off than the P40 Pro, which had the same main and telephoto snapper but a higher-res ultra-wide camera. However, that ultra-wide camera is where many of the improvements actually come, as it has an improved focal length, along with another key change that we’ll get into later in this section.",
    "Pictures taken on the Huawei Mate 40 Pro looked fantastic, from scenic vistas and close-up subjects, or portrait shots. We could expend plenty of words praising the color accuracy, depth, contrast, AI tweakery, and more, but instead we’d suggest that you just scroll down to our Camera Samples section to see for yourself.",
    "The ultra-wide camera uses a ‘free-form’ lens which, to cut a detailed scientific process down to its bare elements, uses an uneven shape to effectively reduce the kind of distortion ultra-wide snaps usually have. This works well, and wide-angle pictures looked fabulous.",
    "The periscope telephoto lens supports 5x optical zoom, and pictures taken at this zoom level look so good that it’s hard to tell they’re zoomed at all. You can zoom in 50x optically, which simply crops in the image, and compared to super-zoom snaps we’ve seen from other phones the Mate 40 Pro’s don’t look awful – they do look rather grainy though, so you might not find yourself using this feature very much.",
    "Portrait mode is great – images don’t have over-the-top ‘bokeh’ effects, and instead some settings, like highlights and shadows, are tweaked to make the subject stand out more naturally.",
    "It’s when the sun goes down that the Huawei Mate 40 Pro really shines – it’s consistently brilliant at taking photos in low-light conditions. Standard shots taken during the night, or in dark places, looked great, with plenty of detail, colors picked up well, and highlights and shadows balanced. Snaps also had very little noise in dark areas.",
    "We were particularly impressed with Portrait-mode shots taken in low-light conditions – when we took some photos in a dark bar the results were great, despite the lack of light and a bright red sign nearby.",
    "Huawei’s fantastic moon photography setting is back too, if you opt to zoom in to around 50x on the celestial body, and we took some amazing photos of it that we can’t quite believe we got from a smartphone.",
    "On the front, the Huawei Mate 40 Pro has two cameras, with a 13MP f/2.4 ultra-wide snapper joined by a time-of-flight (ToF) sensor for improved depth sensing. Selfies look good, as they’re pretty bold in terms of color, and we liked having the ability to adjust our framing thanks to the use of an ultra-wide lens, as you can zoom in or out to a limited degree.",
    "Portrait mode on the front-facing camera is a little less useful that on the rear though – instead of snaps having some background blur applied and settings tweaked a little, you have to choose from a limited selection of effects, like Stage Lighting (removes all your background) or Hearts (which makes lights behind you look heart-shaped). None of the options we could find produced anything that looked like a ‘standard’ Portrait selfie, as they go too hard on the processing effects, so we found ourselves ignoring them.",
    "Talking of processing, Huawei has typically gone hard on the ‘AI Optimization’ for its camera phones, and we thought this was to thank for our great-looking snaps until we realized that we’d had it turned off for much of our camera testing – we had to remember to switch it on for our later shoots. By this we mean to say the cameras are so great that AI doesn’t even feel necessary - if you turn it on, you’ll find photos tweaked in subtle ways to make them look better, though not all snaps benefit too much.",
    "Fans of fun camera modes will find plenty in the Huawei Mate 40 Pro to enjoy. There’s the aforementioned moon mode (though we’d love to see an astrophotography option for stars too, a la Google Pixel 4), Dual View which lets you record video on the front and back cameras at once, various slow-mo settings up to an impressive 3840fps (normal slow-mo is only 960fps, and this super-slow-mo lets you see even the quickest action in full detail), and Light Painting, which seems to combine shutter speed tweaks with AI optimization to create artistic snaps of everything from cars to star trails.",
    "Finally, let’s look at videography. The phone uses the ultra-wide snapper, not the main one, to record videos, and you can shoot up to 4K 60fps, but if you turn on image stabilization or subject tracking that drops down to 1080p 30fps.",
    "Footage looks great, with surprisingly vibrant colors for a smartphone video. Even without the stabilization mode enabled, videos don’t shake too much, and we’ve also got to commend the seamless zooming (up to 10x).",
    "Unlike on many other smartphones, you can record 4K video using the front-facing camera. However, the resulting video looks a little dim, and the efforts of the AI to cover this up when the clip was played back on the phone became rather apparent, with excessive brightening and oversaturated colors.",
    "As with the display, the lack of apps makes it a little hard to really test the Huawei Mate 40 Pro performance in full - from our experience, though, we never felt let down by the phone’s power.",
    "There’s Huawei’s newest Kirin 9000 chipset here, paired with 8GB RAM. AppGallery doesn’t actually have our usual benchmarking app, Geekbench, so we can’t use scientific methods to compare the phone’s power to its competitors, but we’d imagine it’s roughly on par with the Snapdragon 865 Plus found in some recent phones.",
    "When playing games on the phone (Fortnite is available) or using photo editing apps (PicsArt sat at the AppGallery’s popular apps list for the entirety of our review, though we’d never heard of it before), the Mate 40 Pro felt snappy and fast, and we never found much lag when doing intensive tasks or opening apps.",
    "The 256GB storage here feels more than enough for most people; if you’re not sure that will be enough, not many popular cloud storage options are available via AppGallery. We found ourselves having to plug the Mate into our computer to save photos and grab the photos for the camera samples section above.",
    "We’ve finally reached the elephant on the phone, the apps situation. We could write thousands of words about AppGallery’s strengths and weaknesses, but to cut it down to six: ‘AppGallery is no Play Store replacement’.",
    "AppGallery does have plenty of apps, but few of the popular ones you’ll likely have installed on your Android device or iPhone. There are few social media apps save Tiktok and Snapchat, no major entertainment services like Netflix, Amazon Prime Video or Spotify, and a relatively trim list of games. We found the social media absence the real killer - we had to use a second phone alongside the Mate 40 Pro for WhatsApp, Instagram, Twitter and the Facebook suite.",
    "There’s a strange, though not unwelcome, focus on regional apps in AppGallery. In the UK we were recommended plenty of apps from national retailers, catch-up apps from certain channels, telecoms hubs and banking services, and we’d imagine in other countries, you’ll find plenty of apps for you. The UK’s All4 is no substitute for Netflix, though.",
    "Perhaps the most annoying absence here is Google’s own apps – especially, of course, the Play Store, but the others too. The lack of Google Drive leaves no mainstream cloud storage services available; Google Maps’ replacement, TomTom GO, is slow, costs money, and only gives driving instructions; the Huawei news feed, replacing Google News, exclusively recommended us tabloid stories, with an emphasis on celebrity clickbait. Some of the Google services are actually available via the browser app, but you shouldn’t have to rely on this kind of workaround to access apps.",
    "We’ve also got to query the way Huawei handles its apps. When you turn on the phone for the first time, the menu is littered with folders of app icons – these aren’t actually installed on the phone, so we can’t accuse them of being bloatware, and you have to click them to download the app. Still, this feels a little too pushy in the way it encourages you to download the apps – and in the case of dating apps like Tinder and Badoo, whether they’re pre-installed or not you might not be comfortable with having those icons on your phone for a partner, or acquaintances, to see.",
    "To its credit, Huawei does seem proactive in bringing new apps to AppGallery, and in the next few months or years we’ll almost certainly see its app roster swell. But until there are more of the bigger apps you likely use in your current smartphone, it’s hard to recommend the Mate 40 Pro as your next handset.",
    "There is a potential remedy to the app problem in the form of 'Petal Search' which comes installed on the phone - it lets you search for non-app-store ways to install apps, like APKs, straight from the app website, or similar. This technically lets you install apps you otherwise wouldn't be able to find like WhatsApp and Instagram, and the vast majority of apps you likely use every day are included, though not every single app.",
    "Some might find Petal Search solves all their app problems, especially for social media, with many popular platforms available this way. We didn't actually use most apps downloaded this way, as our WhatsApp backup and social media logins are tied to our Google account, which means we can't access them on the phone.",
    "For people who aren't in that position, or just want some extra services and games not available through the AppGallery, it's a valid option. However if your accounts on games, shopping apps and more are tied to your Google log-in, you might have issues. For more information on Petal Search check out Huawei's website here.",
    "Beyond the app situation, the phone runs Android 10 (Google banned Huawei from using its apps and services, not Android itself) with EMUI 11 laid over the top.",
    "We’re big fans of EMUI - it has loads of options to change the way the phone works, from visual tweaks (Dark mode, Eye Comfort filter, the ability to change color temperature) to functional (editable always-on display, various navigation options, useful pre-installed apps). It brings quite a big visual overhaul from stock Android, with vibrant backgrounds and app icons, which helps you appreciate the display technology.",
    "As with most Huawei phones, EMUI has a built-in step counter, potentially making your fitness tracker redundant if you like this kind of information, though it’s likely not as accurate as a dedicated device.",
    "The Huawei Mate 40 Pro battery life is stellar, and not once did it fail to survive a day of use. Is this because the relative lack of apps means there were fewer reasons to use the phone? Perhaps, but there’s probably more to it than that.",
    "The battery capacity is 4,400mAh, which is about average for a flagship phone, but we’d imagine the real reason the phone lasts a long time is some smart software optimizations to keep the battery going longer. We say this because the company has used similar optimizations to give its wearables fantastic battery life.",
    "Charging here is equally impressive: there’s 66W wired charging, which will power up the phone in under an hour, and also 50W wireless powering, which is certainly a rarity in smartphones. We didn’t actually get to test out this latter speed, as to get it you need to buy a separate 50W pad from Huawei, but we used the phone with one of the company’s other wireless pads, and it seemed pretty snappy too.",
    "Finally, there’s 5W reverse wireless charging, which lets you power up other wirelessly-charging devices using the Huawei Mate 40 Pro as a mat. At 5W this is ever so slightly faster than other devices with the feature, but the option is a little hidden in the Settings menu.",
    "First reviewed: November 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Huawei Mate 40 Pro price and availability",
    "15": "Design",
    "20": "Display",
    "25": "Cameras",
    "42": "Performance and specs",
    "46": "Software",
    "58": "Battery life",
    "62": "Don't buy it if..."
  },
  "links": {
    "Huawei's website here": "https://consumer.huawei.com/en/mobileservices/search/"
  }
}