{
  "source": "https://www.techradar.com/reviews/jbl-flip-5",
  "title": "JBL Flip 5 review",
  "category": "audio-visual",
  "updated": "2020-02-20T08:27:20Z",
  "author": "becky-roberts",
  "summary": "A fun, no-frills portable Bluetooth speaker",
  "verdict": "JBL’s Flip 5 is a simple soul with Bluetooth-only playback and modest features, but if you desire a rugged, great-sounding portable speaker and can sacrifice voice control or hands-free call functionality, you won’t be disappointed.",
  "pros": [
    "Engaging, entertaining sound",
    "Easy to use",
    "USB-C Fast Charging"
  ],
  "cons": [
    "No 3.5mm input",
    "No mic for hands-free calls",
    "‘Only’ Bluetooth 4.2"
  ],
  "article": [
    "Modern architect Ludwig Mies Van Der Rohe’s famous ‘less is more’ phrase is not a common approach to many Bluetooth speakers these days as brands strive for Wi-Fi and multi-room this, voice control and AirPlay that.",
    "The minimalist manner of the JBL Flip 5 portable speaker is unexpected, then – especially as it even strips back some of the features of its predecessor, the JBL Flip 4.",
    "Still, the best Bluetooth speakers aren’t always the ones with the longest spec sheets, and JBL has a proven track record for quality speakers. So does the Flip 5 indeed buck the trend or represent another flippin’ steal from the renowned US stalwart?",
    "The Flip 5 launched in August 2019 for $119.95 / £119.99 / AU$149.95 as the successor to the Flip 4, which we also awarded four stars for its punchy, bass-laden sound and rugged design. It’s plummeted a few pennies since then, putting it up against class-leading competitors such as the UE Boom 3 and JBL’s own Charge 4.",
    "Typical for a JBL speaker, the widely available Flip 5 comes in a collection of colors, including Desert Sand, Mustard Yellow, Dusty Pink, Grey Stone, River Teal, Fiesta Red, Ocean Blue, Midnight Black, Steel White, Forest Green, and last but certainly not least the finish you see pictured here: Squad – or in layman's terms, cameo.",
    "Thankfully, the Flip 5’s design will allow you to show off its talents almost anywhere. Just half a kilo / one pound and the size of a small thermal flask, the compact yet robust Flip 5 can be easily carried in a hand, slipped into a bag or, thanks to the shoelace strap, hung on, say, a door handle in a bedroom or tree in a park.",
    "Already picturing your new portable speaker soundtracking your summer picnic? Know that weather would need to be considered to save your snacks but not this speaker – its IPX7 waterproof rating means it can be immersed in water up to a meter deep for a maximum of 30 minutes.",
    "The passive bass radiators at either end are recessed enough into the tubular housing to avoid easily damaging them, although we’d be cautious shoving it haphazardly into a bag carrying sharp or pointed objects.",
    "We can’t imagine JBL receives many returns for spoiled speakers within the warranty, though. The Flip 5, like so many of its siblings in JBL’s line-up, is well-built, impeccably finished and, with a simple button layout and handy battery indicator, very straightforward to use.",
    "Whichever finish takes your fancy, you get the same straight up, no-frills portable speaker. There’s Bluetooth playback of course (simply press the dedicated button to initiate pairing); JBL’s PartyBoost function that pairs Flip 5 or Pulse 4 speakers either for stereo pairing or simultaneous playback in the companion JBL Connect app; and a USB-C slot for charging – and that really is your lot.",
    "JBL has decided not to equip the Flip 5 with an AUX socket for hardwiring a smartphone or alternative audio device, nor is there a built-in microphone to facilitate hands-free calls and Siri and Google Assistant activation.",
    "They’re both surprising omissions considering their presence on the Flip 4, although perhaps more unusual is its support of Bluetooth 4.2 over the newer 5.0 standard. It’s not the end of the world, but it does mean missing out on faster data speeds and a staggering wireless range of 240m (4.2 offers a range around four times shorter).",
    "What JBL has improved with the Flip 5 is the speed of charging. A full charge, which offers 12 hours of playback, takes an hour less – 2.5 rather than 3.5 hours.",
    "A step up in sound quality seems promising thanks to a greater (20-watt) power output and newly engineered, racetrack-shaped 44mm driver with an increased cone area for greater sonic amplification.",
    "That on-paper promise materializes in practice, too. Like a mutt suffering from small-dog-syndrome, the Flip 5 demands to be heard (the difference is, you'll actually want to hear it).",
    "Whether we subject the mini speaker to Mac Miller’s languid-yet-sharp rapping or Explosions in the Sky’s post-rock instrumentalism, the JBL delivers it with stark clarity, lashings of detail and more than a hint of dynamics.",
    "Had we not been so well acquainted with JBL’s penchant for sonic excellence, we’d be shocked how clear and musical this unassuming little speaker sounds. As it happens, we’re pleasantly reminded of it instead.",
    "With Gone by Charli XCX and Christine and the Queens, both the hollow baseline and crisper percussion come through thick, fast and defined, making it almost impossible to criticize the speaker’s low-end performance.",
    "The equally enticing vocals that wash over the electronica come through with sharpness and precision, and thanks to the Flip 5’s spaciousness and rhythmic knack, each element in the mix seems to fit together just right.",
    "We aren’t compelled to turn up the volume in order to feel engaged, but even when we do as we give it an open field stage, it avoids sounding distorted or like it’s being pushed too hard. We don’t feel obliged to sit close to it either, the Flip 5 confidently able to spread its sound past its modest dimensions. Stand several meters away (frisbee, anyone?) and you’ll still find yourself singing along.",
    "The JBL Flip 5 is a simple soul – perhaps too simple for some in this world – but that minimalist approach has allowed JBL to focus on performance and create one of the best-sounding budget portable speakers around.",
    "Thanks to its neat design and IPX7 rating it's suitable for use outside as well as in, making it an ideal outdoor speaker.",
    "And so, JBL’s track record with excellent Bluetooth speakers persists. On behalf of everyone who loves good-quality music on the move, long may it continue."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "9": "Features",
    "14": "Performance",
    "20": "Final verdict"
  },
  "links": {
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "JBL Flip 4": "https://www.techradar.com/reviews/jbl-flip-4",
    "best Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "UE Boom 3": "https://www.techradar.com/reviews/ultimate-ears-boom-3",
    "Charge 4": "https://www.techradar.com/reviews/jbl-charge-4",
    "Pulse 4": "https://www.techradar.com/reviews/jbl-pulse-4",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you"
  }
}