{
  "source": "https://www.techradar.com/reviews/alienware-m15-r3-2020",
  "title": "Alienware M15 R3 (2020) review",
  "category": "computing",
  "updated": "2021-11-19T16:53:19Z",
  "author": "jeremy-laird",
  "summary": "Alienware’s brilliant 15-inch gaming beast just got a little bit better",
  "verdict": "Alienware’s brilliant 15-inch gaming beast, the M15, just got a little bit better thanks to design tweaks and newer components. But, it’s still painfully pricey.",
  "pros": [
    "Great build quality",
    "The very best components",
    "Sublime all-round performance"
  ],
  "cons": [
    "4K OLED panel not optimal for gaming",
    "Nvidia Max-Q GPU a little limited",
    "Very expensive"
  ],
  "article": [
    "Have to ask how much? You probably can’t afford it. So it goes with the latest revision of the fabulous Alienware M15 gaming laptop for 2020.",
    "At least it does for this absolutely loaded review configuration. This 15-inch beast is crammed with pretty much the finest components known to science, man, Christendom, you name it. First up, given this is a gaming laptop, is the Nvidia GeForce RTX 2080 Super graphics card.",
    "It’s Nvidia’s top mobile graphics chip, and thus ultimately the best currently available. However, for the relatively slim M15 chassis Alienware has opted for the low-clocked Max-Q version of the 2080 Super, which limits performance somewhat. Nvidia does have some new 3000-series graphics chips, like the RTX 3080, but mobile versions are some way off during its release. So, the 2080 Super is as good as it gets for some time.",
    "Next, the screen. It’s a 15-inch 4K OLED panel rated at 400 nits and it’s utterly glorious, although also problematic in this context, more of which momentarily. Then there’s the 10th-gen Intel Core i9-10980HK CPU, no less than Intel’s finest eight-core mobile processor. Rounding things out in the key specs department are 32GB of RAM and a 512GB M.2 SSD. All told you’re looking at a meaty price tag starting with a ‘3’, be that in bucks or olde worlde pounds.",
    "Anyway, if the core components look sweet in isolation, how do they all hang together? The M15 is easily Alienware’s best, not to mention, thinnest 15-inch chassis yet. It has a premium vibe that has previously eluded Alienware’s engineers and some neat detailing, including the natty RGB ‘halo’ ring on the rear.",
    "More importantly, it feels robust. The keyboard bed is absolutely rock solid, even if the actual keystroke is arguably softer and not as crisp as some gamers would like. You also get all the ports you could reasonably ask for, including three USB A sockets, USB-C, mini DisplayPort (we’d prefer full DisplayPort), HDMI, Ethernet and MicroSD.",
    "But what of the most important matter of all, performance? In our benchmarks, the latest M15 cranks out some very nice numbers, topping an average of 60fps in Metro Exodus and Total War: Three Kingdoms at ultra settings and 1080p, both very demanding titles. Any snags? The ‘Max-Q’ thing means that this 2080 Super performs more like a 2070 Super mobile part.",
    "What’s more, the native resolution of the 15-inch panel is 4K not 1080p. Crank it up to 4K and maintain ultra settings and you’re looking at barely playable frame rates in the high 20s and low 30s. Knock some setting downs and you can, of course, smooth things out. And let’s be clear, the pixel density and detail in-game at 4K on a 15-inch panel will blow your mind. It’s incredible.",
    "But the overarching point is that, in pure gaming terms, 4K is still a bit too much screen for for that Max-Q GPU. Maybe Nvidia’s next gen mobile graphics will fix that. For now and for most gamers, a 1080p or 1440p panel, ideally with a much higher refresh rate than the 60Hz of the M15’s OLED panel, would be a better fit in this chassis. Indeed, Alienware offers a 300Hz 1080p option for the M15. There are always exceptions, however, and if you understand the current limitations of a 4K OLED panel in this context, this is an incredible machine.",
    "At $3,299 (£3,099, AU$5,598), the Alienware M15 for 2020 ain’t exactly cheap when tricked out with top-end components. It can actually be had starting at under $1,500 / £1,500, but that’s with either a Radeon RX 5500M or GeForce GTX 1650 Ti graphics, neither of which are great shakes in gaming terms.",
    "Inevitably, you can access the same CPU and GPU as this top-tier configuration offers for less money from other gaming laptop suppliers, such as MSI and Gigabyte. What you won’t get is quite the same premium vibe and overall feel-good factor. Exactly how much value you place on that is obviously a subjective call.",
    "Regarding our test configuration, we’d suggest thinking hard about the value of the pricey 4K OLED option. Lordy, it looks stunning. But it generates huge GPU load. For most gamers, Alienware’s 1080p 300Hz panel will be the better bet.",
    "This is comfortably Alienware’s best 15-inch design yet. It’s not super slim. Nor is it a member of the fashionable zero-bezel brigade, lower bezel and hinge in particular are pretty beefy. But at well under an inch thick and tipping the scales at 2.5kg, it’s not a monster either.",
    "The 240W power supply, meanwhile, has been designed to be relatively flat and wide and reasonably thin. That helps with portability compared to a narrower but thicker brick. However, the absence of straps to help keep the cables tidy in transit is a pity, to be sure.",
    "It’s also simply far slicker and sexier than previous generations of Alienware laptops. And if the actual design is a subjective call, the quality is undeniable. That’s particularly notable in the rock solid keyboard bed that suffers from virtually no flex or bounce. The keys themselves offer a pretty generous 1.7mm of travel. The action is quite soft, the upside of which is low noise. But gamers who favour a more crisp and mechanical feel may require a little adjustment time. As for the glass-topped trackpad, it’s a nice touch, literally, even if it will likely see little if any gaming action.",
    "Elsewhere, the evidence of proper engineering is legion. Alienware has built in 12-phase graphics voltage regulation, with six phases for the CPU. The cooling is handled by an advanced solution involving copper heat pipes, vapour chambers and larger fans than before. And Alienware has updated the chassis coating to reduce smearing and staining.",
    "Alienware also says the four-way (woofer / tweeter) stereo speaker design packs 2.5x more bass and 2x more treble than before and 30 per cent more volume overall. Really, those are just some of the highlights. The list of features and revisions is huge.",
    "Other details of arguably more aesthetic concern involve the RGB lighting for both the keyboard (per key) and the rear ‘halo’. Both are configurable via the Alienware AlienFX app. For some, they’ll be a bit showy. But then all the effects can be instantly diasabled via a quick keyboard shortcut.",
    "Ports-wise, we’re talking a MicroSD card reader, three SuperSpeed USB 3.1 Gen 1 Type-A sockets, HDMI 2.0b, Mini-DisplayPort 1.4, USB-C with Thunderbolt 3, the Alienware Graphics Amplifier Port, Gigabit Ethernet and a headphone jack. All your base are belong to Alienware, you could say.",
    "At 1080p and with all the settings set to ‘ultra’, the Alienware M15 for 2020 has the measure of pretty much any game you throw at it. That’s largely down to the Nvidia GeForce RTX 2080 Super mobile graphics chip. It is as good as mobile GPUs currently get.",
    "At least, it nearly is. This is the ‘Max-Q’ version of the 2080 Super and it’s clocked significantly lower than the standard version. Low enough, in fact, that gaming performance is about the same as a 2070 Super non-Max-Q fitted to Alienware’s large M17 chassis.",
    "With this particular configuration, the slight problem is that the glorious 15-inch OLED display is fully 4K. That has two immediate consequences. First, for the best image quality, you need to run at native resolution, and that crushes frame rates down to the high 20s or low 30s, again assuming ultra settings.",
    "The visual quality at 4K really is something special. Partly that’s thanks to the qualities of OLED - the incredibly rich colours, near infinite contrast, super fast response. But it’s also the crazy pixel density and detail. Don’t let anyone tell you 4K is overkill on a 15-inch panel in that regard. You can see the difference compared to 1080p, it’s incredible.",
    "But paying this much for a laptop and having to switch off or at least knock some of the in-game eye candy isn’t ideal. The harsh reality is that the Nvidia GeForce RTX 2080 Super in Max-Q format doesn’t have the graphics chops for totally smooth gameplay at 4K in the most demanding titles, not in mobile form it doesn’t. Perhaps Nvidia’s incoming RTX 3000 Series will leap that hurdle. But the mobile variants of that new Ampere family of GPUs are probably six months away, at least.",
    "You can, of course, opt to run the M15’s 4K OLED panel at 1080p. The result, however, is soft non-native image quality and refresh rate limited to 60Hz. For many gamers, one of Alieware’s high-refresh 1080p screen options will likely be a better all round choice. If online shooters are your thing, the 300Hz panel sounds pretty sweet.",
    "If you want great battery life, an eight-core gaming laptop with a massive GPU isn’t the best starting point. That said, the M15 puts on a respectable showing away from the mains, managing over five hours in the PC Mark 10 battery test and not far off seven hours watching movies. That’s a couple of full-length blockbusters on a plane ride. Just don’t expect to actually game or crunch video on battery power for more than a few fleeting moments."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Price and availability",
    "12": "Design",
    "19": "Performance",
    "25": "Battery life",
    "26": "Don't buy it if..."
  },
  "links": {
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}