{
  "source": "https://www.techradar.com/reviews/waterfield-designs-outback-duo-waxed-canvas-laptop-bag",
  "title": "Waterfield Designs Outback Duo Waxed Canvas laptop bag review",
  "category": "computing",
  "updated": "2020-08-12T08:00:08Z",
  "author": "desire-athow",
  "summary": "A wonderfully designed and practical laptop briefcase",
  "verdict": "The Outback Duo laptop bag combines full grain leather and waxed canvas with some smart features that will keep up to two laptops secure. It is expensive and it will divide opinions but one thing that nobody can deny; it is a quality product.",
  "pros": [
    "Pros",
    "Gorgeous finish, both inside and out",
    "Quality material",
    "72-hour international delivery"
  ],
  "cons": [
    "Lacks any security feature",
    "No reinforcement on the bottom edge",
    "Handle slightly bigger than expected",
    "A free wax tin would have been great"
  ],
  "article": [
    "Briefcases, messenger bags, sleeves, backpacks… There are so many ways to carry your laptop, tablet and assorted accessories around that it is easy to forget that what you put your devices in is both a fashion statement and a status symbol with a heavy dose of practicality.",
    "Finding the right balance can yield a long-term partnership that lasts for life, which is what Waterfield Designs is aspiring to with its new Outback Duo laptop brief, a bag that provides a stylish way to carry a laptop, a tablet and a few other things.",
    "The Outback Duo Laptop brief bag comes in two sizes: one to accommodate two devices up to 16-inch x 9.75-inch (about 41 x 25cm) and that includes Apple MacBook Pro 16, Apple MacBook Pro 15, Microsoft Surface Book 2 and 3, Microsoft Surface Laptop 15 and Dell XPS 15.",
    "The other is a smaller one that can house two devices up to 13-inch x 9-inch in dimension (33 x 23cm); devices that fit this format includes Apple MacBook Pro 13-inch, Apple iPad Pro, Apple Surface Pro 3 13.5 and Dell XPS 13.",
    "One surprise is that the bigger bag costs only $10 more than the smaller one ($239 v s$229), despite being significantly physically bigger. Both models are available in three versions, Waxed canvas with chocolate leather, Ballistic Nylon with chocolate leather and Ballistic Nylon with black leather.",
    "The first thing that hits home when you first handle the Outback Duo is the sweet, sweet scent of leather, an earthy, primordial smell. Granted it is an intensely subjective point of view and some of our readers may not agree with me or may consider opting for something else based on ethical or religious beliefs.",
    "Distressed leather is something that will divide opinions. Using this material though gives uniqueness to the product; like snowflakes, you won’t find two exact copies due to the way the leather will be used over the lifetime of the product. As a natural material, leather has undeniable appeal with endless variations in scars, creases, color and texture.",
    "On the outside, it is dark brown with a leather flap that hides a front pocket and leather-lined handles. These do not align easily which can make them seem bulkier than they actually are.",
    "There’s a pair of metal loops to hold the detachable suspension shoulder strap and a two-way water-proof concealed metal zip with a pair of pull tabs with fabric strings, secured by metal ends. That makes it difficult to add any gizmo to secure your bag’s content and dissuade opportunistic thieves.",
    "At the back is a wheeled suitcase passthrough while the bottom doesn’t contain any reinforcement. We would have loved to see discrete rubber reinforcements to protect devices inside from sudden shocks due to falls.",
    "Inside are two padded laptop compartments, one of each side with space in the middle, with plush, no-scratch black fabric for protection; there’s a gold-colored, waterproof liner to make it easier to identify what’s inside. Clever, inconspicuous laptop compartment cut-outs also allow for better in-case laptop charging.",
    "The front pocket is folded to keep bulky accessories from bulging out and the flap is shut securely thanks to a strong magnet that requires minimal alignment. There’s three pockets to organize your phone, cables and others.",
    "We managed to fit a Dell Latitude 7490 and a Lenovo Thinkpad X270 snugly with a bit of wriggle room. One is a 14-inch notebook and the other one a 12.5-inch laptop, together weighing more than 3Kgs without accessories. Our biggest issue is the lack of reinforcement to mitigate any fall; that said, never during our brief test did we find it lacking in quality or sturdiness; just be careful with drops.",
    "Waterfield defines lifetime as “the length of time that a product, through normal/expected use, can be expected to function as intended”. In other words, it should not be construed as lasting forever but lasting a very long time. “The lifetime guarantee”, the manufacturer adds, “specifically refers to the length of time, through normal use, a WaterField Designs product will function for its intended purpose. It does not apply to the lifetime of the user.”",
    "Choosing the right bag can be a bit of a trek/trial and error but there’s something uniquely authentic about the Outback Duo. Knowing that it is handcrafted in San Francisco (“where rent is high, labor expensive, and competition intense. We wouldn’t go anywhere else”, says the marketing blurb) make it a little bit more special.",
    "Yes it is expensive and yes it smells a bit but boy does it have character and style with an aura of timelessness. And like good wine, it will likely improve over time; the leather will age and will develop its own patina. In addition, you can freshen up the canvas fabric by using the appropriate wax.",
    "However, the current pandemic and the new normal means that classic bags like this one may never sell in enough quantities to sustain businesses that have thrived pre-Covid.",
    "In conclusion, there's certainly no shortage of quality leather laptop bags to choose from these days, in a range of shapes and sizes, but if you want something a little bit special then the Outback Duo, even allowing for its premium price, shouldn’t disappoint."
  ],
  "headers": {
    "2": "Price",
    "5": "Design",
    "13": "Lifetime warranty vs “Lifetime” warranty",
    "14": "Final verdict"
  },
  "links": {
    "Outback Duo Laptop brief bag": "https://www.sfbags.com/products/outback-duo-laptop-brief?tab=Details",
    "Dell Latitude 7490": "https://www.techradar.com/reviews/dell-latitude-7490",
    "Lenovo Thinkpad X270": "https://www.techradar.com/reviews/lenovo-thinkpad-x280"
  }
}