{
  "source": "https://www.techradar.com/reviews/hideway-vpn",
  "title": "Hideway VPN review",
  "category": "computing",
  "updated": "2020-12-04T15:34:25Z",
  "author": "sead-fadilpasic",
  "summary": "Basic VPN but gets the job done",
  "verdict": "Hideway doesn’t really stand out from the average crowd, mainly due to its slightly obsolete appearance, lack of native clients, absence of information on the website, and poor customer support. However, it undoubtedly provides high download speeds on its single server location and lets you choose among more subscription options than some.",
  "pros": [
    "Plenty of subscription options",
    "Excellent speeds",
    "2-day free trial"
  ],
  "cons": [
    "Very basic VPN",
    "Tiny server network",
    "No details on logging",
    "Doesn’t work on Android",
    "Non-responsive customer support"
  ],
  "article": [
    "Hideway is a rather basic VPN provider that offers its service on a single server location - in Austria. While we had some good experiences with its performance, we found it very difficult to actually learn more details about it due to the lack of information on the website and non-responsiveness on the side of its customer support.",
    "This platform offers two types of accounts - subscriptions/flat rate and long-term accounts.",
    "The former are renewed on a regular basis and there are three of them - 10 GB at $9.51/month, 50 GB at $16.31/month, and flat rate at $27.19/month. The latter are valid for 2 years and aren’t renewed upon expiration. There are four long-term packages - 10 GB at $13.59, 20 GB at $21.75, 75 GB at $40.79, and 150 GB at $54.39.",
    "Although this might be enough for most users, some of the best VPN providers out there offer no limitations on traffic at all, which is why they may be a better option.",
    "There’s also a 2-day free trial that includes 0.1 GB (100 MB) and is enough to test the service’s capabilities. Accepted payment methods include credit/debit cards, PayPal, and bank wire transfer.",
    "Hideway is very basic, especially when compared to today’s market giants like ExpressVPN, NordVPN, Surfshark, Hotspot Shield, and other leading VPN providers.",
    "Not only do all of them have speedy and responsive customer support but also provide plenty of other advantages you won’t see with Hideway, such as access to popular streaming platforms and nicely designed native apps for all the major devices.",
    "Most importantly, they don’t limit the amount of VPN traffic you can use with their plans.",
    "One of the main reasons why many people turn to VPNs is to provide them with access to popular VOD platforms like BBC iPlayer or Netflix that may be unavailable in their regions. Unfortunately, Hideway isn’t one of them and if this is a deal-breaker for you, then you should divert your attention to the VPN providers that can unblock your desired content.",
    "This VPN service is run by the company Simon Consulting GMBH, headquartered in the city of Graz, Austria. Thanks to its location, your private information is protected by the General Data Protection Regulation (GDPR) legislation, at least if you’re in the EU.",
    "There’s only one VPN server at your disposal and it is located in Austria. Externally, all users appear under one identical IP address, but internally, each user is assigned an address from the “private” 10.0.0.0 network.",
    "Hideway’s website provides a handy VPN Check that allows you to see if your VPN connection is effective. The client area is very rudimentary, but it lets you check your account status, the duration of your package, as well as the amount of your used up upload and download traffic. It also enables you to easily renew your account or order a new one if the current is no longer active.",
    "According to the website, Hideway VPN can be used for all sorts of Internet applications, torrenting, P2P, and Emule included.",
    "If you’re using a Windows, Mac, iOS, or Linux device, the default protocol your connection will be protected with is OpenVPN. Alternatively, you can take advantage of the L2TP protocol that is pre-installed in most operating systems, and Hideway provides the secret shared key for this connection on its website. This protocol is primarily recommended for platforms that don’t support OpenVPN, as OpenVPN still provides the highest encryption level.",
    "The provider’s privacy policy is only available in German, but using Google Translate, we managed to decipher what it says about collecting your sensitive data while using its service - nothing.",
    "We are only told what information is collected when you’re visiting its website - the date and time of access, amount of data sent in bytes, source/reference from which you came to the website, browser and operating system used, as well as your IP address.",
    "The provider will also collect your personal details when you’re purchasing the service, but even then, you can choose to only use your email address. It will also collect your contact details when you’re reaching out to customer support.",
    "Hideway’s VPN service can be set up on Windows, iOS, Mac, and Linux devices with third-party OpenVPN software and instructions available on the website. It can also be enabled with the devices’ in-built VPN option and L2TP protocol.",
    "There is a very tiny FAQ section and a forum where you can ask questions, as well as read answers to previously asked questions.",
    "Although the website provides some information, it is ultimately not enough, which is why you’ll probably need to contact customer support via email or telephone if you need assistance with anything. If you’re using the email method, you may need to arm yourself with patience as we’re still waiting for the response to our query, three days on.",
    "Hideway is far from easy to use, but once you get the hang of the third-party software, things get smoother. We only had access to one server location - Vienna, Austria, so we tested its download speed on a 63Mbps testing connection. We were pleasantly surprised as it hailed a very fast 28.59Mbps.",
    "Hideway is an okay VPN option, with high speeds and a good selection of pricing plans but with a lot of limitations that make the industry leaders such as ExpressVPN a much more attractive option. These limitations are evident in its server network, missing native apps, lack of support for geo-blocked streaming content, and subpar customer support."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "12": "Privacy and encryption",
    "17": "Support",
    "20": "Speed and experience",
    "21": "Verdict"
  },
  "links": {
    "Hideway": "https://www.hideway.eu/vpn_server/english/",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Hotspot Shield": "https://www.techradar.com/reviews/hotspot-shield-vpn",
    "VPN Check": "https://www.hideway.eu/vpn_server/english/check_vpn/",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "privacy policy": "https://www.hideway.eu/menu.php/datenschutz.html",
    "instructions": "https://www.hideway.eu/menu.php/install.html",
    "FAQ section": "https://www.hideway.eu/vpn_server/english/faq/",
    "forum": "http://www.hideway.eu/forum/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-8784751218984508000"
  }
}