{
  "source": "https://www.techradar.com/reviews/seagate-ironwolf-510-ssd",
  "title": "Seagate IronWolf 510 SSD review",
  "category": "computing",
  "updated": "2021-09-08T08:50:39Z",
  "author": "mark-pickavance",
  "summary": "An SSD made for cache-hungry NAS",
  "verdict": "Extreme endurance separates this NVMe from those made for desktop use. But the lack of power loss support and a narrow market for these products has made the IronWolf 510 on the expensive side.",
  "pros": [
    "Impressive endurance",
    "2yr Rescue Data Recovery Services plan"
  ],
  "cons": [
    "Expensive",
    "Average write performance",
    "Power loss recovery isn't supported"
  ],
  "article": [
    "NAS equipment in general sets out with the premise of providing good performance in a compact and easy to manage package while doing this with very modestly specified hardware.",
    "This approach contrasts with typical server configurations that have massively powerful CPUs and gigabytes of RAM. These require constant monitoring, heat management and often substantially more physical space.",
    "One of the downsides the NAS approach is that if heavy demands are made on its resources, and during this time they can quickly become overwhelmed.",
    "In those circumstances, any means to accelerate drive operations is welcome, and the current trend is to mitigate the hammering that the file system takes using a cache.",
    "Many of the business-orientated NAS designs have the option to increase the installed RAM, but because the platforms that these machines use aren’t workstation PCs, they are often limited to 6GB or 8GB in size.",
    "A better and generally more cost-effective approach is to utilise SSD storage as an intermediate cache that sits between the system and the physical hard drives, providing a means to run the hard drives efficiently and maintain system performance in trying times.",
    "The latest generation of NAS boxes are replete with models that include M.2 slots for this purpose, and storage makers are now addressing this emerging market.",
    "First out of the gate is Seagate with the IronWolf 510, an M.2 NVMe SSD that can take the sting out of intense operations and enable the NAS to handle more simultaneous users.",
    "But this is an expensive choice, that needs to justify the purchase price.",
    "The Seagate IronWolf comes in four capacities; 240GB, 480GB, 960GB, and 1.92TB.",
    "NVMe NAS targeted technology isn’t cheap, which $119.99, $169.99, $319.99, and $539.99 respectively for those capacities well demonstrates.",
    "From a pure layman’s perspective, the Seagate IronWolf 510 looks like any other M.2 NVMe storage device. And indeed, it is possible to mount it on an NVMe supporting motherboard or daughtercard and use it in a PC like any other NVMe drive.",
    "The differences between this drive and a Seagate FireCuda 510, Samsung 970 EVO or WD Blue SN550 are internal, not just variances in the controller and NAND modules, but in the way that these drives are designed explicitly for NAS operations.",
    "That said, it still makes use of Phison NVMe SSD controller, DDR4 DRAM for caching, and TLC NAND flash as the critical components.",
    "But the special sauce here is that instead of using the typical Phison PS5012-E12 controller, this stick mounts the enterprise-class Phison PS5012-E12DC device.",
    "This 28nm controller has the capabilities to deliver up to 3200 MB/s in Sequential Reads, and 3200 MB/s in Sequential Writes, but also provide extended endurance, reduced latencies, and provide consistent performance on a variety of workloads.",
    "One reason often given why standard NVMe drives are unsuitable for NAS deployment, is that it has inherent power loss data protection.",
    "Having the power yanked while a file is partially written, leaving unresolved data packages in the cache, could easily result in the corruption of a NAS volume.",
    "The Phison PS5012-E12 controller was designed to handle that possibility, mounting additional circuitry to provide extra operational time to flush RAM and buffers, should the worst happen.",
    "However, when we asked Seagate about this point, they admitted that it isn’t utilised, unlike the previous Iron Wolf 110 design which has this feature.",
    "It should go without saying that running a mission-critical NAS without a UPS (uninterruptable power supply) is a risky enterprise even if it doesn’t use SSD caching. But don’t expect this IronWolf to help out if the NAS is suddenly disconnected.",
    "Another concern of server operations is a minor glitch that corrupts data as it moves through the system, and this platform is designed to handle those rare occurrences by providing a means of chaperoning the data as it travels from the host device to NAND flash.",
    "Most NVMe drives have a data correction scheme, but the parities testing in this device should effectively prevent soft errors.",
    "The other important feature of this drive is the controller's LDPC ECC engine has been tuned to enhance NAND endurance allowing the 240GB, 480GB, 960GB and 1.92TB to have TBW (Total Bytes Written) of 435TB, 875TB, 1,750TB and a whopping 3,500TB respectively.",
    "The IronWolf 510 brochure uses the acronym DWPD (drive writes per day) and declares that value to be 1.",
    "What that means is if you have the 960GB IronWolf 510 installed, it should be able to have 960GB pass through the cache drive every 24 hours and still achieve its five-year warranty.",
    "And the TBW numbers support that hypothesis.",
    "If you compare the endurance with typical desktop NVMe drives, where a 1TB drive might have a TBW of 600TB, the IronWolf 510 has a life expectancy of at least triple that value.",
    "This unit also comes with a 2-year Rescue Data Recovery Services plan. But being realistic, recovering data from a conventional file structure is one problem, but making sense of how a NAS operating system might utilise cache space on a drive and pulling out whole files seems an implausible exercise at best.",
    "We tested a 1.92TB using an AMD Ryzen test platform and synthetic benchmarks to access drive performance. We don’t have the time or facilities for testing the TBW of this device, so those numbers must be taken in good faith.",
    "Our immediate reaction to the synthetic benchmarks is that the read performance of this drive is acceptable, but the write speed is less than we were expecting.",
    "In trying to explain a write speed of less than 1000MB/s, this drive must maintain a scenario where power loss won’t be catastrophic. Therefore, the amount of write data in the RAM cache needs to be minimised while maintaining performance, a tricky proposition.",
    "We believe that Samsung found a way to negate this somewhat and improve the write performance to around 1,430 MB/s, but neither can offer the 3,000MB/s write performance of consumer drives.",
    "Both did better than Synology, as it can only manage 550MB’s writing on the SNV3400-400G.",
    "Although we haven’t officially tested the Samsung 983 DCT, it appears to have a distinct writing advantage over the IronWolf 510, but the Seagate drive offers better IOPS.",
    "How this might overall impact on performance when the drive is used exclusively for caching and not direct file access is debatable. But we suspect that for those using a NAS solely for file serving that the Samsung might be the better choice, where those using it for NAS installed applications might find the IronWolf 510 the cache of choice.",
    "When a NAS box is filled with physical hard drives, there are realistic limits to how fast it can read and write even with a perfectly designed RAID configuration. Typically, a hard drive will read and write at around 150MB/s, with a five drive RAID pack delivering around 400-450MB/s in total, or the equivalent of a single SATA connected SSD.",
    "It doesn’t take much mathematical prowess to realise that the IronWolf 510 with 3,000MB/s reads and 1,000MB/s writes aren’t exactly matched to the physical storage in that hypothetical configuration. Unless the drive pack composes of 10 or even 20 drives, the performance envelope is better aligned if the drives aren’t hard drives, but SATA SSDs.",
    "Maybe a couple of years from now 4TB SATA SSDs will be cheap, and NAS boxes will be awash with them, and the IronWolf 510 will make substantially more sense then.",
    "Alternatively, we’ll probably stop using SATA and mount M.2 SSDs in the new super-tiny NAS boxes and forget about caching storage operations entirely.",
    "Because of this somewhat predictable future, the window of opportunity for devices like the IronWolf 510 will be brief, and the next drive in this series will be most likely promoted as being for cache or storage.",
    "However, these future devices will still need a structure like the IronWolf 110 offers with inherent power failure mitigation, making it more likely that future designs might incorporate this in all NVMe storage and not just those specifically made for NAS use.",
    "Synology has two NAS designed NVMe drives, the SNV3400-400G and SNV3500-400G that both come in only 400GB capacities, and don’t compare well to the endurance or performance of the IronWolf 510. They also make the Seagate drive look slightly less expensive, with the SNV3400-400G typically costing $225 for 400GB, where the IronWolf 510 is $169.99 for 480GB of capacity.",
    "The only other major brand that has a NAS tuned NVMe drive is Samsung with its 983 DCT, built around the Samsung Phoenix controller. That comes in both 960GB and 1.92TB capacities, has a similar DWPD and costs $277 for the 960GB model.",
    "That price undercuts the IronWolf 510, but we have seen the 1TB model discounted to this level.",
    "Given the rock-bottom cost of NAND currently, due to a below-predicted consumption and improving production yields, the value of the IronWolf 510 is its biggest sticking point.",
    "It is much more than a consumer NVMe drive, though it is cheaper than the disturbingly expensive Synology SNV3000.",
    "While we’re impressed with some of the technology that Seagate put in the 510, there are still many caveats to using NVMe in NAS, not least those limitations put on them by the NAS makers.",
    "We’ve noted some, like Synology, don’t allow the NVMe storage to be used for anything other than caching, and others allow it to be both.",
    "Increasing the cache by adding a drive like the IronWolf 510 will only address some performance problems, not all.",
    "It is good at improving performance issues caused by large numbers of files in a single folder, numerous and frequently accessed small files. They’re also useful for NAS-based applications that involve databases and the manipulation of large data sets.",
    "Where they don’t help much is in some of the very time-consuming exercises that a NAS box can undertake, as a surface validation or rebuild. They also won’t make file transfers to connected host systems run any quicker, as the limit there is network bandwidth.",
    "Before you jump in with both feet and invest heavily, it might be worth considering if the performance problem will be addressed by one, or more, of these.",
    "The Seagate IronWolf 510 is an expensive solution from a noticeably shortlist of costly NAS SSDs and one that needs to be deployed with some planning if it is to be considered worthwhile.",
    "Note: It came to our attention after this review published that while the IronWolf 510 uses the Phison PS5012-E12DC controller with power loss support, this feature was not implemented on this specific product. And, the review has been adjusted to reflect this."
  ],
  "headers": {
    "9": "Price",
    "11": "Design",
    "29": "Performance",
    "36": "NAS and SSDs",
    "42": "Competitors",
    "45": "Final verdict"
  },
  "links": {}
}