{
  "source": "https://www.techradar.com/reviews/dameware-review",
  "title": "Dameware review",
  "category": "computing",
  "updated": "2020-05-13T10:47:49Z",
  "author": null,
  "summary": "Read our Dameware review to discover if this is the remote computer access tool for your business",
  "verdict": "Dameware Remote Everywhere boasts impressive security features, but it disappoints in its ease of use and performance: we experienced several crashes during testing.",
  "pros": [
    "High levels of security",
    "Fast connections"
  ],
  "cons": [
    "Expensive",
    "Sessions crashed frequently during testing"
  ],
  "article": [
    "In this Dameware review, we look at Dameware Remote Everywhere (DRE) by Solarwinds to determine whether it’s worthy of consideration as the best remote desktop software.",
    "DRE is a cloud-based software as a service (SaaS) solution aimed at IT professionals who need to provide remote support for a large number of computers and mobile devices, on a variety of operating systems.",
    "Dameware Remote Everywhere will appeal to those looking for a service that is fast and secure while providing detailed information about the devices it connects to.",
    "Dameware provides two different types of solutions: on-premises and SaaS. DRE is the SaaS solution, and to use the service, every technician must have a separate license. Each license is available for 500 endpoints, which essentially means devices.",
    "Prices get cheaper the more licenses you purchase, starting at $540/license for 1–5 technicians and going down to $400/license if you have more than 100 technicians. So, if you have five technicians, the cost would be $2700.",
    "With licenses costing several hundred dollars each, Dameware is a service aimed at businesses with large IT networks that need enterprise-level features. DRE can be used from anywhere that has an internet connection. And even though a technician might be a long way from the device that needs support, DRE can connect to it in less than eight seconds to help bring about a resolution to the problem as quickly as possible.",
    "A technician can be working on any computer running Windows, macOS, or Linux, and can connect to any desktop computer or mobile device, Android or iOS. In addition, they can access the end user’s machine without needing to disturb them, working behind the scenes to resolve the reported problem.",
    "The first step in getting started with DRE is to register for an account. You don’t need to enter any billing information, but you will need to supply company information, including email and phone. Once registered, you’ll receive an email with a link to create a login, after which you’ll be logged into the online dashboard.",
    "DRE is available as a free trial for 14 days fully functional, but when you first log in, you’ll be presented with a notice to extend that trial to 90 days. From that point, you’re ready to start using the service, with the whole setup process only taking a couple of minutes.",
    "While the setup process only took a few minutes, moving on from there wasn’t as easy as we would have liked. Initially, we wanted to test connecting remotely to an Android phone.",
    "It wasn’t immediately obvious how to do that from the dashboard we’d just logged into, so we went hunting for some documentation. Once we’d found it, we found it a bit lacking in the information we needed.",
    "Eventually, we were able to connect to a test phone after downloading an app and entering a PIN number which is generated from the console on the technician’s workstation. The connection was quick and the resolution was OK but not as good as we thought it might be from the way it’s described on the Dameware website.",
    "Being able to browse the local workstation’s drives and copy files to the remote device was good and worked with no problem. But we found that the session crashed when clicking on Processes or Applications under the System Info tab. We’d then have to quit the app on the phone and restart it and re-enter the PIN number to continue.",
    "Dameware features a very high level of security, meeting requirements set out by the U.S. Federal government. It is compliant with Federal Information Processing Standards (FIPS) 140-2, using the BSAFE Crypto-C Micro Edition cryptography module.",
    "Dameware was also the first remote access software product to offer a Smart Card solution, which was developed in 2006 in coordination with the U.S Army. Since then, smart card authentication has become mandated at all levels of the Federal government.",
    "Smart card authentication is the process that allows access to a remote machine by first logging into a local machine with a smart card and personal identification number (PIN).",
    "For a product that is all about providing technical support for others, Dameware’s support options are a bit limited. There are no 24/7 phone numbers or live chat available. You can submit a support ticket or email technical support directly.",
    "You can also call one of their technical support lines in the US, Europe, or Asia Pacific, but they’re only available during normal business hours. Dameware actually has offices in 12 different locations, but many of those only handle sales inquiries.",
    "For the price you pay per license, we were disappointed in DRE. Getting set up took longer than we would have liked, and the documentation wasn’t up to the sort of standard we’d expect from a service charging this much.",
    "The software itself was fine when it worked, but there were numerous crashes when trying to access sections with important information about the remote device. We contacted Dameware support during the setup phase and the resolution of our query took several days, and only after a follow-up email from us.",
    "A strong alternative to DRE is Zoho Assist, which has two different types of remote support software: Remote Support and Unattended Access.",
    "Remote Support works in much the same way as DRE and comes in three different plans starting at $8/month and going up to $21/month. More expensive plans include more features and more simultaneous sessions, which compares to a single active session for every DRE license.",
    "Zoho Assist might not be as secure as DRE, but it will appeal to those with more limited budgets, and for those organizations that may already be using one of the suite of Zoho products."
  ],
  "headers": {
    "3": "Dameware: Plans and pricing",
    "5": "Dameware: Features and utilities",
    "7": "Dameware: Setup",
    "9": "Dameware: Interface and performance",
    "13": "Dameware: Security",
    "16": "Dameware: Support",
    "18": "Dameware: Final verdict",
    "20": "Dameware: The competition"
  },
  "links": {
    "Dameware": "https://www.dameware.com/",
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "Zoho Assist": "https://www.techradar.com/reviews/zoho-assist"
  }
}