{
  "source": "https://www.techradar.com/reviews/zoho-desk",
  "title": "Zoho Desk review",
  "category": "computing",
  "updated": "2020-10-22T04:06:20Z",
  "author": "mark-pickavance",
  "summary": "Competitively priced helpdesk software packed with features",
  "verdict": "Zoho Desk isn’t short on features, and high-end plans are reasonably priced, but we didn’t find it easy to use, and there is only limited free support.",
  "pros": [
    "Loads of features",
    "Integrates with other Zoho apps",
    "Cheap per agent"
  ],
  "cons": [
    "User interface needs work",
    "Paid support levels"
  ],
  "article": [
    "Zoho Desk is a customer service SAAS product that bills itself as the first “context-aware” solution in the industry. That means that every interaction with a customer is guided by a range of information that Zoho has about them, including their history and past issues and activities—anything that will help an agent understand the issue more quickly, which in turn brings about a quicker resolution.",
    "In this Zoho Desk review, we’ll cover Zoho’s approach to helpdesk ticket management as we take a closer look at its pricing, features, support, and ease of use.",
    "Like many helpdesk software providers, Zoho Desk comes in a range of plans starting with a free option that can be used by up to three agents. Paid plans start at $12/agent/month for the Standard plan and go up to $35/agent/month for the Enterprise plan. The paid plans have no limits on the number of agents and come with a 15-day free trial.",
    "As you move through the plans, each new level adds more features to those already offered by the previous one, and by the time you get to the Enterprise plan, more than 200 features are included.",
    "The Enterprise plan clearly boasts an impressive feature list, but even the free plan comes with features that make it worthwhile considering. These include the multilingual email ticketing and customer management system which is at the core of the software, a help center with a private knowledge base, macros for executing repetitive tasks automatically, mobile apps, and 24/5 email support.",
    "Zoho Desk’s ticket management system is multichannel meaning that email, phone, social media, and live chat can all be used for customer support interactions. Tickets are automatically organized, and a number of handy tools exist to increase ticketing efficiency, and by extension, agent productivity.",
    "Zoho Desk also has an artificial intelligence feature called Zia that can speak to your customers and share relevant knowledgebase articles with them, automatically tag tickets, alert agents to unusual activity, and be trained to carry out actions specific to your business.",
    "When you first log in to your Zoho Desk dashboard, you’re presented with a list of your tickets. The other main tabs in the dashboard are for knowledge base articles and customers.",
    "Similarly to many online helpdesk apps, Zoho Desk provides you with a lot of control over what can be edited for each ticket – for example, status, owner, priority, classifications, and channel. You can also view a ticket’s activity history and apply various actions to it.",
    "At the bottom of the window when viewing a ticket is a button for Apply Macro. However, when you click on it, it says “macros aren’t created yet,” and there’s no indication as to how to create one. Other helpdesk software apps we’ve looked at have a default set of macros included, and you can add others if you need ones specific to your business.",
    "The lack of help with the macros is just one example of how Zoho Desk doesn’t feel as intuitive as other helpdesk solutions we’ve looked at. There are many different links and buttons scattered all over the dashboard, and it feels a bit overwhelming to find your way around. Some of the links and buttons are also tiny and thus difficult to read.",
    "Zoho Desk is a bit different from other helpdesk software providers in that it provides different levels of support. There are three tiers, with the first being free and the other two costing either 20% or 25% of your license fee.",
    "The free option only offers live chat and toll-free phone support during business hours, while the others offer those options for 24 hours. The Enterprise plan is available seven days a week as opposed to the five days for the Premium plan.",
    "The two paid plans introduce remote and configuration assistance and product onboarding. Meanwhile, the Enterprise plan gives you your own account manager, along with a quarterly report on your usage of features, with suggestions on how to optimize your business processes.",
    "Zoho, the company behind Zoho Desk, produces many different software products and takes the same high-level approach to security for all of them. There are a whole range of security procedures, including background checks and security awareness programs for employees; restricted access to data centers with constant monitoring in place; firewalls, network redundancy, and DDoS prevention to maintain infrastructure security; and the use of strong encryption for all customer data transfers.",
    "If you like to shop around before deciding on a purchase, there are plenty of alternatives in the online helpdesk space for you to consider, including Freshdesk and Zendesk.",
    "Freshdesk is another solution offering a large range of features. There are a selection of plans, including a free option that can be used by unlimited agents. Its paid plans range in price from $15/agent/month up to $99/agent/month, and all plans come with a 21-day free trial.",
    "LiveAgent is another option with a free plan that has no limit on agents, while paid plans go from $15/agent/month up to $39/agent/month. Like Zoho Desk and Freshdesk, as you move up through the plans, more features are added to those available from the previous level.",
    "Zoho Desk has competitive pricing, with its high-end plans cheaper than those of many competitors. However, its free plan has a small limit on the number of agents and you have to pay to get better levels of support.",
    "The software’s feature set is impressive but we found the app itself a bit overwhelming to use and lacking in tips or guides on how to make the most of it."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "7": "Interface and in use",
    "11": "Support",
    "14": "Security",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Zoho Desk": "https://www.zoho.com/desk/",
    "helpdesk": "https://www.techradar.com/best/best-helpdesk-software",
    "Zendesk": "https://www.techradar.com/reviews/zendesk",
    "Freshdesk": "https://www.techradar.com/reviews/freshdesk-crm-review",
    "LiveAgent": "https://www.techradar.com/reviews/liveagent"
  }
}