{
  "source": "https://www.techradar.com/reviews/honor-9a",
  "title": "Honor 9A review",
  "category": "phones",
  "updated": "2020-07-30T05:00:46Z",
  "author": "ian-stokes",
  "summary": "Honor’s latest budget phone has great specs, but lacks apps",
  "verdict": "If you’re just looking at the Honor 9A from a hardware perspective, it offers phenomenal value. For £160 you get a multi-lens camera, fingerprint scanner, and long-lasting battery. But without Google Services, it’s a tough sell.",
  "pros": [
    "Super cheap",
    "Does everything you need from a smartphone",
    "Good camera for the price"
  ],
  "cons": [
    "No Google Mobile Services",
    "No fast charging",
    "It's a fingerprint magnet"
  ],
  "article": [
    "The Honor 9A is the latest in a long line of budget smartphones from Honor, and on a pure hardware front it’s quite possibly the best budget smartphone the company has ever made. For around £160 (roughly $205 / AU$290) you get a triple-lens camera, a long-lasting battery, and a 720p+ screen.",
    "The Honor 9A even features some extras that we wouldn’t expect to see on such an affordable handset, including a fingerprint scanner and facial recognition for quick and secure unlocking. So, what’s the catch?",
    "Well, you get what you pay for and costs have to be cut somewhere, so the Honor 9A doesn’t look or feel all that flashy. It has a plastic back with a strange reflective rear panel which looks more tacky than high-tech.",
    "The triple-lens camera array is very impressive for the price though, especially when you consider that Apple’s budget option, the iPhone SE (2020), is over twice the price and only comes with a single rear camera.",
    "It’s not just specs either - the Honor 9A snaps nice photos. There’s no telephoto lens though, so zooming in results in blurry images. The 8MP selfie camera was a nice surprise too, taking great pictures of our disheveled lockdown look.",
    "The core specs meanwhile are comparable to other budget entries like the Samsung Galaxy A11 (which hasn’t made it to the UK yet). You get a serviceable octa-core chipset, 3GB of RAM, and 64GB of storage. It won’t light your world on fire, but it can handle video streaming, apps, and even some light gaming.",
    "The battery life is a particular highlight, with the 5,000mAh cell lasting for a couple of days of moderate use. There’s no fast charging though, and it charges via micro USB rather than the more modern USB-C.",
    "But… and you all knew it was coming, there’s a catch. Honor is owned by Huawei, which is currently persona non grata with the US government. As a result, new Honor phones can’t use Google Mobile Services, and so the Honor 9A doesn’t have access to the Google Play Store.",
    "That means far fewer apps are easily accessible than on most phones, and that’s a death knell for a smartphone, no matter the hardware. It still runs Android, so the UI is familiar at least, but the main available app store is a barren wasteland of knock-offs. We love the Honor 9A as a handset, but without access to the Google Play Store, it’s almost impossible to recommend over something like a Samsung Galaxy A21 or even the more pricey iPhone SE (2020).",
    "The Honor 9A launched on July 1 in the UK with an RRP of £159.99 (roughly $205 / AU$290), but it basically launched on sale, so you’re only going to pay £129.99 if you’re picking one up at the time of writing.",
    "The Honor 9A won’t be coming to the US due to the current battle between Huawei/Honor and the US government. We’re also not expecting to see the Honor 9A launch in Australia.",
    "At the current price of £129.99, the Honor 9A comes in significantly cheaper than the Honor 9X Pro, Honor’s previous release which was aimed more at the mid-range market. It also undercuts Samsung’s rival smartphone, the Samsung Galaxy A21s, which has an RRP of £179.99.",
    "As we’d expect with a smartphone that only costs £160, there are plenty of cost-saving measures that have been taken with the Honor 9A’s design, but it still feels like a well-built piece of kit. The front screen is glass, while the back is covered with a plastic shell.",
    "On the size front, the Honor 9A measures in at 159.1 x 74.1 x 9mm and weighs 185g. For reference, that’s ever so slightly smaller and heavier than the Samsung Galaxy A11, which is probably the Honor 9A’s main competitor.",
    "The Honor 9A comes in three color options - Midnight Black, Ice Green, and Phantom Blue. The handset we had in for review was the Phantom Blue option, which is a metallic cyan color.",
    "It’s not quite as fancy as the pearlescent purple option that Honor had on the Honor 9X Pro, but it doesn’t look too bad… until you get your grubby fingers on it anyway. We found this reflective surface to be an absolute magnet for dust and fingerprints once we started using it.",
    "The selfie camera is now in a notch at the top center of the screen. Fans of previous Honor phones might be sad to see the adorable pop-up selfie camera go, but with advancements in technology it was inevitable.",
    "There is a fingerprint scanner on the back of the handset, just to the side of the camera array. In testing we found this to be an ideal location, as it’s basically where your finger would rest when holding the phone naturally. Setup was easy and we found it reliably unlocked for us, whilst keeping others out.",
    "On the right side of the handset you’ll find the lock and volume controls, while on the bottom of the phone you’ll find an absolute rarity these days - a headphone jack. The Honor 9A even comes with a pair of wired headphones, though they’re nothing to write home about.",
    "Without headphones, you get a single speaker at the bottom of the handset, which results in sound coming from only one side if you’re watching videos with the screen held horizontally.",
    "The Honor 9A has a 6.3-inch LCD display with a resolution of 720 x 1600. The screen has an aspect ratio of 20:9 and an 88.4% screen-to-body ratio thanks to the relatively small bezels around the edge of the screen - it’s not quite the edge-less display that we see in flagship smartphones, but the black borders here are small and unobtrusive.",
    "The aspect ratio is in line with basically all current smartphones, maximizing screen size while ensuring the device is comfortable and easy to use. We had no issues reaching the far corners of the touchscreen when using the Honor 9A.",
    "The screen is obviously lower quality than you’ll find with more high-end smartphones which have 1080p or even QHD AMOLED displays, but we found that the 720p+ display here is more than adequate for watching YouTube videos (via the website, since there is no YouTube app, of course). It also looks fine when scrolling through web pages or between apps.",
    "Despite the lower resolution, we found the Honor 9A’s screen had vibrant colors and it was able to compete with even our OnePlus 8 in terms of brightness. Honestly, for the price you're paying, this isn’t a bad little screen at all.",
    "There are also a range of display options including an eye comfort mode that can automatically switch the screen to a warmer tone, filtering out blue light to help you sleep. You can have this mode on all the time, or schedule it on a timer to come on during the evenings. There’s an ebook mode too, which shifts the color balance into a warmer spectrum to make reading less of a strain.",
    "When you’re looking at budget smartphones, the camera is almost always the first thing on the chopping block when companies are looking to save costs. That’s still true with the Honor 9A, and you’re certainly not going to get anything that competes with flagship models, but we’re still impressed with the camera array in the Honor 9A.",
    "With the Honor 9A you get a triple-lens rear camera array, headlined by a 13MP f/1.8 main lens. In the supporting roles there is also a 5MP f/2.0 ultra-wide and a 2MP f/2.4 depth sensor.",
    "This is basically identical to the camera setup in the similarly priced Samsung Galaxy A11. It’s still great value though, especially when you consider that the iPhone SE (2020) comes with a single 12MP lens and it costs more than twice the price of the Honor 9A.",
    "Of course, the raw numbers don’t tell the whole story, so how does the camera on the Honor 9A stack up? Honestly, pretty well. The standard 13MP camera is great for snapping everyday pictures, and we managed to get some good-looking pictures without needing to mess around with the Pro settings. Likewise, the ultra-wide lens does an admirable job, too.",
    "There is no telephoto lens though, so you’re stuck with 4x digital zoom and, honestly, we’d just leave that slider well alone or you’re going to end up with a grainy mess of a photo.",
    "If you’re looking to capture video, the Honor 9A can record at up to 1080p resolution at 30 frames per second. This isn’t exactly a blistering pace, but it’s fine for capturing basic videos. There are no fancy extra features though, so no slow-mo recording or motion stabilization. As a result, we found video recordings suffered from pretty severe blurring during movement.",
    "On the front side there's an 8MP selfie camera, though we’re sad to say that the pop-up selfie cameras found on the likes of the Honor 9X aren't present here. Instead, the selfie camera is embedded in a notch in the top center of the screen. Still, it snapped good-quality photos.",
    "The selfie camera can also be used for facial recognition, letting you unlock the phone simply by giving it a steely glare. We found this worked reliably and didn’t let random people unlock the device.",
    "The Honor 9A is running on an octa-core Cortex-A53 chipset (the MediaTek MT6762R Helio P22) which is a low-to-mid range chipset. Alongside this you get 3GB of RAM, and a reasonable 64GB of storage.",
    "The phone runs on Android 10, with Honor’s proprietary Magic UI 3.1 overlaid on top. Since Honor is owned by Huawei, which is currently engaged in a bitter feud with the US government, the Honor 9A does not have Google Mobile Services.",
    "This means no Google Maps and, more importantly, no Google Play Store. This means the selection of apps available on the Honor 9A is extremely limited.",
    "You can’t get Facebook, Twitter, Spotify, WhatsApp, or a number of other key apps from Huawei AppGallery (the replacement store on the phone). In all honesty, this is a crippling blow for the phone and basically leaves it dead in the water, in the UK at least.",
    "We should mention that you can manually install Google Mobile Services onto the Honor 9A if you know how, but neither Honor nor Google recommends this (and neither can we).",
    "In practice, we found that the Honor 9A runs smoothly and can handle most day to day operations like streaming videos and running apps, but it’s not built for gaming. You’ll get away with some smaller games, but things on the level of PUBG and Fortnite are well outside of its capabilities.",
    "We were unable to run our standard Geekbench 5 benchmarking software on the Honor 9A as it's not readily available in the company's App Gallery. That means we're not able to provide anymore details on exact stats of the power behind this phone.",
    "The Honor 9A has a whopping 5,000mAh battery, which is bigger than the batteries in most of the best smartphones on the market, never mind other budget options. The Moto G8 Power has the same size battery, but even that costs more.",
    "That 5,000mAh battery means that you’ll easily be able to get through an entire day without needing to charge your phone, even with pretty rigorous use. In practice, we found that the Honor 9A could easily go a couple of days before it needs to be charged with moderate usage.",
    "The stats that Honor put out from its own testing lab claim that you can get 65 hours of calls, 32 hours of video playback, and 36 hours of 4G calls out of a fully charged battery. While we didn’t sit and watch 32 straight hours of YouTube to test that claim, we can say that our experience matched up with these numbers - we didn’t manage to drain the battery below 50% even during days of heavy usage.",
    "The Honor 9A does not support wireless charging or fast charging though. This means that when your Honor 9A does eventually run out of battery, it’s going to take a while to recharge it back up to full.",
    "One nifty trick that we’re pleasantly surprised to see is reverse charging via an OTG cable, which means you can charge other gadgets and smartphones from the Honor 9A’s battery. Considering the chunky battery in the Honor 9A, we love this addition as you can recharge your smartwatch on the go while still having plenty of life in your smartphone.",
    "First reviewed: July 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Honor 9A price and release date",
    "12": "Design",
    "20": "Display",
    "25": "Camera",
    "33": "Specs and performance",
    "40": "Battery life",
    "45": "Don't buy it if..."
  },
  "links": {
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "Honor phones can’t use Google Mobile Services": "https://www.techradar.com/news/huawei-ban",
    "Honor 9X Pro": "https://www.techradar.com/reviews/honor-9x-pro-review-uae",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Honor 9X": "https://www.techradar.com/reviews/honor-9x-review",
    "Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power"
  }
}