{
  "source": "https://www.techradar.com/reviews/asus-rog-zephyrus-s-gx701",
  "title": "Asus ROG Zephyrus S GX701 review",
  "category": "computing",
  "updated": "2020-03-13T10:59:52Z",
  "author": "matt-hanson",
  "summary": "Slim, light and packed with power",
  "verdict": "The Asus ROG Zephyrus S GX701 is one of the best gaming laptops ever made, but the high level of performance and gorgeous thin and light design comes at a very high price, which makes it unaffordable for many people.",
  "pros": [
    "Brilliant performance",
    "Gorgeous design",
    "Easy to carry",
    "Fantastic 17-inch screen"
  ],
  "cons": [
    "Very expensive",
    "Short battery life",
    "No LAN port"
  ],
  "article": [
    "The Asus ROG Zephyrus S GX701 really made a great first impression when it was showcased at CES 2019. That’s saying a lot, considering that Asus showed off a number of impressive Asus laptops at that same event. Though this isn’t surprising as the Zephyrus line has long proven that light and thin laptops can just be as powerful as the big and bulky gaming laptops.",
    "This latest addition doesn’t fall far from the tree, packing the very latest gaming hardware in its slim and light design. This laptop is armed with Nvidia GeForce RTX graphics with the Max-Q design along with an 8th generation Intel Core i7-8750H six-core processor with a turbo clock speed of 4.1GHz and up to 24GB of RAM. It’s also configurable up to an RTX 2080 with 8GB of GDDR6 VRAM.",
    "The result is a powerful gaming machine that’s incidentally one of the best Asus laptops we've had the pleasure of testing. Unsurprisingly, the Asus ROG Zephyrus S GX701 also comes with the steep price so many laptops with a svelte design and powerful internals have. But, if thin and powerful are a top priority for you, this gaming notebook won’t disappoint.",
    "As with previous Zephyrus gaming laptops, the Asus ROG Zephyrus S GX701 is not a cheap device. With this level of performance combined with such a slim design, the high price tag of the Asus ROG Zephyrus S GX701 shouldn’t come as much of a surprise, but there’s no denying that this is a gaming laptop that’s aimed at enthusiasts with deep pockets.",
    "The price of the Asus ROG Zephyrus S GX701 starts at $3,299.99 (£3,299.99, about AU$4,600 ), and this will net you a model with an Nvidia GeForce RTX 2080 graphics card, Intel Core i7-8750H processor, 16GB of RAM, 1TB SSD and a 17.3-inch 1080p display with Nvidia G-Sync.",
    "There should be other models with different graphics cards, which will lower the price, and there’s the ability to configure it with more RAM, which will add to the price. We’re following up with Asus to find exact prices for these different models. Don’t hold out any hope on them being radically cheaper, though.",
    "The Asus ROG Zephyrus S GX701 is available to pre-order now in the US and UK, with delivery estimates of April 2019. Again, we’re chasing up with Asus about Australian availability, but at the time of writing, you’re not able to pre-order it in Australia through the Asus store.",
    "This hefty price tag makes it one of the most expensive gaming laptops on the market, though we expect other RTX-toting laptops to be similarly pricey when they emerge from other manufacturers.",
    "As we mentioned earlier, Asus’s range of Zephyrus gaming laptops have been designed to be as thin and light as possible, which makes their bigger, bulkier competitors look positively dated by comparison.",
    "This has continued with the Asus ROG Zephyrus S GX701, which Asus claims is the most compact 17-inch gaming laptop ever made. The idea is that the Asus ROG Zephyrus S GX701 comes with a 17-inch display, yet its body dimensions are more akin to those found on a 15-inch laptop. With dimensions of 399 x 272 x 18.7mm, it’s around 23% smaller and 40% thinner than average 17-inch gaming laptops.",
    "In comparison with the Asus ROG Zephyrus GX501, which is an older generation Zephyrus laptop with a 15.6-inch screen, the Zephyrus S GX701’s dimensions are only slightly larger – which is impressive considering the larger screen.",
    "This smaller size and larger screen is made possible mainly thanks to the incredibly narrow bezels that surround the screen. At just 6.9mm thick, the top and side bezels allow for an 81% screen-to-body ratio, which means there’s very little wasted space.",
    "To achieve such a small top bezel, Asus no longer includes a built-in webcam above the screen. For many people this will seem like a worthwhile trade-off for such a slimline device. However, if you use a webcam often – for video calls or broadcasting on Twitch, for example – then Asus has come up with a rather elegant solution by including a slimline external webcam that can clip onto the Asus ROG Zephyrus S GX701 (or placed elsewhere), and can fold to just 17mm thin when not in use.",
    "Not only does this allow the Asus ROG Zephyrus S GX701 to be a slimmer device, but it means Asus can pack more tech into the webcam than you’d find in an integrated camera, and it’s capable of recording 1080p footage at 60 frames per second.",
    "As with previous Zephyrus laptops, the keyboard is at the front the laptop’s body, which is usually where the trackpad would go on other laptops. This leaves a big space at the rear of the keyboard that looks a little odd if this is your first Zephyrus.",
    "However, this space is used by the Zephyrus S GX701’s ROG Active Aerodynamic System (AAS), which helps keep the powerful components cool despite the laptop’s thin design. Beneath the surface there are a number of heatsinks and pipes that push out hot air and bring in cool air, along with two large fans. To help with the airflow, when you open up the Asus ROG Zephyrus S GX701, the rear of the laptop lifts up from the surface it’s on. It’s an elegant and effective way of keeping the laptop cool.",
    "Because the keyboard is right at the front of the laptop it means the trackpad can’t go in its traditional spot below it. Instead, Asus have placed it on the right-hand side of keyboard, where you’d expect to find a number pad on a traditional keyboard. It doesn’t take too long to get used to this new placement for the touchpad, and for gaming you’re likely to use a proper mouse.",
    "The keyboard itself is fine, with large keys and Asus’s Aura RGB lighting. The travel of the keys is very shallow, however, due to the thinness of the laptop. Again, most people will find this a worthwhile trade for the thin design, but it does mean the keyboard isn’t as satisfying to use as a mechanical keyboard – which many of the Asus ROG Zephyrus S GX701’s competitors now include.",
    "A new addition to the Asus ROG Zephyrus S GX701 is a small scroll wheel at the top of the keyboard that can be used to change the volume. It’s a nice touch, and it’s also highlighted by the RGB LEDs of the laptop.",
    "Sound is handled by two speakers on either side of the laptop that are powered by \"smart amplifier tech,\" according to Asus, which means the Asus ROG Zephyrus S GX701 is capable of much fuller sound than the tinny speakers that are often built into laptops.",
    "Again, according to Asus, this allows the speakers of the GX701 to handle 2.5x the volume, 1.6x the bass and 1.5x the dynamic range. The speakers are also capable of virtual 7.1 surround sound, which should hopefully mean they’ll provide a more immersive experience while playing. We’ll be giving the Asus ROG Zephyrus S GX701 a proper test of its audio capabilities later on.",
    "Port-wise, the Asus ROG Zephyrus S GX701 comes with a good selection. On the left-hand side is the power connection, a HDMI 2.0b port, a standard USB 3.1 port, a USB 3.1 Type-C port with DisplayPort 1.4 and power delivery and a 3.5mm audio jack.",
    "On the right-hand side is a USB 3.1 Type-C and two standard USB 3.1 ports. Interestingly, while the Asus ROG Zephyrus S GX701 has a standard DC charger, it can also have power supplied by USB-C. Plugging the Asus ROG Zephyrus S GX701 into a USB-C charger (or power pack) doesn’t charge the Asus ROG Zephyrus S GX701 – as it won’t supply enough power for the GX701’s hungry internals – but it stops the Asus ROG Zephyrus S GX701’s battery from depleting. It’s a nice feature that means if you find yourself without the GX701’s DC charger, if you can get your hands on a generic USB-C charger, you can at least still use the laptop.",
    "You can also use the Asus ROG Zephyrus S GX701 to charge up USB-C devices such as smartphones. Again, this is a nice touch, but considering how scarce battery life can be on gaming laptops, you might not want another device leeching any precious power.",
    "So, it’s a good spread of ports, though there’s a notable omission: Ethernet LAN. While most people are perfectly happy with wireless networking on their laptops, when it comes to gaming it can be essential to have a wired connection to ensure a fast and stable experience.",
    "The lack of an Ethernet port is disappointing, then, and we’d have liked to have at least seen a USB-C to Ethernet adapter thrown in, considering the price and importance of wired networking for a gaming laptop.",
    "While the components that power games are the most important considerations when buying a gaming laptop like the Asus ROG Zephyrus S GX701, the quality of the screen is a close second. After all, if the gaming laptop doesn’t have a screen that can do justice to the graphics of a game, then you could be paying for hardware you’re not making the most of.",
    "The good news is that Asus has obviously put a lot of care and attention into the screen. As we mentioned earlier, this is a 17-inch display, which for a gaming laptop is pretty large, and it comes with a 144Hz refresh rate, which means games feel smooth and fluid, while the G-Sync technology means there’s no screen tearing either.",
    "Response times are 3ms, which is very good, and there’s no perceptible lag between you controlling a game and it appearing on the screen, and there’s no distracting blurring during fast-paced action either.",
    "The display is also factory calibrated, and it’s Pantone Validated with 100% sRGB color gamut. Essentially, this means the display looks fantastic right out the box, but it also means that the Asus ROG Zephyrus S GX701 is a viable laptop for digital creatives, such as photographers and video editors, where color accuracy is of the utmost importance. With the power behind the Asus ROG Zephyrus S GX701, it makes for a formidable workstation.",
    "The 1080p resolution is fine for a 17-inch screen, but it means that even with the most recent games, the RTX 2080 isn’t particularly taxed. Of course, that means that the Asus ROG Zephyrus S GX701 will be future-proof for many, many years, and if you want to give the RTX 2080 a real workout, you can hook it up to an external 4K monitor or TV to see what the GPU is really capable of.",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "26": "Display"
  },
  "links": {
    "CES 2019": "https://www.techradar.com/news/asus-announces-rog-zephyrus-s-gx701-an-ultra-thin-gaming-laptop-with-nvidia-geforce-rtx-graphics",
    "Asus laptops": "https://www.techradar.com/news/best-asus-laptops",
    "best Asus laptops": "https://www.techradar.com/news/best-asus-laptops",
    "Asus ROG Zephyrus GX501": "https://www.techradar.com/reviews/asus-rog-zephyrus"
  }
}