{
  "source": "https://www.techradar.com/reviews/dualshock-4-back-button-attachment-review",
  "title": "DualShock 4 Back Button Attachment review",
  "category": "gaming",
  "updated": "2020-02-19T18:44:43Z",
  "author": "vic-hood",
  "summary": "Is the DualShock 4's optional upgrade worth it?",
  "verdict": "The DualShock 4 Back Button Attachment is great for those who want the option to add two extra mappable buttons to their PS4 controller without having to shell out for a new - and likely more expensive - gamepad. It's easy to program but, due to the DualShock 4's sleek design, can feel feel a bit clunky at times.",
  "pros": [
    "Affordable",
    "Quick and easy to program",
    "Headset integration"
  ],
  "cons": [
    "Can feel clunky",
    "Can't map to all buttons"
  ],
  "article": [
    "The DualShock 4 Back Button Attachment is Sony's take on a Pro PS4 controller. But, rather than asking players to shell out for another, more expensive gamepad, the company has instead created an accessory that simply plugs into your existing DualShock 4 controller - adding two additional mappable buttons.",
    "These buttons allow for more control over customization, letting you program each button respectively to a variety of gamepad inputs. This level of customization may not be needed by everyone, but it's a welcome option for those who enjoy more competitive play.",
    "And what's more, it's not as expensive as buying a special pro controller, with the accessory priced at $30 /£26/ AU$50. It's not exactly cheap but it's certainly a more affordable option than the likes of Microsoft's Xbox Elite Wireless Controller Series 2.",
    "So, is the DualShock 4 Back Button Attachment worth your hard-earned cash? Let's weigh up the pros and cons of Sony's PS4 controller upgrade.",
    "The DualShock 4 Back Button Attachment comes in a small box with just the device itself and a hefty instruction booklet. The attachment doesn't require any software to work, you simply need to plug it into the audio jack port/external port at the bottom of your controller, and away you go.",
    "The attachment doesn't actually look like much at first glance, it's essentially two paddles attached to a black, circle LED screen with an audio jack and external jack to plug into the DualShock 4. There's also a 3.5mm audio jack port on the bottom of the attachment so you can still plug in your own gaming headset.",
    "The attachment is roughly three inches wide and under two inches tall, so it's pretty dainty individually.",
    "Once plugged into the bottom of the controller, the paddles should sit neatly and (fairly comfortably) in the curves of the back of the controller's legs, with the LED screen sitting in the middle.",
    "Holding a controller with the attachment takes some getting used to. It can feel bulky and almost alien attached to the DualShock's light frame, especially for those who admire the PS4 controller for its sleek design.",
    "As someone with quite small hands, it felt uncomfortable to hold, and we often found ourselves accidentally hitting the buttons when we were simply trying to rest our fingers on the back of the controller.",
    "However, the rear buttons are ergonomic so they should really be more comfortable. Having tested the controller with various members of staff in the TechRadar office we found that, for those with bigger hands, it was actually more comfortable. It really depends on if you prefer sleek or weighty, but it's also an expected trade-off if you're adding extra buttons to a controller. It is likely that the addition will be preferential for those who like the bulky weight of the Xbox One controller.",
    "The attachment requires the controller to be connected to a PS4 to work, or at least charging, otherwise it pretty quickly turns itself off.",
    "To turn the screen on (and therefore the device), you press and hold the screen until the PlayStation buttons symbol appears. The screen will then show a button symbol on the left, a 'P1', 'P2' or 'P3' in a circle in the middle and then another button symbol on the right.",
    "The attachment can save up to three custom profiles at a time, and the 'P1' etc corresponds to which profile you're currently using. To switch between profiles, you simply double click the LED screen. You can then program that profile's buttons by press and holding down the screen, on the applicable profile, until the 'P' flashes.",
    "There are sixteen possible button input options for each rear button and, once the 'P' is flashing you can click the respective button to cycle through the options. Once you've picked the ones you want then you simply click the LED screen again to lock it in. It's surprisingly quick and easy to do, and allows you to easily change configuration during your game with minimum disruption.",
    "You can't map the buttons to all the DualShock 4's buttons, but there's still enough that it shouldn't be a huge problem. The programming also takes immediately, and works an absolute treat with the rear buttons giving a satisfying click as they're pressed.",
    "The PS4 Back Button Attachment is a fantastic accessory for those who want more control over customization when it comes to their PS4 controller.",
    "It's quick and easy to use, without the need to faff around with extra software. And, even better, it allows you to upgrade your current DualShock 4 controller for an affordable price, removing the need to splash out on an expensive Pro gamepad.",
    "However, depending on how weighty you like your controller to feel, it can either be super comfortable or a bit clunky. But, given that it adds an extra two mappable buttons, it's actually pretty light compared to other controllers in the same vein."
  ],
  "headers": {
    "4": "Design",
    "11": "Performance",
    "16": "Verdict"
  },
  "links": {
    "DualShock 4 controller": "https://www.techradar.com/reviews/gaming/games-consoles/controllers/dualshock-4-controller-1157615/review",
    "Microsoft's Xbox Elite Wireless Controller Series 2": "https://www.techradar.com/reviews/xbox-elite-wireless-controller-series-2-review"
  }
}