{
  "source": "https://www.techradar.com/reviews/gopro-hero-9-black",
  "title": "GoPro Hero 9 Black review",
  "category": "cameras",
  "updated": "2021-07-02T11:34:44Z",
  "author": "mark-wilson",
  "summary": "Big changes, slightly rough edges",
  "verdict": "The GoPro Hero 9 Black is the most powerful and versatile action camera you can buy, but for most people its predecessor offers better value. While the new sensor and front display are useful additions, the changes don't collectively represent a big leap over the Hero 8 Black. Its slightly unresponsive touchscreen is also a little frustrating, even if a firmware fix is en route. No other action can match the Hero 9 Black's skillset, but others do currently edge it for value.",
  "pros": [
    "5K video delivers more detail",
    "Front display is handy for vlogging",
    "Improved battery life",
    "New software tricks"
  ],
  "cons": [
    "Unresponsive touchscreen",
    "Little improvement to 4K shooting",
    "Still no 4K/120p mode",
    "HEVC files need recent editing hardware"
  ],
  "article": [
    "Update 16/9/20: GoPro has released some new firmware for the Hero 9 Black, which could resolve some of the slight issues we found with its touchscreen interface and auto exposure – we'll update this review as soon as we've tested it fully.",
    "The GoPro Hero 9 Black is the most powerful and versatile action camera you can buy, but collectively its new features don't provide quite enough real-world benefits over its predecessor to justify the price.",
    "The two biggest upgrades are its new sensor and front display. That new 23.6MP sensor shoots 5K video that does deliver slightly more detail than the Hero 8 Black, in the right conditions.",
    "But perhaps the bigger benefit is to its electronic stabilization, with the Hero 9 Black able to provide HyperSmooth Boost – GoPro's strongest stabilization – in all shooting modes. This makes it a top performer for those who demand high-quality 4K (and 5K) video.",
    "That new front color display, while far from perfect, is also a very useful new feature for vlogging or general shooting. It's a little laggy and no match for a dedicated articulating screen like the one on the Sony ZV-1. But if you like to frame yourself in videos a lot, then this is probably the GoPro for you.",
    "However, some of the GoPro Hero 9 Black's other new features aren't quite as polished. The new battery boosts its stamina a little, but it's only a minor improvement and we found the Hero 9 Black more prone to overheating that its predecessors.",
    "While you get slightly improved stabilization with GoPro's new flagship, the actual quality of its 4K video isn't noticeably better than the Hero 8 Black's. Other features like Scheduled recording, while useful on occasions, aren't yet completely reliable. And most frustratingly, we found the Hero 9 Black's rear touchscreen to be pretty unresponsive at times.",
    "Still, the latter is apparently going to be fixed by a November firmware update, and if GoPro can iron some of the Hero 9 Black's other minor kinks, it could yet become our number one action camera pick. Right now, the Hero 8 Black pips it for sheer value, but this feature-packed sibling is a close second.",
    "The GoPro Hero 9 Black is available to buy now for $449.99 / £429.99 / AU$699.95, which represents an 11% price increase on Hero 8 Black's launch price.",
    "However, you can get a sizable discount on the Hero 9 Black if you get it with a one-year GoPro subscription. If you go this route, the GoPro Hero 9 Black is available to buy $349.99 / £329.99 / $559.95, including the subscription.",
    "Formerly known as GoPro Plus, the latter brings advantages like unlimited cloud storage and replacements for broken cameras (up to two per year). While GoPro is clearly hoping you'll carry on paying the $49.99 / £49.99 / $69.99 annual subscription after the first year, it is possible to cancel the auto-renewing service.",
    "Already a GoPro Plus subscriber? You can also take advantage of the discounted $349.99 / £329.99 / $559.95 price for the Hero 9 Black.",
    "If you fancy getting a few accessories with your new action cam, there is also a Hero 9 Black bundle. This includes a GoPro Handler floating grip, Magnetic Swivel Clip, spare battery, microSD card and the camera itself, all of which sets you back $499.99 / £479.99 / AU$799.95.",
    "GoPro has also revealed pricing and availability for its various 'Mod' accessories. The new Max Lens Mod, which is only compatible with the Hero 9 Black, will cost $99.99 / £89.99 / $159.95 when it becomes available in October. That ultra-wide lens accessory will bring Max HyperSmooth video stabilization (also seen on the GoPro Max) and the ability to lock the horizon even when it's rotated 360-degrees.",
    "There is also a Media Mod for Hero 9 Black accessory, which fits the new flagship's redesigned body, available to buy now for $79.99 / £79.99 / AU$129.95. This bring bonuses like a built-in directional mic and 3.5mm mic port for external microphones.",
    "Finally, there's the Display Mod (available for both Hero 9 Black and Hero 8 Black) for those who want a larger front-facing screen the Hero 9 Black's 1.4-inch display. That's available now for $79.99 / £79.99 / AU$129.95, and joins the already on-sale Light Mod (US$49.99 / £49.99 / $84.95).",
    "The Hero 9 Black is the biggest redesign of GoPro's flagship action camera since the Hero 5 Black, and the results are mostly positive (with a few caveats).",
    "There are three big physical changes from the Hero 8 Black: a new 1.4-inch color display on the front, a beefier body (to house its bigger battery), and a larger rear 2.27-inch rear touchscreen.",
    "Collectively, these new features feel like a response to the DJI Osmo Action, a fresh-faced rival that in some ways made GoPro action cameras feel a little dated. In some ways, the Hero 9 Black still does, and that's partly because the new features all come with slight downsides.",
    "First, the good news. That 1.4-inch color display on the front is definitely a handy new addition for vlogging. It thankfully isn't touch-sensitive, otherwise your memory card would quickly fill up with lots of unhappy accidents, but it does provide a live video preview of your scene and some useful shooting info.",
    "Being a square display, it certainly isn't quite in the same league as the side-hinged screens seen on cameras like the Sony ZV-1, or your smartphone's screen when mounted on gimbals like the DJI OM 4. While the latter give you a generous live preview of your whole shot, the Hero 9 Black's is more of a rough guide. It's enough to make sure your face is going to be in the frame, at least.",
    "Previous GoPros have all had monochrome displays, which show shooting info like the remaining battery life, how much space is left on your memory card, and your current resolution/frame-rate. Not quite as exciting, but certainly more practical if you don't shoot a lot of videos to camera.",
    "Naturally, the new color display comes with greater battery demands, which is partly why GoPro has inflated the Hero 9 Black's body size to squeeze in a new 1,720mAh battery. That battery's capacity is 40% bigger than the 1,220mAh ones its predecessors, which GoPro says leads to a 30% real-world improvement. As we'll see later in the 'performance' section, that's slightly optimistic according to our tests.",
    "Still, these changes do come with downsides for anyone who's upgrading from an older GoPro. The Hero 9 Black isn't backwards compatible with older GoPro batteries, as they're a different size, so you can't use older ones as spares. And the new design, which boosts its size and weight by about 10%, will also be too big for your old cases or housings.",
    "A GoPro redesign was inevitable at some point, so we can't be too critical about that, but one of our biggest disappointments with the Hero 9 Black is the responsiveness of its rear touchscreen. This 2.27-inch display is slightly bigger than the Hero 8 Black's, but it still has large, dated bezels and feels noticeably slower when responding to touches and swipes.",
    "It's possible this is down to a processor bottleneck, given the GP1 chip now has to drive a larger rear screen and color front display simultaneously, while recording. Either way, GoPro has confirmed that a fix is coming in a November firmware update, but it's not ideal for a flagship model with this price tag.",
    "Still, GoPro has at least reintroduced the removable lens cover, which it omitted from the Hero 8 Black. Whether you're replacing a cracked lens or adding an ND filter, this is a useful bonus, even if it can't exactly be considered a 'new' feature.",
    "The reason GoPro has backtracked on its removal is because it's created a new Max Lens Mod, which screws onto the Hero 9 Black's lens mount to give you a super-wide field of view and even stronger electronic stabilization. We'll update this review when we've had the chance to take it for a spin.",
    "Overall, the Hero 9 Black remains a handy, pocketable action camera that's waterproof down to ten meters and is now much better for vlogging. We'd just like to see some updates smooth out its slightly rough overheating and touchscreen edges.",
    "GoPro's special sauce has long been the combination of its class-leading HyperSmooth stabilization, first seen on the Hero 7 Black, and clever software features like TimeWarp. While the Hero 9 Black improves on these features and broadens its versatility, it doesn't really introduce one killer reason to upgrade from the Hero 8 Black.",
    "Not there aren't some significant changes under the hood. GoPro flagships have had 12MP sensors going all the way back to Hero 3 Black in 2012, but the Hero 9 Black takes the radical step of pushing this resolution up to 23.6MP with a new sensor. This allows it to shoot 5K/30p video and take 20MP stills, while also supporting the more powerful HyperSmooth Boost stabilization mode (which crops your footage by 25%) in all resolutions and frame-rates.",
    "Of course, greater resolution doesn't necessarily mean better image quality. Other factors, including image processing, lens quality and sensor size, can all have an equally big impact on the final result. The Hero 9 Black's 1/2.3in sensor is also exactly the same size as its predecessors, making it significantly smaller the 1-inch Edition module for the Insta360 One R.",
    "But that new 23.6MP resolution is nevertheless the key that unlocks the Hero 9 Black's headline features. In good light and the right conditions, there's no doubt that its 5K/30p mode, particularly when combined with the 'High' 100Mbps bit-rate, can capture more detail than any GoPro so far.",
    "That resolution boost also gives the Hero 9 Black the extra pixels needed to support HyperSmooth Boost stabilization, which can iron out judder from the bumpiest of mountain bike rides, in both 4K/60p and 5K/30p modes. This simply isn't possible on the Hero 8 Black.",
    "On the other hand, neither HyperSmooth 3.0 nor TimeWarp 3.0, which are GoPro's moving timelapses, are radical improvements on their Hero 8 Black equivalents. HyperSmooth 3.0 effectively just gives you Boost stabilization in those two higher resolutions and frame-rates, plus some handy horizon leveling that's previously only been available in the GoPro app.",
    "And TimeWarp 3.0, while still one of our favorite GoPro effects, really only brings the ability to add a 'speed ramp' during the middle of your video to briefly slow it down while adding some audio. It's a nice touch that fast-tracks the editing process, but it's more of a firmware upgrade than a headline-worthy feature.",
    "More interesting are the Hero 9 Black's new 'Power Tools'. These handy little software tricks were first teased in GoPro Labs, its new platform for GoPro users to trial new beta features. Some of the best ones have now been built into the Hero 9 Black.",
    "Our favorite is 'Hindsight'. Turn this on and the action cam will constantly buffer video in anticipation of something GoPro-worthy happening. Once said incident occurs – your cat performing the perfect cartwheel, for example – you can press the shutter button and it'll retrieve the previous 15 or 30 seconds of video. It's definitely a good way to avoid filling up memory cards if you're trying to capture your Rube Goldberg machine in action.",
    "The other 'Power Tools', including 'scheduled capture' and 'duration capture', feel like they should have been on GoPros long ago, but work well and boost the Hero 9 Black's versatility.",
    "Still, it's worth knowing that you can bring some of these features and others to your Hero 8 Black, albeit in a more rough-and-ready form, by loading the GoPro Labs firmware onto your camera.",
    "While the Hero 9 Black has lots of new features, it doesn't bring many major performance enhancements over the Hero 8 Black – or ones that will be hugely noticeable in your videos, anyway.",
    "This doesn't mean that the Hero 9 Black isn't a fine action camera, just that its upgrades don't necessarily justify the premium over its two predecessors. For example, HyperSmooth 3.0 stabilization is still excellent and ideal for shooting first-person sports, as long as you don't mind the 'floaty' look.",
    "But the addition of HyperSmooth Boost to the 4K/60p and 5K/30p modes probably won't be a huge deal for many people, because in most situations setting HyperSmooth to 'high' (which is a 10% crop, rather than Boost's 25% crop) is enough to smooth out any judder.",
    "What about the Hero 9 Black's new, bigger battery? It does help boost its stamina, but probably not enough to make a huge practical difference to how you shoot.",
    "In our side-by-side battery test with the Hero 8 Black, with both cameras shooting 4K/30p with HyperSmooth on, we got an extra 12 minutes from the Hero 9 Black (84 minutes, compared to 72 minutes from its predecessor). And that included a short overheating break for the new model, which we didn't get on the Hero 8 Black.",
    "We did also get an overheating shutdown when shooting 5K/30p video, with the Hero 9 Black needing a cool down after 28 minutes of continuous shooting. In both cases it did recover enough after five minutes to keep shooting, and shooting 5K is significantly more demanding than any mode on any other GoPro. But it certainly still makes sense to carry a spare battery, or an external USB charger, if you want it to last the day. With mixed, intermittent use (shooting video, stills and time-lapses), our Hero 9 Black lasted around 4-5 hours.",
    "Sadly, there are no real improvements to high frame-rate shooting, either. We'd have loved to see a 4K/120p mode for some crisp slo-mo footage, but that's still only possible at 2.7K resolutions or below (the same as on the Hero 8 Black and Hero 7 Black).",
    "Again, the Hero 9 Black does take some good quality slow motion clips that are great for breaking up your social media videos. But the usual rules apply – like its predecessors, this is best done in bright sunlight, because from dusk the high ISOs will turn your clips into a noisy, smudgy mess.",
    "One pleasant surprise we did find with the Hero 9 Black, though, was a slight improvement in its handling of wind noise. The Hero 8 Black made some big leaps here, and it seems the new model has improved the voice isolation in noisy environments even further, which could be handy if you like to provide live commentary over your action sports adventures.",
    "The GoPro Hero 9 Black shoots some of the best video and stills you can get from an action camera, but it isn't a huge upgrade over the Hero 8 Black.",
    "The new 5K/30p mode certainly captures more detail than any other GoPro flagship, particularly when you switch to the high 100Mbps bit-rate mode. File sizes also aren't noticeably bigger thanks to the use of the efficient HEVC codec in some modes, although they can very demanding on your computer.",
    "But if you're mainly looking to shoot videos to watch on smartphones or social media, then the extra resolution probably won't be hugely noticeable. Even on a 4K monitor, you'll only be able to see a significant increase in detail when cropping or pixel peeping. Of course, having the option to crop can be useful, but it's worth considering whether or not you'll realistically need this.",
    "Of course, if image quality is your main concern and you want the best detail possible from any action camera, then the Hero 9 Black could well be worth the investment. But for most people, the Hero 8 Black and Hero 7 Black are perfectly good enough in this department. After all, the three cameras all have the same size sensor. And as good as GoPro's Hypersmooth stabilization is, even tiny amounts of judder can be enough to negate that resolution boost.",
    "When shooting 4K/30p on both the Hero 9 Black and Hero 8 Black, we sometimes actually preferred the latter's video. Out of the box, the Hero 9 Black's footage can look more processed and oversharpened, which is possibly down to some slightly more aggressive noise reduction. Having more photosites crammed onto the same size sensor can improve detail, but it can also increase the amount of noise that needs to be managed.",
    "We did also find that the Hero 9 Black has a greater tendency overexpose bright scenes, particularly in the sky, compared to the Hero 8 Black. This may be fixed in a firmware update, but it's another example of other factors being more important to image quality than resolution.",
    "Still, you certainly won't be disappointed with the footage you shoot on the Hero 9 Black, particularly in its 5K/30p mode. HyperSmooth stabilization remains the best you can get from an action camera, and the in-camera horizon leveling is a useful (if not entirely flawless) addition.",
    "The new sensor does also let you shoot 20MP still photos, and grab 14.7MP frames from your videos. While this does deliver a slight increase in detail over its predecessors, there isn't a major step up in the Hero 9 Black's stills photography.",
    "You get all the same options as before – the option to shoot in Linear mode to correct wide-angle distortion, plus SuperPhoto for regaining some highlight detail. In good light, the results are very good, with sharpness across the frame and crisp detail.",
    "But in challenging conditions, such as backlit scenes like the above, the performance shows how far flagship smartphones like the iPhone 11 Pro (right) have moved ahead of GoPros like the Hero 9 Black (left) for stills.",
    "You do have the option of shooting in raw to lift the shadows a little, but on a sensor of this size the amount of leeway you get is pretty small. The lack of zoom can also be frustrating, making the Hero 9 Black more of an emergency, waterproof backup to your smartphone for stills, rather than a genuine alternative."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "GoPro Hero 9 Black price and release date",
    "16": "Design",
    "29": "Features",
    "40": "Performance",
    "49": "Video and image quality",
    "60": "Don't buy it if..."
  },
  "links": {
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "GoPro Max": "https://www.techradar.com/reviews/gopro-max",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "DJI OM 4": "https://www.techradar.com/reviews/dji-om-4-gimbal",
    "Hero 7 Black": "https://www.techradar.com/reviews/gopro-hero7-black-review",
    "Insta360 One R": "https://www.techradar.com/reviews/insta360-one-r",
    "GoPro Labs": "https://www.techradar.com/news/gopro-labs-lets-you-unlock-new-hero-8-black-features-heres-how-to-try-it-now"
  }
}