{
  "source": "https://www.techradar.com/reviews/strikingly",
  "title": "Strikingly website builder review",
  "category": "computing",
  "updated": "2020-11-18T09:37:54Z",
  "author": "mike-williams",
  "summary": "Build a stylish single-page website in minutes",
  "verdict": "You don't get many templates and they're not very customisable, but Strikingly does make it easy to build attractive and surprisingly capable websites.",
  "pros": [
    "Simple and easy-to-use",
    "Good editor",
    "No ecommerce transaction fees",
    "Live chat support"
  ],
  "cons": [
    "Not very many templates",
    "Limited customization options",
    "Most features are on the Pro plan"
  ],
  "article": [
    "Strikingly is unusual when ranked against the best website builder platforms, as it has a focus on designing mobile-friendly single-page websites. Before you decide a “single-page” site isn’t for you - it's not as limiting as you might think. Surprisingly, it allows you to add image galleries, a blog, custom forms, even a simple web store (with no transaction fees). There are many useful supporting features, too: responsive templates, video backgrounds, password protection, social media feed integration and more.",
    "Plans start with a basic free account, although you won’t find it unless you click on the “monthly” options. While most website builders hide their signup procedure behind a Getting Started button, Strikingly takes things a step further. Visit the company website and the first thing you'll see is an animated form asking for your name, email address and password, or you can even sign up immediately via Facebook. A Strikingly Subscriptions feature allows visitors to subscribe to your blog, for instance. The service collects email addresses and can send excerpts of any future posts with a click.",
    "Strikingly has three main plans on their website. Because of the organized interface, it’s really easy to find prices. Each plan is cheaper if you sign up for the annual plan. Strikingly does offer a free plan so you can test out the web host before pulling out your credit card. Here’s a summary of the paid plans:",
    "The Limited plan costs $8.00 per month when paid annually. It includes your own domain name, 50 GB of bandwidth, and 1 GB of storage per website (up to 2). This plan is great for entrepreneurs or small business owners who want to get their ideas or products online.",
    "The Pro plan is $16.00 per month when you purchase the yearly plan. It includes up to three pro sites and unlimited bandwidth. You’ll also have 3 GB of storage and access to all the pro features like pop-ups, HTML, and JavaScript.",
    "The VIP plan is $49.00 per month for the annual plan. This plan includes everything in the Pro version except a lot more storage - up to 10 GB. You can include multiple members with this plan to help manage your site.",
    "The interface is very easy to navigate. There are also a few apps to integrate your site with other services. These don't offer anything like the range of services seen in Wix and Weebly, but they cover many of the basics: Google Maps, SoundCloud, Google Calendar, PayPal, Wufoo forms, Ecwid stores, Facebook and Disqus comments, and a general Embed box for adding tweets, Giphys, and more.",
    "The settings dialog reveals some interesting advanced tweaks. Pro account holders can define custom actions which might be visible to users on a mobile device (calling, texting, finding directions). You're able to use a custom Favicon (the icon for your site in a browser tab), and set the icon used when your site is shared on social media. A collaboration feature allows inviting colleagues or friends to help develop the site. Everyone gets their own login, which means there's no need to share your password with others.",
    "The Strikingly editor groups most of its controls and options in a well-designed sidebar. A navigation map shows you the content sections in the current page. You can reorder them, delete them, and add new elements. You can adjust site-level details including fonts, colors and animations.",
    "The right-hand side of the screen is reserved for a view of the current page. The editor overlays some buttons on this, allowing you to change layouts, provide a new background (including video support), and more. But otherwise the page looks much as it will in your browser, and a few elements work in the same way (clicking the menu buttons will scroll to their page sections).",
    "Editing in Strikingly is more about working with prebuilt components than going your own way. For example, one section in our template contained two images, the first with text to the right, and the other underneath with text to the left. The editor allowed us to replace and edit the images, enter and reformat text, customize the layout (alignment, whether we preferred columns or rows, should the media be on the left or right) and more. But we couldn't add a new element which didn't fit the section format, like a button, or tweak existing elements by resizing or dragging them.",
    "There are many website builders out there - Wix, Squarespace, and Jimdo are just a few. What makes Strikingly different is how it automatically saves your work. Whatever you add or tweak, Strikingly does a good job of protecting you from accidents and mistakes. This ensures that whatever happens, you'll never lose too much if something goes wrong. And even after saving, you can keep tapping Undo to reverse all your recent changes.",
    "Site previews are another highlight. Buttons to preview your work in desktop, phone and tablet views enable you to check that your pages work across all devices. Another option allows viewing the live site, which means if you've noticed a problem and gone back to the editor to change something, you can view the results immediately. It's a thoughtful touch which will save you time and hassle when tuning your website.",
    "The Strikingly website builder isn't as powerful or customizable as the top competition, but it's very user-friendly. You might even say it notices the things you need to add to your website. With Strikingly, you can easily build a good-looking site that’s complete with a blog. You can set everything up within a few minutes. If simplicity is key, add Strikingly to your shortlist.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Interface",
    "8": "Features",
    "11": "The competition",
    "13": "Final thoughts"
  },
  "links": {
    "Strikingly": "https://www.strikingly.com/",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Limited plan": "https://www.strikingly.com/s/pricing",
    "Pro plan": "https://www.strikingly.com/s/pricing",
    "VIP plan": "https://www.strikingly.com/s/pricing",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Weebly": "https://www.techradar.com/reviews/weebly",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "Jimdo": "https://www.techradar.com/reviews/jimdo"
  }
}