{
  "source": "https://www.techradar.com/reviews/magisto-621",
  "title": "Magisto 6.2.1 review",
  "category": "computing",
  "updated": "2020-10-23T15:34:30.406Z",
  "author": "steve-paris",
  "summary": "Let an AI do most of the video editing heavy lifting",
  "verdict": "Magisto AI lets you create videos in minutes, and offers you a few tools to customise its creation to help you give it a more personal touch.",
  "pros": [
    "Works on iOS, Android, and online",
    "Easy to use"
  ],
  "cons": [
    "Import glitch is frustrating",
    "Subscription can be pricey if you won’t take advantage of Vimeo’s bundled features"
  ],
  "article": [
    "In the world of video editors, the latest version of Magisto was released a few weeks ago, so we thought it was a good idea to take a look at it now, and see why 120 million people have already used this app to make videos, either online, or through dedicated iOS and Android apps.",
    "We’ll be looking at how the phone interface fares.",
    "It’s clear from the get-go that everything is done to make the video creation process as easy as possible, although you can’t create anything without setting up an account.",
    "Magisto lets you connect using Facebook, Google or your Apple ID. But if none of those appeal, you’re also able to just use your email address. We were somewhat puzzled that you couldn’t log in using your Vimeo account, since Magisto is made by that company.",
    "Once registered, you start by selecting photos and videos in your camera roll - although we noticed that the interface crashed constantly when trying to access our clips - bringing them up for a few seconds and then throwing us back to the main import interface. Still we were able to get the shots we wanted, but got pretty frustrated in the process.",
    "You also have the option of making use of Google Photos (you’d need to sign in with your Google Account in order to do this), or iStock’s photos and videos.",
    "Even though you can use the service without spending a dime, you’ll quickly notice you’ll be asked to subscribe to the paid service constantly. It begins once you’ve logged in and comes back again when you try to access subscription-only features.",
    "It’s made to look like you have no option but to accept said subscription, but tapping on the ‘X’ top left of the interface will take you back to the last place you were.",
    "Tapping on the list of clips you’ve selected brings up the option of adding text to each of them (up to 90 characters per clip).",
    "The bottom on that page lets you choose Presets (a subscription only feature), the project’s ratio (portrait, square, landscape or automatic), and the video’s maximum duration (60 seconds is the maximum for free accounts).",
    "Following on from that, you need to select a style for your project. These are broken down into categories, such as Memories, Fun, Season, Wow, and Minimalistic, and there are quite a few to choose from.",
    "Next, you get to select the background music, which Magisto has a huge selection of (broken down into Moods, Genres, Type, and Category), and then it’s up to Magisto’s AI to create a video based on all that information.",
    "Now you could just leave it at that and be done with it - one video made in a handful of minutes. But should you feel the need to tweak the result, you have a few tools available to you - just tap on ‘Edit’.",
    "This is where you can change pretty much everything, from big alterations like replacing a clip with another, adding more footage, or moving clips around, to more precise modifications like trimming clips or customising of the effects which have been added automatically.",
    "Trimming a clip is an extremely simple process: move the selection along the clip to select a different segment, and drag the green handles on either side to lengthen or shorten the selection.",
    "The Layout section lets you choose the type of transition effect you’d like to apply to each specific clip, which can include a text section should you wish.You have a vast selection of groups of colours available to you should you wish to customise that layout; it’s not the same as having complete freedom over the colours yourself, but it’s close.",
    "You’re also able to add text boxes and stickers to your clip.",
    "The text feature has everything you’d expect: you can alter the size, font, colour, opacity and alignment of your words, but the nicest tool is the Style, which allows you to select how the text will appear and disappear on screen. There aren’t many options, but they are nicely done.",
    "As for stickers ,there’s a large selection of them available, which should suit all of your needs. You can resize and rotate them, apply one of three transitions (fade, stamp or pop), and alter its opacity.",
    "As you can add multiple text boxes and stickers, it’s also possible to set which ones will be in front of the other should they overlap.",
    "Once you’ve finished applying your changes, tap on Preview to have a look at your creation.",
    "If you’re happy with your work, it’s time to share it with others. By default it’s made public on magisto.com, which means anyone can see it, but you can also opt to have it Unlisted instead (only people you share the link with will be able to see it then).",
    "Magisto isn’t the only way you can distribute your work: tap on the Share icon to reveal additional options, such as Facebook, Instagram, YouTube and Twitter, or use Messages or WhatsApp instead.",
    "If your platform of choice isn’t there (what? No TikTok?), simply Download the video to your camera roll, and upload it wherever else you’d like.",
    "As we’ve seen, there are some features that aren’t open to you when working on the Free plan.",
    "Premium ($4.99 per month on a yearly plan), lets you remove the Magisto watermark, the 60-second limit on your videos, and unlocks the preset function.",
    "Professional ($9.99 per month on a yearly plan), grants you access to iStock and includes Vimeo Pro (which has a £20 monthly value).",
    "Finally, Business ($34.99 per month on a yearly plan), includes Vimeo Business (which has a value of $50 per month).",
    "If you’re thinking of taking advantage of Vimeo’s services, the two top tiers are clearly an excellent deal.",
    "The glitch of the import interface crashing when browsing through your clips aside, Magisto is a good product to let you create quick snazzy videos in minutes. The interface is simple enough to not overwhelm newbies, and has sufficient versatility to make each project unique and interesting, even if your options are limited."
  ],
  "headers": {
    "2": "Getting started",
    "4": "Build your edit",
    "9": "More options",
    "14": "Fine tuning",
    "20": "Preview and share",
    "24": "Subscriptions",
    "29": "Final verdict"
  },
  "links": {
    "video editors": "https://www.techradar.com/best/free-video-editing-software",
    "Magisto": "https://www.magisto.com/",
    "Premium": "https://www.magisto.com/pricing?prev_path=/&via=top_menu",
    "Professional": "https://www.magisto.com/pricing?prev_path=/&via=top_menu",
    "Business": "https://www.magisto.com/pricing?prev_path=/&via=top_menu"
  }
}