{
  "source": "https://www.techradar.com/reviews/pc-mac/software/piriform-recuva-review-1323657/review",
  "title": "Piriform Recuva review",
  "category": "computing",
  "updated": "2020-04-20T14:24:38Z",
  "author": "daniel-blechynden",
  "summary": "Find out whether this software is right for your business in our Recuva review",
  "verdict": "Piriform Recuva is a popular data recovery program that comes with a selection of advanced tools, including a secure overwriter, a formatted drive scanner, and virtual hard drive support.",
  "pros": [
    "Very fast, effective scans",
    "Draws very little processing power"
  ],
  "cons": [
    "Deep scans take a long time",
    "User interface isn’t the most attractive"
  ],
  "article": [
    "Choosing the best data recovery software can help you recover lost files and data from computers, portable hard drives, USB sticks, and more. In our Recuva review, we’ve looked closely at this popular file recovery program to determine whether it’s worth using. It’s competitively priced and comes with a fast, efficient data scanner.",
    "A free version of Piriform Recuva is available for personal users and those wanting to test the software. For commercial use, you will need to upgrade to a paid license, which starts at $34.95 per computer per year. A discounted price of $28.95 is available if you purchase more than 11 licenses.",
    "Piriform Recuva doesn’t use a tiered pricing structure, so all users have access to all features. The software comes with quick and deep scan options, and it works with memory cards, iOS devices, and virtual drives, among others. Unfortunately, though, it’s only available for download on Windows PCs.",
    "Recuva is a feature-rich data and file recovery program that’s up there with the best we’ve used. For starters, it enables you to retrieve data from reformatted or damaged drives, improving the chance of a successful recovery. A deep scan mode is also available, which is useful for finding hidden files.",
    "Meanwhile, Piriform Recuva was designed to be fast and efficient, reducing business downtime when recovery is needed. You can also take a snapshot of your recovered files and create a virtual disk image to prevent future data loss.",
    "On top of this, Recuva is compatible with data recovery from virtual hard drives (VHDs). And, it even enables you to create and restore to a new VHD. Finally, you can use the secure overwrite tool to ensure sensitive or confidential files are truly deleted forever.",
    "Downloading and installing the Recuva client takes no more than a few minutes and requires no technical knowledge. Simply click the download link and follow the prompts. No special setup is required before starting a scan.",
    "Meanwhile, the Recuva user interface is simple yet effective. It includes a drop-down menu for drive selection, a button to start a new scan, and an options popup. In the options menu, you will be able to select your language and specify the layout of the client. Different scanning options can also be chosen, including deep scanning and scanning for non-deleted files.",
    "To gauge Piriform Recuva’s performance, we completed both a standard and a deep scan on a mid-range Windows laptop with 8GB of RAM and a 1TB hard drive. Overall, the results were great. On both occasions, we were able to find and restore the test files we deleted with the program’s clever file search and filtering tools.",
    "A standard scan only took about a minute to complete. On average, it used around 10% CPU and 600MB of RAM. This is impressive and suggests that you shouldn’t have any problems running Recuva alongside other programs. A deep scan took almost 24 hours, but we could comfortably run it in the background while working on other tasks.",
    "We were very happy with the results of our Recuva test. Alongside the test files we deleted intentionally, it found over 86,000 objects in slightly more than a minute. These included a wide range of file types, among them images, text files, and cached web data.",
    "Additionally, the vast majority of files retrieved were fully recovered. A small percentage of older files had been overwritten or were in poor condition, but that’s to be expected. If you know what sort of file you’re looking for, you can also specify this before commencing your search for a faster, more effective file recovery scan.",
    "Recuva users can contact customer support directly by submitting an email ticket. Those with a paid subscription have access to priority support and most issues are sorted quickly.",
    "There are also four different self-help resources. The FAQ section contains answers to popular questions, and the technical documentation pages provide a detailed overview of the software. More specific questions can be asked in the active community forum and an impressive selection of short video tutorials is also available.",
    "Ultimately, Piriform Recuva is up there with the best data recovery programs we’ve tested. The free version is great for those who want to test the software before purchasing, and annual subscriptions are very competitively priced.",
    "What’s more, Recuva is backed by powerful features, including a deep scan tool, secure file overwriter, and formatted drive scanning. And although its client interface isn’t the most attractive we’ve seen, it is simple and effective. Scans are fast and thorough, and the program runs comfortably in the background. Overall, Recuva is a perfectly reasonable choice if you’re looking for a reliable data recovery solution.",
    "Recuva is good, but there are similar applications that could be better suited to your needs. For example, if you’re looking for a simple data recovery program for occasional use, the Ashampoo Undeleter costs just $14.99 for life. It doesn’t come with any advanced tools, but it does the job. Meanwhile, Recover My Files has similar features to Recuva. It costs from $69.95 for a lifetime license and is suited to those with high-spec computers and regular data restoration needs.",
    "If you're looking for more alternatives to Piriform Recuva then take look at our guide to the Best remote desktop software."
  ],
  "headers": {
    "1": "Recuva: Plans and pricing",
    "3": "Recuva: Features",
    "6": "Recuva: Client and client setup",
    "8": "Recuva: Performance",
    "10": "Recuva: Efficiency",
    "12": "Recuva: Support",
    "14": "Recuva: Final verdict",
    "16": "The competition"
  },
  "links": {
    "best data recovery software": "https://www.techradar.com/best/best-data-recovery-software",
    "Ashampoo Undeleter": "https://www.techradar.com/reviews/ashampoo-undeleter-review",
    "Recover My Files": "https://www.techradar.com/reviews/recover-my-files-review",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}