{
  "source": "https://www.techradar.com/reviews/personal-capital",
  "title": "Personal Capital review",
  "category": "computing",
  "updated": "2020-09-28T20:28:42Z",
  "author": "rob-clymo",
  "summary": "Take control of your finances with Personal Capital",
  "verdict": "If you’ve got a varied portfolio of financial interests Personal Capital has plenty of appeal and works to great effect via the app and especially the Apple Watch edition.",
  "pros": [
    "Potent app",
    "Lots of advisory features",
    "Customer service"
  ],
  "cons": [
    "Fee for consultations"
  ],
  "article": [
    "Personal Capital is a Fintech business that advises consumers on how best to invest their money and offers a portfolio of products that help to automate the process. Using their supporting app it’s possible to quickly consolidate many different accounts covering everything from investments through to retirement savings.",
    "Having been around since 2009 the personal finance software is both free and easy to use. It’s essentially a combination of a finance-tracking tool that can help you keep tabs of spending via your bank accounts and credit cards while also incorporating tools for monitoring investments. Handy during the coronavirus pandemic.",
    "Personal Capital gets a further boost from the paid-for financial advisory services that it offers. It's also possible to use various Personal Capital tools, including a Retirement Readiness Score, Recession Simulator and a Fee Analyzer to complete your financial housekeeping.",
    "Comparable products include Mint, You Need a Budget (YNAB), Banktree, Money Dashboard or Moneydance to name but a few.",
    "There’s no charge for using the Personal Capital software, which means that you can exploit all of the tools within the app without spending anything at all. However, Personal Capital does offer advisory services relating to your finances and these do come with fees attached.",
    "Personal Capital suggests calling one of their advisors to get an overview on what they might be able to offer you as they have packages that relate to investment services, wealth management and private client options.",
    "The latter is based around a fully customized investment plan to help you get the most from your money. Therefore, with such a personalized service, there don't appear to be any off-the-shelf pricing guidelines.",
    "When it comes to features, Personal Capital has three core categories that showcase its best options. There’s wealth management, cash management and financial tools. Wealth management is the part of the business that lets you have a dialog with human members of staff, although the online service backs that up with lots of automated functionality.",
    "Cash management lets you keep all of your money interests in one place and everything can be managed either via the web or using Personal Capital’s powerful app.",
    "The Financial Tools aspect is particularly useful as it features a suite of applications and services that help you get a better overview of your money. For example, you’ll be able to quickly get stats on your net worth, carry out budgeting chores, keep track of your cash flow and even plan for your retirement.",
    "Personal Capital works on a variety of devices and turns in a solid performance if you install the app on the Apple Watch, which allows you to quickly check spending by a quick date search. The app is available for both iOS and Android devices, while the desktop edition of Personal Capital is just that; a website without quite the same level of pep as witnessed on the mobile editions.",
    "There are plenty of useful tools to be found inside the Personal Capital workspace and most, if not all, are easy to get the hang of. With a little bit of investigation you can organize all of your current or checking accounts, savings, mortgages and credit cards, along with retirement monies and investment accounts into one handy location.",
    "Linking these to Personal Capital when you set up an account initially can be done within minutes. Getting started is similarly easy with just the need to sign up and create an account profile. Once you’ve got your log in sorted you’re basically in business.",
    "Support from Personal Capital is on hand in several different ways, with 24/7-phone availability and email being the main sources of contact. The website has a comprehensive range of help articles too, which cover all of the main areas of the software and associated services, plus a few other topics that might help you out when you’re using Personal Capital.",
    "Another handy option for getting in touch is a chat tool, which appears on the bottom right-hand corner of the page in the browser edition. The Known Issues feature found within the support hub is a great timesaving tool that flags up any current problems that might be affecting the service.",
    "Personal Capital sells itself as the smart way to track and manage your personal finance and that’s essentially right on the money. Having the capacity to showcase all of your accounts, retirement funds and investments too within the confines of a web site and app combination makes it hugely useful.",
    "The built-in accessories such as the Retirement Planner and interactive cash flow tools are practical additions. Meanwhile, the extra appeal is provided by having real advisors to talk things over with if you’ve got a good grasp of your finances but aren’t quite sure what to do next.",
    "Granted, you’ll need to pay for the extra advice, but Personal Capital gets you up and running even if you just start out by investigating the free app."
  ],
  "headers": {
    "4": "Pricing",
    "7": "Features",
    "10": "Performance",
    "11": "Ease of use",
    "13": "Support",
    "15": "Final verdict"
  },
  "links": {
    "Personal Capital": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1387154405086957300&xs=1&url=https%3A%2F%2Fwww.personalcapital.com&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpersonal-capital",
    "invest their money": "https://www.techradar.com/best/best-budgeting-software",
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "Banktree": "https://www.techradar.com/reviews/banktree-personal-finance",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance"
  }
}