{
  "source": "https://www.techradar.com/reviews/fujifilm-instax-mini-11",
  "title": "Fujifilm Instax Mini 11 review",
  "category": "cameras",
  "updated": "2020-04-06T08:56:31Z",
  "author": "tom-morgan",
  "summary": "Instant converts have a new favorite starter camera",
  "verdict": "It doesn't look all that different from the outgoing Mini 9, but Fujifilm's latest instant camera is also its best. Auto exposure and a variable shutter speed help it take better pictures and avoid wasting shots, while the adjustable lens makes all kinds of close-up photography possible – not just selfies. If you're just getting started with instant film, there's no better place to start.",
  "pros": [
    "Auto exposure delivers great results",
    "Allows for close-up photography",
    "Film packs are reasonably priced"
  ],
  "cons": [
    "Viewfinder not entirely representative",
    "Overblown highlights outdoors",
    "Toy-like design not for everyone"
  ],
  "article": [
    "Newcomers to instant photography have been well served by Fujifilm's Instax Mini 9, which has long been our go-to budget choice. It was affordable, easy to use, and packs of film weren't too pricey either.",
    "It wasn't perfect, though. You had to manually adjust the exposure for different lighting situations, which was easy to forget, and the lens needed a clip-on attachment if you wanted your selfies to be in focus.",
    "Fuji has refined the formula with the Instax Mini 11, adding an auto exposure system with variable shutter speed, and an adjustable lens barrel for close-ups. Even better, the price has only risen by $10 / £5 / AU$17.",
    "This makes it the ideal starter camera for anyone looking to try instant photography for the first time, or to liven up parties and events with fun, spur-of-the-moment snaps that can be shared right away. The low price even puts it in gift territory.",
    "The Fujifilm Instax Mini 11 still uses packs of Fuji's credit card-sized Instax Mini film, which is some of the most affordable instant film around. Each pack holds ten 54 x 86mm shots, which have a rectangular 46 x 62mm (2.4 x 1.8-inch) image area.",
    "Both color and monochrome packs are available for around $8/£8/AU$15 a pack, and there's a huge variety of border colors and patterns beyond the traditional white. Multipacks of various sizes can also bring the price down even further.",
    "There's a clear family resemblance between the Fujifilm Instax Mini 11 and its predecessor, the Mini 9. The new camera shares the same rounded, almost bubble-like appearance, and is still made from matte plastic.",
    "It's a little slimmer now, though still not quite pocket-sized. Fuji's more advanced Mini LiPlay is still the most portable Instax around, but it costs more than twice as much.",
    "The front grip is narrower, and there's now a ridged thumb grip on the rear for easier one-handed use. Beyond the lens barrel release, which also acts as a power on switch for the built-in flash, the only other button is the shutter release.",
    "There's no way to disable the flash, no self timer, and no tripod thread on the bottom. This is about as simple as instant cameras get.",
    "Film packs are loaded via a flip-down door on the rear, with the viewfinder shifted to the far right side. A tiny counter ticks down your remaining shots, so you don't accidentally open the film door and waste a half-finished pack.",
    "The Mini 9 wasn't afraid of bright colors, and the Mini 11 has followed suit, though it sticks with pastel hues for a more subtle effect. Fuji also includes two stick-on rubber buttons that make the shutter button that little bit easier to find blind, but the diamond effect finish is a little blingy and won't be to all tastes.",
    "Push the lens barrel release and it extrudes using a spring mechanism, with the built-in flash activating automatically.",
    "Like the Mini 9, it uses two AA batteries, which are much easier to come by than the CR2 batteries that power some of Fuji's other instant cameras. Battery life is typically around ten packs of film, or 100 shots, so more than enough for a day of shooting.",
    "There's no way to manually disable the flash, which fires automatically with every shot – whether it's really needed or not.",
    "It's because the auto exposure system can now vary the shutter speed between 1/2 and 1/250, so it should be able to capture the right amount of light in all shooting scenarios. This is a big step up from the Mini 9's fixed 1/60 shutter speed, and helps massively when shooting indoors.",
    "It may be off center, but the Mini 11's viewfinder gives a good representation of what the lens will capture. If something appears to fit within the frame, it should appear once the print develops. The selfie mirror built into the lens barrel also helps line-up those arm-length shots.",
    "Speaking of selfies, now giving the lens barrel an extra pull extends the lens ready for close-up shooting. It's a much simpler system than the Mini 9's easily forgotten clip-on attachment, though you have to grip the lens barrel awkwardly to close it up again, otherwise you end up turning the camera off completely.",
    "Instax Mini prints are ejected out of the top of the camera pretty much as soon as you press the shutter button, and take between three and ten minutes to develop completely. This is quicker than Polaroid's I-Type film, although each print is physically larger than Fuji's pocket-friendly film.",
    "Instax film tends to produce pastel-like colors and soft-focus details, giving your photos that unmistakable instant feel, though they tend to be more true-to-life than rivals including Polaroid or Lomography.",
    "Those can appear far more dream-like, while Instax appears more natural. Darker scenes and shadows appear much more dramatic than real life, though.",
    "With no need to manually adjust the exposure settings every time the lighting situation changes, the Fujifilm Instax Mini 11 has a much greater hit-rate when it comes to correctly judging a scene than the Mini 9, although the nature of Instax film means overblown highlights are still common.",
    "Skies in particular are easily washed out, though the rest of the scene tends to be well balanced.",
    "The off-center viewfinder can also make light flares an issue when shooting towards the sun. What might seem well-composed can actually have direct sunlight hitting the lens.",
    "It's an issue we've seen in other instant cameras, though, so it's more of a learning curve for the photographer than a failing of the camera.",
    "It works best indoors, capturing both your subject and the background. The Mini 9 would regularly leave backgrounds looking pitch black, whereas this camera preserves a lot more detail.",
    "The fixed focus lens manages to keep the majority of portrait and middle distance shots looking crisp, while landscapes can appear softer and more dreamlike.",
    "Popping out the lens barrel into its selfie mode helps sharpen close-ups, though you have to remember to close it again before shooting anything further away, unless you want your print to look like the lens was covered in Vaseline.",
    "The Fujifilm Instax Mini 11 improves on the previous generation Instax Mini in meaningful ways, making instant photography more accessible than ever with a largely accurate auto exposure system and an adjustable lens that works for close-ups and selfies as well as portraits and landscapes.",
    "The lack of buttons and superfluous modes should mean anyone can pick it up and start shooting, whether they're familiar with instant film or not.",
    "It keeps everything else we loved about the Mini 9, and the upgrades haven't made it significantly more expensive either. It isn't immune from overblown highlights, particularly when outdoors, and the off-center viewfinder can make compositions a little tricky at first, but as most other instant cameras are guilty of this to some degree, these aren't major concerns.",
    "For anyone looking for a fun, affordable way to get started with instant photography, and doesn't mind Fuji's pocket-sized prints, the Fujifilm Instax Mini 11 is now the obvious choice."
  ],
  "headers": {
    "6": "Design and features",
    "12": "Performance",
    "19": "Image quality",
    "28": "Verdict",
    "32": "Not convinced? Try these..."
  },
  "links": {}
}