{
  "source": "https://www.techradar.com/reviews/technics-eah-az70w",
  "title": "Technics EAH-AZ70W review",
  "category": "audio-visual",
  "updated": "2021-07-15T15:51:43Z",
  "author": "gerald-lynch",
  "summary": "Just short of greatness",
  "verdict": "The Technics EAH-AZ70W come tantalisingly close to being class leading, thanks to a superb fit and wonderful bass richness. But some digital interference and middling battery life drag them down.",
  "pros": [
    "Great build quality and fit",
    "Strong bass response",
    "Effective noise cancellation"
  ],
  "cons": [
    "Some digital interference",
    "Battery life could be bettter"
  ],
  "article": [
    "The Technics EAH-AZ70W true wireless headphones do a great job of recreating Technics signature sound in a small, portable package. Their noise-cancelling tech is solid, and the buds do an excellent job of bringing richness and detail to your songs. They’re also among the most comfortable true wireless earbuds not to feature a stem-style design.",
    "However, the earbuds aren’t without some irritants. Connecting to the buds can be erratic, battery life isn’t extensive, and you’ll experience some static noise with noise-cancelling switched on. No fault fully undermines the wonderful audio reproduction on offer here, but does detract from the premium package the price tag surely aims for.",
    "You can pick up the Technics EAH-AZ70W earbuds now, priced at £239.99 / $249.99. That makes them a tad more expensive than our top-rated true wireless pick, the Sony WF-1000XM3 (which can regularly be found on discount sale, too). So make sure you do your research and shop around before pulling the trigger on the Technics option.",
    "They may lean on the expensive side, but you’re definitely getting premium build quality with the Technics EAH-AZ70W. The buds come in an ovoid pill-box style brushed aluminium case with the Technics branding etched into the top, and a USB-C connection on the back.",
    "Flip open the hinged lid and you’ll find the buds nestled inside, which offer the same brushed metal finish on their outer side. These metal circles also act as touchpads for playback controls, and are among the most responsive we’ve found on true wireless earbuds. Tap either earbud to play or pause a track, or answer a call; hold either to reject a call; touch and hold to the left earbud to fire up your phone’s voice assistant, or the optional built-in Alexa assistant; touch and hold the right earbud to cycle noise cancelling options; double tap the left earbud to decrease volume, triple tap it to increase; double tap the right earbud to skip a track, triple tap to go back a track. All gestures work well – you’ll find more often than not that any miscommunicated command is more likely down to your forgetting what each bud can do.",
    "They’re among the most comfortable true wireless earbuds we’ve tried recently too. Five different earbud sizes come in the box, and make getting a secure fit in your ear canal a piece of cake. Between the shape and weight of the buds, they’re comfortable to wear for long stretches of time without annoyance. IPX4 water resistance will make them safe to use in rainy weather or during sweaty exercise sessions.",
    "It’s an exemplary presentation from the EAH-AZ70W. Using 10mm dynamic drivers and graphene-coated diaphragms, there’s an acoustic chamber carved into the inside of each bud, giving room for the bass to really thump through impressively. Detailed and expressive, you’ll pick out fresh details in songs you thought you knew well. We had a lot of fun listening to the opening crunch of Lenny Kravtiz’s Are You Gonna Go My Way, with its stereo-split duelling guitars giving way to a thunderous bass groove. It’s a great example of the detail in the highs and mids the EAH-AZ70W is capable of, while giving a natural-sounding oomph to the powerful low end.",
    "There’s room for subtlety too, with Judee Sill’s piano-led The Kiss lilting gently across the buds, with the faint reverb of the doubled-up vocal noticeable in a way few true-wireless buds would be capable of.",
    "However, it’s a terrible shame that the EAH-AZ70Ws suffer regularly from faint interference, with quiet moments deflated by static fizzle and sizzle. It prevents a great sound from becoming class-leading.",
    "The Technics EAH-AZ70W do a great job of tuning out external sounds, using Technics’ own Dual Hybrid Noise-Cancelling technology, adding digital processing on top of the usual analogue counter-feedback technique. It does a great job of tuning out the sound of transport and chit-chat, though doesn’t eliminate them entirely. We’re slightly concerned that the additional digital stage is adding to the aforementioned static sound, however.",
    "You can cycle through three sound modes on the Technics EAH-AZ70W. The first is the full-on noise-cancelling mode, which blocks as much ambient sound as it can manage, the second is an Ambient Mode that can be switched on to elevate the surrounding external sounds without switching your tunes off. The third mode, if you can call it that, switches them both off, boosting battery life in the process and leaning on the Technics’ already-admirable passive noise cancelling seal.",
    "They’re not the longest-lasting true wireless earbuds on the market, but the Technics EAH-AZ70W aren’t the worst, either.",
    "You’ll get six hours from the buds on a full charge with active noise cancellation modes switched on, with the case housing a further 12 hours of on-the-go battery charge for a total of 18 hours playback. You may get a little more with active noise cancellation switched off. But that’s not class leading from noise-cancelling earbuds, with the Sony WF-100XM3 offering 24 hours, and the Sennheiser Momentum True Wireless 2 giving 28 hours. Still, a 15-minute charge gets you 70 minutes playback if you’re in need of a quick fix.",
    "The Technics EAH-AZ70W also come complete with their own accompanying smartphone app (Technics Connect), which is handy for the initial pairing process and for tweaking the noise cancellation and EQ settings to your liking. The EQ in particular is very powerful, and you can quite drastically change the sound of the earbuds to your taste by playing with it. But the use of the app can also frustrate, as sometimes we found the buds wouldn’t connect automatically to a handset unless it too was open.",
    "The left bud can also be used to access a smart helper, with support for Siri, Google Assistant and Alexa (in its ‘Built-in’ variant). All work well, but note that getting Alexa to sync with the earbuds through the aforementioned Technics Connect app can be a bit tiresome."
  ],
  "headers": {
    "0": "Technics EAH-AZ70W one-minute review",
    "2": "Technics EAH-AZ70W price and availability",
    "3": "Design",
    "6": "Audio quality",
    "9": "Noise cancellation",
    "11": "Battery life and connectivity",
    "15": "Don't buy them if..."
  },
  "links": {
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}