{
  "source": "https://www.techradar.com/reviews/gocycle-gx-2020",
  "title": "Gocycle GX (2020) review",
  "category": "fitness",
  "updated": "2021-07-15T11:48:54Z",
  "author": "kris-sangani",
  "summary": "The 2020 Gocycle GX is a fast, stylish and portable option for commuters",
  "verdict": "Electric foldables are a fast-growing bicycle segment. The calibre of engineering that has gone into Gocycle's latest foldable, the GX, is evident by the stylish and reliable design which offers a trouble-free solution to the long and sometimes tiresome urban commute. The motor provides ample power when needed, and the battery lasts long for stress-free commutes.",
  "pros": [
    "Foldable in seconds, not minutes",
    "Long-lasting battery",
    "Stylish and robust build quality"
  ],
  "cons": [
    "Expensive.",
    "At 17.5kg, it's difficult to carry",
    "Latency on pedal-assist"
  ],
  "article": [
    "Without a shadow of a doubt, the Gocycle GX is yet another head-turner from the British based bicycle maker. Folding e-bikes are still a bit too heavy to be truly portable, but the GX shaves a few kilos off the weight with the magnesium alloy and aluminium construction. It's an excellent choice for commuters who want to arrive fresh and grease-free.",
    "It offers a comfortable and adaptable ride as the contact points are similar to a large-wheeled electric bike. It doesn't fold down as compact as the GS and G3 models, but its clasp design means that it can be folded down fast for those in a hurry.",
    "It has an attractive fuel gauge built into the handlebars, which incorporate five LED lights that count down when you ride. Additionally, the bike can be fitted out with proprietary accessories, and Gocycle has a great app which can be attached to the handlebars for providing speedometer, odometer and fitness tracking stats. You can also customize the riding mode using the app.",
    "Only three manual shift gears are available, but this is enough for most urban commutes. However, the latency on the pedal assist will make the steepest hill starts difficult. It offers a comfortable ride in challenging road conditions, but the saddle is a bit of a let-down.",
    "Its fuel efficiency performed much better than expected, and the motor crops time off journeys compared to a conventional bike—a superb choice for urban active-travellers.",
    "Update: GoCycle has now released a limited edition model, the GoCycle G3+, with a stowable magnesium frame, fast-folding handlebars and carbon wheels. The G3+ features a 375Wh battery, which GoCycle says offers a maximum range of 50 miles. Only 300 of the bikes will be produced, and the first delivers are scheduled for December 2020.",
    "The 2020 Gocycle GX was released in April 2020, with a retail price of $3,299 / £2,895 (about AU$4,500).",
    "The new GX features Gocycle's unique engineering with its streamlined chassis and now emblematic pitstop wheels, which allow you to change the tires without removing the wheels themselves.",
    "It weighs 17.5 kg and has heft compared to non-electric fold-ups, but this is to be expected for an e-bike. Nevertheless, it is one of the lighter fold-up electrics.",
    "The chains, gear and sprockets are all encased, leaving no exposed oily parts, which is ideal if you're commuting in your ordinary work attire.",
    "The bike's ergonomics mean that the main contact points (seat, handlebars and pedals) are pretty much the same as a large-wheeled bike. Therefore, anyone used to a conventional bicycle should find it pretty easy to adapt.",
    "However, Gocycle has compromised on the foldability of the GX in comparison Gocycle's other folding GS and G3 models. It doesn't fold down to the same proportions, but it is easier to assemble and fold down thanks to the quick-release and snap-on clasps. You will still be able to stow it on in the train luggage hold.",
    "Assembling the bicycle from the folded position is simple thanks to the three easy snap clasps. Gocycle claims that it can be completed in 10 seconds. Perhaps with practice, you might come close, but I doubt the vast majority will be able to manage that. I think 30 seconds to a minute to be more realistic after several attempts.",
    "The handlebar features LED bars which indicate the charge level of your onboard battery, and the Gocycle GX has an app which turns your Android or iOS smartphone into an onboard computer featuring a speedometer, battery monitor and trip odometer. You can also track your fitness progress, view your watts, cadence and calories burned.",
    "Additionally, it's possible to change the motor mode from 'eco', 'city', 'on-demand' and 'custom', which are self-explanatory. Your phone is secured to the centre of the handlebars with two rubberized O rings. You might want to consider a more secure solution such as a Quadlock adaptor.",
    "There are three manual grip shift gears on the right handlebar. After pushing off in first gear, the pedal-assist kicks in about half a second later. The motor controller has more significant latency than Shimano or a Bosch motor equipped bicycles, but when it does activate, boy do you feel it. It allows you to accelerate away from lights with greater ease and shift up to third gear swiftly.",
    "Travelling from outer London to Euston Station, it was a pleasure to concentrate on good riding and watching out for traffic rather than be distracted by fatigue.",
    "The rear suspension handles the uneven surfaces of London infrastructure easily. It would be hard to compete with a conventional bike, but it's good for a foldable. Comfort could be improved with a better saddle which you should be able to upgrade.",
    "My first ride was approximately 12 miles from home to central London. This journey would typically take me 55 minutes to an hour. On the GX, I managed to slice 15 minutes off that journey – far quicker than public transport or car. I arrived without sweat and was able to fold it down quickly to stow away. A quick check on the LED fuel gauge and I had only used 20 per cent of the battery. The specifications claim I would get about 40 miles, depending on pedal input. At this rate, it would have exceeded the specs to almost 50 miles on a single tank of power.",
    "Most electric bicycles have a boost button. On the GX, the booster is located under the left handlebar and provides a better than average oomph of power to accelerate out of scary moments on city roads.",
    "E-bicycles are expensive pieces of kit. Therefore, being able to fold and keep it in the office or your home without taking up too much space is a definite selling point for the GX. However, weighing almost 18 kilos means that it is prohibitively heavy if you have to lug it up flights of stairs at home or the office.",
    "The battery is encased inside the frame, but it can be removed if you want to charge it up. However, you can leave it inside and still charge it. This takes approximately seven hours, but Gocycle does offer the possibility of purchasing a charger that only takes three and a half hours.",
    "This is an excellent choice for commuters if you don’t face stairs at either end of your journey. But this is currently a problem with all electric foldables."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and release date",
    "7": "Design",
    "12": "Performance",
    "23": "Don't buy it if"
  },
  "links": {
    "Folding e-bikes": "https://www.techradar.com/best/best-folding-e-bikes",
    "electric bike": "https://www.techradar.com/best/electric-bike",
    "GoCycle G3+": "http://www.gocycleuk.com/category_s/172.htm",
    "Quadlock": "https://www.quadlockcase.co.uk/"
  }
}