{
  "source": "https://www.techradar.com/reviews/moneystrands-personal-finance",
  "title": "MoneyStrands personal finance review",
  "category": "computing",
  "updated": "2020-09-28T20:08:33.166Z",
  "author": "rob-clymo",
  "summary": "Add the cool factor to your finances with MoneyStrands",
  "verdict": "MoneyStrands is a fun and funky app for taking control of your finances with a host of tools for setting budgets and savings goals topped by a cool community angle.",
  "pros": [
    "Brilliant for budgeting",
    "Community appeal",
    "Simple but works"
  ],
  "cons": [
    "Only works with US banks",
    "Read-only so no third-party add-ons"
  ],
  "article": [
    "MoneyStrands is personal finance software aimed firmly at app fans and a package that adds in a distinctly social aspect to your money management housekeeping. In fact, there’s even a community area of the program that lets you compare your own spending with other people who have similar habits or patterns to the way they part with their cash.",
    "Using it is currently limited to the US however, due to its integration with American banks only. The software lets you connect to your bank accounts and create a better way of managing your money as well as scheduling for the future using its suite of budgeting tools. It's particularly useful currently given the situation with coronavirus. MoneyStrands therefore makes good sense if you’re looking to bring your money matters out of the financial fog.",
    "Competitor products include Mint, You Need a Budget (YNAB), AceMoneyLite, Money Dashboard and Moneydance, all of which are worthy of investigation too.",
    "The MoneyStrands app is currently completely free to use, although its creators have suggested that in future there may be additional functions added that will form part of an optional premium suite of features. Presumably this will move MoneyStrands into the paid-for environment, or perhaps the company will have two different versions. Currently, the free-to-use philosophy appears to be working in terms of building up a dedicated user base.",
    "Like many personal finance apps, MoneyStrands works because it simplifies dealing with your financial affairs. Therefore, once you’ve got the app on your phone you get easy-to-digest facts and figures on all aspects of your money movements. There’s analysis, including the ability to click on Expenses and Cash Flow tools.",
    "However, the really cool aspect is the Community tool, which lets you compare your finances with others who have similar spending habits. This gives MoneyStrands something slightly different.",
    "Using the built-in calendar and budgeting options you can create a plan for your finances, which is especially useful if you’re not great with money or have complex incomings and outgoings. So much so that there’s a tool for letting you know if it’s okay to spend or not, which is invaluable for curbing those impulse purchase moments.",
    "MoneyStrands is available for both the iOS and Android platforms. Connecting the app to your bank accounts and credit cards might seem like the most demanding aspect of the service, but this is actually a straightforward process that should work as expected.",
    "All you need to do once the registration and log-in process has been completed is to pick your way through the list of bank logos, select your bank or credit card company and enter your details. MoneyStrands will do the rest. Any worries about security are alleviated with the app having fingerprint log-in capability, 256-bit SSL encryption and additional security features design to keep you and your money safe and secure.",
    "The designers have done a great job putting together MoneyStrands. It has a cool and contemporary look about it and works well once you’ve got it installed on your phone.",
    "The controls and logical layout make it a cinch to navigate, while the ability to set up those all-important budgeting goals is really easy. If you’re left cold by having to tackle money matters then the ease of use that comes with MoneyStrands means that tackling this chore isn’t too much of a struggle.",
    "Full marks has to go to MoneyStrands for its user-friendly design, which for example groups your different transactions into various types of purchase. The app does this by default, but you can also set these groups and categories manually. Brilliantly simple.",
    "There doesn’t seem to be any obvious means of support for MoneyStrands. Nevertheless, given the easy to use nature of the app there’s not actually that much that will present you with problems along the way.",
    "Even connecting to your bank or banks, perhaps the most potentially challenging aspect if you're not familiar with it, requires very little manual intervention. There’s a pretty good page of frequently asked questions that tackle most, if not all of your queries relating to the software and its capabilities.",
    "MoneyStrands comes with lots of appeal, although there are limitations currently. The biggest issue if you like what you see but live outside of the US is that it's not available unless you’re in America. There’s no desktop edition of MoneyStrands either, which isn’t a big deal as this software is all about convenience and being able to better manage your money on the move.",
    "Being able to do that on your mobile device makes obvious sense. Using MoneyStrands couldn’t be easier, with an interface that lets even those with the most disheveled of finances pull things into better shape with the use of a few screen taps. MoneyStrands works with Yodlee to deliver the secure API aspect of the app and its currently completely free-to-use appeal is obvious."
  ],
  "headers": {
    "3": "Pricing",
    "4": "Features",
    "7": "Performance",
    "9": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "MoneyStrands": "https://moneystrands.com",
    "personal finance": "https://www.techradar.com/best/best-personal-finance-software",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "AceMoneyLite": "https://www.techradar.com/reviews/acemoney-lite",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance"
  }
}