{
  "source": "https://www.techradar.com/reviews/logitech-g203-prodigy",
  "title": "Logitech G203 Prodigy review",
  "category": "computing",
  "updated": "2020-02-03T16:48:40Z",
  "author": "mike-jennings",
  "summary": "How cheap is too cheap?",
  "verdict": "The Logitech G203 Prodigy is a good, affordable gaming mouse, with enough precision to handle mainstream games alongside decent buttons. It’s even got RGB LEDs. However, pricier rodents will have crisper, faster buttons, a larger, more ergonomic design and extra features.",
  "pros": [
    "Very affordable",
    "Solid sensor and core button quality",
    "Well-designed software"
  ],
  "cons": [
    "Some buttons are too soft and spongy",
    "Underwhelming design",
    "Quite small"
  ],
  "article": [
    "The Logitech G203 Prodigy is one of the cheapest gaming mice on the market: its price of $23 (£23, around AU$58) means that it’s far more affordable than the big-brand mice that dominate gaming discussions and esports events.",
    "That price is even lower than our previous budget favourite – the HyperX Pulsefire Surge RGB, which currently costs $46 (£37, around AU$77).",
    "The low price means that the Logitech G203 Prodigy concentrates on the basics. On the inside, that means an optical sensor with an 8,000 DPI sensitivity level. Don’t be fooled by the packaging saying 6,000 DPI, by the way – Logitech has improved that figure with a firmware update.",
    "An 8,000 DPI sensitivity level is a solid figure for mainstream single-player and competitive gaming. It’ll sate virtually anyone who plays on a 1080p or a 1440p panel – and it’ll even be fine for most people who play on 4K or widescreen displays.",
    "You’re only really going to need anything beyond 8,000 DPI if you’re a keen esports or FPS player. In those twitchy situations, speed and precision are vital, and so you’ll want to seek out a mouse with more than 10,000 DPI – and that’ll likely involving spending more than $40 or £40.",
    "Only a single gaming profile can be stored on this mouse – more expensive peripherals usually store five – but Logitech’s software can store an infinite number. It can also customise each button. It’s a good app and makes living with the G203 easy.",
    "The more expensive HyperX is rated for 16,000 DPI, and it stores three profiles. Few people need a mouse rated for such sensitivity, but the HyperX is better for competition.",
    "The HyperX has six buttons alongside better lighting. It’s also heavier, taller and longer than the compact G203.",
    "The physical design is plain – the G203 is made from matte plastic, with no textured areas and a shape that’s barely different from your average office rodent. It’s robust, though, so it’ll certainly stay the course, and there are customisable RGB LEDs at the rear.",
    "The Logitech G203 has six buttons: the two main ones, the scroll-wheel, a DPI switcher and two side buttons. It’s ambidextrous, but you only get side buttons on the left-hand side.",
    "There are no extra ergonomic features, and the G203 is compact: its 64mm width and 38mm height make it a tad smaller than pricier gaming mice. The size and shape won’t be an issue for most gamers and most grip types, but gamers with larger hands may struggle.",
    "The G203 has ample speed and precision for most gaming scenarios, and its two main buttons are reasonable: fast and consistent.",
    "However, the lower budget is evident here – the main buttons are loud, and they have a little more travel and a little less speed than buttons on pricier peripherals. For mainstream gaming, this won’t slow you down, but competitive players will want shallower, faster mechanics.",
    "The side buttons are acceptable, but they’re spongy and require too much force to press. The scroll wheel is lighter and consistent, but it has no horizontal clicking and its scrolling is staggered, not smooth.",
    "The G203’s surface isn’t the best, either: it’s smooth and slippery, and the situation won’t improve if your hands get sweaty.",
    "The HyperX is better: its main buttons are faster and lighter than the Logitech – and they have an endurance rating of fifty million clicks, while the G203 is rated for only ten million."
  ],
  "headers": {
    "0": "Two minute review",
    "11": "Performance",
    "16": "Don't buy it if..."
  },
  "links": {
    "gaming mice": "https://www.techradar.com/news/best-gaming-mouse",
    "HyperX Pulsefire Surge RGB": "https://www.techradar.com/reviews/hyperx-pulsefire-surge-rgb"
  }
}