{
  "source": "https://www.techradar.com/reviews/razer-blade-pro-17-2020",
  "title": "Razer Blade Pro 17 (2020) review",
  "category": "computing",
  "updated": "2020-07-10T10:55:13Z",
  "author": "bill-thomas",
  "summary": "Razer going pro",
  "verdict": "The Razer Blade Pro 17 has some of the strongest performance in its class, but it's held back by its heavy build and short battery life – but if that doesn't bother you, there's a lot to love.",
  "pros": [
    "Best-in-class performance",
    "Robust performance",
    "Plenty of ports",
    "300Hz display"
  ],
  "cons": [
    "Short battery life",
    "Expensive",
    "Very heavy"
  ],
  "article": [
    "The Razer Blade Pro has been around for a while, but with this 2020 iteration, it has to compete with an entire landscape of workstation-class gaming laptops which are aiming to take Razer's crown. Laptop manufacturers have all woken up to the fact that a huge portion of the fanbase for these devices - which were previously almost exclusively marketed as high-end gaming laptops - are some of the best laptops for creators, especially for anyone that has to do heavy video editing on the go.",
    "And, strapped with an Intel Core i7-10875H processor, 16GB of RAM and an Nvidia GeForce RTX 2070 to start, there's definitely a lot of horsepower to spare. Paired with a lovely 17-inch 1080p display, this is definitely a laptop where you'll be able to play all the best PC games at max settings without messing around with resolution settings.",
    "You will be paying for that hardware, though. The Razer Blade Pro 17 starts off at $2,599 (£2,599, AU$4,899), which will get you the configuration you see to the right. Now, you can get last year's model with a 9th-generation Intel processor and drop that price down to $2,399 (about £1,900, AU$3,450) though you will get a 240Hz display, rather than the 300Hz display found on the 2020 model.",
    "Of course, if that's not quite enough power, you can always go for one of the more juicy models. You can get the Razer Blade Pro 17 with up to an Nvidia GeForce RTX 2080 Super, upgrade that SSD to 1TB and get a 4K 120Hz display to top it off for $3,799.",
    "Both of these configurations sound like a lot, but compared to other desktop-replacement laptops like the $2,299 (about £1,860, AU$3,600) Gigabyte Aorus 17G and the $2,999 (about £2,430, AU$4,390) MSI GS75 Stealth, the Razer Blade Pro 17 fits in with its contemporaries, even though it definitely outclasses them in design.",
    "Razer has always had excellent design, and the Blade Pro 17 is definitely no exception. The all-black design is only interrupted by a lit up Razer Logo on the back that doesn't even look obnoxious like most illuminated logos do. Of course, there's also an RGB keyboard, which you can customize with the pre-installed Razer Synapse software.",
    "Beyond that, the keyboard is excellent, if a bit less clicky than we'd expect from a gaming laptop - though that's in no way a bad thing. The Razer Blade Pro 17 also has the best trackpad we've ever seen in a laptop of this class. While we get that with this kind of laptop, people are going to be primarily using external mice, having a trackpad that doesn't suck is underrated - and this one is almost as good as a Mac trackpad.",
    "On either side of the keyboard, you get these massive top-firing speakers. They aren't the best sounding speakers in the world - the bass isn't quite as heavy as we'd like - but because of their positioning they aren't muffled. Nestled in the top of the right-hand speaker, you get a power button, which is just kind of a weird placement.",
    "As far as ports are concerned, there are plenty. There are two Thunderbolt 3 ports – one on each side of the laptop, along with three USB-A ports. Then, to add a cherry on top, there's an HDMI port, Ethernet and a full-sized SD Card reader. Basically, whether you're a gamer or a creative professional, you're not going to be left wanting for ports.",
    "The reason Razer was able to stuff all these ports in, though, is the sheer thickness of this laptop. This thing is thicc™. While it's not much bigger than other laptops in its class, measuring just .78 inches thick, it's very heavy. This thing weighs a whopping 6.06 lbs, which is heavier than the Gigabyte Aorus 17G, which is a full 22% thicker. If you're looking to commute with this thing, just be prepared for the workout that carrying it around in your backpack is going to be.",
    "And that's before you even consider the weight of the charger, which you're going to need to carry around with you too – because the battery life isn't great. With its 10th-generation Comet Lake-H processors, Intel has drastically improved the average battery life of even the most beefy workstations. Coupled with Nvidia Optimus, which intelligently switches off the dedicated GPU when it's not needed, even gaming laptops are getting some pretty decent battery life these days.",
    "But not the Razer Blade Pro 17. In the PCMark 10 battery test, this laptop squeezed by with just 4 hours of battery life, a full hour behind the Asus Zephyrus Duo – a laptop with two screens. A lot of this likely comes down to the 300Hz refresh rate, but you're definitely going to want to make sure this thing is plugged in most of the time.",
    "Luckily, the Razer Blade Pro 17 performs as expected – but there's a bit of a twist. Right out of the box, the performance profile holds the laptop back a little bit. If you want to squeeze the most juice out of it, you're going to want to go into Razer Synapse, select the Razer Blade Pro icon, go over to the performance tab, and make a custom power profile, and crank the CPU and GPU sliders all the way up. Once you do that, you're going to be able to squeeze the most performance out of the laptop – which just means better frame rate for gamers and time saved for creators.",
    "Once you do that, the Razer Blade Pro 17 punches above its weight class, beating the RTX 2080 Super in the Zephyrus Duo in all of our gaming tests. It does still lag behind when it comes to raw CPU performance – but not by much.",
    "Ultimately, this is a powerful laptop, with a nice aesthetic and plenty of ports. It's a bit heavy, to be sure, and the battery life isn't quite there, but if those are things you can live with, there's a lot to love about the Razer Blade Pro 17."
  ],
  "headers": {
    "15": "Don't buy it if..."
  },
  "links": {
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "best laptops for creators": "https://www.techradar.com/news/best-laptops-for-video-editing",
    "Nvidia GeForce RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g",
    "MSI GS75 Stealth": "https://www.techradar.com/reviews/msi-gs75-stealth",
    "Asus Zephyrus Duo": "https://www.techradar.com/reviews/asus-zephyrus-duo-gx550"
  }
}