{
  "source": "https://www.techradar.com/reviews/google-pixel-buds-2020",
  "title": "Google Pixel Buds (2020) review",
  "category": "audio-visual",
  "updated": "2021-06-30T13:46:39Z",
  "author": "nick-pino",
  "summary": "The Google Pixel Buds aren't exactly the 'AirPods for Android' you've been waiting for",
  "verdict": "The new true wireless Google Pixel Buds are a major upgrade on their predecessors. The always-listening Google Assistant is great, but the lack of active noise cancellation and fatiguing sound quality at this price are a disappointment.",
  "pros": [
    "Always-on Google Assistant",
    "Live language translation",
    "Sleek design"
  ],
  "cons": [
    "Aggressive, fatiguing sound",
    "No noise reduction",
    "Mediocre battery life"
  ],
  "article": [
    "The new Google Pixel Buds might feel like a zeitgeisty knock-off of the work Samsung and Apple are doing, but they do in fact bring something new to the table: an always-listening Google Assistant.",
    "That may seem like a small feature, but up until now Android devices haven't exactly had a complete Apple AirPods-like solution. Sure, there have been some absolutely incredible true wireless earbuds like the Sony WF-1000XM3 that cater to that crowd, but they still weren't entirely in sync with your Android device.",
    "The new Google Pixel Buds are. Not only do they sync up to your Pixel phone the second you open the case near them the same way AirPods sync up to iOS devices, but if you enable Google Assistant, you'll be able to talk to it at any point by saying the wake words – again, just like AirPods.",
    "But unlike their Cupertino-contrived competition, Google's Buds offer live language translation as long as you have connection to the Internet, which is a game-changer for all the mono-linguists out there.",
    "That said, while the Google Pixel Buds seem to offer the best compatibility with Android devices, they don't offer any form of active noise cancellation, middling on-board battery life of about three hours and cost more than other comparable earbuds from Sony and Samsung.",
    "Worse, they also have some of the weakest sound quality of any true wireless earbud we've tested so far in 2020. It's warm, treble-heavy and for folks with a sensitivity to hi-hat clashes and sibilance, they'll wear you down after a half-hour of listening.",
    "There's no debating that these are a huge improvement on the original Pixel Buds and a fine companion for your Google Pixel 3, Pixel 3a or Google Pixel 4 smartphone.",
    "The feature-set alone is a marked improvement and Google has clearly paid attention to what customers are looking for in terms of ease-of-use and sleek design.",
    "Where the Pixel Buds could still improve is in their sound quality and lack of active noise cancellation tech. There are a number of other earbuds out there that sound better and cost less, or cost more and include noise cancellation.",
    "As much as we appreciate the feature set of the Google Pixel Buds for Pixel owners, the less-than-perfect audio quality, lower battery life and loose fit keep the Google Pixel Buds from receiving our unbridled recommendation.",
    "[Update: Pixel Buds users can now use Find My Device to locate their earbuds should they go missing. According to 9to5Google, users have noticed their Pixel Buds are listed upon logging into the app.",
    "The earbuds are also due a software update in the coming weeks, though Google is yet to reveal the full details.]",
    "The Google Pixel Buds arrived in stores in the US on April 27, 2020, available in four colors – Oh So Orange, Clearly White, Quite Mint, and Almost Black. They then arrived in the UK on July 13, 2020, but only in the Clearly White hue.",
    "The UK will get treated to Almost Black later in the year, but the orange and mint options aren't making their way across the Atlantic.",
    "In the US and UK, the Google Pixel Buds price is $179 / £179, which means the Pixel Buds are more expensive than the second generation Apple AirPods (with wireless charging case), Samsung Galaxy Buds Plus and even the five star Sony WF-1000XM3. In Australia, they're about the same price as all of these contenders.",
    "For around $50 / £50 less you can get the Samsung Galaxy Buds Plus that have a 12-hour on-board battery and 12-hour charging case, and for $10 / £10 less you can pick up the Sony WF-1000XM3 that have active noise cancellation – a supremely helpful feature for commuters and frequent travelers that you won't find on the Pixel Buds.",
    "In Australia, however, the latest Pixel Buds are AU$279, which is actually a good deal cheaper than all of the contenders mentioned previously, so it's worth bearing that in mind when making your decision.",
    "The most prominent feature of the Google Pixel Buds – and the thing that separates them from the original Pixel Buds that it will likely replace in the future – is that they're completely wireless. There's no cord running in between the buds this time, and that's truly liberating.",
    "They're possibly the cutest true wireless earbuds currently available too, as the clean, rounded design of both the buds and case is pleasing to the eye.",
    "The case has also been fully redesigned and fits better in both your hand and your pocket. The egg-shaped case's lid can be flicked up and down with a satisfying click and the entire case only sports a single USB Type-C port for charging. Even better, the case itself supports wireless charging and a bright LED on the case lets you know that it's being charged.",
    "Inside the box Google includes multiple sets of eartips and a decently long charging cord – both of which are appreciated. You may need the extra eartips as the mediums that come on the buds can actually run a bit large and push the earbuds out of your ear.",
    "These are some seriously small buds and can only stay in your ears with the help of a little nub-like protrusion that rests inside the outer ear. How uncomfortable you find the nub will likely be a point of debate, but we didn't find them the most comfortable or the most prone to staying in our ears.",
    "Those with a different ear shape will have more success in this area than we did, but we wish Google would've used a fin design (like the Powerbeats Pro) to keep the buds in place instead of the nub.",
    "It means if you're thinking of using the Google Pixel Buds during a workout or outside activity, you may want to think again as they run the risk of coming loose during excessive movement.",
    "The only outright missing feature in terms of design is active noise cancellation. A number of other headphones around the $200 mark have it and it's something that is missing from the Google Pixel Buds. In fact, due to their design, there's not even a lot of passive noise reduction here, either.",
    "To compensate for their lack of noise reduction skills, though, the Pixel Buds are able to automatically adjust their volume based on the amount of noise the microphones pick up – which, although not quite noise cancellation or anything close, is better than nothing – and automatically pause when you take them out of your ear.",
    "We didn't find the automatic volume adjustment that helpful but auto-play/pause certainly is a huge help in conserving battery life and a smart inclusion.",
    "What we did enjoy, however, were the on-bud touch controls. We've used a lot of wireless earbuds, and a common theme through them all is some rather hit-and-miss touch controls. Not so, with the Google Pixel Buds.",
    "Both buds are touch pads, and we found them supremely responsive, whether it was single tapping to play/pause music, holding down to listen to our notifications or swiping over them, forwards or back, to increase or decrease the volume.",
    "You can edit the various actions in the Pixel Buds app too, so if you want - for example - to single tap to skip a song, double tap to go back to the previous track and triple tap to play/pause, you can.",
    "Last but not least, it's at least worth mentioning that the Pixel Buds come with a stalwart IPX4 water-resistance rating. That makes them capable of withstanding a sweat-filled trip to the gym and a few minutes out in the rain, but probably not a trip to the beach. So tread carefully.",
    "The Google Pixel Buds come with 12mm speaker drivers in each bud. So how do they sound? Not amazing, unfortunately. Right off the bat, without any music playing you might hear the slightest bit of hissing and you'll notice that some songs have an incredibly weak bass response.",
    "Instead, what you'll notice is that Google's Pixel Buds really focus on the mids and treble. They make hard rock songs like The Best from Awolnation course with energy and sublime left-right separation – which is great – but the music never sounds like it's supposed to because it's missing the low-end.",
    "Audio enthusiasts would describe the sound quality as bright, a term that most associate with sibiliance (exaggerated tonal harshness) and listening fatigue. There's no way to customize this sound either, so you're basically stuck with the audio quality that Google gives you... which isn't ideal.",
    "Similarly, video audio quality is a bit of a mixed bag: we had no problem listening to videos on YouTube with the Pixel Buds, but turn to an action-heavy movie on Netflix and suddenly you're missing the lower half of the audio track.",
    "We also had an issue while using them on a Facebook Messenger call where the microphone crackled with every single word as did simply re-adjusting them in our ear. Again, potentially these were just one-off issues that could be fixed with firmware updates or flukes caused by connection quality, but right now we're simply not confident enough to say that these are strong contenders for video calls.",
    "Where the Google Pixel Buds works as advertised, for better or worse, is with battery life. Officially, Google touts three hours per charge with a total of 24 extra hours when deposited back inside the charge case between charges and we found that number to be pretty spot-on.",
    "The built-in battery life on the Pixel Buds is lower than what you'd find elsewhere, so if you plan on using these on a long-haul flight, expect to go 15-20 minutes without them in your ears while they recharge.",
    "The good news is that the amount of battery life inside the case is comparable to its Sony, Samsung and Apple equivalents and they can be charged wirelessly, which is a nice touch.",
    "While they don't always fit very well, you have to hand it to Google for building a ton of features into these earbuds for Android users. The automatic connectivity right out of the box is pretty magical, and the always-listening Google Assistant allows you to control your whole home from wherever you are.",
    "One neat feature that's specific to the Pixel Buds is the ability to integrate directly with Google Translate to offer real-time translations. The way it works is that, once you say 'OK Google, be my Spanish translator', your Android phone automatically opens the Google Translate app and starts working.",
    "You press and hold your left earbud to say something in your native language, and it will then repeat in the translated language from the speakers on your phone. Hold the translate button on your phone while the other person talks and you'll hear the translation directly in your earbuds.",
    "When you get a rhythm down for the conversation, the solution is magical, allowing you to talk with extended family, friends and strangers that you would've struggled to communicate with before. The only problem is that you'll need to speak one at a time and unless you download a language pack (around 45MB each) you'll need to be connected to Wi-Fi in order for it to work.",
    "The other hidden trick the Google Pixel Buds can do is read your notifications from your phone and, if you choose to do so, respond directly using dictation. These features aren't quite as polished as we'd like, and can often feel a bit overwhelming if you have social network and email notifications turned on.",
    "You can select which apps the Assistant reads notifications for, which will cut down on the amount of times you're interrupted, but you can't specify notifications from a particular contact or chat. If you find this all a bit much, you can turn off spoken notifications completely, via the Pixel Buds app.",
    "The feature is incredibly practical though, especially for hands-free use, and it could pave the way for even better implementation down the road."
  ],
  "headers": {
    "0": "Two minute review",
    "12": "Google Pixel Buds price and availability",
    "17": "Design",
    "31": "Audio Performance",
    "36": "Battery life and connectivity",
    "46": "Don't buy them if..."
  },
  "links": {
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Google Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "9to5Google": "https://9to5google.com/2020/08/17/pixel-buds-find-device/",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "original Pixel Buds": "https://www.techradar.com/reviews/google-pixel-buds-2020",
    "Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro"
  }
}