{
  "source": "https://www.techradar.com/reviews/sandisk-extreme-pro-portable-ssd",
  "title": "SanDisk Extreme Pro Portable SSD review",
  "category": "computing",
  "updated": "2021-01-11T23:29:26Z",
  "author": "nick-rego",
  "summary": "Extreme speed.",
  "verdict": "Built for toughness, the Extreme Pro Portable SSD delivers great performance no matter what you’re throwing at it.",
  "pros": [
    "Great design",
    "Rugged",
    "Excellent performance"
  ],
  "cons": [
    "Exposed USB port"
  ],
  "article": [
    "With the prices of SSD storage dropping lower and lower, there’s little reason to use a traditional mechanical HDD as your source for external storage. SanDisk offers plenty of internal SSD solutions, but its Extreme Pro Portable SSD is an improvement from its predecessor.",
    "The tough design makes it much more durable for throwing into a camera bag, and with up to 2TB of capacity and blazing-fast transfer speeds, it’s an excellent choice as an excellent external storage solution for both PC or Mac users.",
    "Note that a 4TB version of this drive was launched in January 2021 at CES 2021 with a significantly higher price to reflect its premium status.",
    "We’re reviewing the 1TB version here, which is priced at AED 729/$189.99/£159.99 and is available at most retailers. You can also opt for a 500GB or even a 2TB drive, depending on your storage needs.",
    "The design of the Extreme Pro Portable SSD remains largely unchanged. It’s got a sturdy, rubberized body that makes it easy to grip, and an aluminium body with a loop at the top to secure it via a carrying clip.",
    "The drive is IP55 water and dust resistant, so for those who need to copy data quickly during photo shoots or filming, this drive is more than capable of standing up to wear and tear. The one thing you’ll need to be careful about is the USB-C port at the bottom.",
    "It’s not covered or protected in any way, so should your drive fall into water or become dusty, you’ll want to make sure that this port is thoroughly dry and clean before you connect it to anything. It would have been nice for SanDisk to include some sort of removable cover attached to the drive to protect this port, so maybe we’ll see that in a future version.",
    "Bundled with the drive are two USB cables – one with USB type C on both ends, and one with USB type A for more general compatibility. Again, it would have been nice if there was a way that both cables could be bundled together for convenience, so you don’t have to bring two cables along everywhere.",
    "This is where the Extreme Pro Portable SSD really takes the cake. If you’re looking for ridiculously fast data transfer speeds, then you won’t be disappointed. Provided you’re using a Thunderbolt 3 port, you’ll get really good performance out of this drive. SanDisk rates the Extreme Pro Portable SSD at read speeds of up to 1,050 MB/s, but we peaked at around 928MB/s during our tests.",
    "Bundled on the drive is SanDisk’s SecureAccess software, which lets you create a secure space on your drive to lock files and folders behind a password. It’s not necessary if you just want to use your drive like normal, but is an added bonus.",
    "There are plenty of external storage solutions out in the market, but very few of them will be as durable as the Extreme Pro Portable SSD. It’s got great transfer speeds to keep you going, plenty of storage, and comes in a variety of storage sizes.",
    "Whether you’re trekking through snowy mountains or filming in the middle of the desert, this drive won’t let you down."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "8": "Performance",
    "10": "Final verdict"
  },
  "links": {
    "SSD storage": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "from its predecessor": "https://www.techradar.com/reviews/sandisk-extreme-portable-ssd-1tb"
  }
}