{
  "source": "https://www.techradar.com/reviews/hbo-max",
  "title": "HBO Max review",
  "category": "entertainment",
  "updated": "2021-03-08T17:27:22Z",
  "author": "gem-seddon",
  "summary": "The HBO Max streaming service brings high-end shows and big blockbusters together",
  "verdict": "HBO Max storms out of the gate with a prolific content library, bursting at the seams with 10,000 hours of movies and shows from Warner Bros and HBO, alongside a clutch of streaming exclusives. At $14.99, the price tag’s a little steep, especially with no 4K/HDR options or support on some key devices at launch, but Netflix just got a strong competitor.",
  "pros": [
    "Massive, diverse content library",
    "Downloads available",
    "Intuitive, easy-to-use app"
  ],
  "cons": [
    "No 4K/HDR",
    "Subscription costly",
    "Missing on key devices"
  ],
  "article": [
    "HBO Max rockets into the streaming stratosphere with a hefty content payload – by far its most enticing quality. Boasting an impressive 10,000 hours of shows and movies, curated from a wide range of “hubs”, you won’t be hanging around waiting for new content to drop. With options to create multiple profiles, parental controls, offline downloads and the choice to watch over several screens simultaneously, it’s primed for household usage.",
    "This isn't HBO’s first streaming service, after all: it follows on from the existing HBO Now and HBO Go. While under the HBO banner, the Max service hails from both WarnerMedia and HBO, under the stewardship of parent company, AT&T. What does this mean? Well, for starters: the variety of content available is staggering. Included in its array of content hubs: the entire HBO catalog, the DC Universe, TCM, CrunchyRoll, Looney Tunes, Studio Ghibli, and Cartoon Network.",
    "- Click to head to the HBO Max website to find out more and sign up",
    "We haven’t even touched on other licensing exclusives secured by AT&T, such as Friends, Doctor Who, Fresh Prince of Bel-Air and the Lord of the Rings trilogy.",
    "At $14.99 a month, it’s on the costlier end of the on-demand streaming services, lapsing Netflix’s standard option by $2 (though it's $1 cheaper than its Premium Plan).",
    "In that regard, it’s a tad disappointing that the service has yet to include 4K HDR options like Netflix, but we’ve been told by a HBO Max spokesperson that this is set to change in the future. Likewise, the inability to stream on Roku and Amazon devices right now lets it down compared to other recent streaming service launches.",
    "For now, if you’re happy to view in HD SDR and you have a device that can download the HBO Max, then dive in and prepare to be overwhelmed by the content here.",
    "Currently, HBO Max is only available in the US.",
    "For HBO newcomers, it’s easy. You sign up for a free seven-day trial and then pay the $14.99-a-month subscription fee.",
    "The question is, do existing HBO subscribers have access to HBO Max? While the $15 fee remains the same, the question of the free upgrade to HBO Max depends on a number of factors.",
    "Those with an HBO Now subscription through one of the following subscription providers are automatically eligible for Max: HBO, Apple, Google Play, and Samsung TV apps, Hulu, Consolidated Communications, Verizon, Optimum, Verizon, and HBO Now gift cards. If your provider is listed above, all you do is sign-in to the HBO Max app with your existing HBO Now login and password.",
    "Got an HBO subscription through their cable or satellite provider? You’re eligible if you watch via Altice One, Atlantic Broadband, Apple TV Channels, AT&T TV, AT&T U-verse, Cox, DIRECTV, Optimum, RCN, Spectrum, Suddenlink, Verizon FIOS, WOW!, and Xfinity.",
    "AT&T wireless customers on the following plans have HBO Max included without paying extra: Internet 1000, Unlimited Elite, Unlimited Plus and Unlimited Plus Enhanced, Unlimited Choice and Unlimited Choice Enhanced, Unlimited &More Premium.",
    "The HBO app is available on iOS, PS4, Xbox One, Android, Android TV, Apple TV and Samsung Smart TVs. You can watch it through major desktop browsers, too.",
    "If you access HBO Now through an Amazon Prime add-on, you’re splat out of luck. At time of writing, the list of supporting devices is also woefully absent of two streaming big-hitters: Amazon and Roku have yet to finalize any deals to host HBO Max. This is one of HBO Max's biggest misses as it stands.",
    "Why reinvent the wheel? So goes the thinking behind the HBO Max app, which, if you’ve used Netflix, Amazon Prime, Hulu or Disney Plus apps, will feel delightfully familiar. Content is presented in rows, under various categories and headings.",
    "Take a scroll down the home screen and after the top banner, you’ll find (at the time of writing) Featured Series, Max Originals, Features Movies, Harry Potter, HBO Series: Editor’s Picks, and then the HBO Max Hubs.",
    "Click on one of the hubs, and you’ll arrive at that specific content vertical. At the top, you’re given the option to toggle a tab from Featured (the default setting) or A-Z. On Featured, for example, the DC brand includes a sliding banner of spotlighted content, then different DC-specific headings like Epic Origin Stories, or Gotham’s Joker.",
    "This latter category features everything the Joker appears in, across all of the cinematic and small-screen universes, live-action and animated. It’s these small touches that make this app a little less rote and more anticipatory of users’ needs.",
    "That is one of the best features of the HBO Max app: the ability to narrow down into specific sections beyond just genres (action, drama, horror, etc). For younger watchers, and parents in particular, we can see the “character” heading being particularly helpful. Kids’ Character Collections is a curated section that gives moms and dads the chance to see for example, all Scooby Doo content in one place.",
    "The rest of the homepage feels similarly to Disney Plus in terms of its curated content: this doesn’t feel like a random assembly of titles conjured by an algorithm. Where Netflix often spews out nonsensical recommendations, the HBO Max sections suggest a human touch.",
    "Another great example is Blockbuster Franchises. This takes you to a page with each franchise and its titles. For example, three of the Die Hard movies are available at the time of writing. Completists will be consoled by the fact that it’s at least easy to spot the gaps without furtively searching. Double Features are another fun subcategory here that make it simple to watch a double bill in an evening.",
    "This is where HBO Max shines. It’s tough trying to pin down HBO Max’s strategy in terms of luring in customers: which piece of the content pie is the bait? In terms of volume, the sheer amount of content here certainly puts its fellow mainstream competitors, Netflix, Amazon Prime, et al. in the shade.",
    "The current content libraries available, also known as the HBO Max hubs, are HBO, DC, Sesame Workshop, TCM, Studio Ghibli, Cartoon Network, Adult Swim, CrunchyRoll and Looney Tunes.",
    "Warner gets the limelight in terms of where its content is positioned in the app. That’s no surprise considering the billions AT&T sunk into securing licensing deals for shows like Friends, The Big Bang Theory, The Fresh Prince of Bel-Air and Rick and Morty, as well as content from other Warner subsidiaries such as New Line Cinema (the entire Nightmare on Elm Street series is here).",
    "The biggest surprise is the inclusion of all eight Harry Potter movies to stream, especially as it was expressly stated that they wouldn’t be. Other goodies raided from the Warner catalog include a wide variety of Looney Tunes cartoons, and the DC Extended Universe. Weirdly, Man of Steel, the movie that kickstarted that particular cinematic world, is absent.",
    "That’s not where the glaring omissions end. None of the Superman movies are available. Birds of Prey, the newest Warner Bros. DCEU flick isn’t included, perhaps because it's a little too new. One of the biggest absentees? Christopher Nolan’s Dark Knight trilogy.",
    "This might be due to existing licensing deals, since the movies were recently on Netflix. In that regard, it’s hard to predict which upcoming Warner flicks will make the leap to HBO Max. Likewise, if you’re wanting to watch the entire Hobbit trilogy you’ll be stuck as the second instalment, The Desolation of Smaug, isn’t included.",
    "Naturally, HBO’s entire line-up is along for the ride, offering users immediate access to every show and movie under the flagship banner. An expected, that’s still not to be overlooked considering the frequency with which HBO is churning out top-shelf original programming. This is a treasure trove of sterling television that includes The Sopranos, The Wire, Game of Thrones, Six Feet Under, Big Love, Barry, Succssion, and more. New episodes of HBO shows are added as they air.",
    "A batch of Turner Classic Movies make the grade, and while that range of classics doesn’t necessarily threaten Criterion’s streaming service, the likes of Casablanca and Gone with the Wind serve as a solid introduction for golden oldies newcomers.",
    "HBO Max’s homegrown offerings, shows and movies dubbed Max Originals, are part of a plan to try and outshine Netflix. The original programming roster carries only six titles at launch - the Anna Kendrick series Love Life, The Not Too Late Show with Elmo, fashion reality show Legendary, kids' crafting competition Craftopia, a brand-new crop of Looney Tunes cartoons and On The Record, a Russell Simmons documentary.",
    "It’s not charging out of the gate with a stacked slate, but it's the promise of future Max Originals that’s got our taste buds tantalized. One of the biggest draws is the long-awaited Game of Thrones prequel The House of the Dragon, estimated to land in 2022.",
    "Currently in development are three Max Originals from JJ Abrams’ Bad Robot production company: Overlook, a ten-episode The Shining spin-off, Duster, about a getaway driver, and the third, as-yet-unnamed show featuring characters from the DC property Justice League Dark. One of the more recent acquisitions set to drop in 2021 is the notorious “Snyder Cut” of the 2017 DC Extended Universe film, Justice League.",
    "The large majority of users who choose to access HBO Max through smartphones, tablets, and smart TVs, will be satisfied with the default HD/SDR streaming option with Dolby Digital 5.1 audio.",
    "Those whose TV set-up boasts 4K capabilities and HDR might already be accustomed to streaming 4K / HDR content through Netflix, Amazon Prime, Vudu, Disney Plus or Apple TV. While for Netflix, that quality boost comes with a $3 premium attached, taking its monthly subscription to $16 a month, for many the cost is worth it for the 4K HDR, Dolby Vision, and Dolby Atmos content thrown in too.",
    "Sadly, HBO Max has yet to offer any 4K/HDR content.",
    "There’s no option to cough up a few extra bucks a month for the privilege, either. It’s a little disheartening, especially as a decent chunk of its top-tier movies - such as Alien and Joker - can be viewed in 4K HDR on physical media, and are all the better for it.",
    "While it’s a shame, it’s not a surprise that the only streaming option is HD, as that’s the only format offered on HBO cable, HBO Now and HBO Go.",
    "Certainly, this feels like a missed opportunity to showcase certain HBO IPs. In particular? Game of Thrones’ downright necessary 4K HDR version of the Battle of Winterfell episode. The HBO Original series’ fight-heavy, nighttime episode received immediate backlash, as those streaming it live struggled to see the action engulfed in blobs of darkness.",
    "That’s not to say HBO Max doesn’t have better video quality in its crosshairs; a spokesperson confirmed to TechRadar that \"4K HDR will not be available on HBO Max at launch but we look forward to delivering this in the future.\"",
    "In terms of watching offline, the HBO Max app does give you the option to stream and download only over Wi-Fi, to help you avoid hitting data caps. You can also choose from the Fastest Download or Highest Quality options, although it doesn’t reveal what quality is offered for that fast download."
  ],
  "headers": {
    "0": "The One-Minute Review",
    "7": "HBO Max price and availability",
    "15": "HBO Max app design and UI",
    "22": "HBO Max content library",
    "33": "HBO Max quality and viewing experience",
    "41": "Don't subscribe if..."
  },
  "links": {
    "Click to head to the HBO Max website to find out more and sign up": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-3057167249487483000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhbo-max",
    "At $14.99 a month": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1106503345423177600&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhbo-max",
    "Harry Potter movies": "https://www.techradar.com/how-to/how-to-watch-the-harry-potter-movies-in-order",
    "The House of the Dragon": "https://www.techradar.com/news/house-of-the-dragon",
    "Snyder Cut": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "confirmed to TechRadar": "https://www.techradar.com/news/hbo-max-launches-without-4k-and-hdr-streams-but-theyre-coming-eventually"
  }
}