{
  "source": "https://www.techradar.com/reviews/huawei-watch-gt-2e-review",
  "title": "Huawei Watch GT 2e review",
  "category": "wearables",
  "updated": "2020-05-08T04:00:10Z",
  "author": "ammara-rounaq",
  "summary": "Sportier but not smarter",
  "verdict": "Huawei’s Watch GT 2e is a surprisingly solid and versatile fitness tracker that also serves up smartwatch staples like viewing notifications, swapping watch faces, storing music and checking the weather, making it a useful companion for your next workout. It also delivers on its promise of long battery life. However, there’s not much point in buying one if you’re not into fitness.",
  "pros": [
    "Long battery life",
    "Great fitness tracking",
    "Affordable price"
  ],
  "cons": [
    "Limited software functionality",
    "Limited compatibility with iOS devices",
    "No third-party apps"
  ],
  "article": [
    "Huawei’s Watch GT series wearables are better known as stripped down smartwatches with great design, impressive battery life and solid fitness tracking. The only sore points being their lackluster software and expensive price tag, which make them hard to recommend.",
    "With the Watch GT 2e, Huawei has shed some features from the Watch GT 2, lowered the price tag and directed focus to the GT series’ strongest selling points - battery endurance and versatile fitness tracking - now at a more affordable price.",
    "The Huawei Watch GT 2e has a lot of hardware features such as an AMOLED display, GPS and continuous heart rate monitoring, as well as the ability to track a multitude of sporting activities, but does it do enough to warrant your consideration?",
    "The Huawei Watch GT 2e is on sale now in the UK, but there’s no clear on sale date for the US or Australia. We’ve asked Huawei to confirm if the device will be coming to those markets, and we’ll update this review if we hear more.",
    "The Huawei Watch GT 2e costs £159.99 (around $200, AU$300) in the UK, and you can buy it from a variety of retailers including Argos.",
    "The Watch GT 2e hits store shelves across selected retailers and online shops in the UAE on May 14 for AED 599. Pre-orders start on May 7 and run until May 13. If you order during this time, you can nab yourself a pair of complementary Huawei FreeBuds Lite.",
    "Whereas the Watch GT 2 came in two dial sizes, the Watch GT 2e comes in just one - 46mm. As far as the straps go, you have a choice between a regular looking Graphite Black or sportier Lava Red and Minty Green, which come with perforations similar to Nike’s straps for the Apple Watch.",
    "We like the design direction Huawei has taken with the Watch GT 2e, which moves away from the professional classic look of the Watch GT 2 and takes on a modern style that suits a younger and more active generation. The biggest change is in the way the strap meets the watch body. The strap is now seamlessly integrated into the top and bottom of the watch, as with the Apple Watch, making for a comfier fit around the wrist where the fluoro rubber straps sit more snugly for accurate monitoring and data collection. Changing straps is a breeze with a pin mechanism that makes it easy to swap between your favorite bands.",
    "The round crowns from Watch GT 2 have also been changed on the Watch GT 2e. There are now two flat buttons with tapered edges for convenience and to prevent mistouches when your palm bends backwards towards your wrist during exercise.",
    "The watch body is a combination of sturdy plastic and stainless steel with the top clad in glass that’s smoothed off at the edges for a seamless look. Around the rim you’ll find small markings that look more modern and pleasing than the markings found on the Watch GT 2.",
    "Display-wise, you get a gorgeous 1.39-inch AMOLED touchscreen that’s nippy and responsive, with a crisp 454 x 454 resolution (326ppi). It’s bright too, and you’ll have no trouble reading data on the Watch GT 2e, even underdirect sunlight. There’s also an option to have always-on display if you don’t like blank screens, but it will be a strain on the battery’s stamina.",
    "The Watch GT 2e’s main highlight is a slew of new workout modes that can track anything from running, swimming, cycling to more unconventional activities like parkour, ballet, skateboarding and belly dancing. If you can do it, the Watch GT 2e will probably be able to track it with decent accuracy.",
    "The watch has a water resistance rating of 5 ATM, which means it can survive a short trip underwater up to 50 meters. So, while you can’t go scuba diving with it, you can still partake in shallow water activities like swimming.",
    "When you get moving, the Watch GT 2e can automatically detect six types of workouts and start logging data. Afterwards, you can see a reasonably detailed summary of your activity straight from your wrist before syncing it to the app to see more comprehensive charts or share your workout on social media.",
    "We stuck to more conventional forms of exercise - indoor cycling, running and HIIT. In comparison to the Garmin Vivoactive 4 and the Apple Watch 4 for a couple of sessions, the Watch GT 2e produced similar tracking information, with a few numbers off here and there for pace, steps taken, heart rate bpm and distance covered. The only stat we found consistently different by a large amount was calories burned, which always ended up higher by 50-200 on the Watch GT 2e compared to other fitness watches.",
    "One area where we found the Watch GT 2e to be better than the Garmin Vivoactive 4 was GPS tracking wherein the Watch GT 2e was able to more accurately track the route taken.",
    "There were also a few issues syncing certain workouts to the app, but since all basic information is stored on the watch itself and easily accessible, we weren’t too bothered. Hopefully the issue will be fixed with a software update.",
    "Aside from exercise, the Watch GT 2e also keeps track of the number of steps you’ve taken throughout the day, all-day stress levels, continuous heart rate and even sleep quality, with detailed charts on the app, if you wear the watch to bed.",
    "There’s an SpO2 sensor, a new feature that measures level of blood oxygen saturation, which can help gauge how well your body is absorbing oxygen.Do you really need to know your blood oxygen saturation levels? Possibly not, but it can hint at your body’s overall conditioning or point to an underlying issue like sleep apnea. It’s a feature that’s becoming common on Garmin devices, and will likely be adopted by other fitness brands in the coming future.",
    "The Watch GT 2e uses Huawei’s ownKirin A1 chip made for wearables with double the RAM found on the original Watch GT 2. That means it comes with4GB instead of 2GB. It uses Huawei’s own LiteOS to run things on the software side, and it keeps the UI basic so it’s easy to get to grips with.",
    "Swiping left or right from the watch face will take you through basic information like steps taken, calories burned, average heart rate, stress level and weather. All of these can be changed to display your favorite stat screens. Swiping up from the main watch face shows you all your notifications in a list, while swiping down shows you battery statistics and quick settings.",
    "The top button on the edge of the watch is how you access the menu, which presents all of the watch’s features in a neat list. That same button is also used as a way to go back. Pressing the bottom button can be tweaked to set up a shortcut, but by default it brings up a list of your favorite workouts.",
    "For further tinkering, you’ll have to head over to Huawei’s Health app where you can tweak settings, set up notifications, see in-depth information pertaining to workouts and health, such as visualized graphs on sleep data and heart rate measurements.",
    "Unlike the Watch GT 2, there’s no built-in speaker or microphone on the Watch GT 2e. There’s also no 4G/LTE version, which means you’re tethered to your smartphone.",
    "Smartwatch features do exist here, but they’re kept to a minimum. You get notification support from apps on your phone but there’s no way to interact with those messages. The watch may come with GPS, but there’s no maps app for navigation and other missing features include NFC for contactless payments or third-party apps. That means you’re limited to what is pre-installed here.",
    "You can also customize the watch face by selecting the ones stored on the watch or switch things up by installing from a varied list accessible through the Huawei Health app. If none of those catch your fancy, you can select a photo of your choosing from your photo album. The varied watch face selection is nice but a stark reminder of just how much you can’t do with the Watch GT 2e.",
    "Since there’s no third-party app support you can’t play offline playlists from Spotify, but you can store your own music directly on the watch. It has 2GB of space, which is around 500 songs. To listen to music, you can pair any Bluetooth earphones with a simple process.",
    "Huawei claims that much like its predecessor, the Watch GT 2e’s 455mAh cell can last two weeks on a single charge, though in practice it depends on how you use it. With continuous heart-rate monitoring, GPS tracking and music playback, you’re more likely looking at battery life of five to eight days.",
    "Even with heavy fitness tracking (two to three hours per day) with continuous heart rate monitoring and GPS enabled, the Watch GT 2e can last five to six days, which is pretty decent and surpasses battery stamina found on high-end offerings from Garmin, Apple and Samsung.",
    "When the watch runs out of juice, charging is a quick affair using Huawei’s proprietary compact charging cradle that can recharge from zero to full in just under an hour and a half. This watch won’t work with generic wireless chargers.",
    "The Huawei Watch GT 2e is a surprisingly solid fitness watch with plenty to offer fitness fans no matter what kind of activity they might be into. From ballet to boxing, gym activities to outdoor sports like running, swimming and cycling; there’s a way to track and gain insight to crucial fitness data.",
    "You won’t have access to third party applications or any of the bells and whistles that usually come with a smartwatch that runs Wear OS or watchOS. You’ll mostly be limited to using the watch as a fitness tracker that can push some notifications from your phone, but the smartwatch features that are present generally work well.",
    "What you do get is an impressively long battery life and solid fitness tracking in a comfortable sporty design. Plus, it’s all available for a remarkably affordable price.",
    "The Watch GT 2e is for active people who want to track a variety of indoor and outdoor activities and don’t want to spend a lot on a fancy fitness tracker and also don’t particularly care about full-fledged smartwatch features.",
    "You get similar metrics to those found on high-end Garmin watches, although without their polished advanced modes. Unlike those high-end watches, you get a massive battery life and great value.",
    "Buy it if you’re looking for reliable fitness tracking for your outdoor and indoor training activities and want a device that won’t break the bank.",
    "While it's missing a few features that some would consider essential to a smartwatch experience such as answering calls, NFC and third party app support, there’s still a lot of features here that give you a good bang for your buck.",
    "The Watch GT 2e’s long battery life combined with versatile fitness tracking and ease of use make it easy to recommend.",
    "First reviewed: May 2020"
  ],
  "headers": {
    "3": "Huawei Watch GT 2e price and availability",
    "7": "Design and display",
    "11": "Fitness and health monitoring",
    "19": "Software and performance",
    "27": "Battery life",
    "30": "Verdict",
    "33": "Who’s it for?",
    "35": "Should you buy it?"
  },
  "links": {}
}