{
  "source": "https://www.techradar.com/reviews/tcl-10-pro-review",
  "title": "TCL 10 Pro review",
  "category": "phones",
  "updated": "2020-05-20T16:24:09Z",
  "author": "jon-mundy",
  "summary": "A curvy design hides some sharp edges",
  "verdict": "The TCL 10 Pro sports some eye-catching hardware, including a slick design and a physically well-integrated quad-lens camera. But there are significant snags throughout, such as an oddly calibrated AMOLED display and a camera that yields inconsistent results. It’s not a bad phone, but you can get so much more for the money, whether you’re minded towards Android or iOS.",
  "pros": [
    "Flagship-like design with no camera bump",
    "Large curved AMOLED display",
    "3.5mm headphone jack"
  ],
  "cons": [
    "AMOLED display not the best example",
    "Unreliable camera",
    "Abrasive edge"
  ],
  "article": [
    "The TCL 10 Pro looks and even feels quite a bit like a flagship phone, but a handful of rough edges can’t quite be waved away on the strength of some lower mid-range pricing.",
    "Its curvy AMOLED display, quad-lens camera, and dapper design make a strong first impression. Elsewhere, little touches like a dedicated Google Assistant button, a 3.5mm headphone jack, and a completely flush camera module mark the TCL 10 Pro out as something a little bit different from the norm.",
    "But there are faults and flaws across the board that take the sheen off. For example, the TCL 10 Pro’s AMOLED display exhibits a somewhat sickly green tinge, and it doesn’t get very bright. Sitting just underneath that display, meanwhile, there’s an unreliable and sluggish in-display fingerprint sensor that may just drive you to frustration.",
    "The TCL 10 Pro’s ostensibly svelte design hides its own issues too, such as an uncomfortably pronounced ridge on the bottom rear edge. And we would have happily indulged a form-spoiling camera bulge if it meant that the images it took weren’t so wildly inconsistent.",
    "TCL’s custom UI is far from the most egregious example of Android tinkering, and plenty of Google’s stock OS shines through. But you still get a smattering of bloatware, while bespoke features like the edge interface seem to be born from the early era of curved displays.",
    "Performance is acceptable, for the most part, but it’s not unheard of to get superior processing power at this price. We’re thinking of the Huawei Nova 5T and the Realme X2 in particular, not to mention the 2020 iPhone SE.",
    "On the bright side, battery performance is pretty good, and you’ll be able to clear a full day of usage without issue. You’ll have to make do without wireless charging, but that’s hardly the norm at this end of the market (though the iPhone SE says hi again).",
    "While it’s a solid attempt to put the TCL brand on the map, the TCL 10 Pro finds itself falling in between two stools. You can spend a little more and get something much more fluid and capable, or spend a little less with hardly any compromises and even one or two improvements.",
    "All the while a certain iPhone SE stands astride those very same two stools with a phenomenally compelling package at almost the same price. While it’s far from a bad phone, it’s difficult to see where the TCL 10 Pro fits into this picture.",
    "The TCL 10 Pro is set to launch on Monday June 1, 2020 in the UK and Australia, and May 19 in the US, costing $449 / £399 / AU$899. There’s just the single model available, which comes with 128GB of storage.",
    "While this price is at the lower end of mid-range territory, it still pitches the TCL 10 Pro in amongst some classy rivals. There’s the freshly discounted $499 / £469 OnePlus 7T at the top end, and the $350 / £300-ish Realme X2 and Huawei Nova 5T just below.",
    "Meanwhile, just around the corner we have the imminent arrival of the Xiaomi Mi 10 Lite, which promises to provide a similar hardware package with the bonus of 5G connectivity for just €349 (roughly $380, £310, AU$640).",
    "Google’s Pixel 4a should provide some stern opposition too, with extra camera clout and the cleanest software around virtually guaranteed.",
    "But we should really address the elephant in the room here. The TCL 10 Pro is one of the first phones to bear the full force of the iPhone SE hurricane. You have to feel a little for TCL, which finds itself at ground zero in terms of both release date and pricing.",
    "The TCL 10 Pro feels nice and balanced in the hand, with dimensions that more or less match those of the OnePlus 8 and the Realme X2 Pro (give or take the odd millimeter). At 177g, it has got a pleasing heft to it without being ridiculously heavy.",
    "TCL has clearly worked very hard to give the 10 Pro the basic look and feel of a flagship. It’s got the whole glass and metal sandwich thing down, just like all the top flagships.",
    "Of course, when you move straight across from such classy customers as the OnePlus 8 Pro and the Huawei P40 Pro as we did, the differences in build quality are obvious. Only one in particular is troublesome, though, and that’s the presence of pronounced ridges where the frame meets the glass back. The bottom edge in particular really grates against your palm and pinky finger.",
    "One design choice that’s arguably an improvement on those same flagships is the TCL 10 Pro’s camera module. While your opinion will vary on the attractiveness of its horizontal strip design, the fact that it’s completely flush with the phone really stands out. Or rather, doesn’t.",
    "Another flagship flourish is the implementation of a waterfall-style curved display. These are way more pronounced than the OnePlus 8’s and the Samsung Galaxy S20’s, with the screen melting right off the left and right edges. Whether or not you like the practical effect that this has on viewing and handling quality, there’s no denying it makes the TCL 10 Pro look pretty.",
    "The flagship features keep getting ticked off with an in-display fingerprint scanner. But we kind of wish TCL had just worked in an old fashioned rear-mounted solution. This one’s slow and unresponsive, with a few too many false reads for comfort.",
    "On the flip side, TCL has bucked current flagship expectations by including a 3.5mm headphone jack. This is increasingly rare even at this end of the market.",
    "Another fresh hardware inclusion is an additional hardware button on the left hand edge, which will bring up Google Assistant. This could be handy if you don’t fancy barking ‘Hey Google’ , or don't want to accidentally wake up your Google Home.",
    "The bottom edge of the phone, meanwhile, features a USB-C port and a solitary speaker. There’s no stereo sound provision here. But did we mention there’s a headphone jack?",
    "On the surface of things, the TCL 10 Pro comes up with the display goods. It’s got a 6.47-inch 1080 x 2340 AMOLED display, which supplies way punchier colors and deeper blacks than the LCD panels offered by, for example, the Huawei Nova 5T.",
    "Again, though, switching directly over from a phone like the OnePlus 8 highlights the second class nature of this component. There’s a slight greenish tinge to it in default Vivid mode, which is emphasized when you hold the TCL 10 Pro at a slight angle, while reds pop to a distracting degree.",
    "This may be because we’re so used to Samsung’s AMOLED displays by now - the South Korean manufacturer supplies the vast majority of the smartphone AMOLED market, after all.",
    "This is TCL’s own display, and it’s good to see competition in any marketplace. But when flanked by the AMOLED displays of the more expensive OnePlus 8 and the cheaper Realme X2, the comparison isn’t particularly flattering.",
    "It’s possible to tinker with the color tone, as you might hope, with three main presets and a color tone ‘warmth’ slider. But we could never quite get a wholly satisfactory result, and the process is confused by a NXTVISION visual enhancement mode that locks you into that Vivid default. We ended up deactivating the latter anyway in an attempt to rein in the over saturation, which proved effective only to a point.",
    "There’s an optional real-time HDR enhancement mode that will supposedly ‘upscale’ streaming SDR (standard dynamic range) video and photo content to HDR. But to be honest, we struggled to notice a huge effect, or to even find an everyday means for putting such a feature through its paces.",
    "On the plus side, the phone has full Netflix certification, so you’ll be able to stream Full HD HDR10 content in all its glory.",
    "While we’re picking up on the display’s shortcomings, it’s not great in direct sunlight. It simply doesn’t get quite bright enough, it seems, leading to excessive reflections.",
    "Ultimately, the TCL 10 Pro’s display feels like it belongs to a previous generation of AMOLED technology, before Samsung got a handle on it and tamed all those resplendent colors.",
    "One of the practical features that AMOLED technology enables is the TCL 10 Pro’s curved edges. We’ve already mentioned that this looks good, but there are the usual issues with color distortions over the curved corners that you’ll either care about or won’t.",
    "TCL has attempted to justify this as more than an aesthetic conceit by including an Edge Bar software feature. Swipe up or down one edge of the phone, and a little side overlay will pop out, granting speedy access to your favorite apps.",
    "Samsung took a similar approach in the early days of its own curved-screen experiments. And when it comes to practical usefulness, your mileage may vary. But as there’s no inherent reason why this couldn’t be done on a flat display, we’re inclined to label it a gimmick and move on.",
    "The TCL 10 Pro packs in four rear cameras, but it’s not quite as comprehensive an offering as you might assume. None of the cameras have a telephoto lens, meaning any zoomed shots are cropped, and one of the lenses is dedicated to capturing depth data for the others. Still another is a 5MP macro lens, which is never a provision we find particularly useful.",
    "Still, the phone’s setup is led by a 64MP f/1.8 camera with a 1/1.7-inch sensor, and that's accompanied by a 16MP ultra-wide camera. Which isn’t too shabby at all. Indeed, the TCL 10 Pro is capable of capturing some really good, detailed shots in good lighting, and even some serviceable night time shots.",
    "You’ll need to hold the TCL 10 Pro in place for a number of seconds while taking these ‘Super Night’ mode shots, but the difference in quality between these and simply leaving the phone’s auto mode to handle things is marked.",
    "It’s all relative, of course. Comparing these same night shots to very similar ones taken with the OnePlus 8 - which is hardly a shining example of the camera phone format - shows that the TCL 10 Pro is lagging well behind even the third or fourth tier.",
    "But night mode is still quite an advanced feature, and it works here at a basic level. What we’re really disappointed about with the TCL 10 Pro’s camera is how inconsistent and glitchy it seems to be in regular conditions. Let’s set aside the annoying watermark that finds its way onto your shots by default, as this can at least be turned off in the Settings menu.",
    "More problematic is the TCL 10 Pro camera’s AI system, which automatically adjusts exposure and color and picks out scene types. It’s simply not as good as rival efforts from Huawei and Xiaomi. In the odd shot that we took in really quite normal, well-lit conditions it would oversaturate colors to a crazy degree, with the kind of brilliant greens you might expect to see on an alien planet in a particularly lurid video game.",
    "Elsewhere, the AI seemed wholly unable to balance brighter elements, such as the pure white petals of some lilies, making them look like weird garden lamps. And while the 24MP selfie camera takes reasonably crisp shots, it too seems to struggle with bright spots, like the early evening sky or the sun shining off this writer’s (admittedly pale) head.",
    "Close-up indoor food pictures with reasonable natural lighting look quite appetizing at first glance, but there was a tendency to pump up the reds and greens to an unnatural degree. On a couple of occasions the AI algorithm couldn’t make its mind up whether it was taking a food shot at all, and kept flipping between two modes, revealing an unwitting flip-book illustration of the unnaturalness of this effect.",
    "We encountered another glitch when we got to reviewing a bunch of our photos, with around half a dozen out of 70 or so shots inexplicably orienting in portrait when we quite clearly shot them in landscape.",
    "Portrait shots are far from a total write-off, but you will get that distinctive fuzzy-edge effect that most cheaper cameras produce. We got some odd artifacts with portrait selfies, too. It’s generally best to stick with the phone’s ‘natural’ levels of bokeh when shooting any kind of close-up.",
    "The TCL 10 Pro’s camera does close up and zoomed right out, with a little Night mode magic stirred in. Here’s a selection of photos that shows off its ability to take crisp well-lit shots, just about passable night shots, and plenty of crazy over-saturation in between.",
    "The TCL 10 Pro runs on a Snapdragon 675 chipset, and is backed by 6GB of RAM. It’s not a terrible setup for a lower mid-range phone in 2020, though you can get much faster for similar money.",
    "Way out ahead you have a couple of phones running on 2019’s flagship hardware, such as The OnePlus 7T and the Huawei Nova 5T. The iPhone SE, of course, runs on Apple’s top-end A13 Bionic CPU.",
    "Even when it comes to purpose-built mid-range hardware, though, the Snapdragon 675 isn’t the newest option in Qualcomm’s range. It was powering the likes of the Moto Z4 around this time last year, and we’ve since seen the superior Snapdragon 730 and 730G finding its way into phones such as the Samsung Galaxy A80 and the Realme X2.",
    "The TCL 10 Pro is undeniably slower than its rivals. An average Geekbench 4 multi-core score of just over 4,000 stands at around 40% less than the Realme X2 and its Snapdragon 730G.",
    "While it’s no racehorse, though, the 10 Pro still runs smoothly enough. The camera app fires up nice and quickly, skipping between multiple open apps is breezy enough (doubtless thanks to that generous RAM allotment), and home screen navigation typically feels nice and fluid.",
    "We were even able to play CoD Mobile and Unkilled on High settings without too much of an issue - though obviously it wasn’t as slick an experience as on more capable phones. Recent graphical showcase Forza Street exhibits the odd stutter, but again is perfectly playable - though the TCL 10 Pro’s dim, unbalanced display doesn’t do the game’s night-time-neon visual style many favors.",
    "The TCL 10 Pro’s software utilizes a custom UI on top of Android 10. But the TCL UI isn’t the worst take on Google’s operating system we’ve ever seen.",
    "The menus and icon designs stick close enough to stock Android to feel sufficiently slick and intuitive, and there’s no attempt to replace the Google Feed to the left of the home screen. Which is as it should be.",
    "TCL is happy to let Google do most of the heavy lifting on the app front, with essentials like email, messaging and web browsing all covered by Google for the most part.",
    "The 10 Pro isn’t entirely without software issues or bloatware, however. TCL supplies its own Music, Gallery, Video, File Manager, and web browser alternative, while in the UK at least BT Sport comes as a rather random optional pre-load at the outset. And the app drawer (should you choose to display it) is laid out really counter-intuitively, with downloaded apps divided into categories.",
    "The lock screen, meanwhile, feels like it wastes the space and AMOLED technology it’s been given. Yes, you can have it keep a permanent low-power read out of the time and date, but the only way to make a useful amount of notification information appear there is to select the ‘Classic’ (i.e. non-TCL) approach in the Settings menu.",
    "We’re glad there’s the option, and indeed this is quite a customizable UI in general. But not everyone will go delving into these deeper menus. The default software offering should be better.",
    "The TCL 10 Pro comes with a 4,500mAh battery. That's pretty large when you consider that The OnePlus 8’s is 4,300mAh and the Realme X2 Pro’s is a mere 4,000mAh. Those are two higher-end devices.",
    "And with a low-powered chipset and an AMOLED display that doesn’t get crazy bright, the TCL 10 Pro will get you well into a second day of moderate usage. Inevitably, more intensive usage will eat away at the battery life a lot quicker, but it’s really nothing to be concerned about.",
    "One hour of Netflix streaming, with the brightness set to full, lost us 8%. That’s pretty similar to the Realme X2’s 7%, and significantly better than we got with the Huawei Nova 5T.",
    "Meanwhile our standard 90-minute looping HD video test drained just 10%. When you consider that the Realme X2 Pro drained 13% in the same test, you’ll appreciate that TCL’s frugal approach has paid off in this respect.",
    "The TCL 10 Pro also supports 18W fast charging, which it claims can get you from 0 to 50% in 35 minutes. In our own day to day usage, we observed that half an hour of charging with the battery at 27% yielded a 37% gain.",
    "It’s far from the fastest charging on the market but it’s competitive. The Realme X2’s 30W solution is quite a bit better, but we got similar practical results with the Huawei Nova 5T’s 22.5W method.",
    "First reviewed: May 2020"
  ],
  "headers": {
    "9": "TCL 10 Pro price and release date",
    "14": "Design",
    "23": "Display",
    "35": "Camera",
    "45": "Camera samples",
    "46": "Specs and performance",
    "52": "Software",
    "58": "Battery life",
    "64": "Don't buy it if..."
  },
  "links": {
    "Huawei Nova 5T": "https://www.techradar.com/reviews/huawei-nova-5t",
    "Realme X2": "https://www.techradar.com/reviews/realme-x2-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "OnePlus 7T": "https://www.techradar.com/reviews/oneplus-7t",
    "Xiaomi Mi 10 Lite": "https://www.techradar.com/news/xiaomi-just-launched-the-cheapest-ever-5g-phone-with-some-pretty-decent-specs",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Realme X2 Pro": "https://www.techradar.com/reviews/realme-x2-pro",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Huawei P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Moto Z4": "https://www.techradar.com/reviews/moto-z4-review",
    "Samsung Galaxy A80": "https://www.techradar.com/reviews/samsung-galaxy-a80-review"
  }
}