{
  "source": "https://www.techradar.com/reviews/honor-magicbook-pro-2020-16-inch-laptop",
  "title": "Honor MagicBook Pro (2020) 16-inch laptop review",
  "category": "computing",
  "updated": "2020-09-08T08:30:57Z",
  "author": "desire-athow",
  "summary": "We’re getting frisky with a potential game changing notebook",
  "verdict": "The Honor MagicBook Pro is a great laptop that doubles as an exceptional mobile workstation thanks to an outstanding price-performance ratio. Shame about the placement of the webcam though.",
  "pros": [
    "Affordable",
    "Excellent performance",
    "Great build quality",
    "Speakers firing up",
    "Fingerprint sensor built into power button",
    "Magiclink feature holds some interesting promises"
  ],
  "cons": [
    "The pop up webcam",
    "No card reader",
    "No numeric keypad",
    "Smaller than expected battery",
    "Memory is soldered"
  ],
  "article": [
    "Honor has quietly found its place alongside its parent company, Huawei, as the up-and-coming challenger brand. Of the three laptops released by the brand at IFA 2020 in Berlin, the MagicBook Pro is the one which garners the most interest partly because of its very affordable price tag and its main target, the 16-inch Apple MacBook Pro. Could this be the best-value and most balanced mobile workstation on the market yet?",
    "At the time of writing, the Honor Magic Book Pro is on sale direct from the manufacturer in the UK, France and Germany with other territories likely to follow. Only one model is available, one with 16GB RAM and 512GB SSD and a price tag of £850, which includes a free Honor watch worth £120. That translates to a VAT-free price of about $940.",
    "The design language of the MagicBook Pro shares common features with the Xiaomi Mi laptop brand, the Dell XPS 15 and, of course, the Apple MacBook Pro. Note the Space Gray colour scheme paired with an aluminum chassis rather than a magnesium alloy one (lighter but also displaying more flex) and a frosted matte finish.",
    "With dimensions of 369 x 234 x 16.9mm and a weight of 1.7Kg, it doesn’t aspire to be the lightest or the thinnest although a screen-to-body ratio of 90% means that it is not much bigger than a 15.6-inch laptop when it comes to footprint.",
    "A long hinge connects the display, a 16.1-inch full HD IPS one, to the base. One thing that is immediately noticeable is the lack of holes on the bezel which means that the camera sensor and the microphones are located elsewhere.",
    "The HD webcam - based on the Omnivision OV9734 - is a pop-up type that resides inside a key between F6 and F7 and don’t worry, it won’t damage your screen if you happen to close the display without remembering to push down the webcam.",
    "There’s no numeric keypad and two speakers are hidden behind grills located on each side of the keyboard. A fingerprint reader (Goodix branded) is also located in the power button.",
    "The keyboard keys are almost apple-sque, almost nearly flush with the surface and backlit while the touchpad is generously proportioned but without any physical buttons. Shame about the stickers next to them though.",
    "An audio connector and two full size USB ports are located on one side and a type-C USB, a full size HDMI 2.0 and a full size USB on the other. The Type-C connector doubles up as a universal power port that is paired with the bundled Huawei-branded switching power adaptor. The latter delivers between 5V and 20V and between 2A and 3.25A, making it ideal for charging other devices as well.",
    "The base of the laptop contains two parallel rubber strips that act as raisers to allow air to cool the components inside via a perforated grill. There’s no card reader or Thunderbolt 3 connector.",
    "The highlight of the MagicBook Pro is the AMD Ryzen 5 4600H that powers it. It is a six-core processor with a base CPU speed of 3GHz, 11MB cache, 12 threads, six graphics cores running at 1.5GHz. Now there’s a good reason why a hexa-core model was chosen and that has to do with the fact that the base MacBook Pro model has a 6-core CPU, the Intel Core i7-9750HF, a CPU launched last year with a comparable 45W TDP.",
    "The 4600H is therefore faster, much faster than its Intel rival. The difference is even more marked once you include the integrated GPU, a Radeon RX Vega 6, one of the beefiest on the block.",
    "The rest of the configuration includes two 8GB memory modules (a total of 16GB, soldered), a 512GB WD SN730 PCIe NVMe SSD and a Realtek 8822CE 802.11ac (Wi-Fi 5) Wi-Fi card with Bluetooth 5.0. The battery - which is charged by a relatively compact 65W fast charger - is a 56WHr model, 40% smaller than Apple’s or the LG Gram 17; this has obviously a direct negative impact on battery life.",
    "Ladies and gentlemen, this is the fastest non-workstation laptop we have tested to date, conceding defeat on compute benchmarks to the almighty and undisputed king of the hill, the 16-core XMG Apex 15. The combination of a very fast processor, a capable graphics subsystem, ample system memory and a nippy SSD means that this is a supremely capable laptop that will easily take on the mantle of a mobile workstation.",
    "The fans kicked in only under load during the most intense parts of our benchmarks. Honor says that six temperature sensors and a cooling-fan motor with higher spin rates helps cool the laptop more effectively.",
    "The pleasant experience continues on to the screen: the display is a 300nits model with a 1000:1 rated contrast ratio and a 100% sRGB color gamut. While it is not bright enough when working in direct sunlight, the fact that it is matte reduces the glare that usually makes glossy screens almost unusable whenever it’s sunny. Out of the box, the image quality is, pun intended, clearly visible. Hardly any bleed, colours that pop out, just enough vibrancy, an all-round (subjective) success.",
    "The keyboard is likely to divide opinions as always; it has a much shorter travel which in turn impacts on the feedback, which feels sharper and less noisy. Again, that’s in line with the whole Apple experience. It is not distracting but those who like copious feedback when touch typing could be disappointed. As for the touchpad, it was a bit meh. We are fans of physical buttons and this one didn’t have any; sure it was responsive and of good size, but beyond that, it did lack character.",
    "The webcam is probably the only glaring weak spot of an overall very good product. While the picture quality is good, its fixed location means that interlocutors on your video conference calls will see you from a downward angle (see picture) when the laptop is on one’s lap. The problem is different on a table where its inflexibility becomes a clear flaw.",
    "At just over seven hours, the battery life is decent without being exceptional. Our best time was reached by the LG Gram 14 with well over 10 hours, a 50% difference. That said, the MBP achieved this with a 56WHr battery (8WHr per hour), making it less frugal than the Gram 14’s 73WHr (7WHr per hour). Note that you should be able to charge the device to 50% capacity in 30 minutes.",
    "As mentioned before, the obvious rival to the MagicBook Pro is the MacBook Pro 16-inch. The latter costs almost three times as much but comes with four Thunderbolt 3 ports, a much bigger battery, a higher-resolution display, six speakers and a discrete GPU. Whether or not the 200% premium is worth it is debatable but one thing that cannot be argued is that the MacBook Pro 16-inch is an exceptional workhorse.",
    "There are very few 16-inch Windows laptops at the time of writing, a slightly odd category that fits between the usual 15.6-inch models and the awkwardly bigger 17.3-inch ones.",
    "That said, we’d like to commend the LG Gram 17 which received our recommendation in July 2020 and a comment from our fellow reviewer, Bill Thomas, that this is a laptop that “can't actually be real”. Why? For a start it is the lightest 17.3-inch laptop ever built, it is even lighter than the smaller Apple’s MacBook Pro 13-inch albeit with a much larger footprint. While it does cost more than the Honor MBP, the Gram 17 has a bigger battery capacity, a higher screen resolution, Thunderbolt 3 ports and a numeric keypad. Some models also come with a dedicated Nvidia Geforce GTX 1650 GPU.",
    "The only other model worth mentioning is the HP Pavilion 16.1-inch notebook, a gaming laptop with an Intel Core i5-10300H and a dedicated Geforce GTX1660Ti GPU. It is far heavier than the MagicBook Pro, has a smaller battery and its quad-core CPU won’t stand a chance against the Ryzen’s hexa-core processor.",
    "We understand Honor’s desire to have a faceoff with Apple’s MacBook Pro but we have to question the wisdom of adding yet another screen size, one which is after all only half an-inch diagonally bigger than most of its peers.",
    "On the whole though, the MagicBook Pro is a great laptop to use, very well built and with a solid pedigree as it is essentially a Huawei device. It is mightily quick, has a good battery life and overall provides a very rounded and polished computing experience.",
    "Other than the questionable choice of having the webcam hidden in the keyboard, there’s a number of changes we’d advocate for the next iteration. Use a 16:10 panel - just like Apple’s - which will allow for more room above and below the keyboard.",
    "Doing so means you can get a proper numeric keypad - surely a must at this size - in and move the speakers above the keyboard. Next, try to fit a bigger battery even if it means bumping the price up; matching the 100WHr battery on the Apple MBP would be ideal. A memory card reader would also be appreciated as well as the inclusion of Thunderbolt 3 as a universal connector.",
    "Last but not least, we’d love to see a “Pro^2” version of the MagicBook Pro, one with an 8-core AMD Ryzen processor, a discrete GPU, 32GB of RAM, a pair of 512GB SSD in RAID-0 and Windows 10 Pro. That would be a landmark, flagship halo product that could propel Honor from the ranks of challenger to that of head turner."
  ],
  "headers": {
    "1": "Price",
    "2": "Design",
    "10": "Hardware",
    "13": "Performance and in use",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "16-inch Apple MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "UK": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=279855&clickref=trd-us-8940024978540627000&wgtarget=https%3A%2F%2Fwww.hihonor.com%2Funitedkingdom%2Fproduct%2Fhonor-magicbook-pro",
    "XMG Apex 15": "https://www.techradar.com/reviews/schenker-xmg-apex-15-mobile-workstation",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations",
    "video conference": "https://www.techradar.com/best/best-video-conferencing-software",
    "LG Gram 14": "https://www.techradar.com/reviews/lg-gram-14-2020-core-i7-10th-gen-laptop",
    "LG Gram 17": "https://www.techradar.com/reviews/lg-gram-17-2020",
    "HP Pavilion 16.1-inch notebook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/hp-pavilion-gaming-notebook-1306202/review"
  }
}