{
  "source": "https://www.techradar.com/reviews/kitchenaid-5ksb8270-artisan-power-plus-blender",
  "title": "KitchenAid 5KSB8270 Artisan Power Plus blender review",
  "category": "appliances",
  "updated": "2021-07-06T12:15:18Z",
  "author": "emily-peck",
  "summary": "The most powerful blender on the market",
  "verdict": "With variable speed control and a 3.5 peak horsepower motor, the KitchenAid 5KSB8270 Artisan Power Plus Blender is a fast and flexible design, but you’ll pay for the pleasure.",
  "pros": [
    "Very powerful",
    "Stylish design with matching appliances",
    "Variable speed control"
  ],
  "cons": [
    "Bulky base",
    "Basic control panel"
  ],
  "article": [
    "Synonymous with style, the iconic KitchenAid collection of small appliances includes stand mixers, coffee makers, toasters, food processors, and more. There’s also the KitchenAid 5KSB8270 Artisan Power Plus Blender, which boasts an impressive spec and claims to be the most powerful blender on the market. To find out if this head-turning design lives up to its promise, read our full KitchenAid blender review here and find out if it's worthy of a place among the best blenders around.",
    "When it comes to price, at £649 / US $835 / AUS $1,260 the KitchenAid 5KSB8270 Artisan Power Plus Blender is one of the more premium models available. While it does feature a high-quality finish and motor, you’re no doubt paying extra for the well-respected KitchenAid brand name.",
    "With its 3.5–peak horsepower motor and stainless-steel blade, the KitchenAid 5KSB8270 Artisan Power Plus Blender can easily take on a range of ingredients. It is designed to blend speedily through tough produce including frozen fruit and fibrous vegetables and also take on finer ingredients such as nuts and seeds.",
    "It has a net weight of 9.4kg, so it’s not an appliance that can be easily moved and stored. But with its stylish good looks and choice of three bold color finishes including red, grey and black, it’s likely you’ll want to show it off on your worktop as a permanent fixture – as long as you have the space for it that is.",
    "On the base of the blender, you’ll find relatively basic controls including 4 pre-set ‘Adapti-blend’ programs for smoothies, juices and soups and self-cleaning. These are illustrated with symbols, but on first glance we didn’t find it obvious what each symbol meant and had to consult the manual to confirm. There’s also a variable speed control that goes from 1 up to 11 to give you instant control over the speed of the blend.",
    "A 1.75 litre BPA-free dishwasher safe graded Thermal Control jar with soft touch removable handle sits on top of the base. We were surprised at how easily this can be placed on top, and there’s no need to fiddle around locking it into position. It’s worth noting that the spout of the jug isn’t that defined, so you will have to be precise when pouring liquids into your cup.",
    "While using the KitchenAid 5KSB8270 Artisan Power Plus Blender to make an avocado, banana and spinach smoothie we were pleased with the roomy opening of the vented lid design, which lets you easily add ingredients during the blend. It did a good job of blending the spinach into the mix, and crushing the ice in under 30 seconds too.",
    "Power is at the heart of the KitchenAid 5KSB8270 Artisan Power Plus Blender and it naturally revs up to quite a speed - when we turned the dial up to level 11 however, we found the noise uncomfortably loud. But when we used it to make a smoothie on level 5, it nudged an acceptable 99 decibels and worked a treat to blend the ingredients together very quickly. What we like most about the control panel is the START/STOP toggle, which - should things start to sound like a small aircraft is taking off in your kitchen - allows you to easily turn off the blender at any point you like.",
    "While it does have a few pre-set programs, this blender relies heavily on the manual speed dial, so you’ll have to guess how long ingredients should be blended for inside and hope for the best. You can hurry things along by using the ergonomic tamper that can be gripped comfortably in your hand to nudge any trapped foods down to the blade. We also like the removable measuring cap that comes in handy for adding small amounts of liquid or nuts and seeds – up to 60ml/2.0oz.",
    "It doesn’t come cheap but if you want to invest in a design that makes large batches of soups and smoothies, blitzes through ingredients with speed and invest in an iconic design that comes with matching appliances, then the KitchenAid 5KSB8270 Artisan Power Plus Blender is worth turning your head."
  ],
  "headers": {
    "1": "Price and availability",
    "2": "Design",
    "6": "Performance",
    "9": "Verdict"
  },
  "links": {
    "KitchenAid collection": "https://www.techradar.com/news/should-i-buy-a-kitchenaid-appliance",
    "coffee makers": "https://www.techradar.com/deals/best-cheap-coffee-makers-on-sale/best/best-coffee-machines",
    "best blenders": "https://www.techradar.com/best/best-blenders"
  }
}