{
  "source": "https://www.techradar.com/reviews/zebra-tc26-touch-computer",
  "title": "Hands on: Zebra TC26 Touch Computer review",
  "category": "phones",
  "updated": "2020-08-03T12:51:47Z",
  "author": "mark-pickavance",
  "summary": "More than a mobile phone",
  "verdict": "There is plenty to like here, but a few things could be better. It's a significant improvement over the TC25, but still has a few rough spots that need addressing.",
  "pros": [
    "Tough",
    "Interchangeable batteries",
    "Tons of accessories",
    "6-year Android warranty",
    "Android 10"
  ],
  "cons": [
    "Display lacks contrast",
    "Poor power button placement"
  ],
  "article": [
    "The Zebra TC26 is the natural development of the TC25 that appeared back in 2017, and that we’ve previously reviewed.",
    "It takes the same basic concept of a toughened for business data capture phone and addresses the greater hardware expectations a 2020 customer has over those three years ago.",
    "The TC26 has a better CPU, a bigger and better screen, more RAM and storage, a better camera and interchangeable battery solution. And, it uses Android 10, and not the Android 7.x Nougat platform that the TC25 was released.",
    "Except for the scanning hardware options, there are few areas that haven't been improved in both the hardware and software sides of this equation. And, this device is designed to function as part of a much broader technology ecosystem that enables information capture to be better integrated into existing systems, and the condition of the equipment to be proactively monitored. There are plenty of excellent features in the TC26 range, and a great selection of accessories to enhance it further. We just think that the ergonomics of it might need some adjustment for those more familiar with traditional button layouts and the screen lacks the contrast we’d prefer. Overall, this is a built-for-purpose device that delivers substantial improvements over its predecessor and almost writes the business justification itself.",
    "The cost of the TC26 is dependent on the model, and there are four possible options, and there are also the TC21 variants that don’t include mobile phone technology.",
    "Zebra makes two basic designs that don’t include the integrated barcode scanner or special connector on the rear. These are designated the TC26 No Scanner and the TC26 Basic.",
    "Uk prices start around £380 excl VAT, and scanner capable model is at least £80 more.",
    "But, the designs with the scanner and connector are the ones most customers will want, and they are nearer £460 excl VAT for the TC26 Plus with 3GB of RAM and 32GB of internal storage, and £510 excl VAT for the High Memory version, that comes with 4GB of RAM and 64GB of internal flash memory.",
    "As this product is distributed by a reseller network, depending on the quantity and service options, there is likely to be some flexibility on unit cost.",
    "To get all the upgrades and feature enhancements that Zebra offers an additionally a Mobility DNA license are required that costs an extra one-off amount equal to approximately 10% of the hardware outlay.",
    "The first question that anyone is likely to ask about the Zebra TC26 is if this is a computer or a phone?",
    "Our short answer to that is it doesn’t matter, as all phones are computers by definition. This one is packed full of technology that was primarily designed for phones to use, but if calling it a computer helps, that’s fine.",
    "A better word to describe it might be a ‘platform’, as its design has orientated the technology to make it a critical piece of a business use puzzle, while also being an android phone.",
    "Zebra makes two versions of this device, the Wi-Fi-only capableTC21 and Wi-Fi and 4G empowered TC26 reviewed here.",
    "As almost everything we’ll mention, except the mobile phone part, are replicated in the cheaper TC21, a good choice for those that don’t need the equipment to make mobile calls.",
    "The target audience for the TC26 is business operations where data gathering and verification are a regular part of the workflow, like in a warehouse or distribution centre. And for employees that need a simple to operate a device that connects their efforts to centralised data allowing the business to track, trace and identify products in the system for the purpose of stock control or quality assurance.",
    "The TC26 was conceived to cope with a long working day, capture data using data entry, its camera or barcode scanner, and link that information to ann extended information system seamlessly.",
    "There are various tropes in rugged phone design, and the Zebra TC26 sticks with many of them. These include the angled corners, high-visibility buttons, and channels to connect wrist straps and lanyards.",
    "It certainly feels sturdy in hand, and the thickness of this design is masked by having thinner edges that are chamfered towards the centre.",
    "The front face of the device has a slightly recessed glass surface that is only interrupted by two thin ports that are used to carry sound to the ear and microphone, respectively.",
    "The Corning Gorilla glass face covers almost the entire frontal area, being only a few millimetres short of the 158 mm length and 79 mm width.",
    "However, when you power the TC26 up, you realise that the screen doesn’t go all the way to the edges and is only about 110 mm long and 62 mm wide. Oddly, in imperial parlance, this is a 6-inch sized phone, with a 5-inch screen.",
    "The screen isn’t the only aspect of this design that’s unconventional when compared with a more traditional phone design, and most of these changes are designed to make it more robust or work better in the scanning and data capture roles.",
    "The truly radical parts of this design are the rear and top, as these incorporate the scanning hardware and the surface connectors that are used to mate the TC26 to the Zebra Trigger Handle. These features have resulted in the movement of the rear-facing camera to one side, which might take some adaptation for those that expect the camera to be more centrally located.",
    "The back is also modified with two small latches that enable the battery to the detached quickly, and Zebra makes a thicker ‘Enhanced capacity’ battery that can snap into place, giving this device plenty of flexibility for those that might need extended battery life away from charging opportunities.",
    "Located under the battery are the Nano-SIM and 128GB Micro SD card slots, avoiding the necessity for a card tray or any water/dust proofing of that slot on the outside.",
    "The other notable features of this design are the buttons, with a yellow button on each side that activates scanning and a volume rocker on the right and PTT (push-to-talk) button on the left.",
    "Confusingly, the power button isn’t on the side but on the top-right edge where most first time users won’t be expecting to find it, and this choice undermines how easy it is to operate with one hand.",
    "The power and data connection are combined with a USB Type-C port on the bottom edge, and there is no audio jack output unless you purchase a cable to enable that from USB.",
    "The screen in the TC26 is a 5-inch backlit LED with a resolution of only 1280 x 720, which is ‘low resolution’ by modern phone standards.",
    "A flipside to having such a relatively small display memory footprint is that the TC26 is highly responsive and the display updates rapidly. The downside is that if you are viewing the best resolution images the camera can capture a pixel on the screen represents 12 pixels or more in the captured image. If you zoom in to see pixel for pixel, you would only be seeing around 7% of the whole picture.",
    "A more general issue is that unless the brightness on this phone is set to the higher end of its possible range, the output is on the dark side and contrast levels are suppressed.",
    "This design uses the front-facing camera to detect ambient light levels to adjust brightness, but as on so many android phones, it has a bias towards making it darker than many users will be comfortable. Yes, it saves power, but that’s of little value if you can’t see the screen clearly.",
    "For the size of this device, the screen seems small, dark and somewhat undersaturated.",
    "Depending on the model, there are two possible scanning platforms, the SE4100 and SE4710. Only the TC26 Basic comes with the SE4100, where the Plus and High Memory models both offer the superior SE4710.",
    "It’s worth noting that it is also possible to scan just using the optical capabilities of the rear-facing camera, though it would probably take longer to achieve than a dedicated scanner.",
    "Those that envisage incentive scanning should go for a TC26 that has the SE4710.",
    "It appears to be the practice that Android device makers forget to fill in the Camera ID when compiling the operating system.",
    "Therefore, without dismantling it, what camera sensors the TC26 uses remains a mystery. The previous TC25 had only an 8MP rear, and this has a 13MP, but neither of the cameras is likely to concern Samsung or Apple.",
    "Given sufficient light, the rear camera can take reasonably sharp images, as it can focus, where the front camera uses fixed at infinity focusing.",
    "The camera application presents various still image options including HDR and candlelight modes, although most users are likely to leave it set to Auto.",
    "Video mode has digital image stabilisation, noise reduction and a selection of different encoding codecs. However, the best resolution on offer is only 1080p.",
    "If the user is likely to be taking plenty of photos or video where quality is critical, then the camera in the TC26 probably isn’t ideal, but for general use and optically capturing a barcode, it will work.",
    "We’ve seen plenty of large Chinese phones that use the very cheapest SoCs at their core, but the TC26 uses a high-quality part, even if it isn’t the latest technology.",
    "The Qualcomm Snapdragon 660 is an octa-core SoC that first appeared in 2017, and has been used previously in the Asus ZenFone Max and ZenFone 4, the Xiaomi Redmi Note 7, Huawei Y Max, and a few Nokia 7.2 designs. It’s considered a solid platform with an excellent power profile and reasonable multi-tasking performance.",
    "On the review model this came with 3GB of RAM and 32GB of flash storage, although by the time the operating system and pre-installed apps took their share, it ended up with just 17.3 GB of internal space available.",
    "The Micro SD card slot can boost the storage by 128GB, should that be an issue.",
    "How these choices translate into performance is always fascinating, and using GeekBench 5 revealed that this device is relatively slow compared with the latest Samsung Exynos or Qualcomm Snapdragon 865 powered devices.",
    "It also wouldn't run the PC Mark (Work 2.0), stopping partway through.",
    "None of the benchmark results as especially good, and the storage results from Androbench show internal flash memory performance is very sluggish.",
    "But what needs to be considered here is that the TC26 was designed as a workhorse and not a racehorse, and for everyday use, the performance is adequate.",
    "It’s not designed for localised processing or to handle the performance demanding tasks that a PC can perform, even if Zebra has labelled it a ‘touch computer’.",
    "A quoted battery life of 10 hours on the standard 3100 mAh battery is highly dependent on use, especially the amount of scanning, but Zebra has a 5400 mAh module, and extra batteries can be purchased to cover extreme scenarios.",
    "The standard battery can be fully recharged in four hours, which isn’t fast. And, also disappointingly, Zebra didn’t support any form of wireless charging on this design.",
    "What’s good about the battery is that it can be swapped out easily, but the capacities aren’t huge, and the extended battery makes the TC26 up to 3.4 mm thicker and heavier.",
    "We also noted that no control mechanism is included to stop the battery being removed while Android is running. That could easily lead to a corrupted device and the potential for un-synced data.",
    "There are plenty of robust phones around that are much cheaper than this, but that dismisses the unique features of TC26 series.",
    "The number of devices with dedicated barcode scanners in them is much smaller, and products like the Raptor E5, ScanSKU M Series and Datalogic Skorpio X4 all cost about the same or much more.",
    "Where this leads the way is in the version of Android it uses, and how this has been tweaked specifically for its business application.",
    "This device comes with Android 10 installed, and those that have DNA Enterprise licensing can expect this to be maintained for up to six years if you have a Zebra OneCare Support Service agreement.",
    "This implementation is from the outside a relatively clean distribution that doesn’t try to reinvent the default interface or diverge away from the core OS functionality.",
    "No wallpapers are included other than a single default uninspiring blue to black gradient. The app selection consists of the usual Google suspects, some tools that relate to the hardware and DNA software technology, and a handful of third-party utilities.",
    "But the most important features of this Android implementation aren’t on the surface but bolted into the OS in a way that allows Zebra to offer with its Mobility DNA software.",
    "These Mobility Extensions (Mx) enable the TC26 to be connected to other business platforms and technology using the Enterprise Mobility Management (EMM) software.",
    "Barcodes captured by the device can be funnelled directly into existing business tools using Zebra’s DataWedge application that doesn’t require a developers expertise to use and if you do have a development team they can use the Zebra Enterprise Mobility Development ToolKit (EMDK) to get the most out of the devices and the data they capture.",
    "It's this hidden feature specifically that elevates the TC26 above merely being a toughened Android phone and makes it into part of a bigger narrative about using technology in a business context.",
    "The other compelling argument for devices like this is how long they will last in service, and the TC26 appears to have the right credentials in this respect.",
    "We’re not huge fans of phone makers quoting standards that aren’t created by standards bodies, like MIL-STD 810G, but Zebra do give a few details about what tests it performed.",
    "Its interpretation of MIL-STD 810G had them drop the TC26 1.2 metres on to concrete, and 300 ‘tumbles’ from 50cm.",
    "The sealing specification is IP67, which translates as protected against the effects of temporary immersion between 15cm and 1m for a duration of up to 30 minutes. And, it should resist dust ingress.",
    "It’s important to understand that we never test review hardware to destruction (intentionally), so we can’t confirm or refute these claims.",
    "The phone should function between -10C and 50C, and cope with being stored another 20C colder or hotter, with humidity in the 5% to 95% range.",
    "There are many things about this design that standard out, and a few that could have been better.",
    "What we liked about it most was the high quality of the construction, and the ability to easily charge the device and swap the battery when required.",
    "These features, among others, should provide a high degree of availability, and the charging cradle is a worthwhile investment that avoids the USB port damage by careless cable insertions.",
    "The underlying hardware is solid, though hardly spectacular, and for a device that might end up with lots of applications installed and running, 3GB or 4GB of RAM might prove insufficient.",
    "We’re fans of programable buttons, barcode readers that aren’t an afterthought, minimalist interfaces, and easily accessible SIM card slots.",
    "But the true strength of this device is when you use it to leverage the associated DNA software technology that welds the device to primary business objectives at the source.",
    "So where could the TC26 have been better?",
    "There are a few irritations, and the one that most people will notice first is the quality of the screen. It’s low resolution, the default chosen font is too small, and the adaptive backlighting always makes it darker than it needs to be.",
    "That can make the screen more difficult to see than it should be, and while you can enlarge the font and adjust the brightness, the defaults should be closer to optimal.",
    "Another major annoyance is the power button placement, in a location that it isn’t traditional on Android phones. This placement invariably requires two hands to trigger without impressive dexterity.",
    "These points aside, the Zebra TC26 is an impressively specified device that delivers a suite of functionality that should make it popular with the logistics sector, and those that need a resilient working environment phone.",
    "It isn’t cheap. But we’d argue that the outlay is appropriate for the flexibility of the design, the support services that Zebra provides to back its hardware up, and the special features that it offers.",
    "In short, the Zebra TC26 is built for purpose and priced accordingly."
  ],
  "headers": {
    "4": "Price and availability",
    "10": "Design",
    "29": "Hardware",
    "37": "Cameras",
    "43": "Performance",
    "52": "Battery life",
    "56": "Competition",
    "72": "Final verdict"
  },
  "links": {}
}