{
  "source": "https://www.techradar.com/reviews/kisi",
  "title": "Kisi review",
  "category": "computing",
  "updated": "2020-10-11T19:30:33Z",
  "author": "jonas-p-demuro",
  "summary": "Reimagine physical security",
  "verdict": "Kisi is an attractive access control option for those looking for a cloud based approach.",
  "pros": [
    "Thirty day trial window",
    "Less opaque pricing",
    "Cloud server approach",
    "Online support portal"
  ],
  "cons": [
    "No chat support",
    "Lacks direct email address for support",
    "No mobile support in standard software",
    "Expanding the system involves third party support"
  ],
  "article": [
    "Kisi was founded in 2012, and has offices in both Brooklyn, New York, and Stockholm, Sweden. Since then, it has been on a mission to change the way facilities are secured, via IoT devices. Kisi designs its devices to be future proof with real time, over-the-cloud updates.",
    "A leader in access control systems, Kisi boasts over 1,000 customers are using their technology to secure their facilities. These notable customers include Georgia-Pacific, Century 21, Harry’s, and the PGA.",
    "Kisi endeavors to balance simplicity against security. On the hardware side, users have a choice of card readers, with available indoor and outdoor models. While there is a requirement of a Pro Controller, there is no need for a local server, as Kisi is run through the cloud. All data transmitted is fully encrypted.",
    "Kisi indicates that this distributed architecture has some unique advantages. This includes eliminating unmanaged Windows servers that can become a failure point as they are susceptible to being hacked. Manual operations are also done away with, as many processes are automated, and the burden of on and off boarding of users is streamlined.",
    "Kisi is controlled via its intuitive web-based software, that can grant and revoke permissions by each user, or by each doorway for full granular control that is simple to use.",
    "There are also plenty of options for credentials. The default is the Black Kisi Pass which features 128-bit AES encryption. A variation on this is the White Kisi Pass, that has a white front to allow for printing, such as for a custom ID card at an organization. An additional option is the Kisi Fob, that is designed to fit on your keychain. Finally, for the ultimate in mobility, there is the Kisi Mobile Credential that does away with the access card in favor of using the smartphone as the credential, via an app. Both iOS and Android devices are supported.",
    "The power and flexibility of Kisi does not stop with mere access control, and can extend to more complex situations. An example of this is that Kisi works with Cisco Meraki cameras that can record images and video to complement the access control data, and can be used for verification and auditing purposes for users entering through a doorway. Other examples include integration with Fire Alarm Control Panels (FACP), a lockdown feature for school emergencies such as an active shooter, and use in relay based elevators.",
    "We’ll skip right to the punchline- we wish Kisi offered some more direct methods to get needed support.",
    "While Kisi does indicate a direct telephone number on the bottom of its site, there is no indication if this is for sales only, or also for support as it does not get listed in the support section of the Kisi website. There is also no direct email, nor chat support.",
    "There is an online portal for support, and users can upload files as needed.",
    "The support strikes us as more self help, with a Community section listed for user discussion of topics. There are also topics divided into sections which include Getting Started- Installation, Admin- On-boarding, Troubleshooting, and Best Practices.",
    "In the market segment of access control we find too much opaque pricing, so we’ll focus on the proverbial glass being half full, as Kisi does at least provide some information on the costs of a system- although truth be told, it left us wanting for some more. We also appreciate the 30 day trial window for plans.",
    "On the hardware side, Kisi indicates that two components are needed for the system. The first is the Kisi Reader Pro (KRP), which has a cost of $599 (£456). Each doorway to be protected will need a reader mounted “On the wall next to the door,” and there is also a Kisi Reader Pro Outdoor (KPRO) for exterior applications, for a higher cost of $699 (£532) available. The readers then connect to the Kisi Controller Pro (KCP) that comes in at $899 (£684), and is designed to be installed in an IT room or closet.",
    "Also, realize that the prices above are not the full prices. There will be an additional cost for the electronic lock, unless you already have one installed. Thankfully, Kisi is compatible with many brands, and can work with existing wiring and locks for an upgrade project. The other cost to be factored in is the installation costs. Kisi indicates that it has certified Kisi integration partners to get the system installed.",
    "Another consideration for the system is the software. Two software solutions are offered, but neither has a cost of acquisition, nor an idea of the ongoing subscription fees. The Standard software has limitations of web only access (no mobile support), 120 days of event storage, a limitation of up to 5 administrators, and standard support. The higher tier of software, dubbed Organization, lifts these limitations, with an unlimited number of administrators, has web and mobile support, unlimited web storage, and priority support with 99.99%+ uptime.",
    "Kisi offers an access control system that has quite a bit of capability. We are concerned at the opaque portions of the pricing such as the software, the lack of support options such as chat or direct email, and the shortcomings of the standard software such as the missing mobile support. Balance that against the transparent hardware pricing, the choice of access control credential cards, and the cloud server approach that obviates the need for a local server. Overall, Kisi is a solid choice in this competitive segment."
  ],
  "headers": {
    "2": "Features",
    "7": "Support",
    "11": "Pricing",
    "15": "Final verdict"
  },
  "links": {
    "Kisi": "https://www.getkisi.com/",
    "access control systems": "https://www.techradar.com/news/best-access-control-systems",
    "Black Kisi Pass": "https://www.getkisi.com/products/mobile-app-access-card",
    "White Kisi Pass": "https://www.getkisi.com/products/mobile-app-access-card",
    "Kisi Fob": "https://www.getkisi.com/products/mobile-app-access-card",
    "Kisi Mobile Credential": "https://www.getkisi.com/products/mobile-app-access-card",
    "online portal for support": "https://help.kisi.io/hc/en-us",
    "Community section": "https://help.kisi.io/hc/en-us/community/topics",
    "Kisi Reader Pro": "https://www.getkisi.com/products/reader",
    "Kisi Reader Pro Outdoor": "https://www.getkisi.com/products/controller"
  }
}