{
  "source": "https://www.techradar.com/reviews/oneplus-buds",
  "title": "OnePlus Buds review",
  "category": "audio-visual",
  "updated": "2021-07-15T14:42:00Z",
  "author": "nick-pino",
  "summary": "Discount true wireless earbuds for all the OnePlus faithful",
  "verdict": "The OnePlus Buds’ ridiculously cheap price and 30-hour battery life make them feel like a mighty appealing alternative to the Apple AirPods, but some major issues with fit, noise isolation and limited voice assistant support prevent them from stealing the limelight.",
  "pros": [
    "Great price for true wireless earbuds",
    "30-hour combined battery life",
    "Tight integration with OnePlus phones"
  ],
  "cons": [
    "Uncomfortable to wear",
    "Limited noise isolation",
    "No always-on assistant"
  ],
  "article": [
    "The OnePlus Buds are finally here and they’ve exceeded every expectation we’ve had in terms of price and battery life. Their exterior case has the same space-age aesthetic as the Google Pixel Buds, and the earbuds themselves both look and feel almost identical to the Apple AirPods, which feel like the clear inspiration for OnePlus’ first true wireless earbuds.",
    "Unfortunately, following Apple’s design to the tee probably wasn’t the best idea.",
    "The AirPods aren’t known for being exceptionally comfortable, fall out fairly easily and have little to no passive noise isolation, and the same is true for the OnePlus Buds.",
    "On the feature front, they lack active noise cancellation and a way to summon Google Assistant on any device other than a OnePlus phone - at least for now - and also the touch controls are fairly limited for anyone who doesn’t own a OnePlus phone.",
    "All that said, if you’re a OnePlus owner already and you’re looking to dip your toes into the pool of true wireless earbuds, the OnePlus Buds are a cheap entryway. They last for up to 30 hours between wall charges and they use Warp Charge that provides 10 hours of battery life in just 10 minutes without needing any special cables or chargers.",
    "If you can live without a lot of higher-end features like ANC and can suffer through a tight fit that may cramp your outer ear, the low-cost OnePlus Buds might be the AirPods alternative you’ve been waiting for and worth auditioning for their budget entry price.",
    "In terms of price, the OnePlus Buds are significantly cheaper than any other rival true wireless earbuds out there, priced at £79 / $79 (about AU$110). They’re cheaper than the $159 / £159 / AU$229 Apple AirPods. They’re cheaper than the $179 / £179 (about AU$270) Google Pixel Buds. They’re cheaper than even the $129 (£130, around AU$200) Sony WF-XB700 that we truly thought would be one of the cheapest name-brand true wireless earbuds of 2020.",
    "Now, before you call us out on it, we know there are other similarly priced or cheaper true wireless earbuds out there on Amazon like the Lypertek Tevi that we gave a perfect score. But if you’re looking for the cheapest earbuds from a big phone manufacturer like OnePlus, these are truly the cheapest option out there right now.",
    "If you were to lay the OnePlus Buds on their backs and asked people to identify the headphones, most would say these are AirPods. The resemblance is uncanny.",
    "The obvious difference here is that the AirPods use a rounded back and are smaller, while the bigger OnePlus Buds have opted for a touch-capacitive flat panel on the back. Unfortunately, though, without doing any customization to the controls, they’re super limited. Basically, it’s just skip with a double tap or answer phone calls with a single tap. That’s it.",
    "Speaking to OnePlus about it, they say control customization is coming after launch and there will be more options soon. For now, be prepared to have little control over your music.",
    "One nice design touch to counter the lack of controls is that the earbuds do have sensors inside them that will automatically pause the music if you take the buds out of your ear and resume it when you put them back in. That’s a smart move that helps the Buds reach their 30 hours of promised battery life and is useful if you’re the kind of person who’s constantly putting in and taking out their earbuds.",
    "So how do they feel? Not great, really. We’re used to wearing earbuds with customizable eartips that can accommodate ear canals and outer ears of all shapes and sizes. Because of their all-plastic design, the OnePlus Buds really can’t be tailor-fitted for each ear and, in our experience, became painful to wear after the first hour.",
    "That only upside to the Buds being as big as they are is that they hold in fairly well while you’re exercising which, given their sweatproof IPX4 rating, make them decent gym companions if you don’t mind hearing weights slam in the background due to their lack of active noise cancellation.",
    "The Buds themselves sit inside a super sleek case that’s roughly the same shape and size as the Google Pixel Buds case. The OnePlus Buds are a bit lighter inside their case at around 46g, however, and have an exterior LED status light that makes it easy to tell when they’re fully charged and ready to go. Last but not least, the case uses USB-C which is a nice modern touch compared to the luddite holdouts still using microUSB.",
    "While the OnePlus Buds don’t have active noise cancellation they do have \"environmental noise cancellation\" for phone calls that at least reduces the background noise others hear when talking to you. That’s not a good tradeoff, obviously, but we do have to give OnePlus some credit for making phone calls sound almost as good as they do when using our phone’s built-in speakers.",
    "That environmental noise reduction tech would’ve been a great pairing for an always-listening assistant... However, that’s currently not something the OnePlus Buds support until an OTA update comes later this month that will allow users to customize the double-tap function of the earbuds. But even once the assistant arrives, it won’t be always-listening like Siri does on the Apple AirPods 2nd Gen or the Google Assistant does on the Google Pixel Buds which is a fairly disappointing bit of news here.",
    "The other missing features here are aptX HD or LDAC codecs that would’ve enabled the earbuds to stream Hi-Res Audio. Instead, the Buds only support SBC and AAC that certainly makes the audio sound decent, but not shine the same way the Sony WF-1000XM3 can.",
    "Thankfully they do support Bluetooth 5.0 and only have about 103ms of latency (0.1s) to help the audio keep pace with the visuals when you’re watching shows and movies.",
    "These are also the first earbuds to have Warp Charging, OnePlus’ 2C charging tech that offers 10 hours of battery life in just 10 minutes of charge time. Yes, others have offered fast-charging before, but it’s usually closer to five hours of charge in 15 minutes instead so 10 hours in 10 minutes feels like a huge step up.",
    "Ending on another positive note, OnePlus has also included a Find My Earbuds feature and a super simple setup process for OnePlus smartphone owners who simply need to open the case of the earbuds near a OnePlus phone to start pairing. It’s another thing the company lifted from Apple, Google and others, but this time it clearly works to OnePlus’ advantage.",
    "The OnePlus Buds pass the biggest test when it comes to sound performance - they stay connected and don’t fall out of sync. If there’s one deal-breaker for true wireless earbuds, that’s it, and we’re glad to say that we didn’t have any problems there.",
    "Sonic profiles are obviously quite subjective, but we found them to be pleasant to listen to, with a soft bass response and decent clarity in the mids and highs. We would’ve liked a slightly wider soundstage, but they sound as good as a pair of low-end over-ears headphones even before we went in and tweaked the EQ a bit.",
    "While OnePlus doesn’t currently have a way for you to change the EQ through an app, you are able to use Android’s built-in EQ to up both the sub-bass and treble in the 10-15Khz range, two areas that we felt were just a hair lacking with the Buds’ default audio profile.",
    "We put the OnePlus Buds through their paces with a number of genres and songs and felt that they were equally comfortable with pretty much every style of music, though bassheads certainly won’t be writing home about them and should instead take a look at what Beats have been up to in the true wireless space.",
    "In terms of calling performance, voices came through as incredibly clear on my end, and those we spoke to over the phone said we came through clearly, too. When we did some A/B testing with the speakerphone, those we spoke to said we sounded louder when using the phone’s microphone instead of the earbuds, but said it was a negligible difference.",
    "So how do they compare to the competition? Well, in terms of sound quality alone, they’re as good as the Samsung Galaxy Buds Plus and Google Pixel Buds, in our opinion, but the Sony WF-1000XM3 still wins out thanks to their noise-cancellation, aptX HD/LDAC support and incredible sound quality.",
    "Things could possibly be different once OnePlus adds Dolby Atmos support that’s expected soon via an OTA update, but according to information sent to us by OnePlus, that will only be available to OnePlus 7 Series and OnePlus 8 Series owners – so take it with a grain of salt.",
    "The two takeaways on battery life are that these things last forever at 30 hours of combined charge – 7 hours in the Buds, 23 in the case – and can be recharged in a matter of minutes thanks to Warp Charge. When we asked OnePlus if Warp Charge could hurt the overall lifespan of the lithium-ion battery inside the Buds, they said that they had found that Warp Charge didn’t degrade it at all and didn’t pose a safety risk because the earbuds cap the charging at 5v 1.5A to avoid damage.",
    "What that means here is that, in terms of battery life and performance, the OnePlus Buds are bulletproof and simply one of the best in the category.",
    "You want true wireless buds at a cheap price The OnePlus Buds are among the cheapest true wireless earbuds out there from a top-tier phone company and, with support for Dolby Atmos coming to in an OTA update to the OnePlus 7 and OnePlus 8, they're an even better value if you own a OnePlus phone.",
    "You wish your earbuds had fast-charging technology If you’re constantly picking up dead earbuds because you use them so infrequently, the OnePlus Buds are a great solution. They’ll hold their charge for weeks at a time and, once they do die out, can be resuscitated in just 10 minutes.",
    "You're an Apple AirPods wannbe If you want to join the in-crowd with a pair of AirPods look-alikes that don’t cost so much, the OnePlus Buds certainly fit the mould. No, they don't sound as good and aren't as full-featured, but Apple's earbuds carry a certain amount of clout and status, and these earbuds play the part well.",
    "You're wearings buds to drown out the world Travelers, commuters or office workers beware – the OnePlus Buds don't block out outside noise. This means they aren't ideal for a crowded office, in-flight isolation, or simply commuting on public transit everyday. The little noise isolation and lack of active noise cancellation will sour your experience.",
    "You're fussy about the fit If you’ve had any sort of customizable fitting earbuds in the past, the OnePlus Buds will be a shock to your system. They’re big, beefy and plasticky with absolutely no give to them. They’ll either fit like a glove or they won’t and the only middle ground here is pretty painful.",
    "You're an audiophile or avid music listener There’s nothing wrong with the sound the OnePlus Buds produce. They are truly workmanlike in their sound quality in that they get the job done. That said, they aren’t exactly the most musical true wireless earbuds out there. They don’t have a wide soundstage and can’t bring the bass or high-end treble the same way, say, Sony or Klipsch earbuds can."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Price and release date",
    "8": "Design",
    "15": "Features",
    "21": "Performance",
    "28": "Battery life",
    "30": "Buy it if...",
    "33": "Don't buy it if..."
  },
  "links": {
    "Google Pixel Buds": "https://www.techradar.com/reviews/google-pixel-buds-2020",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "provides 10 hours of battery life in just 10 minutes": "https://www.techradar.com/news/exclusive-oneplus-buds-to-charge-faster-than-apple-airpods-via-warp-charge-technology",
    "Sony WF-XB700": "https://www.techradar.com/reviews/sony-wf-xb700-truly-wireless-headphones",
    "Lypertek Tevi": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}