{
  "source": "https://www.techradar.com/reviews/fnatic-mini-streak-rgb-speed-edition",
  "title": "Fnatic Mini Streak RGB Speed Edition review",
  "category": "computing",
  "updated": "2020-11-04T12:19:58Z",
  "author": "christian-guyton",
  "summary": "Built for gaming, with a stylish appearance and a surprisingly reasonable price",
  "verdict": "‘Silver Speed’ mechanical switches make for a refined gaming keyboard that expertly packs the features and performance of the original Streak into a compact, tenkeyless form factor. Although it might be aimed at tournament competitors, the Mini Streak is sure to garner praise from any gamers who prefer a compact keyboard.",
  "pros": [
    "Clean aesthetic and tasteful RGB",
    "Silver Speed switches feel great",
    "Good value for money"
  ],
  "cons": [
    "Additional buttons are hard to reach",
    "No longer comes with a wrist rest",
    "Better for gaming than typing"
  ],
  "article": [
    "Esports titan Fnatic has put out a decent range of PC gaming peripherals over the last few years (along with some natty branded apparel) but the Streak keyboard is certainly one of the most successful.",
    "The tenkeyless Mini Streak—stylised as miniSTREAK—purified the original concept into a smaller, more portable keyboard, and now we’re checking out its latest iteration, available for $99.99 (£99.99, around AU$180).",
    "So, what’s new here? Upon first glance, this doesn’t appear much different from the original Mini Streak; the lightweight metal top panel and PCB keycaps still look great, with gently rounded edges and a detachable USB-C power cable that slots into a groove on the underside of the keyboard. So far, so good.",
    "There are a few small superficial changes from the previous model (still available from Fnatic as a ‘legacy’ version), such as a new slimmer font and brighter RGB lighting. The real changes are hidden beneath the plastic keycaps: gone are the industry-standard red/brown/blue switches from Cherry, replaced by new Silent Red and Silver Speed switches from Kailh.",
    "We've reviewed the Speed Edition, and these linear silver stems are a genuine joy to use in fast-paced games. With a mere 40g of required force and an actuation point of just 1.1mm, the Silver Speed switches feel like a true hair trigger, completely removing any opportunity to blame an untimely defeat on your hardware. If you don’t react fast enough in a game, you’ve nobody to blame but yourself.",
    "These switches are pretty quiet (although anyone seeking silence will likely be better off with the new Silent Red version) and with a bit of practice, actively improved our movement control in shooters like Apex Legends compared to more conventional red and blue switches.",
    "The sensitivity is so high, however, that typing can be a chore. Just lightly resting a finger on a key may trigger input, making mis-types common unless you’re already accustomed to a super-sensitive keyboard. It’s not the worst keyboard we’ve seen when it comes to typing, but it’s certainly not ideal.",
    "One change we can’t say we approve of is the removal of the included wrist rest that came with previous models of the Mini Streak. This padded leather rectangle was a welcome sight for sore hands, and Fnatic’s decision to no longer include it with these new models of the keyboard is a shame.",
    "The Speed Edition retains the original Mini Streak’s bi-positional rubberised feet and swappable magnetic custom panel at the rear, the latter of which will allow gamers to have their own gamer tag or team name illuminated in RGB for all to see—once Fnatic gets around to offering that service, anyway.",
    "Despite some mechanical refinements inside the hardware itself, one glaring design issue from previous iterations of the Streak hasn’t been solved. The extra buttons in the upper-right corner of the keyboard (controlling volume mute, mic mute, and ‘tournament mode’, which dims RGB effects) are very small, feel cheap, and are frankly difficult to reach.",
    "Even with the keyboard tilted towards you, these buttons remain mostly hidden behind the top row of keys, and reaching them for a quick mute is very cumbersome.",
    "Still, these are small frustrations with what is fundamentally a good compact keyboard for serious gamers. At a hundred bucks, it’s competitively priced (if not cheap). The lightweight construction is undeniably high-quality, and the RGB lighting is bright and vibrant with excellent customisation in the Fnatic OP software, which also allows for a degree of button remapping. At just 28mm thin, it’s easy to slip into a bag for travelling to tournaments or LAN parties.",
    "Ultimately, there aren’t many compact gaming keyboards that can match the Mini Streak’s quality at the hundred-dollar price point. Direct competitors like the Razer Huntsman TKL Tournament Edition can arguably match the quality seen here, but at a higher price.",
    "The big draw here is the Silver Speed switches, which are perfect for games that demand snap reactions. If that’s something you look for in a keyboard, check the Mini Streak Speed Edition out."
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Don't buy it if..."
  },
  "links": {}
}