{
  "source": "https://www.techradar.com/reviews/sackboy-a-big-adventure-review",
  "title": "Sackboy: A Big Adventure review",
  "category": "gaming",
  "updated": "2020-12-21T12:16:02Z",
  "author": "adam-vjestica",
  "summary": "Stuffed full of magic",
  "verdict": "Sackboy: A Big Adventure is the surprise jewel in Sony’s PS5 launch lineup and a shining example of how to create a kid-friendly, yet challenging platformer that appeals to all ages and abilities.",
  "pros": [
    "Fantastic level design",
    "Four-player co-op",
    "Challenging gameplay"
  ],
  "cons": [
    "Somewhat predictable boss fights",
    "End of level fanfare takes too long",
    "Some levels require two players"
  ],
  "article": [
    "With so many mature experiences already available on the platform, Sackboy: A Big Adventure might be the most important game in Sony’s PS5 launch lineup.",
    "It’s easy to forget that video games aren’t just solely aimed at those in their 20s and 30s – millions of parents will also be looking to buy a PS5 for their little ones over the coming months and years, and if there’s nothing suitable for them to play, it can make that purchasing decision a difficult one. The importance of having a family-friendly title that can also satisfy seasoned fans of the genre shouldn’t be understated, then.",
    "It helps that Sackboy: A Big Adventure is a truly wonderful platformer, of course. It manages to avoid the common pitfall that many developers fall into when designing games for younger audiences, where gameplay is woefully oversimplified. Instead, Sackboy: A Big Adventure provides a perfect balance of pinpoint precision platforming, inventive level design and accessibility.",
    "Developer Sumo Digital’s charming take on Sony’s hessian hero ditches the create, share, play model of the LittleBigPlanet games for a pure platforming experience – and it’s all the better for it. The game draws favorable similarities to Nintendo’s magnificent Super Mario 3D World, but, Sony’s take on territory that’s often reserved for the portly plumber isn’t a mere tribute act. It’s a resounding recital that exudes quality from the title screen to the end credits.",
    "Sackboy: A Big Adventure’s story is achingly simple and buoyed by some sterling voice acting from Bafta-award winning actors such as Richard E. Grant (Can You Ever Forgive Me?) and Dawn French (Vicar of Dibley). Craftworld is under attack from a dastardly villain named Vex, who wants nothing more than to unleash pure pandemonium across the Imagisphere. To do so, he kidnaps the Sackfolk and enslaves them into building a maniacal machine. Thankfully, Vex is unable to capture our beady-eyed adventurer, Sackboy, who subsequently sets out on a perilous quest to stop Vex in his tracks.",
    "In your bid to takedown Vex, you’ll have to guide Sackboy through a generous amount of playful worlds, collecting countless Dream Orbs as you go that unlock new areas. Each level is packed full of kooky characters to meet and impish enemies to overcome, and there are also hidden costume pieces to discover that let you customize Sackboy in all sorts of creative ways. From a Tudor to a devilish rock god, Sackboy’s outfits are adorable, and you can even create your own fashionista combinations, should you choose. They also appear in the game’s cutscenes, which can make for hilarious viewing.",
    "Looking pretty’s one thing, but you’ll need to master all of Sackboy’s abilities if you’re to conquer the game’s many challenges. Sackboy’s main repertoire involves slapping, rolling, grabbing, performing a flutter jump and slamming to the ground. These actions let you interact with the world in a variety of ways, whether that’s hanging on to a sponge roller as it spins round, or breaking boxes to reveal bubbles you can collect. Nothing feels redundant, and it allows the developer to add new situations to tackle in each level.",
    "The jumping mechanics have thankfully been overhauled in Sackboy: A Big Adventure, allowing for some seriously satisfying platforming compared to previous franchise entries. Sackboy had a nasty habit of feeling overly floaty and ungainly before, but developer Sumo Digital has wisely ditched the old design for something that feels faithful, yet fundamentally works far better.",
    "So Sackboy: A Big Adventure feels great to play, then, but what elevates the game to the next level is how its craftwork presentation is stitched together to create an amazing foundation that makes everything click. Every object, level and character is made up of real-world materials, much how you might imagine Etsy if it was an actual, physical place.",
    "You’ll jump over spiked rollers made out of shiny tinfoil, be fired out of flowers made from felt, and encounter countless animated stickers, everyday items and things you'd find nestled in an arts and crafts box. The world’s patchwork style provides innumerable opportunities for the developer to delight, and – credit where it’s due – every level feels distinct, lovingly designed and bursting with charm. It’s hard not to sit back and just admire the sheer level of detail on display.",
    "The power of the PS5 only helps to drive home just how beautiful Sackboy: A Big Adventure is, too. Running at a locked 60 frames per second and a crystal clear 4K resolution, there are times when the game looks exceptional, despite also being on PS4. You can see the frays on Sackboy’s body, and every texture appears more realistic thanks to the extra clarity provided.",
    "The fact you can experience the entire game with up to three other players is also huge achievement. We were only able to partner up with one other player locally during our playthrough (online support is now available), but we enjoyed helping and hindering each other in equal measure. The game’s co-op only levels were also a particular highlight, as they involved teamwork and problem solving, which was really fun to do as a couple. You’ll need to throw each other onto platforms, operate switches in tandem, and pull on cords together to progress.",
    "Sackboy: A Big Adventure is also crammed full of things to do once you’ve made your way through the story, whether you’re going it alone or with a friend in tow. Along with hundreds of Orbs to find, platforming purists will also appreciate the Knitted Knight challenges, which are timed events that will test even the most hardened of players. Completing the game's many levels without dying will also prove a stern test.",
    "And then there’s the special music levels, which take popular tracks you know and love and transform them into feel-good, toe-tapping stages. While we won’t spoil them all here, you can expect to be accompanied by hits from Bruno Mars and Britney Spears. Throw in online rankings in the game’s timed levels, and you’ll be looking at well over 25 hours to get everything done.",
    "Sackboy: A Big Adventure is stuffed full of magic and bursting at the seams with creative ideas. While most PS5 owners will likely pick up the punishingly difficult Demon’s Souls or Marvel's Spider-Man: Miles Morales, Sackboy can hold his hessian head up high. He’s the star of an exceptional platform, and yet another excellent PS5 launch game."
  ],
  "headers": {
    "3": "Dream theater",
    "5": "Gotta collect 'em all",
    "8": "An amazing eyeful",
    "12": "Hobbyist",
    "14": "Verdict"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Marvel's Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review"
  }
}