{
  "source": "https://www.techradar.com/reviews/fileshadow-file-transfer-app-review",
  "title": "FileShadow file transfer app review",
  "category": "computing",
  "updated": "2020-10-01T07:42:59Z",
  "author": "david-nield",
  "summary": "FileShadow will bring all your files together",
  "verdict": "Get FileShadow to hold your files and connect your cloud storage accounts and you've got one central place for everything – it's a bit rough around some of its edges, but it works as advertised, and is likely to be a good fit if you've got a lot of files you need to manage.",
  "pros": [
    "Plenty of useful features",
    "Supports multiple cloud services",
    "Advanced search and tagging"
  ],
  "cons": [
    "Account registration not the smoothest",
    "You have to supply a phone number",
    "Not much in the way of file security"
  ],
  "article": [
    "FileShadow combines elements of cloud storage and file sharing into one coherent whole, and it's also able to plug into apps and cloud lockers that you already use. It's difficult to sum up in a few sentences, as it combines so many different services into one package.",
    "The features available through FileShadow include local file backups, secure cloud storage, connecting multiple cloud accounts, automatic file tagging, local file editing, online publishing and advanced searching – it's got a lot of different elements.",
    "The easiest way to think of FileShadow is as a vast repository for all of your files – local files, cloud files, scanned files, shared files and so on. Not only does the service make all these files easy to access, it makes them easier to sort and to search through – images get tagged via AI analysis, for example, while document text gets scanned through Optical Character Recognition, so you have to do less of the sorting yourself.",
    "You can add files to FileShadow directly, or you can import them from a variety of other places, including the cloud storage services run by Google, Dropbox, Adobe, Apple and others. It can also work with certain NAS drives if you need it to. You can see the idea: get all of your important data collected together in one place.",
    "There are some tools here for collecting groups of files together and sharing them with other people, though the options you get are pretty rudimentary in terms of controlling file and folder access, allowing downloads and edits, and so on. It's there if you need it, but other services tend to do it better.",
    "FileShadow offers plenty of integrations with other apps and devices too: you can automatically pull in files from Slack, for example, or automatically upload documents imported through a Fujitsu ScanSnap scanner. Add in the support for connecting some of the biggest cloud storage services in the business, and FileShadow is definitely comprehensive from a features perspective.",
    "As is the case with a lot of business software, FileShadow's interface definitely puts function over form. Bare, drab design choices, copyright notices that are a year out of date, interface elements that look as though they've been developed by different teams over different periods of time... FileShadow isn't alone in having these issues. The interface is fast at least, and works as advertised on desktop and on the web.",
    "Adding third-party accounts is pretty straightforward. You make your pick – Dropbox, Google Drive, OneDrive, OneDrive for Business, Box, Creative Cloud, Lightroom, Slack, Apple or Windows – and then enter your credentials for the particular service. Once that's done, your files are scanned, which can obviously take some time if you've got several terabytes of data there.",
    "We like the different filters you can put on your files (date, source, location and so on), and the search and tagging functions seem to work well based on the testing that we did. You can view files like Office documents, PDFs and images inside the web browser interface, but we weren't able to stream audio and video files. FileShadow is also able to supply plenty of information about each file, including the source it was added from and when it was last edited.",
    "While the FileShadow interface doesn't match up to some of the best alternative tools, it is ambitious in terms of everything that it tries to do. We'd like to see it get a new lick of paint, but overall we were satisfied with the speed of the various applications and processes. As yet there are no dedicated apps for accessing your files on mobile, which is another point against it.",
    "FileShadow says that all of the files it stores are encrypted, but we can't find any reference to what type of encryption is used, and it doesn't appear to be end-to-end encryption. You can set up two-factor authentication on your account, which is good to see, and the setup process at the beginning is quite involved too – we did have some problems trying to register an email address, but we were able to resolve them with some help from FileShadow support in the end.",
    "While FileShadow is certainly not insecure, it doesn't come with a huge number of security and privacy options (no password protection or expiry dates on the file shares, for example). You're really relying on your own security procedures, and the security procedures of the cloud services you're connecting, when it comes to making sure your files are safe and protected from unauthorized access.",
    "The pricing structure for FileShadow is based on how many files you need it to work with. For $7 (about £5.40) a month or $50 (about £39) a year, you can manage up to 10,000 files or 30GB, whichever is greater. Pay $13 (about £10) a month or $120 (about £93) a year, and that goes up to 20,000 files or 60GB. Pay $30 (about £23) a month or $250 (about £195) a year, and you can handle up to 50,000 files or 100GB of data.",
    "The top-tier Professional package will set you back $90 (about £70) a month or $700 (about £540) a year, and with that you can use FileShadow with 200,000 files or 600GB of data. You can try any of these plans for 30 days for free without putting in any payment information, or use the service completely free of charge but stick to just 10GB of storage.",
    "There's a lot that we like about FileShadow, including its main mission of bringing all your files together in one place. Uploading files, connecting cloud accounts, and searching through files is all simple and straightforward, and we can see how some users would come to rely on this as a very useful tool. Many of us will have files spread all over the place, and FileShadow does a good job of transferring them into one repository.",
    "There are some areas where it doesn't impress too much though – the interface looks a bit outdated and is occasionally a bit buggy, there are no mobile apps, and the security and privacy features are a little thin on the ground. You can try out FileShadow for free, and so if it's of interest we'd recommend doing that – you'll then be able to judge whether this is something you'd be interested in paying for."
  ],
  "headers": {
    "2": "FileShadow features",
    "6": "FileShadow interface",
    "10": "FileShadow security",
    "12": "FileShadow pricing",
    "14": "FileShadow verdict"
  },
  "links": {
    "FileShadow": "https://www.fileshadow.com/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file sharing": "https://www.techradar.com/best/best-ways-to-transfer-files-online"
  }
}