{
  "source": "https://www.techradar.com/reviews/greatcall-review",
  "title": "GreatCall review",
  "category": "pro",
  "updated": "2020-10-27T16:13:16Z",
  "author": "jeph-preece",
  "summary": "Our GreatCall review explores why it's our pick for best medical alert system",
  "verdict": "GreatCall combines a blazingly fast call response time, excellent medical alert systems, and pricing that makes having a mobile medical alert system more affordable than most landline systems. For these reasons, GreatCall is our pick for best medical alert.",
  "pros": [
    "Fastest emergency response times",
    "Very good audio quality",
    "Affordable monthly payments"
  ],
  "cons": [
    "Requires a one-time equipment fee",
    "Fall detection available only on Ultimate package"
  ],
  "article": [
    "In our GreatCall review, you learn how this brand is not like other medical alert companies. This brand has long recognized that mobile medical alert systems are more effective, even if your mobility limits you to the home. As such, the company doesn’t offer in-home systems like most services. And the mobile systems are often more affordable than an in-home landline system with a different company. When you combine this with excellent performance and quality products, it’s easy to see why they are our pick for best medical alert.",
    "In our GreatCall review, we look primarily at the Lively Mobile Plus. While the service offers medical alert smartphones and a medical alert wearable, the Lively Mobile Plus provides the best apples-to-apples comparison with other medical alert systems. In the process of our review, we tested the audio quality, emergency response time, quality of calls, and pricing.",
    "Get a free quote for a medical alert system.",
    "GreatCall has four products. Two are phones made specifically for seniors. The Jitterbug Smart 2 is a smartphone with large text, a simplified interface, and a help button that can be accessed from the home screen. The Jitterbug Flip is just a flip phone, which your loved one can use to call whomever they want, but it also features a button to call an emergency response center.",
    "The GreatCall Lively Mobile Plus is their best medical alert system. This mobile medical alert system costs about $40 to buy, but is only $24.99 per month for the most basic package. It’s sturdier than other mobile medical alert systems. And the audio quality is exceptional. The main reason for this is each Lively Mobile Plus is brand new. Unlike other companies, who lease their equipment to you, you buy the Lively Mobile Plus and don’t have to return it when you cancel your service.",
    "To get the fall detection feature activated, you have to upgrade to the Ultimate package, which might be worth it. Of all the fall detection sensors we’ve detected on mobile medical alert systems, the Lively Mobile Plus had the most accurate. It’s not too sensitive and not too dull. It’s not perfect either, but it gives you the best shot of getting help if you fall and can’t press the help button.",
    "The Lively Wearable is a unique system to GreatCall. This watch-like system is a button on a wristband and connects to the 5Star app on your phone.. When pressed, it tells your smartphone to call the emergency call center. In this way, it uses technology you may already use to make the call and doesn’t look as much like a medical alert device as most PERS units. And while we’d prefer the Wearable to have a display to make it more like a watch and more discreet, it’s still better than most mobile medical alert devices.",
    "In all of our tests, GreatCall’s Lively Mobile Plus had the fastest call response time. In fact, the average call response time was twice as fast as the second fastest medical alert service’s call response time with most calls being answered in less than 15 seconds. And with GPS and WiFi tracking, the emergency responders can help EMTs locate you faster. This all translates to a quicker response. And a quicker response is directly related to a successful recovery, both physically and mentally.",
    "We believe the fast response times are the result of GreatCall’s 5Star Urgent Response Center, which they own and operate. This means the emergency response center is answering calls from home security systems and other services at the same time they’re answering your call for help. As with most call centers, it’s available 24/7 every day of the year and they have highly trained IAED-certified operators who stay on the line until you get help.",
    "Every test we performed proved how well-trained they were, as each operator asked several times if we were okay, spoke in a calm tone, and confirmed our identity and location. All important details in a call. And with this service, there is no emergency too small. They understand that not all emergencies require an ambulance. They can call a family member or neighbor to help.",
    "GreatCall’s 5Star Urgent Response Center is also the only medical alert service to offer medical advice to seniors through the call center. You can get prescriptions and refills, as well as medical advice, such as whether you should get tested for Covid-19.",
    "GreatCall is different. And “different” is good in an industry of clones and copycats. The company often provides discounts and deals, especially to AARP members. And you’re never tied into a contract. Cancel any time with no fee. You don’t have to return equipment. You don’t have to pay exorbitant installation fees. There aren’t loads of add-on’s that they push on you. And the marketing is separated from the customer service, so you’re never pressured to buy.",
    "Every product they offer is available with the GreatCall link, a smartphone app for family and loved ones. The app keeps your loved ones in the know, alerting them if you’ve pressed the help button. They can also see your appointments, gauge your activity levels, and retrieve your location if you need help.",
    "As mentioned, you buy the products with GreatCall rather than lease them. Then you pay a monthly fee to maintain the subscription to the call center. For the Lively Mobile Plus, which is the most comparable PERS system to other companies, the one-time product fee is around $40, but the monthly fee is $24.99 for the basic package, $29.99 for the preferred, and $39.99 for the Ultimate, which includes fall detection.",
    "By starting at $24.99 for the basic package, you can get a mobile medical alert system for less per month than the average in-home landline system, which cost around $30 per month. Some services offer landline systems at around $20 and $25 per month, but these in-home systems are inferior compared to any mobile medic alert system. However, with most services, the mobile system is the most expensive package, starting around $45 per month. And you can expect to add $10 if you want fall detection.",
    "In our tests, the GreatCall Lively Mobile Plus came out on top in nearly every category. The audio quality is superior because it’s not an old and used device. The call response times are super fast because the call center is only answering calls from GreatCall customers. The fall detection sensor is the most accurate we’ve tested (in a medical alert system). And the added perks of the GreatCall Link and the 5Star Urgent Response Center make GreatCall the best medical alert system for seniors, especially when you consider the affordable pricing.",
    "Why subscribe to an in-home landline system with inferior communication and technology when you can get a mobile medical alert system with GPS location tracking for less? This is why GreatCall is the best overall pick for medical alert systems. It’s really that simple."
  ],
  "headers": {
    "3": "Medical Alert Systems",
    "7": "Emergency response center",
    "11": "Medical alert company",
    "13": "Cost comparison",
    "15": "Final Verdict"
  },
  "links": {
    "Get a free quote for a medical alert system": "https://www.techradar.com/news/the-best-medical-alert-systems-and-services-for-every-budget-2021#section-get-a-quote-for-a-medical-alert-system"
  }
}