{
  "source": "https://www.techradar.com/reviews/honor-magic-earbuds",
  "title": "Honor Magic Earbuds review",
  "category": "audio-visual",
  "updated": "2020-05-05T16:00:11Z",
  "author": "henry-st-leger",
  "summary": "There's little magic here for Honor's AirPod imitators",
  "verdict": "The Honor Magic Earbuds offer a satisfying collection of features for their mid-range price tag, including active noise-cancelling and pleasing auto pause functionality. Audio, however, is a bit rough around the edges, and we can’t help but feel that the sound should have been more controlled.",
  "pros": [
    "Firm fit",
    "Cheaper than AirPods",
    "Sleek case",
    "Active noise cancellation"
  ],
  "cons": [
    "Some scratchy consonants",
    "Little bass",
    "Short battery life",
    "Could be comfier"
  ],
  "article": [
    "When the Honor Magic Earbuds were first announced, we were certainly intrigued. With a form factor that cleaves pretty close to the AirPods Pro, and a price point that undercuts even the standard Apple AirPods, many of us wondered whether Honor may have a true wireless earbuds competitor on their hands.",
    "Add to that active noise cancelling – still a rarity among in-ear buds – and there’s clearly plenty to recommend the Honor Magic Earbuds… on paper at least.",
    "Not every technology packed into these compact earbuds pays off, while audio may be disappointing to those expecting AirPods-level performance, even if some aspects of Honor’s design are worth a look. Why’s that? You can find out in the rest of our Honor Magic Earbuds review below.",
    "The price tag of €99 (roughly $110 / £90 / AU$170) makes these earbuds pretty mid-range, meaning we wouldn’t expect market-leading specs or bottom-dollar performance – and the question, as ever, is whether the trade-off of price and performance is worth it.",
    "The earbuds are available to pre-order from May 5 across the UK and Europe, and will be availably to buy from May 21. More specific region pricing is yet to be announced.",
    "The Honor Magic Earbuds may look familiar, and that’ll be because of how similar they are to the Apple AirPods Pro.",
    "Honor’s earbuds feature a near-identical stem design, with adjustable eartips for a snug fit in your ears, and it’s clear Honor isn’t trying too hard to differentiate its offering.",
    "These buds do fit pretty firmly – in this reviewer’s ears, at least – though they have a slightly boxier shape than the AirPods Pro, which could lead to some discomfort after long listening sessions. For on-and-off use, though, we found them largely comfortable.",
    "The model we reviewed was in a clean white (Pearl White), though you can also buy these buds in an aquamarine color (Robin Egg Blue) if you want something a bit different from the many sets of AirPods out there.",
    "You get a smattering of eartip sizes in the box, as well as an USB-C cable for charging up its rather sleek case. Honor has gone for a horizontal take on the charging case, meaning the earbuds rest on their side – and they make a rather satisfying click when attaching magnetically to the inside of the case.",
    "You’ll find a pairing button on the back of the case, too – if you open up the case, and hold down the pairing button until a white light appears, the earbuds should be visible to whatever source you’re pairing it with.",
    "There’s no connection sound when the earbuds link up to a source device, though, which quickly proved frustrating as we had to pick up our phone to check if the earbuds had connected.",
    "But what of the features? Honor has made much of the inclusion of active noise-cancelling, which aims to soften outside sounds and help listeners hear intended audio that bit more clearly.",
    "The noise-cancelling – activated with a long press on either earbud – most certainly works, helping to diminish external noise. The effect is rather minimal, but we’re glad to have something to help block out the outside world when we want to.",
    "The Magic Earbuds’ three-microphone array, however, works exceptionally well for calls and voice recordings, with speech being clearly picked up in our various Zoom and Google hangouts meetings throughout the week. Honor uses a technology it calls “uplink noise reduction”, which appears to help in this regard.",
    "You’ll get the latest Bluetooth 5 standard, ensuring a reliable connection with smartphones and other Bluetooth devices, and we didn’t have any dropout issues during several days of testing. As with the Apple AirPods, audio will pause when taking a bud out of your ear too.",
    "The battery life should last you 3.5 hours for music playback, or a brisker 2.5 hours for more energy-intensive calls – but the charging case will get that amount up to around 14.5 hours total. That's not a huge amount by modern standards, but it is enough to get through a full day's use, at least.",
    "As in any headphones review, though, we need to talk about the audio quality – and it’s not what we hoped we would hear.",
    "The Honor Magic Earbuds pack in 10mm drivers per earbud, and they certainly have some whack, though you probably won’t want to play anything too loudly through them. Trebles, especially, can get quite scratchy, with a grating sibilant sound that turns s’s and x’s into torturous consonants.",
    "We listened to Blondie’s classic One Way Or Another and found ourselves flinching at every refrain of “maybe next week”. This was mitigated by turning down the volume, to be fair – but it doesn’t bode overly well for loud environments, such as a rush hour commute, especially given the slight nature of the earbuds’ active noise-cancelling.",
    "The Magic Earbuds are far better with mids, with our standard rock and pop anthems performing largely well, and vocals being pretty clear – even if some of the finer vocal details we’re used to hearing with the (more expensive, admittedly) Jaybird Vista earbuds aren’t to be found here.",
    "The bass is also pretty nonexistent, meaning you shouldn’t get these earbuds if you’re hoping to listen mostly to thudding house tracks or banging drums.",
    "When listening to Stormzy’s 2019 album, Heavy Is The Head, we found that lower frequencies were largely lost, or converted into lower-end mids – making for a perfectly pleasant sound, though music fans after real audio fidelity probably won’t find what they want here.",
    "The Honor Magic Earbuds offer a satisfying collection of features for its mid-range price tag, including active noise-cancelling and pleasing out-of-ear audio pause functionality.",
    "Audio, however, is a bit rough around the edges, and we can’t help but feel that the sound should have been more controlled. We tested Honor’s buds in tandem with the 2017 Apple AirPods and found the latter were far easier on the ears, with deeper bass and an overall more balanced sound, which is a disappointing realization when reviewing a 2020 model.",
    "While this Apple imitator undercuts the AirPods on cost, something like the Cambridge Audio Melomania 1 may be a better choice at this price point."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "12": "Features",
    "17": "Audio quality",
    "23": "Verdict"
  },
  "links": {
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "in-ear buds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Jaybird Vista earbuds": "https://www.techradar.com/reviews/jaybird-vista",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1"
  }
}