{
  "source": "https://www.techradar.com/reviews/vpnbaron",
  "title": "VPNBaron review",
  "category": "computing",
  "updated": "2020-10-16T15:14:58.980Z",
  "author": "sead-fadilpasic",
  "summary": "Works with Netflix, but don’t expect much more",
  "verdict": "VPNBaron looked good at first but, once we started using it, its bad qualities came to the surface: limited server network, lack of native apps and live chat option, as well as missing information in the no-logs policy.",
  "pros": [
    "Unblocks Netflix",
    "Supports torrenting",
    "7-day money-back guarantee"
  ],
  "cons": [
    "Lacks details on no-logs policy",
    "Small server network",
    "Limited customer support",
    "Expensive"
  ],
  "article": [
    "VPNBaron is a small Romania-based VPN that provides sufficient service when it comes to its support for private browsing, torrenting, and Netflix unblocking. However, it underperforms in many other areas, which is why we recommend you take a look at one of the best VPN services for a better solution if you’re dead serious about your privacy and security online and your requirements cannot be met by VPNBaron.",
    "If you decide to go for this VPN provider, you’ll have three pricing plans at your disposal: the 1-month Bronze pack at €8.52/month ($9.69), which allows only 2 simultaneous connections, the 6-month Silver subscription at €6.92/month ($7.87) with up to 3 simultaneous connections, and finally the 12-month Gold option at €4.94/month ($5.62), which increases the simultaneous connection limitation on 5.",
    "There’s no free trial - at least not in the traditional sense. Instead, there’s a no-questions-asked 7-day money-back guarantee, which should be enough to get a taste of the service and see if you like it enough to keep it.",
    "Three payment methods are accepted: PayPal, credit cards, and Bitcoin.",
    "VPNBaron has many flaws, which is why we recommend you check out superior (and cheaper) solutions, such as NordVPN, Surfshark or CyberGhost.",
    "If you want to splash out on the best service around, go for the more advanced ExpressVPN.",
    "VPNBaron unblocks Netflix US, but only on Windows, Mac, and Linux devices. If you try streaming on mobile devices, you’ll get the “using a proxy” error.",
    "According to the provider’s customer service, no other geographically restricted streaming services are available at the moment.",
    "VPNBaron is owned by the company called HEXVILLE SRL, with an address in Iasi, Romania, a country that doesn’t have any data retention laws, nor is part of any intelligence-sharing alliances. Romania is also a member of the European Union and is therefore subject to GDPR.",
    "The website itself isn’t a great source of information except for the basics, and only after carefully studying its knowledge base do we actually find some of the information we need.",
    "There are 16 server locations available and we manually counted 20 servers on the website, which isn’t much - especially considering some competitors boast thousands.",
    "The settings in the Windows app allow you to choose between UDP and TCP protocols. If you’re using TCP, you can also add DPI (Deep Package Inspection) Protection, which is handy if you’re in a country that censors the internet and restricts certain websites through ISPs, like in China, Egypt or Iran.",
    "Additionally, the app allows you to turn on Force DNS (set a DNS for your real network card) and Kill Switch - a tool that ‘kills’ your online access (disables the network) if the VPN connection is lost, preventing the exposure of your real IP address. Advanced users can also add custom OpenVPN commands.",
    "Torrenting is supported with no limitations, and you can find information about torrenting via the Vuze client in the website’s knowledge base.",
    "There isn’t much detail on VPNBaron’s no-logging privacy on the website (the Privacy and Legal link leads to a broken page), except the claim that it doesn’t gather “data about you and your internet activity.\"",
    "“We record the number of active VPN connections of our users but do not match them with any the ip [sic] data of the server or the user. This information helps us limit the number of simultaneous connections and prevent our network [sic] being exploited,\" reads the site.",
    "This is as much as we get about VPNBaron’s no-logging policy, which is far less than what some of the competitors have, who have not only listed the tiniest details about what they do and don’t log but also invited outside auditors to confirm these claims.",
    "The company’s download section only contains the client for Windows but this VPN service can be installed on Mac, iOS, and Android through third-party software (Tunnelblick and OpenVPN app), as well as manually on Linux and DD-WRT routers.",
    "To help you with installing and using the platform, the provider has created a knowledge base which isn’t very rich but can be handy.",
    "Customer support can be reached via email and phone (in Romania). There’s also a ticketing option, but we only received an empty popup after sending a query, with no way of knowing if it was sent. The live chat option is non-existent, even in the premium members area, which is a bit disappointing for a VPN that is neither free nor cheap.",
    "We asked a few simple questions via email and received a response after two hours, which isn’t ideal if you’re in a hurry, but we’ve seen worse.",
    "The setup process is less user-friendly than we'd like. You first need to create an account, then you’ll need to purchase a subscription, after which you’ll receive a message in the Member Area with a username and password - overkill if you ask us. After you’ve signed up, paid, and downloaded your VPNBaron Windows app, you can open it and sign in.",
    "If you want to use VPNBaron on iOS, Android or Mac, you’ll have to download third-party software and servers separately from the Member Area, but it isn’t terribly complicated considering there are detailed guides covering these platforms accompanied by video instructions.",
    "The Windows app itself is pretty basic, with all the servers listed neatly. However, you won’t be able to switch between them easily when connected. In other words, you’ll have to disconnect from the current server and reconnect to a new one.",
    "The server in Paris that the app chose for us automatically offered usable but low download speeds: 15Mbps on a 55Mbps testing connection. A server in Amsterdam performed better, reaching 18Mbps, while a Tokyo server gave us poor speeds of only 10Mbps.",
    "VPNBaron is a decent VPN service, but nothing special. It supports private torrenting and will give you access to Netflix, but speeds are below average and the server network limited.",
    "Further, there are no native clients except for Windows, there isn’t much useful information about the no-logging policy and the customer service is slow.",
    "If you’re looking for a premium VPN provider that will eliminate all the troubles we encountered with VPNBaron, then, by all means, check out one of the true VPN heavyweights such as ExpressVPN."
  ],
  "headers": {
    "1": "Price",
    "4": "Alternatives",
    "6": "Streaming",
    "8": "About the company",
    "11": "Privacy and encryption",
    "17": "Support",
    "21": "Speed and experience",
    "25": "Verdict"
  },
  "links": {
    "VPNBaron": "https://vpnbaron.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1246684262088214800"
  }
}