{
  "source": "https://www.techradar.com/reviews/hyperx-cloud-ii-wireless",
  "title": "HyperX Cloud II Wireless review",
  "category": "computing",
  "updated": "2020-12-02T23:00:16Z",
  "author": "ural-garrett",
  "summary": "A wireless gaming headset that lacks true versatility",
  "verdict": "There’s so much to love about the phenomenal sound quality and battery life provided by the HyperX Cloud II Wireless. Too bad the lack of a dedicated 3.5 mm jack makes it useless between charges or as general headphones.",
  "pros": [
    "Great all around sound",
    "Outstanding battery life",
    "Quality build",
    "Comfortable"
  ],
  "cons": [
    "Console compatibility is bad",
    "No dedicated 3.5 mm jack"
  ],
  "article": [
    "Despite releasing some of the best gaming headsets like the Cloud Flight and Stinger Wireless, Kingston’s mainline HyperX Cloud series had yet to receive the wire-free treatment. The HyperX Cloud II Wireless hopes to fill that void with some sacrifices. However, mostly everything individuals have loved about the Cloud II and Cloud Core remains. This means the incredibly sturdy aluminum frame still provides hours of comfort and the sound quality is outstanding.",
    "Going wireless doesn’t hurt the audio experience due to the 2.4 GHz connection via USB-A. The battery life is impressive with up to 30 hours of battery life as well. Unfortunately, the lack of a dedicated 3.5 mm jack is a sore point considering the versatility offered by similarly priced competitors and Kingston themselves.",
    "Design wise, the headset looks sleek. A power button, microphone on/off switch, USB-C port for charging and LED battery life indicator alongside the detachable mic jack occupies the left cup while a single volume roll rests on the right cup. Unlike the Cloud II and Cloud Core, the volume roller increases and decreases volume in increments of twos instead of four.",
    "The same aluminum frame remains comfortable and rugged. The headset honestly feels indestructible. Even with the added wireless capability, the Cloud II Wireless weighs nearly the same as its wired siblings. Kingston’s signature memory foam and leatherette returns as well for considerable comfort.",
    "Working best on PC, the virtual surround sound can be switched on and off through standard sound settings. These settings still lack the level of customization offered by headsets from SteelSeries or Razer, though.",
    "Windows and OSX users can also utilize the USB-C port for a wired connection. Be mindful that the included USB-C cable probably won’t be long enough outside of close laptop use. Also, other USB-C devices, like most Android phones or modern iPads, aren’t compatible either.",
    "Besides being incompatible with the Xbox One, it works fine on Playstation 4. The problem with usage on the Switch is that the 2.4 GHz USB dongle only works on the dock. Nintendo’s hybrid console does feature a USB-C port, but it won’t work in handheld mode, unfortunately. With the PS5 and Xbox Series X just hitting the market, it would have been nice to have some compatibility there. To make things even worse, there isn’t a 3.5mm headphone jack, either. Multiplatform gamers who like to have their headsets double as general use headphones should probably stay away.",
    "For those devices that are compatible, users will be in luck as audio quality is still an amazing experience while gaming or listening to music. According to Kingston, the Cloud II Wireless can get louder than both the Cloud II and Cloud Core with sound pressure levels increasing from 98+3dB to 104dB at 1kHz.",
    "First person shooters and horror games, which rely on sound positioning, sound fantastic. And audio quality for music is just as clear as the wired variants. Audio sounds even better through the virtual 7.1 surround sound. Using the microphone is clear as well, due featuring noise-cancelling and built-in mic monitoring. Playing games that require heavy communication shouldn’t be much of an issue though a sidetone adjuster would have been nice.",
    "Charging to full in the two-to-three hour range during the review, the Cloud II Wireless battery is impressive at up to 30 hours. Playing or using the headset around four hours a day means that it’s theoretically possible to only need to charge it once a week.",
    "The HyperX Cloud II Wireless gaming headset was clearly designed with the sole focus of delivering great wireless capability matched with impressive sound quality. Everything else falls apart from the inconsistent console compatibility due to lack of a 3.5 mm headphone jack. Priced at $149.99 (£159, about AU$210), the headset doesn’t offer the same flexibility as the recently released SteelSeries Arctis 7P Wireless."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don't buy it if..."
  },
  "links": {
    "best gaming headsets": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "SteelSeries Arctis 7P Wireless": "https://www.techradar.com/reviews/steelseries-arctis-7p-wireless"
  }
}