{
  "source": "https://www.techradar.com/reviews/silicon-power-1tb-microsd-card",
  "title": "Silicon Power 1TB microSD card review",
  "category": "computing",
  "updated": "2020-12-23T21:01:03Z",
  "author": "desire-athow",
  "summary": "The cheapest large capacity microSD card has landed on our desk with a whimper",
  "verdict": "The Silicon Power 1TB microSD card delivers what it promised, a solid, if unimpressive performance, at a rock bottom price, significantly undercutting the rest of the competition. For single-handedly bringing the prospect of owning a 1TB storage product closer to the masses, it deserves a best value award.",
  "pros": [
    "Cheapest 1TB card at the moment",
    "Relatively fast"
  ],
  "cons": [
    "“Only” five year warranty",
    "No bundled software"
  ],
  "article": [
    "After the Sandisk Extreme 1TB and the Micron C200 1TB memory card, Silicon Power has unleashed its first 1TB microSDXC memory card ahead of bigger names such as Kingston or Samsung. The storage product is part of the company’s Superior brand and is only the sixth card of this capacity available on the market.",
    "Silicon Power sells this 1TB microSD card (SP001TBSTXDV3V20SP) on Amazon for a mere $169.99 with free shipping in the US and shipping and import fees applicable to other destinations.",
    "The microSD card comes with a five year warranty and is, according to the manufacturer, waterproof, shockproof and X-ray proof. Rated at UHS Speed Class 1 (U3) and UHS Video Speed Class 30 (V30), the Superior microSDXC UHS-I card claims to hit read and write speeds up to 100MBps and 80MBps respectively, with minimum random read of 1,500 IOPS and random write of 500 IOPS which explains its A1 classification.",
    "Note that Silicon Power says that products incompatible with the UHS-1 interface will see their read/write speeds drop dramatically, down to around 20MBps in the latter case.",
    "Like all the other 1TB cards on the market, the Superior is likely to use a 96-layer QLC (quad-level cell) NAND technology from WD or Kioxia with an automatic error correction code (ECC) function.",
    "We tested the Silicon Power 1TB microSD card with a Startech microSD card reader, on our Dell Latitude 7490 laptop. Bear in mind that performance will often depend on what card reader you use so we didn’t use the embedded card reader on the laptop.",
    "The card comes without any software - there is no data recovery software like with Sandisk - and formatting it to the exFAT file system leaves us with a 931GB usable disk space. We also recommend that you use a cloud storage or cloud backup service to keep your data safe.",
    "Compared to the two other 1TB microSDXC cards that we have tested, the Silicon Power came out slightly worse on some and slightly ahead on others. It scored the highest Crystaldiskmark read score at 93MBps compared to 92 and 90 for its rivals. We were surprised by its relatively low real life file transfer speeds which fell below 58MBps compared to 71MBPs for Sandisk.",
    "At the time of writing, there are five other microSD memory cards with a 1TB capacity. Three of them are widely available: two from Sandisk (the Ultra and the Extreme) and one from PNY and all of them are far costlier than their Silicon Power alter ego. The Micron C200 which we reviewed back in 2019 is sadly missing in action.",
    "We have probed Samsung, Netac, Patriot and Teamgroup to find out what their plans for 1TB microSD cards are. The latter has the cheapest 512GB microSDXC card on the market, one that costs under $55 or $110 per TB (and a 40% discount on the promotional price).",
    "For those looking for the fastest 1TB microSDXC card, there’s the Sandisk Extreme Pro; it is far more expensive, at $400, but almost doubles the read speeds to 170MBps and is fast enough to record at 8K resolution. You will need a compatible reader to make the most out of it though.",
    "The unique selling point of the Silicon Power Superior 1TB microSD card is its price. At less than $170, its suggested retail price is already cheaper by at least 15% compared to its nearest competitor. It is not significantly slower than its rival although it does not offer a lifetime warranty or a software bundle. But these are compromises that many, we feel, will gladly accept in exchange for a rather sizable saving.",
    "Just bear in mind that this is not a memory card designed for high-endurance use cases like 24/7 surveillance at high resolution. That falls under the remit of Silicon Power’s new Golden Series superior family which unfortunately, at the time of writing only offers up to 256GB capacities.",
    "The falling prices of NAND memory means that we could be looking at significantly cheaper 1TB microSD cards over Christmas and into next year. One thing we won’t see for a foreseeable future will be even higher capacities, partly because of the real physical barriers to, well, putting more things in something that small (see the boxout elsewhere on the page for more).",
    "As for the cheap 2TB microSD cards you frequently encounter on Wish, Amazon or eBay, they’re 100% certified fakes that you will purchase at your own risk. We don’t expect to see microSD cards bigger than 1TB until at least 2023, if ever. 5G and 6G as well as ubiquitous fast Wi-Fi means that, for a lot of users, the onboard storage they have on their laptops or smartphones is plenty enough, especially if they have, say a Google One or a Microsoft Onedrive account."
  ],
  "headers": {
    "1": "Pricing and availability",
    "2": "Hardware",
    "5": "Performance",
    "8": "The competition",
    "11": "Final verdict"
  },
  "links": {
    "1TB microSD card": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fproduct%2FB08NCDG9X9%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8569174984553228000-20",
    "microSD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "Dell Latitude 7490 laptop": "https://www.techradar.com/reviews/dell-latitude-7490",
    "data recovery software": "https://www.techradar.com/best/best-data-recovery-software",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "Micron C200": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card",
    "Google One": "https://www.techradar.com/news/everything-you-need-to-know-about-google-one",
    "Microsoft Onedrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365"
  }
}