{
  "source": "https://www.techradar.com/reviews/oukitel-wp8-pro-rugged-smartphone",
  "title": "Oukitel WP8 Pro rugged smartphone review",
  "category": "phones",
  "updated": "2020-11-21T04:25:54Z",
  "author": "desire-athow",
  "summary": "A waterproof phablet destined for outdoor adventures with a surprising price tag",
  "verdict": "The WP8 Pro by Oukitel is certainly a great deal if you’re looking for a rugged phablet that won’t break the bank. It performs on par with our expectations but the presence of a microUSB port and below average performance means that there are other better alternatives if size doesn’t matter.",
  "pros": [
    "Oleophobic screen",
    "Elegant design",
    "Affordable price",
    "Android 10",
    "Hidden App clone feature"
  ],
  "cons": [
    "MicroUSB port",
    "Sub-par performance",
    "Older Bluetooth",
    "Lacks a notification LED"
  ],
  "article": [
    "The competition at the entry level of the rugged smartphone market is heating up with Oukitel flexing its muscles and threatening established, better known stakeholders such as Doogee, Ulefone and Blackview. Its WP8 Pro, which has just launched, is a statement to the old guard and comes after our recent review of the Armor X8, a rugged device from Ulefone that targets the same audience.",
    "Right now, the Oukitel WP8 Pro is available from AliExpress for $129.99 but from November 23 to November 27, its price will go down to $119.99 as part of AliExpress Black Friday offers.",
    "The first thing that strikes you when you hold the Oukitel for the first time is how thin it is relative to its surface area. At 12.0mm, it is surprisingly svelte for a rugged smartphone; that’s particularly obvious when you look at the other dimensions (178 x 84.7mm). Lift it though and it is pretty clear that this is one solidly built smartphone.",
    "At around 260g, it is reasonably heavy thanks partly to the use of a metal frame and a bigger than average battery. There’s plenty of polycarbonate plastic around and the design philosophy embraced by the WP8 Pro is one of simplicity with the now-universally adopted four big sides/four small corners rugged smartphone design.",
    "The large display has a large in-screen water drop 8-megapixel selfie camera in the middle with a layer of Corning Gorilla glass on top and what looks like an oleophobic coating. The rear of the WP8 Pro houses a 16-megapixel camera sensor with two smaller, 2-megapixel ones.",
    "On the top and bottom are flaps that hide an audio jack and a microUSB port (yes, they still exist). A volume rocker, a customizable button, a dual SIM tray, a power button and a side-mounted fingerprint reader are located on each side of the phone.",
    "Its slim profile means that despite its large surface area, the WP8 Pro can be manipulated with one hand but just barely. Note that it is rated IP68/IP69K and MIL-STD-810G which means that it will be able to handle some toss and tumble without much issue.",
    "Given the entry-level price tag that the WP8 Pro comes with, we were not expecting major surprises given our encounter with the Armor X8.",
    "We recognise the trio of core components: an eight-core Mediatek Helio P22 processor, 4GB of LPDDR4x memory and 64GB onboard storage.",
    "The 6.49-inch display nudges the WP8 Pro into phablet territory but mildly disappoints because of its low resolution (1560 x 720 pixels). Elsewhere, there’s a 5Ah battery (with OTG capabilities), Wi-Fi 5 but Bluetooth 4.2, NFC and an FM radio. The bundled charger is a standard 10W model (5V,2A).",
    "The WP8 Pro performed in line with our expectation; that is, it’s decent as an entry-level smartphone but don’t expect anything that will send your heart racing. It is mightily close in terms of benchmarks to the Armor X8 but tracks consistently below the latter.",
    "This being a Mediatek-powered rugged smartphone, we find the usual array of features such as a toolbox containing what many would consider to be (free) virtual tools for DIY fans and professional handymen. There’s no Duraspeed though, one attribute that allowed users to configure the behavior of apps in the background.",
    "There’s a useful kids mode as well as a game one, both obvious in their target use cases. App clone is a bit more complex but nonetheless a potential lifesaver. It allows you to clone an application. The two applications can run at the same time. This worked with YouTube for example allowing you to run two instances (but not two videos).",
    "Alternatives to the WP8 Pro will have at least an octacore processor with 4GB of RAM and 64GB onboard storage. Android 10 is compulsory as would a bigger-than-average battery.",
    "The first obvious competitor is the X8 which we reviewed very recently. It is smaller, about the same price and shares the same core hardware. Overall, the Ulefone rival wins some (Type-C, better Bluetooth, higher battery capacity) and loses some (lower resolution, lower resolution camera).",
    "The second less obvious one is the WP5 Pro, another Oukitel model that has almost exactly the same specification bar the lack of NFC, the smaller screen size, lower resolution camera sensors and a much bigger battery at 8Ah. It costs almost the same as well.",
    "A tad more expensive at $129.99 at the time of writing is the Doogee S58 Pro, an altogether superior device with more system memory, a 16-megapixel front facing camera, a Type-C connector and a much bigger battery.",
    "The lower end of the market is extremely competitive with four players now vying for a share of the pie in a market that has been growing over the past decade as shown by the rising volume of global search queries for “rugged smartphones”.",
    "The WP8 Pro has a lot going for it but its USP will be its screen size. Although not as big as the 6.88-inch of the Blackview BV6100, the 6.49-inch display is big enough to make the WP8 Pro a potential, more durable candidate to replace tablets handled by field operators. The fact that it runs Android 10 and has cellular capabilities make it even more enticing.",
    "Otherwise, there are better candidates elsewhere either for the same outlay or for just a bit more. We can’t fathom why Oukitel chose to include a microUSB port in lieu of a Type-C connector and why an older version of Bluetooth was included."
  ],
  "headers": {
    "1": "Availability and pricing",
    "2": "Design",
    "7": "Hardware",
    "10": "Performance and in use",
    "13": "Competition",
    "17": "Final verdict"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "Armor X8": "https://www.techradar.com/reviews/ulefone-armor-x8-rugged-smartphone",
    "Oukitel WP8 Pro": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-1212508071695534300&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F1005001292858258.html",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Blackview BV6100": "https://www.techradar.com/reviews/blackview-bv6100-ruggedised-smartphone"
  }
}