{
  "source": "https://www.techradar.com/reviews/creative-sxfi-theater",
  "title": "Creative SXFI Theater review",
  "category": "audio-visual",
  "updated": "2020-02-10T17:55:52Z",
  "author": "ted-kritsonis",
  "summary": "Creative takes its audio holography to headphones made for computers and consoles",
  "verdict": "The Creative SXFI Theater hold a lot of promise to enhance the sound of your favorite games, movies and music, but without Bluetooth, you won’t be wearing them with your mobile devices.",
  "pros": [
    "Works with PC/Mac, PS4 and Switch",
    "Great sound quality with Super X-FI",
    "Easy setup and solid battery life"
  ],
  "cons": [
    "No Bluetooth or TV inputs",
    "Super X-Fi doesn’t work with Xbox",
    "Microphone isn’t spectacular"
  ],
  "article": [
    "There's something more visceral about watching a movie in surround sound. When the audio comes at you from all angles, you feel more immersed in the content and enraptured by the story being told on your TV. But, because you need so many components to make it work, surround sound systems aren't cheap. So what if someone figured out a way to get surround sound audio without the need to buy a bunch of speakers?",
    "Creative has been attempting to do that with its Super X-Fi (or SXFI for short) technology, and the SXFI Theater are the company’s first headphones designed to produce virtual surround sound for TV junkies and gamers.",
    "The Creative SXFI Theater were released at the tail-end of 2019 and currently cost $199.99 / £189.99 / AU$299.95. That's on the more expensive side of things for a pair of wireless headphones - especially ones that don't include features like noise cancellation or regular Bluetooth.",
    "For comparison, you could spend a bit more and get the Jabra Elite 85H that come in at $299.99 / £279.99 / AU$499 and offer noise cancellation, or spend a bit less to get the Audio-Technica ATH-M50xBT that use regular Bluetooth for $199 / £179 / AU$379 ... but neither of those use Creative's proprietary SXFI technology that create the illusion of a full surround sound system in a pair of over-ear headphones.",
    "Technically, this isn’t Creative’s first kick at the can. The Sound Blaster X3 was a USB DAC (digital-to-analog converter) with a built-in headphone amplifier to produce the same SXFI effect for computers and game consoles. The key difference there was that you could plug in your own favorite pair of headphones.",
    "That device plugged in to the computer or console on one end, with wired headphones on the other, but the SXFI Theater takes things full-wireless.",
    "It does this by using a TX wireless transmitter dongle that plugs into a dock that connects via USB to any device capable of running audio through it. The headphones are already paired out of the box because they use their own low-latency 2.4GHz signal to communicate and reduce lag.",
    "There is a 3.5mm line-in cable included in the box to enable wired connections with other devices, including if you want to use the headphones away from home. Doing so cancels out the Super X-Fi effect, however. There’s also no Bluetooth here, leaving all wireless functionality to the signal noted above.",
    "All the controls are situated on the left earcup: The power button is located toward the front, along with connector plugged by a rubber stopper. That’s for the included microphone attachment, which we’ll get to later. There’s a USB-C charging port, 3.5mm jack, mute button, volume dial and the Super X-Fi button toggling the feature on and off.",
    "The padded leather used for the cups and headband helps make the SXFI Theater soft and comfortable, and while they’re a bit heavy at 339 grams, we came away pleasantly surprised at how easy it was to wear them for longer periods.",
    "Like most other wireless headphones, there wasn’t much to setting up these up. We first tried it with a PlayStation 4 by plugging in the dock via USB and slotting in the receiver stick. Once we turned on the headphones, they immediately paired. We had the PS4’s audio routing through to the headphones in seconds.",
    "As with other Super X-Fi products, you can apply an existing profile over to the SXFI Theater. If you don’t have one, you can create it by using the SXFI app on Android or iOS to take photos of your face and both ears. It maps them and uniquely interprets how you hear sound to create the customized profile. The caveat here is that certain headphones are optimized for the audio holographic effect - including most major models from Sennheiser and Sony - and not surprisingly, most Creative headphones as well including the SXFI Theater.",
    "As before, Creative delivers app support on both mobile and desktop: The SXFI Air Control app for Android and iOS and SXFI Control app for Windows PC and MacOS offer some customization options. They’re not unlike those available in the SB Command app the company ties to some of its Sound Blaster products.",
    "You get an EQ, including the option to choose from a handful of presets or creating your own. Overall, the app doesn’t offer a deep dive into too many features, but that was okay with us. We updated the firmware through the mobile app automatically when we first logged in. We couldn’t be sure, but it looked like it was loading our Super X-Fi profile at the same time the firmware was updating.",
    "The SXFI Theater delivers solid sound. Technically, the headphones don’t support Dolby Atmos, DTS, nor any specific surround sound standard from a third-party, however they do a pretty good job of simulating what 7.1 surround might feel like through psycho-acoustics and DSP.",
    "Movies and TV shows sounded great, giving us a wide soundstage to listen to, providing more depth to the audio engineering that went into the content. When we watched Iron Man 3, for example, we could feel the effect go to work with all the various sound effects coming from different directions. But even a film lacking that kind of noise, like Beverly Hills Cop, sounded very different with Super X-Fi.",
    "When we listened to music through the headphones, we got the same experience we had with Creative’s other Super X-Fi headphones. Now that the technology is into its second generation on the software side, we caught on to the improved playback and spatial effect. It’s just cleaner and more spread out, maintaining that feeling of a studio track sounding like it’s at a concert hall.",
    "Because these are Creative’s headphones, the profile for them already exists in the SXFI app, adding an optimization boost.",
    "The key to these headphones is the low latency — apart from the Super X-Fi technology, it’s the primary reason to consider them. Using an ad hoc 2.4GHz connection means the headphones can take advantage of a fatter wireless pipe to receive the signal from the connected audio source. The result? Fewer dropouts and no delays or lag — fundamental things gamers demand.",
    "That being said, we never noticed any significant lag while playing games, both offline and online. Range is limited to about 30 feet, so we found it was better to be a little closer to the transmitter, just in case.",
    "When we did move around to test distance, we didn’t find much of a drop-off, but given the 2.4GHz frequency is common in other wireless devices, interference at greater distances is always a possibility.",
    "We really liked playing different titles from the past and present, like Batman Arkham Knight, Call of Duty: Modern Warfare (2019) and Battlefield V. The ability to discern directional movement and sound is what has always stood out about Super X-Fi in this context. We observed the same thing in our review of the Sound Blaster X3 and Sound Blaster G6.",
    "The lack of Xbox One support is unfortunate if you like the tech involved here, but it’s nice to see the Nintendo Switch included. For PC and Mac connections, the level of customization is higher, but the mobile app can always step in too.",
    "The included microphone attachment isn't amazing, though it is passable. The articulating arm is a nice touch, but the people we talked to didn’t find the audio quality to be all that remarkable. If you like doing voiceovers or consider yourself the chatty type gaming online, you might want to take caution here.",
    "Finally, last but not least, Creative rates the SXFI Theater at 30 hours of battery life per charge. That largely depends on how high the volume is, and how often you toggle Super X-Fi on. We managed to routinely hit above 25 hours at about 65% volume, so the estimate isn’t far off.",
    "What's strange is that the SXFI Theater are really similar to the company’s SXFI Air C, a USB-powered headphone with an almost identical spec sheet. The biggest differences are USB-C and the 2.4GHz connection on the SXFI Theater. The Air C has to be plugged in directly at all times to work, meaning it’s not wireless like this one is.",
    "Paying $200 is a lot to ask from consumers for headphones that don’t have Bluetooth, nor the ability to work natively with TVs, but we like the Super X-Fi technology and where it’s headed. And while it may not be quite as personalized as it could be, SXFI is bound to help you listen to content in ways you hadn’t before."
  ],
  "headers": {
    "2": "Price and release date",
    "4": "Design",
    "10": "Setup",
    "14": "Performance",
    "25": "Final verdict"
  },
  "links": {
    "Jabra Elite 85H": "https://www.techradar.com/reviews/jabra-elite-85h",
    "Audio-Technica ATH-M50xBT": "https://www.techradar.com/reviews/audio-technica-ath-m50xbt-headphones",
    "Sound Blaster X3": "https://www.techradar.com/reviews/creative-sound-blaster-x3",
    "Sound Blaster G6": "https://www.techradar.com/reviews/creative-sound-blasterx-g6"
  }
}