{
  "source": "https://www.techradar.com/reviews/lauco-8-port-wireless-charging-miniature-docking-station",
  "title": "Lauco 8-port wireless charging miniature docking station review",
  "category": "computing",
  "updated": "2020-09-30T08:50:31Z",
  "author": "desire-athow",
  "summary": "At last some innovation in the world of laptop peripherals",
  "verdict": "The Lauco is a USB hub that transforms into a full-fledged laptop docking station once connected to a Type-C power supply unit. Its build quality is surprisingly good and so is the array of ports it offers and its pricing.",
  "pros": [
    "Great value for money",
    "Very solidly built",
    "Plenty of ports",
    "Surprisingly compact",
    "Wireless charging",
    "USB offers 10Gbps speeds"
  ],
  "cons": [
    "No audio port",
    "Can’t run both memory card readers at the same time"
  ],
  "article": [
    "The rise of ultra thin laptops like the ThinkPad X1 Nano from Lenovo does come with some inconveniences: a lack of useful ports which handicap these notebooks making them ill-equipped for optimal working-from-home environments. Such a state of affairs has caused a significant rise in interest both from manufacturers and the target audience for docking stations.",
    "More than 3,200 people have cumulatively invested a massive $326,000 on Kickstarter to back a USB Type-C wireless charging hub the size of a stack of credit cards, one that comes from a company we never heard of before, Lauco. This model has eight ports and there’s one - slightly bigger - that has 12 ports.",
    "The suggested retail price of the 8-in-1 version of the Lauco miniature docking station is $119. Back it on Kickstarter for $79 at the time of writing with an estimated delivery date in October 2020. The crowdfunding ends on October 5. The 12-in-1 version currently sells for $99 with an SRP of $149. Bear in mind though that backing anything on Kickstarter comes with associated risks described here.",
    "We have reviewed plenty of big and bulky laptop docking stations but it is the first time that we came across something as refreshingly small as the Lauco. The 8-in-1 docking station that we received is positively tiny; it looks like a pebble or a puck and holds easily in the palm of one’s hand. It is difficult to believe that this peripheral can not only augment the connectivity options of a laptop - or theoretically a smartphone or tablet - but can also wireless charge a smartphone.",
    "How did they manage to produce something so compact? Below is an exploded view of the device we’re reviewing today. There’s a lot happening here in a compressed form factor - 90 x 58 x 16mm, weighing only 100g - with a brushed aluminum-magnesium alloy enclosure. Four tiny rubber feet raise the base of the device; they hide four tiny screws.",
    "The top is covered by a thin tempered glass sheet where the 10W Qi wireless charger is located. Note that at the time of writing, the third stretch goal ($350,000) was about to be reached which will increase the wireless power rating to 15W (up from 10W) and a 2mm non-slip silicone pad.",
    "There are four Type-C connectors (only two can do data, one is dedicated to power delivery), two memory card slots that can’t be used simultaneously (a microSD card and an SD card), a HDMI port that can output to 4K, a full size USB 3.0 port. All the USB ports are USB 3.1 Gen 2, delivering 10Gbps.",
    "There’s no 3.5mm headphone jack though; a tiny LED will light up when plugged in. Note that the Lauco docking station doesn’t come with its own power supply unit as it is usually the case, instead, you need to “BYOPSU”.",
    "There’s also a 20cm Type-C to Type-C cable in the box. It is not your bog standard $1 cable as it supports 100W power delivery charging as well as USB 3.1 Gen 2 data transmission. That’s a very important point given that the Lauco supports a maximum of 85W USB-C power delivery to the laptop; you will need a 45W charger if you want to use all the functions of the hub",
    "Remember that the Lauco docking station requires a compatible USB Type-C power supply unit in order to charge the host device, otherwise it will just be a passive USB hub that has its (limited) uses We did not encounter any issues nor did we notice any random errors/uncomfortable heat dissipation during our limited time with the device.",
    "Phones that support the DisplayPort alternate mode like the Samsung Galaxy Note 9 will be able to connect to the Lauco hub and to a HDMI monitor without the need for an external power adaptor as the handset will provide the power. Adding in a keyboard and a mouse will transform the smartphone into a thin client with a PC mode, a la Samsung Dex. A great laptop replacement when you are out and about.",
    "We tested it with a Note9, a Dell Latitude 7490 and a Chuwi laptop. Note that you should be able to connect a portable laptop battery charger to it if you are away from a wall socket. Some of the features are also exclusive to Microsoft Windows and are not available on Apple’s Mac platform.",
    "Where to start. Putting together such a product requires the designers to make some choices from the onset. The number of ports, their locations and the power dissipation amongst some of the factors. Ultimately, in our case, it boils down to whether you want a more portable 8-port USB hub or the more extravagant and more expensive 12-port USB hub.",
    "The latter has an additional HDMI connector (which would, in theory allow you to run two 4K monitors simultaneously albeit at 30Hz), two USB type-A connectors and a Gigabit Ethernet port, all the ingredients for a perfect mobile workstation scenario.",
    "Any future improvements? There’s not much to add. We’d love to see an audio connector, a longer two-year warranty (currently only 18 months) and perhaps the ability to integrate the USB cable around the body of the device which will mitigate any risk of mistakenly using the wrong Type-C cable.",
    "All in all, the Lauco, in its 8-port version, is an exceptionally capable piece of technology that should satisfy even the most demanding mobile worker. It is well built, offers more ports than you’d expect, is very keenly priced and didn’t suffer from any major downsides."
  ],
  "headers": {
    "2": "Price",
    "3": "Design",
    "9": "In use",
    "12": "Final verdict"
  },
  "links": {
    "ThinkPad X1 Nano": "https://www.techradar.com/news/lenovo-has-launched-one-of-the-lightest-linux-laptops-ever-built-and-its-a-thinkpad",
    "Lauco miniature docking station": "https://www.kickstarter.com/projects/laucocable/lauco-the-smallestandpowerful-100w-usb-c-wireless-charging-hub",
    "described here": "https://www.kickstarter.com/projects/laucocable/lauco-the-smallestandpowerful-100w-usb-c-wireless-charging-hub#risks-and-challenges",
    "laptop docking stations": "https://www.techradar.com/news/the-best-laptop-docking-stations",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Dell Latitude 7490": "https://www.techradar.com/reviews/dell-latitude-7490",
    "portable laptop battery charger": "https://www.techradar.com/news/best-portable-laptop-battery-chargers-and-power-banks",
    "mobile workstation": "https://www.techradar.com/news/best-mobile-workstations"
  }
}