{
  "source": "https://www.techradar.com/reviews/urbanista-london",
  "title": "Urbanista London review",
  "category": "audio-visual",
  "updated": "2020-08-17T10:38:55Z",
  "author": "olivia-tambini",
  "summary": "The Urbanista London are a cheaper alternative to the AirPods Pro",
  "verdict": "The Urbanista London are a good cheap alternative to noise-cancelling true wireless earbuds like the Apple AirPods Pro, and with a slick, fashionable design, they’re ideal for the more style-conscious among us. The sound quality is pretty good, and while the noise cancellation could be better, it’s unusual to get ANC at all at this price, making them well worth a look if you’re on a budget.",
  "pros": [
    "Stylish looks",
    "Decent sound",
    "IPX4 water-resistance"
  ],
  "cons": [
    "Noise-cancellation isn’t the best",
    "Audio lacks a little detail"
  ],
  "article": [
    "The Urbanista London are part of a new wave of noise-cancelling true wireless earbuds, but unlike much of the competition, they’re not particularly expensive at $149 / £129 / AU$269.",
    "A cheaper alternative to the Apple AirPods Pro and the Sony WF-1000XM3, these wireless earbuds stay true to Urbanista’s cool, fashion-forward aesthetic, coming in navy, black, rose gold, and pearlescent white, with a slick USB-C charging case. We loved the jewelry-like sheen of these buds, and they certainly stand out from the sea of monochrome earbuds on the market.",
    "Aside from their stylish use of color, it’s clear that these buds take a few style cues from the AirPods Pro, with protruding touch-sensitive stems and silicone eartips – you get three different sizes of eartips in the box, and we found them to be very comfortable to wear.",
    "For gym bunnies, there’s an IPX4 water-resistance rating, which means these buds can stand a bit of sweat – and for all us less physically-inclined bud wearers, that means the Urbanista London won’t break if you get caught in the rain, too.",
    "Pairing the earbuds with our smartphone was super easy, and thanks to Bluetooth 5 support, the connection was strong and reliable. The battery life of the Urbanista London comes in at 25 hours in total – that’s five hours from the earbuds themselves, with an additional four charges contained within the charging case.",
    "That's a slight increase on the battery life offered by the AirPods Pro, despite the far lower price.",
    "We were pleasantly surprised by the audio quality provided by the Urbanista London. A generally warm, well-balanced soundstage makes it near-impossible to not tap your toes while listening with these buds – a universal indicator of decent sound.",
    "They aren’t the most dynamic earbuds we’ve tested, and slightly rolled-off treble frequencies means that you may miss out on a little detail in the higher frequencies of your music; audiophiles in particular will likely crave a little more accuracy and a more neutral sound.",
    "Still, for the price, the sound is good, and certainly suitable for casual listeners. Unfortunately, the noise-cancellation isn’t quite as good, and it doesn’t live up to the AirPods Pro or the Sony WF-1000XM3.",
    "That being said, the Urbanista London do block out some environmental sound, and with your music turned up, you should be able to listen relatively undisturbed. For that reason, these buds might not be suitable for you if class-leading noise cancellation is a dealbreaker – if that’s not the case, there are plenty of reasons to love these stylish, budget-friendly wireless earbuds.",
    "The Urbanista London were released on May 25, and cost $149 / £129 / AU$269 – which is considerably more budget-friendly than many noise-cancelling earbuds on the market today.",
    "For example, the AirPods Pro cost $249 / £249 / AU$399, and with a similar design, the Urbanista London could make a cheaper alternative to the Apple earbuds.",
    "Cheaper true wireless earbuds that cost under $100 / £100 are increasingly commonplace – the JLab Go Air cost just $29 / £29 for example, but don’t expect cool extras like noise cancellation.",
    "Coming in navy, black, rose gold, and pearlescent white, the Urbanista London perpetuate the brand’s reputation for cool, colorful earbuds, which are just as much fashion accessories as they are audio devices.",
    "These earbuds take a few style cues from the AirPods Pro, with protruding ear stems and silicone ear tips, though the choice of colors is a welcome departure from Apple’s all-white aesthetic – and the satin sheen of the earbuds and charging case adds of luxe, jewelry-like feel.",
    "Those ear stems are touch-sensitive, and can be used to control your music playback, summon your device’s voice assistant, and answer or reject calls. In our experience using the touch controls was okay, though sometimes a single tap was registered as a double tap and vice versa. Unfortunately, there’s no way to skip tracks via the touch controls, so you’ll have to fish your phone out of your pocket if a terrible track intercepts your playlist.",
    "The Urbanista London’s USB-C charging case is small enough to slip easily into your pocket, and comes with a row of four LEDs underneath the clasp, which give you an indication of your remaining battery life.",
    "Open up the case, and you’ll find magnetic pins that keep the earbuds safely in their slots when not in use; in between these slots, there’s a pairing button that you need to hold down to connect the buds via Bluetooth for the first time. Having paired them once, you need only to open up the charging case and the buds should automatically pair with your phone, which is really convenient.",
    "During our tests, we found the Urbanista London were very comfortable to wear, even during long listening sessions, and with a choice of three ear tip sizes, you should find that they stay securely in your ears.",
    "An IPX4 water resistance rating means that these wireless earbuds can be used during workouts – while the best running headphones may come with higher IP ratings, the Urbanista London will certainly be able to withstand a little sweat or rain.",
    "With a 10mm driver in each earbud, the sound profile offered by the Urbanista London is generally warm and well-balanced, if not super dynamic and lively.",
    "Starting off with Phoebe Bridger’s Garden Song, intricately picked guitars provided a warm bedrock for Bridger’s haunting vocal melody, as it floated above the mix with a pleasantly soft tone.",
    "Moving onto the livelier Kyoto, the juxtaposition of distorted guitars and crashing drums with kitschy flute melodies sounded well-balanced, with plenty of room for each instrument to shine.",
    "As we listen to I Don’t Belong by Fontaines DC, mellow guitar riffs and punchy drum fills sound tightly controlled – though the highest frequencies are somewhat rolled off, so you do miss out on that very top end of the percussion.",
    "This means the Urbanista London aren’t the most accurate-sounding earbuds on the market, and some listeners may find the sound comes across as slightly muffled. Still, if you find harsh treble frequencies give you a headache, you may prefer this softer sound.",
    "There’s a little liveliness missing from the soundstage, too; dynamic changes in tracks like 'God Only Knows' by The Beach Boys are a little subdued, and we missed out on some of those undulating vocal harmonies.",
    "Even so, there’s an undeniable head-nodding, toe-tapping quality to these earbuds, and they certainly make for an enjoyable listen. The Beatles’ 'I’m Only Sleeping' sounded rich and highly textured, with reversed electric guitar drones cutting through the dulcet barber-shop style vocals.",
    "A Day In The Life is similarly enjoyable to listen to, with taut bass runs and expertly panned vocals giving way to cacophonous orchestral racket.",
    "The noise cancellation offered by the Urbanista London is pretty limited, but it will block out some environmental noise – and if you’re listening to music as well, you should find you’re able to listen relatively undisturbed. They’re definitely not on par with the Sony WF-1000XM3 or the AirPods Pro, but the Urbanista London do a pretty good job for the price.",
    "As for the microphone quality, we found that our voice was picked up accurately when using the earbuds to summon Google Assistant, and calls sounded clear enough when we spoke to friends using the buds.",
    "The battery life of the Urbanista London comes in at 25 hours in total – that’s five hours from the earbuds themselves, with an additional four charges contained within the charging case.",
    "That’s not dissimilar from the battery life offered by the AirPods Pro, despite the Urbanista London being significantly cheaper. That’s not to say that 25 hours is particularly impressive, however; the budget-friendly Lypertek Tevi boast an outstanding 70-hour battery life, for example.",
    "Thanks to Bluetooth 5 support, the connectivity of the Urbanista London is very good, and they’re incredibly easy to pair. Connect them once, and from then on, they’ll pair with your device when you simply open up the charging case."
  ],
  "headers": {
    "10": "Urbanista London price and release date",
    "13": "Design",
    "20": "Audio performance",
    "28": "Noise cancellation and microphone quality",
    "30": "Battery life and connectivity",
    "33": "Don't buy them if..."
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "noise-cancelling earbuds": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "JLab Go Air": "https://www.techradar.com/reviews/jlab-go-air-true-wireless-earbuds",
    "best running headphones": "https://www.techradar.com/best/best-running-headphones",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Lypertek Tevi": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review"
  }
}