{
  "source": "https://www.techradar.com/reviews/huawei-mate-20-pro-review",
  "title": "Huawei Mate 20 Pro review",
  "category": "phones",
  "updated": "2020-10-21T16:37:40Z",
  "author": "david-lumb",
  "summary": "The Huawei Mate 20 Pro is still a powerful device, and now it's cheaper",
  "verdict": "Huawei has the best from Apple and Samsung in its sights with its powerful, full-featured flagship – and it's worth the cost, if you can stomach a four-figure pricetag.",
  "pros": [
    "Top-of-the-line specs in a classy design",
    "Three cameras, including a great wide-angle lens",
    "World-first features on a mainstream phone, like in-screen fingerprint"
  ],
  "cons": [
    "Pricey. So pricey.",
    "Camera's HDR elements aren't as good as Google Pixel 3, iPhone XS",
    "Basic UI, complex nest of settings, little tutorial help"
  ],
  "article": [
    "Update: After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "While it's no longer the newest Huawei phone on the market, the Huawei Mate 20 Pro has enough premium features to keep up with recent flagships. It’s a powerful smartphone with three rear cameras and a distinct yet reserved style, but its bold signature is a handful of neat tricks (like an in-screen fingerprint sensor) that are finally coming to mainstream phones.",
    "In many ways, the Mate 20 Pro is a superlative device that rivals the Samsung Galaxy Note 9, Google Pixel 3, iPhone XS, and other 2018 phones. While it's been surpassed by the Huawei Mate 30 Pro and the new flock of 2020 flagships, it's still a powerful phone that you can now find far cheaper than its original £899 (AU$1,599, €1,049, about $1,150) pricetag: now, you might find one online for half the cost.",
    "That lump of change could get you a powerful laptop, DSLR, budget motorcycle or modest vacation. The Mate 10 Pro, released last year, started at £699 ($799, AU$1,099), but the new Mate 20 Pro has joined a few of this year’s other top flagships to become one of the most expensive consumer phone on the market.",
    "Inevitably, then, sitting as it does in that top-tier price bracket, the Mate 20 Pro is subject to the question: is it worth all that money?",
    "The short answer is yes, if your only scale is what other current phones have to offer. Whatever else happened in 2018, phone innovation didn’t, which makes the Mate 20 Pro’s minor improvements and additions more impressive.",
    "But let’s delve into the specifics to see why this is pretty great phone perhaps deserves its dizzyingly high price tag.",
    "The Mate 20 Pro release date was October 26, 2018, in the UK, and November 1 in Australia, it costs £899, €1,050, AU$1,599 (about $1,150). As has been the case with Huawei, don’t expect this flagship phone to hit US shores - unless you buy an unlocked version from overseas and find a carrier that will support it.",
    "There’s only one version of the Pro (for now) with 6GB RAM and 128GB of storage. But the other versions in the Mate 20 line – like the 7.2-inch screen Mate 20 X and 8GB RAM and up to 512GB Porsche Edition – offer different performance and form factors if you want a slightly different take on this already-performance-driven smartphone.",
    "In previous years, we've seen the Huawei Mate series discounted heavily around Black Friday and Cyber Monday so you may want to see if this device is any cheaper on those sale periods.",
    "If you missed the Huawei P20 Pro earlier this year, you’re in luck: the Mate 20 Pro is a better version in nearly every way.",
    "Where the P20 Pro had a main camera, 3x zoom telephoto and monochrome lens, the Mate 20 Pro kept the former two and added a color ultra-wide lens. While this may give its predecessor the edge on low-light and nighttime shots, the Mate 20 Pro is no slouch there, and you’ll love having the option to ‘zoom out’ with the ultra-wide.",
    "The Mate 20 Pro inherits the 24MP f/2.0 front-facing camera from the P20 Pro, but expands the front camera suite with more sensors. This stretches its notch to iPhone XS-levels of width, but that’s the price for more dynamic photos unlocking the phone with your face.",
    "At 157.8 x 72.3 x 8.6mm, Huawei’s latest phone is just a couple millimeters bigger (and almost a millimeter thicker) than the P20. That makes its 6.39-inch OLED screen larger, too, with resolution that’s higher than the Google Pixel 3 and slightly better than the Samsung Note 9, at least on paper.",
    "One of the biggest braggable points, of course, is the Kirin 980 processor, which is debuting on the Mate 20 Pro and its sibling devices. It's the first 7nm chip on Android and second in the market after Apple’s formidable A12, which came packed in the iPhone XS and iPhone XS Max.",
    "The Mate 20 Pro’s 6GB of RAM and 128GB of storage haven’t improved from the P20 Pro, though you can expand the storage via a new proprietary “nanoSD” format card to a maximum of 256GB. But if you opt to plug in a nanoSD for more storage, you’ll have to place it in one of the phone’s two SIM slots (cleverly stacked in an over/under tray inserted next to the USB-C port) and give up dual SIM functionality.",
    "These specs are about on par with other flagship smartphones, though the Kirin 980 is speedier than Snapdragon 845 which first appeared in a phone earlier in March. Don’t worry about sapping the battery while you’re putting the new chip through its paces: the Mate 20 Pro comes with a 4,200mAh battery, which lasts as long as you’d think.",
    "The Mate 20 Pro has a couple things other phones today don’t, though they’re more party tricks than market-upending features. The first is something phone fans have been eager to try out: an in-screen fingerprint scanner. In theory, this makes it easier to unlock your phone while it’s resting flat than using a back-mounted fingerprint button or facial recognition.",
    "The second new trick probably won’t get used much, but in a pinch, it’s a godsend: the Mate 20 Pro can wirelessly charge other Qi-charging phones or devices. There’s nothing more heroic than lending a hapless friend some juice when their phone is at death’s door.",
    "Looking at the Mate 20 Pro tells you two things: 1) it likely costs quite a bit of money, and 2) it’s got a signature look – but only from the back. Which isn’t to knock its high-resolution, curved-edge screen and thin-but-wide notch; we’ve just seen them elsewhere before.",
    "The top tier of the smartphone market requires differentiation, and Huawei chose to let its cameras do the talking. The Mate 20 Pro collects all three of its rear-facing cameras and its flash in a slightly-raised block on the phone’s backside. With the rear fingerprint sensor gone, this gives the phone a clean, semi-symmetrical look that’s better in person than in pictures.",
    "Individuality aside, there’s no getting over how long and thin this phone is. The Mate 20 Pro dimensions are still several millimeters smaller than beastly flagship phones like the Samsung Galaxy Note 9, but it is one of the larger phones on the market.",
    "As a result, using the Mate 20 Pro one-handed went out the door during our testing. We found ourselves relying on the serviceable facial recognition rather than the in-screen fingerprint sensor (located 2/3 down the front) to unlock the phone. The thinner edges made it difficult to type or swipe around one-handed, and the sleek front-and-back surfaces combined with the very tall ratio (19.5:9) made it a bit hard to use the phone casually, like if I wanted to flip it out to check the weather.",
    "In other words, it feels like a pricey phone that sacrificed ease-of-use for a little extra screen space, which is great for whoever is fine with two-handing their device. To be fair, there are a couple settings to help, but the most useful just shrinks the screen space to put it within reach of your fingers, wasting a good portion of that big, beautiful display.",
    "The phone itself comes in five colors, three of which have the standard glossy surface that makes it trivial to slide the phone over slick tables (the slightly-protruding camera block notwithstanding). These include a standard Black, a cream-colored Pink Gold and the signature Huawei blue-fading-to-purple Twilight.",
    "The last two hues, Emerald Green and Midnight Blue, have something else: an ever-so-slightly textured back. Remember holofoil trading cards and comics from your childhood? That’s what this feels like, arguably affording more grip than the other surfaces and, as Huawei claims, resisting fingerprint smudging.",
    "But it’s so subtle that it might just be there to sound cool when you run your finger across it. (As “cool” as a muted zipper sounds, anyway.) In other words, it’s one of many small things that contribute to the Mate 20 Pro’s rep as a pricey, elite phone.",
    "The other instant giveaway, of course, are the three rear cameras, arranged in a signature 2x2 grid. A Huawei spokesperson reckoned that the camera block would instantly tip bystanders off to your phone’s make and model, and they aren’t wrong.",
    "The Mate 20 Pro has a full IP68 water and dust resistance rating, which is the industry standard these days. And lastly, if you lamented when the Mate 10 ditched the headphone jack, hopefully you bought some Bluetooth headphones in the interim: the Mate 20 Pro doesn’t have a 3.5mm port, either. If that’s a dealbreaker, consider the vanilla Mate 20 or the gamer-focused Mate 20 X – both of which include the standard audio port.",
    "Mate 20 Pro’s OLED 6.39-inch screen is gorgeous, plain and simple. It helps that the Mate 20 Pro ditched the Mate 10’s bottom-front button for a seamless display. Its bezels are pretty thin, especially without a lower speaker grille: instead, sound comes out of the bottom-facing USB-C port. (Don’t worry, its output isn’t dampened much when something is plugged in.)",
    "The display has an impressive 19.5:9 ratio 2K+ resolution (3120x1440), which is about 537 pixels per inch. That puts it ahead of the Google Pixel 3 at 439ppi and just past the Samsung Galaxy Note 9 at around 514ppi. While there’s not too much content that makes full use of this resolution – and, sadly, there’s no out-of-the-box option to split the screen between two windows – it’s still a sharp and vibrant display.",
    "If you want to shift the color temperature or ditch all the harsh blue light, there are options in the settings to tweak those to your preference. If you want, you can even downgrade the Mate 20 Pro resolution to full HD or lower, which reduces battery drain, though that feels like a Harrison Bergeron-level injustice. Even dialed down to HD+, the expansive screen looks good.",
    "The Mate 20 Pro display’s edges curve down in a this-looks-expensive style straight out of Samsung’s playbook. Even if it doesn’t come with any interactive elements (like the squeeze-to-activate HTC U11 Edge Sense), the curved screen admittedly gives the Pro a classy, if unoriginal, look.",
    "Speaking of following trends – yes, the Mate 20 Pro has a notch. It’s about as wide as the iPhone XS for the same reason: to fit in the front-facing camera and sensor package. If you find the notch hideous, you can hide it with an effect that shifts the ‘ears’ into dark mode, which decently simulates a full black bar at the top.",
    "It’s a good bet that the OLED screen is brighter than the 820 nits its less-powered sibling, the Mate 20, is capable of, but we don’t have an official word from Huawei. Suffice to say, it can get bright. Very bright.",
    "The in-screen fingerprint sensor does work, and pretty reliably... so long as your finger is placed in the small target area. A fingerprint zone pops up when the screen activates, which means you’ll either have to tap the display ‘awake’ to find your target or guess where the sensor is. That’s much harder to do by feel when grabbing your phone from a pocket.",
    "Even then, it’s not perfect at recognizing fingerprints, and is so-so at reading portions of fingers. While the in-screen sensor certainly makes the Mate 20 Pro easier to unlock than a back-mounted sensor or facial recognition when it’s resting flat, the feature is more cumbersome than a dedicated physical button.",
    "Still, Huawei is ushering in the age of in-screen fingerprints, which deserves praise for keeping the front screen lean and clean."
  ],
  "headers": {
    "8": "Huawei Mate 20 Pro release date and price",
    "11": "Key features",
    "20": "Design",
    "30": "Screen"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Samsung Galaxy Note 9": "https://www.techradar.com/reviews/samsung-galaxy-note-9-review",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "Huawei Mate 30 Pro": "https://www.techradar.com/reviews/huawei-mate-30-pro-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "Mate 20": "https://www.techradar.com/reviews/huawei-mate-20",
    "HTC U11": "https://www.techradar.com/reviews/htc-u11-review"
  }
}