{
  "source": "https://www.techradar.com/reviews/newsleecher",
  "title": "NewsLeecher review",
  "category": "computing",
  "updated": "2020-11-16T23:08:41Z",
  "author": "desire-athow",
  "summary": "Reliable all-in-one service",
  "verdict": "Impressive and speedy Usenet access is complemented by a free newsreader, fast search, and a simple collection of subscription bundles.",
  "pros": [
    "Newsreader with search",
    "Good binary and text retention rates",
    "500+ Mbps download speeds"
  ],
  "cons": [
    "Newsreader is subscription-only",
    "Larger free trials out there"
  ],
  "article": [
    "Getting started with Usenet can be tricky for the newcomer. Similarly, older newsreaders are unsuitable for the modern demands of Usenet access, such as superfast search and NZB files.",
    "One solution to this is NewsLeecher, the Usenet service provider that also offers a free desktop client. Used together, the NewsLeecher service promises fast speeds and long retention.",
    "Registered in 2002, NewsLeecher has servers in the US and EU, and bundles a free (optional) newsreader client into subscriptions. Three subscription levels are available via a smart website.",
    "NewsLeecher has a strong reputation, although in recent times has been struck by denial of service attacks.",
    "With a full NewsLeecher subscription (a client-plus-search subscription is also available), you can expect unlimited downloads, over 12 years' retention, 256-bit encryption, and speeds of over 500Mbps (where your internet provider supports it).",
    "As noted, there is also a free client which can be used with any other Usenet service if necessary.",
    "NewsLeecher boasts \"SuperSearch\", an optimized, superfast search system that ensures fast search results. Meanwhile, the \"SuperLeech\" feature helps you to automatically find specific binary files when they're uploaded, saving time with manual searches. These tools are available only via the NewsLeecher app, which underlines its value.",
    "Elsewhere, NewsLeecher is keen to communicate its server status, providing a public service status page, complete with facts, figures, and graphs. To underline this commitment to clarity, even the signup page has server status updates.",
    "For technical help and support, there is both an active community forum for tech support answers, feature requests, bug reports, and a support form to log a ticket.",
    "Member access to support tools and settings is provided via an attractive, easily navigable website.",
    "For most Usenet service subscribers, the important factors are download limits, speed, and retention. This term refers to the length of time data is retained on a Usenet server. NewsLeecher offers an unusual approach here, providing two retention limits - one for text (discussion \"newsgroups\" on Usenet), another for binaries.",
    "So, while (at the time of writing) text retention is 6312 days (over 17 years), binary retention is just 4540 days (almost 12 and a half years). So, media from 2008 and discussions dating back to 2003 can be found using NewsLeecher. This is a considerable advantage for the service, and almost certainly the largest retention limit available.",
    "There is no claim for completion, however. A cursory glance at the NewsLeecher status page reveals that some data loss occurred in late 2019 to early 2020, which has no doubt impacted on the service's ability to post the industry-standard 99% (or more) completion.",
    "You'll get the basic 256-bit SSL encryption option with NewsLeecher; given it's as fast as the unencrypted option there's no reason not to keep your Usenet activity secure.",
    "Signing up to NewsLeecher requires email address, username, and first and last name. This isn't as much as some providers, but more than others. Payment is via credit card or PayPal. Unlike some Usenet services, there is no crypto option to help enhance your privacy.",
    "Curiously, while the service's terms and conditions are relatively detailed, there is no specific Privacy Policy available on newsleecher.com. As such, it's not possible to discern whether or not your personal data is held securely, if any of it is sold, whether NewsLeecher retains access or activity logs, and if search logs are stored.",
    "This seems like a key shortcoming that could be addressed relatively easily.",
    "Newsleecher was tested using the dedicated app, mid-morning, on an internet connection checked on Speedtest at 63Mbps (tested using a UK ISP connecting through a Dutch VPN to bypass traffic shaping).",
    "The sample file was a randomly chosen upload from 34 days earlier, a 2.1GB DivX file compressed as RAR. The download was consistent at around 2000Kbps, peaking at 2100Kbps.",
    "Overall, this is a satisfactory result. Access to text groups and messages is lightning-fast, as you would expect for the relatively small files. The Newsleech client permits posting to newsgroups.",
    "Three bundles are available from NewsLeecher.",
    "The first is somewhat incidental. It provides only the NewsLeecher client, and SuperSearch and SuperLeech services to the subscriber for $3.99 (£3.08 or €2.62) a month. Just to underline: there is no Usenet access with this Client Plus option. You do get priority support for software issues, however.",
    "For standard Usenet access, NewsLeecher's $9.49/month (£7.33 or €8.07) Pure Usenet package gives you priority support, 30 simultaneous connections, full retention, and SSL.",
    "The premium package from NewsLeecher is the Ready-To-Go option. For $11.99 a month (£9.26 or €10.20), you can enjoy the benefits of the Client Plus and Pure Usenet packages. This is the prime NewsLeecher experience and feels more of a complete package.",
    "NewsLeecher does not offer the ability to pay for six months or annually in advance. There is also no \"block\" option for short term use. However, all NewsLeecher bundles can be cancelled at any time, and a free fully featured 14-day trial with a 14GB download limit is available.",
    "While there is nothing flashy about NewsLeecher, the service feels competent and confident.",
    "Many Usenet providers deliver their service through largely anonymous and barely functional websites. NewsLeecher offers a far more polished approach, but it's one that also feels \"hands on.\" You get the feeling that there is someone actively running the operation, rather than it being a sort of \"pop-up\" service.",
    "Retention is outstanding, the SuperSearch feature lives up to the name, and the pricing is effective. Privacy seems to be a shortcoming, but otherwise this is a commendable Usenet service.",
    "Perhaps best of all is that NewsLeecher's app can be used with any Usenet provider. So, if you get tired of NewsLeecher's Usenet provision and fancy a change, the app is still there, suitable for adding other Usenet servers and credentials."
  ],
  "headers": {
    "4": "Features",
    "10": "Retention",
    "13": "Security and privacy",
    "17": "Performance",
    "20": "Pricing",
    "25": "Final verdict"
  },
  "links": {
    "Usenet": "https://www.techradar.com/best/best-usenet-providers",
    "NewsLeecher": "https://www.newsleecher.com/",
    "service status": "https://www.newsleecher.com/status/",
    "Speedtest": "https://www.speedtest.net/",
    "Pure Usenet package": "https://www.newsleecher.com/usenet/?fpbt",
    "Ready-To-Go": "https://www.newsleecher.com/readytogo/?fpbt",
    "Client Plus": "https://www.newsleecher.com/software/?fpbt"
  }
}