{
  "source": "https://www.techradar.com/reviews/the-last-of-us-2-review",
  "title": "The Last of Us 2 review",
  "category": "gaming",
  "updated": "2020-06-20T11:44:20Z",
  "author": "vic-hood",
  "summary": "The Last of Us 2 is the greatest game of this generation",
  "verdict": "The Last of Us 2 is an emotional, captivating gut-punch that explores themes of vengeance, tribalism, and the gray areas of morality, making it not only the game of the year, but of this generation.",
  "pros": [
    "Incredibly fluid combat with more elements",
    "Rewarding pockets of exploration",
    "Plenty of accessibility options",
    "Captivating and nuanced storytelling"
  ],
  "cons": [],
  "article": [
    "Troy Baker tried to warn us. The voice-over actor, who portrays Joel in The Last of Us series, told us that we weren’t ready for The Last of Us 2 – and he was right. Whether you’ve caught spoilers, watched trailers or just have your own expectations of what The Last of Us 2 will entail, you won't be prepared for the emotional impact of this stunning sequel – and there’s nothing like experiencing it first-hand.",
    "The Last of Us 2 is a captivating masterpiece. Not only does it improve on its predecessor, but it trumps every PS4 game that has released this generation. That’s down not only to the emotive and nuanced storytelling, which confidently exceeds the boundaries of what we know games can be, but in the way the game takes a critically-acclaimed formula and elevates it beyond what we could have imagined. And it does so without submitting to the tropes we’re so used to seeing in games.",
    "But this exploration of new ground doesn't mean that developer Naughty Dog has strayed from the core elements of the series. Infected still lurk in the shadows of desolate buildings, we're still presented with stunning, lost worlds that only offer pockets of exploration off the beaten track, and we again become emotionally tied to the beautifully developed characters laid before us.",
    "However, with The Last of Us having been released seven years ago, there are plenty of welcome adjustments and additions to modernize what could, in the original game, often be a clunky experience. In The Last of Us 2, combat is more fluid but measured, taking into account not only how a character would approach a situation, but how their physicality informs their strengths and weaknesses, while small but vital improvements to weapon and skill upgrades allow for more control over your playstyle.",
    "All these aspects come together to create a sequel that won't disappoint, and which will have you torn but enraptured from cutscene to cutscene. It's been a rocky road to The Last of Us 2, plagued with delays and spoiler leaks, but we can assure you that it’s been worth the wait. If there's one more current-gen game you pick up this year, make it The Last of Us 2.",
    "The Last of Us saw grizzled smuggler Joel tasked with escorting angsty teenager Ellie through a post-apocalyptic United States on a mission to find a militia group known as the Fireflies, who are residing in the Massachusetts State House outside the quarantine zone. During the journey, it comes to light that Ellie is immune to the infection that has ravaged the globe, and that the Fireflies want her so they can attempt to develop a cure. But when it turns out that the Fireflies at that location have been killed, Joel and Ellie travel to Jackson County, Wyoming to enlist the help of Joel's brother Tommy, an ex-Firefly, to locate the group.",
    "Turns out the Fireflies are in Saint Mary’s Hospital in Salt Lake City, Utah. So, long story short, the pair travel to the hospital, where they find the militia group. However, Marlene, the head of the Fireflies, tells Joel that Ellie is being prepped for surgery and that, in order to find a cure, the infected part of Ellie’s brain must be removed – which would ultimately kill her.",
    "Joel, who's definitely not on board with this plan, kills all the Fireflies and flees with Elllie, who, on this long journey, has become like a daughter to him. The pair return to Jackson, but Joel lies to Ellie about their escape, telling her that the Fireflies had found other immune people and that they couldn’t find a cure, so she was free to go.",
    "The Last of Us 2 picks up the story roughly four years after its predecessor. Ellie and Joel now live alongside Joel's brother Tommy in a settlement in Jackson County, where they've built lives the best they can considering the dangerous and unpredictable state of the world.",
    "However, the relationship between Ellie and Joel is becoming strained, with Ellie having doubts about what really happened with the Fireflies, and Joel struggling to loosen the reigns on the (now grown) woman that he once put his life on the line to protect.",
    "Immediately we become immersed in the lives of the characters again, even though their relationship has changed drastically from when we left them. Naughty Dog leverages the bond we developed with Joel and Ellie in a way that has you truly feeling the heartbreak on both sides.",
    "After a series of harrowing events, Ellie leaves Jackson in search of revenge, heading to Seattle in pursuit of members of a new militia group that has popped up in place of the Fireflies: the Washington Liberation Front (WLF or Wolves for short).",
    "We're not going to tell you any more than that about the subsequent events in this review, because you really do need to experience it first-hand. Every emotional sequence is better played than spoken about – trust us.",
    "While The Last of Us primarily explored the relationship between Ellie and Joel, The Last of Us 2 goes far beyond that. You'd be forgiven for thinking this is a simple bloody revenge story, and Naughty Dog could have fallen into that trope.",
    "Instead, we embark on a story that blurs the lines between the 'good guys' and the 'bad guys', often in a way that's hard to digest, and in which an 'us versus them' mentality becomes much more complicated when everyone is simply out to survive. More connects us than separates us, and Naughty Dog's nuanced storytelling exposes parallels between Ellie and those she sees as the 'other' in subtle but powerful ways.",
    "Perhaps the hardest pill to swallow is that we're forced to watch Ellie lose herself and what she cares about as a result of a vendetta, while being complicit in her violent actions, and then witness the consequences of those actions for others.",
    "While other games have dipped their toes in the waters of fleshing out 'enemy' characters, providing them with a tragic backstory or some redeeming characteristic, The Last of Us 2 goes a step further. You feel empathy for the other side, and your feelings about the protagonists shift; it's uncomfortable, and a true testament to Naughty Dog's storytelling.",
    "Every line in The Last of Us 2 earns its place, carefully considered and carrying emotional weight, with beautifully scripted scenes the inquisitive will stumble upon, but which players in a hurry could miss entirely.",
    "This thoughtfulness runs through the veins of the game. We see a degree of diversity that shouldn't be an accomplishment for game in the modern age. We're presented with diverse body types, often atypical of the bikini-clad women we still often see in modern media; a range of ethnicities, avoiding the lazy stereotypes often assigned to them; and there's an exploration of gender and sexuality that doesn't feel forced or disingenuous, and which avoids the pitfalls of familiar tropes.",
    "The Last of Us 2 shows us in more detail the stunning world we fell in love with the first time round. While you can't explore every location as thoroughly as the curious among us might want to, you'll want to take time to soak up the grim atmosphere, particularly the smaller details, before venturing down the linear path set before you.",
    "And that's not to say there aren't areas to investigate. There are little pockets of exploration available when you need to scavenge resources and collectibles, and often, taking advantage of these can lead to you triggering scenes you could have otherwise missed entirely, and which add layers to the lore and character development. We implore you to take in as much as possible but, as Naughty Dog previously said, there are plenty of scripted scenes you'll probably miss the first time around; this is a game that demands to be played again.",
    "The variance in locations will come as a welcome change for those who grew tired of the rehash of desolate apartment buildings on offer in The Last of Us, often varied only by seasons. Instead, there are changes in both the environments you explore and in the ways you can use them to your advantage in combat – which we'll come back to.",
    "While exploring isn't mandatory in The Last of Us 2, players who choose to can expect a more fleshed-out experience. There are artifacts, often in the form of documents, which give further insights into the game's story, while those who love to collect items can pick up trading cards along the way.",
    "There's also an occasional safe – with a code likely nearby – that will grant you lots of handy resources. And you're going to want as many of those as you can grab for crafting and upgrades.",
    "Perhaps our favorite improvement over The Last of Us is to the upgrade system. Where The Last of Us saw Joel collecting supplements to improve specific abilities, The Last of Us 2 offers different skill branches, allowing you to use supplements to upgrade specific branches of abilities such as stealth, precision and explosives. You can unlock new branches by finding training manuals – but these are easy to miss, so keep your wits about you.",
    "As Naughty Dog previously warned, resources are in short supply, and so you need to be a bit more picky about what you choose to upgrade than you might be in another game.",
    "This also applies to weapon upgrades, which can be unlocked with scavenged materials. Each time you find some of these materials you only get a handful, and each weapon upgrades requires a considerable amount. In addition, workbenches are few and far between – and when you do find one, you may be frustrated to find that you don't have enough materials to upgrade anything.",
    "While it can be difficult to choose what to upgrade, these improvements do allow you to adapt Ellie more to your playstyle. In addition, there are more crafting options generally, including different arrow types, alongside health kits, mines and the ability to make melee weapons deadlier. It really depends how you want to play.",
    "Outside of crafting and upgrades, traversal has also been improved. You're frequently presented with small puzzles that you must solve in order for your character to climb over walls and access buildings out of reach. To maneuver around these new areas you've got a few more traversal options, such as rare occasions to utilize ropes, a dedicated jump button (finally) and the ability to both crouch and crawl – handy for hiding under vehicles and in long grass. They're small but welcome changes that gives traversal somewhat of a fresh coat of paint.",
    "No two ways about it: the Last of Us 2 is a violent affair. While the violence isn't gratuitous, and plays a part in the overall narrative, you're going to need to get used to the fact that Ellie pretty much slices and dices everyone she encounters.",
    "But simply going into combat full-throttle isn't always the best idea in The Last of Us 2. Instead, we found that taking a more calculated, stealthy approach seemed to result in better outcomes – and there are plenty more combat options to facilitate that.",
    "For example, in an instance where Ellie was surrounded by bow-wielding Seraphites (a hostile cult, known by the nickname 'Scars'), rather than going in ham-fisted, we took advantage of the tall grass to conceal ourselves, using a bow and arrow to pick off stragglers, and distractions such as bottles to separate individuals from their pack. Popping down a trap mine or two also helps – these essentially work as a remote bomb that blows up when enemies get to close, as they did in the first game – as does Ellie's listening ability (inherited from Joel), with enables you to detect danger even in dimly lit scenarios. The option to stealth-kill enemies is back too, naturally – providing that you can get close enough without being detected.",
    "But combat isn't always necessary, and you can use the environment to sneak past enemies, by climbing under cars or through tall grass. It's really up to you how you want to play, in most instances.",
    "If you're someone who prefers a bit more action, you can go in guns blazing, but we advise retreating when things get too hairy, as it can be a bit impractical – and potentially fatal – to have to change between ammo types or weapons, or to craft much-needed materials such as health kits, in the middle of a firefight.",
    "However, the new dodge ability means that (if timed right) you can quickly move out of the way of melee attacks before landing your own punishing blow on an enemy. While Ellie is quick and agile, and able to move around often undetected before landing a lethal blow on an unsuspecting enemy, her physicality doesn't lend to heavy-handed close-up combat.",
    "So, if an enemy gets too close, it's good to have an upgraded melee weapon on you with which to fend them off, but there are occasions when you'll need to resort to frustrating bouts of button-pushing to loosen yourself from their grasp – something that will be familiar to those who grappled with the Infected in the first game.",
    "Speaking of the Infected, while they aren't necessarily the main threat in The Last of Us 2 (that honor goes to humans), they do still pose a threat. While you'll run into your old foes such as Clickers, Bloaters and Runners, there are also a few new Infected species to deal with – including the Shambler, who has a nasty habit of releasing toxic fumes everywhere when it gets too close.",
    "While the Infected are ever present in The Last of Us 2, the main narrative is never about them, and nor do they detract from it; instead they act as a reminder of the type of world you're inhabiting – in case you forgot.",
    "The Last of Us 2 is one of the most accessible AAA games we've seen to date, boasting more than 60 accessibility features in total. These are available from the main menu, and offer players the option to adjust a variety of aspects of the game to suit their needs, whether that's implementing text-to-speech and audio cues, visual aids, anti-motion sickness measures, or improving combat accessibility.",
    "There are also advanced options that focus on fine-motor impairments and hearing, as well as others to benefit low-vision and blind players. These options are something we believe should be in every game, and to see them in one of the biggest games of 2020 is most welcome. You can learn more about the full range of accessibility options at the PlayStation Blog.",
    "It's hard to put into words why you should play The Last of Us 2 without spoiling the aspects which make it truly great.",
    "While the long-awaited sequel seemingly starts out as a run-of-the-mill revenge tale, it becomes more nuanced, and Naughty Dog's vision begins to come to light. And, while this may take a few hours to become clear, the pacing is perfect for the story that's unfolding.",
    "The Last of Us 2 can be a hard pill to swallow sometimes – it's heart-wrenching and sickening on occasion, and it'll put you through the emotional wringer.",
    "It's worth noting that this is a much longer game than the first, weighing in at roughly 30 hours, depending on how much exploring you want to partake in. If you're not invested in the story, it could seem like a slog – but for those who are it's almost like two games in one, a threequel and sequel rolled into one fully-fledged story.",
    "Every twist and turn is a surprise, and even if you've seen spoilers there are plenty of important plot-points which weren't touched upon in leaks – and what leaks there have been won't detract from your experience. We often found ourselves thinking that we knew what was around the corner, only to be greeted with something entirely different. A lot of that is down to Naughty Dog's (successful) attempts to throw us off the scent, utilizing fake voice-overs and clever edits to paint a different story in trailers and showcases to what you find in the game.",
    "The Last of Us 2 may not be for those who haven't played the original, but for those who've grown to love these characters, and this world, it's a more than worthy continuation of a beautifully told story, built upon in ways we didn't imagine, and with all the care we wanted."
  ],
  "headers": {
    "5": "A history of violence",
    "13": "Moral minefield",
    "19": "We're not in Jackson anymore...",
    "24": "Small but key improvements",
    "29": "Post-apocalyptic arsenal",
    "38": "Strides in accessibility",
    "40": "Verdict"
  },
  "links": {
    "PlayStation Blog": "https://blog.playstation.com/2020/06/09/the-last-of-us-part-ii-accessibility-features-detailed/"
  }
}