{
  "source": "https://www.techradar.com/reviews/kensington-sd4900p-hybrid-docking-station",
  "title": "Kensington SD4900P Hybrid Docking Station review",
  "category": "computing",
  "updated": "2020-01-14T09:21:53Z",
  "author": "mark-pickavance",
  "summary": "Plenty of connectivity, but practical bandwidth limits",
  "verdict": "There is a reason most docking station makers stay away from triple displays on USB-C, and the SD4900P demonstrates why. While it is possible to connect an amazing selection of devices to this box, you can’t practically run them all at full speed.",
  "pros": [
    "Many connections",
    "Triple 4K output"
  ],
  "cons": [
    "No Thunderbolt 3 connection",
    "DisplayLink",
    "Only 60W charging"
  ],
  "article": [
    "Kensington Computer Products might sound British, but this Californian technology company has been around for at last 35 years and makes a very wide range of personal computer hardware including mice, keyboards, travel adapters and security mechanisms.",
    "Today we’ll be looking at one of its docking stations, the SD4900P, or Kensington SD4900P USB-C and USB 3.0 Triple 4K Hybrid Docking Station to give its full title.",
    "A product designed to enhance productivity in the workplace by extending a laptop to create a more desktop-like experience.",
    "But does it take USB-C and USB-A connections beyond their practical limits?",
    "Kensington makes a series of docking stations using a very similar case that includes the SD4700P, SD4800P and the SD4900P that we’re reviewing here.",
    "Unlike some competitors that like aluminium enclosures, the designers of this equipment went with injection-moulded plastic in black.",
    "They also made some curious choices about the texturing of this case, where the top, bottom rear and sides have a matt appearance, but the front is high gloss.",
    "As we might have predicted before opening the box, the glossy surfaces attract dust and fingerprints compared with the textured ones, that don’t.",
    "Another slightly odd choice is that the top is slightly recessed, creating a tray of sorts for small change, or whatever.",
    "But as a docking station, the critical features are the ports, and the SD4900P has plenty of those.",
    "On the rear is a PSU power input, USB-C downlink from the computer, three each of DisplayPort 1.2 and HDMI 2.0, a Gigabit LAN port and four USB-A 3.1 Gen2 ports.",
    "The ends are relatively unused, with a Kensington Security and Nano Security slots at one end and a power switch at the other.",
    "And, on the front is a single USB-C 3.1 Gen2, another USB-A 3.1 Gen2, 3.,5mm Audio jack for headphones, and a 3-in-1 card reader that can handle SD, Micro SD and Compact Flash.",
    "It is important to clarify that while it is physically possible to connect six monitors to the dock, the DisplayPort and HDMI output are options, so you get to chose three of whatever output you prefer.",
    "Our immediate reaction to that information was to wonder why mounting six complicated cabling ports on this device was a better option than providing three DisplayPort and some inexpensive cable adapters for HDMI?",
    "We must conclude this was the cheaper option.",
    "Another external feature of note is two small threaded holes on the base designed for attaching the SD4900P to the optional Docking Station Mounting Bracket (K34050WW).",
    "The big selling point of the Kensington SD4900P is that it supports triple displays, and at 4K resolution. But this set some alarms off immediately, as this dock isn’t connected by Thunderbolt 3, and the USB 3.1 Gen 2 connection used has a quarter as much bandwidth available.",
    "In whatever ways 10Gb/s is divided, it won’t adequately supply three 4K displays, six USB ports each requiring up to 10Gb/s, a Gigabit Ethernet port and the other less bandwidth-hungry items on here.",
    "At a rough estimate, the ports on this device would require more than 76Gb/s of connection to the host computer to have all the necessary bandwidth, and it only has 10Gb/s.",
    "The obvious conclusion is that this isn’t practical, or at least some significant compromises are required in what you can realistically connect and how it might work.",
    "How these limitations are addressed by the SD4900P are twofold. And, depending on how you might want to use this device, either of them might work for you.",
    "One is that the dock supports USB-C Alt Mode, where is can pipe video data over USB-C merged in with other data. The drawback of that option is that each display you add eats into the available bandwidth, and if you use all three screens then there won’t be much left for other uses.",
    "The alternative display connecting method is DisplayLink, another technology designed to achieve multiple displays over limited bandwidth.",
    "If you don’t have USB-C and are using the provided USB-A to USB-C cable that Kensington kindly includes, then a maximum of two 4K displays is possible.",
    "DisplayLink must be installed on the host system that can compress the data of a video display for sending to the port on the dock, reducing the bandwidth requirements.",
    "Our experience of DisplayLink hasn’t been great, we’ll admit. Because it requires some significant processing on the PC, how much bandwidth it uses can vary wildly depending on the amount of change occurring, and most laptops don’t have the spare performance to drive it properly.",
    "How well this works for any specific user is entirely dependent on many factors, such as the laptop host hardware, the resolutions of the monitors and the amount of motion on the displays.",
    "Those who expect smooth 4K video on three monitors from a computer with integrated GPU and USB-A connection are likely to be disappointed. But those with less ambitious objectives, USB-C and more concurrent PC hardware might be pleasantly surprised as to what they can do.",
    "The UK cost of the SD4900P is £279.02, and it can be bought in the USA for $277.96 from online outlets.",
    "That makes it one of the more expensive options for a USB connected dock.",
    "If you are willing to accept dual display output, there are many alternatives that offer better value for money and those with Thunderbolt 3 are less bandwidth compromised.",
    "We’d strongly recommend the Caldigit USB-C Pro Dock that we recently reviewed. As it is cheaper, sports a metal exterior and is both USB-C and Thunderbolt 3 connectable.",
    "Kensington’s own SD5000T Thunderbolt 3 Docking Station costs a little more but does offer 85 watts of power to the connected laptop.",
    "A much cheaper choice is the Dell D3100 Docking Station, it supports triple displays (only one at 4K) on USB 3.0, but you can buy three of these for the price of one SD4900P.",
    "On paper, this hardware looks wonderful, but the lack of Thunderbolt 3 and the 60 watts limit on passthrough charging power make the reality less desirable.",
    "Being able to cable three monitors is also an attractive option, but you need a powerful laptop to drive that configuration smoothly and triple display functions better on docks that use a Thunderbolt 3 and not DisplayLink software.",
    "If you want each port on the dock to run like it would if it was on the laptop then you need to invest in a Thunderbolt 3 dock that can give you the bandwidth to run screens and have high-speed peripherals at the same time.",
    "And the other caveat to this hardware is the charging. The 60 watts provided isn’t enough power for charging the more powerful Ultrabook’s, like the 15-inch Apple MacBook Pro.",
    "Therefore, you need to check the charging demands of any laptop this dock is likely to be used. Or, if the laptop doesn’t have USB-C, then assume that charging isn’t something that the dock will provide.",
    "Overall, the compromises made to achieve triple displays are too great, and most users would be better with a dual-screen option and plugging the third display directly into the laptop to reduce the bandwidth overhead.",
    "For many users, this dock would work well, but we think that other designs offer better value for money and fewer caveats."
  ],
  "headers": {
    "4": "Design",
    "17": "In use",
    "29": "Competitors",
    "35": "Final verdict"
  },
  "links": {
    "Caldigit USB-C Pro Dock": "https://www.techradar.com/reviews/caldigit-usb-c-pro-dock"
  }
}