{
  "source": "https://www.techradar.com/reviews/nba-2k21",
  "title": "NBA 2K21 review",
  "category": "gaming",
  "updated": "2020-09-07T13:05:01Z",
  "author": "stacey-henley",
  "summary": "NBA 2K21 takes it to the rim (but can’t get it in the bucket)",
  "verdict": "NBA 2K21 is the best NBA game, perhaps the best sports sim ever, for raw on-the-court play. But off the court, NBA 2K21's emphasis on microtransactions makes it difficult to love.",
  "pros": [
    "Fast and fluid play",
    "New shooting adds depth",
    "MyCareer is a great story"
  ],
  "cons": [
    "Massive over reliance on VC",
    "Too many MyCareer restrictions",
    "MyTeam lootboxes still unfair"
  ],
  "article": [
    "In Game 5 of the 1997 NBA Finals, Michael Jordan scored a match leading 38 points while sweating profusely and occasionally leaving the court due to illness, only to return moments later and resume his domination of the game. Though Jordan was actually suffering from food poisoning, the game became known in the annals of basketball history as ‘The Flu Game’. NBA 2K21 feels very much like The Flu Game. It’s mostly brilliant, but wherever it isn’t, it’s an absolute mess. It’s not flu or food poisoning that’s making NBA 2K21 sick though; it’s VC.",
    "The actual basketball in NBA 2K21 is sublime, with the series continuing to make little tweaks and improvements with each installment. This year, some of the irritating out-of-bounds scenarios have been tightened up, but the biggest change is the shooting. While button shooting still exists, stick shooting strives to give closer control, and after initially having a punishing difficulty curve, a quickly implemented hotfix makes it run much smoother. On the court, you couldn’t ask for more.",
    "Off the court, it’s a different story. VC (or Virtual Currency) flows through everything, blocking off some difficulties in the otherwise top class MyCareer mode, and forcing you to choose between either upgrading your MyCareer pro, or improving your MyTeam roster. Of course, the game really wants you to do both, but in order to do that, you have to spend more actual money in-game. It’s not just that microtransactions are present, it’s that the game pushes them so hard that it damages your enjoyment of MyCareer, puts barriers ahead of your access to The Neighborhood, and sees most offline modes losing out.",
    "First, let’s lace up our Nikes and head to the court. The NBA 2K series has always been a half step ahead of FIFA (and a couple ahead of Madden) in terms of raw sports simulation. After tightening up defence last year, taking home the crown as the best sports sim on the market should have been an easy alley-oop for NBA 2K21. It feels like they’ve missed the dunk but put in the rebound.",
    "The passing, running, and defensive work is as clean and asquick as it was last year, but this addition has brought in stick shooting alongside the usual button play, as well as changing how the shooting meter both looks and works.",
    "With this change comes a new dribbling system, which definitely offers greater control and feels more fluid. However, if you’ve tried shooting either in the demo or on launch day of NBA 2K21, you’ll know they’ve massively overcooked the difficulty. Dame Lillard was missing open jump shots when the aim was yellow; in 2K’s aiming system, yellow means ‘very close but not perfect’. It has been patched since then, and shooting is much more natural. The stick still takes getting used to, but the punishment for getting yellows isn’t too severe unless you’re boxed out, not in a hot zone, or using a player with poor shooting stats.",
    "The matches themselves, filled with sponsorships from Gatorade, Mobil, and many more, can sometimes lean too much towards a presentation of a live game on TV than actual play, but once you’ve got the rock in your hands, that fades away. Minute to minute, play to play, shot to shot, NBA 2K21 is seamless. It’s as close to perfect as you can realistically imagine a sports sim can be. It’s the Michael Jordan of sports sims, but only if you mean Jordan in The Flu Game.",
    "VC - the virtual currency at the heart of NBA 2K21 - is largely to blame for this. Not entirely, and we’ll get to other weaknesses in time, but the beginning and end of a large proportion of NBA 2K21’s issues stem from the microtransactions the game is built around.",
    "One of the game modes is MyTeam, a card-based team-building game where you must buy players, contracts, jerseys, and anything else you can think of, either in blind packs or in individual auctions. The game constantly pulls you towards this; we had taken the Trail Blazers to the Finals in MyLeague, our player in MyCareer had just reached the NBA, and we’d done little more than try out the features of MyTeam, and still every time we turned the game on, the menu pulled us towards MyTeam with a ‘Continue Now’ button.",
    "In our pre-order bonus packs, we got a strong team - Kobe, Shaq, Lillard, Williamson, and Ingram - but once we started buying real packs, the quality of players on offer sunk rapidly. You can have a decent time playing some offline 3v3, earning minimal coins, working on your skills, but to really get the most out of MyTeam, you need to play online. That means you need to constantly buy - often with real money, though grinding is possible - new players and packs. You can’t accuse 2K of neglecting on the court play, but all roads seem to lead back to MyTeam, and the possibility of players spending more real money. VC can be earned for free, but it takes a long time to earn even a single pack which, in this lootbox system, could end up being VC down the drain.",
    "Even MyCareer, the game’s story mode, is infected with VC. Everything your player does earns you some VC, and you can either spend this on upgrading your player or save it for packs. It’s poor design - and it feels deliberate - that you can use MyCareer to make your MyTeam better, but to do that long term, you need to try and compete in the NBA with a low-level pro whose potential skill points are being spent on virtual contracts to make sure you can keep playing online with Kevin Durant. You can’t switch the difficulty down past Pro either, lest you earn too many VC coins and game this system. That, especially, feels like a spiteful move.",
    "Narratively, MyCareer remains the best sports narrative experience out there, and is packed with big name stars like Michael K. Williams, Djimon Hounsou, and Jesse Williams. The latter is far too intense at times, but it feels like a real production, tells a compelling story without overdoing the melodrama, and offers some satisfying story beats. It’s a bit too scripted in places, but that’s a minor criticism in a sports drama.",
    "Despite how good it is though, the lack of a full range of difficulty needlessly gatekeeps newcomers out of what should be a welcoming mode, and it can’t shake the feeling of being an elaborate maze designed to lead you back to MyTeam, with that Playoffs winning 3-pointer worth nothing more than a few coins towards the next pack.",
    "MyCareer is also home to The Neighborhood, a returning online game mode built around street ball and creativity. Offline, you can recapture some of this feeling in The Park, but it isn’t quite the same. The Neighborhood is decent game mode itself, but it has too many drawbacks to really warrant praise. For one, you can only access through MyCareer with your pro, which again brings in the issue of where to spend VC. It also can’t be accessed until you reach the NBA, which means either skipping over by far the most interesting and personal part of the narrative mode’s story, or playing through more slowly and not getting to access arguably the most fun online mode until you’re several hours into a story which barely connects to the The Neighborhood in the first place.",
    "The Neighborhood is representative of NBA 2K21 as a whole, in that the basketball is great, but every decision made around it lets the side down.",
    "NBA 2K21 is not a three and a half star game. It’s a five star game and a two star game crammed together. The basketball is near perfect, especially with the shooting difficulty now smoothed out, and remains top of the sports sim tree. But every other design choice is either there to get you to spend more money on MyTeam or just a straight up bad design.",
    "There is a great basketball game here, with near flawless gameplay and a compelling narrative. But it’s bogged down by its obsession with VC, strange implementation of its most creative modes, and - once you discount things you have to pay extra for to truly enjoy - lacking in some key features. Even with the shooting difficulty smoothed out, while this is a fantastic accumulation of the NBA 2K series for long time fans, newcomers are blocked out of too many game modes, making the game too unwelcoming to be great."
  ],
  "headers": {
    "3": "Total court domination",
    "7": "Show me the money",
    "11": "Got game",
    "15": "Verdict"
  },
  "links": {}
}