{
  "source": "https://www.techradar.com/reviews/acer-chromebook-714",
  "title": "Acer Chromebook 714 review",
  "category": "computing",
  "updated": "2021-04-13T00:35:30Z",
  "author": "jeremy-laird",
  "summary": "The Acer Chromebook 714 is seriously solid, but not especially stylish",
  "verdict": "Acer’s premium business-orientated 14-inch Chromebook is all metal and seriously solid, not especially stylish for the money",
  "pros": [
    "Seriously solid metal chassis",
    "Decent quad-core performance",
    "Strong battery life"
  ],
  "cons": [
    "Slightly dated styling",
    "Keyboard a little mushy",
    "Storage performance is weak"
  ],
  "article": [
    "Hard to believe Google’s Chromebook Pixel launched way back in 2013. We’ve certainly all had plenty of time to get used to the idea of a premium Chromebook since then.",
    "In fact, you can now choose from a full spectrum of budget-to-premium models. Enter, therefore, the new Acer Chromebook 714, a 14-inch model and something of a ‘tweener when it comes to pricing.",
    "At around $500 (£500) to $800 (£800) depending on specification, it’s not a true premium device. But it’s also expensive enough to bring certain expectations. Spec for spec, it’s a little cheaper, for instance, than the Google PixelBook Go. But also a lot pricier than an Intel Celeron-based model like the HP Chromebook 14.",
    "Out of the box, the Acer Chromebook 714 makes a solid impression - literally. With an all-aluminium chassis it’s both pleasingly rigid and reasonably slim. Slight demerits when it comes to build involve a little bounce to the keyboard bed and some rattle from the generously proportioned trackpad.",
    "Design wise, the fat bezels top and bottom date the Acer Chromebook 714 a little, but do allow for a webcam mounted up top for optimal ergonomics. Overall, the build and design isn’t up there with the best all-metal laptops, including the inevitable Apple reference point. But then you wouldn’t expect that at this price.",
    "What you would expect and do indeed get is a proper CPU with high performance cores, in this case an Intel Core i5-8250U. That’s a quad-core, eight-thread chip that boosts up to 3.4GHz and provides plenty of performance for daily tasks and entry-level grunt for serious work loads like image editing or video encoding. It’s a proper processor, albeit only just.",
    "The same goes for the 14-inch IPS display. Our review unit lacks the optional touch facility, so it’s a conventional 1080p item without any snazzy features like HDR or high refresh. For colour accuracy and viewing angles, it’s a reasonable effort. For contrast, brightness and all-round punch, it’s a little lacking.",
    "Ports-wise, we’re talking USB-C on each side of the chassis, both of which support charging and video out, a USB-A socket, headphone jack and a microSD card reader. There’s also a fingerprint scanner for heightened security and speedier OS access and a dual microphone setup with Google assistant support. Speaking of audio, there are stereo speakers, but they deliver atrocious sound quality.",
    "The final, and for some most critical, piece of the puzzle is battery life. This is an unambiguous win for the Acer Chromebook 714, with over 13 hours of video playback available. You’ll probably get a little less from web browsing, but this is still a laptop that delivers all-day battery life.",
    "At an estimated $700 (£620) as tested the Acer Chromebook 714 lines up close to the entry-level Google Pixelbook Go, but gives you a quad-core Intel Core i5 processor to the Go’s dual-core chip. A quad-core Pixelbook is available, but pricing starts with an ‘8’ on either side of the Atlantic (it currently isn’t available in Australia).",
    "The Go is arguably a more premium feeling device, but there’s no denying the advantage in performance from an extra pair of CPU cores. Of course, at this price point, some pretty decent Windows laptops can be had. You’re just about into entry-level Ultrabook territory.",
    "As an all-round workhorse, that would make more sense. In that context, the Acer Chromebook 714’s most obvious weakness is its 128GB eMMC as opposed to M.2 storage. But if you don’t need to run Windows apps and you’re fully signed up to the Google ecosystem, those are ultimately moot points.",
    "The Acer Chromebook 714’s strongest design feature is just that; strength. This thing feels positively bombproof. The all-metal chassis is very rigid, the only exception being a slight bit of bounce to the keyboard. The keyboard itself also suffers from a raster mushy keystroke. It’s not a bad keyboard, but it’s neither as crisp in action nor as rock solid underneath as we would prefer.",
    "One other niggling flaw involves the trackpad. It’s generously proportioned and finished in Corning Gorilla Glass for a slick feel. But it suffers from a little rattle and movement separate from the clicking action, which gives it a slightly cheap vibe.",
    "Anyway, the upside of what for the most part is a tough, all-metal laptop should be good long term durability. The downside is weight. It’s a fairly slim device at 1.8cm. But that tough build means it weighs in at 1.6kg. It’s still very portable, with a compact 45 watt charger, but this is not a featherweight laptop. It feels significantly larger and bulkier than a typical 13-inch Ultrabook or the likes of the MacBook Air.",
    "Speaking of which, the overall aesthetic inevitably owes a little to ye olde Apple MacBook, what with the grey anodised chassis finish and black backlit keyboard. Beyond that, it’s a fairly generic looking portable, albeit with slim display side bezels which help to keep the overall footprint in check.",
    "However, the upper and lower bezels are pretty beefy. With the current vogue for vanishingly small bezels in everything from laptops to smartphones and TVs, that prevents the Acer Chromebook 714 from looking terribly contemporary.",
    "That said, the large upper bezel does at least provide plenty of space for proper webcam location, an obvious boon in this age of video conferencing.",
    "Ports-wise, a USB-C slot on both sides of the chassis means you can choose which side to plug in for charging or connecting an external display. There’s also a conventional USB-A socket and a microSD reader. It’s not exactly a plethora of ports, but there is more than enough high bandwidth connectivity for most needs.",
    "As a model aimed as much at business users as home office, the Chromebook 714 also has a fingerprint reader, though this can only be used to login to the laptop rather than verify online services.",
    "Another slightly marginal aspect is the 14-inch 1080p screen. It’s IPS, so color accuracy and viewing angles are decent. But it’s a little short on punch, brightness and vibrancy. It’s not a terrible panel. But neither is it good enough to be a highlight or a feature you can enjoy in its own right.",
    "Thanks to the quad-core Intel Core i5-8250U CPU, this is a Chromebook with genuine performance chops. It’s capable of much more than just web browsing and media consumption. It’s powerful enough for light content creation on the move.",
    "If there is a weakness, it’s the 128GB eMMC SSD. That’s not a performance orientated configuration. Granted, Chromebooks are very much based on the idea of cloud rather than local storage. And the USB-C ports allow for pretty rapid access to external devices. But it’s a limitation all the same.",
    "Battery life is unquestionably one of the Acer Chromebook 714’s strengths. It kept on trucking for over 13 hours in our 720p video playback test. OK, all-day working or web browsing will drain the battery more quickly. But this laptop is good for a genuine 10-plus hours in the context and that means it’s a genuine all-day device."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Price and availability",
    "12": "Design",
    "20": "Performance",
    "23": "Battery life",
    "24": "Don't buy it if..."
  },
  "links": {
    "Chromebook Pixel": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/chromebook-pixel-2015-1289817/review",
    "Google PixelBook Go": "https://www.techradar.com/reviews/google-pixelbook-go-review",
    "HP Chromebook 14": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/hp-chromebook-14-1317787/review"
  }
}