{
  "source": "https://www.techradar.com/reviews/razer-cynosa-lite",
  "title": "Razer Cynosa Lite review",
  "category": "computing",
  "updated": "2020-05-24T10:00:28Z",
  "author": "mike-jennings",
  "summary": "Is the Razer Cynosa Lite worth it?",
  "verdict": "The Razer Cynosa Lite has good typing action, and it’s soft, fast and quiet. It’s cheaper than its rivals, too. However, mechanical units still offer more snap, and this cheap keyboard also falls behind thanks to poor RGB lighting and a lack of features. It’s a reasonable budget option, though.",
  "pros": [
    "Fast, comfortable typing action",
    "Very affordable",
    "Decent build quality"
  ],
  "cons": [
    "Few extra features",
    "Disappointing RGB lighting",
    "Mediocre rollover rating"
  ],
  "article": [
    "The Razer Cynosa Lite is one of the most affordable gaming keyboards that Razer has ever produced – it’s a big departure from a company that’s usually associated with high-octane, high-end hardware.",
    "The Cynosa’s lower price means that this unit uses membrane keys rather than mechanical technology, and it also means that there are fewer RGB lights and other features than on pricier peripherals.",
    "The Cynosa only costs $45 (£45, around AU$80), which means it undercuts its rivals by quite a bit. The Logitech G213 Prodigy is around five dollars or pounds more expensive, and the SteelSeries Apex 3 is around ten dollars or pounds more.",
    "The affordable Cynosa Lite is made entirely from plastic, just like its rivals – there’s no room in the budget for a metal baseplate. That impacts build quality: the Razer is reasonably sturdy and is more robust than the SteelSeries and Logitech units, but it’s still easy to bend the plastic back and forth. Be careful with it, though, and it’ll easily last trips to LAN parties.",
    "The budget price also means limited decoration. The Razer has an RGB logo on its front edge, but there are no extra areas of bold angles and bright lights – the kind of additions we expect from Razer.",
    "The Cynosa Lite does have RGB LEDs in its keys, but they’re underwhelming: the lighting is not bright or consistent, and the sole lighting zone means you don’t get many customisation options.",
    "This is one area where the Lite’s rivals are both better. The G213 is a bit brighter, and the SteelSeries Apex 3 has stronger lighting on each key and extra lighting beneath its buttons – which means it features a bold, ethereal RGB glow beneath the keys. Both competitors also have more lighting zones.",
    "Elsewhere, the Razer has a slim feature set. This keyboard can record macros on-the-fly, and it is spill-resistant. However, it has no macro or media buttons and no extra wrist-rest. Its ten-key rollover is fine for most situations, but it’s not particularly high and won’t sate frantic games. The cable isn’t braided, which means it’s more prone to knotting.",
    "The SteelSeries is spill-resistant, includes a wrist-rest, and it has 24-key rollover. It also has a volume roller and a media button, and underneath it’s got cable-routing channels. The G213 has a wrist-rest, loads of media keys, a braided cable and a spill-resistant design.",
    "The Cynosa Lite has membrane keys that are sunken into the device, which makes them look more compact that the SteelSeries and Logitech units – those keys stand proud of the keyboard.",
    "The buttons are good: light and soft, with ample speed for most gaming situations. The typing action is quiet and comfortable, and the typing action is linear – which means the buttons hammer straight down, without the noticeable ‘bump’ of mechanical units.",
    "The soft, light buttons are easily good enough for gaming, but they still can’t compare with mechanical hardware: those pricier devices offer more weight and speed, with a crisper action.",
    "They differ from the SteelSeries buttons – that unit was also made from membrane technology, but its buttons had a mechanical-style bump and a bouncier typing action. The G213 also used membrane hardware, and it offer heavy, satisfying typing that’s not far removed from mechanical devices.",
    "When picking one of these membrane devices, it’ll come down to personal preference: some people will prefer the soft, linear Razer while others will want the taller, heavier buttons of the Logitech and SteelSeries units."
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Don't buy it if..."
  },
  "links": {
    "SteelSeries Apex 3": "https://www.techradar.com/reviews/steelseries-apex-3"
  }
}