{
  "source": "https://www.techradar.com/reviews/google-home-mini",
  "title": "Google Home Mini review",
  "category": "audio-visual",
  "updated": "2021-02-01T15:22:52.091Z",
  "author": "cameron-faulkner",
  "summary": "The Google Home Mini's small on sound, big on value",
  "verdict": "The Home Mini is the cheapest way of buying into the Assistant yet for those looking to buy into Google’s smart home ecosystem. While it's a good value for the price, its poor sound performance makes it a better desk buddy than a standalone speaker.",
  "pros": [
    "Integrates with Google Cast",
    "Offers Bluetooth support",
    "IoT-friendly",
    "Incredible value"
  ],
  "cons": [
    "Sound performance is weak"
  ],
  "article": [
    "The Google Home Mini may have been usurped by the Nest Mini last year, but we don't think you should write it off just yet – not least because you can find some fantastic Google Home Mini deals as a result.",
    "It's cute, it's compact, and it was only $49 / £49 / AU$79 at launch (although you can generally find it for less than half the price these days). The affordable Google Home Mini does something that most of the best Bluetooth speakers can’t: it comes equipped with Google Assistant, which is always at the ready to help you find answers, turn on the tunes, dim the lights, start a TV show and more by using nothing but your voice.",
    "That means that the Home Mini is exactly like the larger, more expensive Google Home and even the much more powerful Google Home Max in that it can control your smart home devices. But that’s where the comparisons stop. While the others make for very solid standalone speakers from a performance standpoint, the Home Mini can’t hold its own as the sole sound-maker in your house.",
    "Of course, if you're after a compact Alexa speaker, you'll want to check out our new Amazon Echo Dot review instead. Otherwise, read on for the rest of our Google Home Mini review.",
    "There’s certainly an aspect of subjectivity in judging sound quality, but most would agree that what the Home Mini is capable of isn’t a whole lot. The soundstage – despite being pitched as 360-degrees – falls a little flat. While skilled in pulling up the most obscure music you can think up from a fairly wide variety of streaming services, the Mini has a difficult time doing them justice because of this speaker’s diminutive profile.",
    "However, if you already own a Google Home or have a speaker set up with a Chromecast Audio, the Home Mini will make your audio arrangement even sweeter with its expertise leaning on the highs in the sound profile. Vocals and the like chime through clearly, but come in at the expense of, well, everything else. This isn’t a problem if you have other speakers picking up the slack, but by itself, the Home Mini just isn’t mighty enough.",
    "In spite of that fact however, it’s impossible not to recommend this little device. Its Assistant smarts, large list of features and low price make it easy to take the plunge on the Home Mini.",
    "The Google Home Mini looks as if Google turned the Home upside down, then smushed it down to size. As such, you’ll find the fabric texture on the top of this device with the matte plastic on the bottom half. Also, if you like to compare tech to food, this device looks like a macaron.",
    "The palm-sized Home Mini gives off a look that its fabric mesh is just for looks, but it’s actually conductive to your touch in a few areas. For example, tapping the top pauses and resumes play. Google had plans to allow for the Assistant to be summoned by tapping and holding on the middle, but has since permanently (via: 9to5Google) disabled the feature due to privacy concerns.",
    "Placing a finger on the left and right sides of the speaker lowers and raises the volumes, as you might expect. And lastly, whenever you navigate with your voice or touch, the Home Mini will illuminate four LEDs on its top to show that your action has been registered.",
    "Moving down to the lower half, the Home Mini features a micro USB port on its rear to provide power (this device is battery-free, like the Amazon Echo Dot) and a microphone switch that enables you to turn off active listening, making this a speaker that you’ll have to tap to interact with.",
    "Exposing its bottom, you can see a circular rubber mat to keep still on whichever surface that you place it on. Google provided TechRadar with a coral (peach-colored) model, but the Home Mini is also available in chalk (grey) or charcoal (black).",
    "The Google Home Mini is the most affordable Google Assistant-enabled speaker available and thankfully, its voice recognition doesn’t suffer from the reduction in size and price. Whether shouting from across the room or speaking gently 10 feet away, the Home Mini yielded similarly great results.",
    "In terms of what the Home Mini can take control of, the list goes on. You can place a call for free in the US, a feature that's also recently launched in the UK, as well as stream music through an assortment of music apps like Pandora, Spotify, YouTube Music, iHeartRadio and more. It can send a request to pull up a YouTube video over to your Chromecast to effortlessly begin viewing. The Home Mini is also a smart home hub in that it can also integrate with Internet of Things (IoT) devices from the likes of TP-Link, Philips Hue, Wemo and more.",
    "But putting aside its smart capabilities for a moment, the Home Mini boasts an impressive set of features that are available right out of the box for those who can’t be bothered to talk to their speaker or connect it with extraneous services.",
    "Connecting is a breeze through the Google Home app and is quick to teach you a thing or two about the Home Mini, like how it works and resources that provide instant access to a wide variety of free audio content. If you want to solely use the Home Mini as a set of Bluetooth speakers, the Google Home app offers up pairing settings, though they are rather buried within the app.",
    "Once your smartphone is set up with the Home Mini, it’s simple to begin listening. Either give the speaker a shout for some tunes, being as specific or vague as you’d like, or just hit the Cast button near the top to give your phone free reign to push its audio straight to the Home Mini.",
    "Speaking of Cast, Google’s latest speaker works best within a crowd of other Cast-enabled devices. In my studio apartment, I grouped together a Google Home, a Chromecast Audio-connected soundbar and the Google Home Mini to build a surround-sound setup. When in this grouping, the Home Mini stood out as the star of the highs, pushing the vocals through extra hard when the larger Home was more focused on the mids.",
    "But, on its own, the Google Home Mini shouldn’t be used as much more than a desk buddy. It’s more than enough if you’re simply using it to get a glimpse at your calendar, hear the latest news or phone a friend with its free voice calling (available now in US, coming later in the UK). But if you’re looking for something that will faithfully reproduce your favorite music, this isn’t the best solution out there. This mini speaker can get fairly loud, but there’s no bass in the delivery.",
    "Similar to the Amazon Echo Dot, it's clear that the Home Mini is Google’s attempt at getting the Assistant into as many homes as possible. At that, the sheer amount of capabilities that the Google Home brings in addition to its chic, premium build and the low price make it an instant star.",
    "If you’re in the market for a cheap speaker, the Google Home Mini will do the trick for many. But, keep in mind that it’s best viewed as a supplement to the Home family, not the foundation. This device’s specialty, aside from being oh-so smart, is mainly to reward those who are already within Google’s Cast-enabled walled garden with a cheap, new device.",
    "Yes, the Google Home Mini is less than half the price of the larger Google Home, and half its size, too; however, it just doesn’t sound like we’re getting half its performance – we’re getting something a bit less."
  ],
  "headers": {
    "7": "Design",
    "12": "Performance",
    "19": "Verdict"
  },
  "links": {
    "Nest Mini": "https://www.techradar.com/news/google-nest-mini-release-date-price-and-features",
    "Google Home Mini deals": "https://www.techradar.com/news/google-home-prices-deals",
    "best Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Google Home": "https://www.techradar.com/reviews/google-home",
    "Google Home Max": "https://www.techradar.com/reviews/google-home-max",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "Alexa speaker": "https://www.techradar.com/news/the-best-alexa-speakers",
    "new Amazon Echo Dot review": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "9to5Google": "https://9to5google.com/2017/10/11/psa-google-home-mini-touch-removed/",
    "Chromecast Audio": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-audio-1305396/review",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/amazon-echo-dot-2020"
  }
}