{
  "source": "https://www.techradar.com/reviews/cowboy-3",
  "title": "Cowboy 3 review",
  "category": "fitness",
  "updated": "2020-10-02T15:33:03Z",
  "author": "cat-ellis",
  "summary": "The smoothest, quietest e-bike we've tested to date, if you're tall enough to ride",
  "verdict": "Cowboy has aimed to anticipate everything a city commuter needs, and has built an electric bike that makes cycling as effortless as possible. The ride is astonishingly smooth thanks to the carbon track in place of a chain and lack of gears, and both the bike and its companion app are packed with thoughtful touches to make your journeys easier and safer. It's just a shame there's only one frame size.",
  "pros": [
    "Extremely smooth ride",
    "Almost silent",
    "Fuss-free setup and maintenance"
  ],
  "cons": [
    "Only one frame size"
  ],
  "article": [
    "The Cowboy 3 is a very impressive hybrid-style e-bike for fuss-free urban riding. It offers an incredibly smooth ride thanks to its powerful motor, use of a carbon belt in place of a chain, and absence of gears.",
    "The Cowboy 3 is extremely easy to set up and ride. The quick-start guide walks you through the process, and even includes the Allen keys necessary to adjust the seat height and straighten the handlebars. Cowboy offers its own repair and maintenance service so there’s no need to book an appointment at a bike shop (whose staff would almost certainly be unfamiliar with the Cowboy’s unusual design).",
    "Cowboy says that aim was to predict what users will need, and we believe it’s done so with aplomb, factoring in the need for quick starts at traffic lights, speedy recovery after low-speed accidents, and visibility in poor conditions. Even the mudguards have been redesigned to better accommodate the bumps of cobbled or patched streets.",
    "The chief downside is that the Cowboy 3 only comes in one frame size, which is designed with the height of the typical man in mind. It suits a wide range of heights, but will be too large for the average woman. Hopefully the Cowboy 4 will make the super smooth ride available to more people.",
    "Some e-bikes, like the Ribble Hybrid AL e, could be easily mistaken for conventional bicycles, but the Cowboy 3 wears its electric heart on its sleeve. The rear hub motor is small and unobtrusive, but the large power pack on the seat tube and integrated lights mean there are no questions about its nature.",
    "It’s sleek and modern, with no flashy graphics, but it definitely does attract attention. Taking it on the train, we overheard several fellow passengers commenting on it – particularly the carbon belt, which replaces the usual oily chain to minimize maintenance and keep your clothes clean and minimize maintenance. If there’s no chain and gear rings, there’s nothing to slip.",
    "At 16.9kg (2.4kg of which is the battery), the standard spec Cowboy 3 is definitely one of the lighter e-bikes around. The optional mudguards only add an extra 1kg, and are a very wise addition if you’ll be using it for commuting. However, if you’re planning to shoulder it, be aware that the location of the battery pack and motor mean it’s significantly more heavy at the back. Balance it accordingly, and take care on stairs.",
    "The riding position is fairly upright, giving you a good view of the road ahead. It's just a shame that there's only one frame size. Cowboy says this is optimized for riders between 5' 5\" and 6' 4\" tall, which will suit the typical man, but leaves out most women, whose average height is 5’3” in the UK and Australia, and 5’4” in the US.",
    "The tires have been revisited since the Cowboy 2, and are now puncture-resistant, and hydraulic disc brakes for plenty of stopping power (essential when a bike accelerates as swiftly as this).",
    "While there’s no substitute for a solid Sold Secure lock, the Cowboy 3 also has an anti-theft system, which warns you if the bike is being moved when you’re not within Bluetooth range). It will also tell you the bike’s location, which is extremely useful if you need to get the police involved.",
    "We also like the fact that the battery can only be removed with a physical key. It pops off easily when unlocked, but is otherwise secured firmly in place. Thieves often target e-bike batteries and sell them for scrap (it’s much easier than stealing an entire bike), so either taking the battery away with you or locking it in place will make their lives much harder.",
    "The ability to easily remove the battery also makes for easier charging – you can simply plug it in under your desk to charge rather than having to move the entire bike close to an outlet.",
    "The Cowboy is equipped with integrated front and rear lights, which illuminate automatically when you unlock the bike, and can be turned off and on with a quick tap of a button in the app. We’d strongly recommend keeping them switched on at all times for extra visibility – partly because of the bike’s matte black frame, and partly because it’s so extremely quiet. More on that in a moment.",
    "The Cowboy 3’s motor kicks in the moment you push off, giving you a much faster and easier start than a conventional bike. It’s noticeably faster to engage than other e-bikes we’ve tested recently, and makes the bike excellent for stop-start city traffic, allowing you to move off quickly at lights and making hill starts a breeze.",
    "We had the opportunity to test the Cowboy 2 in London last year, and there have been several subtle but noticeable upgrades to the bike’s third iteration. These include a new transmission system, which is now designed for a top speed of 27-28km per hour, is cleaner, requires less maintenance, is concealed better, and is less noisy.",
    "In fact, the Cowboy 3 is the quietest electric bike we’ve ridden to date. The motor is pretty much inaudible, even when working flat-out, there’s no chain noise, and no sound of changing gears. On a smooth stretch of tarmac, the only noise is the puncture-protected tires on the road.",
    "Cowboy estimates a typical range of 43.5 miles, which is impressive, but because there are no power levels to choose from, you’ll need to ‘lock’ the motor and ride unassisted on the flats if you need to eke out some extra distance.",
    "Before using the Cowboy 3, we strongly recommend investing in a handlebar mount for your phone, which will become a handy bike computer with assistance from the Cowboy app.",
    "It’s straightforward to use (much more so than Mahle’s somewhat patchy Ebikemotion app), offering a handful of simple controls and turn-by-turn voice navigation. Just zoom out of the map, tap where you want to go, and the app will calculate the optimum route. It’s a shame there’s no way to enter a destination using a postcode, but that’s a minor complaint – particularly considering maps are completely free (unlike those in Ebikemotion).",
    "Once you’ve installed the Cowboy app (available for both Android and iOS), created an account and paired your bike using the supplied QR code, you can unlock the bike whenever you’re nearby by simply holding a button on-screen for a few seconds. You can also opt to have the bike unlock itself automatically when you're within Bluetooth range.",
    "The bike isn’t immobilized when ‘locked’ – it simply means that the motor won’t kick in when someone begins riding. You’ll still need to invest in a good quality bike lock, and be careful where you leave it. The Cowboy 3 is a looker, and definitely attracts attention.",
    "The bike can also detect if you’re in a crash, using in-built sensors to detect if it’s suddenly stopped and gone over while pressure was being applied to the pedals. If this happens, the bike’s lights will begin to pulse, and the appl prompt you to respond to confirm that you’re all right. If you don’t do so quickly, the bike will send a message to an emergency contact, including your location (determined using GPS).",
    "Rather embarrassingly, we did manage to slip at one point and take a fall during testing, but hadn’t set up the emergency contact at the time. We can, however, confirm that the bike still worked perfectly after a sideways knock that would probably have dislodged the chain on a different bike.",
    "First reviewed October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Design",
    "13": "Performance",
    "17": "Companion app",
    "24": "Don't buy it if"
  },
  "links": {
    "Cowboy 3": "https://cowboy.com/",
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "Cowboy 2": "https://www.techradar.com/news/cowboys-latest-electric-bike-helps-you-choose-the-cleanest-route-to-work/news/with-hipster-stylings-and-a-built-in-phone-has-belgian-firm-cowboy-made-e-bikes-cool"
  }
}