{
  "source": "https://www.techradar.com/reviews/huawei-matebook-x-2020",
  "title": "Huawei MateBook X (2020) review",
  "category": "computing",
  "updated": "2020-11-13T20:25:41Z",
  "author": "matt-hanson",
  "summary": "Slim, light and affordable",
  "verdict": "The Huawei MateBook X (2020) is a stylish, thin and light premium laptop that punches well above its weight. It's pricey, but still offers excellent value for money, with superb performance and battery life. Shame about the webcam placement, however.",
  "pros": [
    "Stylish design",
    "Fair price",
    "Good performance",
    "Excellent battery life"
  ],
  "cons": [
    "Webcam shoots up your nose",
    "Lack of ports",
    "Difficult to buy in the US"
  ],
  "article": [
    "The Huawei MateBook X (2020) is a brilliant thin and light laptop from a company that’s likely best known for making smartphones, and falling out with the US government.",
    "However, it's also been slowly and steadily building up its reputation in the laptop market, with its MateBook lineup of laptops proving to be decent Apple alternatives, minus the high price tag. With the excellent Huawei MateBook X (2020), the company has once again shown that it should be a brand to be reckoned in this market.",
    "Why? First of all, the MateBook X (2020) is a stylish laptop that’s thin, light – weighing just 1kg – and easy to carry around. While there is certainly a nod to Apple in terms of its design, Huawei is forging its own identity, so the MateBook X (2020) doesn’t feel quite so much of a MacBook knockoff as its predecessors.",
    "If there's one design feature we’re still not too keen on, it's the placement of the webcam. It sits in the keyboard, popping up with a quick tap of a button. However, its low position means the person at the other end will see you from a pretty unflattering angle – although, it has at least enabled Huawei to keep the bezels that surround the MateBook X (2020)’s screen impressively thin.",
    "This style doesn't come cheap, though, with prices for the MateBook X (2020) starting at £1,099 / €1,599 (around $1,900/AU$2,600) for a model with a 10th-generation Intel Core i5 processor and 16GB of RAM. That’s a high asking price, one that will put off many people. However, considering the build quality and performance on offer here, we think it’s pretty fair.",
    "Speaking of performance, the Huawei MateBook X (2020) does an excellent job at keeping up with pretty much any task you throw its way. Windows 10 feels fast and responsive, and for day-to-day usage, this machine is quick and capable.",
    "Battery life is another highlight; it lasted 9 hours and 30 minutes in our tests. It will easily last a full work or school day. With its fast charger, even if you do need to top up the battery, you won’t need to plug in the MateBook X (2020) for long – around 30 minutes will have the battery life back to 50%.",
    "Overall, then, the Huawei MateBook X (2020) is a fantastic thin and light laptop at a super-competitive price – a laptop that will further cement Huawei’s reputation as a laptop-maker to keep an eye on. It’s just a shame about the webcam placement.",
    "Huawei is known for producing rather slick devices that come in at more affordable prices than its rivals. With the MateBook X (2020), the company is offering a stylish thin and light laptop for a starting price of £1,099.99 / €1,599 (around $1,900/AU$2,600).",
    "For this money you get an Intel Core i5 processor, 16GB of RAM and 512GB of SSD storage. This puts it at around the same price as the MacBook Air (2020), which costs $1,299 / £1,299 / AU$1,999 for similar specs (but with only 8GB of RAM).",
    "The MateBook X (2020)'s price is also in the same ballpark as the LG Gram 14 (2020), another thin and light laptop.",
    "A version with a more powerful Intel Core i7 processor is available, and that costs £1,399 / €1,799 (around $2,100, AU$3,000).",
    "Perhaps it’s a sign of Huawei’s growing confidence that it has chosen not to undercut the MateBook X (2020)'s competition to such a significant degree – but it remains expensive, so it will have to really impress to prove that it has what it takes to keep up with its premium, more well-established rivals.",
    "After all, this is quite a bit more expensive than Apple’s new MacBook Air (2020), whose prices start at $999 / £999 / AU$1,599.",
    "One last note about availability: it’s still difficult to buy Huawei products in the US, so if you're Stateside and want to purchase this device, your only option may be to import it.",
    "We have to hand it to Huawei: with the MateBook X (2020), the company has created a superbly designed laptop. It's an expensive device, and it looks and feels it. Available in two colors, Silver Frost (reviewed here) and Emerald Green, its 11.2 x 8.14 x 0.54-inch dimensions and 1kg weight combine to present a laptop that looks understated and professional.",
    "It’s certainly a device that feels easy to carry around, while not being too fragile that you’d worry about taking it out and about.",
    "In terms of styling, the Apple influence can still very much be seen – but we’d imagine the Emerald Green version feels a little removed from it. Anyway, you wouldn't call this a cheap MacBook knockoff, because it’s actually more expensive than many MacBook models. A strange state of affairs, to be honest.",
    "The compromise of having a thin laptop usually comes by way of a reduced number of ports – and, sadly, that proves true here. The MateBook X (2020) has just two USB-C ports (one on each side), and an audio jack for headsets. If you have any older USB devices that you want to use with this laptop, you’ll need an adapter.",
    "On opening up the laptop, you get to appreciate just how thin it is. The 13-inch screen has impressively narrow bezels. The screen itself is superb, too, with a ‘2K’ 3,000 x 2,000 resolution and a 3:2 aspect ratio. This means it’s taller than a widescreen 16:9 display, making it handy for word processing and spreadsheets, and reading websites. The extra height makes a noticeable difference, in a good way, and this is true of other laptops and tablets with similar displays, such as the Microsoft Surface Pro 7.",
    "With a contrast ratio of 1,500:1 and a maximum brightness of 450 nits, the Huawei MateBook X (2020)'s screen offers decent image quality. And with 100% sRGB color gamut support, it should be capable of displaying some truly stunning images. We found it works well in direct sunlight (there’s even a light sensor to adjust screen brightness depending on the ambient lighting where you’re using it), and contrast is good: blacks are nice and dark, with light colors offering decent brightness.",
    "The bezels around the screen are impressively thin due to the lack of a webcam above the screen. Instead, it’s built into the keyboard, between the F6 and F7 keys. It looks like a standard keyboard key, with a camera logo – but press it, and the camera pops up. It's an elegant solution (and something we’ve seen in other Huawei laptops, too), and also security-conscious, since pressing the webcam back down into the keyboard effectively covers up the camera.",
    "However, we do have to highlight how unflattering this webcam can be. It’s aimed upwards at such an angle that even people with the most chiseled of chins is likely to feel pretty self-conscious. Many people will end up wishing Huawei had just left the webcam in the traditional spot above the screen, even if this would have resulted in a slightly thicker top bezel.",
    "The rest of the keyboard is perfectly fine, with a size and travel that’s similar to a MacBook. There’s no backlighting of the keys, so in dark environments you may struggle to make out the keys you’re pressing.",
    "The large trackpad is responsive, and runs right to the bottom edge of the laptop. It does a fine job of controlling Windows 10. There’s also a fingerprint scanner just above the keyboard, which doubles as a power button. As is the case with other Huawei laptops, it has a clever feature where it scans your fingerprint when you press it to turn on the laptop, then stores your fingerprint to log into Windows 10, so you don’t have to tap the button twice. In our experience it worked well, reliably logging us in throughout our time with the laptop.",
    "Overall, the Huawei MateBook X (2020) performs very well. Windows 10 feels fast and responsive, and using it daily for general use, we had absolutely no complaints. Huawei’s inclusion of the 10th-generation of Intel processors is a good choice, bringing performance gains to this thin and light laptop over previous models.",
    "The Intel Core i5-10210U processor that features in the review model is a quad-core processor with a base frequency of 1.6GHz and a boost of 4.2GHz. Paired with the 16GB of RAM, it delivers an excellent Windows 10 experience, taking multitasking in its stride.",
    "However, we did notice that the processor appeared to be throttling during intensive tasks and benchmarks. This is likely due to the Huawei MateBook X (2020)'s fanless design. The lack of fans means this laptop is virtually silent, and while that's a positive, it also means the MateBook X (2020) struggles to keep its cool. As a result, when the processor is overworked, the laptop becomes hot – and when it reaches a certain temperature, the CPU's performance is throttled, thus reducing performance and heat.",
    "Unfortunately, this is the price you pay for the combination of thin and light, fanless design and decent CPU. The good news is that for standard day-to-day tasks, such as browsing the web and word processing, there will be no issue – and the silent, thin and light design will be worth it. But for demanding tasks that require sustained CPU firepower, you may find performance is hampered due to throttling.",
    "In other areas, however, we remain impressed. The 13-inch panel's 3,000 x 2,000 resolution results in very good pixel density, and by default Windows 10 scales at 225%. You can lower this, though, to give yourself more room to work: we used it at 150%, shrinking text and graphics to allow more room, but without things becoming uncomfortable.",
    "Our benchmarks show that the Huawei MateBook X (2020) beats the MacBook Air 2020, although the latter includes a low-spec Core i3 processor. The fact that the Huawei MateBook X (2020) comes with a quad-core CPU, compared to the entry-level MacBook Air’s dual-core unit, resulted in the MateBook X dominating in the multi-core tests. Featuring double the RAM included in the MacBook Air, the Huawei MateBook X (2020) not only takes some of its design cues from Apple, but it takes the lead in many respects – although keep in mind this is a more pricey machine.",
    "Overall, the Huawei MateBook X (2020) performs really well. But don’t expect it to be able to crunch through complex video-editing tasks or play AAA games. As a productivity machine, however, it impressed.",
    "Also, those who own a compatible Huawei phone can use the Huawei Share feature to wirelessly connect their mobile to the laptop (this is achieved via an NFC chip inside the body of the laptop, so it’s very easy to use).",
    "On connecting the phone, you’ll be able to open apps on both devices, use video-calling features, and drag-and-drop files to and from the smartphone and laptop. It works well, and is a welcome extra feature. We’d love to see it work with handsets from different manufacturers, but we can understand the reasons that Huawei wants to limit the functionality to its own devices. If you already own a Huawei handset, consider this a big plus.",
    "We were very pleased with the overall performance of the Huawei MateBook X (2020), including the laptop's battery life.",
    "In our video benchmark, where we loop a 1080p video with the screen at 50% brightness, the Huawei MateBook X (2020) lasted a very respectable 9 hours and 30 minutes, easily blowing past the MacBook Air’s 8 hours. Apple usually has the edge when it comes to battery life, but we’re loving seeing Windows 10 laptops such as the Huawei MateBook X (2020) benefit from the more efficient 10th-generation Intel chips, which allows them to deliver improved battery performance.",
    "In the PCMark 10 battery life test, which replicates more intensive workloads such as document creation and video calls, the laptop also impressed, lasting just shy of 9 hours.",
    "We found we could use the Huawei MateBook X (2020) for a full work day without needing to top it up, making this an extremely versatile laptop. If you do need to charge it, the included fast charger can restore around half of the battery in just 30 minutes. This means that when using the Huawei MateBook X (2020), you shouldn’t have to worry about running out of battery – which is a refreshing thing to say about a compact Windows 10 device."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "15": "Design",
    "25": "Performance",
    "34": "Battery life",
    "38": "Don't buy it if..."
  },
  "links": {
    "LG Gram 14 (2020)": "https://www.techradar.com/reviews/lg-gram-14-2020-core-i7-10th-gen-laptop",
    "new MacBook Air (2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}