{
  "source": "https://www.techradar.com/reviews/sony-a8gag8-oled-tv",
  "title": "Sony A8G/AG8 OLED TV review",
  "category": "televisions",
  "updated": "2020-06-11T13:50:49Z",
  "author": "nick-pino",
  "summary": "A beautiful - but expensive - OLED with best-in-class upscaling",
  "verdict": "The Sony A8G/AG8 OLED is a fantastic 4K HDR TV with amazing picture performance, incredible upscaling and the best-in-class motion processing. We have some reservations about Sony’s Acoustic Audio Surface tech and the plastic remote that uses an IR blaster to control the TV, but it performs in the only category that matters: picture quality.",
  "pros": [
    "Amazing 4K HDR performance",
    "Ultra-customizable picture",
    "Best motion processing"
  ],
  "cons": [
    "Middling sound quality",
    "Fairly expensive",
    "IR remote is really awful"
  ],
  "article": [
    "When it comes to OLED TVs, you probably think of LG - basically the only company in the world that produces enough panels at scale to supply the entire industry. But the TV manufacturers buying those panels (namely Sony and Panasonic) are taking the technology and making it their own with custom processors, in-house designed bezels and stands, as well as installing their own smart TV platforms - or in Sony’s case, a licensed partner’s.",
    "The result is a TV that’s different in both form, function and price from the TVs that LG produces, and are therefore worth looking at in more detail.",
    "That leads us to the Sony A8G OLED (Sony AG8 if you’re in the UK and Europe) that takes an LG OLED panel and infuses it with Sony’s X1 Extreme Processor and Android TV Oreo with Google Assistant built into the TV itself.",
    "Sure, it’s slightly more expensive than the lower-cost LG B9 OLED and LG C9 OLED, but if you want the best upscaling, motion processing and picture customization options, look no further than the Sony A8G/AG8 OLED.",
    "After over a decade of designing OLED TVs, Sony is showing no signs of slowing down: In 2019, Sony released the A9G OLED - which we loved - and the Sony A8G OLED (reviewed here), as well as a few LED-LCD TVs like the Sony X950G (XG95) and Master Series Z9G.",
    "The A8G/AG8 comes in two sizes, 55-inch and 65-inch, which are available for $1,799 (£2,199, AU$3,195) and $2,499 (£2,999), respectively. (Note: Only the 55-inch version is currently being sold in Australia.)",
    "Those prices will probably go down once the Sony A8H OLED is released later in 2020, but for now it's one of the more expensive OLEDs on the market and rival the cost of last year’s LG E9 OLED.",
    "Although it shares the same birthplace as the panels found in LG’s B9 and C9 OLED TVs, Sony chose to encase that panel in a minimalist frame with a crescent-shaped stand. That gives it a slightly different look than the LG B9 OLED that uses a pedestal to hold the TV upright.",
    "The stand is reversible if you want a slightly different look and, in terms of cable management, you can string cords through the back of the legs of the TV, which should help to keep your entertainment center looking tidy.",
    "While the bezel on the front is fairly minimal, the TV is a tad chunky in the back-midsection. That’s where the internals of the TV are hosted, and that’s where you’ll find the IO ports, which are rather generous in quantity: On both the 55-inch and 65-inch versions of this TV you’ll find four HDMI ports with HDCP 2.3 and one with ARC, plus a digital audio out, 3.5mm auxiliary and three USB ports.",
    "For the real TV enthusiasts out there, the Sony A8G/AG8 doesn't support eARC, nor does it have any HDMI 2.1 ports (something not amended for the 2020 follow-up, the Sony A8H OLED).",
    "Last but not least, there’s a physical power button and volume rocker located next to the ports on the back in case you ever lose the remote.",
    "Speaking of the remote, it's probably our least favorite design choice of the A8G - for a TV as beautiful and as advanced as this one is, it’s crazy that Sony is still shipping it with an unnecessarily-large IR remote.",
    "It’s easy to see that Sony wanted to design a sort of all-in-one remote that has both a numerical keypad, colored buttons for cable box selections, playback controls, smart TV buttons, and buttons for your media players and set top box. While this level of control is great, the remote is big, bulky and requires line-of-sight at all times for everything but a Google Assistant voice search.",
    "Sony thankfully ships the TV with an IR extender, which you’ll need to use if your soundbar covers the IR receiver on the front of the TV, but we’d much rather have a Bluetooth remote with more streaming service shortcuts and a remote finder button instead.",
    "Design TL;DR: The Sony A8G/AG8 has all the elements of a premium TV with a few irksome holdovers - like the IR remote and bulky midsection - from the lower-end TV ranges.",
    "Like the A9G OLED, the step-down A8G uses Android Oreo - the latest version of Android TV that supports built-in Google Assistant and a familiar row-based design that helps separate Android TV from smart TV platforms like Tizen and webOS.",
    "Other TVs might have ruined Android TV for you - as some TV’s processors just aren’t capable of keeping up with the platform’s resource-intensive visuals - but on the A8G/AG8 everything is snappy and responsive, with a relatively deep catalog of apps that can be found along the bottom-most row.",
    "Each row is a visual representation of content inside an app. For example, the YouTube row will have recommended YouTube videos for you based on what you’ve watched previously. The same is true for the Netflix, Google Play Movies & TV and Play Music rows, too.",
    "This design makes finding new content relatively easy, but it can bury the library of apps which now requires a bit of scrolling to get to. Among the supported apps you’ll find Disney Plus, YouTube TV, Amazon Prime Video, Vudu, Crunchyroll, CBS All-Access, ESPN, Starz, HBO Now and many, many more.",
    "Should you want to use your phone to control the TV, there are a number of third-party Sony remote apps that allow you to do that - but by far the best way is to just use the built-in Chromecast to Cast whatever content you want to watch from your phone to the TV. This feature is great if you have several people who each want to share media - for example, a group friends who all want to show you different YouTube videos and can take turns casting without directly connecting to the TV itself - or if you just want to share some quick photos with the family on the big screen.",
    "Like other Android devices, the Sony A8G comes with Google Assistant built-in, which is especially handy if you’re looking for a specific film or for a specific actor/actress. The TV can also then be controlled by other Google Assistant devices like a Google Nest Mini, and even has some limited crossover with Amazon’s Alexa functionality. According to Sony, there’s support planned for Apple AirPlay 2 and HomeKit, but they weren’t available for us to test in time for this review.",
    "Smart TV TL;DR: Android TV can be a mixed bag in terms of performance, but on the A8G/AG8 it works great and is fully stocked with all of the most popular apps.",
    "Any old 4K TV can take Ultra-HD content and make it look great, but the Sony A8G/AG8 is among a select few that can take any content, regardless of age and quality, and make it shine. That’s due primarily to the X1 Extreme Processor which uses a multi-faceted upscaling process to reduce grain, sharpen edges and enhance colors. This is something all 4K TVs do to some extent, but almost none of them do it as well as Sony does.",
    "To test the A8G’s mettle, we threw on The Lord of the Rings: The Fellowship of the Ring on DVD - a classic that’s well-worth re-watching every few years. The result? The Shire, which has always looked picturesque thanks to its New Zealand backdrop, looked especially verdant on the A8G, with beautiful greens and bright blue skies, and the forest of Lothlorien and the Mines of Moria had an almost ethereal look to them - which we loved.",
    "Other darker scenes which would have looked grainy and grey on other TVs, like the Battle at Weathertop, looked great on the A8G/AG8 due to the noise reduction algorithm and OLED panel that can replicate true black.",
    "The only drawbacks to the TV’s HD/SDR performance is that it can experience a bit of black level crushing when there’s not enough data in the video - basically anything that’s near black drops down to pure black instead of its natural color - and the TV can take scenes that have a lot of color and go a bit overboard with it. (The Rivendell scene from The Fellowship of the Ring has an insane orange hue with the standard settings.)",
    "The other difference, and one that might not matter to most, is that the X1 Extreme Processor doesn't do object-based HDR enhancements the way the X1 Ultimate Processor does. That means potentially some objects on screen could look sharper and more vibrant on the more expensive A9G, but we didn't notice it nor did it affect our viewing experience.",
    "At the end of the day, this TV offers better HD/SDR performance than most other TVs - and that’s before you get to the high-octane world of 4K HDR content.",
    "HD/SDR Performance TL;DR: It can get a bit overzealous in some scenes, but most times the X1 Extreme does a great job upscaling and enhancing old HD/SDR footage.",
    "While OLED TVs have been panned in the past for their lower-than-LCD levels of brightness, the A8G/AG8 will surprise you with 800 nits of peak brightness. That’s still less than, say, a Samsung Q90 QLED or Vizio P-Series Quantum X, both of which easily top 2,000 nits - but it’s a big improvement on previous generations.",
    "That perceived uptick in brightness means that the A8G/AG8 looks great in both dark settings and light-splashed living rooms, and helps HDR content look more colorful and impactful.",
    "That said, Sony is fairly conservative when it comes to its color grading and tends to be less vibrant than other manufacturers. Based on its reference grade counterpart - Sony's Pro OLED mastering monitor, the BVM-X300 - the A8G/AG8 produces natural-looking pictures right out of the box and can be really fine-tuned exactly how you like with Sony’s deep customization options. Image presets comprise Vivid, Standard, Cinema, Game, Custom, Graphics and Photo, with Standard being fairly versatile and applicable in most circumstances.",
    "You’ll have slightly fewer options when it comes to setting motion processing strength, but by and large the default MotionFlow and CineMotion settings (set to '5' and 'High', respectively) are pretty great.",
    "The two big disappointments here are the lack of Netflix Calibrated Mode, something Sony offers on both the A9G/AG9 and X950G/XG95, but also lacks any screen syncing tech like AMD FreeSync or Nvidia G-Sync.",
    "The A8G/AG8 will automatically swap to a low-latency gaming mode when it detects a game console, however, so that is a big plus.",
    "In terms of formats, this TV supports Dolby Vision, HDR10 and HLG, and has Dolby Atmos passthrough if you have a compatible soundbar or speaker system.",
    "Another positive note for cinephiles and TV binge-watchers: there aren’t many screens that can compete with the A8G/AG8 in terms of contrast. That makes this a perfect companion for shows like Night on Earth or Altered Carbon, both of which have scenes interspersing bright areas and completely dark sections. Having a TV that can handle both without color banding or gradation is truly magnificent.",
    "4K/HDR Performance TL;DR: If you’re the kind of person who likes picture-perfect images and not oversaturated visuals, this is the OLED you’ve been looking for.",
    "Like other OLEDs in the lineup, the A8G/AG8 uses Sony’s Acoustic Surface Audio technology instead of traditional down-firing speakers to add sound to its excellent picture performance. Overall, Sony's proprietary technology sounds fairly good, but it's not quite perfect yet, especially when stacked against a proper soundbar.",
    "For those who missed its debut on the Sony A1E OLED back in 2016, Acoustic Surface Audio uses actuators affixed to the back of the TV to create sound using the screen.",
    "The result is a sound that seemingly emanates from the middle of the screen and casts a wide soundstage: Voices seem to come directly from the actors’ and actresses’ lips, and though it lacks some bass, music does a good job filling the whole room.",
    "The only problem with Sony’s Acoustic Surface Audio solution is that the soundstage comes at the expense of clarity - especially in the low-end. Unfortunately in large, open rooms dialogue can get lost and bass carries but doesn’t have any real power behind it. Now, admittedly, traditional speakers usually don’t fare any better in these types of conditions, but it’s particularly upsetting when your TV costs as much as this OLED does.",
    "Sound TL;DR: For most living room setups, the A8G/AG8 delivers good sound with a wide soundstage, but those with large, open spaces should be wary.",
    "The biggest competition for the A8G/AG8 is LG’s B9 and C9 OLED TVs from 2019, as they use the same exact panels with a slightly different processor, exterior and speaker design as well as WebOS instead of Android TV.",
    "The reason you’d pick an LG OLED is because it’s cheaper by around $500 - and sometimes more when they’re on sale. The Sony A8G/AG8 is definitely going to cost more, and what it offers - better upscaling and motion handling - might not be worth the extra money to a less-critical viewer.",
    "After spending over a month with it, we really were impressed with the A8G/AG8. Sony remains the king of upscaling - taking old DVD HD/SDR footage and making it look modern - and always impresses with its natural visuals and frame-perfect motion handling. We have some reservations about Sony’s Acoustic Audio Surface tech and the plastic remote that uses an IR blaster to control the TV, but it performs in the only category that matters: picture quality.",
    "So much so, in fact, that we'd recommend buying this instead of a Sony A9G/AG9 if you want to save around $1,000/£1,000. The latter nets you a slightly better processor, a better remote and Netflix Calibrated Mode, but the A8G looks similar in so many regards that the little extras probably don't matter much.",
    "That being said, it’s still on the expensive side, especially compared to the LG B9 and C9 OLED - as they cost much less and offer much of the same picture quality at a more attainable price point. You'll lose out on some of Sony's proprietary tech, but to some, saving $500 is totally worth the trade-off."
  ],
  "headers": {
    "4": "Price and release date",
    "7": "Design",
    "16": "Smart TV (Android 8.0 Oreo)",
    "23": "HD/SDR Performance",
    "30": "4K/HDR Performance",
    "39": "Sound",
    "44": "Other panels to ponder...",
    "46": "Final verdict"
  },
  "links": {
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "LG B9 OLED": "https://www.techradar.com/reviews/lg-b9-oled-tv-oled55b9-oled65b9",
    "LG C9 OLED": "https://www.techradar.com/reviews/lg-c9-oled-oled55c9-oled65c9-oled77c9",
    "A9G OLED": "https://www.techradar.com/reviews/sony-bravia-a9g-ag9-oled",
    "Sony X950G (XG95)": "https://www.techradar.com/reviews/sony-x950gxg95-4k-tv-xbr-65x950g",
    "Master Series Z9G": "https://www.techradar.com/reviews/sony-bravia-master-series-z9g-8k-hdr-tv",
    "Sony A8H OLED": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "LG E9 OLED": "https://www.techradar.com/reviews/lg-e9-oled",
    "Google Nest Mini": "https://www.techradar.com/reviews/google-nest-mini",
    "Samsung Q90 QLED": "https://www.techradar.com/reviews/samsung-q90-qled-tv",
    "Vizio P-Series Quantum X": "https://www.techradar.com/reviews/vizio-p-series-quantum-x-px65-g1",
    "Sony A1E OLED": "https://www.techradar.com/reviews/sony-bravia-a1e"
  }
}