{
  "source": "https://www.techradar.com/reviews/mobirise",
  "title": "Mobirise website builder review",
  "category": "computing",
  "updated": "2020-11-17T11:20:15Z",
  "author": "steve-paris",
  "summary": "Want to design a nice looking website? Then check this service out.",
  "verdict": "Mobirise gives you the simple options you need to create a basic yet good looking website.",
  "pros": [
    "Elegant interface and design",
    "Easy to use",
    "Easy to create nice looking sites"
  ],
  "cons": [
    "No blogging",
    "No e-commerce",
    "Limited options"
  ],
  "article": [
    "Mobirise is an app for both Windows and Mac, that advertises itself as free, and will help those with no coding experience to create websites with ease.",
    "But although it’s true that you don’t have to pay for it, if you want to use anything but the two bundled themes, you’re going to have to fork out for the privilege. I mean it’s understandable: you design an app, you should expect to be financially rewarded for that, but it would be more honest to be upfront about it: if you want to unlock all the features, you can do so for a one-off fee of $149.",
    "You can also choose to gain access to new themes one at a time. As of this writing, there are 87 of them to try out, at $49 a pop (that’s where the $149 price tag becomes mighty attractive if you’re going to go down that route).",
    "Mobirise allows you to build sites using blocks, and that price also includes over 3,400 blocks to play with. However don’t go clicking on ‘buy now’ just yet, and let’s take the free version out for a spin.",
    "The moment you launch the app you need to log in. You can do so using your Google or Facebook accounts, but if you’d rather keep everything separate, you can create a Mobirise account instead.",
    "Once done, you’re presented with a default website based on the ‘Mobirise 4’ theme, which you’re free to browse through, customise, or just create one of your own from scratch. This is where you have access to only two themes - this one and ‘Mobirise AMP’, but that’s more than enough to get a taste for what’s on offer.",
    "Do note that you can’t change a site’s theme once you’ve started creating it. If you change your mind, you’ll have to start again from scratch.",
    "The interface is incredibly simple to use and understand. The bulk of the window is your site. Not only is it a preview of what you’re creating, but you also have hands on editing control over everything right from there. Want to change a menu’s name? Just highlight it and overwrite it. Want a different colour? Select the section and alter it. It really is that simple.",
    "The tools you need for each specific task appear as you require them. This makes for a very clean interface which is very nice to use.",
    "The list of blocks you add to your site can be found on the right hand side by clicking on the big ‘Add Block to Page’, lower right of the interface.",
    "Adding additional pages, or creating a brand new site, is done from the sidebar on the left (revealed by clicking on the three horizontal lines, top left of the interface).",
    "Adding blocks is incredibly easy. Reveal the section and scroll through the list until you find the one(s) you’re interested in. There are headings on the far right of the sidebar, to help you jump to the right section quicker, but if you just scroll through the list, you’ll pass through every category in time.",
    "You can add a navigation menu, headers, image galleries, videos (only from YouTube and Vimeo it seems), an article section, or an ‘about us’, ‘contact us’, ‘maps’ section, links to social media, and a footer.",
    "Your page is now populated with generic images and texts, but it’s a simple matter to edit it all to make your site truly your own.",
    "Just click on some text and edit it. You’ll have a choice of heading size, colour and justification. You can bold and italicise words or turn them into hyperlink. The basics, really, but it’s all there and easy to access. By default the colour section will give you a list of matching colours that would suit the other shades on your page, but you’re also free to select any colour you wish.",
    "Changing images is just as easy: select one and you’re instantly brought to a free online library. There’s a handy search field to find the exact image you need, or import your own from your computer instead.",
    "Your image editing options are extremely limited. You have cropping, zooming, and flipping tools, and that’s it.",
    "We do like the ‘Site Library’ option: this is where all the photos you’ve used throughout your site are stored. It saves you from re-uploading the same photo should you wish to use it multiple times. Saves on bandwidth, and speeds up visitor access to your site.",
    "There are some editing options for each of your blocks. These are accessed by clicking on the Block Parameter icon (a cogwheel to the right of each block). This is where, for instance, you can choose to increase the block’s top and bottom padding, add a background colour, or set how many images are to be in your Gallery. It’s all done with sliders, toggles and drop down menus. Very straightforward and easy.",
    "As you’d expect, you can also reorder your blocks or delete them altogether.",
    "Now you could create a complete landing page that way - everything you need to share with your visitors about yourself and your business, on one scrollable document, but Mobirise also lets you create multiple pages.",
    "You can start a new one from scratch, or duplicate an existing one should you prefer.",
    "Your pages don’t appear in the navigation menu automatically though. You have to create a menu name, and link it manually to any new page. This is not very convenient, especially if you plan on creating a complex website. Even if you only want a couple of pages, automatically updating the navigation bar should be something Mobirise, which prides itself on making it easy for you, should offer.",
    "The absence of a blogging facility is sorely felt. Yes, you can create ‘Article’ blocks, place them on new pages, and link to such articles manually from the main page, but you’d essentially be doing the non-existing blogging tool’s job for it. And of course, there’s no ecommerce facility.",
    "This is just a website builder which is designed to create simple and attractive pages to attract customers, and get them to contact you.",
    "As you’re building your site, you have multiple ways to check how it would look to potential visitors.",
    "One way is the button in the middle of the top toolbar. It lets you toggle between Mobile and Desktop view (Desktop is selected by default).",
    "What’s quite cool is the fact you can edit your site no matter which view you’re in.",
    "Another way is opening your site in your default browser. Depending on its complexity, it will take a few seconds for Mobirise to export your project, but once done, it’ll open instantly, and you’ll be able to browse through it at your leisure.",
    "When you’re ready to publish, Mobirise has an FTP client built right in, which is most convenient.",
    "Such a straightforward app should be easy for most people to use, but anything can happen, so it’s good to know there’s a help centre and a forum for you to access. The help centre is broken down into sections, and also has a search field to make finding the right article easier.",
    "As with all online forums, this one is filled with users asking questions with others (hopefully) providing the answers they seek.",
    "And if all else fails, the app’s Help section also lets you write an email to Mobirise’s technical support team.",
    "Mobirise is very easy to use, has a lot of simple options to help you create an elegant site in little time. There are limited options - at least the free version has - but if all you need is a basic site to advertise your presence online, and don’t need features like blogging or ecommerce, you should definitely check Mobirise out. What it does, it does extremely well."
  ],
  "headers": {
    "4": "Getting started",
    "7": "Interface",
    "11": "Populating a page",
    "13": "Customization",
    "25": "Preview",
    "30": "Support",
    "33": "Final verdict"
  },
  "links": {
    "Mobirise": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7962531023524456000&xs=1&url=https%3A%2F%2Fmobirise.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmobirise",
    "one-off fee": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3841351484543194000&xs=1&url=https%3A%2F%2Fmobirise.com%2Fextensions%2Fkit%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmobirise",
    "$49 a pop": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3598379433543935000&xs=1&url=https%3A%2F%2Fmobirise.com%2Fextensions%2Fkit%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmobirise",
    "help centre": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1314084863334939400&xs=1&url=https%3A%2F%2Fmobirise.com%2Fhelp%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmobirise",
    "forum": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2575967689317265400&xs=1&url=http%3A%2F%2Fforums.mobirise.com%2F%3F_ga%3D2.31250811.551708579.1593996107-1166067083.1593996107&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmobirise"
  }
}