{
  "source": "https://www.techradar.com/reviews/budgetpulse",
  "title": "BudgetPulse review",
  "category": "computing",
  "updated": "2020-09-20T20:39:13Z",
  "author": "rob-clymo",
  "summary": "BudgetPulse aims to help you keep track of your money and accounts the easy way",
  "verdict": "BudgetPulse is a great no-cost option for anyone who wants a basic suite of money management features wrapped up in an online package that keeps things straight and to the point.",
  "pros": [
    "Free to use",
    "Easy to master",
    "Powerful import options",
    "Comprehensive user instructions"
  ],
  "cons": [
    "Fairly basic",
    "Online only",
    "Requires Adobe Flash to be installed",
    "Email-only support"
  ],
  "article": [
    "BudgetPulse is proof positive that not all of us need complicated financial and budget management tools. And, if you class yourself as one of the many people who just wants something simple, especially during the coronavirus crisis, then BudgetPulse is therefore a great option. This is an online software solution that, thanks to its web-based design is a very handy, no fuss, no bother creation that lets you keep a keen eye on your finances.",
    "BudgetPulse can also help you get your money affairs in better shape, thanks to its practical tools and assistants. The solution aims to help you with your monetary planning in straightforward fashion and uses a secure setup in order to do that. It’s quite powerful too, with the capacity for importing financial statements from existing Quicken or Microsoft Money files. From there you’ll find budgeting for the future rewardingly accurate.",
    "Similar products in this marketplace include Mint, You Need a Budget (YNAB), Banktree, Money Dashboard or Moneydance to name but a few.",
    "The good news about BudgetPulse is that it is completely free to use, which makes it ideal if you’re not too keen on paying for financial management services. And, considering it is a gratis arrangement, BudgetPulse does a very decent job of delivering its online web-based solution with a full suite of tools and options to work with.",
    "That’s really impressive for a service that also allows you to import the aforementioned Quicken or Microsoft Money files, plus you’re not tied in to any kind of contract either.",
    "We love the way BudgetPulse initially allows you to pick through core areas of the online service and get all of the basic nuts and bolts administration work setup, before you start using it for everyday tasks.",
    "So, it’s a good idea to tweak and fine-tune your account preferences, such as choosing your geographical location, time zone and country currency. The latter is perhaps central to making sense of your financial planning decisions. From there, the service has a main menu collection that consists of a main Dashboard area, plus tabs for Transaction, Budget, Accounts, Charts, Goals and Tools.",
    "There’s also a decent Search option and dedicated help section. Establishing your accounts is a crucial part of the process and can be done by importing them, or manually once you’ve established the ones that are needed. The ability for defining your budget makes a lot of sense too.",
    "With its purely online web browser-based interface you’ll find that BudgetPulse works just as it should, assuming you have a dependable internet connection that is. It also works if you’re accessing it using a device other than a desktop computer or laptop.",
    "Admittedly, the version you get to use on something like a tablet or a smartphone will, in essence, be using the same interface as that seen on a conventional computer, but it’s still a workable arrangement that will tick over nicely just as long as you're online.",
    "However, bear in mind that you will need Adobe Flash Player 8 or above in order for all of the features and functions to work, which might not be for everyone.",
    "One of the best aspects of BudgetPulse is the ease with which you can get started. After creating a user name and password, you’ll need to verify your account via an email confirmation and then it’s straight down to business.",
    "And, to make the transition to better financial management that little bit easier, BudgetPulse kindly offers a small welcome screen that appears once you have logged in. This is a great little primer area that takes you through the setting up of preferences, how to establish your accounts and enter transactions, as well as defining your budget.",
    "Once you’ve picked through that little lot then using BudgetPulse is really pretty straightforward.",
    "Hopefully you’ll find that BudgetPulse is so suitably user-friendly that you won't require much in the way of support. We found it to be pretty uneventful in terms of configuring the online interface to work as we wanted it to. From there, just as long as you follow the steps in each of the tab areas, you’ll find that everything should fall into place.",
    "However, support-wise you get lot of detail in a comprehensive FAQ area, plus there’s a user guide and videos that are very helpful too. There’s a neat blog that’s worth a look if you’re feeling smitten with BudgetPulse and want to keep tabs with what is happening in their world. If you’re really flummoxed though it’s possible to post a question in the BudgetPulse public forums area or contact them via a support email.",
    "We found the need to have Adobe Flash player installed in order to get the best from the more dynamic BudgetPulse features, such as bar and line chart diagrams, a little bit irritating. Not everyone is keen to have this on their machines, so that might prove a little offputting for some.",
    "Nevertheless, aside from that relatively minor gripe, BudgetPulse should be commended for providing such a comprehensive online solution for free. The interface is basic and all the better for that, plus it delivers a surprisingly detailed overview of your finances and all without the need for much in the way of tech savvy-ness.",
    "In fact, if you're prepared to work through the step-by-step early part of the process then using it on a daily, or even occasional basis, makes BudgetPulse a breeze. Budgeting for the future is one of it’s great strengths too."
  ],
  "headers": {
    "3": "Pricing",
    "5": "Features",
    "8": "Performance",
    "11": "Ease of use",
    "14": "Support",
    "16": "Final verdict"
  },
  "links": {
    "BudgetPulse": "https://www.budgetpulse.com",
    "budget management": "https://www.techradar.com/best/best-budgeting-software",
    "online software": "https://www.techradar.com/best/accounting-software-small-business",
    "finances": "https://www.techradar.com/best/accounting-software-small-business",
    "Quicken": "https://www.techradar.com/reviews/quicken",
    "Microsoft Money": "https://www.techradar.com/news/microsofts-new-money-in-excel-offers-dynamic-management-of-your-finances",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "Banktree": "https://www.techradar.com/reviews/banktree-personal-finance",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Moneydance": "https://www.techradar.com/reviews/moneydance",
    "Budgeting": "https://www.techradar.com/best/best-budgeting-software"
  }
}