{
  "source": "https://www.techradar.com/reviews/roccat-kone-pure-ultra",
  "title": "Roccat Kone Pure Ultra review",
  "category": "computing",
  "updated": "2020-01-07T15:30:41Z",
  "author": "christian-guyton",
  "summary": "Lightweight and well-crafted",
  "verdict": "An excellent, if fairly basic, mouse from Roccat that trades some fancy gaming features for a super-light design, but doesn’t skimp on the internal hardware to maintain high performance in a variety of scenarios.",
  "pros": [
    "Ultra-light design",
    "Durable exterior",
    "Buttons feels great"
  ],
  "cons": [
    "A bit light on features",
    "Cable feels cheap"
  ],
  "article": [
    "The Roccat Kone Pure Ultra might not have the adjustable weighting or seven hundred programmable buttons that come as part of the ‘gaming mouse’ experience, but it doesn’t need any of that.",
    "There’s something to be admired in a product that is fundamentally simple, but done perfectly. As Bruce Lee said, “I fear not the man who has practised 10,000 kicks once, but I fear the man who has practised one kick 10,000 times”. For Roccat, this mouse is that one kick.",
    "There’s very little not to like about the Kone Pure Ultra; the initial appearance is a simple one, which would be deceptive of the Pure Ultra’s quality if it weren’t for the price tag - this Kone costs $69.99 (£59.99, around AU$100) right now.",
    "That might sound expensive for a product that could easily be mistaken for a ten-dollar supermarket mouse (were it not for the RGB lighting), but the Pure Ultra proves itself to be worth the cash.",
    "That deceptive appearance manifests as a plain black wired mouse, with the usual left and right buttons, scroll wheel and two additional buttons on the left-hand side above the thumb rest, along with two buttons for real-time sensitivity tweaks to the rear of the scroll wheel. All six buttons feel satisfying to click, and any latency was virtually undetectable.",
    "Scrolling is a pleasant experience too; while the scroll rate is fixed - no free-spinning scroll wheel mode here - it feels sturdy, as does the rest of the construction. Considering that this mouse weighs just 66g, it’s still perfectly durable.",
    "Buttons aside, the broader user experience is great. The two rubberized base pads glide smoothly over most surfaces, and the 16000 DPI optical sensor has a customizable lift-off distance that can be adjusted down below 1mm (depending on your mousepad). Overall mouse sensitivity is fantastic.",
    "An extremely low weight and lift-off distance makes this a mouse ideal for specific purposes. Decreased lift-off distance is perfect for camera control in games, particularly for gamers who prefer lower sensitivities. It also provides a smoother experience in 3D design software, although the Kone Pure Ultra is very clearly marketed as a gaming mouse.",
    "Of course, that means RGB lighting, because god forbid any piece of gaming hardware isn’t adorned with gaudy LEDs. Thankfully, the Pure Ultra keeps it relatively subtle, with a glowing Roccat logo that can be customised in the manufacturers Swarm software, which also allows the tweaking of other settings such as scroll speed, polling rate and button assignment. The lighting is quite bright, but remains concealed under the palm during normal use so as to avoid distraction.",
    "The seventy-dollar price tag may be a bit daunting, but most parts of this mouse feel worth the price. The only exception is the rubber-coated cable, which is a bit inflexible and feels somewhat cheap. It isn’t a deal breaker, we just wish it was woven or simply higher-quality - the point where it meets the USB connector in particular feels like it might be in danger of breaking after extended use.",
    "The Roccat Kone Pure Ultra is a great mouse for the casual gamer, or the FPS fan who enjoys a clean, clutter-free experience. If you’re a fan of mouse hotkeys in your games, though, the Pure Ultra doesn’t quite have the amount of customization that we’ve come to expect from gaming mice. That doesn’t make it a bad product; there are simply more complex options available."
  ],
  "headers": {
    "11": "Don’t buy it if…"
  },
  "links": {}
}