{
  "source": "https://www.techradar.com/reviews/honor-band-5-sport",
  "title": "Honor Band 5 Sport review",
  "category": "wearables",
  "updated": "2020-02-17T12:15:08Z",
  "author": "samuel-horti",
  "summary": "A basic tracker specializing in detailed running stats",
  "verdict": "The Honor Band 5 Sport gives runners and basketball players plenty of data to play with - even if not all of it is accurate. For the money, it goes impressively in depth, but outside these two activities it's severely lacking.",
  "pros": [
    "Granular running data",
    "Long battery life",
    "Eco-friendly credentials"
  ],
  "cons": [
    "Basic screen",
    "No heart rate or GPS",
    "Some of its tracking is wayward"
  ],
  "article": [
    "The Honor Band 5 Sport is a stripped-down version of an already basic fitness tracker, the Honor Band 5. It has no heart rate monitor, no GPS, no touchscreen - it doesn’t even have a color display. What it does have, however, is a shoe clip.",
    "Don’t worry, it’s more exciting than it sounds. The clip lets you strap the tracker snugly to your shoe laces and, thanks to new tech, access detailed running metrics such as your stride length, the swing angle of your leg, and your contact time with the ground.",
    "It can also measure stats specifically for basketball, such as your average vertical jump height and average hang time, some of which is useful even if you’re not into the sport.",
    "Essentially, it’s a tracker for runners and basketball players: you’re getting lots of detail for those two activities, but you’re sacrificing the Honor Band 5’s touchscreen, its heart rate monitor, and other activity options (the base band tracks swimming, for example, which the Sport doesn’t, despite having the same water resistance rating).",
    "That’s all on top of the nuts and bolts you’d expect from any fitness tracker: you can wear the Honor Band 5 Sport on your wrist and it will count your steps accurately, as well as your sleep patterns and phone notifications.",
    "And like the Honor Band 5, it’s gloriously cheap at just around £25 (roughly $30 / AU$45). While we found some glaring errors in its tracking - failing to register jumps entirely, for example - it’s hard to complain when you’re getting data this granular for such a low price.",
    "The body of the Honor Band 5 Sport includes a small screen at the top (which we’ll talk about below), and a button underneath. That’s it. Don’t expect to be able to do much with it - you can’t respond to notifications, for example - but the button worked without fail, which is a good sign, and the tracker is water resistant to 50 meters.",
    "The body slots into either the wrist strap or the shoe strap. It feels securely in place, and we never had to worry about it popping out when exercising. When you want to swap between the two straps, it’s easy: a firm press on the screen will bring the Honor Band 5 Sport free, and then you just pop it into the other strap.",
    "It automatically detects when you’ve put it in the shoe strap, and switches to footwear mode, allowing you to track either running or basketball sessions. It did this reliably, and a buzz confirms it’s in place.",
    "Unfortunately, because the body of the Honor Band 5 Sport is symmetrical, it’s easy to slot it in the wrong way up, but that’s easy to correct by taking the body out, rotating it and putting it back in: the vibration tells you when it’s in place properly.",
    "Once you’ve slotted the screen in to the shoe strap, you feed one end of the clip under your laces and secure it via two clasps. Again, it feels sturdy, and never looked like it might come undone. It’s also surprisingly comfortable to wear while running: we never really felt it against our foot, and it was easy to forget it was there at all.",
    "The 15g weight no doubt helps - it’s one of the lightest fitness trackers on the market. It’s not exactly slimline, and is thick enough to protrude a fair distance from your wrist, but not to the point that it looks silly.",
    "The shoe strap looks purely functional, which is all you want from something attached to your foot. The wrist strap, however, is more stylish, and comes in six possible colors. The patterns look chaotic in an organic, natural sort of way, and that reflects the material it’s made from: recycled plastic bottles.",
    "Honor calls the device its first “entirely eco-friendly product”, and hopefully that points to a future direction of travel. Call it a marketing gimmick if you want, but it’s certainly good for the environment. It dealt surprisingly well with sweat, too, and never chafed during exercise.",
    "The Honor Band 5 Sport’s display is as basic as it gets: a 48 x 88 LED black and white screen. It’s just about big enough to tell you what you need to know.",
    "As you tap the touch button to cycle through various stats such as steps, calories burnt and time slept, each has a distinct icon that’s easy to recognize at a glance.",
    "You can set the screen to wake up when you lift your wrist, which tells you the time, date and battery remaining, and you can also tell it to cycle through stats by rotating your wrist. Both worked consistently: even raising our wrist very slowly and titling it ever-so-slightly yielded the desired response."
  ],
  "headers": {
    "6": "Design",
    "14": "Screen"
  },
  "links": {
    "Honor Band 5": "https://www.techradar.com/reviews/honor-band-5-review"
  }
}