{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-book-flex-2020",
  "title": "Samsung Galaxy Book Flex 2020 review",
  "category": "computing",
  "updated": "2020-05-04T12:00:00Z",
  "author": "bill-thomas",
  "summary": "Flying too close to the sun",
  "verdict": "The Samsung Galaxy Book Flex is a device with a lot of potential – a gorgeous display and excellent battery life would make it a desirable device. But a few odd design choices make it hard to recommend.",
  "pros": [
    "Lovely display",
    "Beautiful finish",
    "Built-in Qi charger",
    "Included stylus"
  ],
  "cons": [
    "Bad fingerprint scanner placement",
    "Loose hinge",
    "So-so audio quality",
    "Expensive"
  ],
  "article": [
    "A beautiful 2-in-1 laptop like the Galaxy Book Flex seems like a natural thing to expect from a company like Samsung. Its phones are renowned around the world for having big, beautiful screens that are a joy to consume content through – not to mention their fantastic 4K TVs.",
    "The Samsung Galaxy Book Flex does retain some of that legacy in its gorgeous 15.6-inch 1080p QLED display with some of the smallest bezels we've seen in this kind of device – short of something like the Dell XPS 13 2-in-1. However there are some strange design choices that really hold this laptop back from living up to that Samsung potential.",
    "If you want to get your hands on this device, there's only one model, which changes depending on where you live. In the US, you're getting the Intel Core i7-1065G7 with integrated graphics, 12GB of RAM and a 512GB SSD, which will set you back $1,399 (about £1,120, AU$2,180). You may have noticed that's not the model listed to the right, and that's because we got the international version for review. We've reached out to Samsung to get pricing for this model, and we'll update this review when we hear back.",
    "Right out of the gate, one of the biggest issues is that the shift key gets cut in half to make way for the fingerprint sensor. While it's great that this laptop does have a fingerprint sensor – you can never have too much security – we are constantly hitting that instead of the shift button. We kind of do a lot of typing, and working on this laptop is kind of a nightmare. However, this is something that you would probably get used to over time – but it will take some adjustment if you're a touch typist.",
    "Otherwise the keyboard is genuinely great. The chiclet keys feel nice and crisp with nice spacing for the main part of the laptop. This unfortunately doesn't extend to the num pad, which is so narrow that it may have even been better to leave it off. Though, there are plenty of folks that live for num pads on a keyboard, so we'll chalk that one up to personal preference.",
    "We also genuinely love that Samsung put the speakers on the side of the laptop, rather than having them on the bottom. Sound quality still isn't quite on the level of a MacBook Pro, but it's good enough to watch some Netflix on your lunch break.",
    "This is good because you're going to want to watch Netflix on this laptop. While this panel is only 1080p, it's still one of the most colorful and bright displays we've ever used. We're still using this laptop to watch shows in bed.",
    "And while the display is genuinely amazing, there's one critical error – the hinge. We are actually able to grip the laptop by the base, and gently wobble it back and forth for a bit in order to get the Samsung Galaxy Book Flex into tablet mode without even having to touch the top of the device. This sounds like a cool trick, but when you're just trying to get some writing done with the device in your lap, the screen wobbles quite a bit.",
    "This wouldn't be such a huge deal if it wasn't such a big laptop. If it was a super lightweight 13-inch laptop, it could be argued that the device is simply designed to be used as a tablet. With this hulking 15.6-inch display, though, it's not exactly something you're going to be using as a tablet a majority of a time.",
    "It's a shame because otherwise the Galaxy Book Flex really is a pretty laptop. It has this gorgeous Royal Blue finish that will make it an easy choice for anyone that wants to show off their laptop. Plus, it has this little pen dock built into the side of the laptop that houses the – luckily included – S Pen.",
    "We're no artists, so we can't really speak to whether or not the pen is actually any good, but it feels smooth enough. Beyond that, ports are kind of limited, with two Thunderbolt 3 ports, a USB 3.2 Type-C and a slot for a SIM card. That we also weren't able to test – we're pretty much stuck indoors.",
    "One especially cool feature here though, is that there's a Qi wireless charger built into the touch pad. Now, we probably would never use this, as this editor is a touch pad addict, but if you're primarily using an external mouse, you can wirelessly charge your phone on your laptop while you use it.",
    "Performance is top-notch, though we should mention that the Nvidia GeForce MX250 found in the unit we reviewed here isn't available in the US. Still, the laptop was able to get a solid 1,722 points in Cinebench R20 and 4,720 in Geekbench 5 – both are about what you can expect for a laptop with an Ice Lake Core i7 processor.",
    "And, if you're worried that the lack of an Nvidia GeForce MX250 really cripples the device, you shouldn't. Compared to the most recent Dell XPS 13, which we reviewed with the same processor, the Galaxy Book Flex is only around 30% faster in 3DMark Time Spy. That might sound like a lot, but when the GPU is a whopping 80% slower than the RTX 2060 found in the Asus Zephyrus G14 – you're not exactly going to be playing games on this laptop either way.",
    "Battery life is also a highlight here. In our movie test, where we play a video at 1080p on loop until the laptop runs out of juice, the Galaxy Book Flex beats out the Dell XPS 13, coming in at 9 hours and 47 minutes – and that's with a bigger display and everything. And with a PCMark 10 battery score of 10 hours and 43 minutes, this is definitely a device you can work on all day – if you can cope with the loose hinge and tiny Right Shift key, of course.",
    "Then there's all the added software. Beyond the inclusion of a McAffee trial – which we wish laptop manufacturers would just stop doing – most of the software is usually not running in the background. But there's still a lot of weird additions. Samsung includes the WildTangent Games app, which we haven't seen in a laptop in like 5 years, along with an Amazon app and a Booking.com app.",
    "These apps almost definitely help subsidize the cost of this device, but we typically like to have as little software as possible when we start up a device for the first time, especially if it costs as much as the Galaxy Book Flex."
  ],
  "headers": {
    "0": "Two minute review",
    "17": "Don't buy it if..."
  },
  "links": {
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Dell XPS 13 2-in-1": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2019",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-2020",
    "Asus Zephyrus G14": "https://www.techradar.com/reviews/asus-zephyrus-g14"
  }
}