{
  "source": "https://www.techradar.com/reviews/tresorit",
  "title": "Tresorit cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T14:38:20Z",
  "author": "mark-pickavance",
  "summary": "Tresorit is a Swiss cloud storage system that runs like clockwork",
  "verdict": "While Tresorit isn't as comprehensive or as feature-packed as some of its competitors, it does excel in its encryption protocols, and in the quality of its client software. Just make sure Tresorit has all the tools and options you're going to need before signing up.",
  "pros": [
    "End-to-end encryption",
    "Neat, intuitive apps",
    "Solid connection speeds"
  ],
  "cons": [
    "Relatively expensive",
    "Few add-ons/extras"
  ],
  "article": [
    "Swiss-based Tresorit focuses on two key aspects with its cloud storage service: security and simplicity. It sits on your computers and your mobile devices, syncing files to and from the cloud, and enabling you to share files and folders with other people when needed.",
    "It's a lot like services such as Dropbox or SugarSync in the way that it operates, but its clean user interface and its emphasis on keeping your files protected (it offers end-to-end encryption everywhere) make it worth considering whatever requirements you've got.",
    "End-to-end encryption is one of the key features offered by Tresorit, which we'll talk a little bit more about in the security section below. As for core functionality, the client software essentially lets you sync any file or folder from your computer or mobile device to the cloud and back, under the limits set by the type of account you're using.",
    "You can also create specific 'tresors' inside the apps: collections of files and folders that you wish to organize, share and distribute as one. It gives you a bit more flexibility if you don't want to stick to the exact folder structure that already exists on your computer, but to be honest, we can't imagine using it very much. Your mileage may vary.",
    "Data from networked drives and NAS drives can be included in your cloud backups, if needed, and there's also support for file versioning: that means you can roll back to older versions of files rather than the latest versions, if you have to. When it comes to sharing files and folders, you have the option to add expiry dates and passwords to the generated links, for extra security and privacy.",
    "While you can sync files between multiple people and multiple devices—so everyone is always working off the latest versions—there's no live in-app collaboration here, like you get in alternatives such as Dropbox and Google Drive. While Tresorit might not have as many bells and whistles as these rivals, it covers the core functions very well indeed.",
    "The interface sported by the various Tresorit apps is certainly one of the strong points of the service. The apps are clean, tidy and modern-looking, and you won't have any problems finding your way around them (the guided tour that you get when you first open up the client apps certainly helps).",
    "Upload and download speeds were both perfectly respectable during our testing, and are likely to depend more on the quality of your home or office internet connection rather than anything at the Tresorit end. We're pleased to see the ability to throttle bandwidth use in the client apps, in order to avoid overwhelming your web connection, which is something other services offer too.",
    "The mobile apps are perhaps even more intuitive to use than the desktop programs, and there's definitely a Dropbox-style vibe here. Files can be accessed quickly and simply, and shared with just a few taps. If you need yet another app to automatically upload your mobile photos and videos to the cloud, then the apps for Android and iOS are able to do this for you too.",
    "It's a similar story on the web—everything is simple and plain, but easy to find and functional. A few more options would be welcome (like the ability to stream media files directly from the web interface), but overall we can't have too many complaints. If you want, files can be kept exclusively on the web rather than being synced to one or more of your devices.",
    "End-to-end encryption is one of the flagship features of Tresorit, with all files and metadata protected using randomly generated encryption keys that never travel in an unencrypted form. As an extra level of protection, Tresorit clients apply a Message Authentication Code (MAC) to the content of each file, and this code is held only by the client and those the file is shared, but not kept by Tresorit.",
    "Decryption is only possible with a user’s unique decryption key: even Tresorit staff can't access your files. This 'blind' or 'zero knowledge' approach has the advantage that neither hackers nor law enforcement can access your files; but if you should forget your key, it's gone forever. Two-factor authentication is included as well, for extra account protection.",
    "Tresorit has pricing both for individuals and for teams as well as a free offering called Basic with 5 GB storage. For the full cloud storage, after a 14-day free trial, you'll need to pay $12.50/£8 a month for 500GB of room and support for 5 devices, or $30/£20 a month for 2.5TB of room and support for 10 devices. If you pay for a year at a time, the equivalent monthly rate is 20 percent lower.",
    "On the business side, your options are $15/£10 per user per month, $25/£15 per user per month, or $30/£30 per user per month, depending on how many users you need. Every user gets 1TB of cloud storage space and can use Tresorit from up to 10 devices. Again, the monthly price is less if you pay a year at a time, and a 14-day trial is available. While you could enter your payment details when signing up, there is also the option not to do so.",
    "On the plus side, Tresorit is a very secure, very fast, very reliable service, with apps that are a breeze to use. Its backup services are flexible and sophisticated, with the option to create custom groups of files and folders outside of the folder structure of your main computer. Meanwhile, the end-to-end encryption and security measures are top notch – there's nowhere safer to put your data.",
    "That said, Tresorit is on the relatively expensive side for the amount of cloud storage you get, puts limits on the number of devices you can use, and doesn't come with some of the extras (like collaboration tools) that its rivals do. We came away impressed, but it's not going to be the best cloud storage solution for everyone and every business."
  ],
  "headers": {
    "2": "Tresorit features",
    "6": "Tresorit interface",
    "10": "Tresorit security",
    "12": "Tresorit pricing",
    "14": "Tresorit verdict"
  },
  "links": {
    "Tresorit": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1221722732763662000&xs=1&url=https%3A%2F%2Ftresorit.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Ftresorit",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "SugarSync": "https://www.techradar.com/reviews/sugarsync"
  }
}