{
  "source": "https://www.techradar.com/reviews/taxslayer-pro",
  "title": "TaxSlayer Pro review",
  "category": "computing",
  "updated": "2020-09-17T13:16:21Z",
  "author": "rob-clymo",
  "summary": "Get to grips with accounting using TaxSlayer Pro",
  "verdict": "TaxSlayer Pro is perfect for accounting professionals with desktop editions to suit more conventional workers, plus a bumper cloud-based web package that lets you get the job done no matter where you’re located.",
  "pros": [
    "Premium features",
    "Try for free option",
    "Excellent app",
    "Cloud and desktop editions"
  ],
  "cons": [
    "Not for personal tax returns",
    "Expensive",
    "Aimed more at tax pros"
  ],
  "article": [
    "TaxSlayer Pro is aimed at tax professionals who need to handle the accounts of others, including individuals and freelancers along with small and medium-sized business owners too. A step up from the regular and very popular TaxSlayer cloud-based software, this is a package that comes armed to the teeth with all of the tools needed to get professional accounting chores done. It's proving especially useful in the wake of the coronavirus pandemic.",
    "TaxSlayer Pro is also cloud-based in its Web edition, which means it can be accessed and used from anywhere with an internet connection. Similarly, the accompanying app is aimed at helping tax professionals keep on tops of their clients accounts even when they're on the move. If you're not a tax pro then TaxAct, Jackson Hewitt Online, Credit Karma Tax and FreeTaxUSA are all worth a look instead.",
    "While it’s hardly a budget option you’ll find that any one of the three different TaxSlayer Pro options comes bundled with a mountain of features, all designed with efficiency in mind.",
    "The current range starts out with a Web edition, priced at $1395. That’s closely followed by a $1495 Premium package while there’s also a seemingly budget-based package that costs $1195 and both of these are more conventional desktop-based editions.",
    "The latter model is a little lighter on features, which are detailed below, but it’s a good bet if you need pro-level tools but want to save a few dollars getting into that arena. Interestingly, all three bundles allow you to try them for free, which is an obvious benefit if you’re looking to spend quite a lot of money.",
    "Considering the three different pricing tiers outlined above, if you pick over the features of each package then there’s not too much that seems to differentiate them from each other.",
    "Similarly, the price difference between this trio of cloud and desktop-based software options is pretty nominal when you consider just what sort of return on investment you can expect to get.",
    "The Web bundle fair bristles with features including: unlimited 1040 program options, comprehensive bank product solutions, a TaxesToGo mobile app, free unlimited e-filing, an all States included feature, unlimited support, a refund estimator tool, multiple user access, web bank integration, cloud-based reporting, paperless office functionality, a client portal, digital signature compatibility and a Tax Status Now feature.",
    "TaxSlayer Pro is aimed at the accounting professional and, as such, the cloud-based software and mobile app Web combination has been honed to work without hassle.",
    "The Premium and Classic editions are a little more old school and perform as you'd expect for desktop-based packages. If you’re looking for the most up-to-date feature set and functionality though then it’s the Web edition that will perform best out of the three, especially because of the cloud-based nature of its structure.",
    "But it’s also thanks to practical features, such as the digital signature compatibility that will help speed up your workflow no matter where you happen to be based.",
    "Considering that it’s aimed squarely at tax professionals you’ll need to be prepared for the quite complex functionality of TaxSlayer Pro. Given that it comes packed with lots more functionality than many cheaper ‘Lite’-style accounting software the learning curve is therefore steeper.",
    "However, if you’re already working within the professional tax and accounting space then much of what you encounter along the way is fairly routine. TaxSlayer Pro has been well put together too, and the quality reflects the reason why this is such a premium-priced product.",
    "Fans of traditional desktop software will find the Premium and Classic editions offer many familiar workspace tools and functions, but on-the-go professionals will definitely prefer the more dynamic Web edition with its accompanying app.",
    "With heavyweight tax and accounting software packages that come with a premium price tag it only seems reasonable that TaxSlayer Pro should have a hefty level of support on tap. Unsurprisingly then you’ll find there are plenty of resources to choose from if you're in the position of needing help or guidance.",
    "There’s a whole online support hub for starters, which includes a support blog plus the options for contact support via email or raising a support ticket. You’ll also find help videos in this area, plus a raft of system requirement facts and figures. All of this will prove useful if you’re struggling with some of the more basic installation issues that can often occur when you start using a new package.",
    "Interestingly, the latter also has a list of Windows editions that you should not attempt to run TaxSlayer Pro on, as well as flagging that it’s not compatible with Mac computers. There are numbers for phone support too, with hours varying between Tax Season and Off Season periods. Either way, these generally cover regular business hours.",
    "TaxSlayer Pro has so many features and such a powerful array of tools that it’ll probably be too much to handle if you're a non-professional. Conversely, if you're looking to tackle the business accounts of others and need a range of options to deal with all kinds of clients then one of the three TaxSlayer Pro options will certainly suffice.",
    "The Web bundle has the obvious advantage of featuring all of the different tools for getting the job done, and enjoys the benefit of the TaxesToGo mobile app too, but the desktop packages are equally as well-stocked when it comes to tackling tax filing duties.",
    "You’ll pay a premium price for the privilege, but once you start to explore the TaxSlayer Pro interface you’ll soon start to see where the investment has been made. This is no ordinary accounting software package."
  ],
  "headers": {
    "2": "Pricing",
    "5": "Features",
    "8": "Performance",
    "11": "Ease of use",
    "14": "Support",
    "17": "Final verdict"
  },
  "links": {
    "TaxSlayer Pro": "https://www.taxslayerpro.com",
    "tax professionals": "https://www.techradar.com/best/best-tax-software",
    "accounts": "https://www.techradar.com/best/accounting-software-small-business",
    "TaxSlayer": "https://www.techradar.com/reviews/taxslayer",
    "TaxAct": "https://www.techradar.com/reviews/taxact",
    "Jackson Hewitt Online": "https://www.techradar.com/reviews/jackson-hewitt-online",
    "Credit Karma Tax": "https://www.techradar.com/reviews/credit-karma-tax",
    "FreeTaxUSA": "https://www.techradar.com/reviews/freetaxusa",
    "non-professional": "https://www.techradar.com/best/small-business-tax-software",
    "tax filing": "https://www.techradar.com/best/small-business-tax-software",
    "accounting software": "https://www.techradar.com/how-to/the-best-alternatives-to-quickbooks-accounting-software"
  }
}