{
  "source": "https://www.techradar.com/reviews/ukit",
  "title": "uKit website builder review",
  "category": "computing",
  "updated": "2020-11-30T03:24:07Z",
  "author": "mike-williams",
  "summary": "uKit is a website builder designed for small businesses",
  "verdict": "uKit is a website builder that allows you to sell your products online and share your ideas with the world. You can try any of the plans for free (for up to 14 days) and all plans include unlimited storage space. You might want to test out the templates and see if uKit is right for you.",
  "pros": [
    "Low prices",
    "Supports multiple websites",
    "Capable, easy-to-use editor",
    "Imports Facebook images, posts"
  ],
  "cons": [
    "Limited blog",
    "Not very special web store features"
  ],
  "article": [
    "uKit is an easy-to-use drag-and-drop website builder from Moscow-based Ucoz Media. The service delivers all the core features you'd expect from a website builder, including responsive templates, drag-and-drop content sections and page elements, a blogging system, web store and integration with a scattering of web apps and services (Ecwid, MailChimp, LiveChat, LiveAgent, SlideShare, and more).",
    "These features don't always have the power you'll see elsewhere, and for instance the blog and web store are more suitable for novices and home users than demanding businesses. But uKit recognizes this in its low prices, which offer some real value.",
    "You can test any of the uKit plans free for 14 days before deciding on selecting a paid plan. If you decide to use the free trial, you can test any of the plans and see how you like the templates (there’s over 350 to choose from). Here’s a quick summary of the four website builder plans on the website:",
    "The Minimal plan costs as low as $2.50 per month when you sign up for the two-year plan. It includes unlimited website storage space, unlimited domains, and access to website statistics.",
    "The Basic plan costs $5.00 per month when you sign up for two-years. This plan includes Google Analytics, live chat support, and a dynamic text feature. This plan works great if you want a little additional help with your website.",
    "The eCommerce plan is only $6.00 per month (again, when you select the two-year plan). It includes everything in the Basic plan plus the ability to sell your own items.",
    "The Pro plan is $7.50 per month for the two-year subscription. This plan includes ecommerce, a custom coding feature, and custom color schemes. If you want to make a website that’s more personalized and creative, then this plan is the way to go.",
    "The interface is very easy to navigate and also not as “uptight” as other website builders. It becomes redundant when web hosts ask for name, address, phone number and everything else when you sign up to their service. It's good to see uKit taking a more relaxed approach. Enter your email address, password, and the website immediately logs you in and kicks off the setup process. It couldn't be easier.",
    "Website building starts by choosing a template. At first glance it seems there's a lot to choose from, but then you realize many of them are near identical layouts with different background photos. Still, there's enough to get by, including a selection of simple one-page sites, and we were able to preview and choose a good-looking example within a couple of minutes. If you change your mind, later, you can switch to another template without losing your content.",
    "The setup wizard continued by prompting us for our business name, address, email, phone number, Skype name and social media links. This is used to automatically populate the various Contact fields on each template, but you can skip the step if you're not interested.",
    "The uKit editor has a good-looking, clean and simple design which neatly organizes its many tools and options in a single left-hand sidebar. Page management, side building, colors, fonts, site backups and more, are all just a click or two away.",
    "The bulk of the screen is used to preview the current page. Hovering your mouse over a page element displays a mini-toolbar telling you what it is, and listing actions you can perform on it, and left-clicking an item tells you more.",
    "uKit pages are built from content blocks as well as individual page elements, so exploring the various toolbars reveals plenty of options. You can edit and reformat text, replace images, change background images, adjust block layouts, duplicate a block, copy it to another page, and more.",
    "You can drag and drop most page elements within a block, but these can only be moved to approved positions (to the left of one object, above or below another.) Still, it gives you some flexibility, and the editor does a decent job of showing you where these drop points can be.",
    "The current page is initially displayed in its desktop layout, but you can switch to tablet or mobile views in a click or two. Page blocks can be selectively hidden in the current view, and a few options are view-specific. You can set a complex high-res background for the desktop, for instance, but use something smaller and simpler for mobiles, hopefully speeding up load times.",
    "With so many website builders out there (Odoo, Dreamhost, and Voog) you might wonder what’s different about uKit. First, plans come with unlimited storage space (which is rare for most all website builders). The plans are also affordable with the lowest plan starting at $5.00 per month. uKit also has a promotional tool built in to help you determine if your website is ready to market to a larger audience. This built-in wizard helps you find ways to improve your website’s SEO and help your monthly traffic increase.",
    "uKit is a good website builder for anyone looking for an affordable way to promote their business. You can add ecommerce tools, use the blogging tool, and even improve your website’s SEO with the promotional tools. The great thing about uKit is you can try any of the plans free for up to 14 days.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Interface",
    "10": "Features",
    "15": "The competition",
    "16": "Final thoughts"
  },
  "links": {
    "uKit": "https://ukit.com/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Ecwid": "https://www.techradar.com/best/best-shopping-cart-software",
    "MailChimp": "https://www.techradar.com/reviews/mailchimp-website-builder",
    "LiveChat": "https://www.techradar.com/reviews/livechat",
    "LiveAgent": "https://www.techradar.com/reviews/liveagent",
    "SlideShare": "https://www.techradar.com/news/world-of-tech/roundup/linkedin-to-buy-slideshare-1079032",
    "free for 14 days": "https://ukit.com/pricing",
    "Minimal plan": "https://ukit.com/pricing",
    "Basic plan": "https://ukit.com/pricing",
    "eCommerce plan": "https://ukit.com/pricing",
    "Pro plan": "https://ukit.com/pricing",
    "Odoo": "https://www.techradar.com/reviews/odoo-website-builder",
    "Dreamhost": "https://www.techradar.com/reviews/dreamhost-website-builder",
    "Voog": "https://www.techradar.com/reviews/voog"
  }
}