{
  "source": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
  "title": "Nvidia Geforce RTX 2060 Super review",
  "category": "components",
  "updated": "2020-09-21T18:34:49Z",
  "author": "jackie-thomas",
  "summary": "The best graphics card for most people?",
  "verdict": "The Nvidia GeForce RTX 2060 Super, according to Nvidia, offers the same level of performance as the RTX 2070 at a much lower price, which makes it a no-brainer for anyone that loves performance and saving cash.",
  "pros": [
    "Excellent 1440p performance",
    "Shiny new card design",
    "Affordable"
  ],
  "cons": [
    "Can't handle 4K gaming",
    "Founders Edition is heavy"
  ],
  "article": [
    "The Nvidia GeForce RTX 2060 Super couldn't have come at a better time. While its predecessor, the Nvidia GeForce RTX 2060, gave us our first real look at what ray tracing is capable of and allowed the more budget-conscious gamers out there access to its wonders, it still limited consumers to 1080p gaming.",
    "The refresh of the 2000 series produced the Supers including the Nvidia GeForce RTX 2060 Super. A card more in line with the RTX 2070 performance-wise than its predecessor, it essentially took what the 2060 had to offer and gave it more power. Better yet, it packs in a ton of performance for a smaller fee than its vanilla predecessor.",
    "So, even in the impending shadow of the RTX 3070, which has just been launched at the Nvidia’s September 1 event, the Nvidia GeForce RXT 2060 Super is still, for most users, the best graphics card available. It hits that sweet spot between performance and value that you don’t get in most other GPUs.",
    "The Nvidia GeForce RTX 2060 Super reached store shelves on July 9, and is selling for a cool $399 (about £315, AU$580) for the Founders Edition. There’s limited availability for third party cards right now, so pricing is around the same $400 mark. With time however, those prices will hopefully drop.",
    "You may have noticed that this fits in exactly where the Founders Edition of the vanilla RTX 2060 was, and there's a reason for that. Nvidia is lowering the price of the original RTX 2060 Founders Edition down to $349 (about £275, AU$500), allowing entry into Nvidia's ray traced vision for even cheaper.",
    "The most important thing to note here is that Nvidia claims that the RTX 2060 Super is able to come within striking distance of the original RTX 2070's performance – it even wins in some of our synthetic workloads.",
    "Still, we can’t forget the other team here. The AMD Radeon RX 5700 XT goes for the same price of $399 (about £315, AU$580), and delivers equivalent performance in most tests. The RTX 2060 Super does have one leg up on Team Red however – via those RT cores, the RTX 2060 Super supports ray tracing, whereas the RX 5700XT does not.",
    "The Nvidia GeForce RTX 2060 Super utilizes the same, cutting edge Turing architecture as its predecessor, but it comes loaded with plenty of improvements, particularly when it comes to core counts and VRAM.",
    "The Nvidia GeForce RTX 2060 Super features 2,176 CUDA cores, compared to the RTX 2060's 1,920. They are also clocked higher, featuring a boost clock of 1,650 MHz. These improvements alone help explain the boost to 7.2 TFLOPs of raw power. The graphics card now features more RT cores, too – up to 34 from 30 – so the RTX 2060 Super is now capable of pushing out 6 Giga Rays/s of ray tracing performance.",
    "What's more, the Nvidia GeForce RTX 2060 Super features 8GB of GDDR6 VRAM, up from the original model’s 6GB. This should future-proof the graphics card, as well as make it more feasible for 1440p gaming. This all comes with a bump in power consumption, however, with the new Turing card consuming 175 Watts of power.",
    "Physically, however, the card looks extraordinarily similar to the Nvidia GeForce RTX 2060 Founders Edition. However, the RTX 2060 Super Founders Edition has a chrome design under the logo, making it more reflective. While it’s most likely to only appeal to those with a see-through case, it is a welcome design uptick.",
    "Thanks to the boosted specs, the Nvidia GeForce RTX 2060 Super should be the card to get if you want to play at 1440p with ray tracing enabled. We put it through a litany of benchmarks, and it is easily one of the graphics cards to watch in 2019.",
    "Metro Exodus, one of the most hardware intensive PC games out there, is extremely smooth at 1440p, with all the graphical settings dialed up to Ultra. Even with ray tracing and DLSS enabled, we are still able to get a playable experience – even if it wasn't locked at 60 frames per second (fps).",
    "Similarly, we’re able to turn all the settings up in Shadow of the Tomb Raider, and are amazed – there are no performance fumbles during the game’s intro.",
    "This is all reflected in our benchmark results, too. In 3DMark TimeSpy Extreme, for instance, the Nvidia GeForce RTX 2060 Super gets a whopping 4,277 points, a huge 21% jump over the original 2060. But, what's really cool is that the Nvidia GeForce RTX 2060 Super did better than the RTX 2070, too – as that card scores 4,117.",
    "In games, the performance gap between the RTX 2060 Super and the original model is even more stark. In Metro Exodus, we were able to get 58 fps vs 53 on the RTX 2060.",
    "At the end of the day, the Nvidia GeForce RTX 2060 Super is able to handle most games at 1440p with aplomb. This graphics card is definitely worth your time, especially if you're rocking a G-Sync monitor.",
    "The Nvidia GeForce RTX 2060 Super might be the Nvidia graphics card for most PC gamers to get. It's not overly expensive, and it will let you tackle most games at 1440p without much – if any – loss in detail. Plus, with the newly expanded 8GB frame buffer, this graphics card should have a much longer life in your pc.",
    "It's also much more affordable than the RTX 2070 was at launch, and because the Nvidia GeForce RTX 2060 Super offers just about the same level of performance, the value speaks for itself. We're just left wondering why Nvidia didn't release this card sooner – we finally have the value-oriented Nvidia Turing graphics card."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Features and chipset",
    "11": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "Nvidia GeForce RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Nvidia’s September 1 event": "https://www.techradar.com/how-to/how-to-watch-the-nvidia-geforce-rtx-3080-launch-event-online",
    "best graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 2070'": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "AMD Radeon RX 5700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-5700-xt",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot",
    "G-Sync monitor": "https://www.techradar.com/news/computing-components/graphics-cards/nvidia-g-sync-vs-amd-freesync-1289637"
  }
}