{
  "source": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
  "title": "Ribble Hybrid AL e review",
  "category": "fitness",
  "updated": "2020-07-20T14:42:56.128Z",
  "author": "cat-ellis",
  "summary": "The Ribble Hybrid AL e is much more than just a pretty frame",
  "verdict": "If you've been considering investing in an electric bike, the Ribble Hybrid AL e has a lot going for it. It offers a smooth ride that irons out the bumps in your journey so you can enjoy the ride and arrive fresh, it looks fantastic, and it's surprisingly reasonably priced.",
  "pros": [
    "Smart design",
    "Smooth power-assisted ride",
    "Surprisingly affordable"
  ],
  "cons": [
    "App needs some work"
  ],
  "article": [
    "The Ribble Hybrid AL e is an electric bike that's a joy to ride, ironing out the bumps in your journey and taking the sweat out of your everyday commute, shopping trips or weekend joyrides. The motor is almost silent, and the ride is super smooth, so you can enjoy the journey and arrive at your destination feeling fresh.",
    "It's one of the most stylish e-bikes on the market too, with a design that takes its cues from classic city bikes and only betrays its electric nature with a slightly chunkier than average downtube and a single discreet button on the top tube. Other than that, it could be easily mistaken for a regular smart city hybrid.",
    "It's surprising, then, that this is also one of the most affordable e-bikes around (cheaper ones do exist, but not this well built), and although it might not pack the same raw power as more expensive pedelecs, the Hybrid AL e still has plenty of power to take the grunt out of undulating routes.",
    "Spend some time perfecting it in Ribble's Bike Builder, and you can create your perfect e-bike for a very reasonable price.",
    "Released in April 2020, the Ribble Hybrid AL e Standard Edition starts at £1,999 (about $2,500, AU$3,600), while the Fully Loaded Edition (with a pannier rack, mudguards, bell and USB lights) starts at £2,099 (about $2,600, AU$3,800).",
    "Bottle cages, child seats, toeclip pedals and other add-ons are available for an additional fee through Ribble’s Bike Builder menus, letting you create a setup that meets your exact needs, whether you need a bike to take the sweat out of your daily commute or something for weekend fun.",
    "The Ribble Hybrid AL e is one of the smartest electric bikes around today, and could easily pass as a regular city bike at first glance, with only a slightly chunkier than average downtube and a discreet power button on the top tube betraying its nature.",
    "There are four frame sizes to suit heights from 5’4” to 6’4”, with a relatively short reach that gives a fairly upright riding position.",
    "The frame is available in Petrol Blue (as seen here) and Copper as standard, but custom paint colors are available through the Bike Builder. Our review model also featured mudguards and a pannier rack, but not the LED lights found on the Fully Loaded Edition.",
    "With its aluminum frame, carbon forks and feather-light drive system (a mere 3.5kg), the Ribble Hybrid AL e tips the scales at just 14.5kg, making it easy to lift upstairs or onto public transport.",
    "Our review model was supplied with a comfortable women’s Selle Royal Vivo Trekking Saddle, but there’s a wide range of other options available through Ribble’s Bike Builder (leather and synthetic, women’s and unisex, brown and black).",
    "The review bike was also fitted with large rubber grips, which are comfortable but won’t be to everyone’s liking. The default option in Ribble’s Bike Builder is a more road-style design in faux leather.",
    "The bars are on the wider side, which gives plenty of stability. Some riders may find them a little too broad for narrow city routes, but they're typical for a hybrid.",
    "The Ribble Hybrid AL e is a joy to ride. Its motor is whisper-quiet, with only the faintest whirr betraying the presence of a motor as it effectively irons out your route, providing 250 watts of power to supplements your pedalling.",
    "Riding with the power off is thoroughly enjoyable too, and the Shimano hydraulic disc brakes are reassuringly firm (bikes below this price level are typically supplied with rim or V-brakes).",
    "The ride is super smooth, with three power modes to choose from, all accessible via the bike’s single button. One tap shows your current power level (green for level one, orange for two, and red for three), and a second tap will switch to the next one. We must admit, the top level is the most fun.",
    "If your bike is fitted with lights, these can also be controlled through the button – a short press followed by a long one will turn the button’s color to yellow, indicating that they’re fully illuminated.",
    "As a hybrid, the AL e is capable of tackling roads and taking on some gentle trail action, though we’d avoid anything that’s likely to get it absolutely filthy. The bike has an IPS rating of five, which means it’s resistant to splashes (so the odd ride through a puddle won’t be an issue) but you shouldn’t go hosing it down with a pressure washer.",
    "Ribble says that the battery can be fully charged from flat in 3.5 hours, and a full charge lets you ride assisted for up to 60 miles over variable terrain. That seemed to bear out in our tests, with a 10-mile ride (using varying levels of power assistance) draining only a little over 20% of the total charge.",
    "An extender battery is available (neatly disguised as a water bottle), but at £550 (about $700, AU$1,000) it's a big investment.",
    "Like many lightweight electric bikes, the Ribble Hybrid AL e is powered by Mahle’s ebikemotion drive system. This can be connected to the Ebikemotion app (available for Android and iO), effectively turning your phone into a bike computer with GPS navigation. Apps for Google Wear OS and Apple Watch are also available.",
    "Pairing the bike is simple. After installing the app, power the bike on with a tap of the button, then open the app and either create an account or log in using Facebook, and grant it the necessary permissions.",
    "The main screen displays useful data such as assist level, battery level, and your current position, plus handy data including your speed and the weather forecast. Additional maps can be bought and downloaded for offline navigation if you’re planning to stray off the beaten path.",
    "It’s a great concept, and most of the core features work well, but it’s worth bearing in mind that to get the most out of the navigation, you’ll need to subscribe to a map pack for £3.99 (about $5, AU$7) per month. This is a pretty steep price over the course of a year, but it does gives you maps for every city and town in your continent. Perhaps more affordable packs for individual countries might be a more appealing option."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "6": "Design",
    "13": "Performance",
    "24": "Don't buy it if"
  },
  "links": {
    "electric bike": "https://www.techradar.com/best/electric-bike"
  }
}