{
  "source": "https://www.techradar.com/reviews/microsoft-excel",
  "title": "Microsoft Excel review",
  "category": "computing",
  "updated": "2020-11-03T07:44:14Z",
  "author": "richard-sutherland",
  "summary": "A look at the venerable spreadsheet tool in 2020",
  "verdict": "Microsoft Excel remains the top spreadsheet application available today, with a long list of built-in data calculation and visualization tools. But other spreadsheet software aren’t far behind.",
  "pros": [
    "Powerful function set",
    "Good data visualization tools"
  ],
  "cons": [
    "Clunky collaboration",
    "Intimidating interface"
  ],
  "article": [
    "Microsoft Excel has been the world’s most famous spreadsheet software for over three decades. Unlike presentation software, Excel has functions and tools for making calculations and graphs, which mean that you can use it for doing anything from planning a household budget to keeping track of a store’s inventory. In 2016, Microsoft stopped releasing discrete versions of Excel and began automatically updating the program through Windows Update. It’s available as part of the Microsoft 365 subscription model.",
    "In this Microsoft Excel review, we look at where Microsoft Excel stands in the current market and whether it’s still the best spreadsheet software for a small business.",
    "Microsoft Excel is available for Windows, macOS, iOS, and Android. Excel is one software package in the Microsoft 365 suite that includes Microsoft Word, PowerPoint, Outlook, OneNote, OneDrive, and Skype.",
    "You can access a limited online-only version of Microsoft Excel at office.com, though many of the features of the full product are missing. You can’t use SmartArt, WordArt, or macros in the online version, for example. But you can still collaborate with others in real time.",
    "If you’re a teacher, student, or faculty member, you can get Office 365 Education for free simply by signing up using a valid school email address on the Microsoft website.",
    "For full desktop versions of the applications, you can get Microsoft 365 Personal, which costs $69.99/year. A family account for two to six people costs $99.99/year.",
    "Business plans that include all the desktop Office applications start at $12.50/user/month. A $20/month plan adds device management and cyber threat detection, and enterprise versions that add compliance capabilities.",
    "Office Home & Business is available as a one-off purchase that includes the desktop versions of Word, Excel, PowerPoint, and OneNote. The biggest downside with this option is that you don’t get ongoing updates, so you might need to rebuy Office again in the future if there are significant updates. Office Home & Business also doesn’t include the web versions of the software, online file storage, or support for Microsoft Teams meetings.",
    "With Microsoft Excel, you enter and manage data in the form of numbers, text, and graphics in a grid format, as you would with any spreadsheet. But Excel allows you to process more data at a time than competitors like Google Sheets. Whereas Sheets can only handle around 5 million cells, in Excel, you can feasibly work with 17 billion cells. As Excel makes better use of your computer’s processing power, it’s fast even when you are working with large sets of data and performing complex calculations.",
    "Another draw of Excel is its long list of built-in functions. There are over 450 functions for manipulating and displaying data. With macros, you can extend this functionality almost indefinitely by writing your own VBA code. Online spreadsheet software lacks this power and versatility.",
    "Excel has great data visualization tools too. With charts, conditional formatting, pivot tables, pictures, shapes, icons, maps, sparklines, and SmartArt, you can create compelling representations of your data that accurately summarizes your calculations.",
    "Excel’s user interface can be somewhat daunting for new users. So many features have been added over the years that it's hard to know where to start. To combat this, Microsoft has added an interactive Getting Started tour that takes you through creating your first formula, PivotTable, and chart. If you prefer, the ribbon menu at the top of the interface can be hidden so Excel looks a bit more like a web application.",
    "Microsoft has added a few features for co-authoring, but they’re not as streamlined as competitors like Google Sheets, which have online collaboration baked into their DNA. You can see modifications in real time and chat with others within the Excel interface, but only if everyone has a Microsoft 365 subscription. Often, the people you want to collaborate with don’t have the latest version of Excel, so co-authoring doesn’t work.",
    "Microsoft’s website is packed with resources for getting the most from Excel and the other Office applications. There’s an official Excel tech community for complex queries and a community forum. The application itself has hundreds of built-in helpful guides on the software’s features. These include videos that take you step by step through using the features.",
    "Microsoft also has phone and live chat support. Though we had to wait a few minutes to talk to someone via live chat, the support we received was courteous and the agent was knowledgeable.",
    "Google Docs is one of the best alternatives to Microsoft Office, and Google Sheets is a direct competitor to Microsoft Excel. Although there’s a paid version as part of Google Workspace (formerly G Suite), the average user will get by just fine using the free version of Google Sheets. Though it doesn’t have the range of features, functionality, and advanced visualization tools of Microsoft Excel, collaboration is relatively easy and it’s free.",
    "If you prefer a desktop application that you can use offline, LibreOffice is a free Office software suite with a spreadsheet application named LibreOffice Calc. It’s not as polished as Microsoft Excel and doesn’t have support for VBA macros, but it’s powerful enough for most tasks.",
    "If you’re new to spreadsheets, we suggest that you first try the free, limited, online-only version of Microsoft Excel at office.com. This includes most of Excel’s key features. Once familiarized with the software, you may see the benefit of a Microsoft 365 subscription, as it includes the full desktop versions of Excel, Word, and Powerpoint.",
    "Microsoft Excel is an extremely useful tool that’s worth taking the time to learn. Its ubiquitous use in the business world makes it the obvious choice if you need a spreadsheet tool. Though alternatives such as Google Sheets have made some effort to try and close the gap over the past few years, they still can't match the power of Excel."
  ],
  "headers": {
    "2": "Microsoft Excel: Plans and pricing",
    "8": "Microsoft Excel: Features",
    "11": "Microsoft Excel: Interface and in use",
    "13": "Microsoft Excel: Support",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Microsoft Excel": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8924098422182554000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fen%2Fmicrosoft-365%2Fexcel&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmicrosoft-excel",
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "presentation software": "https://www.techradar.com/best/best-presentation-software",
    "Microsoft Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "Office 365 Education for free": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1314427154767966200&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Feducation%2Fproducts%2Foffice",
    "Google Sheets": "https://www.techradar.com/news/google-sheets-vs-microsoft-excel",
    "data visualization tools": "https://www.techradar.com/best/best-data-visualization-tools",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best alternatives to Microsoft Office": "https://www.techradar.com/news/best-microsoft-office-alternative",
    "free Office software": "https://www.techradar.com/best/free-office-software"
  }
}