{
  "source": "https://www.techradar.com/reviews/silicon-power-pc60-960gb-portable-ssd",
  "title": "Silicon Power PC60 960GB portable SSD review",
  "category": "computing",
  "updated": "2020-07-14T13:33:58Z",
  "author": "desire-athow",
  "summary": "An affordable newcomer in a very crowded market",
  "verdict": "The Silicon Power PC60 is bland, unassuming and average in everything except its price. Don’t get me wrong, we like it for what it is, an entry-level, affordable and capable device that is far, far cheaper than the (slower) competition. Oh and there’s 4% extra capacity.",
  "pros": [
    "Reasonably fast",
    "Very small and light",
    "Type-C",
    "Cheapest in its category",
    "1TB, not 960GB",
    "Three year warranty"
  ],
  "cons": [
    "None"
  ],
  "article": [
    "The PC60 from Silicon Power is an entry-level external solid state drive (SSD) with a capacity ranging from 240GB to 1.92TB and while its manufacturer isn’t one of the few vertically integrated vendors that make chips and drives (Kioxia, Samsung, SK Hynix, WDC and Micron), there’s one thing where it trounces everyone else - including the company’s very own Bolt B75 Pro - and that’s pricing. We tested the 960GB version and it retails for $97.99 at Amazon at the time of writing.",
    "The PC60 is eminently small, measuring only 80x80x11mm, making it one of the more compact storage devices we’ve seen to date; and at 46g one of the lightest too. The marketing literature is wax lyrical about the design philosophy: “it fits snugly in the palm of a hand and comfortably slides into a pocket”, it says, before adding “The polished frame accentuates its square shape, while the unique ripple design symbollically (sic) conveys memories like ripples, momentary fluctuations in life that are recorded on to this device.”",
    "All this to say that its surface is made of rubber and won’t slip easily out of your hand, the ripples mentioned here are helpful to a certain extent. There’s a useful keyhole, a white status light that blinks when transferring data and a Type-C USB port.",
    "Yes it is made of plastic but the PC60 is unashamedly entry-level and doesn’t aspire to be anything but. Silicon Power says that it will withstand minor drops and bumps. Don’t try anything too daring though with this build quality. Other than the short cable than came with it, there’s nothing much to write about.",
    "This is a USB 3.2 Gen 2 drive but attached to a SATA device, so Silicon Power unsurprisingly puts the maximum read/write performance of the device at 540/500MBps. We never got to those dizzying heights, the PC60 reached 493MBps and a surprising 504MBps on read and write respectively.",
    "Scores on AJA, ATTO and AS SSD were significantly lower with the real life transfer of a 10GB file taking about 33 seconds to complete; that equals a transfer rate of about 300MBps. That said, the numbers were better than the Integral 1TB or the Seagate One Touch 1TB, two models that we reviewed recently.",
    "One more thing, even if this is a 960GB drive, the formatted capacity of the drive was 954GB, which is what you’d expect from a 1TB drive, like the HP P700 or the Adata SE760. A tiny difference, but in an ultra-competitive market, every little helps.",
    "Note that a free software package is also available for download to provide useful functions such as data backup and restore, syncing, AES 256-bit encryption, and cloud storage for efficient data management. As it is usually the case, we urge people to get a cloud backup (or cloud syncing or cloud storage solution) to protect their data with a provider, perhaps a lifetime option of 1TB or more is likely to be the best option.",
    "At the beginning of this review, we mentioned the fact that the PC60 trounces everyone else when it comes to price. It costs $97.99 at the time of writing at Amazon, that’s $5 more than the cheapest internal drive; if the cheapest price per unit storage is what you’re after, then there’s very little incentive to look elsewhere.",
    "Adata has two storage devices that are good alternatives but at a more expensive price point. The SD600Q and the SC680 are both available from Newegg for just under $100 at the time of writing. The later is particularly enticing for those looking for extra protection as it meets the stringent MIL-STD-810G military standard.",
    "If you’re willing to sacrifice a bit of speed for endurance and robustness, then the Adata SD700 (yes, another one) might be worth a look. It is IP68-rated, so is waterproof, dustproof and shock resistant but has a transfer rate of up to 440MBps. It sports an old school USB cable with flat Type-A connectors and its price, $129.99, will only be attractive if ruggedness at a low price is high on your list.",
    "The fourth and final Adata product worth mentioning is the SE800 which is also IP68-rated, like the SD700 but also offers USB 3.2 Gen 2 with speeds of up to 1GBps, all for $147.99. We tested it and gave it an Editor’s choice badge; we said that it is “absurdly quick, waterproof and not that expensive” and should “be near the top of your list if you are after an external SSD that can deliver what it says on the tin.”",
    "If there ever was a likable external SSD, then the Silicon Power PC60 is the one. Yes, it feels cheap and looks cheap, but it is also extremely affordable, so much so that if your needs are pretty modest, we don’t see any reasons why you should fork out extra for anything else. If you want a more robust storage solution or one which is faster, there are other options available but for bog standard, no-frill, run-of-the-mill experience, nothing, at the time of writing, can beat the PC60.",
    "We would love it if they could partner with a software vendor to provide a cloud storage solution of some sort. We couldn’t find the 2TB/1.92TB version of that drive; given that the cheapest external SSD costs about $300, Silicon Power could very quickly carve a lucrative niche. Last but not least, none of the SSD produced by the Taiwanese company are waterproof or dustproof; IP68 does carry a significant cachet for a big audience out there and Silicon Power has expertise in producing IP68 products as its Armor range lists six hard disk drives."
  ],
  "headers": {
    "1": "Design",
    "4": "Performance",
    "8": "The competition",
    "12": "Final verdict"
  },
  "links": {
    "Bolt B75 Pro": "https://www.techradar.com/reviews/silicon-power-bolt-b75-480gb",
    "$97.99 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB087WRRXXZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6729847533156011000-20",
    "Integral 1TB": "https://www.techradar.com/reviews/integral-memory-960gb-type-c-external-ssd",
    "Seagate One Touch 1TB": "https://www.techradar.com/reviews/seagate-onetouch-1tb-external-ssd",
    "HP P700": "https://www.techradar.com/reviews/hp-p700-1tb-portable-ssd",
    "Adata SE760": "https://www.techradar.com/reviews/adata-se760-external-ssd",
    "free software package": "https://www.silicon-power.com//web/software",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "cloud syncing": "https://www.techradar.com/best/best-file-syncing-solution",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "SD600Q": "https://www.techradar.com/reviews/adata-sd600q-ruggedized-external-ssd",
    "SC680": "https://www.techradar.com/reviews/adata-sc680-480gb-external-ssd",
    "SE800": "https://www.techradar.com/reviews/adata-se800-waterproof-external-ssd",
    "Armor": "https://www.techradar.com/reviews/silicon-power-armor-a85"
  }
}