{
  "source": "https://www.techradar.com/reviews/rapidvpn",
  "title": "RapidVPN review",
  "category": "computing",
  "updated": "2020-07-21T08:01:32Z",
  "author": "mike-williams",
  "summary": "A small VPN with some unusual features - but big problems, too",
  "verdict": "Fine for unblocking Netflix, average to absolutely useless at just about everything else. Don't risk your cash, there are far better VPNs around.",
  "pros": [
    "Unblocks Netflix",
    "Reasonable prices",
    "Dedicated IP plans"
  ],
  "cons": [
    "Very poor Windows app",
    "No iOS, Mac apps",
    "Doesn't unblock Amazon, BBC iPlayer, Disney+",
    "Small network covers US, Europe only"
  ],
  "article": [
    "RapidVPN is a small VPN with a basic feature set, but a wide range of plans and pricing options.",
    "The network offers only 18 locations, and they're not widely distributed: RapidVPN provides 12 in the US, one in Canada and five in Europe (Germany, Netherlands, Sweden, Switzerland, UK.)",
    "P2P is supported, but on the Switzerland and Netherlands locations only.",
    "Protocol support covers OpenVPN, PPTP, L2TP, SSTP and SoftEther (no IKEv2, unfortunately.)",
    "RapidVPN only has apps for Windows and Android (don't be confused by the iOS RapidVPN app, it's a different provider), but the setup page also has configuration instructions for iOS, Mac, Linux, routers, Chromebook and more.",
    "The service supports up to 4 simultaneous connections as standard. You can add more, up to a maximum of 99, but it's expensive at an extra 40% of your base subscription cost per connection. Especially as companies like Surfshark and Windscribe allow unlimited connections at no extra cost.",
    "Support looks limited, at least compared to the best of the rest. There's no web knowledgebase or live chat, and customers are directed to a web form with a quoted response time of 'under 5 hours.' We've seen worse, but ExpressVPN's live chat has never even left us waiting 5 minutes.",
    "RapidVPN may not beat the competition on features, but it tramples all over them for pricing options, with more plans and choices than just about anyone else.",
    "The Dynamic VPN plan is the one you'll probably want, giving you full access to all 18 RapidVPN locations. It's priced from a low $7.20 a month, but you can also subscribe for two months (and it falls to $6.95), three ($6.17), six months ($4.98) or a year ($3.54.)",
    "A Torrent VPN plan only supports one of the Swiss or Netherlands locations, but even lower prices - from $5.90 billed monthly to $2.99 billed annually - could make it interesting, even if you've not the tiniest interest in P2P.",
    "The company offers dedicated IP plans with addresses in Canada, 5 European countries (Germany, Netherlands, Sweden, Switzerland, UK) and 12 US locations (Philadelphia, Boston, Ashburn, Bend, Chicago, Dallas, Denver, Garden City, Las Vegas, Los Angeles, Miami, Phoenix.)",
    "Dedicated IPs are far more likely to get you access to US Netflix or whatever other service you need in your target country, and far less likely to be blocked in future.",
    "Prices vary depending on location, but they're never expensive. US dedicated IPs are priced from $7.90 to $10.50 billed monthly, for instance, while European locations range from a monthly $5.90 to $9.50, and they all have similar subscription options to the other plans (1, 2, 3, 6 and 12 month options, with discounts for longer deals, so a $7.90 a month dedicated US IP costs $4.41 over a year.)",
    "A bonus Trust scheme adds extra days if you don't break RapidVPN's rules (send spam from your account, use torrents on any servers but Switzerland or Netherlands.) For example, if you have no violations at the end of a 6-month subscription, RapidVPN gives you 20 free days.",
    "You can get a dedicated IP for life, nothing more to pay, from $210 (Philadelphia) to $390 (Chicago) in the US and $144 (Switzerland) to $346 (UK) in Europe. Lifetime plans may look appealing, but you have to trust that you'll want to use them for a long, long time. A New York dedicated IP costs $52.90 for a single year, and $356 on the lifetime plan, so you'd have to use it for approaching 7 years before you'd get close to seeing any benefit.",
    "Still, we're happy to see RapidVPN provide the option, and overall, the company offers reasonable prices and a lot of billing flexibility.",
    "Payment options look great, too, with support for card, PayPal, Bitcoin and other cryptocurrencies, Perfect Money, Web Money and more.",
    "RapidVPN no longer adds extra fees for particular payments types, either (the company used to add 5% for cards, 10% for PayPal or Perfect Money, 25% for Bitcoin, 20% for other cryptocurrrencies.) Now, you're only charged the standard price, however you're paying.",
    "There's one remaining gotcha in the '30-day money-back guarantee', though, which looks generous, but doesn't apply if you've transferred more than 400MB data. That'll protect you if you find you can't connect at all, but the tiny data allowance isn't enough to properly check all locations or assess speeds.",
    "RapidVPN's explanation of its logging policy is basic and short on detail. This is as much as we could find: 'We do not keep any logs of your activity. RapidVPN don't collect or share your personal information or track your online activities.'",
    "That's no more than a statement of what you would expect from any VPN: 'we don't save your internet history.' It says nothing about any possible session logging, including recording connection times, your incoming IP address, and the IP you're allocated (perhaps enough of an audit trail to link an internet action back to your account.)",
    "Sometimes a provider's Privacy Policy has more information, but not here. (The above quote was taken from RapidVPN's privacy policy, so this is as detailed as the company is going to get.)",
    "Whatever it says in the small print, we know from RapidVPN's description of its service that there must be some logging going on. Restricting the number of simultaneous connections means the company must track incoming connects, for instance. And to enforce the '400MB' refund limit, it has to be tracking bandwidth used per session.",
    "This type of logging isn't particularly unusual, or harmful, but the real problem here is it's not being disclosed. VPNs need to work to establish their user's trust, and that requires spelling out everything they're doing, in detail, not just using vague promises which don't tell the whole truth.",
    "Buying a RapidVPN subscription began just as we expected. We chose a plan, a subscription length, opted to pay via PayPal and handed over our email address.",
    "But then: a surprise. A 'PayPal Order Account Verification' page asked for the email address associated with our PayPal account, then told us 'Please check your PayPal email address. We just sent you an email with our PayPal address.'",
    "The company can't take payment directly via PayPal? Customers must wait for an invoice, instead? That might be acceptable if you're buying online from a tiny home business run from someone's kitchen, but it doesn't create a very professional impression for everyone else.",
    "It makes the signup process more complicated, too. We quickly realized this as minutes went by with no email from RapidVPN. We had just the same wait during our last review, presumably because someone at RapidVPN has to notice our order, then manually generate and send us the invoice.",
    "After a couple of hours, RapidVPN replied, asked us to manually pay them via PayPal, then email them again, with the receipt, to confirm that we'd paid. We did just that, and 30 minutes later the company emailed us our credentials.",
    "We could have avoided this by paying via card, as RapidVPN can take those payments automatically. We're struggling to see why they can't manage the same with PayPal, though, like just about every other VPN provider in existence. If we're going to trust a company with our most important internet activities, we need it to show extreme competence, not fail at a task as basic as this.",
    "RapidVPN's Windows app installed quickly and with no hassle. A quick look at its files raised a couple of issues, though. It uses an absolutely ancient version of OpenVPN dating back to 2010, probably the oldest we've seen bundled in any modern VPN. And although we didn't explore this in depth, a support file included links to download key configuration files via HTTP, rather than HTTPS. If the app uses those, it increases the opportunity for an attacker to intercept or modify them.",
    "We launched the app and found it looks even more dated than its OpenVPN build, with a text-heavy interface and a number of odd usability issues.",
    "Most VPN apps start in an 'automatic' or 'fastest' mode where it chooses the closest server to you, for instance. RapidVPN started with this turned off, presenting us with a US server by default, even though we're in the UK. And even when we enabled 'Auto Select', it chose a Netherlands server.",
    "The app has an 'auto select' feature for protocol, too, and you might expect this to give you the most secure option. But you'd be wrong. RapidVPN set itself up to use PPTP by default, or when we clicked 'Auto Select', a protocol regarded as so broken that many VPNs stopped supporting it entirely some time ago. (RapidVPN does flag it as having low security, but that's not enough - it should have better chosen default settings.)",
    "The app's connection issues can't match that for importance, but they're far more irritating. We like to see a desktop notification to tell us when we're protected, for instance, but RapidVPN gives us three, one after the other. It then automatically minimizes the client window, annoying if you'd prefer to keep it open to confirm your connection status. Try opening it and you'll find it's this mini VPN widget which just displays basic connection details. Tap the Disconnect button and it gives you two notifications where one would do, and then it takes another extra click to open the full app again.",
    "The app does have some worthwhile functionality, at least. You're able to select your preferred protocol (PPTP, L2TP, SSTP, OpenVPN) from a list; DNS and IPv6 leak protection is built in, and a kill switch blocks all internet access if the VPN drops.",
    "It's good to see a kill switch option, but it's not a firewall-type, system-wide feature. It's an application kill switch only, which means you must tell the app which processes you'd like it to close if the VPN drops (your browser, your torrent client, whatever it might be.)",
    "While this can be useful, it's a hassle to set up and maintain. It leaves you to figure out which processes you must close, for instance (and there's no guarantee you'll be able to shut down all of them.) You must add them all to RapidVPN's list, and it's up to you to add new processes in future.",
    "An application kill switch is still better than none at all. RapidVPN's offering worked for us, too, successfully closing Chrome when we forcibly dropped our connection. But it's not the easiest or most reliable way to keep you safe. And it risks creating a false sense of security. If you're a VPN newbie you might see the words 'kill switch' and assume you're protected, when the reality is it'll do nothing at all unless you set it up properly.",
    "There was better news with RapidVPN's DNS leak protection. This is sensibly turned on by default, and we found the service replaced our regular DNS servers whenever we connected.",
    "The app ended on a small privacy fail, though, when we noticed that it saved our username and password to the Registry, in plain text, fully exposed to snoopers or for harvesting by malware.",
    "RapidVPN doesn't make any big claims about its website unblocking abilities, but the company got off to a good start, with its UK server instantly allowing us into US Netflix.",
    "The company then failed with BBC iPlayer, though. And Amazon Prime Video. And Disney+. That's not great, but RapidVPN's dedicated IP plans should unblock more websites, and have less chance of being blocked themselves later.",
    "To measure performance, we used the benchmarking sites SpeedTest and TestMy to assess download speeds from UK and central European locations.",
    "UK results ranged from 50-60Mbps on our 75Mbps test line. The top VPNs can achieve 66-68Mbps, but you're unlikely to notice any difference, and in general RapidVPN's UK server performed very well.",
    "We tried a second European location capable of more than 300Mbps, but results were little changed at 60-80Mbps.",
    "Still, that's not slow, either, and in both locations RapidVPN managed enough speed to handle most tasks.",
    "RapidVPN is a small VPN with some serious issues and no sign the company quite knows what to do about them. We wouldn't trust the service with anything privacy-critical, and although it could just about work as a cheap Netflix unblocker for a month or two, even that feels like an unnecessary gamble."
  ],
  "headers": {
    "7": "Plans and pricing",
    "19": "Logging",
    "24": "Signing up",
    "30": "Windows app",
    "41": "Performance",
    "47": "Final verdict"
  },
  "links": {
    "RapidVPN": "https://www.rapidvpn.com/dynamic-vpn-ip",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "setup page": "https://www.rapidvpn.com/setup-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Dynamic VPN plan": "https://www.rapidvpn.com/dynamic-vpn-ip",
    "Torrent VPN plan": "https://www.rapidvpn.com/torrent-vpn",
    "dedicated IP plans": "https://www.rapidvpn.com/vpn",
    "Trust scheme": "https://www.rapidvpn.com/trust-point",
    "dedicated IP for life": "https://www.rapidvpn.com/life-time-vpn",
    "Privacy Policy": "https://www.rapidvpn.com/policy",
    "SpeedTest": "https://www.speedtest.net/",
    "TestMy": "https://testmy.net/"
  }
}