{
  "source": "https://www.techradar.com/reviews/engenius-ensky-wi-fi-6-4x4-indoor-access-point",
  "title": "EnGenius EnSky Wi-Fi 6 4x4 Indoor Access Point review",
  "category": "computing",
  "updated": "2020-01-07T10:45:37Z",
  "author": "mark-pickavance",
  "summary": "A magic wand for IT managers to wave at challenging Wi-Fi problems",
  "verdict": "A high-quality MESH enabled 802.11ax access point that simplifies deployment with Power-Over-Ethernet technology. The extra cost is worth paying for an access point that is superior to all 802.11AC hardware for the extended range and quality of service in high traffic environments.",
  "pros": [
    "PoE+",
    "Uplink and downlink of OFDMA",
    "MESH capable"
  ],
  "cons": [
    "Not cheap",
    "No PSU included"
  ],
  "article": [
    "Since Wi-Fi technology entered the business use it has been a contentious technology, where the reality of wire-free network deployments has never quite lived up to the promise.",
    "And, to further sully the reputation of 802.11 standards, and all its alphabetic minions, when it finally did work effectively, it resulted in a demand that outstripped the frequencies and performance demands quicker than it could be revised and relaunched.",
    "What IT managers want is a fire-and-forget technology that handles exceptional demand elegantly, is rapidly deployable, manageable and isn’t overtaken by the proceeding technological wave before it is fully deployed.",
    "And, that description accurately sums up the EnGenius EnSky Wi-Fi 6 4x4 Indoor Access Point we’ll be reviewing here.",
    "The pricing of the EnGenius EnSky Wi-Fi 6 4x4 Indoor Access Point reflects that it offers highly manageable Enterprise-class technology, and isn't meant for home or small business users.",
    "EnGenius offers two models; the EWS377AP reviewed here and the slightly less impressive EWS357AP, that only has two antennae and not the four of its superior sibling.",
    "A typical price for the EWS377AP is £362.81 in the UK, and it can be found on Amazon.com for $308.33. Its EWS357AP little brother is $189 on Amazon.",
    "However, neither of these options are in stock currently, although they are expected very soon.",
    "From the outside, EnGenius went with a classic and distinctly minimalist styling that allows those working near them to be mostly oblivious to their existence.",
    "The gently domed case is 205mm square made of a combination of high quality injected white plastic with an aluminium base.",
    "It feels extremely very well made and the clean lines strongly promote the professionally designed equipment vibe.",
    "What you don’t get in the box is any means to power this device, even if it has a 12v barrelled power socket. Although, why they put this on the access point and didn’t include a supply that fitted it is a mystery to this reviewer.",
    "One possible answer is that you are encouraged to power this device using PoE (Power Over Ethernet), as the single Ethernet port supports it.",
    "The version of PoE on offer is 2.5GBASE-T PoE+. But, achieving that level of traffic will require a switch that supports 2.5GBASE-T on a PoE link, and those devices aren’t cheap.",
    "But without that connection, the majority of the potential WIFI bandwidth that the EnGenius EnSky offers can only be shared between connected wireless devices and not the wider wired network or beyond.",
    "As an IEEE 802.11ax access point, marketed as ‘Wi-Fi 6’ by the Wi-Fi Alliance, this hardware supports several critical innovations that 802.11ac didn’t include.",
    "These include Multi-user MIMO (MU-MIMO) in both uplink and downlink directions and not just downlink. The use of transmission ‘colouring’ to enable the differentiation of multiple networks operating on the same frequencies. And, lots of other subtle enhancements, like dynamic packet fragmentation, and Target Wake Time (TWT) technology that reduces overall power consumption.",
    "It's best to think of this as the next step in Wi-Fi evolution that is designed to meet the needs of those environments where there are many wireless devices and networks all trying to get access without the noise of failed connections drowning out the service.",
    "Because of shorter wait times between data transmissions, the system can tolerate more noise and still function, which in turn enables greater coverage with viable connections.",
    "This hardware is meant to be deployed on the ceiling and included with the unit are two plastic clips that the underside of the access point will engage.",
    "Where this works best is in a false ceiling scenario, where the unit is connected to a tile that has a hole cut in it to allow the Ethernet cable through, and power if that’s required.",
    "Once it is mounted, powered and connected to the network it can be configured using the inbuilt web interface, or a remote management tool such as SkyKey.",
    "Depending on how obsessive those administering the network are, this can be a five-minute job where they merely change the admin default password and make sure users can connect. Or, a much longer exercise where all manner of controls and nuances are set for operation, which might include reporting access and time controls.",
    "Our only reservation about the hardware and its deployment is that nature of how it connects to the Ethernet cable.",
    "Specifically, the pocket that the LAN cable enters to attach to the device is the wrong shape, as the cable is expected to make a 90-degree turn in only 40mm, and that’s going to put a strain on it over time.",
    "Terminating cables with a 90-degree L-shaped bend isn't easy or cheap.",
    "When you consider that power might be flowing through that cable, having strands or the receptacle break would be unfortunate.",
    "What’s curious about this problem is that the pocket is 108mm wide. Therefore if the Ethernet port had been placed on the end of that pocket it would have a much less aggressive approach to the socket.",
    "While not a huge issue, perhaps if this product is redesigned at some point, it might be worth reconsidering the cable ergonomics.",
    "We’ve heard many things from wireless networking providers about how new features will dramatically improve performance, only to be disappointed.",
    "But this isn’t one of those scenarios, as this equipment does live up to its billing and more.",
    "What blew our minds was that we got a better connection to this device when in the next room than to another AC class access point in the same room as our phones.",
    "Typically at close range, we achieved around 650 Mbps on 5GHz connections, and 150 Mbps on a 2.4GHz link. These levels dropped with distance, but not as markedly as with 802.11ac hardware. Even a few rooms away we still managed over 200 Mbps on 5GHz, impressively.",
    "This router is built around the Qualcomm Quad-Core A53s chipset running at 2GHz, providing 802.11ax connections on both 2.4 and 5GHz, with four antennae on each frequency.",
    "As with many 4x4 solutions, this enables 1148Mbps on the 2.4GHz range and another 2400Mbps on 5GHz, giving a total just under 3,500 Mbps. That’s a theoretical throughput, and the downstream Ethernet has a cap of 2,500 Mbps, but that’s still a decent amount of bandwidth to divide amongst users.",
    "Some 4x4 hardware makers are adding the 160Hz channel to their devices to create even more bandwidth, but this isn’t an option with the Qualcomm chips used here. However, very few client devices use 160Hz, so how much of a loss this might be is debatable.",
    "Since a recent firmware upgrade it is fully MESH capable, and when the 802.11ac specification is fully ratified, we’d expect that further upgrades will extend the scope of this hardware when additional channels are made available.",
    "There are only two small bones of contention that we have with the EnGenius EnSky Wi-Fi 6 4x4 Indoor Access Point. And the first of those is that at this price delivering it without a power supply or PoE injector seems churlish.",
    "Maybe EnGenius has determined that most of their customers already have PoE switches, and therefore the PSU is redundant?",
    "But we’d take the view that there isn’t much that annoys IT staff more than budgeting and ordering equipment, having it arrive and then discovering that they need additional hardware the day of deployment.",
    "Another irritation is that the default login password detailed in the Quick Installation Guide is wrong. It didn’t take much time for a seasoned IT professional to guess what it really was, but the factory settings and the documentation should be the same.",
    "Other than those very minor points, this is an exceptionally effective piece of equipment that delivers the level of service that IT teams are often expected to achieve with Wireless networking.",
    "For those that use PoE switches already and familiar with remote management tools, this solution provides good coverage of legacy technology with the promise of a substantially better experience than 802.11ac.",
    "Confronted with a line manager demanding better wireless coverage in a specific location, IT staff can deploy these devices quickly. And, with the prudent use of a few long network cables, they can be performance verified before they’re mounted to the ceiling, and the exact placement can be tweaked for optimal results.",
    "On the strategic front, this hardware offers a networking technology that will get better going forward and should be easy to redeploy should the business move elsewhere or radically alter the topology.",
    "Equipment this well made and specified shouldn’t be expected to be cheap, but with the EnGenius EWS377AP, your business is undoubtedly getting what it paid for."
  ],
  "headers": {
    "4": "Pricing",
    "8": "Design",
    "19": "In use",
    "29": "Performance",
    "37": "Final verdict"
  },
  "links": {}
}