{
  "source": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2019",
  "title": "Dell XPS 13 2-in-1 (2019) review",
  "category": "computing",
  "updated": "2020-10-23T16:40:02Z",
  "author": "michelle-rae-uy",
  "summary": "Giving the 13-inch MacBook Pro a run for its money",
  "verdict": "There’s a lot to love about the Dell XPS 13 2-in-1 (2019), so much so that you’ll be hard pressed to find fault in it. Beyond its stunning design, gorgeous display and portability, it also delivers enough power for productivity and even a bit of casual gaming.",
  "pros": [
    "Stunning, extremely portable design",
    "Great performance",
    "Gorgeous, responsive screen"
  ],
  "cons": [
    "Battery life is just okay",
    "Only decent sound",
    "Lid hard to open"
  ],
  "article": [
    "Get ready to be swept off of your feet. The Dell XPS 13 2-in-1 (2019) has not only refined everything good about the original, but also fixed many things that aren’t. There’s no denying that this 13-inch laptop is beautiful, as soon as you pop it open. It’s also plenty powerful, designed to give the latest 13-inch MacBook Pro a run for its money.",
    "In fact, we’d go as far to say it’s enough to convince us to move on from the macOS environment entirely. Beyond its more affordable price tag, the Dell XPS 13 2-in-1 (2019) also has an upper hand over its Apple rival on a few things. That includes a much better keyboard and a versatile form factor, as well as a more powerful processor that will see you through your productivity demands and some light editing or casual gaming. There’s also the smaller and more compact chassis, and extremely responsive touch display that the MacBooks only wish they could have.",
    "That’s not to mention the Dell XPS 13 2-in-1 (2019)’s fresher and more appealing design – that woven Arctic White look inside a Platinum Silver exterior is simply endearing. We also love how that woven texture feels under our wrists. Sure, the competition has a Touch Bar and perhaps better-sounding speakers, but it’s not like we’re incapacitated without them.",
    "The Dell XPS line has always held a special place in our computing hearts, and this 2019 model of its 2-in-1 series is no different. Thanks to its 2-in-1 feature and ultra compact form factor thrown in the mix though, it’s an excellent contender in its own right.",
    "The Dell XPS 13 2-in-1 (2019) has to be one of the best 2-in-1 laptops we’ve tested this 2020. If you’re looking for a compact 13-inch with more than enough power, a lot of versatility and a stunning design to boot, you’ll be crazy not to get it.",
    "For a hybrid laptop packed with a 10th-generation Intel Core i7-1065G7 processor, 16GB of memory and 512GB of storage (SSD), our review configuration of the Dell XPS 13 2-in-1 (2019) will only set you back $1,449 (£1,699, A$2,999). With that, you’re also getting a 1920 X 1200 touchscreen display and an Intel Iris Plus integrated graphics.",
    "There are cheaper laptops out there with fairly similar specs, but none could compare with the combination of features and specs this portable has to offer.",
    "Comparing the Dell XPS 13 2-in-1 (2019) to two of the most highly-rated 13-inch laptops out there, however, it clearly comes out on top in terms of price. The MacBook Pro 13-inch (2019) will cost you $2,499 (£2,449, A$3,799). That will get you the same amount of memory and storage, an Intel Iris Plus Graphics 655 and an aging 8th-generation Intel Core i7 processor. What’s more is that it has neither a 2-in-1 form factor nor a touch display.",
    "On the other hand, the HP Elite Dragonfly, which currently sits at the number one spot of our best 2-in-1 laptops list, will cost you $2,304 (£1,750, A$3,400) with the same memory, storage and 8th-generation i7 CPU as the MacBook, only slightly better with its UHD Graphics 620 graphics card and a convertible form.",
    "Now, those top may be at the top of the laptop food chain right now, but they do have aging processors – though this could change once Apple updates its 13-inch MacBook Pro line. As far as competition with the same power inside, there are the HP Spectre x360 13-inch and the Lenovo Yoga C940.",
    "For the same CPU, integrated graphics, memory and storage space, the HP Spectre x360 13-inch will set you back a little less at $1,299 (about £1,000, A$1,965). That goes for the Yoga C940 as well, which will cost $1,369 (about £1,050, A$2,070). Plus, if port selection is more important, the other two also have the advantage by having both USB 3.1 and USB-C ports on offer.",
    "Though neither of the two has an FHD+ screen. They’re also slightly bigger and heavier. So, in terms of display and portability, the XPS 13 2-in-1 has the win.",
    "If you do want to take home the Dell XPS 13 2-in-1 (2019), but cannot afford to go over $1,000/£1,000 and don’t want to pay more than that for specs you don’t need, don’t worry. This laptop starts at $999 in the US, which gets you a 10th-generation i5-1005G1, 4GB of memory and 256GB of storage. In the UK and Australia, the base configuration starts at £1,409 and A$2,199 respectively, with a 10th-generation i5-1035G1, 8GB of memory and the same storage.",
    "You shouldn’t judge a book by its cover, but by all means, go ahead and judge this one. Not that the Dell XPS 13 2-in-1 (2019) is a faultless machine, but it definitely has a lot going for it inside and out.",
    "That unassuming yet high-quality Platinum Silver exterior, with its tiny 11.67 by 8.17-inch form factor and only the Dell symbol embossed in the middle, may make you curious enough about this laptop to pick it up. However, it’s the endearing woven Arctic White interior (Black is also on offer) and ultraslim bezel FHD+ display that will get you hooked.",
    "The first time we popped open the Dell XPS 13 2-in-1 (2019), we couldn’t put it down. It doesn’t just look good; it feels good as well beneath our hands. The keyboard has a matte finish that feels soft, while the textured woven areas on either side of the trackpad where your wrists rest actually feels nice and somehow helps keep your wrist from sliding.",
    "Although having a white computer can be a tricky thing, since it’s easier to see all the dirt and grime that pile up overtime, it doesn’t feel like you need to be extra careful when using the Dell XPS 13 2-in-1 (2019). Simple regular cleaning should do it to keep the keyboard, trackpad and other areas clean, and that matte finish does keep oil from your fingertips at bay.",
    "Another feature worthy of praise here is the tiny HD webcam. Where the original had the camera below the display so that anyone you’re chatting with ends up looking up at your nostrils, this 2019 model has it back in its rightful place. What’s more is that Dell designed it to fit in the ultraslim top bezel, so what you get is a lens smaller than many other webcams out there but is just as capable of shooting at 720p resolution.",
    "Speaking of the display, our review unit may only have the 13.4-inch display with 1920 x 1200 resolution – a 4K model is also available – but it’s already plenty sharp for us. It’s also incredibly vibrant, impressively bright with 500 nits of brightness and has hardly any glare thanks to the 0.65% of anti-reflective coating.",
    "Because it’s made of Corning Gorilla Glass 5, the touchscreen also feels delightful beneath our fingertips. And, finally, those are the thinnest bezels we’ve ever seen, which not only gives you more screen real estate, but also gives that laptop a minimalist look.",
    "We adore the keyboard on the Dell XPS 13 2-in-1 (2019). It has great travel and bounce, making it satisfying and comfortable to type on. It’s certainly much nicer to use than the MacBook Pro 13-inch, and less noisy. While it’s not as spacious due to the space Dell had to work with, it’s not as cramped feeling as many others – though in large hands, it might feel a tad more cramped.",
    "We’re not massive fans of the mini arrow and page up/down keys, however. They are crammed in together, with the page up button sitting on top of the left arrow key and the page down key sitting on top of the right arrow key. This positioning has resulted in many accidental presses during our testing, which can get frustrating when you’re trying to be productive.",
    "The trackpad, made of fiberglass, fits snugly and works well. It's of the Ultrabook variety where it's just a pad, no separated buttons. But, there's certainly a bit more give where the buttons would be.",
    "It does seem highly sensitive – at medium sensitivity, we have accidentally moved tabs and made unintended clicks from just having our fingers too close to the trackpad. However, it doesn’t happen too often to the point of being annoying, and you can always set it to low sensitivity.",
    "It has only a few ports: two USB-Cs, a 35mm audio jack and a microSD card reader. Still, it’s actually superior to the MacBook in this regard, not only because of the microSD card reader, but also because it places a USB-C port on either side of the computer. This means that there's not a lot of crowding when you’re using both, and you can also charge on either side so you don't have to get tangled in the cord either.",
    "Finally, there’s the speaker. It has decent volume, and its sound can be tweaked a little via the MaxxAudio Pro software. However, this being such a thin laptop, it’s slightly boxy sounding and has almost no bottom end. Still, the sound decent, though we’d take your favorite set of cans when traveling if you’re particular about audio.",
    "Armed with a 10th-generation Intel Core i7-1065G7 and coupled with 16GB of LPDDR4X memory, the Dell XPS 13 2-in-1 has more than enough power to deliver when tackling everyday computing tasks.",
    "It’s more than just a productivity laptop, though. While the Dell XPS 13 2-in-1 is only equipped with Intel Iris Plus graphics, this little laptop that could has proven that it’s quite capable of handling casual gaming as well as light photo and video editing software.",
    "Obviously, this isn’t a gaming computer by any means. It can, however, handle more casual and older games. We were able to run both Civilization VI and Assassin's Creed Unity on 1080p high, as well as Vampyr, a 2018 AA game, without issue.",
    "This isn’t a video editing computer, either. However, we were curious about how it would handle it anyway. So, we made a minute and a half video on Adobe Premiere Pro using five stock clips. Rendering and exporting that video without added effects took about as long as the video itself: five and a half minutes with an effect added to each clip.",
    "We had a bit of a rough start testing this laptop, as it couldn’t “access graphics hardware\" when we were trying to run the Total War: Warhammer II and Shadow of the Tomb Raider's benchmarks. But, we did a refresh, ran CCleaner on the registry and for general computer issues, and updated both Dell and Windows drivers to find and fix the issues.",
    "We also started noticing some slow down when we had multiple browser tabs open at the same time. But, we just needed to update the Dell driver again, and that did the trick.",
    "Since then, we haven’t experienced any issues or slow downs, and were able to successfully put this laptop to the test.",
    "Speaking of which, the Dell XPS 13 2-in-1 gets a solid 1,747 points in Cinebench R20, higher than that of what the similarly specced Lenovo Yoga C940, which got 1,385 points, and that of the lower specced HP Elite Dragonfly, which got 1,059 points. In GeekBench 4.3, the Dell XPS 13 2-in-1 (2019) scores 4,758 (single-core) and 17915 (multi-core), lower than that of the Yoga C940’s 5,620 and 18,029 or HP Dragonfly Elite’s 5,266 and 13,893.",
    "Those results aren’t exactly mind-blowing. On top of that, its fans get fairly loud and the keyboard does heat up quite a bit when the laptop is under duress. It doesn't get too hot to use, but it does experience throttling pretty quickly with heavier tasks. Still, because of its compact and thin chassis, the Dell XPS 13 2-in-1 (2019) was never meant to break performance records.",
    "This is supposed to be a thin and light laptop that combines portability, versatility and performance in a chassis designed to be a stunner and a form factor that gives you several devices at once – ideal to meet a traveling professional’s productivity demands. And, in that, it certainly succeeded.",
    "Whatever battery life a manufacturer is promising on a laptop usually ends up being longer than what you can actually expect, and that’s also the case with the Dell XPS 13 2-in-1. Although Dell says that this laptop will last up to 16 hours, 58 minutes, it comes up considerably shorter during our tests.",
    "In PCMark 8, which tests heavy productivity use, it makes it to 4 hours and 36 minutes (with 14% left on the battery). In the TechRadar battery test, where we loop 1080p video until the laptop dies, it lasts 7 hours and 50 minutes. Those results are pretty much on par with both the Lenovo Yoga C940 and HP Elite Dragonfly.",
    "They’re also far from the over 16 hours of longevity Dell has promised. However, that’s good enough to get you through an entire day’s work, given you’re not pushing the laptop to its limits. But, just in case, we’d bring that charger."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "13": "Design",
    "26": "Performance",
    "36": "Battery life",
    "39": "Don't buy it if..."
  },
  "links": {
    "13-inch laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-13-inch-laptops-which-is-right-for-you-901574",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-13-inch-2019",
    "best 2-in-1 laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "HP Elite Dragonfly": "https://www.techradar.com/reviews/hp-elite-dragonfly",
    "Apple updates its 13-inch MacBook Pro": "https://www.techradar.com/news/new-macbook-pro-13-inch-spotted-with-10th-generation-ice-lake",
    "HP Spectre x360 13-inch": "https://www.techradar.com/reviews/hp-spectre-x360-2020",
    "Lenovo Yoga C940": "https://www.techradar.com/reviews/lenovo-yoga-c940",
    "video editing software": "https://www.techradar.com/best/free-video-editing-software"
  }
}