{
  "source": "https://www.techradar.com/reviews/verticalresponse",
  "title": "VerticalResponse email marketing review",
  "category": "computing",
  "updated": "2020-08-06T13:22:23Z",
  "author": "kieron-allen",
  "summary": "A trusted brand that still delivers",
  "verdict": "A high-performing, feature-heavy service perfect for non-technical users.",
  "pros": [
    "Lots of features",
    "Very user friendly"
  ],
  "cons": [
    "Paid plans go up in price quickly",
    "Ambiguous security measures"
  ],
  "article": [
    "Founded in 2001, VerticalResponse has been in operation since the early days of the internet and is one of the best email marketing services available. The platform has enabled over 1.4 million businesses to implement a bespoke digital marketing strategy regardless of technical know-how.",
    "In our VerticalResponse email marketing services review, we look at the pros and cons of this well-established email campaign software to see if it can still hold its own when pitched against more recently launched email campaign tools.",
    "VerticalResponse offers three price plans, Basic, starting at $11 per month paid monthly, Pro, starting at $16 dollars per month, and Pay As You Go, which requires users to buy email credits to create one-off bespoke campaigns. Credits start at $0.025 per email but reduce in cost the more you purchase.",
    "On the surface, VerticalResponse’s price plans appear relatively simple, but delve a little deeper and things begin to get complicated.",
    "All paid accounts enable users to send unlimited emails every month, but pricing isn’t static. It increases depending on the number of contacts in your account. For example, the Basic plan increases to $22 per month once you exceed 500 contacts, $33 per month after you reach 1,000, and so on up to 40,000.",
    "The Pro plan, which comes with a few extra features, including A/B subject line testing, works in the same way. Most email marketing services use a similar pricing structure, but there tend to be fewer variables.",
    "On the plus side, VerticalResponse does offer a free 60-day trial and discounted rates for non-profits.",
    "The platform also offers a separate paid plan for advanced surveys at $19 per month, and a Full Service Email Marketing service from $196 per month.",
    "VerticalResponse is packed with features enabling users to produce professional outreach emails, organize and undertake email marketing campaigns and surveys, and A/B test messaging to optimize conversions.",
    "Core features include a straightforward email editor, contact list management system, detailed analytics, automated email blasts, an HTML editor, mobile-friendly email templates, Facebook and Twitter connectivity, an image library, and editable pop-up forms.",
    "For most businesses, this would be enough, but VerticalResponse has a number of stand-out features that make the platform even more appealing.",
    "There is a Test Kit—paid for using VerticalResponse credits on an email by email basis—which enables you to preview subject lines, check how your email will appear on close to 60 apps, devices, and browsers, and scan for any broken links.",
    "VerticalResponse has an easy-to-use landing page builder, so in the absence of a website you can create landing pages to give your emails more credibility.",
    "The software can even integrate with other marketing tools like Salesforce and Magento for cross-platform syncing of contacts and email lists.",
    "Self-explanatory and simple, VerticalResponse makes it possible to carry out some very complex digital marketing procedures with no technical knowledge.",
    "The setup process was quick and simple. After entering our email address into the Start Free Trial box on VerticalResponse’s homepage, we were instantly redirected to a standalone sign-up page.",
    "After entering our login credentials we were given instant access to the Get Started page on the VerticalResponse web app.",
    "There’s an option to follow the prompted setup instructions or explore the site independently. Follow the prompts, and you’ll be asked to create your first email list. If you don’t want to do this, you can cancel the pop-up and explore the site manually, as we did.",
    "The steps required to create emails and landing pages were particularly straightforward and the results very professional. Anyone new to email marketing would likely feel comfortable using this interface.",
    "The VerticalResponse interface is clean, simple, and very easy to navigate. Tabs are arranged over two tiers with Messages, Contacts, Forms, and Surveys above, and Upload New List, Create Sign Up Form, Create Segmentation–or sub-groups, and Create Landing Page below.",
    "This thoughtful layout ensures all key features are easily accessible, making the whole process, from creating a bespoke email template to sending it out, as time-efficient as possible.",
    "Contacts can be added individually or imported in bulk. This process was quick and easy, and the contact information we added was instantly displayed.",
    "It took a lot of digging to find out how VerticalResponse protects the data it handles as we were unable to locate any references on its website.",
    "In the end, we had to do a Google search. This led us to an obscure, dateless post on VerticalResponse’s help site regarding the company’s intended migration from SSL (Secure Sockets Layer) to TLS (Transport Layer Security) to mitigate SSL cyberattacks.",
    "The platform uses the privacy policy of its parent company Deluxe and is explicit in its compliance with the EU’s General Data Protection Regulation (GDPR), a crucial piece of legislation for digital marketers.",
    "For queries out of office hours, you can contact support via email, but don’t expect an instant reply.",
    "You can access help and support in-session by selecting the question box in the top left corner of the screen. You have the option to choose help for the page you are on, which is a nice touch, or consult the full index. Either way, you are re-directed to the VerticalResponse help center.",
    "This standalone website does contain a lot of information and is well organized, but we found some of the categories, like A/B testing, to be a little light on articles.",
    "VerticalResponse has a live chat and telephone assistance line, but they only operate Monday to Friday, 6 am to 5 pm PST.",
    "VerticalResponse offers value for money at the low end of its price plans. However, as soon as a business scales up, the price quickly increases. GetResponse might be better suited to growing businesses, with its Basic plan starting at $15 per month for 1,000 contacts.",
    "Another industry veteran is AWeber. While this service is similarly priced and also aims to simplify email marketing, VerticalResponse offers a far greater range of features.",
    "VerticalResponse is feature rich and well tailored to first-time users not familiar with digital marketing strategies. That said, established businesses with tech-savvy staff would also benefit from its usability, saving time and money on marketing campaigns."
  ],
  "headers": {
    "2": "Plans and pricing",
    "8": "Features",
    "15": "Setup",
    "18": "Performance",
    "22": "Security",
    "25": "Support",
    "29": "The competition",
    "31": "Final verdict"
  },
  "links": {
    "best email marketing services": "https://www.techradar.com/best/best-email-marketing-software",
    "surveys": "https://www.techradar.com/best/best-survey-tools",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "HTML": "https://www.techradar.com/best/html-online-courses",
    "email": "https://www.techradar.com/best/best-email-clients",
    "landing page builder": "https://www.techradar.com/best/landing-page-creator",
    "Magento": "https://www.techradar.com/best/best-shopping-cart-software",
    "GetResponse": "https://www.techradar.com/reviews/getresponse",
    "AWeber": "https://www.techradar.com/reviews/aweber"
  }
}