{
  "source": "https://www.techradar.com/reviews/feren-os",
  "title": "Feren OS review",
  "category": "computing",
  "updated": "2020-12-09T15:28:45Z",
  "author": "mayank-sharma",
  "summary": "One of the best options to introduce new users to Linux",
  "verdict": "Thanks to its sane defaults and an excellent collection of custom tools, Feren OS is shaping up to become the best Linux distro for welcoming users into the unfamiliar environment.",
  "pros": [
    "Ready-to-use",
    "Collection of custom apps",
    "Aesthetically pleasing"
  ],
  "cons": [
    "Single developer"
  ],
  "article": [
    "Feren OS has been under development for over half a decade now and the one-man project has started to build a community of users and contributors around it.",
    "The teenage developer of Feren OS has been toiling hard on the project and has taken several mature decisions to improve the usability of the distro. The project has gone through several major tweaks in the background to improve the user experience in the foreground.",
    "For a long time Feren OS was based on top of Linux Mint, but with its latest release, Feren OS has gone back to its original upstream distro, Ubuntu. In a sense Feren OS takes Ubuntu and makes it easier to use. It does so by turning it into a more out-of-the-box usable desktop than the open ended Ubuntu, which is designed to appeal to a wide variety of users.",
    "Feren OS uses a heavily customized KDE desktop environment that’s been tuned for user friendliness. Usually the preferred desktop environment for power users, KDE is extremely customizable. The Feren OS developer has taken advantage of the malleable desktop environment to tweak it to suit new Linux users.",
    "The distro is chock full of apps. Besides LibreOffice and VLC, there’s also Remmina remote desktop client, and raster graphics editor Krita. The distro uses the Vivaldi web browser and packs in some interesting apps as well including the Boot-Repair tool and Timeshift, which is a system restore utility that takes incremental snapshots of the file system at regular intervals.",
    "The inclusion of the proprietary Vivaldi browser is a testament to the distro’s pragmatic approach. Even if you don’t wish to use a closed-source browser, switching to an open source one is a walk in the park.",
    "That’s because the distro includes a very helpful (and totally newbie proof) browser changer app that the distro has forked from Zorin. You can use the tool to install any of the other popular options including Firefox, Chromium, Brave, Falkon, and even proprietary ones such as Opera, Chrome, and Edge, with a single click.",
    "Experienced users will appreciate the fact that the option to install Chromium will install Debian’s version of Chromium instead of Ubuntu’s, which has been rubbing the community the wrong way.",
    "Feren OS uses the distro-neutral Calamares installer that’s been tweaked to shorten the process to essentially just the partitioning step. The user creation step has been delegated to a first boot app that will also help you configure other essentials as well such as the keyboard and the timezone, when you boot into your new installation.",
    "Aesthetics play a central role in Feren OS and help with the distro’s mission of being accessible to everyone irrespective of their background and experience.",
    "Feren OS has a number of custom apps and one of its most useful one, as far as its core audience is concerned, helps you change the desktop layout of the distro. You can use the tool to make your desktop mimic the desktop of macOS (complete with a global menu) and Windows 10 (with the tiles in the Start menu). There’s also something for Windows XP users.",
    "Besides these, there’s also a layout that’s inspired by Ubuntu’s discontinued unity desktop environment, and another that’ll help you navigate using a touch screen. You can switch between all of the available layouts seamlessly without logging out, which is another usability win.",
    "Earlier editions of Feren OS relied on a welcome app dialog that helped you familiarize yourself with the new distro. This has now been replaced by the Feren OS Tour app, which does an impressive job not only of orienting you with the new environment, but to also help you tweak some key aspects.",
    "The desktop layout is part of the Tour as is the transfer tool that’s designed to help you move files from your Windows installation into your new Feren OS.",
    "The tour will also help new users get started with the desktop by orienting them with some of the most common functions such as the applications menu, and the system tray. Impressively it also introduces the KRunner launcher to help even KDE newbies utilize the full power of the desktop environment.",
    "Also introduced as part of the tour in the Feren OS store, which is a fork of the MintInstall app store, with new features. The store is visually appealing, lists reviews and ratings for apps and also supports Flatpaks. Feren OS also borrows the Update Manager from Linux Mint, which again helps take the pain out of this essential system maintenance task.",
    "Feren OS joins a small list of distros designed to help introduce new users to Linux. It is unique in making full use of the malleability offered by the KDE desktop to create a familiar environment for users coming over from proprietary operating systems.",
    "Just like with its choice for KDE, Feren OS is also not afraid of borrowing the best tools for the job and then tweaking them to suit its purposes. In fact, some of its best tools come from Ubuntu, Linux Mint, and Zorin OS. That said, the developer has worked on all of them to bring them in line with his vision of a newbie-tailored desktop distro.",
    "Also, while all distros that cater to the new Linux user spend effort on their theming, none come close to providing Feren OS-like attention to detail when it comes to crafting a visually appealing distro. Everything from its collection of wallpapers and themes, to the ability to choose the accent colours speak volumes about the importance it assigns to this aspect of creating a user-friendly distro.",
    "Designing a desktop for the inexperienced Linux user is a tough ask. Kudos to Feren OS for its decision to use the best available app for the job, irrespective of the source, instead of reinventing the wheel. The distro’s got tools and apps from several different projects and has integrated them nicely with the desktop.",
    "All things considered, Feren OS has managed to do a stupendous job of shipping a distro with sane defaults that’ll appeal not just to new Linux users, but also to experienced campaigners that want a distro that just works."
  ],
  "headers": {
    "2": "Features",
    "8": "Installation and Use",
    "16": "The Competition",
    "19": "Final Verdict"
  },
  "links": {
    "Feren OS": "https://shareasale.com/r.cfm?b=1270706&u=1338591&m=37723&afftrack=trd-us-2279872978180689400&urllink=https%3A%2F%2Fferenos.weebly.com%2F",
    "latest release": "https://medium.com/feren-os/the-feren-os-november-2020-snapshot-is-now-available-eeabf6806fb?source=collection_home---4------2-----------------------",
    "rubbing the community the wrong way": "https://www.techradar.com/news/linux-mint-introduces-its-own-take-on-the-chromium-web-browser"
  }
}