{
  "source": "https://www.techradar.com/reviews/kareo-billing",
  "title": "Kareo Billing review",
  "category": "computing",
  "updated": "2020-01-15T05:44:22Z",
  "author": "jonas-p-demuro",
  "summary": "The technology platform to support your independent practice",
  "verdict": "Kareo has an attractive offering with their module based approach, but user reviews provide caution that what is promised may not be delivered.",
  "pros": [
    "Multiple support options",
    "Module based plans",
    "Fixed cost",
    "Free demo"
  ],
  "cons": [
    "Opaque pricing",
    "Support frustrations",
    "Lack of aggressive collections"
  ],
  "article": [
    "Kareo can trace its origins to 2004 when it was founded by Dan Rodrigues, a family medicine physician. In the subsequent years, its “Passionately driven” philosophy has led to significant growth leveraging $120 (£91) million in raised funding, and now boasting 545 employees at five offices, servicing approximately 50,000 providers, with over 30 awards gathered along this journey. Kareo also provides a platform for the growing area of telemedicine to enable remote visits through internet streaming technology.",
    "At the core of its service is Kareo Clinical, the digital platform designed to facilitate electronic charting, prescription writing, code encounters, and manage patients. Kareo Engage is also offered to provide online marketing strategies and SEO. Overall, Kareo is designed for a smaller practice, and not for enterprises.",
    "Additionally, Kareo also provides another module, Kareo Billing. This platform automates the billing process to get clinicians paid faster. Using its comprehensive end-to-end claims tracking system, Kareo can reduce the days for bills to be held in accounts receivable. It starts with Kareo’s ability to upload patient demographic data, supporting documents, and verify insurance eligibility. There are also smart checks integrated into the billing workflow to facilitate claims going through.",
    "Another benefit is that Kareo Billing puts the data in the cloud. Software gets downloaded to the user’s computer, with data getting uploaded to the Kareo server.",
    "There is also an emphasis on comprehensive charge management. Kareo Billing provides all the tools necessary to capture and manage charges directly into Kareo so they do not get missed. Kareo is also ICD-10 compliant with integrated tools for correct codes to also enhance billing, and minimize resubmitted claims. Also included is a Secure Messaging System within Kareo for secure communication between patients, providers, employees and billers as issues arise.",
    "Integrated into Kareo Billing are intuitive billing analytics. This allows the management of the practice to easily get a financial snapshot of the billings and collections to determine the financial health of the practice via reports. Then Kareo’s dashboard can simply and easily display this information in an easily digestible format.",
    "Kareo has some downsides, starting with that it is built on an older platform, which makes it susceptible to downtime issues. There are also described issues on data transfers for clinicians looking to upload data, and found the transfer speeds too slow, and the data incomplete, resulting in missing information.",
    "Other users point out the poor customer service, with lack of followup by Kareo when trouble tickets are submitted. There are reports of the same problem bouncing between multiple departments with a lack of resolution. Still others complain that what they are told by sales when purchasing the service differs from what they experience once the service is acquired.",
    "During the initial period with Kareo, free onboarding is included to get the office transitioned. Subsequently, and not surprisingly, beyond this, the options do get trimmed down, although they are still better than most.",
    "Kareo offers a wide variety of support options. These start with online chat, which is available on weekdays, from Monday to Friday, between the hours of 5 AM and 4 PM PDT. There is also the option to email the company, which actually opens up a portal to enter the issue encountered, which creates a Help Ticket. The final option is to call Kareo via a toll free number, between the same hours listed above.",
    "There is also a status blog, that indicates if the systems are operational, or if there is a downtime event. Users can also subscribe to this page to get these operational updates.",
    "Finally, there is Kareo University, which is available to all customers. This provides a wide variety of courses to cover staff learning needs, with options that are instructor led, and self-paced offerings. Upon completion, the user will even receive Kareo Certification.",
    "Kareo Billing, just like the other Kareo offerings, simply is not forthcoming in their pricing structure for their services. While we can certainly appreciate that each practice has unique needs, it would be preferable to at least get an idea of the costs prior to contacting the company for the custom quote.",
    "With further research, we gleaned that for physician and optometry clients, the costs run $150 (£114) to $300 (£228) monthly, depending on the number of modules chosen, with the billing module being the most expensive piece. Other non-MD clients, like therapists, can acquire the Kareo modules at a less expensive price of $50 (£38) to $150 (£114) monthly. After purchasing the first module, additional modules are added at 50% off, but unfortunately there is no discount for additional providers. At least there is no startup cost, no cancellation fee, or fees for office staff to use the software.",
    "While Kareo’s fixed cost on a monthly basis is attractive for a busier practice, it may explain the lack of aggressive collections during the billing process. Some other competing services work on a fixed percentage basis, and don’t get paid until the money is collected, giving the billing service more of an incentive to collect on the claims they are billing.",
    "There is no free trial, but there is an offer for a free demo.",
    "Kareo Billing is one of the modules for the Kareo offering. The pros include an affordable fixed cost, multiple support options, and flexible plans priced based on the number of modules chosen. Downsides include poor customer service, opaque pricing, and downtimes due to an older platform. While there is plenty to like here, Kareo’s overall service may not be worth the headaches that some users encountered."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "8": "Support",
    "12": "Pricing",
    "16": "Final verdict"
  },
  "links": {
    "telemedicine": "https://www.techradar.com/best/best-telemedicine-software",
    "Kareo Clinical": "https://www.techradar.com/reviews/kareo",
    "Kareo Billing": "https://www.kareo.com/practice-management/",
    "Kareo University": "https://helpme.kareo.com/Kareo_University"
  }
}