{
  "source": "https://www.techradar.com/reviews/geotab",
  "title": "Geotab review",
  "category": "computing",
  "updated": "2021-09-09T09:44:41Z",
  "author": "jitendra-soni",
  "summary": "Advanced telematics solution provider",
  "verdict": "An impressively versatile fleet tracking solution, albeit lacking transparency in pricing.",
  "pros": [
    "Flexibility",
    "Ease of use",
    "Pre-built solutions"
  ],
  "cons": [
    "No transparency around pricing",
    "Customer support is dependent on resellers"
  ],
  "article": [
    "Geotab offers hardware and software services for fleet management. It was founded in 2000 and is headquartered in Oakville, Canada.",
    "Geotab is one of the largest telematics outfits in the world and was also the first company to surpass two million connected vehicles built on a single, open platform.",
    "It offers a range of fleet tracking solutions that include Go devices for real-time tracking which come with a simple plug-and-play installation, and MyGeotab software. These solutions help businesses with the required intelligence to optimize efficiency, stay compliant to regional regulations, and improve driver safety.",
    "Unlike most other companies involved in fleet management services or tracking equipment, Geotab does not sell its solutions directly to the end customers. Instead, it operates through a network of resellers.",
    "The company does not list any plans, pricing or contact information online. This gives resellers the option to offer additional features by including software based on the fleet manager’s requirement; hence the pricing and the contract may vary for each customer.",
    "Geotab’s solution, however, can support all compliance requirements and the company offers a standard year-long warranty with Go devices. Furthermore, with the ProPlus plan, this warranty can be extended for a year. The Geotab Go device requires an upfront payment followed by an ongoing monthly payment for the service.",
    "Since pricing varies from case to case, it is best to contact the company or reach out to the nearest reseller directly to get a quote for your particular business requirements.",
    "While the company has multiple tiers each with specific features, it only offers live GPS tracking with the ProPlus plan. The other available plans are Base, Regulatory (HoS) and Pro, with the ProPlus being the top-tier offering.",
    "The software, MyGeotab, is a cloud-based solution and can be used via any web browser. This makes it platform independent so you can use it on any OS or device that can run a browser.",
    "The MyGeotab dashboard offers all the information required at the administrator's end, including real-time data on vehicle position, speed, fuel consumption, and other key metrics at a glance. It also offers various reports like driver scorecards, HoS (Hours of Service), driver productivity, and more, with an easy drag-and-drop customization option.",
    "MyGeotab also boasts an SDK offering a set of tools for working with vehicle data, enabling integration with third-party hardware or systems. If you already have a tracking device, you can easily pair it with the dashboard to get going. This could potentially result in a huge initial cost-saving, as well as saving companies the hassle of getting old devices replaced with new ones.",
    "There are a ton of add-on solutions available on the Geotabs website under the marketplace section. These ready to use solutions allow fleet management companies to add specific features according to their requirements.",
    "Apart from the MyGeotab dashboard, there is a Geotab Drive app that can be used by drivers to complete vehicle inspections, engage in messaging, and much more. It abides by FMSCA compliance standards as a part of the Geotab ELD cloud system.",
    "This simple to use app helps remove the hassle of paperwork, letting drivers log their work hours automatically. It allows them to communicate with the administrators while on the go. Administrators can also use the in-vehicle driver feedback function to give real-time feedback and coaching.",
    "A number of online reviews left by users suggest that MyGeotab is a very intuitive and easy to use dashboard. Among those reviews, several companies reported that they were able to optimize their expenses better and were able to monitor drivers efficiently thus controlling shrinkages in real-time.",
    "Furthermore, a few companies have reported that with the help of Geotab they have found undisciplined drivers who were not following efficient routes, and were able to coach them in a better way with the help of driver scorecards.",
    "All that said, some reviews have reported random inconsistencies in driver’s duty functions which can cause unnecessary delays, wait periods, and even disciplinary action against drivers.",
    "As for the hardware products offered by Geotab, the website highlights:",
    "Since Geotab retails its products through resellers, the company does not provide direct support to users. There is no direct contact number on the website for a user to call. Instead, the website directs customers to the nearest approved reseller which can handle basic queries and even driver training, if required.",
    "The hardware products come with extensive DIY guides to set them up and the company expects customers to install the devices on their own. The website also has a handful of training content to get started.",
    "Geotab is unlike any other provider with a unique business model. This has its benefits like customization and flexibility, although customer support is one of the major misses here. Since support is entirely dependent on resellers, your experience may vary like the pricing and contract.",
    "The dashboard itself is very easy to use and the openness of the platform is another highlight. Geotab comes across as a trusted brand among its users and has a great reputation overall."
  ],
  "headers": {
    "3": "Plans and pricing",
    "7": "Features",
    "18": "Support",
    "20": "Final verdict",
    "22": "Further reading"
  },
  "links": {
    "fleet management": "https://www.techradar.com/best/the-best-fleet-management-software-and-services-2020",
    "fleet tracking": "https://www.techradar.com/best/best-gps-fleet-tracking-solutions",
    "fleet management services": "https://www.techradar.com/best/best-gps-fleet-tracking-solutions"
  }
}