{
  "source": "https://www.techradar.com/reviews/sterling",
  "title": "Sterling review",
  "category": "computing",
  "updated": "2020-10-28T05:16:54Z",
  "author": "annie-beverley",
  "summary": "Background checks which look at your candidate’s entire history",
  "verdict": "Sterling delivers prompt background checks through a combination of technology and human reviews.",
  "pros": [
    "Fast turnaround time",
    "SSN tracing",
    "Extensive support options"
  ],
  "cons": [
    "Large businesses will need to request a quote"
  ],
  "article": [
    "Sterling conducts background checks so that businesses can verify the identity of prospective employees and uncover problematic incidents in their past, the likes of which may jeopardize company culture going forward.",
    "In this Sterling review, we’ll assess if it provides one of the best background check services available today. We’ll analyze every aspect of Sterling’s service, including price, functionality, and features. Finally, we’ll compare Sterling against its competitors, so you can decide if it’s the right service for your organization.",
    "Businesses who intend to conduct over 100 background checks a year must contact a Sterling representative, who’ll provide a tailored quote suitable for their organization’s demands.",
    "Small business users who intend to conduct less than 100 background checks a year can choose a pricing tier based on the extensiveness of the background check required. The cheapest one is a driver’s check, which costs $9.95 per check. Education and employment verification are also affordable, costing only $19.95 per check.",
    "Check packages begin with the Basic Check pricing tier. It costs $29.95 per check, discloses criminal records, and traces social security numbers (SSN). The Preferred Check is $59.95 per check, improving upon the capabilities of the Basic Check by revealing federal criminal files by location and disclosing terror suspect status. The most expensive check is the Pro Check, at $79.95 per check, which discloses all information in the prior two checks, plus multi-state booking records and all federal criminal information.",
    "Sterling conducts all checks legally by consulting publicly available records. They aim to help business leaders determine if potential employees are trustworthy by revealing financial information (such as bankruptcies), workplace compensation demands, and criminal record data. Be aware that all credit and criminal background checks are only legal when the potential candidate agrees to them.",
    "Using an SSN trace, Sterling searches criminal records archives not only by name but also by social security number, revealing undisclosed addresses and aliases on the way. Arrest records or convictions are then verified for accuracy before they’re presented to business leaders for review.",
    "Sterling has a wide range of services, so hiring managers can simply wait for their candidate’s background check to arrive on their desk. These include the below:",
    "Sterling checks criminal records of county courthouses in areas the prospective candidate has lived (for up to 10 years). Most employers want this background check as standard, which is why it’s inclusive to Sterling’s Basic Check and all other tiers.",
    "All check packages include searches for your candidate’s names on the National Registry of Sex Offenders, so you can ensure the safety of individuals within your organization and protect any children who may be on your business premises.",
    "Preferred and Pro Checks consult the database of the Office of Foreign Assets to identify if your candidate is present on any lists as a domestic or international terror suspect.",
    "SSN tracing is included with every check package. Because SSN trace identifies public records connected to a social security number instead of a name, information normally concealed from public records concerning address history and potential aliases is revealed. SSN trace demonstrates whether or not your candidate is being truthful about their previous employment and location history.",
    "Sterling’s Preferred and Pro Checks assess whether your candidate’s name occurs on any federal crime databases so you can ensure your assets are safe in their hands. Furthermore, a federal criminal search confirms whether your candidate’s been honest about their location in the past 7–10 years.",
    "Sterling has extensive customer support available. Help can be solicited via phone, 24 hours a day, across all American, European, and Asian business timezones, including Pacific Time and Eastern Time for clients in the United States.",
    "Customer support teams are trained in specific industries. For example, there are specific support teams for hiring departments in healthcare, retail, and government. When you first speak with a Sterling customer support representative, they’re already well acquainted with the specific background check demands of your industry.",
    "However, candidates don’t enjoy the same positive experience of customer service as business clients do, as they can only solicit help via an onsite form. Candidates regularly critique Sterling on review aggregators for delays processing documents, poor communication, and impossible deadlines imposed at the last minute.",
    "In contrast with competitor GoodHire, Sterling’s method of conducting background checks seems outdated. Sterling delivers the results of the background check at the close of the process. GoodHire integrates checks into your team’s workflow via your Applicant Tracking System platform, so you can see exactly what stage of the process is ongoing and receive notifications with each update.",
    "Certn is one of Sterling’s leading competitors. Rather than conducting background searches and presenting them to your hiring manager, Certn enables hiring departments to conduct independent background checks using its software. Despite the convenience of inhouse software, outsourcing background checks can be beneficial from a legal standpoint, as it diminishes responsibility in case of civil suits.",
    "Sterling is undoubtedly a market-leading background check service to evaluate the character of potential hires based on their legal and employment history. All the checks Sterling offers indicate whether your candidate is trustworthy, with more extensive checks required for professions that handle sensitive data, deal with vulnerable people, or hold valuable assets. As an outsourced background check service, Sterling will help distance your organization from culpability in case any civil suits arise as a consequence of the process. We’d recommend Sterling for small businesses that must verify their employee’s integrity to protect assets."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "How it works",
    "7": "Features and services",
    "13": "Support and customer care",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Sterling": "https://www.sterlingcheck.com/services/criminal-background-checks/",
    "best background check services": "https://www.techradar.com/best/background-check-services-sites-online",
    "GoodHire": "https://www.techradar.com/reviews/goodhire",
    "Certn": "https://certn.co/"
  }
}