{
  "source": "https://www.techradar.com/reviews/efax",
  "title": "eFax review",
  "category": "computing",
  "updated": "2020-04-23T10:50:46Z",
  "author": "alex-mcomie",
  "summary": "Adequate online faxing, but expensive",
  "verdict": "While eFax is a perfectly functional online fax service, it doesn’t provide any standout features, and it’s more expensive than many competitors.",
  "pros": [
    "Mobile app available on both iOS and Android",
    "Edit faxes through eFax Messenger"
  ],
  "cons": [
    "Separate limits for sent and received faxes",
    "More expensive than the competition"
  ],
  "article": [
    "Fax machines are no longer a cost-effective purchase for most businesses, but you may still need to send and receive some faxes. Online fax software platforms are a convenient and affordable option for small and large businesses that want access to fax capabilities without investing in a fax machine.",
    "In our eFax online fax review, we’ll take a look at the application’s features and consider whether it’s worth using over another one of the best online fax services.",
    "eFax offers three subscription tiers: Plus ($16.95 per month), Pro ($19.95 per month), and Corporate (custom pricing based on your volume). You get two months free if you pay upfront for a full year.",
    "Plus users can send and receive 150 pages per month. Unlike some other email to fax applications, eFax tracks sent and received pages separately. In other words, Plus subscribers get 150 sent pages and 150 received pages per month for a total of 300.",
    "Pro raises these limits to 200 each, but it’s identical to Plus in every other way. Both Plus and Pro come with a $10 setup fee. Along with providing more pages, Corporate plans are HIPAA compliant, offer an optional Business Associate Agreement, and come with an API to integrate eFax with other apps.",
    "However, we've experienced repeated problems accessing their pricing page over the past couple of weeks, and despite emailing the company haven't heard back from them about this.",
    "With eFax, you can send faxes in several ways. First, you can access the eFax website and send a fax from the dashboard. You can also create contacts to keep track of ongoing recipients.",
    "It also supports email to fax, enabling users to send faxes using their email client. Additional options include the mobile app (available on both iOS and Android) and the eFax Messenger app for Windows 10.",
    "eFax Messenger offers other helpful features along with the ability to edit and send faxes. For example, you can use the Print Driver to quickly convert any document on your computer into a fax. The app can also receive contacts from your email client to streamline the process of sending documents.",
    "When you sign up for eFax, you’ll have the opportunity to select a fax number and connect your email address. The service requires a credit card number to create an account, even if you’re signing up for a free trial.",
    "You can send and view faxes immediately after creating an account. There’s very little setup involved in sending faxes through the website, app, or your email client.",
    "If you want to send faxes from your computer without using the website, you can also install eFax Messenger. Unfortunately, this application is only available for Windows 7, 8, and 10, so Mac users will need to send faxes online or via email.",
    "The eFax website has a relatively basic design, but both eFax Messenger and the mobile app look more modern. That said, it’s easy to view and manage faxes regardless of how you’re accessing eFax.",
    "eFax streamlines the process of sending faxes, so you can send documents in just a few seconds. The service supports up to 50 recipients for a single fax along with the option to create a cover page. Documents should arrive within a few seconds of being sent. You’ll receive a confirmation email once your fax goes through.",
    "eFax offers robust security measures, and Corporate users gain access to enough protection to comply with a variety of standards including HIPAA, GLBA, and 256-bit TLS. While Plus and Pro users don’t get the same security options, faxes sent online or through the mobile app are still encrypted in transit.",
    "Plus and Pro users can add more protection by contacting customer support to activate eFax Enhanced Security. Users with Enhanced Security won’t receive faxes in their inboxes. Instead, eFax will email you when faxes are available and link you to view them on the website, which is secured by a TLS connection.",
    "The eFax Help Center is the first place to look if you run into any issues while using the service. It contains guides for setting up and using eFax, adjusting preferences, and more.",
    "While there aren’t any help forums, you can contact eFax support directly if the Help Center doesn’t have the answer you’re looking for. Help is available via phone and email, but there’s no information about support hours or turnaround times. 24/7 technical support and a dedicated account manager are provided for Corporate users.",
    "Fax.plus is significantly cheaper—while the eFax Plus plan costs $16.95 per month (plus a $10 setup fee) for 150 sent and 150 received faxes, Fax.plus Premium comes with 300 combined pages per month for $11.99 with no extra fees. SRFax, another popular application, provides 500 combined monthly pages for just $9.95, just over half the cost of eFax Plus.",
    "Fax.plus is also designed for large teams. Slack integration and an admin panel with team management features are available in the Business tier ($19.99) and above. With competitive pricing and combined limits for sent and received faxes, Fax.plus is arguably a more cost-effective option.",
    "While it doesn’t have the best presentation, eFax provides everything small and large businesses need to send and receive faxes without a fax machine. You can send faxes through the website, mobile app, eFax Messenger app, or your existing email client via email to fax.",
    "Unfortunately, eFax tracks sent and received faxes separately. While this won’t affect businesses that do both equally, it adds unnecessary costs for companies that primarily send or receive faxes. That said, this is a relatively minor concern. All things considered, eFax is a great option for businesses of all sizes, but it's not the most cost-effective one."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features and utilities",
    "9": "Setup",
    "12": "Interface and performance",
    "14": "Security",
    "16": "Support",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "Fax machines": "https://www.techradar.com/news/best-fax-machines",
    "Online fax software": "https://www.techradar.com/best/best-online-fax-service",
    "eFax": "https://efax-emea-countries.sjv.io/c/221109/417607/7450?subId1=trd-us-1211550647723411500&sharedId=trd-us&u=https%3A%2F%2Fwww.efax.co.uk%2F",
    "website": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Android": "https://www.techradar.com/best/best-note-taking-apps-android",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "credit card": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Mac": "https://www.techradar.com/best/best-business-mac",
    "Fax.plus": "https://www.techradar.com/reviews/faxplus",
    "SRFax": "https://www.techradar.com/reviews/srfax"
  }
}