{
  "source": "https://www.techradar.com/reviews/hp-envy-x360-13-2019",
  "title": "HP Envy x360 13 (2019) review",
  "category": "computing",
  "updated": "2020-12-11T03:13:16Z",
  "author": "jeremy-laird",
  "summary": "HP gives its slimline 2-in-1 laptop an AMD upgrade",
  "verdict": "HP gives its 13-inch slimline 2-in-1 Envy x360 laptop a battery life boost courtesy of an upgrade to the latest AMD mobile CPU.",
  "pros": [
    "Slim and sleek for a 2-in-1",
    "High quality chassis",
    "Improved battery life"
  ],
  "cons": [
    "CPU performance merely adequate",
    "Graphics performance disappointing"
  ],
  "article": [
    "In a way, the HP Envy x360 13 (2019) is a new laptop. Make no mistake: the Envy line itself isn’t entirely new and has been around since the early 2000s. However, while its previous version made do with the AMD Ryzen 2000 series chip, this 2019 model comes with one of AMD’s newer mobile offerings from its 3000 APU line.",
    "Of course, since the previous version of the Envy x360 13 didn’t exactly blow us away, the HP Envy x360 13 (2019)’s success now hangs in the balance of this new mobile processor. So, has AMD upped its game enough for this portable to impress us? Will its integrated AMD Vega graphics throw a bit of light gaming capability into the equation? More importantly, will a nicely engineered 2-in-1 13-inch laptop offer an intriguing alternative to the obvious Intel-powered options, including the Lenovo Yoga 920?",
    "When it comes to battery life, the HP Envy x360 13 (2019) is certainly an improvement over its predecessor – and, that’s courtesy of this new chip. But, is its performance up to par? Read our review to find out.",
    "The revised HP Envy x360 13 is fresh out of the blocks and pricing has yet to settle. In the US it’s currently a steal in this configuration with the AMD Ryzen 5 3500U CPU and 8GB of RAM at just $699.",
    "UK pricing hasn’t been released, though the equivalent previous generation model with the AMD Ryzen 5 2500U is listing at £799. We’d expect that to come down pretty shortly, so UK buyers may want to hold out a little after initial availability. In Australia, meanwhile, you’re looking at around AU$1,799.",
    "The US price compares fairly favourably with the obvious alternatives. The Dell Inspiron 13 7000 2-in-1 can be had a little cheaper with an AMD chip. But it’s not quite as upscale a laptop, lacks thin bezels and has yet to be launched with AMD’s 3000 series chip.",
    "The Lenovo Yoga 920 will typically set you back an additional $150 to $200 for a comparable specification, though that is a 14-inch model and exclusively powered by Intel CPUs.",
    "With its anodised all-aluminium chassis, the HP Envy x360 13 does a pretty passable impression of a true high-end 2-in-1 portable. As reviewed it tips the scales at under $700 Stateside and will probably soon be available for under £700, so that’s not a bad trick. After all, Dell’s XPS 13 2-in-1, to take one premium example, starts at not far off double the money.",
    "In terms of build, the HP Envy x360 13 (2019) feels solid and sturdy with little to no flex in the chassis. The same goes for its 360-degree hinge, allowing for conversion into tablet mode. You get the sense it’s been engineered to last.",
    "With slim bezels on two out of three sides of the display, the HP Envy x360 13 is reasonably compact, too. However, the Envy’s bottom bezel makes for a hefty old chin. It’s most noticeable in table mode, even if it’s an issue shared with most 2-in-1 convertibles. The recent trend for near all-screen laptops has yet to trickle down to the 2-in-1 segment.",
    "Subjectively, the HP Envy x360 13 also feels at least as slim and sleek as the likes of, say, the Lenovo Yoga 920, despite the fact that the official numbers say otherwise. That said, it’s still just thick enough to offer a pair of full-size USB Type-A ports in 3.1 spec.",
    "There’s also a USB Type-C socket and a microSD reader. While the full-sized USB ports will score points with those averse to using dongles, it’s worth noting that the single USB-C port doesn’t support charging, which is a pity.",
    "All told, HP Envy x360 13 weighs in at 1.27kg which makes it eminently portable and means there’s isn’t too much penalty to be paid for the 2-in-1 convertible functionality.",
    "Elsewhere, HP has also teamed up with Bang & Olufsen for the sound system. Improved audio is always welcome, but in this case the relatively wide speaker grille above the keyboard has a knock-on effect. It means the track pad below is shallower than we would have preferred.",
    "If you’re used to a really large trackpad, you’ll find the Envy’s quite restrictive, that’s for sure.",
    "Speaking of those Bang & Olufsen speakers, their performance is pretty disappointing. The likes of a 12-inch Macbook, which is a thinner and lighter device, knocks out not only more volume but also much better definition. Not all tie ins with audio specialists, it seems, truly deliver.",
    "As for the HP Envy x360’s 13-inch touch screen, it’s about as good as you could reasonably expect at this price point. Thanks to IPS technology, colors are accurate and the viewing angles of the panel itself are excellent, while maximum brightness levels are good though not stellar and the Gorilla Glass cover does introduce some reflections.",
    "The native 1,920 by 1,080 resolution is a limiting factor in terms of outright detail and font sharpness. But it’s still a pleasing display and a higher resolution panel would have an impact in terms of both price and battery life."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "15": "Sound and vision"
  },
  "links": {
    "Lenovo Yoga 920": "https://www.techradar.com/reviews/lenovo-yoga-920-review",
    "Dell Inspiron 13 7000": "https://www.techradar.com/reviews/dell-inspiron-13-7000-2-in-1-2018",
    "Dell’s XPS 13 2-in-1": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2019"
  }
}