{
  "source": "https://www.techradar.com/reviews/gotrusted",
  "title": "GoTrusted VPN review",
  "category": "computing",
  "updated": "2020-10-20T15:27:24Z",
  "author": "sead-fadilpasic",
  "summary": "A slightly expensive and secretive but reliable service",
  "verdict": "GoTrusted could do some things better, like providing more details about its platform, offering lower rates for longer subscriptions, supporting more than one simultaneous connection, as well as guaranteed unblocking of the popular streaming channels. However, if you’re willing to pay what it’s asking, you’ll be getting a fast and reliable service with helpful and friendly customer support just one click or phone call away.",
  "pros": [
    "Excellent speeds",
    "Risk-free trial",
    "Patented encryption",
    "Phone customer support",
    "User-friendly"
  ],
  "cons": [
    "A bit expensive",
    "Doesn’t guarantee access to Netflix, iPlayer",
    "Only 1 simultaneous connection"
  ],
  "article": [
    "GoTrusted is a US-based VPN provider that has been online since 2005, making it a veteran in this particular field. It provides unlimited and fast service on an undisclosed number of servers in roughly 70 locations and protects your privacy using all the major protocols accompanied by its patented technology.",
    "This VPN vendor keeps things modest in terms of its app features and details it provides publicly so if you’re looking for something better, there are plenty of great solutions listed (and tested) among the best VPN services.",
    "The provider offers three pricing options and they are all accompanied by a 7-day risk-free trial, allowing you to take the platform for a test run before deciding to keep it or not. You won’t even be charged for the duration of this trial, you’ll only need to cancel the subscription before the time is up.",
    "Only one session per account is allowed at the same time, but you can install the service on as many devices as you like.",
    "As for the pricing, the cheapest and most popular option would be to go for the annual subscription at the price of $7.49/month (billed $89.88 every year), but there are also shorter (and more expensive) plans. The 6-month subscription would cost you $8.75/month, while the monthly has a price tag of $9.95/month. These rates place GoTrusted on the more expensive end of the VPN spectrum.",
    "It also has group pricing options at the price of $6.99/month/user and you’ll get one month free of charge if you select yearly pricing. Default user groups count five, 10, and 25 individuals, but you can also ask for a customized option by contacting customer support.",
    "While GoTrusted is undoubtedly fast and secure, other players in the VPN field outperform it in other areas. For instance, NordVPN, Surfshark, and CyberGhost are all cheaper, richer in features, fully transparent, and guaranteed to give you access to the likes of Netflix anywhere in the world. The same goes for ExpressVPN, which is slightly more expensive but worth it as it provides the best VPN service on the market at this time.",
    "Accessing major streaming services like Netflix, Hulu, BBC iPlayer, and Amazon Prime Video in areas where they might be blocked is one of the most desirable features of a VPN. That said, GoTrusted makes no guarantees to unblocking all streaming services, “but always works to make access possible”. This means that you should consider other solutions if access to such services is the primary reason you’re looking for a VPN.",
    "GoTrusted is a company registered in Stuart, Florida. Its website is pretty stingy with information so we had quite a few questions for its customer support. The company has 70+ server locations in various parts of the world, including in India, Chile, Israel, South Africa, Turkey, Mexico, and more. Its policy is not to openly list its servers, server locations, and IP addresses as “that it makes it easier to block our services”. The apps have lists of popular countries but you can get additional locations by contacting the support team.",
    "GoTrusted’s website mentions that it protects your privacy with the use of “patented encryption”. We inquired for more details and we got the response that the provider publicly supports L2TP, PPTP, and IPSec, as well as variations on OpenVPN and its own patented proprietary VPN protocols.",
    "Torrenting/P2P traffic is allowed but GoTrusted advises users against it, “since they usually are seeded by bad actors looking to send DMCA notices”. Fair enough.",
    "The provider claims to not monitor individual session traffic, with the exception for the purposes of general network performance monitoring. It specifies it may “gather data on connection information, including the timing and size of all packets sent over the Internet during a session”. This doesn’t sound bad although it would be great if the provider invited an outside auditor to test and confirm these claims. Also, the location of the company is the USA, the country whose government has a poor reputation for keeping its nose outside people’s business, so caution is advised.",
    "The provider has apps for Windows and Mac. There are no apps for Android or iOS, but these devices can still be equipped with the VPN service with the help of the provider’s detailed manual setup instructions or customer support.",
    "Its support section isn’t very plentiful but if you need help with anything, you can contact customer support via online chat, email, or even telephone. We waited about two days to get a response from customer support to some of our questions via email but we did find out everything we wanted.",
    "GoTrusted is very easy to download and install. Switching between servers, however, isn’t as quick and easy as with some, as you’ll have to disconnect first, go to the app’s settings and choose a new server, then connect to it. Nevertheless, this is just a minor inconvenience, and the platform does great in terms of download speeds.",
    "The app automatically connected us to a server in Delaware, US. The download speed was a low 7.77Mbps which later increased to a much more acceptable 13Mbps on a 35Mbps testing connection. We also tried a closer location - Paris, France, which gave us a very good 19Mbps.",
    "GoTrusted doesn’t provide lots of details on its services but instead offers a risk-free 7-day trial to let you see what it can do first-hand. Its features and options aren’t many, which might appeal to beginners, but leaves a lot to be desired for those who want to tinker around with the settings and customize the service. On top of that, it’s a rather expensive solution considering it can’t guarantee you access to popular streaming channels.",
    "Therefore, if you want the ultimate and truly complete experience and you don’t mind paying more for it, then an advanced solution such as ExpressVPN is a better choice."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "12": "Support",
    "14": "Speed and experience",
    "16": "Verdict"
  },
  "links": {
    "GoTrusted": "https://www.gotrusted.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-5058423096446295000"
  }
}