{
  "source": "https://www.techradar.com/reviews/realme-7-5g",
  "title": "Realme 7 5G review",
  "category": "phones",
  "updated": "2020-12-02T15:22:37Z",
  "author": "jon-mundy",
  "summary": "Another fine budget phone from Realme",
  "verdict": "The Realme 7 5G makes it a trio of classily competent affordable phones from the manufacturer. Like the Realme 7 and Realme 7 Pro before it, this is a well-balanced phone with an appealing design and decent performance - this time with the added bonus of a 120Hz display.",
  "pros": [
    "120Hz display",
    "Solid build and appealing design",
    "Large 5,000mAh battery"
  ],
  "cons": [
    "Cameras not at Pro level",
    "LCD not AMOLED",
    "Mono speaker"
  ],
  "article": [
    "Realme has bombarded the budget phone market in recent months with the Realme 7, the Realme 7 Pro, and now the Realme 7 5G.",
    "Despite its shared name and superficial similarities, this latest model isn’t merely a tweaked take on one of its brothers. For all intents and purposes, this is the China-only Realme V5, but with a faster chipset and a higher refresh rate display.",
    "This subtly different path means that the Realme 7 5G clashes a little with the Realme 7 Pro. It’s better in some ways, and worse in others.",
    "Realme’s refined design work continues here with an appealing split-mirror finish that’s just flashy enough, without straying into gaudy territory. This is a weighty, solid-feeling phone too, with barely a hint of the plasticky cheapness that often affects the sub-$300/£300 smartphone category.",
    "The headline feature, however, is a double take-worthy 120Hz display. We’re used to seeing such rapid refresh rates on flagship phones, and it’s certainly impressive seeing such a spec trickle down to a more accessible price point.",
    "This choice to emphasize refresh rate means that you lose out on the benefits of AMOLED, which is a compromise we’re not sure we’d make given the choice. But choice is precisely what Realme is giving you, and those in the ‘hertz til it hurts’ brigade will lap it up.",
    "You’re dealing with a reasonably strong performer here too. MediaTek’s Dimensity 800U does more than provide 5G connectivity - it also outperforms many of its silicon rivals, and even matches the Realme 7 Pro. It’s aided by a clean UI that doesn’t lay on the bloat, which we appreciate.",
    "There are no surprises when it comes to the Realme 7 5G’s camera performance, for better and for worse. It takes reasonably balanced shots in good lighting, but the quality falls off in more demanding conditions, and the macro lens is a waste of space.",
    "It’s good to see Realme backing up that fast display refresh rate with a sufficiently meaty battery. At 5,000mAh, you’ll get through a full day with plenty to spare - and possibly a second if you don’t hit the media too hard.",
    "All in all, this is another strong budget effort from Realme. If you like the sound of the Realme 7 or Realme 7 Pro, but demand fast network performance and an even faster display for similar money, give it a closer look.",
    "The Realme 7 5G hit UK retailers on November 27, 2020, at a price of £279 (around $370 / AU$505). Just the one configuration is available, with 6GB of RAM and 128GB of storage, though some territories will have the option of 8GB of RAM.",
    "We don’t know if the Realme 7 5G is headed for the US or Australia at the time of writing. An earlier conversation we had with Realme CEO Madhav Sheth suggested that the company wanted to crack Europe before turning its attention the US, so we wouldn’t expect an imminent rollout.",
    "UK customers can buy the Realme 7 5G direct from the Realme website. It's also available from Amazon, where at the time of writing it's just £229 (roughly $305 / AU$415).",
    "Realme has gently refined its budget phone design language for the 7-series, with a more chic look than previous entries.",
    "Like the Realme 7 and the Realme 7 Pro before it, the Realme 7 5G has a stylish metallic-mirror finish to the rear panel. The split effect gives two subtly different sheens, reflecting vertically on the left and horizontally on the right, and offset in favor of the latter.",
    "The rear panel feels encouragingly premium, with little give and an almost satiny texture. At 195g and 9.1mm thick, meanwhile, the phone sits dead in the middle of the Realme 7 Pro and the Realme 7.",
    "Like the Realme 7, you get a side-mounted fingerprint sensor stashed behind the power button on the right edge. Though this isn’t generally considered to be as advanced a component as an in-display sensor, it benefits from being fast, reliable, and easy to locate. We’d take that over a second tier in-display alternative any day.",
    "Around the front, the Realme 7 5G looks much like its brothers, with a dominant 90.5% screen-to-body ratio, a punch-hole selfie camera, and a noticeable chin.",
    "There doesn’t appear to be any form of IP certification here, but Realme claims that all of the the phone’s ports are tightly sealed by protective silicone, which should protect the innards from the odd splash of water.",
    "The Realme 7 5G would appear to contain the same 6.5-inch LCD display as the Realme 7 and the Realme 6 before it. That includes the exact same 1080 x 2400 ‘FHD+’ resolution, with 405 pixels per inch.",
    "We’re a little disappointed that we don’t get the AMOLED display of the Realme 7 Pro here, if we’re honest. The LCD here is perfectly fine, but everything is noticeably more muted compared to even a basic AMOLED, and it looks a little washed out in bright outdoor conditions.",
    "Choice of panel aside, there’s one standout feature of this display: a 120Hz refresh rate. That’s double the Realme 7 Pro, and a little faster than the Realme 7. It puts the Realme 7 5G display in amongst a much more expensive and prestigious band of handsets.",
    "It does feel a smidgen more responsive than the 90Hz display of the OnePlus Nord N10 5G, aided by a 180Hz sampling rate. But we only came to that conclusion after holding these budget phones side by side, alternating rapidly between the two.",
    "Indeed, with the limited hardware running this phone, there’s an argument to be made that a 120Hz refresh rate is somewhat superfluous here. It’s a feature that makes a lot more sense when supported and surrounded by other powerful components.",
    "The Realme 7 5G isn’t slow, as we’ll go on to discuss, but it certainly lacks the necessary grunt to run 3D games at blistering frame rates. Web content doesn’t always load in and respond quite as sharply as with more powerful handsets, either, which lessens the impact of a high refresh rate display.",
    "Still, we’re impressed that Realme has worked such a premium component into its latest budget offering. We’d probably rather have the Realme 7 Pro’s 60Hz AMOLED than the Realme 7 5G’s 120Hz LCD, all things considered, but it’s nice to have the choice.",
    "The Realme 7 5G would seem to pack an identical camera setup to the Realme 7. And that’s no bad thing, by and large.",
    "Ostensibly a quad camera setup, it pairs a 48MP f/1.8 Samsung S5KGM1ST sensor with an 8MP f/2.3 119-degree ultra-wide one. These main sensors are then complemented by a macro sensor and a black and white portrait sensor that provides depth and contrast data. Both are 2MP.",
    "In general, well-lit conditions, we were reasonably happy with the Realme 7 5G camera’s output. It tended to capture well-balanced scenes, albeit with slightly punched up colors and the odd overexposed background element. Close-ups and portraits are pleasingly sharp and full of bokeh, with the depth sensor seeming to earn its place.",
    "The ultra-wide camera does an adequate job too, though the general tone of its shots looks quite a bit less natural and crisp than with the main sensor, and it gets extremely soft at the edges. Again, this is not unusual in a cheaper phone.",
    "We’re no fan of dedicated macro lenses on smartphones - especially ones that are unhelpfully low-megapixel, and included seemingly just to boost the official lens count. While this one does admittedly enable much closer up shots than the main sensor can manage (around 4cm), the results are so grainy as to be rendered pointless.",
    "There’s a night mode here, but we found it to be a little inconsistent. On several occasions, in very dark scenes, it would flat out refuse to initiate the 3–4 second exposure time necessary to brighten things up. When it did activate, it didn’t always compensate very well for our hand movement, even with dead-static scenes.",
    "When it did work, night mode managed to brighten up a series of late night street scenes quite effectively. But generally speaking, decent night modes continue to be the preserve of flagship phones and the Google Pixel 4a.",
    "There’s a 16MP f/2.1 selfie camera here too, which should do the trick nicely. And video recording will stretch to a decent spread of 4K/30fps, 1080P/120fps, and 720p/240fps modes.",
    "All in all, the Realme 7 5G holds its own as a budget camera offering. But if photography is particularly important to you, then the Realme 7 Pro is a better bet.",
    "The Realme 7 5G runs on the MediaTek Dimensity 800U, a new mid-range 7nm chip from the Taiwanese semiconductor maker.",
    "Aside from being 5G-ready, the Dimensity 800U represents a healthy power boost over the previous Dimensity 700 series. According to Realme, that includes 1.4x faster app launch times, 11% faster performance in CPU benchmarks, and 28% faster performance in GPU benchmarks.",
    "Our own benchmark tests reflected this uptick in performance. An average multi-core score of 1,780 in Geekbench 5 certainly beats the Helio G95-powered Realme 7 on 1,625. It also pips current budget darling the Poco X3 NFC with its Snapdragon 732G on 1,699, and matches the performance of the Realme 7 Pro.",
    "Backed by 6GB of RAM, we certainly didn’t experience any major issues with day to day tasks. Everything flies by nice and smoothly, even with that 120Hz refresh rate active. No, it’s not as silky smooth an experience as with a premium 120Hz phone like the OnePlus 8T. But the fact that the Realme 7 5G is running at this speed at all is pretty impressive.",
    "Gaming performance is very good too. PUBG defaults to HD graphics and high frame rate settings by default, and it largely maintains a smooth (if not stutter-free) gameplay experience. Intense 2D games like Dead Cells and Juicy Realm also perform admirably, the latter on maxed out settings.",
    "You don’t get the benefits of the Realme 7 Pro’s stereo speakers with these games, sadly, so you’ll have to make do with a bottom-mounted mono setup. You do get a 3.5mm jack, at least.",
    "An ample 128GB of storage should see to all your app and media needs, though we should probably sound a note of caution around that new(ish) Dimensity 800U CPU. We couldn’t get Netflix to run during our time with the phone, suggesting that app support might not be quite as universal or as speedy as with more mainstream Qualcomm chips.",
    "Realme’s custom Realme UI isn’t a particularly distinctive take on Android 10, but like the Vivo Y70, it benefits from keeping things simple.",
    "The home screen is clean and uncluttered, with simple icons and familiar menus, and Google Feed situated to the left. It’s packed full of Google apps, too, with just a small handful of homegrown options and bundled extras like Facebook and WPS Office to do with as you wish.",
    "Just like the Realme 7, the Realme 7 5G benefits from a huge 5,000mAh battery. This will ensure a day of comfortable usage without any fretting over running out of juice.",
    "There are a couple of variations this time around, however. Chief among those is a faster 120Hz display refresh rate, which will inevitably take its toll.",
    "Perhaps this explains why the Realme 7 5G lost 11% of its charge after 60 minutes of video streaming with the screen brightness set to max. The Realme 7 lost the same about after 90 minutes of video playback.",
    "Of course, it’s never a precise art measuring battery drain in this way, with several factors coming into play. In general, stamina simply won’t be a concern for the vast majority of users.",
    "Especially not with Realme’s Dart Charge plug bundled in. Just like the Realme 7, you get a 30W charger in the box, which Realme claims can get you from 0 to 100% in just over an hour.",
    "In our practical experience, we were able to get from 33% to 91% in 30 minutes, which is pretty good. Not as good as the Realme 7 Pro, with its 65W charger, but good nonetheless.",
    "First reviewed: December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Realme 7 5G release date and price",
    "13": "Design",
    "19": "Display",
    "26": "Camera",
    "35": "Specs and performance",
    "44": "Battery life",
    "50": "Don't buy it if..."
  },
  "links": {
    "Realme 7": "https://www.techradar.com/reviews/realme-7-review",
    "Realme 7 Pro": "https://www.techradar.com/reviews/realme-7-pro-review",
    "Realme website": "https://www.realme.com/uk/realme-7-5g",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08MQ1CJ1G%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2699274166084102000-21",
    "OnePlus Nord N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "Vivo Y70": "https://www.techradar.com/reviews/vivo-y70-review"
  }
}