{
  "source": "https://www.techradar.com/reviews/videoshow",
  "title": "VideoShow review",
  "category": "computing",
  "updated": "2020-11-18T19:03:36Z",
  "author": "steve-paris",
  "summary": "A free video editor for iOS and Android",
  "verdict": "VideoShow shows potential as a multi-platform mobile video editing app, but is marred by artificial limitations and a constant push to get you to pay for a subscription.",
  "pros": [
    "Good range of tools",
    "Easy to use",
    "Intuitive"
  ],
  "cons": [
    "Must agree to have personal data shared",
    "Riddled with ads",
    "Constant push to get a paid subscription",
    "Unnecessary restrictions"
  ],
  "article": [
    "VideoShow is a video editor that comes in multiple flavours. There’s a free app, and a paid-for “Pro” version. Depending on which mobile platform you’re on, the price of going Pro varies greatly: as of this writing, on Android via Google Play, it’s $24 (£18.49). On iOS, it’s an eye watering $59.99 (£54.99). That’s a heck of a lot for a mobile app, especially when there are so many cheaper or free alternatives - like the free version of VideoShow itself. This could be a case where having adverts might be well worth it?",
    "With that in mind, we explored the free version of VideoShow on iOS.",
    "First impressions weren’t ideal: you have to agree to the app’s terms and conditions wherein they let you know that not only will they be collecting information from you, they will share that personal data with others. You can’t try the app out without agreeing to this, so we did, but it left a bad taste in our mouth.",
    "The interface is divided into sections.",
    "At the top of the screen are Materials, Collage and Template, three menus designed to get visual and audio effects for your projects. This includes themes, subtitle effects, transitions, stickers, etc. A handful are installed by default, but you’ll no doubt need more, so you’ll need to browse through the library to choose those that interest you.",
    "A few are only accessible should you upgrade to a paid subscription, but most are free. Each time you download an effect, you’re presented with an add. They even try to entice you to give the app a 5-star rating in exchange for some free material. For instance you can’t download the most basic of transitions, “Dissolve”, without giving the app 5 stars….",
    "It does get tedious after a while, but it’s just how the app is designed: to wear you down until you give in and buy the app, or give up.",
    "Having grabbed a handful of Materials, we thought it was time to see how the editing side of this video editor works, so we tapped on the big orange ‘Video Edit’ button.",
    "Choosing media from your device’s photo library is easily done: scroll through and tap on the ones you’d like to use for your project. It’s a shame that your media isn’t separated between photos and videos - you’re just stuck scrolling through the whole lot, although you have access to individual albums which might help you find what you need quicker.",
    "One thing you need to be aware of is VideoShow won’t let you work with 4K video. The maximum is HD. If you have 4K footage, VideoShow will instruct you to get a",
    "Having selected appropriate and compatible footage, it’s time to add them to your project. You assemble your video by tapping on the clips. As you do so, they populate the bottom of the screen. You’re free to remove some by tapping on their grey ‘x’ and reorder them by tapping and dragging.",
    "Once you’re happy with your selection (don’t worry, you can amend it later on too), tap on ‘Add’.",
    "The interface changes to a more traditional interface for editing on a mobile device. The top of the screen is devoted to a preview of your project, with the lower half to the tools you need to polish your work.",
    "‘Clip Edit’ for instance allows you to trim or split a selected clip. You can alter its speed, slowing it down to ¼ or speeding it up 4 times. It’s also possible to Reverse the footage. The Zoom tool lets you crop a clip, and there are tools to rotate it 90 degree, or flip it.",
    "There’s also an ‘Adjust’ tool to perform some colour correction, but this is a premium tool that requires payment to use.",
    "Adding effects is easy and surprisingly versatile. In other mobile apps we’ve reviewed, adding text to a clip would force you to have it for the entire duration of said clip. There are ways around this of course, like cutting a clip to the right length, but this limits creativity and experimentation.",
    "VideoShow lets you select when the text will appear, and for how long. On top of that, its customisation options, are varied, allowing you to change the colour of your text, add an outline, change the font, even apply animations.",
    "The same is true for other effects, like filters, stickers, transitions, etc. You’ll also notice that you have direct access to the Materials section from each section, letting you quickly download additional options as and when you need them.",
    "As you’d expect there are a few premium tools, such as Mosaic, Scroll Text and Overlay. You are able to experiment with them to see how they perform, but the moment you confirm your changes, you’ll be asked to get a subscription, or remove the effect.",
    "Once you’re happy with your creation, it’s time to share it with the world, and the export feature will leave you disappointed: OK, we already established that you couldn’t work with 4K footage, HD being the highest resolution available with the free app. However you’ll notice that the export feature limits you to 480P or 720P. 1080P (ie HD) is a premium option. You’d think that if they were going to downscale your footage upon export anyway, they could’ve allowed you to work with your 4K footage. But no.",
    "It certainly feels like VideoShow is designed to get you to pay for it, sooner or later.",
    "Getting a subscription will remove all those pesky annoying adds, grant you access to all tools, allow you to work with and export high resolution footage.",
    "The price is either $19.99 (£21.49) per year, or $5.99 (£4.99) per month (the yearly option is so heavily discounted, the developers are clearly hoping you’ll go for it).",
    "Choosing either gives you have a three-day free trial, to make sure you’re happy with your purchase, after which your card will be charged. We did not try this ourselves.",
    "VideoShow has a lot of good tools on offer, and the interface is clear and easy to use. We weren’t happy with some artificial limitations, like not letting you edit in 4K when the exported film was going to be downscaled anyway, and we certainly didn’t like having to agree for our personal data to be shared with others.",
    "We feel there are less intrusive apps out there should you be in the market for a video editing solution for iOS or Android."
  ],
  "headers": {
    "3": "Getting started",
    "7": "Footage limitations",
    "10": "Editing a project",
    "15": "Effects",
    "19": "Export",
    "21": "Subscription",
    "24": "Final verdict"
  },
  "links": {
    "VideoShow": "https://videoshowapp.com/",
    "video editor": "https://www.techradar.com/best/free-video-editing-software"
  }
}