{
  "source": "https://www.techradar.com/reviews/robinhood",
  "title": "Robinhood review",
  "category": "computing",
  "updated": "2020-03-23T16:14:00Z",
  "author": "jitendra-soni",
  "summary": "Offers trading at zero commission",
  "verdict": "Robinhood offers a very easy to use platform which comes with its own limitations.",
  "pros": [
    "Mobile-first experience",
    "Clean and minimalist App",
    "Fractional shares",
    "Instant funding system",
    "Fast account opening"
  ],
  "cons": [
    "Limited investment options",
    "No demo accounts",
    "Limited product education material",
    "User data sales"
  ],
  "article": [
    "Robinhood was the first mobile-investing app to offer commission-free investment in the US. Almost every other company followed them to make the investment process easier and affordable for all.",
    "Even though it was founded in 2013, Robinhood has been able to create a solid base of over 10 million users transacting on its platform. Its biggest USP is the fact that it allows free trading in stocks, options and ETFs via a smartphone-based platform.",
    "It allows users to trade in over 3500 US stocks including the likes of Apple, Nike, Coca Cola, Netflix and many more. It has access to stocks listed on Nasdaq and NYSE.",
    "Robinhood also plans to offer savings accounts to the customers along with a higher interest rate, all this again for free.",
    "While Robinhood aims to be a mobile-first company, investors can use the web platform as well to invest in their preferred options. It offers a wide variety of investment options such as stocks, ETFs, Gold and Crypto. The best part is that trading in all these options is absolutely free, including Options trading, which normally is chargeable with other platforms. However, you cannot invest in mutual funds, bonds or even futures trading at the moment.",
    "Among other features, Robinhood doesn’t charge you for selling your investments or even transferring the money to your bank account. It does, however, charge a fee of $75 to let you transfer your account to some other broker or platform. This fee is not uncommon and most brokers levy such a charge to demotivate you from switching.",
    "Adding funds to your Robinhood account is simple and quick too. You can add funds the moment your account is activated. It offers instant verification with the bank to facilitate quicker transfer of funds. Up to $1000 can be added to your account instantly while any amount more than that takes a few days to process.",
    "Since the service is targeted at digital natives, there is no limitation of minimum amount to get started with. To open a margin trading account, you need to have a minimum portfolio of $2000, a Financial Industry Regulatory Authority regulation applicable on all traders.",
    "One of the most unique parts here is that Robinhood offers yield on the amount lying in your account. This can be compared to the interest offered by the banks in savings accounts. Although the rate fluctuates based on the interest rates, it is indeed a bonus for keeping some extra funds in your account.",
    "As mentioned earlier, Robinhood offers Options trading without any fees or contracts or any commissions. This is generally for experienced traders and Robinhood offers filters and trade strategies to help traders.",
    "Another program that the company offers is called Robinhood Gold. It allows you to invest in securities using borrowed money or margin. Under this program, the broker offers research and exclusive quotes on over 1700 companies and access to margin loans. This is a paid-for service and is available at a monthly fee of $5.",
    "This fee includes the interest of the first $1000 borrowed from Robinhood. Any loan amount beyond $1000 is charged at 5% annual interest rate. To get upgraded to Robinhood Gold you need to have a deposit of minimum $2000 in your account.",
    "Since Robinhood offers almost every thing for free, it does cut some corners which might impact users, especially the ones who are just starting. Limited research information or investor education is one such factor which might be a big trade-off for a starter. Though an experienced investor might not have to worry much about self education.",
    "Robinhood Snack is the company blog that you can subscribe to in case you want to read some interesting editorials, which have some easy to understand daily market summaries.",
    "The Robinhood mobile app is easy to use and offers everything that you need from any basic trading application. You get a watch list, charts, quotes, charts and analyst rating apart from news. Since this is a no-frills trading option, the features are fairly simple and offers you very limited information like last price and change in percentage, etc. Unlike other platforms, users are allowed to create just one watch list.",
    "The mobile app does not support horizontal layout, thus limiting the information available to you in one glance while using it in a vertical layout. The next biggest drawback of the application is that until you put money into a particular stock, you can’t set price alerts for that stock. This is not the most ideal way to monitor stocks.",
    "Users will find similar options on both the mobile app or the website. Since the service targets young users, the layout is minimal and easy to understand.",
    "Robinhood offers support via email only. Users are expected to use the self-help resources that are available via the FAQs listed on the website. Should you still need a human response to a query, then you can send an email to the support team. The lack of telephone support is almost certainly because of the service being free.",
    "However, on that point, one way Robinhood does make money includes selling some of your data, as well as paid gold membership, rebates from market makers and trading venues, income generated from cash and other mediums like a stock loan, and Interchange fees. Many seasoned traders may have an issue with their information getting sold to companies.",
    "Robinhood is able to attract the young and new investors with its zero-charge model. However, like all no-frills service come with some compromises, and Robinhood is no exception."
  ],
  "headers": {
    "4": "How to invest via Robinhood",
    "14": "Trading on Robinhood",
    "17": "Support",
    "19": "Final verdict"
  },
  "links": {
    "Robinhood": "https://robinhood.c3me6x.net/c/221109/748415/10402"
  }
}