{
  "source": "https://www.techradar.com/reviews/insta360-one-r",
  "title": "Insta360 One R review",
  "category": "cameras",
  "updated": "2020-03-04T05:10:01Z",
  "author": "andrew-williams",
  "summary": "Is this modular action camera the best of all worlds?",
  "verdict": "The Insta360 One R is a unique action camera that offers comparatively good value when compared to non-modular rivals like the GoPro Hero 8 Black and GoPro Max. Neither its standard 4K footage or 360-degree video are a match for those cameras, while its small screen and software issues also make it less user-friendly. But the modular design is a success and gives you the flexibility of adding further modules, like the One-inch Edition. If you're prepared to accept its foibles and compromises, it's a good option for those who want to dabble in both 4K and 360-degree video.",
  "pros": [
    "It’s two (or three) cameras in one",
    "Solid 4K and 360-degree image quality",
    "Largely successful modular design"
  ],
  "cons": [
    "Sub-GoPro image processing",
    "Very small screen",
    "Significant bugs at launch"
  ],
  "article": [
    "The Insta360 One R is a unique answer to the tricky question that's facing all action cameras in 2020 – how do you cram more tricks and shooting power into these little rugged video cams, without making them impractically big?",
    "GoPro's answer for the Hero 8 Black is its Mod accessories, which let you add a shotgun mic, bigger screen and LED light to the action camera when you need them. But Insta360, which is best known for its 360-degree video cameras like the One X, has taken a different, and highly ambitious, approach with the Insta360 One R.",
    "The One R is a truly modular action cam – one third is battery, another block is home to the controls and screen, while the last part is the lens and sensor brick.",
    "This style lets you choose one of three cameras to slot into the Insta360 One R – there’s a 4K action camera, similar to the GoPro Hero 8 Black, and the 360-degree camera is nearer to the GoPro Max.",
    "And there’s even a camera with a one-inch sensor. It makes the Insta360 One R one of the few rivals to the uncompromising Sony RX0.",
    "Some of you will be most intrigued in that last high-end camera module. But in this review we’ll look at the standard 4K one and the 360-degree cam, and ask whether they can really compete with the rival GoPros.",
    "The Insta360 One R is available to buy from today in various bundles.",
    "The standard One R 4K edition (with just the 4K camera module) costs $299.99 / £299.99 / AU$499.99, which undercuts the price of the GoPro Hero 8 Black.",
    "If you fancy having the versatility of a 4K action camera with the option of turning it into a 360-degree cam, then the One R Twin Edition might be for you. This costs $479.99 / £439.99 / AU$749.99, which is pretty reasonable when you consider it's only slightly more than an Insta360 One X.",
    "Slightly pricier is the premium one-inch Wide Angle Mod, co-engineered with Leica, which will set you back $549.99 / £519.99 / AU$849.99. We haven't tested this one-inch block out yet, but read on to find out more about the One R's 4K and 360-degree modules.",
    "We had two initial concerns about the Insta360 One R. Would the modular design make it huge? And would feel as if it was always about to fall apart?",
    "Both of these were unfounded. The Insta360 One R is only a bit bigger than a GoPro Hero 8 Black, and is surprisingly sturdy.",
    "There’s no tough locking mechanism to keep the control block and camera lens part together, but the One R feels rigid enough when you clip the battery base in at the bottom. Sure, the Hero 8 Black looks more accomplished, and its soft touch finish feels better too. But Insta360 has managed to make the modular design here seem almost practical, rather than a strange science experiment.",
    "When you want to switch lenses, you simply unclip the battery, pull the lens off and slot in your other module. It takes around 20 seconds.",
    "Insta360 has not thrown away water resistance for the modular dream either. It says the One R meets the IPX8 standard, and is resistant to five meters. This means accidental dunks are no problem and surface-level swimming may be okay, but you probably shouldn’t take it snorkeling. Those who want to take it diving will need to invest in Insta360's separate diving case.",
    "Now we come to the first of the Insta360 One R’s bad bits. Insta360 says the mounting case needs to be in place for the water resistance to count. It doesn’t actually cover all the ports, but presumably applies more pressure to keep the internal seals tight.",
    "You don’t need a case at all with a GoPro Hero 8 Black, and it is certified to 10m rather than 5m. We’re also slightly concerned about how the seals will cope with months or years of use, given this is a brand new design. Insta360 fires out inventive cameras at a rate of knots, and sometimes it pays to take things slower.",
    "The casing also means the Insta360 is, in a practical sense, not as small as it appears. This also introduces an area where the modular design is impractical. If the battery runs out mid-shoot, you need to unmount it, remove it from the case and actually take the camera apart. The GoPro Hero 8 Black’s side-loaded battery compartment is much more convenient.",
    "Luckily, you don’t need to go through the same rigamarole to swap microSD cards. There’s a little flap on the side for the slot, and the casing does not block it.",
    "The Insta360 One R’s screen introduces our second issue. It’s a 1.3-inch square display, similar to the front screen of the DJI Osmo Action.",
    "You use this to compose your shots and navigate the interface. And this is a lot to ask of such a tiny touch display.",
    "Shoot a 16:9 aspect video and the preview becomes even smaller. There was no comparison, using it side-by-side with the Hero 8 Black. The GoPro screen is far more comfortable to operate, and is no user experience revelation itself.",
    "Insta360 has some more work to do on the stability of the interface too. We have seen huge improvements in its performance, moving from a beta to the launch release. But scrolling through menus often results in unwanted scrolls all the way to the top or bottom, and flicking between the modes (stills, video and so on) is occasionally extremely erratic.",
    "Buy a Insta360 One R in the early days and you may have to wade through some irritating bugs for a while.",
    "Insta360 is clearly trying, though. For example, when you flick down from the top of the screen you get to a screen of settings toggles. When we first used the One R, there was no indication of what they did beyond the little icon. Now, when you tap them, a little prompt of their function appears.",
    "For all the improvement Insta360 can, and will, add, we’d still rather use the larger screen of a GoPro or DJI Osmo Action.",
    "The Insta360 One R dream is standard 4K video capture that can match the GoPro Hero 8 Black and 360-footage that rivals the GoPro Max. We are a way off that dream, but there are several things to like here. Let’s start with the 4K wide-angle camera, which is the 'normal' side of the One R.",
    "We went out to the park for a run to shoot side-by-side with the Hero 8 Black and One R. The sharpness and effectiveness of the stabilization, which Insta360 calls FlowState, are roughly similar. Both are great and the One R captures a lot of detail at 4K resolution in good lighting. The character of the video is quite different, though.",
    "The Insta360 shoots with significantly lifted shadows, bringing more detail out of the darker areas of the image. This initially makes the One R clips look brighter, with an HDR-like effect even when you do not use the HDR mode. The GoPro’s videos appear more contrasty, but lifting out shadow detail is one of the main things you might want to do in the edit.",
    "A victory for Insta360, then? Not quite. In other, perhaps more difficult areas, the GoPro is the clear winner.",
    "The Insta360 One R is far more susceptible to blurred frames and to shimmering textures. Those blurred frames can happen in reasonably decent lighting when there’s significant motion, and the shimmering effect occurs even when the camera is still, again, in reasonably good lighting.",
    "Why? It’s about the intelligence with which the camera handles itself. If the shutter speed is too low to deal with the camera’s motion, you’ll end up with blurred frames. And that shimmering effect is likely down to noise reduction algorithms that largely treat frames as single images, rather than analyzing how they appear in motion.",
    "Sometimes you’ll even see big parts of the scene (the tops of trees in our case) appear to dance around, as if the stabilization hasn’t applied to that part of the image. This looks completely deranged, like the One R has dropped some acid. We’ll assume for now it’s an unfortunate, if interesting, bug that may be ironed out by the time you read this.",
    "We also took some stills from motion-free footage in both the Hero 8 Black and Insta360 One R to take a closer look at their image processing. The Insta360’s rendering of detail is good, roughly a match for the GoPro up to the edge of the frame.",
    "However, the GoPro’s processing wins out when we take those frames into Photoshop, raise the shadows and look at the actual detail in there. Too often the Insta360 One R turns parts of natural textures into mush, where the GoPro holds onto more textural detail. This effect and the wider texture shimmer effect are likely all part of the same lower-tier image processing.",
    "The real-world result? While both cameras can produce very pleasing looking video, you have a lot more to work with when you take a GoPro’s footage into a pro-grade image editing application. For casual use they are not too far apart, but if you’re making short films rather than holiday video or bike ride memories, you’ll notice the difference.",
    "Removing purple color noise is one thing the Insta360 One R seems to do better than the Hero 8 Black, though. There’s almost none of it.",
    "How about the 360-degree footage? A lot of the same impressions apply.",
    "The 360-degree module shoots at up to 5760x2880 (5.7K) resolution, 30 frames per second. And Insta360 has nailed several of the essentials.",
    "Stabilization is excellent, and so is the stitching. You’ll just see a slight flutter pass over the image if your crop of a 360-degree video jumps over the border between the two lenses’ views. And, just like the GoPro Max, image sharpness drops off significantly towards the edge of each lens.",
    "However, we are perfectly happy with the results until you start shooting in lower light. At one point we shot the UK's Hammersmith riverside on foot, with the One R up on Insta360’s selfie stick.",
    "While the stabilization is great, it can’t get rid of the unsettling “judder” caused by those pesky blurred frames, caused by the motion of every footfall. The cable stays of a bridge appear to vibrate like guitar strings, and light sources pulsate.",
    "The GoPro Max is not immune to this effect, but it is less pronounced and distracting than in the Insta360 One R.",
    "So where do we end up? The Insta360 can’t take quite as good 4K standard action cam footage as the Hero 8 Black or as good 360-degree footage as the GoPro Max. But you can get a One R with both camera modules for less than the cost of a Max. We should also say that the Max’s 4K footage easily outclasses the Max’s 1080p non-360 video for detail and sharpness.",
    "You can’t simply pull video off the One R by plugging it into your laptop and dragging off the files. They need to be exported either through the mobile app (iOS available, Android incoming) or the Insta360 Studio app.",
    "This likely lets the camera enhance its editing and stabilization using much more powerful processing than the camera itself has. It’s a clever tactic, but adds another step to the process.",
    "Editing your 360-degree video is quite similar to the GoPro experience. You choose key points across the footage in the Insta360 app, selecting fields of view at that point. But instead of pinch zooming and rotating to get the desired frame, you choose one of five fields of view and then drag the view around.",
    "This is a bit more limiting than the GoPro style, but it is not distinctly worse, and is just as quick. There’s also a subject-tracking option in the edit, letting you keep a subject at the same spot in the frame, using object recognition. This is a neat way to get a professionally edited look with almost zero effort.",
    "The Insta360 One R cameras also have some fun extra modes. You can take HDR and non-HDR photos, capture a Time Lapse-style video and use four additional fields of view with the 4K camera. These are similar to the GoPro Hero 8 Black’s, minus the ultra-wide SuperView. You can also shoot slo-mo at up to 200fps (1080p) with the 4K camera.",
    "We shot a Time Lapse during a run, and the results are less sharp and clear than a GoPro TimeWarp, again perhaps thanks to that pesky frame blurring. The footage also looks less stabilized. However, at this speed that blur can seem like deliberate motion blurring.",
    "You can remotely control your Insta360 One R using the companion app, and this works pretty well. You’ll see a live preview on your phone screen, which lags by less than a second.",
    "There’s voice control too, but we unfortunately couldn’t get it to work. Just like the stabilization bugs mentioned earlier, this may be fixed by the time you read this.",
    "The Insta360 One R has two microphones, one fewer than the GoPro Hero 8 Black. We tested the audio recording quality of the two cameras side-by-side.",
    "Their tonalities are quite different, but we are perfectly happy with the mic quality of the Insta360. Recorded sound is not tinny or thin, and low bass frequencies are represented.",
    "However, the One R’s sound is much brighter (greater treble presence) than the GoPro’s, and this makes the noise bed much clearer. The GoPro may also have a cleaner signal path or better mics, resulting in less noise in real terms, but the Insta360’s bright tone won’t help.",
    "A light noise gate will fix all that, though, and we only noticed this so readily because we used studio headphones to compare the audio tracks.",
    "The GoPro is also better at picking up environmental sound than the Insta360 One R. This is no surprise, considering it has an extra mic.",
    "Insta360 also makes it easy to plug in your own microphone, as long as you buy an accessory. The Mic Adapter cable lets you plug in a 3.5mm microphone, and takes up the USB-C port. You can’t monitor the audio at the same time, though.",
    "The standard battery is a 1150mAh cell, just slightly lower capacity than the Hero 8 Black. Like most action cameras, it is easy to drain down in a day. If you take longer clips you should be able to get around 40 minutes recorded before it runs out. And a recharge takes just over an hour.",
    "Insta360 will also release a double capacity battery that, in a GoPro-apeing move, has built-in mounting fingers. This will, according to Insta360’s own documentation, worsen the water resistance. But it does mean you don’t need to (and can’t) use the mounting case. A 3D shooting mount is coming soon too.",
    "The Insta360 One R succeeds in areas that it could easily have failed in, coming from a company that fires out dynamic action camera designs at quite a rate. But it also trips up in predictable ways, particularly when compared to the more polished alternatives from GoPro.",
    "The One R doesn’t have the most stable software, and the screen will always seem a compromise. The handling of shooting parameters and image processing also takes some of the impact away from impressive-sounding techy standards like 100Mbps shooting (4K lens) and H.265 support.",
    "We’d still recommend GoPro cameras over an Insta360 One R for filmmaking projects and YouTubers who want the best image quality. However, let’s not forget the reality here. The Insta360 One R can capture great 4K video and solid 360-degree footage for less money, while the modular approach is largely a success and adds little to the thing’s size.",
    "It also doesn't just cost less than two GoPros – the dual lens bundle is cheaper than the 360-degree GoPro Max alone.",
    "The Insta360 One R may not be an unmitigated success, but it is certainly a success. Using one is only likely to get better as more software updates arrive too."
  ],
  "headers": {
    "6": "Insta360 One R release date and price",
    "10": "Design",
    "19": "Display and interface",
    "26": "Image quality (4K module)",
    "37": "Image quality (360-degree module)",
    "44": "Modes, editing and software",
    "52": "Battery life and audio",
    "60": "Verdict"
  },
  "links": {
    "Hero 8 Black": "https://www.techradar.com/reviews/gopro-hero-8-black",
    "One X": "https://www.techradar.com/reviews/insta360-one-x",
    "GoPro Hero 8 Black": "https://www.techradar.com/reviews/gopro-hero-8-black",
    "GoPro Max": "https://www.techradar.com/reviews/gopro-max",
    "Insta360 One X": "https://www.techradar.com/reviews/insta360-one-x",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review"
  }
}