{
  "source": "https://www.techradar.com/reviews/solarwinds-passportal",
  "title": "Solarwinds Passportal business password management review",
  "category": "computing",
  "updated": "2021-01-21T11:34:50Z",
  "author": "daniel-blechynden",
  "summary": "Secure password management backed by advanced features",
  "verdict": "All things considered, SolarWinds Passportal is a high-quality, reliable business password management program. It’s highly secure, comes with great administrative controls, and includes everything you need to look after your company’s credentials.",
  "pros": [
    "Highly intuitive user interface",
    "Great user access controls"
  ],
  "cons": [
    "No pricing information available",
    "Browser extension is quite basic"
  ],
  "article": [
    "SolarWinds Passportal is rated among the best business password managers across the web. It’s a powerful yet intuitive program aimed at high-end business users, and it comes with a selection of impressive features to make business password management fast and straightforward.",
    "In the rest of this Passportal review, we look at the main features of this program, explaining why it represents one of the best password recovery solutions available. We also look at its prices, user interface, security integrations, and more so you don’t have to.",
    "Unfortunately, SolarWinds doesn’t openly advertise the prices of its Passportal password management software. It’s available as a stand-alone product or as part of a larger SolarWinds software package, but you will have to contact the sales team to get a custom quote.",
    "However, there is a free trial available on request, so you can test the program before committing to a purchase. What’s more, online reports suggest that prices start from a relatively affordable $18 per user, per month.",
    "SolarWinds Passportal is backed by an impressive range of features that put it up there with the best business password management software on the market.",
    "For one, all users will have access to highly functional browser extensions. These are available for Chrome, Firefox, and various other popular browsers, and they provide impressive password management tools at the click of a button.",
    "Passportal also comes with a highly secure password generator. It enables you to create custom passwords when required, and it can even be set to change multiple passwords at once.",
    "As the system administrator, you can create clear user permissions that specify who within your organization is allowed to access what passwords. This is done through a folder system, where different passwords are stored in different folders. Then, you can simply set access permissions to these folders. What’s more, if someone feels like they need to use a password that they don’t have permission for, they can simply request access via their dashboard.",
    "If you take care of password management for clients, you can rebrand the Passportal interface with your own logo and branding. This allows you to provide high-quality, secure password management services under your own business name.",
    "The Passportal user interface is very neat and intuitive. Menu buttons across the top of the screen allow you to view notifications, access your saved passwords, and review management history. You can also search for various passwords or access credentials, add new login details, or edit existing entries.",
    "As the system administrator, you will also be able to manage access permissions and users via the menu on the left of the screen. Ordinary users will only have access to the My Vault and Company Vault portals, which are used to store and manage personal and company credentials respectively.",
    "There are various support services on offer to help you familiarize yourself with Passportal. All subscribers will be able to contact the customer support team via live chat, ticket submission, and phone. Before you subscribe, you will only have access to phone support, which is still quite impressive.",
    "What’s more, there are various self-help resources to help you get started with the program. The SolarWinds Customer Success Center contains various tutorials and how-to guides, along with comprehensive documentation. In addition, the company’s YouTube channel has some great videos outlining the functionality and setup procedures for Passportal.",
    "Like all the best password managers, SolarWinds Passportal is backed by a selection of powerful security features. For one, it uses secure, cloud-based hosting through the Amazon Web Services platform. This system is highly redundant and scalable, ensuring you always have access to your passwords and other credentials.",
    "All data is backed up with a point in time recovery system to secure servers. With this system, your information can be restored to any point in the past three months. The entire Passportal system is proactively monitored for vulnerabilities and security breaches, and any threats deemed serious are dealt with on a priority basis.",
    "Dashlane is one of Solarwinds’ main competitors. With extremely secure password management solutions, AES 256-bit encryption, and a powerful central management console, it’s a great choice for those looking for a highly functional and reliable program. And it comes in at a competitively priced $8 per month, per user.",
    "Another great option is LastPass, which is backed by advanced administrative controls and multi-factor authentication. Business plans start at $4 per user, per month, making it a highly affordable choice.",
    "Ultimately, SolarWinds MSP Passportal is one of the most powerful password management programs we’ve used. It has a number of advanced features, supports administrative control of large teams, and boasts powerful security integrations.",
    "On top of this, Passportal comes with great customer support, an intuitive user interface, and the power of the rest of the SolarWinds ecosystem (if required).",
    "The bottom line: If you’re looking for a high-quality, reliable password management solution for your business, we’d highly recommend looking closer at SolarWinds Passportal."
  ],
  "headers": {
    "2": "SolarWinds Passportal: Plans and pricing",
    "4": "SolarWinds Passportal: Features",
    "9": "SolarWinds Passportal: Interface and in use",
    "11": "SolarWinds Passportal: Support",
    "13": "SolarWinds Passportal: Security",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "SolarWinds Passportal": "https://www.solarwindsmsp.com/products/passportal",
    "best business password managers": "https://www.techradar.com/best/business-password-management-software",
    "best password recovery solutions": "https://www.techradar.com/best/password-recovery-solutions",
    "password generator": "https://www.techradar.com/best/password-generator",
    "best password managers": "https://www.techradar.com/best/password-manager",
    "Amazon Web Services": "https://www.techradar.com/news/aws",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "LastPass": "https://www.techradar.com/reviews/lastpass"
  }
}