{
  "source": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-fold-review",
  "title": "Lenovo ThinkPad X1 Fold review",
  "category": "computing",
  "updated": "2020-12-19T14:48:09Z",
  "author": "john-loeffler",
  "summary": "The future is definitely foldable, but it's still in the future",
  "verdict": "The Lenovo ThinkPad X1 Fold is a remarkable and gorgeous innovation, but its very underwhelming performance and battery life makes it hard to recommend for the price.",
  "pros": [
    "Beautiful foldable display",
    "Incredible form factor",
    "Full Windows 10 Home"
  ],
  "cons": [
    "Lousy performance",
    "Middling battery life",
    "Very expensive",
    "No headphone jack"
  ],
  "article": [
    "When we first looked at the Lenovo ThinkPad X1 Fold at CES 2020, we definitely saw it as the direction mobile computing was going to take in the coming years, and that is still very much the case - the Lenovo ThinkPad X1 Fold just isn't it.",
    "There is a lot about the Lenovo ThinkPad X1 Fold that we like – even love – but the kind of radical innovation it accomplishes comes at a very steep cost both in terms of price as well as performance and battery life.",
    "The Lenovo ThinkPad X1 Fold has an incredibly sleek and well-designed form factor. It's very hard to think of a laptop that isn't just a variation of every other clamshell laptop out there. The X1 Fold is more of a book than anything, an aesthetic that is reinforced by the leather back of the display.",
    "When folded, the X1 Fold could literally sit on a bookshelf and if anyone notices it at all, it'll be to say how classy it is – like an expensive, leather-bound hardcover of some important work. Leave it on a table and it catches the eye with it's slim, glossy strip along the edge, the Core i5 logo in the corner the only hint that this isn't a very expensive Moleskin journal.",
    "The Core i5 logo is deceptive though. The processor beneath the luxurious cover is more like a low-powered Celeron than an i5 you might be used to in any other laptop. The Intel Lakefield hybrid architecture allows the entire system fit in an ultra-thin, hinged, two-panel chassis, but it really doesn't hold up well to serious use.",
    "As a business-oriented device, the graphics performance might not be too much of a concern, but the general CPU performance - both single-core and multi-core - mean that you can do a lot of things with this laptop, you just need to do them all one at a time - and even then, it won't do it especially well.",
    "For the price, there are far, far better laptops out there, they just won't be foldable, or look as good as the Lenovo ThinkPad X1 Fold. That's probably the point, since this is definitely the kind of business device that is marketed towards a pretty specific kind of customer: those with money to drop on a device they don't really need to use very effectively but which will let them stand out in a crowd of similarly dressed business types tapping away on laptops in a conference room or in an airport waiting area.",
    "If that's you, this will definitely accomplish that goal. You are paying a premium here to be an early adopter, but you're going to be getting an early preview on the future of mobile computing the same way shoe-sized cell phones in the 1980s paved the way for the iPhone.",
    "The Lenovo ThinkPad X1 Fold is available now on Lenovo's site or through other retailers, but it's definitely not cheap. Starting at $2,499 / £2,519 / AU$3,799 (without the Bluetooth keyboard and, in the US and Australia, without the Lenovo Mod Pen), you'll have to spend at least $2,749 / £3,089 / AU$ 4,179 to get the X1 Fold with a stylus and keyboard.",
    "The only option on the X1 Fold is 8GB RAM, but from there, you can opt for either Windows 10 Home or Windows 10 Pro and a 256GB/512GB/1TB PCIe SSD, with the most expensive configurations costing you $3,099 / £3,209 / AU$6,199 (just note that in the UK, the most you can get is a 512GB SSD).",
    "As the world's first foldable laptop, it's hard to quite know how to describe the Lenovo ThinkPad X1 Fold. With the keyboard and stylus, it's a fully functional laptop, but that doesn't quite capture it. Without the keyboard and stylus, we'd be tempted to call the display or base configuration a tablet, because that's kind of what it is, but that really undersells the design.",
    "This is a fully functional Windows 10 64-bit laptop, so it doesn't run into the same compatibility issues that a Windows on ARM laptop has (the X1 Fold was able to run every single benchmark test we threw at it, for example, unlike a Windows-on-ARM system like the Lenovo Flex 5G), so we're definitely in some uncharted waters.",
    "The display, 13.3-inches at 2K (1536 x 2048) QXGA resolution screen with flexible plastic rather than glass, is beautiful to look at, generally speaking. When fully open, the middle \"seam\" is only noticeable if you look at it up close, though it is much more apparent when the screen is folded at all, with the blue background of the default Windows 10 wallpaper turning a much lighter shade of blue right down the middle. We didn't find it particularly distracting, but it's definitely there.",
    "The bezels around the screen aren't the largest we've seen but they're not the smallest either. They're also magnetized which allows the Bluetooth keyboard to \"dock\" with the screen, turning the X1 Fold into something very reminiscent of a netbook. The keyboard is very secure when docked, which is definitely a plus since magnetized connections can often be hit or miss.",
    "When secured, the screen shrinks automatically to just that part of it that's visible above the keyboard, so you still have access to the Windows 10 taskbar when the keyboard is docked.",
    "The keyboard itself is pretty tightly spaced and limited, but that isn't a surprise given the size it's working with. The keys are large enough that you can still hit them without accidentally hitting it's neighbors as well, something netbook fans will remember with either fondness of consternation.",
    "Thanks to Bluetooth, though, any Bluetooth-capable keyboard is useable with the X1 Fold, it just won't be able to dock the way the Fold's Mini Keyboard will.",
    "The stylus has 4,096 levels of pressure for precise control and can sense the tilt of the pen for more accurate shading when doing graphics work.",
    "When the keyboard is docked, the X1 Fold closes perfectly around it with the magnets securing it in place and the Mini Keyboard has an elastic fabric holder for the Mod Pen, so all together the X1 Fold is a highly portable machine even with the separate peripherals.",
    "In the case of the keyboard, this is definitely for the best, since making it thin enough to fit inside the closed X1 Fold also means it feels very flimsy on its own, like sitting-on-it-accidentally-will-snap-it-in-two kind of flimsy. How well it will hold up to abuse is an open question, since we treated it delicately so as not to break it. If you like throwing around your mobile peripherals in a cluttered bag, you really will want to be careful here.",
    "The X1 Fold has a very limited number of ports with only two USB Type-C 3.2 connections along the top and side of the display. There is also a Nano SIM slot for a network service provider to enable 5G/LTE connectivity.",
    "There is no headphone jack, so if you plan on using headphones, you need to use a Bluetooth connection, which could be an issue if you're using it during a flight.",
    "When closed, the X1 Fold looks like a book – seriously. The leather cover on the back of the display slides a bit to reveal a glossy black stripe of plastic along the edge that adds a cool aesthetic to it as well. We really can't stress how cool this thing looks and feels when it's closed.",
    "The kickstand on the back has a cool, red felt fabric on the inside, which pops out nicely from the black leather on the back. The stand holds up well but, this being a touchscreen, tapping the top-left of the screen too hard might rock the screen a bit, though it takes a good bit of force to actually knock it over.",
    "Finally, if you just get the X1 Fold on it's own without the keyboard, there is a virtual keyboard you can use with swipe-typing functionality, so if you're the type who can really work the virtual keys on your smartphone or tablet, you'll do well with this one.",
    "Lenovo's Vantage software is able to split the screen depending on whether the Fold is fully open or slightly folded, giving you two windows to work with when the device is folded, even allowing one of the two be the virtual keyboard space with the top being the main display, creating a virtual laptop of sorts.",
    "Across the board, the performance on the ThinkPad X1 Fold is pretty lackluster to pretty awful, depending on what you need it to do. The Intel Core i5 Lakefield SoC is a new hybrid architecture from Intel meant to shrink the size of their chips for use in mobile devices and ultra-ultra-thin laptops.",
    "Earlier this summer, leaked benchmarks of Lakefield showed that it fell well short of the advertised maximum clock speed of 3.0GHz and that it greatly underperformed Intel Amber Lake CPUs, despite Intel's promise that it would exceed it by about 12%.",
    "Unfortunately, the ThinkPad X1 Fold put up some of the lowest benchmark scores we've seen all year, confirming Lakefield's surprisingly poor performance – even when compared to the Qualcomm Snapdragon 8cx in the Flex 5G.",
    "In our Geekbench 5 test, the X1 Fold scored between 590 and 620 points, with an average score of 607, in single-core performance. Meanwhile, the Flex 5G's Snapdragon 8cx scored 83 points better, with an average of 690 points.",
    "The difference is even more stark when you look at it's multi-core performance. The X1 Fold manages to eek out 1,724 points, while the Flex 5G scored nearly a thousand points higher, with an average score of 2,661.",
    "On our 3DMark benchmarks - which, to its credit, the X1 Fold was at least able to run - it probably would have been better if it couldn't. It's Night Raid, Firestrike, and Time Spy scores just underscore how poorly the X1 Fold can process dynamic visuals. No one is expecting this to be a gaming machine, but even the Acer Swift 3 managed to break 500 on Time Spy and scores just over 1600 on Firestrike.",
    "And even as the Flex 5G's Snapdragon CPU handily defeats the X1 Fold's Core i5-L16G7, the Flex 5G absolutely destroys the X1 Fold on battery life. The Lakefield CPU surrenders a lot of power compared to mainstream Core i5 mobile CPUs in other laptops, but it gains virtually nothing for that sacrifice.",
    "Lenovo says that the X1 Fold's 50WHr battery is rated for 8.5 hours of battery life, but on our PCMark10 battery test, it fell about two hours shy of that time with an average life of six hours and 35 minutes. On our HD movie benchmark, it lasted 7 hours and 23 minutes.",
    "While the Flex 5G had some major issues around app compatibility (it couldn't even run the PCMark 10 battery test) and it isn't exactly a high-performance machine in it's own right, on our movie test it was at least able to impress us with 29 hours and five minutes of battery life on average, with it's longest time being 32 hours and 27 minutes.",
    "There is one thing that we can say about the Lenovo ThinkPad X1 Fold: if you're looking for performance and the choice is between the X1 Fold and the Flex 5G, we'd definitely recommend the Flex 5G, which is pretty stunning.",
    "In addition to the Wi-Fi 6 802.11AX and Bluetooth 5.1 connectivity, which are increasingly becoming standard across the industry, there is an option to get always-on 5G/LTE connectivity.",
    "This will require you to buy the X1 Fold through an authorized service provider who will install the Nano SIM card and the set up the service for the device. It goes without saying that this will incur additional monthly charges which adds considerably to the expense of the device, but having the option of an always-on internet connection is definitely a plus in the X1 Fold's column, especially when 5G networks actually manage to roll out in North America, Europe, and elsewhere.",
    "With a device this expensive, we didn't expect to see much in the way of bloatware, and thankfully that turns out to be the case. The only preinstall of note is the Lenovo Vantage software which helps manage the screen orientation as you use the device.",
    "Probably the most important software feature on the X1 Fold is that it is running a full-featured Windows 10, either Home or Pro (no S-Mode here). It might not necessarily run everything well, but at least it can run the full suite of x64-bit apps like Adobe Photoshop and the like."
  ],
  "headers": {
    "0": "Two minute review",
    "8": "Price and availability",
    "10": "Design",
    "26": "Performance",
    "36": "Connectivity",
    "38": "Software and features",
    "40": "Don't buy it if..."
  },
  "links": {
    "CES 2020": "https://www.techradar.com/reviews/lenovo-thinkpad-x1-fold",
    "Lenovo Flex 5G": "https://www.techradar.com/reviews/lenovo-flex-5g",
    "leaked benchmarks of Lakefield": "https://www.techradar.com/news/this-intel-lakefield-benchmark-should-have-microsoft-and-samsung-worried",
    "Acer Swift 3": "https://www.techradar.com/reviews/acer-swift-3-2020"
  }
}