{
  "source": "https://www.techradar.com/reviews/allegiancemd",
  "title": "AllegianceMD review",
  "category": "computing",
  "updated": "2020-04-13T18:00:00Z",
  "author": "jonas-p-demuro",
  "summary": "The cloud software company that offers a better method for running your practice",
  "verdict": "AllegianceMD delivers on the useful tools to run your practice automatically, but we wish for more transparency in their pricing model.",
  "pros": [
    "Toll free phone support",
    "Integrated e-Fax",
    "Unlimited document uploads",
    "Search for appointments via AI"
  ],
  "cons": [
    "Opaque pricing",
    "High cost",
    "Lack of clinician mobile apps",
    "Poorly rated iOS patient app"
  ],
  "article": [
    "AllegianceMD offers medical software targeted for small to mid-sized medical practices. No newcomer to this competitive area, it builds on over two decades of experience, and can be traced back to Avicenna in 1996.",
    "Today, it offers software across a variety of areas, including Electronic Health Records, Practice Management, Patient Engagement, and Merit-Based Payment.",
    "AllegianceMD’s Practice Management module promises to automate the practice. This has the benefit of streamlining operations, and can ease the work for the office staff, while optimizing the cash flow to the practice.",
    "An important aspect for any practice is the scheduling of appointments. A common task for office staff is to search for the next available appointment for a patient that needs the services of the practice. Rather than having to scroll endlessly through days of a schedule, AllegianceMD is able to efficiently leverage an AI search to find the next available slot painlessly.",
    "Another issue to consider when choosing a Practice Management module is how it deals with the physical paperwork, and here AllegianceMD shines. It eliminates the need for a physical fax, or even a separate, a la carte fax service. There is integrated e-faxing, that can use a toll free number, a local number, or even your existing fax number. Then, through the AllegianceMD service, an unlimited number of faxes can be sent, and received without any additional charge.",
    "Also, in any practice, there are physical documents to save, such as handwritten doctor’s notes, or paperwork requests from patients. With an electronic setup, there is no need to keep separate paper records, and this can all be integrated together. With AllegianceMD, these documents can be simply scanned, and uploaded to their cloud based system, without an extra cost.",
    "Billing also gets enhanced via electronic posting of EOB. While most systems can capture charges from their EHR, AllegianceMD ratchets this up a notch with the ability to also pull them in from the schedule, showing the benefit of this tight integration. There is also automation applied to the creation of electronic secondary claims, when they are not forwarded by the primary insurer. Also, EOB’s get organized via color coding for an organized look, and there are available reports and analytics available to track the important financial health indices of the practice.",
    "The mobile app support for AllegianceMD is a bit of a mixed bag at this time. At least there is a patient portal app available (critically important for patient engagement these days), and for both the Android and iOS platforms. However, neither version of the app is highly rated, with the My Portal MD version garnering a low 1.5 star rating on the Apple App Store.",
    "Additionally, AllegianceMD falls short on a physician mobile app at this time as it is “Currently being redeveloped due to new features” according to Amanda via online chat.",
    "Looking through the user reviews, other issues pop up. One is that the billing, in particular for Medicare patients, does not go through, and then the payments are delayed. Another user called AllegianceMD out for a clunky workflow, which was inefficient, and when support was contacted the workarounds suggested proved to be inefficient for that clinician.",
    "Support for AllegianceMD is available via a variety of methods. This includes via a toll free phone number that is, according to Amanda from AllegianceMD that answered my query, “Fully staffed M-F 7a to 7p CST, and a skeleton crew 7p-7a and weekends. And always accessible by email.” There is also the chat available for support, which is how we sent our query, which was answered in under a minute around noon on a weekday.",
    "We also appreciate the option, as seen in the image above, for access to an online portal. By entering our contact info, and our account number, we can utilize this self support option to create a trouble ticket on our own.",
    "Like most of its brethren in this area. AllegianceMD is not forthcoming with their pricing, and has it opaque on the site. Rather, in order to obtain the pricing, contact with the company is required, and the practice needs a contact person that can supply their name, email and phone number, and answer a solitary question about how many providers are in the practice via an online portal to initiate the process. Elsewhere, a toll free number gets listed for those that prefer a more direct approach.",
    "The only hint of the pricing comes in the AllegianceMD’s FAQ that answers a question about the cost as “... an affordable monthly fee—less than an average utility bill,” which certainly leaves the price an open question.",
    "Searching elsewhere, we found that for the Practice Management component only, the pricing starts at $400 (£326) monthly for each full time provider, and bundling it with the EHR increases the cost to $489 (£399) per provider monthly. Clearly, AllegianceMD’s monthly utility bills must be sky high!",
    "AllegianceMD is a cloud based software solution that can shoulder much of the burden of running a busy medical practice. The highlights include the multiple support options including a toll free number, the AI approach to scheduling, and the included e-Faxing support. The drawbacks include the lack of mobile apps for clinicians, the opaque costs that turn out to be high, and the billing issues. Overall, AllegianceMD ends up being a mixed bag when we weigh it all out."
  ],
  "headers": {
    "2": "Features",
    "7": "Drawbacks",
    "10": "Support",
    "12": "Pricing",
    "15": "Final verdict"
  },
  "links": {
    "AllegianceMD": "https://allegiancemd.com/",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}