{
  "source": "https://www.techradar.com/reviews/cloudvpn",
  "title": "CloudVPN review",
  "category": "computing",
  "updated": "2020-12-04T11:31:05Z",
  "author": "sead-fadilpasic",
  "summary": "The VPN classic with a few good selling points",
  "verdict": "CloudVPN is a decent VPN platform that protects your privacy with all the standard technology, supports torrenting, unblocks Netflix, and gives you 24 hours to fully try it out. All this takes place under some very good speeds that are at their best when using servers near your physical location but can get pretty low for some of the more exotic locations.",
  "pros": [
    "Simple and user-friendly apps",
    "24-hour free trial",
    "Unblocks Netflix",
    "DoubleVPN"
  ],
  "cons": [
    "No money-back guarantee",
    "Some logging",
    "Doesn’t unblock BBC iPlayer"
  ],
  "article": [
    "CloudVPN is a provider of VPN services that keeps things simple and to the point. All the details about its platform are visible on the website, and the entire process - from downloading to connecting - takes less than a minute.",
    "The pricing starts with the monthly option at $9.99/month, followed by the “halfyear” subscription at $5.99/month (charged $35.9 every 6 months), and ends with the yearly plan at $4.16/month ($49.9 charged every 12 months). One CloudVPN account will allow you to run the VPN on up to 6 devices at the same time.",
    "Accepted payment methods are plenty and include credit cards, Apple Pay, Google Pay, Bitcoin, UnionPay, Alipay, WebMoney, Qiwi, Paymentwall, and Yandex, depending on your preferred currency.",
    "If you’d like to get a taste of this VPN before paying for it, you can apply for a 24-hour free trial. Just leave your email address and you’ll instantly get a trial activation code you can paste in the downloaded client. Make sure to test the service out to the max, as there’s no money-back guarantee on the table.",
    "CloudVPN is great, up to a point - its platform is still not as advanced and fast as ExpressVPN’s, it’s more expensive than NordVPN or Surfshark, and it can’t unblock BBC iPlayer. It doesn’t even have a money-back guarantee, which is something the said providers take pride in, with CyberGhost offering as long as 45 days to get your money back if you aren’t fully satisfied with it.",
    "CloudVPN is capable of unblocking the popular streaming service Netflix US and UK in regions where these libraries aren’t available, but the same can’t be said of BBC iPlayer.",
    "The company operating CloudVPN is called VPN Network Service Ltd. and is located in Belize, a place that isn’t under any obligatory data-retention laws or intelligence-sharing treaties. Its users are provided with access to “almost 100 servers in various countries of the world” (95 servers in 41 countries, to be more precise), including Isle of Man, Romania, Turkey, Iceland, Russia, Estonia, Israel, India, Moldova, Vietnam, and more.",
    "CloudVPN guarantees your anonymity online with the use of the bullet-proof AES-256 encryption, accompanied by OpenVPN and IPSec connection protocols. To protect your private data from leaking in case of a VPN connection interruption, there’s an optional kill switch - a mechanism that will block your entire Internet access should such a situation transpire.",
    "The provider also features a so-called DoubleVPN, which means it can create an additional encrypted tunnel between its servers for another layer of privacy.",
    "All these industry-standard tools and features help you stay perfectly anonymous even when sharing large files via P2P and torrenting clients, which this vendor supports.",
    "CloudVPN’s Privacy Policy details all the data it promises never to collect, including your original IP address and how you utilize the VPN connection. This includes which apps, services, or websites you used while connected to the service. It does collect the data involved in signing up for the service - including email address, subscription status, and payment information.",
    "We found it slightly too nosey that it also collects device-specific information when you open the CloudVPN app, including unique mobile ID, language, hardware model, operating system, and network information.",
    "It also collects the app’s version, how much you’re active per day, total data used, and city-level geodemographics. The provider claims this information helps it to better understand the user and in product planning, for the ultimate goal of improving the user experience and satisfaction.",
    "Additionally, CloudVPN says it collects the VPN connection data that includes the server you connected to, connection timestamp, error report, choice of the protocol, and network type. However, this information is only used for troubleshooting and service optimization, and is automatically erased after 96 hours.",
    "CloudVPN has easy-to-use apps for all the major platforms - Windows, iOS, Mac, and Android, as well as browser extensions for Chrome and Firefox. Users can also download OpenVPN configuration files and manually enable the service via third-party software.",
    "Interestingly, the App Store link for the iOS app was not working so we did some manual search and managed to find it. The app had a nice rating - 4.4 stars (out of 5), as judged by 71 people. It was last updated on May 5, 2020.",
    "The Android app has been downloaded over 50,000 times and was last updated on April 11, 2020. So far, it has been rated by 324 users and has a solid score of 4.0 stars (out of 5).",
    "Installation manuals for all the supported platforms can be found on the website, along with the answers to frequently asked questions. Contacting customer support can be done via email and web form. Unfortunately, our attempts at contacting it via email were left unanswered so far.",
    "A recommended server in Slovenia gave us an amazing 55.28Mbps which is quite a lot on a 69Mbps testing connection. We also tried a server in Portugal, which is a bit further away from our physical location than Slovenia, and it hailed a much lower (but still very usable) 17.37Mbps.",
    "Then it was time for New York to show its capacity. We expected this to be more of a challenge, considering it is on a different continent than us but it performed quite well, providing us with a solid and usable 13.14Mbps.",
    "Finally, we decided to give a server in Japan a go, but our speed test wouldn’t even start due to terribly low speeds. To be fair, we were warned inside the app itself that low speeds are expected for this location.",
    "Connecting is simple - you just need to double-click on your desired server and press the connect button. However, server switching via the app’s interface is a bit less convenient - you will have to disconnect from the active server and reconnect to the new one. That said, you can switch servers more easily via the system tray - simply right click on the CloudVPN icon and select the server you want.",
    "We liked CloudVPN’s apps, its functional speeds, support for torrenting and Netflix, as well as the 24-free trial. However, it still has some things it should work on to reach the level of the industry leaders such as ExpressVPN.",
    "This primarily refers to the lack of the money-back guarantee and some logging, but it also wouldn’t hurt to increase its download speeds for locations further away from the user. It would also be helpful to introduce a live chat option for easier access to customer support."
  ],
  "headers": {
    "1": "Price",
    "4": "Alternatives",
    "5": "Streaming",
    "6": "About the company",
    "7": "Privacy and encryption",
    "14": "Support",
    "18": "Speed and experience",
    "22": "Verdict"
  },
  "links": {
    "CloudVPN": "https://cloudvpn.pro/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "email address": "https://www.techradar.com/news/best-email-provider",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "privacy": "https://www.techradar.com/best/anonymous-browsing",
    "Privacy Policy": "https://cloudvpn.pro/privacy/",
    "Chrome": "https://chrome.google.com/webstore/detail/cloudvpn-%D0%BA%D0%B0%D1%87%D0%B5%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D1%8B%D0%B9-%D0%BF%D1%80%D0%BE/pcienlhnoficegnepejpfiklggkioccm?hl=en-US",
    "Firefox": "https://addons.mozilla.org/en-US/firefox/addon/cloudvpn-vpn-service/",
    "find it": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5131957675286537000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fcloudvpn-hotspot-vpn-proxy%2Fid1342125266",
    "Android app": "https://play.google.com/store/apps/details?id=com.cloudvpn.pro&utm_source=site&utm_campaign=download-page&pcampaignid=MKT-Other-global-all-co-prtnr-py-PartBadge-Mar2515-1",
    "frequently asked questions": "https://cloudvpn.pro/faq/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-5731211588102764000"
  }
}