{
  "source": "https://www.techradar.com/reviews/zelle-money-transfer",
  "title": "Zelle money transfer review",
  "category": "computing",
  "updated": "2020-09-29T10:36:43Z",
  "author": "rob-clymo",
  "summary": "Make quick safe money transfers using Zelle",
  "verdict": "Zelle is a quick and easy way of transferring money within the United States and has the bonus of letting you send and receive cash without any fees.",
  "pros": [
    "Easy to configure",
    "Convenient",
    "Free"
  ],
  "cons": [
    "US only",
    "Basic feature list"
  ],
  "article": [
    "Zelle is an app-based mobile payment solution that lets you carry out peer-to-peer money transfers. Zelle has received praise for its simplicity, with the ability to move money without hassle or cost and allows you to send or request money to and from contacts held in your phone.",
    "The mobile payment service and app combination is currently limited to users in the US. Zelle is generally used to best effect by sending and receiving money in tandem with your own bank’s app, but it’s also possible to send money directly from within the Zelle app if your financial institution doesn't support it. Although Zelle can’t currently be used for things like in-store payments it is super useful for sending family and friends cash when needed, which is useful during coronavirus.",
    "Similar products worth looking at include the likes of WorldRemit, Azimo, Venmo, Western Union, PayPal and Moneygram.",
    "The Zelle app is free to use and there are no charges for transfers either, which makes the service very appealing. Compared to regular bank wire transfers that invariably add in costs for both sending and receiving money, the freedom and fee-free aspect of Zelle makes it a very practical solution for the cost-conscious. You’ll need to use the service frequently in order for your bank to allow you to send increasingly larger amounts however.",
    "Being able to use Zelle is currently dependent on being in the US, as it has teamed up with around 50 American banks in order to get the peer-to-peer service working. Big name financial institutions such as Bank of America, Chase, Citibank and Wells Fargo feature in that list, so there is plenty of mainstream appeal with the service.",
    "In fact, Zelle has a whole area within its website that will indicate if your bank or credit union is compatible with what it offers. Zelle does add that you can still use the service even if it's not in the listings however. A slight drawback is that you can’t send money to someone outside of the US, so in some respects Zelle does have annoying limitations. But for domestic use it’s pretty handy. Transactions should happen in minutes as long as the recipient’s email address or US mobile number is already enrolled with Zelle.",
    "If you go down the route of using the Zelle service with its dedicated app, which is available for both iOS and Android, then you’ll find that it’s a fairly minimalist chunk of software. With little inside it to break or go wrong you can therefore expect to get swift and trouble-free transfers. If you use the service via your own banking app then that will obviously be fairly dependent on the robustness of your chosen financial institution.",
    "Although Zelle sounds like it might be problematical to get set up, especially if you’re using the service via your regular banking app, it’s not too bad at all. There are actually few settings that need to be tweaked in order to get up and running, such as allowing SMS text messages to be received, selecting your preferred account to be used for the transactions and also supplying your mobile number and email.",
    "Using the Zelle app is similarly straightforward, with the need to pick your bank from the approved list of financial outlets in order to get things underway. Sending and receiving funds, once you get to that point, is perhaps the easiest part of the entire process with just the recipient’s number or email address needed to ping over your chosen amount of cash.",
    "If you run into problems with Zelle then there’s assistance available, although this is found via the contact page rather than a dedicated support area. Once you’ve found it though the help area is quite useful as it covers all of the main areas and any potential sticking points. This includes how to connect with your bank or credit union.",
    "There’s also a contact from, which lets you send Zelle support staff questions or queries about anything else not covered in their FAQs. The help page suggests calling them if you need immediate assistance, which can be done using the number on the site between 10am and 10pm ET 7 days a week, excluding Thanksgiving, Christmas Day and New Year’s Day.",
    "Zelle will be useful to folks in the US who want to send money to others from time to time and are keen to avoid the fees involved with regular bank wire transfers. While its appeal is certainly handy for domestic users, the inability to send money internationally will be a drawback for some. Being able to facilitate Zelle transfers from within your your own banking app is practical too, but the standalone software is less impressive.",
    "It gets the job done, but there are little in the way of frills or funky features to shout about. No matter, Zelle will be a boon for some; especially those who need to swiftly send some cash to a person in their contacts list. If Zelle can beef up the feature set and make it a service with more global appeal then this could evolve into something really good in the future."
  ],
  "headers": {
    "3": "Pricing",
    "4": "Features",
    "6": "Performance",
    "7": "Ease of use",
    "9": "Support",
    "11": "Final verdict"
  },
  "links": {
    "Zelle": "https://www.zellepay.com",
    "money transfers": "https://www.techradar.com/best/best-money-transfer-apps",
    "Venmo": "https://www.techradar.com/news/venmo-targets-small-and-micro-businesses-with-new-payment-service",
    "Moneygram": "https://www.techradar.com/reviews/moneygram-currency-transfer",
    "send money": "https://www.techradar.com/best/best-money-transfer-apps",
    "banking app": "https://www.techradar.com/news/open-banking-gets-its-very-own-app-store"
  }
}