{
  "source": "https://www.techradar.com/reviews/sony-fe-20mm-f18-g",
  "title": "Sony FE 20mm f/1.8 G review",
  "category": "cameras",
  "updated": "2020-02-28T11:43:38Z",
  "author": "james-abbott",
  "summary": "A fine new wide-angle prime for your mirrorless Sony camera",
  "verdict": "The Sony FE 20mm f/1.8 G is a superb addition to the Sony FE lineup that will appeal to a wide range of photographers, from landscape fans to wedding snappers. While it's expensive, this wide-angle prime justifies its price tag with its fast, quiet autofocus, compact design and impressive sharpness throughout its aperture range.",
  "pros": [
    "Compact size and lightweight",
    "Three aperture control options",
    "Excellent sharpness"
  ],
  "cons": [
    "Expensive",
    "Not as fast as rivals"
  ],
  "article": [
    "It seems that Sony has been listening to its photographers, with the latest addition to its continually growing FE lineup being the highly anticipated Sony FE 20mm f/1.8 G. Just when you thought you had every lens option you needed, Sony has thrown a curveball that could send even the most prudent photographer rushing to their local camera store.",
    "The new lens certainly fills a gap for Sony, though its relative value depends a little on where you're buying it. With the Sigma 20mm f/1.4 available for just over two-thirds of the price of the Sony offering in Europe, it’s going to take something special to entice European photographers to pay more for a slightly slower lens. Fortunately for Sony, the FE 20mm f/1.8 has a few tricks up its sleeve that make the choice not quite as clear-cut as it might first appear.",
    "In the United States, though, the two lenses cost exactly the same amount, so it will be more of a case of the slightly larger maximum aperture of the Sigma versus the smaller size, lighter weight and additional features of the Sony.",
    "This is a lens that will have a strong appeal for landscape, travel, astro, portrait and wedding photographers due to its 20mm focal length, fast maximum aperture and relatively compact size. For landscape and travel photographers especially, the 20mm is tiny and extremely light compared to the 16-35mm f/2.8 GM, or even the 16-35mm f/4, which is smaller and lighter than its f/2.8 counterpart.",
    "Prime lenses are often simply designed, and the Sony 20mm is no exception, but there’s no denying that it has more to offer than most comparable lenses. As you’d expect, there’s an AF/MF switch to toggle between focus modes, a customizable button on the side, a manual aperture ring and a switch to move between stepless and clicked aperture selection.",
    "The most impressive feature, beyond the small size and weight of the lens, is that the manual aperture ring has three settings to suit all photographers and videographers. There’s the 'A' setting for camera body control of the aperture, stepless for manual control when shooting video, and clicked manual aperture, where you can feel the click between each stop, and which is more suitable for stills. So, whatever your preferred method of aperture control, this lens offers it.",
    "This is a lens that’s clearly been designed with portability in mind, with diminutive proportions of 84.7 x 73.5mm and a weight of just 373g, with a 67mm filter thread. Handily, the front of the lens doesn't rotate, which makes it ideal for use with filters. It's also incredibly compact, and balances perfectly with Sony A7- and A9-series cameras, as well as A6000-series APS-C bodies, on which the equivalent focal length is 30mm.",
    "Autofocus is fast and extremely quiet thanks to two XD linear motors, and the lens employs linear manual focus, with a smooth manual focus ring providing a comfortable amount of resistance that holds focus once found. The minimum focus distance is 19cm when using AF and 18cm when manually focusing.",
    "The FE 20mm f/1.8 G's build is solid, and feels exactly how you’d expect for a professional lens that’s dust and moisture resistant. Inside, the lens consists of 14 elements in 12 groups, and the fluorine front element is there to help water droplets and fingerprints dissipate quickly.",
    "As you’d expect from a prime, when this lens is set to its sweet-spot aperture it’s incredibly sharp throughout the frame – and with this lens that aperture is f/8. While sharpness is impressive at f/1.8, it’s when you stop down to f/2.8 that you see a significant jump in sharpness, with each subsequent aperture stop providing improved edge sharpness to f/8.",
    "Beyond f/8, image sharpness across the frame reduces incrementally from f/11 to f/22, with the latter setting being the least sharp. It’s safe to say that this lens performs best between f/2.8 and f/8, but f/1.8 and f/11 are still more than sharp enough.",
    "As you’d expect, when shooting at f/1.8 there’s noticeable vignetting. This, however, is reduced drastically by stopping down to just f/2.8, and is gone completely at f/4.",
    "There’s also a small amount of barrel distortion, but this is only noticeable when shooting subjects such as a wall straight-on and close-up. When shooting high-contrast subjects wide open at f/1.8, no chromatic aberration is visible.",
    "The Sony FE 20mm f/1.8 G is a lens that clearly fills a hole in the Sony FE lineup, and has broad appeal across a wide range of photographic genres.",
    "Image quality is optimized towards the first half of the aperture range, with the most impressive performance between f/2.8 and F/8. That said, the FE 20mm f/1.8 G exhibits respectable sharpness wide open at f/1.8 and f/11.",
    "Focus is fast and quiet, while the manual focus ring is smooth and provides a comfortable amount of resistance when turning. The lens's multiple aperture ring settings also help broaden its appeal for both still and video shooters.",
    "While it's expensive at $900 / £949 (around AU$1,800), the FE 20mm f/1.8 is one of those lenses that provides the perfect balance of features and image quality, and will be hugely desirable to many photographers. It's small, it's lightweight and, most importantly, it's very sharp."
  ],
  "headers": {
    "4": "Features",
    "6": "Build and handling",
    "9": "Performance",
    "13": "Verdict"
  },
  "links": {
    "16-35mm f/2.8 GM": "https://www.techradar.com/news/best-sony-lenses"
  }
}