{
  "source": "https://www.techradar.com/reviews/cryptostorm",
  "title": "CryptoStorm VPN review",
  "category": "computing",
  "updated": "2020-11-20T17:21:45Z",
  "author": "sead-fadilpasic",
  "summary": "Prime directive: privacy and transparency",
  "verdict": "CryptoStorm deploys the most advanced technologies at its disposal to provide its users with perfect anonymity and security on the internet. It has put every part of its platform on display, showing that it has nothing to hide and that its intentions are honest. That said, it holds a rather small server network, lacks many customization options and settings, doesn’t unblock Netflix or BBC iPlayer, and its customer support could use improvement.",
  "pros": [
    "Ultimate security and privacy",
    "Entirely transparent",
    "Supports multi-hop",
    "Lifetime subscription option"
  ],
  "cons": [
    "Limited server network",
    "Doesn’t unblock Netflix or BBC iPlayer",
    "Non-responsive customer support"
  ],
  "article": [
    "CryptoStorm is a VPN service dedicated to securing privacy to all who need it, through its free tier and paid accounts.",
    "It operates under the unique principle of token-based network access, with transient and temporary hashed tokens that allow it to have no database or records, thus providing 100% anonymity.",
    "The service is highly advanced and focused on experts, although its Windows app is rather beginner-friendly. If you don’t feel comfortable with this type of platform, you’ll want to check out one of the simpler solutions among the best VPN providers on the market.",
    "CryptoStorm’s service can be yours for free if you’re not bothered by the speeds of only 160kbps (still good for browsing as it offers the same level of privacy and security as the paid version). However, if you’re willing to pay for higher speeds, you can do so by selecting any one of its paid packages.",
    "These include recurring and non-recurring subscriptions, differing in lengths, number of supported devices, and accepted payment methods. Recurring subscriptions that you can pay using PayPal include a 1-week option at $1.86 (1 device), 1-month at $6/month (1 device), and a yearly at $52/year (equal to $4.33/month, 4 devices).",
    "Non-recurring subscriptions that you can purchase with PayPal include all of the above, plus a 3-month ($16, 2 devices), 5-month ($24), 6-month ($28, 3 devices), 11-month ($4), 2-year ($94, 5 devices), 25-month ($97), and lifetime ($500, 6 devices) option.",
    "If you’re paying by credit card, you can choose between non-recurring 1-month, 3-month, 6-month, and 1-year subscriptions. Paying by Bitcoin (BitPay) can get you all the same non-recurring subscriptions as with PayPal with the exception of the 1-week subscription.",
    "If you’re unsatisfied with the service and have used 50% or less of your token’s duration, the company will refund your order. This means that if, for instance, you’ve used your token for only 2 days of your 1-week subscription and aren’t satisfied, you’re eligible for a refund.",
    "Despite its highly advanced service, CryptoStorm has disadvantages that make some of its competitors more appealing. For example, it isn’t as easy to use as are the likes of ExpressVPN, NordVPN, Surfshark, or CyberGhost, it doesn’t have native apps for all major platforms or thousands of servers like they do, and it doesn’t unblock Netflix or BBC iPlayer. Furthermore, some of these VPNs even come at a lower price.",
    "Although many top-level VPN services enable users to access major streaming platforms like Netflix and BBC iPlayer in regions where these might not be accessible, this isn’t the case with CryptoStorm. So if this is important to you, we recommend you look elsewhere.",
    "CryptoStorm is a decentralized and flexible organization with “roots in Iceland, branches worldwide”. It carries out its financial operations in several regions and has no central office. If you sign up for it, you’ll get access to 674 available IP addresses and an undisclosed number of servers in 30 locations.",
    "The provider operates under the open-code model that emphasizes transparency and welcomes intensive public and peer review, so you can be sure it has nothing to hide. It also issues a regular Warrant Canary where it lists all the court orders, gag orders, or similar requests from any authorities it received (or didn’t receive) in a certain period.",
    "CryptoStorm’s main selling point is its utmost dedication to its users’ privacy. This includes the principle of token-based network access and the ensuing lack of any records or database that might be shared with third parties in any circumstances. In addition to being hashed, these tokens provide complete privacy due to their transient and temporary nature.",
    "To secure your connections, CryptoStorm uses expert-level technology - PFS-based (Perfect Forward Secrecy) ephemeral ciphers, 8192-bit RSA instances, 521-bit EC instances, Ed25519 and Ed448 instances - all supporting ChaCha20-Poly1305.",
    "It also deploys a blockchain-based censorship-proofed deepDNS system with unparalleled security and functionality, along with seamless and transparent .onion and .i2p access.",
    "In addition to the good old OpenVPN (UDP and TCP), CryptoStorm utilizes a state-of-the-art cryptographic protocol called WireGuard (albeit still in beta stage) that works on Windows, Mac, iOS, Mac, Android, and BSD. WireGuard aims to be faster and simpler than IPSec and a better performer than OpenVPN.",
    "If you’re using a Linux device, you’ll find that CryptoStorm allows you to connect to multiple VPN tunnels, increasing your privacy even more than with just one VPN connection. You simply need to download a script, follow the instructions, and you’re good to go.",
    "Optional settings include a killswitch - the mechanism that blocks your Internet access if the VPN fails, as well as IPv6 and DNS leak protection, STUN/WebRTC leak protection, DNSCrypt - a network protocol that authenticates and encrypts DNS. You’ll also get a blocker of intrusive ads and trackers. There are a few other options that might be more suitable for pro users.",
    "Needless to say, all these privacy features allow you to torrent in peace with no fear of governments snooping on your activities.",
    "Among a bunch of technical mumbo jumbo in CryptoStorm’s privacy policy, we managed to dig up the most important information - about logging. A lot of the terms and processes sound complicated and unfamiliar but the main gist of it is this: “none of the log files will ever contain any data that could be used to identify a customer”.",
    "This VPN vendor has a custom app for Windows, but other supported platforms - Mac, iOS, Android, Linux, routers - require the installation of third-party software (like OpenVPN Connect, Tunnelblick, and Viscosity) and/or tinkering with the device yourself, which might not be the most ideal solution for beginners.",
    "Should you require assistance, you can consult CryptoStorm’s online community, where you’ll find all sorts of information, ranging from announcements and news to explanations and installation guides. This is also a good place to ask any questions you might have.",
    "If you’d rather have one-on-one communication with someone from the support, you can send them an email, be it if you need help or just information. However, be prepared to wait.",
    "We first tested the free version, which upon connecting gave us an IP address in France. As expected, the download speeds were pretty low (the provider did say this) but still surpassing the 1.6Mbps listed on the website. Specifically, our speed test showed 1.9Mbps on a 67Mbps testing connection.",
    "As for its paid service, we tested a server in Sweden, which gave us an amazing speed of 44Mbps on the same testing connection as above. Then, we decided to test a location in the US, but the connection typically timed out and we were forced to restart it so we could continue with testing. After a few attempts, we finally connected to a server Florida. This time around, the results weren’t as impressive, delivering a lot lower 12Mbps, but this can be expected when establishing a VPN connection to a region so distant from our physical location. Moreover, this speed is still very usable.",
    "If you’re using a Windows device, you won’t have any problems using this service as the app is simple and user-friendly. However, this isn’t the case with other supported platforms as they require installing third-party software, downloading config files, and carefully following the instructions on the website. VPN pros, on the other hand, will be just fine.",
    "CryptoStorm gives out an impression of a very professional and capable platform, even though this makes it not as appealing to VPN beginners.",
    "It is fully transparent and offers a bunch of useful features, but it lacks the sizable server network and the capacity to unblock the likes of Netflix and BBC iPlayer, both of which are proudly featured by some of its competitors, such as ExpressVPN."
  ],
  "headers": {
    "3": "Price",
    "8": "Alternatives",
    "9": "Streaming",
    "10": "About the company",
    "12": "Privacy and encryption",
    "20": "Support",
    "23": "Speed and experience",
    "26": "Verdict"
  },
  "links": {
    "CryptoStorm": "https://cryptostorm.is/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "free": "https://cryptostorm.is/cryptofree",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "WireGuard": "https://cryptostorm.is/wireguard",
    "instructions": "https://cryptostorm.is/multihop",
    "privacy policy": "https://cryptostorm.is/privacy",
    "online community": "https://cryptostorm.ch/",
    "help": "mailto:support@cryptostorm.is",
    "information": "mailto:info@cryptostorm.is",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-8704875365827841000"
  }
}