{
  "source": "https://www.techradar.com/reviews/shoeboxed-receipt-scanning",
  "title": "Shoeboxed receipt scanning review",
  "category": "computing",
  "updated": "2020-09-30T11:42:46Z",
  "author": "rob-clymo",
  "summary": "Tame your receipts and track expenses with Shoeboxed",
  "verdict": "We love the simplicity of Shoeboxed as it allows you to get on top of your receipts and expenses with a heady mix of digital brilliance and analog practicality.",
  "pros": [
    "Brilliantly simple",
    "Tames even the most unruly of receipt piles"
  ],
  "cons": [
    "Limitations with lower end package",
    "Organised types might not see the appeal"
  ],
  "article": [
    "Shoeboxed is a great idea for the small business owner, sole trader or any kind of freelancer as it allows you to keep quick and easy track of receipts. Even though we live in an age where many things are kept on file digitally, it’s still easy to quickly amass lots of paperwork, including things like fuel receipts, car park tickets and chits for all kinds of other sundry expenses.",
    "The Shoeboxed concept has been designed to alleviate that sort of tedium and help you get things into order. The American-owned business has actually been in existence since 2007, but Shoeboxed has become a worldwide operation that is now available right around the globe. Similar products in this area including QuickBooks, Expensify, Hurdlr and Zoho Expense all of which are useful during the ongoing coronavirus crisis.",
    "The Shoeboxed team has come up with a neat way of enticing you into the world of better receipt filing, with a 30-day trial that means you can create an account and enjoy instant access to any one of the different packages. Currently, Shoeboxed is available in three different package types.",
    "The cheapest option is Startup, which is aimed at individuals and freelancers. It normally costs $23 a month but is currently on offer for $18 a month (billed annually).",
    "Next up is the Professional edition, which normally coasts $47 per month but which is currently available for $36 (billed annually). This one is more suited to professionals and small businesses.",
    "The third Shoeboxed option is Business, which normally retails for $71 per month but is currently $54 a month (billed annually). This is aimed at businesses with high volumes of receipts. You can, of course, just try the package and then cancel anytime during the 30-day trial and you will not be charged.",
    "The free Shoeboxed app is mighty useful too, which has Starter and Lite subscription plans: $4.99 per 30 days for 25 document scans for the former and $9.99 per 30 days for 50 document scans for the latter, and both can be linked to your main Shoeboxed account.",
    "Shoeboxed is one of those brilliantly simple ideas that actually becomes more useful the more you get to use it. There are numerous standout features, not least of which is the way you can get your receipts organized in fine digital fashion, which can then be accepted by both the Internal Revenue Service and the Canada Revenue Service come tax filing time.",
    "Not only do they get digitized, but it’s easy to file them in an orderly fashion too. After precision scanning, receipts can be categorized, organized and are fully searchable. That means you’ll spend less time looking for that all-important elusive receipt that you desperately need to locate.",
    "Shoeboxed also boasts Magic Envelopes, which enable you to get a bunch of traditional paper receipts turned into digitized versions, without you have to lift a finger. Add on the powerful expense reports that can be produced with the resulting data and Shoeboxed is a potent force to be reckoned with. We’re also fans of the way you can auto-import receipts from Gmail straight into Shoeboxed.",
    "There’s no doubt that Shoeboxed will save you time and, over a longer period, money too. The way it works is very simple, and the associated app comes as an added bonus as it allows you to track receipts on the go thanks to its receipt and mileage tracker. It’s available for the iPhone, iPad and Android devices and uses the GPS on your mobile to precisely track mileages.",
    "The other slightly old-school feature, Magic Envelopes, is actually a wonderfully easy to use system that lets you mail your latest stack of receipts to Shoeboxed and they’ll digitize it all for you. The resulting scans simply appear in your system account, job done. Alternatively, you can still get scans digitized and into your account using your mobile device, desktop scanner or email.",
    "The support options offered by Shoeboxed look to be in good order. This starts out with a comprehensive Support Center on the website, which also features a fairly substantial knowledge base that covers many common questions you might have about the service.",
    "There’s the opportunity to raise a ticket with the support team should you need to, while phone support is also available Monday to Friday between 9 and 5 CST. There’s a US toll-free number and an international option available too. In addition, it’s possible to summon help on the website pages, with a pop-up chat-style interface where you can enter the details of your query, as well as adding attachments where necessary. All bases are therefore pretty much covered.",
    "Shoeboxed is a really useful tool if you’re the sort of person who tends to muddle through, stuffing receipts into all kinds of corners and then trying to make sense of them all come tax filing time. It’ll help you get your house in order, get everything into a digital system and then get each and every item categorized. If you loathe doing your own accounts Shoeboxed can help shave hours off the time you’ll spend getting ready for tax filing duties.",
    "There are some cool features inside Shoeboxed, and the reporting functionality is an added bonus. While individuals and small businesses might find it useful, larger companies could see it as a real bonus for getting employees to keep better records. The higher-end package options are priced accordingly, but Shoeboxed is still recommended if you desperately need a more efficient way of picking through mountains of receipts."
  ],
  "headers": {
    "2": "Pricing",
    "7": "Features",
    "10": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "Shoeboxed": "https://www.shoeboxed.com",
    "receipts": "https://www.techradar.com/best/best-expense-trackers",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-pro",
    "Expensify": "https://www.techradar.com/reviews/expensify-budget-manager",
    "Hurdlr": "https://www.techradar.com/reviews/hurdlr-expense-tracker",
    "Zoho Expense": "https://www.techradar.com/reviews/zoho-expense-budget-manager",
    "Startup": "https://www.shoeboxed.com/pricing/",
    "Professional": "https://www.shoeboxed.com/pricing/",
    "Business": "https://www.shoeboxed.com/pricing/",
    "tax filing": "https://www.techradar.com/best/small-business-tax-software",
    "accounts": "https://www.techradar.com/best/accounting-software-small-business"
  }
}