{
  "source": "https://www.techradar.com/reviews/microsoft-access",
  "title": "Microsoft Access review",
  "category": "computing",
  "updated": "2020-11-05T15:11:50Z",
  "author": "darcy-french",
  "summary": "A workhorse of the Microsoft 365 suite, but its days might be numbered",
  "verdict": "A great choice for designing straightforward business applications that leverage existing databases, but increasingly out of touch with developments in the AI and machine learning space.",
  "pros": [
    "Included in Microsoft 365",
    "Easy to use"
  ],
  "cons": [
    "PC only",
    "No AI or machine learning"
  ],
  "article": [
    "Microsoft Access is a business-oriented platform that can change the way your business operates. It is ideal for small and medium-sized organizations and enables you to design and implement powerful business applications with ease.",
    "In our Microsoft Access review, we look at the platform’s strengths and weaknesses and consider whether it can compete against its more modern competitors.",
    "Although the platform is infrequently updated, many business leaders should still consider Microsoft Access as one of the best cloud database platforms for their organization.",
    "You can purchase Microsoft Access in two ways: in a Microsoft 365 bundle or as a standalone product.",
    "Sole-traders or small businesses can purchase a personal Microsoft 365 subscription for $69.99 per year (one license) or $99.99 per year (six licenses).",
    "For larger organizations, there are three options. For full Microsoft 365 access, including OneDrive and Teams, you can purchase Microsoft 365 Business Standard ($12.50 user/month) or Microsoft 365 Business Standard Premium ($20 user/month). If you just want app access without the collaborative features, you can purchase Microsoft 365 Apps for $8.25 user/month.",
    "As a standalone product, Access costs $139.99.",
    "Like with most Microsoft applications, preloaded templates are aplenty, and there’s one for almost all business requirements. This saves you time when creating new databases and applications, and means you can leverage the platform’s powerful features without spending hours and hours in training.",
    "Relationships are important, and this is particularly true when it comes to Microsoft Access. One of the most powerful features of a relational database builder (like Access) is assigning relationships between different blocks of data.",
    "Access enables users to designate several types of relationships, such as one-to-one, one-to-many, or many-to-many.",
    "These relationships are what enable you to design advanced search queries that provide new insights and harness the power of your data.",
    "It is also what separates Access from a program like Microsoft Excel that doesn’t enable you to connect data in this way.",
    "Access is increasingly being outpaced by competitors that use advanced AI and machine learning capabilities, along with cloud database technologies. However, this shouldn’t mean that Access is obsolete. Fortunately, we can now integrate Access with many other cloud database and line-of-business apps, including Microsoft’s own Azure SQL.",
    "These integrations mean that day-to-day business applications can be created and powered through Access, while the data created is shared with other cloud databases for safekeeping and advanced querying.",
    "Unfortunately, Access is another Microsoft platform that is only available for Windows 10 users. There is no support for iOS, macOS, Linux, or any other operating system. There is also no web app, which means you can only use Access on the device on which it was installed.",
    "On Windows, however, the app performs well and is highly responsive. The interface has an early 2000’s industrial feel about it, and if you’ve used the platform at any point in the past 20 years, you’ll notice that little has changed.",
    "One of the biggest advantages of purchasing a Microsoft product is the premium support. Whether you purchase a personal subscription or an advanced enterprise package, you know that Microsoft will troubleshoot your issues in a timely and efficient manner.",
    "Within the app you can access video tutorials, how-to guides, and answers to a vast range of frequently asked questions. You can also contact the Microsoft support team directly via an in-app live chatbox.",
    "However, we found the in-app help site to be laggy and difficult to use. We recommend heading directly to Microsoft’s website for support.",
    "Security for Microsoft Access forms part of the broader Microsoft 365 security umbrella. If you use Microsoft’s cloud storage platform, OneDrive, all your Access files will be encrypted both in transit and at rest. If you prefer total security with end-to-end encryption, the Personal Vault within OneDrive can achieve this.",
    "Alternatively, you can store Access files locally on your device or a removable drive. However, if you choose this option, then security is your responsibility. The file will only be as secure as the drive it is stored in.",
    "Access to your account is also highly secure. Microsoft enables all users to implement two-factor authentication, which we highly recommend.",
    "Microsoft Access faces competition on multiple fronts, including from other Microsoft platforms. There is always Microsoft Excel for simple databases and querying, which most people are already familiar with. For more advanced database building that is highly scalable, there is Microsoft Azure.",
    "Other competitors in the cloud database space include Oracle and Amazon, which are accumulating greater market share due to their impressive AI and machine learning capabilities. However, these services might be too costly and unnecessarily advanced for small businesses.",
    "For companies looking to build their own databases, it’s also worth considering the best database design software.",
    "Although Microsoft Access might be falling behind newer and more powerful platforms such as Microsoft Azure, Oracle Database Cloud, and Amazon Relational Database, we still think it’s a useful tool for most businesses.",
    "If you need to create relational databases suited for front-end business use, then there are few platforms more suitable than Microsoft Access. The vast range of templates and straightforward features enable you to make your data work for you in no time at all.",
    "And if you’re already using Microsoft 365 apps, you can use the platform at no extra cost. So, in conclusion, we don’t think it’s time to do away with Access just yet."
  ],
  "headers": {
    "3": "Microsoft Access: Plans and pricing",
    "7": "Microsoft Access: Features",
    "14": "Microsoft Access: Interface and in use",
    "16": "Microsoft Access: Support",
    "19": "Microsoft Access: Security",
    "22": "The competition",
    "25": "Final verdict"
  },
  "links": {
    "Microsoft Access": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9028275518392649000&xs=1&url=https%3A%2F%2Fwww.microsoft.com%2Fen%2Fmicrosoft-365%2Faccess&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmicrosoft-access",
    "best cloud database": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "collaborative features": "https://www.techradar.com/best/best-online-collaboration-tools",
    "databases": "https://www.techradar.com/best/best-database-software",
    "Microsoft Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "best database design software": "https://www.techradar.com/best/best-database-design-software"
  }
}