{
  "source": "https://www.techradar.com/reviews/bluejeans",
  "title": "BlueJeans video conferencing service review",
  "category": "computing",
  "updated": "2020-10-08T20:17:31Z",
  "author": "christian-rigg",
  "summary": "A video conferencing solution rich in features",
  "verdict": "BlueJeans has several great features for businesses, including video recording, meeting highlights with task assignment, and up to 20 breakout meetings for collaborating on subtasks. However, issues with lag potentially undermine the service.",
  "pros": [
    "Smart meeting minutes with task assignment",
    "Encryption-only access for improved security",
    "Custom branding"
  ],
  "cons": [
    "More latency than many competitors",
    "No background-blur option"
  ],
  "article": [
    "If you’re looking for the best video conferencing software, BlueJeans has no shortage of features that help it stand out, including high definition video and crystal-clear Dolby Vision sound, encrypted conference calls, and advanced user management, all of which will appeal to business owners and professionals. Read through our full BlueJeans video conferencing review below to see if this video conferencing software is right for your business.",
    "Like most video conferencing services, BlueJeans is priced per host—somebody who can schedule and start meetings, and invite guests. You’ll want to get enough hosts for your company, bearing in mind that no meetings can take place in their absence. On the plus side, BlueJeans never limits your meetings: conference calls can be left open for hours, even days.",
    "The Standard plan costs $12.49/host/month and comes with unlimited meetings of up to 50 participants and five hours of video recording per month. Pro plans cost $17.49/host/month and support up to 75 participants, with 20 additional hours of recording, advanced call analytics, and integration with collaborative apps like Slack and Microsoft Teams. Both plans can be paid annually to benefit from a 20% discount.",
    "Tailor-made enterprise plans come with up to 100 participants, unlimited recordings, brand customization and ISP-bypass for direct connections to BlueJeans servers.",
    "Finally, you can try out the software with a risk-free 7 day trial, before making any commitments.",
    "BlueJeans is compatible with Windows, Mac, Linux, iOS/iPadOS and Android, and can be accessed through all major browsers. The software includes a number of stand-out features that will appeal to business owners and professionals. For example, meeting recordings can be broken down into chapters, with segment highlights, task assignment and smart follow-up.",
    "On top of the fact that meetings have no time limit, hosts can create up to 20 breakout sessions and distribute participants as needed, great for collaborating on subtasks. You can easily share your screen, annotate with whiteboard functions, and even allow remote desktop access to an assignee—great for smooth presentations. However, we did miss the ability to blur out backgrounds for greater privacy and distraction-free meetings.",
    "Administrators have advanced user management features, and can enable or disable features on a company-wide or group basis.",
    "Setting up BlueJeans on both our 16” MacBook Pro and 12.9” iPad Pro was a breeze. Just download the program, enter your login details, and you’re good to go. On both devices, we were up and running in fewer than 2 minutes. On the admin side of things, it will take a little longer to add users, assign groups and manage permissions, but we found the admin interface very intuitive, and loved all the tips and guides for helping you to get started.",
    "We found the BlueJeans interface impressively intuitive and enjoyable to use. Scheduling and starting meetings was easy, and we liked the click-to-copy feature for sharing your meeting’s ID. All the features were easy to find: recording, participant management, and chat, with whiteboarding, screen sharing and others “apps” grouped together. The iPadOS was equally intuitive, and we loved the Low Data and Commute modes.",
    "In terms of CPU use, we were happy to see that BlueJeans used about 25% CPU on our 2.6 GHz 6-Core Intel Core i7 and little RAM. However, we would have gladly sacrificed a few more system resources for higher latency: video and audio are delayed by about 1.5 seconds, which is longer than some competitors. On the plus side, video quality is great at 720p, and sound comes through clearly thanks to built-in Dolby Vision technology.",
    "BlueJeans prides itself on great security, and has a number of features both client-side and on-server to help keep your meetings and data secure. While end-to-end encryption isn’t supported (which is typical for conferencing software and related to the technical challenges involved in encrypting video for multiple participants), calls can still be AES-128 encrypted. Admins can also require participants to connect using encryption-enabled channels.",
    "Administrators also have full control over meetings, and can add a passcode, expel or silence participants, enforce certain user password protocols, and turn on and off features like session recording or remote desktop control.",
    "Overall, we found BlueJeans’ security sufficient for most business settings and, just as important, easy to understand.",
    "First off, BlueJeans has a rich knowledge base and FAQ, plus lots of tutorials and videos to get you started, understand features, and set admin preferences appropriately for your business. On top of this, BlueJeans’ phone support and online chat are both available 24 hours a day, seven days per week—that’s a big advantage for businesses, who may need quick support at any time.",
    "Businesses have the luxury of choice as providers rise to meet an increased demand for video conferencing solutions.",
    "GoToMeeting is another great business-oriented suite. Starting at a similar price point of $12/host/month, it has an intuitive interface and, in exchange for a slightly heavier use of system resources, a smoother audiovisual experience. If your conferences tend to include lots of active discussion, this may be a better option.",
    "Alternatively, if your conferencing needs are relatively light, with short, infrequent meetings, you might find everything you need with Zoom’s free plan, a surprisingly feature-rich solution that supports an unlimited number of meetings with up to 100 participants for 45 minutes.",
    "BlueJeans has several great features for businesses, including video recording, meeting highlights with task assignment, and up to 20 breakout meetings for collaborating on subtasks. The software was built with security in mind, and administrators will enjoy the deep level of control over participants and features.",
    "However, while the image and sound quality is excellent, we found the lag a little longer than many other video conferencing solutions. We recommend signing up for a free trial and testing out the software on your own network to see if the latency meets your needs. If so, we highly recommend taking advantage of BlueJeans business-oriented features, great security and ease of use."
  ],
  "headers": {
    "1": "Plans and pricing",
    "5": "Features and utilities",
    "8": "Setup",
    "9": "Interface and performance",
    "11": "Security",
    "14": "Support",
    "15": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "BlueJeans": "https://www.prf.hn/click/camref:1101l9P59/pubref:trd-us-1602951802977748000/destination:https%3A%2F%2Fstore.bluejeans.com%2F",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "collaborative apps": "https://www.techradar.com/best/best-online-collaboration-tools",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "Windows": "https://www.techradar.com/news/best-windows-10-pro-laptops",
    "Mac": "https://www.techradar.com/best/best-business-mac",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "iOS/iPadOS": "https://www.techradar.com/best/best-business-ipad-apps",
    "Android": "https://www.techradar.com/best/best-android-antivirus-app",
    "password": "https://www.techradar.com/best/password-manager",
    "GoToMeeting": "https://www.techradar.com/reviews/gotomeeting",
    "Zoom": "https://www.techradar.com/reviews/zoom"
  }
}