{
  "source": "https://www.techradar.com/reviews/quickbooks-gopayment",
  "title": "QuickBooks GoPayment review",
  "category": "computing",
  "updated": "2021-06-23T14:00:35Z",
  "author": "rob-clymo",
  "summary": "QuickBooks GoPayment lets you process card payments using the power of mobile",
  "verdict": "GoPayment comes recommended for the growing business that needs to process larger and higher numbers of payments, and its simple-but-effective design is best suited to existing QuickBooks customers.",
  "pros": [
    "Very versatile",
    "Works with Quickbooks",
    "Mobile solution",
    "Free card reader"
  ],
  "cons": [
    "You need an account to get the best from it",
    "Can get expensive",
    "Disapointing customer support",
    "Complicated pricing"
  ],
  "article": [
    "QuickBooks GoPayment is a product from Intuit, which is the huge company that has developed many other software solutions for the business community. It’s therefore well placed to offer GoPayment, which allows merchants to process payments and then tie transactions and orders into QuickBooks Online.",
    "To do this you need an Apple or Android smartphone or tablet plus the free app. Alternatively, you can use a card reader to ‘swipe, dip or tap’ as Intuit puts it. On paper this sounds like the perfect arrangement that should be able to make your business more efficient and hopefully, due to the added flexibility, push up profits despite the current coronavirus crisis. So does it work like that in reality?",
    "Considering that GoPayment has the backing of a large company like Intuit there is less clarity when it comes to pricing for the service. On the face of it the QuickBooks GoPayment app is free, so that does at least get you started. From there though you’ll need to get yourself an account with the likes of QuickBooks, TurboTax or Mint in order to get the best from it.",
    "QuickBooks Online is actually the best way to milk most from the system and ensure you get value as it integrates of a lot of the features found within that package. Currently it’s down from $25 per month to $12 for the Simple Start package, while the Essentials bundle is down from $40 to $20 per month.",
    "And, at the time of writing you simply pay per transaction, with the QuickBooks website quoting the following figures: ACH bank transfers 1% (max $10), Card – swiped – 2.4% plus 25 cents, card – invoiced – 2.9% plus 25 cents or card – keyed coming in at the most expensive with a 3.4% plus 25 cents cost.",
    "However, deals change continually on this site and it also says that it’s possible to make additional savings if you’re a larger concern by calling them.",
    "Quickbooks GoPayment is flexible in that it you can accept payments from customers who want to use credit cards, cash or old school cheques too. You’ll need to order the free card reader from them, which will allow you to enter the customers card information, using a variety of options including swiping or tapping it.",
    "Of course, being part of Intuit means that this large concern has produced an array of solutions for whatever kind of business you run. Using the app-based approach GoPayment is therefore tailored more to an on-the-go or mobile business where you don't necessarily have the traditional point of sale arrangement in place. And, as you would expect, transactions can be handled via Apple or Android devices.",
    "As you would hope and expect, the performance of QuickBooks as a service has already proven itself over many years. The GoPayment part of this equation adds to that, by allowing business owners to use the card reader to take payments on-the-go, and by having everything linked this means that you can do quick everyday essentials such as generating invoices and receipts in larger volumes.",
    "There are currently two readers, the QuickBooks All-in-One and the QuickBooks Chip and Magstripe. The former comes free if you sign up for QuickBooks Payments. However, the All-in-One unit does have the Bluetooth benefit of being able to handle Apple Pay, Google Pay and Samsung Pay too, plus regular contactless cards or EMV and magstripe variants too.",
    "The good thing with GoPayment is that it’s not essential to have a QuickBooks user account in order to enjoy what it offers. That said, you will find the experience an easier more seamless adventure if you do tie all of your business elements together.",
    "So, to be honest, you’ll probably find that it’s best to have an account or, perhaps, look elsewhere instead if you don't like the idea of being tied in to one solution.",
    "Nevertheless, if you do go down the GoPayment path you’ll need to get yourself an Intuit merchant account and from there it’s a case of using the free reader whenever you want to process a card payment.",
    "One of the obvious benefits of being signed up to a large concern like QuickBooks and Intuit is that you should get the bonus of having lots of support. And that’s exactly what you do get via an array of different options. There are online FAQs, tutorials, video explainers, blogs and community resources too.",
    "GoPayment looks to offer much, and it seems to do the job particularly well if you’re a fully paid up member of the QuickBooks community. However, we think it seems rather confusing to get started with, the pricing and different deals that change frequently don't help either.",
    "While the app is workmanlike and acceptable enough, it could still benefit from improvements. Similarly, while the hardware in the shape of those card readers is suitable for the job in hand, you’ll still find it most appealing if you’re an existing QuickBooks customer. There’s potential, but improvements to the whole package would be welcome. Competition-wise, lookout for Square, SumUp, Shopify, PayAnywhere as well as iZettle."
  ],
  "headers": {
    "2": "Pricing",
    "6": "Features",
    "8": "Performance",
    "10": "Ease of use",
    "13": "Support",
    "14": "Final verdict"
  },
  "links": {
    "QuickBooks GoPayment": "https://quickbooks.intuit.com/payments/mobile/",
    "Intuit": "https://www.techradar.com/news/intuit-takeover-of-credit-karma-probed-by-justice-department",
    "software solutions": "https://www.techradar.com/best/accounting-software-small-business",
    "process payments": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "QuickBooks Online": "https://signup.quickbooks.intuit.com/?locale=en-us&offerType=buy&bc=OBI-LL3&offerId=20015757",
    "card reader": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "QuickBooks website": "https://quickbooks.intuit.com/payments/pricing/",
    "GoPayment": "https://quickbooks.intuit.com/payments/mobile/",
    "card readers": "https://www.techradar.com/how-to/how-to-take-card-payments-contactless-or-pin-based",
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "SumUp": "https://www.techradar.com/reviews/sumup-pos",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "PayAnywhere": "https://www.techradar.com/reviews/payanywhere",
    "iZettle": "https://www.techradar.com/reviews/izettle-2"
  }
}