{
  "source": "https://www.techradar.com/reviews/roku-express",
  "title": "Roku Express (2019) review",
  "category": "audio-visual",
  "updated": "2020-06-02T10:55:29Z",
  "author": "nick-pino",
  "summary": "A revamped design and free new streaming channels boost the lowest-powered Roku",
  "verdict": "The Roku Express may not be the most powerful or fastest player on the market, but it’s built on a rock-solid, egalitarian platform that offers both a truly universal search feature and a ton of free content. It makes some concessions to reach its low price (see: its basic IR remote and lack of 4K support) but it’s still a very good player, especially for folks who still use an HDTV. That said, if you own a 4K HDR TV or plan on buying one in the future, it’s worth stepping up to the Roku Streaming Stick+ or, if you want an ethernet port, the Roku Ultra.",
  "pros": [
    "Unbelievably inexpensive",
    "Roku’s egalitarian platform",
    "Comes with a remote"
  ],
  "cons": [
    "Basic IR remote",
    "Can’t stream 4K HDR content",
    "Super short HDMI cable"
  ],
  "article": [
    "Look as hard as you want, there’s no other streaming player on the planet like the Roku Express. Sure, at face value both Chromecast and the basic Amazon Fire TV Stick seem to offer something similar, but both fall short - either due to their lack of a remote in the case of Chromecast or in the lack of a truly open platform in the case of the Amazon Fire TV Stick. What the Roku Express excels at is offering folks a basic HD streaming player that’s dead-simple setup and use, comes with a remote in the box … if albeit a basic one.",
    "While there are other, more powerful players on the market like the new Roku Ultra and recently revamped Amazon Fire TV Cube, the Roku Express offers steadfast HD streaming for around $30 (about £25, AU$40), less money than literally every other other streaming device on the planet, Chromecast included.",
    "Here’s what it’s like to use one as your main streaming player.",
    "[Update: Roku has announced a big update to its free, ad-supported platform, the Roku Channel, bringing the experience of watching linear TV to its popular streaming devices.]",
    "The new 2019 Roku Express is available in the US right now and replaces last year’s model at the same price $30 (about £25, AU$40).",
    "For comparison, the Google Chromecast is $35 (£30, AU$59) and offers similar performance but uses your phone instead of a remote, while the Amazon Fire TV Stick with the Alexa Voice Remote costs $39.99 (£39.99, AU$69.99). The Fire TV Stick is very comparable in terms of performance, but instead uses Amazon’s more insular Amazon Fire TV OS.",
    "While the Roku Express’s performance might fit into the category of streaming video box, its stature puts it more in the category of a streaming stick. At 0.7 x 3.4 x 1.4 inches (H x W x D) it’s nearly the same size as the Roku Streaming Stick and, funny enough, even smaller than the remote that comes inside the box. But, the benefit to its small form factor is that you can throw it in a bag or store in on your media shelf without it taking up too much real estate.",
    "The comparison to the Stick goes beyond size, however. Like the Roku Streaming Stick, the Roku Express is powered via its microUSB port. Roku ships the Express with a microUSB-to-USB cable, which can be plugged directly into your TV if your TV has a USB port on it, and a wall adapter if the first option doesn’t work.",
    "Roku also includes a two-foot-long HDMI cable in every box, a remote and double-sided adhesive tape that will allow you to stick the Express onto your TV or on any surface around it that still gives it line-of-sight to the remote.",
    "The inclusion of all these accessories is actually somewhat surprising – while other manufacturers are all too happy to send you out the door without all the necessary equipment in hand, the Roku Express is a complete kit.",
    "But there are three big problems here. The first is that its diminutive size would’ve made it easy to tuck behind a TV but, because it needs line-of-sight to the remote, it has to sit out on the shelf. It also means that the entire system is IR-based, and that means that the remote can’t do anything beyond basic functions - i.e. no voice search, volume control or private listening. For that, you’ll need to step up to one of the better Roku models.",
    "The other problem is that, while Roku is one of the few manufacturers to provide you with an HDMI cable in the box - something not even the $119 Amazon Fire TV Cube does - it’s likely the shortest HDMI cable you’ve ever come across. It doesn’t give you much room to move the box around and, considering that it also always needs line of sight, it pretty much means that it has to sit right under your TV.",
    "The last issue, and this is a minor one given the scope of the player, is that Roku decided to use an 802.11b/g/n single-band wireless antenna instead of upgrading to 802.11ac, the new wireless standard that improves both the distance in which signal can travel and transmission speed. Roku says that because the player only streams in HD it doesn’t need the better component, but the additional reach and speed would almost certainly be appreciated.",
    "Performance, more or less, is shaped by three things: the Wi-Fi antenna, the processor and the Roku platform. We’ve talked about the Wi-Fi antenna already – most notably its short range and lackluster bandwidth – but we have yet to discuss the last two.",
    "Because Roku doesn’t disclose what processor it uses inside the Roku Express, it’s hard to compare it to other streaming players in a fair, objective way. That said, we’re happy to provide anecdotal evidence based on our experience with the player.",
    "Despite using something less powerful than, say, the Nvidia Shield's Tegra X1 ARM-based processor, which has a memory clock of 1600MHz, the Roku Express does just fine. That’s because the OS on top of the player is less power-hungry than Android TV and its ilk, and therefore allows the Roku Express to zip along fairly well, especially on good connections.",
    "Of course, a ‘good’ internet connection ranges from area to area and from person to person. For our test, we were using a 150mbps wireless connection that was slowed down to around 22mbps on the Roku Express (still considered ‘Excellent’ according to Roku OS). Keep those numbers in mind as we talk about speed and performance.",
    "On our connection, the Express starts up in under 30 seconds and content takes 5 seconds or less to load, depending on which app we used. If your network is a bit spotty or is prone to suffering from slowdown, however, expect that number to skew a bit higher.",
    "The counter-balance to the antenna and processor is the Roku platform – it’s lightweight and fairly minimalist in nature. At most there’s maybe 15 boxes on the screen, which makes it easy fodder for the Roku Express to scroll through without having to stop and wait for content to pop in.",
    "Combine these three factors and you have a useable streaming experience for less than the cost of a few Blu-rays. The Roku Express isn’t faster than Chromecast when it comes to streaming content, nor does it beat out Amazon’s Fire TV Stick or even Roku’s own Streaming Stick released earlier this year. The Express also doesn’t do your content any favors in terms of upscaling - it can take 720p content to 1080p, but that’s about all it can do. If you want something that will really enhance your content, you should probably step up to one of Roku’s 4K players or the Apple TV HD.",
    "The other point worth pointing out is that the Roku Express can only handle streams of up to 1080p. If you want to stream your favorite Netflix or Amazon Prime series in Ultra HD, you’ll have to step up to the Roku Premiere line of set-top boxes or any one of the 4K players like the Chromecast Ultra, Apple TV 4K or Nvidia Shield from Roku’s competitors.",
    "Should you decide to stick with the HD-only Roku Express you can expect decent, but not mind-bogglingly beautiful images. Streaming Planet Earth II in HD just didn’t have the same effect as it does when you stream it on a 4K TV and player, especially on big screens. In fact, we really wouldn’t recommend the Roku Express on screens much larger than 40-inches unless you have a TV with excellent image upscaling.",
    "So what, exactly, can you watch on Roku? Well, there’s the major streaming platforms – Netflix, Amazon, HBO, Hulu, Google Play TV and Movies and, starting in October, Apple TV – but then there are thousands of extra channels, including The Roku Channel which offers free TV shows and movies with ads.",
    "At last count, Roku has over 3,500 channels available to download with varying degrees of paid content, interesting shows and specificity. There's plenty of mainstream content like The Big Bang Theory is available on CBS All Access and Captain America: Civil War can be found on Google Play Movies and TV, but if you're looking for a film noir alien channel or an ultra-specific '90s country metal hybrid station, Roku's storefront is the place to find it.",
    "Cord cutters who live in the US will also have access to Sling TV, YouTube TV and PlayStation Vue, the live TV cable alternatives that are bringing new life to the cord cutting movement. While both services run significantly better on higher-end streaming devices, they’ll still run on the Express’s lower-end hardware.",
    "But the biggest benefit of choosing a Roku Express over a Chromecast or Amazon Streaming Stick is the fact that it runs the full version of Roku’s OS. That means you’ll have access to every app the larger Roku boxes run as well as essential Roku functions like universal search that scours over 100 apps to find the best price on TV shows and movies and Roku Feed which surfaces content currently in theaters and alerts you when it becomes available on your favorite streaming services.",
    "Another feature Roku has that cord-cutters will love is the Featured Free section of the homepage that shows you what's available for free on the different services. This is an invaluable resource for cord-cutters who want live cable-free, and a great alternative to channel surfing for folks who still have a box.",
    "Yes, other platforms like Apple TV and Amazon Fire TV have implemented similar features on their boxes, but neither hold a candle to Roku when it comes to finding cheap or free content in an unbiased way.",
    "The last piece of the puzzle worth talking about is the remote that ships with the Roku Express. The remote itself is matte black, incredibly lightweight and has a small purple Roku tag sticking out of one end.",
    "Depending on where you buy the Roku Express, the remote’s bottom four media buttons differ. However, what you’ll find exactly the same on every remote are the back, home, directional and playback buttons, all of which are pretty clearly labeled and dead-simple to use. The remote that was shipped to us had Netflix, Hulu, Sling TV and ESPN+ media buttons as well.",
    "What you won’t find on the remote is the 3.5mm headphone jack that you find on last year’s Roku Streaming Stick+, the Roku Premiere+ or the Roku Ultra models that allows you to listen to your TV through the remote, nor does it have a microphone built in for voice searches, a 3.5mm jack for private listening or a volume rocker to change the volume on your TV.",
    "That said, if you want that functionality and sit near your smartphone while binging your favorite shows, you can always download the Roku app which allows for private listening, faster search and the ability to control your Roku Feed. It’s an absolutely excellent app and has actually been our preferred way to control Roku devices for the last year.",
    "Besides being one of the easiest to use products on the market, the Roku Express is also the absolute cheapest at $30 (about £25, AU$40) and has done so without cutting many corners. It comes with a remote and a completely functional Roku platform, not some cheap watered down version. Its small size and even smaller price tag make it one of the lowest points of entry into streaming, and a perfect gift for a family member or friend still on the fence about streaming video players.",
    "That being said, the Express is a somewhat paradoxical name – it’s not as fast as other streaming video players on the market or even as quick as Roku’s own streaming stick. For that reason, if you own a 4K TV or plan on buying one in the future, it’s worth stepping up to the Roku Streaming Stick+ or, if you want an ethernet port, the Roku Ultra."
  ],
  "headers": {
    "4": "Price and release date",
    "6": "Design",
    "13": "Performance",
    "22": "Roku OS and content",
    "28": "Remote",
    "32": "Final verdict"
  },
  "links": {
    "Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Roku Ultra": "https://www.techradar.com/reviews/roku-ultra",
    "Amazon Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "Roku has announced a big update": "https://www.techradar.com/news/roku-update-big-addition-brings-live-on-screen-program-guide-30-extra-channels",
    "Roku Channel": "https://www.techradar.com/news/rokus-free-streaming-service-is-now-available-on-ios-devices",
    "streaming devices": "https://www.techradar.com/best/streaming-device",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "Roku Streaming Stick+": "https://www.techradar.com/reviews/roku-streaming-stick"
  }
}