{
  "source": "https://www.techradar.com/reviews/glyph-thunderbolt-3-dock",
  "title": "Glyph Thunderbolt 3 Dock review",
  "category": "computing",
  "updated": "2020-10-02T09:49:45Z",
  "author": "mark-pickavance",
  "summary": "More than your average dock",
  "verdict": "Beautifully engineer and with an excellent specification, this is the Thunderbolt 3 docking station that users will adore. The integrated NVMe storage is useful, but the limitations of bandwidth have undermined its maximum performance.",
  "pros": [
    "Gorgeously engineered",
    "Full Thunderbolt feature set and power output",
    "Inbuilt NVMe capability",
    "3-year Warranty"
  ],
  "cons": [
    "Expensive",
    "NVMe performance is dissapointing"
  ],
  "article": [
    "Having tested the impressively quick Glyph Atom Pro SSD not long ago, we were keen to see how other devices from the same stable compared.",
    "Luckily, Glyph Production Technologies dispatched its equally stylish Thunderbolt 3 dock for us to review.",
    "With so many Thunderbolt 3 docks now available, many using the new Intel Thunderbolt chipsets, we were curious to discover what made this one worth owning?",
    "Products from Glyph are often expensive we’ve found, probably because the core market for its products is Apple customers. But the price of this unit varies massively depending on where you purchase it.",
    "The model reviewed here that comes with no internal storage costs £413.66 on the UK Amazon but only $299.95 on the US Amazon.com site. Even with shipping added, it is cheaper to buy it stateside than get it directly in the UK.",
    "European pricing is typically €414.90, making it cheaper than the UK, but not as cheap as for Americans.",
    "Alongside the bare unit the possible NVMe storage options are 500GB for $399.95, 1TB for $499.95 and $663.95 for the 2TB model.",
    "When you consider that a cheap 2TB NVME, like the PNY CS2130, costs just around $234.99, the ability to competently use a screwdriver could save you a considerable amount.",
    "There is a simplistic elegance to the Glyph Thunderbolt 3 dock that we like.",
    "It’s not one of those attention-grabbing devices. Instead, it exudes functionality and reliability while being subtly understated.",
    "Where other designs tend to use a metal tube with plastic ends, this dock is metal throughout, and it feels substantial and always cool to the touch.",
    "It’s a minor point, but the labelling on this product is much better than we’ve seen elsewhere. As the Glyph designers took the time to use all the proper USB and Thunderbolt logos, revealing which are the 10Gbit ports and which aren’t without the need to refer to the manual.",
    "Where it also diverges from other popular designs is that this is physically a large dock that would be hard to ignore on any desk. Glyph went with the choice to put the Thunderbolt ports, two of them, on the rear and not the front.",
    "To achieve the full 40Gbps performance of Thunderbolt 3 on a passive cable, it must be 80cm or shorter, and its precisely that length here. That cable length should not be a problem for most laptop users, who are the intended audience for this device.",
    "The front offers a 10Gbit USB-C, 5Gbit USB-A, 3.5 mm jack sockets for both headphones and microphones and an SD Card reader (UHS-II). On the rear are two Thunderbolt 3 ports, one of these being labelled for 87 watts charging, and the other with 15 watts.",
    "Also at the back are the power connection, a DisplayPort outlet, another USB-A and a 1Gbit Ethernet port.",
    "While only two USB-A ports might seem a limitation for those that have a mouse, keyboard and webcam to connect, there isn’t anything stopping the chaining of a USB hub from them.",
    "What you don’t get is a power switch, making the Glyph Thunderbolt 3 dock powered from the point it is connected to the PSU and that to a power outlet.",
    "We’d prefer an on/off switch, if only from an environmental perspective, but Glyph decided it didn’t need one.",
    "There is one other exciting feature that can be found under a removable plate underneath, an M.2 socket for NVMe SSD. If you buy this unit with storage mounted will discover the slot already occupied. But for those who purchased a dock without any storage, can remove a few screws and install a standard M.2 2280 format NVMe drive of their choice.",
    "It should go without saying, but this installation should only happen with the device disconnected from the power supply.",
    "As we’ve mentioned in numerous Thunderbolt docking station reviews, they’re an exercise in bandwidth management, and the Glyph solution is no different.",
    "If we add up the potential connection options, then you can oversubscribe the 40Gbps of the technology with predictable results.",
    "Those that want to use the DisplayPort and Thunderbolt downlink for dual 4K monitors, for example, need to accept that there isn’t enough bandwidth left for all the other ports full performance.",
    "Equally, if you want to attach a Thunderbolt external drive, like the Glyph Atom Pro, then you can only have a single monitor connected. How the pie sliced is up to the user, but you can’t have everything.",
    "One factor that most Thunderbolt 3 docks don’t have to consider is that the M.2 slot is also another mouth to feed, as the PCIe express requirement for NVMe drives is typically four lanes, each of 7.88Gbps. That’s a whopping 31.5Gbps, on a system that only has 40Gbps to share around.",
    "Allowing it to have the full bandwidth wasn’t a viable option, so in this device, they capped the NVMe as a two PCIe lane or 15Gbps connection. The result is that the performance of NVMe drives installed in the dock is half what they can achieve when internally mounted in a computer, sadly.",
    "And, if you do use it, and have dual monitors, then only about 5Gbps will be left for anything else you connect. If they’re low bandwidth peripherals like mice and keyboards, that won’t be a problem, but for those using external USB-C storage, it could have a noticeable performance impact.",
    "Where is fully delivers is on power, as it comes with a massive PSU which supplies 20v at 7.5A to the dock. For charging it can provide slightly more than the 85 watts that the more demanding laptops need, and it even has 15 watts spare to send to any attached Thunderbolt peripheral.",
    "If you have a modern laptop or Apple Mac with a full 40Gbps Thunderbolt 3 port, the Glyph Thunderbolt 3 dock should be plug and play.",
    "But it is always worth mentioning that some Apple equipment has Type-C ports that aren’t Thunderbolt, and some PC makers installed Thunderbolt that only supports 20Gbps connections.",
    "This dock won’t work with a USB-C downlink, and while it will work with a degraded Thunderbolt facility, the reduced bandwidth will impact what you can connect and run concurrently.",
    "Those wanting to get a Thunderbolt docking station need to research the laptop they intend to connect to it. And discover any limitations before they order this hardware or any other dock.",
    "There are plenty of Thunderbolt 3 docking stations that are cheaper than this one, but the number that has the inbuilt storage is a small list.",
    "Sonnet makes the SON-ECHOEXPSE1-TB3 for around $250 that allows a full-Height, half-Length PCIe card to be connected to Thunderbolt, but it isn’t a dock.",
    "And, StarTech has a Thunderbolt 3 PCIe Expansion Chassis With DisplayPort that is an alternative to the Glyph solution, but like the Sonnet would require an M.2 carrier card to mount the NVMe drive.",
    "The nearest solution is a new product by TerraMaster, the TB2, an external RAID box with space for two 3.5 or 2.5-inch SATA drives with a Thunderbolt downlink and DisplayPort.",
    "It costs a little more than the Glyph, doesn’t have any USB ports, and the speed of the storage wouldn't be at the level of the NVMe drive in our review hardware.",
    "The best choice for those that have two Thunderbolt ports on their computer is to get Thunderbolt connected dock and also an NVMe Thunderbolt enclosure, like the one made by YottaMaster.",
    "These enclosures have the full bandwidth of Thunderbolt 3 available to the one device, allowing them to get much closer to the performance of the drive when mounted inside the computer.",
    "For US customers the Glyph Thunderbolt 3 Dock is something of a bargain, but for Europeans, it’s a much less inviting deal.",
    "Those stateside get a fully-featured Thunderbolt 3 docking station that offers 87 watts of charging power, a Thunderbolt 3 downlink, and an inherent high-speed storage device.",
    "Having a downlink gives the flexibility to support a 5K single video output or chain to other Thunderbolt devices.",
    "Our only disappointment is the NVMe slot that didn’t get the bandwidth that it could use reducing the performance significantly. That said, most NVMe drives used in the dock will still faster than any USB-C connected solution, but it could have been even quicker has more bandwidth been allocated.",
    "Based on the prices Glyph is asking for pre-installed NVMe, we’d recommend you bought and installed it yourself, and it isn’t worth using the very fastest drives, since that enhanced performance will be mostly redundant.",
    "Overall, until Thunderbolt 4 arrives and docks to support that technology, the Glyph Thunderbolt 3 Dock is about as good as it gets."
  ],
  "headers": {
    "3": "Price, availability and value",
    "8": "Design",
    "21": "Hardware",
    "29": "In use",
    "33": "Competitors",
    "40": "Final verdict"
  },
  "links": {
    "Glyph Atom Pro SSD": "https://www.techradar.com/reviews/glyph-atom-pro"
  }
}