{
  "source": "https://www.techradar.com/reviews/logitech-g213-prodigy",
  "title": "Logitech G213 Prodigy review",
  "category": "computing",
  "updated": "2020-05-25T11:00:28Z",
  "author": "mike-jennings",
  "summary": "Does it earn a place on your desk?",
  "verdict": "The G213 impresses in several key areas: its mechanical-style typing action is robust and impressive, and it has good features for media playback and day-to-day use. Its build quality and lighting could both be better, though, and it’s physically larger than its rivals.",
  "pros": [
    "Satisfying, impressive typing action",
    "Loads of media keys",
    "Plenty of features elsewhere"
  ],
  "cons": [
    "Mediocre build quality",
    "Underwhelming lighting",
    "Larger than rivals"
  ],
  "article": [
    "The Logitech G213 Prodigy is one of the more affordable keyboards around, with a price of $50 (£40, around AU$80). It wasn’t always this way, though – the G213 was originally released at nearly twice the price.",
    "The price drop means that the Logitech G213 Prodigy punches above its weight when compared to similarly-priced rivals like the Razer Cynosa Lite and SteelSeries Apex 3.",
    "The Logitech G213 Prodigy has an impressive collection of features. In the top-right corner it has an array of media buttons, a volume rocker, a Game Mode toggle and a button to switch the lighting on or off. This unit is spill-resistant, and it includes a braided cable. Logitech doesn’t reveal the G213’s rollover rating, but it’s at least ten – so it’s just as good as the Razer, and easily good enough for most gaming situations.",
    "The Logitech G213 Prodigy features RGB LEDs that can be customised across five different zones, and it includes a wrist-rest, but it still manages to look pretty modest, with no over-the-top design. In that sense, it’s well-suited for both gaming and work.",
    "The Logitech G213 Prodigy's feature set also compares reasonably well to rivals. The Razer has one lighting zone, no media keys, no wrist-rest and no braided cable, but it is spill-resistant. The SteelSeries is spill-resistant too, and it has ten-zone lighting, 24-key rollover and a removable wrist-rest, but no Game Mode and fewer media keys.",
    "The Logitech G213 Prodigy may have good features, but it’s not perfect. Its wrist-rest isn’t removable, which means it’s 218mm deep and 452mm wide – bigger than both rivals. There’s no USB pass-through. Build quality is only mediocre: its plastic easily creaks back and forward.",
    "The Razer is more robust and it has macro recording on all of its buttons, while the Logitech G213 Prodigy only has macro recording on the function row.",
    "The Logitech G213 Prodigy's lighting is also mixed. The G213 may have five zones, which means solid versatility, but the lighting itself is a little weak and inconsistent. It’s better than the Razer’s illumination, but the SteelSeries had stronger lettering and an extra glow beneath the keys.",
    "On the inside, the G213 has membrane keys rather than mechanical buttons – no surprise at this price. The keys are designed to mimic mechanical units, and have 4mm of travel distance and a 50g actuation force. They also have a noticeable tactile bump in their action, just like many mechanical devices.",
    "The Logitech G213 Prodigy's buttons are tall and heavy – in that respect they’re very similar to most mechanical keyboards. They’re firm, with a noticeable bump when they bottom out, and they’re quick.",
    "The heavy, satisfying and solid action will easily cope with mainstream gaming and esports.",
    "They’re also very different to rivals. The Razer’s buttons are softer, lighter and shorter – very similar. The SteelSeries keys are more closely matched, but they’re noticeably bouncier than the G213. That characteristic will irritate some users.",
    "As ever, the Logitech G213 Prodigy’s keys don’t compare to proper mechanical hardware: these buttons may be tall, heavy and firm, but a mechanical keyboard will have more snap and heft. Also bear in mind that you could find a basic mechanical keyboard for only thirty dollars or pounds more."
  ],
  "headers": {
    "0": "Two-minute review",
    "13": "Don't buy it if..."
  },
  "links": {
    "SteelSeries Apex 3": "https://www.techradar.com/reviews/steelseries-apex-3"
  }
}