{
  "source": "https://www.techradar.com/reviews/wavlink-wl-ug76pd2-usb-c-4k-universal-docking-station",
  "title": "WavLink WL-UG76PD2 USB-C 4K universal docking station review",
  "category": "computing",
  "updated": "2020-08-27T11:30:12Z",
  "author": "desire-athow",
  "summary": "A driverless docking station that can power two monitors and provide power delivery",
  "verdict": "The WavLink WL-UG76PD2 USB-C 4K Universal Docking Station is a lukewarm attempt to solve the universal problem of drivers and docking stations. Its relatively high price tag combined with fewer than 10 ports and a mere one-year warranty make it hard to recommend.",
  "pros": [
    "Has a power button",
    "No drivers to be downloaded",
    "Onboard graphics system-on-chip"
  ],
  "cons": [
    "Only 100W available power",
    "Only one year warranty",
    "Design is not optimal",
    "Lack of front facing ports",
    "One HDMI port is 2K only",
    "Only four USB ports",
    "No card reader",
    "No Type-C connectors"
  ],
  "article": [
    "The Apple MacBook Air can be credited for ushering the era of thin-and-light laptops when it launched in 2008. The world’s thinnest notebook at the time has spawned countless clones and inspired dozens of brands to develop something similar in style and substance.",
    "Apple’s minimalist approach has caused laptop vendors to eschew physical connectivity and embrace - where possible - wireless technology. Laptops like the 2020 MacBook Air or the 2020 Dell XPS 13 now have just a couple of connectors, albeit Thunderbolt 3 ones.",
    "That brings us nicely to the WavLink WL-UG76PD2, a 4K docking station that connects to your laptop using a USB Type-C connector without any driver installation. At the time of writing, it retailed for $150 after a special Amazon coupon.",
    "The WL-UG76PD2 looks like a rectangular block of plastic, solid but uninspired; At 103 x 61 x 125mm, it is reasonably compact and well designed, with tiny rubber feet and plenty of air vents for cooling. Be aware though that its power brick, a 100W (20V, 5A) one, is about half the size of the docking station and connects to it via a proprietary port.",
    "Speaking of connectors, there’s four USB 3.0 at the back (one of them supporting fast charge/Quick Charge 3.0), an audio jack, two HDMI ports (one supporting 2K and another one 4K), an on/off switch, a Gigabit Ethernet port plus a Type-C port that connects to your computer and provides up to 65W upstream power.",
    "On one side is a Kensington lock; note that all the ports are located at the rear of the device and there’s no available Type-C connector or card reader. Given the size of the box, we legitimately were expecting a few more connectors, nine ports simply isn’t enough in this post-pandemic era.",
    "The WavLink WL-UG76PD2 owes some of its features to the Silicon SM768 graphics display system-on-chip with InstantView driverless docking technology, one that “lets users mirror the screen of any laptop or Android phone to display presentations without downloading a driver”.",
    "Note that you will STILL need to use drivers but these will load directly from the docking station where they are stored on an embedded USB flash drive. This, according to Silicon Motion, will help “alleviating the frustrating and often confusing limitations corporate IT departments place on downloading and loading non-compliant software.”",
    "Silicon Motion claims that its Content Adaptive Technology (CAT) hardware codec for high efficiency display, will reduce CPU loading by up to 70%. We haven’t been able to test this in real life. Note that you will only be able to get power delivery if you use a Type-C connector.",
    "The InstantView app can work on any Windows operating system without the need for admin rights. It supports normal docking mode with drivers and has extended displays. When it opens, it will detect the monitor and docking station and automatically turn on the monitor and clone laptop screen to them.",
    "According to the manufacturer, the WavLink dock will work with Type-A too even if it doesn’t come with a USB-C to USB-A cable. It won’t damage your laptop as “USB will communicate with each other” and if charging is not supported, it simply won’t charge. Silicon Motion has already confirmed that a new firmware will be available by the time this review is published.",
    "In use we didn’t encounter any significant issues, the docking station worked as advertised but the learning curve was slightly bumpier than expected. We used a Dell Latitude 7490 laptop as the test platform, one which has a Thunderbolt 3/USB Type-C port and used a 4K monitor and a wireless keyboard/mouse as connecting peripherals.",
    "While the input peripherals were automatically detected, it’s not totally plug-and-play. Sure we didn’t need to download anything manually (as it was done through a menu rather than through a website) but it was still rather disconcerting as drivers had to be installed and updated, which can be an issue in a locked-down environment (e.g. enterprise laptops). In truth though, it does take only 60 seconds or so with the screen flickering a few times.",
    "In a very competitive environment, the WavLink WL-UG76PD2 has some serious rivals; the relatively high price combined with a lower-than-expected number ports, the lack of dual 4K HDMI ports and only one year warranty means that there’s a frightening amount of rivals that has more/better features for less.",
    "We are not a big fan of the boxy shape, the absence of any front facing ports, card readers and Type-C connector (there’s one but it is used by the laptop for power). Other docking stations offer more port variety (DisplayPort, VGA, card readers, Type-C) and features like a spare SSD slot or wireless charging.",
    "Plus the post-COVID 19 era will enshrine the permanence of work-from-home as a defacto way of working, which, in turn will make docking stations an almost essential fixture, which in turn will foster innovation and attract a lot of attention.",
    "That may also explain why we’ve seen an uptick in the number of Indiegogo projects covering docking stations and more monitor manufacturers moving to include docking-station capabilities with their display. It simply makes sense."
  ],
  "headers": {
    "3": "Design",
    "6": "Performance and in use",
    "13": "Final verdict"
  },
  "links": {
    "retailed for $150 after a special Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FWAVLINK-Universal-Docking-Delivery-Ethernet%2Fdp%2FB0874HP7GC%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1158400887952715000-20"
  }
}