{
  "source": "https://www.techradar.com/reviews/zoolz-cloud-backup",
  "title": "Zoolz Cloud Backup review",
  "category": "computing",
  "updated": "2020-11-02T11:02:33Z",
  "author": "mark-pickavance",
  "summary": "Leveraging the chill of Amazon Glacier technology",
  "verdict": "There are lots of things to like about Zoolz Cloud Backup for both personal use and business deployment. It combines an easy to follow interface with excellent web management options and the ability to combine cloud operations with local external storage.",
  "pros": [
    "Comprehensive, flexible options",
    "Cold storage component",
    "Set it up once, then forget it"
  ],
  "cons": [
    "Backups aren't instant",
    "Slightly dated interface",
    "No two-factor authentication"
  ],
  "article": [
    "Ed: Zoolz has now officially cancelled its lifetime subscriptions, a move that caused consternation amongst a lot of its users. We've reached out to the Zoolz team and this is what they told us in an official statement. The effect the pandemic has had on our business, coupled with cloud storage costs being consistently driven up by large multi-billion-dollar enterprises like Google, Apple, and Microsoft made it impossible for us to continue to compete in the consumer market. We were faced with a no-win decision to make: either cease to offer Home plans or lay off a considerable percentage of our workforce. We thought we had tried everything within our power to make this as easy and stress-free as possible for our Home customers. We extended the deadline for users to restore their data by six weeks. We offered refunds for those customers who had purchased their plans within the last 12 months, and finally we offered business plans to those wishing to keep their data on our servers with a 90% discount. We also offered users that requested more time to restore their data, extensions on the closure of their accounts. We completely understand our users’ frustration and anger, and although we did honour our lifetime deals for up to seven years, ultimately we had to cease offering consumer plans long before their ‘lifetime’ promise. We can’t thank all our users enough for the support we’ve received as we grew our cloud backup service. As a business, nothing is worse than when you can’t deliver on your promise. For this, we are deeply sorry.",
    "Zoolz Cloud Backup is geared primarily towards businesses looking for long-term, comprehensive data security that doesn't need much in the way of maintenance. It's particularly good at standards compliance (HIPAA, GDPR), and at giving you control over a team of users and how they're able to access the cloud storage you've configured.",
    "While Zoolz does give you a web interface to access your files, it's best at just working away in the background unseen, and letting you restore files as and when needed. The Zoolz service also gives you the option of what it calls 'cold storage' using Amazon Glacier technology – cheaper online storage for files that you don't need to access quite as often.",
    "Zoolz has a whole host of features to tempt you in: user and policy management, no speed or file size limits, automatic deduplication, support for external and NAS drives, server backups, 256-AES server-side encryption, round-the-clock technical assistance... it's difficult to come up with a feature that Zoolz Cloud Backup doesn't offer.",
    "Then there's that cold storage option: it's half the price of the instant storage, and you can combine both instant and cold storage as you like in your account. The downside is that it takes longer for data in cold storage to be restored – typically between 3 and 12 hours for a restore to start – but that'll be just fine for a lot of users.",
    "Actually, there are options and choices throughout Zoolz – you can, for example, have backups run at maximum speed and take up all your bandwidth, or throttle them so you can get on with other internet business while they run in the background. It's the sort of flexibility that a lot of IT managers and small businesses will be looking for.",
    "You can get Zoolz to back up the key folders on a computer or choose them specifically yourself, and the software is able to copy data to local storage and the cloud simultaneously, so you always have plenty of redundancy built in. Backups aren't instantaneous though – they run on a schedule (from every 12 hours to every 7 days), so it's not so suitable for a quickly changing environment.",
    "The Zoolz interface isn't bad, exactly, but it's a long way from the sort of modern and intuitive look you'll get in applications such as Google Drive and Dropbox. The menus and screens come across as a little bit dated and awkward – but that said, is the software interface really all that important in a backup tool? It does the job, and that's what counts.",
    "Backing up was relatively slow too, though we were using the standard (throttled) rather than the turbo mode. However, that's not really what Zoolz is about – remember that the most regular backup schedule you can set up is every 12 hours. This is a suite of tools to have running in the background while you work.",
    "The web interface is the same as the desktop clients: clean and functional but not much more than that. You get a nice overview of your computers, your registered users, the servers you've set up, your computers and recent activity on your account. What's more, changing your account settings or upgrading your package is simple too.",
    "You can also move and restore files from the web interface, as well as set up user policies and file access privileges. While most personal users will consider this overkill, IT professionals will be delighted by the granularity that Zoolz offers, and that extends to reports on client activity, bandwidth usage, and many other aspects of Zoolz activity.",
    "Zoolz certainly ticks a lot of boxes when it comes to security, though there's no two-factor authentication option here. That means you're left with the standard username and password approach, so you'll need to make sure that access to your login credentials is well guarded in whatever way you see fit.",
    "All files dispatched to Zoolz end up on an Amazon Web Services system, and by default are encrypted using the industry standard AES 256-bit algorithm. Transport layers protect them on their journey to and from there, while storage encryption can be applied either with a password that Zoolz also holds or a completely private key that only you have (the latter is safer, but your data will be gone forever if you forget the password).",
    "As you would expect, you've got plenty of pricing options to pick from when it comes to Zoolz Cloud Backup. Pricing starts at $15/£12 a month for 1TB of storage, $30/£24 a month for 2TB of storage, and $75/£60 a month for 5TB of storage – and you can go all the way up to 50TB of storage for $750/£600 a month, should you need to.",
    "You can get discounts for paying yearly instead of monthly: 1TB of space is $150/£120 a year, for example, which works out as $15/£10 per month. It's competitively priced when you look at the competition, especially when you consider you can back up as many files and computers as you like, with no file size or user limits. Cold storage add-ons are typically around half those prices.",
    "Take a look at the Zoolz client list – which includes the likes of Dell, Duracell and the Harvard Library – and you can see that this is a heavyweight cloud backup storage solution. It gives you a ton of flexibility in terms of managing drives, servers, storage types and users, and it's all simple to manage and operate. That flexibility means it can easily slot into a whole host of small business scenarios.",
    "Okay, you don't get instant backups, and the interface is a bit clunky, but really these are minor annoyances. From the data compliance measures to the hybrid (cloud and local) backup options, we've been impressed with Zoolz Cloud Backup in the time that we've spent with it – and we think you will be too."
  ],
  "headers": {
    "3": "Zoolz features",
    "7": "Zoolz interface",
    "11": "Zoolz security",
    "13": "Zoolz pricing",
    "15": "Zoolz verdict"
  },
  "links": {
    "Cloud Backup": "https://www.techradar.com/best/best-cloud-backup",
    "Amazon Glacier technology": "https://en.wikipedia.org/wiki/Amazon_Glacier"
  }
}