{
  "source": "https://www.techradar.com/reviews/macbook-air-review",
  "title": "Apple MacBook Air (2018) review",
  "category": "computing",
  "updated": "2020-12-11T02:27:38Z",
  "author": "matt-hanson",
  "summary": "Slimmer, lighter and better looking",
  "verdict": "Apple MacBook Air users won’t be disappointed that this update is thinner and lighter than ever before. However, it’s only slightly faster, and definitely more expensive. If you’ve not been convinced by the MacBook Air before, the cosmetic enhancements might not be enough to sway you now.",
  "pros": [
    "Small, lighter design",
    "Beautiful Retina display",
    "Good value for a MacBook"
  ],
  "cons": [
    "Sometimes feels underpowered",
    "Only two Thunderbolt 3 ports"
  ],
  "article": [
    "Did you know the 2018 MacBook Air isn’t the newest Air on the block? Check out our review of the more recent MacBook Air (2019).",
    "The Apple MacBook Air (2018) might just be the perfect machine for you if you’re looking for a MacBook with a Retina display and a much-more affordable price of entry. There’s a reason why the MacBook Air line has kept a comfortable spot in both our best Macs and best laptops list, and this 2018 entry only reinforces that.",
    "Bringing in some refinements such a Retina display, over 10 hours of battery life, Touch ID, and an updated keyboard, the Apple MacBook Air (2018) not only lives up to that ‘Air’ brand, it actually improves on it. It raises the bar in a number of key areas – that new screen is more stunning than ever, the battery is longer lasting, and the whole thing is lighter and smaller than ever before.",
    "While the laptop’s specs aren’t going to be top-of-the-line and some of its rivals are equipped with faster processors, it still comes at a price more affordable than the Pro line. Just expect to spend for upgrading the storage or to invest in an external hard drive, especially since you won’t be able to use a microSD for extra storage – the 2018 comes sans microSD slot.",
    "If you’re looking for a significantly more powerful device compared to previous models or a Windows user looking to switch to the macOS environment for cheaper, then this refresh might feel like a disappointment. However, you’re a fan of Apple’s lightweight laptop or if you have a much older MacBook Air, the Apple MacBook Air (2018) is a worthy contender.",
    "The MacBook Air 2018 is pricier than any previous model. However, while this 2018 follow up doesn’t match the $999 price of its predecessor, it’s still the cheapest laptop in Apple’s 2019 lineup.",
    "For anyone dismayed by Apple’s high (and rising) prices for its devices, that might not be much comfort. At the time of this review, the MacBook Air (2018) started at $1,199 (£1,199, AU$1,849).",
    "Note that the 2017 MacBook Air is still available at a lower price on third-party. If you are on a limited budget, third-party sellers are still hawking the 2017 MacBook Air at the same $999 (£949, AU$1,499) price. You’ll have to give up new features like the fingerprint sensor and the higher resolution display, but it’s $200 off, so decide for yourself if it’s a worthy trade-off.",
    "However, if you want the latest rendition, you’ll be happy to know that it’s now $100 cheaper at $1,099 (£1,099, AU$1,699). Currently, at that price, you get an 8th-generation Intel Core i5, Intel UHD Graphics 617, 8GB of memory and a 128GB SSD. You can configure it with more memory and storage, but the MacBook Air will obviously get pricier from there. You can get up to 16GB of RAM and a 1TB SSD.",
    "Additionally, the highest pre-configured MacBook Air goes for $1,299 (£1,299, AU$1,999), which comes with 256GB SSD storage, but otherwise is mostly the same. That’s a price increase of $200 (£200, AU$300) for a bigger SSD. To up the storage to 512GB SSD from the base model will cost you an extra $400 (£400, AU$600), while upgrading to 1TB is a whopping extra $1,200 (£1,200, AU$1,800).",
    "Even by Apple’s standards that’s a rather absurd price increase – considering that at that price, you can get a 1TB to 2TB external SSD. You’re better off sticking with the 128GB SSD and purchasing an external storage drive separately. If you want to configure your MacBook Air, it’s best to double the RAM to 16GB at 2,133MHz for an extra $200 (£180, AU$320).",
    "No other components are configurable on 2018's Apple MacBook Air, which means you’re stuck with the same processor and integrated graphics. The above costs also highlight Apple’s crazy-expensive prices for storage. We haven't tried to dismantle the MacBook Air apart, but we’d wager it’s extremely difficult to open it up and install a larger – and cheaper – SSD yourself.",
    "If you don’t need that much storage space, and rely on cloud services for storage, this won’t be too much of an issue. However, for people who need their disk space, it means the MacBook Air can quickly become quite an expensive proposition – unless, as we suggested earlier, you get an external hard drive. You just have to decide whether it’s worth carrying around an extra moving part just to save a couple of hundred dollars, or if it’s better to pay that for convenience.",
    "Still, the market for premium $1,000/£1,000 laptops is more packed than ever before, with some incredible machines dominating the price point, mainly spurred by the success of the original MacBook Air. With a price of $1,099 (£1,099, AU$1,699), the MacBook Air 2018 is going toe to toe with impressive Windows alternatives, like the Huawei MateBook X Pro and Dell XPS 13. Both offer more powerful internals and beautiful displays for comparable prices.",
    "Where the MacBook Air used to be the undisputed best laptop at this price point, it’s now facing an uphill battle to reclaim that title.",
    "Of course, the XPS 13 and MateBook X Pro are only viable alternatives if you’re not married to the macOS. If you’re wedded to macOS and Apple’s ecosystem, then the Apple MacBook Air (2018) offers the most affordable way to get a new MacBook – and its latest refresh, as well as drop in price, definitely gives it better value.",
    "One could realistically argue that the MacBook Air spurred Intel and rival laptop makers to create the Ultrabook category of laptops, which were premium devices that put power, style and a thin, lightweight form factor above all else.",
    "The original MacBook Air changed the laptop scene back when it was originally unveiled – there’s no getting around that – so, you’d be forgiven for expecting Apple to revolutionize their design just as they did before. If that were the case, prepare to be disappointed.",
    "Apple played it safe with the MacBook Air 2018. This laptop is definitely not the market-defining laptop that its predecessor was. However, it does inherit that iconic thin and light design, while still benefiting from some important improvements where it counts.",
    "In fact, the new MacBook Air is smaller than the original with dimensions of 11.97 x 8.36 x 0.61 inches, making an already portable laptop even lighter and thinner. And, the MacBook Air case retains the same wedge-shaped design, so it tapers off to 0.16 inches at its thinnest point.",
    "As we noted in our initial hands-on review of the new MacBook Air, the new laptop has the same width and depth as the 13-inch MacBook Pro, while being a bit thinner and lighter.",
    "Thankfully, the reduced size and weight of the MacBook Air doesn’t mean there’s a deficit in features. You still get a 13.3-inch display (more on that in a sec), and we’ve already mentioned that it’s equipped with faster hardware, including an 8th-generation fanless dual-core processor as well as 8GB of RAM, which can be upped to 16GB.",
    "Port-wise, you get two USB-C (Thunderbolt 3) ports along the left-hand side of the MacBook Air. You can use either one for charging, and we’re glad that Apple continues to use the USB-C format as a charging port, rather than its proprietary MagSafe port, which makes the Air a far more user-friendly and flexible device.",
    "One drawback we were initially concerned with was the fact that both USB-C ports are all located on one side, and quite close together too, since this means that, when the MacBook Air is charging, the second USB-C port might be a bit too close to plug things in unless you have an adapter or dongle.",
    "Having a USB-C port on either side, like the Dell XPS 13, would have avoided this situation, while giving you a bit more charging flexibility.",
    "The good news is, for most people this won’t be too much of an issue, and we’re glad to see Apple moving over to USB-C for the latest MacBook Air. It helps keep the body of the MacBook Air slim, while also future-proof by making it compatible with new and upcoming USB-C peripherals.",
    "Although, if you rely on legacy USB peripherals, then you’re going to need a dongle or dock for them to function with the Apple MacBook Air 2018. Admittedly, that’s a pain. However, you’ll likely find that this trend extends to most modern laptops, especially premium thin-and-light Ultrabooks. So investing in a hub or dock now might be wise.",
    "One thing’s for sure: the two USB-C ports are certainly a step up from the single USB-A port of previous MacBook Airs. The only other port is a 3.5mm headphone jack – an increasingly rare sight on Apple products – on the right-hand side.",
    "The Apple MacBook Air now utilizes the improved keyboard that the MacBook Pro 2019 has, and Apple claims that this iteration has four times more key stability than standard laptop keyboards, while offering greater comfort and responsiveness.",
    "During our tests, we realized that the keyboard does take a little adjusting, especially if you’re coming from an older MacBook Air. The keys are very shallow, travel-wise, so you don’t quite get the responsive feedback you get from other laptop keyboards, but that’s the price you pay for such a slimline design. There’s also a satisfying ‘click’ to the keys when pressed, although this does make it a bit noisier to type on than previous versions. However, once your fingers adjust, it ends up being quite a pleasant typing experience.",
    "The MacBook Air (2018) also has Touch ID built in, letting you to log into the laptop securely with your fingerprint. It’s a nifty, time-saving feature, and genuinely makes logging into the MacBook Air quick and effortless. As with other Mac devices that have Touch ID, the feature works beautifully, detecting fingerprints and logging us in without any issues.",
    "While Touch ID is here, the Touch Bar – the MacBook Pro’s slim additional display that replaced the function keys’ locations, offering contextual shortcuts for the apps you’re currently using – isn’t. This feature likely won’t be sorely missed, however, as the function keys along the top are more than enough for offering quick access to different tools.",
    "The chassis surrounding it has shrunk, but the Force Touch trackpad is actually bigger, now 20% larger than the standard trackpad on previous MacBook Airs. It gives users more room for gestures and to move the cursor around – you won't want to go back to a smaller trackpad once you try this one out. Also, unlike on older MacBook Airs, the trackpad is now flush with the body, and requires only gentle presses to register as clicks. It’s a much more comfortable – not to mention, quieter – experience.",
    "The use of recycled aluminum makes this the greenest MacBook ever, according to Apple, and while its unibody design has been made from the metal shavings from previously machined devices (which means Apple doesn't need to mine and smelt further materials), there are no blemishes or marks.",
    "This is the same premium-looking – and feeling – MacBook Air we’re used to, only friendlier to the environment. Apple told us that it has achieved this design feat by employing full-time, in-house metallurgists in order to ensure that the recycled aluminum body is up to Apple’s rigorous standards.",
    "The MacBook Air (2018) unibody shell is cut from a solid block of aluminum, which gives it a sturdy feel despite its thin and light design. It’s an impressive machine to hold – light enough to easily carry around yet robust enough that you can toss it in a backpack and take it with you when you’re on the move without worry.",
    "The speakers have also improved. Despite their small size, they have twice the bass of its predecessors, and are capable of 25% louder volume. The T2 security chip, which is built into the MacBook Air and offers a number of security features, also helps with stereo spacing of the speakers. The idea is that this gives the impression of the two speakers being further apart than they actually are. We tried it out by watching some films, and there is a clear distinction when sounds pan from left to right, even if it doesn’t rival a proper stereo setup with speakers placed at either side of the room.",
    "The speakers however are clear, have a good range, and still sound really good at high volumes. This sort of sound quality is rare on slim and light laptops, and the improved audio, combined with the updated and improved high-resolution screen, makes the MacBook Air a terrific laptop for watching films and listening to music on.",
    "A 720p FaceTime HD camera and three-microphone array help to make video conferencing and voice calls look, and sound good as well, although the resolution is increasingly looking outdated compared to rival laptops that have 1080p webcams.",
    "Apple is offering a range of colors for the MacBook Air: Space Gray, Gold and traditional Silver. However, the illuminated Apple logo has been dropped for a chrome one, as the thinner lid design cannot accommodate that classic piece of design flair.",
    "Overall, while the design isn’t as game-changing as that of the original MacBook Air, Apple has gone to impressive lengths to improve on the look and feel of the new model.",
    "The display on the Apple MacBook Air (2018) is where Apple has arguably made the biggest, and most welcome, updates. Despite the shrinking overall size of the Air – in comparison to previous models, the screen size remains the same at 13.3 inches.",
    "This was made possible by trimming the bezels around the screen. So, the new MacBook Air not only is smaller and more portable than its predecessors, but also boasts a screen that’s more prominent when in use.",
    "The screen keeps the 16:10 aspect ratio, but that’s where the similarity to previous MacBook Air screens ends. The MacBook Air (2018) is the first Air with Retina display, with a resolution of 2560 x 1600 pixels, resulting in a pixel density of 227 pixels per inch (ppi). It’s a little sharper than the MateBook X Pro, and easily outshines the entry-level XPS 13.",
    "The Retina screen gives this MacBook Air four times the resolution of the previous models. The leap from the 900p resolution of older MacBook Airs to the Retina resolution really is stunning, and it’s likely the first thing you’ll notice when you power on the new Air. Anyone who felt the lower resolution of previous MacBook Air models were a bit cramped when working will no doubt enjoy the improvement.",
    "In addition, Apple has also given this Retina display True Tone technology when it refreshed it in July 2019. This means that the MacBook Air screen will now automatically adjust the color temperature for a more natural and comfortable viewing experience. With it, the new MacBook Air display is now actually on a par with the more expensive MacBook Pro, the 13-inch model of which boasts the same screen size and resolution.",
    "Apple has also dramatically improved the viewing angles of the screen on this year’s MacBook Air. That was one of the biggest drawbacks with the old MacBook Airs, to the point where tilting the screen just a little bit away from our faces made it impossible for us to see anything on the screen. The 2018 MacBook Air fixes that. It was only at the most extreme angles that we saw a lot of reflection from the anti-glare glass protecting the LCD screen.",
    "There’s also been a boost to color accuracy for the MacBook Air 2018, with a wider color gamut capable of displaying 48% more colors than the previous Air – it means that photos in particular look brighter and more vibrant on the new MacBook Air’s screen.",
    "The new MacBook Air display is arguably the most impressive update, and the higher resolution gives this entry-level MacBook a premium feel, while also making media and photos look better than ever.",
    "When the original MacBook Air was released back in 2008, it got plenty of praise for its slim and light design. However, many reviewers voiced their reservations over the lackluster performance of the device compared to other (larger, if pricier) laptops. Many suggested that the slim design of the MacBook Air forced less powerful components, which Apple did address in later revisions.",
    "We would love to say that, 10 years later, things have changed, but alas. While the MacBook Air comes with 8GB of two 2,133MHz LPDDR3 RAM, which can be configured to 16GB, and a speedy SSD, processing power still feels slightly restrained by its dual-core Intel Core i5-8210Y processor.",
    "This 1.6GHz, dual-core Intel Core i5 can Turbo Boost up to 3.6GHz, with 4MB L3 cache, which is fine for most day-to-day tasks, but is not as speedy as some quad-core processors you see in rival laptops around this price point, like the Dell XPS 13. For strenuous tasks, or for multi-tasking, the Apple MacBook Air 2018 isn’t as strong a contender as other laptops at this price range.",
    "The new MacBook Air just isn’t as snappy as we’re used to on more powerful Macs. The MacBook Air occasionally felt like it was lagging, taking a few more seconds to load apps and respond to instructions while we were using it, especially when we opened multiple apps.",
    "So, it’s worth repeating that the 13-inch MacBook Pro really doesn’t cost that much more than the MacBook Air, and it’s much more powerful. If you want a MacBook that has some power, we’d have to recommend going for the 13-inch MacBook Pro.",
    "While the move to use a low-powered dual core Intel Core i5 processor is a bit disappointing, the MacBook Air does have an ace up its sleeve to help mitigate this – by including the Apple T2 security chip, which works alongside the main processor to offload certain tasks.",
    "This is mainly to do (as the name suggests) with security features, so it manages your fingerprints when using Touch ID, as well as an SSD controller with on-the-fly data encryption for \"industry-leading security.\" It also helps with the stereo spacing effects of the speakers, which we mentioned earlier, as well as having an omnipresent ‘Hey Siri’ feature – a first for a MacBook Air that allows you to use your voice to control the laptop.",
    "The new MacBook Air comes with macOS Mojave pre-installed though, so the lower spec of the Air is handled pretty well (thanks to Apple’s operating system being tailor made for the hardware – as opposed to Windows 10’s ‘one size fits all’ approach, which makes it more demanding).",
    "The T2 chip does specialize in HEVC video transcoding, which offers transcoding times up to 30 times faster than devices without it. While the MacBook Air isn’t a laptop we (or Apple) would recommend for professional heavy-duty video editing software and transcoding, it’s a nice feature to have for hobbyists who may want to dabble in editing home videos or do some light video editing while on the go. By taking some of these tasks from the Intel processor, it gives that CPU more breathing room to keep other tasks running as smoothly as possible.",
    "In our day-to-day tests, we found the MacBook Air (2018)’s performance to be a bit of a mixed bag, with the device doing a fine – if not seriously impressive – job of handling most tasks we asked of it, but struggling a bit when asked to do lots of tasks at once.",
    "Our benchmark results also show that the hardware of the MacBook Air offers less power than the competition. When this MacBook Air was set against the older 12-inch MacBook, the Cinebench benchmarks show roughly the same results, at 264 points compared to the MacBook Air’s 279. The Geekbench 4 scores show a similar result, with the 12-inch MacBook scoring 3,879 in single-core and 7,072 for multi-core, compared to the new MacBook Air’s scores of 4,247 and 7,832 respectively. Again, these aren’t huge leaps for the newer MacBook Air.",
    "Comparing these to the MacBook Pro (2018) 13-inch with Touch Bar, with a 2.7GHz Intel Core i7-8559U quad-core processor and 16GB of RAM, the results are starker, with 669 points for Cinebench, and Geekbench 4 scores of 5,320 for single-core and 18,135 for multi-core.",
    "This is a clear advantage to the MacBook Pro, though it’s worth mentioning that these results are for a model that costs $1,799 (£1,749, AU$2,699), far pricier than the MacBook Air (2018).",
    "The benchmark results only tell part of the story, but at least they give us an idea of where the MacBook Air (2018) sits in the MacBook hierarchy: more powerful than the 2017 12-inch MacBook by a hair, but a bit less powerful than the MacBook Pro (2018).",
    "When we initially set up the MacBook Air, it did become unresponsive whilst connecting to a Wi-Fi network, though once we rebooted the device it didn’t crash again. We’ve installed the update, and so far we haven’t had any further issues.",
    "Also worth mentioning is that during our review, Apple released a supplemental update for its macOS 10.14.1 operating system specifically for the MacBook Air (2018), designed to improve the stability and reliability of the new laptop. We re-ran our benchmarks with the update installed and saw small improvements for every score. The new scores with the update installed are the ones you see in this review.",
    "Apple reports that the Apple MacBook Air (2018) as capable of 12 hours’ worth of local video playback or 12 hours of wireless web use, which is a more than decent amount that should get you through a whole work day without requiring a charge.",
    "The high-resolution Retina display does cause the battery life to drain slightly faster than its predecessors. However, Apple’s decision to go with a lower-power, dual-core processor means the Apple MacBook Air (2018) has one of the longest lasting batteries found in a MacBook.",
    "Every other Retina MacBook is rated for 10 hours of battery life, based on Apple's own estimates, so if you’re an Apple fan that places long lasting battery above all else, then the Apple MacBook Air (2018) might just be the ideal laptop for you.",
    "In our own battery life tests, where we ran a looped 1080p video with the screen set to 50% brightness, the MacBook Air lasted 10 hours and 30 minutes. It’s 1.5 hours short of the 12-hour battery life that Apple promised, but it’s still a respectable amount, and much longer than the 12-inch MacBook’s 8 hours and 4 minutes.",
    "During our tests, we found that the MacBook Air did a good job of holding its charge while we browsed the web, watched movies and used various apps. The only downside is that, it does seem to charge quite slowly, taking a few hours to fully charge from completely empty.",
    "Images Credit: TechRadar",
    "First reviewed November 2018"
  ],
  "headers": {},
  "links": {
    "MacBook Air (2019)": "https://www.techradar.com/reviews/apple-macbook-air-2019",
    "MacBook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-1287806/review",
    "best Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "external storage drive": "https://www.techradar.com/news/best-portable-ssd",
    "external hard drive": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Huawei MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro-2019",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "13-inch MacBook Pro": "https://www.techradar.com/reviews/macbook-pro-2018-with-touch-bar-13-inch",
    "video editing software": "https://www.techradar.com/best/free-video-editing-software",
    "Apple released a supplemental update for its macOS 10.14.1 operating system": "https://www.techradar.com/news/apple-releases-macos-mojave-update-to-improve-macbook-air-2018-reliability"
  }
}