{
  "source": "https://www.techradar.com/reviews/solarwinds-service-desk",
  "title": "Solarwinds Service Desk review",
  "category": "computing",
  "updated": "2020-10-19T15:30:04Z",
  "author": "john-faulds",
  "summary": "Easy-to-use ITSM solution for businesses to support their employees",
  "verdict": "Solarwinds Service Desk is reasonably priced, highly customizable, but most importantly, easy to use.",
  "pros": [
    "Easy to use",
    "Lots of customization options"
  ],
  "cons": [
    "Reports slow to load",
    "Limited data export options"
  ],
  "article": [
    "Solarwinds Service Desk is a software solution for IT service management (ITSM) aimed at supporting a company’s own employees. It can be used for incident and asset management, cataloging and fulfillment, and as a single portal for the submission of tickets and requests.",
    "Even though the focus of a service desk is more internal, it still has the same end-user focus as all the best helpdesk software solutions. In this Solarwinds Service Desk review we help you decide whether it could be useful for your business as we take a look at its pricing, features, support, and ease of use.",
    "Solarwinds Service Desk has a very simple pricing structure, offering a choice of four plans. The Team plan is the entry-level one at $19/month/agent. At the other end of the scale is the Enterprise plan at $89/month/agent (subscriptions are billed annually). All plans are available fully functional for a 30-day trial.",
    "Each step up in plan adds to the features available from the previous one, and the level of support changes too. The Team plan includes incident management, a service portal, and a knowledge base, while the Enterprise plan adds multi-factor authentication (MFA), custom dashboards, and onboarding services.",
    "Solarwinds Service Desk has a large selection of features including tools for incident, IT asset and problem management, an employee service portal, and a knowledge base.",
    "Incident management software is used for streamlining ticket submissions, with tickets able to be submitted by email, phone, the service portal, live chat, or in person. The software also includes the ability to automate simple tasks and route tickets to the right people so that incidents are resolved more quickly. Built-in artificial intelligence can also speed up ticket resolution by recommending solutions.",
    "Problem management functionality allows your agents to easily group similar incidents together to avoid multiple agents working on the same issues and prevent redundancy. Automation features mean that tickets can be categorized and routed to the correct technician without manual involvement.",
    "The employee service portal is a web app that employees can use to submit and track service requests or find answers to questions that may have been asked before via the integrated knowledge base and other resources. Not only is the service portal helpful for employees, but it gives technicians all the data they might need to resolve incidents quickly in one place.",
    "Solarwinds Service Desk has a very clean interface that we found easy to navigate. Access to all of the main sections of the dashboard is hidden behind a hamburger menu icon in the top left corner of the window, but the menu itself is very responsive, and it’s easy to find what you’re looking for.",
    "The dashboard comes with a pre-selected group of widgets displaying your organization’s data, but you can add new ones or edit or remove the existing ones. You can also create completely new dashboards if you don’t want to add too many widgets to a single page.",
    "When viewing a list of incidents, you have a lot of control over how the data is filtered and sorted, and you can customize the columns that are displayed. Once you’ve selected an individual incident to view, you again have a lot of control over its settings, and the user interface makes it easy for even novice users to figure out how to update and add to an incident.",
    "For those that do need a little extra help, every page you visit has a text and video tutorial that can be accessed by clicking on the ‘?’ button near the top right of the window.",
    "We were impressed at how easy Solarwinds Service Desk was to use but did find that sometimes pages, or parts of pages that displayed data, were a bit slow to load. In particular, we found building reports to be very slow, even at the very beginning of our testing, when we only had a handful of sample issues.",
    "There are phone numbers in different regions, email addresses, and a live chat widget available if you need support for Solarwinds Service Desk. However, the pricing information for the product seems to indicate that the level of support varies depending on the plan to which you’re subscribed.",
    "The Team plan has access to email support, the Business plan has real-time, 24/7 live chat as well as email support, and the Professional and Enterprise plans both have access to chat, email, and phone support.",
    "There are also self-help resources like the quick start guide, FAQs, and knowledge base.",
    "As with most providers of helpdesk software, Solarwinds takes a rigorous approach to security, which applies to the various layers that go into developing web apps.",
    "Employees sign confidentiality agreements and undergo specific security training. World-class data centers are used, protected by fire suppression systems and security guards. All changes are logged and regular audits are carried out. Networks are protected by firewalls and malicious code protection, and disaster recovery systems are in place.",
    "The ITSM market is smaller than the overall helpdesk software market, but there are still some competitors worth considering, like Freshservice by Freshworks and Jira Service Desk by Atlassian.",
    "Freshservice has a very similar feature list to Solarwinds Service Desk and also has a choice of four plans that go from $19/month/agent up to $99/month/agent and a 21-day free trial period. There’s very little to separate the two, but some have found Freshservice to be more usable.",
    "Jira Service Desk has a different pricing structure, including a free plan, and offers both cloud and self-managed versions of its software. The free plan is for up to three agents. The Standard plan is $10/month (or $100/year) for three agents but then increases to $20/agent/month for between 4 and 15 agents. After 15 agents, the price starts to come down slightly. For example, it’s $19.69/agent/month for 16 agents but $18.75/agent/month for 20 agents, and so on. The Premium plan starts at $40/agent/month, and then reduces like the Standard plan from 16 agents onwards.",
    "Solarwinds Service Desk is ideally suited to companies with large IT departments that are looking to provide high levels of service for their own employees and internal customers. It is reasonably priced and comes with a generous free trial so you have enough time to evaluate its capabilities.",
    "While we did find the web app to be a bit slow sometimes, in general, we were impressed by how easy Solarwinds Service Desk is to use and the level of control offered over how data was presented and updated."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "8": "Interface and in use",
    "13": "Support",
    "16": "Security",
    "18": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "Solarwinds Service Desk": "https://www.solarwinds.com/service-desk",
    "ITSM": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "best helpdesk software": "https://www.techradar.com/best/best-helpdesk-software",
    "four plans": "https://www.solarwinds.com/service-desk/pricing",
    "Team plan": "https://www.solarwinds.com/service-desk/pricing",
    "Enterprise plan": "https://www.solarwinds.com/service-desk/pricing",
    "Freshservice": "https://www.techradar.com/reviews/freshservice",
    "Jira Service Desk": "https://www.techradar.com/reviews/jira-service-desk"
  }
}