{
  "source": "https://www.techradar.com/reviews/motorola-edge-review",
  "title": "Motorola Edge review",
  "category": "phones",
  "updated": "2020-07-23T00:22:08Z",
  "author": "tom-bedford",
  "summary": "On the Edge of success",
  "verdict": "The Motorola Edge feels like a mid-range phone imitating a premium one, and it shows, with a few rough edges like a fingerprint sensor which isn’t the easiest to use, and cameras that take pictures which aren’t the best we’ve seen. However this is still far from your average mid-range phone, and it feels good in the hand and looks great.",
  "pros": [
    "Feels great in the hand",
    "Impressive battery life",
    "Handles almost all games well"
  ],
  "cons": [
    "Cameras not the greatest",
    "Fingerprint sensor is temperamental",
    "Curved screen functionality is limited"
  ],
  "article": [
    "The Motorola Edge isn’t best compared to its premium Motorola Edge Plus sibling – that phone is a fully-fledged flagship, and occupies a whole different segment of the market to the Edge – but nor is it appropriate to judge it against other Motorola phones, which are nearly all budget devices, or the top-end handsets from Nokia, Motorola’s close rival, or most other mid-range phones for that matter.",
    "No, we’d most closely liken the Motorola Edge to the Xiaomi Mi Note 10: both are accomplished mid-range phones masquerading as premium phones in many ways, with features and specs you’d normally find exclusively on top-end phones. Both are also overshadowed by pricier and more premium siblings, in the form of the aforementioned Motorola Edge Plus and the Xiaomi Mi 10.",
    "In fact, if it wasn’t for the mid-range price, the Motorola Edge could easily be confused for a premium phone. It has a sleek curved display, a ‘punch-hole’ front-facing camera, a 64MP main camera and plenty more features that, at first glance, make you think you’re handling a phone that costs more than it actually does.",
    "During our time with the phone we’ve been impressed by these features – the Endless Edge screen, as Motorola calls it, really does make the phone feel great to hold – and also by the fact that it lasts longer than some flagships we’ve tested thanks to its large battery, and can handle games better than its mid-range chipset would lead you to expect.",
    "There are issues too, though, and it’s clear where Motorola has cut corners to keep the Edge much more affordable than the Edge Plus. Its chipset certainly isn’t a top-end one – although you won’t always notice, depending on what you’re using your phone for, and some of Motorola’s bespoke curved-screen functions feel a little superfluous.",
    "Arguably the biggest issue is that the Motorola Edge’s cameras aren’t the greatest performers. That’s not to say they’re bad, but you can find phones at around the same price that take fantastic-looking pictures – including the aforementioned Xiaomi phone – and the Edge’s photographs are a little lacking in comparison.",
    "Some of these negative points are simply the result of Motorola cutting corners in order to keep the price down, but others may be indicative of the fact that this is Moto’s first new flagship line in a few years, after the Motorola One line range which began in 2018. It’s hard to create great camera software, after all, and Motorola hasn’t needed to do so for some time.",
    "The Edge was a chance for a company typically associated with budget phones to prove it can make a device that’s more than that,While the Motorola Edge Plus is a fully-fledged flagship phone, Motorola is pitching the Edge more as a ‘flagship-killer’ - but it doesn’t quite earn that medal, thanks to its rough edges. That said, it’s got some strong points, and we found the phone endearing itself to us the more we used it.",
    "The Motorola Edge price is £549 / $699 (about AU$1,015), which gets you 6GB RAM and 128GB storage – there are no alternative configuration options. You can buy the phone in the UK now, and Motorola has confirmed it's coming to the US starting July 31; it’s likely the phone will also be available in Australia, although we don’t know when.",
    "That price tag means the Edge costs roughly twice as much as handsets in the firm’s affordable Moto G series in the UK (and presumably more regions if it rolls out worldwide), but is roughly half the price of its big sibling, the Motorola Edge Plus, which goes for $999 (around £800 / AU$1,550). In other words, it slots neatly into Motorola’s lineup.",
    "For context, the Edge’s closest competitors in terms of specs are the Xiaomi Mi Note 10 (£459, roughly $565, AU$850) and OnePlus 8 ($699 / £599, about AU$1,100) so it sits at around the same price point as some pretty impressive rivals.",
    "The phone will start being sold in the US on July 31 and will be sold online on websites for Best Buy, B&H, Amazon, and Motorola.com. No, it won't be sold by carriers, but for a limited time, it will get a $200 discount.",
    "The Motorola Edge is sleek, both to look at and to hold, and this is mainly thanks to its Endless Edge screen which curves at the edges. This isn’t the slight taper of the Samsung Galaxy S20 either - instead the display wraps around the sides at a 90-degree angle to the sides that really justifies the phone’s name. Because of this curved display, the phone’s volume rocker and power button are set quite far back on the right edge.",
    "Mainly as a result of the screen, we found the Motorola Edge felt great in the hand, and since it’s quite a long, thin device, it wasn’t too hard to reach the side buttons, although those with smaller hands might have trouble accessing the higher-up volume rocker.",
    "One thing to note here is that the divides between the front, back and central frame of the phone are more distinct than on other devices, so much so that you can clearly make out the different parts. On a few occasions fluff and dust got caught in the gaps between these sections, so if you get yourself a Motorola Edge you may have to get used to cleaning it now and then.",
    "The streamlined design continues to the back of the handset, as the camera array barely pokes out from the rear of the device at all. The ‘block’ the cameras are housed in is actually recessed into the phone’s body very slightly, although the lenses protrude from the dip, so they’re almost flush with the back of the device.",
    "The rear of the Motorola Edge is made of plastic, unlike most other mid-range and premium handsets which are cased in glass, and it’s a design decision which feels like an anomaly at this price point. This is presumably to keep the price down, and many users likely won’t mind, but those who are used to glass-backed handsets might see it as a downgrade.",
    "Another design element to note is that, along with the USB-C port, there’s a 3.5mm headphone jack here, which not all mid-range phones have these days. This will be welcomed by those who are fans of wired audio (there’s a jack on the Edge Plus too).",
    "The phone’s dimensions are 161.6 x 71.1 x 9.3mm, which is about average for a phone with a screen this size, although at 188g its weight is a little less than similar handsets, and it feels noticeably lighter in the hand.",
    "We tested the black version of the Motorola Edge, which is the only color that’s available in the UK – some regions will also get a magenta version. This black finish is as reflective as the screen, and looks very similar to the display when the device is switched off – we often confused the phone’s rear with the front when reaching for the in-screen fingerprint sensor, especially since the camera array is so dark you barely notice it.",
    "The Motorola Edge screen is a 6.7-inch OLED panel with a 1080 x 2340 resolution. That’s not as high-res a display as you’ll get on flagship devices like the Samsung Galaxy S20, but it matches most of the phones the Edge is competing with, although those rivals generally have AMOLED panels, which show punchier colors. The Edge’s OLED screen is HDR10, one of the main differences between it and the HDR10+ Edge Plus.",
    "The Edge’s display has a 90Hz maximum refresh rate, and while we did find ourselves missing the smoother 120Hz of many 2020 flagships, the experience of using the phone is still smoother than you’ll find with cheaper devices that have the ‘standard’ 60Hz refresh rate (you can drop down to 60Hz if you need to save battery).",
    "The screen is broken up by a ‘punch-hole’ cutout at the top-right of the display, which houses the front-facing camera lens. While it isn’t as small as some cutouts we’ve seen, it isn’t huge and didn’t hamper our experience with the phone too much.",
    "In general, the screen felt pretty bright on the default auto setting, and while the phone is a little lacking in screen specs compared to other devices, we didn’t mind too much. The fairly high resolution is matched by a good contrast ratio and vibrant colors.",
    "One intriguing feature of the Motorola Edge is that the edges of the screen can be used to access certain functions. The Huawei Mate 30 Pro offered this to a certain extent, as it let you swipe the sides of the display in lieu of a volume rocker among other things, but the Edge has a wide range of functions – for example you can swipe down to bring up your notifications, or press the sides when gaming as you would shoulder triggers on a game controller.",
    "This isn’t the first time we’ve seen this sort of functionality on a smartphone – Samsung introduced us to the edge screen concept back in 2014 with the Samsung Galaxy Note Edge – but Samsung phones now don’t have curved-edge functions any more.",
    "It’s interesting to see Motorola bring it back, but there’s only one function we actually appreciated, and that was the ability to use the edges as virtual shoulder buttons when playing games. Other functions, like swiping down on the edge to see your notifications, or up to see your recent apps, felt no easier or more natural than the standard ways to access these functions.",
    "In fact, we found it much easier to turn Edge Touch’, as Motorola calls it, off; when you do this an accidental touch prevention mode is engaged, which stops you accidentally selecting functions if you touch the edges of the phone with the palm of your hand.",
    "The Motorola Edge has three rear cameras: a 64MP f/1.8 main camera, plus 8MP f/2.4 telephoto (for 2x optical, 10x digital zoom) and 16MP f/2.2 ultra-wide snappers. There’s also a 3D time-of-flight (ToF) sensor for improved background blur.",
    "Pictures taken with the main camera show good levels of detail, but colors don’t really seem to ‘pop’, and snaps can look a little dim too. We’d guess this is more down to Motorola’s post-processing software than the hardware – phones from companies like Samsung and Apple take great snaps because the image optimization is good, and it seems that isn’t the case here.",
    "We did manage to take a few good-looking pictures though, especially on sunny days, so if you’re lucky with lighting you can get perfectly okay shots, and you can always give them a boost with a quick edit in a free app.",
    "It’s worth pointing out that, despite the main camera being 64MP, you can’t actually take 64MP snaps, as the phone only takes 16MP snaps via pixel binning (link here). Most phones with high-res sensors give you the option of utilizing the full resolution, or opting for pixel binning to get low-light shots that are lower in resolution, but which are brighter and contain less noise, and the lack of that option was missed here.",
    "Snaps taken with the ultra-wide camera actually looked a little more vibrant and bright than those shot with the main camera – they did look a touch distorted around the edges, although that’s to be expected from an ultra-wide lens, and it wasn’t bad enough to ruin the images.",
    "The telephoto snapper captured fairly good-looking pictures at 2x zoom, and while the aforementioned vibrancy problem was apparent, the pictures still looked as good as you can expect 8MP snaps to. At 10x zoom images were rather grainy, as you’d imagine, but details were still discernible.",
    "In terms of videography, the Motorola Edge can shoot 4K up to 30fps, like the flagships of 2019 but not quite as good as the 8K recording or 4K at 60fps that 2020’s top phones can reach. We noticed some pretty strong stabilization being applied when shooting video, useful for those with shaky hands.",
    "There’s a slow-mo mode, but unlike most of these, which shoot at 960fps, the Edge’s only manages 240fps, or 120fps if you want to shoot in FHD, so instead of giving you super-slow shots it merely makes your normal videos look a bit slower.",
    "Finally, let’s talk about the 25MP f/2.0 front-facing camera for selfies – this was perhaps our favorite snapper of the bunch. Pictures taken with it were fairly bright (at least by the Edge’s standards), with plenty of detail. Portrait mode was adept at blurring backgrounds while keeping subjects sharp, and at smoothing facial features without being overzealous – in fact this is one of the best selfie-camera portrait modes we’ve tested.",
    "Arguably the biggest difference between the Motorola Edge and Edge Plus, other than a different camera array, is the chipset. While the Plus has the top-end Snapdragon 865 processor, the Edge has a more mid-range Snapdragon 765G, which is paired with 6GB of RAM.",
    "Those might sound like middling specs on paper, but in practice we rarely felt the processing power was lacking. Sure, the Edge misses out on some of the perks made possible by the Snapdragon 865, like 4K 60fps video recording, but performance was generally impressive.",
    "Gaming felt fluid, with short load times, little lag and graphics often rendered to their max limit (in games with variable graphic settings). This is likely partly due to the processor being optimised for gaming, as denoted by the ‘G’ in its name , and in general we were pleasantly surprised with the phone’s gaming potential.",
    "Editing high-res pictures, navigating the phone and opening new apps all felt similarly snappy, and we often forgot that we weren’t using a phone with a top-end chipset. The only time we were reminded of the fact was when we put the phone through the Geekbench 5 benchmarking test: it returned a multi-core score of 1,732, which is much lower than the Motorola Edge Plus, which scored 3,344, about average for a top-end phone.",
    "The Motorola Edge score is almost identical to that of the 2019 Oppo Reno 2, which is a more affordable phone, and we weren’t blown away by that device’s processing power. Presumably there are some smart software optimizations under the Edge’s hood that compensate for the low processing power.",
    "The Motorola Edge runs ‘stock’ Android 10, just as you’ll find it on other Motorola phones, as well as Google Pixel and Nokia devices – this is the purest version of the operating system, free of the visual and navigational changes other brands make for their forks, and of the bloatware that’s often added.",
    "Motorola does, however, include a few additions to the formula on its phones, known as Moto Actions. These include ‘Quick capture’, which lets you open the camera app by quickly twisting your wrist twice, and ‘Fast torch’, which turns the torch on or off when you shake the phone in a karate-chop motion. These can take some getting used to, but once you do, some can be pretty useful.",
    "With the Motorola Edge series, the company has introduced a new mode, ‘My UX’, which lets you customize font, interface color, app icon shapes and a few other things. We tried this out, but failed to create anything that looked any better than the default settings, so we ended up sticking with those. If you’re artistically inclined, however, you might like using this function to make your phone feel more personal.",
    "Most previous Motorola phones have had physical fingerprint sensors, and the company doesn’t seem to have mastered the art of in-screen ones, as the Edge’s doesn’t always work perfectly.",
    "Most of the time when we put our thumb on the sensor, particularly when the phone’s screen wasn’t on or was showing the always-on display, nothing happened. Instead, we had to lift our thumb away and try again, which usually worked. Doing this only took a second, but it was still irritating to have to repeat the procedure, especially given that the fingerprint sensor isn’t the quickest anyway.",
    "The Motorola Edge battery capacity is 4,500mAh, which is fairly standard for a mid-range phone, and we were pleasantly surprised by how long the device lasted before needing to be recharged.",
    "Generally, the phone comfortably saw us through a day of average use, and even when we were playing lots of games, conducting video chats and streaming music, it was rare for the phone not to last until bedtime. We’d anticipate that with light use, especially if you dial the 90Hz refresh rate down to the ‘standard’ 60Hz and deactivate the always-on display, the phone’s battery life could stretch to two days.",
    "The good battery life isn’t matched with snappy charging speeds though, as with 18W charging the Edge is lagging behind competitors like the Xiaomi Mi 10 and OnePlus 8 which offer 30W, which is the typical charging speed of phones at this price point. There’s no wireless charging here, but that’s no surprise as few mid-ranged phones have the feature."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Motorola Edge price and availability",
    "12": "Design",
    "20": "Display",
    "28": "Cameras",
    "37": "Specs and performance",
    "42": "Software",
    "47": "Battery life",
    "50": "Don't buy it if"
  },
  "links": {
    "Motorola Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Xiaomi Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Motorola One": "https://www.techradar.com/reviews/motorola-one-review",
    "coming": "https://www.techradar.com/news/the-affordable-flagship-motorola-edge-launches-in-us-with-a-dollar200-discount",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "discount": "https://www.techradar.com/news/the-affordable-flagship-motorola-edge-launches-in-us-with-a-dollar200-discount",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Huawei Mate 30 Pro": "https://www.techradar.com/reviews/huawei-mate-30-pro-review",
    "Samsung Galaxy Note Edge": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-note-edge-1263718/review",
    "pixel binning": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "Oppo Reno 2": "https://www.techradar.com/reviews/oppo-reno-2",
    "Motorola phones": "https://www.techradar.com/news/best-moto-phones"
  }
}