{
  "source": "https://www.techradar.com/reviews/zipbooks",
  "title": "ZipBooks review",
  "category": "computing",
  "updated": "2020-09-23T10:34:57Z",
  "author": "rob-clymo",
  "summary": "ZipBooks is simple accounting software based in the cloud",
  "verdict": "ZipBooks has free and paid for options to choose from and whichever route you choose there are slick cloud-based page layouts with lots of functionality. Suitable for freelancers and mid or even large-sized businesses it gets better with age.",
  "pros": [
    "Simplicity itself",
    "Good package options",
    "Payment processing",
    "Lots of templates"
  ],
  "cons": [
    "Average support",
    "No Android app"
  ],
  "article": [
    "ZipBooks is a reasonably recent addition to the ranks of cloud-based accountancy, tax and finance software, having first appeared back in 2015. But, in a lot of ways that’s good news. ZipBooks isn't bogged down with lots of baggage accumulated from down the years and, as a result, it comes across as a sprightly cloud-based contender with lots to offer, especially during the coronavirus crisis.",
    "Its basic format revolves around four main areas; accounting, billing, expenses and intelligence. The secret to the latter feature is a powerful collection of reporting tools that deliver practical insights into your financial affairs. Variations on the competitor front include competitors FreshBooks, QuickBooks, Xero, Sage Business Cloud Accounting, Kashoo, Zoho Books and Kashflow.",
    "ZipBooks carries on the theme for simplicity with its current pricing structure. That starts out with a Starter package, which is free and lets you send unlimited invoices, manage unlimited vendors and customers, as well as view basic reports and supporting connection to one bank. Not bad at all.",
    "For the Smarter package, and $15 per month, there’s everything in Starter plus the capacity for scheduling recurring invoices with auto-bill, automated reminders, the ability to save invoice line items, plus multiple bank connections. You also get account notifications, the capacity for tracking time and can add five team members too.",
    "Next up is Sophisticated, which comes with everything in Starter plus smart tagging, custom categories, the ability to reconcile every account, lock completed books, share documents securely, get complex reports and invite unlimited users. ZipBooks also has an un-priced Account package, which requires you to contact them.",
    "ZipBooks ticks plenty of boxes when it comes to covering all of your financial and accountancy needs. This is also most impressive when you consider that the basic version is free, though to successfully expand its appeal you’ll need to stump up a monthly subscription fee like those outlined above.",
    "Core must-have features are the likes of online invoicing and the capacity for recurring billing, while you can also keep tabs of time, expenses and more besides. There are natty quick-to-use templates too, which if you need to style up an invoice or other business document prove invaluable. What’s more, it’s all contained inside a refreshingly simple, not to mention quite colorful workspace.",
    "During our time using it we found ZipBooks to be decidedly sprightly, especially considering that it has quite a lot hidden inside that eye-catching interface. Being browser-based means that as long as your internet connection is steady and constant you shouldn't suffer any issues with usability.",
    "One area where ZipBooks is probably going to need some work in order to bring it up to the same standard is in the app department. Currently ZipWorks doesn't have an Android edition but the app for iOS is okay, though we found the overall experience most effective when the service was being used via a web browser.",
    "Sign up is really easy as it follows a common theme. You simply press the button to get started and follow the steps, including adding in the name of your business, along with a password. ZipBooks will also flag up any leads from visitors looking for a specialist in your line of work if you're interested.",
    "Once you’re into the main work area the layout is deliciously simple. Over on the left-hand side of the screen are the core menus, including Invoices, Transactions, Reports, Contacts, Tracking, Payroll and Growth. Over on the right are checkboxes that show how far you’re into the setup process.",
    "Along the top of the menu bar there’s a More tab that, in essence, lets you access a hierarchical menu route to any, or all, of the features and functions. Overall, ZipBooks is a breeze to get around.",
    "Help is always close to hand within ZipBooks and that’s down to a small tab in the corner of the right-hand side of the interface. Click on it and you get access to a help database. This proves useful in some areas, such as when you’re setting up a connection to your bank. While the database returns answers to frequently asked questions, there is also the provision for chatting to real people during their opening hours.",
    "We couldn't find the exact times during testing, with a ‘Back later’ note seeming to suffice. Phone support isn’t immediately obvious either, while the cloud-based service also lacks the vibrant online community aspect that rivals have to their benefit. Granted, ZipBooks is still a growing entity, but it would be good to see this implemented as part of the support strategy. Its social media channels make amends for that shortcoming though.",
    "ZipBooks is another fine and dandy member of the software-as-a-service ranks for accountancy. The layout and usability factors score highly with us, as it’s pretty hard to go wrong, both during initial setup and moving forwards too. As you build up your accountancy picture there’s also great support on the reporting side of things, and ZipBooks eggs you on with the positive vibes coming from its neatly colored interface flourishes.",
    "ZipBooks is also keenly priced and stacks up nicely against many of the other cloud-based alternatives that are out there, though it’s weakness is still the app part of the equation. Areas of the support picture could be a little clearer perhaps, but given the easy-to-use structure of ZipBooks that’s actually not too much of a negative. Indeed, overall, ZipBooks leaves us with a real feelgood factor."
  ],
  "headers": {
    "2": "Pricing",
    "5": "Features",
    "7": "Performance",
    "9": "Ease of use",
    "12": "Support",
    "14": "Final verdict"
  },
  "links": {
    "ZipBooks": "https://zipbooks.com",
    "accountancy": "https://www.techradar.com/best/accounting-software-small-business",
    "tax": "https://www.techradar.com/best/best-uk-tax-software",
    "finance": "https://www.techradar.com/best/best-personal-finance-software",
    "accounting": "https://www.techradar.com/how-to/online-accounting-tools-for-sole-proprietors",
    "billing": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "expenses": "https://www.techradar.com/best/best-expense-trackers",
    "FreshBooks": "https://www.techradar.com/reviews/freshbooks-2020",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks",
    "Xero": "https://www.techradar.com/reviews/xero",
    "Sage Business Cloud Accounting": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "Kashoo": "https://www.techradar.com/reviews/kashoo",
    "Zoho Books": "https://www.techradar.com/reviews/zoho-books",
    "Kashflow": "https://www.techradar.com/reviews/kashflow-accounting-service",
    "Starter package": "https://zipbooks.com/pricing/",
    "Smarter package": "https://zipbooks.com/pricing/",
    "Sophisticated": "https://zipbooks.com/pricing/",
    "Account package": "https://zipbooks.com/pricing/",
    "software-as-a-service": "https://www.techradar.com/news/what-is-saas"
  }
}