{
  "source": "https://www.techradar.com/reviews/olympus-e-m1-mark-iii",
  "title": "Olympus E-M1 Mark III review",
  "category": "cameras",
  "updated": "2020-05-04T12:13:21Z",
  "author": "tim-coleman",
  "summary": "A complete package for pros and keen amateurs",
  "verdict": "The Olympus OM-D E-M1 Mark III is the most compelling Olympus camera yet for pros and enthusiasts. Offering the power of the E-M1X, with the latest TruePic IX processor and in a more compact body, it's a great all-round camera for photography and increasingly for video. Lightning fast and reliable, there is little that the E-M1 Mark III cannot do.",
  "pros": [
    "Great build quality and handling",
    "Excellent image stabilization",
    "Very fast burst shooting",
    "Huge array of shooting modes",
    "Improved AF performance for action"
  ],
  "cons": [
    "Default JPEG noise reduction is too aggressive",
    "Not the best EVF around",
    "Low light image quality due to small sensor"
  ],
  "article": [
    "Professional sports and wildlife photographers aren't exactly short of options these days, but the Olympus E-M1 Mark III is yet another compelling contender from the Micro Four Thirds flag bearer.",
    "We were big fans of the Olympus E-M1 Mark II when it arrived in late 2016, with our review calling it the \"total package\" for anyone after a weatherproof system that could do stills and video. But with rivals launching a slew of full-frame mirrorless cameras since then, what new tricks has Olympus pulled out of its hat to keep the E-M1 Mark III relevant?",
    "At first glance, it specs sheet makes the E-M1 Mark III look like an evolution rather than an overhaul. Still, it brings several refinements, most of which can be found in the much chunkier (and costlier) flagship E-M1X. In fact, you could call this latest camera a mini E-M1X.",
    "The E-M1 Mark III keeps things the same as its predecessor – its image sensor, screen, viewfinder and high-speed shooting rates – but there are a few big new features. These include the latest processor, AF joystick, improved continuous AF system, USB charging, plus a host of new (and refined) shooting modes.",
    "Once you’ve explored the E-M1 Mark III more closely, learnt how to get the most out of it and set it up accordingly, it's an exceptionally capable camera. And it’s the refinements – the evolution – that make the E-M1 Mark III more useable across a variety of scenarios. Sometimes, it’s just a few small changes that make a big difference.",
    "You can buy the Olympus E-M1 Mark III right now in various bundles. If you just want the camera body-only, it's available for $1,799.99 / £1,599.99 / AU$3,099. While this is the same price as many of today's full-frame cameras, it's actually cheaper than the E-M1 Mark II's launch price of £1,849 (around $2,400 / AU$3,570).",
    "There are also bundles available with Olympus' Pro lenses. You can buy it with the M.Zuiko Digital ED 12-40mm f/2.8 Pro lens for $2,499.99 / £2,199.99 / AU$4,199. Or if you need an all-in-one zoom lens, you can get it with the M.Zuiko Digital ED 12-100mm f/4.0 IS Pro lens for $2,899.99 / £2,499.99 / AU$4,799.",
    "We've long been fans of the Olympus OM-D range's ergonomics. If you want a diminutive camera with a chunky hand grip and intuitive button layout, you won’t go wrong here.",
    "Of any Olympus OM-D or PEN camera, we say the E-M1 Mark III tops the pile in the way it operates. From its overall handling to its performance, there is no better Olympus camera for enthusiasts and pros.",
    "The E-M1X might be Olympus’s flagship camera, but it’s pretty hefty. The E-M1 Mark III offers it all in a more compact package, with the option to expand (via an optional grip) and being powered by the latest TruePic IX processor. Call it a mini (and cheaper) E-M1X.",
    "In addition to sitting very well in the hand, it’s quickly clear that the E-M1 Mark III is a solid bit of kit. The robust magnesium alloy body is weather-sealed and tested to IPX1 standards, which involves dripping water. We've had no qualms about exposing the camera to rain and dust, although we’ve not had the opportunity to use it in sub-zero environments. Also, the shutter is now rated up to 400,000 shots.",
    "We’re not entirely keen on the position of the on/off switch. In most cameras it is found on the top right, around the shutter release and top dials, which makes sense. But here the switch is on the left, which somehow seems counterintuitive.",
    "An AF joystick is introduced and makes a great way to quickly select your AF points, via the screen or through the viewfinder. The stick feels great and is very responsive. It actually makes the limited touch functions of the articulated LCD screen less noticeable and less relevant.",
    "Those considering an upgrade from the E-M1 Mark II will be pleased to see that the E-M1 Mark III uses the same optional vertical grip and battery unit.",
    "Battery life is respectable at 420 shots. In practice and with power saving modes, that number can be a lot higher. There is also the option for on-the-go charging via USB using a power bank or laptop.",
    "You get twin SD card slots, with only slot one compatible with UHS-II cards. For fast shooting modes and some video recording, you’ll end up relying on that one card slot more.",
    "The EVF is the same one as found in the E-M1 Mark II. It’s very good, and we especially like the option of a 120fps refresh rate, but there are other better and larger viewfinders available. The E-M1X has a physically larger finder, as does the Panasonic G9, which also has a higher resolution.",
    "With such an array of features, it’s no surprise that the menu system is vast and becoming harder to navigate. Still, Olympus offers solutions in the shape of a My Menu page to store regularly used settings, plus four custom shooting modes on the top dial.",
    "How does the Olympus E-M1 Mark III differ from the mirrorless rivals like the Fujifilm X-T3 and Sony A6600? Broadly speaking, it prioritizes versatility and shooting modes over outright image quality.",
    "Not only does the E-M1 Mark III use a smaller Four Thirds sensor than those two rivals, it slightly disappointingly uses same 20.4MP Live MOS chip as its predecessor from 2016.",
    "By today’s standards, the image quality potential of the E-M1 Mark III is unlikely to cause a stir. In addition, many of the core features appear unchanged, like the screen and EVF.",
    "But hold on a minute, don’t leave just yet. Take a closer look. There is an all-new TruePic IX processor. A few curiously-named shooting modes. An AF joystick. Image stabilization up to 7.5EV. A new picture is forming.",
    "Take the High-Res Shot mode, which now has two options; handheld and tripod. Previously, it was limited to tripod use and combined multiple exposures into a 50MP image. Now, that resolution is available handheld – and with a steady hand it works! Incredible. When using the tripod mode (with care), the final result is an 80MP file.",
    "In day-to-day use, the limitations of High-Res Shot mode become clear. But when the entire scene is stationary – a serene landscape or even product photography - it’s a great option that counters the limited 20.4MP resolution of the sensor.",
    "Live ND shooting is a neat feature, too. Available in manual or shutter speed priority modes only, Live ND gives the option of reducing light intake up to 5EV, that’s equivalent to an ND32 filter. So if you don't own an ND filter or are caught out without one, those long exposure shots are still possible.",
    "We have used the new extended low ISO 64 setting with the Live ND set to 5EV and been able to get a shutter speed of 60 seconds with f/13 at the end of the day. Handily, the effect of the long exposure is displayed on screen, too.",
    "We’d love to see the effect of the ND filter in Live ND mode available across other shooting modes, in particular for video.",
    "Talking of live display, the Live bulb modes now find their way onto the shooting mode dial, with Live Composite and Live Time options. Both display the exposure on screen in real time so you know when to finish the shot.",
    "Given this is a camera aimed at enthusiasts and pros, full manual exposure control in these type of shooting modes is available, unlike for entry-level cameras in the lineup like the Olympus PEN E-PL10.",
    "A new AF mode has been introduced for this lineup; Starry Sky AF. This mode has proved extremely useful and entirely reliable during our tests. We had the new 12-45mm f/4 lens which does not feature a manual focus clutch and would otherwise be convoluted to use for astrophotography. But, for any lens like the aforementioned, Starry Sky AF is a real winner.",
    "A while we are on AF, the E-M1 Mark III has an improved phase-detection AF system, with refinements in its performance especially for face and eye detection AF. It’s supported by the inclusion of an AF joystick, which is a welcome addition.",
    "Olympus offers a ProCapture mode which is designed for those moments when you might miss the action. It's activated when the shutter is half-pressed, buffering up to 35 shots before the shutter is pressed for capture – perfect if your reactions are not quite up to scratch.",
    "Another shooting mode that we like in this camera is focus stacking, particularly because now the completed stacked image can be achieved in-camera, even for handheld shots. Any solution that does away with time in the editing suite is welcome and the in-camera results are good. The sensor size is already more suited to macro photography (over full-frame and APS-C) thanks its greater depth of field.",
    "Then there is in-camera keystone correction, time-lapse photography with the option of saving both the individual photos and a final 4K video. Truly, the more you dig into the dense menu system and shooting mode options, the more you discover what the E-M1 Mark III can do.",
    "This is not just a camera for photography. The solid video specification includes Cine 4K at 24fps (237Mbps), Full HD videos up to 120fps, a flat color profile plus a lovely OM-Log400 profile, headphone and external microphone ports, all backed up with that powerful image stabilization which is now up to a barely believable 7.5EV.",
    "From instant start-up and shutter response to rapid AF and continuous high-speed shooting, this is a camera that won’t let you down in quick-fire situations.",
    "The E-M1 Mark III is seriously quick. 18fps silent shutter with continuous AF, 15fps mechanical shutter and 60fps electronic shutter with fixed focus is not to be sniffed at. And to an extent those numbers are backed up by real world use performance.",
    "With a UHS-II card inserted, we have been able to shoot approximately 65 frames (Raw & JPEG), or approximately double that in JPEG-only in the continuous high 18fps burst, before the camera slowed down.",
    "Yet for an all-round satisfying performance where there are no obvious limits, we landed on the 10fps continuous low setting (mechanical shutter). Bear in mind that this ‘low' setting is equivalent to what most other cameras max out on.",
    "For the most part, continuous subject tracking AF recognizes and sticks to a subject very quickly, even right up to the near edges of the frame. However, we have two main observations about this AF mode; there are occasional drops to the background and, if the subject is moving fast towards or away from the camera, AF may lag a fraction especially when the subject gets closer to the camera.",
    "When capturing action with the E-M1 Mark III, it’s really important to make sure the right AF mode is selected to get the best performance. For example, the 9-AF-point array is more accurate than entire 121-point array for single subjects. We’ve been extremely impressed with the refined face- and eye-detection AF, even for video.",
    "Overall, we found our hit ratio of sharp shots of moving subjects was higher when shooting with the continuous low setting rather than continuous high – that’s another reason not to push the camera to its limits for action.",
    "This AF evolution is backed up by the addition of an AF joystick. The stick can be used through the viewfinder, so you won’t need to take your eye off the action.",
    "Evaluative metering is very reliable – one of the most accurate available. It’s also handy that there is now a dedicated exposure compensation button on the top of the camera, but it’s even quicker to rotate the front dial for exposure compensation when using the semi-automatic shooting modes. For creative control, the spot metering modes for highlights and shadows work really well, too.",
    "If there is one common criticism leveled at the E-M1 Mark III, it is a perceived stagnation in image quality. It’s true, the imaging sensor is the same 20.4MP one as found in the E-M1 Mark II. And at this price point, there are alternative cameras with higher resolution and larger sensors with greater light gathering potential.",
    "So what of low light performance? Well, we’re happy with images up to ISO 800, where there is no perceived loss of quality. The biggest drop in quality is at ISO 3200. If you are regularly shooting in low light, this might not be the system for you.",
    "But it’s Olympus’s ongoing innovation with new shooting modes and the smaller sensor size that enables the E-M1 Mark III to perform well in other ways. For example, you can rely on the camera to acquire a sharp focus on the eyes in portraiture, or for image stabilization to keep detail sharp, or to have faster frame rates to capture the moment.",
    "Using Starry Sky AF with image stabilization active and camera mounted to tripod, we were able to get consistently sharp shots of the stars during a cold and windy night.",
    "Plus, the selection of lenses in the Micro Four Thirds system (from Olympus, Panasonic and third-party brands) is vast. If you want sharp detail and shallow depth of field in any situation, there are options. Frankly, we like how an f/1.2 lens in this system has great light gathering potential while offering a greater depth of field (f/2.4 full frame equivalent).",
    "And if you are shooting in optimum light contrast, the playing field is leveled somewhat. The minimum native ISO 200 setting is a tad limiting in good conditions like a sunny day, or for long exposures, but it’s great that there are now extended settings down to ISO 64.",
    "Compared to larger format cameras, higher contrast and perceived limited tonal range in the Four Thirds format is more obvious when shooting in color modes with standard or vivid reproduction. So, stick to the ‘natural’ picture mode and color rendition is very pleasing, as we have come to expect of Olympus cameras.",
    "If there is one slight observation to make about color rendition, it is that magentas and reds in JPEGs are a little too saturated (with a consequent loss in detail) even in what is the subtle ’natural’ picture mode that we love. To be fair, we’ve seen this in other camera systems too. In that same setting, greens and blues are understated in JPEGs compared to the Raw files.",
    "As well as the handle on magentas, in our opinion, noise reduction is by default too aggressive for JPEGs. We quickly opted to turn off noise reduction completely.",
    "Casual video shooters are catered for completely, even those that are starting to explore video more seriously. The log color profile looks great in Cine 4K and handheld shots are smooth with that excellent sensor-shift stabilization plus competent continuous AF with face detection.",
    "The Olympus OM-D E-M1 Mark III is a robust camera, intuitive and comfortable in the hand. It’s light and small with the option to expand, and has the lens selection to help it flourish.",
    "Once you dig deeper into those convoluted menu systems and options within the shooting modes, it’s clear just how complete the E-M1 Mark III is. The array of shooting modes are a delight. There is little it cannot do and, crucially, it’s lightning quick for the entire photographic process.",
    "At this price, though, the E-M1 Mark III faces stiff competition in the mirrorless and DSLR sectors. You can get a high-speed, weather-sealed camera in any of the four-thirds, APS-C and full-frame sensor formats at this level.",
    "And so the same old dilemma remains; the smaller Four Thirds sensor size does limit you in some ways (namely low-light performance) and propel you in others. But if you already know where you sit on that and this format appeals, it’s hard to think of a better camera for photography."
  ],
  "headers": {
    "5": "Olympus E-M1 Mark III release date and price",
    "7": "Build and handling",
    "18": "Features",
    "35": "Performance",
    "44": "Image quality",
    "54": "Olympus E-M1 Mark III verdict",
    "58": "The competition"
  },
  "links": {
    "Olympus E-M1 Mark II": "https://www.techradar.com/reviews/olympus-om-d-e-m1-mark-ii",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600"
  }
}