{
  "source": "https://www.techradar.com/reviews/claimcare-medical-billing-services",
  "title": "ClaimCare Medical Billing Services review",
  "category": "computing",
  "updated": "2020-09-24T16:06:19Z",
  "author": "jonas-p-demuro",
  "summary": "Professional medical billing",
  "verdict": "ClaimCare provides a full billing service along with a guarantee, but we would prefer some more information about pricing and support upfront.",
  "pros": [
    "Instant Payment Program",
    "Expedited program for smooth transition",
    "Service Level Guarantee",
    "Credentialing service"
  ],
  "cons": [
    "No transparency in pricing",
    "Lack of user reviews",
    "No mobile apps",
    "Lack of options for support"
  ],
  "article": [
    "No internet startup, ClaimCare has over 17 years of medical billing experience. It is US based, with multiple locations, including Austin TX, Dallas/Fort Worth TX, Houston TX, Orlando FL, San Jose Ca, and Pittsburgh Pa. Its clients include all the specialities, across the entire US, and furthermore all the employees are US based.",
    "ClaimCare Medical Billing Solutions endeavors to offer a full service medical billing service, with the goal of increasing your practices collections, in a short turnaround time. It does this by providing an efficient, and dedicated service that can allow a practice to outsource this necessary service and avoid the hazards of a practice attempting to do this in house.",
    "A key component to getting practices paid sooner, is the Instant Payment Program. ClaimCare asserts that this can get the practice paid in an amazing 24 to 48 hours after the patient encounter, eliminating the significant delays of waiting for a prolonged period after for payment, which can hamper a practice’s cash flow.",
    "Transitioning to a new billing solution is often a difficult proposition for a practice. Downtime needs to be minimized or else a practice will not have the ability to bill during the transition time. Dubbed as their Expedited Billing Solution, ClaimCare indicates that a complete billing solution can be up and running in under a week. This is ideal in the situation where a practice loses their inhouse biller, or if the practice has a backlog of claims to be submitted.",
    "While ClaimCare focuses on its billing services, it also offers a suite of other ancillary services. These range from the time sucking tasks of credentialing, to contracts, also the training of the staff for the front office, and integrated billing and scheduling software.",
    "Finally, unlike some competing services, ClaimCare backs this all up with its Service level guarantee. More than just words, it backs up the service with quantifiable benchmarks, such as that “85% of your charges will be resolved within 60 days,” among others",
    "While ClaimCare Medical Billing Services has been around for over a decade, the lack of a single user review that we could find is certainly concerning after multiple internet searches. Additionally, at least the company does have a social media footprint with its Facebook page, and while technically it has a positive profile, it consists of “5 Likes,” which puts it in the single digit range, which is pretty tiny for the amount of claimed customers. Things over at Twitter are minimally improved with a mere 13 followers after 402 tweets, which is also unimpressive.",
    "Furthermore, there is an overall lack of detail on how this service works on its site. For example, it is not indicated if ClaimCare works with any EHR, or only with certain ones, but it is stated that one can be supplied as part of the service in a bundle without any further indication of the additional cost, if any, involved. It also is not told if there are available mobile apps, such as for iOS and Android to be able to access the billing services when away from the office with ease. If ClaimCare requires a certain desktop platform, this is also not designated on its site. The pricing shared on the website is also more amorphous than most as detailed below. Finally, support options (also below) are also not easily visible.",
    "As far as we can tell from ClaimCare’s website, the only option for support is via an online portal. Here users can ask their question, and an email is required in order to receive a response. At least there is an option to put in your phone number, but we would also like to see an option box to designate how you would like to receive your response, whether by phone or by email. Also, some competitors provide a way to upload attachments to illustrate the issue a user is having, such as annotating a screenshot, but ClaimCare has no such option.",
    "We also lament the lack of other options for support, such as directly via phone, online chat, or some self support options. There is also no indication what the hours or days for support are.",
    "Furthermore, we’d like to admit that we get a little concerned when the numbers listed on the support page to their online portal are all for sales, and not to support the product.",
    "ClaimCare is simply not forthcoming in their pricing, and going up and down their website we reach the conclusion that it simply is not there. Rather, it requires company contact, where your needs can be explained, and then ClaimCare can provide a custom quote. The only indication of the pricing is that ClaimCare offers “the most competitive billing rates in the industry,” which does sound enticing.",
    "The reality may not be so rosy though. After multiple searches, we did glean that ClaimCare prices the service at approximately $200 (£154) to $300 (£231) per provider monthly, dependent on the number of providers, and the volume. It is not known if there are lower costs for non-MD practices, such as an optometrist or physical therapist. Furthermore, there are concerns for additional costs, including the initial transfer of records that can run an estimated $500 (£385) for each 1,000 records, and initial training that can run approximately $200 (£154) for each session.",
    "ClaimCare Medical Billing Services is a bit of a black box of a billing service. There are some aspects of it to like, such as its Instant Payment Plan to get clinicians paid sooner, thereby reducing the time for the accounts receivable to get paid, along with setup in less than a week, and the ancillary services offered, such as credentialing. However, on the downside, there are issues with the opaqueness to pricing, the limited support options, and the total lack of any user reviews. While each practice needs to choose its best billing option, our opinion is that there are better options out there."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "8": "Support",
    "11": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "ClaimCare": "http://www.claimcare.net/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}