{
  "source": "https://www.techradar.com/reviews/shopify",
  "title": "Shopify review",
  "category": "computing",
  "updated": "2020-10-12T20:14:59Z",
  "author": "mike-williams",
  "summary": "Hassle-free web store creation with the e-commerce giant",
  "verdict": "Shopify represents an easier way to build and manage your web store, but there are more powerful platforms around.",
  "pros": [
    "No product/bandwidth/disk space limits",
    "No revenue-per-year limits",
    "Huge number of apps and extensions",
    "Excellent mobile app"
  ],
  "cons": [
    "Less features than BigCommerce",
    "Transaction fees apply unless you use Shopify Payments",
    "Maximum two staff accounts on the basic plan"
  ],
  "article": [
    "Shopify is a one-stop e-commerce platform which provides just about everything you need to build and grow your web store: a template-based site builder, comprehensive product catalog, easy payment processing, automated fulfilment via shipping apps and other integrations, inventory management, powerful analytics and more.",
    "Beginners can start gently by focusing on their storefront. Shopify has 72 top-quality templates available, although only eight of these are free. An excellent theme browser enables filtering the designs by industry or layout type. Most themes are available in multiple styles, and you can preview any of these with a click.",
    "Professional store features include support for customer accounts, product reviews, automatic tax and shipping rates, abandoned checkout recovery, numerous payment gateways and more.",
    "Store management tools cover easy order fulfilment, inventory management and refund tools. Marketing options such as gift cards, discounts and email marketing help you drum up more business, and detailed reports and Google Analytics support provide essential feedback on your efforts so far. There's even a custom mobile app so that you can view and control what's happening, wherever you are.",
    "Shopify doesn't have nearly as many of the annoying limits or catches that you'll sometimes get with other platforms. You can sell as many products as you like, be they virtual or physical, there's no bandwidth or disk space limit, and you don't have to factor in the cost of SSL as there's a free certificate thrown in.",
    "Despite all this functionality, the Basic Shopify plan is available for a very reasonable $29 (around £22.70) a month. This doesn't include gift cards or Shopify's more advanced reports, but otherwise includes all the features we've described so far.",
    "The only significant penalty comes in the transaction fees. Online orders are charged at 2.2% + 20p, whereas in-person payments have a lower rate of 1.7% + 0p.",
    "There's also a minor hassle in that you only get support for two staff accounts. Some competitors don't impose any user limits at all. You have have the ability to track inventory and fulfill orders in 4 separate locations.",
    "Upgrading to the $79 (around £61.80) Shopify account cuts online credit card charges to 1.9% + 20p, and in-person ones to 1.6%. You also get gift cards, professional reports, and an option for up to five staff members to access and manage your accounts, and increase your location to 5.",
    "The most expensive tier is the ‘Advanced Shopify’ at $299 per month (around £234). This cuts the online credit card charges down to 1.6% + 20p, in-person charges to 1.5%, gives you up to 15 staff accounts, and can handle 8 locations.",
    "Whatever attracts your attention, Shopify offers a free 14-day trial to help you explore it further, with no credit card details required.",
    "Signing up with Shopify works much as you would expect: hand over your email address, name, physical address and phone number, and the service logs you into Shopify's web admin console within a few seconds.",
    "The Shopify interface does its best to keep options to a minimum. A left-hand sidebar organises features into straightforward categories - Orders, Products, Customers, Analytics, Marketing, Discounts, Apps - while the Dashboard highlights how you should get started (add products, then customise your store). It's all very clean and simple.",
    "One problem with this minimalist approach is it's not immediately obvious where you should look to carry out a particular task. Fortunately, a well-designed search system is on hand to point you in the right direction.",
    "Start typing in the box and matching interface options are displayed and updated as you go. We began typing PayPal, for instance, but by the time we reached 'PayP' the search box was displaying just one match, Payment Provider Settings. Tapping this took us to the relevant page in the Settings screen and we were able to check out our various options.",
    "Shopify's dashboard design won't be for everyone. Competitors such as UltraCart and Volusion make arguably better use of their home pages, for example displaying reports on store performance so they're always visible at a glance. Those sites can also look cluttered and be more intimidating to e-commerce newbies, though, and overall, Shopify's dashboard provides a comfortable and straightforward place to work.",
    "The Shopify dashboard suggests that adding a product is the 'first step to launching your store', so we clicked the Add button to get started.",
    "The website displayed a simple Add Product form where we were able to manually enter product details. This covers all the essentials you would expect - description, images, linked videos, product classifications (type, vendor, collections, tags), variants, pricing, inventory details, shipping - but little more.",
    "Shopify product descriptions can include basic tables, for instance, while an Insert Video box enables entering simple embed codes. By contrast, BigCommerce offers almost as many table settings and options as Microsoft Word, and its Embed Media box offers fine-tuned control over HTML5 video and audio, Flash, generic IFrame and other objects.",
    "Import features are minimal. Shopify only supports CSV files, the maximum file size is only 15MB, and there's no control over the import process and no option to link custom fields in the CSV to specific Shopify product attributes. This won't be an issue if the file is in the correct format, though, and Shopify does at least provide a sample file to help, as well as previewing the results of the import process before asking you to accept it.",
    "Shipping support is better, at least once you've realised where it is (buried in Settings rather than highlighted on the Dashboard as a must-do task if you’re selling physical products).",
    "The system gets you off to a quick start with some reasonable default settings: you're shipping from the address you specified during setup, you're charging domestic shipping rates for your home country and have a single shipping zone to cover the rest of the world. Even if this isn't accurate, it gives you some sample values to explore.",
    "If you need more, you're able to add as many other shipping zones as necessary. Each one can include your choice of countries, and your shipping rates can be calculated based on the price or weight of an order, or calculated from the rates taken from a specific shipping provider or app.",
    "Although Shopify doesn't allow for specifying the dimensions of a product, you can enter weight, and a Packages system enables setting up different prices for the various package sizes and types you'll use to ship your products.",
    "Setting up your payment providers is equally straightforward. PayPal Express Checkout and Shopify Payments are enabled by default. The Stripe-powered Shopify Payments system enables taking payments via credit cards once you've provided a few more personal and financial details.",
    "There's direct support for Amazon Pay and you can also choose to accept alternative payments, as well as manual and other options (bank deposit, cash on delivery, money order, more.) You can set up whatever you need with minimal hassle and be taking orders almost immediately.",
    "Designing your site is a good start, but the real work comes in running the store over the long term, so it's important that your chosen platform has all the necessary tools to help.",
    "One major Shopify highlight is its mobile app (iOS and Android are supported.)",
    "Along with its general site management and inventory tasks (adding and editing products, browsing reports), the app enables processing orders, issuing refunds, connecting with staff or contacting customers directly. This means there's no waiting around for customers if you happen to be out of the office - you can give them the speedy service they expect, almost wherever you are.",
    "Built-in analytics give you an at-a-glance view of many important business stats: total orders and sales; top products; online store sessions by location, device type and traffic source; sales by social and traffic source; and top referrers and landing pages. Individual reports give you more detail, and a capable report generator gives you multiple report templates and allows you to edit columns and add custom filters.",
    "As we've seen, there's a lot of functionality here, but it doesn't just stop with the standard Shopify features. An exceptionally busy App Store enables expanding its powers by integrating with an array of third-party services covering every aspect of your business: marketing, sales, social media, shipping, inventory, customer service, accounting, reporting and more.",
    "We don't have the space here to do justice to what's on offer, but to give you an idea, here are just some of the things you can do with Shopify's free social media apps: enable signing up and logging in with multiple social network accounts; embed Instagram feeds in your store; automatically post custom messages to social networks when you add new products; collect reviews from Facebook, Twitter and Google+ and use them in your store; integrate messaging via Skype, Messenger, SMS and email; promote best-selling products on your favourite sites, and the list goes on…",
    "Many of these apps are free or include free options, and overall they greatly expand what the service can do. If you're browsing Shopify's website to find out more about the service, be sure to check out the App Store, too.",
    "An excellent e-commerce platform, relatively easy to use and with a huge library of apps for integrating with other services. Beware the transaction fees if you don't use Shopify Payments, though."
  ],
  "headers": {
    "11": "Getting started",
    "16": "Creating your store",
    "26": "Running your business",
    "33": "Final verdict"
  },
  "links": {
    "Shopify": "https://www.shopify.com/",
    "theme browser": "https://themes.shopify.com/",
    "Basic Shopify": "https://www.shopify.co.uk/pricing",
    "Shopify account": "https://www.shopify.co.uk/pricing",
    "Advanced Shopify": "https://www.shopify.co.uk/pricing",
    "BigCommerce": "https://www.techradar.com/reviews/bigcommerce",
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1344738888804310300&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fgb%2Fapp%2Fshopify%2Fid371294472",
    "Android": "https://play.google.com/store/apps/details?id=com.shopify.mobile&hl=en_GB",
    "App Store": "https://apps.shopify.com/"
  }
}