{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
  "title": "Samsung Galaxy Z Fold 2 review",
  "category": "phones",
  "updated": "2021-06-30T09:49:45Z",
  "author": "matt-swider",
  "summary": "The most futuristic phone of 2020",
  "verdict": "The Samsung Galaxy Z Fold 2 is the only foldable phone you should consider buying in 2020 if you want to maximize that satisfying ‘wow’ factor when showing it off. It feels like you own a smartphone from the future when you collapse its tablet-sized screen in half, and the larger front display and stronger hinge fix the biggest Gen 1 issues. Be warned: it’s still priced for early adopters and the cameras on the Note 20 Ultra are better.",
  "pros": [
    "Much bigger front Cover Display",
    "Refined second-gen hinge",
    "Improved split-screen software"
  ],
  "cons": [
    "As expensive as phones come",
    "Lacks Samsung’s best cameras",
    "No microSD card slot"
  ],
  "article": [
    "Jaded about smartphones? Think you've seen it all? The Samsung Galaxy Z Fold 2 is the cure; the one piece of tech that has truly wowed us in 2020. It’s the only foldable phone with 5G that we recommend buying – if, and only if, money is no object.",
    "Every time the screen folds in half, it impresses. Strangers in a socially distant New York City, not eager to make small talk right now, are stopping us to ask: what is that thing? And is it actually worth buying? Let’s take those two questions one at a time.",
    "The Fold 2 is the screen-bending sequel to the Galaxy Fold 1, with nearly all of the improvements we asked for 11 months ago. Its 6.2-inch Cover Display fixes our chief complaint regarding the first Fold’s bezel-heavy 4.6-inch front. It’s now just big enough to type on, even if it still feels cramped on account of its narrow-yet-tall shape.",
    "Unfolded, it's like owning a 7.6-inch mini Android tablet. That’s something we’d typically need a backpack to cart around, and would often end up leaving at home. Our 7.9-inch iPad mini 4 has been on home lockdown before it was cool. Yet Samsung's design makes its device fully pocketable at a moment’s notice. As long as we’re not wearing our jeans with the slimmest pockets (which we’ve been told more than once that we shouldn’t be wearing anymore anyway), this chunky phone-tablet hybrid can go almost anywhere.",
    "The inside display impresses beyond size. Its adaptive 120Hz refresh rate kicks in when you’re playing games or watching movies, offering more fluidity compared to the 60Hz screen on last year’s Fold; smoothness matters on a big screen like this. It impressed us enough to nearly distract us from the fact that, yes, there’s still a faint crease down the middle of the display and, no, despite the inclusion of Samsung Ultra’s Thin Glass, this doesn't feel like a glass screen. Its top layer is a plastic screen protector that feels mushy to touch compared to the solid glass front Cover Display.",
    "Everything else about the Fold 2 feels stronger, especially the retooled hinge that can prop open the phone at multiple positions. Samsung’s variable screen mechanism is coupled with what it calls Flex Mode, which automatically reshuffles the UIs of certain apps. Its best trick is decluttering the camera app’s live preview at the top screen, while the controls appear at the bottom-right, and the last photo taken shows up at the bottom left. While Flex Mode is limited to a few apps right now, it feels very clean compared to a one-screened smartphone in which all of these elements would appear overlaid.",
    "Here’s where we’re going to throw the caution flag: the Z Fold 2 cameras shouldn’t dictate your smartphone purchase. It has five perfectly good cameras, including three on the back – regular, ultrawide and telephoto. But with a 2x optical and 10x digital zoom here, Samsung’s best camera phone remains the Galaxy Note 20 Ultra, thanks to its stunning 5x optical and 50x digital zoom. Money can’t buy everything in one phone.",
    "We mentioned the Z Fold 2 can go almost anywhere. It’s not waterproof or dust-proof, like most phones at this price point. But it can go the distance. We experienced all-day battery life in our testing, and the phone comes with a 25W charger in the box for what Samsung calls ‘Super Fast Charging’. It also supports fast 11W wireless charging (that’s a bit slower than the usual 15W wireless charging we see on new Samsung phones), and reverse wireless charging, in case those new Galaxy Buds Live need some juice.",
    "We called the original Galaxy Fold 'the most forward-thinking smartphone you shouldn't buy' because, even with its screen-folding innovation, it had classic first-gen limitations – and at a price higher than that of the very best laptop. We also knew that Samsung would be quick to remedy our biggest complaints – and it did. But this still isn’t the best Samsung phone for the average consumer.",
    "So we’re torn. The Galaxy Z Fold 2 remains obnoxiously expensive for a smartphone – it costs as much as two Samsung Galaxy S20 phones if you fashion your own hinge (please... don’t actually attempt that). Yet it fixes most of the first-gen limitations we complained about, courtesy of its larger Cover Display and improved durability. It has the features we wanted at a price no one asked for.",
    "It’s easier to recommend this phone to early adopters who crave novelty, knowing that, with each new iteration, the perk of showing off a foldable screen will wear off. It won’t be mind-blowing when the Galaxy Z Fold 5 comes out if everybody has one. If that’s triggering your smartphone FOMO, this more durable and refined Fold sequel is for you.",
    "But the Fold 2 isn’t destined to go mainstream among average consumers when more practical phones exist, like the Galaxy S20 Plus and Note 20 Ultra, which have better cameras and start at half the price. Samsung could stand to cram more into its next foldable phone, but our biggest request for the Galaxy Z Fold 3? Fold that price in half.",
    "The Samsung Galaxy Z Fold 2 release date is Friday, September 18 in the US and UK. In Australia, the release date is September 25. We've yet to learn availability details for the UAE and other regions.",
    "You’re going to be paying a lot no matter where you buy it. The Fold 2 price is $1,999 / £1,799 / AU$2,999 (about UAE 7,300), and there’s only one model, which has 256GB of storage (there’s no microSD card slot for expanding on that).",
    "That’s twice the price of the Galaxy S20, so to sweeten the deal, Samsung is offering its ‘Z Premier Service’ in most regions. Current benefits include 1:1 VIP customer service, and, bizarrely, a meal from a Michelin star restaurant and a FairwayPass for a round of ‘elite’ golf.",
    "The box also lacks free Galaxy Buds and a two-piece case, but you can take solace in two things. First, the Fold 2 is a 5G phone, hence why it’s $20 more than the Fold 1 in the US (where the Fold 1 was simply 4G LTE), yet £100 cheaper in the UK (where the Fold 1 was 5G). The price is trending in the right direction when you compare apples to apples.",
    "Second, at least it’s much cheaper than the designer Fold 2 Thom Browne Edition, which will cost a truly ridiculous $3,299 / £2,999 when it launches on September 25, with the Galaxy Watch 3 and Galaxy Buds Live included in a fancy box.",
    "The Galaxy Z Fold 2 feels like Samsung’s vision of the future of phones fully refined. This echoes our thoughts on the original Fold when we said “it gives you the opportunity to own the future of smartphones and tablets”. You still get that awestruck feeling here.",
    "Samsung has added polish to its screen-folding innovation, and that’s seen in two design features. The first is the ‘Hideaway Hinge’. This smooth backbone to the Fold 2 lets you prop open the inner display at any angle from 75 to 115 degrees. So you can stop mid-unfold and use the phone like you would a laptop – a very tiny laptop. Or, since half of the phone is standing upright, you can easily snap a selfie using the rear camera. No tripod necessary.",
    "Second, Samsung has evolved its ‘sweeper’ technology to better repel dust particles. There’s a necessary gap along the phone’s spine, which ensures that it can fold and unfold, with tiny vacuum-like bristles, now smaller in Gen 2, lining the inside of the all-important hinge. The Fold 2 isn’t dust-proof but its achilles heel is less exposed.",
    "Given all the cutting-edge tech packed into such a narrow (when folded) device, here’s the most non-shocking statement of this review: this phone is thick. Folded, its girth is 16.8mm, and it does feel as if you’re holding two average-sized phones back-to-back in your hand.",
    "Here’s the good news: at 282g, it’s lighter than it appears – it’s still heavier than the Galaxy S20 Plus at 186g, but not twice as heavy, as its double-up-phone look may suggest. We also found it a lot easier to hold when folded due to its narrow shape, and unfolded, it’s 6.9mm thick, which is about typical for any flagship phone or tablet that we’d call thin.",
    "The Galaxy Z Fold 2 takes favorable cues from the Note 20 series, with matte colors and squared-off edges. It comes in Mystic Bronze and Mystic Black, and you can also customize the hinge color – but only if you buy the phone unlocked from Samsung – with the Mystic Black, Metallic Silver, Metallic Gold, Metallic Red and Metallic Blue options offering a nice color accent.",
    "But similarities with the Note 20 design stop there. Samsung shifts the fingerprint sensor from in-screen to the side-mounted power button, which makes sense, and doesn’t include an S Pen, even though a stylus would be fitting for a spacious 7.6-inch display.",
    "Samsung is no longer the only phone manufacturer with a foldable phone, but it still has the most polished design when compared to the dual-screen Microsoft Surface Duo, the LG V60, and newly announced Moto Razr 2020.",
    "There’s more to the Fold 2 screen than intricate folding mechanisms. Its size and refresh rate have been boosted so much that there’s absolutely no reason to consider buying a Fold 1, and current owners will feel instant regret for buying Gen 1 technology (we can’t say we didn’t warn you in our original review).",
    "The 6.2-inch Cover Display is now more usable, despite the fact that the phone’s dimensions haven’t changed dramatically, and it’s still easy to hold in one hand when folded. It’s a meaningful jump from the measly 4.6-inch front screen that made the original Fold’s feel as if it contained more black bezel than actual screen. It still feels cramped to type on when the keyboard pops up, but we can at least get off a message with enough swype-typing precision.",
    "The 7.6-inch mini tablet-like screen is also a smidgen larger than its 7.3-inch predecessor, creating a wonderfully spacious canvas on which to play games and even make routine edits to spreadsheets. Creating spreadsheets from scratch is still leagues easier on a larger tablet, laptop or desktop, but the Fold 2 is a nice stop-gap between phone and tablet for most productivity-related tasks.",
    "Both screens, front and inside, look tack-sharp, and the inside display benefits from an adaptive 120Hz screen refresh rate. Movies and games move more fluidly than on a 60Hz screen, and it’s really noticeable on such a large display. Samsung’s tech is smart enough to dial down the refresh rate when you’re doing something less graphics-dependent, like checking email, to conservative battery. The uneven jello-like effect between the two halves of the screen is also gone, according to our testing. That was a problem that plagued the Fold 1, and everything now moves uniformly.",
    "There’s actually extra screen real estate here that the official screen specs don’t show. Gone is the Fold 1’s oversized cutout in the top-right corner along with its second ‘depth’ camera. The single front camera is housed in a small display punch-hole, and dropping from two inside cameras to just one didn’t make a difference to our portrait photos (Samsung is presumably using software to distinguish depth).",
    "There’s an obvious reason why Samsung didn’t pair this phone with an S Pen. The top layer of the large inside display has a screen protector – one that you shouldn’t rip off. The company’s Ultra Thin Glass is underneath, and that’s a step in the right direction, but the plastic protector is likely too delicate to handle your stylus strokes.",
    "The biggest changes to smartphone software in the last decade are happening right now, and that’s because foldable phones are pushing the idea of using multiple apps simultaneously. The functionality has existed on phones before, but the concept is fully realized on the Fold 2.",
    "Flex Mode is the means by which Samsung executes split-screen software – perfectly. When the 7.6-inch Fold 2 is propped up at a 90-degree angle, the camera app shows the live camera preview on the top part of the screen. On the bottom-left is the last photo taken (great for comparing your most recent shot to the one you’re about to take), and the bottom-right side is dedicated to camera controls. YouTube allows for something similar: you can watch a video on the top half of the screen, while you scroll through comments or navigate to other videos on the bottom screen.",
    "All of this information would normally be crammed onto one small smartphone screen, so Flex Mode has the potential to dramatically declutter the Android interface – it reminds us of what the Asus Zenbook Duo is doing for laptops with its screen embedded in the top part of the keyboard case. Here’s Samsung’s big problem though: while Flex Mode applies to a few other apps, like video calls and Google Duo, it’s not compatible with more than a handful.",
    "Split-screen is compatible with more apps, and allows you to view three apps at once, with some apps evening supporting drag-and-drop between the windows. If you’ve turned your nose up at split-screen modes on a phone before, you’re not alone – us too. But in tablet mode, the Fold 2 screen is just big enough to make it work.",
    "The one thing that doesn’t work is Samsung’s insistence on using its default web browser, which can’t be uninstalled. Happily browsing in Google Chrome, we opened up a Google search result for a Reddit page, which gave us a familiar option: ‘Do you want to use the native Reddit app, or do you want to continue in a web browser?’ Unfortunately, that browser was ‘Samsung Internet’, which has none of our passwords or bookmarks. Welcome to Samsung’s walled garden.",
    "The rest of Android 10 and Samsung’s OneUI 2.5 overlay//interface work great, and Samsung’s App Continuity feature lets you customize which apps stay open on the small screen even when you fold the phone. This has allowed us to hang up all video calls when we close the phone, but leave other apps, like Google Maps, open. We loved configuring directions on the big screen, then folding the phone to follow the route on the Cover Display, safely palming the Fold 2 while exiting the subway.",
    "The Galaxy Z Fold 2 is one of the fastest Android smartphones in 2020, mirroring what we experienced from the US version of the Note 20 Ultra, which uses the same chipset as all versions of the Fold 2: Qualcomm’s top-of-the-line Snapdragon 865 Plus.",
    "Samsung’s Exynos 990 chipset didn’t get utilized in the Fold 2, and that’s good news for everyone in the UK and other regions. The Exynos 990, found in the Note 20 series, outside of the US, showed weaker performance and battery life than Qualcomm’s chip in our testing.",
    "There’s plenty of CPU horsepower and laptop-grade 12GB of RAM here, flawlessly handling multi-tasking even with three apps open and projecting a computer-like interface onto a TV using the enhanced wireless Samsung Dex mode. With a Geekbench 5 multi-core score of 3,172 the Fold 2 still falls short of the iPhone 11 Pro (3,424), and will likely be outshone further by the iPhone 12, but you’ll be hard-pressed to find a performance hiccup on the Fold 2.",
    "5G speeds are going to vary by region and carrier, according to our tests in New York City. We experienced sub-6 ‘5G’ at 200Mbps on T-Mobile, and then, minutes later in the very same spot, much faster mmWave 5G at 1.6Gbps on Verizon. The tradeoff is that the slower sub-6 speeds worked indoors as well as outside, while mmWave required us to stand outside directly under a 5G antenna. The Fold 2 – like all 5G phones in 2020 – feels future-proofed more than it’s constantly super fast.",
    "Everything about the Fold 2 specs is cutting-edge… except for the internal storage size. 256GB is limited given the fact that a) you’re paying such a high price and b) there’s no microSD card slot in the SIM card tray, so you can’t expand the storage beyond 256GB. We expected 512GB, and we would’ve traded exactly one Michelin star restaurant meal for the upgrade.",
    "The Fold 2 has five cameras, and they capture some of the best photos on a smartphone – but they’re not Samsung’s absolute best. That may sound harsh, because the pictures from all three 12MP rear cameras (regular, ultrawide and telephoto), as well as the two 10MP cameras (one of the Cover Display and one on the inside tablet display) look sharp. They’re all great.",
    "It’s just that the Note 20 Ultra has spoiled us as our go-to camera phone, thanks to its 5x optical and 50x digital zoom. So going from that to the Fold 2, with its 2x optical and 10 digital zoom, felt like a downgrade, especially given that this phone carries a much higher price tag. Even the S20 and S20 Plus have a 3x hybrid optical zoom, and they start at half the Fold 2’s price.",
    "Exclusive to the Fold 2, however, is the ability to snap a photo using the unfolded 7.6-inch display and see a live preview on the Cover Display. Think about it this way: you can play director when asking a friend or stranger to take your once-in-a-lifetime vacation photo: they have a huge screen on which to nail the shot, and you have the Cover Display to alert you to the fact that you’re not fully in the frame. You’ll walk away with a better photo, and with your head intact. The Huawei Mate Xs also offers this, but that phone isn’t available worldwide.",
    "Again, the cameras are good, and Samsung has the best interface of any phone manufacturer – it’s easy to use and yet feature-packed. But when you’re paying so much more money than you would for the Note 20 Ultra, you expect something that’s at least on a par with the company’s ‘cheaper’ phones.",
    "Here’s what you need to know about the Galaxy Z Fold 2 battery: we’ve been averaging all-day battery life from a nightly charge for a week straight. That’s not too surprising, as the official battery capacity is 4,500mAh, a modest upgrade over the original Fold’s 4,380mAh.",
    "Of course, your mileage will likely vary based on two factors: how much you use the 7.6-inch screen vs the less-power-hungry 6.2-inch Cover Display, and how often you have the 120Hz mode activated; Samsung’s adaptive screen refresh rate is smart, dialing things down to as little as 11Hz for simple tasks, but we found the (totally worth it) mode depleted our Fold 2 battery life a bit faster.",
    "Samsung has equipped the phone with its Super Fast Charging tech, and includes a 25W charger in the box. Like the Note 20 Ultra, though, it doesn’t support the optional 45W charging accessory introduced when the Note 10 Ultra premiered, and which worked with all three S20 phones.",
    "It does, however, support fast wireless charging, albeit capped at 11W instead of the usual 15W, and allows you to use PowerShare to wirelessly charge another Qi-compatible device (like the Buds Live) from the back of your phone.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "12": "Samsung Galaxy Z Fold 2 price and release date",
    "17": "Design",
    "25": "Screen",
    "31": "Interface",
    "37": "Performance",
    "42": "Cameras",
    "46": "Battery life",
    "50": "Don't buy it if..."
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Galaxy Fold 1": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "iPad mini 4": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-mini-4-1303873/review",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "Galaxy Watch 3": "https://www.techradar.com/news/samsung-galaxy-watch-active-3/reviews/samsung-galaxy-watch-3-review",
    "Microsoft Surface Duo": "https://www.techradar.com/reviews/microsoft-surface-duo",
    "LG V60": "https://www.techradar.com/reviews/lg-v60-thinq",
    "Moto Razr 2020": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Asus Zenbook Duo": "https://www.techradar.com/reviews/asus-zenbook-duo-ux481fl-review",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}