{
  "source": "https://www.techradar.com/reviews/jbl-flip-4",
  "title": "JBL Flip 4 review",
  "category": "audio-visual",
  "updated": "2020-02-27T12:43:28Z",
  "author": "luke-johnson",
  "summary": "A life-friendly speaker that doesn't skimp on sound",
  "verdict": "The JBL Flip 4 is a robust, affordable Bluetooth speaker, and one that’s comfortably supplying sounds to all elements of your life. While the speaker might be punchy, deficiencies in the mid-range stop it being an instant must-buy.",
  "pros": [
    "Decent, rugged design",
    "Reasonable price tag",
    "Plenty of bass"
  ],
  "cons": [
    "Underwhelming mid-range sound",
    "Slightly basic looks",
    "Boring colour options"
  ],
  "article": [
    "As of 2019, the JBL Flip 4 has been succeeded by a new portable Bluetooth speaker; check out our JBL Flip 5 review for more information on the brand's latest waterproof speaker. JBL's minimalist update strips back some of the features of the JBL Flip 4, but in doing so, has created a simple, great-sounding piece of audio kit that we wholeheartedly recommend you. The original review of the JBL Flip 4 follows below:",
    "Smartphone battery booster? Check. Netflix download filled tablet? Check. Nintendo Switch and the compulsory copy of Zelda: Breath of the Wild? Check. Trips away are now a mission in tech packing, ensuring you’ve enough gadget goodness to see you through an extended weekend apart from your home comforts.",
    "A decent Bluetooth speaker is the latest must-have addition to this backpack-filling list, and the JBL Flip 4 the latest cable-cutting sound supplier looking to tempt you into parting with your cash in favour of smartphone-shaming sounds.",
    "With a $100 (£119.99, around AU$130) asking price, it’s a relatively affordable speaker, flirting with that all important $100 barrier and notably cheaper than the high-end, heavily stylised likes of the Bang and Olufsen BeoPlay A1 or the similarly specced UE Boom 2.",
    "Packing splashproof IPX7 certification into its tough, cylindrical form, the JBL Flip 4 is a speaker capable of getting the party started whether lounging at home, chilling by the pool or enduring the muddy swamp of a British festival. Crucially, it doesn’t sound too bad either, but in an increasingly crowded market doesn’t quite do enough to become an instant classic.",
    "After an original look for your Bluetooth-friendly sound supplier? Then you’re going to want to look elsewhere. The JBL Flip 4’s design is firmly from the pages of the Bluetooth speaker designer’s handbook. A slightly shorter version of the UE Boom 2, its canvas and rubber form see it line up as an outdoors-friendly, all-weather, all-location offering.",
    "What this cylindrical, ruggedised speaker lacks in originality, however, it more than makes up for on the practicality front. The durable fabric material lets the sounds flow while keeping dirt and debris out, while the sizeable rubber end caps and body-hugging accents mean it can be comfortably chucked in your bag or mistreated at the beach without fear of damage.",
    "Large play/pause, volume up and down, and sync buttons act as the on-device controls, with their oversized, plastic form making them easy to access when dealing with fingers chilled by the sea or caked in mud.",
    "On the rear, the essential power control sits above a handy battery indicator, with five small LEDs giving an at-a-glance view of how close you are to needing a recharge. There’s another physical button, this one for syncing up multiple speakers, although this is unlikely to get too much use.",
    "A waterproof port cover hides the re-charge enabling micro USB socket and an AUX in port for when Bluetooth’s not necessary. Finishing the largely unadulterated look is a carry chord. Looped in to the top of the speaker, this shoelace style addition is perfect for letting you hang the speaker in a convenient, party-filling location, or have it set up in your shower.",
    "Adding options to the minimalist design, the Flip 4 is available in six different colours, including the traditional black and less outdoor friendly white, as well as blue, red, grey, and green.",
    "While these colour options are great for those looking to express their personality, they’re more about the party vibe than living room-adorning home audio enablement. Sure the Flip 4 can sit on a self, but its look is more student digs than modern home chic.",
    "A design that you can comfortably take anywhere is only of use if the speaker offers audio output that you’re actually going to want to listen to. Fortunately, on this front, the JBL Flip 4 ticks most of the right boxes.",
    "This isn’t the most well-rounded speaker going, but given its size and price, sound quality is pretty pleasing. Bass is relatively beefy and well rounded and there’s no unwanted clipping or distortion when the volume is cranked.",
    "The mid-range is lacking slightly, however. Vocals don’t exactly get lost, but neither are they punchy. Things can sound a little muddled in the mids, with tracks like Nathaniel Rateliff’s Howling at Nothing seeing the vocals and guitar struggling to come to the fore over the strong drum line.",
    "The speaker’s sound is big though, you can really push the volume up, with the linked bass radiators that protrude from either end of the speaker, moving with the beat, help cut distortion and offering a party-friendly sound with a decent amount of grunt. It’s not the deepest overall sound, but it will get the party going whether indoors or out.",
    "Ultimately, it’s not a sound that’s as accomplished as the Bose Soundlink Mini 2 or powerful at the Beats Pill+. However, for such a compact, rugged speaker it’s more than acceptable and holds its own against the likes of the UE Boom 2.",
    "You can sync a couple of handsets up to the speaker simultaneously too, seamlessly switching between the two to create the ultimate playlist. As well letting you listing to your music, the speaker’s Bluetooth abilities can be used to let you handle your calls, doubling as a speakerphone.",
    "Given its ultra-portable design, battery life is key. Fortunately, the JBL Flip 4 has solid staying power, with its 3,000mAh capable of pumping out an impressive 12-hours of tunes between necessary trips to the mains. That’s a couple of hours less than the UE Boom 2, but still nothing to be sniffed at.",
    "Bringing bluntness over refinement, the JBL Flip 4 is a good Bluetooth speaker that never quite skirts with the realms of greatness. It’s rough, tough design makes it perfect as a portable speaker to accompany all aspects of your life while its sound is solid without worrying your home audio system.",
    "It’s all weather friendly design is a win, but a lack of definition and distinction in the mid-range ultimately means its sound quality is not quite up to scratch when compared with some, more high-end portable speakers.",
    "What it’s got going in its favour however, is price. Cheaper than the UE Boom 2, its rival might be a third bigger and more than a third more expensive, but it’s certainly not as much as a third better, and that’s why the JBL Flip 4 shouldn’t be sniffed at."
  ],
  "headers": {
    "5": "Design",
    "12": "Performance",
    "19": "Verdict"
  },
  "links": {
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "JBL Flip 5 review": "https://www.techradar.com/reviews/jbl-flip-5",
    "waterproof speaker": "https://www.techradar.com/news/best-waterproof-speaker",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "UE Boom 2": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/ue-boom-2-1311342/review",
    "Bose Soundlink Mini 2": "https://www.techradar.com/reviews/bose-soundlink-mini-ii",
    "Beats Pill+": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/hi-fi-and-av-speakers/beats-pill-1327566/review"
  }
}