{
  "source": "https://www.techradar.com/reviews/mediafire",
  "title": "MediaFire cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T15:23:45Z",
  "author": "mayank-sharma",
  "summary": "Back to basics",
  "verdict": "A bare bones file sharing service, Mediafire is missing many of the useful features that are standard with its peers. Its lack of a desktop sync client and any sort of encryption, makes it nearly impossible for us to recommend it.",
  "pros": [
    "Good pricing",
    "No bandwidth limits"
  ],
  "cons": [
    "No desktop app",
    "No file previews",
    "No sync",
    "No encryption"
  ],
  "article": [
    "There’s no two ways about it: MediaFire doesn’t offer all the luxuries that you get with other file sharing and cloud storage services. But for what it's worth, it does have several of the essential features and at a reasonable price point.",
    "MediaFire allows for bulk file uploading, and comes with a file manager that can help you sort through them with relative ease. It also makes a light job of sharing the files and offers useful sharing options. While the service doesn’t give you all the controls over your files that you get with its peers, its one-time links ensure you retain some control over the shared links.",
    "Unlike a majority of file sharing services, you can use MediaFire to share files without even registering with the service. Of course this ability comes with certain restrictions to discourage misuse. For starters, the unregistered account only offers GB of storage. Also such files that aren’t associated to a registered account are automatically zapped after 14 days.",
    "Registering the service is simple and you also get the convenience of logging in with your Facebook or Twitter credentials.",
    "Simply registering with the service unlocks a host of features. For instance you now get 10 GB of storage for uploading and sharing files. Furthermore, each file can be up to 4 GB in size. MediaFire also uses the industry standard rewards mechanism to give you the opportunity to earn more storage space by completing tasks such as installing the mobile app, and connecting your Facebook and Twitter accounts.",
    "What’s the catch, you ask? Free users don’t get access to all the features and their downloads are monetized by ads.",
    "For an ad-free experience, you’ll have to switch to a paid account. Unlike most services, MediaFire only has two subscription plans. There’s a Pro plan that gives you 1 TB of storage space and enables you to upload single files that are up to 20 GB in size. It costs $5/month or $3.75/month if you pay for a year in advance. Enterprise users have the Business plan that gives a whopping 100 TB that can be shared by 100 users. It costs $50/month or $40/month if paid for a year in advance.",
    "Both paid plans offer a similar set of advantages over the Free plan. Not only are the downloads ad-free, but these plans also enable you to embed download links directly in your website, emails, or social media posts, in order for recipients to avoid going through the MediaFire website. Both paid plans also come with several other perks such as bulk downloads, direct uploading from website links, and one-time links that we’ll get to later.",
    "MediaFire’s web interface is neatly arranged, clearly labelled, and definitely one of the service’s strengths. You can drag and drop files and folders into the interface to upload them or use the upload button.",
    "You can track uploads and manage the files once they have been added to your MediaFire account. MediaFire’s web app has a search bar that helps you find the files you need. You can type the file name or filter the files by their type.",
    "But that’s where the usefulness ends. Very surprisingly, MediaFire doesn’t offer the ability to stream audio and video files. It can’t even preview PDF and documents in most common formats. Previewing files is a pretty standard feature with virtually all file sharing services and MediaFire’s lack doesn’t bode well for the service. The only files that it does display within its web interface are images that you can also view in a slideshow. Apart from images, all other files open in a new tab where you get some basic information about the file such as its size, an explanation of the file format as well as its compatibility with Linux, Mac OS X, and Windows.",
    "The next important feature that’s lacking is security. While MediaFire does use an encrypted connection for file transfers, it lacks additional measures to safeguard the files against unauthorized access. End-to-end encryption is a pretty standard feature that you’d expect from any file sharing service, especially in the post-Snowden world. However, you can’t encrypt your files in MediaFire. This is even more worrisome since the service is based in Texas, United States.",
    "Like its peers, you can use MediaFire to share any file or folder from your account. In fact you get the option to create a share link while you are still uploading the file or folder.",
    "One of the useful features of the service is its ability to share multiple files without first placing them in their own folder. This functionality can be rather convenient and handy in certain situations. For instance you can use it to generate a sharing URL for a number of random files in your MediaFire account without first moving them into a folder.",
    "Another interesting feature when it comes to sharing is the ability to subscribe to folder changes via RSS. Instead of a regular share URL, you can ask MediaFire to generate a RSS URL for a folder. Anyone who has this URL will receive updates as and when you add or delete files from this folder.",
    "Pro and Business users get a very useful collaboration feature called FileDrop. Using this feature you can allow others that possess the URL to the folder to add files to it. You can ask MediaFire to email you whenever someone transfers a file into your FileDrop-enabled folder.",
    "All files and folders you share from your MediaFire account will be accessible by anyone with the share URL. Mediafire doesn’t offer any access controls with its sharing function which is another concern. The only saving grace is the fact that Pro and Business users can password protect their shares.",
    "You can also use the 1-Time Download feature as an access control as well. With this feature you can restrict downloading the file only once. After the file has been downloaded, the URL becomes invalid. You can add further safeguards like an expiration date after which the URL expires irrespective of whether it has been accessed or not. You can also ask MediaFire to notify you via email when a file has been downloaded using the 1-Time Download link.",
    "A major disappointment with the service is the lack of a desktop app. In fact, the service even lacks browser add-ons, which are a norm with similar services. The lack of a desktop app also means that you can’t really use MediaFire to automatically synchronize content from your computer, which is a real shame.",
    "The service does offer mobile apps for both Android and iOS. While these offer the ability to automatically upload any images or videos you shoot using the smartphone, they too lack the ability to sync content.",
    "Unlike some of its peers, MediaFire offers unlimited though ad-supported bandwidth for downloads of your shared files. Paid users get 1 TB of ad-free bandwidth per month after which their downloads are accentuated with ads as well.",
    "You’ll also find that many standard features that are standard with other file sharing services are missing in MediaFire, such as file versioning. The service also has limited documentation, most of which is outdated. For instance we couldn’t find anything regarding MediaFire’s delete history policy.",
    "Without a client sync tool or proper security, we can’t imagine a business that would use this, unless they’ve got some clever plan as to how to exploit the substantial amounts of storage space that MediaFire has to offer.",
    "I’m sure some user or company has found a good use for this service in its present condition, but for most users, the low cost is overshadowed by the numerous caveats involved in using it."
  ],
  "headers": {
    "3": "Plans and pricing",
    "8": "Interface and use",
    "12": "Features",
    "18": "Apps",
    "22": "Final verdict"
  },
  "links": {
    "MediaFire": "https://www.mediafire.com/",
    "file sharing": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file manager": "https://www.techradar.com/best/the-best-file-manager"
  }
}