{
  "source": "https://www.techradar.com/reviews/optoma-uhd30-4k-projector",
  "title": "Optoma UHD30 4K projector review",
  "category": "audio-visual",
  "updated": "2021-07-15T10:48:52.688Z",
  "author": "jamie-carter",
  "summary": "Supersized 4K projection for day or night",
  "verdict": "The Optoma UHD30 is affordable, gamer-centric and surprisingly compact – which should make it a great choice for many a shopper. Its low input lag – it manages just 15.7ms – is the main draw here, for responsive play, even if it’s largely an all-rounder in other regards.",
  "pros": [
    "Crisp, colourful 4K images",
    "Bright enough for daytime use",
    "Natural-looking gameplay",
    "Plenty of ports"
  ],
  "cons": [
    "Requires a large room",
    "Greenish ‘bright’ mode",
    "Poor built-in speaker"
  ],
  "article": [
    "Are you gaming in the daytime? Whether you’re taking a break from working from home or you’ve got some time on your hands, Optoma is hoping that you are – with a new UHD30 4K projector that’s ideal for gaming, even if you have a lot of ambient light to contend with.",
    "The Optoma UHD30 is affordable, gamer-centric and surprisingly compact – which should make it a great choice for many a shopper. Its low input lag – it manages just 15.7ms – is the main draw here, for responsive play, even if it’s largely an all-rounder in other regards.",
    "Why’s that? The UHD30’s novel 240Hz refresh rate actually isn’t all that useful; it’s only really relevant to PC gamers. Its impressive UltraDetail 4K sharpness, bold and nuanced colour and adeptness in daylight makes it a versatile projector, but a projector like this also needs a short-throw lens for small rooms and decent built-in speakers to really impress. Sadly, the UHD30 has neither.",
    "Hot on the heels of the Optoma UHD50X, and retailing for $1,299 / £999 / AU$2,899, the UHD30 is primarily sold as a projector for gamers. That’s a good price for any projector, but especially for one with a 240Hz refresh rate and a mere 15.7 milliseconds (ms) input lag on its ‘Enhanced Gaming’ mode.",
    "The UHD30’s advanced features make its dinky 315x270x118mm size and 3.9kg weight something of a shock. We’ve seen smaller projectors, but most 4K projectors are a lot bigger than the UHD30.",
    "Despite its small size, though, it packs a lot of ins and outs on its rear. There are two HDMI inputs, one compatible with HDMI 1.4 – so capable of supporting 4K at 30Hz – and the other HDMI 2.0-ready and able to carry 4K HDR video at 60Hz.",
    "While that’s a novel array of HDMI slots, the UHD30 has a couple more surprises in the form of a USB power out and an optical audio out. The former means that the UHD30 can take a smart stick such as a Google Chromecast, Amazon Fire TV Stick or Roku TV. While the optical audio can take all sound into an amplifier or soundbar. The UHD30’s rear also includes a 3.5mm audio input and output brace.",
    "Other ins and outs include a VGA input for older laptops and PCs, and both an RS-232 port and a 12V trigger out for integrating the UHD30 into a custom install-style control system.",
    "Its lamp is rated at 4,000 hours in ‘bright’ mode and 10,000 hours in ‘eco’ mode. Also in the box is an ergonomic white plastic remote control – with a white backlight that comes on automatically when any button is touched, though in a blackout we found it far too bright.",
    "The UHD30 is designed for living rooms. Sure, it works in a dedicated home cinema, but its status as an occasional gaming projector – as well as its compatibility with streaming sticks – means it should be judged in a living room.",
    "Weight-wise it’s light enough to yank from a cupboard, but dump it on a coffee table and the problems begin because its throw ratio of 1.5:1-1.66:1 means that it needs to sit a long way from a projector screen or wall to create a large image. For example, to create a 100-inch image, which is surely what most users are going to want, the UHD30 must be placed about 3m from a wall or projector screen. That’s quite far, and means for most people the UHD30 will create an image about the same size as their TV – in which case, what’s the point of getting a projector at all?",
    "Once in place, the UHD30’s 1.1x manual zoom (a tad less than the Optoma UHD50X) and 40° vertical (but not horizontal) keystone correction are just about enough to get a dead-on image, though manual lens shift levers would be better.",
    "Once set up, there is a suite of picture presets (Cinema, HDR Simulation, Game, Reference and Bright; note that ‘Enhanced Gaming’ is a separate option) as well as the option to calibrate the UHD30 to compensate for the color of the wall you’re projecting onto.",
    "The UHD30 makes some pretty bold claims. As well as super-low input lag for super-smooth gaming and a high refresh rate, it supports 4K HDR, being compatible with both HDR10 and Hybrid Log-Gamma (HLG) content. The UHD30 also presents a Rec.709 colour gamut, boasts 3,400 lumens brightness, and has a 500,000:1 contrast ratio.",
    "In practice, the experience when gaming is good, but we’re not convinced the UHD30’s ‘Enhanced Gaming’ mode is worth all the fuss. A huge bugbear of gamers is input lag – otherwise known as latency – which is the slight delay between a video frame being sent to a display and that display actually showing it. It makes gameplay awkward. The ideal scenario is to get below 30 milliseconds, which the UHD30’s ‘Enhanced Gaming’ mode achieves if – and only if – the HDMI 2.0 input is used. With the UHD30 in that mode, the latency is cut to a swift 15.7ms while a 240Hz refresh rate is enabled.",
    "The actual refresh rate is determined not by the display, but by the source (which would have to be a PC since no games console supports high frame rates), but in any case the UHD30 does support 240 frames per second (fps). It’s overkill, for sure, but either way, there’s a natural feel to gameplay, which remains both smooth and sharp. However, we noticed just as much judder on an Xbox One as usual; it’s only that super-fast response time that’s important here.",
    "Meanwhile, the UHD30’s UltraDetail feature helped make a 4K video of Iceland’s Gulfoss waterfall appear crisp, sharp and colourful when viewed on a 70-inch projector screen. Colours appear rich and bold with just enough shadow detailing. Only in strong daylight does that not ring true, when the otherwise reasonably impressive contrast naturally takes a dip. The UHD30 does have a Dynamic Black option, but it made only a slight improvement.",
    "In our tests, the ‘Reference’ colour mode proved the most adept in a blackout and, not surprisingly, the ‘Bright’ mode had to be used in strong daylight. The latter has a slight greenish hue to it that worsens the brighter you push the UHD30 (it goes bright enough to cope even with really strong sunlight).",
    "Mostly good so far, but a run-through of Gravity on Blu-ray and also some 50Hz TV fodder from British TV was slightly spoiled by judder. However, during our review, there was no trace of the dreaded DLP ‘rainbow effect’.",
    "Image-wise, the UHD30 is a really good projector worth the money, but it’s not a world-beating bargain either.",
    "We’ve begun to see Bluetooth streaming on home cinema projectors like the UHD30 – making it possible to use a third-party Bluetooth speaker – so it’s a shame not to see that here. A plethora of wired ins and outs give the UHD30 some significant audio options, but given the occasional use nature of a gaming projector, the UHD30’s built-in speaker needs to be sufficient by itself – and it just doesn’t.",
    "The power output of 10W gives lots of volume, but little else; it’s harsh, it’s tinny and it’s unpleasant to listen to. The volume goes up to a max setting of 10, but it’s best left on 1 or – better still – 0. Worse, if you choose to mute it, a large icon of a speaker with a line through it sits in the corner of the screen for perpetuity; best to leave the audio activated and take the volume right down to zero.",
    "Another worry on super-bright daytime projectors like the UHD30 is fan noise. The brighter the lamp goes, the more cooling is required. That’s occasionally the case with the UHD30, which is rated at 26 dB as typical and 28 dB maximum, though our measurements found a peak fan noise of 50dB with the UHD30 at peak brightness. The UHD30 can get pretty loud, but it’s really not that bad and certainly not a deal-breaker."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design",
    "9": "Setup",
    "13": "Picture performance",
    "20": "Audio performance",
    "23": "Don't buy it if..."
  },
  "links": {
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Optoma UHD50X": "https://www.techradar.com/reviews/optoma-uhd50x",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "Roku TV": "https://www.techradar.com/reviews/roku-streaming-stick",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "HLG": "https://www.techradar.com/news/hybrid-log-gamma-what-you-need-to-know-about-hlg",
    "DLP ‘rainbow effect’": "https://en.wikipedia.org/wiki/Digital_Light_Processing",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079"
  }
}