{
  "source": "https://www.techradar.com/reviews/ulefone-armor-7-rugged-smartphone",
  "title": "Ulefone Armor 7 rugged smartphone review",
  "category": "phones",
  "updated": "2020-06-25T15:51:52Z",
  "author": "desire-athow",
  "summary": "The competition heats up amongst rugged smartphone vendors",
  "verdict": "The Ulefone Armor 7 is a solid rugged smartphone with a very keen price tag. You’d be hard pressed to find a cheaper device with 8GB of RAM, the added bonus being its waterproof and shockproof features.",
  "pros": [
    "NFC",
    "Wireless charging",
    "Great price",
    "Superb configuration for the price",
    "Dual LTE/4G SIM standby",
    "Good performance"
  ],
  "cons": [
    "The lanyard",
    "Camera sensor positioning"
  ],
  "article": [
    "Ulefone is the last of the big three rugged smartphone vendors to unveil a flagship smartphone based on Mediatek’s P90 chipset and a 48-megapixel rear camera. Blackview and Doogee have already unveiled their BV9900 and S95 Pro flagship models and with MWC 2020 just weeks away, an event that promises even more surprises and reveals especially as Mediatek announced a new 5G chipset.",
    "No real surprise here; the Armor 7 sticks to the tried and trusted, classic 4+4 rugged smartphone template. Four long sides, four rubber vertices for added protection. Not much evolution from a design perspective. The most notable change happens at the back where there’s a very smooth plastic plate rather than the usual rubber cover.",
    "A front facing camera sits bang in the middle of the top bezel in a water drop setup. There’s no permanent capacitive system buttons which may divide opinions and no status lights (except for the battery status).",
    "The rear houses a speaker grill, three camera sensors and five LED flashlights plus a heart rate sensor; the cameras are protruded which means that they will take most of the shock if this phone hits the ground flat.",
    "Note the notch at the very bottom of the device which is used to attach the bundled lanyard. Not sure why and how that is a useful addition as it makes the device a couple of millimeters thicker.",
    "At 166 x 81 x 13.55mm for a weight of 290g, it is big without feeling like it. On the left and right edges are a SIM tray, a customisable SOS button, a fingerprint reader, the power button and two others for controlling the volume.",
    "On the top and bottom edges are an uncovered Type-C connector (beware of dust and lint getting stuck there) and a proximity sensor.",
    "Ulefone mentions that the phone is compliant with IP68/IP69K requirements and has been MIL-STD-810G certified under laboratory conditions. The phone, the company said, has used a bi-injection process with a waterproof glue to hold together the assemblage of metal, plastic and composite material.",
    "The Armor 7 is one of a handful of rugged smartphones on the market that use a Mediatek P90 chipset. This Helio part was unveiled back in 2018 and sports six slower cores and two faster cores, paired with a PowerVR GM 9446 GPU.",
    "It offers Cat-13 150 Mbps upload and Cat-12 600 Mbps download, Dual 4G SIM with Dual VoLTE standby mode plus Bluetooth 5.0, 802.11ac wireless connectivity and an NPU. Ulefone added 8GB of DDR memory with 128GB onboard storage. A microSD card slot is available but you will need to sacrifice a SIM card to use it.",
    "When it comes to the camera subsystem, the Armor 7 uses three Samsung rear cameras; a 48-megapixel one, a 16-megapixel night photography one and an 8-megapixel telephoto lens with a 10X zoom; It can also capture 4K videos.",
    "In the box, you four leaflets, a tempered glass to protect the screen on the Armor 7, a Type-C to 3.5mm audio converter, a 15W (5V3A) power adaptor, a Type-C to Type-A adaptor, a Type-C to microUSB adaptor and a Type-A to Type-C cable and a short strap.",
    "A 5,500mAh battery, NFC capabilities and a 6.3-inch FHD+ display complete the specification sheet. The battery can be charged wirelessly using an optional 10W charger and the phone supports all three major satellite positioning systems.",
    "The display was already covered by a screen protector when we picked it out of the box and we were surprised at how easy it was to scratch; you can of course remove it but decided to keep it in place especially as it was oleophobic.",
    "There’s a kids mode (Children Space) that allows the user to fine tune access and usage time. It is, in a nutshell, a heavily restricted virtual desktop. The heart rate monitor and the ubiquitous outdoor toolbox kit are the two other apps that are worthy of a mention. The latter includes a pedometer and a pressure sensor amongst other things.",
    "Since this is a Mediatek-powered smartphone, you also get DuraSpeed - which reduces resources for apps running in the background - and Smartlock which keeps your device unlocked when it is safe with you by recognising physical signals.",
    "Let’s start with the biggest rival to the Armor 7, the Doogee S95 Pro which on paper seems to be a better buy. It sells for about the same price with a smaller battery but makes up for it with a unique magnetic modular design that allows you to attach accessories to it. Shame that these include only a speaker and a battery pack.",
    "If your budget allows, then the AGM X3 should definitely be on your list. It sports a faster CPU, the older but still very capable Snapdragon 845. It has a smaller battery and lacks the sophistication of the cameras found elsewhere but its design is far more neutral and the X3 feels more like a rugged phone you’d have no qualms using outside of work.",
    "The BV9900 is billed as the most indestructible super camera rugged smartphone ever and has a price tag to match that at just under $500. On paper though, it is a different story; the price premium is not justified as it uses the same camera and the same processor as the Armor 7 and the S95 Pro. It has twice the internal storage though but is it worth a 40% premium?",
    "More of an evolution than a revolution, the Armor 7 has nudged the limits of what has been achieved when it comes to ruggedised devices. It is not a true flagship product; the AGM X3 has a much faster processor despite being launched in 2018.",
    "Commercial imperatives and a price sensitive market means there’s almost no chance of having a Qualcomm Snapdragon 855 for example in a device from Ulefone or Blackview or Doogee. But all is not lost, MWC 2020 will likely see some major announcements regarding the successor of the Helio range with accompanying handset unveilings.",
    "Back to the Armor 7 though, it is a handset that fulfills all the main expectations one would have had from a top-end rugged smartphone. Looks the part, feel sturdy, has a big battery and a few gadgets. It is very well priced against the competition and overall, performs as expected. A big thumbs up from us."
  ],
  "headers": {
    "1": "Design",
    "8": "Hardware",
    "13": "Performance and in use",
    "16": "Competition",
    "19": "Final verdict"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "BV9900": "https://www.techradar.com/news/a-cheap-8gb-ram-waterproof-smartphone-with-256gb-storage-just-went-on-sale",
    "S95 Pro": "https://www.techradar.com/reviews/doogee-s95-pro-rugged-smartphone",
    "MWC 2020": "https://www.techradar.com/news/mwc-2020-is-cancelled-everything-you-need-to-know-about-what-happens-next",
    "5G chipset": "https://www.techradar.com/news/mediatek-mt6885-5g-chipset-to-be-unveiled-on-november-26",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "Doogee S95 Pro": "https://www.techradar.com/reviews/doogee-s95-pro-rugged-smartphone",
    "AGM X3": "https://www.techradar.com/reviews/agm-x3-rugged-smartphone"
  }
}