{
  "source": "https://www.techradar.com/reviews/easy-hide-ip-vpn",
  "title": "Easy Hide IP VPN review",
  "category": "computing",
  "updated": "2020-12-04T11:30:31Z",
  "author": "sead-fadilpasic",
  "summary": "Excellent speeds in Europe; in the US... not so much",
  "verdict": "Easy Hide IP is a very good VPN provider, at least if you’re using it for streaming BBC iPlayer, browsing, and torrenting on servers that aren’t on a different continent than you. If you’re in Europe and want to watch some US-only Netflix content, you might not be able to do so due to some exceptionally low speeds. That said, Easy Hide IP is very reasonably priced and has some of the simplest and most straightforward apps in the business.",
  "pros": [
    "Affordable",
    "Excellent speeds in Europe",
    "Can unblock Netflix US, BBC iPlayer",
    "Supports torrenting"
  ],
  "cons": [
    "Disappointing US speeds",
    "PayPal isn’t working",
    "No native apps except for Windows"
  ],
  "article": [
    "Easy Hide IP provides the usual VPN experience - private browsing, torrenting, access to geo-restricted services, and good speeds, albeit not for the servers on different continents.",
    "The shortest possible subscription is renewed on a monthly basis and costs $5.95/month. It is followed by the annual subscription at $3.95/month and the 24-month option at $2.77/month, placing this provider among the cheaper crowd on the VPN market.",
    "No matter which subscription length you opted for, you’ll be able to run up to 5 simultaneous VPN connections on your devices. There’s no free trial, but each plan is covered by a no-questions-asked 7-day money-back guarantee, which counts as a free trial in our book.",
    "Customers can pay for their subscriptions using credit cards, PayPal, Perfect Money, and cryptocurrencies including Bitcoin, Ethereum, Litecoin, Monero, and others. That said, when we tried paying via PayPal, we received an error message (not because of anything from our side).",
    "When paying, you can choose whether you want it to be a one-time purchase or a recurring one, which is another advantage in our book, since it’s a rare option in the VPN industry and puts the control over your payments into your own hands.",
    "Some VPNs on the market had complaints from customers who canceled their accounts but the VPNs in question never canceled their recurring payments so they had to communicate this with their banks and then request refunds for the paid but unused service. With Easy Hide IP, this potential problem can be avoided.",
    "Easy Hide IP certainly has its advantages, but none of them can place it among the industry’s top players (yet). For instance, ExpressVPN and NordVPN both boast superior speeds, 24/7 live chat, thousands of servers, and very generous money-back guarantees, even though they are more expensive.",
    "Some are even cheaper than Easy Hide IP, in addition to providing a more advanced service - Surfshark offers its 2-year subscription at the price of $2.49/month, while CyberGhost goes as low as $2.25/month for 3 years of its service.",
    "Easy Hide IP can not only unblock popular streaming services like Netflix US and BBC iPlayer, notorious for restricting access to its content on specific geographical areas, but it also has specialized servers for these purposes. That said, the speeds were so low for us on the Netflix servers that HD streaming was impossible. The BBC iPlayer server, however, performed very well.",
    "The company operating Easy Hide IP VPN is called Edelino Commerce and is located in the Seychelles, outside of any jurisdictions that might be overly inquisitive about your online activities or demand that VPNs retain your sensitive information. It provides access to 5,000 IP addresses, 150+ VPN servers in over 32 countries including Panama, Argentina, Russia, Japan, Iceland, India, and others.",
    "Easy Hide IP supports torrents and P2P networks, although not on all of its servers (the list can be found in the client dashboard once you sign up). Your privacy during torrenting and other online activities is preserved with the help of OpenVPN (TCP/UDP), PPTP, L2TP, and Easy Hide’s proprietary Classic protocol, which can only be used on a Windows PC.",
    "According to the VPN vendor, the Classic protocol provides more features than others, including being able to choose which of your apps will be directed through VPN servers. The vendor also adds that it is more flexible and can work where other protocols are blocked.",
    "The vendor’s Privacy Policy doesn’t offer many details about what is and isn’t logged, except in one part, where it says that it will “NEVER keep online activity logs or store private information about individual user activities on our network. Information regarding payments may be logged, as per payment processor regulations.”",
    "More details would’ve been nice, or even better - an independent audit that would analyze its no-logging policies and issue a public report, which is something that its more famous competitors have started introducing.",
    "This VPN company has a straightforward and simple app for Windows. Other platforms, including Mac, iOS, Android, Ubuntu, Debian with Gnome 1, Synology NAS, routers, are supported through manual installation via PPTP, IKEv1, L2TP, IPSec, OpenVPN, Stunnel, and WireGuard, configurations files you can download off the website, as well as third-party apps like Tunnelblick, OpenVPN Connect, and OpenVPN GUI.",
    "All the installation manuals are available on the website, as are the answers to frequently asked questions, but if you need more help than what the website can offer you, you can contact customer support directly via web form or email. There’s also an online chat option on the website, although it’s not live.",
    "Immediately after we started using it, the app recognized our device didn’t have the OpenVPN TAP driver needed for its use and offered to install it, which was a very good sign, considering not many VPN apps are capable of this, at least not in our experience.",
    "In addition to being very simple to use, the app also had a few surprises, such as allowing you to choose the IP address you wanted for each server, adding servers to favorites, and checking out the connection log.",
    "We conducted our speed tests on an 84.55Mbps testing connection, and the first location we chose was Prague, the Czech Republic. The results for this server were downright amazing - reaching almost 60Mbps, which isn’t something we see every day.",
    "Then we tested a server in the UK, specially purposed for accessing BBC iPlayer. The results were great - 28.84Mbps, but only on OpenVPN-UDP protocol, as others wouldn’t even connect to our speed test.",
    "The next target location was East Coast US, specifically New York. We expected lower results for this location since it wasn’t on the same continent as us, and we were right to do so. In fact, they were so bad, we couldn’t even connect to the speed test and the connection kept breaking.",
    "We did manage to get some results from the US-Netflix-East server when we switched the protocol from OpenVPN-UDP to OpenVPN TCP, but they were quite disappointing - only 2.6Mbps. We also gave the West Coast US a chance (using UDP) and, surprisingly, it did better, but still low - 5.8Mbps.",
    "Finally, we reached a more exotic location - India. The speeds there were expectedly lower than in Europe, but better than in the US - 10.05Mbps, which is considered a good speed considering India is very far away from our physical location.",
    "Depending on what you need a VPN for, Easy Hide IP can be either amazing or slightly disappointing. Namely, if you want a service that will protect your privacy online, give you top speeds on servers relatively near you, for browsing, torrenting, as well as for access to BBC iPlayer, then you’ll get it.",
    "However, if you’re in Europe and trying to gain access to the Netflix US content, you might be faced with speeds that are less than ideal for HD streaming, in addition to poor connection stability. This is where the industry heavyweights such as ExpressVPN perform much better."
  ],
  "headers": {
    "1": "Price",
    "6": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "10": "Privacy and encryption",
    "14": "Support",
    "16": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "Easy Hide IP": "https://easy-hide-ip.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "privacy": "https://www.techradar.com/best/anonymous-browsing",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "Privacy Policy": "https://easy-hide-ip.com/privacy_policy",
    "WireGuard": "https://www.techradar.com/vpn/what-is-wireguard",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-2735408267192974000"
  }
}