{
  "source": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
  "title": "Oppo Find X2 Pro review",
  "category": "phones",
  "updated": "2020-11-06T10:14:23Z",
  "author": "tom-bedford",
  "summary": "Top specs with a top-end price tag",
  "verdict": "The Oppo Find X2 Pro is a fantastic smartphone – from its design to its software and features, it exudes premium-ness, and it feels a treat to use. The display in particular is top-end, with a few features which beat out the competition, and it also seems that Oppo is taking strides in creating a truly great post-processing system for photos. You’re really paying for all these great features though, with a price tag that’s just as high-end as the tech, and that may limit its appeal.",
  "pros": [
    "Beautiful display",
    "Feels great to hold",
    "Takes good-looking pictures"
  ],
  "cons": [
    "Very pricey phone",
    "Battery life is just okay",
    "No wireless charging"
  ],
  "article": [
    "In 2019 Oppo released the stylish Reno 10x Zoom, but the company has managed to make that phone look comparatively boring in 2020 with the Oppo Find X2 Pro, which sets a new high bar for good-looking phones from the company.",
    "The Oppo Find X2 Pro is a slightly-specced-up sibling to the Oppo Find X2, which in turn is a successor to the Find X from 2018. Oppo seems to have maxed-out almost every feature of its new phone, from the display and camera tech to the sleek design, making it a true premium contender to rival the OnePlus 8 Pro or Samsung Galaxy S20 Plus.",
    "The display is perhaps the key selling point of the phone, with a big size, high resolution and fast refresh rate, and a few other pieces of tech that make it one of the best screens you’ll find on a phone right now. These good looks are mirrored in the design: this is a sleek phone with a curved screen and a back made of either ceramic or a faux leather leather.",
    "Oppo is making strides in the camera department too, combining top hardware (including some of the proven tech from its previous devices) with software that’s coming close to rivalling that of Samsung’s or Apple’s in terms of post-processing and optimization smarts.",
    "In fact it’s pretty hard to think of any obvious drawbacks to this phone – other than its price, which will shock people who know Oppo for its mid-range and budget handsets. The display tech can drain the battery rather quickly, and there’s no wireless charging, but these are drawbacks that many users won’t care about, if they notice them at all.",
    "The Oppo Find X2 Pro, then, is Oppo’s magnum opus, and the handset that will represent the company with distinction when the dust settles on 2020 and we compare the year’s flagships.",
    "Editor’s note: We were unable to test the Oppo Find X2 Pro’s 5G capabilities due to the coronavirus lockdown prohibiting travel to 5G-connected areas. However, 5G speeds depend more on the network than the device, so 5G performance isn’t necessarily an indication of a phone’s capabilities. We also only had limited opportunity to test certain camera features.",
    "The Oppo Find X2 Pro came to the UK and some other countries in June 2020, and we’ve been told that it’ll be released in Australia too. We haven’t heard if it’ll be released in the US too, but since Oppo phones haven’t previously been released in the States, we’d expect that to be the case here too.",
    "As we’ve noted, The Oppo Find X2 Pro is a pricey phone, and you’ll pay £1,099 / AU$1,599 (about $1,450) for the privilege of owning it. For context, the Oppo Reno 10x Zoom was a lot cheaper at £699 / AU$1,199 (about $889), and that was the most top-end Reno phone when the Find X2 Pro was launched.",
    "That makes the Find X2 Pro phone pricier in certain regions than the OnePlus 8 Pro, which costs $999 / £899 (around AU$1,700) for its priciest variant, and the Huawei P40 Pro, at £899 / AU$1,599 (around $1,100).",
    "The Oppo Find X2 Pro is a fairly large phone, as its dimensions are 165.2 x 74.4 x 8.8mm, however as those dimensions show it’s pretty long and thin, so it doesn’t feel too big. Well, those are the measurements of the ceramic version of the phone, but you can also get it in a faux leather finish, which is slightly thicker at 9.5mm.",
    "This is the version we tested out, and it feels truly premium, as it’s easier to grip and more comfortable in the hand than the typical glass most devices are made of.",
    "The ceramic version of the phone has a black rear, whereas the faux leather model is orange with gold highlights. Our review handset was the latter version, as pictured, and we think it looks pretty stylish. There’s also a gray faux leather Lamborghini Edition if you want your phone bedecked in car logos, although we couldn’t actually find which regions this is available in.",
    "While the faux leather version is thicker than the ceramic version it’s also 17g lighter, at 200g.",
    "On the back of the phone is a fairly long, but not particularly prominent, camera bump housing the lens array. On the right-hand edge of the device are the volume rocker and power button, while the USB-C port is on the bottom – there’s no 3.5mm headphone jack here, which may irk users of wired headphones.",
    "For a phone of this size, the buttons are fairly low down on the side, making them easy to reach no matter how large or small your hands are.",
    "The phone is IP68 protected, so it’s safe from dust and water to a high degree.",
    "The Oppo Find X2 Pro display is top tier, with a 6.78-inch display packed full of features to enhance your viewing experience. Between its 3168 x 1440 UltraHD resolution, 10-bit color, 120Hz max refresh rate and high 800 nits max brightness, content reliably looks fantastic, whether you’re gaming or watching movies, or just scrolling through social media.",
    "On paper, it seems like that display is the same as the OnePlus 8 Pro’s, as the refresh rate, resolution and size are all identical, and it’s likely no coincidence that both Oppo and OnePlus are owned by the same parent company, and often share manufacturing facilities. However the Oppo Find X2 Pro has a few extra tricks up its sleeves in terms of optimization.",
    "Oppo’s O1 Ultra Vision Engine chipset can automatically upgrade video to 120fps (to match the screen rate) when you’re using various video streaming sources, and the phone also packs tech similar to Apple’s True Tone display, which adjusts the color and brightness of a screen depending on the ambient lighting. These two pieces of software really improve how the screen shows content, and make the screen easier to see in a range of environments.",
    "A divisive element of the display may be the fact that it’s curved, more so than on other curved-edge phones, as it falls away rather dramatically at the edges of the display. Not all phone users are fans of curved displays, but we rarely had problems with accidentally pressing the display with parts of our hand, so it seems there could be accidental touch protection tech at play here.",
    "The screen is broken up by a small punch-hole cut-out in the top left corner, as is the style on a plethora of 2020 flagships. If you don’t like curved screens or punch-hole cameras, the Oppo Find X2 Pro may not be for you, but otherwise the phone has one of the best displays you’ll find on a smartphone right now.",
    "On paper, the Oppo Find X2 Pro has weaker camera specs than some of its premium competitors, but peer behind the veil – and start using the thing – and you’ll discover that there’s more at play here.",
    "Oppo seems to be imitating Samsung and Apple phones to a certain extent, as while those devices usually stick with relatively low-resolution sensors, they have software that elevates the quality of images – that’s the case here, and the post-processing really seems to get the job done.",
    "The main camera here is a 48MP f/1.7 snapper, which might sound low-res compared to the 108MP sensors you’ll find in certain other phones; however this camera is Sony’s IMX689, which has the physically largest sensor of any 48MP snapper so far, and the Find X2 Pro is the first phone to debut this tech.",
    "The benefit of a large sensor is that the individual pixels, or photosites, can be physically larger, which in turn means the sensor can gather more light, resulting in pictures that are brighter and have stronger colors – and this is certainly the case with pictures taken on the Oppo Find X2 Pro’s main shooter.",
    "They’re bright and bold, with pictures taken in low-light conditions hardly showing the noise that these types of images generally suffer from, and photos snapped in full light looking glorious – and the night mode is one of the best we’ve seen outside Google’s and Apple’s product lines.",
    "If we had to note a downside to the camera, it would be that the autofocus perhaps isn’t as snappy as it is in other smartphone cameras, and it could occasionally be indecisive as to what it was going to focus on. This was a minor drawback though, and something we only encountered occasionally, depending on what we were photographing.",
    "The second camera is a 13MP f/3.0 periscope telephoto snapper, and it’s the same as the one on the Oppo Reno 10x Zoom (which is where that phone gets its name). This provides 5x optical, 10x hybrid and 60x digital zoom.",
    "Zooming in with the Oppo Find X2 Pro will result in pictures that aren’t as fuzzy or noisy as zoomed shots from competing phones – sure, pictures sometimes can look a bit grainy, especially when you’re using the digital zoom, but this is one of the best cameras we tested for optical and hybrid shots. Pictures that were zoomed in looked almost indistinguishable from those taken at 1x zoom, except of course they were taken using the lower-res sensor.",
    "The third snapper on the back is a 48MP f/2.2 ultra-wide, which is a very high-res sensor for an ultra-wide lens, though it’s not the same sensor as the main camera. Pictures taken with this showed very little distortion, which isn’t generally the case with ultra-wide smartphone shots – and, more importantly, there wasn’t much difference in color quality between wide-angle shots and those from the main camera.",
    "Sometimes, pictures taken with an ultra-wide camera can look paler or, alternatively, much bolder than those from the main camera it’s paired with. That’s not the case here, so you can switch between snappers without worrying how your pictures will turn out colors-wise.",
    "There’s no depth-sensing or macro camera here, but the absence of the latter is made up for with a macro mode on the ultra-wide camera, which automatically snaps on when the device senses that the subject is very close.",
    "Auto macro mode could be useful to save you from manually having to switch the mode, but when it’s activated you’re switched from the main camera (which you’ll likely have been using) to the ultra-wide one; this would mean the framing of the close-up subject would be changed, which sometimes meant we had to to re-frame the picture, which could be irritating. We’d appreciate the ability to disable automatic macro mode, but there doesn’t seem to be any such setting.",
    "The Oppo Find X2 supports video capture up to 4K, at 30fps or 60fps. There’s no 8K recording, unlike on some top-end rivals, but since few people can actually view 8K video, that’s no big loss. Video quality is good, thanks in particular to some supreme image stabilization tech that lets you track subjects with barely any shaking or wobbling.",
    "On the front of the device is a 32MP f/2.4 camera, which took selfies that looked bright and bold. However, when we took pictures in Portrait mode, the post-processing felt quite overzealous in blurring the background and saturating the picture, to the point where the resulting image looked rather unnatural. We much preferred pictures taken in the standard mode.",
    "The Oppo Find X2 Pro has a 4,260mAh battery, which would normally be pretty standard for a premium smartphone; however, the aforementioned screen tech seems to take its toll, and battery life isn’t fantastic as a result.",
    "Generally, with light use, the phone would last us around a day, although if we were to push it to its limits and game with it, or spend lots of time enjoying the 120Hz scrolling through social media, or shoot a lot of video, then we’d need to charge the phone part-way through the day.",
    "The Oppo Find X2 Pro’s charging speeds make up for its shortcomings in terms of stamina though – the company’s 65W VOOC charging system is startlingly snappy, and at the time of writing it’s the fastest charging speed available on a phone, matched only by another Oppo handset.",
    "When we charged the phone for just 20 minutes from empty it got to 74% power, and it was fully charged after only 35 minutes. The phone didn’t get very warm in this time either, as other phones with fast-charging systems can. It seems, then, that the Find X2 Pro is a great choice for people who just want to top their phone up now and again, rather than having to plug it in for extended periods.",
    "There’s no wireless charging here, however, which is surprising given that almost all top-end smartphones offer this feature, and is likely down to the phone’s rear material given faux leather or ceramic doesn’t conduct power as well as glass. This is perhaps the most glaring hole in the Find X2 Pro’s line-up of features.",
    "The Oppo Find X2 Pro lives up to its ‘premium smartphone’ billing in the specs and performance department, as the phone is packed with the very best internals that were available when it launched.",
    "The chipset is the Snapdragon 865 from Qualcomm, the top processor available to Android phones at time of release, and which is also found in the OnePlus 8, Xiaomi Mi 10 and certain Samsung Galaxy S20 units (depending on region). This is teamed with 12GB RAM, the most you’ll find on any non-Samsung phone.",
    "When we put the Oppo FInd X2 Pro through a benchmark test it returned a multi-core score of 3295, which is high for an Android phone. In fact, that score beats the Samsung Galaxy S20 Ultra and Xiaomi Mi 10 Pro, with only the OnePlus 8 Pro, Motorola Edge Plus and iPhone 11 devices achieving better results.",
    "This shows the Oppo phone has some top-tier processing speeds, and our experience with the phone backs this up: apps were quick to load, top-end games ran with no issues, and we were able to record plenty of 4K video without the phone chugging. So it seems that whether you’re looking for a great gaming phone, or a handset that will enable you to capture and edit impressive looking videos or photos on the fly, the Find X2 Pro would be a great option.",
    "The chipset is paired with a 5G modem, making this Oppo’s joint-second 5G phone after the Oppo Reno 5G (joint with the non-Pro phone). Most recent top-end smartphones are 5G-compatible, so this isn’t exactly groundbreaking, but if you’re buying a new smartphone in 2020 it makes sense to pick up a 5G model if you want something future-proof.",
    "The phone runs the latest Android 10 operating system, with Oppo’s custom ColorOS UI laid over the top. The main differences here are aesthetic, and whether you prefer this UI to another will be down to personal taste.",
    "Unlike most other third-party UIs, ColorOS lets you customize the shape of icons as well as their size, as well as the background layout and other elements, which is a neat addition that we appreciated.",
    "Other perks include an always-on display that’s more vibrant than those on some other devices, snappy gesture navigation, and a useful real-time network speed indicator in the notification bar that lets you see how fast your internet connection really is. There’s also barely any bloatware – we wish Xiaomi would take a leaf out of Oppo’s book here.",
    "Something worth noting if you regularly use your phone entertainment is that the Oppo Find X2 Pro has dual stereo speakers, one down by the USB-C port and another at the top of the screen. This audio setup makes gaming, listening to music and watching content a treat, and the speakers are pretty good quality, although not as good as those on certain competitors, and at top volumes they could sound a little tinny.",
    "First reviewed: June 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Oppo Find X2 Pro price and availability",
    "10": "Design",
    "17": "Display",
    "22": "Camera",
    "36": "Battery life",
    "41": "Performance and software",
    "50": "Don't buy it if:"
  },
  "links": {
    "Reno 10x Zoom": "https://www.techradar.com/reviews/oppo-reno-10x-zoom-review",
    "Oppo Find X2": "https://www.techradar.com/reviews/oppo-find-x2-review",
    "Find X": "https://www.techradar.com/reviews/oppo-find-x",
    "OnePlus 8 Pro": "https://www.techradar.com/reviews/oneplus-8-pro",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "Oppo phones": "https://www.techradar.com/news/best-oppo-phones",
    "Huawei P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung phone": "https://www.techradar.com/news/best-samsung-phones",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Xiaomi Mi 10 Pro": "https://www.techradar.com/reviews/xiaomi-mi-10-pro-review",
    "Oppo Reno 5G": "https://www.techradar.com/reviews/oppo-reno-5g",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}