{
  "source": "https://www.techradar.com/reviews/vivavideo",
  "title": "VivaVideo review",
  "category": "computing",
  "updated": "2020-10-23T15:49:57.268Z",
  "author": "steve-paris",
  "summary": "Edit on the go with a clever interface",
  "verdict": "A very good app with some limitations (unless you fork out for the subscription), which can help you create elegant short videos with ease.",
  "pros": [
    "Elegant interface",
    "Very intuitive",
    "Feature rich",
    "Works on iOS and Android"
  ],
  "cons": [
    "The 3-day trial feels a little short",
    "Can’t buy the app outright"
  ],
  "article": [
    "Using a video editor on the go is incredibly freeing. You can shoot something, edit it, and share it almost instantly. There are numerous apps that offer this functionality, and the one we’re exploring here is VivaVideo, available (mostly) for free for Android and iOS.",
    "You’ll notice that the interface only works in portrait mode. This allows you to preview your edit at the top and have all your tools available on the lower part of the interface.",
    "Once you’ve given permission for VivaVideo to gain access to your camera roll, you can add as many clips as you’d need in one go. There is however a limit with the free version: you can’t create a movie longer than 5 minutes.",
    "The interface makes it remarkably easy to edit a short film. You can pinch to zoom in for precision work, swipe to move back and forth along the timeline, etc.",
    "The tools you need, like trim, split, delete, are easily accessible. You can also rotate a clip and zoom into it, but bizarrely those two tools are hidden away in the ‘Canvas’.",
    "The Canvas menu is actually where you get to select your project’s dimensions. By default it takes on the dimension of the first shot you import into it, but you can alter it at any time. You options are 1:1, 4:5, 4:3, 9:16, 16:9, 3:4 and 2.39:1. You can also switch between these at will.",
    "Other tools include the ability to alter the speed of a clip or an entire project, reverse your footage, rotate it or duplicate it, mute it, or alter the volume (up to 200% of the original).",
    "The Sort tool is there should you need to reorder your clips. It makes it really easy to grab some video and move it to another location through that interface.",
    "We were quite impressed with the number and quality of transitions available, the vast majority of which are free. The rest are only available to ‘VIP’ members (more on that later).",
    "There is a Voice Changer sound effect, but we felt this was the weakest part of the entire app. The results of all the default options were really poor with the clips were tried it with, to the point that it just felt like a gimmick. There is a ‘Custom’ option which shows promise, however this is only for VIP members.",
    "The Colour Correction tools are also only available to VIP members, and although you are free to try them out, your changes won’t be preserved unless you upgrade your membership.",
    "You’ll notice that your project has a ‘VivaVideo’ watermark applied to it lower right of the screen which cannot be removed, nor can you add a different type of watermark, even in addition to that one, unless, you’ve guessed it, you become a VIP.",
    "As you’d expect, adding text boxes is also included in the package. You have a choice of fonts, colour, styles and we really liked the way you can resize, rotate and move those boxes around the canvas: with the gestures you’re used to when manipulating your phone screen: pinch, grab, turn, it’s all incredibly easy and intuitive.",
    "You can also add animated stickers to your project. These include animated GIFs and emojis, which can be controlled exactly like the text boxes above.",
    "There is an option to keyframe these stickers and text boxes, so you can move them across the screen over time, but this is a VIP privilege.",
    "And in addition to all of this, you also have access to filters and effects. Just like everything else, you need to download them before you can use them, and they can be applied to specific clips or to your entire project, as easily as every other feature in this app.",
    "So, what’s the deal with all these VIP options?",
    "Obviously developers need to eat, and providing a free app doesn’t put food on the table, so in order to entice people to shell out, they’ve peppered VivaVideo with numerous bonus features which can only be accessed by upgrading, as we’ve seen.",
    "In addition to all of these bonus features, going VIP will also allow you to remove that VivaVideo watermark, get rid of those pop up ads, and enable you to create projects longer than 5 minutes.",
    "All in all, it’s quite tempting.",
    "But there is a catch though: you can’t purchase the app outright - you need to get a subscription.",
    "You’re offered a free 3-day trial to check it all out (you’ll then be charged $2.60 (£2.04) per month - billed yearly, so $31.60 (£24.48)), or if you’d rather pay each month, that will set you back $6.50 (£4.99) - per month.",
    "This can be viewed as an expensive mobile app, but you can stop paying at any time, and you will then only lose access to those VIP tools. We do feel however that a 3-day trial period is a little short.",
    "We were very impressed by VivaVideo. For an app that is mostly free, it offers a serious amount of features, many of which are extremely well implemented. We even liked the mini tutorials that pop up when you first use a tool to explain to you how they work. It’s a shame the VIP section is subscription only, but if you’re serious about making movies on the go, it’s definitely an app worth checking out."
  ],
  "headers": {
    "1": "Import",
    "3": "Edit",
    "12": "Text, filters and effects",
    "16": "VIP",
    "23": "Final verdict"
  },
  "links": {
    "video editor": "https://www.techradar.com/best/free-video-editing-software",
    "VivaVideo": "https://vivavideo.tv/"
  }
}