{
  "source": "https://www.techradar.com/reviews/ironsocket",
  "title": "IronSocket VPN review",
  "category": "computing",
  "updated": "2020-12-04T18:25:50.304Z",
  "author": "sead-fadilpasic",
  "summary": "Stream and torrent all you like",
  "verdict": "IronSocket is a small, yet powerful VPN platform that certainly has a bright future. Not only does it provide access to all sorts of video and audio streaming channels, supports torrenting, but it also does this at very good download speeds. Its only disadvantages are the small number of servers, lack of live chat customer support, and no clients for platforms except Windows, all of which can be easily fixed.",
  "pros": [
    "Customizable kill switch",
    "Unblocks Netflix, BBC iPlayer, more",
    "Allows torrenting"
  ],
  "cons": [
    "Limited server network",
    "Native client only for Windows",
    "No live chat"
  ],
  "article": [
    "IronSocket is a VPN service whose story begins with the creation of the website “HideMyNet.com” in 2005. It was at that time that the people behind it “began building the VPN and DNS Proxy technologies necessary for our users to surf the Net anonymously, and unblock censorship filters, regardless of their location.”",
    "In early 2003, they started working on rebuilding the platform and VPN server infrastructure to create a more powerful service with more servers around the world and upgrade their network performance.",
    "Today, the service offers excellent download speeds, unblocks popular streaming channels, supports torrenting, offers a few extra features, and accepts multiple payment methods. However, it still has a lot of work ahead if it aims to someday be listed among the industry’s best VPN providers.",
    "If you want to entrust this vendor with your online privacy, you can choose among several pricing plans. As always, there’s a 1-month subscription as the provider’s most expensive solution - at $6.99/month (yet still rather cheap in comparison to many).",
    "It is followed by the 6-month option at $35.95 (equals to $5.99/month) and a 1-year package at $49.95 (equals to $4.16/month), placing this provider somewhere in the middle of the VPN pricing range.",
    "The website states you can run “3+ VPN and Proxy Connections” at the same time. This means that the above prices refer to three VPN and three IP slots, while you can pay more if you need more VPN connections and IP slots - four, six, or eight. For instance, if you want four simultaneous VPN and proxy connections, you’ll have to pay an additional $1.50/month. If you want six concurrent VPN connections and six IP slots, you’ll pay an additional $3.00/month. Finally, eight simultaneous VPN connections and eight proxy connections will cost you an additional $4.00/month.",
    "Users are welcome to pay using PayPal, credit cards, gift cards, or Bitcoin. If you’re worried about the provider not being up to your standards, its 7-day money-back guarantee should put your mind at ease. However, this isn’t a long period in this business, especially considering that some competitors offer 30 or even 45 days of refund guarantee.",
    "IronSocket is an impressive little VPN vendor but it certainly has its disadvantages. One of them is the small number of servers and the other is its disappointingly short money-back guarantee. Namely, while this provider only offers seven days before you can change your mind and request a refund, ExpressVPN gives you 30 days, and so do NordVPN and Surfshark.",
    "CyberGhost does even better, offering a 45-day money-back guarantee on all of its plans. Needless to say, all of these top-tier providers feature vast server networks counting thousands of units in all corners of the world.",
    "Thanks to its Smart DNS Proxy, IronSocket allows you to stream certain VOD services that might not be available in all regions, including Netflix, BBC iPlayer, Hulu, HBO Now, and more. Using a DNS proxy alone doesn’t route your connection, so it will have a minimal effect on your connection speed.",
    "IronSocket is owned and operated by a company called Pusa and Daga Hong Kong Limited, based in Hong Kong. The company has over 90 servers in 40 countries around the world, including in Hong Kong, Iceland, Saudi Arabia, Russia, the US, Egypt, Cyprus, and others. About 300 IP addresses are available on its VPN platform, while its DNS service has access to 2,000 IP addresses.",
    "To provide ultimate privacy for its users, IronSocket uses SSL VPN and IPSec VPN servers, DNS proxy, HTTP proxy, and Socks5 proxy. It also uses standard connection protocols, including OpenVPN and PPTP.",
    "If you’re running the OpenVPN protocol, the service will utilize RSA 4096-bit keys and military-grade AES-256 encryption. The PPTP protocol is slightly less secure, with its 128-bit encryption over ‘GRE’ Protocol #47.",
    "IronSocket also provides strong privacy protection for anyone into torrenting and P2P file sharing via clients like uTorrent, qBittorrent, and others. Do note, however, that not all of the provider’s servers are P2P-optimized.",
    "One of the additional options and tools you can tinker with in the Windows app is a “drop protection”, which is typically called a kill switch since it “kills” your entire Internet access whenever the VPN connection drops, preventing your real location from being discovered by third parties. Unlike many of its competitors, IronSocket also allows you to select the apps you want to automatically shut down in case of a VPN connection interruption.",
    "You’ll also be able to turn on/off the DNS leak protection, select a VPN protocol, tinker with the protocol-specific settings (like the encryption level for OpenVPN and a maximum transmission unit for L2TP/PPTP), enable DNS proxy, and more.",
    "As for its no-logs policy, IronSocket details it in its privacy policy, where it states that it only collects the minimum data needed to provide its service, manage your account, and protect itself from fraud and abuse. In short, it claims not to “log or record in any manner the content you access while using our Services”.",
    "Further down in the privacy policy, we discover that the session information collected during the use of its VPN includes “time and date of the session connection and disconnection, the IP address used for the session and which server was connected to, and a numerical representation showing total bytes transferred per session.” This is more logs than we had hoped, but IronSocket doesn’t hold on to them for long - typically 72 hours, “after which it is purged from our servers.”",
    "The page adds that “the Company cannot (by system design) disclose IP addresses of websites visited or information about applications, services and websites accessed by any users while connected to our virtual private network service because we DO NOT log or store this information”. This is good to hear, but an independent audit report would be even better.",
    "IronSocket only has a client for Windows, but can also be installed on Windows, Mac, Linux, Android, iOS, streaming boxes, game consoles, routers, and smart TVs with the help of third-party software like Tunnelblick and OpenVPN Connect and/or configuration files. If you’re using Windows, you can download the IronSocket EasyVPNConnect Installer that makes the whole installation process a tad simpler.",
    "Should you require installation on any of the platforms for which the provider doesn’t offer apps, you’ll be able to get it done with some guidance available in the website’s support section. This part of the website is quite rich in useful information, but if you still need some assistance, you can contact the customer support directly via email, support ticket, or web form. Unfortunately, there’s no live chat.",
    "To see how well this provider performs, we first tested its download speeds when connected to a server relatively close to our physical location, and we picked Italy. The results were excellent - 20Mbps on a 65Mbps testing connection.",
    "Expectedly, the download speeds weren’t as good the further away we went from our location but still very good in comparison to many of the competitors. Specifically, a server location in US Central gave us a very usable 12Mbps. We also wanted to test the speeds to some of the more exotic locations, like India, which got us a surprisingly good 9Mbps.",
    "As long as you’re using the provided Windows client, you won’t have absolutely any difficulties. The app is very straightforward, ideal for beginners, but also has some additional customization options for VPN professionals. As for the other supported platforms, beginners might struggle since they’re not used to VPN providers available through third-party clients. However, with the help of the website, everyone will eventually manage to connect.",
    "IronSocket got our attention not only with its promises but also with its remarkable execution. It will unblock virtually any streaming service you set your eyes upon, allow you to share large files via torrenting/P2P clients via some of its servers, as well as provide some interesting extras in its Windows app. However, the lack of servers, native apps for other platforms, and live chat place it far down in the charts currently led by super-performers such as ExpressVPN."
  ],
  "headers": {
    "3": "Price",
    "7": "Alternatives",
    "9": "Streaming",
    "10": "About the company",
    "11": "Privacy and encryption",
    "19": "Support",
    "21": "Speed and experience",
    "24": "Verdict"
  },
  "links": {
    "IronSocket": "https://ironsocket.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "more": "https://ironsocket.com/channel-guide",
    "privacy policy": "https://ironsocket.com/privacy-policy",
    "support section": "https://ironsocket.com/support",
    "email": "http://support@ironsocket.com",
    "support ticket": "https://ironsocket.com/tickets",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-2279227169824333300"
  }
}