{
  "source": "https://www.techradar.com/reviews/acer-travelmate-p6",
  "title": "Acer TravelMate P6 review",
  "category": "computing",
  "updated": "2020-08-26T15:14:27Z",
  "author": "mike-jennings",
  "summary": "A brilliant selection of features and great battery life surprise inside a dull exterior",
  "verdict": "The Acer TravelMate P6 is packed with features, has tremendous battery life and enough power to handle daily workloads – but pricier rivals are faster, slicker and better-looking.",
  "pros": [
    "Loads of business features",
    "Class-leading battery life",
    "Solid components and connectivity",
    "Soft, comfortable keyboard",
    "Powerful enough for most work tasks",
    "Cheaper than many rivals"
  ],
  "cons": [
    "Screen is good – but not great",
    "Rivals have better performance",
    "Better keyboards and trackpads available",
    "Middling build quality and dull looks"
  ],
  "article": [
    "The Acer TravelMate P6 we’ve reviewed costs $1,399 (£1,299, around AU$2,400), which is a little less than most of its competitors, and it’s an impressive office machine in several key areas.",
    "It only weighs 2.4 pounds (1.1kg), which undercuts rivals like the LG Gram 14, Dell XPS 13 and Apple MacBook Air 13. It’s packed with features – it has good internal and external connectivity, MIL-STD-810G accreditation, TPM and a webcam with IR and a privacy shield, and it can be configured with even more hardware, like NFC support and SIM card compatibility. When it comes to business versatility, it’s better than every competitor.",
    "The Intel Core i7 processor delivers enough power to handle day-to-day work situations, from Office applications and loads of browser tabs to light photo-editing, and its Nvidia GPU is a little better than Intel’s integrated offerings. The screen quality is reasonable – and the touch functionality is a bonus – and the Acer has better battery life than any of its key rivals. If you’re careful with the screen brightness, this machine will last for two working days.",
    "In some areas, though, the Acer’s lower price does mean compromise. The screen is good enough for everyday work, but it doesn’t quite have the colour accuracy or gamut ability to handle colour-sensitive work tasks – the Dell or Apple machines are better. On the inside, several rivals offer significantly more CPU power, which means that laptops like the LG, Dell and Apple have more ability when handling multi-tasking scenarios and tougher work software.",
    "The machines from Dell and Apple have snappier, higher-quality keyboards and trackpads, too, and the Acer only has mediocre build quality and aesthetic design – it’s not overly robust and it looks a little underwhelming.",
    "Those issues mean that the Acer isn’t the right laptop if you need a machine with lashings of power, great-looking design, or a particularly sturdy chassis. Despite that, there’s certainly a place for this laptop. It’s powerful enough to work as a mainstream daily driver, and it has stellar battery life and loads of features alongside a reasonable price.",
    "The Acer we’ve reviewed costs $1,399 (£1,299, around AU$2,400), and it’s the most expensive version of the TravelMate P6 that’s currently available. If you’re based in the UK, it’s possible to save cash with a £1,099 machine that pairs an Intel Core i5-10210U processor and 8GB of memory with the 1TB SSD and Nvidia graphics core.",
    "American buyers have a little more choice. Models that cost $1,049 and £1,199 include 8GB of DDR4 and 256GB SSDs alongside different variations of Core i5 processor.",
    "Acer also says that models are on the way with different screen and graphics options – certain models will ditch Nvidia’s GPU hardware and abandon the touchscreen, presumably to bring prices down further.",
    "Acer’s machine tips the scales at 2.4 pounds (1.1kg), which is impressively light for a business laptop – better than most rivals. The 0.62in (16mm) thickness is decent, and barely any different from any of the market’s leading ultraportables. It can be slipped into a bag without making a dent.",
    "The dimensions are good, but the Acer isn’t as impressive elsewhere. Build quality, for instance: the TravelMate is made from magnesium alloy and its base is reasonably sturdy, but the screen flexes too much. At least it’s got MIL-STD-810G certification for high and low temperatures, drops, vibrations, humidity, and rain, which is the bare minimum for any decent business laptop.",
    "The Acer isn’t a particularly good-looking machine. The black metal is dull, the screen’s bezels are too wide and there are no stylish touches.",
    "The Acer’s key rivals outpace the TravelMate’s design in important areas. The LG Gram 14 looks better and is lighter, the Dell XPS 13 looks smarter and is slimmer, and the Apple MacBook Air is one of the best-looking laptops around. The Dell and Apple machines have better build quality too.",
    "The TravelMate’s keyboard is reasonable but, again, it’s another area where competitors improve. The Acer’s buttons have a fast and consistent action, and they’re soft, with a slightly crisper feel when they bottom-out. It’s easy enough to work for hours here, and the layout is decent, with a double-height Return key and separate Page Up and Down keys.",
    "The Dell and Apple machines are superior, though, with crisper buttons and quieter operation. The Acer’s trackpad is only middling, too – fine for day-to-day use, but with spongy buttons.",
    "The Acer’s Core i7-10510U processor is a 14nm Comet Lake chip with four Hyper-Threaded cores alongside base and boost speeds of 1.8GHz and 4.9GHz. It’s joined by 16GB of dual-channel memory, a 1TB SSD and a low-end Nvidia GeForce MX250 graphics core. Connectivity is handled by WiFi 6, Bluetooth 5.0 and Gigabit Ethernet.",
    "This machine has great business features. Around the edges the Acer has a single USB 3.2 Gen 2 Type-C port that supports DisplayPort, Thunderbolt 3 and charging, and there are two full-size USB 3.2 Gen 1 connectors with slower transfer speeds. There’s an audio jack, a Kensington lock slot and a microSD card reader. The HDMI 2.0 port is notable because it supports 4K output at a higher frame rates than the more common HDMI 1.4 standard. The 1080p webcam offers good quality, a privacy shutter and IR support, and the Acer also has TPM 2.0 and a fingerprint reader in the power button.",
    "It’s even possible to configure this machine with NFC, a smart card reader and SIM card support if you’re a business talking to Acer about larger deployments.",
    "The LG machine is similar when it comes to business additions, although its webcam doesn’t support IR and it doesn’t have a privacy shutter or super-fast USB 3.2 Gen 2. The Dell and Apple machines don’t have full-size USB ports and they miss out on hard-nosed office features like TPM, webcam privacy shutters and Gigabit Ethernet. There’s no doubt about it here – for office versatility, the Acer wins.",
    "The only negative is the audio gear. The Acer’s speakers have decent volume and the mid-range is relatively crisp, but bass is almost non-existent, and the top-end is tinny. They’re only suitable for casual media use.",
    "The Acer is fast enough to handle everyday computing – it’s smooth and responsive when zipping around Office apps and web browsers with loads tabs, and it’s powerful enough to tackle mainstream photo-editing. It’s only going to encounter issues if you try to run high-end database or video software – or if you want to run loads of work software simultaneously.",
    "It’s solid, but rivals offer more. In Geekbench the Acer returned single- and multi-threaded scores of 1,225 and 2,965, but the LG Gram 14 included a 10nm Intel Core i7-1065G7 that scored 1,330 and 3,494. That 10nm chip is also used inside the Dell, and a variant is used in some Apple machines, too – and, unsurprisingly, the Acer’s 14nm CPU also fell behind Passmark, CPU-Z and Cinebench. LG’s machine includes that faster Core i7 for a near-identical price to the Acer, although you’ll have to pay $1,399 (£1,599, around AU$2,159) to get that silicon inside the Dell and $1,449 (£1,449, around AU$2,149) to get a similar CPU inside the MacBook.",
    "The SSD’s read and write speeds of 3,545MB/s and 2,860MB/s are solid – easily good enough to keep the machine feel snappy and loading times swift.",
    "Don’t expect much from the Acer’s Nvidia GPU. Acer has used the weaker version of the MX250, which only has 2GB of memory, and it scored 3,421 in 3D Mark Fire Strike. That’s around 600 points more than the Intel Iris Plus integrated GPU included elsewhere, which means a modest boost to photo-editing tools and graphical applications – but it’s not transformative.",
    "The internals may not break speed records, but the modest hardware and battery deliver superb longevity. In PC Mark the Acer lasted for just over ten hours, and in our movie tested it lasted for a whopping fourteen hours and thirty-three minutes. Reduce the screen brightness and keep the applications light and you’ll see sixteen hours from this machine. It’s hours better than any rival.",
    "The Acer’s 14in touchscreen has a 1080p resolution, which is fine for everyday work. It’s matte, and viewing angles are good. The contrast ratio of 1,374:1 is easily good enough to provide great depth in darker areas and impressive vibrancy everywhere else – although the brightness measurement of 316cd/m2 means this machine isn’t bright enough for outdoor use. The Delta E of 2.48 is reasonable and the colour temperature of 6,717K is great, too – so colours are accurate.",
    "Those results aren’t quite good enough to handle colour-sensitive tasks, though, and the display only rendered 92.3% of the sRGB gamut and 67.7% of the Adobe RGB colour space. So, while this screen is easily good enough for day-to-day use and mainstream colour work, professionals who need pinpoint accuracy will have to look elsewhere.",
    "It’s better than the LG’s glossy panel, but the Dell and Apple machines are brighter and bolder, with more accurate colours and crisper resolutions."
  ],
  "headers": {
    "0": "Two-Minute Review",
    "6": "Price and Availability",
    "9": "Design",
    "15": "Hardware",
    "20": "Performance",
    "28": "Don't buy it if..."
  },
  "links": {
    "Acer TravelMate P6": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7747746785397417000&xs=1&url=https%3A%2F%2Fwww.acer.com%2Fac%2Fen%2FUS%2Fcontent%2Fprofessional-series%2Ftravelmatep6&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Facer-travelmate-p6",
    "business laptop": "https://www.techradar.com/news/best-business-laptops",
    "LG Gram 14": "https://www.techradar.com/reviews/lg-gram-14-2020-core-i7-10th-gen-laptop",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Apple MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-2019"
  }
}