{
  "source": "https://www.techradar.com/reviews/safevpn",
  "title": "SafeVPN review",
  "category": "computing",
  "updated": "2020-07-08T03:41:07Z",
  "author": "mike-williams",
  "summary": "A small VPN with some big claims, but are they really true?",
  "verdict": "SafeVPN's business plan appears to be, take the excellent Windscribe service, make it worse, and resell it for much more money. If you like its speed and unblocking performance, just sign up with Windscribe, you'll be much better off.",
  "pros": [
    "Easy to use",
    "Decent speeds in most locations",
    "Unblocks US Netflix, iPlayer, Amazon, Disney+",
    "24/7 phone and email support"
  ],
  "cons": [
    "Supports only 3 simultaneous connections as standard",
    "No mobile clients",
    "Deceptive website",
    "Overpriced after the first term"
  ],
  "article": [
    "SafeVPN is a VPN brand run by Network Connect, the company behind brands such as PrivacyWeb and UltraVPN.",
    "(There are several similarly named providers, but we're talking about the service based at SafeVPN.com, and not SafeVPN.net or SaferVPN.com.)",
    "The SafeVPN website makes the service sound like a full-strength security suite, with claims that it's 'the simplest way to stay safe online', and that it offers tracker-blocking and 'safe family browsing' with 'no complex parental controls to set up and maintain.'",
    "The network offers only 100 servers, but they're well spread across 60+ countries. The server names suggest they're owned by Windscribe, a positive sign as it's an excellent VPN.",
    "Some descriptions seem misleading, or confused. A claim to 'load videos and websites fast' makes it sound like SaferVPN will speed up your connection, rather than slow it down. And while the features page of the website says the service protects up to 5 devices at the same time, the front page says 3 (turns out the smaller figure is correct.)",
    "Headline prices look good, though mostly that's because there's an introductory discount. Monthly billing is $6.99 for the first month, $8.99 on renewal; this drops to $4.99 over 6 months, then $9.98 on renewal (yes, really - more expensive than the monthly plan); and although the first term of the annual plan looks cheap, at $2.99 a month, it jumps to $7.50 after that.",
    "What's more, this only gets you support for connecting up to three devices. You can upgrade to support unlimited devices for a further $2.92 a month over the first year, rising to $5.83 afterwards. By year two that means you might be paying $13.33 a month on the annual plan to cover unlimited devices.",
    "If you sign up direct with Windscribe, instead, you'll be able to access the same servers from unlimited devices for only $4.08 a month on its annual plan. Or if price is your top priority, Surfshark's two-year plan is a tiny $1.99 a month. Putting that into perspective, SafeVPN charges $125.87 to protect 3 devices for two years; Windscribe asks $97.92 to protect unlimited devices, and Surfshark just $47.76.",
    "Privacy is an issue with every VPN, but the SafeVPN website does its best to reassure you, stating that 'We promise not to sell your browsing history' and 'We won’t keep a log of what you access.'",
    "That's a good start, but the small print often tells a different story, so we headed off to the SafeVPN Privacy Policy to try to find out more.",
    "The document is lengthy and packed with detailed clauses and GDPR-related jargon, but, unfortunately, it's mostly about general website and business procedures, with no clear information about the VPN.",
    "The only extra details we could find were in a brief support document, which stated 'Safe VPN does not monitor your internet searches, or visited websites. We do, however, note the IP of your device and monitor the amount of traffic you put through the Safe VPN servers...'",
    "It seems that there's some degree of session logging, but how much? At a minimum, the system might be recording a single incoming IP address as it connects, and maintaining a running total of bandwidth used. But it's also possible that SafeVPN is keeping a record of every session, with incoming and outgoing IP addresses. There's not enough information here to say for sure.",
    "Setting up SafeVPN was mostly straightforward, though with some odd moments. 'Your antivirus protection starts here', a web page said as we were signing up. Antivirus protection?",
    "The Windows client has a familiar interface which, if you've ever used another VPN app, you'll recognize right away. A central console displays your current location and gives you a big Connect button; other locations are available on a simple list, and there are a couple of useful configuration options in a Settings box.",
    "The client's location list doesn't have a 'Best' or 'Automatic' selection to access the nearest server, unfortunately, and there's no Favorites system to speed up re-connecting to your most commonly used locations. The server list does enable choosing either countries or the locations within them, though (useful, as there are nine locations in the eastern US alone). It also highlights servers which specialize in video streaming or support P2P.",
    "Choose a location, click Connect, and desktop notifications make it clear what the client is doing, and when you do get connected, the client interface updates to indicate its status and display your new IP address.",
    "The Settings panel gives you options to load the client when Windows starts, to automatically connect to the best or last connection, and to enable a firewall (SafeVPN's name for its kill switch), which automatically blocks your internet connection if the VPN connection drops.",
    "We tested the client by forcibly closing the VPN connection, and found it coped very well. The interface updated to tell us there was a problem; the kill switch correctly blocked internet access for all other apps; the client automatically tried to reconnect to the VPN, and a desktop notification told us when we were protected again.",
    "Overall, this was a decent performance, but the Windows client was still short on many of the features we see in other top VPN clients. There's no way to change or reconfigure your protocol, for instance (it's OpenVPN-only.) There are no DNS options, and no automatic protection whenever you access an insecure or untrusted network. VPN newbies may appreciate SafeVPN's simplicity, but more demanding or experienced users will be frustrated by its lack of power.",
    "We wanted to check out the Android app, but, well...",
    "There's an Android page on the website with a 'get it on Google Play' button, but clicking it got us Google's 'we're sorry, the requested URL was not found on this server' error message.",
    "We searched Google Play manually and founds lots of VPNs with similar names, but no luck - they were all from different providers.",
    "We opened a live chat window, and a support agent responded within a couple of minutes. But when we explained the problem, he just told us to search on Google Play. What, it was too difficult to post the URL directly into chat?",
    "We tried again, still no result. He paused for a moment, then told us to go to the Android page we'd visited first.",
    "We explained we had, and pasted the dead link. He said, okay, and told us to enter the URL download.safevpn.com on an Android device.",
    "Switching to an Android device, we entered the URL, and got the same Google Play 'we're sorry, the requested URL was not found on this server' error we'd seen at the beginning. And that's where we gave up.",
    "SafeVPN advertises an iOS app, too, and when we clicked the website link, it took us to a real product. But unfortunately, it wasn't a SafeVPN product, but Total AV's iOS app, a security, cleanup and maintenance suite, where the VPN is one of many functions (and as far as we can tell, not provided by SafeVPN.)",
    "Maybe there's a perfectly reasonable explanation for this, it's some temporary issue, and will all be cleared up by the time you read this. But if you're buying SafeVPN for use on a mobile device, if only occasionally, don't take the website's word about the apps on offer. At the very least, find them on your app stores before you buy.",
    "The SafeVPN website claims the service can 'unlock restricted content', 'from video streaming to social networks', and provides twelve examples: Amazon, BBC iPlayer, Facebook, Google, HBO, Hulu, Instagram, LinkedIn, Skype, Twitter, WhatsApp and YouTube.",
    "These aren't just empty words. The SafeVPN Windows client includes specialist unblocking servers for the UK, UK, Canada and Japan. And they worked perfectly in our tests, getting us into BBC iPlayer, US Netflix, Amazon Prime Video and Disney+, a great result.",
    "Our performance tests showed above-average speeds from the UK, with our nearest UK server reaching 65-68Mbps on our test 75Mbps line, and UK to US and European locations achieving a solid 40-65Mbps.",
    "Re-running our tests from a European data center with a 350Mbps+ connection gave us a chance to see what the service could do, and an excellent 150-200Mbps was the result.",
    "The review ended with some mixed results in our privacy tests, though, with the Windows client showing a DNS leak when connected via IKEv2, but no problems at all when connected via OpenVPN.",
    "SafeVPN has taken the excellent Windscribe service, made it much worse (3 device limit, no mobile apps, misleading website), and then, after the introductory deal, added a massive and totally unjustified price premium. If you like the speed and great unblocking performance, go direct to Windscribe, you'll be much better off."
  ],
  "headers": {
    "8": "Privacy and logging",
    "13": "Windows client",
    "20": "Mobile apps",
    "29": "Performance",
    "34": "Final verdict"
  },
  "links": {
    "SafeVPN": "https://www.safevpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Windscribe": "https://www.techradar.com/reviews/windscribe",
    "Monthly billing": "https://www.safevpn.com/pricing",
    "over 6 months": "https://www.safevpn.com/pricing",
    "annual plan": "https://www.safevpn.com/pricing",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "SafeVPN Privacy Policy": "https://www.safevpn.com/privacy-policy",
    "brief support document": "https://support.safevpn.com/",
    "Total AV's iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7443905698739632000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fph%2Fapp%2Fsafevpn%2Fid1130411958"
  }
}