{
  "source": "https://www.techradar.com/reviews/doxyme",
  "title": "Doxy.me review",
  "category": "computing",
  "updated": "2020-02-05T19:00:45Z",
  "author": "jonas-p-demuro",
  "summary": "Breaking down the barriers to telemedicine",
  "verdict": "Doxy.me offers a range of tiers to offer a simple, and effective approach to virtual office visits.",
  "pros": [
    "Free tier and free trial",
    "Browser based",
    "HIPAA compliant"
  ],
  "cons": [
    "No mobile apps",
    "Occasional hiccups",
    "Higher prices for multiprovider plans"
  ],
  "article": [
    "Doxy.me is a relative newcomer to the telemedicine space, born at the University of Utah for a prenatal study, and then going to the public in 2014. As of May 2019, with subsequent growth it is currently serving approximately 50,000 providers, and providing 3 million telemedicine minutes on a monthly basis. Doxy.me is designed to break down barriers, make telemedicine more accessible, and is released free.",
    "Doxy.me has a number of attractive features that make it a simple and turnkey solution in the telemedicine space. Of concern with any online solution in healthcare, the first concern is patient privacy, and Doxy.me has that covered with a fully HIPAA compliant solution, with encrypted point-to-point connections. Furthermore, there is also a Business Associate Agreement (BAA) to ensure the security of the Protected Health Information (PHI).",
    "Not every telemedicine interaction with a patient needs to happen with a full video connection. For example, a quick text communication can work well for a simple issue to follow up on, but clinicians are limited as standard texts, specifically SMS, is not HIPAA compliant, and not to be used for communication with patients and their families. Doxy.me has an offering to bridge this gap, their Live Chat, which can be used for a simple text based communication, while maintaining PHI security. It can even be used during a video chat session with another patient, for efficient use of time.",
    "Doxy.me offers a robust browser based platform, for use on any platform with a browser. When patients login, each is greeted via a Check In, designed to be simple, while welcoming, analogous to signing in with the receptionist at an office. In turn, clinicians have a Patient Queue screen, which allows the clinician to see which patients have checked in, and ready for their session. Clinicians can even switch between patients as needed.",
    "While Doxy.me works in any browser, there is no need for any software installation on any platform, but also keep in mind that there are no available mobile apps for either iOS or Android, which can certainly be easier to use on a tablet or smartphone.",
    "Perusing user reviews indicates a generally liked product. In some cases, there can be intermittent connectivity issues, with providers indicating that at times either they, or their clients have to refresh their browser to continue the session. In more extreme situations, it also gets reported that reboots of the computers at both ends of the session are needed to reestablish communication to continue, which can certainly interrupt the flow, and in another case a user reports significant freezes to their screen. Doxy.me is also reported to be picky about which browser it runs in, and if another video chat client is simultaneously running, such as Skype, it can precipitate a Doxy.me crash.",
    "Doxy.me generously offers both a free trial, as well as a free tier of their service. It is also stated that the free tier is “Free forever” giving us confidence that this is no bait and switch to get folks paying.",
    "The free tier also offers an unlimited number of minutes, across an unlimited number of sessions. It even includes a personalized room URL, and reportedly works in any browser, so no software install is required. It is fully HIPAA compliant, through a secure data center. It gets limited to a single clinician, and it is low definition (LD) video, which is lower quality than SD and HD video. You can also access a meeting history, and get browser notifications.",
    "The free trial offer refers to the Professional tier, which is also for an individual provider, at a cost of $35 (£27) per month. It includes all the features of the free tier, including unlimited minutes and sessions, the video quality gets upgraded to HD or SD depending on the available bandwidth, with an option for an audio only call. Additional functions for this higher tier include a room passcode, text and email notifications, photo capture, and payments.",
    "While these lower tiers get limited to a sole provider, the top tier, Clinic, gets offered for a multiple clinician practice. This has a cost of $50 (£38) per each clinician, with a discount offered for practices with more than five providers. There are a handful of additional benefits to this multiprovider tier, including a dedicated account rep, custom marketing materials, and a monthly usage report.",
    "Support is offered through multiple avenues, which vary according to the tier chosen. The free tier has the option for email support, and also access to online help pages. The Professional tier upgrades support to add on demand online chat, and scheduled communication via phone or video. The Clinic tier at the top includes all the options for the lower tiers, and also adds a dedicated online rep.",
    "Doxy.me gives clinicians a reasonable solution for office visits through their online portal. The pluses include HIPAA compliance across all the tiers, a generous Free tier with unlimited minutes and sessions, the free trial for the Professional tier, and a dedicated support person for the top level Clinic tier. Our wish list for future offerings includes mobile app support, discounts offered for less providers on the Clinic tier pricing, and a more stable platform with less reported crashes and reboots. Overall, for clinicians looking for a pay one price, more affordable solution for online visits with their patients, Doxy.me is worth a close look."
  ],
  "headers": {
    "1": "Features",
    "4": "Drawbacks",
    "6": "Pricing",
    "10": "Support",
    "11": "Final verdict"
  },
  "links": {
    "Doxy.me": "https://doxy.me/",
    "telemedicine": "https://www.techradar.com/best/best-telemedicine-software",
    "free tier": "https://doxy.me/pricing",
    "Professional tier": "https://doxy.me/pricing",
    "Clinic": "https://doxy.me/pricing"
  }
}