{
  "source": "https://www.techradar.com/reviews/ofx-money-transfer",
  "title": "OFX money transfer review",
  "category": "computing",
  "updated": "2020-09-29T09:00:11Z",
  "author": "rob-clymo",
  "summary": "Move your money where you need it with OFX",
  "verdict": "If you're looking for a bank-to-bank transfer service without too much in the way of overheads then the online edition of OFX gets the job done easily.",
  "pros": [
    "Cheap rates",
    "Convenient",
    "Rate alerts"
  ],
  "cons": [
    "App could do with the odd tweak",
    "No iPad edition currently"
  ],
  "article": [
    "OFX, formerly Forex, is one of many online money transfer services that allow you to move cash from one bank to another, either within the US or to another country. There’s a website for desktop users, while those on the move might prefer the services of OFX via its app. Both are handy during the coronavirus crisis.",
    "One of the main appealing aspects of OFX is that it continues to provide cheap international money transfers, with no cap on the amount you can send either. The service can be used from a variety of locations around the globe, including the US, Hong Kong, France, Australia, India, Singapore, Taiwan, the UK, China, Japan, Denmark, Canada, New Zealand, Germany and Saudi Arabia.",
    "It takes less than 5 minutes to get yourself registered with OFX and while you do that you’re able to dynamically keep track of popular exchange rates. Competitor products include the likes of WorldRemit, Azimo, Venmo, Western Union, PayPal, Zelle and Moneygram.",
    "You can use OFX free of charge in either the desktop or app editions. As with many other providers of money transfer services, the company generates revenue from the exchange rate markup. That means you don't have to pay any transfer fees from within OFX on moving money over $1,000 or more, although your bank will more than likely charge for transferring money internationally. You’ll need to check this aspect with your own bank, ideally prior to using the OFX service.",
    "Getting started with OFX doesn't require too much in the way of effort and it’s certainly convenient, but you’ll need to have your ID verified. If you begin the sign-up process you’re first presented with one of two options, which means you have to select if you’re transferring money for personal or business reasons.",
    "Going for the personal option is the simpler route, which requires nothing more than telling OFX the country you’re located in and giving them an email, If you’re heading down the business transfer route then there’s a requirement to select a business type, such as Private Company, Sole Proprietorship, Partnership, Trust, Charity or Public Company.",
    "The section below that asks which currencies you’re most likely to be transferring and the amount of your local currency that you expect to transfer on an annual basis. This includes $0-500,000, $500,000 – $1,000,000, $1,000,000 – $5,000,000 right up to $5,000,000+.",
    "Just how efficiently your money gets from A to B is largely dictated by how quickly to want it to happen. Transfers can take up to four days, but if you wish to send a domestic wire transfer, as opposed to a direct debit then this process will much faster. As with anything though, faster generally means more expensive, particularly in the case of banks and what they charge for wire transfers. That’s part of the appeal with OFX though as there is no transfer fee.",
    "Having been around for nigh on 20 years OFX, which was formerly known as Forex around the globe, has got its business honed nicely, so there’s very little involved with carrying out your money transfers. Usefully, OFX has the built-in ability to let you monitor your transfer, which is done to best effect with the OFX app. However, you can easily dip into the website or use the option of SMS or email notifications to keep tabs on the progress of your cash transfer. Funds need to be sent to the OFX account you’ve created. However, it is also possible to link a bank account to allow OFX to take the funds out directly. The cash will then be converted to the currency required and sent to the recipient via bank transfer.",
    "There’s a really solid page of frequently asked questions, all of which can help you get to the bottom of most aspects of OFX and its exchange capabilities. There are also phone numbers for contacting them, depending on whether you're a personal or business customer. You can also send them an email via a customer service address. Usefully, given the fact that many of OFX’s users are dotted around the globe there is also a list of international numbers, many of which (though not all) are free to call.",
    "OFX isn't the fastest way to transfer money to locations around the globe using a bank-to-bank setup, but it’s still one of the most cost-effective options. There’s a good balance between using the desktop browser-based solution, or the app, depending on where you are sending cash and if you’re happy with waiting a few days for the money movement to happen then OFX works just fine.",
    "The company states that most of its transfers end up getting processed within 24 hours anyway. While there’s no iPad version of the app yet, which some users on the move find frustrating, there’s really not too much else to get frustrated about when it comes to cost-effective money transfers."
  ],
  "headers": {
    "3": "Pricing",
    "4": "Features",
    "7": "Performance",
    "8": "Ease of use",
    "9": "Support",
    "10": "Final verdict"
  },
  "links": {
    "OFX": "https://www.ofx.com/en-gb/",
    "money transfer": "https://www.techradar.com/best/best-money-transfer-apps",
    "Venmo": "https://www.techradar.com/news/venmo-targets-small-and-micro-businesses-with-new-payment-service",
    "Zelle": "https://www.techradar.com/reviews/zelle-money-transfer",
    "Moneygram": "https://www.techradar.com/reviews/moneygram-currency-transfer",
    "transfer money": "https://www.techradar.com/best/best-money-transfer-apps",
    "money transfers": "https://www.techradar.com/how-to/how-to-transfer-money-to-your-friends-and-family"
  }
}