{
  "source": "https://www.techradar.com/reviews/google-gmail",
  "title": "Google Gmail review",
  "category": "computing",
  "updated": "2021-06-30T06:45:44Z",
  "author": "tom-johnson",
  "summary": "A Gmail account unlocks much more than just the ability to send and receive emails",
  "verdict": "Although Google Gmail for business is more expensive than most email services, users get a lot more than just email capabilities, which in turn can cut costs elsewhere.",
  "pros": [
    "Get lots for your money",
    "Great collaboration tools for teams",
    "Sleek and easy to use"
  ],
  "cons": [
    "More expensive than most"
  ],
  "article": [
    "In a relatively short space of time, Gmail has become one of the most widely-used email platforms in the world, and Google Workspace (formerly G Suite) an invaluable tool for businesses of all sizes.",
    "There’s no doubt that Gmail is one of the best email services on the market, but does that mean it’s right for you? In our Google Gmail review, we’ll assess the platform’s features to help you decide whether it’s worth your money.",
    "Although the free version of Gmail is a powerful tool for personal use, businesses may prefer a premium Google Workspace plan. Yes, Google Workspace—because there aren’t any purchase options for just Gmail. Whilst this makes it more expensive than its competitors, you do get a lot for your money.",
    "The most basic plan (Business Starter) costs $6 per user, per month and comes with 30GB cloud storage for each user (double the capacity of the free version). You also get a custom business email address and the ability to host video meetings for up to 100 people.",
    "On the other hand, the most advanced package (Business Plus) comes with 5TB cloud storage and the video meetings can host up to 250 people. Moreover, video meetings can be recorded and saved to Google Drive (a feature that’s also included with the Business Standard plan). However, at $18 per user, per month, Business Plus isn’t cheap, so prospective buyers will be glad that there’s a 14-day free trial.",
    "Despite all the Google Workspace features that are either enhanced or made available with pricier plans, it’s worth noting that for Gmail alone, you get the same functionality regardless of how much you pay (excluding cloud storage capacity).",
    "Whilst it might take some getting used to, Smart Compose is a nifty feature that makes it quicker to write emails. Moreover, there’s a Smart Compose Personalization setting, which makes suggestions personalized to your writing style. It’s a bit gimmicky rather than a super time-saver but every little helps.",
    "Nudges are handy reminders that place emails at the top of your inbox with a highlighted reminder, such as: “Sent 3 days ago. Follow up?” or “Received 5 days ago. Reply?” If you’re dealing with a lot of correspondence, these can really help you stay on top of things.",
    "Whether you’re working on a train or your Wi-Fi is having a bad day, being able to read, respond to, and search emails when you lose your connection is really useful. Although you’ll need Google Chrome for this to work, this feature is also available on the free version of Gmail.",
    "With Gmail, you can talk to people within your organization via Google Chat or Google Meet, send out calendar invitations, and add to your to-do list, without leaving the platform.",
    "Gmail blocks 99.9% of dangerous emails before they reach your inbox and will warn you of any suspicious emails.",
    "The Gmail interface is easy to use and set up on both desktop and mobile. The simple layout means that even amateur users will quickly get to grips with the platform. Typically, emails are automatically sorted into one of three categories, including Primary, Social, and Promotions.",
    "Although Gmail doesn’t always sort emails correctly, it does a pretty good job and learns from its mistakes when you manually move emails into the correct categories.",
    "As well as an extensive knowledge base, there are three levels of support available to premium users, including Standard Support, Enhanced Support, and Premium support.",
    "Standard Support is the default option for all plans except Enterprise (the most expensive). However, Business Standard and Business Plus customers can upgrade to Enhanced Support for a fee. Enterprise customers, on the other hand, get Enhanced Support as standard and can upgrade to Premium Support.",
    "The key difference between them is the response time, which varies from four hours for Standard Support to 15 minutes for Premium Support. Premium Support customers also get a designated Technical Account Manager. For more information on Google’s support offerings, click here.",
    "If having a private and secure email server is your top concern, there are better options than Gmail, such as ProtonMail. Whilst Gmail is pretty secure, it can scan your emails to carry out certain functions, such as Smart Compose. However, ProtonMail enables end-to-end encryption, which means nobody (including ProtonMail) can read your emails.",
    "Microsoft Outlook, on the other hand, is still a favorite for many, and the Microsoft 365 business plans have a similar price tag to Google Workspace, ranging from $5 per user, per month for the most basic to $20 per user, per month for the most expensive. However, Microsoft does offer more affordable plans for personal use, which still include apps like Word, Excel, and Powerpoint. Additionally, the familiar office apps available in Microsoft 365 are far superior to Google's own.",
    "For teams, there’s plenty of functionality that enables seamless collaboration, with a lot of actions made available from within Gmail, such as the ability to reply to comments on a Google Doc.",
    "Although Gmail is one of the more expensive options out there, because you’re paying for all of Google Workspace, it’s important to remember you’re getting a lot more than just an email service.",
    "Gmail is a solid choice for any business looking for a new email provider. With plenty of easy-to-use tools across desktop and mobile versions, users won’t be disappointed.",
    "The big question is whether it's really worth paying for it as part of a Google Workspace package, especially when rivals such as Microsoft 365 offer a better platform overall."
  ],
  "headers": {
    "2": "Google Gmail: Plans and pricing",
    "6": "Google Gmail: Features",
    "11": "Google Gmail: Interface and in use",
    "13": "Google Gmail: Support",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "Gmail": "https://mail.google.com",
    "best email services": "https://www.techradar.com/news/best-email-provider",
    "click here": "https://support.google.com/a/answer/10105075?hl=en#:~:text=Google%20Workspace%20Standard%20support%E2%80%94Standard,with%20your%20Google%20Workspace%20license.&text=Google%20Workspace%20Enhanced%20support%E2%80%94Enhanced,7%20access%20to%20priority%20support.",
    "secure email server": "https://www.techradar.com/best/best-secure-email-providers",
    "ProtonMail": "https://www.techradar.com/reviews/protonmail-secure-email",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "Microsoft Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "Powerpoint": "https://www.techradar.com/reviews/microsoft-powerpoint",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}