{
  "source": "https://www.techradar.com/reviews/pro-ject-carbon-debut-evo",
  "title": "Pro-ject Carbon Debut Evo review",
  "category": "audio-visual",
  "updated": "2020-10-24T10:00:03Z",
  "author": "simon-lucas",
  "summary": "21 years is a long time to be making your Debut",
  "verdict": "Want to be entertained in the inimitable vinyl manner, and be sure you’re not missing a scrap of information at the same time? You’ll want to turn your ears in Pro-Ject’s direction, then.",
  "pros": [
    "Detailed, expansive, engaging sound",
    "Impressive specification",
    "Wide choice of very pleasant finishes"
  ],
  "cons": [
    "Could sound more vigorous",
    "Doesn’t necessarily look the money’s-worth"
  ],
  "article": [
    "Pro-Ject introduced its first Debut turntable at the end of the last century, and it’s been refined, upgraded, and become increasingly expensive ever since. This Debut Carbon Evo is the most refined and upgraded model so far – and it’s also the most expensive.",
    "In terms of specification, though, the Pro-Ject goes a long way towards justifying its price. The carbon fibre tonearm is supplied with a very capable Ortofon (or Sumika) cartridge. A new motor design, some damped and adjustable feet, and automatic speed change contribute no end to improved performance and improved ergonomics. And with a choice of nine finishes, including five very attractive new ‘satin’ options, there’s sure to be a Debut Carbon Evo to fit in with your interior decor choices.",
    "Setting up is simple: attach the drive belt, put on the platter, and attach counter- and antiskate weights to that single-piece tonearm. Attach to your wider system with the high-quality phono leads that are included, plug into the mains, and you’re good to go.",
    "And it doesn’t matter the sort of music you like to listen to – the Debut Carbon Evo laps it up. In every circumstance it’s a detailed and revealing listen, able to focus on the minutiae even as it describes the complete picture completely convincingly.",
    "It has all the warmth and weight the vinyl format is famous for, but it’s not musclebound and it doesn’t get bogged down – instead it simply motors along in the most natural way imaginable. There’s a sort of instinctive correctness to the way the Pro-Ject makes music that goes a long way to explaining why vinyl has endured as a format all these many decades.",
    "It’s not the last word in absolute precision, and there are other similarly priced turntables that offer a little more bite and aggression. But if you value a smooth, informative ride from a beautifully engineered and nice-looking record player, don’t spend any money until you’ve heard the Debut Carbon Evo.",
    "The Pro-Ject Debut Carbon Evo is on sale now, and priced at $499 / £449 / AU$879. That makes it far less of an entry-level proposition than 1999’s original Debut – but then Pro-Ject has covered off the entry level with its Elemental and Primary models, while the Debut Carbon Evo is a much better specified device than the original Debut could dream of being.",
    "At this price, the Pro-Ject goes up against some very capable and very well-regarded alternatives. The likes of Rega (with its Planar 2) and Thorens (and its TD190-2) are ready to turn your head – but Pro-Ject’s reputation is the equal of that of any competitor, and the company is always an option at this sort of money.",
    "Nobody in their right mind messes with the design of a turntable, do they? Ever since the record player did away with the need for a trumpet horn, they’ve all looked the same (apart from those self-consciously ‘wacky’ designs that are odd for the sake of it). A record player is a rectangle with a circle on it – and, if you’re feeling adventurous, a plastic dust-cover on the top.",
    "And that’s how it is with the Pro-Ject Debut Carbon Evo. At a glance, it looks just like every other record player – certainly it looks enough like the original Debut Carbon from 2017 to make you wonder why the price has risen from the original’s $400 / £349 / AU$550. But like pretty much every record player, a lot of your money goes on the stuff you can’t see: the bearing, the motor, the damping and all the other necessities.",
    "The Debut Carbon Evo has – ahem – evolved from the original Debut Carbon in a number of places. The new model features the same height-adjustable damped feet fitted to Pro-Ject’s $899 / £749 / AU$1190 X1 turntable, and a new motor design with some hefty decoupling incorporated – the motor’s now barely in contact with the main body of the turntable.",
    "Its steel platter is now heavier, thanks to a thermoplastic ring on its inside edge – it’s a technique to reduce operation noise and was popularized by, among others, Technics. And there’s now a suggestion of convenience in the shape of a speed-change switch at the bottom of the plinth – previously you’d have to take off the platter and move the drive belt to change speeds, but now 33.3rpm can become 45rpm (or vice-versa) at a press. Of course, if you’re the hands-on type (and you own some properly elderly records) you can change the drive belt itself in order to play at 78rpm. Both belts are included in the package.",
    "The one-piece tonearm is made of carbon fibre, and comes fitted with a very capable Ortofon 2M Red cartridge (except in America, where it features a Sumiko Ranier cartridge instead. Quite why the United States requires a different option is anyone’s guess). All that’s required is for the belt, platter counterweight and antiskating weight to be attached and the Debut Carbon Evo is ready to go.",
    "Mind you, before you get to that point you’ll need to choose between the Pro-Ject’s numerous finishes. As well as the wood veneer and glossy white, red or black of the previous model, the Debut Carbon Evo is also available in five satin finishes: black, white, yellow, blue or green.",
    "Our review sample is in Fir Green, and very nice it looks too. The finish is flawlessly smooth, and as reassuring as the build quality.",
    "Despite the only branding on the entire product being a discreet ‘Pro-Ject’ logo on the dust-cover, anyone who’s familiar with the Pro-Ject family sound will have no trouble picking out the Debut Carbon Evo as a bit more of the same. And that’s meant almost entirely positively.",
    "The Debut Carbon Evo is a luxuriously full-bodied listen, but that’s not to say it’s in any way languid. It has plenty of the warmth and richness that’s so often held up as an unarguable vinyl virtue, but it doesn’t wallow or slur. It’s easy to listen to, but it’s not uninvolving.",
    "And it’s nigh-on impossible to wrong-foot. From A Tribe Called Quest’s I Left My Wallet In El Segundo to Father John Misty’s Hollywood Forever Cemetery Sings, from Leonard Bernstein’s Gee, Officer Krupke to Nina Simone’s Pirate Jenny, the Pro-Ject sounds both right at home and thoroughly engaged.",
    "Like any worthwhile turntable, it’s very adept and tying everything together. There’s a tangible sense of performance from the Evo, even when it’s playing cut’n’paste collages from the likes of A Tribe Called Quest. The unity of a recording, the way the midrange rides on the low-frequency underpinnings, and the way the treble balances securely on the top, allows every record to sound coherent and convincing. Even with the most processed, machine-derived recordings, this Pro-Ject glides along with the sort of casual authority of sound that can only come from a well-sorted record player.",
    "There’s heat in the low frequencies, certainly, but they’re not overcooked and it’s certainly not at the expense of detail or texture. There’s a similarly lavish amount of detail retrieved in the midrange – it reveals so much about the glee and malevolence Nina Simone imbues her performance with it’s almost hair-raising – and while the top end is rolled off just fractionally, it’s far from a blunt instrument.",
    "The Pro-Ject handles tempos and rhythms with equal assurance. Oh, you’ll get a straighter edge and a more martial approach from a similarly priced Rega turntable, but the Evo counters (and strongly) with its unfussy nature and the almost ostentatious amount of detail it digs out.",
    "It’s not lacking anything where dynamics, both great and small, are concerned either. The sparer and more low-key a recording, the more the Pro-Ject reveals about the harmonic details – and the more full-on and instrument-heavy a recording, the more the Pro-Ject enjoys giving every element full expression."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Pro-Ject Debut Carbon Evo price and release date",
    "8": "Design",
    "15": "Audio performance",
    "22": "Don't buy it if..."
  },
  "links": {
    "turntable": "https://www.techradar.com/news/best-turntables",
    "Debut Carbon": "https://www.techradar.com/reviews/pro-ject-debut-carbon"
  }
}