{
  "source": "https://www.techradar.com/reviews/realme-watch-s",
  "title": "Realme Watch S review",
  "category": "wearables",
  "updated": "2020-12-16T11:20:00.865Z",
  "author": "michael-sawh",
  "summary": "Looks the part but stumbles when it comes to tracking",
  "verdict": "The Realme Watch S is a far more polished effort than Realme’s first smartwatch. There’s better materials in place, an improved display, and it’s overall much nicer to live with. It just does the smartwatch basics though and is a better fitness tracker than sports watch, with a battery life that can go for weeks. If you have a tight budget and are happy to keep things simple, there’s plenty to like about the Realme Watch S.",
  "pros": [
    "Well-built and nice design",
    "Easy to use",
    "Good battery life"
  ],
  "cons": [
    "Not suitable for swimming",
    "Not great sports tracking accuracy",
    "Android only"
  ],
  "article": [
    "The Realme Watch S is the Oppo spin-off’s second smartwatch, and it switches from a square design to a round one, as well as stepping up the price to give you more in the way of hardware and software.",
    "It’s ditched the plastic case for a larger circular aluminum case that now hosts a 1.3-inch LCD display with a ramp up in resolution compared to the first Realme Watch, but it does still lack an always-on display mode.",
    "It’s also still an option that only works with Android phones, and as a smartwatch it does the very basics of letting you view notifications, control your phone's camera shutter and music playback, and change watch faces. If you’re happy with the basics, then the Watch S delivers them without any major issues.",
    "As a fitness tracker, it will track your steps and sleep, and accuracy-wise it's in the ballpark of a Fitbit tracker we compared it against.",
    "Heart rate monitoring is a little better equipped for daily monitoring than it is for exercise, where it usually posted wildly high maximum heart readings for runs and indoor workouts. Though continuous monitoring seemed a little off too. You can also take on the spot blood oxygen measurements, which proved much more accurate.",
    "There’s no built-in GPS, which means you’ll need to rely on motion sensors or piggyback off your phone’s GPS to track outdoor activities. The Realme Watch S did however fall quite short for distance tracking even when leaning on our phone’s GPS.",
    "On a more positive note, the Realme Watch S’s battery does hold up well. It has the capacity to go for well over a week with all features in use, so even with heavy use you should comfortably get a week out of it.",
    "For the money, the Realme Watch S does a good enough job. It looks like a nice smartwatch and keeps things simple. It’s easy to use, handles notifications and music features well enough, and does an okay job on the fitness tracking front too.",
    "If you’ve got less than £100 (around $130 / AU$175) to spend, there’s enough to like here. If you want more in the way of sports tracking in around the same price bracket (or live in a country where this isn't available), we’d say look in the direction of something from Amazfit’s collection of watches, such as the Amazfit T-Rex.",
    "The Realme Watch S was launched on November 2 and is currently available in the UK from Realme’s website, priced at £74.99 (around $100 / AU$130). There’s no availability in the US or Australia at the time of reviewing.",
    "While Realme went square for its first smartwatch, it switched things up and went round for the Watch S. That’s not the only big change you can expect for its second stab at making a smartwatch. You’re also getting a nicer case material, improved screen resolution, and altogether something that looks much better on the wrist.",
    "The Realme Watch S features a 47mm aluminum case that measures in at 12mm thick, making it a bit chunkier than Realme’s first watch, and it’s heavier at 48g too. That’s paired up with a pretty standard-looking 22mm silicone strap that comes in a choice of black, green, blue, or mustard color options.",
    "That case holds in place a 1.3-inch, 360 x 360 LCD touchscreen display with Corning’s Gorilla Glass to toughen things up. While it’s a drop down in screen size, you’re getting a step up in resolution in comparison to the first Realme Watch. It doesn’t feel as washed out and it offers strong maximum brightness, good colors, and strong viewing angles.",
    "There isn’t any horrible screen lag when you swipe across it either, and it’s a step up in pretty much every way. There’s no always-on display mode here though and while raise to wake worked well in general, it seemed to struggle a bit more for responsiveness during exercise.",
    "Joining that touchscreen display are two physical buttons, with the top one pushing you into the app menu and the bottom one offering quick access to a feature of your choice. Out of the box, that’s set to workout tracking as default. Those buttons twist as well, though that hasn’t been utilized for any of the onboard features.",
    "If you’re hoping to take the Realme Watch S for a swim or in the shower, you’re out of luck. it’s been slapped with an IP68 water resistance rating that’s better suited to a bit of rain or splash of water than being dunked in it for any period of time.",
    "As with the original Realme Watch, this is one for Android phone owners only, and you’ll need to download the Realme Link app, which requires your phone number to login and permission to access your location at all times to set up the watch.",
    "The Realme Watch S is running on Realme’s own in-house operating system and no details have been shared on the kind of processor that’s powering it.",
    "The on-watch software is pretty straightforward to use. Swipe up to reveal your apps and features, swipe down for messages, and left or right to see widgets for things like activity tracking and weather updates.",
    "You have the ability to change watch faces and that’s done by pressing down on the main watch screen to swipe through a collection of both analog and digital options, with more found inside the very basic Realme Link companion app.",
    "In terms of the smartwatch features you have at your disposal, you can view notifications for first and third-party apps, and control music playing on your phone. You can also view weather forecasts, and use the watch to control your phone’s camera.",
    "There’s nothing ground-breaking here, but crucially the features all work largely without issue. You can’t respond to notifications, but they are generally well optimized for the display and easy to read. Though some messages from apps like WhatsApp didn’t always display correctly, and emails simply deliver subject lines and nothing more.",
    "Music controls work and you can access them during exercise as an added bonus. Weather forecasts are handy as well.",
    "It’s a basic smartwatch experience, but it’s a good one for the most part.",
    "When you switch from smartwatch to fitness tracking mode, there’s a decent array of features at your disposal. Realme includes a pretty typical 3-axis accelerometer sensor to deliver things like step tracking and workout modes such as indoor running. It also delivers the automatic sleep monitoring.",
    "There’s an optical heart rate sensor that brings features like continuous monitoring, resting heart rate, heart rate alerts, and heart rate during exercise. That sensor also enables blood oxygen measurements as another window into your fitness levels. It took measurements without issue and matched up with the readings from a dedicated pulse oximeter.",
    "There’s no built-in GPS, but you do get connected GPS, allowing you to lean on your phone’s GPS signal to map outdoor activities. There are also extras like guided breathing exercises, which are not all that different from similar features we’ve seen on Apple, Garmin, and Fitbit watches.",
    "As a fitness tracker, you can either keep track of your stats from watch faces that support it, or head to the dedicated widget that shows steps, calories burned and hours you’ve stayed active for. There are also features like inactivity alerts and the ability to set up some handy \"drink some water\" reminders.",
    "From an accuracy point of view, we generally found step tracking to be within 500-1,000 steps of a Fitbit fitness tracker. But continuous heart rate monitoring, which samples at a minimum rate of every 5 minutes, posted wildly high average heart rate readings. At times it was 20bpm more than was recorded by Fitbit and Garmin fitness trackers and a chest strap monitor.",
    "When it’s time to go to bed, the Realme Watch S will track sleep duration and deep, light and REM sleep stages. It additionally tracks heart rate during sleep, though again, it doesn’t feel hugely reliable.",
    "In general, it tended to post longer periods of sleep than the Fitbit Sense we compared it against. It clearly logged the time we were in bed before falling asleep as time slept, and while sleep stages were roughly the same, its sleep tracking definitely feels a little off.",
    "When you move to tracking activities, there’s 16 modes covering a range of indoor and outdoor activities. There’s the usual suspects like running and cycling along with things like yoga, football, and strength training. Just don’t expect it to track your exact movements on a football pitch or your downward facing dog.",
    "For running, the connected GPS support was pretty snappy at locking onto the phone’s signal, and you’ll be able to see stats like pace, distance, and duration. You have a screen dedicated to music controls and you simply hit the top physical button when you’re ready to end the tracking session.",
    "When you opt for something like football or cricket, you’re just getting workout duration and heart rate data.",
    "Our workout data however suggests the Realme Watch S is not fit to handle that tracking. On runs, it tracked one less mile and data like average pace and speed were way off from a Garmin Forerunner watch.",
    "With heart rate, average HR data was usually within 3bpm of a chest strap, but maximum heart rate was at times 15bpm out from the chest strap. It was a similar story for indoor workouts where heart rate data simply didn’t feel reliable enough.",
    "The Realme Watch S packs a 390mAh battery with the promise of giving you as much as 15 days of battery life. That’s double what the first Realme Watch promised.",
    "That 15 days is based on lab conditions, like turning on continuous heart rate monitoring and receiving message notifications 100 times. When you’re running low, there’s a power saving mode that leaves you with the time and battery status.",
    "In our time with it, those battery claims seemed to ring true. It doesn’t significantly drain the battery on a daily basis even with all of its key features in use.",
    "We usually saw around 5-10% drop off each day and that was with the screen at automatic brightness, tracking a workout for around 30-40 minutes, and with continuous heart rate monitoring enabled.",
    "When it is time to charge, there’s a magnetic charging base that sits securely on the back of the watch case to power you up when you’re running low.",
    "First reviewed: December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Realme Watch S price and release date",
    "10": "Design and display",
    "16": "Performance and software",
    "24": "Fitness",
    "36": "Battery life",
    "41": "Don't buy it if..."
  },
  "links": {
    "Realme Watch": "https://www.techradar.com/reviews/realme-watch",
    "Amazfit T-Rex": "https://www.techradar.com/reviews/amazfit-t-rex-review",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense"
  }
}