{
  "source": "https://www.techradar.com/reviews/buffered-vpn",
  "title": "Buffered VPN review",
  "category": "computing",
  "updated": "2020-07-20T11:11:26Z",
  "author": "mike-williams",
  "summary": "Forget the name – there’s no ‘buffering’ with this VPN",
  "verdict": "Buffered VPN's scores well for speed and Netflix unblocking, but spoils the effect with the vague logging policy, weak Windows client and more. Keep looking, you'll get better results elsewhere.",
  "pros": [
    "Above-average performance",
    "Works with any OpenVPN-compatible device",
    "Unblocks Netflix",
    "Live chat support"
  ],
  "cons": [
    "Small network",
    "Privacy policy is short on details",
    "Below-par desktop client",
    "Some dubious info on support website"
  ],
  "article": [
    "Update (June 2, 2020): Buffered VPN has merged with Encrypt.me, and in the company’s words, will continue to offer “world class VPN services through Encrypt.me”. In other words, you’ll be signing up with Encrypt.me, and you can check out our full review of that service here.",
    "Original review follows below...",
    "Hungary-based Buffered is a small VPN provider which delivers in some areas, but is a little more questionable in others.",
    "The network is relatively small, with just 37 locations. They're reasonably well spread, though, with servers in Europe, North America, Argentina, Australia, Hong Kong, Iceland, Indonesia, Israel, Japan, Korea, Mexico, Russia and more. They all support P2P, too.",
    "Buffered was late adding mobile apps, but now has custom software for Android, iOS, Windows and Mac, along with instructions for routers and more. You're able to connect up to 5 devices simultaneously.",
    "Support is vital, even for experienced users, and Buffered VPN's 24/7 live chat should ensure you're never far away from expert help.",
    "Buffered VPN has only a very basic free trial for mobile users (one hour a month), and nothing at all for desktop users, but if you do sign up, you're protected by its 30-day refund policy. There are no sneaky exclusions buried in the small print, no limits on sessions or data use - just send a request via email, and a reason, and you'll get your money back.",
    "This is good news, especially if you're signing up for the monthly plan, which costs a painful $12.99. (Even the premium ExpressVPN undercuts this, just, at $12.95.)",
    "Fortunately, the annual plan looks much better value at $6.95, and if you sign up for two years, the price falls even further to $4.12.",
    "Most VPN providers understand that they need to reassure customers about their logging policy, and Buffered tries to do this in the very first line of its FAQ page:",
    "'Since we value your online privacy and rights, we don’t track any of your online traffic.'",
    "That's good news, but not exactly specific. What about session data, IP addresses, device IDs, timestamps? The FAQ covers none of that, but does admit to some logging, later: 'That’s why we only log data regarding the duration of your connection.' That's some form of session logging, presumably, but how does it work? How is Buffered identifying a session? Is it recording a start time, an end time? We would like to know, but the company isn't saying.",
    "A Privacy Statement doesn't give us much more detail, beyond a mention of the data it can collect about app errors. It's a lot, too: device identifiers..., operating system’s version, language, IP addresses, network information, user information on the operating system, routing tables, DNS server addresses, other filesystem information.' But if you're worried, you can opt out of crash reporting by flicking a switch in the Settings dialog.",
    "Put this all together and you really don't have very much. Buffered isn't confessing to anything bad, but it's not spelling what it's doing, either, and we would like the logging policy become far more detailed and specific.",
    "Buffered VPN doesn't have a trial, so we got started by choosing the monthly plan, entering our email, choosing a user name and password, and handing over our cash (cards, PayPal and Bitcoin are supported).",
    "Once the payment was accepted, the website redirected us to a 'Welcome Aboard' page. This asked us to complete our profile, but when we followed the link, we found a form requesting our home address. Oh, and recommended we keep this up-to-date in case our address changes. We're struggling to think of a good reason why Buffered needs this information, but the website didn't force us to provide it, fortunately. We just ignored the profile page, and Buffered didn't appear to care.",
    "After verifying our email address, the website pointed us to the appropriate client for our Windows review system, as well as listing its other downloads: Android, iOS and Mac, OpenVPN configuration files, and setup instructions for Linux, routers and more.",
    "The Buffered VPN Windows client opens with a mobile app-like location picker, a simple alphabetical list of servers with a Favorites system and a Recent Locations tab. There's no server load or ping information, and you can't expand a country to see locations within it, although the US does get three regional locations (East Coast, Midwest, West Coast.)",
    "Click a location, it connects quickly, and the client updates to display a lot of information: connection time, killswitch status, upload and download speeds, the total data uploaded and downloaded, and your new IP address. It all looks a little cluttered, to us, but if you really care about your current upload speed or any of the other bits and pieces, you might think differently.",
    "A Tools button pointed us at a 'Bandwidth test'. We expected this to link to a website, but no - the client interface is replaced by a speed dial which updates to show our current connection performance. That could be useful for troubleshooting, although we're not sure we'd trust any VPN provider to give us a completely accurate, objective and unbiased report on its own speed.",
    "A more useful Firewall Test tool verifies that ports 53, 443, 993 and 1194 (commonly used by VPNs) are available, a neat troubleshooting feature we've not seen included in an app before.",
    "The Settings page is more basic. You can manually set VPN ports and enable a kill switch, but otherwise it's all very ordinary (launch Buffered when Windows starts, automatically connect to the last server, and so on.)",
    "Overall, the Windows client works and is reasonably easy to use, but we have to question its design priorities. Buffered has equipped it with plenty of unusual features, but most of these just aren't very necessary, and we would have preferred more focus on higher value options such as adding support for more protocols.",
    "Mobile VPN apps can sometimes offer more or different features, but Buffered's Android offering had almost exactly the same interface and functionality as the desktop version (the only difference we could see is that it's missing the kill switch). This isn't necessarily a bad thing - the interface makes more sense on a mobile device - but the app still can't compete with the big-name VPNs.",
    "'Buffered' probably isn't a name you'd choose to imply high speeds, but our tests found that the service generally performed very well.",
    "Our local UK servers averaged a creditable 55-60Mbps, close to the maximum achievable on our 75Mbps test line.",
    "Near European servers were almost as impressive, for example with the Netherlands averaging 50-55Mbps.",
    "More distant European locations were generally above average, with one or two exceptions. Romania, for instance, struggled at 10-20Mbps, although even that is enough for most browsing and streaming tasks.",
    "The situation picked up with Buffered's better-connected US servers, seeing speeds return to a healthy 45-55Mbps.",
    "We noticed a few issues in the more distant or less common locations, for instance with Argentina limiting us to an average 10Mbps, and Australia 15-20Mbps. But again, they were never less than usable, and on the whole Buffered delivered very acceptable speeds.",
    "The Buffered website may not mention Netflix up-front, but it does explain that the service helps you 'enjoy the entertainment you want', and that it can bypass geo-restrictions by 'making it look like you're connecting from a different country.'",
    "We began testing this by logging into the UK server and trying to access BBC iPlayer. No luck, though - the site warned that 'this content is not available in your location.'",
    "Switching to the US East Coast server gave us some unblocking success, allowing us to view US-only YouTube content. That's not a very big success - we've only ever seen one VPN which couldn't unblock YouTube - but it's a start.",
    "The news got considerably better when we found the same server also enabled streaming US Netflix, a far more difficult task which defeats many other VPNs.",
    "This situation can change at any time, but that's where Buffered's 'one free hour a month' scheme could actually be useful. If Netflix access is a top priority, you can easily check it at any time and confirm that it still works for you.",
    "Buffered VPN has a wide range of support resources on its website, including setup tutorials, troubleshooting guides, and lots of FAQs and background information on VPNs in general.",
    "How useful these might be is open to question. Although there are a reasonable number of guides, they're sometimes short on detail, and we've seen more and better tutorials on offer with the likes of NordVPN and ExpressVPN.",
    "We also found some of the FAQs included misleading information, and seemed to be more about selling the advantages of Buffered than informing readers. For example, the 'What VPN protocols does Buffered support?' page tells us that Buffered doesn't support L2TP because it 'doesn't really offer any type of encryption.'",
    "Is this true? Well, sort-of, L2TP is about creating the tunnel, and doesn't in itself encrypt your data. But no VPN uses L2TP alone, instead they combine it with IPsec to authenticate and safely encrypt your information.",
    "To simply say that L2TP 'doesn't really offer any type of encryption' isn't very helpful, then, and is far from the standard we'd expect of a professional VPN. For a comparison, look at PureVPN's blog post on PPTP vs L2TP, a much more detailed and accurate piece, which explains that L2TP \"uses the IPSec suite to provide end-to-end encryption, data origin authentication, replay protection, as well as data integrity.\"",
    "If you're also unimpressed by the web content, support is available 24/7 via email and live chat. We opened a chat session and had a speedy and accurate answer to our test question. The website has plenty of issues, then, but Buffered can still deliver decent help when you need it, and that's what matters most.",
    "Buffered VPN delivers on speed, compatibility, Netflix and more, but weaknesses with the network, logging policy, support site and Windows client design make it hard to recommend. If you're keen anyway, use the one-free-hour-per-month mobile scheme to try before you buy."
  ],
  "headers": {
    "9": "Privacy and logging",
    "14": "Apps",
    "24": "Performance",
    "30": "Netflix",
    "35": "Support",
    "41": "Final verdict"
  },
  "links": {
    "merged": "https://buffered.com/signup",
    "full review of that service here": "https://www.techradar.com/reviews/encryptme",
    "Buffered": "https://buffered.com/#a_aid=futurepublishing",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "monthly plan": "https://buffered.com/signup",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "annual plan": "https://buffered.com/signup",
    "FAQ page": "https://buffered.com/faq/what-is-buffereds-logging-policy",
    "Privacy Statement": "https://buffered.com/privacy_statement",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "What VPN protocols does Buffered support?": "https://buffered.com/faq/what-vpn-protocols-does-buffered-support",
    "L2TP": "https://en.wikipedia.org/wiki/Layer_2_Tunneling_Protocol",
    "IPsec": "https://en.wikipedia.org/wiki/IPsec",
    "PureVPN": "https://www.techradar.com/reviews/pc-mac/software/utilities/purevpn-1325640/review",
    "PPTP vs L2TP": "https://www.purevpn.com/blog/difference-between-pptp-and-l2tp-protocols?aff=27226&a_bid=6e0928ec&siteID=TnL5HPStwNw-MT8Wwkk7RyffSOE4ENF7_Q"
  }
}