{
  "source": "https://www.techradar.com/reviews/world-of-warcraft",
  "title": "World of Warcraft: Shadowlands review",
  "category": "computing",
  "updated": "2021-07-30T09:18:44Z",
  "author": "bill-thomas",
  "summary": "Who knew death could be so fun?",
  "verdict": "In its early form, World of Warcraft: Shadowlands has the potential to be one of the best expansions in the game's history. The story is on point, the endgame systems are the most exciting in years, and the new graphics tech makes the game look more modern than ever before.",
  "pros": [
    "Excellent visuals",
    "Tons of new and exciting content",
    "Best dungeons yet",
    "Linear questing system is awesome"
  ],
  "cons": [
    "Amount of content can be overwhelming",
    "Combat abilities tied to covenant choice"
  ],
  "article": [
    "World of Warcraft: Shadowlands is the eighth expansion to the long-running MMORPG, and as such, it carries a lot of weight on its shoulders, especially following the maligned Battle For Azeroth. Much like 2016's Legion, Blizzard Entertainment finds itself needing to rediscover the identity of World of Warcraft in order to maintain dominance on the genre it helped popularize 16 years ago.",
    "And, as far as the early expansion experience goes, it succeeds. World of Warcraft: Shadowlands, at least at this early stage before the first raid opens up, stands as one of the best expansions the game has ever seen. However, the sheer amount of content you run into once hitting the level cap could be overwhelming, especially if you're approaching it from the same mindset as other expansions.",
    "Because of the nature of World of Warcraft, we will be updating this review periodically over the lifespan of the expansion to reflect changes made to the game. So, be sure to check back when new patches launch to see how the new content affects the overall experience.",
    "In both World of Warcraft: Legion and Battle For Azeroth, the questing experience was totally open-ended. Once you got into the expansion, you could choose any one of multiple zones and play through the stories in any order. Shadowlands, on the other hand, goes back to the same approach that Cataclysm and Mists of Pandaria took – guiding you through a specific linear path – and it's all the better for it.",
    "Moreso in Battle For Azeroth than Legion, the story was incredibly disconnected, with the different zone stories feeling completely separate from one another, which meant the questing experience was much less memorable.",
    "Because the main story in Shadowlands is inherently tied into everything you do while leveling up, however, it feels like your actions in the four different zones – Bastion, Maldraxxus, Ardenweald and Revendreth – actually matter to the overall story.",
    "The story opens up with you searching for allies in The Maw, an area where only the most irredeemable souls go after death, after they've been kidnapped and taken there. You obviously escape through some very WoW-like means (you're very very special uwu), and then go to Oribos, the main city and hub for the expansion. After that, you need to gather allies and resources in order to go back into the Maw to show the new villain, The Jailer, who's boss.",
    "But because the story is so linear, the journey through the zones feels impactful, rather than a collection of fun little detours like in the last expansion. All four zones flow into one another flawlessly, which makes for one of the best questing experiences the game has ever seen.",
    "Now, this approach could backfire as you try to replay it with multiple characters or alts. Blizzard has prepared for this by letting you level up subsequent characters through any of the zones with sidequests, world quests and dungeons. We only leveled up one character, however, so we haven't experienced this workaround system ourselves – yet.",
    "We hit the new level cap of 60 about halfway through the Revendreth zone, and had to do quite a bit of questing after hitting the cap in order to unlock all of the endgame features.",
    "Once you hit level 60 and get to the point where all of the expansion features are unlocked, there is a vast array of content that'll be open to you. The way Blizzard has conditioned players in past expansions to think that all content is mandatory if you wanted to maximize the amount of damage, healing or mitigation your character can do in raids, means that it is a bit overwhelming once you hit max level.",
    "But instead, it kind of marks a shift in focus for World of Warcraft. There is an absolute ton of content available, but you don't have to burn yourself out to complete all of it right when hitting level 60.",
    "Ultimately, you're able to prioritize the content that's important to you: rather than forcing players to slog through bad content like the Islands in Battle For Azeroth, you're able to just mainline dungeons if that's what you're into.",
    "A lot of the content will be through the lens of the covenant you choose. Once you hit max level, and hit a certain point in the story, you'll be able to choose to represent one of four groups: The Kyrian in Bastion, Necrolords in Maldraxxus, Night Fae in Ardenweald and Venthyr in Revendreth.",
    "Because all the zones and the covenants are so varied in theme and abilities, each of these covenants feel like a totally distinct choice, which means your personal experience through the endgame of World of Warcraft: Shadowlands will be totally different depending on which you choose – at least in theory. Again, the expansion hasn't been around long enough to see how differently each covenant will play out.",
    "We chose the Night Fae from Ardenweald, both because the theme fit so well with our character – a Restoration Druid – and because a website told us that the Convoke the Spirits Covenant ability was the best one for druids.",
    "That's probably how it's going to play out for most people, unfortunately. Because each Covenant gives you two new abilities that you can use in combat, a lot of players are going to be pressured into picking an ability that's less based on their own aesthetic preference and more on which ability will be best in Castle Nathria, when that raid opens on December 8.",
    "We're lucky in that playing alongside a bunch of fairies and ghostly forest creatures is something we're into. Some players, however, may not be as fortunate.",
    "Through your covenant, you'll have a daily activity to complete called a Calling. This will have you go to zones for World Quests, run specific dungeons, or other lightweight activity. By doing this you'll earn renown, which is absolutely key to advancing through the endgame content in World of Warcraft: Shadowlands.",
    "In our experience so far, these Callings aren't quite as tedious as the Emissary quests in previous expansions, as they're way more flexible and generally let you approach it however you want.",
    "Torghast: The Tower of the Damned is by far the coolest feature Blizzard has ever built into World of Warcraft. This will have you battling through multiple floors of enemies, traps and puzzles in order to fight one big boss at the end, to get the materials you'll need to craft Legendary equipment.",
    "Throughout each floor, you'll be able to unlock special abilities and upgrades that will make you do more damage, give you access to extra talents and abilities, or help you survive the later floors more easily. This system of unlocking special abilities awards exploration in these instances, and it's genuinely a rush the first few times you do it.",
    "The final boss of every run will drop Soul Ash, which you can use to craft Legendary gear, which will enhance your performance throughout the rest of the game with special effects. That's right, Legendaries are back in full force – but unlike Legion, where random Legendary items would drop off of everything you do, each specific Legendary effect is unlocked through a specific activity.",
    "This means you can figure out which Legendary item you want to unlock and work towards that specifically, and you won't be forced to do a whole bunch of content you don't actually want to do in order to maximize your chances of getting the right piece to drop.",
    "Because this is World of Warcraft, there's certain endgame content that's back, and isn't going to go anywhere. Raids and Dungeons have returned, along with the Mythic+ system that originated in Legion.",
    "However, Blizzard has time-gated a lot of the endgame content, and you won't be able to do any raids or Mythic+ dungeons until they unlock on December 8 for Mythic+ and Normal raids, and December 15 for Mythic raids and Raid Finder. That means a lot of the core content isn't quite available yet, but we'll be updating this article as we run this content to give a running impression of the expansion as time goes on.",
    "The 5-man dungeons are accessible now, however, just at lower difficulties. For the most part, they're some of the best dungeons in the history of the game, even though we are currently holding a grudge against Plaguefall just for being a major pain to heal through.",
    "The dungeon and raid content, in large part, is what each World of Warcraft expansion lives or dies by, so we're interested to see how things will play out through the next couple of years.",
    "After 16 years, you'd think World of Warcraft would look a lot worse than it does right now, but how good it looks right now blows us away.",
    "Every expansion sees Blizzard working in new technology to keep the game looking fresh, and it really knocked it out of the park this time around. The new Zones, especially Bastion and Ardenweald, are absolutely stunning, even by today's standards.",
    "Sure, it's not going to be on the same level of fidelity as Cyberpunk 2077 or whatever, but for a game that'll be old enough to vote by the time this expansion is over, it looks phenomenal.",
    "It's incredible how well this game scales from low-end to high-end, too. To get into this game, you don't really need an extremely powerful PC. The minimum requirements are an Intel Core i5-3450 and Intel UHD Graphics 630. Basically anyone can install World of Warcraft and play it efficiently.",
    "However, we played through this expansion on a PC with an Intel Core i9-10900K, 64GB of RAM and an Nvidia GeForce RTX 3090, and with ray tracing enabled at 5,120 x 1,440 we were still around 90 fps most of the time, and it looked stunning. No matter what level of hardware you come to World of Warcraft: Shadowlands with, you're going to get a great experience, and that's one of the things we'll always love about this game.",
    "Before any of the raids open or before any of the patches come out, it's impossible to tell where World of Warcraft: Shadowlands is going to fall in the game's history. Right now, we're very much feeling that early expansion euphoria that have come with playing a game for half of your life.",
    "Our early impressions lead us to think that this is going to be one of the best expansions the game has ever seen, right up there with Wrath of the Lich King and Mists of Pandaria. But because so much of what makes a WoW expansion great or not depends on what comes after the initial launch, we're just going to have to wait and see how things play out.",
    "One thing we can say for sure, however, is that the fresh surroundings, excellent story and fun new endgame systems have us excited to log into the game every single night, which hasn't happened since World of Warcraft: Legion. And for that, it deserves praise, especially in 2020 when everything is so chaotic IRL."
  ],
  "headers": {
    "3": "Tell me a story about death",
    "10": "Staying busy in the afterlife",
    "20": "Torghast is Legendary",
    "24": "The classics are still here",
    "28": "Aging with grace",
    "33": "Verdict"
  },
  "links": {
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "Nvidia GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "ray tracing": "https://www.techradar.com/news/ray-tracing"
  }
}