{
  "source": "https://www.techradar.com/reviews/huawei-p40-pro-review",
  "title": "Huawei P40 Pro review",
  "category": "phones",
  "updated": "2020-06-02T11:14:18Z",
  "author": "james-peckham",
  "summary": "The P40 Pro has superb cameras, but it’s hampered by its software",
  "verdict": "The Huawei P40 Pro’s hardware makes it the most polished and capable device the company has ever made, but the software experience cripples the handset. The lack of Google Mobile Services is a major problem for many would-be users, and while the camera, design and battery life are all first-rate, that Google-sized hole in the overall package means it’s a very difficult phone to recommend.",
  "pros": [
    "Phenomenal battery life",
    "One of the best cameras in a phone yet",
    "Likeable design"
  ],
  "cons": [
    "Frustratingly limited software",
    "Big camera bump",
    "Bezels don’t add much"
  ],
  "article": [
    "If you want a Huawei P40 Pro badly enough, you’ll be able to make the most of this handset – it offers a luxurious design, long lasting battery life and one of the best cameras we’ve ever seen on a phone.",
    "For the average user, though, this isn’t a phone we’d recommend. Owing to the Huawei ban in the US, the phone doesn’t have Google Mobile Services, meaning the handset doesn’t have access to popular Android apps like the Google Play Store, YouTube, Gmail and a multitude of others.",
    "In our time with the Huawei P40 Pro, we found this to be frustrating and it bordered on defeating the object of having a smartphone in 2020. Not being able to access the services we use on Android devices every day hampered our experience of using the Huawei P40 Pro, and it’s likely you’d find the same.",
    "That said, the Huawei P40 Pro does offer a premium design that excels anything the company had made before, along with a high-resolution screen that’s a genuine joy to use.",
    "The camera on the Huawei P40 Pro is one of the best we’ve ever used, delivering significantly improved performance in low-light scenarios, and offering a strong point-and-shoot mode that allows you to get great-looking photos each time you hit the shutter button.",
    "We also found the battery life on the Huawei P40 Pro to be top-notch, allowing you to get a full two days of use if you’re only lightly using the device.",
    "Ultimately, however – and we’ll explore this in more depth below – the Huawei P40 Pro is held back by its lack of useful software. With time, the experience will get better, and there are ways to get around some of the major frustrations; but when alternative devices from Apple, OnePlus and others cost a similar amount, and come packing the full range of apps you’d expect to find on a modern smartphone – it’s very difficult to recommend opting for Huawei’s latest.",
    "The company unveiled the Huawei P40, P40 Pro and P40 Pro Plus at an event at the end of March 2020, and the phone went on sale on April 7 in the UK, landing in Australia on April 16. There’s currently no sign of a US release date, and we doubt there ever will be an official launch in America.",
    "Huawei released the P40 Pro in one configuration, which is 8GB RAM and 256GB storage, and it's available in five colors: Silver Frost, Ice White, Deep Sea Blue, Blush Gold and Black; however, not all of these may be available to you, depending on where you are.",
    "As for the Huawei P40 Pro price, you're looking at £899 / AU$1,599 (around $1,100).",
    "Huawei smartphones are currently not available through US carriers or major retailers, though it's still possible to buy them; however, this usually means a higher cost, or relying on unverified online retailers, and software may not be optimized for US networks.",
    "This is the best-looking phone Huawei has ever released. It feels premium in the hand, and it uses similar materials to other top-end phones you can buy right now.",
    "The P40 Pro features what Huawei calls a 'Quad-curve Overflow Display’, which essentially means it has curved glass at all four edges. We've seen a few phones with curved sides – it’s a design feature that dates all the way back to the Samsung Galaxy S7 Edge – but with the Huawei P40 Pro you also get curved top and bottom edges.",
    "However, the display itself only curves at the sides, not at the top or bottom of the phone, where it's just the glass on top that’s curved. This gives the handset a unique feel, but it doesn’t change the look of the phone’s screen all that much.",
    "There are still very thin bezels at the top and bottom, and while these do look thinner than on competing phones, it’s not a drastic difference compared to, say, the Galaxy S20 Ultra.",
    "The 6.58-inch screen on the Huawei P40 Pro has a resolution of 1200 x 2640, which isn't quite Quad HD but equates to a pixel density of 441ppi, which is slightly lower than the current flagships from some other brands.",
    "For comparison the Galaxy S20 Plus comes in at 1440 x 3200 and 525ppi, while the iPhone 11 Pro is 1125 x 2436 pixels and 458ppi. In day-to-day use, however, most people will be unlikely to notice much difference, and we didn’t find it an issue during our time with the P40 Pro.",
    "The screen is bright and large, and looks gorgeous – we found it to be particularly good for watching video. Huawei has also increased the maximum refresh rate of the screen to 90Hz, which is faster than the 60Hz of its previous phones, although not quite as fast as competing handsets like the Galaxy S20 and Oppo Find X2 Pro, which offer a 120Hz display.",
    "A higher refresh rate essentially allows for a smoother image on the screen when you’re playing mobile games or scrolling through your social media feeds. It won’t be a must-have feature for many, but it’s a nice touch if you want a premium-feeling phone; 90Hz doesn’t feel as smooth as 120Hz, but it’s a noticeable difference compared to 60Hz.",
    "The 90Hz setting is enabled by default, but note that it will drain your battery faster that 60Hz, so if you’d rather conserve power, and can live without the smoother display, you can drop down to 60Hz in the settings.",
    "At 158.2 x 72.6 x 9mm the Huawei P40 Pro is a touch shorter and narrower than the Galaxy S20 Plus, and it fits nicely in your hand; however, you'll still need two hands to use it comfortably, and if you like smaller phones you may prefer the Huawei P40.",
    "Flipping the phone over, Huawei has gone from the flashy dual-color gradient finishes on the P30 to classier-looking solid tones for the P40 Pro. We've been testing the Deep Sea Blue version, but there are up to five colors up for grabs depending on your location.",
    "The most interesting shade is arguably Silver Frost, which is a satin finish, with the colors flitting between light silver and dark grey depending on how the light is hitting the phone. We think it looks nicer than the Cosmic Grey of the Galaxy S20 series, and it hides fingerprints quite well, giving it a cleaner look than most other phones.",
    "The Huawei P40 Pro has a huge camera bump; we’ll talk about this more later, but there’s no escaping the fact the camera array is housed in a rather large protrusion. Like it or not, if you want a high-end phone with impressive photography features in 2020, you'll have to embrace the bump.",
    "The power button and volume keys are on the right side of the phone, while on the base are a USB Type-C port and the single downward-firing speaker, which pumps out reasonable audio at a good volume. The dual nano SIM tray is also located here, and can also be used to expand storage.",
    "The Huawei P40 Pro is powered by the same Kirin 990 5G chipset that we’ve seen in the Mate 30 Pro 5G and Huawei’s folding phone, the Mate XS, and it’s plenty fast enough to keep up with the latest flagship phones from rival brands.",
    "We found it to be just as speedy as other top-end phones, such as the Galaxy S20 or iPhone 11, when we were darting around between apps and games. It scored an average of 2997 in our Geekbench 5 benchmarking, which is a similar score to the Samsung Galaxy S20 Plus, which sports a similarly top-end Qualcomm Snapdragon 865 chipset.",
    "Huawei’s processor is teamed with 8GB of RAM, and it’s worth noting that there’s no 12GB of RAM option available. That’s an interesting decision on the part of Huawei, as many other top-end phones in 2020 feature more RAM than this – although that said, we didn’t notice it being any slower than other top-end devices.",
    "You’ll have the choice of 128GB, 256GB or 512GB of internal storage, and that can be increased with microSD cards up to 256GB. We found the 256GB model to be more than enough, but you may want to max out your storage if you like to fill your phone with apps and media.",
    "The processor is also currently the only high-end chipset with integrated 5G, meaning it will work well with the dedicated 5G networks of the future, as well as with the current hybrid LTE/5G networks.",
    "Editor’s note: We were unable to test the Huawei P40 Pro’s 5G capabilities as we don’t live in an area which has access to the 5G network, and due to the coronavirus lockdown we were unable to travel to a 5G area.",
    "If there’s one thing that has made Huawei’s P series phones stand out from the crowd, it’s the camera tech. The P20 and P30 handsets raised the bar when it came to mobile photography, and Huawei is looking to raise it higher again with the P40 Pro.",
    "The Leica-branded camera setup comprises 50MP f/1.9 primary and 40MP f/1.8 ultra-wide cameras, and a 12MP telephoto camera that’s capable of 5x optical zoom or 50x digital zoom. There’s also a time-of-flight (ToF) sensor for creating bokeh effects in portrait-mode shots.",
    "Huawei continues to use an RYYB sensor for the primary camera, the one here is the largest Huawei has ever used, and it’s bigger than the one found on the Galaxy S20 Ultra. The RYYB (Red, Yellow, Yellow, Blue) sensor design is an alternative to the more traditional Red, Green, Green, Blue 'Bayer Pattern' filter on most camera sensors, and in theory enables the sensor to collect more light.",
    "Using pixel binning (whereby four of the sensor's pixels are combined into one larger one, enabling improved low-light performance at the expense of resolution) the effective pixel size is 2.44μm, and we found that the P40 Pro’s cameras performed phenomenally well in low-light conditions.",
    "Huawei is debuting its XD Fusion Engine in the P40 series, which uses AI to optimize your photos. Huawei was one of the first manufacturers to get on board with AI, and the results on the P40 Pro are impressive.",
    "What we liked best when testing this camera was how fast and effortlessly the P40 Pro enabled us to take shots. It really is just a case of pointing and shooting, with the AI doing much of the heavy lifting.",
    "There are more in-depth features for you to play around with here if you wish, but you’ll also get perfectly good shots from the automatic shooting mode.",
    "Huawei claims the AI can remove photo-bombing friends from a picture, and even reflections that appear when you’re trying to photograph something that's behind glass. We’ve yet to be able to test this properly, with the Covid-19 lockdown limiting our ability to go out and take photos, but it’s something we’re keen to test further.",
    "The P40 Pro also features impressive zoom capabilities, with up to 5x optical zoom and 50x digital zoom. Photos at such high zoom levels aren't very clear, though, and we’d recommend sticking to 10x for better picture quality. You can see examples of how the zoom performed below:",
    "We found the zoom capabilities matched what other top-end phones, such as the Galaxy S20 range, are able to achieve. Unlike the S20 Ultra, Huawei’s device doesn’t go up to 100x zoom, but that’s not a feature we think many people will be desperate to use.",
    "Huawei is also making much of the video capabilities on the P40 Pro, with an ultra-wide sensor that natively supports the same aspect ratio as DSLR cameras. We found video recording on the phone to work well.",
    "It's capable of recording in 4K, plus there are options for slow-mo and improved low-light video as well. It's also capable of telephoto video that allows you to zoom in and record video using the telephoto camera.",
    "On the front of the device there’s a lozenge-shaped cutout that houses a 32MP camera, plus an IR depth sensor that’s used for portrait mode shots as well as face unlocking.",
    "While this tech isn’t as secure as the dot projector system on the Mate 30 Pro, Huawei thinks it’s good enough for verification when using Huawei Pay, the company’s digital payment service.",
    "We found face unlock worked well, but there’s also the in-screen fingerprint sensor if you’re not keen on using your face to access your phone.",
    "The Huawei P40 Pro is running Android 10, the latest version of Google’s operating system, but without Google services, including applications such as Gmail and Google Drive. This is due to the restrictions the US government has placed on Huawei amid ongoing security concerns.",
    "That’s the elephant in the room with the P40 Pro, and for many it’ll be reason enough to avoid this handset.",
    "It’s a frustrating scenario, as this is something that has been out of Huawei’s control, but it makes this phone a lot less useful to the average person in the West than a device from a rival like Apple, Samsung or Google.",
    "Huawei’s own App Gallery – the company’s answer to the Google Play Store – is included on this device. It has some top-end apps – you can find a list of some key ones here – but a lot of heavy hitters are still missing.",
    "For example, there’s no Instagram, Facebook or WhatsApp directly available through the App Gallery. These apps can be transferred over to your phone via a feature called Phone Clone, but they’re limited in their functionality.– and that’s if you can get them working at all.",
    "We found Instagram just didn’t work on two Huawei P40 Pro devices we tested, crashing every time we tried to open the app. WhatsApp worked well throughout our testing, but it doesn’t connect to Google Drive, so we had to do without access to our backups of conversations.",
    "Often, we found it frustrating to use the Huawei P40 Pro for these reasons. The company promises it will be encouraging developers from around the world to optimise apps for its platform, but there’s a lot in the Google Play Store that you’d be missing out on here.",
    "On several occasions we found that we weren’t easily able to access popular services – for example, we wanted to order a takeaway one night and we weren’t able to use Deliveroo or Uber Eats.",
    "Some services are still available through Huawei’s own web browser, but it’s not as easy as using the YouTube or Gmail apps, for example, on your phone.",
    "A good example of a Huawei alternative app is when it comes to directions. You can't get Citymapper or Google Maps on this device, but if you're looking for directions there's a third-party app called Here Maps.",
    "All of the rest of the features of Android are provided here – including feature-of-the-moment Dark Mode – and Google’s OS comes with Huawei’s own overlay on top. It’s called EMUI 10.1, and it’s a lot better looking than Huawei software tended to be a couple of years ago.",
    "The Huawei P40 Pro has a 4,200mAh battery inside, and we found this to perform phenomenally well – we’d often get to the end of a busy day with between 20-30% left in the tank.",
    "It seems the processor on the P40 Pro has been well optimized for power management, ensuring that the phone will easily see you through a full day with average use.",
    "You’d need to be using the phone pretty lightly in order to get a full two days from a single charge, but this is the same for a lot of the P40 Pro’s top-end rivals.",
    "More good news is that the P40 Pro supports 40W fast-charging, with the charger included in the box. It can also be charged wirelessly, and offers fast reverse-wireless charging, enabling you to share your phone’s battery with other devices that can be charged wirelessly, such as headphones or another phone.",
    "First reviewed: April 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Huawei P40 Pro release date and price",
    "11": "Design and display",
    "25": "Specs and performance",
    "31": "Camera",
    "46": "Software",
    "57": "Battery life",
    "61": "Don’t buy it if"
  },
  "links": {
    "Huawei P40": "https://www.techradar.com/reviews/huawei-p40-review",
    "Samsung Galaxy S7 Edge": "https://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s7-edge-1315189/review",
    "Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Oppo Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "Mate XS": "https://www.techradar.com/reviews/huawei-mate-xs",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}