{
  "source": "https://www.techradar.com/reviews/lg-gram-17",
  "title": "LG Gram 17 review",
  "category": "computing",
  "updated": "2020-02-10T23:47:48Z",
  "author": "michelle-rae-uy",
  "summary": "All the makings of an Ultrabook",
  "verdict": "The extremely light and thin LG Gram 17 boasts good battery life, a decent number of ports and enough power for productivity, if you’re into large displays.",
  "pros": [
    "Incredibly slim and light for a 17-inch",
    "Lots of power for productivity",
    "Affordable price"
  ],
  "cons": [
    "Aging processor at this point",
    "Sound distorts slightly at highest volume"
  ],
  "article": [
    "To put it simply, the LG Gram 17 will surprise you.",
    "While other 17-inch laptops feel like big, bulky loads that are more burdensome to lug around than they’re worth, this one has thin and light written all over it. So much so that it’s easy to underestimate, as it carries more like a budget Chromebook at first blush than a productivity machine. The fact that it has a very simple, minimalist look also doesn’t help.",
    "Though you shouldn’t knock it. On top of being the lightest 17-inch laptop on the market when it came out, which is not at all an easy feat, the LG Gram 17 has a few merits under its belt – including being a CES Innovation Awards 2019 Honoree.",
    "In fact, it has all the makings of one of the best Ultrabooks. It boasts optional USB-C charging, decent battery life (up to 19.5 hours, according to LG), a good selection of ports, an impressively bright display with a 16:10 aspect ratio and, of course, all the power you’d need for productivity. It also has a fingerprint sensor for easier login, a Kensington lock for extra security, and a rugged metal alloy build that is shockproof, dust-proof and can withstand extreme temperatures.",
    "Essentially, you’re getting a surprisingly impressive laptop with all the tools for productivity you need, the portability you could ever want and all that extra real estate for a much lesser price point than the competition. And, as a reward, you’re also getting an incredible 1600p display with 359 nits of brightness.",
    "If you’re looking for that ideal 17-inch laptop that won’t feel like a massive burden to take with you on business trips and personal travels, you’ve truly found a winner in the LG Gram 17. There’s no doubt this is one of the best 17-inch laptops you’ll find in 2020.",
    "The LG Gram 17 is hardly a budget laptop. Its one and only configuration, which is fitted with an 8th-generation Intel Core i7 processor, Intel UHD Graphics 620 integrated graphics, 16GB of RAM and 512GB solid state drive, costs $1,699 (£1,199, A$2,699).",
    "All things considered, that’s more than a fair price. Not only are you getting a beautiful 17-inch 2560 x 1600 IPS LCD display and a reliable fingerprint sensor, but also a rugged body as well as its extremely portable, thin and light design on a 17-inch laptop.",
    "Again, to put that into perspective, the productivity machine HP ZBook 17 G6 with the same amount of storage and RAM will cost you $2,099 (about £1,618, A$3,110). This configuration has a 9th-generation Intel Core i7 chip and slightly better graphics, which give it a bit of an advantage, but it also only has a 1080p IPS screen with 300 nits of brightness.",
    "On the other hand, a Razer Blade Pro 17 with the same processor as the HP ZBook 17 G6 and powerful graphics made for gaming, but also the same amount of storage and memory, will set you back a whopping $2,499.99 (£2,399.99, AU$4,299).",
    "Closer to the LG Gram 17’s price point is the HP Elite Dragonfly, which currently tops our best laptops list. Primarily aimed at traveling professionals, an HP Elite Dragonfly with the same processor, integrated graphics and memory currently sits at $1,629 (£1,618, AU$2,770). And, it only has a 13.3-inch Full HD touch display.",
    "The same LG Gram 17 configuration is available in the UK for £1,199. While it doesn’t seem to be available on the LG AU website, the same configuration is also on hand in Australia from third-party sellers at A$2,699.",
    "It might be easy to underestimate the LG Gram 17 if you were to judge a book by its cover. After all, this laptop doesn’t seem to have any exceptional features at first glance, only a simple dark gray design with the word “gram” etched on top. Some might even go as far as calling it unattractive.",
    "However, you only need to lift this laptop to appreciate its appeal. The LG Gram 17 is the lightest 17-inch laptop out there, touting a weight of just 2.95 lb – making it 0.07 pounds lighter than the considerably smaller MacBook Pro 13-inch. At 15.0 x 10.5 x 0.7 inches, it’s also only slightly bigger than the MacBook Pro 16-inch.",
    "This is a laptop you’ll want to throw in your backpack or in your leather tote bag, if you’d like to squeeze in a bit of work while traveling or if you want to work on the go.",
    "It’s a good thing that it’s made of carbon nanotube-reinforced magnesium alloy, as this laptop might also be as rugged as the MacBook Pro, too. We weren’t able to test just how strong, but it’s supposedly shockproof, dust-proof, resistant to low pressure and able to withstand extreme temperatures.",
    "Of course, this being a productivity machine, the amount and diversity of ports is very important. Thankfully, LG hasn’t tried to economize here. There’s a decent assortment of ports on this laptop, from the necessary USB 3.1 (there are three), Thunderbolt 3 (charging capable) and headphone jack to HDMI and micro-SD. It also comes with a USB 3.1 adapter for RJ45 Ethernet.",
    "There’s not a lot to complain about the LG Gram 17’s general design, either. The keyboard has a nice tactile feel, good bounce and decent travel, making it great and comfortable to use for productivity. The trackpad works well and has a bit more give than expected. The speakers get pretty loud and boasts a decent soundstage. And, the fingerprint reader on the power button is extremely reliable.",
    "However, if we were to nitpick, there are a couple of things worth mentioning. The laptop does generate a bit of heat near the back portion of the keyboard when performing more intensive tasks. In addition, the speakers do get a little distorted when on full volume. These issues are hardly unique to the LG Gram 17, though.",
    "Bear in mind, too, that thin, light and rugged are not the LG Gram 17’s only defining features, design-wise. One of the best things about this laptop is its 17-inch QHD (2560x1600) IPS LCD display. On top of the fact that it’s a 17-inch on a 15.6-inch form factor, it boasts a 16:10 aspect ratio, which essentially gives you an even bigger canvas.",
    "Most importantly, this screen delivers incredibly beautiful picture quality with 359 nits of brightness, 1600p resolution and over 96% color gamut. So whatever it is you’re doing on this laptop – whether that’s streaming movies and shows or doing work – you’ll be doing it on a display that’s a complete stunner.",
    "The LG Gram 17 is a laptop built for productivity. It’s Intel Core i7-8565U processor may seem outdated at this point on paper, especially with Ice Lake out now and Tiger Lake coming in 2020. However, it’s more than powerful enough for productivity.",
    "We tested this ourselves by having 20 tabs open at the same time on the browser, with four of them streaming video and one downloading a massive file. Granted, loading new tabs near the end took a second longer to load. But, on the upside, we also didn’t notice any stuttering or interruption of anything that’s already open including the videos. The 16GB of memory certainly helped.",
    "Unfortunately, with only the Intel UHD Graphics 620 for graphics, the LG Gram 17 definitely cannot play anything resembling current AAA games.",
    "It’s ok for casual gaming. However, it delivered really low framerates with Shadow of the Tomb Raider, as well as had a lot of stuttering and frame rate drops with Plague: An Innocence Tale and Hellblade: Senua's Sacrifice. The Wolf Among Us played fine, but at the same time, it’s an older game with much lower requirements. Because this is not a gaming laptop however, this shouldn’t be too surprising.",
    "This shows in our benchmarks. In Cinebench R15, the LG Gram 17 garnered 513 points, which is just a hair under what the popular HP Spectre x360 got, and more or less half of the Razer Blade Pro 17 (2019) gaming machine.",
    "In Geekbench, the LG Gram 17 holds its own, scoring more than the HP Elite Dragonfly and Razer Blade Pro 17 (2019) in the single-core test. It also scored above the HP Elite Dragonfly in the multi-core test - but that laptop is running an older 8th-generation processor.",
    "We definitely wouldn’t count on doing intensive creative tasks with this laptop, let alone graphics-heavy gaming. However, if you want a portable for productivity that’s reasonably priced and on which you can do a bit of streaming as well as light gaming after work, know that you’re getting a lot of value with the feature-rich LG Gram 17.",
    "According to LG, the LG Gram 17 boasts up to 19.5 hours of battery life, which would have been incredible. Unfortunately, in the TechRadar battery test, where we loop 1080p video until the laptop dies, it only lasts 10 hours and 44 minutes. That’s about 9 hours short of what’s being promised.",
    "However, it’s also 2 hours and 30 minutes longer than the Elite Dragonfly, which only lasted 8 hours and 11 minutes during the test, and only an hour less than the MacBook 16-inch’s 11 hours and 41 minutes.",
    "That means that it’s about on par with the competition, battery-wise. Plus, 10 hours and 44 minutes is also more than a full day’s work, which means that the LG Gram 17 will see you through 8 to 9 hours of work on a full charge. It also means that you can work while traveling, whether that’s on a transcontinental flight or on a train ride from London to Edinburgh, without needing to whip out the charger."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Price and availability",
    "12": "Design",
    "21": "Performance",
    "28": "Battery life",
    "31": "Don't buy it if..."
  },
  "links": {
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "best 17-inch laptops": "https://www.techradar.com/news/best-17-inch-laptop",
    "HP Elite Dragonfly": "https://www.techradar.com/reviews/hp-elite-dragonfly",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Ice Lake": "https://www.techradar.com/news/intel-ice-lake",
    "Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2020"
  }
}