{
  "source": "https://www.techradar.com/reviews/coolcut-112",
  "title": "Coolcut 1.1.2 review",
  "category": "computing",
  "updated": "2020-10-23T15:49:22Z",
  "author": "steve-paris",
  "summary": "Does this video screen grabber have everything you need to edit your project?",
  "verdict": "If you’re looking for a screen grabbing tool, Coolcut may meet your needs. It’s been much improved since the last time we looked at it - when it was called GoPlay - and despite a handful of niggles, is well worth a look.",
  "pros": [
    "Simple video screen grabbing tools",
    "Can build an edit fast",
    "Acceptable video editing tools"
  ],
  "cons": [
    "Webcam recording are is embedded in the screen recording rather than saved separately",
    "Dubbing doesn’t automatically mute the audio on other layers"
  ],
  "article": [
    "Coolcut (formerly GoPlay Video Editor) is a Windows-only app which is not strictly speaking a traditional video editor. It’s main focus lies in being able to record your screen - a very useful tool if you’re into making tutorials, or recording your game sessions, for instance.",
    "When you first launch the app, you’re offered a very simple menu: ‘Recorder’, or ‘Video Editor’. Since we’ll be needing footage, let’s take a look at its recording capabilities first.",
    "The first time you launch either Recorder or Editor, little onscreen tutorials appear to help you quickly understand some of the major features of Coolcut. It’s a great way to make you feel at ease when tackling a new or revamped application.",
    "Having Clicked on ‘Recorder’, you’re then graced with a live preview of what is currently seen on your screen. All the controls you need are along the edges of that window. By default, Coolcut will record the entire screen for you, but you can select ‘Window’ instead to focus on a specific area, ignoring everything else. You are also free to resize that selection and even choose specific dimensions depending on your screen’s resolution.",
    "There’s an option to use a webcam connected to your PC to record yourself instead of your computer screen, or, if you select the ‘picture in picture’ option, you can do both at the same time. This is a cool feature which works as advertised, but you must specify how big you want the recording of yourself to be, and where on the screen you want to place it prior to starting the session; you cannot alter this during the editing process. The video of yourself is essentially burned onto the footage as it’s being recorded, which greatly limits your editing options.",
    "You also have the ability of recording the audio that comes from your PC and/or the one from your built-in microphone.",
    "Top of the screen is a quality option. By default it’s set to ‘Lossless’, but if this proves too taxing for your computer, you have other options available.",
    "You also have the ability to do live recordings (ie stream them on the web), but you need to manually enter the live RTMP address before you can do that.",
    "Once all your preferences are set, hit the blue ‘Rec’ button, and Coolcut will immediately begin recording the screen. Stoping the recording is done either via a keyboard shortcut or by clicking on that button once more (which has turned red and is now labelled ‘Stop’).",
    "The Editing part of Coolcut looks and feels like a regular non-linear video editing app, with better options than were available in previous versions.",
    "Any footage you’ve recorded appears in the browser section. Double-click on any clip to see it in the preview window to the right. Not only are the screen recordings there, but you can also import any number of other video clips stored on your hard drives.",
    "Just as you’d expect, you create your video in the Timeline area. Coolcut doesn’t allow gaps in your video so as you drag more and more clips, they’re automatically added to the end of the previous one. Even better, delete a clip within your edit and all footage to its right is automatically moved to the left. This allows you to build an edit fast.",
    "The editing tools have been beefed up in this version. In addition to being able to cut a clip, you can alter its speed, crop it, generate a freeze frame (when you wish to focus on a specific section for longer for instance), and even have access to green screen parameters.",
    "You can only work with one video track - which really labels this app as a basic editor. There is a sort of workaround thanks to two picture in picture tracks. As its name suggests you can add a video on top of another, but by default, that second video will be smaller than the one underneath it. However, not only can you reposition it to where you want it to be, you can resize it too.",
    "So theoretically, this could allow you to work with up to three layers of video, but you’d have to resize every clip you add there, and if you delete a clip in the primary track it won’t affect the picture in picture clips’ position, so this is a solution that is very far from ideal.",
    "However, as a picture in picture tool, it works very well. You can use it to add a watermark for instance, or insert a small piece of video. Don’t forget though that if you recorded yourself at the same time as your computer’s screen, that ‘picture in picture’ effect cannot be altered from its original position. Considering the tools are there, it’s very frustrating the webcam video is ‘baked in’ as it is.",
    "You have access to a good number of transitions, from the basic cross dissolve (which it calls Fade in and Fade Out), to more interesting motion and 3D effects.",
    "We do appreciate the fact that simply mousing over the transition’s thumbnail gives you an animated preview of what to expect. This applies to Filters as well.",
    "You also have numerous titles to choose from to add to your video.",
    "Scroll down your available layers in the timeline and you’ll notice additional ones past the Pic-in-Pic layers: Text1 and Music1 are self explanatory, but then you get to Dubbing1.",
    "If you’re not keen on recording a narration as you’re grabbing the screen, you have the option of doing it as you’re working on the edit via the ‘Dubbing’ button, and this is where those tracks will appear.",
    "Click on that button, and the audio recording starts immediately at the playhead’s location. Unfortunately it still doesn’t mute the other layers as you do so, meaning that if you forget to mute the tracks yourself, it will make it impossible to reposition your voice-over to another position later on, or even edit it, as you’ll transfer a copy of the background audio too. It’s an odd omission to have made, and it would’ve been better for any audio to be muted automatically as you click on that button.",
    "Once you’re happy with your video, it’s time to share it. Coolcut offers you a series of options. You get to chose its format, resolution, bit rate and frames per second (or just leave those as standard if you’re not certain about them). As expected, the free version forces you to include a ‘Coolcut’ end credit. If you want to get rid of that, you need to become a VIP (more on that later).",
    "Another way to avoid the end credit and still not pay those hard working developers, is to choose ‘GIF export’ instead. But be aware that a GIF has no sound, and its quality and resolution is severely constrained. Still, the option is there if you’d like to make a meme, or something.",
    "Finally, you can sidestep all that video you recorded and edited, and only export the audio.",
    "All these options are leaps and bounds better than what was available in previous versions.",
    "There are two flavours to this software: Ordinary and VIP. The first one is free but doesn’t include all features in Recorder or Editor, and also adds a watermark to your video. Possibly the worst limitation is a restriction to only record two minutes at a time. To remove all this, you need to choose VIP.",
    "This can be done on a month by month basis for $9.80 per month, pay three months at a time for $12.90 per quarter, or forgo the subscription model and pay for the software outright for $49.50.",
    "The most popular option is $39.48 per year, which includes a free 3-day trial.",
    "Coolcut’s selling point is its video screen grabbing capabilities, and this works pretty much as you’d expect. The editing section of this app has been vastly improved, and so are its exporting options. It’s just a shame that there are still some puzzling design decisions which hamper what could be a very good product.",
    "However, those major niggles are few. Everything else is miles better than it used to be, and is well worth taking a look at Coolcut if you’re interested in making short screen recordings for free, or pay to make longer ones."
  ],
  "headers": {
    "1": "Interface",
    "3": "Recorder",
    "9": "Editing",
    "13": "Picture in picture",
    "16": "Effects and transitions",
    "19": "Audio recording",
    "22": "Exporting",
    "26": "VIP",
    "29": "Final verdict"
  },
  "links": {
    "Coolcut": "https://www.coolcut.tv/",
    "GoPlay Video Editor": "https://www.techradar.com/reviews/goplay-video-editor",
    "video editor": "https://www.techradar.com/best/free-video-editing-software"
  }
}