{
  "source": "https://www.techradar.com/reviews/sunvpn",
  "title": "SunVPN review",
  "category": "computing",
  "updated": "2020-12-18T16:48:35Z",
  "author": "sead-fadilpasic",
  "summary": "Fast, but it lacks finesse",
  "verdict": "SunVPN excels when it comes to speed, unblocking capabilities and affordability. But it falls down in other areas, such as platform support, data traffic caps and detail on the website. It does, however, have an excellent free tier that gives you a glimpse into its premium offering.",
  "pros": [
    "Strong speeds",
    "Unlocks Netflix, BBC iPlayer",
    "Low prices",
    "Free tier"
  ],
  "cons": [
    "Only usable on Windows and Android for now",
    "Limited monthly traffic",
    "Website lacks critical information"
  ],
  "article": [
    "SunVPN is a small provider of VPN services with support for only two platforms (Windows and Android) for now. But native clients for a wider range of devices is on the way.",
    "Each SunVPN account supports simultaneous VPN connections on 3 devices. The accounts are charged per device and duration, so the pricing plans are:",
    "These rates are among the cheapest on the market, but the plans do have some drawbacks. Specifically, the accounts have a limited amount of data you’re allowed to transfer per month (up to 10TB), which should be enough for most users, but is still a limitation.",
    "If you’d like to give this provider a test run, you’re free to do so thanks to a trial that is limited only in the number of available servers. There’s also a 7-day money-back guarantee if this is your first purchase with the vendor.",
    "SunVPN accepts payments made via PayPal and Alipay.",
    "This VPN solution does have its advantages but it's not on the same level as top players in the market like ExpressVPN, NordVPN, or CyberGhost.",
    "All offer gorgeous native clients, thousands of servers, and unlimited traffic, but are admittedly more expensive than SunVPN.",
    "Being able to unblock geographically restricted streaming content on platforms like Netflix and BBC iPlayer has become an important feature in the VPN world. In our tests, we discovered that SunVPN can, indeed, unblock localized content on both platforms.",
    "This VPN is run by a company called SunVPN Services, whose exact location is unknown. We looked everywhere and the only (vague) mention of a location is in its Terms of Service, where it’s simply called the “Country”.",
    "Wherever this company may be seated, it offers access to an unclear number of servers in 38 countries worldwide, including Brazil, Latvia, Turkey, Russia, Egypt, South Africa, Vietnam, and others.",
    "Why \"unclear\"? Because it first states that it has 500+ servers but further down the page, the number is changed to 100+. We got no clarification from customer support.",
    "Failing to find relevant information on the website, we sent customer support an inquiry about encryption, protocols, and support for torrenting. We’re still waiting for the response but, in the meantime, we recommend against torrenting.",
    "As for the encryption, the only information available on the website is that the service uses “proprietary encryption technology”. No more details have been provided.",
    "There are two main connection modes. In the Region Mode, only network data outside your own region will use the provider’s proxy server. In the Global Mode, all network data uses the proxy server.",
    "The apps also include an Exceptions List, where you can add a list of domains that can receive your data without going through the proxy server. Additionally, you can add domains to the Ignore List, or the list of domains toward which your data will always go through the proxy server.",
    "SunVPN states that its “strict zero-logs policy keeps your identity under wraps. We and our systems do not record any of your activity”. However, in the provider’s Privacy Policy, we do find out that some information is actually logged “when using the Application”, but with your permission and you can revoke it whenever you feel like it through your device’s settings.",
    "SunVPN has native apps for Windows and Android, but apps for iOS, Mac, and Android TV are under development. The Android app has been rated by 32 users so far, who have given it 3.8 stars (out of 5), but has been downloaded over 1,000 times.",
    "The information offered on the website is very scarce, so you’ll have to rely on email only, as there’s no other channel of communication with customer support.",
    "We found the apps very easy to navigate and switching servers was simple. The download speeds were tested on an 80Mbps connection.",
    "Our first target location was the one closest to us among those offered in the trial - Amsterdam, The Netherlands. We first tried Region Mode, which gave us an exceptionally fast 47.23Mbps. Then we switched to Global Mode, which should be slower in theory since the data passes through a proxy, but the speed actually improved, reaching 50.73Mbps.",
    "We then wanted to see how a location across the ocean would fare, so we picked New York, USA. Region Mode delivered a very nice 16.17Mbps, but the Global Mode did substantially worse: 6.32Mbps.",
    "Finally, we decided to pay a visit to a server in Hong Kong, which delivered 7.65Mbps in Region Mode and 8Mbps in its Global Mode - both fast for a location so far away from ours.",
    "SunVPN is fast, cheap, and it unblocks geo-blocked streaming content. However, it has a way to go if it aims to compete with the largest fish in the VPN market.",
    "It will soon benefit from clients for iOS and Mac, but more servers, extra information on the website and getting rid of data traffic limitations would all deliver marked improvements."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "11": "Privacy and encryption",
    "16": "Support",
    "18": "Speed and experience",
    "22": "Verdict"
  },
  "links": {
    "SunVPN": "https://www.sunvpn.world/web/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Terms of Service": "https://www.sunvpn.world/web/app/terms",
    "Privacy Policy": "https://www.sunvpn.world/web/app/privacy",
    "Android app": "https://play.google.com/store/apps/details?id=com.klib.solitary.mobile",
    "email": "mailto:support@sunvpn.world"
  }
}