{
  "source": "https://www.techradar.com/reviews/shadeyouvpn",
  "title": "ShadeYouVPN review",
  "category": "computing",
  "updated": "2020-10-16T15:49:25Z",
  "author": "sead-fadilpasic",
  "summary": "Looking for a good VPN? Just don’t bother with this one",
  "verdict": "ShadeYouVPN should be a good choice for a really modest user - offering top anonymity and access to Netflix and torrenting. However, a very limited number of servers are available, and even then, most of them won’t work.",
  "pros": [
    "Unblocks Netflix, Hulu",
    "Very affordable",
    "Free trial + money-back guarantee"
  ],
  "cons": [
    "Serious connectivity problems",
    "Client only for Windows",
    "Unreliable customer support",
    "Limited privacy policy"
  ],
  "article": [
    "ShadeYouVPN is a Scotland-based provider of VPN services that has been active since 2012. It provides the essential VPN capabilities, including support for torrenting and select streaming channels.",
    "However, if by the time you finish reading this review you realize ShadeYouVPN isn’t right for you, you’re welcome to take a pick among one of the best VPN services in the industry.",
    "ShadeYouVPN offers two slightly different packages - Standard and Premium, both available at different lengths. The Standard option’s monthly subscription costs $3.95/month, the 6-month is available at $2.83/month, and the 12-month subscription at $2.16/month. It allows simultaneous use on up to three devices and provides 18 VPN servers in 12 locations.",
    "The Premium 1-month subscription costs $7.95/month, 6-month $3.5/month, and 12-month $2.33/month, placing it among the cheaper VPN services. It supports up to five simultaneous connections and offers access to 25 VPN servers in 15 locations.",
    "You can pay using credit cards, PayPal, Bitcoin, PerfectMoney, WebMoney, Qiwi, Ukash, Payeer, and more. If you’d rather test the service out before paying, there’s a 24-hour trial, which isn’t very long but will allow you to run it a few times and check what it’s got. Be careful, though - the free trial starts as soon as you sign up, not when you click the activation link in the email, as would be the logical choice. There’s also a 7-day money-back guarantee if you do pay and realize you’ve made a mistake.",
    "Premium VPNs like ExpressVPN, NordVPN, or CyberGhost are much more competent in all the departments in which ShadeYou fails, even if some of them may cost more. Besides, even though ShadeYou is very affordable, there are cheaper products out there so we recommend giving Surfshark a go if you want a truly capable and reasonably priced platform.",
    "ShadeYou will provide you with access to streaming services that may be blocked in certain regions, including Netflix, Hulu, Spotify, and Last FM. That is, if you ever manage to connect to a server that allows you to access these services.",
    "According to its website, ShadeYou is registered in the city of Inverness, Scotland, UK. It offers its users access to 18 servers in 12 locations or 25 servers in 15 locations, depending on the chosen subscription package (although they may not be accessible at all times). The covered locations include countries like Ukraine, Hong Kong, Russia, and Romania.",
    "This VPN vendor relies on OpenVPN, L2TP/IPsec, and PPTP transfer protocols, as well as the 2048-bit encryption and 4096-bit encryption, depending on the chosen package. Other privacy-oriented features include DNS leak protection and a kill switch that steps in whenever your VPN connection is interrupted and shuts down your Internet access to prevent leaking of your sensitive information.",
    "Unrestricted torrenting and P2P traffic are allowed on some servers and the provider promises never to keep logs of your online activities - “ShadeYouVPN.com does not collect information about the activities of our clients on the network. We do not keep logs , so we simply do not have data that could be transferred to third parties.”",
    "We aren't, however, told what exactly does the company mean by “logs”, and we have no way of verifying the no-logging claims, as ShadeYouVPN is yet to invite an outside auditor to test it and issue a report like some other VPNs have done. Also, its location isn’t very promising in terms of privacy, as the UK is one of the co-signatories of some of the global intelligence-sharing agreements.",
    "ShadeYou only has a client for Windows but supports other platforms via manual installation and third-party OpenVPN clients. These other platforms include Linux, Android, iOS, and certain routers, and the provider offers detailed instructions on installing the service on them.",
    "The FAQ section is rather modest, however, but you can get more help if you contact customer support via web form and email at support@shadeyouvpn.com. Regrettably, there’s no live chat option so you’ll need to arm yourself with patience before anyone sees your message. We’re still waiting for the response to our inquiry.",
    "Despite other platforms requiring a bit more work, the Windows client is very easy to get around in, and we had no problems installing it. The download link was provided on the website, and we only had to follow simple installation steps. Once you’ve signed up for an account, you’re ready to start using the app. Do note that the settings are rather sparse, and there isn’t much you can customize save for the switching on/off the kill switch, proxy, DNS leak protection, and a couple of other basic options.",
    "The download speeds were very low - when we managed to connect. Namely, the first dozen times we tried connecting to various servers, the app stayed on “connecting” pretty much forever. We kept trying until eventually one server worked - the one in Russia, but it was extremely slow - 0.23Mbps on our 55Mbps connection.",
    "We later discovered that only four servers on the provider’s network status list were operational - all the others had the “technical work” notice. You should also note that the network status list is inaccessible in the app itself so it’s impossible to know which server to connect to without consulting the website.",
    "When it manages to connect, ShadeYou VPN does what it’s supposed to, albeit under remarkably slow speeds - hides your online activities with strong encryption, provides access to some geographically blocked services and websites, and enables sharing large files via P2P clients.",
    "However, most of its servers don’t even work, so obviously you should be looking at other solutions available on the market. For instance, a top performer such as ExpressVPN is a much better choice despite its higher price, as it provides thousands of servers that deliver lightning speeds and never fail to connect, lots of features and extras, access to a long list of streaming services, and 24/7 customer support via live chat, all of which ShadeYouVPN lacks."
  ],
  "headers": {
    "2": "Price",
    "5": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "11": "Support",
    "13": "Speed and experience",
    "16": "Verdict"
  },
  "links": {
    "ShadeYouVPN": "https://shadeyouvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "its website": "https://shadeyouvpn.com/",
    "support@shadeyouvpn.com": "mailto:support@shadeyouvpn.com",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-8071983322400852000"
  }
}