{
  "source": "https://www.techradar.com/reviews/flow-vpn",
  "title": "Flow VPN review",
  "category": "computing",
  "updated": "2020-11-18T20:12:15Z",
  "author": "sead-fadilpasic",
  "summary": "No torrenting but very easy-to-use",
  "verdict": "We found Flow VPN to be a solid performer - unless you plan to torrent or stream popular services like Netflix or BBC iPlayer.",
  "pros": [
    "Free trial",
    "User-friendly apps",
    "Solid speeds"
  ],
  "cons": [
    "Doesn’t support torrenting",
    "Some logging",
    "Not many features"
  ],
  "article": [
    "Flow VPN is a provider of VPN services that offers simple native clients for all major platforms, as well as manual configuration options for additional ones.",
    "Its product is solid in terms of performance, but doesn’t allow torrenting due to the amount of illegal file sharing that occurs via torrenting clients.",
    "It also logs some information, and there aren’t as many features as you might be used to with the best VPN companies.",
    "All of Flow VPN’s subscription options are accompanied by a free trial, so you can take the platform for a spin before making a final decision on whether you want to purchase it. The trial typically lasts for three days if you’re installing on Windows, seven days for mobile devices, and if you’re using PayPal or Stripe, you’re getting five days. The subscription options include: monthly at $5.99/month, quarterly at $4.99/month, and annual plan at $3.99/month. Do note that the free trial doesn’t seem to be included in the monthly subscription.",
    "You can use your subscription on up to 4 devices at the same time, although current bandwidth per user is limited. However, FlowVPN says this limit is “set more than high enough to allow smooth streaming of HD video and fast file downloads, but if you’re using your account on several devices at the same time you will notice things slowing down.”",
    "There’s no money-back guarantee, and the company states that any refund requests “will be made at the discretion of Flow VPN management and only after investigations have taken place.” Accepted payment methods include credit/debit cards, PayPal, Alipay, UnionPay, Stripe, and Paymentwall.",
    "Flow VPN performs well but falls well behind some of the VPN industry’s A-listers like ExpressVPN, NordVPN, Surfshark, CyberGhost, or PrivateVPN, all of which support torrenting, offer more features, and can provide access to Netflix and BBC iPlayer. Some of them even cost less.",
    "Although access to services like Netflix and BBC iPlayer that are often unavailable in certain places is one of the most sought-after qualities for a VPN, Flow VPN cannot guarantee it. You may have luck with certain servers sometimes but if having reliable access to such VOD channels is important to you, you might want to consider one of the alternatives.",
    "Flow VPN is the product of Portable Ltd, a company registered in Warwick, UK, which is also the owner of Global VPN and UK VPN. The company ensures access to a network counting over 1,000,000 IP addresses and 250-300 servers spanning across over 60 countries, including Turkey, Hong Kong, Australia, Costa Rica, Panama, Kazakhstan, Serbia, and South Africa.",
    "To protect your privacy, Flow VPN uses an NAT firewall that prevents unwanted inbound traffic, PPTP, L2TP, OpenVPN, and IKEv2 protocols, as well as the “bank-grade 128-bit encryption to secure your traffic” (do note that most VPN providers use the stronger 256-bit encryption).",
    "In its Mac and iOS apps, the vendor also offers SSH tunnelling “that encapsulates VPN traffic through the SSH protocol giving highly secure, firewall-friendly connections.” Flow VPN doesn’t support traffic via torrenting clients like BitTorrent, citing the risk of legal action if it’s used for illegal file-sharing.",
    "The company’s Terms and Conditions state that it “monitors and records some of the data transferred across our network”, during the normal use of the service. The purpose of this is to “monitor the load of each server to allow us to plan capacity and improve services, provide customers with their recent connections in the app, and to identify abuse of our service”. The information collected includes connecting IP address, authentication requests, session data (allocated IP, connection date, time, duration, etc.), which is considerably more than what many other VPN providers (claim to) collect. Whether or not more information is collected, we can’t tell, at least not until an independent auditor is invited to examine the platform.",
    "Flow VPN has apps for iOS, Mac, Android, and Windows, as well as browser extensions for Chrome and Firefox. Manual configuration is available for routers so you can connect multiple additional devices.",
    "Its iOS app has a rating of 4.7 (out of 5) as judged by 3.100 users and was last updated on January 25, 2020. The Android app doesn’t have such a great score - only 2.5, rated by 6 users. It has been downloaded 1,000+ times and was last updated on May 28, 2020.",
    "Should you require assistance, you can consult Flow VPN’s knowledgebase that contains troubleshooting articles, answers to frequently asked questions, and configuration instructions for the supported devices. If you’d like to talk to someone on the team, the provider claims to have 24/7 customer support, but it is only available via email or ticketing system. That said, you won’t be left hanging for a long time - we got an email response from the friendly customer support in less than 2 hours even though our query was more general in nature.",
    "The apps are very minimalistic, which makes them incredibly simple and easy to use. However, switching between servers requires disconnecting from the active one first, then choosing another server and clicking the ‘Connect’ button.",
    "We first tested a server relatively close to our physical location - Croatia. This server hailed a solid 20Mbps on a 47Mbps testing connection. Lithuania gave us a much lower but still usable 13Mbps while a server in Argentina performed expectedly even lower, with 4.64Mbps.",
    "Flow VPN doesn’t stand out much from the crowd, save for the fact that it offers a free trial that varies based on your chosen method, as well as some of the most minimalistic and user-friendly apps we’ve seen so far.",
    "Unfortunately, it doesn’t support torrenting, logs more information than we’d like, it’s unreliable for any serious Netflix/BBC iPlayer streaming, and doesn’t have thousands of servers, unlike its competitors and ultimate performers such as ExpressVPN. That said, it doesn’t cost an arm and a leg (although there are cheaper solutions) and provides stable connections with solid speeds to the nearby servers."
  ],
  "headers": {
    "3": "Price",
    "6": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "9": "Privacy and encryption",
    "12": "Support",
    "15": "Speed and experience",
    "17": "Verdict"
  },
  "links": {
    "Flow VPN": "https://www.flowvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "PrivateVPN": "https://www.techradar.com/reviews/privatevpn",
    "Terms and Conditions": "https://www.flowvpn.com/terms-vpn/",
    "knowledgebase": "https://www.flowvpn.com/support/knowledgebase/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1181998840049506300"
  }
}