{
  "source": "https://www.techradar.com/reviews/hp-omen-15-2020",
  "title": "HP Omen 15 (2020) review",
  "category": "computing",
  "updated": "2020-12-11T15:06:48Z",
  "author": "laura-francis",
  "summary": "HP is back with a beast of a gaming laptop",
  "verdict": "The HP Omen 15 is a powerful gaming laptop which packs in a strong performance and excellent visuals despite being heavy and bulky to carry around on a daily basis.",
  "pros": [
    "Great for multitasking and streaming",
    "Excellent gaming performance",
    "Great display"
  ],
  "cons": [
    "Heavy and bulky design",
    "Expensive",
    "Battery performance not that great"
  ],
  "article": [
    "Despite being quite a heavy and bulky device with underwhelming battery performance, the HP Omen 15 still has quite a lot to offer, and makes up for it with strong gaming performance, excellent audio design and video quality, along with a great, clear, anti-glare display.",
    "The HP Omen 15 is able to cater to a multitude of needs from casual gaming to more professional competitive esports, streaming various video content from the likes of Disney+, Netflix, YouTube and Amazon Prime, playing music on Spotify, to playing AAA games, to the more basic everyday tasks. It is super reliable and versatile and performs well enough for productive tasks.",
    "If large screen displays with a 144Hz refresh rate are your thing and you're after a powerful gaming laptop, then the HP Omen 15 may be for you. The laptop’s anti-glare display shows clear images in the most beautiful detail, and its 1TB Solid State Drive means that the HP Omen 15 allows for lots of storage space.",
    "After spending a lot of time with the device, the HP Omen 15 has plenty to offer in terms of gaming performance. However, the battery life is not the greatest and is easily one of the biggest complaints we found whilst we were testing it. Having to plug in the device to charge if you’re looking to use it for extended periods of time can prove to be a bit of a pain.",
    "Overall, the HP Omen 15 is competent and fast enough for a multitude of everyday tasks with its 10th generation Intel processor, but when it comes to battery life performance, it falls near the back of the queue. It does, however, have a wide range of ports for a variety of uses, whether its charging other devices or importing content from other external devices.",
    "In the UK, the HP Omen 15 ranges from £1,299.99 and £1,399.99 for the 17-inch variant and the price varies from different retailers, including Amazon and Very. In Australia, the HP Omen 15 is available from various retailers and comes in at AU$2,999.00 and AU$3,599.00 on the HP Store Australia for the other model which includes more ports.",
    "In the US, the HP Omen 15 comes in at prices ranging from $999.99 and $1,449.99 from various retailers, including the US HP Store and Costco.",
    "Compared to other devices currently on the market, particularly the Asus Zepyrus G14, which in our view is one of the best gaming laptops at the moment that is more of a compact gaming laptop, the battery performance of the HP Omen 15 completely pales in comparison. The Asus Zepyrus M15 GU502 also offers a much better battery performance at a lower price point.",
    "The HP Omen 15 is one huge beast of a gaming laptop to say the least. It is very heavy and bulky, so if you are looking for a gaming laptop that is far more lightweight and compact, this may not be for you, as it is not very portable.",
    "The machine is very heavy to carry around on a regular basis and incredibly difficult to haul around if you are a regular traveler or commuter. But it packs a solid punch when it comes to gaming performance.",
    "Another great thing about the HP Omen 15 is that it has quite an impressive range of ports, depending on your needs and uses, whether it’s plugging in a games controller or a mouse, or even for more basic everyday tasks, as such as phone charging, for example.",
    "These ports include a memory card reader that fits a microSD card, enabling you to upload photos and videos easily, as well as a headphone/microphone jack, two Type-C USB ports, an HDMI port, a RJ-45 (network) jack, and a power connecter.",
    "The main keyboard has a backlit, RGB light up display, always useful for dim and dark conditions. It also has a separate numeric keypad, alongside the main keyboard, which while some might find a little overwhelming, it could be ideal and convenient for others.",
    "The display is very large, coming in at 15.6 inches with a 144Hz refresh rate, and is gorgeous, ideal for those wanting to play more cinematic or AAA games. There is also a built-in webcam included which records at 720p which is reasonable enough for carrying out everyday video calling (something many of us are doing an increased amount of).",
    "This makes the HP Omen 15 a great fixture on your desk, whether it is for work or play. We tested the laptop in sunlight and found that it shows a bit of a reflection, but we were still able to see the display very clearly.",
    "The sound quality is extremely crisp when watching online video content. The audio of the HP Omen 15 is fitted with state-of-the-art Bang and Olufsen audio, so it definitely does not disappoint when consuming casual video content.",
    "There may not be much need for any external speakers or headphones/earphones when it comes to casually consuming content on YouTube.",
    "But when it comes to gaming, to get the most of soundtracks and in-game audio design, a pair of external speakers and a great pair of headphones or earphones should do the trick in enhancing the experience.",
    "In terms of performance, while it generally runs fast and responsive with its 1TB SSD and 10th generation Intel processor, the HP Omen 15isn't the most powerful laptop out there.",
    "However, one of the most exciting things about the HP Omen 15 is that it includes recent Nvidia hardware. We also found that it performed extremely well with modern games and could confidently run even the most demanding AAA titles.",
    "For instance, after several hours of playing the PC edition of Death Stranding, we found that on the highest settings with the battery plugged in, that it managed to give a solid and smooth performance, with a frame rate averaging from 80 fps and 90fps and even as high as 100fps. When it was not plugged in, there were a couple of frame rate drops but it still managed to run at around 30fps, which is the standard for most AAA games on consoles and PC. Thankfully, the fan does not tend to get too loud whilst the laptop runs, even though we found that it makes quite a bit of noise.",
    "Whilst we benchmark tested Metro Exodus, one of the more graphically demanding games, we found that it runs at a maximum of 49fps when tested at 1080p at Ultra on a 1920x1080 resolution. When we benchmarked tested on Low at the same resolution, the results that were found were 142fps.",
    "With a much less demanding game, Total War: Three Kingdoms, during our benchmark tests on both Ultra and Low, the results were 12.0 fps and 11.3 fps.",
    "During the movie playback battery life test, we played a video on a continuous loop in VLC, with the screen set to 50% brightness, and the HP Omen 15 ran for a total of three hours and forty minutes. The battery life performance was shown to be lackluster and thus it would be required to have it plugged in if you wanted to use it to watch any movies or for longer periods of time.",
    "During the PC Mark 10 Battery Life test, on the same settings as before, the HP Omen 15 ran for a total of 3 hours and 15 minutes. Battery life performance was pretty underwhelming, then, compared to other gaming laptops currently on the market, namely the ASUS Zepyrus G14."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "8": "Design",
    "18": "Performance",
    "25": "Don’t buy it if…"
  },
  "links": {
    "Asus Zepyrus G14": "https://www.techradar.com/reviews/asus-zephyrus-g14",
    "Asus Zepyrus M15 GU502": "https://www.techradar.com/reviews/asus-rog-zephyrus-m15-gu502",
    "ASUS Zepyrus G14": "https://www.techradar.com/reviews/asus-zephyrus-g14"
  }
}