{
  "source": "https://www.techradar.com/reviews/acorns",
  "title": "Acorns review",
  "category": "computing",
  "updated": "2020-03-06T16:37:46Z",
  "author": "jitendra-soni",
  "summary": "Perfect platform for your micro savings",
  "verdict": "Good for saving and investing spare change, not so great for long term investors",
  "pros": [
    "Simplest medium to save",
    "Does not require a minimum investment",
    "Cashback reward options"
  ],
  "cons": [
    "High fees on small account balance"
  ],
  "article": [
    "Acorns is a micro-investment platform that is based on the modern theory of investment portfolios. In fact, it rejuvenates the old spare change concept we used in our growing years to accumulate money. The term Acorn itself stands for the base from which oaks can be cultivated.",
    "Acorns simplify and demystifies the concept of investing through an innovative mobile app. The major purpose of developing the app was to remove the mental restrictions of being an investor. You do not really need to be a professional investor to become an investor, and that is precisely what Acorns lets you learn.",
    "Acorns is a micro-investment tool that lets you save the “spare change’ from your purchases and lets you use this small amount into the portfolios that have a low-risk scenario. If you remember the habit of saving the change and then using it for some big purchase, you will understand how does Acorns work. Instead of spending it on things, you will be investing it into different investment portfolios.",
    "Acorns basically works as a robo-advisor (a non-human investment adviser) and lets you know where to invest this spare change in. You just need to link your credit or debit card with Acorns and the app rounds up all your credit and debit card purchases to the nearest dollar and then invests the change – the spare change – into a portfolio.",
    "All the tasks are handled automatically, and you do not need to go with any sort of manual intervention. You would only set it up once and forget it. Wholly automated software takes care of everything else.",
    "You will have to download the app and answer a few questions that it poses to you. Based on your responses, you will then get a recommendation for a suitable portfolio. The options for the different portfolios range across traditional to aggressive.",
    "Some of the options you can invest in would be:",
    "Depending on your time horizon and risk levels, you can finalise a genre of portfolio and link your credit/debit card with Acorns.",
    "What is a Roundup? Well, when you use your linked debit or credit card to make a purchase, Acorns rounds up the purchase to the nearest dollar. Then it withdraws the difference – the spare change – from your linked account and invests it in the portfolio you have chosen.",
    "For instance, if you made a purchase of say, $1.65, it will be rounded up to $2.0, and the difference amount of $0.35 is invested in the portfolio. Of course, it is a small amount but eventually adds up. Something akin to what we used to do during the olden days, where the spare change was stored in a jar and one fine day, was carried to the bank.",
    "Who can invest in it? Practically anyone can, but the focus is on young adults who are entirely new to investment and kind of abhor it. The target market for the platform basically comprises of students who have a valid .edu email address. The platform does not charge them any management fee in such a scenario for a period of four years.",
    "Acorns also offer you a cash back reward option labelled Found Money. It lets you earn cashback if you spend money at any of the Acorns’ partners. The cashback bonus can range across 10 to 5 %. You can either opt for the Tap and Get an offer with a purchase through your mobile phone or use the Simply Spend offer for spending by swiping your linked card as usual. They currently have over 250 partners including Boxed, Expedia, Lyft, Nike and Sephora.",
    "One criticism, however, is the high cost. It charges a flat management fee which varies between $1-$3 a month depending on the features you want. Considering that Acorns is designed for small savings, as a percentage of your pot this charge could be quite a significant cost.",
    "Some of the features that Acorns offer you can be summed up as",
    "The mobile app is available across every major platform Apple Store, Amazon or Google Play Store. The app is easy to use with a three-step sign up process. The account creation is available only for US citizens.",
    "If you are looking at the support options the platform has no human adviser assistance most of the times. That would make it a little difficult to make a decision on if you have questions before investing. However, there is 24-hour phone and chat support with response time ranging across 24 to 48 hours should be good enough. The website does offer plenty of resources and that should be enough to begin investing.",
    "If you want to make the best out of your spare change and get access to occasional cashback, Acorns should be a great option. The roundups indeed accumulate fast, and you could be surprised to find your portfolio growing.",
    "In case you are someone who needs a nudge to begin investing, Acorns could be of interest for you. It can also be the right option if you have very little income and do not have much to save. You can indeed begin investing without affecting your regular lifestyle.",
    "Acorns is an excellent service in the micro-saving category. Of course, it may not be the right platform if you are looking for retirement savings. If you are a professional, you can perhaps skip Acorns.",
    "The platform is basically for those who are not able to save much, such as college students. You can use it if you are someone who does not have a habit of investing. In all other cases, we do not think it would suit an average investor as such."
  ],
  "headers": {
    "2": "What does Acorns offer?",
    "8": "How does Acorn's Roundup work?",
    "16": "Is Acorns right for you?",
    "18": "Final verdict"
  },
  "links": {
    "Acorns": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9275089399357587000&xs=1&url=https%3A%2F%2Fwww.acorns.com%2Fpricing%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Facorns"
  }
}