{
  "source": "https://www.techradar.com/reviews/aukey-powerstudio-300-portable-battery-charger",
  "title": "Aukey PowerStudio 300 portable battery charger review",
  "category": "computing",
  "updated": "2020-11-13T16:30:38Z",
  "author": "jack-laurent",
  "summary": "A retro looking power bank of epic proportions",
  "verdict": "The Aukey PowerStudio 300 portable battery charger is a capable, high capacity power bank that is both stylish and well kitted. It has two AC power ports, a car charging port and even a USB Type-C connector. The ability to combine two input power sources to charge it faster is also a genuinely useful feature.",
  "pros": [
    "Design",
    "Separate controls for plugs/ports",
    "Two year warranty"
  ],
  "cons": [
    "More expensive than the competition",
    "Only one Type-C connector",
    "Chassis can be easily scratched"
  ],
  "article": [
    "The current pandemic has paradoxically coincided with a surge in new power technologies that aim to significantly decrease the amount of time we spend tethered to a power socket.",
    "Smaller, more powerful GaN power supply units and large-capacity power banks (or laptop chargers or big batteries) have popped up left right and center. At the time of writing, we counted more than a dozen portable power stations on Amazon with some hitting 1.5kWhr.",
    "We’re looking today at the Aukey PowerStudio 300 today, one that sports a 297Wh (82.5Ah) capacity, one that has a rather peculiar design.",
    "You cannot buy this from any online or offline retailer (or on its own website), you could only book it via Indiegogo where it was on sale until recently for $239 (with a Super Early Bird special of $199). Given that Aukey is a not-so-insignificant computer peripheral player on Amazon, we fully expect the company to put in sale towards the end of the year around $329, its suggested retail price. At the time of writing, almost 700 backers have raised more than $175,000.",
    "We have never really seen anything like the Anker PowerStudio 300. It looks from the outside like a vintage radio set from the 1950’s complete with the retro font, a nice leather handle and a plastic shell that looks and feels like yesteryear’s bakelite. Nothing like the industrial designs that usually forge the gas-powered generators or bulky power station rivals.",
    "It is relatively light at more than 3.5Kg thanks to the lithium-ion battery it houses but remains reasonably compact at 262 x 160 x 156mm. Everything happens in the front of the device; there’s a large LCD with a nostalgia-inducing amber colour (think incandescent lamps), five USB ports, two DC outputs and two 2-pin sockets.",
    "The ports are neatly arranged in groups each delimited by a line and each group has its own switch. Also worth mentioning is the LED Flashlight which has its own switch. Other than the power supply unit, you get a car charger and an accessory pouch but nothing to protect the device itself, unlike the recently tested RAVPower PD Pioneer which came with a protective case.",
    "You can charge/discharge the battery up to 500 times according to the manufacturer although in real life, the lifespan of the PowerStudio 300 is likely to vary according to usage. At peak, it can deliver up to 600W and 380W under normal conditions.",
    "We’re not a big fan of the bakelite finish as although it does fit the theme of the 1950/1960’s, it is less practical and more likely to get scratches and cracks when bumped around as the material seems to be more brittle than say a good old rubber layer that can absorb shocks better.",
    "Bear in mind that this is a product for the markets where 2-prong plugs (NEMA 1-15 ungrounded Type A) are in use; think the most of North America and Central America, and some of South America. In theory, you could use an international plug adaptor (or better still, a lead plug extension) to attach more devices to the PowerStudio 300.",
    "We love the fact that the display is clear without blindingly bright and that it can turn itself off automatically to save power. You can charge the device either through the Type-C connector (up to 100W Power Delivery) or through a dedicated barrel-type plug (up to 60W using the bundled brick charger). Annoyingly there’s only one Type-C connector which means that if you’re using it for charging in, you won’t be able to use a backup one for charging out.",
    "You should be able however, to cut down the charging time by using both the DC and the Type-C connectors in what Aukey calls “Double Helix” charging, essentially running them in parallel which, the company says, will cut the charging time - from empty to full - to 150 minutes thanks to the combined 160W power.",
    "Charging any device is as simple as it gets, simply switch on, plug and away you go; laptops, tablets, smartphones, even smaller batteries worked without a hitch. When the PowerStudio reaches its limit when being charged, it will emit a series of beeps and shut down to prevent damage. It will remain silent except under heavy loads when heat will kickstart the dual-fan setup inside. The operating temperature range of the device is between 0°C and 40°C (32°F and 104°F). It will shut down safely when it is either too hot or too cold.",
    "We didn’t open the device to see what’s inside but Aukey provided some pictures that show how tightly assembled the PowerStudio is. Hardly any wriggling space.",
    "The other portable power station we came across was the RAVPower PD Pioneer, a more utilitarian looking portable battery charger that is smaller physically, lighter and rated at 70.2Ah/250W. Like the PowerStudio, we said that it will appeal to a niche audience that wants to strike a balance between price, performance and form factor. At $188, it is also cheaper.",
    "Elsewhere, the cheapest of the flurry of rivals that share similar core metrics with the Aukey PowerStation 300 is the oddly named NinjaBatt which at the time of writing cost just over $216 (after coupon) and featured a smaller 288Whr battery, fewer ports but also a much bigger LCD screen, two lights and what looks like a slightly smaller form factor.",
    "The PowerStudio 300 by Aukey goes to show how far technology has advanced when it comes to high capacity portable power banks and what’s even more interesting is that Aukey also sells 100W solar panels (PowerHelio Y100) that could power the PowerStudio 300 offgrid.",
    "Overall, it is a well designed, well executed product and clearly shows that Aukey knows what they’re doing, not a surprise given that they’ve been manufacturing portable chargers for almost a decade. The PowerStudio 300 is aimed at a more lucrative (albeit more niche) market which is likely to be more demanding.",
    "There’s not much that could be improved or added to Aukey’s flagship product. More type-C ports maybe, a different chassis material perhaps but above all it will depend on the pricing."
  ],
  "headers": {
    "3": "Price",
    "4": "Design",
    "7": "In use",
    "14": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "on its own website": "https://www.aukey.com/product?id=2",
    "Indiegogo": "https://www.indiegogo.com/projects/powerstudio-300-live-life-off-the-grid#/",
    "RAVPower PD Pioneer": "https://www.techradar.com/reviews/ravpower-pd-pioneer-70200mah-250w-portable-power-station",
    "NinjaBatt": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNinjaBatt-Portable-Station-Flashlight-Emergencies%2Fdp%2FB07X3WC9GC%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1029933597906483200-20"
  }
}