{
  "source": "https://www.techradar.com/reviews/moga-xp5-x-plus-bluetooth-controller-review",
  "title": "MOGA XP5-X Plus Bluetooth Controller review",
  "category": "gaming",
  "updated": "2020-10-01T16:22:38Z",
  "author": "gerald-lynch",
  "summary": "A near-perfect game streaming controller",
  "verdict": "With game streaming services bringing console games to our mobile devices, we need a controller fit for the challenge. The MOGA XP5-X Plus Bluetooth Controller does a fantastic job, thanks to its great inputs, flexible removable clip and integrated backup battery.",
  "pros": [
    "Solid controls",
    "Mobile clip offers many angles",
    "Good battery life with device charging support"
  ],
  "cons": [
    "Two cable ports for charging and connectivity cause confusion",
    "Clip can interfere with some phone’s buttons"
  ],
  "article": [
    "Despite the new console hype, the future of gaming sits not solely with the likes of the Xbox Series X or the PS5, but in the cloud, with subscription services and data centers doing the heavy lifting, and our lower-powered mobile devices acting as the conduit to our remote gaming hosts.",
    "From Google Stadia to GeForce Now to Amazon Luna, game streaming is now commonplace (though still not perfected), and to take proper advantage of it, you need a controller fit for the job.",
    "The MOGA XP5-X Plus is perhaps the most capable of all the mobile controllers we’ve seen so far – designed specifically with Microsoft’s Xbox Game Pass Streaming for Android in mind (though, being a Bluetooth controller, it’ll work with any gamepad-supporting gaming app) it ticks pretty much every box you can think of.",
    "Housing your phone in an adjustable cradle, it essentially mirrors an official Xbox One controller (while adding a couple of additional customizable buttons too), and includes a built in battery for charging your mobile device while in play.",
    "It’s comfortable to use, its buttons and weight feel like Microsoft’s own excellent controller, and the addition of a battery pack is a genius extra. Being developed with Samsung phones in mind, the cradle can interfere with the volume rocker of some phone brands’ designs.",
    "It can also be confusing remembering which of the controllers two USB ports are responsible for either charging the controller, your device, or making a wired connection between your phone and the pad.",
    "Those issues aside, it’s the most complete mobile controller we’ve yet tried, and comes heartily recommended.",
    "The MOGA XP5-X Plus is available now, and costs $69.99 / £69.99. That seems quite expensive for a control pad, but when you factor in that removable gaming clips for phones, and battery packs, each cost upwards of $10 / £10, it evens out a bit. Remember that the pad is compatible with PC, too, so can serve a dual purpose.",
    "If you’ve ever used an Xbox One controller, you’ll know exactly what you’re getting here. There are four face buttons (X, Y, A, B), a D-Pad, two clicky thumb sticks, a view button, menu button, Xbox button, two shoulder buttons and two triggers. These all feel great, and have a nearly-identical amount of travel and resistance as the inputs you’d find on a regular Xbox One controller, with a dark grey and green design in keeping with the Xbox aesthetic.",
    "It’s where the package differs from the standard Xbox controller that things get interesting. Beneath the right thumbstick is a toggle to turn off or on the controller’s internal battery charging pack, which can be used to charge your mobile phone when in use. Just under the D-Pad is a button that fires up four small LEDs, each representing battery level in 25% increments.",
    "Both wireless and wired connectivity modes are offered up, and can be switched between with a toggle under the Xbox button.",
    "Finally, there are two clicky buttons hidden away where your fingers rest on the controller’s grips – they can be totally ignored, or programmed for any function of your choosing by holding a button under the battery toggle, pushing your desired input, and then pushing the assignable button you want to attribute it to.",
    "It’s a fantastic controller that feels great in the hand, with useful added functionality. However, you may initially find it confusing to find two separate USB inputs (one standard, one micro) on the rear of the controller. One is used for charging the device and making a wired connection to the pad, and the other lets you charge your phone from the battery pack.",
    "The controller comes with cables of all kinds, for both charging and connecting both micro USB and USB-C phones, as well as charging the controller itself, and figuring out which combination of port and cable is required for each function is a bit of a puzzle initially. Moga doesn’t disclose the size of the battery pack in its controller, and we wouldn’t rely on it for marathon streaming sessions, such is the drain on a device’s battery.",
    "What is nice and simple though, is the included removable phone clip. It’s pretty much identical to the sold-separately PowerA Moga phone clip, which is pretty much the best that money can buy. It’ll house phones up to 79mm (3.12 inches) wide, and has two locking points of articulation that cover a range of 270 degrees of movement.",
    "It makes balancing the weight of your phone and finding the right angle to view its screen at a cinch. Note though that it’s been made with the latest Samsung phones in mind, so you may find some other phones fit slightly more awkwardly – my Pixel 3XL for instance had its volume rocker button pushed unless the phone was placed inside at just the right point."
  ],
  "headers": {
    "0": "One-minute review",
    "7": "MOGA XP5-X Plus Bluetooth Controller price and availability",
    "8": "Design, features and performance",
    "16": "Don't buy it if..."
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "GeForce Now": "https://www.techradar.com/reviews/nvidia-geforce-now",
    "Amazon Luna": "https://www.techradar.com/news/amazon-luna",
    "Xbox Game Pass Streaming": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}