{
  "source": "https://www.techradar.com/reviews/hostpapa",
  "title": "HostPapa review",
  "category": "computing",
  "updated": "2020-11-18T00:55:23Z",
  "author": "mike-williams",
  "summary": "High spec hosting for a low opening price",
  "verdict": "HostPapa is an independent hosting provider that offers a decent amount of options with a handful of appealing features in its quite affordable hosting plans. Together with a first-rate self-help support, this might sound like a perfect solution for small businesses, but its limits may drive others away.",
  "pros": [
    "Eco-friendly approach",
    "Free domain registration even with the cheapest plan",
    "Free domain transfer and website migration",
    "Outstanding self-help options",
    "Starter plan supports hosting two websites"
  ],
  "cons": [
    "No free automated backups",
    "Add-ons can quickly drive up the price",
    "No monthly billing for shared hosting plans",
    "No Windows hosting option"
  ],
  "article": [
    "HostPapa is a Canada-based, privately owned web hosting provider that entered the market in 2002 with its application software related to dedicated hosting services. Three years later, they began offering their first hosting services and, finally, in 2006 the company was officially founded in Ontario, Canada by Jamie Opalchuk. Throughout the years they’ve been providing shared, reseller, WordPress and VPS hosting to customers across the globe. At the same time, they’ve managed to build a fairly good reputation for their commitment to security, reliability, technical expertise and solid customer support.",
    "HostPapa has received a number of awards since its founding, including Uptime Awards from NCM Online and WHTop. In addition, they have appeared on the PROFIT 500 ranking of Canada’s fastest-growing companies list on three occasions, the last time being in 2015. In the same year, they’ve announced a partnership with Dropmysite, a Singapore-based global cloud software platform that provides backup for websites and databases.",
    "One way HostPapa stands out among its competitors is focusing on being and staying green. Their eco-friendly approach is evident in the usage of 100% green renewable energy to power up data centers, web servers and all electronic devices in their offices. Concerns about the impact their company is having on the environment have been featured in their promotional material and are their unique selling point right from the beginning. Additionally, in 2011, HostPapa financed the planting of 10,000 trees all over Africa on Earth Day as part of the Love Trees charity.",
    "HostPapa is also no stranger to curious marketing actions, such as the one in which it promised to donate $5 to Save the Elephants for each former Bluehost user that migrates to HostPapa.",
    "While visually simple at first glance, HostPapa’s official blog is filled with sufficiently engaging and highly informative articles on various interrelated topics, all relevant to both existing and potential customers. Judging by the publication dates from 2020, the blog appears to be updated at least once a week.",
    "HostPapa claims its goal is to provide every customer with a fully-featured hosting package at the lowest possible cost without compromising the quality. All of the above should come together with the help of top-notch customer service and powered by renewable green energy. With this in mind, we were expecting budget-friendly prices and that's more or less what we got.",
    "The shared hosting Starter plan begins at $3.95 per month (although it will cost $7.95 on renewal after the first three years), supports hosting up to two websites and includes a free domain, starter website builder (two pages limit), 100GB of SSD storage and unmetered bandwidth. This sounds like a pretty good value for money.",
    "Although all customers are entitled to cancel HostPapa’s services at any moment, there is a 30‑day risk-free money‑back guarantee. However, it applies to shared and reseller web hosting plans only, which seems a bit reductive.",
    "As for the payment method, HostPapa accepts credit/debit cards and PayPal.",
    "If you’ve selected one of the shared hosting plans, the first thing you’ll notice will probably be the absence of an option for monthly billing. Instead, you’ll be able to select between billings for 12, 24 or 36 months only, which seems unnecessarily inflexible.",
    "On a more positive side, all plans offer a decent value for money and the customers can choose from a few (not too specified) server locations: the US, Canada and Europe. Additionally, at a rather high price you can throw in a couple of add-ons labeled as “website essentials”. A few of these may come already check marked, but you can unselect each of them easily enough.",
    "After this, you are able to choose a new domain name or transfer an existing one, free of charge. To continue, you’ll have to provide HostPapa with a number of rather regular personal information, pick a payment method and finalize the purchase. All in all, it’s a pretty straightforward process.",
    "All details about your order will be displayed on the far right side of the screen in a transparent manner, with both individual and total expenses shown, which is always good to see.",
    "Given that HostPapa doesn’t support Windows hosting, you’ll be using Linux-based cPanel, which is intuitive and easy-to-use, even for average users. From there you’ll be able to install WordPress in no time via Softaculous app installer, and the same goes for hundreds of popular apps, such as Joomla or PrestaShop.",
    "At a minimum, HostPapa offers a basic version of its great drag-and-drop website builder with all its plans, but there is a catch. This product is only offered to users whose domains have been registered with HostPapa. Therefore, if you already have a registered domain elsewhere, you need to transfer to HostPapa before using a website builder or sign up for a new hosting plan. Unfortunately, if you have multiple domain names on your account and want a website builder with each of them, you’ll need to pay for each instance of website builder individually.",
    "A repeated GTmetrix speed test of HostPapa’s main website gave us a few reasons for concern. It took a whopping 20.8 second to fully load the page in comparison to the average result of 8.0 seconds and 253 requests compared to an average of 88. Not surprisingly, GTmetrix decided to grade the website’s speed with a firm F (34%). Truth be told, GTmetrix’s test on HostPapa’s website is not a sole determining factor when it comes to the speed of your future website, but it is a step in the questionable direction.",
    "On the bright side, an uptime test via UptimeRobot that ran on HostPapa’s main website for over a month didn’t show a single trace of downtime and showed only a few major oscillations in response time. Considering that HostPapa guarantees that their uptime will never drop below 99.9%, we can only confirm that.",
    "If you click the Support button on HostPapa’s landing page and then proceed to Customer Care Center, you’ll be presented with a few (and definitely more than we usually see) self-help services done right.",
    "The knowledgebase contains remarkable 2539 articles and 74 different categories. As for their quality, as far as we could tell, they are written in a very easy-to-understand, instructive and helpful manner covering various potential questions, concerns and issues.",
    "Additionally, HostPapa offers video tutorials, information on network status and options to write an e-mail, submit a support ticket, open a live chat or contact the support team via telephone. Both chat and telephone support services are available 24/7.",
    "In addition to the above, there are cost-free weekly webinars as well as 30 minute one-to-one training courses which surely deserves praise.",
    "HostPapa doesn’t have an official forum at the moment, but given the level of support they provide their users with, it isn’t a significant issue.",
    "HostNoc is a fellow Canadian web host provider which, much like HostPapa, offers a wide range of well-rounded and adaptive hosting solutions to global customers and at budget-friendly prices. While HostNoc throws in free daily backups and a constant security monitoring, HostPapa adds free domain registration to all of its plans. Since both competitors seem to be affordable, trustworthy and reliable, the choice may be a matter of personal preference.",
    "If competent customer support is an important factor for you, both HostPapa and Hostgator will meet the criteria. However, when it comes to hosting plans, Hostgator will provide every user with a free SSL certificate, while you’ll need to pay an extra for it with HostPapa.",
    "Bluehost is another strong rival to HostPapa and one of the most popular global hosting options. However, Bluehost doesn’t offer reseller hosting as an option, while HostPapa does, so if that’s what you’re looking for, the choice is clear.",
    "Doteasy is another Canada-based provider which aims to provide quality yet affordable hosting solutions to the international clientele. In contrast to HostPapa, Doteasy provides monthly billing for shared hosting plans. Unfortunately, they are quite expensive and exclude a money-back guarantee.",
    "The main advantage of choosing HostPapa as your host is a good value for a price. It offers a decent range of hosting options, a few attractive features (such as a starter plan supporting two websites), superb self-help selection and pocket-friendly prices. If you are looking for an equally affordable host which will not force you to compromise on hosting options or features, you can’t go wrong with providers like Bluehost and Hostgator as alternatives."
  ],
  "headers": {
    "5": "Plans and pricing",
    "9": "Ease of use",
    "15": "Speed and experience",
    "17": "Support",
    "22": "The competition",
    "26": "Final verdict"
  },
  "links": {
    "HostPapa": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5853258436873182000&xs=1&url=https%3A%2F%2Fwww.hostpapa.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhostpapa",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "dedicated hosting": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "Starter plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3355793938348430000&xs=1&url=https%3A%2F%2Fwww.hostpapa.com%2Fweb-hosting-plan%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fhostpapa",
    "HostNoc": "https://www.techradar.com/reviews/hostnoc",
    "Hostgator": "https://www.techradar.com/reviews/hostgator",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "Doteasy": "https://www.techradar.com/reviews/doteasy"
  }
}