{
  "source": "https://www.techradar.com/reviews/scapple-mind-mapping-software",
  "title": "Scapple mind mapping software review",
  "category": "computing",
  "updated": "2020-07-27T17:30:34Z",
  "author": "jacob-parker",
  "summary": "A better way to make notes on your computer.",
  "verdict": "Need a minimalist program that will help you to beautify your mind maps? If so, there’s a good chance that Scapple, with its slick interface and intuitive commands, is the right tool for you.",
  "pros": [
    "Produces great-looking mind maps",
    "Easy to integrate old notes and other content",
    "Customize your work with different connectors, colors and shapes",
    "Free trial can easily last over 30 days"
  ],
  "cons": [
    "No support for mobile devices or Linux",
    "Pricey compared to free alternatives"
  ],
  "article": [
    "Scapple is a flexible drawing and note-taking application for Windows and Mac computers created by developer Literature & Latte. With Scapple, you can express your ideas with clarity thanks to engaging mind maps and intelligent shortcuts.",
    "Mind maps are awesome because they let you visualize the links between different concepts, thoughts, and information. Providing visual context to something helps us to understand it better, and Scapple stands out because it lets you pull content from other programs into your digital Scapple mind maps to showcase your ideas.",
    "Compared to other mind mapping platforms, Scapple pricing is straightforward. It costs $18 for a single license, or $14.40 if you’re an academic or student. Prices are basically the same whether or not you buy through a third-party, like the Apple App Store, but do vary based on your region.",
    "If you’re not completely sure that this is the right product for you, you can simply start a 30-day free Scapple trial instead. The great thing about the trial version of Scapple is that it doesn’t simply stop working a month after the trial start date. Instead, a day only counts if you actually use Scapple on it. So, if you use Scapple twice a week, the trial will keep ticking over for 15 weeks.",
    "Scapple’s aim is to work as a seamless virtual piece of paper on which you can put together aesthetically pleasing mind maps. You can create text, pictures or links anywhere you want on your Scapple page, and lots of tasks can be accomplished with easy-to-remember keyboard shortcuts. Changing up the style of your Scapple notes is also a breeze thanks to a convenient menu that lets you add borders or change text font.",
    "Works with different types of content",
    "One of Scapple’s most handy elements is its flexible nature when it comes to dealing with pieces of content that haven’t been created within the Scapple interface. To add a text file, picture or PDF to your Scapple mind map, all you need to do is drag it over the Scapple window. Once Scapple has imported your file or text, you can resize or move it around as needed.",
    "Customize your Scapple page",
    "By helping you to represent your ideas in virtual space, Scapple lets you understand them better and share concepts efficiently with others. A big part of this is using formatting options like text size, borders, and shape to show how ideas related to one another.",
    "So that you can create an appropriate text style, Scapple offers an easy-to-use stylization menu where you can experiment with different font sizes, add colorful borders, and change text alignment. You can also modify important document properties like the background image and decide whether or not borders should be created by default. Another stylistic feature you’re sure to get a lot of use out of is a shape drawing tool that helps you compartmentalize related notes.",
    "The first thing you’ll notice about the Scapple interface is its simple elegance. By default, Scapple is free from any clutter like unnecessary menus. To create a note, all you have to do is double-click somewhere and start typing. Don’t worry, you don’t have to figure out how everything works by yourself, though. When you first open Scapple, you’ll see a series of helpful “get-started” prompts.",
    "Using Scapple is incredible intuitive. For example, making a line to link two connected ideas is as simple as dragging one thought bubble on top of another. And, should you want to create an arrow between the two instead, just do that while holding “Shift” and “Command” (⇑ and ⌘ on Mac).",
    "Once you memorize a couple of other commands, you’ll find it easy to do more complicated things like create shapes to contain certain notes, images or equations. To create a boundary shape, all you need to do is select the objects you want to be included. Then, right-click and select “New” and “Background Shape”.",
    "Via the Scapple website, you can troubleshoot any issues that crop up with your Scapple installation. You’ll find a range of instructive video tutorials as well as user manuals and forums to answer any questions. Should you need more advanced support, Literature & Latte staff can be contacted by email. However, you should note that this is a small developer, and non-urgent emails will not be responded to quickly during holiday periods.",
    "There are plenty of other great mind mapping tools out there, but Scapple manages to stand out from the crowd with its slick, pared-down interface and intuitive design. Obviously, this software is significantly pricier than Freemind, which is a free mind map tool, but when the two are put side-by-side, Scapple makes Freemind look clunky and unappealing.",
    "If you’re searching for a new way to express your ideas and interpret concepts in a digital space, Scapple is probably the right tool for you. This mind-mapping package doesn’t just work with basic text notes and drawings, it also allows you to import PDF and image files from elsewhere on your PC and integrate them into your creations with ease."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "10": "Interface and in use",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "note-taking application": "https://www.techradar.com/best/best-note-taking-app",
    "Literature & Latte": "https://www.literatureandlatte.com/",
    "Mind maps": "https://www.techradar.com/best/best-mind-map-software",
    "Apple App Store": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1388258341275166200&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fscapple%2Fid568020055%3Fmt%3D12",
    "PDF": "https://www.techradar.com/best/best-pdf-readers-for-windows",
    "Freemind": "https://www.techradar.com/reviews/freemind-mind-mapping-software"
  }
}