{
  "source": "https://www.techradar.com/reviews/jbl-quantum-one-gaming-headset",
  "title": "JBL Quantum One Gaming Headset review",
  "category": "gaming",
  "updated": "2020-09-16T14:20:51.714Z",
  "author": "jason-fanelli",
  "summary": "Is the new flagship headset from JBL worth the money?",
  "verdict": "The JBL Quantum ONE is a versatile headset that works for every gaming format, but because of the accompanying USB audio mixer, it's a better PC headset than a console one. That said, crisp sound, easy to use accessories, and a comfortable fit on the ears give this headset a lot of bang for its buck.",
  "pros": [
    "Compatible with all consoles",
    "Clear, clean sound on all formats",
    "USB audio mixer is easy to use"
  ],
  "cons": [
    "3.5mm wire can be fickle",
    "Better on PC than consoles"
  ],
  "article": [
    "A new challenger enters the gaming headset ring with the JBL Quantum One, a brand-new flagship model of JBL’s new Quantum range of audio options. It's a bit on the pricey side at $299.95 (around £245, AU$500), but the JBL Quantum One provides studio-level sound at an affordable price.",
    "And not just for one console, either. Interchangeable between the Nintendo Switch, Xbox One, PlayStation 4, and PC, this headset is adaptable to however you play with both a 3.5mm headphone wire and a USB audio mixer included in the box.",
    "It's not quite perfect, but if you want wireless audio on every console you own and spatial audio when you play on PC, the Quantum One is a great option.",
    "The look and feel of the headphones are sure to impress right out of the box: Despite packing so much audio power, the JBL Quantum One is light and comfortable on the head, never feeling like it’s weighing you down or hurting your neck.",
    "Aesthetically, the sleek design of the Quantum One is really eye-catching, with the JBL logo prominently displayed on both earphones. Plugging in the USB mixer and seeing them light up with every color on the spectrum only made them even more impressive. We only wish that feature would come across when wearing them on console, but as it stands the USB mixer won't work Xbox One or PlayStation 4.",
    "In fact, that’s probably the biggest issue we had with the JBL Quantum One headset: it's compatible with all consoles, but it's not as stable and doesn't sound as good as it does when used with a PC.",
    "That said, the 3.5 mm headphone jack will allow for voice chat on Xbox One and PlayStation 4 (not the Nintendo Switch), but we experienced far more technical issues on the console than when we had the USB mixer plugged into the PC.",
    "In terms of performance, the JBL Quantum One reminds us of the LucidSound LS50X, fitting perfectly around my ears and sealing off most outside audio. Moreover, the audio is close to the best we’ve ever heard in a gaming headset, with every minute detail coming through clean and clear thanks to the amazing customizable surround sound.",
    "The spatial audio tech that the Quantum One hangs its hat on is certainly cool, but it wouldn’t always match the direction I was facing which definitely hurt the immersion. Thankfully there’s a small button on the device that adjusts the feature back to center, so all we had to do was look straight ahead, touch the button, and problem solved.",
    "Unfortunately that wasn't the only problem we experienced with the headphones, though: the right headphone would cut out at times, requiring us to readjust the jack in the controller’s port, and the microphone wouldn’t pick up our voice unless we were practically eating it. Also, it might have been because we tested an early sample, but voices coming in sounded muffled even with the console’s settings maxed.",
    "The in-game audio always sounded incredible when it was functioning properly, the surround and spatial sound fully intact, but these minor hiccups kept the JBL Quantum One headset from being the best all-around choice for consoles.",
    "You’re a PC-focused player",
    "Clean audio, an easy-to-use mixer, and a powerful microphone make this headset an instant heavy hitter in the PC gaming sector. Plus the flashy colorful lights will give you some flair while streaming your games to the world.",
    "You play a little bit of every console",
    "The JBL Quantum One can be used on both console and PC, so if you play games on every available format then this is a solid investment. The console experience is slightly more rocky, but the headset still performs well.",
    "You love surround sound right in your ears",
    "The surround sound capabilities of the JBL Quantum One cannot be understated, especially with the spatial sound features that follow your head movement. Despite a few minor issues, this is one of the cleanest sounding headsets for PCs.",
    "You’re a console-exclusive player",
    "The JBL Quantum One certainly works fine with the consoles, but this is clearly a headset created with the PC in mind. The audio still sounds fantastic, sure, but there’s a few technical hiccups that can lead to some mid-gaming session frustration.",
    "You prefer a wireless headset",
    "As powerful and impressive as the JBL Quantum One is, it is a wired headset. If you prefer something that doesn’t tether you to your laptop or controller, then this headset is not the one for you.",
    "You don’t care about surround sound",
    "The One is the top of the new JBL Quantum line, so don’t feel like this is the only option. If surround sound or the other bells and whistles aren’t a concern and you’re just looking for a competent headset, other choices are available."
  ],
  "headers": {
    "3": "Design",
    "7": "Performance",
    "11": "Buy it if…",
    "17": "Don’t buy it if…"
  },
  "links": {}
}