{
  "source": "https://www.techradar.com/reviews/samsung-hw-n950-soundbar",
  "title": "Samsung HW-N950 Soundbar review",
  "category": "audio-visual",
  "updated": "2020-06-04T10:58:41Z",
  "author": "stephen-withers",
  "summary": "Immersive audio done properly",
  "verdict": "The Samsung HW-N950 delivers a Dolby Atmos and DTS:X experience with maximum performance and minimum fuss. The package includes a soundbar, subwoofer and separate rear channels, all combined with two width drivers and four upward-firing speakers. The result is a setup that actually does immersive audio unlike any other soundbar on the market.",
  "pros": [
    "Superb performance",
    "Dolby Atmos and DTS:X support",
    "Extremely well made",
    "Easy to setup"
  ],
  "cons": [
    "Basic audio calibration",
    "Pricey"
  ],
  "article": [
    "The Samsung HW-N950 is something special, as the first soundbar to benefit from Samsung’s acquisition of Harman Kardon – a partnership that's been paying dividends for the last couple of years.",
    "The HW-N950 is a whole-hearted upgrade on Samsung's previous HW-K950 – one of the first Dolby Atmos-enabled soundbars on the market that launched back in 2016. But the differences between the two are night and day.",
    "The HW-K950 was excellent for its time, yes, but the N950 now supports both Dolby Atmos and DTS:X, compared to the K950 which was disappointingly limited to the former. There's also the fact that the N950 does so in a genuine 5.1.4 configuration that consists of a soundbar, additional width channels and two upward-firing channels, two wireless surround speakers that include upward-firing drivers, and a wireless subwoofer. It's a multi-piece solution that rivals – and completely surpasses – home theater in a box systems you might've used in the past.",
    "The previous K950 was an excellent soundbar, yes, but it was only a soundbar; the N950 offers a genuine alternative to a traditional multichannel system.",
    "The Samsung HW-N950 follows the same basic design style that Samsung has adopted on its soundbars for the last few years: a minimalist-but-attractive rectangular shape and largely metal construction.",
    "The build quality is excellent, with metal grilles at the top, front and sides, along with a brushed metal finish to the edges and rear. The N950 comes in black or, as Samsung likes to call it, ‘Midnight Titan’, and is designed to compliment TVs with a screen size of 55 inches or greater. You’ll need enough space in front of your TV to install the N950, although Samsung also includes a bracket for wall mounting.",
    "The soundbar is fairly large and heavy, but that’s understandable considering there are 13 drivers and their corresponding amplifiers built in. These drivers create seven speakers in total, with three front channels (left, centre and right), left and right width channels, and two upward-firing drivers for the top front left and right channels.",
    "At the front of the soundbar, over on the far right, there is a simple LED display. This lights up when you use the controls, and provides information on the volume, inputs and various settings. On the top centre of the soundbar are some basic touch sensitive controls for power, input selection and volume.",
    "The provided remote is an excellent controller: it’s well designed and comfortable to hold, with all the necessary buttons sensibly laid out. As a result, controlling the N950 is an effective and highly intuitive process.",
    "The connections are located in a recessed section under the soundbar, and here you’ll find two HDMI inputs and an HDMI output with ARC (Audio Return Channel). All the HDMI connections support 4K/60p, 4:4:4, Rec.2020, High Dynamic Range (HDR10 and Dolby Vision), 3D and HDCP 2.2.",
    "The N950 also includes an optical digital input, along with built-in WiFi and Bluetooth. On the underside you’ll also find a USB port for service updates, a connector for the two-pin power cable, a button for WiFi setup, and a button for pairing the wireless surround speakers and subwoofer if necessary.",
    "The wireless rear speakers mirror the design and build quality of the main soundbar, with metal grilles on the front and top, and a black brushed metal finish. There is built-in amplification, powering forward-firing drivers for the surround left and right channels, and upward-firing drivers for the top rear left and right channels.",
    "It’s worth remembering that since the rear speakers are wireless, you don’t need to physically connect them to the soundbar at the front of the room. That makes positioning them a lot easier and considerably less messy. However it’s also worth remembering that these rear speakers aren’t completely wireless: you will need to plug them in to power the built-in amplification.",
    "The two-pin power cables connect flush with the underside of the speakers, and at the rear you’ll find screw fixings for wall mounting. There are also indicator LEDs at the rear to show when the speakers are in standby or paired with the soundbar, and a button for manual pairing if necessary.",
    "The included wireless active subwoofer is a bass-reflex model with built-in amplification and a side-firing 8-inch driver. It also complements the design of the main soundbar, and should pair automatically. If it doesn’t, there is a button similar to the one on the wireless speakers which allows manual pairing, and there are also a couple of indicator LEDs.",
    "Design TL;DR: This attractively-designed and extremely well-made soundbar includes wireless rear speakers and a subwoofer, ensuring a genuinely immersive multichannel audio experience.",
    "The Samsung HW-N950’s headline feature is obviously its ability to support both Dolby Atmos and DTS:X using a genuine 7.1.4 speaker configuration. It’s this aspect that differentiates the N950 from any other soundbar currently on the market, because it doesn’t rely on any virtual or psychoacoustic trickery to create an immersive audio experience.",
    "Samsung certainly isn’t messing about when it comes to the N950, which boasts no fewer than 12 speakers using a total of 17 drivers. The front three channels are composed of three drivers each, two woofers and a wide range tweeter, while all the other channels use single drivers.",
    "All of these drivers are individually powered by a total of 512W of built-in amplification, although Samsung hasn’t specified how this amplification is actually allocated to each driver. The system as a whole has a claimed frequency response that goes from 34Hz to 17kHz.",
    "The N950 has been developed between Samsung Audio Labs and Harman Kardon, with the former ensuring the soundbar supports Dolby Digital, Dolby Digital Plus, Dolby TrueHD and Dolby Atmos, along with DTS Digital Sound, DTS-HD Master Audio and DTS:X. Meanwhile, the latter ensures the soundbar meets the expectations of discerning listeners by delivering a sound that is dynamic and spacious, with clear voicing.",
    "Aside from the addition of DTS:X, the N950 differs from the earlier HW-K950 with the addition of side-firing speakers to create a 7.1.4 configuration. It also uses the second generation of Samsung’s wide-range tweeter, which now boasts an improved lower frequency response. The wireless coverage has also been enhanced, improving the rear speaker connection and directly addressing the connection issues that some owners experienced with the K950.",
    "The N950 includes a number of sound modes that use digital signal processing (DSP) to enhance the audio. These include a standard mode, which essentially decodes the audio format as it is, and a surround sound expansion mode that upmixes the audio to use all the available speakers. There’s also a smart mode that analyses the incoming signal, and chooses the best available processing.",
    "The N950 includes both built-in wireless and Bluetooth capabilities, allowing users to easily access their music libraries and streaming services. The wireless connection is easy to setup using Samsung’s SmartThings app, and the Bluetooth can be paired by simply pressing the pairing button on the remote control.",
    "The N950 supports numerous lossy and lossless audio formats including AAC, WAV, OGG, ALAC, AIFF and FLAC, with high resolution support up to 32-bit. Samsung has also included UHQ 32-bit upscaling for the highest quality audio playback.",
    "Finally, the N950 supports Alexa. To do this simply go into Skills on the Alexa app and enable Samsung Wireless Audio, then under Smart Home you select devices and discover the N950. This will enable the 3PDA skills and allow you interact with your soundbar using Alexa voice control.",
    "Features TL;DR: A comprehensive set of features is headlined by Dolby Atmos and DTS:X support that uses a full 7.1.4 speaker configuration, but also includes smart features, hi-res audio and Alexa skills.",
    "The Samsung HW-N950 is extremely easy to setup: you simply place the soundbar beneath your TV (ensuring that nothing is blocking the drivers) and then position the subwoofer towards the front of the room and the surround speakers at the rear.",
    "The wireless speakers and subwoofer should pair automatically with the soundbar, creating a full 7.1.4-channel system. All you need to do then is use an SPL meter (you can create one with a free app on your phone) to set the levels for the centre, side, front top, rear, rear top and subwoofer channels.",
    "If we have one criticism of the N950, it’s that the set-up is rather basic compared to the competition, and unlike other soundbars, there’s no dedicated microphone or set-up app. However, if you take the time to set the speaker levels correctly, the result is a cohesive soundstage with well-integrated bass.",
    "Careful set-up will definitely pay serious sonic dividends and the performance of this soundbar is quite superb, with a wide and open front soundstage, immersive effects and an impressive tonal balance thanks to the use of the same drivers on all the speakers.",
    "This is the first soundbar we have heard that can genuinely compete with an AV receiver and speaker package, although how effective the upward-firing drivers are will largely depend on your ceiling. The lower and more reflective the ceiling is, the better the sense of sounds emanating from overhead.",
    "Needless to say, Dolby Atmos and DTS:X tracks sounded particularly impressive with the N950. We started with the ‘Amaze’ Dolby Atmos trailer, and the Samsung did a superb job of delivering this complex object-based mix. Sounds were steered around the room in a seamless fashion, thunder rolled overhead, and rain fell all around us. The subwoofer underpinned the entire sound field with solid bass that was perfectly integrated with the other speakers.",
    "The vehicular mayhem in Mad Max: Fury Road was an aural assault thanks to the N950, with sounds popping up all over the room, and cars roaring overhead. Explosions and crashes had real impact, while the addition of width speakers helped give the soundstage an epic scope. There was a precision to the effects that gave the sound depth and dimension, while the subwoofer added impact to the explosions.",
    "The same was true with DTS:X soundtracks, making the dragon escape from Harry Potter and the Deathly Hallows Part 2 a marvellously visceral experience. The sounds of spells exploding echoed around the room, the roar of the dragon filled the entire soundstage but always remained balance as the music swelled. Despite the complex nature of the sound design, dialogue remained clear and focused throughout.",
    "Of course, not every soundtrack you listen to will be Dolby Atmos or DTS:X and thankfully the N950 is equally as adept when it comes to standard Dolby TrueHD and DTS-HD Master Audio soundtracks. You also have the choice of listening to the soundtracks in their original form, or using the surround sound expansion mode to take full advantage of all the available speakers.",
    "The film Gravity was a great example of this, with a 5.1 mix that was extremely well rendered by the N950 in its standard sound mode. However using the surround sound expansion mode gives this highly directional mix greater definition, helping to move sounds effortlessly around the room.",
    "Although the N950 is primarily intended to handle TV and movie multichannel soundtracks, thanks to the involvement of Harman Kardon, it’s no slouch when it comes to music either. The recently released 5.1 mix of Appetite for Destruction by Guns ’n’ Roses sounded fantastic on the N950, as did the remastered stereo version.",
    "Performance TL;DR: This is one of the best soundbars we have reviewed in terms of audio quality, and the only one to deliver Dolby Atmos and DTS:X properly. The result is a truly immersive soundstage, with effects that emanate from every direction including above.",
    "The Samsung HW-N950 will set you back $1,699 (£1,499, AU$1,999), so it certainly isn’t cheap, especially when compared to many other soundbars. However, it’s worth remembering that for the asking price you’re getting a full 7.1.4-channel system with actual rear speakers and a separate subwoofer.",
    "No other soundbar comes close to delivering such an immersive audio experience, and in reality you would need to buy an AV receiver and a full speaker package to replicate the N950’s capabilities. The cost of a 9-channel AV receiver and sufficient speakers to deliver five ear-level channels, four overhead channels and a subwoofer would probably be more than the N950. So when you take everything into account, the Samsung is actually good value.",
    "If you’re on a budget but you like the idea of a legitimate immersive audio soundbar system comprised of actual rear speakers and a separate subwoofer, then you could consider Samsung’s original HW-K950. Now that it has been replaced by the N950, this earlier soundbar combination can be picked up quite cheaply. However, it is worth remembering that the K950 is limited to Dolby Atmos and doesn’t support DTS:X.",
    "In terms of more recent soundbars, the LG SK10Y is certainly worth considering, particularly if you aren’t concerned about having actual speakers at the rear of the room. The SK10Y is cheaper and has been developed in conjunction with Meridian, so it should sound great. However its single soundbar and subwoofer combination means it will be very front-heavy in terms of the soundstage, and it doesn’t support DTS:X.",
    "The Sony HT-Z9F is considerably cheaper and it does support both Dolby Atmos and DTS:X. However it’s also limited to 3.1 channels with three speakers on the soundbar and a separate subwoofer. Sony claims that the Z9F can deliver a 7.1.2-channel experience thanks to virtual surround technology that employs psychoacoustics. However, while this might work to a degree, it will never replicate the truly immersive capabilities of the N950.",
    "The Samsung HW-N950 is simply one of the best soundbars that we have heard to date. Perhaps more importantly, it is the only soundbar that really delivers a 7.1.4-channel immersive audio experience. The use of wireless rear speakers and a subwoofer, make the N950 easy to install and setup. It also means that the combination of all these speakers is able to deliver object-based audio as the content creators intended, without resorting to psychoacoustic trickery.",
    "The soundbar, speakers and subwoofer are all attractively-designed and extremely well-made, while the system as a whole offers plenty of useful features. The N950 detected and decoded both Dolby Atmos and DTS:X without any issues, so if you’re a film fan then this is definitely the soundbar for you. It was equally as effective with regular soundtracks, not to mention music via both WiFi and Bluetooth.",
    "If you truly want to immerse yourself in your favourite movie soundtracks, then the Samsung HW-N950 should be at the top of your soundbar shortlist."
  ],
  "headers": {
    "4": "Design",
    "16": "Features",
    "26": "Performance",
    "38": "Value",
    "40": "Other soundbars to consider",
    "43": "Verdict"
  },
  "links": {
    "ARC (Audio Return Channel)": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "LG SK10Y": "https://www.techradar.com/reviews/lg-sk10y",
    "Sony HT-Z9F": "https://www.techradar.com/reviews/sony-ht-z9f-soundbar"
  }
}