{
  "source": "https://www.techradar.com/reviews/usenext",
  "title": "UseNeXT review",
  "category": "computing",
  "updated": "2020-11-24T01:02:38Z",
  "author": "desire-athow",
  "summary": "An experienced Usenet provider from Germany",
  "verdict": "UseNeXT delivers in some areas, but there are problems, too, and overall, you'll be better off elsewhere.",
  "pros": [
    "Six data centers",
    "Great retention",
    "Up to 30 simultaneous connections",
    "Over 200,000 uncensored newsgroups"
  ],
  "cons": [
    "Confusing prices",
    "Questionable privacy policy"
  ],
  "article": [
    "Usenet providers may not be the most popular online services, but they're part of a busy market. Certainly, there are enough to make finding the right Usenet service difficult.",
    "Adding a much-needed degree of simplicity to Usenet is UseNeXT, a German provider that has been operating for over 15 years. Usenet can be complicated and frustrating to sign up to and access. Do the measures employed by UseNeXT make things easier?",
    "Operating since 2004, UseNeXT offers six server farms, impressive speeds, large retention, over 200,000 newsgroups, and two recommended newsreaders.",
    "Considering UseNeXT for Usenet access? The service boasts high speeds up to 800 Mbps and up to 250 GB highspeed volume each month. Connections to the service via your chosen newsreader are via 256-bit SSL encryption, standard for Usenet providers. Subscribers can also get free access to the SpyOFF VPN.",
    "UseNeXT also offers six server farms, guaranteeing fast download speeds and access to over 200,000 uncensored newsgroups. Most Usenet providers promise \"120,000+\" newsgroups, which suggests UseNeXT offers more non-English language content.",
    "Data is served via centres in Europe and the US. These are high-speed servers, meaning that the only thing limiting performance is your ISP's infrastructure. Downloads take place with up to 30 simultaneous connections. This is lower than most Usenet providers who typically boast up to 50 connections.",
    "Signing up to UseNeXT will give you the option of simply viewing your server settings, or using a set up wizard. This is a smart option for anyone new to Usenet, and lets you choose your main device (PC or mobile), whether to stream or download, rate your technical know-how, and select a Usenet client.",
    "Two are recommended by UseNeXT: Momentum (a desktop client/newsreader) and Holmez (a browser-based newsreader that works on smart TVs). Note that these are locked to UseNeXT and cannot be used with other providers.",
    "Problems using UseNeXT can be resolved using the smart knowledgebase. For issues that aren't covered, a contact form is provided with the option to upload supporting screenshots, log files, etc.",
    "A key aspect to choosing a Usenet provider is retention. This is the amount of time data is retained on the Usenet servers. While Usenet has been around since the 1980s, no providers offer historical posts (these can be found in specialist online archives and even Google Groups).",
    "However, binaries (media files) uploaded to newsgroups since the 2000s are often provided, with retention measured in days. So, UseNeXT provides 3,800 days' retention. This means files uploaded since late 2010 (just under 10 years) can be found and downloaded using UseNeXT, which retains 30 petabytes of newsgroup data.",
    "Different providers offer varying retention figures. UseNeXT is among those with a higher retention.",
    "As noted, UseNeXT offers 256-bit SSL/TLS encryption as an option for accessing its Usenet servers. Non-SSL connections are also possible, although the speed differences are negligible. In short, SSL is provided and should be used.",
    "Sadly, UseNeXT does not offer any privacy options. A name, email address, and street address are required for sign up; there is no anonymous payment option (e.g. Bitcoin) and address details are even required for paying with PayPal (info that isn't required as PayPal can handle such data). On first login to UseNeXT via the web you'll be asked to provide a date of birth and phone number. Neither is required, and the request is an overreach that no other Usenet service provider appears to be attempting.",
    "A Privacy Policy has been published on the UseNeXT website. This outlines how customer data is used in terms of logging onto the website and accessing the knowledgebase. However, there is scant information about whether and how search and download activity is recorded. This appears to be a huge oversight that requires resolving as soon as possible.",
    "Our speed test was performed using a domestic connection measured by Ookla’s Speedtest at 39Mbps. Access was achieved via a VPN to avoid traffic shaping.",
    "The selected file was an 800MB AVI. This downloaded in under 6 minutes at a rate averaging 4400Kbps using the Momentum newsreader/Usenet and NZB client.",
    "Based on this and subsequent comparison downloads, UseNeXT appears to be among the fastest Usenet providers we have tested.",
    "UseNeXT boasts \"maximum speed at the lowest price\" and to some extent this is accurate. It has three main packages, Smart, Comfort, and Premium. These all offer a standard monthly membership.",
    "Rookie is €13.95 ($16.47, £12.60) for 60GB a month download capacity up to 200Mbps. Once this is used up, a maximum 1000Kbps cap is applied until the next payment cycle.",
    "Rockstar (€16.95, $20.01, £15.31) gives you 120GB a month download capacity, also up to 200Mbps, with a 1500Kbps cap.",
    "Legend, meanwhile, is €26.95 ($31.82, £24.35) with 300GB capacity. If you manage to reach the limit, there is basically no cap (the 200Mbps is limited by a specified 2000Kbps, essentially the same).",
    "UseNeXT also offers plus plans for bulk payments. These rates are confusing. For example, Rockstar+ is available over nine months (works out at €9.95 a month, or $11.75/£8.99); Legend+ over three months (€19.95 a month, or $23.55/£18.02); Rookie+ over 12 months (€7.95 a month, equivalent to $9.39/£7.18). However, there doesn't appear to be any option to have, say, Legend+ over 12 months, and full bulk prices aren't displayed until the checkout. Additionally. these \"plus\" options don't add any extra features.",
    "In addition to these rates, UseNeXT offers a free 14-day tier. This gives you 10GB maximum download, up to 2000Kbps speed, and can be cancelled at any time. Payment details are required first, and once the 14 days/10GB are up, you'll be charged.",
    "UseNeXT delivers an undoubtedly high-quality service, with high speeds and impressive retention. However, it has some shortcomings. While affordable, the available packages are listed with confusing prices; the privacy policy is unclear; sign up appears to require far more personal data than you should be comfortable providing.",
    "If it's speed and retention and an app with slick presentation and NZB support that you're looking for, UseNeXT is a great choice."
  ],
  "headers": {
    "3": "Features",
    "9": "Retention",
    "12": "Security and privacy",
    "15": "Performance",
    "18": "Pricing",
    "24": "Final verdict"
  },
  "links": {
    "Usenet providers": "https://www.techradar.com/best/best-usenet-providers",
    "UseNeXT": "https://www.usenext.com/",
    "Privacy Policy": "https://www.usenext.com/en-US/conditions",
    "Speedtest": "http://www.speedtest.net/",
    "Rookie": "https://www.usenext.com/en-US/pricing",
    "Rockstar": "https://www.usenext.com/en-US/pricing",
    "Legend": "https://www.usenext.com/en-US/pricing",
    "Rockstar+": "https://www.usenext.com/en-US/pricing",
    "Legend+": "https://www.usenext.com/en-US/pricing",
    "Rookie+": "https://www.usenext.com/en-US/pricing"
  }
}