{
  "source": "https://www.techradar.com/reviews/paper-mario-the-origami-king-review",
  "title": "Paper Mario: The Origami King review",
  "category": "gaming",
  "updated": "2020-07-13T15:25:50.905Z",
  "author": "matthew-forde",
  "summary": "All creased up",
  "verdict": "Though slow starting, Paper Mario: The Origami King is an endearing and stone-cold riotous adventure that is the series best for well over a decade.",
  "pros": [
    "Hilarious and charming",
    "Inventive boss battles",
    "Satisfying puzzles"
  ],
  "cons": [
    "Prolonged tutorial",
    "Lacking real challenge"
  ],
  "article": [
    "Being told by a set of anthropomorphic colored pencils that you were better as a side-scroller sets the tone of what just to expect from Paper Mario: The Origami King. It's whacky, it's bizarre and it's surprisingly brilliant.",
    "Due to celebrate its 20th anniversary this year, Paper Mario returns with its sixth entry to date, coming off the back of the mixed response to the Wii U's Color Splash and the universally panned Sticker Star on the 3DS.",
    "Fans for more than a decade have yearned for a return to the traditional RPG-style and originality that helped propel the first two games to a level the series has yet to reclaim. And though The Origami King doesn't quite hit those levels or even reinstate the previous beloved mechanics altogether, it's a worthy addition and the best Paper Mario since The Thousand Year Door.",
    "We start off in familiar territory, catching up with Mario and Luigi en route to the Origami Festival at the request of Princess Peach. It quickly becomes apparent that not all is what it seems, with much of Toad Town in tatters and the streets abandoned. The brothers continue to the castle where they find Princess Peach has been transformed into an unsettling origami version of her former self, thanks to the evil doings of Olly, the Origami King.",
    "Forced to join the A4 army, Mario is dropped into the depths of the castle, only to be met by Bowser and his minions who are in line to suffer the same fate. The Koopa King has been folded into a square and is not too happy about it either, as his clipped face embarrassingly dangles from a peg.",
    "To escape, Mario finds a Magic Circle, which allows him to utilize the new 1,000-Fold Arms special ability. Here, Mario grows long folded arms that can tear parts of the paper world apart to uncover secrets, solve puzzles, or help in battle (which we'll come onto) and in doing so uncovers the sweet and sassy Olivia, Olly's sister. The trio make their exit via one of Bowser's minions piloting the Koopa Clown Car but are stopped by Olly, only to see the castle raveled in five colorful streams of paper, preventing anyone from entering and seeing Mario and Olivia separate from all in a crash landing – thus beginning the adventure.",
    "Venturing across fall mountains, grassy plains, uncharted seas, desolate deserts, and more, Mario takes on Olly's underlings in a new ring-based battle system. Players must slide and line up enemies to give Mario a heightened attack power, before selecting a weapon (jump, hammer or item) to take them down, all while a countdown looms. This increasingly becomes more complex the further you get and is a big improvement over the sticker mechanics that plagued the last two iterations.",
    "The new puzzle aspect can take time to gel. More so, it contributes to the biggest detriment of the game in which it takes far too long to really get going. It can be a good three to four hours before the first boss is reached, only to introduce a different spin on battles.",
    "Instead of lining up enemies, these fights have Mario rotating the floor panels to build a path to the boss positioned in centre-screen. Protecting the colorful streams are the Legion of Stationary (move over Legion of Doom), an assortment of everyday household items ready to shred all that oppose. They're inventive, ever-changing and a spectacle to behold, all the way through to curtain call.",
    "Besides this, there are Paper Macho boss fights that take place in the open world. Seeing a giant Goomba lit up like a lantern hurdle towards you is definitely a sight to behold. These help to change things up and are spread out well enough that they never feel too overused.",
    "While EXP points (experience points) fail to make their return to the series once again, the higher value placed upon coins help to dampen the blow and still make for a somewhat satisfactory replacement. Players earns coins in battle or in the new linear open world – no chapters this time around - with the currency used to primarily purchase more weapons and accessories for enhancing Mario. There's plenty of them too! At the three-hour mark, we possessed over 13,000 and never felt strapped for cash until the very later stages of the game, and that was really only for additional collectible treasures.",
    "Confetti is a feature that sees Mario throwing the small pieces of paper over gaping holes that are scattered across the land. Identical to the paint gimmick in Color Splash, it's a welcome return that adds to the world. Many of these holes will also show the scaffolding that supports the paper world, helping to keep the narrative going that these games are based within theatre plays. A nice touch.",
    "Outside of this, it's fantastic to see partners make their triumphant return. Partners are characters that you recruit to your party, to help you in combat situations and to generally keep you entertained. There's only a handful of partners in Origami King, but each is endearing and brings so much to the story. All receive smartly written dialogue and play for comedic chops well, yet some are clearer favored. One partner exits in an emotional goodbye, while another leaves unceremoniously. It's a strange choice. However, it doesn't take away from some of the unexpected narrative moments that we wouldn't dare want to ruin here.",
    "When it comes to combat, partners will attack once a turn of their own doing but are never apparent in boss battles and for the most part are decorative. This is a little disappointing, as each character having their own loadout and health to manage (like in the originals) wouldn’t have felt out of place here.",
    "One of Origami king’s prominent new sections takes influence from 2D Zelda. Vellumental Temples are dungeon-like areas where Mario must solve a number of puzzles to reach the Vellumental's guardian. There's so much to love about these levels, whether running over stretches of lava, sliding on ice panels or solving stone tablets to progress to the next section. There's nothing staggeringly new but it's all executed extremely well that it doesn't matter.",
    "Unsurprisingly, Toads are back in their abundances. The mushroom men can be found dispersed across the world, folded up into all manner of shapes which Mario can return to normal via his trustee hammer. Toads then make their way either to Toad Town to open shops or as a spectator for all of Mario's battles where they can be called upon when in trouble. It's enjoyable to search every crevice to 100% the map but there's something lost in seeing that every Toad is identical. Surely, it's not difficult to stick a mustache on one to help differentiate?",
    "The paper aesthetic design, that has helped keep the look of the series timeless, glistens in both handheld and docked mode. It's utterly charming and runs as well as can be expected from a Nintendo first-party product.",
    "Interestingly, music plays a major role not only in audio design and soundtrack – which is fabulous by the way, with Sweetpaper Valley and Shroom City both standouts – but as a major part of the game's personality. There're not many games that can pull off an elderly tree and his trio of singing \"Sap Sisters\" in the first hour and make it work. It's a testament to just how far the writing, dialogue and hysterical nature of the team at Intelligent Systems have come.",
    "It may not be the most challenging title on Switch but it may be one of the most fun. Paper Mario: The Origami King is a refreshing palate cleanser in a year where more light-hearted and comedic experiences are needed more than ever.",
    "Regular battles can occasionally become a little paper thin but as soon as boss battles start appearing, the ante skyrockets. At an approximately 25-hour story, there's enough variety and whimsical Nintendo magic that the pacing never feels off – outside of the opening hours.",
    "For any newcomers, it's worth diving into the madness without the burden of any prior reservations. For long-term fans, don't go in expecting something akin to the original two and you might just be surprised by the imaginative levels, delightful writing, and all-around fun adventure that makes for a justified installment into a series that has always deserved the best."
  ],
  "headers": {
    "3": "Return to form",
    "9": "Coins galore",
    "12": "That's a wrap",
    "18": "Verdict"
  },
  "links": {}
}