{
  "source": "https://www.techradar.com/reviews/amd-ryzen-5-3600xt",
  "title": "AMD Ryzen 5 3600XT review",
  "category": "computing",
  "updated": "2020-07-07T13:00:56Z",
  "author": "bill-thomas",
  "summary": "Time for a celebration",
  "verdict": "The AMD Ryzen 5 3600XT is a spec refresh of the existing Ryzen 5 3600X with some refinements to the 7nm Zen 2 architecture. It's not an exciting release, but it's easy enough to recommend to folks looking to build a good gaming PC right now.",
  "pros": [
    "Stronger single-core performance",
    "More performance at the same price",
    "Included cooler"
  ],
  "cons": [
    "Higher temperatures",
    "Higher power consumption"
  ],
  "article": [
    "AMD Ryzen 3rd Generation processors launched exactly a year ago, bringing 7nm processors to the mainstream for the first time. Even to this day, these processors are completely unmatched when it comes to multi-core performance. Just look at Intel's 10th-generation Comet Lake-S CPU lineup that launched back in May 2020 – which completely failed to topple AMD's reign.",
    "So, when Team Red announced that it was refreshing its processor lineup with the AMD Ryzen 5 3600XT, AMD Ryzen 7 3800XT and AMD Ryzen 3900XT, we were a little lost as to their purpose.",
    "However, after doing some in-depth testing, the jump in boost clocks, which consequently raises single-core performance, cements the AMD Ryzen 5 3600XT as one of the best processors for gaming, and serves as a nice little stopgap until we get AMD Ryzen 4000 later this year.",
    "The AMD Ryzen 5 3600XT should be available today, with a suggested price of $249 (about £200, AU$360). That places it within the exact same price window as the existing AMD Ryzen 5 3600X, which you can find for around $249 (£209, AU$399). This essentially means that the 3600XT all but replaces the 3600X, as unlike the other 3000XT chips, this one still comes with the Wraith Spire cooler.",
    "And, as a bonus, it's still more affordable than the Intel Core i5-10600K, which at the time of writing is selling for $294 (£278, AU$499). And given that the 3600XT trades blows with Intel's mid-range chip in all of our tests, if you're able to find the AMD Ryzen 5 3600XT for $50 (£69, AU$100) cheaper, there's really no reason to not go Team Red for your gaming build.",
    "As we'll discuss in a bit, the gains here over the AMD Ryzen 5 3600X won't be enough to convince literally anyone to upgrade, but that's not what this processor is for – instead, it's for anyone who has yet to jump on the AMD Ryzen 3000 train. And, for that, it's a pretty easy sell.",
    "At the end of the day, the AMD Ryzen 5 3600XT is still an AMD Ryzen 3000 processor, which means it's manufactured on the same 7nm Zen 2 architecture as the rest of the lineup. However, that doesn't mean that AMD hasn't made any refinements over the last year.",
    "You see, AMD has been sitting behind the scenes optimizing the Zen 2 architecture, which has allowed it to squeeze higher frequencies out of the silicon without drastically raising power consumption. This is reflected in the significantly higher single-core performance. And, while it doesn't quite dethrone Intel completely in that world, it comes pretty damn close.",
    "This isn't to say that power and temperatures are exactly the same, however. Now, to be clear, we don't run hardcore stress tests like Prime 95 to see the absolute max temperature that a processor is going to hit, as that doesn't reflect real-world scenarios. However, throughout our testing, the AMD Ryzen 5 3600XT hit 81.3C, compared to the 64.5C of the Ryzen 5 3600X. That's an alarming rise to be sure, but it's entirely because of the higher power consumption.",
    "At its most thirsty, the 3600XT sucked down 101.92W of power, according to HWInfo. That's a 12% jump over the peak 90.45W we saw with the Ryzen 5 3600X. AMD is recommending that anyone that gets one of these XT processors goes with one of the best aftermarket CPU coolers, and with these results, we'd have to agree.",
    "Beyond that, though, there really isn't much different from the rest of the Zen 2 lineup. Even so, if you haven't picked up a Ryzen 3000 processor yet, these XT chips are technically the most refined of the bunch, so there's no reason to not opt for one.",
    "Because the AMD Ryzen 5 3600XT is basically a 3600X with better single-core performance, performance sees a small jump across the board. Multi-core scores are only slightly better, with the XT scoring just 3% better in Cinebench R20 nT.",
    "Single-core performance also sees around a 3% boost, going from 504 to 518 in the Cinebench R20 test. This isn't impressive on its own, but that slight boost is enough to nearly close the gap with Intel. For instance, the Intel Core i9-10900K – a chip that costs twice as much, gets 522 points in the same test. That's 3 points, or just a 0.8% difference, and within the margin of error for that test.",
    "Even in gaming, AMD is threatening Intel's long-standing grip on the \"best processor for gaming\" title. The Ryzen 5 3600XT is basically tied with the Intel Core i5-10600K in Total War: Three Kingdoms at 1080p, while managing to beat that chip in Assassin's Creed Odyssey by a healthy 4% margin – all while being 15% cheaper at the same time. However, the Ryzen 5 3600XT does lose by 4% in Metro Exodus at 1080p – but two out of three is a pretty solid score here.",
    "If you're building a gaming PC right now, and you need the best \"bang for your buck\" processor for gaming, the AMD Ryzen 5 3600XT is it. The 6-core, 12-thread configuration is going to be enough to keep your PC current once the Xbox Series X and PS5 in late 2020, and the high single-core performance means it'll be great for every game that comes out, regardless of how lightly or heavily threaded it is.",
    "The AMD Ryzen 5 3600XT is a minor spec bump to bridge the gap between the Ryzen 3000 and Ryzen 4000 desktop lineups. Coming in at the same price as the 3600X, it essentially replaces that processor, with a slight performance advantage.",
    "This isn't an essential release by any stretch of the imagination, but for anyone that was thinking about building a PC with a Ryzen 3000 chip in it already should go for either the AMD Ryzen 5 3600XT or one of the other XT chips, especially if they were going to grab an aftermarket CPU cooler either way.",
    "And, so, sure it's not exciting, but the AMD Ryzen 5 3600XT achieves what it set out to do."
  ],
  "headers": {
    "3": "Price and availability",
    "6": "Features and chipset",
    "11": "Performance",
    "15": "Final verdict"
  },
  "links": {
    "AMD Ryzen 3rd Generation": "https://www.techradar.com/news/amd-ryzen-3rd-generation",
    "processors": "https://www.techradar.com/news/best-processors",
    "Comet Lake-S": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "AMD Ryzen 4000": "https://www.techradar.com/news/amd-ryzen-4000",
    "AMD Ryzen 5 3600X": "https://www.techradar.com/reviews/amd-ryzen-5-3600x",
    "Intel Core i5-10600K": "https://www.techradar.com/reviews/intel-core-i5-10600k",
    "best aftermarket CPU coolers": "https://www.techradar.com/news/best-cpu-coolers",
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "best processor": "https://www.techradar.com/news/best-processors",
    "building a gaming PC": "https://www.techradar.com/how-to/how-to-build-a-pc",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ryzen 4000": "https://www.techradar.com/news/amd-ryzen-4000"
  }
}