{
  "source": "https://www.techradar.com/reviews/1more-true-wireless-anc",
  "title": "1MORE True Wireless ANC review",
  "category": "audio-visual",
  "updated": "2020-05-13T18:24:23Z",
  "author": "ted-kritsonis",
  "summary": "After a firmware update, the 1MORE True Wireless ANC is now a decent alternative to more mainstream options",
  "verdict": "After correcting some key mistakes, the 1MORE True Wireless ANC are decent pair of earbuds with active noise-cancellation. That said, while they never quite surpass the trend-setting Sony WF-1000XM3 or Apple AirPods Pro, they're a good alternative to the mainstream models everyone else is using.",
  "pros": [
    "Active noise-cancellation",
    "Good sound quality",
    "Supports AAC and aptX codecs"
  ],
  "cons": [
    "Thicker design",
    "Battery life is just okay",
    "App could use an EQ"
  ],
  "article": [
    "It seems every company that can is making true wireless earbuds these days. As they continue to grow in popularity, good alternatives to big name brands pop up when you least expect them to. They’re not all going to necessarily be the cheapest on the block, but they’re worth considering.",
    "That’s really where the $199 (£187, around AU$300) 1MORE True Wireless ANC fit in.",
    "These true wireless earbuds are competing with the like of the Apple AirPods Pro and Sony WF-1000XM3, and while they never quite surpass them, they offer a good alternative to the mainstream models everyone else is using.",
    "Unlike some other true wireless models out there, these aren’t going to win in the diminutive department. The thicker form factor is obvious right out of the box, but it’s also forgivable because of the tech nestled inside.",
    "They each house 10mm drivers with balanced armatures for the high end to spread out the spectrum pretty evenly, since the drivers handle the lower frequencies. Then there’s the active noise-cancellation (ANC) to block out ambient noise, along with a Pass-through mode to pipe it in when you want some spatial awareness.",
    "Then there are the onboard controls: each side has a physical button – tap the left once to lower volume, the right to raise it. Double-tap either button to play/pause audio or accept/end phone calls. Holding on the right skips a track, on the left repeats one. A triple-press raises your voice assistant, though we’ll get to all that later. The outer shells are touch-sensitive, where the one function is to control ANC with a double-tap.",
    "All of this factors in to how they shape up, where the bulk of each earpiece lies outside the inner ear. It’s not unlike how Bluetooth headsets used to be for hands-free phone calls, where the beefy portion hung over. It makes the included eartips and fins all the more important because finding the right seal also requires finding the right stability.",
    "There are four pairs of tips and fins to work with, and you will need to experiment with them to find the best fit. We sometimes had the feeling they were precariously holding onto our ears, yet came away surprised when they stood in place.",
    "Pairing the earbuds was easy enough, and the dedicated 1MORE Music app to facilitate the additional features inside. ANC has two different settings: Mild to block out a moderate level of noise, or Strong to block out as much as possible.",
    "The app makes it easy to just slide between them, but it’s not so simple through the earbuds themselves. Double-tapping either earpiece cycles through things in this order: ANC Strong, ANC Mild, Pass-through, ANC Off.",
    "Firmware updates have already proven to be crucial, too. When we first got these, the audio levels never truly sounded right with ANC turned on. Bass was ridiculously heavy, drowning out the highs in ways that affected any music playing, but an update in March 2020 fixed that, while also improving levels when ANC is off. Had it not been for that, we would’ve been soured on one of the signature features 1MORE touts with these earbuds.",
    "In terms of sound quality, 1MORE collaborated with Luca Bignardi, a Grammy-winning sound engineer who tuned these earbuds. We’re not familiar with what musical style he prefers, but the point of working with him was to get across sounds that artists and producers intended.",
    "To help in that delivery, the ANC use aptX and AAC codecs that carry HD audio wirelessly from your smartphone or tablet to the buds, and help them to sound their best even when you don't have the best source material.",
    "In terms of tone, the ANC boosts bass, whereas Pass-through dilutes it in deference to treble. With everything off, the sound signature is decidedly polarized, meaning that treble and bass tend to stand out at the expense of the mids. This was probably why we sometimes felt like vocals carried a distant reverb in certain tracks.",
    "Still, the amount of bass is also predicated on what kind of seal you’ve achieved with the tips and fins. These are the kind of earbuds that won’t fit every pair of ears with the same level of comfort, but when you do feel like you’ve done it right, you should get something that works for your preferred genre of music.",
    "We listened to a wide range of tracks to gauge that. Sade’s I Couldn’t Love You More isn’t a complex track, but it also didn’t ‘pop’ until we listened in one of the ANC modes. The same was true of The Weeknd’s Blinding Lights, with its new wave-infused synth melody. It’s a lively track, yet came off muddy when ANC was off. We didn’t mind the treble boost as much when listening to late night jazz while writing this review, but we’re not sure how much it will suit most tastes.",
    "When we tried rock with tracks like The Black Keys’ Shine a Little Light and The Rolling Stones’ Living in a Ghost Town, we were fine with listening with ANC off. But the extra bass wasn’t bad for favorite rock playlists when we did turn it on.",
    "What 1MORE really could benefit from is a customizable EQ. There are variables here that could affect one genre more than another, which could be mitigated, to some degree, by playing around with frequencies. Even if there were presets we could play off of, that would be a big step in the right direction.",
    "Phone calls were generally okay, though people knew we were talking through a headset right away. ANC does play a nice role in drowning out noise to boost voices, albeit at the expense of the battery.",
    "Officially, 1MORE rates these at six hours per charge at 50% volume when listening with all special modes off. Since that’s unlikely to happen on both counts, as we experienced, your mileage will vary below that.",
    "At worst, we managed over three hours with ANC on the whole time, and volume hovering at 60% or more. Not great, but understandable given all the stuff going on inside, not to mention the 10mm drivers. On average, we reckon you should expect between 3.5 to five hours per charge. Not stellar numbers at this price range, but it’s pretty much on par with the AirPods Pro, which are $50 more.",
    "The case can recharge the earbuds up to three more times, and since it uses USB-C, you do get some quick charging action. Put them in for 15 minutes and you can get up to two hours of playback. It also supports wireless charging with any Qi-enabled pad or surface, adding another option to get extra juice.",
    "Despite the challenges we came across in using the 1MORE ANC True Wireless, we found some upside in using them: they support AAC and aptX Bluetooth codecs, offer decent noise cancellation and good sound quality.",
    "We just wish 1MORE would augment the audio quality with additional tools and that the fit wasn't so tricky to get right. Firmware updates have already saved these once, perhaps another could have a similar impact."
  ],
  "headers": {
    "3": "Design",
    "8": "Performance",
    "19": "Battery life",
    "22": "Final verdict"
  },
  "links": {
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds"
  }
}