{
  "source": "https://www.techradar.com/reviews/highfive",
  "title": "Highfive video conferencing review",
  "category": "computing",
  "updated": "2020-05-27T14:44:57Z",
  "author": "darcy-french",
  "summary": "An integrated video conferencing solution",
  "verdict": "Highfive represents a compelling choice for an enterprise-wide video conferencing solution. Not only does its software compete well against its most established competitors, it even exceeds them in functionality at times.",
  "pros": [
    "Included hardware in all business plans",
    "Advanced integration with third-party platforms"
  ],
  "cons": [
    "Meetings capped at 125 participants",
    "Included hardware makes Highfive expensive"
  ],
  "article": [
    "Highfive is one of the most unique video conferencing providers in the market and could be the perfect choice for many businesses.",
    "Rather than paying per host or per user, as is the norm with most video conferencing platforms, businesses using Highfive for their video conferencing solution pay per room. With all Highfive subscriptions, the hardware is included, and this really separates Highfive from its competitors.",
    "In our Highfive review, we consider whether Highfive might, in fact, be the best video conferencing software available and whether the software holds up its half of the bargain.",
    "Highfive provides one single software platform for all organizations, and it is packed with all the features you’d expect in a high-quality video conferencing platform, plus some extras.",
    "Meeting duration, call recording, screen sharing, in-call chat, and domestic and international dial-in are all unlimited. With Highfive hardware devices, users can seamlessly project their screens to projectors and TVs.",
    "As is increasingly becoming the norm within the market, Highfive offers deep integration with third-party digital collaboration platforms, working seamlessly with Slack, Microsoft 365, and G-Suite. A partnership with single sign-on provider Microsoft Azure is another nifty feature that saves businesses and users time.",
    "However, one negative of Highfive’s platform is that meetings are capped at 125 participants. This is significantly less than the vast majority of Highfive’s competitors and may dissuade organizations that conduct large teleconferences or webinars.",
    "Anyone can easily download Highfive’s mobile and desktop applications. On mobile, it is as simple as downloading from your device’s app store. However, for Windows 10 the process was more complicated, as we had to install a Google Chrome extension before we could download the desktop application.",
    "The Highfive software platform is well designed and makes video conferencing an easy and intuitive experience. The apps are highly responsive, with important features displayed prominently.",
    "In a test call between three participants using Highfive’s desktop application, audio and video were both clear, and we noticed no lag or distortion.",
    "Users are also able to join a call using Highfive’s web interface, go.highfive.com. This interface made it easy to join a call using a link.",
    "We were unable to test Highfive’s hardware.",
    "Highfive’s calls are encrypted in-transit with the 256-bit AES standard, which is positive. However encrypted calls and messaging are now the norm in video conferencing software, and most video conferencing platforms provide an optional end-to-end encryption service for all or part of their video conferencing software.",
    "Highfive also relies on Amazon Web Services (AWS) and Google Cloud Platform (GCP) to power its cloud conferencing platform. Although AWS and GCP are widely respected for their security policies, including on-site security at their data centers, both have been the target of successful cyber attacks in the past. Unfortunately, we must mark Highfive down for relying on third-parties for a core element of its service.",
    "Highfive is a highly secure platform, but it’s not a leader in security.",
    "Highfive offers a single tier of support for all customers. Phone, chat, and email support is available for all businesses, and administrators can build an ongoing relationship with a dedicated customer representative.",
    "The online support site also provides several useful resources such as video guides and written tutorials. Unlike most of its competitors, interestingly, Highfive also offers in-person training.",
    "Highfive’s pricing model is innovative and incorporates both software and hardware into three levels of membership, Select, Plus, and Premium. Rather than pay for users, businesses pay for rooms. The software options are the same for each plan (see next section), and it is only the hardware that differentiates them.",
    "The Select plan costs $199 room/month. For each room, businesses receive one of Highfive’s all-in-one devices, which have a wide-angle 720p HD camera with a low light sensor, and four high-fidelity microphones.",
    "In making hardware a central part of its business model, Highfive competes directly with other cloud conferencing platforms providing native hardware such as Cisco Webex and Microsoft Teams. These competitors offer a wider range of hardware devices, so businesses that prioritize niche hardware applications in a video conferencing solution may prefer their offerings.",
    "Unfortunately, the unique structure of Highfive’s pricing model makes it challenging to compare affordability head-to-head with its competitors.",
    "Highfive represents a compelling choice for an enterprise-wide video conferencing solution. Not only does its software compete well against its most established competitors, it even exceeds them in functionality at times.",
    "The choice to charge businesses on a per room basis, rather than per user or per host, is an innovative one that we like a lot. Highfive’s innovative pricing model means less worrying about how many individual licenses a business will need, and instead frees everyone in your organization to use the platform as much, or as little, as necessary.",
    "While the decision to use Amazon Web Services and Google Cloud Platform costs Highfive a few marks, it's not a major concern and shouldn’t deter companies from considering Highfive for their business."
  ],
  "headers": {
    "3": "Features and utilities",
    "7": "Setup",
    "8": "Interface and performance",
    "12": "Security",
    "15": "Support",
    "17": "Plans and pricing",
    "19": "The competition",
    "21": "Final verdict"
  },
  "links": {
    "video conferencing providers": "https://www.techradar.com/best/best-video-conferencing-software",
    "Highfive": "https://highfive.com/",
    "single sign-on": "https://www.techradar.com/best/best-identity-management-software",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "go.highfive.com": "https://go.highfive.com/",
    "Amazon Web Services (AWS)": "https://www.techradar.com/news/aws",
    "email": "https://www.techradar.com/news/best-email-hosting-providers",
    "all-in-one devices": "https://highfive.com/hardware/all-in-one-device",
    "Cisco Webex": "https://www.techradar.com/reviews/cisco-webex-meetings",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams"
  }
}