{
  "source": "https://www.techradar.com/reviews/ulefone-armor-7e-rugged-smartphone",
  "title": "Ulefone Armor 7E rugged smartphone review",
  "category": "phones",
  "updated": "2020-05-29T17:53:07Z",
  "author": "desire-athow",
  "summary": "A surprising refresh of one of the best rugged mobile phones on the market",
  "verdict": "The Ulefone Armor 7E is an extremely capable rugged smartphone that delivers the right balance of features, making it a compelling choice in this price range. We can only lament the lack of Android 10 though.",
  "pros": [
    "48-megapixel camera",
    "NFC",
    "Speedy P90 processor",
    "Excellent price",
    "Heart rate sensor",
    "Wireless charging",
    "Dual LTE/4G SIM standby"
  ],
  "cons": [
    "No Android 10",
    "Camera sensor positioning",
    "No customizable button",
    "Lanyard slot",
    "Average storage performance",
    "Only 4GB of RAM"
  ],
  "article": [
    "Out of nowhere, Ulefone, one of the few challenger smartphone vendors in China, delivered a surprising rugged smartphone in the shape of the Armor 7E, a watered down version of the Armor 7. Of the latter we said that it is a handset that fulfills all the main expectations one would have had from a top-end rugged smartphone. Looks the part, feels sturdy, has a big battery and a few gadgets.",
    "What is perhaps the biggest surprise is how affordable it is; the Armor 7E retails for as low as $227 at online Chinese retailer Banggood. The Armor 7 costs $365 at Aliexpress, both prices are at the time of writing and include free shipping to select territories. The Armor 7 is 61% more expensive than its sibling; let’s see whether the compromises are worth the price delta.",
    "One thing that is abundantly apparent comparing both devices is that the Ulefone merely recycled the body of the Armor 7. Both look exactly the same and we will refer you to the corresponding section in our Armor 7 review rather than copying and pasting it here.",
    "The tl;dr summary is that it is big, it has a lanyard slot - which we did not warm up to - and adopted the same design philosophy embraced by most rugged smartphones we’ve tested over the years.",
    "The big differences are found inside. Overall, compared to the Ulefone Armor 7, the 7E is a minor step down. The biggest change - arguably - is the halving of the onboard memory from 8GB to 4GB and some of its camera sensors are also far inferior - two 2-megapixel ones rather than a 16-megapixel sensor paired with an 8-megapixel one. The onboard storage capacity is still 128GB and so is the CPU, the Mediatek Helio P90.",
    "Similarly, the Armor 7 and 7E share other hardware features: a 6.3-inch FHD+ IPS display, a 48-megapixel rear Samsung camera, 16-megapixel front camera and 5500mAh battery. Other features include 802.11ac Wi-FI, Bluetooth, dual nano SIM card with microSD slot, Bluetooth 5.0, NFC, IP68, wireless charging, heart rate sensor and MIL-STD-810G certification.",
    "The star of the show is the P90 which shone during our benchmarks, delivering some of the best numbers in our PC Mark 2.0, ahead of the AGM X3, the former champion with a Qualcomm Snapdragon 845. Its numbers are up there with the Doogee S95, the Blackview BV9900 Pro and the Ulefone Armor 7, all of which are powered by Mediatek’s midrange champion.",
    "One fly in the ointment was the relatively poor performance of the storage subsystem in read under the Androbench benchmark. At 308MBps, its sequential read is significantly slower than the average of 516MBps scored by the three aforementioned smartphones. Curiously the sequential write performance was actually faster than the numbers posted by its peer (246 vs 198MBps).",
    "Elsewhere, the Armor 7E turned out to be an exact replica of the Armor 7. All the apps found on the latter were present on the former and the lack of system memory (remember there’s only 4GB rather than 8GB) didn’t seem to hamper its overall performance.",
    "There’s an FM radio app, an outdoor toolbox kit with 11 features (including a pedometer and a sound meter), a dedicated Children Space app that allows you to provide a safer version of your smartphone for your kids to use.",
    "The Doogee S68 Pro is a smidgen cheaper at $210 but is a mixed bag compared to the Armor 7E. It has an older CPU, the P70, and its best camera sensor (it has three) reaches 21-megapixel, a fraction of the 48-megapixel of the 7E. On the other hand, it has a bigger battery and more memory. Advantage to Ulefone’s candidate.",
    "The Oukitel WP6 is a firm favourite of ours if battery life is what you’re after as it packs 10Ah, almost twice what the 7E offers. It retails for about the same as its Ulefone rival and runs on a P70 rather than the P90 CPU while offering 6GB of RAM rather than 4GB. Although it doesn’t offer NFC, it does have a similar 48-megapixel rear camera sensor.",
    "Blackview doesn’t have any competitive products in that price range with existing models having older processors, older Android versions, less onboard storage or inferior camera sensors. As a reminder, the Armor 7 is a staggering 60% more expensive than its cheaper counterpart.",
    "Ulefone’s latest rugged smartphone is a mature product that doesn’t need any big improvements per se. Actually, perhaps the only improvement that we can demand is the move from the 2018 Android Pie (AKA v9) to Android 10 which is almost one year old now.",
    "The 7E squarely positions the Chinese vendor as a major competitor in the midrange segment with some surprising feature choices. It is the cheapest smartphone - that we know of - which ships with a P90 processor AND a 48-megapixel camera.",
    "In other words, Ulefone managed to ship most of the features found in a high end rugged smartphone in a device with a midrange price. There’s some fascinating arithmetic acrobatics that has been done in order to make the Armor 7, the more expensive version of the 7E, still attractive.",
    "All in all, the 7E punches well above its weight with a feature set that goes beyond our expectations except for the system memory. As expected, it does inherit some of the cons from its predecessor but, given the price, we’re more than happy to live with them."
  ],
  "headers": {
    "2": "Design",
    "4": "Hardware",
    "6": "Performance and in use",
    "10": "Competition",
    "13": "Final verdict"
  },
  "links": {
    "Armor 7": "https://www.awin1.com/awclick.php?awinmid=6378&awinaffid=103504&clickref=trd-us-3768612900027938000&p=https%3A%2F%2Fwww.aliexpress.com%2Fitem%2F4000207631877.html",
    "Armor 7E": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-4560805048946787300&ulp=https%3A%2F%2Fwww.banggood.com%2FUlefone-Armor-7E-IP68-IP69K-Waterproof-6_3-inch-4GB-128GB-48MP-Triple-Camera-NFC-5500mAh-Helio-P90-Octa-Core-4G-Smartphone-p-1661444.html",
    "Armor 7 review": "https://www.techradar.com/reviews/ulefone-armor-7-rugged-smartphone",
    "Doogee S95": "https://www.techradar.com/reviews/doogee-s95-pro-rugged-smartphone",
    "Blackview BV9900 Pro": "https://www.techradar.com/news/a-cheap-8gb-ram-waterproof-smartphone-with-256gb-storage-just-went-on-sale",
    "Ulefone Armor 7": "https://www.techradar.com/reviews/ulefone-armor-7-rugged-smartphone",
    "Doogee S68 Pro": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-6847207439232411000&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_3004005728120224.html%3Fwid%3D2000001",
    "Oukitel WP6": "https://www.awin1.com/awclick.php?awinmid=6607&awinaffid=103504&clickref=trd-us-1114897298134716800&p=https%3A%2F%2Fwww.gearbest.com%2Fcell-phones%2Fpp_009984250623.html%3Fwid%3D1349303"
  }
}