{
  "source": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2020",
  "title": "Dell XPS 13 2-in-1 (2020) review",
  "category": "computing",
  "updated": "2021-09-14T10:58:39Z",
  "author": "orestis-bastounis",
  "summary": "Dell’s premium 2-in-1 XPS is one of the best Windows laptops around",
  "verdict": "A beautifully designed laptop with processing power that delivers a brilliant Windows environment for both general tasks and more intensive applications, making this the best 2-in-1 currently available.",
  "pros": [
    "Great display",
    "Superb build quality",
    "Fantastic battery life"
  ],
  "cons": [
    "Less useful as a tablet",
    "Expensive",
    "Webcam just 720p"
  ],
  "article": [
    "The Dell XPS 13 2-in-1 (2020), also known as the Dell XPS 13 7390, is a major performance and specification update to Dell’s high-end 2-in-1 range, and could be the finest example there is of this popular best-of-both-worlds form factor.",
    "Usually, 2-in-1 laptops function perfectly normally as standard touchscreen Windows laptops. But they also offer a mechanism to flip the screen around and transform the laptop into a tablet, making easier to carry around and use when out and about.",
    "The experience of using one is nothing at all like an iPad or Android tablet though and instead is closer to Microsoft’s Surface Pro. It’s a Windows 10 laptop after all, and it runs standard PC software, with touch interactions and an on-screen keyboard replacing the keyboard and mouse when interacting with standard PC software.",
    "But despite beginning this review by highlighting the Dell XPS 13 2-in-1 (2020)’s tablet functionality, that’s merely one of its features, and we actually spent more of our time using it as a traditional laptop, albeit one that performs spectacularly and offers an impressively fluid Windows experience for general computing.",
    "Our review unit’s combination of Intel’s 10th-generation “Ice Lake” quad-core Core i7 processor, gorgeous high-resolution display, fast PCIe NVMe storage and 16GB of memory makes it a highly capable portable machine. But it’s the addition of outstanding precision aluminium design and solid build quality that allows it to truly stand out as an all-round dream machine for general Windows use and a nifty portable system for some design tasks too.",
    "The only glaring limitation is the lack of any form of discrete graphics for gaming or performance acceleration when using the Dell XPS 13 7390 for video and photo editing. It relies on Intel’s Iris Plus integrated GPU.",
    "In all other respects the Dell XPS 13 2-in-1 (2020) has just about every feature you could want on a laptop. Absolutely stellar battery life, Wi-Fi 6, plenty of storage, quiet (but not silent) operation and great all-round performance make this a real champion of Window laptops and a benchmark by which to judge competing designs against.",
    "If you’re searching Dell’s site for the 7390, be aware that as of late 2020, Dell has confusingly launched a second 2-in-1 laptop called the 9310, with a near-identical design that sits alongside the 7390 in the lineup. Based on the superior 11th-generation Intel processors, we’d recommend go for the 9310 model as you’ll definitely get better performance from 11th-generation Intel processors.",
    "In particular it has the new integrated Intel Iris Xe graphics, and it has the option of more customisation options, including up to 32GB of memory, and an Ultra HD+ HDR display with lovely Dolby Vision support. But in most other respects the two models are identical.",
    "The Dell XPS 13 2-in-1 (2020) model we tested came with a 512GB PCIe 3.0 NVME SSD, 16GB of DDR4 memory and FHD+ display, with a 720p webcam.",
    "If you want the cheapest Dell XPS 2-in-1 (2020) configuration, the absolute entry level configuration has just 8GB of memory, 256GB SSD, a, 11th generation Core i3 processor and lower resolution FHD+ display for a tempting $1,099 (around £900, AU$1,400),",
    "That’s not a lot of memory or storage though, so we’d suggest opting for 16GB and a 512GB SSD. As with other devices, Dell offers a range of configurations and prices.",
    "The fully loaded Dell XPS 2-in-1 (2020) configuration, with 32GB of DDR4 memory, a 1TB SSD and UHD+ HDR 400 display costs $2,249 / £2,199 (around AU$3,000), which is obviously a lot of money but semi-reasonable value relative to competing laptops with similar high-end specifications.",
    "Dell’s premium XPS design language casts off any notion that Windows laptops lack the same chic or modern feel of Apple devices. In (almost) all areas the XPS 13 2-in-1 (2020) both looks and feels like a top quality product, and this goes a long way to justifying the price.",
    "We had more than a few people coo at the slim design. It’s not as thin as a MacBook Air but it does retain the same strikingly thin appearance. It feels strong but highly portable, making good use of every millimetre of space on the chassis.",
    "Strangely though, it still doesn’t feel overly light, despite only weighing 1.3kg, and it gives the impression of some solid heft when when carrying it. We suspect this is purely psychological though, due to the chunky solid feel of the metal lid, but this svelte design doesn’t really get in the way or make it less portable but instead somehow works in its favour, reinforcing the notion that you’re holding a piece of quality well-built hardware.",
    "With the lid closed the Dell XPS 13 2-in-1 (2020) is 13mm high at its thickest point and 7mm high at the narrowest with the lid open. Overall dimensions of 296 x 207 x 13mm (WxDxH) actually make it just slightly smaller than a MacBook Air in width and depth by a few millimetres, which may give you some idea of how thin and portable it really is.",
    "Besides the striking physical appearance, the display is undoubtedly the next high quality feature that you’ll notice on the Dell XPS 13 7390. With bright and sharp colours, even just the Windows desktop and application icons stand out, along with imagery and movies across the Full HD+ (1920x 1200) resolution.",
    "The eagle eyed among you will recognise this as a slightly wider 16:10 aspect ratio than standard HD. Bezels are thin, colors are bright and blacks are dark. It’s great, although this version lacks HDR400 compliance option of its newer 9310 sibling (see above).",
    "In keeping with modern trends, ports are limited. You get two USB-C Thunderbolt 3 ports, 3.5mm audio output and a MicroSD card slot. And that’s it. One of the USB-C ports is used for charging, leaving one lonely port for everything else.",
    "Although Dell includes a USB-C to USB-A adapter in the box, there are no USB-A ports on the laptop itself. For people with a lot of peripherals, you’re either going to need a dock or perhaps use a secondary display with a built-in USB Hub.",
    "You can use a modern display to deliver power and charge the Dell XPS 13 7390, so a really good setup is to use a single cable to dock the laptop with a display and that immediately enables charging, keyboard, mouse and possibly even external storage, all via a single cable.",
    "Notably certain eGPU enclosures offer a similar thing, including Razer’s Core X Chroma, which can charge the Dell XPS 7390 over Thunderbolt, add a display and discrete graphics capability and peripherals via USB-A ports.",
    "Dell’s own WD19TB Thunderbolt dock gives you support for up to three external 4K displays over HDMI and DisplayPort along with 130w quick charging, and wired Ethernet.",
    "But without that pricey addition the included charging cable and battery pack is fantastically small and wont get in the way under a desk, with a white LED on the charging cable that lights up when connected.",
    "With the lid open the inside is coated in a smooth, high quality silicone with a large trackpad and recessed, backlit keys with the power button in the top right. Depending on the external colour scheme you opt for this is either black or white, with the silver version we’re testing coming in black (which is actually very dark grey).",
    "Here the Dell XPS 13 2-in-1 (2020) just slightly falls down. The recessed keys makes typing just a tad awkward, although it’s just a minor niggling point and perhaps something you might not notice. The trackpad is pleasingly large though, occupying a third of the lower section of the laptop and leaving plenty of room, so full marks to Dell for that.",
    "However one more specific criticism relates to the technique for converting it into the tablet mode.",
    "There are two kinds of hinges that allow 2-in-1 laptops to flip the screen around: either rotating the whole top section 180 degrees so the screen lays on top of the keyboard, keeping it safely hidden inside the clamshell, or folding in all the way in a single motion so when the tablet is sitting on a desk, the keys are directly exposed to the table surface.",
    "Dell has opted for the latter, which risks getting dirt and muck on the keyboard, or possibly scratching the keys and surface.",
    "Although the mechanism for doing so is smooth and the metal hinges are as high quality as the exterior, even when taking the photos you see for this review on an outside table, we were slightly paranoid about getting dirt on this expensive laptop.",
    "With a modern 10nm Intel processor, the Dell XPS 13 7390 offers performance that is comparable with most Windows quad-core laptops and at times beats them.",
    "Intel’s Core i7-1065G7 processor has hyper threading so appears as eight logical cores in Windows 10, idling at 1.5GHz, but in this laptop we measured it running at 2.9GHz over sustained periods during tests.",
    "That’s pretty good, particularly since the 10nm processor drives great battery life when throttled down. The Cinebench score of 1,621 and Geekbench scores places it well within range of the top end of Windows performance. The top Intel and AMD desktop chips manage better scores in Geekbench, but make no mistake, with 16GB of DDR4 memory to boot, this laptop is more than capable of video editing, running complex audio software and photo editing.",
    "When running intense applications that put the processor under stress, the fans audibly sped up to a kind of hiss rather than a whine. This is true on most laptops and wasn’t a notable issue here. When in less intensive tasks the 7390 is mostly silent.",
    "As suggested above, gaming is not really an option with Intel’s Iris Plus graphics unless you’re playing vintage titles, browser games or specific games with very low graphics demands.",
    "But this all changes with an eGPU enclosure, something we tested with the Dell XPS 13 7390 for surprisingly great results. Hooked up to one of the Thunderbolt 3 ports, we used the Dell XPS 13 with an eGPU enclosure and an AMD Radeon 5700 graphics card, and suddenly gaming became viable. eGPU enclosures cost quite a bit of money, however, and you need to purchase a graphics card on top of that, making this a relatively expensive way to run games on a non-gaming laptop. It’s not something we recommend for everyone.",
    "If the design and display are the first two real stand-out features of the Dell XPS 2-in-1 (2020), built atop solid performance foundations, then the battery life is what makes it a hat-trick for Dell. In our test we enabled the low power Battery Saver option in Windows 10, set the screen brightness to 50% and the 1080p movie test going on repeat. 14 hours later, it was still running with over 10% of the battery remaining. That’s very impressive, enough to last a typical long-haul flight on a single charge and still provide entertainment for the taxi ride to your hotel.",
    "It’s especially impressive considering the competition. We recently ran a similar test on Apple’s 2020 13-inch MacBook Pro powered by its new energy-sipping M1 processor, lauding its battery life as one of the major advantages of the new architecture, and recorded 13 hours 21 minutes. Intel has come under a lot of flack from some commentators for its processors running hot and draining battery life in laptops, but these criticisms may not be quite so accurate on modern Window laptops based on the combination of the newer 10nm processors and Windows 10’s energy saving feature in the Dell XPS 13 7390.",
    "The obvious caveat is that not every usage situation will offer up this long battery life, and the energy saving feature seriously throttles application performance, so you might not want to leave it on if you’re encoding video, for example."
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Price and availability",
    "13": "Design",
    "31": "Performance",
    "37": "Battery life",
    "40": "Don't buy it if..."
  },
  "links": {
    "Surface Pro": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}