{
  "source": "https://www.techradar.com/reviews/google-home",
  "title": "Google Home review",
  "category": "audio-visual",
  "updated": "2020-11-06T15:40:17Z",
  "author": "nick-pino",
  "summary": "Turn your smart home into a Google Home",
  "verdict": "Wildly intelligent and supremely versatile in the ways in which it can be used, Google Home is a solid smart speaker. It's not as integrated with Google's own services as we'd like, and the Google Home has some room to improve in terms of audio quality, but it's come a long way since launch.",
  "pros": [
    "Customizable base",
    "Massive song library",
    "Expanding hardware ecosystem"
  ],
  "cons": [
    "Missing Google’s own services",
    "Phrasing needs to be precise",
    "Google Cast support needs work"
  ],
  "article": [
    "The Google Home is one of the most popular smart speakers on the planet, despite landing on the smart home scene later than the Amazon Echo.",
    "Even though it has been usurped by the Google Nest Audio, we think the original Google Home is still worth considering – and it could be in for some fantastic deals this Amazon Prime Day and Black Friday.",
    "Since the launch of the Google Home in 2016, the search giant has released a number of smart speakers in the range, including the Google Home Mini, and Google Home Hub.",
    "More recently, Google Home speakers have undergone a name change; nowadays, new Google speakers fall under the Google Nest mantle, including the Google Nest Hub Max and the Google Nest Mini.",
    "What's common among all these smart speakers is that they come with Google Assistant built-in – and the voice assistant is getting smarter all the time thanks to regular updates and machine learning capabilities.",
    "This means you can ask your Google Home speaker to give you the weather report, lower your smart thermostat for you when you leave your home, tell you a fact, or have it find the funny YouTube clip that had you in stitches last night and send it across to your Chromecast.",
    "Of course, voice assistants aren't perfect, and sometimes you may find your questions are lost in translation when speaking to Google Assistant.",
    "That general problem – something working sometimes, but not all the time – isn’t just symptomatic of the $89 / £89 / AU$128 Google Home; its biggest rival, the Amazon Echo, is far from immune to them as well. In due time, both devices will get smarter, but for now, they do make some errors.",
    "One way Google has addressed this is by adding Multiple Actions and Continued Conversation, with both making it easier to ask multiple questions at the same time.",
    "Google Home may not be perfect, but it’s sure to get better over time as Google continues to work on its AI voice assistant technology, Google Assistant, and we’ll be updating our review regularly as new functionality continues to be added.",
    "Your Google Home is changing all the time – that's because new updates are being added to Google Assistant all the time. Now you can even teach the voice assistant to better recognize your voice so you can receive personalized results to your commands and queries.",
    "The Google Home app is getting a redesign, hopefully making it simpler to use and to control your other smart home devices. That's not the only change to Google Home products, however – the company is trialling simpler controls for its Nest smart displays, including the Google Nest Hub Max.",
    "It's not all good news, though; Google quietly removed a handy Google Home feature called Guest Mode, which used to be a way to cast media to a Google Cast-enabled device without sharing the same Wi-Fi service.",
    "Guests without Wi-Fi credentials could get a four-digit pin, which would be used to directly connect to the speaker. Without that, guests now need the full Wi-Fi password instead. Not the end of the world, but annoying.",
    "It's also emerged that Google Home speakers have been experiencing issues with Bluetooth connectivity. Google says that it's working on a fix, but with some problems dating back over a year, is it too little, too late?",
    "In more positive news, Google announced that Assistant has now made its way to more than 500 million devices. That means not only does it come built-in to Google Home, it works on over 5,000 different devices - from cars to phones.",
    "Google Assistant now supports Pandora Premium – simply set the platform as your default music streaming service and say \"Hey Google, play\" followed by the name of a song, artist, playlist or station.",
    "Also, if you have an Android smart TV, you can now use Google Assistant to communicate with Netflix, asking it to play content just like if you had the Nvidia Shield set top box.",
    "Google Assistant has a new feature that means you can now assign reminders to different people in your household. That means if you share your home with others you can evenly distribute all of the different chores. A new feature to enable mobile calling is coming to Australia before a wider rollout, too.",
    "Now, because “air freshener” can be a varied description depending on where you are in the world, a more apt description of its shape might be a small vase – it has a wide bottom and a tapered top. Each Google Home comes with a standard, gray fabric base with a rubber bottom that can be swapped out for a different material or color for around $20 / £18 / AU$29.",
    "So far, Google offers two types of bases to match your home decor: metallic and fabric, each with different colors and finishes. Metallic bases are made out of either painted steel or polycarbonate and come in copper, snow or carbon colors. On the fabric side, the three colors are mango, marine and violet, in addition to the standard white mesh listed above.",
    "From a pure aesthetic point of view, Google Home is the far more attractive option when compared to the Amazon Echo’s all-black canister shape. It’s less ominous than the black monolith and it’s also a fair bit shorter at 5.62 x 3.79 inches (142.8 x 96.4mm; H x D), which means it’s easier for the Home to blend into its surroundings.",
    "There’s also some function to this form, however. The top, flat, inclined surface of the Google Home acts as a touch-capacitive panel, allowing you to change the volume, play and pause the music or activate the Google Home assistant with a tap. Once activated either by pressing the top panel for a couple of seconds or saying the wake word (“OK Google” or “Hey Google”), four multi-colored lights twist and whirl to indicate that you’ve caught its attention.",
    "While Amazon’s Echo has a physical control to change its volume, Google Home’s touch controls feel less precise. We do however appreciate the inclusion of a physical button to mute the speaker, which means you can be sure when it is, and is not, listening.",
    "Google Home generally does an ok job of picking up your voice with its two built-in microphones located on the top half of the chassis, but it doesn’t work 100% of the time. Whether this is down to Google’s software, or its reliance on two microphones rather than the Amazon Echo’s five, it means you’ll definitely end up repeating yourself or raising your voice to get its attention more.",
    "Uncap the bottom base and you’ll find a speaker and two passive radiators, which, considering the sheer volume the little device can put out, is impressive. The Amazon Echo has a few more speakers inside its chassis, and can therefore sound a bit better at higher volumes, however what’s under the hood here is enough to get the job done.",
    "While Google Assistant, the voice and smarts inside the speaker, might be the main attraction here, Google Home is actually a pretty capable audio device as well.",
    "It can access all sorts of streaming services – Google Play Music, YouTube Music, Spotify and Pandora – and works as a WiFi speaker thanks to its built-in Google Cast capabilities.",
    "What that means in practice is that you’ll be able to ask it to play nearly any song you can think of, and it will either find it on Google Play Music’s 30-million-plus catalogue or, if you’ve taken it up on its free trial offer, pull it up YouTube Music. Think about that for a second. Unlimited access to music on YouTube? Yeah, by far and away, Google Home probably has the largest song library of any audio device on the market.",
    "We tried for an hour to find a song that Google Home couldn’t pull up – recalling some seriously obscure music, like the theme song from 1998’s Banjo-Kazooie game on N64 to the title track for Requiem for a Dream – to no avail. Of course, you’ll likely stumble across something that Google Home can’t find, but the fact that we couldn’t stump it after arming ourselves with dozens of songs is absolutely unheard of.",
    "Less impressive is how much difficulty the Google Home had with recognising band names that sound similar to one another. Try as we might, we couldn’t get the speaker to play any music by the band ‘Brontide’. Sometimes it would claim that their music wasn’t available (it’s on Spotify), or else it would play music or playlists from completely unrelated artists.",
    "It’s also too bad the expansive library of songs is stuck – for the most part – inside a less-than-amazing-sounding speaker.",
    "Compared to Bluetooth speakers in its price range like, say, the Creative Sound Blaster Roar 2 or Razer Leviathan Mini, music on the Google Home comes off as less robust with little separation and little punch in the low-end or clarity in the mids and highs.",
    "Now, it’s not completely incapable for playing decent-sounding music – it does have some bass and some mids – but, if you’re expecting Google Home to replace your Hi-Fi setup, you’ll be severely disappointed. (Audiophiles, keep in mind that a vast majority of the time Google Home sources its music from YouTube, a site infamous for its audio compression.)",
    "But Google Home makes up for its less-than-pristine audio quality with a feature that other speakers don’t have, and that’s its ability to both receive and send Google Cast signals, making it the only audio device that can not only stream music from your phone, but send video streams to any Google Cast-compatible connected devices as well.",
    "One of our smaller frustrations with the Amazon Echo Dot, Amazon’s smart speaker that’s designed to be plugged into an existing audio setup, was that there was no way to control which speaker was used as its output using voice commands.",
    "In theory, Google Home doesn’t have this issue. Simply set up a Chromecast with a name that’s easy to pronounce, and you can tell your Google Home to cast your favourite songs or even videos to your Hi-Fi and TV respectively.",
    "At launch in both the UK and Australia, it supported a number of local streaming services. For example, in the UK we were able to play BBC Radio 4 on the speaker directly, which it was intelligent enough to automatically stream from iPlayer, and it was also capable of streaming from Channel 4’s All 4 streaming app.",
    "In theory it’s a great streaming solution, but in practice we had trouble with the functionality.",
    "Take as an example the phrase, “Watch Rick and Morty from Netflix on Jon’s Projector.” If your pronunciation is perfect then the command will work most of the time, but if the speaker fails to hear any part of the instruction then it will fail completely.",
    "Then there’s the issue of selecting specific episodes, which Google Home is unable to do. Ask it to play a show and it will start from where you last left off, but you can’t ask it to play a specific episode. Skipping between episodes, meanwhile, works well.",
    "We’d love it if the speaker was intelligent enough to remember part of the command and ask for clarification on the parts that it didn’t understand, but as it stands you have to get the whole command right in one go.",
    "It’s also a pain to control playback once you’ve started casting. Instructing the speaker to ‘play’ or ‘pause’ works well, but if you tell it to play another song then it suddenly forgets that it’s casting and will instead play the new song from the Home’s own speaker.",
    "The big promise with Google Assistant was that it would be contextually aware, but from our experience it has a long way to go. You’ll find yourself repeating a lot of information that the Home should be able to work out itself.",
    "Of course, Chromecast isn’t the only device that Google Home can talk to. There are a half-dozen devices that can hook into Google Home right now, or will be able to do so soon. (We’ve compiled a list of the best Google Home smart home devices so you don’t have to waste time tracking each one down.)",
    "The highlights of what Google Home can connect to right now are Nest thermostats, Philips Hue lightbulbs and Samsung’s SmartThings platform, while support for even more third-party devices like LIFX lightbulbs and LG MusicFlow speakers should be coming soon.",
    "Google Home will also integrate with thermostats from Netatmo and Tado.",
    "Although you’ll frequently need to sign into these third-party products, once you’re in the functionality works well. We tested the Google Home with a Nest setup and found that its commands were easy and intuitive to give.",
    "Recently, Google announced that Home would support several new smart home ecosystems including products from August, Wink, LIFX, TP-Link, Rachio, Vivent, First Alert, Frigidaire, Logitech, Geeni, Anova and US-retailer Best Buy’s Insignia brand. Together, these should give you far more options for which devices you can string together and give you more control of your burgeoning smart home.",
    "While further hardware integration is nice, one of the largest problem Google Home faces is that it can’t integrate with many of Google’s own services – like Gmail, Voice and Docs – which have been its bread and butter for years.",
    "Take Gmail, for instance. You’d think Google Home might be able to rattle off the subjects of your top 10 emails – but, surprise, it can’t. The same goes for Google Calendar where it’s unable to create new events (although it will happily read out existing events in your calendar), make phone calls with Google Voice or jot down some quick notes in a Google Doc.",
    "Google has a dozen services that the Home should be able to link into and yet, in its current state, simply cannot. Not only is this a big disappointment, but it makes us wonder why this functionality wasn't given more of a priority.",
    "And while it’s easy to hammer this point home and point out all Google Home’s shortcomings in one long-winded tirade, we’re not going to. That’s not because we’re avoiding the harsh criticism or defending the Home, we’re not.",
    "But we’ve already fallen into that trap of being overly critical of a smart platform once before with Amazon Echo, and since then it has flourished into an amazingly smart, connected platform that can answer hundreds more questions than it could two short years ago. It can order pizza or restock the refrigerator or call an Uber or check what time a restaurant closes, and the list of everything it can do grows week over week.",
    "Google Home can do some of that already, making it far and away a better system now than the Echo was when it first launched. Some of that it can’t. But, speaking from experience, it’s only going to get better, smarter and more robust in the coming weeks, months and years.",
    "It’s just not there yet.",
    "One thing’s for sure: You might never appreciate just how much music is on YouTube without buying a Google Home. While some of the biggest music streaming services in the world boast libraries of 25, 30 and even 40 million songs, they’re far from complete. We’re not saying Google Home is capable of playing any song you can think of, but after dredging the depths of the ’90s we still couldn’t find a tune Google Home couldn’t find.",
    "And while Google Home excels as a DJ, it’s also a surprisingly intelligent smart home hub. It already hooks into some of the largest platforms now by including Nest, Philips and Samsung’s SmartThings, and given a few months that number will grow even more.",
    "Its Google Cast functionality is excellent, and has real potential.",
    "Clearly the lack of integration into Google’s own services is a huge issue. The fact that it can’t shoot an email to someone in your contacts or help you schedule events through Google Calendar are massive oversights that vastly reduce how useful the Home could be.",
    "The other problem with Google Assistant is how precise you have to be when asking your questions. Asking what year a song was written might not turn up any results, while asking what year a song was released might unveil the exact answer you were looking for. Follow up any inquiry with a simple request like “OK Google, tell me more about it” and it suddenly forgets what you’ve been talking about for the past 30 seconds.",
    "A lack of contextual awareness is also a massive problem for its Google Cast functionality right now. Be prepared to reiterate where you want your music to play from a lot when using Google Home.",
    "Admittedly, this lack of contextual awareness isn’t something that Alexa deals with – which is surprising considering that the Echo doesn’t come from the company with 20-plus years of search engine experience.",
    "It’s easy to feel disappointed with Google Home when you buy one and expect it to be the coveted center of the smart home Google has marketed it as. It’s just not there yet. It’s a bit too rigid in its language comprehension, its list of smart home devices is growing but still a bit underwhelming, and, perhaps the biggest disappointment of all, it doesn’t have many of Google’s core services built into it.",
    "The best comparison for Google Home, obviously, is the Amazon Echo. They both have identical functions, fetch music from similar sources and are stumped, largely, by the same set of questions. While the Echo is still the more formidable of the two thanks to the dozens of developers who have created bespoke commands, the Home is – at worst – about six months behind in development.",
    "There’s also the issue that although the Home is more ambitious with its media playback, it hasn’t worked out a way for you to access this functionality in a way that’s simple enough to be done with your voice. There’s little point in having all that functionality when it’s a chore to use.",
    "Given the same attention from hardware and software developers and some of those additional Google services, the Home could quickly grow from a nascent smart speaker with Chromecast integration to the first and most critical piece of the ever-expanding smart home.",
    "For now, the Google Home is simply a smart novelty with access to YouTube Music, built-in Google Cast and the ability to save you a trip to the light switch.",
    "Jon Porter also contributed to this review."
  ],
  "headers": {
    "10": "What's new for Google Home?",
    "19": "Design",
    "26": "Audio performance",
    "35": "Google Cast and Chromecast performance",
    "44": "Google Home as the center of your smart home",
    "56": "We liked",
    "59": "We disliked",
    "63": "Final verdict"
  },
  "links": {
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "smart home": "https://www.techradar.com/news/smart-home-devices",
    "Amazon Echo": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-1272454/review",
    "Google Nest Audio": "https://www.techradar.com/reviews/google-nest-audio",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Google Home Mini": "https://www.techradar.com/reviews/google-home-mini",
    "Google Home Hub": "https://www.techradar.com/reviews/google-home-hub",
    "Google Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max",
    "Google Nest Mini": "https://www.techradar.com/reviews/google-nest-mini",
    "Google Assistant": "https://www.techradar.com/how-to/how-to-use-google-assistant-to-control-your-smart-home",
    "smart thermostat": "https://www.techradar.com/news/best-smart-thermostat",
    "Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Multiple Actions and Continued Conversation": "https://www.blog.google/products/assistant/io18/",
    "better recognize your voice": "https://www.whathifi.com/news/you-can-now-train-google-assistant-to-better-recognise-your-voice",
    "Google Home app is getting a redesign": "https://www.techradar.com/news/your-google-home-speaker-is-getting-some-fancy-new-controls",
    "the company is trialling simpler controls": "https://www.techradar.com/news/google-nest-hub-could-soon-make-video-calls-easier-than-ever",
    "Google Home speakers have been experiencing issues with Bluetooth connectivity": "https://www.techradar.com/news/google-home-speakers-have-a-big-problem-and-its-finally-getting-sorted",
    "supports Pandora Premium": "https://www.techradar.com/news/pandora-premium-arrives-on-google-home",
    "use Google Assistant to communicate with Netflix": "https://www.techradar.com/news/google-assistant-can-finally-assist-with-all-your-netflix-needs",
    "you can now assign reminders": "https://www.techradar.com/news/google-assistant-can-now-remind-your-lazy-housemate-to-do-the-washing-up",
    "new feature to enable mobile calling is coming to Australia before a wider rollout": "https://www.techradar.com/news/google-home-speakers-get-mobile-calling-feature-rolling-out-to-australia-first",
    "Creative Sound Blaster Roar 2": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/creative-sound-blaster-roar-2-1309549/review",
    "Razer Leviathan Mini": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/razer-leviathan-mini-1313625/review",
    "Google Cast": "https://www.techradar.com/news/television/these-are-all-the-products-that-work-with-google-cast-1291053",
    "best Google Home smart home devices": "https://www.techradar.com/news/buying-a-google-home-here-are-the-best-smart-home-products-to-go-along-with-it",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar"
  }
}