{
  "source": "https://www.techradar.com/reviews/oppo-find-x2-neo",
  "title": "Oppo Find X2 Neo review",
  "category": "phones",
  "updated": "2020-09-29T10:30:55Z",
  "author": "sean-cameron",
  "summary": "More than the sum of its parts",
  "verdict": "The Oppo Find X2 Neo has a charming in-hand feel, versatile cameras, great speakers, and a screen worth bragging about. With its competition offering more raw power at a lower price however, it falls just short of being ideal for everyone.",
  "pros": [
    "Excellent, smooth screen",
    "Strong speaker performance",
    "Versatile, reliable cameras"
  ],
  "cons": [
    "Rear is a fingerprint magnet",
    "Rivals offer more power for the same price",
    "No 3.5mm audio jack"
  ],
  "article": [
    "The rise of Chinese mobile phone manufacturers in the west has been a long one. Initially it was Huawei which led the charge towards market dominance, however with its political issues only becoming more severe its place near the top is up for grabs, certainly in the UK.",
    "Oppo fancies itself as a top contender, and to achieve the kind of success it craves it has released a new wave of handsets. Each of these has been crafted with a specific consumer in mind and is being marketed accordingly.",
    "The Oppo Find X2 Neo is second from the bottom of the X2 line. This meaning it is a little fancier than the base model, but decidedly below its classier siblings in terms of both performance and appearance. It does have a few tricks up its sleeve however, not least a lower price point.",
    "Competition to the X2 Neo isn’t solely internal, there is of course a coterie of handsets all vying for supremacy at every sector of the market. This is especially true in the ‘premium mid-range’ segment, where value and performance are a particularly daring tightrope act. To achieve true success, the Find X2 Neo will need to not only outclass its peers, but look distinctive while doing so - no easy task.",
    "Oppo has a long history of crafting not only good handsets, but premium devices in other product categories, notably audio. With this in mind, and the resources offered to it by parent conglomerate BBK Electronics, all of the ingredients are there for something special.",
    "Holding the Oppo Find X2 Neo, first impressions are a little odd. This isn’t to say bad, but odd - the handset feels a little old fashioned. And by this, we mean thin and narrow, making it usable with one hand. Though we couldn’t reach every corner with our (admittedly hobbit-like) hands, that it was possible to type out a message on the go was a real plus.",
    "Not only is it thin, it is also solidly constructed. The glass sandwich with a middle of metal design has been seen a thousand times before, however we appreciated the balance in the hand and the lack of any creak or flex. This is a definite improvement over the likes of the OnePlus Nord with its plastic skeleton.",
    "It does suffer from a generic ‘phone’ appearance, however. At least ten other devices have been released in 2020 (some by the same manufacturer) with a highly similar rear camera layout and punch-hole selfie camera.",
    "The positive experience continues with the screen. With a 90Hz refresh rate, a 20:9 aspect ratio, a 1080 x 2400 resolution, and OLED tech, it ticks all the right boxes for a display in this price bracket, save for the omission of HDR compliance.",
    "Images look good out of the box, with plenty of pop and contrast, which can be tuned to your preference in the settings.",
    "Of course, enjoying media content isn’t just about the quality of the screen, but about the overall experience - especially the speakers. Luckily, these are not only dual and front-firing, but quite loud too. Movies, music, and podcasts were all very audible even in challenging environments, with enough bass, and space in the trebles. The Find X2 Neo will be a fine friend to anyone who enjoys movies on the go.",
    "This is aided by the battery life, which proved to be very solid. With a 4,025mAh battery pack inside, the X2 Neo has the stamina to make it through a full day without issue. It comes with a number of battery saving features, including the option to limit the screen refresh rate to 60Hz to eke out a few extra hours should the situation demand.",
    "From a software perspective, the situation begins to change somewhat. For all the attention that has been shown to the hardware, the included ColorOS is a little underwhelming.",
    "Most Android manufacturers have by now staked out their vision of what the operating system should look like. Some have pared things back; others have gone overboard making myriad adjustments. Oppo’s vision of Android is seemingly that it should be iOS - which proves to be both a blessing and a curse.",
    "From a design perspective, ColorOS is bland. Though it has a few quirks, it is unmemorable. Other than a bit of bloat it doesn’t get in the way however, and moving through the home screens in general is smooth and fluid, helped particularly by the high refresh rate of the screen.",
    "Performance on the whole was good, even if the competition is offering a little more oomph for a little less moolah. The Snapdragon 765G is appearing on handsets costing 60% of the Find X2 Neo’s going rate, but it is paired here with a meaty 12GB of RAM and 256GB of storage.",
    "Apps rarely if ever have the need to refresh, and only the most dedicated of movie aficionados will need more storage.",
    "Camera performance proved to be a pleasant surprise overall. There is a large 48MP f/1.7 main sensor outputting 12MP images, a 13MP telephoto lens with 2x optical zoom, an 8MP ultra-wide, and a nondescript sensor placed to gather extra light.",
    "In practice, that translated to mostly nice photos. In good light detail was excellent, dynamic range was good, and images had enough contrast. For our taste though the colors were a little overcooked on the default settings.",
    "There is the option to force the sensor to output images at 48MP, though we wouldn’t recommend this. The small amounts of extra detail which can be found are not enough to compensate for the much larger file sizes.",
    "At night, the positive impressions remain. Though the camera will take another beat or two to capture an image, the results are impressive. There is plenty of detail once again, no saturation is lost in the image, and the brightness isn’t boosted to crazy levels, as with the TCL 10 5G.",
    "The telephoto camera took images with a similar look to the main sensor and a comparable white balance, and the ultra-wide kept enough detail to be usable. That it also functions as a macro lens is a happy bonus.",
    "For those looking for a dependable snapper with decent capabilities and versatility on the go, the Oppo Find X2 Pro is a safe bet.",
    "The Find X2 Pro isn’t the best at any one thing. However, Oppo has crafted a device that provides a great overall experience, each specification adds up to something which is definitely more than the sum of its parts. Its screen, camera, speakers, battery, charging and more add to the feeling of a handset worth considerably more than its asking price.",
    "A slightly wonky software experience, no headphone jack, and no HDR compliance do little to remove this impression - this is a handset which will reward anyone willing to take a gamble away from the world of Samsung and Huawei.",
    "The Oppo Find X2 Neo is available in the UK from a number of providers and stores, on contract and SIM-free from £599.99 (roughly $765).",
    "In Australia, the handset is available from AU$899 from JBL and others. There is no word on availability in the US at the moment.",
    "Long gone are the days when phone designs tended to the needs of those without baseball mitts for hands. From iPhones to the Samsung Galaxy series, the trend is to go bigger, seemingly until some kind of usability limit is reached.",
    "Against this, the Oppo Find X2 Neo is a pleasure to handle and use. To begin with, this is down to the use of an extended aspect ratio for the screen. Instead of the typical 16:9 of the past, or the more common 18:9 in the present, this device has a 20:9 screen.",
    "What this means is that although the screen is still big at 6.5 inches, it is also taller than is typical, making the whole profile of the phone much narrower. Coupled with the thinness, this is a device which can be easily used with one hand, even when on the go.",
    "It is a shame then that the rest of the device, while well put together, feels a little generic in the hand. We have seen many handsets launched in the last few months alone with the same camera layout on both the front and back. The curved sides of the screen look good from a distance, but are only a hindrance in day to day use, though luckily the provided case solves this issue.",
    "A happy inclusion is the under-display fingerprint reader. These have generally had a patchy reputation since their first introduction, but have been steadily improving over time. The unit included in the Find X2 Neo is one of the better examples of the tech, working quickly and reliably. We did occasionally have a few missed reads, due to dirty/wet fingers, but these were rare.",
    "The presence of stereo speakers is also a very welcome inclusion. Firing from the bottom and from the earpiece, these are well balanced in volume and sound rich and full enough for most purposes. In terms of sound profile they are particularly suited to podcasts, with voices coming through clearly.",
    "Beyond its physical 6.5-inch size, the Oppo Find X2 Neo's screen packs in a lot of the tech one would expect for the price point. The refresh rate is 90Hz, which is arguably the sweet spot for performance and battery life, and its resolution is 1080 x 2400.",
    "Having a higher refresh rate means that the experience of using the device feels smoother in a way which can be hard to describe. Especially when reading, playing supported games, or moving through the operating system, it removes a lot of the screen tear, to the benefit of the feel.",
    "Included in the software is the ability to force 90Hz or 60Hz, or to allow the device to toggle between the two automatically based on what you're doing. A higher refresh rate will typically mean more draw on the battery.",
    "As it is an OLED panel, blacks are infinite and contrast is superb - it can also get plenty bright, so we could easily use it in bright sunlight.",
    "No HDR certification is something of a letdown, however. Although far from essential, rivals at even lower price points are offering this as standard, and the tech is a particular joy on OLED screens.",
    "The color balance of the display tends towards the warm side, as might be expected for an OLED, however this can be altered in the settings. We found the default ‘Vivid’ setting a little too eyeball searing, the alternate ‘Gentle’ setting improved this considerably.",
    "In all, though it is a cliché to say that this is a display good enough for everyone, it applies well here. There is enough resolution, color, and contrast to make all content look good, the refresh rate makes daily use a little more pleasant, and the high brightness makes the device viable in most conditions. It is very competitive with devices at the same price point, even with the lack of an HDR certification.",
    "The Oppo Find X2 Neo arrives with a very 2020 camera spec sheet. That is to say, it sports four sensors on the rear (though luckily in this case only one is of dubious utility) and a punch-hole selfie camera.",
    "The main sensor is 48MP in resolution, though it outputs files at 12MP by default. It is flanked by a 13MP 2x optical zoom telephoto lens and an 8MP ultra-wide snapper, which doubles as a macro cam. There’s also a 2MP black and white sensor, which seems to do very little.",
    "Starting with the camera app, it is business as usual. That is to say, barring a few oddball entries that other manufacturers sometimes introduce, it is bog-standard in terms of its layout. Swiping up and down activates various modes, while ‘More’ allows access to the Panorama, Sticker, Time-Lapse and other features.",
    "It is nothing which hasn’t been seen before, and the app itself is relatively nippy, with only a brief processing time between images, though it can’t compete with the likes of the iPhone 11 in this regard.",
    "On to the images themselves, and the picture (no pun intended) is mostly good. In good lighting conditions, images captured have bags of detail and plenty of contrast. The colors can be a little overcooked, and the white balance skews a little too warm in most situations. Shooting in bright sunlight, flare becomes a problem and the images can be a little soft as a result.",
    "Auto-HDR kicks in to improve the situation reliably, though we found on occasion that it flattened the contrast of the images too much, leaving them with little punch. ‘Dazzle Color’ mode is effective at introducing more saturation and contrast, particularly on grey days, but is too much for everyday use.",
    "The main sensor defaults to 12MP images, but 48MP capture can be forced, though this only adds a little extra detail for a much bigger file size, and a noise hit. Photos taken from the telephoto lens at 2x zoom are crisp in detail if a little noisy and are a definite improvement over any 2x crop. The wide-angle was a little soft, but had decent dynamic range and color reproduction.",
    "Low-light performance proved to be a positive picture also. Without any prompting the scene recognition software will kick into a low-light mode that takes an extra beat to capture an image. The results are great for the most part, retaining saturation and detail without going crazy on brightness. A dedicated Night mode exists for more challenging conditions and produced similar results.",
    "Video captured was detailed and had good color, but the mono audio capture means any sound tends to have a mushy reproduction.",
    "In all, for most conditions this is a handset which will serve well. It has the versatility in focal lengths to be happy shooting either near or far, and can punch above its weight at night too.",
    "Processing power remains the most elemental benchmark when comparing the value of differing devices. Logic has it that the most powerful handset should be the most expensive handset, hence the quest of Apple to lead the AnTuTu benchmark scores of any given year with its new iPhone chipset.",
    "So, if it is the expectation that a flagship handset will have only the latest and greatest, the picture is slightly different at the mid-range. While some do offer top shelf performance, others make this sacrifice in order to compensate in other ways, and the Find X2 Neo finds itself in the latter camp.",
    "The Snapdragon 765G is not the fastest chip around, and is included with handsets costing a fraction of the Neo’s going price. In Geekbench 5 it achieves a single-core score of 600 and a multi-core score of 1,742, which puts it roughly with the Snapdragon 845 (which was high-end in 2018) in terms of power.",
    "This is no bad thing. For the most part, only the keenest of mobile gamers will find cause to complain, for everyday tasks we noticed no stutter or lag during our time with the device.",
    "This is aided in no small part by the 12GB of RAM (a lot for a phone) and the 256GB of UFS 2.1 storage, which keeps the system flying along.",
    "Oppo’s software experience also helps. Although it is a significant departure from stock Android, the company's ColorOS is fast and mostly well-optimized. It has an interesting mix of features, some good and some less so.",
    "Having the option of implementing a system-wide dark mode, especially with an OLED screen, is a big boon, however the insistence of having an iOS style of icon placement on the home screen becomes a little jarring.",
    "If having the absolute fastest performance is a total priority for you, the likes of the OnePlus 8 will be a better shout than the Find X2 Neo. For most consumers however, this will offer more than enough power to get through anything that might be thrown at it.",
    "Although phones and their batteries have gotten bigger with time, excellent battery life is still the exception rather than the norm. This is at least in part due to the increasingly power-hungry components being crammed into handsets, including high refresh rate screens and ever more powerful processors.",
    "With a 4,025mAh pack to call its own, the Oppo Find X2 Neo certainly has the potential for good performance in this field - however nothing can be taken for granted.",
    "Pleasantly, we found battery life to be solid for this handset. Even with 90Hz forced as perpetually ‘on’ it would never fail to make it to midnight having been unplugged at 7am. It is definitely a one-day handset though, as we never had enough charge to tough it into a second day.",
    "Not that this matters with the presence of fast charging, and we mean fast. Oppo is one of the grand-daddies of fast charging tech, debuting it before almost anyone else years ago. Its proprietary system is called VOOC and it works a treat.",
    "From 15% we were able to charge to 100% within 40 minutes, all without any heat build-up in the device itself. This kind of speed is transformational when first encountered. Charging changes from being an overnight endeavor to a quick plug and dash before heading out, removing a lot of battery anxiety.",
    "That the fast charger is included in the box is simply icing on the cake, especially in the same year as Apple is rumored to be dropping the inclusion of any charger at all with its devices.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "25": "Oppo Find X2 Neo release date and price",
    "27": "Design",
    "33": "Display",
    "40": "Camera",
    "50": "Specs and performance",
    "58": "Battery life",
    "64": "Don't buy it if..."
  },
  "links": {
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "TCL 10 5G": "https://www.techradar.com/reviews/tcl-10-5g-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8"
  }
}