{
  "source": "https://www.techradar.com/reviews/macbook-pro",
  "title": "Apple MacBook Pro (15-inch, 2019) review",
  "category": "computing",
  "updated": "2020-11-19T16:01:51Z",
  "author": "matt-hanson",
  "summary": "Apple’s productivity machine gets the latest Intel tech",
  "verdict": "Once again, with the MacBook Pro 2019 refreshes, Apple has built a well-designed professional laptop with the MacBook Pro 15-inch (2019). Its upgraded internal components bring a welcome boost. However, the lack of port variety stops it from being a truly flexible prosumer device.",
  "pros": [
    "Powerful",
    "Decent configuration options",
    "Screen remains gorgeous"
  ],
  "cons": [
    "Expensive",
    "Lack of ports",
    "Keyboard concerns remain"
  ],
  "article": [
    "Although the MacBook Pro 15-inch 2019 isn’t the generational update we were hoping for, it isn’t completely devoid of important updates. To its credit, it does come with some incremental updates in its specs, and also brings in a few new features that help cement the line’s status as one of the best professional laptops out there.",
    "The fact that the MacBook Pro 15-inch 2019 lacks any massive redesign may be attributed to Apple saving its major updates for the MacBook Pro (16-inch, 2019), which came out shortly after. It’s easy, therefore, to forgive its shortcomings, especially when you factor in its more powerful specs and a much improved keyboard. Both are certainly welcome updates for MacBook Pro owners with a 2017 or older MacBook.",
    "Design-wise, the MacBook Pro 15-inch 2019 may feel somewhat like an iteration of its predecessor. But, despite that, it still gives Apple that win it needed in a time when all these impressive Windows laptops have raised the stakes in the Ultrabook category. It has certainly given Windows users a compelling reason to switch over to macOS.",
    "The MacBook Pro 15-inch (2019) is available in two main configurations (which you can further customize to better suit your needs and budget). First, there’s an option with a 2.6GHz 6-core 9th generation Intel Core i7 processor, Radeon Pro 555X with 4GB of GDDR5 memory, 16GB 2400MHz DDR4 RAM and 256GB SSD storage for $2,399 (£2,399, AU$3,499/AED9,999).",
    "Then, there’s a model equipped with a 2.3GHz 8-core 9th generation Intel Core i9 processor, Radeon Pro 560X with 4GB of GDDR5 memory, 16GB DDR4 memory and 512GB SSD storage for $2,799 (£2,799, AU$4,099/AED11,679/R44,999).",
    "In the US and Australia, this price compares favorably with last year’s base model, which sold for $2,399 (£2,349, AU$3,499) and came with a 2.2GHz, 6-core 8th generation Intel Core i7 CPU, Radeon Pro 555X GPU, 16GB of DDR4 memory and a 256GB SSD. That’s basically the same spec, aside from the updated processor and GPU.",
    "While the US and Australia essentially get an upgrade for free, UK readers will have noticed a price increase. This is due to Apple bringing UK prices into line with US dollars, so for Apple, £1 = $1. Now, for anyone with even a passing familiarity of exchange rates, you’ll know that this is a fairly raw deal for the UK. However, keep in mind that the US price doesn’t include tax, whereas the UK price does.",
    "As we stated earlier, all the MacBook 2019 models can be configured to add more powerful components if you want – and can afford – them.",
    "In fact, the model Apple sent us to review is something you’d have to configure yourself. It’s the highest-end model, so it comes equipped with an 8th generation Intel Core i9 processor with 8 cores and a 2.4GHz clock speed (5.0Ghz boost), 32GB RAM, AMD Radeon Pro Vega 20 with 4GB of HBM2 memory and 4TB of SSD storage for $5,149 (£4,914, AU$7,859, AED21,549).",
    "This means if you want to buy the model we’ve tested here, then you’re going to need to spend a lot of money. Still, at least there are lower-priced options, and the base MacBook Pro 15-inch (2019) compares favorably with the Razer Blade Pro 17 (2019), one of the latest Windows laptops trying to win professionals away from Apple. That sets you back $2,499.99 (£2,399.99, AU$4,299) for the base model with a 6-core 9th generation Intel processor and Nvidia GeForce RTX 2060 graphics card.",
    "Comparing the two, we’d give the edge to the MacBook Pro 15-inch (2019) as a pure productivity device, taking into consideration the specs, build quality and (slightly) lower price.",
    "If you’ve ever seen or used a MacBook Pro, then you already know what the MacBook Pro 15-inch (2019) looks like. The last time the series got a considerable design change was back in 2016 with the addition of the Touch Bar, and the 2019 model looks – at least on the outside – pretty much the same as the previous models.",
    "This is great news for anyone who believes that the MacBook Pro aesthetic is pretty much on point. On the other hand, it will disappoint anyone who is looking for a fresh new look.",
    "So, the MacBook Pro 15-inch (2019)’s dimensions are 13.7 x 9.48 x 0.61-inches (34.92 x 24.07 x 1.55), basically the same as last year’s model, and is slightly smaller than MacBook Pros launched before 2016’s refresh. The new MacBook Pro 15 also weighs 4.02 pounds (1.83kg) – which, again, is exactly the same as last year’s model.",
    "Color-wise, you’re again restricted to the choice of merely two – Space Gray and Silver. Port-wise, you’ll have four Thunderbolt 3/USB-C ports (two on each side of the laptop) as well as an audio jack port – a rarity on an Apple device these days.",
    "While some people will appreciate the minimalism of only having four Thunderbolt ports – which are fast and versatile (as they are compatible with many connection types and can also double as charging ports) – for many other people, the lack of variety in ports is an irritation, especially on a product that’s meant at professionals.",
    "Anyone who relies on older peripherals like mice, keyboards or external hard drives will need to invest in an adapter. This can lead to a cluttered look, and it’s an additional cost – as Apple doesn’t include an adapter. That’s somewhat disappointing, especially when you’re already spending so much money on a laptop, and many of its competitors now include an adapter – take Acer’s new Swift 7, for example.",
    "Now, one of the explanations for the lack of ports is so that Apple can keep the thin design of the MacBook 2019 line. We’d counter that first of all, if you’re looking for a productivity machine, you want something that lets you work with the tools you depend on with minimum fuss. That’s more important than having an outrageously thin laptop.",
    "Secondly, the Razer Blade Pro 17 (2019) showcases how to have a slim laptop (its dimensions are 15.55 x 10.24 x 0.78-inches, which isn’t a lot larger than the MacBook Pro, especially considering it has a 17-inch display) and still have all the essential ports. It has an Ethernet, two USB 3.2, two USB-C 3.2, a 3.5mm audio jack, HDMI 2.0B and an SD card reader. That’s the kind of port selection that many people – particularly photographers – would find extremely useful and convenient.",
    "It’s also worth keeping in mind that whenever you’re charging the MacBook Pro or any MacBook 2019, one of those valuable Thunderbolt ports is unavailable, basically cutting the number of ports down to three.",
    "As with previous MacBook Pros (and other Apple devices), there is also no way to open up the MacBook Pro 15-inch (2019) and fix or upgrade its parts without voiding the warranty. While many people are ok with that, it does mean that you’re at the mercy of Apple (and Apple approved vendors) if something goes wrong. And, you can forget about adding more RAM or a bigger hard drive to extend the life of your expensive purchase.",
    "Going back to the Razer Blade Pro 17 (2019) for a moment, that machine allows for comparatively effortless upgrading of RAM and storage, with an additional storage slot for another SSD if you need it. While many people may not make use of this, it still makes it a more tempting prospect for professionals who want to get the most future-proof laptop they can.",
    "The 15.4-inch screen is inherited from last year’s – which is not a bad thing as the Retina display remains stunning-looking with a 2,880 x 1,800 resolution. There’s also support for the DCI-P3 color space, which is critical for video editors. The True Tone feature, which makes colors on the screen look more vibrant and realistic (although, it’s at the expense of accuracy) is also included – and this can be switched on or off depending on your preferences (and needs).",
    "Generally, however, the design of the line of MacBook 2019 model refreshes offer nothing new. If you love the look of the MacBook, this will be music to your ears.",
    "Since the introduction of the 2016 MacBook Pros, which brought the ‘butterfly’ switch mechanism to the laptops’ keyboards, there have been quite a few complaints about the keyboards malfunctioning, particularly if debris (like crumbs or dust) end up between the keys.",
    "Last year, in an attempt to fix the issue, Apple installed a silicone membrane to block debris from causing havoc. However, it didn’t really work. News that some keyboards were flawed justifiably bothered anyone investing a considerable sum in Apple’s newest laptops.",
    "On the upside, the MacBook 2019 models of the Pro have once again received improvements. While the keyboard still uses the butterfly switches, Apple said that it has switched the materials used with the mechanism to lessen the probability of the keys getting stuck or becoming unresponsive when pressed, the two main problems previous keyboards had.",
    "Apple hasn’t been too transparent on the particular details of the changes it has made to the keyboard. During our tests, we didn’t experience any issues. However, we didn’t with previous models either.",
    "While the change is welcome, it’s still too bad that Apple hasn’t radically altered the design of the keyboard to guarantee that those issues never occur again. The fact that it includes the new MacBook 2019 models, the Pro included, in its Keyboard Service Program, which will replace a faulty keyboard free of charge, sort of implies that Apple hasn’t completely fixed the issue. Hopefully, any issues with the MacBook Pro 15-inch (2019)’s keyboards will prove infrequent.",
    "The keyboard itself doesn’t feel significantly different to use – perhaps somewhat softer to type on than non-membrane keyboards, but it’s mostly business as usual. So, nice large keys that are easy to hit and comfortable to type on.",
    "They’re also backlit for using in dimly-lit environments, and there’s the Touch Bar, a thin glass touchscreen that stretches along the top of the keyboard, displaying context-sensitive buttons on its 2,170 x 60 resolution screen. These buttons change depending on the application or task that you’re performing, created to give you fast shortcuts for a more seamless workflow.",
    "You’ve possibly made up your mind about how valuable (or not) the Touch Bar is if you’ve used earlier MacBook Pros. We quite like it, and since its unveiling in the 2016 model, more apps are taking advantage.",
    "Next to the Touch Bar sits a fingerprint scanner for quickly and securely logging in to the computer as well as authorizing payments. It's quick and easy to set up, and accurately reads your fingerprint and logs you in without fuss - something that many fingerprint readers on laptops fail to do.",
    "The touchpad also remains unchanged – large, responsive and does its job well, if you want to skip the use an external mouse.",
    "In all, we cautiously welcome the updates Apple has made to the keyboard – and time will tell if they are enough to thwart any more problems. However, we wish Apple did more to eliminate any such doubts – though that would undoubtedly involve a major overhaul of the keyboard.",
    "Such an overhaul is actually rumored for a 16-inch MacBook Pro that could launch later this year."
  ],
  "headers": {
    "3": "Price and availability",
    "11": "Design",
    "24": "Keyboard"
  },
  "links": {
    "MacBook Pro (16-inch, 2019)": "https://www.techradar.com/reviews/macbook-pro-16-inch-2019-review",
    "MacBook": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/macbook-1287806/review",
    "Ultrabook": "https://www.techradar.com/news/what-is-an-ultrabook",
    "Razer Blade Pro 17 (2019)": "https://www.techradar.com/reviews/razer-blade-pro-17",
    "Swift 7": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/acer-swift-7-1327419/review",
    "the keyboards malfunctioning": "https://www.techradar.com/news/macbook-pro-keyboards-with-butterfly-switch-appear-to-fail-more-than-older-models",
    "Keyboard Service Program": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5538670584882980000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fkeyboard-service-program-for-mac-notebooks",
    "rumored for a 16-inch MacBook Pro that could launch later this year": "https://www.techradar.com/news/apples-16-inch-macbook-pro-to-end-the-era-of-butterfly-keyboards"
  }
}