{
  "source": "https://www.techradar.com/reviews/amazon-fire-7-2019",
  "title": "Amazon Fire 7 (2019) review",
  "category": "tablets",
  "updated": "2020-10-21T16:42:28Z",
  "author": "josh-levenson",
  "summary": "A very basic tablet that is cheap",
  "verdict": "Looking for a tablet to read a book on in the shade, watch the occasional YouTube video and order some shopping? At $50/£50, you can't go wrong with the Amazon Fire 7 (2019). But if watching movies or reading in sunlight are priorities, you’ll need to look elsewhere.",
  "pros": [
    "Affordable",
    "Durable build",
    "Fantastic for Kindle-ing"
  ],
  "cons": [
    "Disappointing non-HD screen",
    "Poor battery life",
    "Software is sluggish"
  ],
  "article": [
    "Cheap. That’s the first word that comes to mind when we think of the Amazon Fire 7 (2019) – and at just $50/£50 (around AU$70), that’s exactly what it is. As such, don’t be expecting it to rival the likes of the $799 / £769 / AU$1,229 iPad Pro 11.",
    "We’re in a different league here, one that’s aimed at budget-conscious customers looking for a tablet to read a book, watch the occasional YouTube video, and do some online shopping.",
    "We were rather specific about the use cases there, as that’s about all the Amazon Fire 7 (2019) is capable of doing. Amazon had to make some compromises to keep the cost down – rather a lot of them, in fact.",
    "The result is an affordable tablet that’s perfect for someone looking for a Kindle-like reading experience, but with the added smarts that come part and parcel with Amazon’s Fire OS.",
    "Announced on May 16, 2019, and released on June 6, 2019 the Amazon Fire 7 (2019) price starts at £50 / $50 (around AU$70). That’s the same as the last-gen model, which is impressive considering the latest iteration is faster and comes with more storage.",
    "You're not able to buy this in Australia, but the tablet is still regularly available to those in the US and UK. The price goes up by ten dollars/pounds if you want 32GB rather than 16GB of storage.",
    "If you want to find this tablet even cheaper, you should wait until Black Friday on November 27 or Cyber Monday after that where it's very likely Amazon will be knocking at least a little extra off the price.",
    "The Amazon Fire 7 (2019) looks and feels like it has been wrapped in an OtterBox Defender Series case - it’s thick and coated in rubber.",
    "That’s not such a bad thing, though. The device itself feels extremely robust, withstanding a tumble off the kitchen counter during our time with it without so much as a blemish. You’ll have a tough time breaking it.",
    "Surrounding the screen is a rather sizable bezel. It’s a bit of an eyesore, but serves a purpose: It creates a small surface to grip while reading on the move, without accidentally tapping the screen, which flips the page back and forth. We aren’t sure whether that was Amazon’s intention when designing it, but it’s certainly a nice touch (pun intended).",
    "Once again, the firm has refrained from adopting USB-C, so we’re stuck with an aging micro USB slot, located on the top of the device for. Sure, it would have been nice to see what’s fast become the universal norm of USB connectors – across laptops, smartphones and tablets alike – on the Amazon Fire 7 (2019), but at $50/£50 we can live with having to lug an extra charging cable around.",
    "As for what other design features we’re looking at, there’s a 7-inch IPS LCD screen on the front, and a microSD slot hidden beneath a retractable flap on the right. This might lead you to think the Amazon Fire (2019) is waterproof, but trust us, it isn’t.",
    "Up top meanwhile there's also a volume rocker, a 3.5mm headphone port and a power button, along with the aforementioned micro USB port. The result? A tablet that feels awfully crowded when it comes to button placement.",
    "Mounting the volume controls on the top of the device is one of the worst design decisions a manufacturer can make.",
    "During our testing, we must have muddled up the placement and sent the slate into a light slumber at least thrice when we were attempting to turn down the volume, in a desperate bid to silence the rather monotonous commentary in a pop-up advert.",
    "The rest isn’t bad. The Amazon Fire 7 (2019) feels durable and is comfortable to hold with one hand for extended durations. It’s also small and light enough to be taken anywhere.",
    "Walking to the coffee shop for an espresso? Pop it in your back pocket for the stroll. Commuting to work? Sling it in your bag while it’s not in use. Need to take a detour to the shops? It will fit in your car’s glove box with ease.",
    "Let’s not beat about the bush: The Amazon Fire 7 (2019) has one of the worst screens we've seen on a tablet. But that’s to be expected. It’s a $50/£50 slate, so it’s unreasonable to expect much more than the 7-inch IPS LCD display that comes on board, which has a resolution of 1024 x 600.",
    "That’s far from ideal for regular media consumption, but you should have no issues reading what’s on the screen.",
    "Text comes across crisp and clear. Although while bright, the screen does have a tough time illuminating content when faced with direct sunlight.",
    "With that in mind, if you’re looking for a device for reading on a beach in the Costa del Sol, you’re going to want to go with an ereader such as the Amazon Kindle Oasis. Its Carta E Ink screen is a lot better in bright environments, utilizing a dazzlingly bright backlight to combat glare.",
    "We attempted to watch an episode of Stranger Things on the Amazon Fire 7 (2019), but had to shut it off after about ten minutes. Colors come across washed out and detail was sparse, to say the least.",
    "If you’re used to watching on a HDTV, let alone a 4K TV, at home, you’re bound to notice the drop in quality. Pair that with the mono speaker and you have a recipe for media-consumption armageddon.",
    "That said, we had no issues watching a handful of YouTube videos on the slate. Maybe that’s because we aren’t accustomed to a particular viewing experience for the platform.",
    "Whatever the case, strap on a pair of headphones (or escape to a quiet room, if that’s not an option) and you’ll have no trouble whatsoever taking notes as Mary Berry walks through how she makes her famous Devonshire Scones.",
    "Still, the Amazon Fire 7 (2019) is ideal for those looking for an affordable device to read the latest John Grisham novel around the house, on the tube and even on an aircraft.",
    "You’ll just need to pop up an umbrella if you want to continue to immerse yourself in the action outside. But again, at $50/£50 we have to make a compromise or two – so if watching movies or reading in sunlight are priorities, look elsewhere."
  ],
  "headers": {
    "4": "Amazon Fire 7 (2019) price and availability",
    "7": "Design",
    "17": "Display"
  },
  "links": {
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Amazon Kindle Oasis": "https://www.techradar.com/reviews/amazon-kindle-oasis-2017-review"
  }
}