{
  "source": "https://www.techradar.com/reviews/zoho-projects",
  "title": "Zoho Projects review",
  "category": "computing",
  "updated": "2020-01-18T20:10:21Z",
  "author": "michael-graw",
  "summary": "Inexpensive project management with plenty of app integrations",
  "verdict": "Zoho Projects is an inexpensive project management solution for startups and small businesses. The software boasts numerous communication and time-keeping tools, plus integration with Zoho and Google apps.",
  "pros": [
    "Free plan for up to five users",
    "Integration with Zoho and Google apps",
    "Time tracking for hourly billing"
  ],
  "cons": [
    "Gantt charts are cumbersome to use",
    "Reporting tools break down for large teams"
  ],
  "article": [
    "Zoho Projects sets a high benchmark for every other project management software to meet. The platform offers deep features like Gantt charts and the ability to record billing time on multiple projects simultaneously. Zoho Projects also includes a very impressive suite of communications tools, including real-time chat boxes, forum pages, and integration with Zoho Meeting.",
    "There are a few downsides to Zoho Projects, including that task view features like Gantt charts and kanban cards can be cumbersome to use. But, it’s hard to get too down on the software once you see the pricing: Zoho Projects is free for up to five people and two projects, and paid plans are much cheaper than competing project management platforms.",
    "Zoho Projects offers extremely competitive pricing, especially considering all of the tools packed into this platform. You can use the software completely free for up to two projects and five team members. That makes this a very attractive platform for small businesses and startups looking to pinch every penny.",
    "Paid plans start at $25 per month (or $240 per year) for up to 10 users and 10 projects. This also unlocks the time-tracking features and adds attachments up to 5 GB into the chat system.",
    "The best features of Zoho Projects require a $50 per month ($480 per year) Express plan. At that tier, you get Gantt charts for every project, recurring tasks, and integration with Zoho Accounting & Books. After 15 team members, each new user costs $4 per month of $36 per year.",
    "If you need custom features like task dependencies or a business-specific domain, Zoho Projects also offers a Premium plan for $100 per month ($1,020 per year) or an Enterprise plan for $150 per month ($1,500 per year).",
    "Zoho Projects has a rich feature set that allows this project management software to stand out in a crowded field. To start, the software integrates seamlessly with the rest of the Zoho ecosystem, which includes apps for email, IT management, CRM, finance, meetings, and more. If your business uses Google’s G Suite, Zoho Projects also integrates with most Google apps.",
    "Team communication is one of Zoho Project’s strong suits. The platform features a built-in chat box for instant messaging and paid users can attach files. You can also setup forums for individual projects, which helps create a legacy of knowledge as personnel rotate. Integration with Zoho Meeting is a plus, since you can launch video meetings with colleagues right from your task view.",
    "The platform also does a nice job with time tracking and management. Projects can be assigned ‘strict’ timelines so that task deadlines cannot be set outside the project dates. For Express users, individual tasks also come with a built-in time tracker — and you can check whether time spent is billable or non-billable on that project. It’s also simple to set up recurring tasks within any project.",
    "Zoho Projects also offers a few different task view options. The software’s Gantt charts are nicely organized and easy to keep track of. A kanban-style task board is available, although you’re limited to choosing between a few preset view options (e.g. Open, Closed, or Priority). For coding and development projects, Zoho Projects includes IssueTracker for submitting and tracking bugs.",
    "Managers will be interested in Zoho Project’s resource management reporting feature. These weekly reports highlight which employees are tasked with too much or too little work, as well as which projects their time is being spent on. However, beware that the report presentation is lackluster — Zoho Projects uses a balance scale illustration rather than a simple number score to rate individual team members’ work balances.",
    "On the whole, Zoho Projects is straightforward to use. The various tools and task views are segmented into tabs. In addition, every user on your team can create a custom dashboard that displays updates to their most important projects when they log in and provides alerts about upcoming deadlines.",
    "Zoho Projects is even better when it’s time to start a new project. The platform makes it easy to invite new team members, and flexible, but clear admin tools allow managers to set permissions for task creation and approval.",
    "The most notable place where Zoho Project’s ease of use breaks down is in creating Gantt charts. You can’t simply click and drag a new task on the chart interface. Instead, you have to create a task, and then create a dependency underneath that task — it’s not hard, but it adds friction that was otherwise absent from most other parts of the software.",
    "Zoho Projects is designed to be simple enough that managers and employees alike are unlikely to face much difficulty with it. But when you do need support, there’s plenty available.",
    "Zoho has a huge library of documentation and videos to answer most common questions. The company also has an active forum where Zoho Projects users can post questions and get help from the broad Zoho community. Direct support from Zoho is limited to email, but the company typically responds within a few hours.",
    "There are a few competitors to Zoho Projects, although to be sure Zoho has carved out a low-priced niche for itself among bootstrapped businesses and small teams. For medium-sized teams, LiquidPlanner offers more functional Gantt charts and a variety of reporting and scheduling tools that Zoho Projects can’t match. If you prefer using kanban cards rather than Gantt charts, Asana offers a lot more flexibility to work with this task management methodology than Zoho Projects does.",
    "Zoho Projects is a highly capable project management software with plenty of tools for team communication, project time-keeping, and bug tracking. The platform is particularly attractive for small teams and startups, since it offers a free plan for up to five users and very inexpensive paid plans. While Zoho Projects falls a bit short of the mark in task view features like Gantt charts and kanban cards, the rest of the software environment is very easy to use. In addition, integration with the Zoho and Google app ecosystems is a big plus."
  ],
  "headers": {
    "2": "Plans and Pricing",
    "6": "Features",
    "11": "Interface and In Use",
    "14": "Support",
    "16": "The Competition",
    "17": "Final Verdict"
  },
  "links": {
    "project management software": "https://www.techradar.com/best/best-project-management-software"
  }
}