{
  "source": "https://www.techradar.com/reviews/vpncc",
  "title": "VPN.cc review",
  "category": "computing",
  "updated": "2020-10-28T18:22:04Z",
  "author": "sead-fadilpasic",
  "summary": "A VPN that does the job",
  "verdict": "VPN.cc does what it’s supposed to, keeping you safe from snoopers and unblocking all sorts of content. It even offers two different free trial options so you can take a peek before committing. However, it doesn’t have any advanced features and a lack of any helpful articles, FAQs, or troubleshooting details on the website is disappointing.",
  "pros": [
    "Large server network",
    "Reliable platform",
    "Free trial"
  ],
  "cons": [
    "No help center/knowledge base on the website",
    "Not many features",
    "Missing mobile apps",
    "Only 2 simultaneous connections",
    "Only accepts credit cards"
  ],
  "article": [
    "VPN.cc is a VPN provider based in Malta whose services cover all you would expect from such a platform: bullet-proof privacy protection and unblocking of major geo-restricted services.",
    "However, the website offers very little detail and the service has a few other shortcomings, like the lack of features, mobile apps, simultaneous connections, and payment methods beyond credit cards.",
    "For this reason, we recommend that you also take a look at the best VPN options for more ideas.",
    "The provider offers a traditional 3-day free trial to anyone that wants to test its service out, and you don’t even need to leave your payment details.",
    "There’s also a 7-day free trial if you’re willing to leave your credit card details, but you’ll have to cancel the trial during these seven days if you don’t want to be charged for the full service.",
    "If you find that you like it, you’ll be able to purchase the service packages of four different durations.",
    "The shortest and the most expensive in the long run is the 1-month plan that will cost you $9.99/month. Slightly more affordable is the 3-month option at $8.99/month, followed by the 6-month plan at $7.99/month.",
    "Finally, you’ll get the most value for your money if you go for the 12-month subscription that nets you a 30% discount, which amounts to $6.99/month.",
    "The only accepted payment method is credit/debit cards, which in this day and age is very restrictive, especially if you want to pay via cryptocurrencies for more anonymity or PayPal for more control over your expenses.",
    "If you realize that you’ve made a mistake after the purchase, you’re allowed to change your mind and ask for a refund within 14 days after you paid.",
    "Under one account, you can run the VPN.cc service on up to two devices simultaneously, which is rather minimal, considering there are services out there that can cover 10, 12, or even an unlimited number of devices at the same time.",
    "VPN.cc has a lot to offer but fails to deliver in some areas where today’s best VPN platforms overperform.",
    "ExpressVPN, NordVPN, CyberGhost and Surfshark, for example, all have plenty to provide in terms of features, accepted payment methods, and helpful articles, and some of which cost less too.",
    "Access to geographically restricted VOD services such as Netflix, BBC iPlayer, Hulu, and other platforms is a feature that many users seek out when picking a VPN service.",
    "VPN.cc is a provider that can deliver on that front, as long as you connect to a server in a country where your desired channel is unblocked.",
    "VPN.cc is the product of Pandora Web, a company registered in Malta. By signing up for its services, you’re getting access to quite a large server network, counting 4,753 units with over 20,000 IP addresses.",
    "The vendor has an excellent server coverage that includes 59 countries, in places like Mexico, Croatia, Russia, New Zealand, China, Saudi Arabia, Kyrgyzstan, Costa Rica, and Egypt.",
    "To keep you safe from prying eyes and unblock access to various content, VPN.cc uses OpenVPN, L2TP, and PPTP protocols, but that’s as much as we are told in that matter.",
    "There’s no information on encryption or any other details concerning this area. Also, there are no premium features like a kill switch, split tunneling, etc.",
    "The provider has a privacy policy on the website but it doesn’t offer any details about its logging or no-logging practices. No details are available on whether it supports torrenting/P2P traffic either and we never received a response on the matter from the customer support.",
    "According to the website, VPN.cc has apps for Windows, Mac, Linux, iOS, and Android. That said, the links for mobile apps on the website aren’t working, and looking up manually we only managed to find the iOS app, which was rated 4.1 (out of 5) by 89 people. The app was last updated on November 13, 2018.",
    "You can contact the customer support using email or support form. The Windows app itself has the option to contact the customer support via support form, along with the option to attach an error log and/or operating system info so your problem is solved more easily and quickly.",
    "That said, we tried getting in touch with the customer support for more info but no one responded.",
    "The Windows app is well designed, highly intuitive and responsive, so we had no problems installing or using it. Server switching is as smooth as they come - just double click the desired server, regardless of whether you’re already connected to a different server or not - and the servers can be filtered according to country, city, availability, ping, and distance from your current physical location.",
    "An automatically selected server in Italy delivered solid download speeds - 23Mbps on a 70Mbps testing connection. Next, we tried a server in Australia, despite the app warning us that we might experience poorer performance; lo and behold, we only got 6.33Mbps.",
    "Although VPN.cc is a very sturdy platform with a large number of servers and IP addresses, stable connections, and solid speeds, we found its lack of a help center or any sort of reading material (other than the Privacy Policy and ToS) very off-putting.",
    "This means users will have to contact the customer support and wait for their response whenever they run into the slightest problem or have any questions (and the answer still might not arrive).",
    "If you’d like a feature-packed VPN service that has a detailed help center on its website, along with live user support for any issues you need urgent help with, then you should go with a far more superior service such as ExpressVPN."
  ],
  "headers": {
    "3": "Price",
    "11": "Alternatives",
    "13": "Streaming",
    "15": "About the company",
    "17": "Privacy and encryption",
    "20": "Support",
    "23": "Speed and experience",
    "25": "Verdict"
  },
  "links": {
    "VPN.cc": "https://www.vpn.cc/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1023297072801377700"
  }
}