{
  "source": "https://www.techradar.com/reviews/spendwise-purchase-order-software",
  "title": "Spendwise purchase order software review",
  "category": "computing",
  "updated": "2020-09-30T08:23:15Z",
  "author": "rob-clymo",
  "summary": "Use Spendwise to take the strain out of everyday small business tasks",
  "verdict": "Spendwise does a lot more than just process purchase orders with plenty of accounts-based features for the small business owner.",
  "pros": [
    "Volume purchase orders",
    "Drag and drop dashboard",
    "Great data import features"
  ],
  "cons": [
    "Might not work for larger firms",
    "Basic edition is just that"
  ],
  "article": [
    "Spendwise is a cloud-based software package that allows you to take control of your financial management chores, making it very useful during the ongoing coronavirus crisis. However, it also comes with a raft of other tools for business needs. Launched back in 2012, the US-based software is aimed primarily at small to medium-sized businesses that need to keep a firm eye on efficiency.",
    "As a result, it boasts several core features aimed at maximizing time and money, with tools for creating multiple purchase orders, managing budgets and keeping track of bills and expenses. The software can be set up for multiple users while there’s powerful reporting functionality too. Packages come keenly priced, making it an attractive proposition for the smaller venture, but with plenty of punch for business that are looking to scale up their operations.",
    "Competitor products include the likes of Sage Business Cloud Accounting, QuickBooks, Xero, FreshBooks, Freeagent, GoSimpleTax, TaxCalc, Nomisma, ABC Self-Assessment, Crunch or Zoho Books.",
    "There are currently three different Spendwise plans available. Basic is priced at $9 per user, per month, which can be used by up to 5 people. It offers 10 transactions per month. It also delivers purchasing, receiving, invoice matching and reporting.",
    "Next up, the Pro package costs $19 per user, per month (sold in packs of 5 users) and can be used by up to 50 people. It delivers unlimited transactions per month. This option gets you everything in the Basic edition plus multiple dashboards, approval limits and workflows, custom user roles and budget management. There’s an optional implementation package available as an add-on.",
    "The third package offered by Spendwise is Enterprise and this comes with an unlimited user allowance, unlimited transactions per month plus everything in the Pro edition. You’ll also get the implementation package along with priority support.",
    "Optional add-ons include accounting system integrations and inventory management. There’s no published price for this, however, and you’ll need to contact Spendwise direct for costings.",
    "Business activities within Spendwise revolve around the main dashboard area, which is a workspace that offers access to all of the main features. At its core, Spendwise is focused on tackling bills, purchase orders and PO receipts, all of which can be found from the dashboard console.",
    "The cloud-based software is also useful for in-depth reporting and allows easy management of business contacts too. For convenience and speed it’s simple to populate all of the different facets of the software by importing files into the various areas of the program.",
    "That means contacts can be loaded in, stock items will be populated into a ready-to-go layout and so on. The Quick Setup option on the right side of the dashboard lets you do a lot of this, and shows progress as a result.",
    "During the time we got to use the free trial Spendwise seemed to perform perfectly well via a web browser and our always-on internet connection. Obviously, being cloud-based the software is dependent on being connected, but in terms of overall efficiency of the page loads and general functionality we couldn't find anything to be concerned about.",
    "In fact, the lightweight design of the interface really helps performance, even if you’ve imported quite a lot of data into the system. Importing of data, incidentally, can be done by choosing a CSV file and loading it into the system via your desktop.",
    "As outlined above, the bulk of the features and functions within Spendwise are found in the dashboard workspace. This in itself is a very simple to use interface, with pretty minimal menus and an easy-on-the-eye main work area. Adding to the simple functionality is a menu on the right-hand side of the screen that delivers instant access to quick setup features, such as adding vendors, items and additional users.",
    "Along the same side is a series of tips, designed to help you get the best from the software without having to look too far. The dashboard can also be fully customized with drag and drop efficiency, making Spendwise even more easy to personalize to suit your own requirements.",
    "You’ll find that answers to many common queries can be found in the Spendwise searchable knowledge base. Underneath that are options including a full user guide, tips and FAQs. Users can also call on this page to submit a ticket requesting help. If you’ve gone for the full Enterprise package then you’ll be able to enjoy priority support as a result. Prior to signing up, or using the free 30-day trial, it's also possible to contact Spendwise for a demonstration of the cloud-based software.",
    "Spendwise doesn't suffer from being over complicated, with a user interface that’s a doddle to master. Equally, it’s got a lot of underlying muscle, particularly when you start to input larger chunks of your own data to use within the dashboard area. The trial option is a good one to let you explore the features and functions too.",
    "If you’ve got fairly basic requirements then the entry-level package is a bit of a steal, although bear in mind its limitations. If you need a more capable package then head for either the Pro or Enterprise editions, which boast more scalable features. Whichever option you pick though Spendwise is great at doing a little bit of everything."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Features",
    "10": "Performance",
    "12": "Ease of use",
    "14": "Support",
    "15": "Final verdict"
  },
  "links": {
    "Spendwise": "https://secure.spendwise.com/home/purchase_order_software",
    "financial management": "https://www.techradar.com/best/accounting-software-small-business",
    "efficiency": "https://www.techradar.com/news/the-best-business-technology-and-productivity-gadgets",
    "purchase orders": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "managing budgets": "https://www.techradar.com/best/best-budgeting-software",
    "expenses": "https://www.techradar.com/best/best-expense-trackers",
    "Sage Business Cloud Accounting": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-online",
    "Xero": "https://www.techradar.com/reviews/xero",
    "FreshBooks": "https://www.techradar.com/reviews/freshbooks-2020",
    "Freeagent": "https://www.techradar.com/reviews/freeagent",
    "GoSimpleTax": "https://www.techradar.com/reviews/gosimpletax",
    "TaxCalc": "https://www.techradar.com/reviews/taxcalc",
    "Nomisma": "https://www.techradar.com/reviews/nomisma",
    "ABC Self-Assessment": "https://www.techradar.com/reviews/abc-self-assessment",
    "Crunch": "https://www.techradar.com/reviews/crunch",
    "Zoho Books": "https://www.techradar.com/reviews/zoho-books",
    "Basic": "https://secure.spendwise.com/home/purchase_order_software",
    "Pro": "https://secure.spendwise.com/home/purchase_order_software",
    "Enterprise": "https://secure.spendwise.com/home/purchase_order_software"
  }
}