{
  "source": "https://www.techradar.com/reviews/mix-telematics",
  "title": "MiX Telematics review",
  "category": "computing",
  "updated": "2020-05-19T14:42:16Z",
  "author": "jitendra-soni",
  "summary": "Offers more than just vehicle and asset tracking",
  "verdict": "A veteran telematics provider with a presence in several countries and a comprehensive offering, albeit with some limitations and caveats.",
  "pros": [
    "Comprehensive solution",
    "Installation assistance",
    "Presence in many countries"
  ],
  "cons": [
    "Not much user feedback online",
    "No free trials or demo"
  ],
  "article": [
    "MiX Telematics is a leading cloud-based telematics provider that offers a mobile asset and fleet management solution. Founded in 1995, the company offers this solution in over 120 countries across the globe and has offices in the US and UK, as well as South Africa, Uganda, Brazil, Australia, United Arab Emirates and Mexico.",
    "As of now, MiX Telematics manages over 750,000 mobile assets with the help of over 130 partners and its shares are publicly traded on the New York Stock Exchange as well as the Johannesburg Stock Exchange.",
    "The company delivers a SaaS solution for enterprise fleets, small fleets and consumers, with the ability to track trucks and buses, vans, cars, motorbikes, trailers and more. The company employs a unified approach to telematics, offering actionable intelligence to solve complex vehicle and driver-related problems - it's not just about simply tracking vehicles.",
    "Unlike many other fleet management solutions, MiX Telematics does not offer a free trial or a free demo. The good news, however, is that it's pretty transparent about its pricing and contract structure. The company offers a couple of plans, both payable monthly or annually. For both the plans, the company charges an additional $29.95 per order for shipping and handling of hardware.",
    "Self-installation: This tier starts at $35 a month for a single vehicle and you get an additional 10% discount with the annual plan which costs $378 per year per vehicle. Businesses that opt for this DIY plan are sent the tracking hardware that comes with a limited lifetime warranty, but the company does not offer installation assistance. These devices are plug-and-play, and can be transferred between vehicles.",
    "Among the standard features are live tracking, street and satellite maps, geo-fencing, service and licensing reminders, fuel and cost reporting, access via web or mobile phones and a 30-second software refresh.",
    "Professional installation: As the name suggests this is the pricier of the two plans and is available at $39.50 per vehicle per month or $426 when paid annually (after a 10% discount).",
    "Under this plan, the company offers an accredited installation of the hardware without charging additional fees. However, once installed the devices cannot be moved to other vehicles.",
    "MiX Telematics offers easy to use cloud-based software which helps to optimize costs, improve performance, ensure timely deliveries, and more, all while staying compliant with government regulations.",
    "The MiX Telematics solution helps your business stay organized, and allows you to control the entire fleet using a central command center that makes all the info you need easily accessible. In short, it ensures that the fleet operation runs smoothly with no hiccups.",
    "The software is equally suitable for small, medium as well as large fleet sizes. It helps in managing vehicles effectively, optimizing fuel usage, tracking fraudulent usage, managing payrolls and more. Easy live tracking of vehicles means you don't have the stress of tracing vehicles manually, and it lets the decision-makers focus on more important and critical work.",
    "The tracking hardware supplied by the company collects the vehicle's vital details and transmits them in real-time to the command center, where the information is processed and various reports are prepared that help fleet operators with precise details about the fleet and drivers.",
    "Some key features of the MiX Telematics solution are:",
    "The company's official website has a generic contact phone number and a basic query form for users to reach out in case of a question. It does not, however, provide any direct contact details for the sales team. The company is on most popular social media channels and while its Facebook and Twitter accounts are updated regularly, the YouTube account is not very active with videos being uploaded intermittently.",
    "A product website for MiX Now has a support number and a form to submit a query. Going through the Facebook page shows that the company does host webinars, but the information about these webinars is missing from the website.",
    "MiX Telematics has an interesting range of products and services including hardware installation by experts. However, that comes with added limitations. Its cloud-based solution is fit for varied fleet sizes, though it is always advisable to assess if the offerings match to your requirements.",
    "While the company is a veteran in the business, it does not have many customer reviews online. Better Business Bureau (BBB) shows that the company has been operating for over 10 years yet it's not been accredited with them. There are no user complaints or reviews on the BBB site, although it does rate MiX Telematics as an A+ company."
  ],
  "headers": {
    "3": "Pricing",
    "8": "Features",
    "13": "Support",
    "15": "Final verdict"
  },
  "links": {
    "MiX Telematics": "https://www.mixtelematics.com/",
    "fleet management solution": "https://www.techradar.com/best/best-gps-fleet-tracking-solutions"
  }
}