{
  "source": "https://www.techradar.com/reviews/creativehub-review",
  "title": "Creativehub cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T14:44:05Z",
  "author": "david-nield",
  "summary": "Creativehub is the ideal hub for creatives",
  "verdict": "Creativehub is going to appeal to a very specific group of people: digital creatives with artwork or photographs to share and sell on the web. If that's you then the Creativehub platform has plenty to offer, otherwise you're probably better off looking elsewhere.",
  "pros": [
    "AI-powered image search",
    "Easily publish work to the web",
    "Integrated printing and sales"
  ],
  "cons": [
    "No automatic backup",
    "No advanced security",
    "No detailed file handling"
  ],
  "article": [
    "Creativehub is one of those cloud storage services aimed at a particular group of people – in this case, digital creatives. The focus is on storing images in the cloud, being able to share those images easily, and having an intuitive way of searching through them too.",
    "The ability to show off a portfolio of your work and even to track where it's being displayed on the web is built in, and we're pleased to say there's a free tier that you can try out to see if Creativehub is for you – no financial details required, unless you want to start paying.",
    "If you're a digital artworker looking to promote and track your creations on the web, then Creativehub might just be the ideal cloud storage service. File sharing and file commenting is baked right into Creativehub, so working together with other people is no problem at all, and everything works smoothly on the web and on mobile devices. Being able to see where on the web your images are being used is really helpful too.",
    "As we've mentioned above, a portfolio of your work can be easily created with very little effort and with plenty of customization options for you to take advantage of. Creativehub is far from the only service letting you build up a nice visual portfolio of work on the web of course, but it can definitely hold its own with the competition, and it's convenient to have cloud storage and file sharing built right in.",
    "We're also impressed with the artificial intelligence search, which can recognize what's in your art and your photos without you having to tag everything manually (Google Photos and Apple Photos have similar sorts of features). On top of all that, Creativehub is committed to being end-to-end carbon neutral, and uses some of the proceeds of your subscription money to help support the World Land Trust.",
    "Creativehub also partners with Shopify to make selling your art on the web a straightforward process from start to finish, so you've really got everything you need in one place – if you're the target market. You can in fact upload any kind of file to Creativehub (PDFs, audio files and videos can all viewed straight from the web), though it works best for images and art.",
    "As befits a platform focused on the creative industry, the Creativehub website is a pleasure to use – you can drag and drop files into the web window to upload them, or pick them from the local disk as a group. While Creativehub does offer apps for Android and iOS, there are no desktop apps to take advantage of, but the web app works well enough.",
    "Every part of the Creativehub online interface feels slick and speedy, like something put together by Google or Apple. That doesn't necessarily mean it's feature-packed though: editing and sorting options are kept to a minimum, with the aforementioned AI-powered search intended to take care of most of your organizational needs.",
    "You can easily split files up into projects, which can then be shared in their entirety with other people or published to the web with your own particular branding. Everything is simple, straightforward and flexible – in the case of sharing projects, for example, you can prevent downloads, limit the size of the files that people can access, add watermarks to your images, and add a separate password for extra protection.",
    "Access the app on mobile, and it's almost as polished and as quick as it is on the web, though we reckon you're going to be mostly accessing Creativehub through a browser on a laptop or desktop. You can't really complain about anything to do with the Creativehub interface, even if it is a bit sparse compared with some other cloud storage services.",
    "We're pleased to see two-factor authentication offered as an option with Creativehub – and as soon as you've signed up for an account as well (though you're not forced to use it). It's probably the best way you can protect your account information and the pictures contained inside your Creativehub portal, because it means even if your username and password leak out, other people won't be able to get into your account.",
    "What you don't get are any of the advanced features available on cloud storage services that are more general in their aims and more generic in their approach – there's no end-to-end encryption here, no file versioning, no undelete feature and so on. That may or may not frustrate you, depending on what you're looking for.",
    "Letting users try out all the features of a service for free but limiting the amount of storage they get is by far the best way of tempting people in, so we're pleased to see Creativehub adopting the strategy here. You get 5GB of room to play around with to see if the platform is right for you, and then you've got the option to top that up as required. Some services don't even have a free tier, remember.",
    "If you decide to pay up, the pricing structure is very straightforward: 1TB for £8 (about $10), 2TB for double that price, 3TB for triple that price, and so on. Basically, it's £8 ($10) per terabyte per month. Interestingly, each terabyte you sign up for entitles you to an £8 ($10) credit for Creativehub's physical art printing service – so if you do a lot of printing of your work, the cloud storage is essentially free.",
    "In many ways, Creativehub sticks to the basics of cloud storage: there's no fancy way of syncing files to it from your computer or your phone, there aren't any advanced file management features, there's no team management functionality here, and so on and so on. If you're looking for straightforward storage in the cloud for all sorts of data, then there are better (and cheaper) options out there than Creativehub.",
    "On the other hand, it's absolutely worth a look for digital creatives looking for an all-in-one package that combines cloud storage with advanced search, file sharing and commenting, portfolio publishing and more. You can use Creativehub to sell and print your artwork as well as storing it on the web, which will make it perfect for some."
  ],
  "headers": {
    "2": "Creativehub features",
    "6": "Creativehub interface",
    "10": "Creativehub security",
    "12": "Creativehub pricing",
    "14": "Creativehub verdict"
  },
  "links": {
    "Creativehub": "https://creativehub.io/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}