{
  "source": "https://www.techradar.com/reviews/sony-xperia-5-ii-review",
  "title": "Sony Xperia 5 II review",
  "category": "phones",
  "updated": "2020-10-02T17:04:31Z",
  "author": "james-peckham",
  "summary": "Like an Xperia 1 II, but smaller and cheaper",
  "verdict": "The Sony Xperia 5 II takes a lot of what makes its larger sibling great and distills it into a package that’s much smaller and easier to hold. If you’re looking for near top-end tech in an easier-to-hold phone, you’ll struggle to go wrong with the Xperia 5 II, as it features a great camera, beautiful screen and long-lasting battery.",
  "pros": [
    "Easy-to-use design",
    "Great cameras",
    "120Hz screen looks great"
  ],
  "cons": [
    "Annoying Google Assistant button",
    "Still quite a high price",
    "Antiquated unlock button"
  ],
  "article": [
    "The Sony Xperia 5 Mark II is a flagship phone that inherits most of the best features from the seriously expensive Sony Xperia 1 II, but cuts a few corners in order to bring the price down to the level of most other flagship phones.",
    "It’s a handset that’s streamlined for photography and video recording, rather than matching the competition feature for feature and spec for spec. That said, if you’ve liked the look of Sony’s larger phones in the past, but you want a smaller take on them, that’s basically what you’re getting here, albeit with a few cut corners.",
    "Those cut corners include some key specs – for example, the 4K display of the Sony Xperia 1 II is absent here – but if you’re willing to forego such few bells and whistles this may feel like a handset that’s made specifically for you.",
    "While this may feel like a smaller Xperia 1 II, the Xperia 5 II improves on the formula for Sony phones in a few important ways. This is the first handset from the company with a 120Hz refresh-rate screen, and it makes scrolling through apps or your social media feeds a joy on the 6.1-inch screen.",
    "It also improves on the design, with rounded corners making the phone more comfortable in the palm while retaining the now arguably iconic look of Sony smartphones. There’s still a hefty forehead and chin, above and below the display, but it looks better than previous handsets.",
    "The 3.5mm headphone jack has returned; battery life is strong, with the phone lasting for a full day from a single charge; and the cameras remain as great as they were on the Xperia 1 II. If you’re looking for a smaller-package smartphone with top-end specs, the Sony Xperia 5 II could prove an excellent choice.",
    "The Sony Xperia 5 II price is $949 / £799 (around AU$1,350), and it comes in a single configuration with 8GB of RAM and 128GB of storage. In the US, T-Mobile and AT&T will carry the Xperia 5 II, and in the UK you'll be able to get it from O2, Vodafone, EE, Virgin Media and Carphone Warehouse.",
    "Those in Australia won’t be able to buy the phone as the company no longer sells phones in the country.",
    "The Sony Xperia 5 II's release date is October 15 for those in the UK, and you can pre-order the device now directly from Sony and a variety of other partners. Pre-orders are also open in the US, but it won't be released until December 4.",
    "The Sony Xperia 5 II is a smaller version of the Xperia 1 Mark II. It’s got the same narrow 21:9 aspect-ratio display, though it’s only 6.1 inches, compared to the Xperia 1 Mark II’s 6.5-inch screen. You’ll feel that smaller size as soon as you pick this phone up, as it’s surprisingly easy to fit in one hand.",
    "The 21:9 aspect ratio is the trick that’s allowed Sony to make a phone that feels easy to hold in one hand despite still having a fairly large display, as it makes the phone narrower than most handsets.",
    "If you’ve owned the Xperia 5 or other previous Sony phones, you’ll notice how the edges here are more rounded than on those devices.",
    "This is an interesting decision from Sony, as the squared edges of its phones have become an integral part of the brand’s signature look – however, we don’t think the rounded edges here detract from that look a great deal, so Sony fans are unlikely to be disappointed – and as we say it makes the phone feel that bit nicer to hold.",
    "On the right edge of the phone you’ll find volume buttons near the top and, further down, a Google Assistant button (which can be customized for other functions), as well as a camera shutter button near the bottom that’s designed for taking snaps in landscape orientation.",
    "There’s also an enlarged lock button between the volume and Google Assistant keys, which incorporates a fingerprint sensor, as Sony hasn’t included an in-screen sensor here. That’s a fairly big omission, but we’ve found the fingerprint scanner to work well in our testing.",
    "A couple of times we activated the fingerprint scanner accidentally when we were holding the phone, which was annoying – touching the scanner a couple of times when you’re not trying to unlock the phone will cause the phone to prompt you to use a different unlock method.",
    "When you’re spending this much on a phone you might well be expecting to get an in-screen fingerprint scanner, considering that a lot of top-end phones, including the Samsung Galaxy S20 range and OnePlus 8 series, have this.",
    "The phone’s USB-C port is on the bottom of the phone and the 3.5mm headphone jack is on the top, so you can charge the phone and listen to audio at the same time if you need to – that’s a big deal for many music lovers, and the company decision to bring back the 3.5mm jack, having dropped it on the Xperia 1 and Xperia 5, is a welcome one for many.",
    "The phone’s back is smooth glass, with the camera block in the top-left corner. The Xperia 5 II is set to come in both black and blue colors, but those seem to be the only shades Sony will be offering.",
    "Overall, the Xperia 5 II is an attractive-looking phone, and while the black shade we’ve been using is unlikely to catch the eye, the overall design is functional, and a lot easier to reach everything you need when holding the phone in one hand compared to the Xperia 1 II. The handset is also water-resistant to a depth of 1.5 meters for up to 30 minutes.",
    "The Sony Xperia 5 II only has a Full HD Plus (1080 x 2520) display, rather than the 6.5-inch 4K display of the Xperia 1 II, but it improves on its larger sibling in one key respect: the display here has a 120Hz refresh rate. That essentially means the screen refreshes images twice as fast as older phones, allowing for a smoother experience when cycling through your social media feed or gaming.",
    "The new screen tech makes everything feel smoother and therefore faster, and it’s the sort of feature you don’t know you want until you’ve experienced it.",
    "While the Full HD Plus resolution is a lot lower than the Xperia 1 II’s on paper, in practice the difference isn’t all that noticeable. As mentioned, it’s a 6.1-inch display, and the resolution equates to 449 pixels per inch.",
    "Colors look good on the display, and it can reach a high peak brightness – we were constantly impressed by how good the screen looked when we were watching Full HD video. While we’d have loved to have seen a QHD display here, we didn’t particularly miss it, and it’s a worthwhile trade-off for the price you’re paying.",
    "The screen has a 21:9 aspect ratio, which means it’s longer/taller than the screens on most smartphones. It's designed to be more optimized for watching video content, such as films that are almost exclusively shot in a widescreen ratio.",
    "An additional benefit to this aspect ratio is that the company has included a larger display than it would have been able to previously. It's important to note there are still thick bars at the top and bottom of the screen that make it look a bit dated, but if you prefer the longer screen style you'll likely be okay with that.",
    "The Sony Xperia 5 II inherits its three rear cameras and single front-facing camera from the Xperia 1 Mark II. What does that mean? It means this phone has an extremely powerful camera array, very much designed for those who want to do more than just snap away with their phone camera set to auto.",
    "The three rear cameras are all 12MP shooters: a main camera with a 24mm lens, an ultra-wide camera with a 16mm lens, and a telephoto one with a 70mm lens. We’ve found these cameras to perform superbly in our testing, although they may not be the perfect setup for everyone.",
    "Sony puts a lot of emphasis on its professional photography modes, which enable you to tinker with camera settings that you can’t access on many other phones. This is great if you like to play around with white balance, ISO and more, but again they won’t be for everyone – anhe good news for those people that the automatic mode on the Xperia 5 II is fantastic, and we were able to capture some great-looking shots during our testing.",
    "The camera can be a little slower to focus than some others, but the photos we took looked sharp, and while the colors may not be as punchy as you’ll get from other flagship phones they feel true to life – again, Sony may be thinking of the more serious photographer here.",
    "The telephoto sensor only works up to 3x optical zoom, but the quality of zoom images is particularly good – without studying them closely you wouldn’t know that they were zoomed-in.",
    "You’re not getting the strong zoom capabilities of the Samsung Galaxy S20 series, for example, but if you’re not looking for a phone with high-end zoom performance this will suit you just fine.",
    "There’s a single 8MP front-facing camera, which produces nice-looking selfie shots. There are many phones with higher-specced selfie cameras, but if you’re just looking to take the odd shot for your social media channels you’ll be perfectly happy with what Sony’s snapper can do.",
    "As on other Xperia phones, the selfie camera is located in a solid black bar above the screen – that means there’s no notch on the Xperia 5 II, but it also means that the front of the phone isn’t all screen, which does look a little dated.",
    "The Sony Xperia 5 II packs a Qualcomm Snapdragon 865 chipset with 8GB of RAM alongside it. That isn’t the top-end chipset from Qualcomm at the moment, but we found it delivered sufficient power to enable us to do everything we wanted to do on the phone.",
    "Apps and games loaded quickly, without any stuttering. We didn’t experience any issues with the performance in general, and while the Xperia 5 II may not be able to load games as rapidly as some phones with faster chipsets you’re unlikely to find it an issue.",
    "In Geekbench 5, the phone returned an average multi-core score of 3265. That’s higher than we saw from the Xperia 1 II, which came as a bit of a surprise, and exceeds quite impressive past what we’ve seen from other top-end phones recently, such as the Samsung Galaxy Note 20, which scored 2701.",
    "For gaming, we found the Xperia 5 II to work impressively well. All the titles we tried loaded as quickly as we'd hope for from a phone with a top-end chipset, and a special feature called Heat Suppression Power Control ensures the phone doesn't heat up during long session.",
    "We only played for around 20 minutes at a time, but we didn't find the phone to heat up at all during that period. You may find it does during longer sessions, but the idea behind this feature is it'll save on your battery life by the chipset staying at a everyday temperature.",
    "The Xperia 5 II is available in two storage variants – 128GB or 256GB, although some markets are restricted to one option so you may not have a choice. If you’re stuck with the 128GB and need extra space, you can expand your storage with a microSD card.",
    "The phone comes with 5G built-in, so if you have a supporting network and data plan you'll be able to make the most of next-gen internet connectivity. 5G isn't available everywhere yet, but the technology is spreading out across both the US and UK.",
    "The phone is running Android 10 out of the box, giving you access to many of the best features within Google’s operating system – if you’re after Android 11, the latest version, the update is confirmed for this phone, although it’s unclear when it’ll land.",
    "Sony includes its own UI overlay on all its smartphones, and it’s here too. This gives the OS a distinct look, and a variety of features you’ll only find on phones from Sony, such as its Cinema Pro app for shooting video and its own Music Player app.",
    "Google Assistant is being pushed on the Xperia 5 II, with a dedicated button for accessing the smart helper – we found this annoying, however, as the button sits between the unlock and camera shutter buttons, and every time we pressed the button during our time reviewing the phone it was because we hit it accidentally when trying to press the camera button.",
    "The phone has the same 4,000mAh battery as the Xperia 1 Mark II, and like that phone it also boasts fast-charging capabilities – although to take maximum advantage of this you’ll need to buy a dedicated charger separately.",
    "That’s a large battery for a phone of this size, and it shows in day-to-day use. We found the phone always lasted us through the whole day from a full charge, and we often found it would have at least 30% left in the tank at the end of the day.",
    "Not surprisingly we found the battery to drain faster with intensive usage, but even then the phone never failed to make it through to the end of the day.",
    "There’s no wireless charging on the Xperia 5 II, which is something its larger sibling does have. Instead, the company has included a layer of graphene that helps dissipate the heat of the chipset to ensure it doesn’t get too warm.",
    "This is a shame for anyone who wants access to wireless charging tech, but it seems to be a conscious choice from Sony to opt for the graphene tech and ensure fast-charging is a focus.",
    "On the plus side, as mentioned, the phone does come with fast-charging capabilities. You’ll be able to get 18W charging with the brick included in the box, which we found can get your phone to 50% charge in just 30 minutes, as Sony claims.",
    "The phone also supports even snappier 21W fast-charging, but you’ll need to purchase a separate charger to be able to make use of this.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Sony Xperia 5 II release date and price",
    "9": "Design",
    "20": "Display",
    "26": "Cameras",
    "34": "Specs and performance",
    "44": "Battery life",
    "51": "Don’t buy it if…"
  },
  "links": {
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "Xperia 5": "https://www.techradar.com/reviews/sony-xperia-5-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8"
  }
}