{
  "source": "https://www.techradar.com/reviews/google-pixel-3a-review",
  "title": "Google Pixel 3a review",
  "category": "phones",
  "updated": "2020-10-21T16:32:29.933Z",
  "author": "tom-bedford",
  "summary": "Does the Pixel 3a score an A?",
  "verdict": "The Google Pixel 3a doesn’t feel like the affordable cousin of a high-end phone – it feels more like a powerful and impressive mid-range handset in its own right, with great specs and useful features inherited from the Pixel 3 that you won’t find in many other similarly-priced devices.",
  "pros": [
    "Brings back the headphone jack",
    "Affordable price point",
    "Has Active Edge"
  ],
  "cons": [
    "Feels a little slower than the Pixel 3",
    "No wireless charging",
    "Plastic body doesn't feel 'premium'"
  ],
  "article": [
    "Google has traditionally competed in the high-end smartphone market with its Pixel series, so the Pixel 3a, introduced as an affordable alternative to the Google Pixel 3, is a notable shift in strategy for the company.",
    "Launched at Google IO 2019 alongside the Pixel 3a XL (the lower-cost version of the Pixel 3 XL), the Google Pixel 3a shows the company is trying to expand its customer base by offering phones at a lower price point than its flagship devices.",
    "The Pixel 3a has been superseded by the Google Pixel 4a, which takes some inspirations from the Pixel 4 and packages them in a similar low-cost, high-value smartphone. But that means the Pixel 3a price has dropped over time, and will likely see even more discounts in the lead up to Black Friday on November 27 and Cyber Monday thereafter.",
    "Until rumors started circulating this year we weren’t expecting Google to release affordable handsets any time soon, and we wouldn’t have expected a handset that’s launching at the Pixel 3a’s price point to be as impressive as it is. In many ways, the Google Pixel 3a is a total surprise for its cost.",
    "With many features inherited from the Pixel 3, like its cutting-edge camera and Active Edge squeeze function to launch Google Assistant, the Pixel 3a seems a serious rival to its older sibling. Sure, there’s a small specs drop, but there’s an even bigger price cut – so does the Pixel 3a make the Pixel 3 redundant?",
    "The Pixel 3a, alongside the Pixel 3a XL, became available in a range of stores and from various carriers on May 8, one day after its announcement, but in the US you were able to buy it online before then.",
    "There’s only one power/storage option: 4GB RAM and 64GB, which costs $399 / £399 / AU$649. That’s roughly half the price of the Pixel 3, which cost $799 (£739, AU$1,199) for the 64GB storage model when it was released.",
    "At this price it sits slightly cheaper than other mid-range competitors like the OnePlus 7, Xiaomi Mi 9 and Honor 20.",
    "To look at, the Google Pixel 3a could easily be confused with the Pixel 3 – it has a similar-looking body with rounded edges and screen corners, and the same two-tone rear design, with the top of the phone is reflective whereas the majority of the panel is matted; however, on the Pixel 3 the material used for the rear is glass whereas here it’s plastic – the first clue to the 3a’s budget status",
    "The similarities extend to the placement of the rear camera and flash on the left of the phone’s back panel, the volume rocker and power button on the right side of the handset, and the USB-C port at the bottom of the device.",
    "There’s also an extra port, and it’s a welcome addition – a headphone jack, which you won’t find on many mid-range phones. On the other hand, there's only one front-facing speaker instead of two, so media played on the Pixel 3a doesn’t reach the bar set by the Pixel 3.",
    "One of the most useful features of the Google Pixel 3 is Active Edge, which lets you squeeze the edges of the handset to summon Google Assistant, and this is also present on the Pixel 3a, which is something we didn’t expect given the lower price. It did feel a little harder to press than on the Pixel 3 however, so we found ourselves having to squeeze quite tight to use the feature.",
    "The Pixel 3a is a little bigger than its high-end forebear, with dimensions of 151.3 x 70.1 x 8.2mm, but it’s rather light at 148g – this is because, as mentioned, instead of the glass back of the Pixel 3, the rear of the Pixel 3a is plastic, giving the handset a slightly less ‘premium’ feel.",
    "The phone feels easy to use in the hand – the rear-mounted fingerprint sensor is at the right height to make it easy to reach when you pick up the phone, as are the power button and volume rocker on the right side of the device, and the display is small enough that most won’t have to stretch to reach anything on the screen.",
    "If you like smaller handsets, the Google Pixel 3a is definitely a viable option – its small dimensions make it the perfect pocket phone, and it’s a lot easier to use for everyday tasks like texting and checking emails than its plus-sized relative.",
    "At 5.6 inches, the Google Pixel 3a display is proportionate to the relatively small body of the phone – that’s to say, it’s rather small. If this is a problem for you, you can check out the Pixel 3a XL, but many people don’t need big-screen phones, and the Pixel 3a’s display is just right for everyday functions.",
    "The display is Full HD+ and OLED, with a resolution of 2220 x 1080, and because of the relatively small screen size the pixels per inch count is rather high at 441. This means media you stream, as well as pictures you take, can be viewed in more detail, although you’ll be hard pressed to notice at such a high resolution.",
    "These specs combine to make the screen more than adequate to use for a variety of features – but it’s definitely not as impressive as the Pixel 3. The display has a rather limited max brightness and weaker color reproduction, both of which are most noteworthy when streaming media.",
    "You won’t find the screen quality an issue most of the time, but if you’re trying to watch something on a sunny day, or take a picture where color accuracy is important, you may find yourself wishing for a better display."
  ],
  "headers": {
    "5": "Google Pixel 3a release date and price",
    "8": "Design",
    "15": "Display"
  },
  "links": {
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Google IO 2019": "https://www.techradar.com/news/google-io-2019-keynote",
    "Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "Pixel 3 XL": "https://www.techradar.com/reviews/google-pixel-3-xl-review",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "OnePlus 7": "https://www.techradar.com/reviews/oneplus-7-review",
    "Xiaomi Mi 9": "https://www.techradar.com/reviews/xiaomi-mi-9",
    "Honor 20": "https://www.techradar.com/reviews/honor-20-review"
  }
}