{
  "source": "https://www.techradar.com/reviews/acer-aspire-5",
  "title": "Acer Aspire 5 review",
  "category": "computing",
  "updated": "2020-12-11T03:16:29Z",
  "author": "matt-hanson",
  "summary": "An affordable laptop that doesn’t feel budget",
  "verdict": "The Acer Aspire 5 is a mid-range laptop that ticks pretty much all the boxes you’d want for a day-to-day laptop: it performs most tasks well, plays media fine and has a very good battery life, all for a compelling price.",
  "pros": [
    "Good battery life",
    "Up-to-date components",
    "Good build quality",
    "Decent performance",
    "Well priced"
  ],
  "cons": [
    "Cheap-feeling touchpad",
    "Screen isn’t the most vibrant",
    "Not as light and thin as other laptops"
  ],
  "article": [
    "Mid-range machines like the Acer Aspire 5 are easily overlooked. People are either going for the premium laptops that tend to dominate the headlines, or they look towards budget laptops under $500 to meet their computing demands and budget restraints.",
    "This leaves mid-range machines largely unnoticed, despite their ideal balance of price and performance that actually makes them the ideal investment for many consumers. That balance is something the Acer Aspire 5 has long practiced, offering its users with powerful components and a solid performance while keeping the price affordable and accessible.",
    "Updated with 8th-generation Intel Core processors, this more than competent laptop ticks all the boxes you’d want for a day-to-day laptop. The Acer Aspire 5 has proven once again that mid-range machines are the way to go. And, as long as your needs don't include a whole lot of video editing or designing and drafting, this might just be the best laptop for you.",
    "The Acer Aspire 5 comes in a range of configurations and price points, starting at $399 (around £300, AU$500) for the Acer Aspire 5 A515-51-3509, which comes with an Intel Core i3 7100U processor, 15.9-inch 1080p display, integrated graphics and 8GB of DDR4 RAM.",
    "In the UK, the lowest-specced Aspire 5 comes with an older Intel i3-6006U processor, 15.6-inch Full HD display and 8GB of RAM, for £469.99. In Australia, the Aspire 5 A515-51G is the cheapest model, and comes with a new Intel Core i5 8250U processor, 15.6-inch 1366 x 768 display, 8GB RAM and a dedicated GeForce 940MX graphics card.",
    "Beyond these budget options there's a huge range of Acer Aspire 5 configurations to choose from, which again vary depending on where you live, with top-of-the-line models like the Acer Aspire 5 A517-51G-8433 boasting an Intel Core i7 8550U processor, 17.3-inch 1080p screen, 12GB RAM, a HDD and SSD and dedicated graphics courtesy of an Nvidia GeForce MX150 GPU, for $999.99 (around £700, AU$1,200).",
    "The version reviewed here is the Acer Aspire 5 A515-51-50Y5, which comes with an Intel Core i5 8250U, integrated graphics, 8GB DDR4 RAM and 256GB SSD.",
    "The design of the Acer Aspire 5 is what you’d probably expect from a mid-range laptop: nothing too flashy, and not as svelte as ultrabooks such as the Dell XPS 13 or the Asus ZenBook 3. However, that doesn’t mean this is a chunky, ugly laptop. With dimensions of 2.16 x 38.16 x 26.3cm and a weight of 2.20kg (4.85 pounds), the Acer Aspire 5 is quite a large laptop, but it’s not too heavy or unwieldly to carry around. You may find it a bit of a struggle to whip out and work on a busy train, however.",
    "It’s actually quite a nice-looking, understated machine with a few design flourishes. The chassis is mainly made out of plastic, with a textured surface on the lid, along with a reflective Acer logo.",
    "Opening the laptop reveals a decent-sized screen surrounded by fairly thick bezels, which some may feel is wasted space. It does, at least, allow for a large keyboard on the bottom half of the laptop, which we’ll get to in a moment.",
    "The large bezels also mean the webcam can be positioned in the center of the top bezel, which in our opinion is the best place for a webcam to reside.",
    "The bottom bezel holds another Acer logo, and below that is the nicely-designed laptop hinge that has ‘Aspire’ engraved on it – a nice touch, we think. The hinge allows for a decent degree of adjustment of the screen at a range of angles, although this isn’t a laptop on which you can flip the screen 360 degrees backwards, into a tablet-like position – for that you’ll want a convertible laptop, such as Acer’s own Spin 7 series.",
    "The Acer Aspire 5 comes with two USB 2.0 ports, one USB 3.0, a USB-C, Ethernet and SD memory card port, giving you plenty of options for connecting peripherals.",
    "We’d have liked maybe one of the USB 2.0 ports to be another USB 3.0, but the USB-C port is definitely a welcome addition that gives you some future-proofing.",
    "The bottom half of the laptop, where the large keyboard and touchpad sit, again has a plastic surface, but it has a brushed finish that, while not as premium as aluminum, is still quite pleasant. It didn’t take it too long to pick up fingerprints, however.",
    "The keyboard itself is a nice size, which makes typing on it for long periods comfortable, although the flat keys and short travel distance mean it’s not the most responsive, or satisfying-feeling, keyboard we’ve tried.",
    "The large form factor of the Acer Aspire 5 means it can hold a rather large touchpad, which is offset slightly to the left of the center of the chassis.",
    "The large size ensures that using multi-finger gestures, such as pinching two fingers together to zoom out, is easy, although some people may find the larger size means they're more likely to accidentally rest their palm on it when typing, sending the curser flying around the screen. The touchpad also has a rather plastic and cheap feel to it when pushed, which is a shame, as the rest of the Aspire 5 manages to avoid that."
  ],
  "headers": {
    "3": "Price and availability",
    "7": "Design",
    "14": "Keyboard and touchpad"
  },
  "links": {
    "laptops under $500": "https://www.techradar.com/news/best-laptops-under-dollar500",
    "best laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Dell XPS 13": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
    "Asus ZenBook 3": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/asus-zenbook-3-1322498/review",
    "Spin 7": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/acer-spin-7-1327418/review"
  }
}