{
  "source": "https://www.techradar.com/reviews/bolehvpn",
  "title": "BolehVPN review",
  "category": "computing",
  "updated": "2020-10-20T16:07:11.995Z",
  "author": "sead-fadilpasic",
  "summary": "Expensive but safe and unblocks Netflix US",
  "verdict": "BolehVPN fits the category of an average VPN provider, considering it provides top privacy, supports P2P traffic, and unblocks access to Netflix US, but it has very few servers and is pricier than some of its competitors that have larger and more advanced platforms.",
  "pros": [
    "Unblocks Netflix US",
    "Military-grade privacy",
    "Has a free trial"
  ],
  "cons": [
    "Limited number of servers",
    "A bit expensive",
    "BBC iPlayer support isn’t guaranteed",
    "Poor customer support"
  ],
  "article": [
    "BolehVPN is a Malaysia-based VPN company that has been offering its services since 2007. It operates on a small number of servers but guarantees total privacy, support for torrenting, and access to some popular geo-restricted services like Netflix US.",
    "It is, however, limited by its lack of servers and clients for a wider array of platforms, which is why one of the best VPN services on the market might be a better fit.",
    "BolehVPN has multiple pricing options to choose from. The shortest is the 7-day plan which costs $3.70, followed by the 1-month option at $9.99, 2-month at $16.99 (equivalent to $8.50/month, 6-month at $44.99 (or $7.50/month), and the annual option at $79.99 (or $6.67/month), which isn’t very cheap.",
    "For those who’d like to see firsthand what this VPN offers, there’s a 1-day free trial which only gives access to 2-3 servers. Still, we found this to be quite enough for testing out the service. Once we registered for a free trial we also got a discount code if we pay with Paymentwall, which was a nice touch.",
    "The provider allows only three VPN connections on a single IP address at a specified time, but “you can also have an L2TP connection at the same time”. It accepts payments made in a whole range of different options, including credit/debit cards, Paymentwall, PayDollar, Yandex, MEPS, as well as Bitcoin and other anonymous cryptocurrencies such as Dash, Monero, Zcash, and Zcoin.",
    "You can request a refund within fourteen days from the activation of your VPN account. No refunds are given for services paid via cryptocurrencies although they may be considered on a case-by-case basis.",
    "BolehVPN is only an average performer but costs more than an average, which is why you want to take a look at other VPN services that provide a lot more but at a much lower price.",
    "These include NordVPN, CyberGhost, or Surfshark which is exceptionally cheap at the price of less than $2/month. If you want only the best, then you should give ExpressVPN a chance, even though it may be more expensive (it currently offers an annual plan at the same price).",
    "One of the major reasons why users get a VPN in the first place is to unblock popular VOD channels like Netflix or BBC iPlayer. BolehVPN can give you access to Netflix US with its specialized speed-optimized BolehFlix servers, although support for BBC iPlayer may currently be lacking due to more aggressive efforts by the streaming giant to block VPN platforms.",
    "This VPN company is based in an offshore location in Malaysia. However, if you check its terms of service, you’ll see that its “jurisdiction” part states “you hereby agree that the use of our services will be governed by the law of Seychelles.” Either way, you’re safe from the Five Eyes and other “Eyes” intelligence-sharing countries.",
    "If you decide to go with BolehVPN as your VPN provider of choice, you’ll get access to 35 servers strategically located in 12 countries around the world (Canada, France, Germany, Japan, Luxembourg, Malaysia, Netherlands, Singapore, Sweden, Switzerland, UK, and the US).",
    "The servers are divided into groups according to their purpose - Fully Routed, Proxied, and SurfingStreaming, each with their own advantages and disadvantages.",
    "BolehVPN uses Perfect Forward Secrecy and deploys the latest SHA-2 hashing algorithm, a 256-bit AES encryption, as well as a Public Key Infrastructure (PKI) build with a key size of 4096 bits to effectively block all attempts at intrusion. It includes another, optional layer of obfuscation technology that is able to mask your VPN traffic and prevent detection and/or blocking of VPN usage by network monitoring devices.",
    "The platform is based on the OpenVPN security protocol but also offers additional ones, like L2TP/IPsec, in case your device doesn’t support OpenVPN. Sharing large files via P2P and torrenting clients is supported and perfectly anonymous, thanks to the provider’s privacy-oriented mechanisms and location.",
    "Being a company that operates outside of the jurisdiction of the Five Eyes countries, BolehVPN isn’t obliged to store any user activity logs and it doesn’t track your Internet usage. It states it only keeps the usual system logs required to run its servers. It also says it doesn’t willingly share customer details.",
    "That said, BolehVPN admits it may turn on the logs temporarily if there’s a performance issue or it suspects a user is abusing its service. However, this is merely “a very last resort” and has happened only “a handful of times” and “for not more than a few hours” for the particular server that was experiencing abuse. Even then, none of the information was disclosed to third parties and was only used to terminate the offending user.",
    "The provider further declares its policy is to notify members whenever there’s a request for account data, “unless it is prohibited from doing so by statute or court order. In any case, as BolehVPN does not store any user-identifiable data in relation to customer's usage of the VPN, there is in any case little data that can be given over beyond the date that you paid and your payment details,” which sounds reassuring.",
    "To prove its users are protected against government subpoenas to hand over information, BolehVPN publishes a monthly warrant canary. This doesn’t have the strength of an independent audit report but is nevertheless a welcome addition.",
    "This VPN vendor supports Windows, Mac, Android, Linux, and OpenVPN-supported routers like DD-WRT, AsusMerlin-WRT, or Tomato. A customized client is only available for Windows, but other platforms are covered by configuration files and manual installation with the help of the provider’s support center. The support center and FAQ can also be reached by clicking their respective links inside the app itself.",
    "If you cannot find your answer in the support center, then you can contact customer support via web form, email, phone, at any time of day or night, and you’ll get a response as quickly as possible. This obviously means “20 hours and longer”, as we’ve been waiting for that long before giving up.",
    "The Windows app itself may look a tad overwhelming, but you’ll get used to it quickly. The download speeds varied quite a bit during our testing. We first tried connecting to a server in Frankfurt, which delivered the speeds of 13Mbps on a 74Mbps testing connection - rather slow considering it’s relatively close to our physical location, but still very usable. We then switched to Singapore, which only hailed 5.5Mbps but this is somewhat understandable due to the distance. We also gave a chance to Vancouver, which somehow managed to beat both of our previous attempts, with a fast 24Mbps.",
    "BolehVPN is an okay VPN provider that will get through the geographical blocks imposed by the likes of Netflix US. It will ensure your private data is perfectly anonymous with the use of strong encryption and the industry-standard tools which, among other things, allow you to torrent as much as you want.",
    "However, it is a bit pricey for what it offers, or rather, doesn’t offer, which is a rich server network and an advanced platform such as ExpressVPN."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "12": "Privacy and encryption",
    "18": "Support",
    "20": "Speed and experience",
    "21": "Verdict"
  },
  "links": {
    "BolehVPN": "https://www.bolehvpn.net/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "warrant canary": "http://blog.bolehvpn.net/why-your-vpn-should-have-a-warrant-canary",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-2535481149208487000"
  }
}