{
  "source": "https://www.techradar.com/reviews/rakuten-tv-review",
  "title": "Rakuten TV review",
  "category": "audio-visual",
  "updated": "2020-02-04T15:10:42Z",
  "author": "steve-may",
  "summary": "A solid way to get access to new movies without a subscription",
  "verdict": "Rakuten TV is a solid option for non-subscription Video on Demand, with many movies available in 4K HDR. However, the prices are high for day and date releases, and Dolby Vision is limited to LG screens.",
  "pros": [
    "Wide range of new movie releases",
    "4K HDR support",
    "Dolby Vision on LG TVs",
    "IMAX Enhanced on select Sony TVs"
  ],
  "cons": [
    "Can be expensive",
    "Performance is device dependant",
    "TV shows missing from smart TV apps",
    "Strong competition from Apple, Google, Amazon and Sky"
  ],
  "article": [
    "Rakuten TV is hardly a household name, but it’s an interesting alternative to Apple TV, Google Play and Amazon Prime Video. It’s a not a subscription service (sometimes called subscription video on demand, or SVOD), like Netflix, but a TVOD service (which stands for transactional video on demand), meaning you simply pay to watch whatever movie takes your fancy.",
    "Buying à la carte means you get access to hot new movies day and date with their DVD and Blu-ray release, and in some cases even sooner if a studio so chooses.",
    "The service is currently available in 42 countries, and well-funded. Headquartered in Japan, it runs a number of high-level sports sponsorships, including FC Barcelona and the NBA.",
    "Rakuten TV offers digital purchase and rentals options for all major movie releases, simultaneously with their DVD and Blu-ray counterparts. There’s also an extensive back catalogue of library titles available.",
    "Payment can be made by card or with the Rakuten Super Points loyalty scheme. Spend a quid and you’ll earn a point (with an equivalent value of 1p per point - so don’t get too excited).",
    "Pricing varies from the relatively expensive (£13.99 to buy the Joker in UHD) to impulse purchase promotions (£1.99 to rent the photorealistic Lion King).",
    "Not that you have to pay to watch everything on Rakuten TV. While its top tier titles all come with premium price tags attached, it does operate an AVOD (Advertising VOD) section, Rakuten TV Free. It’s worth signing up to Rakuten TV simply to access this gratis stuff, and you’ll easily find enough to while away a weekend or two.",
    "Rakuten TV Free features a selection of back catalogue B-movies, plus its Matchday FC Barcelona fly-on-the-wall doc, the latter available in 4K UHD. The free movies are a mix of SD and HD. James Gunn’s excellent Super is only available in standard def, but Spanish language zombie horror REC 4 Apocalypse is available to stream in both HD and SD.",
    "If you watch via a browser online, or the mobile app, you’ll also have access to TV shows from HBO, including Game of Thrones. However these are not available through Rakuten TV smart telly apps.",
    "Support for the Rakuten app on Smart TVs is wide. It’s available on the Android TV OS platform, specifically Sony and Philips TV sets, as well as on Samsung, LG, Panasonic and Hisense Smart TVs. You’ll also find the app on Roku streaming sticks, although at the time of writing, you can’t access it on Amazon Fire TV or Apple TV devices.",
    "Xbox One owners will find it in their app store, and it’s available to view in a browser. You’ll also find it on the on demand sections of Freesat and EE PVRs. The mobile app also supports Chromecast.",
    "If you want to build a list of stuff to watch, there’s a Wishlist function. Just add movies and TV shows for easy access later. Much like those operated by Netflix and Amazon, it’s a handy tool to organise your viewing.",
    "My Library stores any content you ‘buy’ or rent. Purchases are automatically saved.",
    "Navigation is basic. There’s a universal search bar, with a drop down menu that reveals genres and themed collections.",
    "Sound and vision quality can be considered above average, but also device dependent. With the right components, it’s a great source for home cinema setups.",
    "4K UHD with HDR (aka HDR10) is commonplace on new releases. Rakuten recommends a minimum 20 Mbps network connection for 4K.",
    "Rakuten also offers titles in Dolby Vision with Dolby Atmos, although these are limited to the app for LG TVs. There’s no price premium for Vision or Atmos titles above regular 4K.",
    "If you own one of a select number of Sony high-end screens, you can also stream releases that are IMAX Enhanced. The IMAX Enhanced programme uses proprietary post-production, ostensibly to give more vibrant colors and better contrast, with less image noise. IMAX Enhanced titles include Venom, Spider-Man: Homecoming, Jumanji: Welcome to the Jungle and Spider-Man: Far From Home.",
    "Multichannel sound is standard on most new releases, signposted by a Dolby 5.1 logo on the movie’s info page. Ironically, while the quality of its streams is high, the Rakuten TV interface is in low res SD, and looks decidedly grotty.",
    "If you want to stream current movies, before they head to a premium pay TV service, then Rakuten TV is a reasonable option, although Google Play, Amazon Prime and Apple TV all provide stiff and similar competition.",
    "Prices are comparable with those other digital stores, albeit sometimes a little on the toppy side. Joker, for example, is marginally cheaper to own digitally via Google Play and Amazon Prime than it is on Rakuten TV.",
    "Still, the provision of 4K HDR on many new releases gives the service a quality edge over those rivals, as well as Sky Cinema on Now TV.",
    "It’s obviously useful to have a transactional Video on Demand service to browse, in addition to SVoD offerings like Netflix and Amazon Prime Video.",
    "If you have migrated away from disc ownership, then Rakuten TV offers an early route to new movies hot from the theatrical circuit. AV fans will appreciate its support for 4K HDR and multichannel sound, too.",
    "Strong competition from Amazon, Google, Apple and Sky, along with top tier pricing, prevents Rakuten TV from being a must have service. Apple offers 4K Dolby Vision and Dolby Atmos streams for the same kind of loose change, and if you’re prepared to wait a few months, hot titles can be viewed for less on other platforms. The proposition is also uneven, limiting Dolby Vision and Dolby Atmos to LG screens, and IMAX Enhanced content to Sony TVs, while TV shows are only available to buy online and through its mobile app.",
    "Thanks to solid studio support, Rakuten boasts a good choice in first run movies. If you don’t own Apple TV, it’s arguably the next best 4K source for these early releases outside of buying a disc.",
    "It’s less attractive when it comes to catalogue content, although the odd bargain price stream does surface. Overall, we think Rakuten TV is well worth considering, if only to take advantage of its free movie selection."
  ],
  "headers": {
    "3": "Content and cost",
    "9": "Devices and compatibility",
    "11": "Features",
    "14": "Image quality",
    "19": "Value",
    "22": "We liked",
    "24": "We disliked",
    "25": "Verdict"
  },
  "links": {
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k",
    "Amazon Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Game of Thrones": "https://www.techradar.com/news/house-of-the-dragon",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "Roku streaming sticks": "https://www.techradar.com/reviews/roku-streaming-stick",
    "Amazon Fire TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-fire-tv-1314169/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Chromecast": "https://www.techradar.com/reviews/chromecast-ultra-au",
    "Now TV": "https://www.techradar.com/reviews/audio-visual/av-accessories/now-tv-1192011/review"
  }
}