{
  "source": "https://www.techradar.com/reviews/aoc-u32u1",
  "title": "AOC U32U1 review",
  "category": "components",
  "updated": "2020-09-10T17:13:57Z",
  "author": "mike-jennings",
  "summary": "Stunning Porsche design paired with 4K ambitions",
  "verdict": "The AOC U32U1 is superb in the sRGB colour space, has a good range of features and stunning design, but it’s weaker in Adobe RGB and HDR colour spaces plus it’s expensive too.",
  "pros": [
    "Fantastic, Porsche-powered design",
    "Superb sRGB ability",
    "Loads of adjustment options",
    "Good selection of ports",
    "Easy to use and navigate"
  ],
  "cons": [
    "Underwhelming Adobe RGB and HDR performance",
    "Some awkward design decisions",
    "Expensive",
    "Disappointing speakers"
  ],
  "article": [
    "The AOC U32U1 is the result of a collaboration between the monitor company AOC and Studio F.A. Porsche – the design house offshoot of the famous car firm. On the outside, that means a bold aesthetic, and on the inside this screen has been built to appeal to designers and creatives who want a top-notch 4K panel.",
    "It’s not cheap though, thanks to a price of $1,075 (£825, around AU$1,480). Can this panel possibly justify the expense?",
    "When a monitor arrives with design by Studio F.A. Porsche, it’s worth paying attention. And, true to form, the AOC U32U1 looks impressive. Its stand is a three-pronged tubular construction with rounded corners, and it looks far better than any conventional display. The cylinders aren’t too big, either, so it’s easy to position the AOC while leaving space for cables, peripherals and speakers.",
    "The display has slim bezels on all four sides, which is rare for a screen – the bottom bezel is usually thicker because that’s some internal hardware is located. AOC and Studio F.A. Porsche have doubled-down on the slimline look by installing the screen slightly proud of the rear casing.",
    "The slim bezels mean the display’s supporting hardware is all installed into a separate box at the rear. It’s a compact and good-looking design decision, and a metal cylinders surges up from the base into the rear of this box to hold everything together.",
    "There’s no doubt about it – this is a fantastic-looking screen, and it’ll impress anyone who wants a display that goes beyond what usual office and design panels offer.",
    "The bold design is paired with a specification that takes aim at high-end creative tasks. It’s a 4K display with a 32in diagonal, which means a density level of 138ppi. That’s high enough to provide crisp detail as well as plenty of on-screen real estate for multiple windows, and the only realistic way to get something sharper is to use a 27in 4K panel.",
    "The AOC U32U1 is an IPS display with 10-bit colour, which is where any colour-sensitive work panel should start. AOC claims that it covers 100% of the Adobe and sRGB colour gamuts and 98% of the HDR-friendly DCI-P3 colour space – so it should be versatile.",
    "It’s a good start, but there are some areas where the specification is more middling. The 60Hz refresh rate is fine for creative work and day-to-day use, but it means that you won’t get the smoother experience provided by 120Hz or 144Hz – this may be more important if you work with animation or video.",
    "The AOC U32U1 is certified for use with DisplayHDR 600, but this is a mid-range protocol that only delivers a minor boost to HDR content. If you need to work in this colour space, a DisplayHDR 1000 or HDR10-certified device would be better.",
    "The rear serves up two HDMI connections, with one supporting the faster 2.0 protocol, alongside a DisplayPort 1.4 socket. There are two USB 3.2 Gen 1 ports that support 5Gbps transfers and a USB-C port that provides charging and DisplayPort compatibility. It’s a shame that those full-size USB ports aren’t faster – ports with 10Gbps and 20Gbps transfers are available. The ports all face downwards, so they’re tricky to reach, and the AOC also doesn’t have a card reader.",
    "Build quality is inconsistent. The stand is robust and its movement is smooth, but the rear of the display has too much flex and the panel is flexible around the edges – undoubtedly due to the gap between the bezel-free panel and the rear casing. The gap around the display could easily become a dust magnet, too, and there’s no cable-management – disappointing on such an otherwise-elegant bit of kit.",
    "The AOC U32U1 is easy to use – it arrives ready-assembled. The on-screen display is large, fast and well-organised, with all of the appropriate options. It’s navigated with a snappy joystick.",
    "There’s a reasonable amount of movement, too. The U32U1 swings into portrait mode, and it’s got a decent 4.7in (about 120mm) of height adjustment alongside 22 degrees of tilt and 80 degrees of left-to-right swivelling. It’s also compatible with 100mm VESA mounts.",
    "Out of the box the AOC U32U1 has middling quality levels, with decent contrast and colour temperature undermined by a mediocre Delta E of 2.42.",
    "Switch to sRGB mode and the AOC U32U1is far better. Its Delta E of 0.68 is fantastic, the colour temperature of 6,554K is top-tier, and the average gamma of 2.14 is reasonable. These statistics are good enough to deliver accurate colours. The brightness level of 294cd/m2 is good enough for design work, and the black point of 0.25cd/m2 is decent. Those latter figures combine for a contrast ratio of 1,176:1 – another solid figure. It could be better, but the contrast level is good enough to deliver great depth, nuance, and vibrancy without becoming oversaturated.",
    "The AOC U32U1’s sRGB mode is its best option, especially when bolstered by superb volume and coverage levels of 143% and 99.7%. Elsewhere, the AOC’s cool and warm options hamper colour quality for sensitive work tasks, and the DCB Enhance setting is oversaturated and underwhelming.",
    "Head beyond sRGB and the AOC U32U1 falls short. Its Adobe RGB volume level of 98.1% is decent, but it only covered 84.5% of the colour space, so it’s not good enough for working in that space.",
    "It’s middling in DCI-P3, where it returned volume and colour figures of 100.8% and 97.1%. Those figures are good enough to enable HDR-based work, and the panel’s HDR peak brightness of 638cd/m2 exceeds DisplayHDR 600’s requirements, but HDR mode’s black level of 0.33cd/m2 isn’t good enough and delivers an HDR contrast ratio of 1,933:1. That’s not bad, but it’s a long way short of the contrast, brightness and nuance provided by a screen with stricter HDR standards and more robust dimming technology.",
    "Don’t expect much from the pair of two-Watt speakers either. They have moderate volume, but the top-end is tinny, and the mid-range is muddy. They’re only good enough for basic media duties.",
    "There’s no shortage of alternatives when it comes to decent 4K displays these days, and there are options if you’d like to save some cash or spend a little more than the AOC U32U1.",
    "It’s easily possible to shave at least $100 (£100, about AU£100) off the AOC’s price and find a 4K panel with the same specification and sRGB ability. If you want to spend the AOC’s budget on a new panel, you’ll be able to find displays with similar colour ability alongside more features and better refresh rates.",
    "The AOC isn’t good enough to handle proper high-end work in the Adobe RGB or DCI-P3 spaces; at this resolution you’ll have to spend more to get that ability. Adding a couple of hundred pounds or dollars to the price will deliver a screen that can handle Adobe RGB, even if it doesn’t look as stylish.",
    "There’s no denying that the AOC U32U1 is expensive – that’s literally the price to be paid for getting a monitor that looks this good.",
    "The design is top-notch, though, and the AOC U32U1 is fantastic for sRGB colour spaces thanks to solid contrast and great colour accuracy. If you’re interested in photo or design work in that colour space, the AOC delivers. It’s got decent features, including USB-C, and solid adjustment.",
    "Be aware, though, that it’s not as good in the Adobe RGB or DCI-P3 colour spaces, and that it has design quirks alongside middling build quality and a high price.",
    "Ultimately, the AOC U32U1 looks great and does a top-notch job with sRGB colour spaces, but it’s not the best or best-value option if image quality is your top priority."
  ],
  "headers": {
    "2": "Design",
    "6": "Hardware",
    "12": "In use and performance",
    "20": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "AOC U32U1": "https://eu.aoc.com/en/monitors/u32u1"
  }
}