{
  "source": "https://www.techradar.com/reviews/microsoft-flight-simulator",
  "title": "Microsoft Flight Simulator review",
  "category": "gaming",
  "updated": "2020-08-17T14:27:41Z",
  "author": "matt-hanson",
  "summary": "We have lift off",
  "verdict": "Microsoft Flight Simulator is clearly a labor of love, with a realism and attention to detail that will make this an essential purchase for flight sim fans. Using cutting edge technology and graphics for the ultimate immersive experience, this isn’t a game that’s going to be for everyone, but if you’re its core demographic, you’re going to love it.",
  "pros": [
    "Incredible graphics",
    "Superb attention to detail",
    "Great peripheral support"
  ],
  "cons": [
    "Difficult for beginners",
    "Range of editions is confusing",
    "Not all airports are created equal"
  ],
  "article": [
    "If you’re reading this review, it’s about 98% likely that you already know whether Microsoft Flight Simulator is for you or not. While the Flight Simulator series isn’t Microsoft’s most exciting of games (for the mainstream, at least), it’s easily one of its most successful, and dating back to 1982, it’s also its oldest.",
    "While the subject matter is a little dry – it aims to realistically replicate the experience of flying various aircraft – the latest version, known simply as Microsoft Flight Simulator, is a fantastic example of why this series is so revered. By combining graphics and features that give us a tantalizing glimpse of the future of video games, it also has a fantastic chance to win over mainstream gamers who may have dismissed earlier Microsoft Flight Simulator entries.",
    "So, we’re talking about stunning graphics and innovative features – such as mapping the entire world using Bing maps – as well as real-time weather and traffic, that are about as close to ‘next-gen’ as you can get right now. For fans of the series, and simulator games in general, the new Microsoft Flight Simulator offers a dramatic generational leap that will define the genre for years to come.",
    "It's not just for hardcore fans, either. The game is hitting Xbox Games Pass for PC on launch day, and is coming to Xbox Series X in the future, with many feeling that Microsoft should have included it in its recent games showcase to really show off what its new console will be capable of, rather than the roundly-mocked Halo Infinite showing we got instead. This means people who may not have considered the game, and certainly don’t have the expensive peripherals needed to get the most out of it, may be inclined to give it a go, too.",
    "That was the position we found ourselves in when reviewing Microsoft Flight Simulator. While we’ve dabbled in simulation games in the past, and even previous versions of Flight Simulator, we didn’t think we’d be the target audience for the game.",
    "However, after several hours, long flights and some embarrassing crashes, we’ve come to appreciate the game on a technical level, and loved it on a far more emotional one. Let’s explain.",
    "If you’re considering buying Microsoft Flight Simulator then there are some important things you need to know. First of all, there are three versions of the game that are available, and that can make picking the best one for you a bit tricky.",
    "So, for $59.99/£59.99/AU$99.95 you get the Standard version, which comes with 20 planes and 30 hand-crafted airports (the rest are basic models).",
    "Then there’s the Deluxe edition for $89.99/£79.99/$139.95. This adds five more planes and five more airports.",
    "Finally, there’s the Premium Deluxe edition that adds 10 additional planes and 10 more airports – as well as all the extras that came with the Deluxe version. That costs $119.99/£109.99/AU$139.95.",
    "As you can see, it can get quite expensive falling down the Flight Simulator rabbit hole, and we’d only recommend the Premium Deluxe edition to flight sim connoisseurs – there’s more than enough content in the Standard edition for beginners.",
    "In fact, what makes the Standard edition a bit of a no brainer for anyone remotely interested in the game is that it is launching on Xbox Game Pass for PC – a subscription service from Microsoft that gives you access to over 100 PC games while you’re subscribed.",
    "There’s currently an offer where you can get your first month for $1 / £1 / AU$1 – after which it’s $4.99 / £3.99 / AU$4.95 a month. That means you could try out Flight Simulator for just $1 – and a month of it will be more than enough time to know if it’s the game for you. If it is, keep subscribed or buy the game as a standalone. If not, cancel your subscription and you’ve only spent $1.",
    "If that $1 price seems too good to be true – then there is a catch. While Microsoft Flight Simulator can be played with a keyboard and mouse, or game pad, to get the full experience, we really recommend getting some extra peripherals – and that can quickly become expensive.",
    "To review Microsoft Flight Simulator, we were sent the Logitech G Flight Simulator Yoke System with Throttle Quadrant and Thrustmaster TPR Pendular Rudder, both of which are hard to buy at the moment (the Microsoft Flight Simulator hype is real, kids). But when they are in stock, they are a couple hundred pounds/dollars each. And while you don’t necessarily need them, we really recommend them (or something similar). It helps with the immersion immensely.",
    "If you’re already a flight sim fan, then you’ll likely have the equipment already, and it should be compatible. Microsoft Flight Simulator does an excellent job of detecting the peripherals you plug in and configuring the controls to match – including images of the peripherals so you can see which button does what.",
    "But, if you’re coming into Microsoft Flight Simulator with no existing peripherals, expect to pay a lot of money – and only do so if you know you’re going to be playing this game a lot.",
    "If you don’t want to (or can’t) invest a lot of money in peripherals, we’d still recommend getting at least a gamepad – keyboard and mouse controls just don’t cut it. We played it with the Xbox One controller on our PC, and while it wasn’t as realistic as using a flight yoke, throttle and pedals, it was playable, and for beginners it may even prove to be an easier way to get into the game, as you’re not having to learn new control methods as well.",
    "So, as a beginner, how is the experience? To be honest – it can be very baffling, with a lot of information (and jargon) thrown at you. There are a number of tutorials that you really should complete first.",
    "Although the co-pilot can get a bit annoying (relentlessly chirpy, even when you’re careening into a canyon), it takes you through the basics. Without it, you’ll be completely lost.",
    "These tutorials aren’t perfect – they still assume a level of knowledge about flying that means if you don’t have it, you may just sit there staring blankly at your screen. While the tutorials tell you what buttons to press, sometimes they don’t give you simple instructions. By neglecting to tell us what button starts the engine, we sat on a runway for about 30 minutes trying to get the damn plane moving. If we’d had passengers, they’d have rioted by then.",
    "You often get a checklist to complete each tutorial, but sometimes you’re not told how to check those off, just a vague instruction.",
    "This can be confusing and frustrating at first, but trust us and stick with it. You’ll find you need to learn things yourself, even if it means delving into the settings menu. We also ended up remapping certain keyboard controls (such as starting the engine and lowing landing gear) from the keyboard to the Logitech Flight Yoke. This meant we didn’t have to have the keyboard near us or learn any complex shortcuts, as the Yoke and throttle come with plenty of buttons.",
    "A bit of tweaking allowed us to have a setup that was much easier to use. And, while flying in Microsoft Flight Simulator can at first start off overwhelmingly confusing, that first time you successfully take off and safely land is hugely rewarding. You actually feel like you’re starting to learn a new skill – which you essentially are.",
    "It makes it all worthwhile, and it’s that real sense of progression that lets this game get its hooks into you. After our first successful flight, we left the game and all we could think about was getting back into the cockpit.",
    "So, by the end of the tutorial, you’ll be ready to fly and raring to go. However, the learning doesn’t end there. Once you’re making your own flight schedule (you can take off and land at pretty much any airport in the world), you can choose your aircraft. Each one is meticulously replicated in the game, which means each cockpit – and the instruments it uses – is different. It means you then have to relearn a lot every time you switch.",
    "This is not a game for people who aren’t able to commit some serious hours to learning its ins and outs.",
    "Perhaps the biggest selling point of Microsoft Flight Simulator is its realism. We mentioned the interiors of the planes, and it really is impressive. Once when flying, we looked out of the side window and saw how the setting sun cast realistic shadows over the interior material of the cockpit.",
    "Also, as your plane climbs higher you’ll see frost begin to form on the windows. As you descend, the frost melts and the water streams off the glass. This is seriously impressive stuff, and the smallest details help immensely with the overall immersion of the game.",
    "The fact that Microsoft has used information from its Bing maps service to realistically include the entire planet is an absolutely fantastic idea, and it really pays off, as you’re able to fly pretty much anywhere, and if you’re familiar with the location, you can navigate by landmarks. All while the graphic engine does an amazing job of rendering everything in photo-realistic quality. We’re not kidding – this really looks next-gen in places.",
    "A fast internet connection is essential for this game, as it needs to stream in a lot of data. There are also some big updates to download before you start – we had to download an additional 95GB before we could begin.",
    "So anyone on a slow or capped internet connection will struggle to run this game, unfortunately. However, the always-connected nature of this game is justified, we think. It also pulls in traffic information and weather reports, so you can fly in realistic conditions wherever you choose to play.",
    "Of course, you can also set the time of day and weather conditions. We really need to call out the weather system in this game. It is stunning. Flying through a storm is thrilling thanks to the realistic graphics and sound (the sound design throughout is brilliant, including sounds and warnings from your aeroplane), while sunsets can be genuinely breathtaking.",
    "Combine that with peripherals and a good monitor (we used an ultra-wide monitor, which adds to the immersion), and you get one of the most engrossing and realistic sims ever made. Virtual reality support is coming later as well, and we can’t wait to try that out.",
    "While Microsoft Flight Simulator is certainly an experience, is it actually fun? It’s a funny thing, really. Sometimes it feels overly stressful and confusing, and when you’re trying to land a plane while an instrument you’ve never seen before is blaring an indecipherable error message, you might not feel like you’re having fun.",
    "And while the weather system is fantastic, taking off or landing in fog (or at night) when you can’t see anything, isn’t much fun either. But it does produce a reaction in you.",
    "It’s the same when flying long distance. There will be hours you spend flying somewhere, and once you’re at cruising altitude, there’s not much to do. So you just sit and watch the world go by, clouds form and disappear, or the sun climb an empty sky. While that might not be fun, it’s certainly relaxing.",
    "In fact, you can find yourself going into a zen-like state that other sims, like Farming Simulator or Truck Simulator, evoke. Let’s be honest, with everything that’s going on these days, the world can sometimes feel a dangerous and stressful place to be. When playing Microsoft Flight Simulator, you get a chance to escape that.",
    "We found that many of our day-to-day worries (that good old background hum of anxiety) melted away when flying above the clouds, carefully adjusting the throttle or trims. We’re not sure if it’s by accident or design, but Microsoft Flight Simulator is actually pretty therapeutic.",
    "But, again, does that mean it’s fun? In the pure-flight sim mode, it’s certainly entertaining and challenging, but maybe for a lot of people it won’t be fun.",
    "However, there are additional modes, such as challenges, that are for more like traditional games. For example, there are landing challenges where you need to safely touch down in some of the most unique and dangerous airports in the world. The better the landing, the higher the score, and there are global scoreboards that pit you against pilots from around the world.",
    "Meanwhile, multiplayer mode places players – as well as real-life air traffic – all in one giant map. While it’s not quite the hectic fragathon many people expect from a multiplayer game, it’s one of those games where players can make their own fun together, setting each other challenges or just doing a bit of virtual tourism. And those experiences can prove to be far more memorable.",
    "If you’re one of the 2% who didn’t know if Microsoft Flight Simulator was for you before reading this review, hopefully you now know. If you’re a flight sim fanatic who wants realism in almost every aspect of their sim, this is for you.",
    "If you love planes and love flying, and would relish the chance to fly iconic vehicles in some of the most beautiful – and dangerous – locations and conditions in the world, then this is for you.",
    "And, if you’ve never played a flight sim before, but want to start, and are intrigued by the stunning graphics and innovative features, then this certainly could be for you as well – but if there’s any doubt, maybe try it out on Xbox Game Pass for PC first – you only have $1 to lose.",
    "Also, if you don’t have time to learn complex control methods, and are after faced-paced, quick endorphin hits in games, then look elsewhere.",
    "While the $1 entry fee for Game Pass is tempting, this kind of game still needs investment, be it in peripherals to get the most out of it, or decent high-end specs in your gaming PC to cope with the graphics. That high-speed internet connection is a must, too.",
    "If you’re someone who thinks this game is just what you’re after, then we can’t recommend it highly enough. It’s easily one of the best sim games ever made, and it’s a promising glimpse of the future of games – for all genres."
  ],
  "headers": {
    "6": "Preparing for lift off",
    "18": "Learning to fly",
    "27": "A stunning simulation",
    "34": "But is it fun?",
    "42": "Verdict"
  },
  "links": {
    "Xbox Games Pass for PC": "https://www.techradar.com/how-to/how-to-set-up-xbox-game-pass-for-pc",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite"
  }
}