{
  "source": "https://www.techradar.com/reviews/lenovo-flex-5g",
  "title": "Lenovo Flex 5G review",
  "category": "computing",
  "updated": "2020-09-03T15:55:27Z",
  "author": "john-loeffler",
  "summary": "The world's first 5G laptop gives a middling debut performance to a nearly empty theater",
  "verdict": "The Lenovo Flex 5G's only justification for its price tag is almost entirely irrelevant at the moment and its ARM CPU lags badly behind its Intel and AMD rivals in terms of performance and compatibility, making it very hard to recommend at this time for anyone but enthusiasts and early adopters.",
  "pros": [
    "Integrated cellular network connectivity",
    "Stellar battery life",
    "Lightweight and portable",
    "Sleek design"
  ],
  "cons": [
    "5G connectivity is all but nonexistent right now",
    "Possibly deal-breaking app compatibility issues",
    "ARM CPU doesn't come close to Intel or AMD CPU performance",
    "Stylus not included"
  ],
  "article": [
    "The Lenovo Flex 5G is clearly designed with a very specific user in mind and its hardware is built to cater to some very specific needs.",
    "The Flex 5G is a 2-in-1 laptop for those who just need a laptop that can access the internet without disruption, run productivity apps for papers or projects, and can transition quickly into a tablet for note-taking, filling out forms, or reading documents - all while lasting a very long time away from a power outlet.",
    "Lenovo manages to deliver on every one of these goals thanks to an under-powered ARM CPU running Windows 10 and a Snapdragon X55 5G network connection that draws much less power from the standard lithium-ion battery. That means its battery life is in a class entirely on its own, easily doubling that of its rivals. Nothing else comes close.",
    "On the flip side, the Flex doesn't come close to competing with laptops running the latest Intel or AMD processors in terms of performance, getting absolutely blown out by its rivals on our CPU benchmarks. To be fair, it isn't meant to compete, since it's not trying to be a high-end desktop replacement or a robust mobile workstation.",
    "The Qualcomm Snapdragon 8cx CPU can competently manage nearly all of the general classroom or business tasks that you'd expect without too trouble, which is perfectly fine for the majority of users, which is why Lenovo goes with the under-powered ARM processor for the Flex 5G.",
    "This does open it up to some very important - and possibly deal-breaking - problems with app compatibility. The Lenovo Flex 5G may be running Windows 10, but that doesn't mean it can run every Windows 10 app.",
    "It can handle the basics like Microsoft Office, Google Chrome, and similar, but it will not be able to run more advanced 64-bit, x64 Windows apps like Adobe Photoshop - at least not until those developers release updated apps for ARM processors. This is going to be a major source of frustration for a lot of people, sadly.",
    "Ultimately, in a world where schools haven't moved to remote-/home-learning, where there are still a lot of business travelers needing always-on internet or a single battery charge that can last them through an entire 18-hour international flight, and the highly-anticipated 5G rollout was actually underway throughout North America and Europe, things would be different.",
    "In that universe, the Lenovo Flex 5G would be the perfect 2-in-1 laptop for students, business travelers, and other non-creative professionals. Unfortunately, we are in a different timeline thanks to Covid-19, so the Lenovo Flex 5G is built for a consumer base that barely exists right now and isn't likely to come back for some time.",
    "If you are a student still attending in-person classes, an international business traveler who is still actively globe-trotting despite the pandemic, or you're lucky enough to live, work, or study in one of the few cities in the world - or even just a city block - where there is consistent and active 5G infrastructure in place, then you should definitely consider buying the Flex 5G.",
    "Otherwise, it'll probably be another year at least before purchasing this laptop will make sense to anyone else, especially considering its premium price tag, performance, and compatibility issues.",
    "The Lenovo Flex 5G comes in only one configuration and is available now for a steep $1,399 (about £1,070/AU$1,955). It can be purchased either from Lenovo or from Verizon, which also provides the laptop's cellular service and so far remains the only cellular provider in North America to do so.",
    "This is one of the other major sticking points with the price tag. In order to access Verizon's 5G network, you will need a monthly data plan. At release, the unlimited 5G data plan offered by Verizon runs about $90 a month. Other markets are likely to have similar data access costs that need to be factored in when considering the price of the Flex 5G.",
    "So, on top of the expense of buying the laptop itself, add the potential recurring monthly cost of the 5G service and the price of the Flex 5G can start to quickly soar.",
    "Another thing to factor into the cost is the fact that the Flex 5G is not upgradeable - not even the RAM, which is soldered onto the mainboard. The specs aren't great to begin with, so its much more likely to be obsolete in a much shorter time frame than other laptops, even with the 5G connectivity.",
    "The design of the Lenovo Flex 5G is one of its main selling points as far as we're concerned. The gray aluminum chassis has a definite minimalist appeal to it and the size and weight of the laptop is very manageable.",
    "At nearly three pounds, it definitely isn't the lightest we've ever reviewed, but it is still light enough to toss in a bag and take it with you without any trouble. In fact, given its battery life, you can safely leave the charger at home and shed some extra weight, something other competing laptops can't quite do just yet.",
    "A lot of this extra weight comes from Qualcomm's 5G antenna, so there isn't much to be done, ultrabooks are just going to be a little heavier going forward once 5G starts becoming a standard feature for laptops.",
    "The keyboard is a decent size for a 14-inch laptop and the keys are responsive, as is the decently sized trackpad. The keys are a bit shallow, however, and they don't offer much in the way of feedback so you know that you're actually hitting the keys as you go.",
    "Still, they're adequately spaced so we didn't get too many errant keystrokes while we used it and we adjusted to the layout pretty quickly.",
    "The touchscreen is fine as far as that goes, though unlike some of its competitors, it does not come with a stylus, so unless you want fingerprints all over the screen, you'll need to buy one separately.",
    "The sound from the Flex 5G is decent as far as laptops go, due in large part to its upward facing speakers next to the keyboard.",
    "In a world where downward-facing speakers plague the ultrabook class as a whole, its nice to see one break away from that and provide for reliable sound quality.",
    "In keeping with its minimalist design, the Flex 5G has only 3 ports, a switch, and a power button. The two USB Type-C ports on the left (one doubles as the laptop's charger) balance out the headphone jack, the airplane mode switch, and power button on the chassis's right side.",
    "The webcam is a standard 720p HD laptop webcam, situated on the top of the display in the upper bezel, and really isn't anything to write home about. Speaking of bezels, they're there and they're noticeable, but they aren't the worst we've seen.",
    "Where the Lenovo Flex 5G really suffers is in its performance. The Flex 5G isn't Lenovo's first ARM-powered Windows laptop, but it definitely demonstrates that the whole Windows-on-ARM concept has a long way to go before it matches its execution with its ambition.",
    "There are two main issues that really drag the Flex 5G down here: performance and compatibility. First, for performance, the Snapdragon CPU scored a pretty unimpressive 698 single-core score and a 2,661 multi-core score on our Geekbench 5 benchmark.",
    "For comparison, two other 2-in-1s we've recently tested were the Acer Spin 5 and the Asus Vivobook Flip 14, which were powered by Intel Core-i7 Comet-Lake and a AMD Ryzen 7 4000-series CPUs, respectively.",
    "On the same Geekbench 5 benchmark, the Spin's single-core and multi-core scores (1,223 and 3,798) are nearly twice as fast as the Flex 5G's, while the Flip 14's single core score of 674 under-performs the Flex 5G's Snapdragon CPU while the Flip's multi-core score of 3,861 blows well past the Flex.",
    "We'd love to compare its 3DMark scores to the Flip and the Spin's, but here we ran into the other major - and possibly deal-breaking - problem with the Flex 5G's performance. There are simply some programs that the ARM-powered Flex cannot run, including several of our benchmark tests.",
    "The Snapdragon CPU is a 64-bit processor, but ARM64 apps are not the same as x64 apps on Windows. While the Snapdragon processor can use emulation to run 32-bit x86 Windows apps, it cannot do this with x64 Windows apps, and not ever program comes in 32-bit and 64-bit versions.",
    "Microsoft has 32-bit versions of all of its consumer software, so running Microsoft Office locally isn't a problem, but Adobe is only available as an 64-bit, x64 app on Windows.",
    "As a result, You would need to go back and run an older, 32-bit, no-longer-supported version of Photoshop if you wanted to use it on your brand new 2-in-1, or find an alternative photo editing program that will run on an ARM processor.",
    "Finding out what is and what is not compatible is not easy at a glance, and many shoppers might buy software they cannot run even though it's a Windows program running in Windows. It's an extra layer of complexity to using the computer that is bound to confuse and frustrate users that will probably never be fully fixed.",
    "For the kind of money you're spending on this laptop, this should absolutely not be a the kind problem that you should have to deal with.",
    "The other outstanding performance issue with the Flex 5G isn't a problem with the Flex itself, but the environment it's coming into. For years, device manufacturers and telecom companies have been preparing to roll out the next generation of cellular network technology, known as 5G.",
    "The hype around 5G is real - it really will provide the kinds of speeds and bandwidth that it has long promised - but the necessary infrastructure still isn't available even in the top markets for these kinds of upgrades like New York City or London.",
    "There are several reasons for this, with two of the biggest being the U.S.-China trade war disrupting the availability of the underlying tech that 5G is built on, and the coronavirus pandemic grinding global economic activity to a halt for months - including the manufacture and installation of 5G network infrastructure.",
    "There was no way Lenovo could have predicted the latter, even if they could arguably predict the former. In either case, the years long development cycle for the Flex 5G meant that it was built based on the assumption that the world would be ready for it when it arrived.",
    "Quite simply, nothing is ready like it was supposed to be and the 5G roll out that the Flex was banking on probably won't get back on track for at least a several more months, if not another year entirely. As a result the best the Flex can offer is an always-on cellular connection to the current 4G LTE network, which is already at capacity and significantly slower than 5G.",
    "The 5G coverage in New York City is block-by-block - and scarce at that - so the usefulness of the Flex 5G's flagship feature is basically nil even in one of the biggest markets for 5G there is.",
    "Where we were able to get 5G service, the Flex 5G performed well, getting upwards of 300 MB/s when downloading and 50 MB/s on uploads. There were still some issues, though, as these speeds weren't consistent, with some tests getting download speeds as low as 60 MB/s and upload speeds of just 10 MB/s.",
    "This isn't so much an issue with the Flex 5G itself as it is with the 5G network as it exists right now. It will be a while yet before these issues work themselves out.",
    "Unfortunately, for the vast majority of consumers who may not see 5G coverage in their area for two to three years - or longer, if they live outside a major metropolitan area - it will be several years before they'll see the kind of 5G performance that would justify spending this much money on a laptop this under-powered and with the kind of compatibility issues that come with ARM CPUs right now.",
    "This is one area where the Lenovo Flex 5G indisputably destroys the competition.",
    "The best performing ultrabooks get somewhere between nine and 12 hours of battery life during our HD movie benchmark. Thanks to the lower-powered CPU and other hardware power advantages, Flex 5G gets a staggering 29 hours and 21 minutes of continuous video on a single charge.",
    "Nothing else comes close, which offers a glimpse into what could have been possible with the Flex 5G had history taken a different turn. With a successful 5G rollout and the only coronaviruses we'd have to worry about being the flu or recurring colds, the Flex 5G could have been a truly game-changing laptop."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Price and availability",
    "15": "Design",
    "25": "Performance",
    "44": "Battery life",
    "47": "Don't buy it if..."
  },
  "links": {
    "2-in-1 laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-2-in-1-laptops-top-5-hybrid-laptops-reviewed-1258451",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}