{
  "source": "https://www.techradar.com/reviews/monoprice-dark-matter-34",
  "title": "Monoprice Dark Matter 34 review",
  "category": "computing",
  "updated": "2020-12-02T19:40:17.626Z",
  "author": "mark-knapp",
  "summary": "34 inches of high-value display",
  "verdict": "The Monoprice Dark Matter 34 offers a shocking value. All of its features add up to a product that doesn’t face much competition at its price point. Though it is a little utilitarian, the bright, smooth panel makes it easy to look past a few nitpicks.",
  "pros": [
    "Serious value",
    "Premium specs",
    "Brilliant visuals"
  ],
  "cons": [
    "Some fiddly settings",
    "Utilitarian design"
  ],
  "article": [
    "The Monoprice Dark Matter 34-inch curved gaming monitor is a bit of stunner. That’s thanks in part to its combination of specs and sticker price. Monoprice may be known by few, but those who know of it likely know it for its affordable products. At just $499 (£405, about AU$699), the Monoprice Dark Matter 34 is just such a product, and it enters a rare field of affordable ultrawide gaming monitors.",
    "That low price doesn’t mean it has no competition. It runs against more mainstay competitors. The $450 (£450 about AU$640) AOC CU34G2X is a near match for gamers, but it misses out on Monoprice’s extra color depth and brightness. Similarly, the Gigabyte G34WQC makes the same trade-off on color depth to reach a $399 (£399, AU$679) price point. Meanwhile, there’s no shortage of much more expensive monitors like the AOC Agon AG352UCG6 Black Edition or MSI Optix MPG341CQR that don’t offer much more on paper.",
    "Considering Monoprice's price, we’d expect a few trade-offs, but a quick glance at the specs sheet shows little in that regard. A 34-inch panel is at the heart of the monitor, and it delivers a 3,440 x 1,440 resolution, 10-bit color depth, DisplayHDR 400, a 144Hz refresh rate with FreeSync support, and (perhaps most exceptionally) a Quantum Dot layer. When we first heard about it, it sounded a little too good to be true, but it actually holds up in testing.",
    "Monoprice may have made this monitor cheaper by dodging any huge advertising campaigns, and the back of the monitor is a rather simple plastic affair. It doesn’t mess around much in the world of fancy RGB lights (though there is a micro USB dongle in the box that shines the Dark Matter logo down from the monitor and a red glowy ring at the back), and you won’t find any speakers built in. The stand even comes across as fairly simple despite including height, angle and tilt adjustment, as well as a handy hole for cable routing. Only the OSD and hardware buttons really highlight the budget nature of this display, but then we just turn the monitor on.",
    "All it takes is a single DisplayPort 1.4 connection to enjoy all this monitor has to offer. Playing through the Call of Duty: Modern Warfare Halloween event, we’re able to enjoy the wide display and sharp visuals, helping us keep track of our surroundings and see enemies in the distance. While our teammates complain about how dark the game mode is, making the zombies extra scary, we have a fairly easy time seeing details in the dark without the visuals feeling washed out. And, though FreeSync support is all Monoprice mentions, we have no trouble running G-Sync.",
    "In Overwatch, the brighter colors and fast action shine through wonderfully. Even though this monitor isn’t boasting a 1ms response time, it feels plenty responsive when we need to snap onto a target. We also don’t notice any issues with pixel overshoot like we have on some overdriven display panels. The only foible is an occasional flicker when our frame rate drops below 60fps (something we’ve strangely only noticed at the start of matches in Overwatch).",
    "HDR is a welcome albeit tedious in Windows 10. It can leave some screens unusually dim (notably, the character selection screen in Rainbow Six Siege). And, depending on how it’s calibrated, it can see light shades of gray blend in with white. While doing work, we find the peak brightness of the display is often almost too bright, so toggling off HDR and setting the display to Photo mode has been easier on our eyes for general use.",
    "The Monoprice Dark Matter 34 also turns out to be an excellent option for enjoying video content. Watching Enola Holmes and both Blade Runner films, the 21:9 aspect ratio made an excellent home for the video. The picture was also outstanding. The VA panel’s ability to achieve deep black levels also kept the black bars at the side of 16:9 from being a distraction.",
    "Though the Monoprice Dark Matter 34 offers 99% coverage of the sRGB color space and 90% of DCI-P3, we’d stick to gaming and entertainment on this display. The curvature and VA panel show a little shift in brightness and color when we move our head around, so we wouldn’t rely on this display for critical color work on photos, video, or design."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Don’t buy it if…"
  },
  "links": {
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "ultrawide gaming monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "AOC CU34G2X": "https://www.techradar.com/reviews/aoc-cu34g2x",
    "AOC Agon AG352UCG6 Black Edition": "https://www.techradar.com/reviews/aoc-agon-ag352ucg6-black-edition",
    "MSI Optix MPG341CQR": "https://www.techradar.com/reviews/msi-optix-mpg341cqr"
  }
}