{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-10t-lite",
  "title": "Xiaomi Mi 10T Lite review",
  "category": "phones",
  "updated": "2020-11-24T17:17:37Z",
  "author": "andrew-williams",
  "summary": "The cost of 5G phones continues to tumble",
  "verdict": "The Xiaomi Mi 10T Lite is an accomplished, great value phone, with a surprisingly premium build, a big battery, and a high-spec screen, but the competition from rival Realme is fierce and there are issues with the camera.",
  "pros": [
    "Self-assured glass back design",
    "Large battery",
    "Pleasant 120Hz screen"
  ],
  "cons": [
    "Camera feels sluggish",
    "Major problems in the 2x zoom mode",
    "Better gaming performance elsewhere"
  ],
  "article": [
    "The Xiaomi Mi 10T Lite brings 5G to the masses. Its base model starts at a truly budget price, and there are only a few signs that this is a ‘cheap’ phone.",
    "Xiaomi uses glass on the back instead of the plastic you might expect at this price, and the screen is large and has a smooth-scrolling 120Hz display panel. The Xiaomi Mi 10T Lite even has enough power to play Fortnite at a fairly solid 30fps.",
    "For many, the Xiaomi Mi 10T Lite is a much more sensible buy than a high-price phone, including Xiaomi’s own Mi 10T.",
    "One of the big issues here though is that Xiaomi has arguably already made something better, the Xiaomi Poco X3 NFC. That phone has slightly better battery life, a faster camera, a better ultra-wide camera, and a lower price.",
    "That said, the Xiaomi Mi 10T Lite’s design is classier and it’s slightly thinner. It has a marginally better chipset too, although real-world benefits are not life changing.",
    "We’re talking about a battle between two top buys here, so you're unlikely to regret buying either. The Xiaomi Mi 10T Lite only has two grating issues. Its main camera is slow to shoot and some bizarre things start happening when you snap photos at 2x. Head to the camera section of this review to find out more.",
    "The Xiaomi Mi 10T Lite starts at £229 (around $305 / AU$415). That nets you the version with 64GB of storage and 6GB of RAM.",
    "You’ll pay £299 (roughly $400 / AU$540) for the Xiaomi Mi 10T Lite with 128GB of storage. While we love high storage phones, this upgrade does not seem a particularly good deal. The entry-level Xiaomi Mi 10T Lite gets you the most tech per dollar.",
    "It's out now in the UK, with no word on if or when we'll see it in the US or Australia.",
    "Xiaomi does not mess about with its budget phones. For a while now producers of cheaper phones have made more use of plastic rather than glass or metal, but the Xiaomi Mi 10T Lite has a Gorilla Glass back, not a plastic one, which should be enough to put a smile on your face when you first pick the phone up.",
    "Toughened glass feels better than plastic made to look like glass, and is less prone to scuffs from light contact. The Xiaomi Mi 10T Lite’s sides are plastic, but you can’t expect a big-brand phone to eject plastic entirely at this price.",
    "Buy a Xiaomi Mi 10T Lite expecting a big phone. Its screen is as large as that of a top-end handset, and at 9mm thick it's not as slim as some, likely to make room for the big battery. A very expensive phone might have a curved glass front to make it feel smaller, but Xiaomi can’t afford such tricks at this price.",
    "The Xiaomi Mi 10T Lite’s dimensions are similar to the Xiaomi Poco X3 NFC’s, it’s just a tiny bit thinner. But it looks far more reserved. The rear comes in plain grey or blue, or a more eye-catching rose gold to green gradient. As you can see here, the plain shades have a low-key style you might expect from OnePlus. From the back this could easily be a top-end phone.",
    "Look closer and you’ll see a few more signs that it's not one, but they are not all negatives. The Xiaomi Mi 10T Lite has a headphone jack. Gold star for Xiaomi. And a side-mounted fingerprint scanner rather than the more popular in-screen kind.",
    "A week of using the Xiaomi Mi 10T Lite is a reminder that these side scanners are really no worse than in-screen ones. What matters most is how fast and accurate they are. This one is both fast and reliable.",
    "The speakers are excellent in this class too. There’s a driver down on the bottom of the phone and another on the front, above the screen. These provide stereo sound with good volume and enough mid-range bulk to make podcasts sound right. Oddly, the Poco X3 NFC seems to have firmer mids still, but that is probably just down to slight changes in the phone’s internal layout.",
    "The Xiaomi Mi 10T Lite has a 6.67-inch 2400 x 1080 LCD screen. A 120Hz refresh rate is the highlight here.",
    "High refresh rate screens are big news in 2020, and mean the screen image changes up to 120 times a second rather than 60. It makes the Android app menu seem to scroll more smoothly, and can reduce motion blur.",
    "However, you don’t get quite the same kind of uncanny smoothness here as in a more expensive 120Hz OLED phone. Why? The perception of smoothness is also affected by the response rate of a screen’s pixels, and this LCD’s ones are only moderately quick. This means there is slight motion blur with high-contrast moving objects, like icons on a black background.",
    "On a few days we switched to 60Hz without really missing 120Hz smoothness, but largely because the Xiaomi Mi 10T Lite still looks pretty smooth at this setting.",
    "Color, contrast, and maximum brightness are all very good at the price too. This is a wide color gamut display that supports HDR and looks sharp.",
    "Consider changing the wallpaper when you first boot up the phone, though, as it really does not show off the Xiaomi Mi 10T Lite’s commendable contrasty punch. The wallpaper you see here isn’t the default one.",
    "The Xiaomi Mi 10T Lite has a little punch-hole for the front camera, and while there is some slight variance in brightness around the hole and at the corners when viewing a full white display, it’s nothing unusual.",
    "Displaying a full white screen at 100% brightness our SpyderX colorimeter registers peaks of 540cd/m. While only half as bright as something like the iPhone 12 Pro, this is an excellent result at the price and makes the Xiaomi Mi 10T Lite comfortable to use on sunny days even when composing photos.",
    "The Xiaomi Mi 10T Lite has five cameras, four on the back and one up front. Only one of these cameras is particularly good, which is no surprise for a budget phone, but it also exhibits some issues.",
    "This main sensor uses the 64MP Sony IMX682 sensor and an f/1.89 lens. Let’s start with the good parts.",
    "The Xiaomi Mi 10T Lite can shoot some gorgeous images in daylight. Detail is respectable and Xiaomi’s dynamic range algorithms do their work on almost every outdoor scene, lifting detail out of the shadows without going too far and flattening tones too much.",
    "Fine detail does not appear as natural as a Google Pixel 4a image down at pixel level, but after transferring a few hundred images to a MacBook Pro to have a better look, there were a good number of shots that made us sit back and think \"that’s a nice-looking image\".",
    "This tells us Xiaomi’s image processing has reached a good level of maturity even for its lower-end phones.",
    "Actually shooting with the Xiaomi Mi 10T Lite is another story. This phone exhibits too much shutter lag, significantly more than the very similar Poco X3 NFC. Xiaomi may be able to fix this with a software update, but right now the camera is slower than most in its class.",
    "Some even stranger things start happening when you use the 2x zoom mode. The Xiaomi Mi 10T Lite does not have a zoom camera, so it takes a crop of the 64MP (which is really designed to be used as a 16MP camera) and uses a slightly different processing approach to make the photo look less like a digitally zoomed image.",
    "Shoot a static subject and it works well. You get perfectly passable shots. But the Xiaomi Mi 10T Lite falls apart as soon as there’s motion in your subject. Try to take a 2x picture of a moving dog or a plant gently swaying in the breeze and the elements in motion will appear much lower resolution.",
    "It’s as if parts of the image have been blurred out by a TV producer. And it's not just blur. You can see aliasing on diagonals.",
    "The good part of this is that it proves Xiaomi clearly does more than just taking a crop of the main view. The bad bit: it doesn’t work.",
    "Again, hopefully it will be fixed with an update.",
    "Ultra-wide Xiaomi Mi 10T Lite shots often have the same high dynamic range charm as those of the primary camera. But in a direct comparison with the Poco X3 NFC’s ultra-wides, shadow detail and detail in general are better in that sister phone. This is no great surprise. The Xiaomi Mi 10T Lite has an 8MP ultra-wide, the Poco a 13MP one.",
    "The other two cameras, a macro and depth assist, suck. As long as your subject is static you are much better off using the 2x view for close-up macro shots. And the Portrait mode, which adds background blur, makes a mess of complicated scenes.",
    "Night photos are okay, but no better than we’d expect from a phone in this category. The Realme X50 5G takes better low-light images.",
    "Video is also typical for this class. The Xiaomi Mi 10T Lite looks good at 1080p, 30 frames per second, with solid stabilization and good image quality. However, there’s no EIS at all at 1080p/60fps or 4K, rendering these settings useless unless you’ll be still or will apply stabilization with editing software in post.",
    "The Xiaomi Mi 10T Lite's selfie camera uses a 16MP OmniVision ov16a1q, which Xiaomi also put into the Redmi Note 9S. It actually shoots 4MP images, but by doing so it holds onto fine detail rendering until the light level gets very low.",
    "Xiaomi uses the Qualcomm Snapdragon 750G processor in the Mi 10T Lite. This sounds like a watered-down version of the Snapdragon 765G, the first great processor that made 5G accessible. But it isn’t in all respects.",
    "It uses newer CPU cores, still supports 5G, and has eight cores, just like the 765G and the 732G used in the Poco X3 NFC.",
    "In Geekbench 5, a CPU-heavy test, the Mi 10T Lite beats both the Poco X3 NFC and Realme X50 5G. It scores 1,931 points (643 per core) to the Realme’s 1,846 (604 per core) and the Poco’s 1,755 (563 per core).",
    "Their GPUs are different, though. The Realme X50 5G has the Adreno 620, the Mi 10T Lite the Adreno 619, and the Poco X3 NFC the Adreno 618.",
    "And here, the performance is more in-line with those names’ numerical values. Xiaomi blocked all the best GPU-testing apps in our review sample: 3D Mark and GFX Bench would not work. Thanks, Xiaomi.",
    "We can’t be stopped that easily, though. We dug into the dirt to find a slightly ropey Unity-based benchmarking tool called GPU Mark. It’s a very basic test made to scrape out some ad revenue cash, but it still works for testing basic 3D rendering capabilities.",
    "The Xiaomi Mi 10T Lite scores 1,003,200 points. The Realme does significantly better, with 1,254,000 points. Xiaomi’s Poco X3 NFC brings up the rear with 775,200 points.",
    "With this in mind, we'd rank the Xiaomi Mi 10T Lite’s Snapdragon 750G in line with Qualcomm’s naming system. It’s not as good as the Snapdragon 765G, but is better than the Poco X3 NFC’s Snapdragon 732G.",
    "In practice, it performs perfectly well. Fortnite runs at ‘Mid’ graphics, at a mostly-solid 30fps apart from occasional moments of slow-down as it loads new textures.",
    "However, the Realme X50 5G is still miles better for Fortnite. It will play the game at ‘Epic’ visuals, 30fps, and does so well.",
    "The Xiaomi Mi 10T Lite has a 4,820mAh battery. That is a chunk less than the 5,160mAh of the Poco X3 NFC, perhaps because Poco phones are made for a more enthusiast, nerdy crowd than the Mi range.",
    "Sure enough, battery life seems marginally worse than the Poco’s, but is still easily long enough to satisfy. A full day of reasonably hard use with the 120Hz display mode sees the battery last until almost midnight before it hits zero.",
    "This included a lot of web browsing, representative of much more than ‘moderate’ use. It easily beats phones like the Samsung Galaxy Note 20 for stamina.",
    "If you want a two-day phone, we’d suggest dropping down to 60Hz. We have never got the Xiaomi Mi 10T Lite to last near to two days - we use our phones too much for that - but at 60Hz we tend to have 30-45% left by bedtime.",
    "The Xiaomi Mi 10T Lite has 33W charging just like the ‘non Lite’ 10T phones, which gets you from flat to 63% in 30 minutes. Not bad at all at the price.",
    "First reviewed: November 2020"
  ],
  "headers": {
    "6": "Xiaomi Mi 10T Lite price and availability",
    "9": "Design",
    "16": "Display",
    "24": "Camera",
    "40": "Specs and performance",
    "50": "Battery life",
    "55": "Don't buy it if..."
  },
  "links": {
    "Mi 10T": "https://www.techradar.com/news/xiaomi-mi-10t-release-date",
    "Xiaomi Poco X3 NFC": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Redmi Note 9S": "https://www.techradar.com/reviews/xiaomi-redmi-note-9s",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review"
  }
}