{
  "source": "https://www.techradar.com/reviews/hurdlr-expense-tracker",
  "title": "Hurdlr expense tracker review",
  "category": "computing",
  "updated": "2021-02-17T17:53:19.991Z",
  "author": "rob-clymo",
  "summary": "Take care of all your expenses and more besides with Hurdlr",
  "verdict": "From everyday expenses through to filing your taxes, Hurdlr’s Premium edition does a little bit of everything to great effect and for small beer..",
  "pros": [
    "Free version",
    "Excellent app",
    "Easy to use"
  ],
  "cons": [
    "Free version lacks options"
  ],
  "article": [
    "Hurdlr has grown from being an expense tracking app that appeals to the likes of freelancers, realtors, hosts, drivers and couriers into a software solution that appeals to users right across the business spectrum, just as long as you’re based in the US or Canada.",
    "While it’s used by a lot of individuals there is now an Enterprise edition of the app, which is aimed at companies who need to keep track of employee expenses. With its automated workflow tools and real-time status updates Hurdlr allows all sorts of people to keep on top of their expenses. Despite the onset of coronavirus there's the ability to track every overhead, such as mileage costs and then also link transactions to financial accounts.",
    "Alongside a free edition, the other paid-for options in the Hurdlr portfolio make it an affordable solution for all types of workers. Competitors to Hurdlr include QuickBooks, Rydoo, Expensify, Pocketguard and Zoho Expense.",
    "There’s a chance to explore Hurdlr for free before you need to buy it, which is a great way to check out its charms. If you like what you see there’s a Premium edition of Hurdlr, which you can upgrade to at any time from the free version.",
    "Premium is currently priced at $5 a month, billed annually. It’s $8 per month if you prefer to work on a month-by-month basis. Hurdlr also comes in a Pro edition, which is $10 per month and is billed annually with no monthly payment option available.",
    "Company owners might also want to explore the options delivered by the Hurdlr Enterprise model, for which you’ll need to contact the company to get more details, depending on the size of your business and its requirements.",
    "Hurdlr comes with a raft of features, although if you plump for the free edition then you’ll get a minimalistic experience that’s short on the sort of tools available in the paid-for editions. Hurdlr therefore explains that going free is best for part-timers and those with side-gigs. Or the curious perhaps.",
    "A better bet is to head straight for the Premium version, which covers plenty of expense and mileage tracking territory. You get unlimited auto-mileage tracking, auto expense tracking, auto income tracking along with real-time calculations for State and self-employment taxes, all of which makes it undeniably practical.",
    "The Pro version delivers the same as Premium, but adds in full double entry accounting, invoicing and delivers advanced reporting too, so for the slightly larger monthly outlay you get quite a lot in return.",
    "You shouldn't get much in the way of problems running the app edition of Hurdlr on your phone as it’s been put together very well indeed. Put it alongside the desktop package that runs via your browser and you’ve got a pairing that’s ideally suited for the time poor who want a lively, dynamic software solution. In fact, Hurdlr is so sprightly it might turn tackling your expenses into an enjoyable experience, which is saying something.",
    "With its fresh and funky design Hurldr gets off to a great start when you're first setting it up. A new user can sign up initially via a browser-based route that takes you through a few simple steps with one-click options to answer.",
    "But the really good stuff happens within the app, which has been very nicely executed. It looks great, works a treat and runs in tandem with the desktop operation, so the whole Hurdlr package seems ideally suited to both novice users and seasoned company professionals.",
    "The Enterprise edition will doubtless go down well with employees too, who often find the task of keeping track of business expenditure an annoying distraction to their daily workflow activities.",
    "While Hurdlr is generally a breeze to install and use there might be the odd occasion where a visit to the support station could be needed. Thankfully, Hurdlr has done a solid job with its help center hub, which contains all sorts of useful tips, tricks and advice for getting you head around all of the features and functions.",
    "Of particular use are the instructional videos, which give you a real hands-on look at core features, and these answer quite a lot of common questions very nicely. If none of that sizeable selection of content suffices then Hurdlr also features an in-app chat capability, plus there’s a support email too.",
    "Hurdlr is impressive and deserves to hit a wider audience, rather than the one that’s currently limited to the US and Canada. With a range of attractive pricing plans, plus that free version that lets people try out the basic range of features, Hurdlr is suitable for all sorts of users.",
    "Once you’ve equipped yourself with the paid for version, especially the Premium edition, you’ll have a killer selection of power tools at your disposal from more basic considerations such as mileage auto tracking and automatic categorization of your many and varied expenses through to real-time tax estimates, reminders and even the ability to file your taxes and send reports to your CPA."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Performance",
    "10": "Ease of use",
    "13": "Support",
    "15": "Final verdict"
  },
  "links": {
    "Hurdlr": "https://www.hurdlr.com",
    "expense tracking": "https://www.techradar.com/best/best-expense-trackers",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-pro",
    "Rydoo": "https://www.techradar.com/reviews/rydoo-expense-tracker",
    "Expensify": "https://www.techradar.com/reviews/expensify-budget-manager",
    "Pocketguard": "https://www.techradar.com/reviews/pocketguard",
    "Zoho Expense": "https://www.techradar.com/reviews/zoho-expense-budget-manager",
    "Premium": "https://www.hurdlr.com/pricing",
    "Pro edition": "https://www.hurdlr.com/pricing",
    "Enterprise": "https://www.hurdlr.com/pricing",
    "tax estimates": "https://www.techradar.com/best/small-business-tax-software"
  }
}