{
  "source": "https://www.techradar.com/reviews/myfax",
  "title": "MyFax review",
  "category": "computing",
  "updated": "2020-04-15T15:47:15Z",
  "author": "alex-mcomie",
  "summary": "Mediocre efficiency and security at an inflated price",
  "verdict": "MyFax lacks any noteworthy features that would differentiate it from the competition, and it charges higher rates than many other online fax services.",
  "pros": [
    "24/7 customer support",
    "Mobile app on both iOS and Android"
  ],
  "cons": [
    "Higher prices than some competitors",
    "Questionable security measures"
  ],
  "article": [
    "Fax machines aren’t as common as they used to be, but businesses in a variety of industries still rely on them for communication. Fortunately, you no longer need a fax machine to send and receive faxes—the best online fax services make it easy to view, edit, and send faxes from your desktop or computer.",
    "In our MyFax online fax review, we’ll examine the program’s capabilities and help you determine whether it’s the right choice for your business. While MyFax offers email to fax support and other helpful features, its lackluster toolkit and high prices make it a less practical option for most use cases.",
    "MyFax is currently available at three price points: Home Office ($10 per month), Small Business ($20), and Power ($40 per month). The service also offers custom Corporate subscriptions for larger businesses.",
    "Home Office supports up to 100 sent and 200 received pages per month. With Small Business, the limit on sent pages to 200, although there aren’t any additional features. Finally, Power users can send and receive up to 400 pages each per month, for a total of 800.",
    "MyFax provides basic tools for online faxes, including the ability to send faxes through your computer, tablet, or smartphone. You can select a local, toll-free, or international number. The service supports up to 50 recipients per fax.",
    "It’s easy to send documents using your existing email client, and teams can use as many as five email addresses on the same account. Furthermore, MyFax provides more than 100 templates for professional cover pages.",
    "While you can store documents locally, MyFax also offers lifetime online storage. The fax archive is available in My Account under View Faxes.",
    "When you get started with MyFax, you’ll be asked for basic information including your location, name, phone number, and email address. The platform will let you choose from available fax numbers, but you can also transfer an existing fax number if you’d prefer. You’ll have to enter a credit card number even if you’re signing up for a free trial.",
    "After creating an account, you’ll be redirected to MyFax Central. From here, you can view and send faxes, adjust preferences, or access support resources. The FAQ offers thorough guides for sending and receiving faxes through MyFax.",
    "While MyFax Central provides everything you need to send and view faxes, the site itself has a relatively basic design. That said, it’s easy enough to use, and we didn’t encounter any issues while testing out the service.",
    "Fortunately, the mobile app looks and functions significantly better, and it offers the same features that are available on the website. Remember that you can also send faxes directly from your email client rather than going through MyFax. Faxes should arrive within a few seconds of being sent as long as you have a decent connection.",
    "Unfortunately, MyFax doesn’t provide much information about its security practices or any options to protect your account and data. While the website claims that MyFax “offers more privacy and security than traditional fax machines,” it doesn’t reference any specific measures except for delivering faxes directly to email inboxes and “limiting unintended access to faxes.”",
    "Additionally, MyFax is missing support for two-factor authentication, a critical tool for account security. Considering what other electronic fax platforms offer, the lack of meaningful security measures is a major downside.",
    "MyFax offers comprehensive help resources to help you get the most out of the application. If you run into any issues, check the Support page for FAQs, user guides, and how-to videos explaining various MyFax features.",
    "Along with email and phone, MyFax is one of the few internet fax services to offer live chat support. With 24/7 availability, you should be able to get an answer at any time of the day. MyFax Corporate users gain access to a dedicated support team.",
    "The drawbacks of MyFax are clear when compared to similar services. The Power plan, for example, costs $40 per month for 400 sent and 400 received pages (800 total). However, Fax.plus offers 800 combined monthly pages for just $19.99 per month, half the cost of a comparable MyFax subscription.",
    "Price isn’t the only area where MyFax falls behind. The Fax.plus interface is significantly more modern, and Fax.plus offers Slack integration, a Google Chrome extension, electronic signatures, team management for administrators, and other critical features.",
    "MyFax offers a number of notable benefits including email to fax, 24/7 support, and a fully featured mobile app. That said, there are also some glaring omissions that make it a less attractive option. For example, the service doesn’t offer two-factor authentication, and there’s no information about encryption or other security features.",
    "Furthermore, MyFax charges more than some competitors for the same number of pages without providing any unique or innovative tools. While it gets the job done for sending faxes online, it’s neither the most powerful nor the most cost-effective option."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features and utilities",
    "7": "Setup",
    "9": "Interface and performance",
    "11": "Security",
    "13": "Support",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "Fax machines": "https://www.techradar.com/news/best-fax-machines",
    "best online fax services": "https://www.techradar.com/best/best-online-fax-service",
    "tablet": "https://www.techradar.com/news/best-business-tablets",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "online storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "credit card": "https://www.techradar.com/best/best-credit-card-processing-service",
    "security": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Fax.plus": "https://www.techradar.com/reviews/faxplus",
    "Slack integration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "electronic signatures": "https://www.techradar.com/best/best-esign-software-solutions"
  }
}