{
  "source": "https://www.techradar.com/reviews/oculus-go",
  "title": "Oculus Go review",
  "category": "wearables",
  "updated": "2020-10-19T09:47:48.320Z",
  "author": "michelle-fitzsimmons",
  "summary": "The headset that will take VR mainstream",
  "verdict": "Oculus Go marks a new era for VR, one in which anyone can simply slip on a headset and dive into virtual realms. Though not perfect, it offers a comfortable fit, solid build, excellent visuals and the promise of more great content to come. For the price, Oculus Go gives it's tethered older brother Oculus Rift a run for its money.",
  "pros": [
    "Experience is almost as good as Oculus Rift",
    "Minimal screen-door effect",
    "Premium device for an affordable price"
  ],
  "cons": [
    "Sits heavy on the face",
    "Light comes through the bottom",
    "Battery-to-charge-time ratio isn’t ideal"
  ],
  "article": [
    "Update: Oculus Go is no longer the sole standalone VR headset from Oculus. Oculus Quest 2 launched in 2020, and it boasts PC-quality virtual reality in an untethered headset. It's the best option if you want standalone VR right now.",
    "Original review continues below...",
    "Oculus Go is, in many ways, the dawn of a new era in virtual reality (VR). It’s a standalone device, meaning it’s finally cut the cord from the PC needed to run its older and more powerful brother, the Oculus Rift.",
    "It’s also, of course, done away with the smartphone. You won’t be slotting anything into the Oculus Go except your face when you slip on the plush headset.",
    "For Facebook, which owns Oculus, Oculus Go represents a brand-new way to experience VR. The company calls Oculus Go the most approachable VR product on the market, and it’s not wrong in that the headset lets you step into VR with little setup and no expensive PC requirements, all at a reasonable price.",
    "As a piece of VR hardware, the experience on hand with Go is almost as good as the Oculus Rift. You won’t mistake one for the other, but we have been continually impressed with how good Go’s VR is, especially considering everything needed to run the headset is contained in a little gray box that sits on your face.",
    "Looking beyond the nuts and bolts of what you get in the Oculus Go package, this headset represents a turning point for VR.",
    "This is VR for the casual gamer, the relaxed consumer of media, the person without the time, money or interest in setting up a PC to power a higher-end headset. This is VR for everyone.",
    "Does this mean people will suddenly start buying Oculus Go in droves, frenzied because they can finally buy a headset anyone can use? No, not by a long shot.",
    "But, the potential is there for word of mouth to spread, for individuals to try a Go on in a store (Best Buy in the US is setting up in-store Oculus Go demo stations) and think, ‘Yes, this is something I can get into’, for parents and peers to buy one as a gift for birthdays or Christmas for less than the price of other headsets.",
    "No, the new VR revolution won’t happen overnight, but Oculus Go signals that it’s coming, and fast.",
    "The Oculus Go price has been permanently reduced; the 32GB Oculus Go will now cost $149 in the US, a reduction of $50 from its original $199 / £199 / AU$299 launch price.",
    "The 64GB model has also been reduced from $249 / £249 / AU$369 to $199 in the US, with both models to be given \"comparable discounts in every country where the Go is available\".",
    "While prices in other territories are still to be confirmed by Facebook, it looks like UK buyers can get their hands on the 32GB Oculus Go for £139, and the the 64GB model for £189 from Amazon.",
    "As soon as you take Oculus Go out of the box, you feel like you’re holding a device that costs $199 / £199. Its design is sleek and has some nice subtle touches; the front panel is a slightly different shade of gray in certain lights, for example.",
    "The straps are soft and adjustable, though it’s always a bit awkward adjusting and cinching down a VR headset by yourself when you’re wearing it.",
    "And, though the headset feels secure on your head, we could feel it sliding up at times, causing us to push the headset back down or otherwise readjust it.",
    "Once on, Oculus Go feels incredible on the face. The plush inner lining is soft and pillowy yet has an airiness to it as well. Oculus said it consulted with the garment industry in making the Go, and this is apparent in the headset’s premium comfort feel.",
    "As for wearing the device, it’s important to point out two things. One is that a fair amount of light seeps through the bridge of the nose.",
    "Some people are really bothered by light leakage in VR as it breaks the immersion. Other users are able to ignore it after awhile, or are otherwise not too perturbed by it.",
    "We tended to oscillate between the two ends of the spectrum; at times the light seeping through was distracting, and at others we were so caught up in a game we forgot it was there.",
    "It’s hard to say how individual users will respond to light leakage, but know that it is present in the Oculus Go.",
    "The second point to note about wearing Oculus Go is that its weight distribution is very much in the front. It rests right on your upper cheekbones, and once you’ve worn it for awhile, an achiness starts to set in, like you’ve been holding a smile for too long.",
    "We have yet to find a headset that has perfected weight distribution. Of the premium headsets on the market, the HTC Vive has done the best job, so far, in minimizing it.",
    "Oculus Go, which, remember, houses everything you need to run VR right inside the box that sits on your face, may have a very forward weight-distribution, yet all-in-all it’s a comfortable headset that feels good to wear.",
    "One neat trick Oculus Go pulls off is how it integrates audio. Instead of building in headphones, like the HTC Vive Pro, the Go’s plastic arms have slits that house the speakers, and this design feature helps the headset maintain its cohesive profile.",
    "Oculus Go also includes a 3DoF controller. The controller feels good in the hand, and, in fact, we prefer it over the Google Daydream View and Samsung Gear VR controllers for its ergonomic design and responsive controls.",
    "You won’t experience the same level of immersion with the Oculus Go controller as you will the Oculus Touch, the controllers that come with Oculus Rift, however.",
    "With Touch, your hands are brought into VR, and the controllers track your hand as well as arm movements.",
    "This isn’t the case with the Oculus Go controller; it’s not much more than a point-and-click remote, though it can move around in the virtual space, and it does so quite faithfully.",
    "In an Oculus Go game called Coaster Combat, you use the controller like a pistol to shoot at and collect coins. The controller felt intuitive here, and we were quickly caught up in the task (helping us to forget the light leakage, for one thing).",
    "It’s games like Coaster Combat where the Oculus Go controller shines because it goes beyond simply selecting things and becomes a part of the virtual world you’re seeing before your eyes."
  ],
  "headers": {
    "11": "Price and release date",
    "14": "Design"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/news/oculus-go-everything-you-need-to-know-about-the-oculus-standalone-headset/reviews/oculus-quest-2-review",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "The Oculus Go price has been permanently reduced": "https://www.techradar.com/news/oculus-go-price-permanently-slashed-to-impulse-purchase-amount",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "HTC Vive Pro": "https://www.techradar.com/reviews/htc-vive-pro",
    "Google Daydream View": "https://www.techradar.com/reviews/daydream-view-2017",
    "Samsung Gear VR": "https://www.techradar.com/reviews/samsung-gear-vr-2017",
    "Oculus Touch": "https://www.techradar.com/reviews/oculus-touch-controller"
  }
}