{
  "source": "https://www.techradar.com/reviews/corsair-hs70bt",
  "title": "Corsair HS70BT review",
  "category": "computing",
  "updated": "2020-12-18T22:36:57Z",
  "author": "mark-knapp",
  "summary": "When one connection won’t do",
  "verdict": "The Corsair HS70 Bluetooth is a sleek and sturdy headset, and it’s great if you need two audio connections at once, otherwise it’s flanked by better options right in Corsair’s own product stack.",
  "pros": [
    "Sturdy design",
    "Three connections",
    "Brilliant mic"
  ],
  "cons": [
    "Subtle interference",
    "Niche"
  ],
  "article": [
    "Corsair is keeping the alterations on the same gaming headset coming with the Corsair HS70 Bluetooth. Don’t be fooled by the name, though. This is a wired headset that also features a Bluetooth connection that can run concurrently with the wired connection for dual audio sources.",
    "This dual-audio trick is one we’ve been seeing more of recently, with the SteelSeries Arctis 3 Bluetooth being the first gaming headset we can remember offering it. The difference here is that Corsair has made it a more affordable feature while maintaining its high bar for build quality.",
    "The Corsair HS70 Bluetooth is $99 (£99, AU$179), which actually sees it pitted right up against the SteelSeries Arctis 3 Bluetooth. It’s also about the same price the Corsair charges for the Corsair HS70 wireless gaming headset and its successor, the Corsair HS70 Pro. Those two headphones predictably feature a near-identical design, but use a 2.4GHz wireless dongle for a latency-free gaming connection. They also include surround sound, something the HS70 Bluetooth supports but doesn’t include.",
    "The Corsair HS70 Bluetooth has a design that comes from a higher class of peripherals. It has solid metal yolks to hold it’s subdued-yet-exciting earcups. The grille on the outside of the earcups isn’t functional, but it’s a step up from a flat plastic backing.",
    "The headband and ear cups feature matching, faux-leather coverings in the same pitch black as the rest of the headset. Two yellow accents – one around the microphone port and one hidden where the size adjustment sliders live – remind us that this is a Corsair product.",
    "In terms of connectivity, there are two primary options: 3.5mm or USB. The headset comes with braided cables for both. The included USB-C port on the headset is great to see, and also slightly recessed in the earcup, giving it some protection.",
    "The left earcup is home to most of the ports and controls with a volume wheel, mic mute toggle, USB port, 3.5mm jack, and microphone jack. The Bluetooth power button is on the right earcup. The microphone jack holds the microphone securely in place, while the arm itself is incredibly flexible and includes a pop filter.",
    "That microphone is one of the headset’s most impressive features. It captures our voice with exceptional clarity. It’s better even than what we’ve seen from the Sennheiser GSP370 and as good as any ClearCast microphone from SteelSeries. With Corsair’s iCue software, Sidetone is also available along with control of the microphone volume.",
    "The rest of the audio experience can simply be described as decent. Using the USB-A-to-C cable, the headset offers a hi-fi audio support with a 96kH/24-bit resolution. That comes in handy when cranking tunes or gaming, but we wouldn’t rely on it for professional audio. This headset is susceptible to some noticeable interference even while connected via USB (we can actually hear faint radio signals coming through). It’s subtle and easily drowned out, but it makes the headset unreliable for creative work.",
    "It’s a shame, because the thick cushions make the headset quite comfortable for a $100 headset. During intense gaming sessions, they can get a bit hot though, as the leather-like material is not very breathable. On the plus side, the lack of surround sound didn’t present much of an issue, as the quality audio and stereo separation was good enough to pick out enemy directions in Rainbow Six Siege and Call of Duty Warzone quite easily. This headset can really boom, though, easily to the point of pain, so balancing the sound requires some care.",
    "All told, the experience is good, but not great. And, for many, the wireless offering of the Corsair’s other HS70 models may have more appeal."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don't buy it if..."
  },
  "links": {
    "gaming headset": "https://www.techradar.com/news/computing-components/best-pc-gaming-headset-1322675",
    "SteelSeries Arctis 3": "https://www.techradar.com/reviews/steelseries-arctis-3-bluetooth",
    "Corsair HS70": "https://www.techradar.com/reviews/corsair-hs70-wireless-gaming-headset",
    "Sennheiser GSP370": "https://www.techradar.com/news/sennheiser-gsp-370-is-a-comfy-wireless-gaming-headset-with-a-100-hour-battery-life"
  }
}