{
  "source": "https://www.techradar.com/reviews/cdburnerxp",
  "title": "CDBurnerXP review",
  "category": "computing",
  "updated": "2020-09-15T08:25:27Z",
  "author": "binay-gupta",
  "summary": "Burn CDs, DVDs, and Blu-rays for free",
  "verdict": "While CDBurnerXP may not have any advanced functions, it comprehensively covers all the essential aspects of creating CDs, DVDs, and Blu-rays, plus it’s a free app to boot.",
  "pros": [
    "Great range of formats supported",
    "Also supports disc spanning",
    "Useful help on tap",
    "It’s free"
  ],
  "cons": [
    "Can’t be used to create DVDs from video files",
    "Interface takes some getting used to"
  ],
  "article": [
    "CDBurnerXP is a veteran piece of disc burning software, having been around since 2003. Despite its name, the program does not have any relation with Windows XP – thankfully – and neither are its functions limited to merely burning CDs.",
    "While CDBurnerXP is freeware, it is a closed source program as it uses certain proprietary libraries. There are several options for installation packages, including a portable version that can be put on a USB stick.",
    "CDBurnerXP supports burning data on DVD-RW, DVD+R, DVD+RW, CD-R, CD-RW, DVD-R, and HD DVD formats. It also allows the burning of audio files like FLAC, Windows Media Audio, AIFF, WAV, MP3, MP2, FLAC, BWF (Broadcast WAV), Opus, and Ogg Vorbis in the Red Book format. The program features an integrated audio player that allows users to check tracks as they go along. Additionally, ISO images can be burnt and created through CDBurnerXP, along with ISO-9660 and UDF formats. It also supports bootable data discs.",
    "CDBurnerXP’s support for disc spanning makes it a perfect tool to back up data manually. However, while one can create both audio and video discs, there is only a single choice available for producing video DVDs – namely by burning Video_TS folders to disc. Taking a video file and converting it into a playable DVD is not possible with CDBurnerXP.",
    "CDBurnerXP’s interface is not very intuitive. It can be somewhat overwhelming for inexperienced users working on the program for the first time. The app’s Help option is useful in helping users acclimatize, though, and find their feet with its various features.",
    "CDBurnerXP’s overall interface may look a bit dated, but users will typically find it smooth sailing once they get used to navigating the program. Launching the program opens up a screen for project selection. However, this does not initiate a selection of wizards, like many other programs. It merely provides a subtle on-ramp to any burning session the user might want to carry out.",
    "Users can work with its Explorer-style interface for creating a data disc. They may even use the program’s drop-zone to drag-and-drop the needed files. Creating an audio CD is also uncomplicated, and so is the procedure required for creating or burning ISO files and copying discs that have already been burned. You can also erase a rewritable disc.",
    "All the functions mentioned above are separately handled through distinct panels. This ultimately turns out to be a competent method as users can put their full focus on the relevant task in hand.",
    "The panel used for burning data or creating ISO images in CDBurnerXP features an interface similar to Explorer, as we’ve mentioned. It provides swift access to the folders and files stored on the computer. Users can also ascertain additional details about these files here.",
    "The panel’s drag-and-drop support can be used to build a list of items that the user wants to burn and to add folders. It can also be used to remove chosen files, specify the number of copies, and view the approximate amount of space remaining on the disc.",
    "Users can also switch to a minimalistic window that provides the number of files and directories on the disc and other key details.",
    "Multiple burning parameters are present in CDBurnerXP, enabling users to select the speed of burning, prevent any additional changes to the disc, and even make changes to the disc later. Verifying data, simulating the burning process, and ejecting the disc are other functions that can be carried out through CDBurnerXP.",
    "The program also allows you to make simple covers for your disc, and the different cover types supported include mini CD cases, DVD and slim or standard CD. There are cover images provided or you can create your own, and it’s possible to both preview or print the cover.",
    "CDBurnerXP is a powerful and smooth-functioning tool to burn data discs and create ISO images, among other tasks. It is ideal for users who do not require advanced features and only want the key tools needed to burn media."
  ],
  "headers": {
    "2": "Compatibility",
    "4": "User experience",
    "8": "Burning data",
    "13": "Final verdict"
  },
  "links": {
    "CDBurnerXP": "https://cdburnerxp.se/en/download",
    "disc burning software": "https://www.techradar.com/best/the-best-free-dvd-burner"
  }
}