{
  "source": "https://www.techradar.com/reviews/logmein-pro-review",
  "title": "LogMeIn Pro review",
  "category": "computing",
  "updated": "2020-04-07T12:17:54Z",
  "author": "christian-rigg",
  "summary": "Read our LogMeIn Pro review to learn about its many business and IT-oriented features",
  "verdict": "LogMeIn Pro is feature-rich and business-oriented, with unlimited accounts, easy file management, multi-monitor support, whiteboard and screen recording options, and 24/7 telephone support.",
  "pros": [
    "Easy file management and remote desktop control",
    "24/7 telephone support"
  ],
  "cons": [
    "No built-in video conferencing",
    "Latency and resource-use could be improved"
  ],
  "article": [
    "Remote access to your systems and files means more flexibility, faster delivery, and greater connectivity. If you’re looking for the best remote desktop software, LogMeIn Pro has some great features that help it stand out. Small and medium-sized businesses especially will love the unlimited user access, 1TB file storage, and support for multiple monitors, not to mention a host of security features to help make sure your company’s data stays safe and private.",
    "In our comprehensive LogMeIn Pro review, we will cover all these features and more. Keep reading to discover what makes LogMeIn Pro one of the most secure and useful remote desktop connection managers out there.",
    "LogMeIn Pro’s plans are identical in terms of features but vary in terms of access. All plans include remote desktop access and printing, 1TB of file storage, and multi-monitor support. In addition, you can use a free 14-day trial to test the full software without needing to enter your credit card details.",
    "Pricing is per month, billed annually. Plans include access for two, five, 10, 25, or 50 connections, at $30, $70, $127, $291, and $541 per month, respectively. In every case, an unlimited number of users can connect to the host computers in question. Finally, the plans respectively include one, three, 5, 10, or 15 LastPass Premium password manager licenses.",
    "LogMeIn Pro has a full suite of features that make it easy to securely access your files and remotely control a desktop. A File Manager gives you quick access to the host’s file system, while IT managers will love the split display that allows for easy drag-and-drop file sharing between the client and host—an excellent solution for sharing large company files that can’t be sent through email.",
    "Remote desktop access is simple and responsive. Move your mouse or touch your device’s screen to control the host computer as if you were there. No problem if your host computer’s asleep: the Wake On LAN feature will have you up and running in no time. For IT managers, Whiteboard Drawing enables you to easily draw attention to items on-screen, facilitating help sessions. If you’re preparing a demonstration for later, you can Screen Record with easy AVI output.",
    "Finally, graphic and web designers, developers, and anybody else who uses multiple desktops will appreciate intuitive Multiple Monitor support: you can view monitors individually on a single screen, or reproduce your workstation exactly with multi-monitor host-to-client support. Your programs and files stay organized just the way you like, so you can be equally productive no matter where you are.",
    "There are two steps to setting up LogMeIn Pro, which are both quick and easy. First, the LogMeIn Control Panel should be installed on the computer you’d like to access remotely. Next, the LogMeIn Client can be installed on any Mac or Windows computer, or iOS or Android device. Installing the Control Panel took less than two minutes on our test computer, as did installing the Client on the same system and downloading it onto an iPhone and iPad.",
    "The interface is straight-forward and easy to use, despite the large number of available features. The Control Panel has a convenient Getting Started tab with easy guides on how to connect remotely. You can easily send an invitation to others, allowing them to view or control your computer via a secure, time-sensitive link, and turn on or off remote access.",
    "On the Client side, you’ll see a list of all the computers you have access to. Everything is synced through your LogMeIn username and password, so you can access your host computers from web, desktop and mobiles apps with ease. Clients are similar between desktop, mobile devices and web browsers.",
    "When connecting to our 16” MacBook Pro with 2.6 GHz Core i7 processor and 16GB of RAM from an iPad Pro, latency was okay, although there was some lag. Mouse tracking could be smoother, although mouse-clicks were more or less instantaneous. Remote access used significant CPU resources—about 25% in our tests, resulting in slightly slower on-screen animations.",
    "When it comes to screen sharing and remote computer access, security is paramount. Business users will appreciate the numerous security features built into LogMeIn Pro. Communications between the host and client are secured using SSL/TLS (OpenSSL), the same as for online banking. In order to access the host computer, you also need the correct login details, without which no connection can be established.",
    "There are a number of in-app features that help ensure a secure and private connection. For example, when you first connect through the Client, you’ll be given the option to blank the host’s screen or lock its keyboard. Additionally, alerts sent to your email notify you of important or unusual activity, such as failed login attempts. Finally, built-in user control systems enable IT managers to monitor and revoke user permissions on an individual or company-wide basis.",
    "LogMeIn Pro has something few tech companies can boast: telephone support available 24 hours a day, seven days a week, in more than 15 different languages. On top of the live support, a rich knowledge base includes a large number of helpful articles, plus guides for everything from managing users to troubleshooting antivirus software. Finally, the community forum boasts a large number of active users, asking questions and providing answers.",
    "LogMeIn Pro doesn’t come cheap, but it’s packed with advanced features that businesses of all sizes will appreciate. Security protocols are industry-standard, while features like remote-lock help keep your data private. The software, however, is resource-heavy, and responsiveness could be improved. The 24/7 telephone support is a great feature, and if you can afford the monthly rates, LogMeIn Pro is an excellent solution for your remote desktop needs.",
    "Although LogMeIn Pro has no shortage of features, it’s by no means the cheapest option on the market. For example, Zoho Assist Enterprise version enables up to six simultaneous connections for just $21 per month. That’s $9 cheaper than LogMeIn Pro’s Individual plan that allows connection to up to two computers.",
    "Furthermore, LogMeIn Pro lacks some features that IT managers may find useful. For example, Zoho Assist, which is more focused on customer support, includes voice and video tools for conferencing, while Remote Desktop Manager ($199/user/year) offers advanced role-based user management, a useful feature for companies with multiple IT technicians requiring different levels of access.",
    "If these features are important to your business, LogMeIn may fall short of your needs, a tough pill to swallow given its hefty price tag. Just keep in mind that LogMeIn Pro includes 24/7 telephone support, which can be a lifesaver.",
    "To see LogMeIn Pro compared directly to its competitors, check out our guide to the Best remote desktop software."
  ],
  "headers": {
    "2": "LogMeIn Pro: Plans and pricing",
    "4": "LogMeIn Pro: Features and utilities",
    "7": "LogMeIn Pro: Setup",
    "8": "LogMeIn Pro: Interface and performance",
    "11": "LogMeIn Pro: Security",
    "13": "LogMeIn Pro: Support",
    "14": "LogMeIn Pro: Final verdict",
    "15": "The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "LogMeIn Pro": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4407606528224617500/https://www.logmein.com/pro",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}