{
  "source": "https://www.techradar.com/reviews/asus-rog-strix-go-24-review",
  "title": "Asus ROG Strix Go 2.4 review",
  "category": "gaming",
  "updated": "2020-10-05T08:56:20Z",
  "author": "gerald-lynch",
  "summary": "A great-looking headset with comfort, if not sound, to match",
  "verdict": "The Asus ROG Strix Go 2.4 is one of the most attractive and convenient headsets out there, but lacklustre audio sullies the deal.",
  "pros": [
    "Quietly stylish",
    "Comfortable fit",
    "Good battery life"
  ],
  "cons": [
    "Hiss behind the sound",
    "Awkwardly-shaped USB-C receiver",
    "Average virtual surround"
  ],
  "article": [
    "Most headsets these days want you to look like the Las Vegas strip while wearing them – all flashy lights and glowing logos. The Asus ROG Strix Go 2.4 wireless gaming headset is a far more laid back affair. With its comfortable fit, light weight and generous leather padding, these are stylish cans you can happily walk down the street in, free from the gaudy sparkles of their RGB rivals.",
    "The Asus ROG Strix Go 2.4 makes a good account of itself in terms of core specs too. A wireless USB-C adapter lets you connect to everything from a PC to a Nintendo Switch without the need for a cable (with 35 hours of battery from a single charge), with a 3.5mm option to fall back on when needed. They also support Hi-Res audio formats, and come with an ‘AI noise-cancelling’ dual microphone – not to mention the convenience of a built in mic that still works when you’ve removed the detachable boom component.",
    "It’s a pity then, with so much going for them, that the Asus ROG Strix Go 2.4 sounds merely good, and not great. They offer a full sound, but detail can be lacking, and we experienced significant distracting hiss and interference when using them wirelessly, enough to sully their otherwise considerable strong points. The fact that its awkwardly shaped USB adapter will likely cause issues with your console or PC’s neighbouring ports too doesn’t go unnoticed, either.",
    "The ASUS ROG Strix Go 2.4 has an RRP of $199, but we’re currently seeing its price hover close to the $150 / £120 / AU$210 mark. At that price it’s quite good value given its premium design and feature set – but be aware there are much better sounding options out there.",
    "With a restrained look, the industrial design of the Asus ROG Strix Go 2.4 is by far the headset’s strong point. Where other headsets are all about peacocking with RGB lighting arrays, this Asus set keeps things simple, looking more like an everyday (and premium, at that) pair of Bluetooth over-ear cans.",
    "On the end of a liberally-padded, foldable and fully-adjustable metal bar sits the headset’s two oval-shaped earcups. It’s unusual to see this shape used in gaming headsets, which usually are larger and rounder, but this is a discreet styling more akin to the Sony WH-1000XM4 models, and all the better for it. You won’t turn heads in the street wearing them, and that’s a good thing, with just a small silver ROG logo and imprinted stamp on the outside of the cups giving away their gaming affiliation. A leather carrying case, charging cable and 3.5mm braided cable finishes off the well-presented package.",
    "Light at 290g, you can comfortably sit wearing the headset for long stretches of time, with memory foam padding keeping the clamp effect from squeezing too hard. Playback controls and a volume rocker / mic mute button sit on the left cup, along with the built-in mic and space for the boom mic. Finally, there’s a wireless / wired mode toggle – which, annoyingly, needs to be manually used when you’re going from one state to the other. The charging port sits alone on the right ear cup.",
    "Inside, you’re getting Asus’s 40m “Essence” neodymium driver system. It’s tuned more to mid-range sounds than over gaming headsets usually go for – for better and worse, as we’ll discuss shortly. A wide 40,000KHz frequency range for Hi-Res audio playback is hit when using a wired connection from the left cup’s 3.5mm jack port, but you’re down to a more standard 20,000KHz when you’re using the USB-C wireless module.",
    "That wireless dongle gives a key advantage to the Asus headset many others lack – it’ll work right out of the box with an undocked Nintendo Switch, which can be a pain to find wireless headsets for. Note there’s also a regular USB converter in the box for using with a PC or console that doesn’t have the newest USB-C standard. The USB-C dongle is a funny shape – a bit like a chunky ‘L’ Tetris block, which could potentially cause problems if your ports are bunched closely together.",
    "It’s a shame then that audio performance from the Asus ROG Strix Go 2.4 is quite a mixed bag. It’s at its best when hooked up to your Hi Res-enabled mobile music player over the 3.5mm cable, as that’s when it’s able to make use of its 40,000KHz frequency range to the max.",
    "The mid-range focus of the drivers is unusual in gaming headset terms. It’s great for following in-game dialogue, but if you’re into action packed, explosive titles, the lack of a power in the bottom end can make scenes seem a bit weak. On the other hand, music-focussed games, especially those with synth soundtracks like Beat Saber or Sayonara Wildhearts sounded great. It’s just not a great all-rounder, if you’d rather be playing COD: Warzone, for instance. Virtualized surround sound, likewise, doesn’t convince – it’s not an easy trick to pull off successfully, and Asus isn’t any worse than the majority of manufacturers attempting to trick your ears that there is sound coming from multiple locations around your head. But it doesn’t raise the bar, either.",
    "Asus does allow for some considerable tinkering though through its Crate and Armoury apps. Here you’ll be able to tweak the equalizer settings and virtual surround profile. While it can’t remove the issues above, it does let you tailor the output in a meaningful way to suit your tastes, within the limitations of the headset itself.",
    "More troubling was the continued hiss we experienced routinely throughout testing. It wasn’t noticed when using the wired connection, but any time wireless playback was active, there was a low hiss behind all the action. It may have been interference unique to my set-up, but it’s not a problem I’ve experienced with other wireless headsets, so was worth noting. It’s volume wasn’t loud enough to be game-breaking, but it was certainly distracting.",
    "The ASUS ROG Strix Go 2.4 isn’t without benefits in the performance stakes though. Its battery life is superb at about 25 hours, giving me the confidence to take it out for a walk around the block listening to my tunes, knowing there’d be enough juice in the tank for a gaming session whenI got home. And the headset’s two microphone options (boom on or off, using the built in option) were great too – speech was conveyed with clarity to my teammates and friends. The built-in mic was usually clear enough to forego the boom entirely. It’s this kind of convenience that makes me really want to love the Asus ROG Strix Go 2.4, but the audio performance is just too patchy to fully recommend."
  ],
  "headers": {
    "0": "One minute review",
    "3": "Asus ROG Strix Go 2.4 price and availability",
    "4": "Design",
    "9": "Audio quality and performance",
    "14": "Don't buy them if..."
  },
  "links": {}
}