{
  "source": "https://www.techradar.com/reviews/xerox-versalink-c405",
  "title": "Xerox VersaLink C405 review",
  "category": "computing",
  "updated": "2020-07-23T13:57:55Z",
  "author": "jim-hill",
  "summary": "A versatile printer with a handy touchscreen",
  "verdict": "For a medium-sized office, this large multifunction beast can really make short work of hefty workloads. It might be expensive, but you’re getting a lot of laser printer for your money, and the C405 is a fast and reliable workhorse for both printing and copying.",
  "pros": [
    "Quick and reliable colour document printing",
    "Easy setup thanks to the large touchscreen",
    "Plenty of paper capacity",
    "Useful apps"
  ],
  "cons": [
    "Wi-Fi module not included by default",
    "Cannot accommodate 10 x 15 photo paper",
    "Touchscreen is sluggish to operate",
    "Too large and expensive for a small office"
  ],
  "article": [
    "This serious multifunction device from the most famous name in office printing should be able to accommodate all the paper-handling demands of a medium, or even a large office. If not, there’s probably an optional upgrade available that will cover your needs, because Xerox sells paper drawers, cabinets and other modules for this line.",
    "With the Xerox VersaLink C405, we have a colour laser printer, scanner and fax that retails at £695 (around $900, AU$1,200). We chose to add the optional Wi-Fi dongle for wireless printing via Wi-Fi Direct. Impressively, this model can even connect to your phone with a single tap, thanks to the inclusion of NFC.",
    "The stand-out feature here, though, is the tilting 5-inch colour touchscreen. It lets you scroll through the menu and offers app-style access to functions such as Print and Scan for Google Drive, or simplified scanning to email. Xerox calls this the App Gallery and you can configure it on your computer. It’s certainly a long way from the 16-charcter fixed display of the Kyocera P5026cdw.",
    "You’ll need to dedicate a low table to this 33kg unit, which took two people to lift from the box as it’s too high for a desk. Surprisingly and a little disappointingly, it cannot accommodate A3 paper although it looks wide enough. It will, however, swallow a lot of plain A4 paper and if its 700-sheet capacity is not enough, you can add a second 500-sheet paper tray thanks to the modular design.",
    "Like most serious office printers, it’s not pretty, but this MFP does feel like it’s built to last, unlike your average photo printer. This machine is designed for speed and capacity rather than style, and the large touchscreen is intended to further speed up the printing process by making the interface easier to access.",
    "Instead of the usual tiny LCD and fiddly buttons, as we already mentioned, you get a nifty 5-inch tilting touchscreen. It looks a little like a smartphone – from ten years ago – as it is a similar size and populated by app icons. Sadly, the user experience is very different as it doesn’t have the processing power behind it to make the apps open quickly. So although we agree that it is ‘best-in-class’ as Xerox claims, it’s actually frustratingly slow to use, and you’ll wind up wishing you could just use your phone to operate the apps.",
    "This heavy-duty machine can print at the impressive rate of 35 pages per minute, in colour or monochrome, and we found the reality lived up to this claim. It can scan quickly too, although the quality for both printing and scanning is limited to 600 x 600 dpi (dots per inch). That will be more than enough for most jobs, but sharper printers are available.",
    "The VersaLink C405 can accommodate anything up to A4 size paper, plus envelopes and photo paper of various sizes. It’s also a fax machine, if you still use that particular medium of communication, and a photocopier.",
    "Connections include an Ethernet port and the usual square USB port, plus Wi-Fi (with the optional upgrade module) and NFC for wireless printing. The Wi-Fi module simply plugs into the back panel.",
    "Functionality is added by downloading the appropriate apps from the Xerox App Gallery. For example, if you choose the Print and Scan Using Google Drive app, which appears on the touchscreen, this makes it easier to scan documents directly to your Google Drive folders online. Similar apps are tailored to suit Office 365, OneDrive and Dropbox.",
    "So long as you have someone else to help you lift the thing out of its box, you should be able to set up the C405 without phoning the IT department for help. That said, it took us some time to puzzle out how to connect the printer to our home network in order to send and receive emails, so we won’t say that it’s easy. There is no companion app to take care of the process for you, so you will need to persevere with the printer’s own touchscreen.",
    "This must be the most costly and sophisticated control panel we’ve ever seen on a printer and from a distance, it looks just like the screen on your phone. In fact, it makes one wonder why you can’t use your phone (or a tablet) rather than relying on the limited processing power of the printer. Presumably, it’s because many offices aren’t keen for staff to connect their own devices to the office network.",
    "Once customised, the apps provide a good shortcut to your favourite features, just don’t expect the user experience and smoothness to be anything close to that of a smart device.",
    "The print quality is reassuringly crisp and consistent in black and white, with no smearing, or creasing over time. Text has a very professional-looking finish with rounded edges and a light touch. The pages come flying out at a terrific rate too. Just be patient with single documents because the time for the first page to print is rather longer than some rivals at around 12 seconds.",
    "Colour prints are Pantone-approved apparently, but we found our photos to look a little artificial. In general, our colour printouts looked lighter and somewhat greener than the original.",
    "Scanning is fast and accurate and it’s easy to choose the destination of the finished file, be that a USB drive, your email, or uploaded to a cloud storage service."
  ],
  "headers": {
    "3": "Design and build",
    "6": "Features",
    "10": "Setup and operation",
    "13": "Performance"
  },
  "links": {
    "laser printer": "https://www.techradar.com/news/best-laser-printer",
    "scanner": "https://www.techradar.com/news/best-scanners",
    "fax": "https://www.techradar.com/best/best-online-fax-service",
    "Wi-Fi": "https://www.techradar.com/news/the-ultimate-guide-to-boost-wi-fi-improve-your-internet-speed",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "office printers": "https://www.techradar.com/best/best-small-business-printers",
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "USB drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "email": "https://www.techradar.com/news/best-email-provider",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}