{
  "source": "https://www.techradar.com/reviews/asus-rog-chakram",
  "title": "Asus ROG Chakram review",
  "category": "computing",
  "updated": "2020-06-16T18:42:43Z",
  "author": "john-loeffler",
  "summary": "The Asus ROG Chakram is a great wireless gaming mouse, but is it worth its premium price?",
  "verdict": "A good wireless gaming mouse with some excellent features and performance, but it's held back by the hefty price and a thumbstick in search of a purpose.",
  "pros": [
    "16,000 DPI tracking",
    "Bluetooth and 2.4GHz wireless connectivity",
    "Wireless charging",
    "Customizable RGB lighting"
  ],
  "cons": [
    "Thumbstick not very useful",
    "Fewer macro buttons than comparable mice",
    "Hefty price tag",
    "Not ambidextrous"
  ],
  "article": [
    "It's clear what the design team was going for when they built the Asus ROG Chakram: what if we combined a wireless gaming mouse and a joystick? Like a lot of similar ideas, a hybrid with the best features of a gaming mouse and a console controller sounds fantastic. Unfortunately, the reality turned out to be somewhat underwhelming.",
    "Don't get us wrong: the Asus ROG Chakram definitely holds its own in the high-end weight class. It has a very high max 16,000 DPI, Bluetooth and 2.4GHz wireless connectivity, and built-in Qi wireless charging capability for its internal battery. If you have a mousepad with wireless charging, the Chakram will run as long as you want without needing to plug it into anything (which you can still do using the USB-C port). But is that enough to justify the lofty price point?",
    "There's no getting around it, the Chakram is expensive, retailing for $159.99 (about £130/AU$230). That laps the mid-tier in terms of cost and it will set you back nearly twice as much as some of the best gaming mice out there, like the SteelSeries Rival 710, the Razer Viper, or the Corsair Dark Core RGB Pro Wireless.",
    "The precision analog stick on the side of the mouse is clearly its big selling point, but there really didn't turn out to be much that the thumbstick did especially well. It does allow you to use your mouse in gamepad mode in Steam, but it's hardly a gamepad replacement.",
    "You can program the stick to act as four extra buttons through the Asus Armory software and assign macros, but it isn't very intuitive to use the stick this way. Without a compelling reason to use the mouse's key feature, manipulating it was just awkward enough to be discouraging.",
    "Since the other buttons and mousewheel feel much more natural, using the thumbstick requires conscious effort. Some may master the thumbstick and get a lot of extra utility out of it, but you'll just have to decide if you want to put in the training necessary to get you there – you're certainly paying for the privilege.",
    "The mouse also has a number of customization options to take advantage of, including swapping out different sized thumbstick pads or replacing the switches underneath the left and right mouse buttons. And like any gaming peripheral, you can customize it with a huge spectrum of RGB lighting and swap out the LED design at the rear of the mouse.",
    "There are two extra buttons on the thumbside of the mouse that you can program with various shortcuts or macros using the Armory software. The Chakram is plug-and-play as far as its basic functionality goes, but to get the most out of it, you'll need to download and install the new Asus Armory Crate package from Asus's website.",
    "Setting up the software requires a pretty quick download and a few minutes of installation time and a system restart, but after that, the Chakram's full functionality opens up.",
    "You have access to different profiles you can create, change the RGB lighting scheme and the lighting effects, select different settings for specific games, and reassign all but the left mouse button however you'd like. Recording and assigning macros to the extra buttons on the side was pretty simple and straight forward.",
    "Those macros and reassignments came in real handy while playing games like Mechwarrior 5: Mercenaries and Elite: Dangerous, where managing several fire groups of weaponry if a dogfight is a matter of life and death.",
    "The Armory Crate settings make it easy to adjust four levels of DPI, with a max of 16,000 DPI on level four. This makes the mouse sail across the screen, but not in the same way that maxing out your sensitivity in your system settings will.",
    "It's much smoother, and for those who like a mouse cursor with some pep to it or you're looking for precision sniping in a battleground, you can get extra-fine control out of the Chakram.",
    "Those of us who prefer a mouse without a hair-trigger can still benefit from a higher DPI in the 4,000 to 8,000 range, especially when paired with its fast polling rate of up to 1,000 Hz. With the Chakram's 40g physical acceleration and 400 IPS, you'll probably have shoot the thing out of a cannon before it'll start having trouble tracking its movement.",
    "The left and right mouse buttons are firm and clicky. The two extra buttons by your thumb don't have as much give to them but they press easily enough to get the job done just fine. The mousewheel rolls smoothly with subtle ticking feedback under your finger to give you that extra sense of control.",
    "There are gamers out there who are more than capable of mastering the analog stick on the Chakram and they may find it offers incredible functionality they can't get anywhere else.",
    "The most consistent use we were able to make of it was having it act as a second mousewheel to scroll up and down webpages. In this function, it was no better than the actual mousewheel and maybe a little worse.",
    "Assigning the four directional command shortcuts to the analog stick did add some depth, but flicking the stick in the right direction can be tricky, as pressing the stick diagonally can lead to the wrong \"button\" being pressed. It doesn't help that the stick puts up some moderately strong resistance which makes the stick want to snap back to center even as you're holding the stick in one any given direction.",
    "The right-handed Chakram's ergonomic profile is very comfortable and easily fits a large hand. The placement of the side buttons give excellent accessibility while the left and right mouse buttons ever so slightly cup the fingers, making it feel very natural and allows for easy clicking of the two. Unfortunately, if you're a lefty – well, you know the deal. They don't make it in an ambidextrous or left-handed model but you're probably very used to that by now.",
    "The solid black plastic of the Chakram is broken by the RGB LEDs lighting up the front of the mouse, just under the mouse buttons, the sides of the mousewheel, and underneath the Asus ROG logo at the base of the palm. The Armory Crate settings can change the color and brightness of the LEDs to complement the rest of your rig and you can set up several different lighting effects as well.",
    "You can also set the lighting to warn you when the mouse is running out of power, which it will do somewhere between 60 and 80 hours depending on how you use it and power-saver settings which you can find in the Armory software. If it dies on you, using a fast charge cable for 15 minutes will get you about 12 hours of battery life.",
    "The grips at the sides are ribbed plastic built scored into the side. It offers excellent traction and control for sweaty hands and you'll never have to worry about the glue holding a rubber traction strip to the side degrading and peeling off the mouse.",
    "You want a highly-responsive gaming mouse With up to 16,000 DPI, 400 IPS, 40g physical acceleration, and up to a 1,000 Hz polling rate, the Asus ROG Chakram is an excellent choice for gamers who want complete control over the mouse's responsiveness and precision.",
    "You want the flexibility offered by an analog stick There are professional gamers out there who have gaming mice more intricate than the Chakram's analog stick, so there's no reason why someone couldn't take it and get a lot of flexibility and functionality out of it. It might not come easy, but if you can acclimate to it, then there's very few gaming mice like it.",
    "You want an end-to-end wireless gaming mouse",
    "If you have a charging mousepad and a Bluetooth- or RF wireless-capable computer, there's no reason you should ever have to manually charge the Chakram or plug it into a USB slot (assuming your charging pad remains powered). The mouse even comes with a zip-up carrying case to protect it from damage while on the go.",
    "You want a lot of buttons for macros While the analog stick can be assigned four commands, bumping the total number of \"extra\" buttons to six, there are other high-end gaming mice that look like little plastic macro-button hedgehogs. If macros are your thing, the Chakram is probably going to feel pretty basic.",
    "You don't want to spend a lot of money on a gaming mouse When it comes to computer components, a gaming mouse isn't - and shouldn't - be at the top of the list of the most expensive out there. Most of the best gaming mice we've reviewed retail for less than $100 (about £80/AU$144), so $159.99 (about £127/AU$232), is a lot for a gaming mouse. If you're on a budget, you'll probably want to pass.",
    "You're a lefty or you're looking for an ambidextrous device The Asus ROG Chakram is a very comfortable mouse (analog stick aside), but it's built for the right-handed. There is no lefty or ambidextrous unit, so if you want one that's built with left-handed comfort in mind, this probably isn't the gaming mouse for you."
  ],
  "headers": {
    "0": "Two minute review",
    "22": "Buy it if...",
    "26": "Don't buy it if..."
  },
  "links": {
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "SteelSeries Rival 710": "https://www.techradar.com/reviews/steelseries-rival-710",
    "Razer Viper": "https://www.techradar.com/reviews/razer-viper",
    "Corsair Dark Core RGB Pro Wireless": "https://www.techradar.com/reviews/corsair-dark-core-rgb-pro-wireless"
  }
}