{
  "source": "https://www.techradar.com/reviews/seagate-firecuda-1tb-external-ssd",
  "title": "Seagate Firecuda 1TB external SSD review",
  "category": "computing",
  "updated": "2020-06-10T09:00:06.390Z",
  "author": "desire-athow",
  "summary": "Great for gaming and everything else",
  "verdict": "The Seagate Firecuda 1TB external solid state drive is a well designed, well executed product but ultimately one whose appeal hinges on the promise of getting USB 3.2 Gen2x2, one for which you’re paying a rather steep premium.",
  "pros": [
    "5-year limited warranty",
    "Fantastic design",
    "Good performance"
  ],
  "cons": [
    "Pointed corners are a hazard",
    "Very expensive"
  ],
  "article": [
    "Seagate is a name usually associated with spinning hard disk drives but the gradual long-term structural decline of this market means that it has had to diversify and solid state drives (SSD) were a natural fit and complementary line of business to move into.",
    "With that in mind, they launched the Firecuda Gaming SSD which is a 1TB external SSD that offers USB 3.2 Gen 2x2 technology for speeds of up to 20Gbps.",
    "You can obviously use it on any device that’s compatible with it; the Seagate Firecuda Gaming SSD comes with 500GB and 2TB capacities as well. The current Amazon US pricing for these three models are $179, $259.99 and $499.99 respectively. We’re testing the 1TB unit today, otherwise known as the STJP500400.",
    "At 143g, the Firecuda is significantly heavier than most external SSD that we’ve tested lately. Its dimensions (10mm x 52.5 x 104.4mm) mean that it is also far bigger as well. Design is something subjective but we’re averse to the idea of having what is essentially a lump of black anodized, chiselled metal with eight pointed corners that could, during a fall, either dent your wooden floor or worse leave your toes rather sore.",
    "We do understand the rationale behind the decision to make it monolithic though, almost like a homage to the dark slab in Stanley Kubrick’s 2001: A Space Odyssey, a movie that probably resonates with a lot of gamers. Switch it on and there’s a nice warm glow that it emits from one small LED strip.",
    "You can even customise the LED color (from up to 300) via Seagate’s Toolkit software and we like the fact that it comes with a long USB Type-C cable.",
    "Seagate doesn’t produce its own NAND chips and therefore doesn’t have the same level of control on the supply chain as its vertically integrated rivals including arch nemesis Western Digital, Kioxia, Samsung and Crucial.",
    "The drive is one of the few external ones that offers compatibility with USB 3.2 Gen 2x2 and others have yet to join the foray for a good reason, there’s hardly any host device that can connect to deliver the target speed of 20Gbps. You should however be able to install a compatible add-in card when they arrive on the market. ASMedia, for example, launched the 3242 controller back in 2019.",
    "As for the tests, the numbers we saw are what we’d expect from a high end USB Type-C storage device with NVMe PCIe components inside. The numbers we recorded were high but not as high as the HP P700 for example which was the highest we recorded for a non-Thunderbolt 3 device.",
    "Read/write numbers for CrystalDiskMark reached 1.02GBps and 0.99GBps with a 10GB file transferred, in a real life test, at nearly 400MBps.",
    "As noted before, the Firecuda supports USB 3.2 Gen 2x2, allowing it to reach up to transfer rates of up to 20Gbps with compatible devices. But these are quite rare; for example, we have yet to see ANY laptops that support this technology and chances are that there will be none as the window of opportunity for USB 3.2 Gen 2x2 to flourish is vanishing. And yes, that’s down to USB 4.0 being firmly on the horizon.",
    "If you want a fast solid state drive, then the Adata SE800 gets our vote. It got our editor’s choice accolade in October 2019 thanks to a very keen price tag and an IP68 rating that means it can be dropped in a glass of water without any issue. And remember the price; $147.99 at Amazon albeit with a shorter 3-year warranty.",
    "The Samsung T7 Touch Portable SSD comes with fingerprint and password security rather than any IP68 rating. It is as fast as the solid state drive above (and the Firecuda). Pricewise though, it is still far cheaper at $209.99 with the 2TB model available for a shockingly low $379.99, a $120 saving compared to the Firecuda.",
    "If speed is what you’re after then one of the cheapest 1TB Thunderbolt 3 NVMe external solid state drives is the OWC Envoy Pro Ex currently available for $299.75. It delivers up to 2.8GBps and can be combined with existing Thunderbolt 3 docking stations and laptops. The 2TB model costs $499.75 which probably makes it a far more desirable option than Seagate’s.",
    "The Firecuda is a great solid state drive but we wouldn’t encourage you to buy it. It is far more expensive than similar solid state drives and its flagship selling point - its ability to transfer up to 20Gbps is curtailed by the sheer lack of USB 3.2 Gen 2x2 compatible products on the market. This is not something that will sadly change overnight.",
    "So you have an overpriced drive that has a great design, a groovy light and the potential to deliver fantastic speeds down the line, in the (distant) future. You could always either get a far faster Thunderbolt 3 drive or a much cheaper - and just as fast - USB 3.2 Gen 2 device and enjoy the performance right now."
  ],
  "headers": {
    "3": "Design",
    "6": "Performance",
    "10": "Competition",
    "14": "Final verdict"
  },
  "links": {
    "$179": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Firecuda-Gaming-External-Solid%2Fdp%2FB083GH6X5V%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8753097182446201000-20",
    "$259.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Firecuda-Gaming-External-Solid%2Fdp%2FB083GH6X5V%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1290918999991332400-20",
    "$499.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Firecuda-Gaming-External-Solid%2Fdp%2FB083GH6X5V%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8296886419108541000-20",
    "Toolkit software": "https://www.seagate.com/support/software/toolkit/",
    "USB 4.0": "https://www.techradar.com/news/usb4-everything-you-need-to-know",
    "Adata SE800": "https://www.techradar.com/reviews/adata-se800-waterproof-external-ssd",
    "Samsung T7 Touch Portable": "https://www.techradar.com/reviews/samsung-t7-touch-external-ssd",
    "OWC Envoy Pro Ex": "https://www.techradar.com/reviews/owc-envoy-pro-ex-thunderbolt-3-1tb-portable-ssd-2019"
  }
}