{
  "source": "https://www.techradar.com/reviews/banana-vpn-review",
  "title": "Banana VPN review",
  "category": "computing",
  "updated": "2020-12-04T11:29:40Z",
  "author": "sead-fadilpasic",
  "summary": "Stable but expensive and slow",
  "verdict": "Banana VPN offers a basic and slow yet secure and reliable service. This means it deploys all the industry-standard tools to protect your privacy from snoopers and to enable secure browsing but it isn’t the go-to platform for torrenting, Netflix, or beginners. Additionally, its pricing, lack of information on the website, and paranoid fraud checks may be off-putting for many.",
  "pros": [
    "Unblocks BBC iPlayer",
    "Stable connections",
    "Secure platform"
  ],
  "cons": [
    "Very slow",
    "No native clients",
    "Doesn’t allow torrenting",
    "Doesn’t unblock Netflix",
    "Exorbitant pricing"
  ],
  "article": [
    "Banana VPN is a provider of VPN services that has been active since 2007 and has since provided a stable platform for anyone seeking anonymity, privacy protection, and access to censored online content. That said, it does fail in many areas, like download speeds, the size of its server network, pricing options and amount, as well as the information it offers on its website, and may even be considered paranoid (seeking ID evidence, etc.). For this reason, we believe you might find a more suitable choice among the best VPN services today’s market can offer.",
    "Banana VPN offers an annual subscription plan at $100 (equal to $8.33/month, billed annually), a 6-month option at $60 (equal to $10/month, billed semi-annually), as well as a monthly subscription at $14.99, which makes this provider’s services quite exorbitant, at least for what they include (or rather not include). Up to three devices can be covered by this VPN at the same time under one account.",
    "You can pay using credit/debit cards by default, as well as using PayPal, but the latter is complicated as you’ll have to contact the company by email first and attach a proof of ID, like a driving license. The company may also ask for a scan or copy of your ID or credit card to confirm your identity regardless of the payment method.",
    "Do note that Banana VPN doesn’t accept orders or logins from Cuba, Iran, Iraq, Libya, North Korea, Sudan, Syria, and Nigeria. Also, you’ll have to wait until the provider “reviews” your order, which is, along with the ID checks, quite a high level of paranoia from a VPN provider.",
    "The provider doesn’t offer a free trial but you can ask for a refund within three days after purchasing the service, which is enough to see if it works out for you or not.",
    "Banana VPN may not be suitable for everyone, especially considering it doesn’t allow torrenting nor can it unblock Netflix. For this reason, you should consider getting a VPN provider that not only allows torrenting and provides access to Netflix (and more!), but also does it at more acceptable rates, like NordVPN, CyberGhost, or Surfshark.",
    "Or even better -if you’re going to spend this much money on a VPN, then why not go for the industry leader - ExpressVPN - which charges the same amount for its 12-month plan (currently even offering 3 months for free) as does Banana VPN? You’ll get a much more advanced platform, with support for torrenting and Netflix, thousands of servers, customer support available at any time of day or night, user-friendly native apps for all major platforms, as well as detailed information on the website and verified no-logs policy.",
    "Being able to unblock some of today’s most popular streaming services is what a lot of users are seeking in a VPN. Banana VPN unblocks BBC iPlayer, ITV, and SKY On Demand, but not Netflix.",
    "The company that owns Banana VPN - Kattouf Internet Services - is located in Limassol, Cyprus. However, the seller of these VPN services is BlueSnap, an international company with branches in the US, UK, Canada, Australia, etc. so ordering these services means you’re entering into a contractual relationship with this company.",
    "As of January 2020, it has only 15 VPN servers - in Texas, Washington, Canada, UK, Germany, the Netherlands, France, Switzerland, Singapore, and Hong Kong.",
    "To protect your online privacy, the provider uses “at least 256bit encrypted tunnels.” There’s no obfuscation option so it’s possible your provider will know you’re using a VPN but not what sites you’re accessing and what else you’re doing online. The supported protocols include OpenVPN, PPTP, L2TP, and SSTP. P2P traffic and torrenting is strictly forbidden.",
    "Not much is said in the privacy policy except that “Banana VPN does not log any user activity whatsoever (sites visited, DNS lookups, emails, etc.). We only log access attempts to our servers (for security and troubleshooting), session durations, and bandwidth used. Those are kept for 2 weeks”. In other words, some logs are collected but not kept for long. Unfortunately, the provider hasn’t yet opened its proverbial doors to outside auditors to confirm these claims, so we have no other choice but to trust it.",
    "The service can be installed on platforms like Windows, Android, iOS, Mac, Linux, Boxee, and DD-WRT router with the help of manual installation video guides, as there are no native clients to download.",
    "Banana VPN has a rather limited support section, with articles divided into billing, configuration, and FAQ topics that cover the basic concerns, installation guides, etc. However, there were some things we couldn’t find information about, for which we had to reach out to the provider’s",
    "For contacting its team directly, this VPN vendor has provided email addresses and an online chat option, although it’s not available 24/7 - only on workdays, between 8:00 and 22:00 GMT UK time.",
    "Banana VPN is far from the easiest VPN service to install. Once your order has been verified and you’ve received an email with your credentials, begins the struggle to set it up since there are no native apps. Instead, the email tells you to click on a link that leads to a non-existent page which should be a download URL for VPN Dialer or consult a setup guide that is basically a low-quality video you’ll often have to pause and try to figure out what to do.",
    "After you’ve finally set up the SSTP connection, you can’t easily switch between servers without creating separate connections for all of them, which is incredibly counter-intuitive and complicated. We’ve tested the download speeds of the US server and they were ridiculously low - delivering only 3.5Mbps on a 60Mbps testing connection. We then created a VPN connection for the server in France. This time the speeds were better but still very low - only 6.3Mbps, which is unacceptable to a server on the same continent as us.",
    "We gave it another chance by testing the server in Germany and we got a somewhat better but again miserable 7.5Mbps. Connecting to any of the said locations took an uncomfortable amount of time during which we had no idea if something went wrong or we just needed to wait longer.",
    "While it does have certain advantages, Banana VPN is mostly a below-average service, especially when compared to the industry giants such as ExpressVPN. It is too expensive, has only a handful of servers, its speeds are poor, it doesn’t unblock Netflix (although BBC iPlayer is supported), forbids torrenting, its platform too complicated for beginners to get around, and it only accepts payments in credit cards."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "7": "Streaming",
    "8": "About the company",
    "10": "Privacy and encryption",
    "12": "Support",
    "15": "Speed and experience",
    "18": "Verdict"
  },
  "links": {
    "Banana VPN": "https://www.bananavpn.com/",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "privacy": "https://www.techradar.com/best/anonymous-browsing",
    "OpenVPN": "https://www.techradar.com/vpn/what-is-openvpn",
    "support section": "https://www.bananavpn.com/f-a-q/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-4348577880254335500"
  }
}