{
  "source": "https://www.techradar.com/reviews/lexmark-mb3442adw",
  "title": "Lexmark MB3442adw review",
  "category": "computing",
  "updated": "2020-09-30T18:42:28Z",
  "author": "jim-hill",
  "summary": "Fast and feature packed",
  "verdict": "This compact AIO punches well above its weight, printing crisp monochrome pages quickly and with a wealth of helpful features.",
  "pros": [
    "Vivid print quality",
    "42 pages per minute",
    "Duplex print and scan",
    "Touchscreen control"
  ],
  "cons": [
    "Non-tilting display",
    "Processing speed varies",
    "Not the cheapest toner"
  ],
  "article": [
    "Don’t judge the Lexmark MB3442adw by its size. This compact all-in-one device manages to include every feature a business class printer should offer and has a print speed that leaves most other lasers behind. Lexmark confidently recommends a maximum monthly page volume of 8,000 prints, one of the highest duty cycles we’ve come across, so it should service any small to medium sized business with ease.",
    "Costing around US$430 (about £334, AU$604), it’s not the cheapest mono AIO around, but its rapid print rate of 42ppm (pages per minute) and touchscreen interface justify the premium price tag. It also ships with a decent amount of black toner — enough for 3,000 pages.",
    "The Lexmark MB3442adw comes in a surprisingly small and heavy cardboard box. The printer itself is conveniently compact, and yet it can hold a useful amount of A4 paper (350 sheets in the main tray). The tray projects out of the back of the unit, but only by a couple of centimetres. Its footprint takes up little desk space and the A4 scanner overhangs the printer by just a couple more centimetres.",
    "It feels heavy and well built with the small, but responsive 2.8-inch touchscreen display mounted prominently at the front. Hidden behind this display is a USB port for inserting a thumb drive and printing, or scanning directly from or to flash memory.",
    "The ADF (automatic document feeder) on top of the scanner can handle up to fifty sheets of A4 paper at a time and it can scan both sides of each page automatically. Single pass duplex scanning is a time-saving feature that you are unlikely to find on cheaper models.",
    "A flap at the front serves as the multimedia tray into which you can place envelopes and headed paper.",
    "To access the toner cartridge, the whole front panel hinges open to reveal the printer’s inner workings.",
    "At the back, you’ll find connections for a square USB Type B cable, an Ethernet cable and fax cables.",
    "The Lexmark MB3442adw is a four-in-one device, which means it can print, scan copy and fax, but it carries almost every other feature you can think of too. It can print on both side of the page automatically of course, but it can also scan both sides at a single pass too. The flatbed scanner has a resolution of 600dpi, which matches the print resolution, while built-in Wi-Fi connectivity makes it easy to print and scan to the cloud from a mobile device running Lexmark’s companion app.",
    "Despite the small size, there’s plenty of room for paper, with the main media tray holding up to 350 sheets of A4 and the ADF racking up another fifty. The multimedia tray at the front accepts envelopes and heavier paper of any size up to A4. You can even expand the paper capacity by adding another drawer unit. The optional 550-sheet tray accessory costs around US$139. You can add multiple trays, a stand or a rolling cabinet if you like. The output bin in the middle of the printer is slightly disappointing in its ability to hold only 150 sheets.",
    "Printing is very fast at 42ppm and the quoted first page out time of 5.9 seconds is also impressive, although in reality, the processing time seems to fluctuate widely. There are enough security features to satisfy most businesses and plenty of black toner in the box. When you’re 3,000 pages are used up you can replace the setup cartridge, using Lexmark’s return program, with a high-capacity cartridge capable of printing up to 6,000 pages at a cost of US$135.",
    "Before you can begin printing, you will have to first install the toner cartridge. With most laser printers, the toner is pre-installed, but don’t worry, it’s a fairly simple operation.",
    "The user manual shows you how to extract the toner cartridge from the heart of the printer, in order to remove its protective packaging. In a few more steps you can also set the language, date, time etc and then join the local Wi-Fi network. At first, we tried using Lexmark’s companion app and followed its setup wizard and iPhone to get connected, but for whatever reason, it failed to get the printer online. Luckily the printer’s own interface makes the process even more straight forward.",
    "Once up and running, the Lexmark MB3442adw is particularly easy to operate thanks to the clear and responsive touchscreen. The Lexmark Mobile Assistant app, once you figure out how to make it see the printer, is also useful for scanning and printing to cloud services such as DropBox and Google Drive.",
    "Pages printed by the Lexmark MB3442adw always look bold, sharp and highly detailed. The native print resolution is 600 x 600 dpi, the same as almost every other laser printer, but by overlapping dots, it can achieve 2,400 IQ (2,400 x 600 dpi) and the trick clearly works because pages of text, graphs and monochrome photos all look great. Where some laser printers produce slightly pale or grey printouts, the Lexmark’s prints are always strikingly black and bold.",
    "Printing is fast too. The quoted print speed of 42ppm for consecutive solo pages is pretty accurate and the speed is not too much slower for duplex printing. However, we found that the first page out time, given as 5.9 seconds, varied widely. Printing photos and diagrams always took more than ten seconds in our tests.",
    "Scanning was also carried out quickly in both single and duplex mode. Photocopies looked faithful with the same bold contrast and lost only a little sharpness in the process. The Lexmark MB3442adw prints quietly enough and we experience no paper jams or misprints during the test, which leads us to conclude that this is a highly competent printer.",
    "At first glance, it doesn’t look like you’re getting much multifunction printer for your money, but the little Lexmark MB3442adw ticks all of our boxes. The compact design is an advantage, while it still manages to fit in a whole lot of paper, toner and features. The duplex printing and scanning is well executed and the touchscreen and front USB ports are certainly convenient. It can print large documents such as manuscripts very quickly and above all, the quality is consistently high. If you need to print lots of pages and you require the added functionality of a scanner and ADF, then this is the AIO for you."
  ],
  "headers": {
    "2": "Design and build",
    "8": "Features and specifications",
    "11": "Setup and operation",
    "14": "Performance",
    "17": "Final verdict"
  },
  "links": {
    "Lexmark MB3442adw": "https://www.lexmark.com/en_us/printer/15682/Lexmark-MB3442adw"
  }
}