{
  "source": "https://www.techradar.com/reviews/netgear-nighthawk-x10-r9000-dd-wrt-flashrouter-vpn-router",
  "title": "Netgear Nighthawk X10 R9000 DD-WRT FlashRouter VPN router review",
  "category": "computing",
  "updated": "2020-05-19T12:01:58Z",
  "author": "mike-williams",
  "summary": "A hassle-free way to protect multiple devices with a VPN",
  "verdict": "An easier way to set up and configure a router to work with accounts from many of the top VPN providers.",
  "pros": [
    "Fast and powerful hardware",
    "Crammed with features",
    "Configurable DD-WRT firmware",
    "Easy setup for a number of major VPNs"
  ],
  "cons": [
    "Expensive",
    "Bulky design won't appeal to everyone",
    "Choosing locations is more difficult than a regular VPN app"
  ],
  "article": [
    "Some routers are small, sleek, and thoughtfully designed to blend into the background, whatever your home or office environment.",
    "FlashRouter’s Netgear Nighthawk X10 R9000 with DD-WRT doesn't worry about any of that. It's a big black box (224 x 168 x 74mm) with eye-catching angled lines, four very large active antennas, and no less than 17 LEDs to indicate the status of its wireless modes, WAN and 6 Gigabit Ethernet ports. It's not ugly, but let's be realistic: you're going to struggle to keep it out of sight.",
    "There's a lot of top-quality networking technology inside: 802.11ac and 802.11ad Wi-Fi support, alongside a quad-core CPU, with quad-stream and MU-MIMO to ensure you'll be able to handle simultaneous 4K streaming and other tasks.",
    "The Wi-Fi interface gets you up to 4.6Gbps in theory, a built-in 10 Gigabit fiber connection provides up to 10x faster (than ‘plain’ Gigabit) wired connections to network storage, and we could do another entire review just on the bonus features (Plex Media Server, support for aggregating two LAN ports, Echo/Alexa compatibility, and more).",
    "What's really interesting here, though, is that this is a FlashRouter, a Nighthawk X10 with custom firmware which makes it very easy to set up and manage a VPN at the router level.",
    "If you've ever tried to set up a VPN at home, you'll understand the hassles: installing apps on every compatible device, setting up all the others manually, maybe finding out you can only connect five devices at once and having to ration which ones you use, and then keeping everything updated.",
    "Using a FlashRouter avoids all of this because there's no software to install, and no complicated manual setup. All you have to do is use the custom firmware to select your VPN (many big-name providers are supported), enter your username and password, and you're done – there is no networking expertise required. Supported VPNs are as follows: blackbox, CyberGhost, ExpressVPN, HideMyAss, IPVanish, IVPN, NordVPN, Private Internet Access, ProtonVPN, PureVPN, SaferVPN, Surfshark, VPN Unlimited, VyprVPN and Windscribe.",
    "Once you've set up the router, connect to it as usual, from as many devices as you like, and the router protects them all via its single connection to the VPN. Easy.",
    "And if you don't need to push everything through the VPN – maybe it'll slow you down, or stop some devices from working at all – you can selectively set up specific devices to bypass the tunnel and use your regular ISP instead.",
    "There is a price to pay for all this convenience, of course. Right now it's a special price of $515 (the regular price is $565), with options including $15 for a UK, EU or Australian power supply and plug, and a further $15 to extend the warranty from one to two years.",
    "If that leaves your eyes watering, opting for a recertified model cuts the cost down to $300 (currently, the regular price for this version is $350). Go for the two-year warranty and that could be a smart choice for bargain hunters.",
    "This FlashRouter spin on the Netgear Nighthawk X10 R9000 arrived safely packed in a sturdy box, with an Ethernet cable, a power adapter, and a single A4 sheet of paper with a Quick Start Guide.",
    "The instructions are simple and direct enough for even the greenest of networking newbies. If the FlashRouter is your only router, connect it direct to your modem; if it's a second device, connect it to your existing router. Power it up, then connect to the FlashRouter's wireless network using the Wi-Fi password printed in the Quick Start Guide.",
    "FlashRouter's app helps you set up the Nighthawk X10 with the details of your VPN account, so if you've not signed up with one of the supported VPNs just yet, now would be a good time.",
    "Enter your VPN username and password and the app prompts you to choose your preferred location. You also get a handful of settings, typically including an 'auto connect' option (the router automatically connects to the VPN when it starts), a global kill switch and the ability to view connection logs.",
    "The kill switch is particularly handy. Most VPNs claim to offer some kind of kill switch, maintaining your privacy by blocking internet access if the VPN drops, but there are a pile of potential issues (the switch may be turned off by default, might not cover every platform or protocol, or sometimes won't even work full-stop). Moving the kill switch to the router ensures it protects everything, out of the box, without you having to do anything else.",
    "You may get a few other options, depending on your provider. NordVPN includes an Order feature which enables sorting servers by countries nearest to you, or depending on server load; Private Internet Access has a choice of encryption (AES-128-CBC or AES-256-CBC); Surfshark supports enabling its CleanWeb DNS feature, blocking access to malicious websites for all connected devices.",
    "This might look a little basic if you're used to fine-tuning your VPN performance, but keep in mind that's not such a good idea with routers (your settings affect all devices, not just one, so generally they should be as safely mid-range as possible). FlashRouter's options cover the basics, and that's fine with us.",
    "Once you've set up the NightHawk X10, there's not a lot else to do, at least in theory. It's set to your preferred VPN location, and it'll reconnect to the VPN if you turn it off and on again. If you're happy with that, you can leave the NightHawk X10 entirely alone, much like you would with any other router.",
    "You can change your VPN location from FlashRouter's app, just as you did during setup, but this isn't quite as simple as you'll see with a standalone VPN app.",
    "Open a location list on a VPN provider's own app, for instance, and you'll typically get a simple display of country and maybe city names, perhaps with load figures or latencies to help you spot the best choices. Click Connect and some apps will use smart routing options to find the best server.",
    "Try this with the FlashRouter app, and (depending on your provider) it's a little more complicated. Location names are sometimes difficult to recognize – we suspect not all users will immediately know whether 'cr16.nordvpn.com.tcp.ovpn' is a good choice, for instance. With some providers, there's no indication of which server might deliver the best performance, either; you just have to pick one and see for yourself.",
    "While that can be a usability issue, we suspect most users won't need to change the router location very often. And if you're an exception, there are workarounds.",
    "Although the FlashRouter is designed to handle all your devices, you can choose to route some through your regular ISP. And if you have a dual-router setup, you can still connect to your original router via a VPN app on your mobile, laptop or anything else, then change location from that app, just as you always have.",
    "If you're happy with your VPN location, but more concerned about some low-level technical tweakery, you also get full access to the NightHawk X10's DD-WRT firmware. Whether you're looking to play with the networking basics (IPs, DHCP) or wireless security settings, set up a hotspot or reconfigure the firewall, there's all the configurability you'll ever need.",
    "Assessing the performance of any router is difficult at the best of times, but factor in a choice of 15 VPNs and there's no individual test we can do that will give you a complete idea of the speeds you might see.",
    "On the hardware side, the Nighthawk X10's powerful quad-core CPU, active antennas and wide support for networking technologies (802.11n, 802.11ac, 802.11ad, 7x Gigabit LAN ports) gives you more than enough power and range to cope with most situations.",
    "The ability to handle 4x simultaneous streams could make a huge difference all on its own. We set up a couple of audio streams on our ISP’s basic modem – which was all it could handle – and download speeds dropped to 23Mbps on our 75Mbps test line. However, the NightHawk X10 managed 64Mbps without difficulty, and there were no streaming glitches.",
    "Whatever your local situation, your final speeds depend on the VPN provider. Check out our reviews of your favorites to find out how they performed when testing using a standalone app.",
    "Would connecting via a router, rather than a native client, affect performance? We ran some tests using an ExpressVPN account, and it made no measurable difference. As we mentioned above, it's more difficult to choose the optimum server for more distant locations, and that might have an effect, but otherwise the FlashRouter hardware should deliver great speeds in most situations.",
    "An expensive but extremely powerful router which makes it much easier to protect all your household devices with your favorite VPN."
  ],
  "headers": {
    "11": "Setup",
    "18": "FlashRouter app",
    "25": "Performance",
    "30": "Final verdict"
  },
  "links": {
    "routers": "https://www.techradar.com/news/best-small-business-routers",
    "FlashRouter’s Netgear Nighthawk X10 R9000": "https://www.flashrouters.com/netgear-r9000-ddwrt-router",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "HideMyAss": "https://www.techradar.com/reviews/hidemyass-vpn",
    "IPVanish": "https://www.techradar.com/reviews/ipvanish-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "special price of $515": "https://www.flashrouters.com/netgear-r9000-ddwrt-router",
    "reviews": "https://www.techradar.com/search?searchTerm=VPN+reviews"
  }
}