{
  "source": "https://www.techradar.com/reviews/royole-rowrite-2",
  "title": "Hands on: Royole RoWrite 2 review",
  "category": "tablets",
  "updated": "2020-01-11T01:33:11Z",
  "author": "david-lumb",
  "summary": "Regular ink, digitally transferred",
  "verdict": "",
  "pros": [
    "Handsome and simple",
    "Can use any A5 notebook",
    "Handy small size"
  ],
  "cons": [
    "Writing-to-text isn't great",
    "Haven't tested mobile app interface"
  ],
  "article": [
    "The Royole RoWrite 2, introduced at CES 2020, refines almost every aspect of its predecessor to deliver one of the best IRL writing-to-digital notebooks we’ve seen so far.",
    "The RoWrite 2 slims down the overall package from the original model, and ditches its gray canvas for a nice leather cover available in a variety of modest colors. Gone are the interior pockets and pen sleeve of the RoWrite 1, but the simplified folio in the new model also cuts down on a lot of the hardware, nearly halving the weight from 775g to 420g, which is less than a 9.7-inch iPad.",
    "The simplified mechanisms make it easy to load in paper: Instead of locking specific paper pads into a plastic-and-sensor frame, you just have to slide a small notebook of any A5-sized variety into the RoWrite 2’s rear cover, and the sensor panel stitched into the back will read your writing or drawing.",
    "Most of the battery and technical guts have been relocated to a metal-encased central column, leaving the rest of the device pretty bendable. While you can swap in any A5 notebook, keep in mind that their spines will brush up against the center column, so spiral-bound notebooks might scratch it (see third photo below).",
    "This makes the RoWrite 2 a lot easier to throw around like a typical notebook. And with smaller dimensions - down from 225mm x 272mm x 20mm down to 180mm x 240mm x 12.5mm, which is just wider and thicker than a 9.7-inch iPad) - the refined smart notebook is plain easier to haul around.",
    "And with a much longer three-day battery life (up from 8 hours), as well as a connected pen that recharges when it magnetically clips into a groove above the paper pad, everything just feels more thoughtfully designed this time around.",
    "The actual process of translating writing from paper to your device is pretty seamless. You’ll need to use the included RoWrite 2 digital pen which uses real ink (you could probably write inkless, as the sensor-filled rear cover is simply tracking where you’re writing with the connected pen).",
    "Connect the pen and notebook to Royole’s app, start writing, and it transfers over in real-time. For the artists among you, there’s the option to draw in different colors, in highlighter, or in various paint stroke styles and thicknesses. If you just want to import your written notes, there’s a so-so words-to-text recognition feature, too.",
    "If your phone isn’t around, the RoWrite 2 can still store your written pages as on-device data until it can upload to a linked tablet or phone. Assuming they’re stored identically to the original RoWrite, whose 16MB could hold 80 pages, the 8GB of storage on the new model can hold some 40,000 pages.",
    "Simple, straightforward, and handsome to boot, the RoWrite 2 makes a good argument for any IRL-to-digital writing fan who doesn't want to deal with buying more proprietary notebooks, like the pricier Moleskine Pen+ Ellipse.",
    "The RoWrite 2 is only marginally pricier than its predecessor, starting at $129 (around £98, AU$186) and shipping to China in March 2020 and then in April 2020 to the US, Europe, and Japan."
  ],
  "headers": {
    "6": "Easy paper-to-digital"
  },
  "links": {
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "iPad": "https://www.techradar.com/reviews/new-ipad-2018-review",
    "Moleskine Pen+ Ellipse": "https://www.techradar.com/reviews/moleskine-pen-ellipse"
  }
}