{
  "source": "https://www.techradar.com/reviews/zip-archiver",
  "title": "Zip Archiver review",
  "category": "computing",
  "updated": "2020-09-19T10:00:50.986Z",
  "author": "binay-gupta",
  "summary": "A powerful archiving and compression utility",
  "verdict": "Zip Archiver is an easy-to-use free program that makes the process of file compression and archiving simple for even novice users, but we’d like to see the app on other platforms aside from Windows.",
  "pros": [
    "Free software",
    "Fast archiving process",
    "Sleek and user-friendly interface"
  ],
  "cons": [
    "Windows-only",
    "More file format support would be good"
  ],
  "article": [
    "Zip Archiver is a free compression and archiving tool for Windows 7, 8, and 10. It can open, compress, and archive files, and developer Hamstersoft has designed the app to be impressively user-friendly. The program also links in with cloud services, allowing for the direct upload of archive files to the likes of OneDrive, Google Drive or Dropbox.",
    "Zip Archiver uses some nifty tech to facilitate the speedy compression of files, and you’ll likely notice the difference in terms of performance between this utility and rivals.",
    "Zip Archiver can also be used to create copies of archived files and even share them with friends and colleagues via special functions. A shareability feature allows for the sending of compressed files through email, RapidShare, CD, DVD, and other mediums. You can share compressed data files, spreadsheets, pictures, images, or videos with ease and speed.",
    "Zip Archiver comes with a host of features that simplify the task of compressing and archiving files and folders. Several archiving solutions are available for Windows-based systems, but this app has some distinct and particularly useful features.",
    "For starters, Zip Archiver benefits from a sleek and modern interface which looks good and makes it easy to use, and self-explanatory even for the less tech-savvy. It makes the process of compression easier for beginners by guiding them through a wizard. The drag-and-drop feature for selecting files for archiving is another handy feature.",
    "A wide range of file formats are supported, including ZIP, ARJ, BZ2, TBZ, 7Z, GZIP, IMG, GZ, TGZ, ISO, RAR, TAR, and more. You can also compress virtually all types of files in any format, including the more uncommon CAB, BZ, IZH, and IHA formats.",
    "This powerful archiver utilizes all the capabilities of your computer to deliver the best results. It uses an improved ‘Very Fast Zip’ algorithm for zipping and archiving files, managing to strike a good balance between saving space on storage and saving time.",
    "Zip Archiver offers technical support in a whopping 40 languages, including English, French, Spanish, German, Japanese, Korean, Russian, Chinese, Arabic, Portuguese, and many more.",
    "Queries can simply be sent to the company by email at support@hamstersoft.com. There’s also a support page on the official website, where you can type in your question (or feedback) along with your contact details and submit your query. The support team promises a swift response.",
    "Zip Archiver is a robust and handy file compression and archiving tool for Windows PCs. It comes with some interesting features like varying compression levels, password protection of archived files and folders, and even splitting files for data compression.",
    "It’s free as well, which is always a bonus, of course, although it would be good to see the app available outside of Windows-based systems, and we’d also appreciate a somewhat wider level of support for compression formats."
  ],
  "headers": {
    "3": "Features",
    "7": "Support",
    "9": "Final verdict"
  },
  "links": {
    "Zip Archiver": "https://ziparchiver.hamstersoft.com/",
    "compression and archiving tool": "https://www.techradar.com/news/the-best-file-compression-software"
  }
}