{
  "source": "https://www.techradar.com/reviews/advancedmd-medical-billing",
  "title": "AdvancedMD Medical Billing review",
  "category": "computing",
  "updated": "2020-09-24T16:07:10Z",
  "author": "jonas-p-demuro",
  "summary": "Outsource your medical billing",
  "verdict": "AdvancedMD Medical Billing has a compelling offering that dovetails with their EHR, but the multiple poor user reviews gives us pause in signing up.",
  "pros": [
    "iOS mobile app",
    "Integrated reporting and analytics",
    "No long term agreements",
    "Claim Inspector to reduce rejected claims"
  ],
  "cons": [
    "Elusive pricing",
    "High cost",
    "No Android app",
    "Poor customer service"
  ],
  "article": [
    "South Jordan, Utah is the home of AdvancedMD’s 600+ employees. The company focuses on ambulatory medical practices with its cloud medical software solutions. AdvancedMD has a national presence serving over 37,000 clinicians at over 13,000 practices. On the AdvancedMD Medical Billing platform, over 6.5 million insurance claims get processed on a monthly basis.",
    "AdvancedMD has a popular EHR, and their medical billing software builds off of that to fully integrate a billing solution for a single platform approach. The medical billing software module then completely interfaces with the AdvancedMD EHR solution, and all of its components to streamline the front office. For example, through integration with the Medical Scheduling and other front office tools, collecting copays after office visits is a snap, with a “One-click display of patient information, copays & eligibility,” that is easily accessible, and instantly available without having to search for the patient.",
    "Furthermore, this close integration also comes through with the payment processing. Here, the billing software integrates with credit card processing. This enables that with a quick swipe the charges can then auto-post to the patient’s account.",
    "While plenty of EHR’s store their data in the cloud, AdvancedMD claims to have more experience than most with it, as it has been taking this approach since 1999. Running the software in the cloud as well also has the advantage that updates happen on the backend, and therefore the company can ensure that end users are only using the latest version of their software. This also means that there are no additional costs associated with software upgrades, nor hourly backups, and neither the latest encryption technology to keep data safe and secure for a HIPAA compliant environment. Furthermore, hosting the data in the cloud provides a pathway for mobile platform use via iOS devices, although unfortunately there is no app for Android to date.",
    "The cloud approach also enhances the functionality of this EMR, particularly when it comes to a practice with multiple locations, and with multiple providers. A practice such as this is a significant challenge to keep track of, and keep always up to date with the bills with traditional, locally run software solutions. However, via the cloud, and AdvancedMD’s Centralized Billing, this becomes a far simpler task, with the ability to manage multiple providers, across multiple locations with ease, as it all gets fed into a single centralized database.",
    "The Claims Inspector is yet another AdvancedMD billing feature. Rather than have claims bounce out unpaid, they get scrubbed for CCI, HIPAA & LCD errors- before submission. By finding the potential errors earlier, AdvancedMD claims that users will see “An almost-100% first-pass claim acceptance rate.” Insurance eligibility can also be batch checked before appointments to minimize surprises about no coverage afterwards.",
    "User reviews point out some of the shortcomings of AdvancedMD. It starts with the lack of an Android mobile app, although an iOS one is available. The reviews go on to indicate that AdvancedMD is difficult to navigate, runs slowly, and also contains too many glitches with frequent downtime issues. There are also lost documents, and lost billing when the claims do not go through. Furthermore, customer service is difficult to reach, with little accountability, and poor resolution of reported problems, making for a frustrating user experience.",
    "Support for AdvancedMD gets offered via a variety of methods. This starts with contacting support via an online portal to submit a trouble ticket. The other option is Live Chat, but there is no indication what hours it is available. From the website, there is no indication of a dedicated phone number for support,although there is a general number listed.",
    "The AdvancedMD website does indeed provide some promise that the pricing will be forthcoming. After all, it indicates that there are both ways to “Build a Bundle,” and also to “See Preconfigured Bundles,” as seen in the screenshot above.",
    "However, almost predictably at this point, choosing either of the options, merely leads to another opportunity to provide your information in order to proceed.",
    "Persistent, we did enter our info, and were able to find out the pricing for the preconfigured bundles. It starts with the EMR/EHR software which also includes Practice Management, at a cost of $729 (£556) per provider per month for the unlimited plan, or $2.18 (£1.66) for each encounter. The Practice Management option, without the EMR, does give access to Scheduling and Medical Billing Software, costs $429 (£327) for each provider monthly for unlimited usage, or per the encounter for $1.42 (£1.08).",
    "There is also the option for full service revenue cycle management which includes billing and collection services, along with “Insightful expertise.” This has a fixed cost of 4% to 8% of the practice collections, and also includes the software.",
    "A significant pro is that there is no long term contract to lock you or your practice into, giving AdvancedMD the incentive to keep their users pleased with the service.",
    "The AdvancedMD Medical Billing solution is a fully integrated offering to build out the already capable AdvancedMD EHR. The pros include software claim scrubbing, integration with patient scheduling, and data hosted in the cloud. However, count the negatives which center around the user reviews, such as poor support, a difficult to navigate interface, and glitchy software with too frequent downtime issues. In the final analysis, for existing users of the AdvancedMD EHR platform, adding the Medical Billing is a reasonable next step, but otherwise this is not worth switching to for users satisfied with their current EHR platform."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "7": "Support",
    "8": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "AdvancedMD Medical Billing": "https://www.advancedmd.com/medical-billing/",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software"
  }
}