{
  "source": "https://www.techradar.com/reviews/asus-rog-theta-electret-review",
  "title": "Asus ROG Theta Electret review",
  "category": "gaming",
  "updated": "2020-08-18T12:15:57.889Z",
  "author": "gerald-lynch",
  "summary": "An interesting idea not ready for the masses just yet",
  "verdict": "The Asus ROG Theta Electret is an interesting experiment in gaming audio, but it isn't quite ready for the prime time just yet.",
  "pros": [
    "Intriguing design",
    "Detailed sound",
    "Wide soundstage"
  ],
  "cons": [
    "Pricey",
    "Weak bass",
    "Needs extra gear to really sing"
  ],
  "article": [
    "There aren’t many gaming headsets like the Asus ROG Theta Electret. Making use of electret drivers alongside discrete neodymium bass drivers, it’s making good on its audiophile-aiming design, pushing clarity and a wide soundstage over the frills of other high-end gaming headsets.",
    "But it’s a curious headset too – the Asus ROG Theta Electret is priced high, doesn’t offer surround sound, is large in design, and requires additional equipment in order to make it truly sing. When the stars align, it’s a fantastic headset, but it’s relatively small feature set and enthusiast-style leanings make it only for the most discerning PC audio connoisseurs.",
    "The Asus ROG Theta Electret is available now from a small selection of retailers, with prices hovering around the £259.99 ($340 / AU$480) mark.",
    "That puts it in the upper echelons of gaming headset pricing though, from an audiophile perspective, its components justify that price.",
    "The Asus ROGTheta Electret is a Hi-Fi grade gaming headset that, thanks to its sole 3.5mm headphone jack connection, will work with basically any platform you care to game on. Plug it into your PC, Nintendo Switch, PS4 DualShock pad or Xbox One pad and it’ll work straight away, with its cable carrying both output and mic-input signals from the detachable boom. There’s no dongle, Bluetooth or wireless functionality to fiddle with.",
    "With an impedance of 32 Ohm, it takes a fair bit of oomph to drive the Asus ROG Theta Electret, so don’t be surprised if they feel a bit quiet or weak when plugged into a console controller. They’re clearly intended to be used with an external amplifier, and so it’s a set probably best suited to use with a PC. The non-detachable cable, extending from both the left and right cans, is only 1.5m long, which may be a problem if your rig doesn’t have front-mounted headphone sockets. Thankfully, Asus pops a 1.2m mic splitter / extension cable in the box.",
    "The exterior design makes the Asus ROG Theta Electret an obvious stablemate of Asus’ Republic of Gamers line. Though there’s no RGB lighting here, you’ve got the same angular, black design language that you find across Asus' gaming line-up. It’s an aggressive style, and it’s defiantly big here – the ROG Theta Electret, with its steel padded band and D-shaped earcups feels ginormous on your head. And though it’s relatively weighty at 555g, that weight is very well distributed, making for a mostly-comfortable headset.",
    "Along with that 3.5mm extension cable in the box, you’ll also find a set of different ear cushions that can be swapped out. Both are chunky and squishy (with extra, welcome care made to support glasses wearers), but one is finished with a premium protein leather, while the other has a more breathable fabric, better suited to hot environments and longer play sessions.",
    "Perhaps most interesting though is what’s going on inside the headset. The Asus ROG Theta Electret is packing in 120mm electret drivers, rarely used outside of audiophile circles, along with separate 45mm neodymium bass drivers.",
    "Those large electret drivers, which hold a static charge, don’t require a separate headphone amplifier, and ASUS believes their use leads to a more spacious and detailed sound. We’d still encourage you to pair the Theta Electret with an amp, or you’re going to find them lacking in overall power. But objectively they can be used without one.",
    "Unless your PC has a very fancy sound card, you’re going to want to pair the Asus ROG Theta Electret with an amp or DAC. As mentioned before, you’re going to run into some volume trouble with a console pad as a result.",
    "Out of the box, the Theta Electret can sound a bit flat, but pair it with Asus' Sonic Studio software, and they come alive, with EQ settings that add depth to the neutral default.",
    "You get a great sense of distance and movement from the ROG Theta, which boasts a very spacious and wide soundstage. Voices punch through clearly, and finer details (like the tropical ambient sounds of Shadow of the Tomb Raider) glisten. You’ll hear things you never knew were there before.",
    "But the dual driver array seems to introduce an unwanted side-effect. Balancing two separate driver systems is always difficult – it’s why it’s so rarely done. And here the trade off comes at the expense of bass.",
    "The Asus ROG Theta Electret never really thumps as you’d like it to. Blasts lack power, and anything approaching subsonic just feels lost. It can make the overall sound feel quite thin, as if ASUS has been worried the bass drivers will overpower the delicate skills of the electret drivers. It leads to a curious sound – one that’s crisp and attentive, but lacking in warmth. At the price, it feels incomplete – especially considering there’s no 3D audio component involved.",
    "Their size and lack of wireless connectivity make it unlikely that you’re going to want to take the ROG Theta for a walk with your smartphone, but they do a decent job of playing back music. The bass again can be shallow without some EQ fine tuning (especially on mobile devices), but the detailed highs and mids can be quite pleasing.",
    "As for the bendy detachable mic, it did a solid job of picking up audio, and transmitted it clearly over Discord. It’s detachable nature is welcome, letting you remove it when not in use, and replacing it if it ever gets damaged."
  ],
  "headers": {
    "0": "One minute review",
    "2": "Asus ROG Theta Electret price and availability",
    "4": "Design",
    "10": "Audio quality",
    "17": "Don't buy it if..."
  },
  "links": {
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot"
  }
}