{
  "source": "https://www.techradar.com/reviews/xiaomi-mi-true-wireless-earphones-2-basic",
  "title": "Xiaomi Mi True Wireless Earphones 2 Basic review",
  "category": "audio-visual",
  "updated": "2021-07-15T14:14:35Z",
  "author": "lewis-leong",
  "summary": "Great for calls and podcasts but not much else",
  "verdict": "The Xiaomi Mi True Wireless Earphones 2 Basic are one of the cheapest true wireless headphones you can buy and they come with a lot of compromises. The headphones are well-made, have touch controls, and are extremely affordable but they simply don’t sound good. The price may be attractive but our recommendation is to save up to buy something better.",
  "pros": [
    "Bluetooth 5.0",
    "Auto-pause feature",
    "Affordable"
  ],
  "cons": [
    "Poor fit",
    "Bad sound",
    "Limited controls"
  ],
  "article": [
    "The Xiaomi Mi True Wireless Earphones 2 Basic are a budget pair of true wireless headphones from the Chinese phone maker.",
    "They’re a more affordable version of the Xiaomi Mi True Wireless Earphones 2 yet feature an hour extra of battery life in the headphones themselves.",
    "On paper, the Xiaomi Mi True Wireless Earphones 2 Basic seem like a good deal... but our testing revealed otherwise.",
    "The Xiaomi Mi True Wireless Earphones 2 Basic cost just $45 (£40, about AU$63), making them among of the most affordable true wireless earbuds from any mainstream manufacturer.",
    "Availability is mixed with easy availability in the UK and EU, and unfortunately the earphones aren’t available in the US, though you can find similar rebranded models on Amazon. Hopefully that will change soon, though.",
    "There’s no denying that Xiaomi took heavy inspiration from the Apple AirPods: the headphones themselves feature a near clone of the AirPod’s buds but the stalks themselves are quite a bit longer and thicker than Apple’s svelte headphones.",
    "Like the AirPods, the Xiaomi Mi True Wireless Earphones 2 Basic feature touch controls... but that's not such a good thing as the controls are just as frustrating here as they are on the AirPods. Using the controls you can play/pause the music, answer calls, and activate your voice assistant, however there’s no way to adjust volume or control music playback, which is a huge drawback.",
    "Also, the Xiaomi Mi True Wireless Earphones 2 Basic are earphones and not earbuds, which means sound can get in and out. This is good if you want to maintain situational awareness while on runs or walks outside.",
    "The bad news? If you need a pair of headphones to block out the noise of the outside world, you’ll have to look elsewhere.",
    "The Mi True Wireless Earphones are optimized to work well with Xiaomi’s phones, mimicking the AirPods’ and iPhone’s quick pairing feature. However, they are easily paired via the traditional method with non-Xiaomi phones.",
    "One nice-to-have feature of the Xiaomi Mi True Wireless Earphones 2 Basic is auto-play pause, which uses an optical sensor in the headphones to detect when you’ve removed them from your ear, pausing your media immediately. Placing the earbuds back in your ear resumes playback.",
    "Other features include Bluetooth 5.0, AAC/SBC codec support, and quick charging. Battery life is rated for 5 hours per charge and the charging case can top off the headphones 3 times for an overall 20 hours of playback. The case and earbuds charge quickly from flat in just 90 minutes.",
    "Sound quality is where the Xiaomi Mi True Wireless Earphones 2 Basic falls flat. Music sounds like it's being played by a small Bluetooth speaker with no depth, poor resolution, and very little bass. Vocals are the highlight, which makes acoustic music and podcasts sound decent. However, highs lack extension, resolution, and can be fatiguing after long periods of listening.",
    "There’s a hint of what bass could be, especially if you force the earbuds deeper into your ears but as they rest loosely in the concha, bass is lacking in impact, resolution, and extension. Bass simply sounds like a muddy mess. Overall, music sounds lifeless from the Xiaomi Mi True Wireless Earphones 2 Basic.",
    "The bright side is that the Xiaomi Mi True Wireless Earphones 2 Basic are great with calls and listening to podcasts where resolution isn’t as important. Friends and family reported clear sound from the headphone’s mic.",
    "It’s hard to recommend the Xiaomi Mi True Wireless Earphones 2 Basic except for those who want the AirPods look without paying the AirPods price. There are better alternatives for just a little more like the SoundMAGIC TWS50 true wireless in-ear headphones. The SoundMAGICs actually sound good, passively cancel out noise, and are sweat resistant.",
    "The Earfun Free True Wireless are an excellent value for just a bit more and include nice-to-have features like wireless charging and 30 hours of overall battery life. And, if you can stretch the budget even more, the Cambridge Audio Melomania 1 are a great value in the cheap true wireless headphone market."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "9": "Features",
    "12": "Audio",
    "15": "Final verdict"
  },
  "links": {
    "Xiaomi Mi True Wireless Earphones 2": "https://www.techradar.com/reviews/xiaomi-mi-true-wireless-earphones-2",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "SoundMAGIC TWS50 true wireless in-ear headphones": "https://www.techradar.com/reviews/soundmagic-tws50-true-wireless-in-ear-headphones",
    "Earfun Free True Wireless": "https://www.techradar.com/reviews/earfun-free-true-wireless",
    "Cambridge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1"
  }
}