{
  "source": "https://www.techradar.com/reviews/zippyshare",
  "title": "ZippyShare review",
  "category": "computing",
  "updated": "2020-04-03T17:58:19Z",
  "author": "mayank-sharma",
  "summary": "Free for all",
  "verdict": "ZippyShare does exactly what its name suggests and little else. It makes for a quick file sharing platform that doesn’t cost anything but lacks the features to make it useful for regular long-term storage.",
  "pros": [
    "Unlimited disk space",
    "Absolutely free",
    "No Download limit"
  ],
  "cons": [
    "30 day file retention",
    "No advanced features"
  ],
  "article": [
    "You wouldn’t be wrong to dismiss it as a scam: a service that offers unlimited hosting space for free sounds too good to be true. But rest assured, is a legitimate file sharing service, its peculiarities and shortcomings notwithstanding. In fact, ZippyShare has been operational for more years than several of the current crop of file sharing services.",
    "Interestingly you can use ZippyShare to transfer and share files without even spending time registering yourself with the service. While this feature is good for quickly sharing the odd file or two, if you plan on using the service regularly it’s best to register an account to get access to some useful features.Before we explore its features, remember that ZippyShare is only a file sharing solution, and little else. In other words, don’t be surprised if it’s missing some of the features that you’ll get with other services.",
    "One of ZippyShare’s most striking features is that it offers unlimited disk space, which is practically unheard of for file sharing services. However, the individual uploads cannot be larger than 500 MB in size. This shouldn’t be a problem for most legitimate uses and is imposed in order to dissuade users from using the service to share files illegitimately.",
    "Another feature that is common with the free accounts on other file sharing services as well, is that ZippyShare will automatically delete files in your account after 30 days of inactivity on them. So if any of your files haven’t been downloaded in the last month, ZippyShare will remove them for good. There’s no recycle bin from where you can restore the deleted files. If you need to share the deleted files, you’ll have to upload them to your ZippyShare account again.",
    "Another positive, is that just like its disk space, ZippyShare has no bandwidth cap on the downloads as well. You can share the files with anyone and these will be available for download as long as they aren’t dormant for longer than the threshold.",
    "One feature that wouldn’t be of much use to TechRadar Pro’s readers but is a nice touch in the larger context, is ZippyShare multilingual interface. Besides English, you can use the service in a dozen other languages, which does wonders to the service’s accessibility.",
    "Like I’ve mentioned earlier you can use the service without registering an account, but it’s best to do so. You don’t get the convenience of single sign-on but it requires little more than your name and login credentials.",
    "The interface for uploading files remains the same: a simple text box into which you can drag and drop and number of files and folders. ZippyShare will display the progress of each file while they are being uploaded. The uploads are quick and there’s no artificial delay, which again is a surprise considering the service doesn’t cost a penny. When a file has been uploaded, ZippyShare will automatically share it and publish the URLs for accessing the file.",
    "The service also offers the option to upload files from a remote URL. This is a rather exotic feature and I was surprised to see it on ZippyShare. But while it did accept the remote links to files I pasted in the designated area, they never showed up in my account and the URLs it generated for these files always returned a “File not found” error.",
    "In terms of apps, ZippyShare doesn’t offer to write home about. Unlike its peers, it doesn’t supplement the web interface with browser extensions. Neither does the service have any smartphone apps. To upload and share content from your phone, you’ll have to access ZippyShare using the web browser on your phone.",
    "The service does offer an app for the desktop but only for Windows. Even then the app is nothing but an upload assistance tool. You can use the app to upload multiple files, but you’ll have to queue them up before hitting the upload button, pretty much like the web app. ALso, just like the web app, the desktop app also spits out URLs once the files have been uploaded to your account.",
    "The only real advantage of the app is that you can use it to upload files larger than 500 MB. When you point it to such a large file, the app offers to split files into chunks of 500 MB. In our tests though the app failed to split Linux ISO images, but worked as advertised on some home videos that were in the MP4 format.",
    "It’s not hard to imagine that the free service sustains itself via adverts, most noticeably on the downloads page. They are usually not intrusive but some download links bring up a lot of ads, pop-ups, and re-directs that are pretty annoying.",
    "ZippyShare isn’t the only service to offer a free account. MediaFire also supports its free account via ads. However, while you can upgrade to a paid account for an ad-free experience, the lack of a similar option for ZippyShare is irksome.",
    "While I can still live with the ads, the real problem for me is the lack of privacy options. Both its web and desktop uploaders give you the ability to mark uploads as private, which won’t be shared automatically. You can also password-protect directories, which when shared will require the password before permitting access to the files. And that’s about it. You’ll be disappointed if you’re looking for access controls or two-factor authentication, which you get with Mega’s free account.",
    "We were also impressed by Mega’s encryption options. While ZippyShare will pipe all transfers through https connection, it doesn’t do end-to-end encryption, which is another must-have feature especially if you’re looking to use the service on a regular basis.",
    "Also, ZippyShare’s lack of smartphone apps doesn’t bode well for the service. It’s the inverse of MediaFire, which has apps for Android and iOS but no desktop app. Even ZippyShare’s desktop app is’t of much use. It lacks useful features like the file syncing you get with other services like pCloud and Mega.",
    "Although the service doesn’t cost a penny, it won’t suit everyone. The adverts are a major turn-off especially since you can’t pay to turn them off. Then there’s the lack of security options, which discounts the service for sharing important files. The lack of a sync option in its desktop app means you can’t use ZippyShare to conveniently sync your files between different computers and devices.",
    "In fact, all things considered, ZippyShare has a very specific use case -- it’s best only for casual users who want to share non-important files that are too big to email. Everyone else will be better served elsewhere."
  ],
  "headers": {
    "2": "Features",
    "6": "Interface and use",
    "9": "Apps and Downloads",
    "13": "The competition",
    "17": "Final Verdict"
  },
  "links": {
    "file sharing service": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "ZippyShare": "https://www.zippyshare.com/",
    "MediaFire": "https://www.techradar.com/reviews/mediafire",
    "Mega": "https://www.techradar.com/reviews/mega",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Android": "https://www.techradar.com/best/best-android-apps-2021",
    "iOS": "https://www.techradar.com/best/best-iphone-apps-2021",
    "file syncing": "https://www.techradar.com/best/best-file-syncing-solution",
    "pCloud": "https://www.techradar.com/reviews/pcloud"
  }
}