{
  "source": "https://www.techradar.com/reviews/xiaomi-poco-x3-nfc",
  "title": "Xiaomi Poco X3 NFC review",
  "category": "phones",
  "updated": "2020-12-10T12:05:25Z",
  "author": "andrew-williams",
  "summary": "A lot of phone for not very much cash",
  "verdict": "Poco is back with another hot deal. The Poco X3 NFC comes with a few features you might expect of a pricier Android handset, such as decent gaming performance thanks to its Snapdragon G-series processor and a 120Hz screen, with excellent battery life sealing the deal. This is a great option for those on a budget.",
  "pros": [
    "Strong gaming performance",
    "Excellent battery life",
    "Great 120Hz wide color gamut screen"
  ],
  "cons": [
    "Struggling camera",
    "Sometimes erratic backlight",
    "It’s quite large, a little heavy"
  ],
  "article": [
    "The Xiaomi Poco X3 NFC is all about value, like every Poco handset before it and almost every Xiaomi device.",
    "But the strategy has changed since 2018’s Pocophone F1. The Poco X3 doesn’t come with a top-tier Snapdragon 8-series processor, because fitting one into a budget phone just doesn’t seem feasible anymore.",
    "However, the end result is similar. The Poco X3 NFC is probably the best phone for gaming at its price. It has a large, well-specced screen, loud stereo speakers, and its Qualcomm Snapdragon 732G processor handles titles such as Fortnite far better than the Snapdragon 665 and Exynos 9611 phones you might buy for the same cash.",
    "It’s simply miles ahead. Even Realme, maker of some of 2020’s best budget phones, doesn’t have anything that can directly compete at launch. Excellent battery life and a nerd-pleasing 120Hz display panel top off the Poco X3 sundae, and make this one of the best buys for techies on a tight budget.",
    "There are a few bits to improve, however. Its screen has a situation-specific erratic backlight flicker, which we believe should be fixable via a firmware update. The odd glitch suggests the Poco X3 NFC is due a system stability update, too.",
    "Only one issue is less likely to be fixed further down the road. The Poco X3 NFC has an impressive-sounding 64-megapixel main camera. It takes good shots, but suffers from significant purple fringing, more so than the majority of rival phones in this price range.",
    "Still, its digital 2x mode is better than most and while its low-light performance won’t worry the Google Pixel 4a, it’s at least on a par with the better budget Androids.",
    "There are still reasons to step up to a phone such as the Realme X50 5G. It has 5G, its performance is a step up, and its glass back feels nicer. But at this level, such a leap in cost may not appear insignificant.",
    "The Poco X3 NFC went on sale on September 17, 2020 in Europe. We don’t have confirmed US pricing and availability details just yet, but the European figures are enough to catch the eye.",
    "The base model Poco X3 NFC costs £199 (about $250, AU$360) and comes with 6GB of RAM and 64GB storage. An upgrade to 128GB storage bumps up the price to £229 (around $300, AU$420), although this is an early bird deal that may rise to £249 (around $320, AU$450).",
    "An additional 64GB storage is a welcome layer of cushioning, but since the RAM remains at 6GB, you’re unlikely to see any performance boost unless there’s a major difference in the speed of the storage itself.",
    "The Poco X3 NFC is one of the best value phones around for several reasons – but it comes sporting the same style and build as the majority in its class. This means the phone’s back is plastic rather than glass, and the sides are plastic rather than aluminium.",
    "You may read online that the sides are metal, but this appears to refer to the thin black band that sits between the glass screen and plastic sides.",
    "We’ve used the Poco X3 NFC in its bundled silicone case throughout testing, which makes its plastic aesthetic less obvious. But it also highlights that this is a large device.",
    "The Poco X3 has a 6.67-inch screen. Despite coming to this device from the 6.53-inch Xiaomi Redmi Note 9, the difference is obvious – so prepare yourself. Although, since Poco phones tend to attract the enthusiast crowd, it likely won’t be a huge problem to them.",
    "What may be an issue is the giant Poco logo on the rear of the device. Plastering the back of a phone with huge lettering is 2020’s most unfortunate tech design trend. But, we don’t actually hate it.",
    "The “Poco” part is built into a layer under the surface; it actually pulls off an attempt to look like the insignia of a fashion brand. We’d much rather this than a slogan such as “take back control” or “dare to leap”, which can be seen scrawled across the Realme X7. Pass the sick bag.",
    "Silicone cases aren’t likely to improve the aesthetic of a phone, but the Poco X3 NFC is clearly made to be used with one (such a case is bundled). It has a camera housing almost as prominent as that on the Samsung Galaxy Note 20 Ultra. In fact, it’s so pronounced that the case has a little lip that extends to meet the housing. This is in order to avoid scuffs to its sides, should you accidentally drop the X3 NFC.",
    "Poco makes it more of a feature by drawing a circle around the camera, with both case and rear design. This makes the camera appear more “techy” and advanced, even if it doesn’t comprise particularly remarkable hardware.",
    "There’s plenty of good elsewhere, though. The Poco X3 NFC has excellent speakers for a $200-ish phone.",
    "You get a loud stereo pair, which means you can listen to a podcast while you cook or have a shower without issue. We always prefer a stereo setup when watching YouTube, too.",
    "The Poco X3 NFC has an IR blaster, which allows the phone to act as a universal remote, a headphone jack, and a side-loaded fingerprint scanner. This scanner isn’t the fastest around. You’ll see a delay of around half a second before the homescreen appears, but it does work every time with a clean, dry thumb.",
    "Of course, the Poco X3 NFC comes with NFC, used for wireless payments.",
    "The Poco X3 NFC has just about the most advanced display at the price. This is a 6.67-inch IPS LCD panel of 2400 x 1080 pixel resolution, and has a trim punch hole for the front camera.",
    "While impressive, they alone don’t make the Poco X3 screen special. It’s the 120Hz refresh rate that does. Most budget phones come with a screen that refreshes 60 times a second. The panel here refreshes at up to 120 times a second.",
    "It’s in the app menu where you’ll notice this most. Your current phone may not look clunky in motion, but put it next to the Poco X3 NFC, and you’ll be proved wrong.",
    "That said, the app menu may be the only place you’ll notice the higher refresh rate, and note that it does have an impact on battery life. Still, this is a remarkably capable screen. It supports wide gamut colour and HDR, and 1080p Netflix streaming.",
    "With a brightness of 450 nits, this isn’t the brightest sub-$400 phone; the Realme X50 5G is a little brighter. Nevertheless, it’s still among the brightest Android phone’s available at under $300/£200. In most respects the Poco X3 NFC has an unfeasibly good screen, but there is one problem.",
    "Backlight flickering was apparent on several occasions through testing. Further investigation suggests this may be the Poco X3 NFC rapidly cycling between its standard maximum and the “sunlight” mode, designed to boost the display in bright conditions outdoors.",
    "However, we’ve seen it appear in lesser form when Auto brightness is switched off. So what’s going on?",
    "Our preliminary conclusion is that the Poco X3’s display optimization may be a little overbearing, and require sorting through a firmware update. The specificity of the conditions in which we’ve seen these quick changes in backlight level don’t appear to suggest it’s an unfixable hardware issue. Fingers crossed.",
    "The Poco X3 NFC has four rear cameras arranged in a striking rounded-off rectangle, the LED flash providing symmetry.",
    "The main camera has a 64-megapixel Sony IMX682 sensor, which is more desirable than the Samsung GM1 unit that features in some other affordable phones such as the Samsung Galaxy M31. Sony sensors are often better.",
    "The second camera has an ultra-wide lens and an unnamed 13-megapixel sensor. Like so many budget Androids, the other two sensors are low-end 2-megapixel units for macro photos and “Portrait” images with background blur.",
    "There are highs and lows with this camera setup. Overall, though, you end up with solid Poco X3 NFC camera performance, but nothing that sets a new standard.",
    "So how do its photos look? These days, you’ll be able to take decent pics in good light with any $200-300 phone, so we went out for a shoot with the Samsung Galaxy M31 and Xiaomi Redmi Note 9 for a closer comparison.",
    "The Poco X3 seems to have the most measured approach to exposure and contrast. It’s better at preserving highlights than the Redmi Note 9, and doesn’t try as hard to make images pop through sharpening and contrast-boosting as the Samsung.",
    "However, processing is a little heavy-handed habit, turning fine textures into oil painting-like strokes. Far-away gravel became a lattice of maggots, more so than in pics taken with the Redmi and Samsung phones. This is right down at pixel level; you won’t notice it unless you really zoom in.",
    "In terms of image quality, you’ll notice significant purple fringing. This is where the areas of very high light contrast are outlined in purple. Trees against a bright sky and reflections in water set this off, and the Poco X3 NFC has one of the most obvious cases of purple fringing we’ve seen in some time.",
    "It’s a form of chromatic aberration, and suggests the Poco X3 NFC’s main camera doesn’t have a good enough lens, despite its reasonably “fast” f/1.89 aperture. A few more pennies spent here would have paid off.",
    "This is one area where you almost end up wishing the Poco X3 had a smaller sensor, as perhaps then it could have used one of the lens components seen in rivals that don’t suffer such optical issues. The lens also exhibits relatively poor sharpness at the very edges of the frame.",
    "Still, you do see the benefits of the high-resolution sensor when shooting at 2x zoom. There’s no zoom hardware here, but zoomed images don’t instantly look like sensor crops (which is what they are).",
    "As 2x images use the central part of the frame, it gets the best of the lens’s limited optical quality. The Poco X3 NFC’s wide camera doesn’t suffer such obvious issues. It's pretty good, and a cut above many cheap Android ultra-wides.",
    "Macro shots are a different story, though. The macro camera only has a dismal 2-megapixel sensor, a clear sign it’s there to make up the numbers.",
    "Use the 2x zoom to take macro images of the same subject and they’ll look far better and sharper than anything the dedicated macro hardware can manage. They look pretty good, actually.",
    "The Poco X3 NFC’s final camera is a 2-megapixel depth sensor. This doesn’t capture images as such, but is used to calculate a depth map of the scene for background blur.",
    "As with most low-end depth hardware, it can’t keep up with complicated scenes or those where there isn’t clear delineation between your subject and the background. However, the 2-megapixel sensor does mean you can take background blur images of anything, not just people.",
    "Plenty of phones let you do this without dedicated depth sensors. Although, some rivals are restricted to depth images of people because they don’t have one.",
    "Some of your Portrait images won’t look quite right, but it’s worth having a play with this mode. Nail the shot and it can be a real eye-charmer.",
    "How about low-light image quality? The Poco X3 NFC has a non-stabilized main camera but it does have a Night mode.",
    "Like most of the best night modes, it takes a couple of seconds to capture an image. But unlike the best, its main effect is to bring out shadow detail, to increase dynamic range, rather than to radically improve all-round clarity and detail.",
    "Still, it’s effective at the part of the job it does, and the Poco X3 NFC is far from the worst night shooter in its class.",
    "We’ve highlighted a few limitations and issues with the camera here, but looking back through the images taken with the Poco X3 NFC, we’re mostly happy. There were no major exposure, colour or dynamic range issues; in fact, many of the shots look great.",
    "Video, too, is solid. It tops out at 4K resolution, 30 frames per second. There’s no 4K/60 here. However, electronic image stabilization is available right up to the top capture mode.",
    "Without it, your handheld footage will look shaky and amateurish. Stabilization is most effective at 1080p, so don’t assume you should always head straight to 4K.",
    "The Poco X3 NFC is more powerful than most other phones you might consider at the price.",
    "The Snapdragon 732G processor inside this handset is far more powerful than the Snapdragon 665 and Samsung Exynos 9611 found in high-profile rivals such as the Motorola Moto G8 Power, Samsung Galaxy M31 and Oppo A72.",
    "In Geekbench 5, the Poco X3 NFC scores 1,699 (549 per core) to the 1,330-odd you’d see delivered by a Snapdragon 665 device.",
    "This isn’t the most important performance angle of the Poco X3 NFC, though. Its GPU is even further ahead. It scores 2,622 in 3DMark’s Sling Shot Extreme test and 2,437 using the Vulkan graphics API. A Snapdragon 665 phone usually scores around 1,300.",
    "The Poco X3 NFC’s CPU performance is above average, then, but its gaming power is through the roof.",
    "This phone plays Fortnite better than others in its class. The game only lets you play at Medium graphics, but it ticks along happily enough at 25fps for much of the time with the dynamic resolution slider maxed out.",
    "While this may not sound like gaming nirvana, it is when you consider that Fortnite is among the most demanding Android games, with many cheaper devices unable to handle it.",
    "The phone world never stands still, and the Poco X3 NFC is sure to be beaten or matched before too long. But, at the time of review in September 2020, this is the best budget gaming phone around.",
    "And it isn’t just about raw power. The large, bold screen and great stereo speakers matter, too.",
    "What about games other than Fortnite? Everything runs perfectly, or very well indeed. ARK: Survival Evolved is playable at Epic visuals with the resolution slider maxed, but you may want to diminish the graphics a little to make it run smoother. We find it comfortable enough maxed, but it isn’t Snapdragon-865-smooth.",
    "So, is the Poco X3 NFC the perfect budget performer? Not quite. Use it in its 120Hz display mode and scrolling around Android feels quicker than any other phone in its class. However, the experience wasn’t entirely seamless: we did notice a few odd pauses during testing.",
    "There’s nothing obvious that we can put our finger on to explain these – very minor – blips, which leads us to believe that a system stability update is all that’s needed to zap them. Still, right now, the Realme X50 5G and its Snapdragon 765G processor get you closer to that “flagship” feel on a budget.",
    "The Poco X3 NFC feels similar to its budget compatriots day-to-day, but with dramatically better results when you play a visually advanced game.",
    "This phone is also a good vehicle for MIUI 12, the latest version of Xiaomi’s Android interface. It has the option of an app drawer as standard and the “animation framework” has been redesigned. This makes Android transitions feel less abrupt. The focus is now on smoothness rather than the pure speed of getting from A to B.",
    "It’s a pleasant update that makes MIUI as good as any interface out there. The Settings menu doesn’t look quite as consistent as some, but after the first few days of tweaking, you’re unlikely to need to head there that often anyway.",
    "What you see in our Poco X3 NFC pics is a slightly tweaked version of the interface out of the box. We made the icons smaller and fiddled with the apps menu transparency, to make it look more like the also-lovely Xiaomi Redmi Note 9 from which we switched.",
    "MIUI 12 makes such style tweaks a cinch. Fairly comprehensive customization is on tap.",
    "The $200-300 category is the place to be for battery life. Companies such as Xiaomi have been squeezing huge batteries into their affordable phones for some time now, and even Samsung is now getting in on the act with its M-series of phones. The Galaxy M51 has an incredible 7000mAh battery.",
    "Xiaomi hasn’t gone that far. The Poco X3 NFC has a 5160mAh battery, just a mite bigger than the 5040mAh found in its sibling, the Xiaomi Redmi Note 9.",
    "The results are much the same, however. Use the Poco X3 NFC in its 60Hz screen refresh mode and stamina is superb. This phone could easily last two full days between charges, even with moderate use.",
    "We’ve struggled to get it close to empty by bedtime, even with lots of Twitter flicking and eBay digging. The 120Hz mode does seem to have a marked impact on battery life, but the Xiaomi Poco X3 NFC still outlasts just about all $1,000-plus Android phones at 120Hz.",
    "The only time we got close to needing to recharge before midnight was on a day with some travelling. It was fairly low by the evening, but only because we’d mistakenly left the Poco X3 NFC’s Wi-Fi hotspot switched on for several hours. Oops.",
    "That you can get away with energy-sapping mistakes such as this and still have juice in the tank shows just how good the phone’s battery really is.",
    "Ninety minutes of locally stored video at maximum brightness takes 15% off the battery in the 60Hz mode, or 17% in the 120Hz mode. It’s a fairly minor change, and as far as we know, the phone doesn’t use a dynamic screen refresh to alter the refresh rate to suit what’s on the screen.",
    "Charging speed is class-leading, too. The Poco X3 NFC has a 33W charger, the kind you might only have seen in a top-tier phone until recently. It means the brick is larger, too, but we’ll put up with that given it can get the battery from flat to 58% in only 30 minutes.",
    "It’s yet another case where you wonder how Xiaomi fits it all in at the price.",
    "First reviewed: October 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Poco X3 NFC price and release date",
    "11": "Design",
    "23": "Display",
    "31": "Camera",
    "55": "Specs and performance",
    "72": "Battery life",
    "81": "Don't buy it if..."
  },
  "links": {
    "Pocophone F1": "https://www.techradar.com/reviews/poco-f1",
    "best budget phones": "https://www.techradar.com/best/best-cheap-phones",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Xiaomi Redmi Note 9": "https://www.techradar.com/reviews/xiaomi-redmi-note-9-review",
    "Motorola Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power",
    "Oppo A72": "https://www.techradar.com/reviews/oppo-a72-review",
    "Realme X50 5G": "https://www.techradar.com/reviews/realme-x50-pro-5g"
  }
}