{
  "source": "https://www.techradar.com/reviews/lenovo-ideapad-flex-3-chromebook",
  "title": "Lenovo IdeaPad Flex 3 Chromebook review",
  "category": "computing",
  "updated": "2021-04-13T00:37:02.878Z",
  "author": "jeremy-laird",
  "summary": "Lenovo’s 2-in-1 Chromebook isn’t slick, but it is excellent value",
  "verdict": "Lenovo’s 2-in-1 Chromebook looks old school, but it’s built to last, both physically and in terms of battery life.",
  "pros": [
    "Excellent value",
    "Solid build quality",
    "Great battery life"
  ],
  "cons": [
    "Looks ancient",
    "Not terribly compact",
    "Weak performance"
  ],
  "article": [
    "If context matters, the most critical qualifier concerning the new Lenovo IdeaPad Flex 3 Chromebook is cash. This thing is cheap. At under £300 in the UK and less than $350 Stateside (around AU$500), it’s affordable enough to earn some leeway when it comes to expectations.",
    "Which is handy, because there are one or two shortcomings you really can’t miss. The most obvious is the Flex 3’s 11-inch screen. Given the tablet convertible 2-in-1 remit, diminutive proportions aren’t automatically an issue. They could be an advantage. In this case? Not so much, thanks to some hugola bezels including an exceptionally elephantine chin.",
    "The net result is not only a conspicuously old fashioned-looking device but also one that’s bigger than it might otherwise be. The 1,366 by 768 pixel native resolution of the screen is likewise a reminder of an earlier era. In fact, the old school vibe extends beyond the screen. Aesthetically, everything from chassis to keyboard gives the impression of being somewhat oblivious to the last decade of laptop design.",
    "With the exception of the 360 degree hinge, that is. It’s solidly executed and marks a literal and metaphorical turning point around which the Lenovo IdeaPad Flex 3 Chromebook transitions to its strengths. This is a very solid feeling device, especially given the price point, with a remarkably rigid body.",
    "The Flex 3 is also decked out with impressive connectivity. Both sides of the chassis sport USB-C and USB-A sockets, which are complimented on the left by a micoSD card reader and headphone jack on the left and a volume rocker and power switch on the right. We just wish the latter was located inside near the keyboard. It’s all too simple to accidentally bump it when switching between tablet and laptop modes.",
    "If the sheer quality of the Flex 3 is surprising, its core specifications are less so. Processing power comes from an Intel Celeron N4020 CPU. That’s a dual-core chip derived from Intel’s low-power and low-cost Atom line of processors, rather than the premium high performance Core family.",
    "Alongside the Celeron chip is 4GB of system memory and just 64GB of eMMC-style storage. All told, it’s a pretty unimpressive technical line up that represents a bottom-rung Intel-powered solution. Were this a Windows laptop or convertible, that would be enough to have us running for the hills. However, the Chrome OS environment is both less demanding and also cloud-centric. So, outright performance and local storage are not as critical.",
    "All of which means that the subjective experience is much better than you’d get in the Windows environment with the same hardware. The Lenovo Flex 3 feels pretty responsive, whether it’s streaming video or working in Google Docs. In tablet mode, the touchscreen functionality is fairly slick, with only occasional stuttering from the interface when swiping or scrolling.",
    "As for battery life, this is one seriously long lasting machine, notching up over 16 hours of video playback.",
    "Ultimately, it all comes back to that context. This is not a high performance device. But when you factor in price, the Lenovo IdeaPad Flex 3 Chromebook is both surprisingly effective and appealing.",
    "At $339 (£299, AU$499) the Lenovo IdeaPad Flex 3 Chromebook packs quite a punch. It’s full-function 2-in-1 with an 11-inch IPS display and excellent build quality. It makes the likes of Google’s now defunct Pixelbook look incredibly expensive.",
    "Of course, there are now numerous affordable 2-in-1 Chromebooks to choose from, including the Acer Chromebook Spin. The general theme in that class of Chromebook involves low-power processing and limited storage. The Flex 3 is no exception.",
    "Meanwhile, alternatives such as the Asus Chromebook Flip and HP Chromebook X360 demonstrate what a little more cash will buy. But the Lenovo IdeaPad Flex 3 has carved out a little niche of its own thanks to that particularly good build quality and some good features including dual USB-C ports.",
    "Rounding out the main features, wireless connectivity takes the form of WiFi 802.11 AC and Bluetooth 4.2. Cutting edge, the Flex 3 is not. But the core functionality is all present.",
    "De-box, power up and it’s initially hard to look past those bezels. The Lenovo IdeaPad Flex 3 Chromebook has some pretty epic borders around its 11-inch touch-capable display. The lower chin, in particular, is enormous.",
    "The immediate consequence is a device a full size larger than it would be with more modern bezels. It’s around the same proportions as many 13-inch laptops. Arguably, that’s not ideal for a device that also doubles as a tablet. The smaller generally the better when holding tablet devices.",
    "The Flex 3 also looks a little dated. That’s not just a function of those bezels. The limited 1,366 by 768 screen resolution adds to that impression. As does the general design aesthetic. Trendy and slick the Lenovo IdeaPad Flex 3 Chromebook most certainly is not.",
    "But what it doesn’t feel is cheap. The chassis is extremely rigid and the 360-degree hinge that allows this machine to transform into a tablet feels robust. That sense of engineering quality extends to the keyboard, which has plenty of keystroke and a really solid base. There are far, far more expensive laptops which lack keyboards of this quality.",
    "The dual USB-C sockets, which both support charging, are another feature you might not expect on such an affordable machine. Not only do they allow you to both charge and connect peripherals via USB-C at the same time. Situating a port on each side of the chassis gives you total flexibility when you plug into the wall. A minor detail, perhaps, but you’ll occasionally be very thankful for it.",
    "Lenovo has also placed a conventional USB-A port on both sides of the chassis, while a microSD card reader and volume rockers also make an appearance. Our only reservation in this area is the side mounted power button, which is rather too easy to hit when converting the Flex 3 from laptop to tablet and back.",
    "In terms of specifications, at this price point expectations need to be kept in check. Processing power comes from an Celeron chip with Intel’s cheaper, lower power Atom-derived cores rather than high performance Core items. There’s also only 4GB of RAM and just 64GB of local storage in sub-optimal eMMC configuration. But then you’re not going to get 8GB of system memory, a large M.2 SSD and a premium processor in a 2-in-1 device without paying far, far more.",
    "Were this a Windows machine, that Intel Celeron chip, 4GB of memory and 64GB eMMC SSD would be enough to invoke fear of the almighty, as in almighty awful performance. But not in a Chromebook.",
    "Granted, the Lenovo IdeaPad Flex 3 Chromebook is no powerhouse. But running Google’s Chrome OS and the G suite of apps, it’s more effective than you might think. That Intel chip has decent video decoding chops, too, thanks to some dedicated hardware. So, decoding video streams or locally stored video files puts very little load on the CPU cores. You can generally count on smooth video playback.",
    "The same can’t quite be said of scrolling around apps and web pages. However, the touch functionally is reasonably responsive. The stuttering and stalling is momentary rather than chronic. More demanding web pages, such as Google Drive, do occasionally feel a little laggy. But it’s not enough to truly slow you down.",
    "The Lenovo IdeaPad Flex 3’s Intel Celeron N4020 CPU is not normally something to show off about. However, it surely contributes to the fairly epic 16 hours-plus of video playback. That’s true all-day battery life and it’s the kind of performance you’d never get from a budget system with a full fat Intel Core process. Clearly less is sometimes more."
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Price and availability",
    "13": "Design and features",
    "21": "Performance",
    "24": "Battery life",
    "25": "Don't buy it if..."
  },
  "links": {
    "Acer Chromebook Spin": "https://www.techradar.com/reviews/acer-chromebook-spin-11",
    "Asus Chromebook Flip": "https://www.techradar.com/reviews/asus-chromebook-flip-c302",
    "HP Chromebook X360": "https://www.techradar.com/reviews/hp-chromebook-x360-12b"
  }
}