{
  "source": "https://www.techradar.com/reviews/swann-spotlight-outdoor-security-camera",
  "title": "Swann Spotlight Outdoor Security Camera review",
  "category": "appliances",
  "updated": "2020-01-02T17:36:34Z",
  "author": "cliff-joseph",
  "summary": "Swann's latest outdoor camera is a safe bet",
  "verdict": "The Swann Spotlight Outdoor Security Camera is good value for money, providing an extensive array of security features and a tough, weather-proof design that is well suited to outdoor use. It’s marred only by a somewhat unhelpful app that will require a bit of patience to master.",
  "pros": [
    "Good value for money",
    "1080p camera lens",
    "Built-in spotlight and siren",
    "Wi-Fi and Ethernet connections"
  ],
  "cons": [
    "Unhelpful app",
    "Requires mains power",
    "Only 7-day cloud storage"
  ],
  "article": [
    "Swann has a long history in the security market, but it has tended to focus on larger CCTV systems in the past, rather than low-cost security cameras for home users. However, the company has recently updated its range of wifi security cameras, and the new Swann Spotlight Outdoor Security Camera is packed with features that can help to protect the outside of your home.",
    "It’s not too expensive either, with the Swann Spotlight Outdoor Security Camera costing £139.99/$149.99 for the weather-proof outdoor model that we review here.",
    "Swann also makes an indoor version of the camera, which costs just £79.99, as it doesn’t require the same sturdy design or outdoor accessories as the Spotlight Outdoor camera. The Swann Security app allows you to control multiple cameras as well, so it’s easy to build a custom security system that combines indoor and outdoor cameras as required.",
    "Swann is an Australian company, but the Swann Spotlight Outdoor Security Camera is certainly sturdy enough to cope with wetter climes.",
    "It is housed within a very solid plastic casing that is rated IP66 for protection against strong rain, as well as dust and debris that might gum up the works. The camera is attached to an equally sturdy mounting plate, and Swann includes a set of screws and plugs so that you can attach it to an outside wall if you need to. The mounting plate also allows you to adjust the angle of the camera so that you can get a good view of the area you want to monitor. The camera does require mains power, but Swann also includes a massive 60ft (18m) extension cable, which should give you plenty of freedom if you need to place the camera high up on a wall, or some distance away from an indoor power supply.",
    "The chunky extension lead also includes both power and Ethernet cables wrapped together, so you can use Ethernet to move the camera beyond the range of your indoor Wi-Fi if you need to (the camera only supports 2.4GHz Wi-Fi networks, but that should be perfectly adequate for streaming 1080p video). Some people might prefer a completely wireless security camera with its own rechargeable battery in order to avoid all that cabling. However, recharging a wireless camera might not be practical if it’s mounted high up on a wall or other structure, so the mains power and Ethernet connectivity of the Spotlight Outdoor camera will be the better option for many homes and commercial properties.",
    "The camera itself is fairly conventional, offering 1080p resolution and 110-degree viewing angle. The video image is good but not outstanding - it did display a little pixellation in our test clips, and there’s a little ‘fish eye’ distortion around the edge of the image, but it’s still perfectly adequate for keeping an eye on the area around your home when you need to.",
    "In fact, it’s really the camera’s additional security features that make it stand out. Along with the main motion-sensor, the camera includes heat and infra-red sensors that provide night-vision that can extend up to 100ft (30m). There’s also a two-way audio system with a surprisingly sensitive microphone that can trigger the camera when it hears any sound, and also allows you to talk to people such as couriers, or yell at intruders via the app.",
    "As the name suggests, the camera includes a spotlight that can be activated when it detects an intruder, and there’s a siren as well. The sensitivity of the various sensors can be adjusted via the Swan Security app in order to reduce false alarms, and you can also control the spotlight, siren and other features manually, so that you can give someone a real scare by turning all the security features on at once.",
    "That range of features is good value for a camera at this price, but the Spotlight Outdoor camera is slightly let down by the Swann Security app.",
    "We were unable to connect the camera to a nearby office Wi-Fi network using the app on my iPhone - although Swann says that this might be due to a bug in the current version of iOS 13, which they’re discussing with Apple. They did suggest deleting the app and reinstalling it, but after a number of attempts we ended up installing the Swann app on an iPad instead. That did allow us to connect to the Wi-Fi network of our choosing - but only after manually typing in both the Wi-Fi password and the long, complicated name (SSID) of the network itself.",
    "Once the camera was connected to Wi-Fi the app on the iPhone was then able to connect to the camera and receive notifications whenever it detected any movement, but it’s worrying that we couldn’t perform that initial installation using just the iPhone.",
    "The Swann Security app provides precise controls for the camera’s many features, including the ability to adjust the sensitivity of the motion-detection sensor, ‘person-detection’ that can tell people apart from moving vehicles or stray pets, and the volume levels for the microphone and speaker. You can specify how long the siren and spotlight are turned on for when the camera detects nearby movement, and also control them manually - perhaps to use the spotlight for a quick look around at night when you’re away from home.",
    "But, oddly, the app overlooks some quite basic options too - such as a simple On/Off control that will allow you to quickly activate the camera when you leave home, and then deactivate it when you return. Instead, you have to go into the app and delve through the Settings menu in order to turn the various sensors and microphone on and off individually. Swann acknowledged this omission when we contacted them, and told us that they were planning to update the app in order to add new ‘Home, Away and Night’ modes, which would allow you to quickly alter the camera settings when you’re coming and going throughout the day.",
    "We were pleased, though, to find that the Spotlight Outdoor camera provides free online storage for your video recordings for up to seven days free of charge, and that it also has a small amount of internal storage that can keep an additional offline back-up of your recordings stored on the camera for up to two days. At the moment, Swann doesn’t offer UK users any subscription plans that provide additional online storage, although it has indicated that it plans to launch a 60-day subscription plan early next year.",
    "Swann’s Security app does have some rough edges, and you may need to be patient as you go through the initial set-up process. Even so, the sturdy design, outdoor accessories, and extensive set of security sensors ensure that the Spotlight Outdoor camera is a good, affordable option for keeping an eye on your garden or other areas outside your home."
  ],
  "headers": {
    "1": "Pricing and availability",
    "3": "Design and features",
    "9": "Getting started and connectivity",
    "12": "Performance",
    "15": "Verdict"
  },
  "links": {}
}