{
  "source": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
  "title": "OnePlus Nord N10 5G review",
  "category": "phones",
  "updated": "2020-11-11T23:42:16Z",
  "author": "david-lumb",
  "summary": "A solid mid-range phone with a 90Hz screen...and 5G",
  "verdict": "The OnePlus N10 5G is a solid mid-range phone without much edge on the competition aside from a 90Hz refresh rate display, some high-megapixel cameras, and fast 30W charging. It's a great lower-cost version of the OnePlus experience, though it's not the fastest, nor does it have the most battery, nor does it take the best photos of its mid-range contingent. Rather, it's a good all-around phone – and one of the cheapest 5G-capable handsets on the market.",
  "pros": [
    "One of the cheapest 5G phones",
    "Good specs and performance",
    "90Hz refresh rate at great price"
  ],
  "cons": [
    "Cameras aren't too impressive",
    "Less battery capacity than rivals"
  ],
  "article": [
    "The OnePlus Nord N10 5G is another in a new category of mid-range phones jockeying for a novel claim to fame: the cheapest 5G phone on the market.",
    "This year already saw the OnePlus Nord, and the N10 5G is a follow-up handset with one purpose: a version that gets 5G at the right price. To get there, OnePlus has made some compromises in specs, making it a less powerful device on paper.",
    "Casual users likely won't notice the changes, and it even has slightly higher-megapixel cameras, though it loses the second ultra-wide selfie camera. It's best to think of the phone as a reshuffling of perks and features for a slightly different role.",
    "Whereas the Nord reasserted OnePlus' place in the mid-range market that it once owned, the N10 5G is the new essential for the 5G age. Despite being a newer device subcategory, so to speak, there's already competition from phones like the Motorola One 5G, Google Pixel 4a 5G, and other handsets.",
    "5G has had a very limited rollout, though, and while networks have certainly grown over the last couple years, they're only starting to expand beyond big cities. Thus, it's more worth judging the N10 5G on its merits as a mid-range phone, and it does have some advantages over its competitors – namely, some high-end features trickling down from OnePlus flagship phones.",
    "Chief among these is the 90Hz refresh rate display: all other things being equal, this makes browsing around the interface or online a much smoother and more pleasant experience on the N10 5G than other phones. It also packs a decent rear camera suite with a 64MP main shooter, ultra-wide, and macro camera.",
    "Its 6.5-inch LCD display is great for watching media or playing games, and its dual speakers project respectable sound quality, though there's a 3.5mm headphone jack if you'd prefer. Its Snapdragon 690 chipset and 6GB of RAM aren't the fastest combination in the mid-range game, but based on benchmarks (and in our testing), the N10 5G isn't noticeably slower than the competition. Its 128GB of storage can be expanded, unlike the locked-in storage of the Google Pixel 4a 5G.",
    "Its 4,300mAh battery isn't the biggest – the Motorola One 5G packs a 5,000mAh capacity battery, for instance – but the N10 5G's 30W charger juices its battery back up over 50% in half an hour, which is a better bargain, in our opinion.",
    "And in terms of build quality, the N10 5G looks and feels sleek enough, with a sleek-looking plastic back and glass display sandwiching a metal frame that makes it feel more top-end than, say, the polycarbonate back of the Pixel 4a 5G.",
    "Ultimately, the OnePlus N10 5G is a solid mid-range phone, even without the 5G connectivity, and is a solid stepping-stone up to more 'affordable' flagships like the OnePlus 8T that sport notably better specs at an equivalent price jump. Unfortunately, it was revealed that the N10 5G will only get one operating system update, and since it ships with Android 10, that means the phone will only get Android 11...which is a big blow to its longevity.",
    "Just a few perks set the N10 5G apart from other mid-range phones, however, so you wouldn't be missing out if you opted for the Pixel 4a 5G for its better camera software and night photography, or the Motorola One 5G for its bigger battery, or the iPhone SE 2020 just to stay in the iOS ecosystem.",
    "But the N10 5G is a great Android phone for the price, with a smoother screen and superior daylight camera, if that’s what you need.",
    "Announced on November 9, the OnePlus Nord N10 5G price is £329 (around $430 / AU$595). In the UK at least, the OnePlus Nord N10 5G release date is November 20.",
    "It means the Nord N10 5G is £50 cheaper than the OnePlus Nord, which sets you back £379 (around $500).",
    "The phone arrives just after the OnePlus Nord N100, an even more affordable phone that understandably lacks 5G connectivity, with a launch in the US at a later date.",
    "The Nord N10 5G comes in one color, Midnight Ice, which is a blue-ish gradient that looks neat, but not quite as arresting as the seafoam green hues of the Nord and the OnePlus 8T. If you want a more reserved color, though, Midnight Ice is just fine.",
    "The OnePlus Nord N10 5G has a solid mid-range look and feel that inherits much from the Nord. While the N10 5G is slightly larger (by a few millimeters on each side), it's virtually a dead ringer for its mid-range progenitor – though it lacks a feature here and there.",
    "The N10 5G has a volume rocker button on the left side and a power/lock key on the right – but no alert slider, which every other OnePlus phone has to switch between silent, vibrate, and loud modes. It's a bit of a miss, though more as an indicator of the sacrifices to bring the N10 5G's cost down.",
    "In exchange, the 5G phone has perhaps an even more precious feature: a 3.5mm headphone jack on the bottom, to the left of the central USB-C port. In our opinion, that's more of a must-have, especially in this price tier, which is full of phones with a headphone jack.",
    "The N10 5G has a glass front and plastic back with a metal frame, which at least feels more luxe in hand compared to other mid-range phones. It's got a sleeker feel than the Google Pixel 4a 5G with its polycarbonate rear cover, for instance, though not more than the plastic back of, say, the Motorola One 5G. Mid-range phones don't get much nicer in materials.",
    "At 163mm x 74.7mm x 8.95mm and 190g, the N10 5G is larger and a bit heavier than the competition, but not by much. It's too wide to easily use one-handed, though it's not cumbersome, and you won't struggle to hit the lock buttons or volume rocker.",
    "The back of the N10 5G has a central fingerprint sensor, which is easy enough to find without looking – just ensure you get your whole digit on it, as it doesn't read partial prints well. It is more accurate and responsive than the in-screen fingerprint sensors on the pricier OnePlus phones.",
    "The camera block on the top left side looks markedly different than that on the Nord; instead of a single column, the N10 5G's cameras are arrayed in a rectangle nearly identical to the camera block on the OnePlus 8T.",
    "The OnePlus Nord N10 5G has a 6.5-inch LCD display that's well-suited for watching media or playing games. Its 20:9 ratio is taller than some other mid-range phones, but even competitive mid-range phones like the Pixel 4a 5G are only slightly wider in format with its 19.5:9 ratio.",
    "The N10 5G's LCD display is unlike the standard OnePlus Nord, which has a 6.44-inch AMOLED display.",
    "Thankfully, the N10 5G retains its predecessor's 90Hz refresh rate, which is a noticeable perk, especially if you've used OnePlus phones before: smooth screen, more in scrolling through apps and browsing pages than while gaming or watching media.",
    "You can set it back to 60hz (the standard on phones) if you want, which does save battery.",
    "The Full HD Plus (1080 x 2400) resolution and LCD combine for a balanced picture: unlike some OLED screens, the dark portions are reasonably balanced with surrounding color, though it doesn't quite have the same impressive vibrancy that some OLED screens deliver.",
    "The N10 5G's screen supports HDR10 Plus, which is another rarity at the mid-range level: when comparing with the Pixel 4a 5G, and it certainly displays crisper details than say the Pixel 4a 5G.",
    "The N10 5G's display is flat with a punch-hole for the selfie camera in the top-left of the screen. It doesn't have an in-screen fingerprint sensor, relying on the rear physical fingerprint scanner – but you can also set facial recognition to unlock the phone, if you prefer.",
    "The OnePlus Nord N10 5G inherits some of the cameras found in the basic Nord, but leaves off others. While both have quad cameras that include a main, ultra-wide, and macro camera, their megapixel count is different between the two – and while the Nord has a 2MP depth camera, the N10 5G opts for a 2MP monochrome sensor.",
    "The N10 5G has a 64MP f/1.79 main shooter (0.7µm pixel size), which has more megapixels but a smaller pixel size than the 48MP f/1.59 camera (0.8µm pixel size) on the Nord.",
    "But it operates much the same, with a 'pixel-binning' option to shoot either a 64MP photo (ideal if you want to print an image in a large size) or a 16MP photo that uses HDR to get the best dynamic color and lighting range. You probably won't notice a difference in daylight shots, so it's really about whether you need such a dense-data photo: a 16MP image we took was 9MB, while a 64MP image of the same subject was 22MB.",
    "The N10 5G has the same 8MP, 119-degree field of view ultra-wide lens as the standard Nord, which is handy in situations when you need to take in more of your subject. It takes noticeably blurrier photos than the main camera, however, so it's best to use it for close subjects (within 10 feet, say) rather than expect good clarity on distance shots.",
    "The 2MP macro camera, activated by tapping the flower in standard photo mode, is good for getting in close to your subject – the phone itself recommends getting within an inch or two – but we struggled to get subjects in focus.",
    "The 2MP f/2.4 monochrome sensor takes black and white photos, should the fancy strike, but it's also meant to augment the main shooter in its dedicated night mode, which takes decent low-light photos so long as there's a little bit of light. Just don't expect a lot of clarity in your subjects, especially if they're in less-illuminated parts of the image.",
    "The N10 5G takes decent but rarely impressive portrait photos, as it struggles at times to apply depth effects around the subject, even after repeatedly tapping it in the camera app viewfinder. There are other modes, too, like slow-motion, time-lapse, panorama, and a fairly robust pro mode to individually tinker with settings.",
    "That wraps up the N10 5G's photo capabilities – notably absent is a telephoto lens, sadly, leading the phone to use digital zoom, which can get grainy pretty quickly. It maxes out at 10x, but we recommend staying below 6x – that's the supposed cutoff for HDR – and ideally, not using zoom at all. The cameras can shoot 4K video at 30fps and super-slow motion in 240fps at up to 720p.",
    "But whereas the standard Nord had two front-facing cameras (main and ultra-wide), the N10 5G has a single 16MP front-facing shooter. Folks who appreciate getting a whole group in a selfie may be bummed out, but casual users will be fine with just the lone front-facing camera.",
    "First, a basic comparison of the main and ultrawide lenses, plus the digital zoom at 5x and the maximum 10x zoom.",
    "Next, a comparison of the 16MP and 64MP main camera mode. Taking shots in broad daylight won't reveal much difference – but even slight variances in light, like the shadow between the trees in the shots below, shows off the difference that the HDR in the 16MP mode can reveal.",
    "Macro and depth modes, with a food shot thrown in...",
    "And finally, a comparison of night mode (with and without), some sunset shots, and night shots.",
    "The OnePlus Nord N10 5G packs respectable but not impressive specs: a Snapdragon 690 chipset, 6GB of RAM and 128GB of storage (expandable up to 512GB via microSD).",
    "That's notably below the Nord's complement of Snapdragon 765 chipset and 8GB of RAM to start. Which would lead us to expect some poorer performance, especially compared to mid-range phones packing the Snapdragon 765, like the Pixel 4a 5G...and yet, in basic benchmarks, the N10 5G performs better than those phones, with a Geekbench 5 score of 1847 compared to the Pixel 4a 5G, which scored 1614 in the same benchmark test.",
    "Whether binging media or playing heated gaming sessions, the Nord N10 5G kept up. It's one of the first 5G-capable phones we've tested running the Snapdragon 690 chipset, and it's been more than capable, with only the occasional hitch when swapping apps keeping it from feeling like a completely seamless experience.",
    "For the record, we did see a slightly higher Geekbench 5 result with our Nord test unit (with 12GB of RAM), which got a score of 1877 – not enough to lament the lack of a Snapdragon 765 chipset in the N10 5G.",
    "The Nord N10 5G is a 5G phone, with connectivity to sub-6 5G networks, which most carriers support anyway – with the notable exception of US telecom Verizon’s mmWave network.",
    "The N10 5G packs Android 10 out of the box – which is a fine operating system, of course, but given Android 11 was publicly released months ago, it's a bit irksome to have a product launching late in the year without the most up-to-date software.",
    "But it does work nicely with OnePlus' OxygenOS 10.5 overlay, which has its usual clean Android experience, custom apps (with a particularly handy file manager) and gaming-focused mode that ekes out more graphical power and silences notifications.",
    "The OnePlus Nord N10 5G has a respectable 4,300mAh battery – bigger than the capacity of the Nord's 4,115mAh battery, and far above the Pixel 4a 5G’s 3,885mAh battery capacity, but below some other mid-range phones – the Motorola One 5G packs a 5,000mAh battery, for instance.",
    "With casual use – a few hours of gaming or watching media and browsing the internet in between – expect the N10 5G to last a full day (and maybe longer) before needing to recharge, though it doesn’t last quite as long as the OnePlus 8 or 8 Pro.",
    "Thankfully, the Nord N10 5G follows its pricier siblings with a WarpCharge 30T fast charger in the box. This zipped the phone from a dead battery to 55% capacity in 30 minutes.",
    "The 30T may pale in comparison to the 65W charger packed with the OnePlus 8T, but a 30W max charging capacity outpaces the recharge rates of other mid-range phones: the Motorola One 5G, for instance, recharges at 15W.",
    "The N10 5G doesn't have wireless charging, sadly, but that's not usually a feature found in mid-range phones anyway.",
    "First reviewed: November 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "OnePlus Nord N10 5G price and release date",
    "16": "Design",
    "23": "Display",
    "30": "Cameras",
    "39": "Camera samples",
    "43": "Performance",
    "50": "Battery life",
    "55": "Don't buy it if..."
  },
  "links": {
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "Google Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Motorola One 5G": "https://www.techradar.com/news/motorola-one-5g-packs-four-rear-cameras-and-5g-connectivity-for-under-dollar500",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "revealed": "https://www.techradar.com/news/oneplus-nord-n10-5g-will-only-get-one-os-updateto-android-11",
    "iPhone SE 2020": "https://www.techradar.com/reviews/iphone-se",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "WarpCharge 30T": "https://www.techradar.com/news/exclusive-oneplus-7t-will-have-23-faster-charging-with-warp-charge-30t"
  }
}