{
  "source": "https://www.techradar.com/reviews/maxymiser",
  "title": "Maxymiser testing tool review",
  "category": "computing",
  "updated": "2020-07-14T15:29:25Z",
  "author": "katie-horne",
  "summary": "Enterprise-grade testing tools for marketers",
  "verdict": "Powerful, cloud-based testing tool for marketers backed by Oracle’s platinum-level customer service",
  "pros": [
    "Supports a variety of testing campaigns",
    "Allows the testing of mobile apps in addition to websites"
  ],
  "cons": [
    "No free trials available",
    "Subscriptions available only as part of the Oracle Marketing Cloud"
  ],
  "article": [
    "Oracle Maxymiser is a cloud-based product offered by Oracle that helps you determine the changes you should make to your website to improve your conversion rates. Maxymiser comes with tools to test your websites and mobile apps as well as reporting and analytics tools to make sense of your data.",
    "As a result, you can make data-driven decisions regarding your website improvements instead of guessing what changes your customers will respond to positively and which will help your business grow.",
    "Maxymiser is a part of the Oracle Marketing Cloud, which consists of six different products geared toward marketers. Unfortunately, Oracle does not publish information about its subscription plans or pricing information for cloud tools, so you will need to reach out to the Oracle sales team for additional details.",
    "Though Oracle offers users a free tier and trial subscriptions, you should know that the Marketing Cloud is not one of the products that’s available to you without a paid subscription plan. The free tier and trial subscriptions cover only the following product areas: infrastructure, databases, application development tools, analytics, content and user experience, management and identity services, and integrations.",
    "Maxymiser can help you gather the data you need to present your customers with personalized experiences. For example, you can collect in-session user activity to display offers and other messages to help reduce customer frustration, abandoned carts, and website bounces. You can also gather prior-use data (e.g., data that came from the users’ prior visits) to provide the viewer with relevant content.",
    "In addition to testing websites accessed by users with laptops and desktops, Maxymiser allows you to extend your testing program to mobile apps. Furthermore, Oracle has designed Maxymiser to minimize latency, lessening the negative impact of the test code on your website or application’s performance.",
    "The dashboard makes it easy for you to view the data you’ve gathered, and there are a variety of filters you can use to distill this data. You can also view graphical displays of your data from the included reporting dashboard.",
    "Maxymiser comes with some data analytics features, but if the features you want aren’t included, you can integrate Maxymiser with the third-party app of your choice. The product works seamlessly with Oracle’s Data Management Platform, but you can use third-party tools (like Tableau) as well.",
    "Finally, Maxymiser’s integrations also help you gain a complete view of your customers by allowing you to bring in the information you have from other sources, such as websites, applications, and third-party CRM products (i.e., Salesforce).",
    "The Maxymiser self-serve interface is designed to be intuitive, making it easy for your users to create campaigns and view results and recommendations. In addition to simplified dashboards that display consolidated data, you can access in-depth charts and graphs as well as reports generated from your testing campaigns.",
    "If you want to collect data on how users interact with your mobile apps, Maxymiser comes with tools that allow you to set up these types of testing programs, and the visual, drag-and-drop editor makes it easy to build new campaigns.",
    "Oracle bundles its comprehensive, platinum-level support services with all SaaS product subscriptions at no additional charge.",
    "Once the Oracle team has received your request for assistance, they will give it a severity level. Users with Severity 1 issues will receive a response within five minutes and an update or resolution within one hour. Users with Severity 4 issues (which are the lowest priority issues) will receive a response within 24 hours and an update or resolution within 48 hours.",
    "Maxymiser is a powerful website and application testing suite for marketers, but there are other options for those who want additional features in their platform (such as support for other types of apps or use of AI-based analysis tools).",
    "One of these is Optimizely, which calls itself an “experimentation platform” that helps you create, test, and analyze varying iterations of a website or application. In addition to mobile apps, Optimizely can help you with Internet of Things apps (e.g., those for Google Home or Amazon Alexa) and smart TV apps. It is helpful to engineering and product teams as well as marketing teams, so do consider it if you want testing software that can be used company-wide.",
    "If you are only interested in A/B tests, where you test one change at a time, consider AB Tasty. In addition to its testing and data analysis tools, AB Tasty comes with AI-based tools to help you drive your experiments and analyze your data. While AB Tasty isn’t as capable as Maxymiser in that it only allows you to run this one type of test, it does do that very well.",
    "Oracle Maxymiser is a powerful, enterprise-grade testing platform for marketers who want to know what website changes would grow their business. Maxymiser allows marketers to make data-driven decisions, and its support for a variety of testing types and powerful analytics and reporting functionality makes it a useful product for those who can afford it."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "9": "Interface and in use",
    "11": "Support",
    "13": "The competition",
    "16": "Final verdict"
  },
  "links": {}
}