{
  "source": "https://www.techradar.com/reviews/origin-millennium-gaming-pc",
  "title": "Origin Millennium Gaming PC review",
  "category": "computing",
  "updated": "2020-10-29T14:14:52Z",
  "author": "michelle-rae-uy",
  "summary": "A school boy’s customization dream, if you can afford it",
  "verdict": "What makes the Origin Millennium stand out from an ocean of gaming PCs is how many customization options it offers. You can build one from the ground up, without putting much effort beyond choosing and clicking. Just be prepared to pay a hefty sum, as that privilege doesn’t come cheap.",
  "pros": [
    "Impressive 4K performance",
    "Customizations abound",
    "Plenty of room for future upgrades",
    "Chassis design makes internals very accessible"
  ],
  "cons": [
    "Can be very expensive",
    "Side panels can pop out easily when transported by hand",
    "No Thunderbolt"
  ],
  "article": [
    "Some PC gamers go for the most popular pre-built gaming PCs out there while others build their own, filling their machines with the best PC components their budget can afford. For those in between, there’s the Origin Millennium.",
    "Origin is known for highly customized builds, allowing gamers to customize their own gaming PCs without actually putting in the work (or needing the knowledge and skill to do so). There’s certainly a huge market for them. After all, not everyone will know which motherboard goes with what CPU.",
    "The Origin Millennium gaming PC is not only highly customizable, from the chassis’ side panels all the way to motherboard’s orientation. It’s also easily expandable – you know, in the rare case that you need more than eight SSDs in the mid-sized tower that you bought or need more cooling power. That makes this machine incredibly future-proof as well.",
    "Origin has made the Origin Millennium so that you never have to buy another gaming PC again in the foreseeable future. That is, until you’ve grown bored of the chassis you already have.",
    "Just be prepared to spend a hefty sum. Even at the Origin Millennium’s base configuration, you’re paying a pretty penny for the privilege of customization and future-proofing.",
    "The Origin Millennium isn’t cheap. The “base” configuration, with an AMD Ryzen 5 3600XT processor, Nvidia GeForce GTX 1660 Super, 16GB of RAM and 250GB storage will already set you back a whopping $2,159 (about £1,665, AU$3,000).",
    "We put the word base in quotation marks because that’s the default configuration Origin starts you off with. You can actually downgrade that to a cheaper configuration touting the slower Intel Core i5 10400F and cheaper RAM for $1,729 (about £1,335, AU$2,400), though that’s still pretty pricey for a gaming PC with just an Nvidia GeForce GTX 1660 Super.",
    "For premium buyers with hefty disposable income, a maxed-out Origin Millennium will cost $11,556 (about £8,900, AU$16,000). This configuration rocks an AMD Ryzen Threadripper 3990X, Nvidia GeForce RTX 3090, 256GB of RAM and 8TB of SSD storage in a full tower with Origin Cryo Core and a hot-swappable cage upgrade.",
    "Those are all without the chassis customizations of either having etchings or your image of choice printed on the side panels.",
    "Our review configuration itself is already premium for most people, touting a $4,280 (about £3,300, AU$5,950) price tag with an Intel Core i9-10900KF, Nvidia GeForce RTX 3080, 32GB of RAM, and a 960GB SSD + 3TB HDD storage combo inside.",
    "Customers based in the UK and Australia will be happy to know they should have the same level of customization as US consumers. However, you will have to pay for international shipping and any taxes that your package incurs through customs.",
    "What makes the Origin Millennium PC unique, is how much customization and how many options you get over competitors. We’re not just talking about internals here, although the crazy amount of components you can choose from is truly impressive. You also decide how your Origin gaming PC will look, from motherboard orientation to side panel design.",
    "To start, the Origin Millennium gaming PC comes in three different cases: a full-tower (Millenium case) and two mid-tower models (Carbide Series 678C and Obsidian Series 500D). Our review model has the mid-sized tower, the 500D. Its sheer size is already telling of this PC’s expandability. Even without getting the full tower, you’re already working with a lot of room to expand.",
    "Though our review unit has the traditional mounting, variable mountings – for different orientations of the motherboard and components – are also on hand when you’re configuring your unit. There are four configurations available: normal, 90 degrees (where the motherboard and components shifted 90 degrees so that they're vertical), inverted, and 90-degree inverted. Inverted only means that the components are facing the other direction so that they’re accessible from the right side of the chassis.",
    "The front door, as Origin calls it, can also be configured to open either from left to right or left to right to reveal front bays where an optional or after-market optical drive can be placed. Our review unit doesn’t have this feature, but if you do opt for it, you’ll be getting four front bays and space for a hot-swap cage for hot-swappable hard drives.",
    "What we do have are the left and right glass side panels, both of which are held in place by magnets and easily pop open for quick access to internals. We appreciate these, as not only do they forgo the need for a screwdriver or tab-pulling, but they’re so easy to open while still having enough hold to stay in place. Do be careful when you’re lifting it, though, as your hands can just as easily pop these open by accident.",
    "The Origin Millennium we reviewed featured just the plain glass panels, the side panels on this PC can easily be customized as well. You can get custom printed HD UV glass panels or laser etched tinted glass or aluminum side panels. You can even use your own high-resolution image for the HD UV glass panels, though not for the printed ones.",
    "The chassis is, in the words of Origin, made of \"server-grade\" steel, making it more durable. It also has a clean interior look, boasting a PSU shroud that covers the power supply to keep the look even tidier. To ensure the interior keeps that clean and well-designed look, Origin has some seriously nice cable management, making it look like a professional built it.",
    "It comes with a decent amount of ports on the front. Depending on the case, you can get a sliding top panel that hides those ports. Our review model doesn’t have this feature, but the front ports – including two USB 3.0 ports, one USB-C, a headphone jack and a mic jack – are easily accessible, not to mention, more than enough for our needs.",
    "The ports on the back naturally depend on the motherboard you choose. We have more than enough USB ports on our unit, with optical audio and S/PDIF options so we could turn it into a home theatre, if we wanted. Our only gripe with the Origin Millennium in terms of ports is that it doesn’t have Thunderbolt. It does have USB-C, however, so it isn’t a big deal.",
    "For future-proofing, you can also add an expansion kit that transforms the Millenium case into a Genesis case for more storage or to add CRYOGENIC CPU and GPU liquid cooling. This lower bay expansion fits at the bottom of the case, which results in an even taller tower.",
    "With quite a bit of RGB, the Origin Millennium can be personalized with quite a bit of light flourish. Our review model has RGB on the motherboard, RAM, GPU, liquid cooler and the six fans, which means that it lights up like Christmas. To personalize the RGB lighting, we have two apps at our disposal – Corsair's iCUE software and MSI's Dragon Center (since our unit has an MSI motherboard).",
    "If you’re familiar with the iCUE app, you already know that it has extensive and very versatile RGB customization. Only issue is having two different apps in control means that it can be confusing – when you have RGB activated in the Dragon Center, sometimes the system will ignore any RGB changes you make in iCUE.",
    "In a way, the Origin Millennium sits somewhere between a pre-built machine and one you’re building yourself. It lets you pick and choose your internals – from their albeit extensive list, of course – and Origin will build a machine that’s pretty unique to you.",
    "It’s worth noting that if you get a PC from a different manufacturer with similar specs, you'll most likely get a similar performance. However, there are still advantages to the Origin Millennium – for example, if you try to build one similar to our review unit yourself, you'll be hard-pressed to even find an Nvidia GeForce RTX 3080 at the moment. So, something like this might be your best bet to getting one.",
    "If you can afford it, you can get any top-of-the-line AMD or Intel CPU, as well as most of the AMD and Nvidia GPUs available. You can even choose your motherboard, power supply,",
    "RAM, and storage. Finally, you can choose from 3 different liquid cooling options - Hydro X Series XD3 RGB, Cryo Core or Hydro X Series Cooling.",
    "Our review unit has the first one, the Hydro XD3 Stage 1 Soft Tube with 360mm radiator, which is the cheapest of the three options above, and already the thermal efficiency is great. With the help of six fans (one at the back, three in front and two on top), the PC never seems to get too hot inside, and the whole thing added some fun additional RGB lighting to our case.",
    "Since the side panels are not vented, it’s left to the back and the top panels to allow hot air to escape, a lot of which is being blown out the top. This isn’t an issue if you have your PC sitting atop your desk. However, if you have it below adjacent to your legs, you might feel that hot air circulation around your lap area. If this is your setup, be sure to have the AC blowing when you’re gaming.",
    "Our review unit of the Origin Millennium, while not the most kitted out, is a souped-up machine. You get the performance you would expect from one with a 10th-gen Core i9, 32GB RAM and an Nvidia GeForce RTX 3080. The PC boots up very quickly, and also uses an SSD as a boot-up drive so you won't experience any bottlenecks running most applications. Unless you're going to render some heavy-duty 3D, you probably won't be able to stretch the system very far for a few years.",
    "When testing it with Metro Exodus, considered one of the most graphically taxing games you can run, at \"extreme\" graphic settings at 4K 60Hz at least, the Origin Millennium came pretty close to perfect. The initial load time isn’t quick, and you might experience a lag or stutter here and there, but other than those, it delivers a rock-solid and very smooth performance with gorgeous detail. Plus, after that initial boot, it loads very quickly.",
    "Red Dead Redemption 2 is also a good game to run and play on this PC at the highest settings. It always looks beautiful and runs like a dream. At 1080p, we get over 120fps on the benchmarks, and super smooth in-game experience. On a 4K monitor, it handles this game with rock-solid 4K performance with up to 68fps in benchmarks. Like Metro Exodus, it might experience the occasional stuttering at these high-res settings, but that doesn’t take away from its impressive performance overall.",
    "Run other popular, graphics-intensive games like Doom Eternal, Hitman 2, Horizon Zero Dawn, Marvel's Avengers, Far Cry 5, Detroit Become Human and Death Stranding at 4K resolution, and you’ll find that this gaming PC will perform flawlessly.",
    "The Origin Millennium gaming PC delivers incredibly solid performance – and that’s when gaming in 4K at the highest settings, which means that at lower graphics settings and resolutions, you’ll get an even smoother and more immersive gaming experience. Is that worth the hefty sum Origin is asking? Possibly.",
    "For people who want a souped-up gaming PC alongside the privilege of customization and future-proofing, absolutely. Some would even spend a few months saving just to take one home.",
    "However, the Origin Millennium isn’t for most people. Even its base and cheapest configurations are pricier than other similarly specced gaming PCs out there. In short, it’s really only worth it if you can afford to splurge on everything, from the powerful components to the design customizations – so you’re getting a whole lot of power and your very own personalized machine to boot. Otherwise, it’s like you’re just paying a premium just to have the ability to customize, without even exercising it.",
    "Our review model of the Origin Millennium comes with two different apps to control various aspects of the software – Corsair’s iCue and MSi’s Dragon Center, which was preloaded due to the MSI motherboard installed in the PC. iCue mostly focuses on controlling RGB lighting, specifically on the fans, liquid cooling and RAM, while the Dragon Center is a bit more robust, controlling RGB for the motherboard, RAM and GPU while also offering a few other features. Some of those include performance settings, monitoring internal temperatures, prioritizing apps in the network, and controlling the fans.",
    "Generally, it isn’t an issue bouncing between the two apps for different settings. However, they do sometimes conflict when you’re trying to set RGB lighting. Particularly, if you turn on a setting in the Dragon Center, iCue would not be able to customize the RGB lighting on that component until you remove the RGB settings you set in Dragon Center."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "11": "Design and features",
    "23": "Performance",
    "36": "Software",
    "38": "Don't buy it if..."
  },
  "links": {
    "PC components": "https://www.techradar.com/how-to/pc-components",
    "AMD Ryzen 5 3600XT": "https://www.techradar.com/reviews/amd-ryzen-5-3600xt",
    "Nvidia GeForce GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "Nvidia GeForce RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Intel Core i9-10900KF": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080"
  }
}