{
  "source": "https://www.techradar.com/reviews/amazfit-gts-2",
  "title": "Amazfit GTS 2 review",
  "category": "wearables",
  "updated": "2020-12-01T13:18:45Z",
  "author": "michael-sawh",
  "summary": "A square smartwatch with good looks and solid fitness tracking skills.",
  "verdict": "With the GTS 2, Huami has refined the design of its square smartwatch for the better and also made it a better smartwatch. The downside is that it’s got a little more expensive and lost a bit of its battery stamina and appeal in the way. If you want an attractive square smartwatch that doubles as a decent fitness tracker, it’s one to look at. If you want a more rounded smartwatch and sports tracking, look in the direction of Garmin and Apple.",
  "pros": [
    "Improved design and same great display",
    "Solid fitness tracking features",
    "Handy offline voice assistant"
  ],
  "cons": [
    "Shorter battery life than GTS",
    "Sports tracking accuracy",
    "PAI health scores not well integrated"
  ],
  "article": [
    "The Amazfit GTS 2 is the successor to the GTS, a square smartwatch that works with Android phones and iPhones offering the features you’d find on pricier watches, for less money.",
    "Huami has refined the look keeping the same sharp, high quality AMOLED display and wrapping it up in a more stylish aluminum and plastic watch case. It’s still waterproof up to 50 metres and comes with removable 20mm straps.",
    "To offer a richer smartwatch experience, the GTS 2 adds a built-in music player, which does only work with your own music and has to be transferred via the Zepp companion phone app. You can also make calls over Bluetooth with the speaker offering decent clarity. There’s two smart assistants in the shape of Amazon Alexa and Huami’s own offline voice assistant. We couldn’t get the former to work, but the latter is a useful way to offer hands-free control of key features on the GTS 2.",
    "When it comes to tracking health and fitness, you’ll get staples like steps and automatically monitoring sleep and there’s a new BioTracker optical sensor that promises continuous heart rate tracking, heart rate during exercise and blood oxygen measurements. It’s certainly a better fit for daily tracking than workouts based on our experience.",
    "There’s built-in GPS to track outdoor activities that came up a bit short in our accuracy tests and is a feature that’s a better fit for casual fitness folk as opposed to marathon runners in training. You do have the ability to share data with third party apps like Strava and Google Fit though, which is nice to see.",
    "The stated battery life of the GTS 2 has dropped significantly from the first GTS, and daily drop off is closer to four or five days compared to the stated seven days in typical usage. Features like always-on display mode, 24/7 heart rate monitoring and turning on the sleep assistant continues to have the biggest most noticeable drain on battery life.",
    "The GTS 2 certainly does a better job than a smartwatch than its predecessor and we definitely welcome the change in design approach. It’s a better fitness tracker than sports watch and those new extras on the whole work well with room for improvement. The problem is that the price has crept up quite noticeably.",
    "While it was a little easier to recommend the first GTS, the GTS 2 is playing with some big names now. Does it offer a better smartwatch experience than the Fitbit Versa 3 or Apple Watch Series 3? Probably not. Its sports tracking doesn’t really match what you’ll get on the similarly priced Garmin Venu Sq.",
    "If you want an attractive, square smartwatch with good battery life and fitness tracking, the GTS 2 does have some appeal. You will be able to find other smartwatches that perform better in other departments though.",
    "The Amazfit GTS 2 is available to buy now in midnight black, urban gray and desert gold for $179 / £179 (about AU$250). That makes it pricier than the first GTS, which is priced at £149.99 / $149.99 (about AU$200), but can actually be found for less than $100 / £100 (about AU$140) from some retailers.",
    "That pricing makes it cheaper than square smartwatches like the Fitbit Versa 3 and the Apple Watch Series 3 and matches the price of Garmin’s Venu Sq.",
    "The first GTS was an attractive-looking affordable square smartwatch and while the materials remain largely the same for the GTS 2, the design philosophy has changed. As a result, you’re getting a much sleeker, stylish watch to live with this time.",
    "You’re still getting an aluminium alloy case with a plastic back that’s dropped slightly in size to a 42mm from the 43mm sized case on the GTS. At 9.7mm thick, it’s put on a slight bit of timber too and has added a curved edge around the solitary physical button. Overall though, it’s a watch that sits similarly on your wrist as the first GTS.",
    "You’ve now got your pick of black, grey and gold case colours, which is a bit of a departure from the most pastel shades on its predecessor. That case is partnered up with a 20mm silicone strap, that can be removed if you want to switch in another official band or a third party option. As a package, it’s also waterproof up to 50 metres depth making it suitable for swimming and showering with.",
    "Where this watch really stands out is the display. It’s the same sharp, 1.65-inch,",
    "348 x 442 resolution AMOLED touchscreen with 341 PPI that was housed on the GTS. The screen feels more unified with the casing that surrounds it, to give it that nice unibody look and there’s all the signs of a high quality display. It shows off great colours, offers good visibility in bright outdoor light and indoors and does support an always-on mode that will have an impact on battery life when in use.",
    "That display does a great job of elevating the look of a smartwatch that clearly aspires to be as attractive as an Apple Watch. It’s certainly no Apple Watch, but it’s an attractive smartwatch in its own right and one that on the whole we enjoyed living with.",
    "Everything the GTS 2 offers in the way of tracking your health and fitness can be found on the GTR 2 that launched alongside it.",
    "You have accelerometer and gyroscope motion sensors to track indoor activity and deliver step counts and enable automatic sleep tracking. There’s built-in GPS to track outdoor activities like running, cycling and open water swimming.",
    "Huami also includes its newest BioTracker 2 PPG optical sensor, which delivers continuous heart rate monitoring, heart rate during exercise and opens up more detailed insights. It also powers stress tracking and the PAI Health Assessment system, using a point scoring system to indicate how regularly you’ve been giving your heart a good workout. It also brings the ability to take blood oxygen measurements for another insight into your current state of fitness.",
    "When it comes to fitness tracking, we found it was within 500-600 steps of a Polar and Garmin fitness tracker we tested it against, offering a nice breakdown of daily stats in the app and on the activity tracking widget on the watch. Outside of inactivity alerts, it’s light on motivational features though and the PAI scores while interesting, don’t feel all that useful in its current guise.",
    "For sleep monitoring, we found it matched up pretty well with Polar’s wrist-based sleep monitoring, which is up there with Fitbit in terms of reliability. It posted largely similar sleep duration as well as times fallen asleep and time awake. There was usually a 20-30 minute difference in the breakdown of deep, light and REM sleep. Additional insights like sleep scores trends are nice additions and make this one of the standout features of the GTS 2.",
    "When it’s time to take your fitness up a notch, you’re getting your pick of 12 sports tracking modes, which are accessible from the Workout screen. For activities like outdoor running, you can view things like pace, distance, average pace and heart rate. You also have access to music controls here too, which is nice to find. From an accuracy point of view though, it’s not great. GPS-based distance tracking was noticeably underreported compared to a dedicated Garmin multisports watch. We also experienced some GPS drop-outs as well.",
    "Heart rate during exercise didn’t fare much better either. While average heart rate was usually within 1-2 bpm of a chest strap monitor, the maximum heart rate was often higher, putting us into a different heart rate zone. The heart rate graphs also shows some unusual spikes and drops in the data that didn’t correlate with the chest strap data.",
    "While there’s plenty on offer with the GTS 2 in terms of sports tracking, whether it’s the modes, the training insights and ability to connect to third party apps like Strava and Google Fit, the tracking is really only fit for casual fitness folk. If you’re more interested in fitness tracking, you’ll feel better served here.",
    "For smartwatch features, the GTS 2 gets the very same features that you’ll find on the GTR 2. That means something that works with Android and iOS phones for starters.",
    "You’ll get notifications, music controls, take calls over Bluetooth, view weather forecasts, alarms and event reminders. On the watch, you can add widgets or dedicated screens to make sure core features are just a swipe away.",
    "The watch faces are customizable and there’s some nice options that show off that great display. There’s a nice mix of digital and analogue options letting you fill that face with data or keep things simple.",
    "The main new features that didn’t appear on the GTS are the music player, Amazon Alexa support and a new offline voice assistant.",
    "We’ll start with the music player, which offers a decent 3GB of storage, giving you room for around 500-600 audio files in MP3 format. Music is transferred from the Zepp companion app and it only works with music you own, not from music services.",
    "With music onboard, you can pair up Bluetooth headphones and select music from the same screen where you’ll find the music controls. From an execution point of view, the music controls work without any major issue. Its usefulness really boils down to whether you own that music and it lives on your phone.",
    "The arrival of Amazon Alexa means you can make use of the onboard microphone to do many of the things you’d expect the smart assistant to do inside of other devices. So you can set alarms and reminders, check for weather reports and control your other smart home devices. We’d like to tell you how well it worked, but either the functionality hasn’t been turned on yet or it currently doesn’t work.",
    "We had more luck with the offline voice assistant, which gives you hands-free control of core features like opening music controls or workout mode. You can also use it to access Alexa (when it works), set up alarms and more. All the voice commands can be found on the watch and the app and on the whole we found they worked without issue.",
    "The GTS 2 packs a 246mAh capacity battery, which is up from the 220mAh one included in the original GTS. That promises to give seven days with typical usage and 20 days in basic usag. You’ll get 25 hours of GPS battery life and it also takes two hours to get from 0-100% battery.",
    "Those battery numbers are lower than what you get on the Amazfit’s GTR 2 and having used both, it definitely shows. Even without the full gamut of features at your disposal in use, we found there was about a 20% daily drop-off in battery. That’s even without using features like GPS or music. If you decide to switch on the always-on display mode, then that drop off is even greater and it tends to be more like three to four days.",
    "You could likely get that seven days, but you’d have to be conservative with things like screen brightness, GPS tracking, enabling the richer sleep metrics and continuously monitoring heart rate. If you want those 20 days, you really have to scale back and it’s less of a smartwatch experience and more of a watch experience.",
    "In terms of charging, it’s not the quickest that’s for sure, though at least the cable magnetically snaps to the back of the watch case and we never had issues of it coming unattached."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Amazfit GTS 2: price and release date",
    "11": "Amazfit GTS 2: design and display",
    "17": "Amazfit GTS 2: fitness",
    "25": "Amazfit GTS 2: smartwatch features",
    "33": "Amazfit GTS 2: battery life",
    "37": "Don't buy it if..."
  },
  "links": {
    "Amazfit GTS 2": "https://www.amazfit.com/en/gts2.html",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "iPhones": "https://www.techradar.com/news/best-iphone",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Fitbit Versa 3": "https://www.techradar.com/reviews/fitbit-versa-3",
    "Apple Watch Series 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "Garmin Venu Sq": "https://www.techradar.com/reviews/garmin-venu-sq",
    "Garmin’s Venu Sq": "https://www.techradar.com/reviews/garmin-venu-sq"
  }
}