{
  "source": "https://www.techradar.com/reviews/lexar-sl200-1tb-portable-usb-ssd",
  "title": "Lexar SL200 1TB portable USB SSD review",
  "category": "computing",
  "updated": "2020-08-11T21:56:40Z",
  "author": "desire-athow",
  "summary": "Another newcomer in a very crowded space",
  "verdict": "The Lexar SL200 is an OK product and that’s about it. Compared to almost everything else on the market, it lacks a clear edge and its premium pricing is not helping it at all.",
  "pros": [
    "Good looking",
    "Solidly built"
  ],
  "cons": [
    "Average performance",
    "Expensive for what it offers"
  ],
  "article": [
    "US-based storage specialist Lexar has been around for nearly a quarter of a century; it was acquired in 2006 by Micron and resold 11 years later to Longsys, a major flash memory company based in China. Lexar is known for its high end storage solutions and was the first to release a 1TB memory card; it has also started to dabble in the solid state drive market.",
    "The SL200 is the newest model from Lexar and we’re reviewing the 1TB version; it is an external USB Type-C device that targets the entry-level market and complements the existing SL 100 Pro SSD which is a faster and more expensive model. The drive is available in 512GB, 1TB and 2TB versions. At the time of writing, only the first two are widely available for $90 and $159 respectively at Adorama.",
    "The SL200 presents itself as a 40g, 86 x 60 x 9.5mm rectangular slab of metal with a dark grey colour and accompanied by two short USB cables (Type-C to Type-C and Type-A to Type-C).",
    "It has an activity LED, a Type-C port and a textured finish at the rear of the device which, according to the manufacturer, gives it a sleek, premium finish. You can’t open it and the whole thing looked very sturdy; it should easily sustain a few drops without much harm.",
    "The device is light which means that most of the device is likely to be empty, which also means there’s scope for reducing the size of the drive to USB Flash drive dimensions.",
    "It’s hard to say what exactly is in the drive without opening it but we know that this is a SATA III drive and is therefore very likely to sport the same internals as the SL100, the NS100, the NM100 and the NS200 which are internal 2.5-inch and M2 models. They all share the same TBW (Terabyte Drive Written) of 512TB with 0.46 drive written per day and 1.5 million hours MTBF (mean time before failure).",
    "It is also very unlikely that the SL200 uses NAND chips from one of the big five Japanese/Chinese/Korean companies (Micron, Samsung, Toshiba, Hynix and WD). Instead, we’re pretty sure that it is using parts fabbed by YMTC (Yangtze Memory Technology), most likely 64-layer 3D NAND that is also used in its home-grown brand FORESEE. This is to say that Longsys has a massive clout in China and Lexar, like Lenovo, is seen as the perfect conduit for international markets.",
    "Lexar bundles an application called DataSafe for Windows and for Mac as well. The company says that it is a free security solution that will encrypt your files in a virtual safe using 256-bit AES encryption with the following caveat. “It is very important that you perform regular backups of your data. We recommend you make backups of your data to your host computer before closing the application”.",
    "Here is a list of the best cloud storage providers and the best backup services on the market.",
    "The drive - which has a formatted capacity of 953GB - comes with a three-year limited warranty and is rated at up to 550MBps in read and 400MBPs in write speeds. We came close to that in real life, hitting 357MBps and 464MBps in our most optimist benchmark, CrystalDiskMark. Others like AS SSD were less forthcoming and painted a rather bleak picture of the performance the SL200 can reach. Note that tests were carried out on a Dell Latitude 7490.",
    "Rivals to the SL200 come in two flavors; either same features but much cheaper or better performance/features at the same price. And the competition out there is fierce to say the least.",
    "The Adata SC680 has 4% less capacity (960GB) but is almost half the price at $97. It is as capable as the SL200 with slightly better performance and a very similar form factor. It sheds the metal enclosure that the SL200 offers to embrace a more conventional plastic one.",
    "The Adata SE800 is still cheaper than the SL200 by a significant amount ($140). It is also waterproof (and certified MIL-STD-810G) and reaches up to 1GBps, more than twice what Lexar’s model can achieve. Its metallic finish might not be to the taste of everyone but it delivers value for money, in spade.",
    "Last but not least is the Lexar SL100 Pro which is the sibling of the SL200. It sells for less than the latter at $156 and outperforms it handily. In a nutshell, it puts the very existence of the product we’re reviewing today into question.",
    "One thing I will repeat time and time again, no product exists in isolation and the SL200 is one good example of how a decent product gets panned because the competition offers much better value for money. So what can Lexar do to rectify its course?",
    "They will have to significantly cut down the price of the SL200 in order to compete with more established brands like Seagate, Crucial or Samsung. But that’s not all, incorporating features like waterproofing and USB 3.2 Gen 2 are essential for Lexar to maintain its competitiveness into a cut-throat market.",
    "The SL300 (we’re name guessing it) will need to offer a unique selling point plus have a compelling price point in order for it to shine amidst a sea of alternatives. Right now sadly, there is no compelling reason to buy the SL200 unless you have a nostalgic attachment to the brand that stems from an emotional connection with the “old” Lexar."
  ],
  "headers": {
    "2": "Design",
    "5": "Hardware",
    "7": "Performance and in use",
    "10": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "$90": "https://adorama.evyy.net/c/221109/51926/1036?subId1=trd-us-1042839936471658000&sharedId=trd-us&u=https%3A%2F%2Fwww.adorama.com%2Filx512sltc.html",
    "$159": "https://adorama.evyy.net/c/221109/51926/1036?subId1=trd-us-1173335679743612200&sharedId=trd-us&u=https%3A%2F%2Fwww.adorama.com%2Filxsl2001tes.html",
    "USB Flash drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "best backup services": "https://www.techradar.com/best/best-cloud-backup",
    "Dell Latitude 7490": "https://www.techradar.com/reviews/dell-latitude-7490",
    "Adata SC680": "https://www.techradar.com/reviews/adata-sc680-480gb-external-ssd",
    "Adata SE800": "https://www.techradar.com/reviews/adata-se800-waterproof-external-ssd"
  }
}