{
  "source": "https://www.techradar.com/reviews/nanoleaf-canvas",
  "title": "Nanoleaf Canvas review",
  "category": "reviews",
  "updated": "2020-05-08T02:06:31Z",
  "author": "sharmishta-sarkar",
  "summary": "Dancing on the wall...",
  "verdict": "The Nanoleaf Canvas is like a lit-up artwork on your wall. It not only gives a room personality, it also makes the space interactive and fun. It might be pricey and extravagant, but it could perhaps be the most beautiful thing you have in your home.",
  "pros": [
    "Easy to set up",
    "Smart home integration",
    "Touch- and voice-sensitive",
    "On-panel controls",
    "Connects up to 500 panels"
  ],
  "cons": [
    "Mounting tape hard to remove",
    "No cable management",
    "Expensive"
  ],
  "article": [
    "UPDATE (May 8, 2020): The current coronavirus pandemic is keeping most of us indoors and Nanoleaf has added new scenes so we can stay focused and keep those wanderlust blues at bay. You'll find them all in the Discover section of the Nanoleaf app, with several Color and Rhythm scenes listed under lists with names like \"Work from home\", \"Wanderlust\" and \"Relaxing before bed\". We've updated this information in the Installation & App Control section on page 2 of this review.",
    "Smart lights are fast becoming mainstream, but nothing available out there today can light up an entire wall the way the Nanoleaf Canvas can. The company’s original set of light panels – christened Aurora at launch, but now simply called the Nanoleaf Light Panels – come close, but not quite.",
    "With the ability to touch panels to change colors, or set up a ‘rhythm scene’ without needing a separate attachment, the Nanoleaf Canvas can turn any drab wall into a work of interactive, colorful art.",
    "Like the original Nanoleaf Light Panels, the Canvas is also a pricey investment for any smart home – yet after using the basic starter kit, we’re happy to admit we’re already considering splurging on an expansion pack to add more panels to our wall.",
    "And if you think the colors might be garish in any way, fear not. They’re mesmerizing, soothing, and you could stare at them for hours without tiring of them, even at 100% brightness. The Canvas can add personality to any space – large or small. They’re perfect to set the scene for a romantic night in, or pulse through a room with the music when a party is rocking. And the touch-sensitive panels make using the lights a whole lot of fun.",
    "The Nanoleaf Canvas starter kit, which includes nine panels, is currently available to order either via the company’s website or through select retail stores for a price of $249.99 in the US, £179.99 in the UK and AU$319 in Australia.",
    "Bigger packs with 18 and 25 light panels are also available from the company’s website, but retail stores currently only stock the starter kit along with an expansion pack of four additional panels – the latter costs $80/£70/AU$109.",
    "Also worth noting is that, while the original Nanoleaf Light Panels required an optional Rhythm Module to make the lights dance to your choice of music, you don’t need to purchase any other accessories for the Nanoleaf Canvas. That’s now powered by a single control panel which is included in each pack.",
    "Unlike the Nanoleaf Light Panels’ triangular shape, the Canvas consists of square panels. If you’re already familiar with older Nanoleaf lights, you’ll immediately notice that the Canvas panels are smaller – the triangular Light Panels measure 21cm in height and 24cm across the base, while the Canvas panels are 15cm x 15cm each. Both sets of lights, though, are made from the same lightweight white plastic.",
    "Alongside that change in overall shape, the new panels have also undergone a small internal design change as well. You’ll notice each square is divided into four sections. This unique design disperses light evenly through the panel, and produces a pleasing crystal-like effect when the lights are switched on. However, despite being divided into sections, each panel is capable of throwing off only a single color of light at a time.",
    "The other thing Nanoleaf has nailed this time around is the brightness of the light. When set to 100% brightness, the older Light Panels were arguably too bright to look at directly, but the Canvas is just right – you’ll never need to squint at it.",
    "Other than the nine light panels, the starter pack also has the power hub (with the product code printed on it – more on that later), the linkers to connect each panel to each other and double-sided tape so you can stick the lights to you walls.",
    "The tape supplied is similar to 3M’s Command strips – they’re just as strong (if not more so) and have a tab that can be pulled to remove the tape off the wall without damage… theoretically at least.",
    "In reality, we found that peeling them off the wall was near-impossible because of the design of the panels themselves. There are three plastic strips visible on the back of each panel where the tape needs to be applied. Unfortunately, the depth at which these strips are placed is so far back that the little tab to peel the tape off gets hidden behind the panel when it’s put up on the wall. That means you’ll likely be peeling off paint along with the panel if you want to move the lights to another spot in the house or want to redesign the look.",
    "On the underside of each panel are slots where the linkers will slide in. There are multiple slots on each panel to choose from, giving you the freedom to get creative with your design layout. Nanoleaf also sells flexible linkers (sold separately) which are perfect for when you want to expand your design to creep up onto the ceiling for some excellent light effects.",
    "The power hub also ends with a small linker at one end, which will slide into the panel closest to your wall socket. If your design layout starts well above the location of the power socket, you will have get used to the cable dangling against the wall. If you think it’s an eyesore and would prefer to have some form of cable management, it will have to be a DIY job.",
    "We popped the power hub’s linker into the Control Square. This is the panel that has a rhythm module built in. So, unlike the Aurora, you don’t need to buy a separate accessory to make your lights dance to your favorite tunes. The Control Square also has the buttons for turning the lights on and off, changing scenes and adjusting brightness. So your family and friends will be able to control the lights without needing access to the app or a smart speaker. The buttons, though, are under a removable transparent sticker which details what the each symbol means.",
    "There’s also a microphone built into Canvas. This makes the lights sensitive to ambient sound (music or conversation), which produces some beautiful effects on your wall. While having a mic in a room might be a cause for concern for some, it’s only functional when the Rhythm feature is on. Nanoleaf says the light sync happens locally with nothing actually being recorded. However, Nanoleaf’s privacy policy makes no mention of a microphone."
  ],
  "headers": {
    "5": "Pricing and availability",
    "8": "Design"
  },
  "links": {
    "Installation & App Control section on page 2": "https://www.techradar.com/reviews/nanoleaf-canvas/2",
    "Nanoleaf Light Panels": "https://www.techradar.com/reviews/nanoleaf-light-panels"
  }
}