{
  "source": "https://www.techradar.com/reviews/xtb",
  "title": "XTB CFD and Forex broker review",
  "category": "computing",
  "updated": "2020-03-24T15:44:10Z",
  "author": "jitendra-soni",
  "summary": "A great platform for CFD and Forex trading",
  "verdict": "Offers wide variety of tradeable assets to choose from with low fees",
  "pros": [
    "Trade over 1500 global markets",
    "Free deposit and withdrawal",
    "Multiple trading platforms",
    "Easy account opening",
    "Demo account"
  ],
  "cons": [
    "High initial investment",
    "Limited product portfolio"
  ],
  "article": [
    "XTB is a leading CFD and forex broker, offering over 1500 instruments to trade-in. It was founded in 2002 as X-Trade which merged with XTB to form a single entity in 2004 and is headquartered in London and Warsaw. XTB is regulated by the UK's Financial Conduct Authority (FCA) and the Polish Financial Supervision Authority (KNF) and other leading financial regulators.",
    "Since it is regulated in one Tier-1 jurisdiction, it can be considered to be a low-risk, broker for trading in Forex and CFDs. It is one of the largest stock exchange-listed brokers and has offices in over 13 countries. These include countries like the UK, Germany, Poland, France, Chile and Spain etc.",
    "XTB offers two platforms to trade on: xStation 5, and the more traditional MT4, from which you can trade in forex, indices, commodities, stock CFD’s, ETF CFD’s and cryptocurrencies:",
    "Forex: Offers over 50 pair of currencies including all the major currencies.",
    "Shares: Over 1500 shares of companies operating in countries such as the United States, United Kingdom, Poland, Portugal, Spain, Switzerland, France and Finland etc.",
    "Indices: Offers indices trading in over 20 major global indices",
    "Commodities: Major commodities available for trading include wheat, copper, coffee, Aluminium, Nickle, Oil, Platinum, Silver, gold etc.",
    "Cryptocurrencies: Major cryptocurrencies include Bitcoin, Litecoin, Ripple, Dash, Ethereum and other",
    "ETF: Option to speculate in ETF",
    "In terms of account type, XTB keeps it simple by offering just type of accounts with fee structure being the primary differentiator between the two.",
    "The standard account has a marked-up spread at 0.35 while the Pro account offers lower spreads at 0.28 though it has commission starting at $3.5 per lot on forex, indices, commodities and crypto.",
    "Both the Standard and the Pro account offers all the trading instruments available on XTB.",
    "It also offers an Islamic account with similar spreads like the Pro account but has a fixed commission of $10 per lot. The Islamic account also doesn’t have an option to trade cryptos. This is open for international customers and doesn’t levy swap fee.",
    "XTB does offer a free demo account for a trial run with virtual currency, though this account is only available for a limited time of 30 days from the signup. After giving a spin to the platform you can sign up for XTB in case you feel that the platform fulfills your requirements as an investor.",
    "You can fund your account in multiple ways like bank transfer, MasterCard, Visa, PayPal, Paysafecard, Maestro, Neteller, and Skrill. XTB accepts payments made in EUR, USD, GBP, and HUF. E-Wallet payments made using PayPal or Skrill are processed the same day, however, they attract a transaction charge of 2%. Bank transfers may take up to 3 days to show up in your account. At the time of signing up, traders need to fund the account with a minimum £/ $/€ 250 while signing up. Similar to most transactions, there are no charges for withdrawal as well.",
    "XTB’s website has an investors education section which is helpful and free for all users. The material here can be found in the form of videos and articles which can be extremely helpful for users who’re just starting up to intermediate level traders.",
    "First-time traders can use the step-by-step guide which covers most of the basics about trading and even advanced concepts such as different trading strategies that offer tips about risk management. Key topics like different regulations, how to operate the account etc can be found under the FAQ section.",
    "The web application offered by XTB, xStation5, is a custom dashboard which offers most common features like menu, charts, watchlists, and notifications etc. which can be found on any typical online trading platform. This makes it easy to navigate and understand. Regular functions like entering a trade, creating a watchlist & tracking it, as well as modifying the charts is easy as the platform is fairly responsive. It loads data swiftly and the tools like heatmaps or screening tool offered information as and when required.",
    "Additionally, it also offers the standard MetaTrader 4 platform which comes with an option to create custom indicators. MT4 is most commonly used by Forex traders as most brokers use this as their core trading platform.",
    "The mobile app experience is mostly similar to the desktop experience. Both the platforms – xStation 5 and MT4 are available on the mobile app as well. The app comes with a modern design and is intuitive to use. It allows you to access important information like account details, trading instruments, charts, order types etc. in a glance. You can also set a number of alerts including price and other important notifications right in the app. The app is also available for the Apple Watch.",
    "XTB offers multichannel support via live chat, phone, or email.",
    "XTB also provides support in many languages such as English, Spanish, Arabic, French, Italian, Portuguese, Russian, Chinese, German, Polish, Czech, Slovak, Hungarian and Romanian.",
    "Email support can be a little slow at times, however, phone support can be rated as excellent. Important and frequently asked information can be accessed easily on the website. You can even reach out to them via their social media handles on Twitter or Facebook.",
    "The XTB platform is designed to suit all types of traders. The custom platform offers the most features in an intuitive manner while MT4 is also available for traders who prefer the more standard platform. While its overall costs are lower than its competitors, its offerings are slightly limited. For fast and easy signup and free transaction, XTB is a contender platform for new users."
  ],
  "headers": {
    "2": "Platforms",
    "14": "Account funding",
    "15": "Resources",
    "17": "Website and app",
    "20": "Support",
    "23": "Final verdict"
  },
  "links": {
    "XTB": "https://www.xtb.com/"
  }
}