{
  "source": "https://www.techradar.com/reviews/thrustmaster-tca-sidestick-airbus-edition",
  "title": "Thrustmaster TCA Sidestick Airbus Edition review",
  "category": "gaming",
  "updated": "2020-12-04T19:34:35.903Z",
  "author": "andrew-williams",
  "summary": "A flight stick made for Microsoft Flight Simulator",
  "verdict": "The Thrustmaster TCA Sidestick Airbus Edition is the perfect fit for Microsoft Flight Simulator. It’s a good quality, reasonably priced flight stick based on real-world Airbus hardware. The price rises significantly if you buy the impressive Quadrant add-ons, but there’s no need for dabblers to do this on day one.",
  "pros": [
    "Smooth deadzone-free stick",
    "Charming throttle based on real Airbus controls",
    "Solid enough plastic build",
    "Reasonable price for the central flight stick",
    "Ready out of the box for Microsoft Flight Simulator"
  ],
  "cons": [
    "All-plastic, fairly light construction",
    "The cost adds up for a full setup",
    "Some of the buttons feel a little cheap"
  ],
  "article": [
    "The Thrustmaster TCA Sidestick Airbus Edition is a flight stick made in the image of an Airbus sidestick. It’s an officially licensed tie-in. And as well as the base controller you can get a throttle set and a pack of additional modules that add a real sense of authenticity to sims like Microsoft Flight Simulator 2020.",
    "Good news on that front: the Thrustmaster TCA Sidestick Airbus Edition is “plug and play” ready for Microsoft Flight Simulator 2020. You won’t need to spend an hour or five configuring its button layout.",
    "However, if you want the stick alone, the Thrustmaster TCA Sidestick Airbus Edition is very similar to the long-standing Thrustmaster T.16000M.",
    "These are plastic flight sticks, made to last but not with the weight and construction quality of a Thrustmaster Warthog. But at a third of the price, what else do you expect?",
    "Give yourself a minute to get over the relatively light all-plastic build and let the quality of the stick itself take over. The Thrustmaster TCA Sidestick Airbus Edition is an incredibly smooth, dead zone free flight stick that offers sim-grade control to compete with any mainstream joystick at any price.",
    "Add the Quadrant throttle if you want even more of an Airbus flavour. The quality and specificity of the controls on these outboard modules blow away those on the flight stick’s base.",
    "No other joystick feels as tailor made for Flight Simulator 2020 as the Thrustmaster TCA Sidestick Airbus Edition. And, sure, you can use it for any other suitable PC game too.",
    "The Thrustmaster TCA Sidestick Airbus Edition is made to a budget, but the attention to detail is excellent.",
    "The Thrustmaster TCA Sidestick Airbus Edition launched in June 2020. It costs $69.99/£64.99, and has spent much of the rest of 2020 out of stock.",
    "Thrustmaster followed up the stick itself with the TCA Quadrant, a $99.99/$89.99 throttle add-on that connects to your PC using a separate USB port.",
    "There’s more too. The Quadrant Add-On pack offers even more controls that screw into the throttle module. It adds a parking brake and landing gear controls, and levers for flaps and speed brakes.",
    "The TCA Quadrant Add-on costs an additional $99.99/£89.99.",
    "Tally that all up and you can spend $270/£245 on the full Thrustmaster TCA setup. This is still a lot lower than the £400 of the Thrustmaster HOTAS Warthog.",
    "Thrustmaster’s Officer Pack is probably the best buy for most flight sim fans. It nets you the flightstick and throttle module for $159.99/£149.99.",
    "Read on to find out more about all three products.",
    "First off, let’s deal with the most important core part of the Thrustmaster TCA Airbus family, the stick itself. It’s excellent.",
    "It may not look all that high-end, but its motion is extremely smooth and the moderate spring-based lets you make fine-grain movements with total confidence.",
    "There is also effectively zero deadzone. In the Windows 10 setup app you have to move it with the force of a mouse’s breath to avoid any input the system recognises.",
    "This alone puts the Thrustmaster TCA Sidestick Airbus Edition right near the top of its class in terms of real-world use.",
    "Tension is non-adjustable, but the default level is well-chosen. There’s enough spring-back to make you want to adjust the plane’s trim so you don’t have to hold the Thrustmaster TCA Sidestick Airbus Edition in place constantly. But not so much kids can’t use the thing without complaining about getting sore forearms in three minutes.",
    "The ergonomics of the stick are more than sound, too. There’s only minor contouring but it fits your grip perfectly and is large enough to seem like a “serious” sim controller.",
    "Some of you are doubtless going to be a little disappointed by the Thrustmaster TCA Sidestick Airbus Edition’s build. Just about everything here bar the screws and internal spring is plastic.",
    "There are no rubberized parts to the stick’s grip, no metal panels anywhere. Of course, this is the norm for a flight stick at this level. And we have no reason to believe it won’t last for years, even if you do end up throwing the Thrustmaster TCA Sidestick Airbus Edition at a wall a couple of times after messing up a landing five times in a row.",
    "Thrustmaster says the TCA Sidestick Airbus Edition’s sensor style helps on this front too. The non-button controls use magnetic hall sensors with no moving parts, so there’s no wear as the years pass by.",
    "There aren’t even any decals on the base’s buttons to gradually wear off. The difference between a new Thrustmaster TCA Sidestick Airbus Edition and one five years old is most likely to be a result of the spring inside losing some tension.",
    "We’re not quite as keen on some of the Thrustmaster TCA Sidestick Airbus Edition’s buttons. The stick’s top buttons and triggers all have a very similar, shallow click.",
    "We aren’t pilots. Perhaps the Airbus A320’s stick buttons feel just like these, but to our fingers they come across a little cheap.",
    "The 12 buttons on the base also have a slightly stodgy action. Still, we’d much rather have a great stick and so-so buttons than the other way around.",
    "Thrustmaster also proves these buttons haven’t just been stuck on here without much thought. The two primary non-trigger buttons on the stick’s top can be swapped around. Each comes on its own little plastic module. You can unscrew them, and there are mirror image replacements in the box. When fastened in, there’s zero wobble, no sign these are switchable.",
    "This makes the Thrustmaster TCA Sidestick Airbus Edition an ambidextrous stick. There's another angle here too, though.",
    "In an actual Airbus plane you’d have one set of controls for the captain, another for the co-pilot. And each uses a different hand to grasp the stick, hence the reserved controls. A third config, that of a centrally positioned stick, uses the taller red buttons on both sides. It’s another little win for the Thrustmaster TCA Sidestick Airbus Edition’s authenticity.",
    "We may be reviewing the Thrustmaster TCA Sidestick Airbus Edition as a full package, with the separate throttle and flaps controls, but the main stick alone has all you need.",
    "As well as moving in normal joystick fashion, the stick twists. This offers rudder control, meaning you don’t need Thrustmaster’s relatively expensive rudder pedals. Want to use them? There’s a button that locks off twist motion very effectively on the stick itself.",
    "See that little ridged black thing towards the back? That’s a little throttle. It sets the Thrustmaster Airbus family up as something you can get involved with without spending too much money. And if your casual interest in flying sims takes off, you an upgrade without needing to get rid of what you bought in the first place.",
    "It’s much like the Thrustmaster wheel family in this respect. But perhaps even better in this case as you could remap the throttle to do… something else. Planes aren’t exactly short of controls to map.",
    "The actual experience of using the Thrustmaster TCA Sidestick Airbus Edition’s built-in throttle is mixed. There’s a good amount of resistance to this slider, letting you set the engine power precisely even though the control only has a few inches of movement. There's also a tiny little click feedback as you each the bottom 20%.",
    "However, at the very bottom of this control’s travel, it becomes a switch that sets the engine to reverse. And there’s not enough resistance or positive feedback to this to help you avoid doing so accidentally.",
    "Still, we absolutely think you can get by with the Thrustmaster TCA Sidestick Airbus Edition alone if your interest in flight sims only started with Microsoft Flight Simulator 2020.",
    "Want to get serious? You’ll need the TCA Quadrant Airbus Edition. This companion to the flight stick is actually a separate peripheral, with its own USB connection to your PC and its own entry in the Control section of games like Microsoft Flight Simulator.",
    "It consists of two separate throttle controls, for dual engine planes, two chunky switches to turn the engines on and off, and an engine state switch. You can even buy two, for control of 4-engined planes, if you want to dive headfirst into “sim land”.",
    "Using the TCA Quadrant Airbus Edition is likely why we have a slightly dim view of the stick’s own buttons. These feel much better and have a real sense of the tactile immersion that is the primary reason to buy a dedicated controller like this.",
    "Sure, the TCA Quadrant Airbus Edition is still made of plastic and the throttles don’t have as much resistance as the real thing. But there are light clicks of feedback as you reach each milestone on the throttle, and a great release catch behind each throttle lever that lets you put the engines into reverse thrust.",
    "Some of you may find the dedicated engine switches are somewhat wasted in their default roles, but they can be remapped to do whatever you like. It’s one of the bonuses of PC gaming.",
    "Thrustmaster’s Add-on pack doubles the width of the Quadrant throttle controller. It comes in two parts, which can be arranged either way around, with the base of the modules screwing into the main one with the help of some little plastic bridges. And it connects to the throttle part using SATA cables just like those currently connecting your SSD or hard drive to your motherboard.",
    "These two extra modules add throttle-style controls for the flaps and air brake and two of the most charming controls of the whole Thrustmaster Airbus setup, the parking brake and landing gear. They delightfully nerdy, with a very specific design that begs not to be remapped, and genuinely adds to the virtual flying experience.",
    "It’s odd that an ostensibly thin enhancement, like a control that operates a little differently to the rest, can level-up your experience. But it really does.",
    "The flaps and brake controls are good too. They move smoothly, but will only sit at 25% increments. You’ll feel tactile feedback as they move past each of these points.",
    "Beyond not messing up the fundamentals of the control units inside, the job of peripherals like the TCA Quadrant Airbus Add-on Pack is to boost a sim’s suspension of disbelief factor. The way a lever feels as you push it doesn’t just matter, it’s kinda the whole deal. And while these may be lighter, smaller and necessarily flimsier than the real deal, they are a pretty effective simulacrum.",
    "Still, we kinda wish the main Quadrant throttle unit had the lovely parking brake control, if only because we love it but can’t quite face the full cost of the full Thrustmaster Airbus rig."
  ],
  "headers": {
    "0": "Two-minute review",
    "8": "Price and availability",
    "15": "An excellent deadzone-free stick",
    "21": "Build quality",
    "28": "Ambi-dextrous buttons",
    "31": "Built-in throttle",
    "38": "TCA Quadrant Airbus Edition",
    "43": "TCA Quadrant Airbus add-on pack",
    "49": "Don't buy it if..."
  },
  "links": {}
}