{
  "source": "https://www.techradar.com/reviews/vpncity",
  "title": "VPNCity review",
  "category": "computing",
  "updated": "2020-06-30T01:36:42Z",
  "author": "mike-williams",
  "summary": "Take this promising new VPN for a spin with a free one-month trial",
  "verdict": "The Windows client needs a bug fix or two, but aside from that, VPNCity is a likeable service, easy to use, which unblocks almost everything for a very fair price. Give it a try.",
  "pros": [
    "Unblocks Netflix, iPlayer, Amazon, Disney+, more",
    "Easy to use",
    "Decent value",
    "Supports up to 12 simultaneous connections"
  ],
  "cons": [
    "Windows client has some issues",
    "Mobile apps are a little underpowered",
    "No security audit"
  ],
  "article": [
    "Hong Kong-based VPNCity is a small VPN without a whole lot of brand recognition - okay, let's be realistic, you've probably never heard of it - but take a closer look, and the service is much more interesting than you might expect.",
    "The network is a decent size, for instance, with 3,167 servers in 42 locations spread across 33 countries. Not just Europe and North America, either; there are servers in Australia, Dominican Republic, Hong Kong, India, Jamaica, Japan, Morocco, Panama, Peru, Seychelles, and more.",
    "VPNCity has custom apps for Windows, Mac, Android and iOS, along with Chrome and Firefox extensions, and setup guides to get the service working with games consoles, Raspberry Pi and others.",
    "If you're regularly bumping into the 'simultaneous connections' limit of your existing VPN, good news, VPNCity supports connecting up to 12 at once, depending on your plan.",
    "The company is mostly very clear about the features it offers. You don't have to dig around in the small print to see if VPNCity supports P2P, for instance; yes, it does, there's a link to tell you more from the main website landing page. And you don't have to guess whether it supports unblocking this of that service, too, because the apps provide specialist streaming locations for Netflix, iPlayer, Disney+ and more.",
    "Prices are very fair, at $9.99 billed monthly to cover up to 6 devices; $5.99 over 6 months to cover up to 8; $3.99 protects up to 10 devices on the annual plan, and if you pay two years up-front, the price drops to $2.99 a month and you can cover up to 12 devices.",
    "That's not quite the lowest around - Private Internet Access charges $2.85 a month for the first term of its annual plan, for instance, $3.33 on renewal - but it's better than most, and looks like good value for what you're getting.",
    "VPNCity supports plenty of payment methods, too - card, PayPal, AliPay, Bitcoin and other cryptocurrencies - and there's a 30-day money-back guarantee if you need it.",
    "Most VPNs make big up-front claims about how much they protect your privacy, and VPNCity is no different. 'We don’t keep any of your online activity' says the website, proudly: 'No browser data, credit card information, no IP address. None, nada, niente.'",
    "Experience has taught us that many of these claims are garbage, often contradicted by the VPN's own Privacy Policy, but VPNCity is different. Its small print is actually worth reading, and includes some very specific details about the service and how it handles logging:",
    "\"your activities...are not monitored, recorded, logged, stored or passed to any third party. We do not store connection time stamps, session information, used bandwidth, traffic logs, IP addresses or other data... Further... VPNCity is based in Hong Kong, which does not require data storage.\"",
    "A VPN can write whatever it likes in its privacy policy, of course. VPNCity has no significant track record, and as it's not put itself through any form of public security audit, there's no independent evidence to show it's doing what it claims.",
    "Despite all that, we have to applaud VPNCity for at least taking the time and effort to address some of our logging and privacy concerns, and we hope it'll extend this in future with an independent audit.",
    "VPNCity offers apps for Windows, Mac, iOS and Android, along with Chrome and Firefox extensions. The mobile apps had decent app store ratings (4.2 for iOS, 4.5 for Android) and both had been updated within the past 3 months, indicating the company is trying to maintain and improve them.",
    "The Windows app has come a long way since our last review. The main location list can now be sorted by location or ping time, there's a Favorites system to group your most commonly-used servers, and a Streaming tab gives you specialist servers to unblock Netflix (US, UK, Australia), Disney+ (US, UK, Australia), BBC iPlayer, HBO Now, CBS, YouTube Premium and a lengthy list of Australian services (ABC iView, 7 Plus, 9 Now, 10 Play, SBS On Demand, Stan, Kayo Sport, Foxtel and more.)",
    "A small but capable range of settings includes optional ad blocking, a choice of protocol (OpenVPN TCP/ UDP or SoftEther), 'Easy Firewall Traversal' to penetrate more restrictive firewalls, various auto-start options, and more.",
    "The app doesn't have an 'automatic' option where it selects the fastest server for you, which means you're left to decide this yourself. We found it placed our nearest UK server at the top of the locations list, though, so getting connected only took one extra click.",
    "Connection times were fast for OpenVPN, typically 4-5 seconds. Some VPNs take 10-30 seconds, and although that might not sound much longer, keeping waiting time to a minimum can make a real difference to your experience.",
    "The app used its own desktop notifications to tell us when it connected, but not when the connection closed (more on that in a moment.)",
    "We noticed one apparent bug. Although we could choose OpenVPN in Settings, if we later reopened and closed Settings, the app then connected using SoftEther, even though it still displayed OpenVPN as the selected protocol. (Yes, we know, it confused us, too.)",
    "Although that isn't a disaster on its own, it's still a concern, because we don't know if the bug might have other effects (the app tries to apply its OpenVPN port and other settings to a SoftEther connection, for instance.)",
    "When we checked the app's OpenVPN configuration, though, it all looked very acceptable, with connections using AES-256-CBC and a 4096-bit key.",
    "The app does a poor job of handling dropped VPN connections. When we forcibly closed ours, it updated its interface, but didn't display a notification or attempt to reconnect. If the app window were minimized, you might not realize your traffic was now unprotected.",
    "Enabling the kill switch improved the situation considerably. Whenever the VPN dropped, it immediately stepped in to block any internet access, keeping us safe.",
    "The app still didn't warn us with a notification, though. It displayed a message and a 'reconnect internet' button its own window, but again, if that's minimized, users won't realize why their internet has died until they switch back to it.",
    "We took a look at the Android app, too, and found an almost identical interface, with the same well-designed server lists, Streaming servers, Favorites system and more.",
    "The app doesn't quite have as many features - no server ping times, no SoftEther protocol support - which makes it look a little underpowered, but overall, it's still effective and easy to use.",
    "VPNCity doesn't just claim to unblock top websites, it actually commits to it, with specialist locations for getting you into many top platforms.",
    "We found these worked perfectly, too, enabling us to stream US Netflix, Disney+ and BBC iPlayer without difficulty.",
    "There is no specialist server for Amazon Prime Video, but we found the US Netflix location worked just fine. There are also generic 'Other streaming services' locations to unblock other platforms in the US, UK and Australia, and the first got us access to Amazon, too.",
    "Our speed tests got off to an excellent start, with VPNCity's nearest London server giving us an average 66-68bps, just about all we could expect from our 75Mbps test line.",
    "UK to US speeds were similar, with downloads averaging 40-50Mbps.",
    "We re-ran the speed tests from a European data center to confirm our results, and maybe get a feel for just how fast VPNCity can go.",
    "Surprisingly, despite a connection capable of 350Mbps and more, VPNCity only averaged 55-60Mbps, fractionally less than UK speeds. That's still far from slow, though, and VPNCity managed decent performance from every location we tried.",
    "VPNCity is a likeable service with great unblocking performance, easy-to-use and solid if unspectacular speeds, all for under $3 a month on its two-year plan. It has some issues - Windows client bugs, a shortage of features for the mobile apps - but that's no surprise for a young service, and we expect these will be addressed in the next few months."
  ],
  "headers": {
    "8": "Privacy and logging",
    "13": "Apps",
    "27": "Performance",
    "34": "Final verdict"
  },
  "links": {
    "VPNCity": "https://www.vpncity.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "setup guides": "https://blog.vpncity.com/guides",
    "billed monthly": "https://www.vpncity.com/",
    "over 6 months": "https://www.vpncity.com/",
    "annual plan": "https://www.vpncity.com/",
    "two years up-front": "https://www.vpncity.com/",
    "Private Internet Access": "https://www.techradar.com/reviews/private-internet-access-vpn",
    "Privacy Policy": "https://www.vpncity.com/page/privacy-policy"
  }
}