{
  "source": "https://www.techradar.com/reviews/remote-desktop-manager-review",
  "title": "Remote Desktop Manager review",
  "category": "computing",
  "updated": "2021-05-13T08:43:02Z",
  "author": "michael-graw",
  "summary": "Remote Desktop Manager review: Network management for large businesses",
  "verdict": "Remote Desktop Manager is a good option for businesses that prize network security. Role-based access controls are a major plus for medium- and large-sized businesses with multiple departments.",
  "pros": [
    "Supports role-based access controls",
    "Includes password management and two-factor authentication"
  ],
  "cons": [
    "Expensive for simple helpdesk applications",
    "More features than many small businesses need"
  ],
  "article": [
    "If you’re looking for the best remote desktop software, it’s worth giving Remote Desktop Manager a close inspection. This platform doesn’t just give your team remote computer access across a network. It also offers a range of security and convenience features like centralized password management, one-click connections, two-factor authentication, and role-based access controls. Even better, Remote Desktop Manager works on Android and iOS mobile devices.",
    "So, is this the best tool for screen sharing across your business? Let’s dive into our comprehensive Remote Desktop Manager review to find out.",
    "Remote Desktop Manager’s pricing depends on how you plan to use the software and how many licenses you need.",
    "For individual users, including solo IT managers, Remote Desktop Manager is free. There is no access to most of the team features, like role-based access controls and shared databases, but you can still remotely access networked computers across your business and use the software’s built-in password management tools.",
    "For IT and helpdesk teams, licenses start at $199.99 per user per year. Businesses can also buy a sitewide license for an unlimited number of users for $4,999.99 per year.",
    "Note that Devolutions, the company that makes Remote Desktop Manager, also offers enterprise-scale solutions and lifetime licenses. However, you’ll need to call the company for pricing options.",
    "Remote Desktop Manager makes remote computer access pretty seamless. The software includes an integrated password manager, enabling you to open remote connections in one click. If you already use a password manager, Remote Desktop Manager probably works with it—the software integrates with around a dozen of the most popular tools, including Dashlane and LastPass.",
    "Importantly, Remote Desktop Manager is capable of accessing much more than just networked desktop computers. You can use the software to manage cloud accounts with Amazon S3, Dropbox, Microsoft SQL Azure, and more, all from a single interface. Remote Desktop Manager also supports linking to server systems, network drives, and just about any other network tools your business might be running.",
    "Another advantage to this platform is the encrypted, centralized vault that stores login credentials for different services across your network. Remote Desktop Manager supports role-based access to this vault, allowing administrators to control which IT technicians can access which parts of the network. That’s a major help for large businesses that have multiple IT teams working across different departments.",
    "Setting up Remote Desktop Manager is fairly quick, depending on the size of your network and whether you need to create tiered access to a credential vault.",
    "The best place to start after installing the program is to add your network data into the system for quick access in the future. Some of this can be automatically imported using a variety of add-ons, but you’ll probably end up entering a fair amount of information by hand. Thankfully, the data categories are well organized and searchable.",
    "What takes a little bit longer is setting up a centralized vault for your IT management team and creating access roles. That’s because you’ll not only need to set up a vault and add users but also generate login credentials for each of them and set the access parameters for different roles.",
    "Still, the process is relatively smooth and won’t take more than a few hours for IT teams running a small network. IT administrators that need to coordinate managers across multiple departments may spend up to a few days working out access issues and creating sub-vaults.",
    "It’s hard not to love the interface of the Remote Desktop Manager desktop app. We tested it on a Windows computer, and it feels extremely intuitive, with the menu bar mimicking the design of Windows File Explorer. On top of that, you can have an unlimited number of tabs open to manage multiple simultaneous connections in a single window.",
    "Even better, Remote Desktop Manager is available on iOS and Android mobile devices. Unsurprisingly, the mobile apps are significantly more limited than the desktop platform, and you wouldn’t want to use them for your initial network setup. But, they’re straightforward to use if you need to access passwords or to change user permissions on the go.",
    "As for performance, we didn’t notice any significant lag when using Remote Desktop Manager on Windows 10. The platform launched in under 10 seconds, and connecting to a local network drive was nearly instantaneous. Just beware that the software itself is bulky—around 550 Mb—and used upwards of 22% of our available processing power when testing remote desktop control.",
    "Remote Desktop Manager takes network security extremely seriously. We’ve already talked about role-based access, which is essential for preventing unauthorized access. But, this remote desktop connection manager also supports security measures like two-factor authentication through Duo or Google Authenticator. You can even lock down the software before you walk away from your computer.",
    "Better yet, IT administrators get access to audit and activity logs. These keep track of all login attempts that use credentials from Remote Desktop Manager-linked password managers or the central vault.",
    "Devolutions provides phone and email support for Remote Desktop Manager by phone and email. The support team is available from 8 AM to 5 PM Eastern, five days a week.",
    "If you need help outside those hours, you have a couple of different options. First, check the online documentation, which is rich with tutorial videos. If that doesn’t have an answer for you, Devolutions also publishes a 1,100-page user manual for Remote Desktop Manager. Finally, the company runs an online community forum where you can ask other IT professionals for help.",
    "Remote Desktop Manager is one of the best network management solutions available for medium- to large-sized businesses. Role-based access controls are a major plus for IT administrators managing multiple teams across departments. The wealth of integrations is also a benefit, since you won’t have to completely transition away from existing password managers or authentication systems. That said, smaller IT teams are likely to find that Remote Desktop Manager is overkill for most simple helpdesk and screen sharing needs.",
    "The closest competitors to Remote Desktop Manager are TeamViewer and AnyDesk. Both of these platforms are much less expensive than Remote Desktop Manager, especially if you only have a handful of IT managers. But, they’re much more limited in scope as well.",
    "For example, TeamViewer gives your entire IT team remote network access for just $99 per month. But, that price only allows you to have one open session at a time. Getting three simultaneous sessions costs $199 per month. Remote Desktop Manager offers unlimited sessions at that price, although only for a single user.",
    "AnyDesk is a bit more robust, as it supports unlimited concurrent sessions for $52.99 per month. But, the software is more oriented around enabling access to network computers than to also controlling cloud server connections. Small businesses may find that AnyDesk is a good alternative if you don’t need everything that Remote Desktop Manager offers.",
    "To see how Remote Desktop Manager compares to other software on the market, check out our guide to the Best remote desktop software."
  ],
  "headers": {
    "2": "Remote Desktop Manager: Plans and pricing",
    "9": "Remote Desktop Manager: Setup",
    "13": "Remote Desktop Manager: Interface and performance",
    "16": "Remote Desktop Manager: Security",
    "18": "Remote Desktop Manager: Support",
    "20": "Remote Desktop Manager: Final verdict",
    "21": "The competition"
  },
  "links": {
    "best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software",
    "Remote Desktop Manager": "https://remotedesktopmanager.com/",
    "password manager": "https://www.techradar.com/best/password-manager",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "helpdesk": "https://www.techradar.com/best/best-helpdesk-software",
    "Best remote desktop software": "https://www.techradar.com/news/best-remote-desktop-software"
  }
}