{
  "source": "https://www.techradar.com/reviews/huawei-watch-gt-2-pro-review",
  "title": "Huawei Watch GT 2 Pro review",
  "category": "wearables",
  "updated": "2020-10-05T15:45:07Z",
  "author": "basil-kronfli",
  "summary": "Titanium looks and suped-up software",
  "verdict": "Huawei keeps adding to its Watch GT line with mini but meaningful updates. The latest refresh sees seriously premium design combined with wireless charging and the smoothest software experience in the series to date. It isn’t perfect - the GT 2 Pro doesn’t support third-party apps; nor is it buttery smooth all the time, however, with improved iOS compatibility, a comprehensive set of exercises and accurate tracking, we’re happy to see a mediocre line of products flourish into something great.",
  "pros": [
    "Seriously premium design",
    "10-14 day battery life",
    "Convenient Qi wireless charging"
  ],
  "cons": [
    "No third-party app support",
    "Notifications aren’t interactive",
    "Limited smarts"
  ],
  "article": [
    "The Huawei Watch GT 2 Pro is a fantastic looking smartwatch, machined from titanium, with a sapphire glass surface, and a ceramic back. Huawei’s made a few great-looking wearables in the past, but the GT 2 Pro could be one of the best looking smartwatches on the scene.",
    "Inside, it runs with Huawei’s custom interface, LiteOS, which is part of the problem and solution the GT 2-series presents. The interface is indeed lite, and can’t stack up to those other smartwatches run from a third-party apps point of view.",
    "What LiteOS is, however, is battery efficient and fully-featured out of the box, so its limitations might not actually hold you back.",
    "The watch will relay notifications from your phone, and in a turn up for the books, plays nicely with iPhones now, unlike its predecessor, the original Watch GT 2. Data captured from it will feed into Apple Health, Google Fit, or MyFitnessPal, but you won’t be able to use its smarts for other third-party training apps like Strava.",
    "In the box, the watch ships with both a leather and a silicone strap, both straps sporting traditional buckles rather than Apple Watch or Oppo Watch-style clasps. Despite being titanium, we didn’t find the watch weighed us down too much, and we slept with it on with no issues or discomfort. That said, it definitely isn’t dainty.",
    "The Huawei Watch GT 2 Pro’s 1.39-inch OLED display is sharp, deep, inky and punchy too, and gets sufficiently bright. Auto brightness is a bit dim indoors, but pumps up when out and about to make the UI easily visible.",
    "Our favorite feature to be added to the series is the Watch GT 2 Pro’s wireless charging support. This takes the headache of fumbling with a proprietary charger, and worked across four different Qi chargers we used, including the back of our Samsung Galaxy Note 20 Ultra.",
    "When it comes to exercises and tracking features, Huawei’s stepped things up, with a route back tool - so even when mobile data is waning, you can still find your way home. There’s also an Outdoor Assistant onboard, which showcases sunrise and sunset times, tide, moon phase and bad weather information and alerts.",
    "The Watch GT 2’s heart rate monitor has also seen a boost, with better light transmission promised, which in turn, equates to more accurate tracking. In our time with it, it matched our chest strap more closely than the two other wearables we tested alongside it, the Nubia Watch and the Xiaomi Mi Band 5.",
    "Great battery life is never a given for a smartwatch, but the Huawei Watch GT 2 Pro lasts roughly 5-6 days with the always-on display active, 10-14 without. While it isn’t Apple Watch smooth, swiping feels more instantaneous than on old Watch GTs, and performance was stable in our week wearing it.",
    "The result is a great looking fitness tracker with fantastic build quality and a comprehensive feature set. That said, it isn’t without limitations, so won’t suit fitness enthusiasts who rely on third-party app support.",
    "Two minutes with the Huawei Watch GT 2 Pro and it’s clear - this is a premium smartwatch, so we weren’t too shocked to see its price climb up to £300 (around $390, AU$530).",
    "That’s compared to £199 for the Huawei Watch GT 2, and £159 for the Watch GT 2E.",
    "With the Watch GT 2 Pro announcement being so fresh, we’re going to have to wait to see how much it actually retails for in other markets. Check back in the coming days for regional pricing.",
    "You can buy the watch in the US, and we can be guaranteed that the Watch GT 2 Pro won’t launch in the US given the Huawei ban in place. Having said that, we would expect it to launch in Huawei’s standard markets, including Australia but we've yet to find out when it's out there.",
    "Smartwatches have come a long way - think back to the Pebble, and the Samsung Gear S - all rectangles heralding the now ubiquitous Apple Watch. Now, it’s gone full circle, with many of today’s finest wearables looking more like their old school, analogue counterparts of old.",
    "The Huawei Watch GT 2 Pro is one of the best looking round smartwatches we’ve used. Its sapphire glass fascia with its framed bevels bend into the sculpted titanium body. It has confident, classical styling, combining subtly contrasted finishes across and a rich, cohesive aesthetic.",
    "If you get the chance to see one in the flesh, we’d urge you to. Many smartwatches either feel clunky or insubstantial, but the Watch GT 2 Pro strikes the balance of being a well-weighted, traditional looking smartwatch with a big, bold display.",
    "The 1.39-inch screen size means the watch isn’t small - and in turn, it won’t appeal to anyone with daintier wrists looking for a subtle watch. There should be a smaller 42mm version down the line, but we’re currently waiting on details of its release.",
    "As with most smartwatches, the Watch GT 2 Pro’s screen is OLED, and gets bright enough for comfortable viewing. Having said that, its auto-brightness can be a touch over-zealous indoors, dimming things down until natural light floods your wrist - after which it brightens right up. Outdoors, however, we had no issues with brightness, and generally, viewability was great",
    "With two buttons on the right which look like rotating crowns (they’re not), the top one takes you to your apps list, while the bottom button is customizable.",
    "The watch ships with a leather and a silicone strap, both with easy release clasps, and it takes standard fitting 46mm third-party straps as well, so you can get customizing with ease.",
    "Comfortable day-to-day, we wore the Watch GT 2 Pro 24/7, waking and sleeping in our week with it, and naturally while working out. Despite effectively being a unibody chunk of machined metal, it didn’t feel bulky or uncomfortable, and the ceramic back didn’t leave our wrists sweaty, unlike some cheaper smartwatches do.",
    "The design of the Watch GT 2 Pro gets near enough full marks if you’re looking for a large, classical looking digital timepiece, and really does illustrate just how far Huawei’s hardware design has come.",
    "It’s a wonder the Huawei Watch GT 2 Pro is as smooth as it is, given the fact its specs are so pared back compared to those of the Apple Watch or Samsung’s latest Galaxy Watch 3.",
    "With just 32MB of RAM, and an incredibly low-power, last-gen Kirin A1 CPU, if you want third-party apps and maximum smarts on your wrist, this isn’t the watch for you. Huawei knows what it’s doing though, as it’s optimized the software on the Watch GT 2 Pro incredibly well. Despite familiar hardware, therefore, the UI just feels smoother than before.",
    "Why would you want a low power watch? No Apple, Samsung or Wear OS smartwatch has excellent battery life - that’s usually reserved for fitness trackers like the Xiaomi Mi Band 5. Huawei’s first Watch GT cracked this battery nut but packed poor UI smoothness.",
    "The Watch GT 2 improved upon this, and the Watch GT 2 Pro feels smoother still. So no Apple Watch smoothness isn’t ideal, but the Apple Watch won’t make it past two days on a single charge.",
    "There are compromises you make for this low power route Huawei’s taken. The Watch GT 2 Pro doesn’t support third-party apps. It has a comprehensive suite of the usual suspects on-board, but you’ll have to wait for OS updates to supplement the out of the box experience.",
    "Additionally, it doesn’t support interactive notifications. Like a fitness tracker, therefore, it relays alerts from your phone, but you can’t respond to messages on your wrist.",
    "On the subject of notifications, one huge update is the fact the Watch GT 2 Pro works almost identically with both Android and iOS from a usability point of view - a major criticism of past generation GTs. In turn, if you fancy a round watch and have an iPhone, for the first time ever, a Huawei timepiece should be on your shortlist.",
    "You can call contacts directly from your GT 2 Pro, using the watch as a Bluetooth receiver. The result is among the clearest watch calling we’ve experienced, and the range is exceptional. Our phone was on a different floor in a 1930s, traditionally built house and we were still able to accept a call and speak using the watch without any difficulty.",
    "As for the core UI, it’s a simple enough system; swipe left and right to cycle through menus - sleep, heart rate, stress levels, weather and activity. Celia, Huawei’s voice assistant will be making its way onto the GT 2 Pro, however, wasn’t working with our early review watch sample. There’s a quick toggle menu that can be swiped down from the top of the screen, and your notifications can be swiped up from the bottom.",
    "Thankfully, the Huawei Health app is also a solid offering across iOS and Android, acting as a dashboard for your health stats, and also helping you manage your watch. Through it, you can choose from a variety of watch faces, which can also be done with the watch itself, set favorite contacts, manage stress tracking and more.",
    "The Huawei Watch GT 2 Pro uploads health data to three key services - Google Fit and MyFitnessPal if you’re using it with an Android phone, and Apple Health if using it with an iPhone. Those services tap into the Watch’s heart rate, sleep, step and workout tracking, making for a more connected experience than the first generation Watch GT.",
    "Press the upper physical button for an app list filled with fitness highlights - Workouts taking pride of place at the top. This list is also where you can review Workout records, track your Heart rate, SPO2, and Stress levels at will, or take a chill pill with some Breathing exercises.",
    "The Watch GT 2 Pro delivers all your usual clock tools - alarms, a timer and stopwatch, in addition to some handy hiking helpers - a barometer and a compass.",
    "We won’t go into all 100+ workouts tracked on it, but it is worth noting that thanks to 5ATM water and dust proofing, the Watch GT2 Pro supports swimming in both a pool and open water, and it also sports a triathlon mode. There’s even skiing tracking.",
    "Huawei’s latest Lite OS gives users the option to add and remove shortcuts to workouts at will, reducing list scrolling and making finding the workout you want easier. If your exercise of choice is outdoors, an excellent highlight is the handy offline navigation aide, which can help you find your way home if you get lost.",
    "The GPS accuracy was reliably spot-on in our time with the watch, matching up with both a phone and a pricier wearable, as too was the heartrate monitor, reading just a few beats high when compared to a chest strap.",
    "We do have one massive issue with the Watch GT 2 Pro - aside from the lack of support for third-party apps like Strava and Spotify. Every time you start a workout, an incredibly loud, incredibly annoying voice projects from the watch to tell anyone in listening distance you’re training.",
    "Then, at various milestones, it pipes up all over again. It’s been a couple of generations now, please, Huawei, swap out your voice coach’s voice, it’s like nails on a chalkboard. Thankfully, it’s easy enough to mute the voice coaching.",
    "The Watch GT 2 Pro lasts and lasts, just like the GTs before it. Huawei’s quoted 14 days is realistic if your brightness is capped and your workouts kept to a minimum. Use it regularly, however, and you’ll more likely get anywhere between 5-10 days.",
    "For us, 7-10 day battery life on a smartwatch that looks this good is exceptional. What makes the Watch GT 2 Pro even better is the fact it’s the first Watch from Huawei to offer wireless charging. Better still, unlike Samsung’s latest smartwatch, the GT 2 Pro worked with no less than four of our Qi chargers, powering up in under half an hour.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Huawei Watch GT 2 Pro price and release date",
    "15": "Design and display",
    "24": "Performance and software",
    "34": "Fitness",
    "42": "Battery life",
    "44": "Don't buy it if..."
  },
  "links": {
    "Watch GT 2": "https://www.techradar.com/reviews/huawei-watch-gt-2-review",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Oppo Watch": "https://www.techradar.com/reviews/oppo-watch-review",
    "Samsung Galaxy Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Xiaomi Mi Band 5": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-5",
    "Huawei Watch GT 2": "https://www.techradar.com/reviews/huawei-watch-gt-2-review",
    "Watch GT 2E": "https://www.techradar.com/reviews/huawei-watch-gt-2e-review",
    "Pebble": "https://www.techradar.com/reviews/wearables/pebble-2-1329989/review",
    "Samsung Gear S": "https://www.techradar.com/reviews/wearables/samsung-gear-s-1263307/review",
    "Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Watch GT": "https://www.techradar.com/reviews/huawei-watch-gt-review"
  }
}