{
  "source": "https://www.techradar.com/reviews/gopro-hero7-black-review",
  "title": "GoPro Hero 7 Black review",
  "category": "cameras",
  "updated": "2020-12-01T17:21:13Z",
  "author": "matt-golowczynski",
  "summary": "This former flagship now offers fantastic value",
  "verdict": "The Hero 7 Black is now the entry-level model in GoPro's new lineup, which means it now offers excellent value. It was the model that brought software leaps like HyperSmooth stabilization and TimeWarp, which still easily stand up today and have only really been refined by its successors. Video and stills quality is excellent, and it has built-in waterproofing without the need for a case. It isn't compatible with GoPro's new Mod accessories and lacks the Hero 9 Black's front-facing screen. But if you just want a tough, reliable action camera with impressive image quality, it's the best value GoPro you can buy.",
  "pros": [
    "Great 4K video and image quality",
    "HyperSmooth is very effective",
    "TimeWarp is great fun",
    "Useful UI improvements"
  ],
  "cons": [
    "Can struggle with voice commands",
    "Screen unresponsive at times",
    "Slo-mo footage only output through app or software",
    "Many cheaper options"
  ],
  "article": [
    "The GoPro Hero 7 Black is now the entry-level model in GoPro's revamped lineup, thanks to the arrival of the GoPro Hero 9 Black. But this former flagship is far from a basic action camera – in fact, for most people it's one of the best-value action cameras around.",
    "Throughout GoPro's history, there have been certain models that have represented big leaps forward – and the Hero 7 Black is one of them. It was the first GoPro to debut HyperSmooth image stabilization, which still stands up today as one of the best EIS systems you can find on an action camera.",
    "While subsequent flagships have made this mode available in a wider range of shooting modes – it isn't available in the Hero 7 Black's for 2.7k/120p mode, for example – this first version of HyperSmooth remains a strong selling point, particularly compared to budget action cameras or older GoPros.",
    "With its refreshed UI and the ability to shoot 4K/60p video, the Hero 7 Black is still a highly polished action camera that is a great value all-rounder for anyone who wants a waterproof ally for their smartphone or main camera.",
    "While some may be disappointed to know that many of the core specs are essentially carbon copied from the Hero6 Black, GoPro’s thinking for this model was clearly less about boosting frame rates and packing more pixels, and more about improving the actual experience of using the device.",
    "This means the Hero 7 Black still incorporates the same 12MP sensor and the same wide-angle lens, for example, and the top video specs of 4K at 60fps and Full HD to a maximum 240fps for 8x slowed-down footage are also unchanged. The myriad of additional sweeteners on top of this, however, make this a significantly more powerful camera than before.",
    "HyperSmooth",
    "The most significant of these is HyperSmooth, a form of video stabilization that GoPro ranks as being the equivalent to using a gimbal. A combination of hardware and software, rather than simply an upgraded optical stabilization system, this was developed in response to user feedback – indeed, this was apparently the number one request – and it presents a clear advantage for anyone who may find using a gimbal for their chosen thrill inconvenient.",
    "GoPro isn’t shy about its capabilities, going as far as claiming that it's the best in-camera video stabilization system not just of any action camera, but of any camera. On top of that, the means of its operation are said to have no additional penalty on battery life.",
    "Unlike the Hero 6 Black, which only allows regular stabilization to be applied to 30fps when shooting in 4K, HyperSmooth can be used even when capturing 60fps footage at full resolution (though not at 4:3) on the Hero 7 Black. The only other time you can’t call upon it is when capturing Full HD footage at 240fps and 120fps footage, although standard standard stabilization is available at the latter frame rate.",
    "TimeWarp video is a further new feature on the Hero 7 Black, one that combines the idea of regular frame-by-frame time-lapse shooting (which you can still do separately) with HyperSmooth – essentially, a stabilized hyperlapse. In essence, it allows you to capture time-lapse footage with the freedom to move the Hero 7 Black at all times. That’s right: time-lapse footage without a tripod, and whatever movement you want.",
    "Voice Control is once again on hand, recognizing 12 separate commands such as “GoPro take a photo” and \"GoPro start video recording”, which, between them, cover all the main tasks.",
    "Audio performance was also revamped on the Hero 7 Black. GoPro expanded dynamic range, providing more natural bass tones and brighter mids, and also redesigned the microphone membrane to eliminate the vibrations that might be picked up, all the while ensuring it can capture more subtle sounds than before.",
    "Easier to take photos",
    "Another new option on the Hero 7 Black was SuperPhoto, something akin to a scene-intelligent auto option on a more conventional camera, which automates a handful of helpful features that you may not think to enable when capturing photos.",
    "So, instead of calling on HDR when shooting scenes with a wide dynamic range, it will do it for you if you want it to. Similarly, the Hero 7 Black deploys multi-frame noise reduction for low-light scenes, if it feels the need to do so.",
    "For the benefit of those who do want intervene and get creative, ProTune will give you freedom to adjust things like exposure compensation, white balance, ISO range, sharpness and so on. You can capture raw images in addition to JPEGs on the Hero 7 Black, and also shoot bursts of images at a maximum 30fps, telling the camera how many images over how long a duration you want it to capture.",
    "The GoPro Hero7 Black also becomes the first Hero model with the capability to live-stream built right into it. This works with Facebook right now, but is set to shortly work with YouTube ad other channels too.",
    "The GoPro Hero 7 Black offers the same kind of rugged and largely rubbered body as the Hero 6 Black, although the sides of the devices are just as smooth as the front, rather than ridged. This also means the previous two-tone look is now gone, but you’ll likely have the GoPro in a case of some kind, so this makes very little difference in use.",
    "Build quality of the Hero 7 Black feels just as solid as the Hero 6 Black. The two doors to the battery/card and USB/HDMI compartments can be a little fiddly to open, though the design is necessary to ensure waterproofing. Without a housing the camera can travel 10m/33ft safely underwater (just as before), although you can go even deeper with the optional Super Suit.",
    "A small plastic frame that wraps around the GoPro Hero 7 Black and clips into place is provided as standard, and this can be mounted on an adhesive stand to keep the camera in place, in addition to many other mounts for helmets, handlebars and more.",
    "One of the advantages of the newer GoPro Hero 8 Black is that it has built-in mounting prongs, which means you no longer need this frame. And indeed, first-time users of the Hero 7 Black are likely to be cautious and find some of this fiddly, as everything is necessarily tight so that it all stays in place when you’re using it in the kinds of expected conditions. But you do soon become used to how rough you need to be with it.",
    "Turn the Hero 7 Black on and you can see just how much GoPro changed things around from its predecessor. There's a refreshed UI, with key information such as current frame rate and resolution condensed into a smaller space, and green icons to show battery life and remaining cards space now easier to see against brighter subjects than the previous white ones.",
    "The Hero 7 Black is also more smartphone-like in operation, with simple directional swipes to access different modes, captured footage/images and more. You can still alternate between shooting modes with a press of the Mode button on the side, but you can also swipe to do the same.",
    "The UI on the Hero 7 Black also adapts to portrait orientation when you have the camera positioned this way, which makes it easier to operate. You can disable it if you think this will be more of a nuisance than a help, but it doesn't seem to be so sensitive enough to warrant the average user needing to do this.",
    "The touchscreen on the Hero 7 Black bears the same 2-inch dimensions as its predecessors, and on the whole it’s generally responsive, but it occasionally fails to respond to touch, and on such a small display it can be annoying to have to jab the same function a few times.",
    "Voice Commands are largely unchanged from before, although you can say ‘GoPro Capture’ and the camera will start recording or take a photo, depending on what mode you’re in. It will even respond to you saying ‘That was sick’ with a Hi-light, but if you’re not a teenager, you can simply say GoPro Hi-light’ to perform the same action. Or, as it happens, 'oh shit'.",
    "The Hero 7 Black generally responds well to a range of voice commands, although as you can probably imagine it’s not quite 100% reliable, and sometimes these need to be repeated a few times. It would also be good to add your own commands to the Hero 7 Black, which is one area we can see this evolving, although pretty much all key functions are covered already."
  ],
  "headers": {
    "4": "GoPro Hero 7 Black review: features",
    "18": "GoPro Hero 7 Black review: build and handling"
  },
  "links": {
    "Hero6 Black": "https://www.techradar.com/reviews/gopro-hero6-black",
    "gimbal": "https://www.techradar.com/news/the-a-to-z-of-photography-gimbal",
    "dynamic range": "https://www.techradar.com/news/the-a-to-z-of-photography-dynamic-range",
    "GoPro Hero 8 Black": "https://www.techradar.com/reviews/gopro-hero-8-black"
  }
}