{
  "source": "https://www.techradar.com/reviews/usenetbucket",
  "title": "UsenetBucket review",
  "category": "computing",
  "updated": "2020-11-22T21:18:08Z",
  "author": "desire-athow",
  "summary": "A decent mid-tier Usenet platform",
  "verdict": "Reasonably priced, with good speed and lower-than-usual retention, UsenetBucket is nevertheless a great gateway to Usenet.",
  "pros": [
    "Affordable",
    "User-friendly interface"
  ],
  "cons": [
    "Limited retention",
    "Lack of buy-outright plans"
  ],
  "article": [
    "Finding a Usenet provider can be as tricky as finding a new ISP, signing up to a VPN, or buying web hosting. You've got speed, download volumes, retention, SSL, simultaneous connections, an optional VPN, occasional exclusive newsreader clients… and then the price.",
    "Usenet services typically offer multiple packages, but things can often get confusing with multiple payment options, tiered features, and even pre-pay blocks. What is needed is a simpler Usenet provider.",
    "Offering Usenet access through a newsreader, UsenetBucket has an affordable collection of simple tiers, as well as a full-featured free trial option. But is it worth consideration?",
    "Launched in 2010, UsenetBucket is operated by UsenetBucket B.V. and based in the Netherlands. It declares its mission is to give \"the best Usenet experience in the business, by giving you full control.\"",
    "It does this with prepaid, flexible packages. These can be extended, upgraded, downgraded, or cancelled at any time. A dedicated Customer Support Team is available for 24/7 assistance, while there is a Customer Advisory Panel, both accessible via a neatly-presented members' area.",
    "Depending on the package you choose, UsenetBucket will give you a maximum 400Mbps link, 25 simultaneous connections, and unlimited traffic. As standard there is SSL support, with 1600 days retention.",
    "UsenetBucket also boasts secure payments process by certified payment providers, along with a detailed status page. This is a useful feature that most other providers don't offer (relying on social media, for example). It simply tells you the current status of the UsenetBucket servers, useful for diagnosing issues with your connection.",
    "The members' area presents everything you need to manage your account. Personal information, invoices, and access to the support team is available here. It's important to underline the importance of a clearly presented members' area; many of Usenet providers offer the minimum of options, but UsenetBucket basically provides everything you could possibly need.",
    "For many Usenet subscribers, retention is a deciding factor in whether they subscribe or not. While speed might be important, low retention is often considered a reason to avoid.",
    "The reason is simple: retention indicates the number of days data has resided on a Usenet server. A lower figure means less retention, an incomplete archive.",
    "1600 days retention is available from UsenetBucket, around 4.5 years' worth of data. As retention levels go, this is low. Some providers are delivering access to text and binaries (media files) from 2008 and in earlier.",
    "While it might be argued that a smaller Usenet archive can result in an optimised, faster service, there are providers offering 12+ years with superfast file delivery, so that argument doesn't hold data.",
    "Suffice to say, 1600 days retention is the lowest we've seen.",
    "UsenetBucket provides the option of an SSL connection for accessing Usenet. This ensures the same degree of privacy as you would expect over a standard HTTPS connection - such as that used by online banking, online shopping, or reading websites like TechRadar.",
    "A detailed Privacy Policy is provided by UsenetBucket. This outlines how your data is used. For instance, your data is \"never released to others, unless we are ordered by a court of competent jurisdiction.\" Additionally, the company \"has never sold or rented member lists or any other member information\" and states it never will.",
    "Also, key for privacy advocates accessing Usenet through UsenetBucket: \"[…] does not monitor or record your activities online. We do not monitor which newsgroups you post to or download from or what you put in news articles that you post.\"",
    "The other side of the coin is the Acceptable Use Policy, covering everything from account sharing and netiquette to spam and breaching copyright. A dedicated misuse/abuse department is in operation for dealing with copyright claims.",
    "While your full name and email address is required for signup, there is a cryptocurrency payment option to keep your activity as private as possible.",
    "To test UsenetBucket, we assessed the current speed of the domestic fibre connection over a UK VPN server using Ookla’s Speedtest. The result of this was 60.74Mbps.",
    "Two files were downloaded to gauge an impression of UsenetBucket's speed. The first was a five-day old video binary of 1.8GB, which downloaded swiftly at an average rate above 1800Kbps. The second, 377MB audio, dropped at just over 2000Kbps.",
    "It may be an impact of the comparatively low retention, but during testing the search results did not appear to provide older binaries to download. This may be due to the retention limit, to an (unstated) focus on NBZ files, or the luck of the search term.",
    "UsenetBucket offers three \"buckets\" of Usenet access covering different payment options and requirements. All three have unlimited traffic, SSL, and 1600 days retention.",
    "The Basic Bucket is €2,95 (equivalent to £2.68, or $3.48) every 30 days, with a 15Mbps limit and 10 simultaneous connections.",
    "Stepping up, the Comfort Bucket is €4,95 (£4.49, $5.84) per 30 days with a 60Mbps limit and 10 connections.",
    "Finally, the Ultimate Bucket is €12,95 (£11.75, $15.27) every 30 days, with a high 400Mbps speed limit and 25 simultaneous connections.",
    "A free 7-day trial is also available, giving you access to UsenetBucket's Ultimate Bucket package.",
    "Payment is via credit card or PayPal, PaySafeCard, or cryptocurrencies Bitcoin, Bitcoin Cash, and Ethereum. These offer varying levels of confidence and privacy, so check your preferred payment method for details.",
    "It's not often we come across a Usenet provider that seems accessible to newcomers to downloading using NZBs from newsgroups, but UsenetBucket certainly fits the bill. Easy to set up, fast, and with a simple but comprehensive members' area, UsenetBucket has some good support tools.",
    "The low retention is a key shortcoming to UsenetBucket, but there is so much more on offer that we can almost forgive it. With three clearly defined pricing levels and a free trial, anyone can try out UsenetBucket without committing."
  ],
  "headers": {
    "5": "Features",
    "8": "Retention",
    "13": "Security and privacy",
    "18": "Performance",
    "21": "Pricing",
    "27": "Final verdict"
  },
  "links": {
    "Usenet provider": "https://www.techradar.com/best/best-usenet-providers",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "web hosting.": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "UsenetBucket": "https://usenetbucket.com/",
    "status page": "https://status.usenetbucket.com/",
    "Privacy Policy": "https://usenetbucket.com/privacy-policy/",
    "Acceptable Use Policy": "https://usenetbucket.com/acceptable-use-policy/",
    "Speedtest": "http://www.speedtest.net/",
    "Basic Bucket": "https://signup.usenetbucket.com/en",
    "Comfort Bucket": "https://signup.usenetbucket.com/en",
    "Ultimate Bucket": "https://signup.usenetbucket.com/en",
    "free 7-day trial": "https://usenetbucket.com/free-usenet-trial/"
  }
}