{
  "source": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/dell-xps-13-1328971/review",
  "title": "Dell XPS 13 (2019) review",
  "category": "computing",
  "updated": "2021-04-02T20:47:26.617Z",
  "author": "joe-osborne",
  "summary": "Dell’s biggest small change yet",
  "verdict": "With its much-improved webcam and longer battery life, the Dell XPS 13 is still among the very best the world over, even if it may not have our sought-after ‘Best in Class’ label anymore.",
  "pros": [
    "Webcam now above display",
    "Big battery life boost",
    "Updated processors",
    "New Frost color option"
  ],
  "cons": [
    "Otherwise tiny update"
  ],
  "article": [
    "Check out our Dell XPS 13 (Late 2020) review for the latest model of the smallest XPS laptop. See also the top Dell laptops 2021 has to offer.",
    "The 2019 follow up to the smallest XPS line, the Dell XPS 13 (2019), proves once again that Dell’s popular portable machine is worth all the hype. For years, the XPS 13 has ranked among the best laptops on the market, and this latest model is keeping it as such, even going as far as to improve on its legacy.",
    "Despite the tough new competition coming out of the high-end Ultrabook market, the Dell XPS 13 (2019) has kept up with some vital upgrades while still preserving everything we know and love about the line. It’s taken previous iterations and refined them in just the right areas – like returning the webcam to where it belongs – while adding some new features and other improvements to the mix, like a significant boost to battery life.",
    "The result is a laptop that boasts a performance that rivals the best of them and an exquisite design that’s almost unparalleled. If you want a top of the line Windows ultrabook – perhaps if you’re ready to move on from that Chromebook or Mac laptop – then the Dell XPS 13 (2019) is a more than worthy choice.",
    "When it was first released, Dell was asking $978 for it in the US market, and that was for the XPS 13’s starting configuration. This price got you an 8th-generation Intel Core i3 processor, and just 4GB of 2,133MHz DDR3 memory as well as a 128GB PCIe SSD along with a 13.3-inch Full HD (1,920 x 1,080) InfinityEdge display.",
    "However, this model is no longer available on the Dell website. Right now, the US lineup starts at $1,149, which gets you an 8th-generation i5 coupled with 8GB RAM and 256GB SSD.",
    "There are three more customizable models on hand, topping out with an 8th-generation quad-core Intel Core i7 CPU, 16GB of RAM and a 2TB PCIe SSD – fitted with a stunning 4K (3,840 x 2,160) touch screen inside a Rose Gold or Frost White chassis. Just be ready to pay an exuberant $2,479 for this configuration.",
    "All configurations are available in Dell’s three colors: silver-on-black, rose gold-on-white and a brand-new frost-on-white layout. The model you see reviewed here would set you back a cool $2,279.",
    "In the UK, the Dell XPS 13 may be had for as low as £1,379. That’s for a configuration with an Intel Core i5 chip, 8GB of RAM and 256GB SSD rounded out with a 4K touchscreen display. Australian buyers will find a similar configuration, only with a Full HD display, for AU$2,299.",
    "The Dell XPS 13 2019 comes in plenty of different configurations. However, there are fewer options on hand for buyers in the UK and Australia. It’s worth remembering that larger storage options are tied into some hefty price bump. But, that doesn’t change the fact that the Dell XPS 13 is still in the same league as its similarly priced rivals – that is, except for the tremendous value of the flagship Huawei MateBook X Pro, especially at the high-end.",
    "If the 8th-generation processors are too dated for you, it’s also worth noting that the line-up has been refreshed to now tout 10th-generation chips for all three markets, with not much increase in their price tags.",
    "At first glance, the Dell XPS 13 looks a lot like its precursor, and that’s mainly the case here. However, Dell also didn’t just take an “if it ain’t broke” approach this year. It actually fixed the XPS’s most obvious design flaw: the location of its webcam. In the 2019 model, the webcam is now back in its rightful place above the display.",
    "Dell is very proud of its new 2.25mm webcam, which it spent two years to design. It’s not only small enough to sit above the thin-bezel display, but also uses a 720p widescreen sensor paired with four far-field microphones, which allows you to activate and use Cortana or Alexa from a good distance.",
    "The webcam’s image quality isn’t anything to write home about. However, we still appreciate the fact that the wider frame is making capturing co-workers or friends next to us even easier. Considering 0.9 megapixel stills and 720p video, you’ll look satisfactory in meetings; just don’t anticipate Twitch broadcaster level quality.",
    "Elsewhere, the build quality and design language are mostly unaltered from preceding model. The laptop is just as thin and light as last year at 0.46 inches (11.6mm) and 2.7 pounds (1.23kg), respectively. The Dell XPS 13 also has the same anodized aluminum screen lid and base, coupled with a woven carbon fiber (or glass fiber on light colored models) keyboard deck.",
    "As for the keyboard, it’s just as punchy and responsive as ever, and the glass-coated touchpad is still superb and comfortable to use. These are two of the features from the Dell XPS 13 that were rightly left alone.",
    "The lineup of ports also stays the same, with two Thunderbolt 3 (USB-C) ports, one USB-C 3.1 port, a microSD card slot and a 3.5mm headphone jack. And, that’s a good thing since this selection is significantly better than many competing laptops, with some of them sticking solely to USB-C 3.1 and not the superior Thunderbolt 3 standard.",
    "Another thing that’s unchanged is the display, not that it needed to be updated. It’s just as dynamic and vibrant as ever in both the Full HD and 4K touchscreen models, and the bezels around the display are practically non-existent.",
    "Specifically on the 4K model we tested for the review, we find the 100% sRGB color reproduction through Dell’s CinemaColor tools to be gorgeous, made even better by some popping HDR techniques and 400 nits of brightness. The 4K panel is very detailed, but it still might be a bit too much for a 13.3-inch viewing area.",
    "Overall, there wasn’t a lot that needed to be changed about the XPS 13 design, except for that one particular elephant in the room that Dell finally fix.",
    "First reviewed January 2019",
    "Images Credit: TechRadar"
  ],
  "headers": {
    "4": "Price and availability",
    "11": "Design and display"
  },
  "links": {
    "Dell XPS 13 (Late 2020)": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Dell laptops": "https://www.techradar.com/news/the-best-dell-laptops",
    "best laptops": "https://www.techradar.com/news/best-windows-laptop",
    "Chromebook": "https://www.techradar.com/news/best-chromebook",
    "Huawei MateBook X Pro": "https://www.techradar.com/reviews/huawei-matebook-x-pro"
  }
}