{
  "source": "https://www.techradar.com/reviews/bittium-tough-mobile-2-c",
  "title": "Bittium Tough Mobile 2 C review",
  "category": "phones",
  "updated": "2020-10-20T12:20:53.921Z",
  "author": "mark-pickavance",
  "summary": "Bittium offers secure duality in a tough phone format",
  "verdict": "Phone security is important to some and they’d be interested in this device, and possibly less concerned about the high price. The specifications of this device aren’t premium, but the real effort went into making it secure.",
  "pros": [
    "Dual personality",
    "Secure Android 9",
    "2nd factor authentication with NFC"
  ],
  "cons": [
    "Expensive",
    "Modest battery capacity"
  ],
  "article": [
    "Bittium, as everyone learned at school, is a genus of Molluscs from the family of Certhiidae, but it also the name taken by a Finnish Corporation based in Oulu.",
    "They specialise in the development of secure communications and connectivity solutions, that includes a Tactical Wireless IP Network, Tough VOIP, Specialized Device Platform, secure VPN (SafeMove) and the subject of this review, Bittium Tough Mobile.",
    "As that collection hints, the Bittium brand covers telecommunications, IoT and defence industry business.",
    "The Bittium Tough Mobile 2 C reviewed here is a telecoms device that might well be of interest to the defence sector, along with those organisations where security is paramount.",
    "Your mission, should you choose to accept it, is to read about the type of phone that professionally paranoid people have, and discover what it costs to join them.",
    "The Bittium Tough Mobile 2 comes in three flavours that include a standard Android phone, a secure Android implementation and the 2 C reviewed here that offers both options in a single device.",
    "The Android pre-installed Mobile 2 is € 1,550 and the secure implementation is € 1,650 (both inclusive of VAT). But the solution reviewed here with both modes cost more, at least € 2,000, but Bittium was unwilling to say exactly how much it is because it is part of a system with potentially a customer-side server installation.",
    "This product is firmly targeting the Enterprise sector, not individuals, and therefore exact pricing can fluctuate based on the scale of investment.",
    "These prices easily make this the most expensive rugged phone we’ve reviewed, and easily one of the most costly smartphones we’ve ever reviewed.",
    "You'll be delighted to hear, it comes in black.",
    "There isn’t anything especially flash or distinctive about this phone from the outside.",
    "Out of the box, the phone displays no prominent branding or anything that constitutes a design motif or signature graphics.",
    "Those that designed the C2 took the monolith from 2001: A Space Odyssey, then fashioned that out of an aluminium block, put rounded corners on it and called it a phone.",
    "It comes with a custom rubber bumper on, although you can remove this if you want to see the logo hidden under it and a giant sticker that reveals the functions of the various buttons and the SIM card tray.",
    "The button selection includes a power on/off, privacy mode, volume up and down, push-to-speak and an emergency button. Charging is via a USB-C port centred on the bottom edge, and there is a 3.5mm audio jack on the top left side.",
    "Engineering of the phone is of the highest quality, although the rubber bumper hides most of those efforts and it collects copious amounts of dust from any surface it is placed.",
    "An overriding theme of this design is that those behind it wanted to boil the smartphone down to its most basic elements and therefore anything that might be considered frivolous has been omitted.",
    "Included in the list of things that aren’t on this phone that you might expect are a fingerprint sensor, multi-lens camera and wireless charging. When you consider that every phone that costs a third of what this one does has all those things, and plenty more, it highlights how the Bittium Tough Mobile 2 C is not like them and was never meant to be.",
    "The biggest difference is that this phone is that it can be multiple Android phones in one. In one mode it is a device you might use to talk to your family and play games on, and in another, it is a totally different platform that is configured for secure communications using only security approved applications.",
    "To access each personality requires a reboot, and by default, the phone will revert to the security profile if shutdown and restarted.",
    "As the second level of security, Bittium provides a Yubico NFC key on a lanyard that needs to be touched to the underside of the phone when it starts. Lose the key or input your unlock code repeatedly, and the 2 C could become a paperweight.",
    "The intention of the designers is that the open side should be treated like any other Android 9 mobile phone, where the secure side has apps that are remotely installed, and communications monitored through Bittium Secure Suite management software.",
    "In this way, those who want to be confident that their staff aren’t giving away state or business secrets via an app they found online can feel more in control.",
    "Where this rates in the scheme of mobile devices for government officials is hard to gauge, but in building a multi-layered solution for mobile comms, Bittium has gone considerably further than most smartphone makers, including Apple.",
    "The contents of the phone are continually audited for its validity, and the modified version of Android 9 has anti-modification mechanisms in place to make sure that its security features aren’t disabled or subverted.",
    "At the core of the 2 C is an SoC built around the Qualcomm Snapdragon 670 SoC and Adreno 615 GPU combination, a 2018 launched chip that would be familiar to anyone who has used the Google Pixel 3a, Pixel 3a XL, Oppo R17, Vivo X23 or Vivo Z23.",
    "Most of these devices all cost under $200, but the Pixel phones are closer to $400, even if they’ve been superseded by the Pixel 4.",
    "This chip isn’t the fastest Qualcomm makes, and its popularity with phone makers wasn’t huge compared with other Qualcomm chips. But it has an impressive eight-core structure where it uses has two 2.0 GHz Kryo 360 Gold (Cortex-A75 derived) matched with six 1.7 GHz Kryo 360 Silver (Cortex-A55 derived) cores.",
    "While it won’t break any speed records, this SoC is a tried and tested solution that delivers a generally good user experience and decent battery life. And, given the complications of creating secure Android installations in this context, the temptation would have been to go with something much older and exploit investigated.",
    "The quoted storage is 64GB, but due to the segmented nature, each Android installation only gets 16GB of space. It is possible to install a 256GB Micro SD card on the SIM tray, but again that would be partitioned so that each side had exclusive access to its area.",
    "This division is a critical aspect, as the secure side of the phone needs protecting from whatever is loaded into the insecure for this solution to be credible.",
    "One area that will disappoint some is the cameras, with the rear being just 12MP autofocus and the front 5MP fixed-focus. Those are low-resolution sensors by current standards, and the lack of a macro lens or any means to create multi-focal images on the rear sensor is a notable omission.",
    "It can take reasonably sharp images but is the white balance is easily confused by artificial lighting resulting in oddly tinted pictures.",
    "A redeeming aspect of the rear camera is that the Snapdragon 670 has the power to process the camera data fast enough to allow for 4K video recording, although to use this effectively would need the extended storage provided by a Micro SD card.",
    "We also need to talk about battery life, as traditionally tough phones tend to have much larger batteries than conventional smartphones.",
    "Bittium ignored that and instead gave the 2 C just 3,000 mAh of battery capacity, which is the least we’ve seen in a rugged phone. Even the AGM A10 had 4400 mAh, and most Doogee designs come with 10,000 mAh.",
    "What’s pleasing is that even with this modest capacity, the 2 C lasts a decent amount of time due to the efficiency of the Snapdragon 670. But that does beg the obvious question of what longevity it might have had with a bigger battery. Also, you can’t change this battery wirelessly.",
    "The only upside to this choice is that the phone is relatively lightweight, but we’d not consider it the type of rugged phone that you’d want to take into remote places where you might not have easy access to power.",
    "Overall, the hardware in the 2 C is adequate but hardly revolutionary, and the latest Samsung premium designs have much more performance and a superior camera.",
    "Once you get accustomed to the duality of this device, then it is relatively simple exercise to move between the two installations as needed. Initially, we wondered if it would be possible to achieve something similar using virtualisation that would allow instant access to the other mode. But in retrospect, the approach is the right one, because assuming that you were in the secure side when you are not could have profound implications.",
    "With the restart mechanism, it is more of an intentioned move, although how long it takes to restart the phone could tempt some users to try and use the less secure mode for everything.",
    "That begs the question that wouldn’t the best scenario be to use two phones, a Bittium for secure comms and another brand for personal use? That idea might have some mileage, but the 2 C can accept a dual SIM, and it works equally well in either mode.",
    "For those that travel, the frequency support on this device covers most LTE, GSM/GPRS/EDGE and UMTS/HSPA bands, but it offers no 5G support.",
    "The performance of the 2 C is good but not record-breaking in most respects.",
    "Taking the Geekbench 5 scores as an example, the single-core score is very close to a Samsung Galaxy S8+ or Huawei Honor View 10, and the Google Pixel 3a XL that it shares its processor with. Multi-core is near the Samsung Galaxy S8 that uses the Qualcomm Snapdragon 835, and Realme 5 Pro that is Snapdragon 712 powered.",
    "The more impressive numbers are the read and write scores on Androbench and the 3DMark results. Many phones can’t run the Vulkan part of Slingshot Extreme, but the 2 C can. It still isn’t a phone we’d recommend for gaming, but it is better than most at 3D graphics and video playback.",
    "What might help its video performance is that the screen is only 1080p in resolution, giving the GPU less work to do in rendering for it.",
    "The obvious question here is that the Bittium Tough Mobile 2 C is an average phone with water, impact and dust resistance that takes security more seriously than any other device we’ve seen, but is it worth the substantial outlay?",
    "That’s not just the cost of the device, but also the software services from Bittium that are needed to complete the security circle.",
    "That entirely depends on what your security is worth, and how much an intercepted communication could cost you, and the extent you are prepared to alter how you operate.",
    "For those involved in a politically sensitive role or high-level business negotiations this degree of secure communications, the high cost might be mostly irrelevant, up to a point.",
    "Typical phone users find the latest Apple pricing causes a sharp intake of breath, but they’re not the market that Bittium is cultivating here.",
    "If you embrace the enhanced security that the 2 C offers the compromises are that this isn’t the quickest phone with the best camera or biggest battery capacity.",
    "The 2 C is a terrific device from a security standpoint, but it’s not for everyone."
  ],
  "headers": {
    "5": "Price",
    "10": "Design",
    "25": "Hardware",
    "39": "Performance and in use",
    "47": "Final verdict"
  },
  "links": {
    "AGM A10": "https://www.techradar.com/reviews/agm-a10-rugged-smartphone"
  }
}