{
  "source": "https://www.techradar.com/reviews/fittrack-dara",
  "title": "FitTrack Dara review",
  "category": "appliances",
  "updated": "2021-02-24T12:03:02Z",
  "author": "cat-ellis",
  "summary": "A stylish, dependable smart scale that's a solid choice for families",
  "verdict": "The FitTrack Dara is an excellent mid-priced smart scale that impressed us with its ease of use and accurate readings. Its support for multiple users is also a real advantage for families, though you might need to do a little background reading to fully appreciate the full range of data it puts at your fingertips.",
  "pros": [
    "Straightforward setup",
    "Supports multiple users",
    "Accurate readings"
  ],
  "cons": [
    "Batteries not included",
    "App could be more descriptive"
  ],
  "article": [
    "The FitTrack Dara is a mid-priced smart scale that uses electrical resistance to determine your body composition, including visceral and subcutaneous fat, muscle mass and bone density.",
    "It's simple to use, and the FitTrack Pro companion app (available for both Android and iPhone) can sync your data automatically with Google Fit, Apple Health and Fitbit, making it easy to keep track of your health and fitness stats in one place. There are dedicated Fitbit scales, but it's great to have the extra flexibility.",
    "Its results tallied with those taken using the commercial body composition scale at our gym, and we appreciate the fact that up to eight people can use the same scale – whether on their own phones, or with multiple accounts on the same device. It's a smart feature that means parents can keep an eye on their kids' development without youngsters worrying about the numbers.",
    "Our main complaint (other than batteries not being included) is that the app could be more informative. Tapping each composition metric reveals a brief sentence or two of explanation, but some warrant more information to help you understand and use the data.",
    "The FitTrack Dara smart scale went on sale in June 2020, with a recommended retail price of $179.90 / £139.90 (about AU$250), but at the time of writing it's discounted to $89.95 / £69.95 (about AU$130). It's also available in a set together with a FitTrack Atria fitness tracker.",
    "The FitTrack Dara is a sleek looking smart scale with a minimalist design: just a clean glass top and four oval contacts (two for your heels and two for your toes). Its LCD display is concealed until the scale is activated, and is bright and easy to read when you're standing up. Like any digital scale, it should only be used on a hard floor for accurate, consistent readings.",
    "The only downside is that it requires four AAA batteries, which aren’t included, so you might need to make a shopping trip before you can get started.",
    "The only downside is that it requires four AAA batteries, which aren’t included, so you might need to make a shopping trip before you can get started.",
    "Up to eight people can use a single scale, with data syncing to separate devices, or to different accounts on the same device, which is particularly handy if you want to keep an eye on how your kids are growing but don't want them worrying about their own weight and tracking it on their phones.",
    "FitTrack advises that the body composition features should only be used by adults aged 18 and over, but there's a separate infant mode for tracking the weight and growth of children.",
    "Connecting to the scale was very simple. Unlike some smart scales, which have to be connected to your home Wi-Fi network, the FitTrack Dara only uses your phone’s Bluetooth connection. Just install the FitTrack Pro app, create an account, and the scale will connect automatically the first time you step onboard.",
    "After you’ve created your account and entered your weight and age, the app will suggest an optimum weight for you. This won’t necessarily correlate with the BMI chart, and is only a rough guide, so don’t be concerned if it doesn’t match your own goals.",
    "If you work out vigorously at least three times a week, or have a physically demanding job, FitTrack recommends that you choose the 'Athlete' option, which is likely to tally more with your expectations, but again is only a calculation.",
    "You can connect the FitTrack Pro app to your Fitbit, Apple Health or Google Fit account – provided you have a supported fitness app installed, you’ll be prompted to link the two during the setup process. Once that’s done, data from the scale will be imported automatically, allowing you to keep track of your weight and activity goals all in one place and use your scale together with your fitness tracker or smartwatch to stay motivated.",
    "The scale will calculate your BMI, body fat percentage, water, bone mass, basal metabolic rate (BMR), visceral and subcutaneous fat, muscle mass, and many more stats. These are presented in a clear list, and color-coded to show whether or not your reading fit within normal limits.",
    "We were impressed by the accuracy of the body composition results, which tallied almost exactly with those from the commercial body composition scales at our gym.",
    "Tapping on each measurement will reveal a brief explanation of what it means in relation to your body, and you’ll often be shown a sliding scale so you can see where your particular reading fits into the scheme of things.",
    "Tapping the ‘History’ tab will reveal a chart showing how your weight has changed over the last week, month or year. If you’re interested to see how your weight has been affected during the day (if you’re concerned you might not be taking on enough water, for example), you can also take several composition readings during a single day.",
    "It’s a shame there isn’t more information about some of the less common stats (such as ‘protein rate’, which refers to the proportion of your diet that should come from protein, ideally). It would also be helpful if the most important metrics (fat, muscle, bone density, water) were all listed together rather than scattered throughout a long list of other figures."
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "5": "Design",
    "10": "User experience",
    "19": "Don't buy it if"
  },
  "links": {
    "FitTrack Dara": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4600642487421030400/https://getfittrack.com/products/fittrack-smart-body-bmi-scale",
    "smart scale": "https://www.techradar.com/best/best-smart-scales",
    "Android": "https://play.google.com/store/apps/details?id=com.icare.fittrack&hl=en_GB&gl=US",
    "iPhone": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1033072057760881500&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Ffittrack-pro-accurate-health%2Fid1382233373",
    "Google Fit": "https://www.techradar.com/news/google-fit-all-about-the-smartwatch-and-phone-fitness-app-and-what-sports-it-tracks",
    "Apple Health": "https://www.techradar.com/how-to/phone-and-communications/mobile-phones/how-to-use-apples-health-app-1305634",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers"
  }
}