{
  "source": "https://www.techradar.com/reviews/vpnht",
  "title": "VPN.ht review",
  "category": "computing",
  "updated": "2020-10-16T15:26:31Z",
  "author": "sead-fadilpasic",
  "summary": "A solid VPN choice despite low server count",
  "verdict": "Although there’s room for improvement in some areas, VPN.ht is a solid provider that offers enough - bullet-proof privacy, simple apps for major platforms, Netflix unblocking and reasonable pricing.",
  "pros": [
    "Unblocks Netflix US",
    "Very easy to use",
    "Cost-effective"
  ],
  "cons": [
    "Limited customer support",
    "Not many servers",
    "Doesn’t unblock BBC iPlayer"
  ],
  "article": [
    "VPN.ht is a very good VPN solution for anyone who wants to retain their privacy online and access US streaming services like Netflix or Spotify.",
    "However, it has a very limited server network, doesn’t unblock BBC iPlayer, and its customer support is lacking, which is why you should check out one of the best VPN services if such things are a deal-breaker for you.",
    "When it comes to pricing, VPN.ht keeps things simple as there are only two subscription lengths - monthly and annual. The monthly plan will only cost you $1.00 during the first month, after which it will renew to a still very acceptable $4.99/month. The annual plan is priced at $3.33/month ($39.99 billed annually), which isn’t the cheapest on the market but nevertheless affordable.",
    "Whichever plan you opt for, you’ll be able to use up to three devices at the same time. Some competitors support more but VPN.ht can also be enabled on a router so the limitation can be lifted.",
    "Accepted payment methods include credit cards, PayPal, bank transfer, Mobiamo, gift cards, and a wide assortment of cryptocurrencies. There’s no free trial, but there’s a 100% money-back guarantee for the first 30 days of service, which is more than enough to see if this VPN platform is good enough for you. Do note, however, that we got our refund in the form of VPN.ht credit, not directly on PayPal, so that’s something to keep in mind.",
    "VPN.ht may not be everyone’s cup of tea, especially considering it doesn’t have a live chat feature, thousands of servers, nor does it unblock BBC iPlayer. If these are a top priority for you, then you might want to check out some of its competitors, primarily ExpressVPN, NordVPN, Surfshark, or CyberGhost.",
    "Many popular streaming channels have measures in place to limit access to their services in certain regions, which is why those who want to watch them turn to VPNs that can help them bypass these blocks. VPN.ht is capable of unblocking at least some of them, primarily Netflix US and Spotify. Unfortunately, if you were hoping to access content on BBC iPlayer, you’ll be disappointed.",
    "The company VPN.ht Limited is headquartered in Hong Kong. With 90 VPN servers units, it doesn’t have as large a network as some of its competitors but these servers are well distributed across the world, including in places like the United Arab Emirates, New Zealand, South Africa, and more.",
    "To hide your online activities, this VPN vendor uses strong encryption through the 64, 128, and 256-bit algorithms, while all its servers support OpenVPN, L2TP, PPTP and IPsec transfer protocols. The Android app also has an optional kill switch - a mechanism that activates whenever your VPN connection is lost, effectively cutting off your Internet access and protecting your IP address from being exposed.",
    "The provider states it doesn’t actively monitor user sessions for inappropriate behaviour nor does it keep direct logs of customers’ Internet activities, so it doesn’t know what you do with its service. That said, “VPN.HT reserves the right to investigate matters we consider to be violations of these Terms.” This may sound a bit alarming, however, it doesn’t say it would report or hand over any of the findings to the authorities and the only punishment seems to be removal or blocking of “any materials or information that we consider to be actual or potential violations of the restrictions set forth in these Terms, and any other activities that may subject VPN.HT or its customers to liability.”",
    "Fair enough, although we have no choice but to take the provider’s word for the privacy of our data. Some VPN providers have already taken steps to demonstrate the truthfulness of their no-logging claims by inviting outside auditors to confirm this, and it would be beneficial for VPN.ht to follow their example. The company does, however, provide a Warrant Canary, listing all the warrants for searches or seizures it receives up to a certain point.",
    "The platform is P2P-friendly, which in its own words means “you can Bittorent at will”, in perfect privacy, with no restrictions.",
    "VPN.ht works on a large selection of platforms, including Windows, Android, iOS, Mac, Ubuntu, Redhat, ChromeOS, and certain routers. It can be installed either manually or through user-friendly and intuitive clients available for Windows, Mac, Ubuntu, and Redhat, as well as apps for iOS and Android.",
    "The Android app has already been downloaded over 100,000 times, although its average score is 2.7 (out of 5) as rated by 947 people. Most of the complaints referred to the inability to connect or log in, but we managed to use it with no problems whatsoever. The app was last updated on April 16, 2020, so perhaps the provider has fixed whatever the issue was. On the other hand, the iOS app has had a much better average score - rated 4.2 by five people. If you need help with anything related to the installation or use of the platform, the provider offers a modest knowledgebase on its website, covering such areas like setting up the service on various devices, changing your VPN credentials, preventing DNS leaks, etc. If your problem or question isn’t covered in the knowledgebase, you can contact customer support by opening a ticket, filling out a form on the website, or sending a message to the email address support@vpn.ht. However, there’s no live chat option, which is certainly a disadvantage for a paid VPN service. Also, the message requests seem to be prioritised, as we asked a simple query via email address not used for an account and still haven’t received a response.",
    "Downloading and installing the apps is a piece of cake - just click on the download link on the website, run the installer, and you’re done. Before you can connect, you’ll need to create an account with VPN.ht and type in the credentials sent to you after you make the payment. Do note that the Windows app will ask for your “email address” but instead you’ll have to enter your VPN username sent by the provider. A minor inconvenience, but still something VPN.ht should fix.",
    "Once signed into, the app will show you all the available servers on a server map but you can also let the app choose the best server for you based on your physical location or just connect to a random location.",
    "The download speeds delivered by this provider were solid for the servers located in Europe, not so much elsewhere. Thus, a server in Serbia reached a decent 20Mbps on a 55Mbps test connection, whereas a Las Vegas-based one hailed around 8Mbps. We also tested a server in Japan, which is quite far away from us, and we got a pathetic 0.31Mbps.",
    "It’s worth mentioning that all the servers connected rather quickly, in a matter of seconds.",
    "VPN.ht provides strong privacy and security, it supports a solid selection of platforms and unblocks Netflix US and Spotify, on top of its budget-friendly prices.",
    "Despite all this, VPN heavyweights such as ExpressVPN are a better choice, due to speedier and more accessible customer support, thousands of servers that guarantee better speeds, as well as unblocking capabilities for many more services."
  ],
  "headers": {
    "2": "Price",
    "5": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "12": "Support",
    "14": "Speed and experience",
    "18": "Verdict"
  },
  "links": {
    "VPN.ht": "https://vpn.ht/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "support@vpn.ht": "mailto:support@vpn.ht",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1019335914084248800"
  }
}