{
  "source": "https://www.techradar.com/reviews/clario",
  "title": "Clario review",
  "category": "computing",
  "updated": "2020-12-10T09:30:10Z",
  "author": "mike-williams",
  "summary": "Antivirus, VPN, identity protection and more in a glossy family-friendly app",
  "verdict": "Hassle-free online security for all your Mac-using family. Mobile apps are basic, though, and it really needs a Windows version.",
  "pros": [
    "Easy to use for non-technical types",
    "Bitdefender and NordVPN underneath",
    "Great value right now",
    "Integrated chat support in all apps"
  ],
  "cons": [
    "Underpowered mobile apps",
    "No Windows version",
    "Interface may frustrate experienced users",
    "Poor VPN unblocking results"
  ],
  "article": [
    "Clario is a one-stop service which aims to handle all your security needs: antivirus via Bitdefender's engine, NordVPN-powered VPN, private browsing, ad blocking, anti-tracking, identity theft protection and more.",
    "While that might sound intimidating to newbies, Clario sells itself very much on ease of use. And if you do run into trouble, no problem - live chat support comes integrated with all apps, and the company claims to have '600+ security experts available on-demand... 24-7.'",
    "There's one notable catch. Clario is available on Macs (Sierra 10.12 or higher), Android, iOS and Mac-based browsers (Chrome and Safari), but there's no Windows version. That's coming soon, though, and there's still a lot to explore here.",
    "Pricing is simple, with just a couple of plans. Paying monthly gets you protection for any mix of three Mac, iOS and Android devices, and costs $12. Opt for the annual plan and you can cover six devices for only $5.75 a month - you could pay more for VPN or antivirus alone. There's even a 7-day trial.",
    "Beware, though, these are launch deal prices. According to the website, the standard prices are $25 billed monthly, or $10.75 on the annual plan, not such a bargain although still fair value.",
    "Signing up is easy. We handed over our name and email address to create an account, then paid in the usual way (Clario supports cards and PayPal.)",
    "Technicalities sorted, the website pointed us download links for the Mac, iOS and Android apps. (There's no mention of the browser extension, as you can't install that stand-alone. You must install the app first.)",
    "We grabbed the desktop build, and the unusual design caught our eye immediately. Forget the usual boring grey background on the login and other intro screens, for instance - Clario has pictures and looping videos of people, a young girl kissing her father, a couple on a bicycle. 'We're for everyone, not just geeks', seems to be the message.",
    "This approach continued as we logged in. Your average security tool might give you 10x checkboxes with various features, and you check or clear these to suit whatever you want. Clario displays the message 'Tell us about your worries and we'll set up Clario for you', then asks you a series of very simple questions about what you need from the service.",
    "'What concerns you about your online identity?', it asked us, for instance, with options like 'What to do after a data breach', 'Email or social accounts hacked' and 'Big Tech collecting personal data.'",
    "If there is anything technical to do, the setup tool explains it clearly. It didn't just install a new tool demanding our password, for instance - it told us what was happening, what we had to do, and why, and also gave us an option to do it later.",
    "There are limits to how far this can help you. Macs have many security layers, by design, and in many cases all Clario can do is describe a series of system steps to follow (click Preferences, click the Lock icon, check this checkbox and so on.) Still, it's easier to use than most, and even security newbies should be able to set up the app without difficulty.",
    "There are some unexpected depths here, too. A Configure Chrome section goes beyond installing Clario's browser extension to help you configure various privacy settings, for instance: set up custom search engines, turn off geolocation, Turn on Do-Not-Track, and so on. A System Settings option advises on configuring automatic app updates or disabling Automatic Login, another helps you set up Time Machine, and the list goes on.",
    "If you get into trouble with any of this, you're able to call up live chat support from within the app. This isn't just an emergency last resort, either. If there's something in your antivirus Quarantine area, for instance, a Review With Expert button opens a live chat session where you can get advice. Many other screens have 'Get help from an expert' or similar buttons, encouraging you to ask if there's anything you don't understand.",
    "Open Clario's console post-setup and you're presented with six tiles: Identity, Browsing, Device, Money, Network and Files. The console tells you when it has any recommendations on how to keep you safe, and there's a search box where you can raise questions with support.",
    "The tile descriptions are simple, focusing on what you want to do, rather than how you want to do it. There is no 'turn on VPN' option, for instance, good news for beginners who might not be clear what a VPN is. Instead, it presents you with common tasks or goals, like 'Shop or bank online securely, or Network > 'Secure your data on unsecured Wi-Fi networks', both of which turn on the VPN for you.",
    "This works well for newbies, but if you're more used to seeing that 'Turn VPN on' button, with your connection status clearly displayed, it might take a while to get used to this task-based approach.",
    "Experienced users might also be left wondering what some functions are really doing. For example, the Identity tab has a feature called Online Account Protection. When enabled, its tile says, 'your accounts are safe from malware and threats', and clicking for more details, it apparently 'safeguards our personal mailbox and social accounts' and protects from 'malicious apps hacking your personal accounts to impersonate you.'",
    "The app is certainly doing its best to avoid complexity, but it leaves us wondering what all this means. Is it only talking about the antivirus? Is there an email component? A spam filter? Maybe it's just scanning attachments? How is it safeguarding social accounts? Is the browser extension playing a part?",
    "Clario's target consumer audience may not care very much, but these are important details, and it should be easier to find out what features you're getting. If nothing else, how can you compare Clario with other products if you're not even sure exactly what it does?",
    "Once you've set up Clario, the app automatically looks out for and blocks malware, with no need for you to do anything else. If you don't look closely at the dashboard, you may not realize you have antivirus, at all.",
    "Drill down, though, and there are more conventional options here. Click Files > Local Storage > More > Local Files Protection, for example, and you'll find Full and Custom Scan options, your real-time protection status, quarantined files and a trusted file list.",
    "A Full System scan proved speedy on our test system, claiming to scan 100,000 files in around two minutes. That's partly because our test Mac has very few applications installed, but Clario suggests most scans will take around 20 minutes.",
    "Web protection begins with Chrome and Safari extensions. The Chrome extension blocks ads, and both aim to keep you safe from malicious websites. We found they worked well, displaying warnings whenever we attempted to visit a risky site, and giving us the option to add it to a Trusted list if necessary.",
    "Use some other browser, or ignore the extensions, and you won't get this web protection. (Of course, you're free to install whatever other malware-blocker you prefer.) Clario's local antivirus setup is still monitoring your system, though, and if you download anything dubious, it should be detected and quarantined immediately.",
    "We have to say 'should be' as Clario hasn't yet been assessed by the big testing labs. There's some good news in that it's powered by the capable Bitdefender engine, which should in theory ensure a decent standard of malware protection and above-average anti-phishing (see our Bitdefender review for more protection details.) Simply using the Bitdefender engine doesn't necessarily mean Clario will work as well as Bitdefender's own products, though, so we'll be interested to see any lab results.",
    "Clario's NordVPN-powered VPN is a major plus for the service, but it's not exactly highlighted in the app. As we mentioned above, typically you'll enable it by choosing a task like 'Secure your data on unsecured wifi networks'; Clario then connects to the nearest server, but there's no up-front indication of what's happening, and even experienced users may not realize that they're now using a VPN.",
    "Explore the interface, though, and you'll come across a more familiar VPN interface eventually (Browsing > Browsing Location 'More' > Location.)",
    "If you've ever used another app, Clario will look very straightforward: here's a list of 15 countries (North America, Europe, Australia and Singapore), there are big Connect and Disconnect buttons, and... No, forget the 'and', that's it.",
    "Our full speed test systems can't use Mac software, but checking a 70Mbps UK connection to our nearest server showed no problems, with speeds averaging a capable 65-68Mbps.",
    "There wasn't such good news with website unblocking, as Clario failed with US Netflix, Amazon Prime and Disney+. That's a surprise as NordVPN worked with all of these in our last review. Maybe we were unlucky, but if you are interested in unblocking websites, test as many as you can during the trial period.",
    "Clario prides itself on its support, with all apps providing built-in chat support from, apparently, hundreds of security experts.",
    "The interface is certainly slick, with the window including a picture of the agent, Dean, giving it a more human feel than the usual chat window.",
    "We decided to ask directly whether the VPN supported unblocking US Netflix right now, if there were any known problems, and which server the company recommended we use. The results were, well, disappointing.",
    "Even though we very specifically asked about Netflix support, Dean replied with some unnecessary description of what a VPN does: 'VPN protects you from third parties and advertisers tracking what you browse so it's a useful tool to utilize even if you're at home', and 'Another benefit of a VPN is that your virtual location can be modified, which can allow you to access geographically restricted content on websites that don't block VPN connection.' Well, thanks. Now, what about Netflix?",
    "We typed 'OK' and waited, expecting more. Dean was typing, the chat window told us, and then his message appeared: 'can I help you with anything else?' What, other than answering our question about Netflix support, you mean?",
    "After pressing him for more (or at least some) information, Dean told us that 'If their websites block a VPN connection you are not able to use it', and 'you can try to connect to different servers and check them one by one', which was the most helpful comment we got.",
    "Giving up on the app, we switched to the website's live chat, hoping that a sales agent might at least know if Clario supported Netflix, or not. But we were surprised to see this agent was also called Dean, and that he gave us the same scripted VPN lines, with precisely nothing else.",
    "Playing the part of a potential customer, we tried to sum up the situation: 'So you can't say whether it unblocks Netflix or not, therefore it's best to install the trial and see?'",
    "'Yes, it is', said Dean, helpfully.",
    "This approach of giving scripted opening comments regardless of the questions is more something we'd expect from a bot than a real security expert. And in the case of this particular VPN issue, it compares poorly with the specialist competition. Ask the same question at ExpressVPN and we generally get a reply within two minutes telling us about any Netflix problems, recommending solutions and the best servers to us - much better.",
    "Still, we only asked a couple of questions, so it's entirely possible that we'd have got better service with other topics. And to Clario's credit, it does encourage users to get in touch with any security issues, and offers remote access support if you need it. It may deliver good service in different situations, but if support is important to you, we'd recommend you ask plenty of questions during the trial, find out just what sort of service you're likely to get.",
    "Clario's mobile apps have a similar interface to the desktop edition, but a distinct lack of features leave them looking feeble in the extreme.",
    "There are only three tiles on the opening Android screen, for instance - Identity, Browsing and Network - and tapping Identity gives you a single option, Data Breach Monitor, which monitors your email address and raises an alert if it appears in a data breach. Useful, but hardly a function which deserves being top of your task list; it's entirely possible you'll use it once and never touch it again.",
    "Tapping Network > Public Wi-Fi Security enables automatically turning on the VPN when you connect to public Wi-Fi.",
    "On the final tile, Browsing > Private Browsing turns the VPN on or off, and Browsing > Browsing Location allows you to choose your preferred VPN location, as we discussed earlier.",
    "The only other feature is the built-in chat window where you can reach out for technical support.",
    "This is so basic that it shows up the weaknesses in Clario's standard interface. You must browse the tiles to see where the VPN location list is, for instance. It's not obvious when you're connected and when you're not, and the dashboard doesn't display the currently selected location.",
    "We're struggling to see how this is simpler to use than a VPN app from, say, TunnelBear, but at least it reduces confusion by using a similar interface to the desktop. And if you can't live with it, swiping left gets you a Quick Actions panel where you can turn the VPN on and off, choose and view your browsing location, all in one place.",
    "It's much the same story with the iOS app, which has all the same features as the Android edition, and throws in a Safari ad blocker, but there's nothing more.",
    "There is still some value here. VPNs can be tricky at times, and having live chat in your VPN app makes troubleshooting a little easier than usual. We suspect most people aren't going to have enough technical troubles for that to be a major advantage, though, and if you're mostly after a simple VPN, you'll get better results from someone like TunnelBear.",
    "Clario does a decent job of making capable antivirus and VPN tech accessible to normal folks. With no Windows version, very basic mobile apps and assorted interface issues, there's a lot of work to do, but we'll be interested to see how Clario develops."
  ],
  "headers": {
    "5": "Getting started",
    "14": "Simple dashboard",
    "20": "Protection",
    "26": "VPN",
    "31": "Support",
    "42": "Mobile apps",
    "51": "Final verdict"
  },
  "links": {
    "Clario": "https://clario.co/pricing/launch-multi-bf",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "identity theft protection": "https://www.techradar.com/best/best-identity-theft-protection",
    "Paying monthly": "https://clario.co/pricing/launch-multi-bf",
    "annual plan": "https://clario.co/pricing/launch-multi-bf",
    "Bitdefender review": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn"
  }
}