{
  "source": "https://www.techradar.com/reviews/moto-g8-review",
  "title": "Moto G8 review",
  "category": "phones",
  "updated": "2020-06-04T13:18:23Z",
  "author": "james-peckham",
  "summary": "The main Moto G8 handset, and perhaps the best",
  "verdict": "The Moto G8 isn’t going to floor you in what it can do, but considering the price you should be impressed with what Motorola has managed to fit into this tight and consistently well-performing package. With strong battery life, great performance for the money, and a few other little improvements, the Moto G8 is a great phone for many who need a budget choice.",
  "pros": [
    "Even lower price than Moto G7",
    "Strong performance",
    "Great battery life"
  ],
  "cons": [
    "No NFC feels like a miss",
    "Only 720p display",
    "Macro shooter not helpful"
  ],
  "article": [
    "The Moto G series has become a staple of the affordable phone market, and Motorola has managed to make an even cheaper than normal base device for 2020 in the form of the Moto G8.",
    "It doesn’t have as much of a specs jump as new numbered models usually do (and in some ways it’s even a step down), but instead the company is aiming to give you the most bang for your buck in the Moto G8, and it mostly achieves that.",
    "You shouldn’t expect a handset that is going to amaze you, but considering how low the price is you shouldn’t be disappointed by what’s on offer either.",
    "The Moto G8’s design feels premium for the type of device we’re talking about, and it has a big display (although the resolution isn’t as good as we’d like).",
    "The battery meanwhile will last you for a full day even with extensive usage, and if you’re not going to be using the phone much each day you should find that it can last even longer. It’s slow to charge, but the 4,000mAh cell performs well.",
    "The camera can hold its own too. There are three elements - a 16MP main shooter, an 8MP ultra-wide one, and a 2MP macro one, with the former two allowing you to take some impressive shots considering the price of the device.",
    "And that’s what it all comes down to; the price of the Moto G8 is - as noted above - even cheaper than the last few generations of Moto G phones. That in itself is impressive, and while you may be missing a few specs that some will be desperate for, this is a perfect cheap phone for others.",
    "The Moto G8’s release has been complicated as the company unveiled a variety of handsets in the range at different times. The standard Moto G8 was unveiled in March 2020, and it went on sale in Europe soon after that.",
    "The phone costs £179.99 / AU$329 (about $220) but it isn’t coming to the US (though you can buy the Moto G Power and Moto G Stylus there, both of which are part of the same range). Exactly why Motorola chose not to bring the G8 to this market is currently unclear.",
    "There’s only one variant of the Moto G8 that you can buy, and it comes with 64GB of space and 4GB of RAM. It’s remarkably cheaper than the Moto G7 that launched at $299 / £239 / AU$399 but it’s important to note that the spec is a little lower here in some regards.",
    "For example, the screen tech on the Moto G8 is a little weaker when compared to the Moto G7.",
    "This is an affordable phone, and if you consider that when handling it then you’ll likely be pleasantly surprised with how the Moto G8 feels in the hand.",
    "It has a plastic frame and rear, so it isn’t going to feel as svelte in your hands as a modern day flagship phone like the Motorola Edge Plus does.",
    "If you’ve got smaller hands, you may not appreciate how large this phone is. It comes with dimensions of 161.3 x 75.8 x 9mm, making it a larger device than a lot of other cheap phones, which could make it a struggle for some to hold.",
    "That said, we enjoyed the size of the device as it allows for a substantial screen (which we’ll dive into more in a moment) as well as a large battery inside.",
    "The rear of the Moto G8 features a physical fingerprint scanner that is slightly embedded into the phone. We found this easy to reach during our testing, but it is impossible to reach when your phone is laying on a table.",
    "To the left of the fingerprint scanner there’s the rear camera (we’ll dive more into the specs later) and this is slightly raised compared to the rest of the device. That means it isn’t flush with the rear of the phone, but the camera bump isn’t as pronounced as it is on some flagship phones.",
    "You’ve got the choice of Capri Blue (the device you can see pictured throughout this review) or White Prism when it comes to colors. It’s odd the company didn’t choose to offer a black option, but we enjoyed the deep blue shade of our device.",
    "The edges of the phone house a USB Type-C slot at the bottom and a small speaker sat to the side of it. There’s also a 3.5mm headphone jack on the top edge of the phone for anyone who wants to use a wired headset.",
    "Remarkably, the Moto G8 comes with a 6.4-inch display. That’s a size that is often reserved for mid-range priced phones and beyond, but Motorola has managed to include one on this device, making it 0.2-inches larger than the Moto G7.",
    "One thing that’s a bit of a disappointment though is that the company has opted for a 720 x 1560 resolution display for this device. That’s down from 1080 x 2270 on the G7, which means the screen quality is lower on this newer device.",
    "That allows the price of the phone to be cheaper, but it’s a noticeably weaker panel in everyday use. All of that said, the Moto G8’s screen is sure to suit some who aren’t going to be using this phone lots for watching video and the like.",
    "The display isn’t outright bad and you’ll likely be satisfied with using it for everyday tasks, especially considering the price of the phone, we’re just keen to ensure you know that the screen doesn’t offer a high-end or even mid-range experience.",
    "If you’re hoping to watch lots of Full HD video on this phone, you won’t be able to.",
    "The top left corner of the screen has a cut-out for a camera, and that’s where the shooter that takes your selfies sits. It’s a basic 8MP camera that isn’t going to bedazzle you, but it’s suitable enough for video calling and the odd selfie.",
    "Moving on to the rear camera, there are three lenses here that combine to give a satisfactory experience compared to other cheap phones on the market.",
    "This isn’t going to give you top photographs that will compete with flagship phones like the Samsung Galaxy S20 or iPhone 11, but it can hold its own when fighting other phones at the low end of the market.",
    "The main shooter is a 16MP f/1.7 wide camera, and that then works with an 8MP f/2.2 ultra-wide for when you want to zoom out a little.",
    "We found the shots to be impressive considering the price of this phone, but again they’re not going to blow your mind. They seem clear with strong color reproduction and you won’t start to notice blurring until you zoom into your shots.",
    "In good lighting, the Moto G8’s camera is highly capable for this end of the market. It will struggle a little more when you’re shooting in low light, but it’s not really any worse than other handsets around this price.",
    "While the two lens types discussed above are fairly typical inclusions, a more unusual element to the Moto G8 is that it also comes with a 2MP macro shooter. However, this didn’t prove much use in practice, as it’s such a low resolution that we often just opted to use the main camera instead.",
    "This isn’t the most powerful phone either, so sometimes you will have to wait a moment for the camera shutter to trigger and that may mean you miss your shot. That said, the auto focus on the Moto G8 seemed to work well at least.",
    "You can also record 4K video, or Full HD if you’re not looking for that higher resolution. We found this worked well, but there’s no specific stabilization technology here so you’ll have to have a steady hand to get a proper handle on filming video with this phone.",
    "The Moto G8 comes with a Qualcomm Snapdragon 665 chipset inside, along with 4GB of RAM to help power it along. That’s quite a powerful chipset for a phone of this type, and we’ve seen it previously perform well in the Oppo A5 (2020).",
    "Much like that phone, the Moto G8 was able to run all of the apps we wanted it to but it will take a little longer than you’ll be used to if you’ve had a more expensive phone in the past.",
    "As for benchmarks, the phone scored an average of 1,324 in Geekbench 5. That’s a similar score to what we saw the Oppo A5 (2020) achieve and it’s an impressive result for a phone of this price.",
    "We found it would run all the games we wanted it to, but this won’t be the device to go for if you want to be playing top-end titles like Call of Duty Mobile. It will run games of that type, but it won’t be as smooth as a top-end phone. This is able to run things like Words With Friends, but you’ll just have to wait a little longer than on a premium phone.",
    "There’s only 64GB of storage in the Moto G8, so you may find that you quickly fill that up with apps, games, and media. If you do, you’ll be able to buy a microSD card to increase the space on the phone.",
    "It probably goes without saying, but the Moto G8 isn’t capable of 5G connectivity. That’s something that is currently mostly reserved for top-end phones, and it’s unlikely we’ll see it on a device like this in the near future.",
    "This phone comes running Android 10 software, and Motorola has a strong history of updating its handsets to the latest software for at least a few years after release.",
    "The software comes with Motorola’s own skin, but that’s pretty non-invasive and you’ll probably like the look. There are a few extra features such as Moto Actions, which provides gesture controls such as the ability to activate the camera by karate chopping with the phone.",
    "One last thing that needs to be mentioned is that the Moto G8 doesn’t come with NFC functionality, so you won’t be able to make mobile payments on this device using Google Pay.",
    "Battery life on the Moto G8 is quite impressive, and it’s sure to last for at least a full day even when you’re using the device a lot. We often found the Moto G8 would last for over a day, but would need a recharge mid-way through the second day of usage.",
    "If you’re relatively light touch with your phone, you should find this device will last for a full two days from a single charge. It has got a 4,000mAh battery inside, which is a decent size, but if you want even more battery you’ll want the Moto G8 Power.",
    "You’ll recharge the phone via the USB-C slot on the bottom edge, and it tops out at 10W, so isn’t particularly fast charging. That said, it’s not overly slow either, as we found the device was able to charge up to full in under two hours.",
    "There’s no wireless charging or other features like that here, which is often something you won’t get access to on a cheaper phone like this, so that’s no surprise.",
    "First reviewed: June 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Moto G8 price and release date",
    "11": "Design",
    "19": "Display",
    "25": "Camera",
    "33": "Specs and performance",
    "42": "Battery life",
    "46": "Don’t buy it if..."
  },
  "links": {
    "Moto G Power": "https://www.techradar.com/reviews/moto-g8-power",
    "Moto G Stylus": "https://www.techradar.com/reviews/moto-g-pro-review",
    "Moto G7": "https://www.techradar.com/reviews/moto-g7-review",
    "Motorola Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Oppo A5 (2020)": "https://www.techradar.com/reviews/oppo-a5-2020-review",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}