{
  "source": "https://www.techradar.com/reviews/amazon-fire-hd-8-2018",
  "title": "Amazon Fire HD 8 (2018) review",
  "category": "tablets",
  "updated": "2020-06-03T16:26:17Z",
  "author": "sean-cameron",
  "summary": "Is this budget slate fit for 2018?",
  "verdict": "The Amazon Fire HD 8 (2018) bets big on its Alexa skills and low price, and mostly succeeds in making a positive first impression. But with laggy performance, poor software and a mediocre screen, it isn’t an easy recommendation even when this cheap.",
  "pros": [
    "Very cheap",
    "Sturdy build",
    "Decent speakers"
  ],
  "cons": [
    "Weak screen",
    "Average battery life",
    "Amazon ecosystem is poor"
  ],
  "article": [
    "Update: the Amazon Fire HD 8 (2018) is no longer the most recent device in its line, as a newer version is now available. To check it out, head over to our Amazon Fire HD 8 (2020) review.",
    "Making a great tablet is no easy task. Moving on from their initial sales boom post-2010, slates have begun to coalesce into a number of discrete segments – with the ‘tablet’ in its purest sense disappearing at a rapid pace.",
    "For the power users who want a tablet which doubles as a computer, there’s the Microsoft Surface Pro X and other Surface slates. Those who are invested in the Apple ecosystem will get a lot of mileage from the likes of the iPad Pro 11, and Google is still trying to figure out how to make Android click with the form factor.",
    "In the midst of this, Amazon has carved its own niche by manufacturing and selling bucketloads of lower-specification, bargain-priced slates to the masses.",
    "The base model runs at $79.99/£79.99 and offers 1.5GB of RAM, an 800 x 1280 screen, 16GB of storage and an unspecified quad-core 1.3GHz chipset.",
    "It comes with lock screen adverts by default (costing $15/£10 to remove) and Amazon’s own custom version of Android – which may be a good or a bad thing depending both on your outlook and purchasing habits.",
    "Then there’s the new 'Show' dock, which allows your new tablet to serve as a relatively cut-price Alexa device, should you wish to introduce a smart speaker to your home.",
    "With this in mind, is the value promised in this budget package worth the hype? Or were too many corners cut in the production?",
    "The Amazon Fire HD 8 (2018) is available now direct from Amazon in the US and UK for $79.99 / £59.99 (around AU$110). Amazon still sells the previous generation of tablets, so be sure to check you're buying the 8th generation that was released in 2018.",
    "That price above is for a 16GB model, but you can also get a 32GB one for $109.99 / £99.99 (roughly AU$155) or add a ‘Show’ charging dock to either version for more money still. You also have to pay an extra $15/£10 if you want a version without lock screen adverts. Still, whatever version you choose this is a cheap tablet.",
    "What marks the 8th generation of the Fire tablets above all those which have come before is the optional inclusion of the ‘Show’ dock.",
    "By adding this dock to the slate, which also has Amazon's Alexa assistant included, what has been created is a serious rival to Amazon’s own dedicated Echo Show. There is other competition in this space too though, such as the Lenovo Smart Display and Google Home Hub for example.",
    "Everything else that this tablet features must be taken within the context of the price charged, with Amazon virtually giving these away in the hopes of locking consumers into its shopping and content ecosystems.",
    "The screen is an 800 x 1280 pixel affair which beats out every other tablet in this price range for resolution and usability, with the only real competitor being Amazon’s cheaper Fire 7 (2017), which boasts a screen directly from the cutting edge of 2011.",
    "Two flavors of the Fire HD 8 (2018) are available, 16GB and 32GB, with the option to add a microSD card up to 400GB in size (a purchase which in itself would cost more than the tablet). This means that those who like to take a portable slate with them on public transport to watch video on the go will be well served.",
    "The Amazon Fire HD 8 (2018) also boasts another small but thoughtful addition which will no doubt please buyers - a variety of different color options as well as a ‘kids’ version. Yellow, Blue, Red and Black can all be had, with the reviewed Canary Yellow version looking quite dapper and holding attention despite the plastic build.",
    "The mentioned ‘kids’ version comes with a special (functionally indestructible) thick rubber case and special software functions to aid helicopter parents.",
    "Not touted quite as loudly as other features is the supposed ruggedness of this tablet, with Amazon claiming it to be a least twice as durable as the glass and metal iPad lineup.",
    "Certainly, seeing an $80/£80 device crash towards a hardwood floor in slow motion is a different experience to seeing a cherished investment do the same - but the added durability is appreciated regardless.",
    "Tablets at the budget end of the spectrum incur a different set of criteria to be judged by when compared to smartphones. A smartphone is something the user takes in their hand throughout the day, in front of a great many people - in short it is a prime example of conspicuous consumption. Think of it as a swish suit, a luxury object.",
    "From this, a cheap tablet is the equivalent of a pair of comfy slippers. It is something which people come home to, which is used during downtime. It lives in the space between the cushions of the sofa, or at the bottom of a satchel. The Amazon Fire HD 8 (2018) fits right in to this lifestyle.",
    "With a sturdy plastic build and the advertised durability, users can feel comfortable tossing one around the home (though never too enthusiastically) mostly without consequence. This is a device for families, for those who value cash above flash.",
    "Saying this, we did encounter an odd flex in certain portions of the rear of the device, however this may simply be a quirk of the review unit.",
    "The back of the Fire HD 8 (2018) houses an Amazon logo and the rear-facing camera. Each side is almost completely flush, apart from the top, which contains the volume buttons, a 3.5mm headphone jack (hooray), the power button and a micro USB port (boo).",
    "The left side houses two small cutouts for the twin speakers, while the right side holds a microSD card slot.",
    "On the front of the device can be found the 8-inch 800 x 1280 screen along with the 2MP selfie camera.",
    "In all, this is an unassuming device, which at 363g is no dainty presence in the hand, but one which exudes a certain kind of design confidence that comes from precisely knowing one’s niche.",
    "Given that the primary use of many tablets is the consumption of media, the screen is make or break in almost every instance. Unfortunately, there are a great many budget tablets, especially those which cost less than $100/£100, which have truly poor screens.",
    "As such, it is somewhat lucky that, while the Amazon Fire HD 8 (2018) will not win any awards for its screen, nor will it compare to the likes of the Samsung Galaxy Tab S4, it is certainly good enough for watching Netflix on the go, or reading a book.",
    "Brightness is perhaps its strongest suit. Although not quite suited to very sunny days, it can certainly compete well with most indoor light sources and has an even backlight, with no ‘bleed’ issues as far as we could see.",
    "As for resolution, this is realistically the minimum that Amazon could get away with for the price. With 189 pixels per inch it is well below what we might consider to be ‘retina’ territory, that is where the human eye ceases to notice individual pixels.",
    "Text can appear a little jaggy when reading, a problem which we particularly encountered with the web browser. For the price, it is forgivable, but only just.",
    "Color reproduction is another weakness. This screen is washed out and lacking the vibrancy which draws the user in to their content. Again though, nothing more could realistically have been expected, and for vegetating on the sofa it is more than adequate overall."
  ],
  "headers": {
    "8": "Amazon Fire HD 8 (2018) price and availability",
    "10": "Key features",
    "19": "Design",
    "27": "Screen"
  },
  "links": {
    "Amazon Fire HD 8 (2020) review": "https://www.techradar.com/reviews/amazon-fire-hd-8-2020",
    "Microsoft Surface Pro X": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "iPad Pro 11": "https://www.techradar.com/reviews/ipad-pro-11",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "Lenovo Smart Display": "https://www.techradar.com/reviews/lenovo-smart-display",
    "Google Home Hub": "https://www.techradar.com/reviews/google-home-hub",
    "Fire 7 (2017)": "https://www.techradar.com/reviews/amazon-fire-7-2017",
    "Samsung Galaxy Tab S4": "https://www.techradar.com/reviews/samsung-galaxy-tab-s4-review"
  }
}