{
  "source": "https://www.techradar.com/reviews/call-of-duty-warzone",
  "title": "Call of Duty: Warzone review",
  "category": "gaming",
  "updated": "2021-06-28T15:48:47Z",
  "author": "lloyd-coombes",
  "summary": "Call of Duty: Warzone is a smashing battle royale game",
  "verdict": "Call of Duty: Warzone is a new contender to the Battle Royale crown, but it’s still likely to give Fortnite more of a run for its money than Blackout ever could.",
  "pros": [
    "Huge, interesting map",
    "Tight, responsive gunplay",
    "Tense Gulag encounters",
    "Contracts offer a new way to play"
  ],
  "cons": [
    "Technical hitches at launch",
    "Uninventive weaponry",
    "Killstreaks can be overpowered"
  ],
  "article": [
    "What did we think of Call of Duty: Warzone? In case you missed it – or weren’t one of the six million players that dropped in for the game’s debut – there’s a new Call of Duty title in town, and it has its sights on the battle royale crown. Call of Duty: Warzone is a new free-to-play battle royale, and the COD franchise’s latest attempt at perfecting the massively multiplayer manhunt.",
    "In competing with foes both new (EA’s Apex Legends) and old (genre-defining juggernaut Fortnite and mode originator PUBG), does Warzone do enough to distance itself from the competition, or have we finally reached saturation point?",
    "The Call of Duty franchise often feels frustratingly iterative, rather than truly revolutionary, but we’re genuinely impressed at Warzone’s tweaks to what has become an exhaustingly vanilla battle royale formula. Yes, there’s a big map (more on that later), and yes, there are a lot of other players (up to 150), but that’s not all that’s new here.",
    "Players can enter matches solo, as part of a duo, or with two squadmates, with the ability to auto-fill gaps in your lineup if you choose to do so. However you drop in, there’s a good chance you’ll sit mouth agape at the gorgeously rendered intro cutscene – pulling back the curtain on Warzone’s ridiculously large map, which dwarfs the offerings of its competitors in terms of scale and variety (although vehicles do help mitigate the gaps between areas somewhat).",
    "Every single building has been custom-designed, eschewing the deja-vu of PUBG’s identikit house templates, or Fortnite’s entirely destructible structures. While it’s easy to get lost, there’s a magic to fleeing an enemy squad to find yourself wandering around a facsimile of Infinity Ward’s previous multiplayer maps, such as Vacant or Overgrown.",
    "Of course, stumbling down memory lane in the middle of a firefight is one thing, but this is far from a rehash. For one, players earn cash from looting and killing which can be used at Buy Stations to call in a killstreak, revive a fallen squadmate, or call in a custom loadout.",
    "Given Blackout’s overwhelming number of weapon attachments, there’s a refreshing simplicity to Warzone’s reliance on stick weapon varients, with more advanced ‘named’ weapons – that come with preset scopes and doodads – available through supply crates littered around the map, the aforementioned loadout request, or a new feature called Contracts.",
    "These Contracts come in three flavors, adding secondary objectives beyond simply survival – so you’ll either be holding territory (Domination style) for a period of time, hunting down a specific enemy, or looting a series of predetermined loot caches. With tangible rewards including high-level weapons and bonus cash, it promotes a less static style of play that constantly feels rewarding.",
    "One of the biggest changes of Warzone is its approach to eliminated players. For a period of time – usually until the game gets towards the business end of things – any player killed in the field will be imprisoned in one of several Gulags. There, you’ll queue up to fight an opponent 1v1 for the right to return to the main map.",
    "Kill the enemy, and you’ll be transitioned back to the map – sans loot that you’d earned before dying. Perish in the Gulag and your teammates will have to scrape together enough cash to redeploy you, which is by no means a certainty.",
    "It gives players a reason to stay invested even when their time is up, and waiting your turn to fight a fellow prisoner builds a tension that somehow feels unique even in the confines of a battle royale.",
    "Avoid the Gulag, and it's business as usual. While there is a Ping system to help communicate with allies, the lack of any Apex Legends-style abilities means that Warzone is all about the shooting, and as you’d imagine it feels great: gunplay is buttery smooth, with weapons offering predictable recoil patterns, even without attachments.",
    "Warzone’s more grounded nature does mean that its weapons don’t tend to stray too far from genre archetypes, which is a shame – those looking for creative weaponry will no doubt be sticking with Apex Legends or Fortnite.",
    "Then there’s the game’s armor system. Whereas most battle royales offer helmets, vests, or shields, Warzone players don’t get any head protection – just armor plates that are stuffed into your vest.",
    "Players can hold five plates at a time, but can only equip three. It’s a system that means you’re not looking for the damage numbers when shooting an enemy, rather you’re listening out for the satisfying ‘clunk’ of their armor falling apart instead.",
    "When combined with regenerating health (taking the hassle of healing items out of your limited inventory), it helps each skirmish move along at a rapid pace.",
    "The only time Warzone feels a little unbalanced is when players that have stockpiled their killstreaks begin to trigger them in the late-game as the circle closes. UAVs have been nerfed to a 100m radius, but when the final circle isn’t much bigger than that and there’s already an airstrike to contend with, it can feel harsh – best save your own for later, just to be safe.",
    "While the battle royale mode is undoubtedly the highlight of this free-to-play package, Plunder mode is also included. It’s apparently still in beta, but revolves around collecting as much cash as possible before escaping off the map.",
    "Each match is half an hour long and revives are in effect, but it’s a fun way to explore the map a little bit more than you usually can in the course of a single battle royale game, while also taking some of the pressure off for newcomers.",
    "It’s not all been good news, though. While Warzone is proving exceedingly popular, there have been some issues where players have simply been unable to get into a game.",
    "That’s due to the servers not populating properly – and there’s also been some unexpected server downtime. It looks like these issues are being fixed, but with reports of infinite revive glitches too, it might not be the worst thing to wait a couple of extra days before jumping in.",
    "Despite some teething issues, Warzone has shown enough in its first few days to suggest that its here to stay, at least more than Blackout did. Its shooting is satisfying, its map rewarding to explore, and it offers more than enough interesting concepts like the Gulag and Contracts to make each match feel wholly unique, wherever you land. We’ll see you out there."
  ],
  "headers": {
    "3": "Modern Phwoar-fare",
    "8": "Gulaggin’ behind",
    "17": "Plunderwall",
    "21": "Verdict"
  },
  "links": {
    "Call of Duty: Warzone": "https://www.techradar.com/news/call-of-duty-warzone-battle-royale",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds"
  }
}