{
  "source": "https://www.techradar.com/reviews/bosch-access-control-systems",
  "title": "Bosch Access Control Systems review",
  "category": "computing",
  "updated": "2020-09-21T16:40:50Z",
  "author": "jonas-p-demuro",
  "summary": "Invented for life",
  "verdict": "Bosch Access Control Systems are worth a close look, particularly for more complicated deployments.",
  "pros": [
    "Options for support",
    "Scalable to more complex facilities",
    "Integrates with third party software",
    "Available backup batteries"
  ],
  "cons": [
    "Opaque pricing",
    "Dead vendor links",
    "No direct email address for support"
  ],
  "article": [
    "Back in 1886 in Stuttgart, Germany, Robert Bosch founded a “Workshop for Precision Mechanics and Electrical Engineering” in his plan to be self-employed. Early on, work focused on mechanical and electrical engineering projects, such as installing phone systems. Bosch has been quite diverse through the years, with product offerings in the auto sector, the IXO electric screwdriver which “became the best-selling power tool worldwide,” and kitchen appliances. With the digital revolution, Bosch developed new product lines including software, Internet of Things, and data protection.",
    "Today, Bosch Security and Safety Systems has a complete lineup of security products that covers access control needs, and is integrated with safety and communication needs.",
    "Bosch offers a comprehensive line of access control hardware and software, with the strength that it can work with other Bosch solutions, such as security functions with integrated cameras. These are easily scalable to cover the most challenging of facilities, such as stadiums, banks, airports and government facilities.",
    "A strength of Bosch is the larger catalog to have an array of choices to plan the access control system, balancing the need for the facility to be open and welcoming, while simultaneously highly secure. This includes different readers, credentials, and various software options to fit different needs. The other advantage is that having access to a larger catalog is that it makes it simple to grow and evolve as your access control needs change. Rounding out the offerings are biometric readers for an even higher level of security, backup batteries in case of a power outage, and PIN-only readers for a lower cost, easy to use solution.",
    "The software is also designed to grow as you do. At the bottom is Access Professional Edition (APE), suitable for the more basic needs of an entry level project such as a retail establishment or smaller office- at a more affordable price point. It can cover up to 512 readers, 10,000 cardholders, and 16 concurrent workplace clients. Support is there for the Open Supervised Device Protocol (OSDPv2 secure channel) which facilitates the bi-directional encrypted communication for the reader and the controller. The software has an easy to use graphical user interface, and integrates easily with third party software for HR, such as for Time and Attendance.",
    "Medium sized and larger scale projects are more suited for Bosch’s Access Management System (AMS) software, which is ideal for office security, and healthcare facilities. This more robust solution can control 10,000 doors, and 200,000 cardholders which can be divided into up to 400 divisions with support for up to 40 concurrent workplace clients. Additional features include encryption throughout the process, along with integration with video management software from either Bosch or a third party solution of your choosing. Finally, there is also integration with both the Bosch B and G Series Intrusion Control panels.",
    "At the top end is the Building Integration System Access Engine (BIS-ACE), software designed for the most challenging of facilities, including airports, and sports stadiums. This also supports what the AMS software can do, but increases it for up to 80 concurrent workplace clients, with up to 200,000 sensors per each server. There is also multi-server topology support, and full support of the Bosch video, fire, intrusion and public address systems via the Building Integration System (BIS).",
    "Finally, to increase the resiliency of the system, the two upper softwares both have an additional third layer of security, known as the Master Access Controller. This additional layer functions between the server and the controllers, to be a backup to controller communication, in the event of a server failing.",
    "Bosch offers a variety of methods for users to get in touch for support. First you need to select your region of the world, so that the options provided are specific to your country.",
    "For the US market, an important option is phone support. We appreciate that it is a toll free number. Other options include Live Chat, and also “Email,” which is actually an online portal to send a message.",
    "There is also a portion of the support website for Bosch products that includes online training, and support for products that includes firmware and software updates.",
    "We are big fans of some upfront pricing, so we can make a comparison, and to plan out a system from the convenience of our couch. However, Bosch did not cooperate.",
    "We did go to the portion of the Bosch Access Control site of “Where to Buy” which seemed promising. We decided to go for the ‘End User’ sales, rather than ‘Government.’ It generated a map, and we entered our local zip. A number of dealers came up, but the first two that the map supplied, were, believe it or not, to dead links, as seen in the above image. Furthermore, number three did not have any pricing either, just an offer for a sales quote.",
    "In our estimation, this was too many hoops to try and jump through for no useful info.",
    "Bosch has created a robust access control solution, with options for the hardware that gets deployed. The pluses include the choice of software, the ability to scale up to larger facilities, and the choice of support methods. The minuses to mention are the lack of a direct email address for support, the totally opaque pricing, and the difficulty in connecting with a local vendor due to the multiple dead links on Bosch’s site. Despite these issues, Bosch remains a market leader in this segment for good reason."
  ],
  "headers": {
    "2": "Features",
    "8": "Support",
    "11": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "Bosch Security and Safety Systems": "https://www.boschsecurity.com/xc/en/solutions/access-control-systems/",
    "access control": "https://www.techradar.com/news/best-access-control-systems"
  }
}