{
  "source": "https://www.techradar.com/reviews/faxcom",
  "title": "Fax.com review",
  "category": "computing",
  "updated": "2020-04-17T08:27:53Z",
  "author": "alex-mcomie",
  "summary": "Not the best way to send faxes online",
  "verdict": "Fax.com only offers a single subscription for 300 pages per month, so it’s only a viable option for businesses with specific fax needs. Even if Fax.com fits your company’s scale, other services provide better features and value.",
  "pros": [
    "Local and toll-free numbers available",
    "Send faxes online or via email"
  ],
  "cons": [
    "Only one subscription",
    "Clunky interface"
  ],
  "article": [
    "While fax machines were once the only way to send and receive faxes, online fax services are an increasingly popular option for both small and large businesses. The best online fax services make it easy to view and send faxes from a variety of devices.",
    "In our Fax.com review, we discovered that this online fax service is a decent option for smaller companies but doesn’t provide the same scalability as some competitors. Read on to learn more about its pros and cons and to determine whether it’s the best option for your company.",
    "Fax.com only offers one subscription. For $9.99 per month, you’ll be able to send and receive a total of up to 300 pages. Additional pages cost 12 cents each, but you will be charged more if the page takes longer than 60 seconds to send. The service also charges a one-time setup fee of $9.99, which is due when you start a new subscription.",
    "The monthly fee covers all incoming faxes along with faxes sent within the US and Canada. International faxes are subject to an additional charge depending on the destination. You can view pricing by country on the Fax.com website.",
    "With Fax.com, you can send faxes via email or through the website. When using the website, you can also add custom headers and cover pages, store contacts, view previous faxes, and more. The service offers both local and toll-free numbers depending on your needs.",
    "Unfortunately, email and the website are the only two ways to send faxes. There’s no Android or iOS app, and the platform doesn’t integrate with other productivity tools.",
    "That said, Fax.com advertises that it offers free online storage for up to 30 days. After you log in, the website states that storing documents for longer “may incur a monthly storage fee based on your current plan,” but Fax.com only offers one plan. Furthermore, the pricing page claims that long-term storage costs “$0.00 per fax per month.” This seems to imply that storage is free over the long term and not just for 30 days.",
    "During the setup process, Fax.com will ask for basic information including your name, email address, and phone number. You’ll also have a chance to select your new fax number. Fax.com requires a credit card, even if you’re signing up for a free trial (available for 30 days).",
    "Once you’ve created an account, you’ll be able to start sending faxes. The process only takes a few minutes. After signing up, you can adjust preferences at any time under the Settings tab.",
    "While Fax.plus provides decent features for sending faxes online, its interface is surprisingly unintuitive. Furthermore, there’s no mobile app, and the website doesn’t display particularly well on smartphones and tablets. With that in mind, it’s easier to send faxes via email rather than the website.",
    "In general, faxes should be delivered to their destination within one minute per page. Unfortunately, Fax.com starts counting a page multiple times if it takes more than one minute to send. Delays are usually caused by a poor internet connection or overly complicated documents.",
    "The Fax.com Support Center provides a basic guide to using the website. If you run into any problems with the platform, access the Support Center by clicking Help in the upper-right corner. The FAQ includes additional information about the site, along with a guide to sending faxes via email.",
    "If you don’t find what you’re looking for, you can also create a ticket through the Support Center. That said, the website doesn’t list any support hours or turnaround times, and there’s no live phone or chat support.",
    "Fax.com is a relatively secure way to send and receive faxes, with documents only available to the sender and recipient. Faxes sent through the website are SSL-encrypted, while documents sent through email are secured by your email client.",
    "On the other hand, Fax.com doesn’t support two-factor authentication, one of the simplest ways to increase account security. There’s also no way to set up single sign-on—users have to sign into a Fax.com account to access the website.",
    "If you’re concerned about pricing, Fax.com isn’t the most affordable option. The SRFax Standard Lite plan, for example, provides up to 500 total pages per month for $9.95—almost identical to the cost of a Fax.com subscription. If you need more than 500 pages, extra pages are just six cents each (compared to 12 on Fax.com).",
    "Additionally, SRFax comes with several key features that aren’t available at Fax.com. Users can schedule faxes to send at a specific time, access unlimited lifetime storage, and integrate the tool with other programs through the SRFax API.",
    "While Fax.com gets the job done if you need to send or receive faxes without a fax machine, it also comes with a number of downsides. First, there’s only one plan, so users who want to send and receive more than 300 pages per month will have to pay 12 cents for each additional page.",
    "Furthermore, Fax.com has a poor web interface and no mobile app. You will be charged more for faxes that take more than 60 seconds to send, and there’s no way to tell in advance how long it will take. All things considered, there are better options out there if you’re looking for an online fax service."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features and utilities",
    "7": "Setup",
    "9": "Interface and performance",
    "11": "Support",
    "13": "Security",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "fax machines": "https://www.techradar.com/news/best-fax-machines",
    "online fax services": "https://www.techradar.com/best/best-online-fax-service",
    "Fax.com": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3159401954268658000/https://www.fax.com/",
    "iOS app": "https://www.techradar.com/news/best-ipad-apps-2021",
    "productivity tools": "https://www.techradar.com/best/best-productivity-apps",
    "online storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "credit card": "https://www.techradar.com/best/best-credit-card-processing-service",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "website": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "single sign-on": "https://www.techradar.com/best/best-identity-management-software",
    "SRFax": "https://www.techradar.com/reviews/srfax"
  }
}