{
  "source": "https://www.techradar.com/reviews/element-secure-messenger-review",
  "title": "Element secure messenger review",
  "category": "computing",
  "updated": "2020-09-09T11:40:07.076Z",
  "author": "david-nield",
  "summary": "Element is a super-secure, decentralized messaging platform",
  "verdict": "The Element messenger platform scores highly for its approach to security and its commitment to decentralization, and it's definitely going to be of interest to businesses wanting control over their own chats – as well as plenty of individual users as well.",
  "pros": [
    "Strong security features",
    "Open source software",
    "Plenty of hosting flexibility"
  ],
  "cons": [
    "Could use some more polish",
    "Some aspects more technical",
    "Occasional mobile bug"
  ],
  "article": [
    "Element is another encrypted chat app for the security conscious to consider, offering not just end-to-end encryption but also decentralized storage, so your message data isn't held in one place by one company – you can even set up your own server, if you want to.",
    "Since its launch in 2016, you might have previously come across Element under the names Riot or Vector. Now it looks as though the branding is here to stay, and the app is making a concerted push to attract users away from the Signals and the WhatsApps of the world.",
    "It's the security and decentralization aspects that Element's developers have focused on, above all else: the end-to-end encryption ensures that only authorized users can see your messages, while the choice of servers (including home servers) means more flexibility and ownership when it comes to your data. It's a little bit like Signal and Slack mixed together, with extra security and privacy options.",
    "Element offers apps for Android, iOS, Windows, macOS and Linux, and it'll also run inside a web browser. When you sign up you'll need to choose a server to host your messages: you can pick a free one, host your own, or pay for one (which might be the way to go if you're hoping to use Element with a community or a business). If you decide to pay, free trials are available.",
    "Most of the features you need in a messaging app are here: public and private rooms, file sharing, granular control over notifications, read receipts, audio and video calling, and plenty more besides. It's a comprehensive package, even if there aren't quite as many consumer-friendly features or as much spit and polish as you might find in some of the more well-known alternatives.",
    "You can use Element and the Matrix protocol to communicate with other chat platforms, including Slack, SMS, Signal, Telegram, Facebook Messenger, Google Hangouts, Skype, Discord and even iMessage, among others – though you'll need some coding know-how and your own server to set up these integrations.",
    "Signing up for Element is a breeze, with your easiest option – if you just want to try out the service for free – being to pick the matrix.org public server. One nice touch is the ability to generate a security key that you can use to decrypt your messages again, should you forget your password. You also need to validate the email address you sign up with, as an additional layer of security.",
    "While the interface doesn't have the polish of something like Microsoft Teams or Facebook Messenger, it's well presented and laid out, and everything is easy to find. Whether you want to attach a file to a message or explore the public rooms on your server, everything is intuitive and accessible, and it won't take you long to get to grips with the software.",
    "We like the ability to make conversations low priority or favorites – as well as just normal – and the tweaks you can make to the notifications so you're not overwhelmed (you can get alerts only when you're specifically mentioned, for example). Another handy feature is the option for new arrivals in a room to see all of the historical messages that have been sent, or only the messages that appear after they've signed in for the first time.",
    "Across mobile and desktop you'll find Element to be basic but elegant in terms of its interface, and as far as we could tell the speeds of the public matrix.org server were respectable as well. We did notice a few bugs – search didn't seem to be working in the Android app, for example – but these were few and far between and not major issues during our testing.",
    "Security and privacy are undoubtedly the strong points for Element. The end-to-end encryption offered by the platform is based on the Olm, Megolm and Double Ratchet standards, and much of the technology is open source and independently audited. No one can get at your data unless they are the intended recipient(s) of your messages – not even the team at Element or Matrix.",
    "You get provided with a secret key when you sign up for Element, and you need this key to log into new devices (alongside your username and password), so don't lose it – this two-factor login process is another reason why you can trust Element. Add in the decentralization, so no single point of control or failure, and from a security standpoint this is one of the best messaging platforms out there.",
    "The core Element apps are all open source and you can use the platform across the web, the desktop and mobile without paying anything – though you will need to either set up your own home server (which can be somewhat technical and might impair performance) or sign up to the public matrix.org server with other Element users (which has been working perfectly well for us).",
    "Various paid-for servers are available too, if you want the best possible speeds, security and data management, plus extras like custom DNS – pricing starts at $2 (about £1.55) per user per month, though as is the norm that's based on paying annually so you're locked in for a year. Alternatively, if you have the company resources, you can set up and configure your own server for Element for your business.",
    "Element is a genuinely interesting and appealing secure messaging platform that will appeal to individual users and businesses alike. It's reliable, it comes with just about all the features that you're likely to need, it's simple to set up, and it has some of the best security and privacy features in the business – if you want to escape the clutches of the big tech giants, this is well worth a look.",
    "For consumers, the biggest problem might be getting all your friends and family to switch over to something new – Element doesn't have quite the same polish as the likes of iMessage, Facebook Messenger, WhatsApp, Slack and the rest, and of course it's not as widely used. The best fit for Element might be those who have the time and resources to really invest in it, including servers and bridges to other apps."
  ],
  "headers": {
    "2": "Element features",
    "6": "Element interface",
    "10": "Element security",
    "12": "Element pricing",
    "14": "Element verdict"
  },
  "links": {
    "Element": "https://element.io/",
    "encrypted chat app": "https://www.techradar.com/best/best-encrypted-messaging-app-android"
  }
}