{
  "source": "https://www.techradar.com/reviews/tikvpn",
  "title": "TikVPN review",
  "category": "computing",
  "updated": "2020-12-14T16:44:24.067Z",
  "author": "sead-fadilpasic",
  "summary": "Plenty to like about this impressive VPN",
  "verdict": "TikVPN is a capable platform with many advantages you’d expect from a good VPN: a high level of privacy, top speeds, and low prices. It can also unblock some geo-restricted content, and you can try it for free for as long as you want. That said, its apps are a bit too basic and we aren’t told a single detail about its mysterious proprietary protocol.",
  "pros": [
    "Excellent free tier",
    "Super-fast",
    "Unblocks Netflix, BBC iPlayer",
    "Gorgeous apps",
    "Inexpensive"
  ],
  "cons": [
    "Not many features or extras",
    "Lacks details on proprietary protocol"
  ],
  "article": [
    "TikVPN is a VPN provider operating from the British Virgin Islands that offers free and premium anonymity services for all major platforms through its native apps, which feature a special proprietary private protocol.",
    "The vendor splits its offering into three price plans: 1-week at $0.99/week, 1-month at $5.99/month, and 2-year at $1.25/month (billed $29.99 every two years). Each account type can support up to 5 simultaneous connections.",
    "In case you aren’t happy with the product, you can ask for a refund under the 30-day money-back guarantee. But there’s also an entirely capable free tier that offers plenty of opportunities to test it out to the maximum.",
    "The only catch? It’s ad-supported and only some servers are available, but otherwise, it’s great. The provider says speeds may be lower than in the premium version, but we were more than satisfied during our tests.",
    "Payments are accepted via PayPal and credit/debit cards.",
    "For a service that isn't particularly well known, TikVPN is really rather impressive. However, there is one box the company fails to tick: it has not commissioned an independent audit of its privacy policy.",
    "For instance, the expensive ExpressVPN has been tried and tested by an independent auditor. NordVPN and Surfshark have done the same, while CyberGhost has undergone an evaluation by AV-Test.",
    "Other than that, these alternative VPN solutions are slightly ahead of TikVPN in terms of number of features, accepted payment methods, and support for different devices.",
    "TikVPN helps its users bypass geographical blocks imposed by various popular streaming platforms, such as Netflix, BBC iPlayer, Disney+, Hulu, HBO, and others via specialized servers.",
    "TikVPN is based in the British Virgin Islands, from where it provides its customers with access to 40+ IP addresses and 595+ servers scattered across more than 40 countries around the world, including Israel, Turkey, Nigeria, Colombia, Mexico, Finland, Costa Rica, Russia, Palau, Croatia, and more.",
    "The business has a Trustpilot rating of 4.9 stars (out of 5).",
    "Instead of the usual list of protocols (OpenVPN, IKEv2, PPTP, etc.), TikVPN uses its proprietary patented connection protocol, which it claims is “verified by experts as the fastest secure VPN on the market”. However, there’s absolutely no information about this mysterious protocol and, when asked about the details, we couldn’t get much information from the provider.",
    "What we do have information on is the level of encryption, specifically the 256-bit AES bank-grade algorithm that ensures your private data is safe from snoopers or other malicious parties. Such security also means your online activities will remain private, including P2P traffic and torrenting, entirely supported by the VPN.",
    "TikVPN’s Privacy Policy is quite a detailed document, outlining the provider’s dedication towards its users’ privacy. Specifically, it states that it doesn’t collect “IP addresses, browsing history, session information, used bandwidth, connection time stamps, network traffic and other similar data”. The only missing element? Independent confirmation of these claims.",
    "Add to this the fact that TikVPN is registered in the privacy-friendly British Virgin Islands (like some of its more famous competitors), a country that doesn’t demand data logging on its soil, and there isn’t much left to worry about.",
    "TikVPN’s exceptionally user-friendly and beautifully designed apps can be downloaded for Windows, iOS, Android, and Mac. The solution can also be installed on a router, allowing you to protect all of your devices, regardless of their number.",
    "The iOS app has a rating of 4.9 stars (out of 5), with feedback gathered from 719 users. Its Android version has a slightly lower rating - 4.4 stars as judged by 2,739 users - but has been installed on devices of over 100,000 users.",
    "If you run into any obstacles while installing and using this provider’s services, you can make use of its Help Center, where you can find some information about the VPN and its features, although not as much as we would like.",
    "More assistance can be had by contacting customer support directly via live chat on the website, email, or contact form.",
    "TikVPN’s apps are exceptionally user-friendly, intuitive, and beautifully designed. They don’t have many features or extras, but they are certainly simple. We had no problems downloading, setting up, or using them.",
    "We first tested an automatically server, located in California, US. The speed of our own connection that we used for testing was 34.3Mbps, so imagine our shock and surprise when this VPN server gave us 26.2Mbps when connected. And mind you, this was on a free app, so the premium version will probably get you an even faster connection.",
    "A server in The Netherlands performed slightly worse (but not by much), with 25.3Mbps, but this is still amazingly fast in comparison to many competitors’ premium speeds. Finally, we also wanted to see how a server in Japan would fare and it did great for a location so far away from our own: 10.8Mbps.",
    "Connection times are very fast as well. The app connects in less than a second, and server switching only requires just a simple double-click or tap.",
    "Testing this VPN was a truly pleasant experience. Not only did it not force us to purchase its premium services, but its free tier allowed us to get a good glimpse into all the amazing capabilities you can get if you purchase the premium service.",
    "Its many impressive qualities include blazing speeds (even on the free tier), unblocking difficult-to-access geo-blocked streaming content, torrent support, low prices, and intuitive apps. The apps themselves have fewer features than some others and we would love to know more about its mysterious proprietary protocol, but otherwise there isn’t much to complain about at all."
  ],
  "headers": {
    "1": "Price",
    "5": "Alternatives",
    "8": "Streaming",
    "9": "About the company",
    "11": "Privacy and encryption",
    "15": "Support",
    "19": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "TikVPN": "https://www.tikvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://www.tikvpn.com/privacy",
    "iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2885540933174219000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fapp%2Fid1477939455",
    "Android": "https://play.google.com/store/apps/details?id=com.speed.svpn",
    "Help Center": "https://www.tikvpn.com/help-center",
    "email": "http://support@tikvpn.com",
    "contact form": "https://www.tikvpn.com/help-center/feedback"
  }
}