{
  "source": "https://www.techradar.com/reviews/ribble-cgr-al-e",
  "title": "Ribble CGR AL e review",
  "category": "fitness",
  "updated": "2020-08-26T16:12:11Z",
  "author": "cat-ellis",
  "summary": "The Ribble CGR AL e is versatile, fun e-bike for the road less travelled",
  "verdict": "If you're in the market for an electric bike for more than just commuting, this could be just the ticket. The Ribble CGR AL e is just as happy on a rough trail as a tarmac road, and its smooth motor assistance and super speedy acceleration make riding a joy. It's just a shame the app can't keep up.",
  "pros": [
    "Fast acceleration",
    "Smooth ride",
    "Stylish, practical design"
  ],
  "cons": [
    "No display other than the LED color",
    "App needs work"
  ],
  "article": [
    "The Ribble CGR AL e is an electric bike that picks and mixes elements of cross, gravel and road designs to create something that’s both versatile and a whole lot of fun. It’s equally happy on smooth tarmac or a muddy trail (though make sure you wipe it down and dry it off carefully afterwards).",
    "The ride is super smooth and acceleration is exhilarating. If you love cycling but are finding it less fun than you once did, this is the bike to put a smile back on your face.",
    "The only downside is the ebikemotion app, which is very handy for checking the bike’s charge on longer or more intense rides, but is still a work in progress. Maps are expensive, and you might find your phone's battery draining rather faster than expected. It’s not a failing of Mahle ebikemotion platform as a whole though, and hopefully it’ll be updated soon.",
    "The Ribble CGR AL e is available to buy directly from Ribble now. The bike is available in four standard setups, with prices ranging from £2,299 (about $3,000 / AU$4,200) to £2,999 (about $4,000 / AU$5,500). When ordering, you’ll have the opportunity to customize your bike through Ribble’s Bike Builder, which will allow you to change and add components, and pick a custom paint color for an extra charge.",
    "If you live in the UK, the CGR AL e is available in cycle-to-work schemes (essentially hire-purchase schemes that allow you to pay for the bike in instalments directly through your salary).",
    "Looking at the Ribble CGR AL e, you’d never know it was an electric bike unless you spotted the discrete power button on the top tube. The battery is tucked inside the downtube, which is only slightly thicker than normal, and the motor is hidden in the rear hub.",
    "Design-wise, it’s an interesting mix. Its road heritage is shown mainly in its drop-handlebar design, and while its tires aren’t particularly knobbly, there’s plenty of clearance around for mud. There’s no suspension, so you’ll definitely feel any rocks and bumps, but this is definitely a bike that’s as happy on a woodland trail as a tarmac road.",
    "Take a closer look and you’ll notice that those drops aren’t smoothly rounded, but have a more ergonomic shape typical of a gravel bike. We found them very comfortable, and the angle worked well with our hands.",
    "When it comes to shifters and brakes, the CRG AL e is available in various specifications, which can be customized further through Ribble’s Bike Builder when you place your order. All models are supplied with a comfortable Prologo Kappa RS Saddle (though you’ll want to get up out of it at every opportunity).",
    "Note that the pedals on our review model are our own (rather old and tatty) ones, and aren’t what you’ll get with the bike.",
    "The bike weighs approximately 13.1kg with no additional components like mudguards or pannier racks, which is impressively light for an e-bike, and makes it easy enough to shoulder and carry. That’s largely down to Ribble’s choice of the Mahle ebikemotion drive system, which contributes just 3.5kg to the overall weight.",
    "The Ribble Hybrid AL e is a lot of fun. Switch on the power (as with any electric bike, this should be done before you place any pressure on the pedals) and you’ll notice the difference immediately – it accelerates extremely quickly, and a gentle push of the pedals in the medium and high assistance levels will definitely put a smile on your face.",
    "Once you’re in motion, the ride is smooth, and the motor is barely audible. Surging along the flats is a joy, but the assistance really comes into its own on climbs, ironing them out so you can forge on without the burn in your thighs.",
    "If you’re planning to ride more off-road than on, we’d recommend switching the standard tires for some knobbier ones that’ll give you more grip; there’s plenty of room to accommodate them. For commuters, the optional mudguards are a wise pick – we couldn’t resist charging through a long, straight tunnel and wound up with a rather stripy back.",
    "The button is your only control on the bike, so it’s wise to read the manual carefully before heading out. To choose a power assistance level, tap the button once so that the LED flashes. Tap it again once, and it will begin to flash green for level one. Tapping it one more time will make it flash orange for level two, and tapping it yet again will cause it to flash red for maximum assistance.",
    "Once the button stops flashing, it will revert to a color that represents the current battery level. It’s a pretty intuitive system, with white and green being good and flashing red meaning you’d better be prepared to plug in soon, or start putting in some more legwork.",
    "The bike is charged through a connector at the bottom of the down tube, which plugs into a simple adapter. Charging is extremely quick too, taking around 3.5 hours from flat. Bear in mind that because the battery isn’t removable, you’ll need to plug the bike itself in. You can buy an extender cable to make this easier.",
    "You can easily use the Ribble CGR AL e by itself, but the bike’s lack of a display means it’s a good idea to download the Mahle ebikemotion app (available for Android and iOS), which transforms your phone into a GPS bike computer. Connecting the bike to the app is extremely straightforward – simply switch the bike on, and it’ll be detected by the app automatically. The bike’s light will illuminate blue when it’s successfully connected.",
    "It’s a good looking app – particularly the main screen, which displays a map with essential information like current speed and charge. However, it’s worth noting that it’s still a work in progress, and not everything works perfectly so far.",
    "The app can provide turn-by-turn navigation, with both on-screen and spoken directions, but only if you purchase a map set first. Each map set covers an entire continent, and once you’ve chosen the one you want, you’ll be able to download maps for individual countries.",
    "It’s a simple enough process, but most people will probably only need to find their way around one or two countries. We’d prefer a system that allowed us to pay for only the maps we need, with optional bundle deals for globe-trotting holidaymakers.",
    "Thankfully, once you’ve purchased a set, it will be linked to your account and available for any ebikemotion-powered bike.",
    "The ebikemotion app also seems to be quite battery-hungry, so it’s wise to ensure your phone is fully charged before heading out on a ride."
  ],
  "headers": {
    "0": "Two-minute review",
    "3": "Price and availability",
    "5": "Design",
    "11": "Performance",
    "17": "Companion app"
  },
  "links": {}
}