{
  "source": "https://www.techradar.com/reviews/lenovo-ideapad-5-14-inch",
  "title": "Lenovo IdeaPad 5 (14-inch) review",
  "category": "computing",
  "updated": "2020-09-28T17:21:02Z",
  "author": "truls-steinung",
  "summary": "A great affordable laptop for serious school work",
  "verdict": "The Lenovo IdeaPad 5 14-inch is a light and sturdy laptop with a great keyboard, good performance and long battery life. All this makes it a great choice for students and other people who want a good work laptop that doesn't cost a fortune, and even though the low contrast screen, the small touchpad and the lack of extra USB-C-ports leaves something to be desired, it still gives you a lot for your money.",
  "pros": [
    "Light and sturdy",
    "Great performance",
    "Good keyboard"
  ],
  "cons": [
    "Low screen contrast",
    "USB-C-port occupied by changer",
    "Touchpad could have been better"
  ],
  "article": [
    "Every student needs a good laptop for school, but laptops can obviously be an expensive investment for anyone with a tight budget.",
    "Luckily, the market is full of laptops that cater to this specific demographic, including Chromebooks and other laptops with modest specs. Unfortunately, these often skimp on build quality, usability and performance, which makes them less than ideal for anyone who needs a laptop that's fast, has a good keyboard and can handle being lugged around in a bag.",
    "The Lenovo Ideapad 5 14-inch feels like a laptop that was specifically made to fill this niche, and does it well.",
    "You get a very sturdy and attractive aluminum chassis, a comfortable and tactile keyboard, plenty of ports and a 14 inch screen – the perfect size for a laptop that has to be portable enough to carry around, but at the same time big enough to comfortably work on documents and presentations.",
    "You could obviously pay more to get a lighter laptop with a better screen and smaller footprint, but if that's not an option for you, the Lenovo IdeaPad 5 14 is a great choice.",
    "The Lenovo IdeaPad 5 14 is available in a variety of configurations including Ryzen 3, 5 and 7 processors, 8 or 16 GB of RAM and 256 or 512 GB of storage.",
    "Availability varies by country and region, and the Ryzen 5 versions seem to be the most common.",
    "The unit reviewed here has a Ryzen 5 4500U processor and 8 GB of RAM, and our impression is that this model will be a good choice for most people. However, it’s worth noting that we have seen this laptop available at retailers with 16 GB of RAM, which might be worth the upgrade if you’re planning to do more demanding work like editing large photos or video.",
    "The Lenovo IdeaPad 5 14-inch has a simple design that should suit most people very well. There’s nothing specifically eye-catching about it, but the laptop has a simplicity to it that we like a lot. The aluminum chassis has a nice and sturdy feel to it, and it should handle being lugged around to lectures and study halls on a regular basis without any problems.",
    "The screen might be considered a weak point for this laptop by some, but it would depend on your expectations and your needs. Neither the contrast nor the brightness is more than average at best, but it is still very usable for things like working with documents and spreadsheets. However, If you're doing a lot of serious photo and video editing, you might want to look elsewhere.",
    "The keyboard has a crisp and tactile feel to it, with fairly long travel for a laptop keyboard, and a nice and satisfying clicky sound that feels just right and at the same time isn’t too loud. This is obviously important for students who need to use their laptop to take notes in class and to study at the library, and IdeaPad 5 14-inch should be perfect for that. It’s worth noting that the keyboard has some deck flex when you press down on it firmly, but not so much that is causes a problem.",
    "The touchpad could have been bigger, but that’s to be expected from a laptop in this price range, and it does function well. There’s a bit of a cheap feel to the mouse button clicks, but over all they do work very well and seem reliable.",
    "The Lenovo IdeaPad 5 14-inch also has a fingerprint reader integrated in the narrow power button above the keyboard, and it works very well with a quick and accurate response.",
    "When it comes to ports, you get USB-C, HDMI, 2 x USB-A and an SD card reader, which seem to cover most typical user needs.",
    "There is just one problem – the charger uses USB-C, meaning that when you're charging you don’t have an available USB-C-port. Charging over USB-C is a good thing, but in this case, we would rather have a traditional charging port – or even better – another USB-C-port.",
    "The speakers are way better than what you would expect from a laptop in this price range. It helps a lot that they are faced upwards, and apart from the fact that they are impressively loud, they also deliver a sound stage that is both wide and fairly balanced with an ok bass response, considering their size. They can't compete with a good pair of speakers or headphones, but they will do just fine for watching YouTube videos or a TV show as long as big and dramatic sound isn't the main focus.",
    "The last thing that’s worth mentioning about the design, is the clever switch that lets you physically cover the web camera when it’s not in use. That way you don’t have to worry about someone hacking your computer and watching you without you knowing about it, and you can throw away that piece of tape you’ve been using to accomplish the same thing.",
    "We are happy to report that the Lenovo IdeaPad 5 14-inch feels snappy and handles multitasking very well. Working with 10-15 tabs open in Chrome at the same times proves to be no issue, even when editing spreadsheets at the same time.",
    "This is even more impressive considering our review unit only has 8 GB of RAM, and even Photoshop runs fine as long as you’re working on smaller projects. However, if you're planning on doing more demanding work, you should probably consider getting a model with 16 GB of RAM.",
    "The Ryzen 4000-series chip is behind this impressive performance, and in Cinebench the 4500U in our review unit competes with the Intel Core i7-7700K. Even more impressive, GeekBench 5 gives us a single-core score of 1,092 which is on par with the Intel Core i5-9400F, and the multi-core score of 4,800 even beats the same chip with a noticeable margin.",
    "In PCMark 10 we get a score of 4811, which is way more than the score Intel Core i7-1065G7 is listed with (3179), and the latter is a chip that is commonly used in laptops in the same price range as Lenovo IdeaPad 5 14”. There is really no doubt that you are getting a lot of performance for your money here.",
    "Obviously, gaming isn’t a focus for this laptop and our 3D benchmarks show that it doesn’t exactly excel in that department. But while playing Fortnite with no other players onscreen, the fps rises to 40-50, which looks OK on paper, but it fluctuates a lot and there are a lot of dropped frames. When things start to get heated the frame rate can drop to the low 20s, which would be considered unplayable by most people.",
    "However, Minecraft works fine, so it’s obviously possible to do some light gaming in between studying on this machine – just don’t set your expectations too high.",
    "Thanks to the power efficient nature of the 4500U-processor, we got a very impressive result of 12 hours and 1 minute from PCMark 10s battery test, and our own standard movie test where we play a 1080p-movie on repeat until the battery runs out, gave us a result of 10 hours and 55 minutes.",
    "That's more than enough to get through a long day of classes and studying, and you'll probably even have enough battery left for some movie watching on the train home.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "0": "2-minute review",
    "5": "Price and availability",
    "8": "Design",
    "17": "Performance",
    "23": "Battery life",
    "25": "Don't buy it if ..."
  },
  "links": {
    "laptop for school,": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook"
  }
}