{
  "source": "https://www.techradar.com/reviews/athenacollector",
  "title": "athenaCollector review",
  "category": "computing",
  "updated": "2020-01-25T12:46:04Z",
  "author": "jonas-p-demuro",
  "summary": "All about getting practices paid more and faster",
  "verdict": "athenaCollector is a powerful addition to the athenaOne suite, but the multitude of user complaints gives us pause in giving it a recommendation.",
  "pros": [
    "Check insurance eligibility prior to encounters",
    "Claims management system"
  ],
  "cons": [
    "Opaque pricing",
    "No mobile apps",
    "Lacks free trial",
    "Support is lacking"
  ],
  "article": [
    "Athenahealth can be traced back to 1997, and is based in the US. It is notable for its cloud based EHR, known as athenaClinicals, which focuses on networking, and outcomes based benchmarking. The billing component of this suite is called athenaCollector, which once again has a fairly unique spelling with the lower case first letter, and a capital letter in the middle.",
    "AthenaOne is the name for the entire suite of services, built from the ground up to be integrated, and network enabled. Its goal is to provide “Measurable financial and clinical results for providers,” with claims that the top providers using this platform can exceed the industry benchmarks consistently.",
    "While billing is often thought of as occurring after the patient encounter, it really needs to be throughout the encounter, and here athenaCollector integrates well across the continuum. This includes the ability to verify patient insurance eligibility in advance of the encounter, or also in real time for walk in appointments. Also, patient payments, better known as copays, can be collected, and tracked at the time of service.",
    "Claims that do not go through are the bain of any office, as they require extra work for resubmission, and delay payment, ultimately interrupting the cash flow of the practice. AthenaCollector has their Claims Management system, which promises to significantly reduce claims that bounce out. It utilizes an “Automatically updated rules engine,” that can scrub claims prior to submission, finding the errors upfront, to increase the chances that it will go through as a ‘Clean claim.’ It’s so good that athenaHealth states on their website that it has a “94% first pass resolution rate.” This all contributes to the claim the athenaCollections manages 9 million denials, and posts $26 (£19.8) billion in collections.",
    "Long gone are the days of meeting with the practice’s bookkeeper to manage the practice’s income and pending collections. With athenaCollections, this becomes an automated process with access to the data at all times, and instantly up to date, with a feature known as the Revenue Cycle Dashboard. Via a single dashboard, there is easy access to tasks to see the financial health of the practice, along with patient information.",
    "Finally, there is integrated Performance Reporting that has the ability for real time reports- available on demand with plenty of detail.",
    "AthenaHealth, and athenaCollector do have some issues evident from the user reviews we found online. This includes that this solution is not laser focused on each specialty, making it not ideal for some practices. There are also issues with patient reminders for follow up appointments, with one user going so far to request their patient’s communication preferences, and dialing it back before a patient gets inundated with a plethora of emails and phone calls for a single visit. Still others report that when support is requested, that the problem remains unaddressed until it gets escalated to prompt a resolution.",
    "The athenaCollector more specifically also has some shortcomings. There are concerns that the billing component could be more aggressive, and robust. Also, the modules within athenaHealth could communicate better, such as having insurance card information transfer over seamlessly. Finally, users indicate that the cost for athenaCollector use is high.",
    "AthenaHealth is completely web based, through a cloud platform. This translates to no software to install, and no available mobile apps for any of the popular iOS or Android platforms. However, this does ensure compatibility across the widest variety of devices.",
    "At least athenaHealth does indicate that there are no hidden fees. However, while not technically hidden, one practice reported that this company charged for technical support, for even what they considered trivial issues.",
    "AthenaHealth has a modern website with a refreshingly clean interface. Unfortunately, the link to support could be more prominent. Apparently, the user needs to be in the athenaNet system, and then there are options to create a case, or request a call. Also provided is access to a ‘Success Community,’ which is likely an online forum, but we cannot confirm details as it gets locked behind the athenaNet login.",
    "Elsewhere on the athenaHealth site it is indicated that 24/7 emergency support is available, and there is available comprehensive onboarding, along with continued training.",
    "AthenaHealth is not transparent about the pricing, and has no information on their website on what the actual costs will be for their service, including the athenaCollector component. Rather than giving the pricing, even in broad form, there is a link to “Schedule a 1:1 Meeting,” and we think most users would prefer some information up front to decide if the costs make sense for their practice- or not. We also found a report that a practice was unable to obtain pricing without first sitting through a 30 minutes sales presentation.",
    "Elsewhere, we gleaned the pricing of the service to be 4% to 7% of the practice’s revenue.",
    "AthenaCollector is a worthy component of the athenaOne suite, endowing it with a number of important capabilities which include the ability to check insurance eligibility prior to office visits, a Claims Management system designed to decrease rejections, and robust revenue cycle management.",
    "The downsides do give us pause for concern, with a lack of mobile apps, multiple complaints centering around user support issues, and opaque pricing with a report of being charged for technical support. While there are plenty of benefits to athenaCollectors, the large number of user complaints across a wide variety of issues does give us hesitation in recommending it."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "8": "Support",
    "12": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software",
    "athenaClinicals": "https://www.techradar.com/reviews/athenahealth",
    "athenaCollector": "https://www.athenahealth.com/healthcare-technology/practice-management-software",
    "Schedule a 1:1 Meeting": "https://www.athenahealth.com/healthcare-technology/practice-management-software"
  }
}