{
  "source": "https://www.techradar.com/reviews/oando-diskimage-16",
  "title": "O&O DiskImage 16 review",
  "category": "computing",
  "updated": "2020-11-06T04:08:00Z",
  "author": "michael-graw",
  "summary": "Advanced disk cloning for PCs",
  "verdict": "O&O DiskImage is a powerful disk cloning software for Windows with compression, file splitting, and encryption tools. The only thing missing is a backup scheduler.",
  "pros": [
    "Create bootable media",
    "Encrypt your backups",
    "Easy to use"
  ],
  "cons": [
    "No backup scheduler",
    "Messy user interface"
  ],
  "article": [
    "If you’re looking for the best disk cloning software for Windows, O&O DiskImage 16 should be in the running. This PC cloning tool is capable of running complete, incremental, and one-click backups and works with a wide variety of file types. Plus, O&O DiskImage 16 enables you to easily create a recovery disk so that you can boot a computer with an unresponsive operating system and restore the hard disk in just one step.",
    "In our O&O DiskImage 16 review, we’ll take a closer look at everything this disk cloning tool offers to help you decide whether it’s right for you.",
    "O&O DiskImage 16 costs $49.95 one-time for a single PC license. You can also purchase a license for up to five PCs for $69.95. Before you commit, you can try out the software for 30 days.",
    "O&O DiskImage 16 is packed with features that make it easier to keep your hard drive backed up or to migrate from one disk to another. To start, the software enables you to copy any HDD, SSD, or remote drive connected to your computer. You can also use incremental backups to minimize the total amount of data that needs to be copied.",
    "One of the best things about this cloning software is that it can also be used to quickly create a bootable drive on a USB stick or external hard drive. This can be put onto the same drive as your hard disk image, essentially enabling you to restore both an operating system and all of your data to a wiped or nonresponsive computer at the same time.",
    "Of course, O&O DiskImage 16 also supports disk to disk cloning. This can be run as a background process without restarting your computer, so it’s relatively fast to clone an HDD to an SSD.",
    "The only notable feature missing from this platform is a task scheduler. You can set up multiple jobs to run in a sequence, which is helpful, but there isn’t a straightforward way to schedule disk backups. If you need a scheduling command, such as for running backups overnight, you may want to consider another disk cloning software.",
    "O&O DiskImage 16 is only available for Windows computers and the desktop app resembles the aesthetic of Windows File Explorer. The tabbed menu can be a little bit crowded, but we appreciated that the software displays connected drives in a graphical interface that makes it easy to keep track of your disk partitions. There’s also an easy to navigate home screen that displays all of the most common backup and restore tasks.",
    "One of the things to keep in mind about this software is that many of the options are hidden behind a settings button. For example, when you go to image a drive, the Imaging Options menu item reveals settings for excluding specific file types from the backup, changing the compression level, or splitting the disk image into multiple smaller files. Helpfully, you can save any combination of settings as a profile for quickly running a similar disk imaging process in the future.",
    "We tested out O&O DiskImage 16 on a 100 GB SSD and found that the imaging process was fairly quick. Copying the SSD to an external HDD without compression took just over 23 minutes.",
    "O&O software provides support only for licensed users, not for the software trial. You can get in touch with the company by email and expect a response within one to two business days. If you’re willing to dive into the software’s documentation, the company provides a detailed user manual that is over 200 pages long.",
    "O&O DiskImage 16 offers the option to add 128-bit, 192-bit, or 256-bit AES encryption to your disk images when creating backups. This is not enabled by default and you’ll need to sift through the backup options menu in order to add encryption. Of course, the software will also prompt you for your encryption password when restoring protected disk images.",
    "O&O DiskImage 16 offers nearly all the same features as other top-tier PC cloning software. But, if you don’t mind losing out on advanced options and encryption, you might want to consider DriveImage XML from Runtime Software. This software is much more limited than DiskImage 16, but it’s free to use for personal use and offers scheduled backups to help keep your drive images up to date.",
    "O&O DiskImage 16 is a powerful disk cloning software with a lot to offer. The platform is capable of creating bootable media, imaging your entire computer in a single click, and quickly imaging one drive onto another. While the interface can be a little bit messy, you have access to a wealth of settings for compression, file splitting, and encryption with every backup. The only feature that this software is missing is a backup scheduler, but this shouldn’t detract from its utility all that much."
  ],
  "headers": {
    "2": "Plans and pricing",
    "3": "Features",
    "7": "Interface and in use",
    "10": "Support",
    "11": "Security",
    "12": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "best disk cloning software": "https://www.techradar.com/best/best-disk-cloning-software",
    "O&O DiskImage 16": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1282864903468359000/https://www.oo-software.com/en/diskimage-backup-your-data",
    "single PC license": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1308457818325850000/https://shop.oo-software.com/36/purl-home?cart=228808&language=en&x-src=bnr19",
    "DriveImage XML": "https://www.runtime.org/driveimage-xml.htm"
  }
}