{
  "source": "https://www.techradar.com/reviews/oppo-watch-review",
  "title": "Oppo Watch review",
  "category": "wearables",
  "updated": "2020-08-10T15:12:31Z",
  "author": "aakash-jhaveri",
  "summary": "The Oppo Watch is an impressive debut Wear OS watch",
  "verdict": "The Oppo Watch is one of the best Wear OS smartwatches money can buy. While that isn't a particularly laudable achievement, its craftsmanship and hardware-software synergy is commendable. It does ape the Apple Watch's design, but there's a lot to like here in terms of its impressive display and fitness modes. Just be wary of the battery life, especially if you want a watch that lasts for days.",
  "pros": [
    "Slick design",
    "Great display",
    "Runs smoothly"
  ],
  "cons": [
    "Battery life is poor",
    "Unoriginal design",
    "Wear OS is still limited"
  ],
  "article": [
    "The Oppo Watch is a great example of what manufacturers can achieve with the right efforts in both hardware and software. Even if its look is uninspired, there’s credit due for how well-executed the curved display - and this smartwatch as a whole - is.",
    "If you’re specifically looking for a Wear OS smartwatch, the Oppo Watch is an easy recommendation. If you're not wedded to the Wear OS platform, it may be a harder sell as you've got alternatives from Fitbit or Samsung.",
    "The Wear OS platform as a whole hasn't changed fundamentally in the last six years, but it has gently improved and Oppo's first foray into that world has provided a unique look while harnessing the highlights of the software.",
    "The Oppo Watch offers some of the best functionality we've seen from a watch running Google's software. Its fitness features are suitable for all, there's enough power here to run every app you'll need and there are a few added extras from Oppo too.",
    "You'll want to consider its average at best battery life when you're thinking about buying this, but if you don't mind recharging your watch each night you're unlikely to be regularly frustrated.",
    "The design may be uninspired and look remarkably similar to the Apple Watch, but it still looks attractive and if you want a square device with a curved display this will be your only choice on your Android phone.",
    "The Oppo Watch was unveiled on March 6, 2020, alongside the Oppo Find X2 and Find X2 Pro at an event hosted by the company in place of its show at Mobile World Congress.",
    "The Oppo Watch is on sale now in India, and it's set to come out in the UK at some point in October. TechRadar asked Oppo whether the device would be coming to the US, and a spokesperson told us there’s “no plan to make it available in the US at this time”.",
    "Oppo has yet to say whether the device will be coming to Australia.",
    "The Oppo Watch price is £229 / Rs 14,990 (around $300, AU$420) for the 41mm variant. If you want want the larger 46mm watch, it'll cost £369 / Rs 19,990 (around $480, AU$670).",
    "Oppo has also said it plans to release a 46mm LTE-ready version of the watch, but we've yet to have pricing confirmation or where it'll be landing.",
    "Let’s address the elephant in the room first. Yes, the Oppo Watch looks every bit like an Apple Watch. The similarities extend to the body, straps and the fascia as well. To the untrained eye, the slightly more curved display might not be unnoticeable.",
    "Wannabe Apple products are nothing new in the consumer tech space, and whether that’s a pro or a con will depend on your preferences.",
    "What you need to know is that the Oppo Watch is almost as sleek and strong as Apple’s wearable. It doesn’t seem fragile from any side, and all the curves meet seamlessly.",
    "You also need to know that this review used the 46mm version of the watch. There are two sizes depending on how big you want your watch to be, and there are some core differences here.",
    "For the rest of this review, we'll be referring to our time with the 46mm variant of the watch so if you opt for the smaller 41mm device you may find some slight differences.",
    "The weight distribution is just right to not feel like a toy. The frame is made of series-6000 aluminium and has held up well with our relatively carefree use. Along with the Black variant that we tested, there’s also a Glossy Gold finish available. The 41mm variant of the watch adds a third Silver Mist color.",
    "Skinnier people usually have to for the smaller dial variants for the watch to not look comically big on their wrists. The Oppo Watch is a rare exception for that rule as the 1.91-inch display actually curves on the sides, making it a tad smaller in appearance, but significantly smaller for how you use it.",
    "Even the Fluororubber band has ample holes to cover wrists of all sizes. It is very similar to the Apple Watch silicone strap with just a bit more rigidity. That hardness also makes it a little more difficult to put on, especially as you approach the holes closer to the chassis.",
    "If you like your phone displays to be curved, you’ll love what a curved watch brings to the table. Firstly, it looks undeniably cooler than other watches with a similarly minimal design.",
    "That’s an important aspect as watches also act as fashion accessories. It still looks like a computer slapped on to your wrist but blends in with most attires. Secondly, it makes every interaction with the watch a lot more enjoyable and smooth.",
    "For an operating system that primarily depends on swipes from the sides, there’s probably no other smartwatch that feels as well-designed as Oppo’s. Tip-toeing between form and function, we also have the improved visual experience and higher screen-to-body ratio, adding the last bit of oomph.",
    "It is also 5ATM water-resistant, rated to be safe at pressure levels equivalent to 50 meters underwater. As always, the certification isn't applicable to salt water.",
    "The left side houses the loudspeaker while the right has the two pushers for functions and navigation. The button on the bottom has a subtle green accent for added character.",
    "By default, it launches the fitness suite but its function can also be customized. We miss the rotating crowns and bezels that some of its competitors offer, but the otherwise swift interface makes up for that.",
    "The display has a resolution of 402 x 476 (326ppi) which is one of the highest on any wearable. Text and icons were adequately sharp and clear and you will not be able to see the individual pixels at standard viewing distances.",
    "The AMOLED construction of the panel also adds another level of immersion as the sides fade away in the frame with no discernible edge or bezel. Colors are vibrant and punchy and stand out beautifully amid the inky black background.",
    "There are five stages of brightness to choose from. For our use, which is predominantly indoors at the moment, even the second level was adequate. We didn't find outdoor legibility to be an issue, either.",
    "Unless you’re looking for a circular dial that mimics a traditional timepiece, this is the best display you can get on a smartwatch for its sharpness, colors and contours. If we were to nitpick, then the black parts of the edges of the display don’t entirely shut down as OLEDs inherently should, but you’ll notice this only in the darkest environments.",
    "This is likely due to the limitations in the distribution of backlight zones across the curved edges.",
    "For years, Android wearables have struggled with inconsistent performance and frequent lags. The only exception was the new crop of Samsung watches, which ran on Tizen OS and Exynos silicon. The same level of fluidity was rare on Wear OS. While I am glad to report that the Oppo Watch scores high in this regard, it does expose additional issues plaguing the platform.",
    "Oppo’s implementation includes using a dual-chip system — the Qualcomm Snapdragon Wear 3100 for the complete functionality and an Ambiq Apollo 3 chipset for the battery saver mode.",
    "Most of the usage will be in the former scenario, as that is primarily why you should even consider a smartwatch. The Snapdragon Wear 3100 platform is nearly two years old at this point. It got a much-needed revamp in the form of the Snapdragon Wear 4100 this year, but is yet to be included in any on sale smartwatch (at the time of writing) so it hasn't been included here.",
    "By design, Wear OS is notorious for being heavy on the RAM than on the chipset. Thankfully, the Oppo Watch ships with an entire 1GB of it. The combination makes operations extremely smooth and responsive, which is still a rare feat for Wear OS watches.",
    "It wakes from sleep promptly, responds to taps and slides quickly and doesn’t spend too much time loading. In terms of performance, we finally have a Wear OS watch that deserves to be on the podium. Though, all is not rosy here as this performance comes with battery life implications.",
    "The Oppo Watch is one of the first smartwatches to run a forked version of Wear OS, with Color OS customizations on top. It’s smartly executed too - leaving the essentials that work well as they are, and changing only the features that could do with a facelift.",
    "This is mainly seen in two places: the notification shade on the top, which borrows the color scheme and iconography from Oppo's namesake for smartphones, and the app drawer.",
    "Gone is the basic 'Rolodex' list of apps in favor of a 3x3 grid of round icons, and we'd say both of these changes are welcome.",
    "For the uninitiated, here’s what the rest of Wear OS is like. The screen on the left is reserved for Google Assistant and Discover, a swipe upwards brings up the current notifications, and swipe right for widgets.",
    "The quick toggles on the top include all the essentials such as sound profiles, theater mode, lock, flashlight mode, find my phone and brightness control. We found all of these to be self-explanatory, and they're easy to identify with universal icons.",
    "You also get the staple Wear OS gestures to navigate through pages. A flick in either direction can scroll up or down and a shake to go back to the home screen. On the topic of the home screen, the Oppo Watch comes with a handful of watch faces with varying quantity of complications.",
    "Without going too deep about the similarities with Apple’s watchOS, you can choose from a selection that prioritizes fitness, media controls, battery stats or the weather.",
    "There’s also an option in the companion app for the watch face to be automatically matched with your attire if you submit a picture. It doesn’t always work but it looks cool. As with Android, if you do not like the default options provided by the watch, you can always download more from the Google Play Store.",
    "Wear OS is a pretty mature operating system now. It can achieve more than most other smartwatches designed for Android phones, but it can often seem a little restricted. For example, owning this watch doesn't increase the functionality of your phone or integrate into an ecosystem the way Apple and Samsung watches do.",
    "Looking at trends, it doesn’t seem Wear OS is a high priority for Google currently. It’s not particularly bad, but just keep your expectations in check if you haven’t used a Wear OS watch yet.",
    "It handles notifications contextually and admirably. For example, a text message via any app will be greeted with quick replies at your fingertips along with the ability to dictate, type, scribble the reply or even draw emojis.",
    "Yes, typing on this tiny screen isn’t great but it works surprisingly well, especially with swipe typing.",
    "Google Assistant is also around to quickly lookup information or launch apps. You also get media controls as soon as any music or video is played on the phone. You can control the playback, skip tracks and even control the volume.",
    "Fitness is another aspect that the Oppo Watch handles well. For starters, it has a heart-rate monitor on the back that regularly checks your pulse and keeps track. It can also alert you of any unusual or high readings. GPS is also inbuilt to track your runs or cycles.",
    "Everyone’s favorite sedentary alert also makes the cut, and even offers to take us through a rather long session of stretches every hour.",
    "Google Fit brings close to a hundred exercise tracking options and now even includes sports. This includes quite a few water sports such as standup paddle boarding and kite surfing, but you shouldn’t take your fancy watch near seawater.",
    "If these weren’t enough, the Oppo Watch also suggests downloading the HeyTap Health app. Unlike what the name suggests, it acts as a hub for a lot of features of the watch.",
    "It brings five specially developed workout routines: fitness run, fat burn run, outdoor walk, outdoor cycling and swimming. Upon selecting these, you’ll be taken through a set of instructions as well as target heart rate. These additions make the Oppo Watch a nifty workout companion - it has something to offer for users of all levels. All exercises, heart-rate monitoring and the pedometer seemed to work with reasonable accuracy.",
    "The watch also offers sleep tracking functionality. It gives you a breakdown of your sleeping patterns with fluctuations between light and deep sleep. It too seemed to be on point with my observations. Oddly though, it tracks sleep only between 8 pm and 10 am. That should cover almost everyone, but we’re not judging.",
    "Calls can also be answered on the watch when it is connected to your phone. People on the other side could hear us just fine as could we. The volume is a little low, so might have to bring it closer to your face for calls done outdoors. Shorter conversations will pose no issues.",
    "An LTE variant of the watch with eSIM capabilities will also be available in some markets but we've yet to test this.",
    "The Oppo Watch runs off a relatively large 430mAh battery. However, the battery life is subpar even with moderate use. Even on lighter days with very few notifications and music control, we struggled to get it to last the 36 hours that Oppo claims it will do.",
    "It was closer to 20 hours on most charges. You could make it last through the day, but we recommend visiting the charger each night.",
    "You do have the option to switch to the aforementioned Power Saver mode, which is supposed to add 20 days to the tank. We didn’t really use it much except when we needed it to pull through for a few hours.",
    "It will switch to a simpler watch face that runs at a lower refresh rate and will continue to display the time, track the number of steps and pulse and handle basic notifications.",
    "Oppo’s popular VOOC Flash charging is here to take care of the refueling. It can go from near-empty to full in a little over an hour, with most of the charging happening in the initial half. You will need to use the included cradle for juicing up as wireless charging is not supported.",
    "Note that this all applies to the larger variant of the Oppo Watch, and the smaller 41mm device comes with a smaller 300mAh cell inside. It has less spec to power though, so we're currently unclear how that battery life will perform.",
    "First reviewed: August 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Oppo Watch price and release date",
    "11": "Design and display",
    "30": "Performance and software",
    "48": "Fitness",
    "56": "Battery life",
    "62": "Don't buy it if..."
  },
  "links": {
    "Wear OS smartwatch": "https://www.techradar.com/news/best-wear-os-watch",
    "Oppo Find X2": "https://www.techradar.com/reviews/oppo-find-x2-review",
    "Find X2 Pro": "https://www.techradar.com/reviews/oppo-find-x2-pro-review",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Color OS": "https://www.techradar.com/news/coloros-7-new-features-rollout-timeline-and-which-devices-will-receive-it"
  }
}