{
  "source": "https://www.techradar.com/reviews/bang-and-olufsen-beosound-a1-2nd-gen",
  "title": "Bang & Olufsen Beosound A1 (2nd Gen) review",
  "category": "audio-visual",
  "updated": "2020-07-06T14:24:21Z",
  "author": "jennifer-allen",
  "summary": "B&O demonstrates that good things come in small packages",
  "verdict": "Visually near imperceptible from the original A1, the Bang & Olufsen Beosound A1 (2nd Gen) is an appealing and highly portable Bluetooth speaker. It somehow throws in flawed Alexa support despite being a solely Bluetooth speaker. It's not perfect but for those that want both style and substance, there's a lot to like here.",
  "pros": [
    "Crisp sound quality",
    "Lightweight design",
    "Waterproof"
  ],
  "cons": [
    "Flawed Alexa support",
    "Not rugged enough for outdoor use",
    "Buttons are tricky to find"
  ],
  "article": [
    "Bang and Olufsen has a strong reputation, so much so that even those who don't know much about speakers know that it's a good brand to purchase from. Back in 2016, it launched its smallest and most affordable Bluetooth speaker, the Beosound A1, and now we've reached the second generation edition of the same speaker.",
    "At a glance, you'd think you were holding the same portable speaker as before with only some minor visual changes, but underneath the hood, there are some hefty improvements that make this an appealing package for most.",
    "Crucially, there's Alexa support here – something that's quite unusual for a Bluetooth only speaker. More on how that works without Wi-Fi later, but it's certainly an interesting twist on the smart speaker.",
    "Elsewhere, one of the delights about the B&O Beosound A1 is its looks. It looks gorgeous and would easily slot into any home, while also being very easy to move between rooms because, ultimately, it's made to be moved around.",
    "Fortunately, it's not style over substance either, with the B&O Beosound A1 delivering fantastic audio quality, with a consistently crisp sound. Whether you're listening to the latest from The Weeknd or Billie Eilish, or listening to some classical music, the Beosound A1 simply sounds great. You'll be impressed at how every instrument stands out, even if the soundstage of this mini speaker shines best in a smaller room than some beefier-looking specimens.",
    "Ultimately, we were impressed with the B&O Beosound A1. A marked improvement over its predecessor, there's better battery life, and waterproofing, although we're not so sure how much we'd like to take it outside the home. Alexa support is a bit poor for reasons we'll go into in our full review below, but the Beosound A1 is still a fine example of why Bang & Olufsen's good reputation precedes it.",
    "Launched on May 14, 2020, the B&O Beosound A1 comes with a recommended retail price of $250 / £200. That works out at around AU$360, though we're still waiting on official Australian pricing.",
    "Don't expect discounts just yet as it's a brand new device. Be careful to look out for whether you're buying a first or second generation unit as there are considerable discounts for the former now, but you'll miss out on some key features.",
    "Two colors are available - Black Anthracite and Grey Mist. Both look pretty stylish and the kind of thing you could easily slip into your living room setup.",
    "B&O usually do a good job of designing attractive speakers and that's certainly the case here. With a metallic casing, the B&O Beosound A1 is a circular disc of a device being a little slimmer and lighter than its first generation predecessor.",
    "Attached to one side is a leather carrying strap with a Bang and Olufsen adorned toggle for adjustments. It makes it easy to grab as well as hook onto things for safety when on the move.",
    "It all looks suitably classy, which means we would hate to chip it or damage it accidentally. While the IP67 certified waterproofing of the B&O Beosound A1 makes it suitable for outdoor use, we're not convinced we'd fancy its chances on a muddy hike. This is a waterproof speaker to leave by the pool rather than take anywhere off the beaten path.",
    "All the controls are around the outside of the speaker. There are buttons for power, Bluetooth, microphone, as well as volume, along with a USB-C charging port too.",
    "Annoyingly, the buttons aren't raised or tactile in any way. That means they look great but if you're fumbling in the dark to adjust something, you won't be able to see what you're doing.",
    "The revamped B&O Beosound A1 has a 3.5-inch woofer along with a 0.6-inch tweeter, and it's powered by two 30W Class D amplifiers. As well as that, the grille has a slightly different hole pattern to its predecessor.",
    "OK, so we're not sure if that makes a huge difference to the sound, but the rest of the specs bode well for a strong audio performance. It also now supports Qualcomm's aptX Adaptive codec, although bear in mind that your smartphone might not.",
    "Bang & Olufsen recommends the speaker for small social gatherings, offices or mid-sized rooms, and that sounds about right to us. Its soundstage is suitably impressive in a relatively small room, delivering the sense of 360 degrees of music. Go outside or into a much larger room however, and you'll realize that size does matter – or at least you'll wish you had two of these. Back to the living room and the B&O Beosound A1 sounds a delight.",
    "It's consistently crisp. We found ourselves enjoying our favorite songs as if we were listening to them for the first time. Tracks like The Weeknd's Blinding Light sound exciting, punchy and energetic, with the likes of Childish Gambino's Feels Like Summer sounding smooth and detailed.",
    "That trend continued with older hits like The Beach Boys' God Only Knows, with each instrument sounding distinctive and sharp. In reassuring contrast, Yaeji's Raingurl sounded surprisingly thumpy in the bass frequencies, but in a good way that makes you want to at least tap to the beat. Simply put, everything sounded devoid of grain or harshness, with a strong, powerful performance.",
    "The soundstage could maybe feel a bit wider, but you'll only really notice this in a large space. In the bathroom, bedroom, or a medium sized living room, the B&O Beosound A1 easily captures your attention.",
    "We can only imagine pairing it up with a second device for stereo sound would counteract these soundstage issues very well.",
    "It's always satisfying feeling like you're rediscovering music with a new speaker and the B&O Beosound A1 has that sense of delight to it.",
    "The B&O Beosound A1 supports Bluetooth 5.1 which is immediately welcome, thanks to further pairing distances, which are sure to come in handy if you've got a big room or outdoor space for using it in.",
    "Bluetooth 5.1 also allows for better battery life with B&O claiming 18 hours of playback at a \"typical\" volume, with even more possible at a lower volume.",
    "In our tests, we found that about right although mileage definitely varies when you increase the sound to very high levels. Still, that's not bad at all and it recharges quickly too, thanks to the USB-C connectivity.",
    "Don't expect anything more complicated than the USB-C port. There's no place for a 3.5mm AUX-in port, for instance. That keeps the B&O Beosound A1 sleek and minimalist, but you might find yourself wishing for an extra option for connectivity, particularly if you prefer the stability of wired playback.",
    "Perhaps the biggest feature here is the aforementioned Alexa support, despite the Beosound A1 being a solely Bluetooth-connected speaker.",
    "B&O states it's a world first for a Bluetooth speaker to offer Alexa without Wi-Fi support. Of course, it does still rely on Wi-Fi (rather than magic, we assume) but that comes via the smartphone that you have connected to the speaker.",
    "It's simple enough to set up but it's flawed. Besides the obvious drawbacks to needing to keep the speaker within range of the phone (although Bluetooth 5.1 helps there), it's a little slower than a direct response.",
    "We also found that despite the three-microphone array, the B&O Beosound A1 isn't always the most responsive to the 'Alexa' wake word. This isn't a speaker to buy if Alexa support is vital, but it's a neat bonus, and it means that it can double up as a smart speaker you can use to control your smart home devices.",
    "The B&O Beosound A1 ties into the B&O app fairly well. You can adjust volume, switch Alexa support on or off, as well as tweak listening modes via an equalizer.",
    "This means even if you're not technically minded, you can still immediately notice the difference between presets like Ambient, Party, and Speaker. It's possible to customize these too ,to get the sound just how you like it. There's also the option to pair two A1 speakers together for stereo sound, although you can't do this with an older first generation device, sadly.",
    "First reviewed: June 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Beosound A1 (2nd gen) price and release date",
    "9": "Design",
    "14": "Audio performance",
    "22": "Battery life and connectivity",
    "26": "Alexa support and app",
    "32": "Don't buy it if..."
  },
  "links": {
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Beosound A1": "https://www.techradar.com/news/should-i-buy-the-bang-olufsen-beoplay-a1-bluetooth-speaker",
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "waterproof speaker": "https://www.techradar.com/news/best-waterproof-speaker",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices"
  }
}