{
  "source": "https://www.techradar.com/reviews/ghost-path",
  "title": "Ghost Path VPN review",
  "category": "computing",
  "updated": "2020-10-20T15:48:10Z",
  "author": "sead-fadilpasic",
  "summary": "Very fast and consistent performer",
  "verdict": "Ghost Path performs great in terms of speeds, unblocking streaming services, low prices, and money-back policy but its server network is very limited, it doesn’t have native apps for mobile devices, and there are some privacy issues.",
  "pros": [
    "Unblocks Netflix and BBC iPlayer",
    "Excellent speeds and stable connection",
    "Isn’t expensive",
    "30-day money-back guarantee"
  ],
  "cons": [
    "No mobile apps",
    "Small server network",
    "Located in the US",
    "Customer support is a bit sluggish"
  ],
  "article": [
    "Ghost Path is a VPN service that aims to “protect your private data, stop hackers, and bypass geographic restrictions on all your devices”, all under very acceptable rates and excellent speeds.",
    "However, we have encountered some issues that make it a slightly inferior solution to today’s best VPN solutions.",
    "Ghost Path keeps things simple in terms of subscription choices. There’s only one package that can be purchased either as a monthly or yearly option. The monthly will cost you $7/month, while the yearly comes with an excellent discount - only $2.92/month or $35 billed annually. Users can run this VPN service on up to five devices simultaneously under one account.",
    "There’s no free trial, at least not in the traditional sense, but the 30-day money-back guarantee can be used in its stead. The vendor accepts credit cards, Paypal, and Bitcoin payments, as well as money orders and cash payments by mail.",
    "Ghost Path does have some shortcomings that you won’t find among its competitors, such as its location. ExpressVPN, NordVPN, CyberGhost, and Surfshark, for instance, are all located outside of the jurisdictions that might demand from them to hand over your personal data and/or logs, as well as featuring much larger server networks and apps for all devices.",
    "If your primary reason for getting a VPN is access to popular streaming channels blocked in certain areas, then you’ll be happy to know that Ghost Path unblocks Netflix, Hulu, BBC iPlayer, ITV Hub, and more, as well as providing good enough download speeds so you can stream all you want with no problems.",
    "The company running Ghost Path is based in the state of Georgia, in the United States. At the moment, it operates around 140 server locations in 52 countries and each server has 1-4 IP addresses that are assigned based on the current load. The countries in which this provider has servers include Chile, Hong Kong, Iceland, Israel, Panama, Russia, and so on.",
    "Ghost Path provides protection of your privacy with the deployment of 256-bit AES encryption, DNS/IPv6 leak protection, and other useful tools, such as a kill switch. A kill switch activates whenever there’s an interruption in your VPN connection, shutting down your Internet access until it’s safe again, thus preventing any of your private data from leaking.",
    "The platform also uses Plex multi-hop connections which direct your traffic to the VPN gateway of your choosing, as well as “bouncing around the provider’s network and connecting to at least one other server before out [sic] to the public Internet and coming back to you”. According to the provider, this prevents anyone eavesdropping on its VPN gateways from distinguishing or tracking a single user’s data as it crosses its network.",
    "The Ghost Path VPN clients utilize OpenVPN connections, as well as supporting PPTP as a solid backup option when OpenVPN isn’t available, such as on mobile devices.",
    "This VPN vendor is torrent and P2P friendly, although you should be careful since its location is the USA, a jurisdiction that takes copyright infringement seriously but privacy not so much.",
    "Ghost Path says it doesn’t keep logs or monitor your activity, ever, specifying that it doesn’t log any data related to your VPN sessions. However, this is impossible to prove unless it brings in an independent auditor to confirm it.",
    "Also, we found its privacy policy slightly problematic in the part where it says that it “may release personal information when we believe in good faith that release is necessary to comply with a law; to enforce or apply our Terms of Service and other policies; or to protect the rights, property, or safety of Ghost Path, our employees, our users, or others. This includes exchanging information with other companies and organizations for fraud protection and credit risk reduction.” So, your personal information, including name, email address, credit card, and other billing information, may still be shared with other parties in certain situations.",
    "You can use Ghost Path VPN on Windows, Mac, and Linux computers, iOS and Android smartphones, as well as wireless routers. Windows and Mac clients can be downloaded from your members’ area once you sign up for the service. However, you’ll need to manually enable the service on other supported platforms.",
    "To help you out with this and other things related to the use of its VPN, Ghost Path has a support section featuring about two dozen articles covering VPN basics, setup instructions, and troubleshooting.",
    "If the articles in the help center fail to address your concern, then contacting the customer support should be your next step. This is possible via chat, web form, email, or even leaving a message on a telephone number. Do note that when we contacted the support via chat, we got an automatic response that “Ghost Path typically replies in a few hours”, so you’ll need to arm yourself with patience. We got our reply after 5 hours.",
    "Ghost Path provides very high download speeds. Connecting to a server in Warsaw, Poland gave us a very strong 35Mbps on a 65Mbps testing connection. Although this location is close to us physically, the speeds didn’t disappoint for servers further away, either. For instance, the server in Vancouver, Canada delivered slower, yet still a very good 18Mbps.",
    "You can view all the servers inside the app, along with their physical distance from you, as well as run detailed speed tests to see which of the servers are ideal for your connection. Switching between servers is easy - just go to the server list and double click on whichever you want to connect to, even if you’re already connected to one.",
    "Ghost Path is an inexpensive VPN service that can be used for anonymous browsing and accessing popular VOD channels at high speeds. However, it doesn’t have mobile apps, its server network is very small, and there are some concerns over the privacy of your personal information.",
    "If you’d like to avoid these issues and don’t mind paying the price, then a top-of-the-line VPN service such as ExpressVPN is the best choice."
  ],
  "headers": {
    "2": "Price",
    "4": "Alternatives",
    "5": "Streaming",
    "6": "About the company",
    "7": "Privacy and encryption",
    "13": "Support",
    "16": "Speed and experience",
    "18": "Verdict"
  },
  "links": {
    "Ghost Path": "https://ghostpath.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "privacy policy": "https://ghostpath.com/privacy",
    "email": "mailto:help@ghostpath.com",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-6622088602765906000"
  }
}