{
  "source": "https://www.techradar.com/reviews/moto-e6s-review",
  "title": "Moto E6s review",
  "category": "phones",
  "updated": "2020-05-13T13:13:51Z",
  "author": "david-nield",
  "summary": "The Moto E6s is a solid phone at an excellent price",
  "verdict": "You usually get what you pay for when it comes to smartphones, but the Moto E6s exceeds expectations for a phone with this price tag. Don't expect miracles at this price, but the Moto E6s manages to reach respectability in all the areas that matter most.",
  "pros": [
    "Low, low price",
    "Appealing design",
    "Headphone jack"
  ],
  "cons": [
    "So-so camera",
    "Sluggish performance",
    "No NFC"
  ],
  "article": [
    "The Moto E6s takes the 'budget' label just about as far as it can go, even for a brand like Motorola – one of the first names we think of when it comes to budget Android phones that manage to offer decent value, successfully mixing low prices with respectable performance.",
    "You can get this phone for a penny under £100 in the UK (that's roughly $125 or AU$190, though as yet we haven't heard anything about a US or Australia launch). In other words, the very affordable iPhone SE 2020 costs four times as much, and the Moto E6s costs a tenth of the starting price of a Samsung Galaxy S20 Plus.",
    "This is one of the cheapest smartphones around full stop, and everything else in this review has to be weighed against that. The less expensive end of the market is more competitive than ever, but Motorola has still managed to undercut almost everyone on price.",
    "In terms of specs and price, this is very similar to the Moto E6 Plus – a clear and logical phone hierarchy is not something you can always expect from Motorola – but this E6s model has an inferior selfie camera and doesn't offer the 64GB storage option.",
    "You haven't forgotten the low, low price of this phone yet have you? Because we're going to keep mentioning it. For a handset that's as light on the wallet as this one, the Moto E6s doesn't look bad at all, though you're not suddenly going to confuse it for a premium-level device.",
    "The 6.1-inch display leads the way, which is a sensible balance between being able to fit plenty on screen and actually being able to hold this in one hand. As is the norm on the last few Motorola phones we've tried, you get a basic plastic case in the box, which you can make use of if you want.",
    "We found the Moto E6s pleasingly comfortable to hold and to use – it's respectably thin at 8.5mm (0.33 inches) and respectably light at 160g (5.64 ounces). There's a lot of plastic here of course, but the build quality is still okay – it feels cheap, but not too cheap, and it's solidly put together.",
    "The bezels (and the teardrop notch) are noticeable, but not overly so, and it's really only the chin bezel that you can call thick. We really should mention the color of our review unit as well, a rather tasteful light-to-navy-blue gradient that Motorola is calling 'peacock blue' for whatever reason. A 'sunrise red' choice is also available.",
    "Around the back there's a fingerprint scanner, the dual-lens camera, and a rather oddly placed single speaker, but the Moto E6s just about gets away with it. The use of a micro USB port is disappointing but to be expected, while fans of wired headphones will be pleased to hear there's a 3.5mm audio jack here.",
    "The Moto E6s isn't going to win any design awards this year, but we've seen worse looking phones at higher price points in the past. It's not going to embarrass you in public, and it doesn't feel at all shoddy or fragile (it's protected against spills and splashes, but not complete submersion).",
    "The screen on the Moto E6s is fine, for the price (not sure if we've mentioned the price yet?) – you get a 6.1-inch, 19.5:9 aspect ratio LCD display running at a resolution of 720 x 1560 pixels, which ends up being acceptably sharp and acceptably spacious.",
    "There are phones with much bigger screens out there these days, but they're harder to stuff into a pocket.",
    "If you're happy to sacrifice a bit of Netflix or Disney Plus screen estate in return for more practicality, the Moto E6s is going to suit you well. We were still quite happy watching YouTube videos and surfing the web, and for a lot of people a 6.1-inch screen is going to be just right.",
    "The brightness and sharpness of the LCD panel is more than satisfactory, and you can adjust the color temperature of the screen if you need to (we didn't). Adaptive brightness options are available in the software too, so the screen can tweak its own brightness based on the ambient lighting.",
    "You're absolutely not going to confuse this for a OnePlus, Samsung or Apple display, but it's going to do the job for you. Motorola hasn't specified the refresh rate of the screen, but it's presumably 60Hz. This certainly won't be hitting the 90Hz or 120Hz rates of the best phones in the business – scrolling occasionally feels janky and slow, but it's not a massive issue.",
    "Whether it's day-to-day phone using or more dedicated uses like movie watching, the screen on the Moto E6s won't let you down. It would be wrong to expect a top-end panel on a phone at this price point, and you don't get anywhere near that, but we had no major complaints about it given what it costs."
  ],
  "headers": {
    "4": "Design",
    "10": "Screen"
  },
  "links": {
    "iPhone SE 2020": "https://www.techradar.com/reviews/iphone-se",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "more competitive than ever": "https://www.techradar.com/news/best-budget-smartphone",
    "Moto E6 Plus": "https://www.techradar.com/reviews/moto-e6-plus",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}