{
  "source": "https://www.techradar.com/reviews/amazon-chime",
  "title": "Amazon Chime review",
  "category": "computing",
  "updated": "2020-04-17T11:54:41Z",
  "author": "darcy-french",
  "summary": "Affordable yet simple video conferencing software",
  "verdict": "Amazon Chime is a reliable video conferencing platform but lacks the advanced features of its competitors.",
  "pros": [
    "Affordable",
    "Highly secure"
  ],
  "cons": [
    "Lacks advanced features",
    "Few businesses use the platform"
  ],
  "article": [
    "Chime is Amazon’s first major foray into the video conferencing market, but the platform has not yet achieved the wide-scale adoption the American tech giant would have hoped for. Whilst Chime’s video conferencing software performs admirably, it lacks the features of many of its competitors.",
    "In our Amazon Chime review, we discuss its strengths and weaknesses and suggest which companies should consider Chime as the best video conferencing software for their business needs.",
    "Amazon Chime operates on a pay-per-use model, meaning businesses can tailor costs to suit their individual needs. Pay per use also means that there are no contracts or upfront costs to begin using Amazon Chime. This is particularly beneficial for small businesses looking for an affordable video conferencing option.",
    "Basic features can be used for free, and include one-to-one calls and group messaging. However, there are also premium features that enable the user to schedule, host, and record calls of up to 250 people. The price for these features is $3/day/user or $15/month. If businesses want to use Chime’s dial-in or call-me services, extra charges apply. These range from approximately $0.002 user/minute in most countries to $0.05 in Spain or even $0.25 in China. Despite the complexity of Amazon Chime’s pricing, it is a highly affordable service.",
    "Amazon Chime’s premium features enable users to schedule, host, and record meetings of up to 250 people. Joining a meeting is simple and can be done with a single click, either from the application or using a custom meeting link. Users can also share their screen, choose which participant's videos to show, and chat and share files with other participants using Chime’s in-built chat functionalities.",
    "Although Amazon Chime offers many of the industry-standard video conferencing features, it doesn’t go far beyond this. The absence of live captioning is noticeable, as is the lack of participation tools such as polls or Q&As.",
    "However, Chime’s compatibility with Slack is a big plus, and the Amazon Chime Meetings App for Slack enables users to schedule and host calls directly from the Slack application.",
    "The Amazon Chime app is available on most desktop, laptop, and mobile devices, while a web-based application also exists. Downloading the app is simple, and is done through Amazon’s website or a device’s application store.",
    "When the app is opened for the first time, you will need to log in using an Amazon account. There is no in-app tutorial, but the software is simple to use.",
    "Once you are in the application, it is easy to add contacts and begin a call. However, it took me two minutes to find a shareable link for the meeting (hint: open meeting options and click meeting bridge info).",
    "The Amazon Chime desktop application is functional, but the user interface is basic. While this makes the application easy to navigate, it also makes it feel as though it is lacking in features. At times the application can be slow to react, and notifications sometimes take a few minutes to sync between devices.",
    "The mobile app is much cleaner, with a simple menu making it easy to navigate the app and access messages and call logs. We also found the mobile app to be more responsive when making a call than the desktop or web-based application.",
    "However, Chime’s video conferencing performs admirably, with no lag or audio distortion perceptible in a four-way call using Wi-Fi connections (approx. 30–50 Mbps). Screen sharing was easy, and a new participant joining the call was not disruptive for the other participants.",
    "Chime’s shared responsibility model is a useful framework for conceptualizing the security services that Amazon provides and the precautions businesses themselves should take in order to protect their data.",
    "When using Chime, administrators have great control over user accounts as well as the data that each user can access through the AWS Identity and Access Management (IAM) protocol. This is especially important for businesses that handle sensitive data.",
    "Finally, all Chime communications (text/video/audio) feature AES 256-bit encryption. This makes personal and professional data very secure when using Amazon Chime.",
    "Amazon Chime’s help center features numerous how-to articles written by Amazon representatives, as well as questions posed by customers and users of the platform. A number of end-user how-to videos are also published on Amazon’s website and were useful as we installed the application and got up to speed with its features.",
    "For more complicated issues, users need to contact Amazon Web Services through the AWS console (account required). On this console, we were able to submit a support request but were unable to speak immediately with a real person.",
    "The video conferencing market is becoming increasingly crowded, with most of the large tech companies releasing their own teleconferencing applications and many small players also competing. Chime is currently overshadowed by providers such as Microsoft Teams and Zoom, which offer more advanced features and boast larger user bases than it does.",
    "Zoom’s substantial market share makes it easier to collaborate across businesses, while organizations wanting a single solution for video conferencing and digital collaboration may want to consider Microsoft Teams due to the inclusion of Microsoft 365. However, Chime’s low cost is an advantage, as is its high levels of security, particularly compared to competitors such as Zoom, who have endured high-profile data security breaches.",
    "Amazon Chime is a solid software package for business teleconferencing, but little more than that. While its low price is an advantage, it offers few advanced features and is suited for businesses that want a reliable video conferencing solution without any of the bells and whistles.",
    "Security is also a plus with Chime, as Amazon is well regarded for its data security. Companies considering Chime can be sure that their data, as well as that of their employees, is secure. This gives the platform an advantage over many of its competitors."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features and utilities",
    "7": "Setup",
    "10": "Interface and performance",
    "13": "Security",
    "16": "Support",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Amazon Chime": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7655138882291592000&xs=1&url=https%3A%2F%2Faws.amazon.com%2Fchime%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Famazon-chime",
    "small businesses": "https://www.techradar.com/best/best-small-business-software",
    "share files": "https://www.techradar.com/best/best-apps-to-share-files-securely",
    "polls or Q&As": "https://www.techradar.com/best/best-qanda-and-polling-platforms",
    "desktop": "https://www.techradar.com/news/best-business-desktop-pcs",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "website": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Wi-Fi": "https://www.techradar.com/news/the-best-wi-fi-extenders",
    "shared responsibility model": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2451479156550471700&xs=1&url=https%3A%2F%2Faws.amazon.com%2Fcompliance%2Fshared-responsibility-model%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Famazon-chime",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "collaborate": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}