{
  "source": "https://www.techradar.com/reviews/benq-ew3280u",
  "title": "BenQ EW3280U professional monitor review",
  "category": "computing",
  "updated": "2020-04-14T11:52:35Z",
  "author": "jeremy-laird",
  "summary": "A mean 4K productivity and multimedia machine",
  "verdict": "BenQ’s latest 32-inch monitor is mean 4K productivity and multimedia machine with USB-C and HDR content support",
  "pros": [
    "Strong feature set",
    "Quality IPS panel",
    "USB-C connectivity"
  ],
  "cons": [
    "Not true HDR",
    "Tilt-only stand"
  ],
  "article": [
    "Monitors measuring 32 inches, offering full 4K and a few additional frills are quickly becoming the default option in the premium PC display market. Enter BenQ’s latest effort, the BenQ EW3280U.",
    "Along with the 32-inch and 4K boxes, it also ostensibly ticks the one marked ‘HDR’ thanks to VESA DisplayHDR400 certification for its IPS panel. Arguably more significantly, BenQ has also added USB-C connectivity with charging support to the mix, making this a well rounded overall proposition. Other notable frills include an IR remote control and integrated speakers that are intended to be more than just occasional.",
    "Broadly, the BenQ EW3280U falls in between the cheapest screens in this category, which typically lack HDR and USB-C support, while undercutting true professional grade content creation models. Time to find out if BenQ has successfully navigated a third way between those two extremes.",
    "Pricing for the BenQ EW3280U is a little variable across the usual online vendors, but kicks off at around $800 (£708 in the UK). That puts it on a very direct footing with the likes of the Philips Brilliance 329P9H. However, the BenQ EW3280U has the advantage of at least notional HDR support, plus wider color coverage.",
    "Immediate impressions of BenQ’s latest premium 4K panel reveal a mix of slim bezels on three sides of its 32-inch IPS panel and a prominent chin on the bottom. The latter slightly detracts from what would otherwise be a thoroughly contemporary design. But it’s there for a reason.",
    "That chin houses both an integrated sound bar, plus IR remote and ambient light sensors. The remote control is an arguably peripheral for a desktop monitor. However, for users who regularly switch modes, or if you intend to use the EW3280U’s speakers and thus adjust volume on a routine basis, it’s actually a very useful feature. For the record, the EW3280U also sports a low frequency speaker in the rear of the display to improve bass performance. It’s part of an audio setup designed by Trevolo that clearly aims to provide a much better experience than the norm.",
    "Another multimedia relevant feature is AMD’s FreeSync adaptive refresh. It gives the EW3280U a little gaming credibility, though the 4K resolution creates a huge load for any graphics card and the 60Hz fresh rate will limit its appeal to serious gamers. Still, it’s part of an overall package that ensures a broad remit for the BenQ EW3280U. It’s specified to be effective for everything from productivity, to entertainment and a little light content creation.",
    "Central to all that is the high quality 32-inch IPS panel. Along with the full 3,840 by 2,160 4K resolution, it also offers VESA DisplayHDR400 certification and BenQ’s own HDRi proprietary technology. The latter is best regarded as something of a re-spin of the DisplayHDR400 capability.",
    "In short, it is not true HDR, but a combination of wider color support and slightly increased brightness compared to a conventional SDR display, plus calibration to display HDR colors more accurately. There’s no local dimming and maximum brightness peaks at 400cd/m2, which is only marginally beyond the usual 300-350cd/m2 of a typical SDR panel.",
    "The BenQ EW3280U’s other key feature is USB-C connectivity with DisplayPort Alt mode. As with similar implementations, the main appeal is the ability to attach a laptop PC via a single cable to drive the display, charge the laptop and connect peripherals, including keyboard, mouse and storage. In the case of the EW3280U, charging power tops out at 60W, which will cover thin and light laptops through to moderately demanding desktop replacement systems.",
    "Overall, then, the BenQ EW3280U has plenty to offer. If there is an obvious disappointment, it involves the stand. Tilt-only adjustment is not what you’d expect for this class of display at this price point.",
    "Make no mistake, this is a vibrant, saturated monitor. BenQ’s default settings deliver a notably punchy and rich experience. Enable one of the simulated HDR modes via the HDRi submenu and that’s even more true.",
    "Whether it’s too much of a good thing, however, is another matter. Certainly, the HDRi functionality is of dubious practical merit. This is not a true HDR display by any stretch, thanks to a lack of local dimming capability, a panel contrast of 1000:1 and a peak brightness of 400cd/m2. To be clear, those are all decent numbers. They’re just not anywhere near what’s required for a true HDR experience.",
    "That said, the conventional HDR mode allows HDR content to be viewed with the correct color balance, which is a genuinely useful feature. And the VESA DisplayHDR400 certification ensures reasonably wide gamut support, notably that 95 per cent of DCI-P3 metric. Despite that, however, this is not a display optimized for serious content creation, such as for professional graphic design. It does not, for instance, offer presets for the sRGB or Adobe RGB spaces. With calibration it will turn its hand to content creation with reasonable aplomb, to be sure. But serious content professionals looking for a 32-inch 4K panel will need to look elsewhere - as well as spend a lot more money.",
    "Speaking of 4K and 32, inches it makes for a nice compromise between detail and usability. Running at 100 per cent scaling is viable for users with normal vision, neatly sidestepping the scaling issues that come with other DPI settings. Admittedly, the EW3280U’s pixel density of 137DPI is not spectacular. But it is an improvement over, for instance, a 27-inch 1440p panel, which clocks in at 109. So you’re getting both more screen real estate and more precision in that comparison.",
    "Anyway, thanks to the IPS panel, the BenQ EW3280U offers excellent viewing angles and with a little tweaking, nearly all users will be able to settle on a very pleasing overall setup. Factor in the 4K desktop area and it’s a great tool for productivity.",
    "As for the audio element, well, it’s certainly a cut above the usual PC monitor integrated speaker performance. But it’s still behind the experience you’d get with a decent bluetooth speaker or fairly cheap satellite-and-sub combo. If simplicity and space are at a premium, it’s a useful feature. If you really care about sound quality, you’ll still want to seek out some dedicated hardware.",
    "More unambiguously successful is the USB-C connectivity. As ever, it makes for fantastic ease of use with laptop PCs, enabling you to leave peripherals plugged in to the monitor as you come and go with your portable machine. On that note, the BenQ EW3280U will for the most part play as nicely with Apple MacBooks as it will Windows PCs via USB-C. However, the relatively low DPI means Apple’s MacOS won’t look as pretty on this display as a MacBook’s built-in Retina panel. As with all monitors of this size and resolution, fonts look just a little jagged.",
    "BenQ has given the EW3280U a pretty broad remit. For the most part, it delivers. For general productivity, this screen is an absolute beauty. It’s big, bold, offers loads of desktop space thanks to the 4K resolution, along with reasonable pixel density and precision.",
    "The USB-C connectivity is another unambiguous win and bestows a huge dollop of usability and practicality. The ‘premium’ integrated audio is also welcome where space is at a premium.",
    "Less immediately successful is the HDRi feature. It’s not comparable with true HDR. That said, thanks to VESA DisplayHDR400 certification, the EW3280U does offer HDR content support, which is certainly better than nothing. The only other obvious shortfall involves the tilt-only stand, which is disappointing at this price point.",
    "It’s not enough, however, to detract from what is a very appealing all-round display solution and a strong candidate as a long term investment to improve productivity and, frankly, viewing enjoyment."
  ],
  "headers": {
    "3": "Price and availability",
    "4": "Design and features",
    "11": "Performance",
    "18": "Verdict"
  },
  "links": {
    "Monitors": "https://www.techradar.com/news/best-business-monitor",
    "Philips Brilliance 329P9H": "https://www.techradar.com/reviews/philips-brilliance-329p9h",
    "desktop monitor": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "4K resolution": "https://www.techradar.com/news/best-4k-monitors",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "storage": "https://www.techradar.com/news/best-portable-ssd",
    "desktop": "https://www.techradar.com/news/best-business-desktop-pcs",
    "graphic design": "https://www.techradar.com/best/best-graphic-design-software",
    "bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Apple MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725"
  }
}