{
  "source": "https://www.techradar.com/reviews/philips-shp9600-open-back-headphones",
  "title": "Philips SHP9600 Open-Back Headphones review",
  "category": "audio-visual",
  "updated": "2020-10-06T02:20:06Z",
  "author": "nick-pino",
  "summary": "Philips’ new budget over-ears have solid sound but a bad build",
  "verdict": "The new Philips SHP9600 are affordable open-back headphones that please acoustically but aren’t well-built at all.",
  "pros": [
    "Light and comfortable",
    "Spacious sound",
    "Good bass response"
  ],
  "cons": [
    "Very budget build quality",
    "No playback controls",
    "Sound leakage"
  ],
  "article": [
    "Philips has always been a huge boon for the budget audiophile crowd, first with its SHP9500 and now with its newer SHP9600 open-back, over-ears.",
    "At just $129 (UK/AU price TBD), they’re affordable enough for novice listeners to stretch their ears but not so expensive that feel the need to keep them under lock and key.",
    "That being said, the tradeoff of these inexpensive over-ears is that the build quality is slightly less sturdy than we’d like to see in a pair of open-back cans and their clarity, while significantly better than most closed-back cans, could still be a hair more refined. For folks who want a little more bass than most other open-backs offer and much more clarity than your closed back cans produce, the SHP9600 are a good, affordable option.",
    "The Philips SHP9600 were released in September 2020 and come in at $129.99. Unfortunately they're exclusive to the US right now and don't have a UK or AU release date or price.",
    "In terms of open-back, over-ear headphones that’s on the lower-side - especially compared to the flagship Philips Fidelio X3 that cost over $300 - but the difference in materials and overall build quality is substantial. For most, we think the Philips SHP9500 is still a better pick considering their lower price point of $79.99, especially if you don’t mind a dip in the bass response.",
    "While open-backs can come in a number of different shapes and styles, Philips’ budget models are pretty straightforward: they’re plain black with a plastic frame and mesh padding. Philips does accentuate the outer ring of the open-back grille with a streak of gold to help set it apart from other brands, but otherwise they're fairly inconspicuous.",
    "The plastic build makes the headphones feel flimsy, which we’d argue is probably the headphones’ biggest flaw, but the silver lining is that they are then ultra-lightweight and don’t feel uncomfortable for long periods of time.",
    "The metal headband does adjust to accommodate a number of head sizes, which is nice, and there's also some mesh padding on the bridge to cushion your cranium.",
    "What you’ll notice missing here are audio playback controls - the SHP9600, like a lot of other open-back headphones, simply doesn’t have them. That makes sense considering that the most common use case for these headphones is critical listening where you’re right next to the vinyl player / amp / PC, but it definitely impacts overall usability.",
    "Inside the box you’ll find a nine foot (three meter) 3.5-to-3.5mm aux cable that connects on the bottom left earpad and a 1/4 inch-to-3.5mm adapter if you plan on connecting these directly to a vinyl player or AV receiver.",
    "As you’d expect from a pair of open-back headphones, the SHP9600 have a detailed and spacious sound quality. The bass has gotten a bit of an uptick since the SHP9500, but it’s just enough to make itself known and not overwhelm. Similarly, mids and highs have enough presence and clarity for our ears, but compared to the SHP9500 you might notice a bit of roll-off that wasn’t there before.",
    "The good news is that the SHP9600 uses 50mm Neodymium dynamic drivers and carries a 32-ohm impedance making them acceptable to use with both headphones and laptops. You’ll still want to power these with high-end AV equipment if you have it, but the low impedance makes it possible for pretty much everyone to use these with their current setup.",
    "For our testing, we plugged them into a Fiio X5 III DAP with a FLAC music collection to try out some lossless files and then went straight from a laptop’s aux port to test Spotify streaming. Both, surprisingly, sounded great with the streaming from the laptop sounding much, much better than we expected. We didn’t feel like we could hear quite as much detail from the Fiio X5 as we could with another, higher-end pair of open-backs like the Fidelio X3.",
    "The other point worth making, and most audio fans will roll their eyes at this, is that these headphones have a lot of sound leakage. Simply by the nature of being open-back headphones, the SHP9600 leak lots of noise at an audible level, potentially making them distracting for coworkers or spouses sharing the same space as you.",
    "That makes these headphones particularly bad for taking outdoors, and while most would never dream of that, we still feel obligated to mention it just in case you’re new to open-back designs."
  ],
  "headers": {
    "3": "Price and release date",
    "5": "Design",
    "10": "Performance",
    "15": "Don't buy them if..."
  },
  "links": {}
}