{
  "source": "https://www.techradar.com/reviews/amazfit-powerbuds",
  "title": "Amazfit PowerBuds review",
  "category": "audio-visual",
  "updated": "2021-07-15T15:37:22.337Z",
  "author": "john-mccann",
  "summary": "Fitness-centric true wireless earbuds packing a big bass punch",
  "verdict": "If you’re after an inexpensive set of fitness-focused true wireless earbuds with a decent feature set and pleasing audio, the Amazfit PowerBuds are a great option. They won’t set your music alight with crystal clear audio, but they’re more than capable of providing top-tapping, heart-pumping playback.",
  "pros": [
    "Great cost-to-feature ratio",
    "Powerful bass",
    "Versatile design"
  ],
  "cons": [
    "Design a little bulky",
    "Microphone quality only okay",
    "No wireless charging support"
  ],
  "article": [
    "The Amazfit PowerBuds are strong true wireless earphones competition for the Apple AirPods (2019), Samsung Galaxy Buds Plus and Beats Powerbeats Pro, with the added bonus of including heart rate tracking and optional ear hooks into their design.",
    "You may not know too much about Amazfit. And it’s likely you know even less about the Powerbuds, but they’re available globally including in the US and UK, and come packed with useful features.",
    "With powerful bass and a firm fit, the Powerbuds are a well rounded set of true wireless earbuds geared towards the fitness market. The eight-hour battery life of the buds (plus another 16 via the charging case) ensures they have the staying power for even the longest workouts, and they can enhance the bass response on tracks automatically when you’re exercising, to keep your motivation up.",
    "Built-in microphones allow you to take calls and interact with your phone’s smart assistant hands-free, while the heart-rate monitor can keep tabs on your beats per minute during any workout - you’ve just got to remember to start the workout in the app to begin with.",
    "While the bass performance is great to keep you in the zone when working out, it can be a little overbearing at times and some users may find it a little too aggressive. You can use the equalizer in the smartphone app to balance the audio, which helps a bit, but the app itself isn’t overly intuitive and takes some time to master.",
    "The PowerBuds are comfortable to wear, with additional magnetic ear hooks included to provide a more secure fit if required. The design is a little on the bulky side, and the charging case isn’t as elegant or aesthetically pleasing as those from the bigger brands.",
    "If you’re after an inexpensive set of fitness-focused true wireless earbuds with a decent feature set and pleasing audio the Amazfit PowerBuds are a great option. They won’t set your music alight with crystal clear audio, but they’re more than capable of providing top-tapping, heart-pumping playback.",
    "The Amazfit ProwerBuds price is $99 / £99.99 (around AU$140), which sees the true wireless earbuds undercut major players in the market including Apple AirPods (2019), Samsung Galaxy Buds Plus and Beats Powerbeats Pro by around $40 / £50.",
    "They’re not the cheapest true wireless earbuds on the market - the JLab Go Air are considerably cheaper, for example - but the PowerBuds are well made and feature rich.",
    "As for their availability, the Amazfit PowerBuds are currently on sale in the US, UK, Spain, Russia, Czech Republic, Brazil, Southeast Asia, South Korea and Taiwan.",
    "Amazfit has informed us the PowerBuds will also be available in Portugal, Italy, Sweden, Norway and Iceland. For those in other countries around the world, there’s currently no word on whether the PowerBuds will be officially made available in more regions.",
    "When you first open up the large, Amazfit PowerBuds charging case, you're greeted with a stylish pair of in-ear buds. Finished in either black/red, white/yellow or white/pink, the lozenge-shaped part of the outer bud is larger than some of its rivals, but it doesn't overly dominate the ear.",
    "What was a little less expected was the additional, smaller section of bud hidden behind the first section, only viewable once removed from the case. It looks as though a smaller set of buds have been fused with a larger set, for a slightly awkward look - but there's a good reason for this.",
    "The additional section is home to the PowerBuds' heart rate sensor, and doubles as a locking mechanism to help keep the buds in place as you twist them into your ear for a solid fit.",
    "Each bud weighs in at 6g, which is similar to the AirPods (4g each) and Galaxy Buds Plus (6g each), while the charging case tips the scales at 57g. That's heavier than the rival Apple (38g) and Samsung (40g) products.",
    "The case is also a little more bulbous, so you’ll notice it more if you're slipping it into a tight pocket, but it's still light enough to be easily portable.",
    "We found the PowerBuds to be a snug fit in our ears with the default rubber eartips which came on the buds, but there are three further sizes of tips included in the box. If the PowerBuds don't feel secure in your ears at first, try swapping to a larger or smaller tip to improve the fit.",
    "Ears come in all shapes and sizes, and you may be someone who finds earbuds don't sit too securely in yours. This is potentially more of a problem for the Amazfit PowerBuds, as they're pitched as sports headphones and will therefore need to survive the forces associated with various workouts.",
    "There's good news though, as you'll find optional ear hooks located on the underside of the charging case's lid. Having the hooks integrated into the case ensures they're protected in transit and means you're less likely to misplace or break them (as long as you always return them to the case after use).",
    "They attach magnetically, and easily enough, to the earbuds, although we did find them a little tricky to slide onto our ears. We needed to use a mirror each time to ensure we were directing the hooks correctly without them becoming detached, and we wouldn't feel confident doing it in the middle of an open field.",
    "You may find that you don’t need the ear hooks. For us, the PowerBuds stayed in our ears during walks, jogs and runs, as well as our usual reps of star jumps, squats and push-ups. If you're looking to do more strenuous exercise, we'd recommend using the ear hooks as a fail safe, but they won't be needed by everyone.",
    "The Amazfit PowerBuds are IP55 rated, which means they're dust and water resistant, ensuring they'll perform during the sweatiest of workouts and rainy runs. The rating only applies to the earbuds themselves, however. You'll want to keep the charging case tucked away, as it doesn't carry the same protection.",
    "The Amazfit PowerBuds sound is delivered from 9mm drivers in each bud, with a more than acceptable frequency range of 20Hz to 20,000Hz, meaning bass is rich and trebles clear.",
    "The first thing that hit us when listening to music was the bass. It's deep and powerful as it pumps into the ear canal, making for an absorbing listening experience.",
    "If we're being picky, the bass is slightly on the muddy side, but its impact is enough to get your head nodding and toe tapping. When working out this powerful bass performance provides added get-up-and-go to exercises, allowing you to push through another set of reps or increase your pace. Listening to Raingurl by Yaeji and 24K Magic by Bruno Mars are great examples of this.",
    "It's not just all about powerful bass performance, as the PowerBuds also deliver when it comes to more instrumental and vocal-heavy tracks. Different instruments and voices can be picked up, and while the sound isn't as clear as more premium offerings, it's more than acceptable considering the PowerBuds' price.",
    "If you find the bass a little too overpowering, head into the Amazfit app and use the music equalizer to fine-tune the listening experience to your liking.",
    "By default, the PowerBuds are set to 'popular', which puts a large emphasis on bass - something which tends to be a preference during workouts - and changing to a preset such as 'classical' or 'jazz' will balance the sound better for those you want less focus on the low frequencies.",
    "Oversall, the audio performance of the PowerBuds keeps you engaged during extended listening sessions, which is exactly what you need for a fitness-centric set of buds - keeping you pumped up in the gym or when you’re out exercising.",
    "Their in-ear fit means the PowerBuds manage to block out some environmental noise from around you (what we call passive noise-isolation), but they don't feature active noise cancellation of more expensive products such as the Apple AirPods Pro. This isn't surprising, considering the low cost of the PowerBuds, but if you're in a busy city or riding on noisy public transport you can expect some bleed of the sounds around you.",
    "Like the Airpods and Galaxy Buds Plus, the PowerBuds don't provide support for high-end audio codecs such as aptX, aptX Low Latency or LDAC. They only support SBC and AAC, which for casual listeners will be acceptable.",
    "However, those with sharper hearing and a passion for Hi-Res Audio won't be served by the Amazift PowerBuds. If you fall into this category, you’re better off looking for something more specialized.",
    "If you take one bud out, to have a conversation with someone else for example, audio playback will automatically pause. It will resume when you pop the bud back into your ear, which makes for a seamless listening experience.",
    "We found the Amazfit PowerBuds battery lasts the eight hours the company claims they will on a single charge. It allowed us to sit at our desk and get almost a full work-day of playback from the buds.",
    "When the 55mAh batteries do run flat, you don't need to scramble for a cable, as the charging case has its own 450mAh battery which can supply an additional 16 hours of charge (enough for a further two full re-chargers for the buds). That means you can get up to 24 hours of audio playback from the PowerBuds before you need to return to a wall socket.",
    "Overall, a total of 24 hours of playback is a respectable amount, although there are options which will last longer if you'd rather not be topping up as frequently. It's also worth noting that if you increase the volume, and switch heart rate monitoring on during workouts, the battery will drain quicker - but the loss is not drastic.",
    "The charging case has a USB-C port on its rear, which allows you to charge up both the case and the earbuds sitting inside it.",
    "Amazfit claims that a 15 minute charge is enough for three hours of playback (with heart rate monitoring off), and we found this to be pretty accurate during our testing, with a full charge taking around two hours. Amazift includes a USB-C in the box as well, so you won't need to buy one separately.",
    "Unfortunately, the case doesn't support wireless charging (whereas the Apple and Samsung offerings mentioned earlier do), so you'll need to grab a cable each time you need to top up properly.",
    "We didn't experience any connection issues with the PowerBuds during our time with them, with support for Bluetooth 5 provided. They are able to maintain a connection with your phone, tablet or computer up to around 10 meters away, with a wall or two in-between. Increase the distance beyond that, or the number of walls/floors, and you'll find the connection cuts out pretty quickly.",
    "It means you can leave the PowerBuds in one room and walk through your home and maintain a solid connection - unless you're lucky enough to live in a mansion, in which case you'll find the connection will cut out when you get a few rooms away from the source.",
    "It's easy to connect the PowerBuds buds to your device, and you have two options. If you're looking for a quick connection, opening up the Bluetooth settings on your device and start searching - then press and hold the button inside the Powerbuds' charging case until the light on the front starts pulsating.",
    "Wait a few seconds for your device to find them, and when the PowerBuds appear in the list tap to connect.You can now start listening to music, podcasts, audio books or anything else.",
    "However, if you want to take full advantage of all the features included with the PowerBuds - including heart rate monitoring and equalizer setting - you'll need to download the Amazfit app. It's available on both Apple's App Store and the Google Play Store for phones running iOS 10 or above and Android 5.0 or above.",
    "From here you'll need to follow the on-screen instructions to select a new device to pair. Once paired you'll be able to access a variety of settings. You can set actions for double and triple taps on each bud, play with the music equalizer to get the right audio for you, and set activity controls such as heart rate monitoring.",
    "The Amazfit PowerBuds come equipped with PPG (photoplethysmography) sensors in each earbud, which use light-based technology to monitor blood flow and produce a heart rate reading. PPG sensors aren't as accurate as ECG (electrocardiography) sensors, which means the data produced by the PowerBuds should be looked at more widely to see the average change in rate.",
    "The data is collected and displayed in the smartphone app, and if the PowerBuds detect your heart rate is becoming excessive, they'll play an alert to notify you it's time to cool down and potentially take a break from your current workout.",
    "What we found frustrating was the fact we couldn't use the heart rate monitor unless we started a workout. It's not possible to use the PowerBuds to quickly check your resting heart rate, which feels like a missed opportunity considering the technology is right there.",
    "The application doubles as a fitness app. You're able to track your workouts, record core information such as your weight, sleep and water intake and it can give you information on your progress and key stats such as your BMI.",
    "You can expand the usefulness of the app by purchasing an Amazfit smartwatch, which can provide more accurate activity tracking and can also provide sleep tracking.",
    "The app isn't the most intuitive we’ve used, and it took us a little while to work out how it all worked, so some perseverance is required.",
    "We found the microphone quality on the Amazfit PowerBuds to be perfectly acceptable for voice and video calls, with no complaints from the other end of the line on our volume or clarity.",
    "The PowerBuds feature ENC dual-microphone noise reduction technology, which reduces the amount of ambient noise when you’re on calls, making your voice clearer to the person on the other end of line.",
    "This seemed to work pretty well when we were using the buds to make calls in a car with a lot of road noise, but it doesn't completely isolate the ambient sounds, so you'll still need to speak up when you’re in especially loud environments.",
    "You can use the Powerbuds to wake your phone's voice assistant - depending on the gesture settings in the Amazfit app. You can choose which earbud to tap to wake the assistant, and whether you want to tap two or three times for the command to work.",
    "We found the tap strength and frequency required to call up the assistant (or to use any other gesture control) was a little hit and miss, and we sometimes had to repeat the gesture for the function to trigger.",
    "When you do it get right, you'll hear the assistant's distinctive chime, which tells you it's listening and awaiting your command. We found there was a delay between the Powerbuds hearing our command and then pushing it to our device, but it wasn't a big issue, and we were able to use the assistant without too much fuss.",
    "While microphone performance is good for calls and speaking to your phone's voice assistant, it's not class-leading. We used the buds to capture our voice audio for a video and a podcast, and it's clear the mics aren't capable of providing the same detailed levels of audio as professional microphone setups.",
    "However, the PowerBuds aren’t aimed at professional audio capture, they're there to allow you to make and receive voice calls, and bark instructions at your handset's voice assistant. It's these tasks they perform well at, so you shouldn’t need to worry."
  ],
  "headers": {
    "0": "Two minute review",
    "7": "Amazfit PowerBuds price and availability",
    "11": "Design",
    "22": "Audio Performance",
    "33": "Battery life and connectivity",
    "51": "Microphone quality",
    "59": "Don't buy them if..."
  },
  "links": {
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Samsung Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Beats Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "JLab Go Air": "https://www.techradar.com/reviews/jlab-go-air-true-wireless-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "for a video": "https://www.youtube.com/watch?v=9lwbt-uyToM",
    "a podcast": "https://www.youtube.com/watch?v=oodHRCR5se8&t=51s"
  }
}