{
  "source": "https://www.techradar.com/reviews/hisense-h65-series-4k-uhd-smart-android-tv-43h6570g",
  "title": "Hisense H65-Series 4K UHD TV (43H6570G) review",
  "category": "televisions",
  "updated": "2020-11-18T15:45:37Z",
  "author": "christian-de-looper",
  "summary": "Surprisingly solid picture quality behind a plastic exterior",
  "verdict": "The Hisense H65 Series offers a surprising amount of value for a budget TV. Its pictures look good with deep contrast and great upscaling, but it does have some issues with screen uniformity. You'll find better TVs if you're willing to spend a bit more, but if you're locked in at under $300 the Hisense H65 delivers decent results.",
  "pros": [
    "Android TV works decently well",
    "Solid image quality for the price",
    "Very inexpensive"
  ],
  "cons": [
    "Audio quality isn’t the best",
    "Plastic build",
    "Better TVs aren't much more"
  ],
  "article": [
    "Hisense has been making some of the best mid-range TVs out there for some time now, largely through its QLED range of products. But the company also builds a slew of budget TVs that make a compelling case to anyone who wants a solid set at a low price. A prime example of that is the Hisense H65G series.",
    "The TV has Android TV built right into it, supports Dolby Vision, and is available in a huge range of sizes - from 43 inches to 85 inches. We’re reviewing the smallest of them, which comes in at a very affordable $280.",
    "But just how much TV can you get for $280? And what corners are cut to hit that price? We put the Hisense H65G to the test to find out.",
    "The Hisense H65G is available right now, from a huge range of retailers and outlets. In the U.S., you can get it from the likes of Best Buy, Amazon, and more.",
    "As mentioned, the Hisense H65G is available in a range of sizes, with the 43-inch model coming at $280, all the way up to an 85-inch model that’s $1,700.",
    "The Hisense H65G is a very affordable TV - and as a result, you shouldn’t necessarily expect a premium design. Thankfully, however, for a TV in this price range, it doesn’t look bad at all. Sure, it’s a little basic, but it’s not ugly.",
    "The TV itself has half-inch bezels around the display on the sides and the top, with a larger bottom bezel that houses a Hisense logo and an infrared receiver. The legs are mounted relatively widely - which is something to keep in mind for those who plan on placing the TV on a smaller TV stand or entertainment center.",
    "On the back, you’ll get three HDMI ports, two USB ports, an ethernet port, and an optical port. It’s a decent selection of ports, and while some might want an extra HDMI port or two, most will be perfectly happy with the selection on offer.",
    "The TV is largely built from plastic, and while it’s not going to fall about for no reason, it’s not the strongest build out there. It’s worth being careful while setting up and moving it, and ensuring that you mount the legs strongly before you place it upright - but it generally should be fine on most TV stands.",
    "The remote matches the design of the TV itself. It’s built from black plastic, and has all the controls you would ever want or need -- somewhat resulting in a more confusing experience. This isn’t an Apple TV or Roku remote. You’ll get a full suite of channel controls and related buttons, and all the Android TV software controls you’ll need too -- thankfully including a Google Assistant button. There are also quick buttons for Netflix, Amazon Prime Video, YouTube, and Google Play.",
    "The Hisense H65G comes with Android TV out of the box, and it’s actually a lot more responsive than we expected. Hisense seems to have been working on the processing power of even its lower-end TVs, and while only a year or so ago a TV in this price range would be immediately slow and unresponsive, with a little patience, the H65G performs well.",
    "For the uninitiated, Android TV is built in rows of content, with a row of apps at the top, and rows of content from those apps as you scroll down. It’s pretty well laid-out, and relatively easy to get used to.",
    "Speaking of Assistant, it’s integral to the Android experience as a whole, and it works decently well here. You actually have to pair the remote as a Bluetooth remote before you can use Assistant - since by default the remote uses infrared only. But the pairing is as simple as holding down the menu button for a few seconds, so it’s not a big deal.",
    "While it’s relatively responsive here, it’s not perfect. There are still times when you’ll need to wait a second or two for the TV to get itself together, especially for things like activating Google Assistant while watching a video or right after closing an app. But as long as you’re happy with waiting a beat for things like Assistant, the overall experience isn’t as hair-pullingly slow as it used to be.",
    "Android TV has begun transitioning to Google TV, however it’s currently unclear which TVs will get the new operating system, or if it will even be available as an update to Android TV devices.",
    "You wouldn’t expect an incredible picture quality from a TV in this price range, but as far as ultra-budget TVs go, the Hisense H65G is about as good as you’re going to get.",
    "It has a 4K resolution, which you would expect in 2020, but the fact that a $280 TV has a 4K resolution really cements the fact that in 2020, you shouldn’t really be considering a TV that has anything less. But this TV goes a step further too - it has Dolby Vision and HDR10 support built right into it, which is always nice to see.",
    "Generally speaking, the Hisense H65G offers a great image quality for a TV in this price range. It has excellently deep black levels, making for a solid contrast ratio, and while it can’t get as bright as some might want, most will appreciate an overall colorful image for epic movies and comedy TV shows alike.",
    "Of course, there are some issues, but they’re not deal-breaking by any means, and easy to look past given the price. For example, there is some blotchiness to speak of, and depending on the panel, you may find some issues related to uniformity, and especially around the edges and corners. Now, for most, it won’t be noticeable, especially for those who don’t spend much time staring at gray screens. But it does still affect color performance a little. There is a little motion blur to speak of too, but it’s not too bad, and definitely not distracting. This TV doesn’t have motion smoothing, which we didn’t really miss.",
    "The TV is pretty good at upscaling lower-resolution video. While you’ll still get some graininess from 720p video, when you get up to the 1,080p territory, content actually looks almost as good as 4K content. That’s always handy for people like me, who spend every waking moment watching reruns of The Office.",
    "Built-in speakers have a reputation for being relatively tinny and lacking depth, and that issue remains more true on cheaper TVs. On the Hisense H65G, you’ll get speakers that will suffice for some TV shows, but as soon as you want any more depth to your audio quality, you’ll need to upgrade. We recommend buying a sound bar or set of bookshelf speakers to use with the TV.",
    "That said, built-in audio quality isn’t terrible. Lows are lacking, but mids are fine, and there’s at least some clarity and detail in the high end.",
    "The good thing about the speakers is the fact that they can get quite loud. Now, you’ll definitely get distortion at the upper end of these speakers’ limits, but it’s not too bad. The majority of the time while testing, we kept the speakers at around the 20-30% level, and if we kept them at 100% we definitely would have heard from the neighbors."
  ],
  "headers": {
    "3": "Price and release date",
    "5": "Design",
    "10": "Smart TV (Android TV)",
    "15": "Picture quality",
    "20": "Audio performance",
    "23": "Don't buy it if..."
  },
  "links": {}
}