{
  "source": "https://www.techradar.com/reviews/nokia-53-review",
  "title": "Nokia 5.3 review",
  "category": "phones",
  "updated": "2020-07-16T13:42:41Z",
  "author": "david-nield",
  "summary": "Another solid budget handset from Nokia",
  "verdict": "Unsurprisingly given Nokia's track record, the Nokia 5.3 is a solid budget performer that offers good value for money. It's absolutely worth a place on your shortlist if you're looking for a new phone that covers the basics well without breaking the bank.",
  "pros": [
    "Very affordable",
    "Bloat-free Android",
    "Decent camera"
  ],
  "cons": [
    "So-so display",
    "Average performance",
    "Not waterproof"
  ],
  "article": [
    "The budget-to-mid-range smartphone market is getting awfully crowded these days – even Apple is having a go with the iPhone SE, which makes it harder for handsets like the Nokia 5.3 to carve our their own niche, especially with the Pixel 4a expected to be announced any day now at the time of writing.",
    "The key selling point here is the price: at £149 / AU$349 (roughly $190, though there's no word yet on US availability), this is one of those phones that's going to make your shortlist if you're looking to spend as little as possible on a new handset. It's less than half the price of the aforementioned iPhone SE.",
    "That's a low, low price – you'll struggle to get a functioning smartphone for less, so you would expect there to be a few compromises along the way as we look at what the Nokia 5.3 has got to offer. In fact, we were pleasantly surprised at what you get for your money, even though features like waterproofing, wireless charging and HDR support on the display are (understandably) cut to keep costs down.",
    "While the specs, screen, and camera are hardly shifting the needle as far as the smartphone industry is concerned, they're all better than you might expect for a phone that's so affordable. The 6.55-inch display gives you plenty of room for watching movies and browsing the web, while the quad-lens camera actually surprised us with the quality of its snaps (though if you want seriously good photos, you'll need to look elsewhere).",
    "Along with its price tag, the other key point in the Nokia 5.3's favor is that it's part of the Android One program, like several Nokias before it. This means you get a bloat-free, stock version of Android 10, plus regular updates for the next two years, so you don't need to worry about falling behind as far as software goes. It also helps the phone to eke out the maximum performance from the Snapdragon 665 processor and 4GB of RAM on board.",
    "Nokia has been one of our favorite mid-range phone makers since it was rebooted under the stewardship of HMD Global, and – up until now at least – it also employed numbering systems that were more logical and easier to follow than those of a lot of brands – so as the successor to the Nokia 5.1, we're a bit confused as to why this phone is called the Nokia 5.3 rather than the Nokia 5.2.",
    "That said, it's easy to understand that this phone sits below the Nokia 6 range and above the Nokia 4 range in terms of that all-important balance between price and performance. You can pick up the Nokia 5.3 now for a very reasonable £149 / AU$349, with no word yet on a US release (a quick currency conversion from GBP comes out at around $190).",
    "Modern Nokia phones aren't flashy – they're stylish, but in a sensible, tasteful-but-discreet sort of way. They're certainly not ugly, but they're not all that innovative either. You get a fairly typical smartphone design when you buy a Nokia handset, and that's true of the Nokia 5.3, which sports a few nice curves, but nothing that's going to turn heads when you take it out of your pocket.",
    "We're not all that keen on the big, circular rear camera array, which looks to have borrowed some of the zaniness of the Nokia 9 PureView. We'd much rather see a horizontal or vertical strip of lenses on the back of our phones, but of course your aesthetic mileage may vary. The power button doubles up as an LED notification light, which is a touch we like.",
    "The display bezels are nice and thin, with just a hint of chunkiness at the top and bottom, and the screen is interrupted by a small teardrop notch. On the whole we prefer no notch and a larger top bezel, but again that's down to personal taste, so we're not going to knock down the Nokia 5.3 too much here. The fingerprint sensor is in the center of the back of the phone – you won't get an in-display sensor on a budget, but face unlock is available too, and it's reasonably fast.",
    "The phone feels reassuringly solid and well-built in the hand, with a matte plastic back that's a pleasure to handle. Despite the low price, the phone itself doesn't feel cheap – lightweight perhaps, but not cheap. Cyan (more of a turquoise), Sand (a beige/gold) and Charcoal (dark gray) are your three color options, and it's the cyan model we're testing out here.",
    "The Nokia 5.3's 6.55-inch, 720 x 1600 pixel, IPS LCD display isn't going to make any eyes pop, but it's a decent enough spec at this price point, and it actually looks better than you might expect up close. While the deep blacks and vibrant colors of OLED are missing, the screen does a good job of showing off photos, web pages, movies and more.",
    "That extra tall, 20:9 aspect ratio does make less-than-widescreen video watching a little awkward, and the teardrop camera notch is a distraction when watching something full-screen, but it's not a huge issue for us; overall, this is a display that's bright and sharp enough to satisfy most people. There's a white balance control slider included in the settings for Android 10, if you need it, but it's not something we used.",
    "Getting a phone down to this price point means some compromises need to be made, and the screen is one of them – this is a long way from the high-resolution, HDR-enabled, super-fast-refresh-rate screens on the flagship phones of the moment. It's not as vibrant in bright daylight, for example, and it's not quite as responsive to the touch as top-tier phones from the likes of Samsung and Apple.",
    "That said, we spent a good deal of time flicking through photos, social media and films and had absolutely no complaints with the look of the Nokia 5.3 screen, given what you're paying here. Even in the fastest-moving games and movie action scenes there was minimal ghosting and lag.",
    "Every phone camera has to be judged taking into account the phone's price, and the Nokia 5.3's quad-lens camera offers plenty of value for money. Don't get too excited though – those four cameras are 13MP standard, 5MP ultra-wide and 2MP macro, plus a 2MP depth camera, so this is hardly cutting-edge.",
    "That comes through in the photos too, which are typical for a phone at this end of the market: respectable in good light, but less impressive when there's not much light available or when subjects are moving quickly.",
    "The cameras focus and capture snaps briskly, depth effects are nicely rendered, and the on-board AI seems to do a passable job of recognizing what's in front of the camera, even though the subject categories are pretty broad (Outdoors, Flowers, and so on). We also appreciated the HDR processing, which can preserve detail in highlight and shadow areas.",
    "So far so standard, but you wouldn't necessarily expect all of this scene recognition and HDR processing on a phone this cheap. We spent a good few hours wandering around snapping shots of the local landscape – with the world the way it is at the moment we were a bit limited in where we could go to take pictures – and most of the time our pictures came out rather well.",
    "In other words, you're getting results you'd expect from a mid-range snapper in something that's right down at the budget end of the market. It's not a phone that's going to work magic in the photography department, but if you're just posting to social media, and you're not taking photos in the pitch black, then the Nokia 5.3 can do the business.",
    "As always, it's in low-light conditions that issues arise, in the shape of excess noise, a loss of detail, and blurring. The Nokia 5.3 does have a night mode, and while it doesn't seem to do a great deal (and it significantly extends the exposure time), it does give you another option for trying to get the best result possible. We also found the macro mode to be a bit hit and miss.",
    "The ultra-wide lens is great for fitting more people or a wider landscape into a scene, but it does seem to affect the overall quality of the photos somewhat – they're not quite as vibrant or as sharp as those taken with the main camera. Still, unless you're trying to set up a photography business with the Nokia 5.3, you're not going to be too disappointed.",
    "Around the front you've got a basic 8MP selfie snapper, which does the basics and not much more – it'll do for your video calling and your social media selfies, but to get a decent photo you'll need to use the rear camera.",
    "The Qualcomm Snapdragon 665 processor inside the Nokia 5.3 isn't going to set any benchmarking records, but it's no slouch either – it'll do very nicely indeed at this price point, and we didn't notice any lag or significant slowdowns during our time with the phone as far as everyday use goes. Even face unlock works speedily, although perhaps just a few milliseconds behind the tech on the latest Pixel 4 phones, for example.",
    "As for gaming, we didn't find any titles that refused to run on the Nokia 5.3, but you'll encounter slow loading times and the occasional stutter in terms of frame rates with more demanding games. This isn't the sort of device you really want to be pushing hard, and serious gamers are unlikely to seek out the Nokia 5.3 out anyway, but if this is a phone that appeals to you then you'll find the gaming experience is fine for whiling away a few minutes in the day.",
    "A multi-core score of 1381 on the latest Geekbench for Android benchmarks puts the Nokia 5.3 squarely in budget-to-mid-range phone territory, and about where we'd expect. The 4GB of RAM and 64GB of storage you get aren't fantastic, but they're a step up from the ultra-budget phones that are even more affordable than this one – it's enough to run Android 10 comfortably, and you can add extra storage via the microSDXC card slot if needed.",
    "We've tested a lot of affordable budget phones down the years, and we're please to report that we were impressed with how speedy the Nokia 5.3 is. You're certainly not going to mistake this for flagship-level performance, but it might just make you question why anyone would spend many times more on a top-tier handset – and if a budget-to-mid-range phone can make you do that, then it's done its job.",
    "The software is undoubtedly one of the highlights of the Nokia 5.3 – not only do you get the latest and greatest version of Android 10 on board, but the phone (like many Nokias before it) is part of the Android One program. That means you get guaranteed updates for two years, and updates that should come through in a timely fashion, which isn't always something you can say about Android devices.",
    "Android One also ensures that you get as close to a stock Android experience as possible, so you've got all the Google apps here ready and waiting as soon as you switch the phone on, and there's very little in the way of bloat – our handset came with an FM Radio app which we didn't really care for, but that's about it as far as extraneous software goes.",
    "Phone makers seem to be stuck in a rut when it comes to balancing power and battery life, with most handsets now seeming to deliver similar battery life no matter what their size or configuration. Phones are generally making it through one day of use comfortably, while never really getting close to two days, but the good news is that the Nokia 5.3 seems to sit towards the upper end of that performance bracket.",
    "The 4,000mAh battery is actually pretty generous in terms of its capacity, but this doesn't translate into battery life that's much more than average. While we had a good 30-40% of juice left at the end of some days, we wouldn't expect the phone to make it through a second day – especially if you need to hammer the battery with something like GPS on maps or a few gaming sessions.",
    "An hour of streaming video at maximum brightness and medium volume knocked the battery down from 100% to 87% during our highly unscientific test; again, that's about average, and suggests that you'll get around seven or eight hours of video streaming from this phone before you have to reach for the charger – it's enough to keep you entertained a long plane journey, which is a good bar to reach.",
    "There's nothing fancy in terms of charging here, which frankly we can live with given the Nokia 5.3's low price. There's no wireless charging, and no fast charging either, with wired charging capped at 10W, but when a phone can hold its charge as well the Nokia 5.3 can, then being able to quickly charge it before you head out of the door is less important.",
    "First reviewed: June 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Nokia 5.3 price and availability",
    "7": "Design",
    "11": "Display",
    "15": "Cameras",
    "23": "Specs and performance",
    "29": "Battery life",
    "33": "Don't buy the Nokia 5.3 if:"
  },
  "links": {
    "having a go with the iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "the Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Nokia 5.1": "https://www.techradar.com/reviews/nokia-51-review",
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview",
    "Pixel 4": "https://www.techradar.com/reviews/google-pixel-4-review",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}