{
  "source": "https://www.techradar.com/reviews/rivyt",
  "title": "RIVYT review",
  "category": "computing",
  "updated": "2020-11-24T02:52:57Z",
  "author": "mike-williams",
  "summary": "Build a professional website that displays your videos",
  "verdict": "RIVYT is a website builder created for video enthusiasts. If you want to easily livestream on your website, share loads of video content, and always have room for uploading, check out RIVYT. Now you can spend time doing what you actually love and create your website with ease.",
  "pros": [
    "Easy to use",
    "Supports livestream",
    "You can use YouTube, Twitch, Vimeo, and Wistia",
    "Organized interface"
  ],
  "cons": [
    "Only 21 templates to choose from",
    "Not very many customization options"
  ],
  "article": [
    "RIVYT is a specialist website builder which enables creating a polished and professional video-based site from your YouTube, Twitch, Vimeo or Wistia channels. While this website builder can’t quite compete with Wix or Weebly, it’s still an excellent web building option that includes a free plan.",
    "The simplest way to give your site a new look, is to apply a different template. You do get a few ways to control the site's features. An optional Search box allows visitors to locate files by searching their descriptions for keywords. You can enable visitors to sort videos by date, or likes, and view your videos as a list or grid view.",
    "RIVYT has one main plan on their website. You can start building a test site right away to see what you think of the product before purchasing the website builder. All you need to do is click on the video platform you want to start with (YouTube, Twitch, Vimeo, or Wistia). Next you choose the template you want to try. Then you can add your videos, branding, site design options, colors, and much more.",
    "The Go Unlimited plan costs $7.00 per month. It includes space to upload over 1,000 videos, unlimited design control, the ability to do live streaming, add products to sell, a live chat option, Google Analytics, and space to create a newsletter. This plan includes plenty of features for the price, and you can cancel at any time.",
    "The interface is clean and easy to follow. You can view the templates on the website (there’s 21 of them). Also, your video selection doesn't have to be restricted to clips from a single YouTube channel. It's possible to add movies from YouTube, Twitch, Vimeo or Wistia, and reorder them however you like. RIVYT's branding panel correctly picked the logos, site title and About text used in our YouTube source. You're free to replace these, though, and can also add a tagline.",
    "A Social Links panel enables adding your email address, shop and support URLs, along with your usernames for Facebook, Twitter, Instagram, LinkedIn, SoundCloud, Tumblr and more. Add any of these and RIVYT will display the appropriate icon on your site.",
    "Upgrading to a commercial Unlimited account gets you the ability to add custom CSS. This gives you substantial control over the site's layout and functionality, assuming of course that you're a CSS expert (unlikely, especially amongst RIVYT's target audience of web design newbies.)",
    "More usable features include the ability for RIVYT to automatically add new videos (upload to your YouTube channel, and the video appears on the site automatically.) MailChimp integration enables users to sign up for a newsletter direct from the site, and there's a basic shopping cart. It really is basic - simple fixed-format product descriptions and a PayPal checkout - but, at this price, we're not going to complain.",
    "Other highlights include support for automatically displaying active live streams, and the ability to connect the site to your chosen domain.",
    "The downside is that there’s many features that have no description beyond a tooltip, and even the most complex tasks only get the briefest of explanations. Some website builders give you lengthy screenshot-packed tutorials to help explain how you point a custom domain to your site, for instance. RIVYT offers just 76 words.",
    "Fortunately, most of the Unlimited plan's features involve little more than flicking a switch ('Live Streaming' = on). Although the domain setup instructions are brief, they were clear and easy to understand (plus there's support via email, though no information on the expected response time). Even if you're a beginner who's aiming to use every single one of RIVYT's most advanced features, you'll probably have your site up-and-running with just a few hours of work.",
    "With so many website builders on the market (like Moonfruit, 123 Reg, or Voog), you might be thinking, “Why RIVYT?” Why not go with another brand? What’s unique and helpful about RIVYT is who it’s designed for. It’s a website builder created to display high quality video. Each template is tailored to suit video creators and their designs. Even though there’s only 21 design options, you can still personalize those designs. Many of the templates have built-in spaces for uploading video content to display to a large audience.",
    "RIVYT is a very easy-to-use way to create a good-looking site from your YouTube channel. If that appeals, its free plan is a must-see. You can test out the website builder even before purchasing a plan to see if it's the right platform for you.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Interface",
    "6": "Features",
    "11": "The competition",
    "12": "Final thoughts"
  },
  "links": {
    "RIVYT": "https://rivyt.com/",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Weebly": "https://www.techradar.com/reviews/weebly",
    "one main plan": "https://rivyt.com/",
    "Go Unlimited plan": "https://rivyt.com/",
    "Moonfruit": "https://www.techradar.com/reviews/moonfruit",
    "123 Reg": "https://www.techradar.com/reviews/123-reg-website-builder",
    "Voog": "https://www.techradar.com/reviews/voog"
  }
}