{
  "source": "https://www.techradar.com/reviews/mydraw",
  "title": "MyDraw review",
  "category": "computing",
  "updated": "2020-08-03T13:52:02Z",
  "author": "jacob-parker",
  "summary": "Top-notch vector drawing tools for a budget price",
  "verdict": "MyDraw might lack cloud integration but it’s an excellent desktop app for creating slick, professional diagrams.",
  "pros": [
    "Large selection of chart layouts",
    "Interface will be instantly familiar to Microsoft Office users",
    "Add detail through barcodes and custom composite objects"
  ],
  "cons": [
    "Desktop-only application can’t be used online",
    "Free-trial adds watermarks to all outputted images"
  ],
  "article": [
    "MyDraw is a diagramming and vector graphics tool developed by Nevron Software. You can use this package to create organizational maps and professional flowcharts on both Windows and Mac devices.",
    "As you’ll see over the course of this MyDraw review, MyDraw isn’t the slickest-looking piece of software package, but its features make it an ideal choice for communicating complicated concepts and plans visually. Another good reason to consider using MyDraw is its affordable pricing scheme which is sure to work for both home and enterprise users.",
    "A MyDraw license will set you back $69, which is fairly good value considering that a license allows you to install the MyDraw software on up to two machines at once. MyDraw offers a free 30-day trial to allow you to test out the platform before signing up, but any images you create during this period will be watermarked.",
    "The great thing about MyDraw is that its licenses are “perpetual”, so there’s no need to make monthly payments to maintain access to your software (the norm with many other diagramming products). However, a license does only get you access to one-year of updates at a time. If you want the latest MyDraw features after that year, you’ll need to purchase a renewal package for $36, this will give you another year of updates.",
    "If you have a large enterprise and want to purchase a MyDraw license for multiple employees, you can access bulk discounts for up to 40% off the cost of an individual license. Similar discounts are available for government, educational, or non-profit organizations. There’s also a recommendation program through which you can get a free MyDraw license by telling friends about the software.",
    "MyDraw is mostly aimed at users with little or no previous experience of using a graphic diagramming toolkit before, so the package is full of accessible design tools. It doesn’t take long to produce your desired visual output thanks to a large range of shapes you can add to projects and a suite of advanced vector operations that let you combine objects and change their geometry.",
    "Automatic layouts",
    "If you need to create a complex diagram in a hurry, MyDraw will help you to do that with a selection of ready-to-go tree and graph layouts. Through these, you can find a way to arrange your data that highlights the flow of a process and ensures displayed information is as readable as possible. MyDraw comes with 12 customizable automatic layouts, so you're certain to find one that suits your unique needs.",
    "Barcodes for extra information",
    "Ideally, professional diagrams should be easy to interpret at a glance but also contain plenty of information for anyone who needs it. With MyDraw, you can achieve this by hiding additional information in your images with linear, data matrix, and QR barcodes.",
    "Barcodes can be placed anywhere you like in a MyDraw diagram, but they work best next to relevant parts of your image so that readers can learn more about a particular element if they want to. Diagram barcodes are a great way to add in product codes, tracking information or links to other relevant documents.",
    "Advanced vector drawing",
    "If you want to design complex, custom vector shapes to add to your MyDraw creations, you’ll find plenty of useful drawing tools in this program. You can use a library of premade shapes and draw freehand curves, circular arcs, or bezier curves. The geometry of any shape can be modified by dragging control points at its edges.",
    "But that’s not all. To get the effect you’re looking for, you can subtract one shape or combine objects to create a new, composite object. In order to keep the design process simple, MyDraw provides drawing aids like guidelines, rulers, and scales.",
    "The MyDraw interface is complex but will be immediately familiar to anyone who has used an application in the Microsoft Office suite. Nevron intentionally matched the look of MyDraw to Microsoft Office programs to create a shallow learning curve for first-time users.",
    "Overall, the interface isn’t particularly exciting to look at, but it does a good job of making objects that you need to access frequently easy to get too. It doesn’t take long to figure out how to resize shapes, create new ones, or even modify the entire layout of a project that you’re working on.",
    "The interface doesn’t change much between Windows and Mac versions of the software, as both are equal in terms of functionality. If you want to change things up, a small selection of different MyDraw skins is available.",
    "Although Nevron Software has done everything it can to make things easy for new users to get to grips with MyDraw, you may want a little extra help with more advanced functions. For this, you can check out MyDraw’s selection of video tutorials. If you need additional help with the software or your MyDraw license, phone support is available on weekdays.",
    "There are plenty of other great professional diagramming tools out there, but MyDraw keeps pace with the best of them thanks to its large range of design functions and the ability to import data directly from Excel files. It’s also significantly more affordable than some competitors. For example, a MyDraw license costs around half as much as an EDGE Diagrammer license.",
    "If you’re looking for a piece of diagramming software to use in your organization or professional environment, MyDraw is an excellent option. It stands out thanks to its large range of drawing features, relatively low price-point, and interface design which intentionally matches productivity tools in the Microsoft Office suite."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "14": "Interface and in use",
    "17": "Support",
    "18": "The competition",
    "19": "Final verdict"
  },
  "links": {
    "MyDraw": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9569309835658897000&xs=1&url=https%3A%2F%2Fwww.mydraw.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmydraw",
    "MyDraw license": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4089570488686867500&xs=1&url=https%3A%2F%2Fwww.mydraw.com%2Forder-buy&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmydraw",
    "a renewal package": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1235196997952380700&xs=1&url=https%3A%2F%2Fwww.mydraw.com%2Forder-buy&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmydraw",
    "bulk discounts": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3920125940326354000&xs=1&url=https%3A%2F%2Fwww.mydraw.com%2Forder-discounts&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmydraw",
    "recommendation program": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1584751474268452400&xs=1&url=https%3A%2F%2Fwww.mydraw.com%2Forder-get-my-draw-for-free&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmydraw",
    "video tutorials": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4680556481754265000&xs=1&url=https%3A%2F%2Fwww.mydraw.com%2Fsupport-video-tutorials-index.aspx&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fmydraw"
  }
}