{
  "source": "https://www.techradar.com/reviews/oppo-a53",
  "title": "Oppo A53 review",
  "category": "phones",
  "updated": "2020-12-04T16:22:53Z",
  "author": "jennifer-allen",
  "summary": "An unremarkable but dependable budget phone",
  "verdict": "The Oppo A53 could have been a forgettable budget phone, but thanks to its 90Hz display and decent battery life, it stands out a little from the competition. Don't expect miracles but do expect a competent device for the price.",
  "pros": [
    "90Hz display",
    "Good battery life",
    "Stylish appearance"
  ],
  "cons": [
    "Average performance",
    "Mediocre camera",
    "Unremarkable"
  ],
  "article": [
    "Oppo isn't a hugely well-known name still despite having an extensive range of phones under its belt, among the latest of which is the Oppo A53, a solidly budget model. That's no bad thing but it does mean that already, we need to temper our expectations.",
    "This isn't a phone that will revolutionize the market but nor should anyone expect that from such an inexpensive device. On the plus side, it does offer some neat extras that mean it occasionally stands out a bit amongst a busy crowd of cheap phones.",
    "While it's the low price that's the main selling point of the phone, the Oppo A53 also bundles in a 90Hz refresh rate, which isn't entirely unique in this field with the likes of the Realme 6 also sporting that refresh rate, but is still a welcome addition to spruce up an otherwise fairly ordinary phone.",
    "Besides the classy display, the Oppo A53 actually looks pretty nice for the price. It has a premium look reminiscent of the Honor 10 Lite, with a curved back that is somewhat eye-catching and ensures you're not simply stuck with the same old tedious back that so many other phones stoically stick with it.",
    "Elsewhere, it's perhaps more unremarkable looking, with the standard bevy of buttons and a conveniently placed fingerprint scanner right where your finger is likely to linger.",
    "At around 186g and 8.4mm thick, the Oppo A53 is quite bulky, but the aforementioned curved back means it sits comfortably in your hand at least, even if your hands are quite small.",
    "Performance wise, the Oppo A53 is about what you'd expect for the price. In our tests, it slightly outperformed the similarly priced Redmi Note 7 when it came to multi-core performance, but it was a fair way behind in single-core performance. In daily use, we weren't irritated by what the Oppo A53 accomplished but it wasn't exactly a wizard either.",
    "That's the general trend with the Oppo A53. It works well enough but it lacks a bit of magic. In general daily use, it does what you need, allowing you to easily switch between apps and games without too much slowdown, but it's not exactly a revolution in design. We were pleased to see that it arrived with little bloatware attached though, with only the likes of Facebook and WPS Office potentially superfluous to one's needs.",
    "When trying out the camera, it's another functional moment for the Oppo A53. It works just fine but don't expect anything more advanced than a macro mode. Even a night mode isn't included and we wouldn't recommend taking snaps in low light with this phone. Again though, it suits the budget reasonably well.",
    "Cutting back on features is a key pattern here, with other absences including waterproofing and wireless charging, but again, these concessions keep the price down. Fast charging is an option at least though and we were pleasantly surprised with how long the Oppo A53 lasted without needing a top up.",
    "So then, the Oppo A53 isn't everything you could want and more, but your bank balance will like the price and you'll certainly appreciate how dependable it is.",
    "With some stylish looks and the bonus of a superior screen than some others can offer at this price, it's not too shabby at all for the money. Just remember to temper your expectations accordingly.",
    "With a recommended retail price of £159.99 in the UK, the Oppo A53 is already discounted to £129.99 SIM-free at most retailers. That hasn't happened yet in Australia, but we wouldn't be surprised if those retailers follow suit soon enough.",
    "At the time of writing, the phone isn't available in the US, but if it does make its way there expect a rough conversion price of around $200. Whichever way you look at it, this is an affordable device.",
    "The Oppo A53 immediately reminded us of the Honor 10 Lite and that's certainly a good thing. Our review unit had the Electric Black color scheme and the back of the unit caught our eye quite well. Rather than simply being a dull black color, it has a glint to it that looks rather appealing, although it is prone to attracting fingerprints and smudges.",
    "UK markets have the choice of Mint Cream or Electric Black, with the former typically costing more depending on where you look. Other markets also have Fairy White and Fancy Blue, with white seeming like the one to go for if you want to avoid marks.",
    "Whichever one you go for, the Oppo A53 is a little on the chunky side at 8.4mm but its curved edges and corners mean it still feels reasonably comfortable in your hands. A fingerprint sensor located on the back of the phone just underneath the camera is ideally suited for unlocking your device with minimal hassle.",
    "Elsewhere, the volume buttons are on the left edge near the dual-SIM slot, while the right edge has the power button. It's all perfectly functional and exactly what feels comfortable to use.",
    "The 6.5-inch display is recessed slightly to give it a bit of protection, with a small notch for the selfie camera. We didn't mind losing that tiny amount of screen space and it all feels reasonably sturdy. The casing doesn't give away a sense that this is a budget phone, although it's worth remembering that the phone isn't rated as waterproof or dustproof.",
    "Along the bottom you'll find a 3.5mm headphone jack, a USB type-C port, and a single speaker grille. It's all business as usual then.",
    "It's a mixed bag for the Oppo A53's display. On the one hand, it has that 90Hz refresh rate. What that means for you is it refreshes the screen 90 times per second rather than the 60 times that many other screens offer.",
    "It means a smoother experience while you're scrolling through things or playing games, and it's certainly a big plus when considering this phone.",
    "However, the resolution of the phone isn't Full HD at only 720 x 1600, and that's not great. It'll do, of course, but it means in certain cases that videos and text won't look as sharp and you'll probably wish you prioritized resolution over refresh rate. Unsurprisingly it's also an LCD screen rather than OLED.",
    "This isn't a terrible display by any means but it's nothing great either. You'll also find you need to bump up the brightness to full if you want to use the Oppo A53 effectively in bright sunlight outdoors.",
    "Is it a big deal on a phone of this price? Not so much, with movies and shows certainly watchable, but it's not exactly a shining example of what smartphone screens can offer.",
    "Let's get this out of the way - the Oppo A53 isn't made for photographers. Its camera is fine and functional but it's nothing special. The rear camera offers a 13MP primary lens, 2MP macro and 2MP depth sensor. There's no wide-angle lens but honestly, we're not convinced it would be great if it were there.",
    "The 13MP f/2.2 main camera is just fine, with okay photos but nothing exceptional, and it's a little slow to shoot. It's good enough for uploading to Facebook but there's a certain lack of detail once you look up close.",
    "That's a similar story for the macro camera, which does the job but feels like it would appeal more to someone less knowledgeable about what smartphones can offer now. Light is key to a good macro shot if you want to avoid any noise on your images.",
    "An up to 5x digital zoom sounds enticing but the picture simply gets less clear the more you zoom, so we wouldn't recommend using it unless you absolutely have to.",
    "Night shots meanwhile are particularly disappointing here with no dedicated night mode and very underwhelming results.",
    "On the plus side, Oppo's software goes some way to improving your photography experience. It includes features like HDR, Dazzle Color, portrait mode and AI improvements. Dazzle Color and HDR in particular are a huge help when trying to get more of the colors of what you're snapping, even during a clear day outside.",
    "For selfie addicts, the 16MP selfie camera is one of the better parts of the camera here with decent color reproduction, although not as much detail as we'd like to see. Also, it's worth noting that switching off the AI beautification mode generally improves results.",
    "Like we said, the Oppo A53 isn't made for photography, although it is functional enough. Predictably its photos don't really stand up to pricier fare but nor would we expect them to. Still, a night mode would have been appreciated.",
    "The Oppo A53 is powered by a Qualcomm Snapdragon 460 processor, which is distinctly entry-level stuff. 4GB of RAM also means it can't rely heavily on memory to make up for any shortcomings. We played Call of Duty Mobile to see how it performed and it was fine but rather slow to load. Ultimately, it shouldn't bother you too much unless you're impatient.",
    "Geekbench 5 scores came in at 253 for single-core performance and 1,266 for multi-core performance. That's not great but it is better than some other budget options such as the Alcatel 3L (2020). It also beats the Redmi Note 7 for multi-core performance, but not for single-core.",
    "Benchmarks are irrelevant in day to day use though and we didn't actually have much trouble with the responsiveness of the Oppo A53. It does everything at a reasonable speed and without any lag or crashes to be seen. We wouldn't fancy its chances with multiple browser tabs open, but that's unlikely to be too much of an issue for the average user shopping for a phone at this price.",
    "The Oppo A53 comes with 64GB of internal storage, with expandable memory of up to 256GB being an option. The internal storage isn't great but it should get you started without any trouble before you consider whether an upgrade is needed.",
    "Android 10 comes pre-installed here and the Oppo A53 isn't too heavy on pre-installed apps. Beyond the standard stuff, there's simply WPS Office, Facebook and Oppo's Game Space app that you may wish to remove.",
    "The last of those aims to speed up gaming performance by clearing the cache and RAM before you play a game. It potentially does improve performance ever so slightly but you'll probably forget all about using it soon enough.",
    "As a budget phone, the Oppo A53 keeps things simple elsewhere, so of course there's no 5G.",
    "With a 5,000mAh battery, the Oppo A53 performs fairly admirably. That's a big battery for a phone of this price and size. It easily lasts more than a day even during heavy usage, such as extensive gaming or binge-watching.",
    "On those days where you use the Oppo A53 a little less, it should last a couple of days, although it's likely that you'll find yourself recharging it to be on the safe side.",
    "There's no wireless charging here but we found it took just over 2 hours to recharge fully. That's not amazing but it's good enough.",
    "Software features such as Super Power Saving Mode and Sleep Standby Optimization go some way to helping you prolong the battery life.",
    "Suggestions are offered about where you can extend the battery life and they're usually pretty intelligent, avoiding reducing what you can actually get done with your phone. Just watch out for Oppo's Game Space which is likely to hammer the battery life if you use it a lot.",
    "First reviewed: December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Oppo A53 price and availability",
    "14": "Design",
    "20": "Display",
    "25": "Camera",
    "33": "Specs and performance",
    "40": "Battery life",
    "45": "Don't buy it if..."
  },
  "links": {
    "Realme 6": "https://www.techradar.com/news/realme-6-arrives-this-week-boasts-90hz-display-and-quad-camera-for-only-audollar469",
    "Honor 10 Lite": "https://www.techradar.com/reviews/honor-10-lite-review",
    "Redmi Note 7": "https://www.techradar.com/reviews/xiaomi-redmi-note-7",
    "Alcatel 3L (2020)": "https://www.techradar.com/reviews/alcatel-3l-2020"
  }
}