{
  "source": "https://www.techradar.com/reviews/authorizenet",
  "title": "Authorize.net review",
  "category": "computing",
  "updated": "2020-09-24T14:12:01Z",
  "author": "rob-clymo",
  "summary": "Use Authorize.net to carry out credit card processing and other services via the cloud",
  "verdict": "While Authorize.net is definitely recommended to medium and larger businesses, smaller companies might find the overheads tend to outweigh the undeniably impressive package of services it provides.",
  "pros": [
    "Long established",
    "Fraud screening",
    "Support",
    "Automatic updating"
  ],
  "cons": [
    "Costly for smaller concerns"
  ],
  "article": [
    "Authorize.net has a website that spells out its intention from the get go, which is to simplify the credit card payment process. Anything that takes the stress and strain out of financial transactions has always got to be welcome news and Authorize.net has been around long enough to know how to do just that.",
    "Launched way back in 1996, the Utah-based concern is today owned by Visa and is already a familiar name and popular option for many businesses across the US. As a payment gateway with products and services to suit a variety of users it has a well-proven track record. On top of that, Authorize.net offers a seamless user experience, which if you’re in need of credit card processing will prove very useful indeed, particularly in light of coronavirus.",
    "It shares the marketplace with competitor products such as Sage Pay, Stripe, PaySimple, Worldpay, PayPal, Helcim and Clover.",
    "In order to use Authorize.net you’ll first need a payment gateway, which will let you connect to its services and gain authorization for transactions. You can sign up directly with Authorize.net but you may instead prefer to have a merchant account provider, which will also let you connect to Authorize.net.",
    "However, if you're going directly to Authorize.net then the current pricing structure is available in three different options. The website recommends its All-in-One option, which is a route that lets Authorize.net get you set up with both a merchant account and a payment gateway. There’s no setup fee, while the monthly gateway costs $25 plus a per transaction charge of 2.9% + 30¢.",
    "Alternatively, the payment gateway only option is best if you’ve already got a merchant account. This comes with no setup fee, a monthly gateway charge of $25 plus per transaction fee of 10¢ and daily batch fee of 10¢. Finally, there’s a tailored pricing option for businesses who process over $500k annually.",
    "Authorize.net does come with plenty to offer the medium to large business with a dazzling display of features that work very well. However, anyone signing up will certainly pay for the privilege and it is one of the pricier options for credit card processing duties.",
    "Nevertheless, for more outlay you get better features, which in the case of Authorize.net means advanced fraud protection. This includes 13 configurable fraud filters relating to IP, transactions, shipping and also velocity. The latter limits the number of transactions allowed per day or hour to stamp out high-volume fraud. Useful if you’re a large concern no doubt.",
    "Authorize.net is also able to work with multiple card types including Visa, MasterCard, Discover, American Express, JCB, PayPal, Visa SRC, Apple Pay, Chase Pay and E-check. There’s also the capacity for setting up recurring payments and invoicing too. Additional features such as automatic account updating allow your business to stay bang-up-to date with regular customers.",
    "Authorize.net is aimed at more established businesses with a larger commercial footprint, which might make it seem a little ominous if you’re operating a smaller concern. However, Authorise.net has been in existence long enough to realize that businesses grow, so if you’re a middle ground venture then it’s fairly easy to configure and is therefore worth investigating.",
    "While Authorise.net does offer a complete solution, in that it's able to help you with e-commerce integration, has point of sale options as well as being able to process mobile and phone payments, some parts of the process can be tricky to implement. On the upside, the setting up of mobile card reader services and turning your phone or tablet into a mobile point of sale device is actually stress-free.",
    "Authorize.net has the sort of support infrastructure that you’d expect from a large credit card processing concern, particularly considering that it is owned by Visa nowadays. You’ll find a central support center, which can provide you with many more basic answers.",
    "Meanwhile, there’s support team also at your disposal 24/7 (though they're closed on major holidays), which goes some way to justifying the additional expenditure you get with Authorize.net. We also rather like the Blog feature of the website, which offers up additional information, plus tips and tricks for getting the best out of the service.",
    "Authorize.net offers slick credit card processing services, but you pay a premium for the experience. If you're starting out, or have what qualifies as a small business then you will probably find something like Square or Stripe more suited to your turnover.",
    "Being both a merchant services provider as well as a payment gateway means that Authorize.net is convenient if you want it to do all the credit card processing donkey work and, potentially, save a little bit on costs in the long run.",
    "While actually using Authorize.net on a daily basis is essentially simple and easy to master, you’ll really need to think carefully about committing to it in order to be sure you’re getting best value. That said, Authorize.net benefits from beefy support and also numerous fraud screening features, so there’s a lot here for the money."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "9": "Ease of use",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "Authorize.net": "https://www.authorize.net",
    "credit card payment": "https://www.techradar.com/best/best-credit-card-processing-service",
    "payment gateway": "https://www.techradar.com/best/best-payment-gateways",
    "processing": "https://www.techradar.com/best/best-credit-card-processing-service",
    "Sage Pay": "https://www.techradar.com/reviews/sage-pay-credit-card-processing",
    "Stripe": "https://www.techradar.com/reviews/stripe",
    "PaySimple": "https://www.techradar.com/reviews/paysimple-credit-card-processing",
    "Worldpay": "https://www.techradar.com/reviews/worldpay",
    "PayPal": "https://www.techradar.com/reviews/paypal-credit-card-processing",
    "Helcim": "https://www.techradar.com/reviews/helcim-credit-card-processing",
    "Clover": "https://www.techradar.com/reviews/clover-pos-point-of-sale-review",
    "card processing": "https://www.techradar.com/best/best-credit-card-processing-service",
    "small business": "https://www.techradar.com/how-to/these-tools-will-help-simplify-the-way-you-run-your-small-business/best/small-business-tax-software"
  }
}