{
  "source": "https://www.techradar.com/reviews/sennheiser-cx-400bt-true-wireless",
  "title": "Sennheiser CX 400BT True Wireless review",
  "category": "audio-visual",
  "updated": "2021-07-15T14:27:29Z",
  "author": "simon-lucas",
  "summary": "‘Affordable’ Sennheisers have Apple AirPods firmly in their sights",
  "verdict": "They’re not the most glamorous nor the most distinctive – but Sennheiser’s new CX400BT true wireless earbuds have it where it counts. They sound open and articulate, and if there’s detail in a recording to be extracted, you can rely on them to do just that.",
  "pros": [
    "Widescreen, detailed, and quite upfront sound",
    "More comfortable to wear than they look",
    "Great app and good touch-control"
  ],
  "cons": [
    "Can be excitable with treble sounds",
    "Ordinary battery life",
    "Don’t quite look or feel the asking price"
  ],
  "article": [
    "Having established its credentials as a high-end true wireless earbud front-runner with two generations of its Momentum True Wireless, Sennheiser’s now turned its attention to the less rarefied area where Apple, Microsoft, Sony and all the rest duke it out. At £169 / $199 / AU$299 / AED799, the CX400BT are pitched right into the thick of the action.",
    "Happily, the CX400BT are specified to compete. They have aptX Bluetooth connectivity, with SBC and AAC codecs catered for too; they have app-based EQ adjustment; they have responsive touch-controls (which can be customised in the app); and they can be operated using Google Assistant or Siri.",
    "They share the same 7mm full-range dynamic driver as their more expensive Momentum True Wireless 2 siblings too, though they go without that model’s active noise-cancelling technology. Thanks to four sizes of eartip in the packaging and the twist-to-fit arrangement, there’s actually quite a lot of passive noise-cancelling delivered once you’ve established the correct fit.",
    "On an aesthetic level, there’s not a great deal to discuss – Sennheiser has never been the showiest headphones brand around, and anyone expecting a little Apple or Microsoft-style weirdness is going to be disappointed. The plastics they’re built from don’t feel anything special, and in all honesty the CX400BT look a little clumsy in situ, but despite a 6g-per-’bud weight they prove comfortable even over extended periods.",
    "‘Extended’ in this instance means a battery life of up to seven hours from the earbuds themselves – there’s another 13 hours held in the charging case. A total of 20 hours’ battery life is by no means a disaster, but it puts the Sennheisers at a mild disadvantage compared to any number of nominal rivals.",
    "The word ‘disadvantage’ doesn’t apply where the sound of the CX400BT is concerned, though. They’re an open, eloquent and prodigiously detailed listen, with some particular talent where texture and timbre are concerned. Only the rather assertive treble frequency response stops the Sennhesiers scoring the full five stars.",
    "The Sennheiser CX400BT are available to buy from September 15, 2020, and cost $199 / £169 / AU$299 / AED799.",
    "That puts them at the same price point as the Apple AirPods with Wireless Charging Case (unless you can find a great AirPods deal, that is), but cheaper than noise-cancelling rivals like Sennheiser’s own Momentum True Wireless 2 and the Sony WF-1000XM3.",
    "Cheaper wireless earbuds are available, though; the Lypertek Tevi and Camrbidge Audio Melomania 1 are two examples of true wireless earbuds without ANC that sound great and cost under $100 / £100 / AU$150.",
    "Sennheiser doesn’t so much ‘design’ a product as ‘put all the necessary components inside a housing’ – and it’s safe to say that ‘design’ doesn’t seem to have been any more of a consideration with the CX400BT than with any other product in the Sennheiser catalogue.",
    "Of course, there’s nothing wrong with the way the CX400BT are made. But the plastics from which they’re constructed don’t feel anything special, and they’re chunky enough to sit proud of the wearer’s ears when they’re in place. Despite the rather ungainly appearance, though, and the unpromising 6g-per-earbud weight, the CX400BT remain secure and comfortable for hours on end.",
    "The charging case is equally prosaic in its materials, and at 59 x 34 x 42mm and 37g (when empty) it’s no shrinking violet either. All this relative bulk makes the 20 hours’ all-in battery life of the CX400BT a bit of a disappointment.",
    "Still, the sizable Bluetooth earbuds means there’s plenty of room for a capacitive touch surface, and the Sennheisers prove very simple and responsive to operate. Between the left and right ‘buds, all the obvious stuff - ‘play / pause’, ‘answer / end / reject call’, ‘skip forwards / backwards’, ‘volume up / down’ and ‘summon voice assistant’ – is catered for. Voice assistants extend as far as Siri and Google Assistant – and thanks to some sharp-eared mics in each earbud, your assistant of choice will have no more trouble understanding you than anyone you’re having a telephone conversation with.",
    "It’s straightforward to tailor your CX400BT experience using Sennheiser’s exemplary ‘Smart Control’ app. Clean and stable where so many alternatives are busy and flaky, it’s everything you want from a control app – and the ability to rearrange the touch controls, fiddle with EQ settings, decide how to answer calls and so on, is extremely gratifying.",
    "The CX400BT are supplied with four sizes of silicone eartips and, as with all in-ear designs, it’s important to make sure you get the fit just so if you’re going to hear them at their best. It’s worth persevering with, because the Sennheisers’ best is really very good indeed.",
    "The company’s claiming a frequency response of 5Hz - 21kHz, and while the idea that the CX400BT can dig that deep is fanciful, there’s no doubting their low-frequency credentials. Once through Danny Keane’s Twenty Tonnes of Tension is ample for the Sennheisers to demonstrate their ability to shape bass sounds convincingly, loading them with information about texture and attack.",
    "Analogue and digital low frequencies scrap it out for primacy here, but the CX400BT have no problem spacing them out even as they’re integrated into the recording as a whole. The bottom end attacks with straight-edged clarity, and the decay of individual notes is well managed at the bottom of the frequency range as a whole.",
    "Up in the midrange there’s an equally gratifying amount of detail retrieved and laid out for inspection. Laurie Anderson’s voice during Let X = X is intimate, immediate and absolutely packed with fine details – and as a result, it’s entirely convincing. The CX400BT are an articulate and naturalistic listen on the whole, and nowhere is that more apparent than when they’re loading voices with character and emotional weight.",
    "This is a fairly empty recording, and while the Sennheisers keep the vocal front-and-centre they give due consideration to the spaces between the sounds in the background. Consequently it’s easy to understand the shape and scale of a soundstage, as well as individual instruments’ position on it.",
    "In virtually every other sonic respect the CX400BT are equally accomplished. They have enough basic dynamism to put proper distance between ‘very quiet’ and ‘very loud’, and they have sufficient talent with second-stage harmonic dynamics to make even the most minor variations plain. You’re never in any doubt the Sennheisers are handing over all available information, and maintaining it as a convincingly unified whole at the same time.",
    "About the only area where the Sennheisers overplay their hand is at the top of the frequency range. Unlike the more expensive Momentum True Wireless 2, which are the very model of high-frequency good taste, the CX400BT are confident to the point of recklessness. Eric B & Rakim’s Microphone Fiend demonstrates the treble edginess well – the Sennheisers are constantly threatening to become uncomfortably hard, and it’s a trait that becomes more pronounced the louder you listen or the more trebly the recording you’re listening to. It’s possible to dial down this top-end excitability in the control app, but you’ll need to take care you don’t neuter the sweet midrange response at the same time.",
    "Far be it from us to labour a point, but 20 hours all-in is not the most impressive battery life a true wireless in-ear ever enjoyed. Seven hours from the buds themselves, 13 in the case and a flat-to-full charging time of 90 minutes or so isn’t going to trouble the likes of the Cambridge Audio Melomania 1 or, for that matter, Sennheiser’s own Momentum True Wireless 2.",
    "Connectivity is via Bluetooth 5.1, and while there’s no aptX HD (or aptX Low Latency) compatibility here, the CX400BT are able to stream Hi-Res Audio files from the likes of Primephonic and Tidal without problems. And despite the lack of Low Latency functionality, we don’t experience any sync issues when streaming video content. Pairing is swift and proves secure even over quite long distances."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Sennheiser CX 400BT True Wireless price and release date",
    "9": "Design",
    "14": "Audio performance",
    "21": "Battery life and connectivity",
    "23": "Don't buy them if..."
  },
  "links": {
    "true wireless earbud": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Momentum True Wireless 2": "https://www.techradar.com/reviews/sennheiser-momentum-true-wireless-2-review",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "AirPods deal": "https://www.techradar.com/news/cheapest-airpods-prices",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Lypertek Tevi": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "Camrbidge Audio Melomania 1": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "Bluetooth earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}