{
  "source": "https://www.techradar.com/reviews/posteo",
  "title": "Posteo secure email review",
  "category": "computing",
  "updated": "2020-11-17T15:23:56.638Z",
  "author": "daniel-blechynden",
  "summary": "Secure email backed by powerful encryption",
  "verdict": "All things considered, Posteo lives up to its reputation as one of the world’s best secure email providers. It uses industry-standard encryption, is backed by great features, and is very competitively priced.",
  "pros": [
    "Powerful encryption features",
    "Very affordable prices"
  ],
  "cons": [
    "Limited customer support",
    "No custom domain options"
  ],
  "article": [
    "Different people require secure email services for different reasons. It might be that you wish to remain anonymous, that you want to keep your personal details off the internet, or that you need to send sensitive information that has to be protected at all times.",
    "We’ve been searching for the best secure email providers, and we’ve reviewed countless high-quality options. In our complete Posteo review, we highlight everything you need to know about this attractive and reliable secure email service.",
    "Posteo uses a very simple price structure. As a European provider, it uses the euro as its base currency. Access to all services, including secure email, an address book, and a calendar, costs just €1 per month (Just over $1 USD). This gets you up to 2GB of secure storage and two alias email addresses.",
    "Additional storage can be added for just €0.25 per GB per month, and extra alias email addresses cost €0.10 per address, per month (with a limit of 20). Payment can be made via credit card, PayPal, or bank transfer. Payments are anonymous, and you can cancel your subscription at any time (as long as you provide at least 14 days’ notice).",
    "Posteo’s secure emailing services are backed by a range of impressive features. For starters, you can use the program on any device, enabling you to synchronize across computers and mobile devices as required. You can also migrate up to three existing email accounts when you start using Posteo, so you can bring important mail with you.",
    "On top of this, Posteo comes with a great selection of email filtering tools. You can create unlimited filters to sort incoming mail, making ongoing management very straightforward. You will also be able to take advantage of high-powered spam and anti-virus filters, protecting your account from hackers and malicious third parties.",
    "Those migrating from an existing service will benefit from Posteo’s email collection tool, which connects to your old account and forwards new messages to your Posteo account. You can also set up various forwarding and autoreply settings, and your email address can be personalized with country codes such as @posteo.de, @posteo.co.uk, and so on.",
    "All things considered, Posteo does everything we would expect a high-quality, reliable secure email service provider to do. What’s more, an email account subscription will also give you powerful address book and calendar tools, which is a neat bonus.",
    "Posteo uses the open-source Roundcube webmail interface, which is simple yet functional. While you won’t have access to a huge number of advanced tools, you will find everything you need here. On top of this, Posteo is very easy to use. The layout is intuitive, and you shouldn’t have any trouble getting started.",
    "Unfortunately, Posteo’s customer support services are quite limited. There are no phone or live chat support options, and email service is only available Monday to Friday from 7am to 7pm GMT. On the plus side, English, French, and German language support is available.",
    "Luckily, Posteo does have a very impressive help center that contains a suite of self-help resources. Here, you will find documentation and comprehensive tutorials on everything from setting up your new email account to configuring your security settings, and much, much more. Once again, all self-help resources are available in English, French, and German.",
    "Security is an extremely important consideration when you’re looking for a secure email provider, and Posteo excels from square one. When you sign up for an account, you won’t have to enter any personal details, which means you won’t ever be able to be identified through your accounts. Payments are anonymized, and all emails are stripped of potentially identifying IP addresses.",
    "What’s more, Posteo’s service is backed by extremely powerful encryption features. The company’s servers use industry-standard AES encryption, all email transmissions are protected with TLS encryption, and there is even an option to stop sending if the receiver is using an insecure mail client. And that’s not all—there are countless other features that we just don’t have time to cover here.",
    "Posteo provides high-quality, reliable secure email services, but that doesn’t mean it will be the right option for everyone. There are countless alternatives worth looking at.",
    "For example, ProtonMail offers both free and premium secure email services with a focus on data protection. With it, you can create emails that will automatically expire after a specified time period, and all transmissions are heavily encrypted. And, there are even native iOS and Android apps to streamline your experience.",
    "Another great alternative is Zoho Mail. Although it doesn’t focus solely on secure email services, it remains an extremely powerful platform. You will also be able to easily integrate your email with the rest of the Zoho ecosystem.",
    "All things considered, Posteo provides some of the best secure email services we’ve used. It’s extremely affordable, comes with a range of great features, and is backed by extremely impressive security integrations. Although the company’s somewhat limited customer support will be a concern for some, there’s little else to worry about here.",
    "The bottom line: If you’re looking for a reliable secure email provider with a reputation for excellence, Posteo might just be the right option."
  ],
  "headers": {
    "2": "Posteo: Plans and pricing",
    "4": "Posteo: Features",
    "8": "Posteo: Interface and in use",
    "9": "Posteo: Support",
    "11": "Posteo: Security",
    "13": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "secure email services": "https://www.techradar.com/best/best-secure-email-providers",
    "best secure email": "https://www.techradar.com/news/best-email-provider",
    "Posteo": "https://posteo.de/en",
    "calendar": "https://www.techradar.com/best/best-calendar-apps",
    "email addresses": "https://www.techradar.com/best/best-email-clients",
    "credit card": "https://www.techradar.com/best/best-credit-card-processing-service",
    "anti-virus": "https://www.techradar.com/best/best-antivirus",
    "open-source": "https://www.techradar.com/best/best-open-source-software",
    "IP addresses": "https://www.techradar.com/news/what-is-an-ip-address",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "ProtonMail": "https://www.techradar.com/reviews/protonmail-secure-email",
    "Zoho Mail": "https://www.techradar.com/reviews/zoho-mail-review"
  }
}