{
  "source": "https://www.techradar.com/reviews/asus-strix-scar-15-2020",
  "title": "Asus Strix Scar 15 (2020) review",
  "category": "computing",
  "updated": "2020-09-18T20:08:34Z",
  "author": "michelle-rae-uy",
  "summary": "Powerful gaming, tempting trimmings",
  "verdict": "The Asus Strix Scar 15 boasts enough power under the hood to rival desktop gaming PCs and a 1080p screen with a whopping 300Hz refresh rate, to start. If only that irksome trackpad worked better, this laptop might have gotten a higher score.",
  "pros": [
    "Powerful performance",
    "Incredibly fast screen",
    "Plenty of trimmings and hardware setting customizations"
  ],
  "cons": [
    "Trackpad is frustrating",
    "No webcam",
    "Fans can get pretty loud"
  ],
  "article": [
    "Gaming laptops like the Asus Rog Strix 15 are fast catching up to their desktop counterparts, proving that they too can handle the fastest and most demanding PC games (and toughest creative tasks) out there without so much as blinking an eye. That’s while also offering the convenience of portability that the modern world seems consumed with these days.",
    "The Asus Rog Strix 15 is hardly the perfect portable gaming machine. Its fairly thick and heavy chassis has some catching up to do, now that a few slim yet powerful gaming laptops are already hitting the shelves. Its fans are still pretty loud despite that larger space inside and its screen is dimmer than ideal. And, that pesky trackpad, while niftily moonlighting as a numpad, just can’t be reliable enough to save its life.",
    "Still, it’s a gaming laptop that carries a lot of power. Our review unit, for example, rocks Intel’s flagship i9-10980HK, an Nvidia RTX 2070 Super and 32GB of memory – there’s more than enough juice there for most AAA games. And, it’s definitely scoring a lot of points solely for that.",
    "But then, you factor in that beautiful 1080p screen with a delectable 300Hz refresh rate, a number of extra features like Keystone II and the incredibly immersive, highly customizable RGB lighting, and the availability of hardware setting customizations, and you’ve still got a powerhouse of a gaming laptop that’s worth shelling out for.",
    "That is, as long as you have the money to shell out, as the Asus Rog Strix 15 starts at a hefty $2,200 (about £1,700, AU$3,000).",
    "If you’re looking for a budget gaming laptop, you’ll have to look elsewhere. The Asus ROG Strix 15 is hardly wallet-friendly.",
    "Our review unit, which boasts an Intel i9-10980HK, Nvidia RTX 2070 Super and 32GB RAM, will set you back $2,800 (about £2,140, AU$3,900). To be fair, you’re getting a lot of power under the hood with that, as well as a total of 2TB storage and a super-fast 300Hz/3ms IPS-level panel. Premium specs, after all, come at a hefty price.",
    "If you do have a bit of cash but not quite as much, lower-end configurations are a bit more accessible. The lowest at $2,200 (about £1,700, AU$3,000) will get you an Intel Core i7, Nvidia RTX 2070 Super and 16GB RAM, with a 240Hz display and 1TB SSD. It’s still a pretty penny, but you’re saving a wad of cash while still getting a powerful GPU.",
    "The Asus ROG Strix 15 is made of sturdy, durable plastic dressed in that same ROG “advanced alien tech” aesthetic as its predecessor and that immersive RGB lighting on the keyboard and fringing three sides of its bottom rim.",
    "In fact, there’s quite a bit of RGB lighting here, ideal for all the RGB loving gamers out there, with eight areas that are all extremely customizable via the Aura Creator and Armoury Crate apps. The RGB lighting for each individual key on the keyboard is customizable as well, if you have the patience and time to do so.",
    "There’s also a decent selection of ports on the Asus Rog Strix 15, with three USB ports and a 3.5mm audio jack on the left side, the Keystone reader on the right, and the HDMI, USB-C and Ethernet ports in the back just below the display.",
    "Sadly, there’s no Thunderbolt 3 port on hand, which may turn some people off, and the placement of the USB-C port in the back seems a strange placement. However, if you’re not nitpicky about your ports, there’s little to complain about here.",
    "The display is the marquee feature. This 1080p panel is standard in terms of resolution, so if you’re all about AAA single-player games you may not be wowed by it. However, the 300Hz refresh rate (240Hz for the low-end configuration) and 3ms response time do bring the goods for esports players. Mirror’s Edge Catalyst, Rocket League and Doom: Eternal at the highest settings all look incredible on it, with no signs of screen tearing or stuttering. As do, of course, the not-so-fast games like Red Dead Redemption and Marvel’s Avengers.",
    "Another selling point here is Keystone II, a physical key that you insert in the reader on the right side of the laptop and is designed to set and restore system configurations. If you’re not familiar, this allows you to save settings such as light effects, trigger sounds and fan settings, quick launch apps or games of your choosing (at default, it’s the Armoury Crate), and access an encrypted virtual drive that you can use as your own private storage.",
    "It’s certainly a nifty addition, especially for those who do a lot of personalization and handle sensitive files. It certainly won’t be necessary for everyone, though. Then again, it’s not really what you’re paying that hefty sum for, so it’s something we can appreciate here without worrying about the price.",
    "The keyboard is decent, comfortable to use and with a decent amount of hotkeys, including one for disabling the trackpad, one for fan management and another for loading the Armoury Crate app.",
    "It isn’t perfect, however. Some keys – including the Home, Page Up and Page Down keys have been moved to the right in a column, shifting the whole keyboard slightly to the left. And, that takes some getting used to. Combined with the fact that the key symbols are harder to see, you can’t really get away without RGB lighting if you’re gaming in the dark. If you’re hoping to use the Reactive RGB present on hand in the Auro Creator software, be sure that you’re already used to this new configuration.",
    "We do have a bone to pick with the trackpad on the Asus Strix Scar 15. It has this nifty feature of moonlighting as a numpad, activated when you hold down the top right corner of the trackpad, and that comes in handy. You might even use them as hotkeys in games, whilst using an external mouse, for convenience.",
    "However, the trackpad itself is pretty erratic to the point of being annoying. It’s not very responsive or accurate, and it sometimes moves too freely, making it an unreliable tool for gaming. If you plan on gaming while traveling, make sure to pack that gaming mouse you have at home as well.",
    "Featuring an Intel Comet Lake CPU and the RTX 2070 Super, there wasn’t any doubt that this particular configuration of the Asus Strix Scar 15 was going to be powerful. After all, the RTX 2070 Super is meant for 1440p gaming with ray tracing, and it’s only working at 1080p resolution here. But, even its lowest configuration should be able to run graphics-intensive games at high settings.",
    "Of course, for the purpose of this review, we’re looking at the former – the highest configuration in this series. It’s certainly powerful enough to rival some of the more powerful gaming PCs out there. It can run the most demanding games right now at 300Hz and its response time can be driven down to 3ms via the software, because of those aforementioned specs.",
    "It’s able to run Horizon Zero Dawn at the highest settings the game looking as immersive as it would on a fairly powerful gaming desktop. As it does with Red Dead Redemption 2 and Shadow of the Tomb Raider, without any signs of ghosting, stuttering or latency.",
    "And, as we mentioned earlier, fast-paced games like Mirror’s Edge: Catalyst and Rocket League, where you’re making fast movements and turns, look butter smooth and crisp.",
    "The first time we tested it with Marvel’s Avengers, there were signs of ghosting at the highest setting with the 300Hz refresh rate. However, seeing as that game is somewhat buggy, we decided to restart the game. The second test ran smoothly, and we haven’t experienced any issues since, so we’re chalking that up to the game’s issues.",
    "One thing also worth mentioning here is that this configuration boasts two SSDs running in RAID 0, giving you a whopping 2TB of space. We have at least 20 games installed on this thing – not all of them AAA, but a good chunk are – and there weren’t any drive issues or bottlenecks here.",
    "For thermal efficiency, you can customize the fans setting via the Armoury Crate app, giving you the option to set them to Windows, Silent, Turbo, Performance or Manual. So, for the most demanding games, you can set them to one of the highest settings to keep your laptop fairly cool. That’s because on Silent mode, the internals do get hot, with the CPU getting into the 90s Celsius and the GPU getting into the 70s.",
    "Setting them on Performance or Turbo, you obviously end up with better heat management – 70s Celsius for the CPU and 60s for the GPU. However, the fans also get pretty loud and blow hot air out the side and back. Be sure to keep your headphones handy and your external mouse a decent distance away when you’re about to play something intensive. Luckily, while the keyboard does heat up while gaming and may get a little uncomfortable to use, we've definitely experienced worse.",
    "The Asus Strix Scar 15’s battery life is not anything to write home about. It’s typical of gaming laptops, coming in at under 2 and a half hours for both our movie and PCMark 8 battery tests. There are other laptops for gaming with battery life worthy of Ultrabooks – the Asus TUF A15, for example, can deliver up to 12.5 hours. During our movie battery test, we also noticed a bit of stuttering every 10-20 seconds when the battery was really low.",
    "Still, considering this laptop is powering a heavy-duty RTX 2070 Super, that battery life is not egregiously bad. Just bring the charger with you, if you plan on gaming on-the-go – and perhaps a portable laptop charger, if you know there won’t be outlets where you’re going."
  ],
  "headers": {
    "0": "Two-minute review",
    "5": "Price and availability",
    "8": "Design",
    "19": "Performance",
    "27": "Battery life",
    "29": "Don’t buy it if…"
  },
  "links": {
    "Gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Intel’s flagship i9-10980HK": "https://www.techradar.com/news/intels-core-i9-10980hk-can-hit-53ghz-but-will-it-be-more-of-a-battery-killer-than-a-performance-king",
    "Nvidia RTX 2070 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070-super",
    "Doom: Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Red Dead Redemption": "https://www.techradar.com/news/red-dead-redemption-2-pc-release-date-news-tips",
    "Marvel’s Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "gaming mouse": "https://www.techradar.com/news/best-gaming-mouse",
    "Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Asus TUF A15": "https://www.techradar.com/reviews/asus-tuf-a15",
    "portable laptop charger": "https://www.techradar.com/news/best-portable-laptop-battery-chargers-and-power-banks"
  }
}