{
  "source": "https://www.techradar.com/reviews/oppo-a5-2020-review",
  "title": "Oppo A5 2020 review",
  "category": "phones",
  "updated": "2020-03-16T14:57:05.381Z",
  "author": "david-nield",
  "summary": "Add the Oppo A5 2020 to the list of best budget phones",
  "verdict": "The Oppo A5 2020 when judged against its price comes out very well indeed: for not much money at all, you get a device that is competent in most areas and really good in a couple.",
  "pros": [
    "Solid design",
    "Superb battery life",
    "Spacious screen"
  ],
  "cons": [
    "So-so performance",
    "Unimpressive camera",
    "Slow charging"
  ],
  "article": [
    "The Oppo A5 2020 is one of the latest phones to appear in the crowded budget-to-mid-range part of smartphone land, and it proves that Oppo can continue to make compelling devices in this section of the market.",
    "It's very similar to the Oppo A9 2020, with the major difference being the camera setup. The A9 has a superior rear camera array, and will cost you a bit more, but if you want to spend as little as possible on your next phone then the A5 is definitely worth a look.",
    "You can pick up the Oppo A5 2020 for around £180 online in the UK and AU$300 in Australia, though as yet we don't have confirmation of a US release. That's not very much money for a smartphone at all, and everything else in this review has to be weighed against the price of admission.",
    "Of course, there's plenty of competition at the lower end of the market – from the likes of Motorola, Honor, Realme and others – but the Oppo A5 2020 does enough to make it worthy of some serious consideration for the budget-conscious.",
    "Take a look at the Oppo A5 2020 and you can tell it's not a premium-level, flagship phone, and it's the same when you pick it up. At the same time it's fair to say that the handset looks more expensive than it actually is – sure, it's clad in plastic and looks unoriginal, but it's nicely curved and finished.",
    "Black and white are your rather ho-hum color choices here, with Oppo attaching a plastic screen protector in the factory and bundling a silicone case with the phone too. So if you want some basic protection for your new handset, you won't necessarily have to go out and buy a separate case.",
    "With that 6.5-inch screen and a thickness of 9.1mm, this is not a compact handset, though you can just about use it with one hand (if you have big-ish hands and dexterous fingers). It's good for getting a lot on screen at once, but it's not so good for stuffing into a small pocket.",
    "Oppo has put the power button on the right here, with the volume controls on the left. The headphone jack (yes, there is one) is down at the bottom of the device, together with a speaker grille. Oppo has thankfully gone for USB-C as the data port, with some budget models still resorting to micro USB.",
    "The fingerprint scanner is up on the back. The phone isn't dust or waterproof, but then you wouldn't really expect that from a phone at this price – corners have to be cut somewhere, so just make sure you don't drop it in the bath or leave it out in a sandstorm.",
    "While the design of the Oppo A5 2020 won't exactly set hearts racing, we've seen a lot worse down at the budget end of the Android market, so we can't really fault Oppo too much in this department. You're not going to be embarrassed to take this out in front of friends and family at least.",
    "You get a lot of screen for your money – 6.5 inches – but the Oppo A5 2020's LCD display is running at a relatively low resolution of 720 x 1,600 pixels (that works out at 270 pixels-per-inch). A super-sharp, hi-res display panel this is not.",
    "The good news is, it doesn't really matter too much. Text and icons remain legible and sharp, and video still looks fine. It's one of those specs that might look worrying on paper, but which isn't going to have all that much effect on your actual smartphone experience in the end.",
    "Of course the difference between this and one of Samsung's high-end Super AMOLED screens is going to be noticeable, but – as with everything else that the Oppo A5 2020 brings to the table – you have to factor in the price you're paying. We didn't find ourselves particularly unhappy or disappointed with the display.",
    "There's a teardrop notch at the top of the screen, and a slightly chunky bottom chin, but the side bezels are nice and narrow – that allows the screen to really pop out, and we found it bright and vibrant in use.",
    "There's actually a Full-screen Display mode available that lets you choose whether apps hide the notch (with a solid black bar) or not, as well as a slider for changing the color temperature from cool to warm.",
    "We found the default color temperature worked just fine, though if pushed to make an adjustment we'd probably go cooler. The auto-brightness setting seems to work well too, and picks up ambient lighting conditions well, but you can override this and set the brightness manually if you prefer.",
    "The trend towards larger screens continues across the industry as a whole, and this is one of the largest you're going to come across at the moment.",
    "If you want a budget phone that comes with a big display, then the Oppo A5 2020 certainly fits the bill, and we don't think you're going to be disappointed with the display quality either."
  ],
  "headers": {
    "4": "Design",
    "10": "Screen"
  },
  "links": {
    "Oppo A9 2020": "https://www.techradar.com/reviews/oppo-a9-2020"
  }
}