{
  "source": "https://www.techradar.com/reviews/dvdfab-hd-decrypter",
  "title": "DVDFab HD Decrypter review",
  "category": "computing",
  "updated": "2020-02-21T12:11:45Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Rip DVDs and Blu-rays to your hard drive for free",
  "verdict": "As long as you're not looking to rip newer or strongly protected discs, this is a decent tool for your ripping needs.",
  "pros": [
    "Available for Mac and Windows",
    "Very quick and easy to use",
    "Reasonable choice of output options"
  ],
  "cons": [
    "Can't rip newer discs",
    "Doesn't bypass all DVD protection",
    "Limited ripping options"
  ],
  "article": [
    "You'd be forgiven for being a little confused about DVDFab HD Decrypter. When you download and installed the software, you actually end up with DVDFab 11; that's because it's a free component of the paid-for DVDFab 11. You are essentially installing a trial version of the commercial DVD ripper, but regardless of whether you decide to upgrade at the end of the trial, you can continue to use HD Decrypter free, forever",
    "The software developer advises users that the program \"allows users to copy/convert nearly all the DVDs (except for adult DVDs and those containing multiple VTS protections) and Blu-rays released before 2018\". Providing your needs don't fall outside of these limitations, you should be good to go.",
    "When it comes to ripping, you can convert entire discs or individual titles into MKV or MP4 format, so you can enjoy your movies on a laptop as you travel, without the need to take your DVD collection with you.",
    "The program works with PAL and NTSC video standards, and you can opt to retain or strip out additional languages and subtitles during the ripping process. The only real downside to the program is that it is not guaranteed to work with all discs.",
    "The entire scanning, configuring and ripping process is pretty simple – there's not really any scope for getting things wrong. The program tries to help you out by automatically trying to work out what you're likely to want to rip from a given disc, and this saves a bit of time for each ripping session.",
    "As DVDFab HD Decrypter is part of DVDFab 11, unless you choose to pay for the full version you'll be constantly pestered to upgrade. This will get annoying after a while, but it doesn't affect your ability to rip discs – you just need to turn a blind eye to the nagging."
  ],
  "headers": {
    "4": "User experience",
    "6": "You might also like"
  },
  "links": {
    "DVDFab HD Decrypter": "https://www.dvdfab.cn/download.htm",
    "DVD ripper": "https://www.techradar.com/news/the-best-free-dvd-ripper"
  }
}