{
  "source": "https://www.techradar.com/reviews/jabra-elite-45h-review",
  "title": "Jabra Elite 45h review",
  "category": "audio-visual",
  "updated": "2021-07-15T14:43:23Z",
  "author": "simon-lucas",
  "summary": "The best value on-ear headphones you could buy?",
  "verdict": "The Jabra Elite 45h are more convenient, better built and – most crucially of all – better sounding than they have any right to be at this money. They’re not absolutely perfect, but then they cost 20% of headphones that are.",
  "pros": [
    "Weighty, balanced sound",
    "Impressive battery life",
    "Useful app"
  ],
  "cons": [
    "Leak sound somewhat",
    "Iffy call quality",
    "Can heat your ears more than a little"
  ],
  "article": [
    "Having established its credentials as manufacturer of some of the very best true wireless earbuds and Bluetooth earphones around, Jabra’s now turned its full attention to wireless on-ear headphones. The Elite 45h are nominally a replacement for the company’s Move Style wireless on-ears – and their combination of colossal battery life, fully competitive specification, and decently realized sound quality puts them right up near the top of the class.",
    "For just $79 / £69/ AU$99, Jabra has wrapped Bluetooth 5 connectivity, 40mm full-range dynamic drivers and a smattering of physical push-button controls in a wireless on-ear frame. Faux leather and memory foam, combined with winningly un-creaky plastic, make for a comfortable fit (even if the earpads themselves absorb ear-heat quite quickly and then give it straight back).",
    "There’s voice control available from Amazon Alexa, Google Assistant, or Siri. Jabra’s Sound+ control app even walks you through a brief hearing test to establish exactly how the EQs should be set to best suit your ears. By the standards of overtly affordable headphones, the Elite 45h are feature-packed.",
    "And who’s about to argue with 50 hours of battery life from a single charge? There are very few headphones around, at any price, that can challenge that figure – and the Jabras will go for another 10 hours after just 15 minutes of USB-C charging.",
    "The Elite 45h don’t feel all that special, it’s true – the plastics are a little hard, and the padding on the headband really couldn’t be any thinner. But context is everything, and with the price uppermost in your mind there’s really not much to complain about here. And despite the fairly prosaic nature of the materials, the Jabras are properly constructed, fold fairly flat and feel like they’ll stand up to quite a lot of careless handling.",
    "Best of all, the Elite 45h sound quite a lot more expensive than they are. The highest frequencies are never far from sibilance, admittedly, and bass can occasionally sound slightly estranged – but it’s all about context, remember? The Jabras don’t emphasize any part of the frequency range, they uncover plenty of detail, they’re punchily controlled and an all-around fully enthusiastic listen – which ought to make them sound like worthy of anyone’s money.",
    "The Jabra Elite 45H were released in June 2020, having been announced at CES 2020 back in January.",
    "They’re available to buy for $79 / £69 / AU$99, making them cheaper than many of the best wireless headphones of 2020 – admittedly many of the pricier models come with extra features like noise cancellation, but the Jabras still offer a long battery life, support for voice control, and sound quality that you might expect from more expensive headphones.",
    "‘Functional’ is perhaps the best way to describe the design of the Jabra Elite 45h – but then pretty much every pair of on-ear headphones look functional, doesn’t it? There’s not a lot of scope here for showy design flourishes.",
    "At 160g the 45h are light enough to remain comfortable for hours on end, and while you may have to fiddle with the fit just a little to get the earcups to sit flush on your ears, once they’re in position they feel secure.",
    "Part of that pleasantly light weight build, is due to the fact that Jabra has specified some fairly thin plastics – but there’s nothing wrong with the way the 45h are put together, and there are no creaks or groans from the frame when it’s on your head. No matter how securely you position them on your ears, though, you won’t be able to prevent some sound leaking out.",
    "The earcups articulate on their yokes to fold pretty much flat, and the looks are kept clean thanks to the headband adjustment arms being concealed in the headband itself. There are no stops or detents, but once you’ve got the correct amount of adjustment the Jabras will maintain their position quite happily.",
    "The right earcup is doing all the work as far as the physical interface is concerned. There’s a slider for ‘power on / off / Bluetooth pairing’, a USB-C input for the rare times you’ll need to charge the battery, a three-button array covering ‘volume up / down’, ‘skip forwards / backwards’ and ‘play / pause’, and one further button to summon your voice assistant of choice.",
    "There’s a two-mic array built into the right earcup, too - and in truth it’s perhaps the least impressive aspect of the Jabras’ performance. The company’s claiming some noise reduction on outgoing voice signals and wind noise protection, but in any event calls suffer from extraneous noise of all kinds. Bounce-back of your speaking voice, wind noise, otherwise-inaudible sounds of the frame flexing… if you prioritize call quality over sound quality, the 45h may not be for you.",
    "The Sound+ app is a fair bit more impressive. It features a few EQ presets, as well as five-band custom equalization and the ability to both name and save a custom preset. On first acquaintance it’ll ask your age (rude) and then run through a few test tones to find out what sort of state your hearing is in – some mild adjustment to the Jabras’ default EQ will then follow. There are numerous other options to make your 45h experience as personal as you like – and the app, mercifully, proves stable throughout.",
    "If the idea of a ‘perky’ sonic signature appeals, you should read on. The Jabra Elite 45h have almost more perk than they know what to do with. If ‘perky’ sounds tiring to you, though, you might want to go and have a nice lie down while the rest of us discuss just how lively and up-front the 45h sound.",
    "There’s real vigor and enthusiasm to the way the Jabras deliver music. From the foot-to-the-floor attack of Neil Young’s Rockin’ in the Free World to the rather more measured No Church on Sunday by Princess Chelsea, the 45h are an animated, up-and-at-’em listen with little in the way of patience.",
    "Tonally, there’s not a lot to take issue with here. The 45h are notably confident where low frequencies are concerned, and while there’s not much wrong with the extension or control of bass notes, their forthright nature can sometimes make them sound slightly dislocated from all the frequency information above them. However, the bottom end is nicely detailed, and there’s decent discipline where individual notes or hits start and stop.",
    "There’s similar animation in the midrange, so singers really sound like they’re giving it everything they’ve got (even if, as with Princess Chelsea, they’re shooting for ‘remote’ and ‘detached’). Again, detail levels are impressively high – and there’s enough space on the Jabra soundstage to allow a vocalist as much room to maneuver as they need.",
    "A few problems lurk at the top of the frequency range, though. Treble always sounds a bit edgy when it’s delivered by headphones as lively and engaged as these, and on plenty of occasions the 45h can sound this close to becoming downright aggressive. It never quite happens, though – the Jabras stay just about on the right side of the line. It’s possible to finesse the treble response in the app, of course – but the range of adjustment is too subtle to make a significant difference.",
    "In most other respects, too, the 45h give a confident account of themselves. It almost goes without saying that they’re as dynamic as you like, more than willing to shift up from ‘quiet’ to ‘loud’ – and, ideally, ‘louder still’. To their credit, the Jabras maintain what poise they have even if you decide to really pour on the volume – the three-dimensionality of their soundstage doesn’t disappear just because things are louder.",
    "Yes, you may only play at a moderate volume to achieve it – but there’s no arguing with 50 hours of playback from a single charge of the battery. Off the top of our heads, we can’t think of a rival pair that can top this kind of stamina. And should the worst happen, the 45h can be fully charged from flat in around 90 minutes.",
    "There’s no pizzaz (or, more accurately, no aptX capability) where the Jabras’ Bluetooth implementation is concerned, but Bluetooth 5 is more than adequate for getting Hi-Res Audio streams from the likes of Primephonic or Tidal on board. And having made a wireless connection, the 45h are inclined to hold on to it – for once, a quoted range of 10m turns out to be pretty accurate."
  ],
  "headers": {
    "0": "Two-minute review",
    "6": "Jabra Elite 45h price and release date",
    "8": "Design",
    "15": "Audio performance",
    "21": "Battery life and connectivity",
    "23": "Don't buy them if..."
  },
  "links": {
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Bluetooth earphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "on-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-on-ear-headphones-1304537",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "best wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Tidal": "https://www.techradar.com/reviews/tidal"
  }
}