{
  "source": "https://www.techradar.com/reviews/apex-legends-review",
  "title": "Apex Legends review",
  "category": "gaming",
  "updated": "2020-03-13T10:08:22Z",
  "author": "matthew-forde",
  "summary": "A legend in the making",
  "verdict": "Apex Legends is an engrossing, revamped take on battle royale that as it stands cannot be beat for its attention, detail and care.",
  "pros": [
    "Fun, fluid gameplay",
    "Ingenious Ping System",
    "Stellar lineup of personalities",
    "Phenomenal take on the genre"
  ],
  "cons": [
    "A few weapons need refining",
    "Battle Pass mundane"
  ],
  "article": [
    "Five years ago, the battle royale genre was barely existent. Titles like PlayerUnknown’s Battlegrounds and Fortnite catapulted the new craze to heights unheard of. With every influencer possessing half a streaming setup jumping into the phenomenon, you literally cannot avoid the buzz. Terms like “winner winner chicken dinner” and “where we dropping boys?” have now transcended videogames media into general pop culture, which for better or worse, is hard to dispute as anything but an achievement. Then on February 4, 2019 a new challenger arose.",
    "Respawn Entertainment stealth-dropped Apex Legends to the world and within a week reached a player base of 25 million. That’s a feat many developers dream of as a lifetime goal - not in seven days. It’s easy to see why it’s been so successful, with Apex pulling heavily from Respawn’s acclaimed Titanfall universe, even going as far as to call it a spinoff. However, Apex stands on its own two legs better than anything the studio has released prior.",
    "We'll be continuing to update this review intermittently to assess how Apex Legends' updates and battle passes affect the game. However our initial review score and verdict will not be changed.",
    "Apex Legends has been with us for a year now and, due to its status as a ‘game as a service’, we think it’s important to update our thoughts on it.",
    "A lot can happen in a year. Taking advantage of every opportunity, Respawn has gone from promising up-and-comer to EA’s ace in the hole, thanks to the humongous success of Star Wars Jedi: Fallen Order and of course, Apex Legends.",
    "Season 4 – Assimilation kicks off to celebrate the anniversary, bringing with it the already initiated sequence of a new character, weapon, map alteration and battle pass, among other collectibles. It’s a tried and tested formula, keeping both fans and the developers confident of the quality to come over the coming months.",
    "Scarpering from the claws of death, destined to repeat the endless cycle in a state of limbo, Revenant made his unorthodox entrance in sanguinary fashion. Stealing the spotlight from cyborg MMA fighter Forge in a trailer teasing the next Legend, professional mercenary Revenant was confirmed shortly after in a John Wick meets Terminator-style arrival.",
    "For the most part, this has been one of Respawn’s greatest assets: its storytelling. Its labor of love to the lore of Apex. Its bold approach to just what a battle royale can be by expanding in cinematic, blockbuster ways that wouldn’t feel out of place as a Netflix anime.",
    "Additionally, it’s even sweeter when the new characters not only play well but bring a different philosophy to the game altogether. Revenant is a malicious brute that is only obsessed with killing. Nothing like the happy-go-lucky Octane or oblivious Pathfinder, no the machine is out for blood and (alongside Caustic) is a straight up villain that the title craved.",
    "Moves wise, brings an interesting setup with his Tactical (Silence) shutting down any rival abilities, Passive (Stalker) increasing speed on walls and when crouched and Ultimate (Death Totem) being able to bring players back to life if killed in battle. They all have their caveats, however.",
    "Disabling enemy moves is all well and good but it basically brings the characters down to equal ground, instead of giving one a momentary advantage. More so, increased movement is barely noticeable, while the totem takes away shield power completely; meaning new strategies will need to be devised to really benefit.",
    "After an extended period solely with World’s Edge, there’s been an outcry from fans to return to the original map, King’s Canyon. It’s hard not to pine either. Still, cracking open Capital City and positioning a Planet Harvester in the centre where the Fuel depot once was does make things more interesting. For instance, the long corridor stretches within the apparatus provoke quick combat, as the split city offers breathing room like never before. Overall, it’s a welcome change.",
    "The Sentinel bolt-action sniper rifle arrives as the new firearm, and it’s fine. It does what’s expected, featuring more recovery time then others, just don’t go in expecting to be blown away like prior newcomers, such as the Charge Rifle.",
    "The same can be said for the Battle Pass - it’s more of the same, which isn’t a bad thing after the initial season one incentives. Even so, maybe when Season 5 rolls round it’ll be time for a big revision but for the time being, it’ll satisfy long-term players (or someone that has clocked in around 180 hours and counting).",
    "Apex brilliance has stemmed from both its consistency and radically different altercations via special events. The Grand Soirée gave players two weeks of chaos where if players missed a day or two then a new mode could be missed entirely. It was simply fantastic, though the more worrying aspect is that now after 365 days of general play, are the themed events and special modes arguably the most enticing element? Time will tell.",
    "Apex Legends may only be a few months old but Respawn Entertainment has been working diligently on rolling out several quality-of-life improvements and ushering in one of the game’s largest overhauls to date.",
    "Apex Legends Season 3 – Meltdown is now live and with it comes a new character, weapon and battle pass, along with a host of other changes both big and small. Most excitedly however, is that Kings Canyon is no more.",
    "A new map - that sees fire and ice clash in spectacular fashion - has arisen in the form of World’s Edge. Let’s start off with the obvious: it’s huge, it’s bright and it’s going to take some time getting used to. This is only the second map to be implemented into Apex Legends, yet it’s radically different with dozens of hidden nooks and crannies.",
    "Already we’ve ran into a number of sealed loot vaults that appear to be counting down to a particular date. This kind of content is exactly what keeps the conversation going and is exactly what the community thrives off.",
    "Next to the lava-infested Thermal Station and frozen Epicenter, World’s Edge is home to lengthy natural plains that make long-play king. Snipers will be right at home (especially considering the satisfying new Charge Rifle), while those looking for close combat will be better equipped in Capitol City, Skyhook or the Sorting Factory.",
    "The fact that Respawn has managed to craft this new territory just eight months on from release is mighty impressive. Sure, the skeleton of Kings Canyon can be found if you look close enough and certain interior layouts seem identical, but World’s Edge is truly scintillating.",
    "Not to mention there’s erupting geysers, a towering tree and an open train circling the map. Everything just screams fun. For the time being, the locomotive will be where the majority of users will head for a good old-fashioned scrap, similar to Kings Canyon’s Skull Town. Players will be lucky to leave unscathed but those that do are treated to high-tier loot and even the opportunity to stop the train by pressing a button in the forward car.",
    "After being teased in Season 2, Meltdown brings in the surveillance expert Park Tae Joon or as he’s better known, Crypto. A much-needed recon character that can be accessed for 750 Apex Coins, Crypto helps balance out the roster (previously Bloodhound was the only character in this class). Crypto utilizes his Surveillance Drone to stay ahead of the competition by maneuvering the machine locally and spotting opponents – even highlighting their whereabouts for teammates.",
    "When charged, Crypto can kamikaze enemies with his drone to take away 50 shield points, slow down movement and destroy traps. When any of these moves are initiated, Crypto remains motionless until disturbed or chosen to exit.",
    "Knowing your adversary’s whereabouts is a huge bonus and one that does potentially raise some concern with just how good Crypto could be for top players. Regardless, his unique playstyle and captivating backstory make for another fantastic addition.",
    "The Season 3 battle pass, while still not amazing, is a sight better than anything that has come prior. More exciting skins and new trinkets that attach to weapons are all well and good but it’s the added currency (so players can spend freely on what they desire) that goes down best. Still, those looking for a Battle Pass that will keep them engaged until its conclusion - maxing out at level 110 - should look elsewhere.",
    "Ranked Leagues have remained the same, albeit a welcome change point system that rewards assists and multipliers. The severity of leaving a match when still able to be respawned has been upgraded too, now resulting in a delay to your next game, which in theory should help improve general play. Barely any issues were seen throughout the new seasons’ launch apart from an unusual bug that makes characters stand in a T-pose on the select screen. A more comical than worrying outcome.",
    "Whether lapsed or curious to see what the world of Apex Legends holds, Season 3 has proven that there is no better time to drop in.",
    "The sky is full of bloodthirsty raptors, Kings Canyon has been invaded by skyscraper-sized monsters, and the world of Apex has been turned on its head. Of course, this is the Apex Legends Season 2 launch which sees Leviathans and Flyers infiltrating the simple settlement of the planet Solace.",
    "After being teased for months, the land has been torn apart by wild animals, leaving areas changed and giving players a rethink when it comes to strategizing. The biggest of these changes has taken place in the Bridges sector, that has been demolished in favor of the multi-storey Cage, while the Cascades has been swapped for the more confined Containment.",
    "The former is more inventive and gives great precedence to that King of the hill-style dynamic. Consequently, this location has become extremely popular, with anyone below needing to be wary of eagle-eyed snipers scouting from above. Containment on the other hand is a nice change-up but nothing special.",
    "Back to the beasties for a moment, Leviathans will slowly move across the map with anyone unfortunate enough to be caught underneath the dinosaur’s ginormous feet meeting an untimely, though hilarious, death for onlookers. Flyers circle overhead, holding onto Death Boxes that contain high-tier loot. By shooting them down you can upgrade your inventory but risk giving away your position. There’s also a few Flyers trapped in cages, but it’s unclear at this time what the plan is for these particular dragons. Just don’t expect to be training any in the meantime.",
    "In addition to map changes, there’s also a new Legend on the block. Positioned as the poster girl for the Season 2, we have the electric-infused Natalie Paquette a.k.a Wattson. Devious but adorable Wattson is the daughter of the Apex Games’ lead electrical engineer Luc Pacquette, giving her arrival that extra context which Respawn does so well. Like all new inclusions, Wattson is unlocked by spending 750 Apex Coins - and she is absolutely worth the money.",
    "Apex was in need of another defensive-type character and Wattson’s playstyle fits this perfectly. Her Perimeter Security ability is a joy to any players patient enough to wait out the closing ring, on top of her Ultimate – Interception Pylon – that not only shocks enemies but restores shield damage. Considering the size of Gibraltar and Caustic, her hit ratio is significantly smaller. Put this together with the fact that she is generally a bit nimbler and Wattson is now the optimum pick for the class.",
    "It’s also worth mentioning the lengths the artists went to with the design, impeccably giving the character a Lichtenberg-figure scar - which is a common side effect of electricity.",
    "In addition to a new character, comes a new weapon: the L-Star LMG. Found in supply drops, the weapon deals a fair whack of damage but overheats if used too much. Initial impressions are that it feels damn good to use, if not a little over-powered. A re-balancing in the near-future seems inevitable.",
    "When it comes to Apex Legends’ Battle Pass Season 2, it seems Respawn has listened to the issues raised by players regarding the previous season’s lacklustre package, offering players not only new costumes and badges this time around but introducing music packs, skydive emotes and custom load screens - alongside a boost to crafting materials. This is what season one should have been and it’s exactly what we’ll keep us coming back for more.",
    "Skydive emotes specifically are a neat addition, taking clear inspiration from the success that Fortnite has achieved with its emotes both in and out of the game - although the levels necessary to unlock them seem a bit high. Emotes are unlocked specifically for each character (via the battle pass) every 10 levels or so, though for someone like myself who mains Wraith, it’s frustrating to see that her dance moves are locked until level 95.",
    "Not constrained to the battle pass, Respawn has also launched Ranked Leagues that see players gaining RP (Ranked Points) by performing well in matches. Everyone starts in Bronze IV, with Apex Predator I being the endgame for pros and Twitch streamers alike.",
    "The ranked system changes up play entirely, as immediately contenders dropping in are avoiding hot spots like there’s no tomorrow, instead opting for more tactical plays. In approximately seven hours of reasonably good play, we made it to Silver tier, proving that if you want that top mantle, you’re going to need your A-game. And that’s exactly what Apex has needed. Something to grind for. Something to keep players interested. Season 2 is here and could just be what is needed to get the casual audience back into the fight.",
    "[Below is our original review of Apex Legends.]",
    "Similar to other battle royales, Apex Legends contenders drop out of a cargo ship onto an island with the aim of being the last combatant standing while an ever-enclosing ring pushes players towards one another. Apex though, changes up the dynamic in a number of ways with the biggest difference being that you’re in a squad of three, with each user controlling a different legend.",
    "Running with this idea, killing enemies is not simply shoot and out. Once a foe’s heath is decimated the player is considered downed. Here, teammates can recover their squad member before they bleed out or are finished off by opponents. After this there’s a further period where teammates can grab their fallen comrade’s banner then return the player back to the action through the use of various Respawn Beacons spread out across the map. This idea keeps the game fresh while adding that extra edge and incentive to make sure enemies are gone for good.",
    "On entry, Apex will walk you through a tutorial giving you chance to work out the controls before entering Kings Canyon. For those familiar with Titanfall, it should be an easy transition. Everything is climbable in the world while the inclusion of a sliding mechanic makes traversal immensely satisfying.",
    "Working in a group is obviously the go to route but the game has been balanced to such a high-standard that whenever reduced to solo play, you never feel overwhelmed. In fact, the odds aren’t that slim of making it to the final two squads, if you play strategically. This is why a single player mode would make a great inclusion. Something hopefully that is planned for the game’s future since only one mode currently exists.",
    "Six characters are available from the start with two more accessible via in-game currency or by purchasing with real money. Keeping these characters locked was a wise-choice by Respawn as it gives players something to strive for, eventually becoming an accomplishment to boast about when earned. Each comes with their own wicked personality and set of individual abilities, while being separated into four classes: attacker, defender, healer and tracker.",
    "Real credit has to be given to how fleshed out and diverse the starting roster is (unlike a certain Blizzard franchise that stumbled out of the gates addressing this). From Mirage’s cheeky overconfidence to Pathfinder’s loveable schadenfreude, everyone truly feels unique with enough of a backstory given to fill in the blanks, albeit not too much that a manual-sized test regarding lore is needed upon arrival. It’s there if you want it, but in no way a necessity.",
    "Each legend has a Passive, Tactical and Ultimate move that play into their style. Lifeline for instance will naturally revive team teammates at a faster pace through her Passive, as well as deploying a Heath Drone (Tactical) and Care Package via her Ultimate for lots of high-quality goods (which we’ll come onto).",
    "Bangalore on the other hand will pull from her military background using a smoke launcher and an air strike to her advantage. For the most part, all seem varied with an equal amount of benefits for players to utilize. There are two exceptions to this however.",
    "The first being Mirage’s Vanishing Act that sends out numerous holograms of himself in an attempt to bamboozle opponents. It’s a cool concept but contradicts the idea of deception considering when rivals see more than one copy it becomes obvious none of them are real. Next to this is Pathfinder’s Inside Knowledge that scans survey beacons for the rings next location, which does very little to give users an edge.",
    "Over time you’ll naturally lean towards one persona. Wraith has become our personal pick, thanks to her agile skills that enable a void jump to escape weapon fire. On top of that, height-wise she’s the smallest, meaning her hit box is significantly less than big brutes like Caustic and Gibraltar. It’s these extra details that go a long way.",
    "At the time of writing, adrenaline junkie Octane has just been introduced to the already impressive roster. Inspiration for the character was taken from Titanfall 2’s speed running community showing how much Respawn value its fanbase. Octane is fun, fluid and another stellar inclusion.",
    "Kings Canyon itself is a medium-sized island covering rocky, industrial and swamp-like terrain. Compared to Fortnite’s map, Apex’s turf is much smaller but because of this feels better condensed. No zone feels wasted with every round feeling different.",
    "Not surprising, there are an abundance of weapons to get acquainted with. Snipers, shotguns, pistols, assault rifles and more all feature, alongside the now infamous Mozambique. Apart from this Nerf blaster, the lineup of firearms is adequate yet there’s room for improvement further down the line.",
    "Besides weapons, the bulk of your time will be spent finding/upgrading loot. Armor, health and weapon attachments are scattered throughout Kings Canyon ranging from common to the elusive legendary. Each match a blue circle will surround a certain area pinpointing where to find high tier loot, which presents the interesting conundrum of risking an early death for quality goods. There’s also a Supply Ship that crosses the land near the beginning (although it can descend some rounds) carrying top tier loot creating a further option.",
    "A shout out must be given to Respawn’s ingenious Ping System. As a completely online game that requires team coordination, normally microphones are required. In Apex this isn’t a necessity. Furthermore, it’s arguably quicker to use the in-game structure than yell that an adversary is incoming. Deeper than this, a simple button push can make allies aware of items, where to head next or whether to hold up in a spot. Everything is accounted for.",
    "Speaking of online, during our playtime little to no server issues were experienced. You might get the odd match where an ally drops out leaving two of you, still this seems out of the developer’s hands. It’s worth mentioning that the game will kick you out if no movement is detected after a little while, which can be a little annoying if your strategy is to wait out opponents or ‘camp’ as it were. Overall though, nothing of genuine concern.",
    "One thing that may bring up some concern however is the battle pass. Originally not released at launch, the Apex Legends battle pass has ended up being anticlimactic due to its uninspiring rewards. Something to reach long-term is part of the initiative surrounding a battle pass but even the highest-level cosmetics feel lackluster. Saying this, as a free-to-play title, Apex handles the loot boxes scenario reasonably well, never forcing real cash to exchange servers. A testament to this still experimental enigma.",
    "Truth be told, the Battle Royale movement has never quite grabbed me. I dabbled in PUBG and spent a dozen hours or so with Fortnite, yet nothing ever quite stuck the landing. Apex though, has got me hook, line and sinker. Featuring intuitive controls, an outstanding comms system and remarkable rogue’s gallery, Respawn has created what feels like the AAA outing for the genre."
  ],
  "headers": {
    "3": "Apex Legends: one year on",
    "15": "Apex Legends: eight months on",
    "28": "Apex Legends: five months on",
    "40": "Not simply shoot and out",
    "45": "Wicked personalities",
    "50": "Extra details go a long way",
    "55": "Ingenious Ping System",
    "58": "Verdict"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Star Wars Jedi: Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "Season 4 – Assimilation": "https://www.techradar.com/reviews/apex-legends-review",
    "Battle Pass": "https://www.techradar.com/how-to/apex-legends-battle-pass-season-one-price-release-date-and-roadmap",
    "Grand Soirée": "https://www.techradar.com/news/apex-legends-update-brings-7-limited-time-modes-and-may-reintroduce-your-favorite",
    "characters": "https://www.techradar.com/how-to/apex-legends-which-is-the-best-character-for-your-playstyle"
  }
}