{
  "source": "https://www.techradar.com/reviews/panasonic-toughbook-a3-rugged-tablet",
  "title": "Panasonic Toughbook A3 rugged tablet review",
  "category": "computing",
  "updated": "2020-08-19T19:32:10Z",
  "author": "anthony-spadafora",
  "summary": "Panasonic’s most rugged Android tablet yet doesn’t disappoint",
  "verdict": "The Panasonic Toughbook A3 is well-suited for tough jobs in less than ideal conditions thanks to its IP65 and MIL-STD-810G certifications. The tablet features an 800 nit display with anti-reflective coating for outdoor use and the device can easily be customized to meet the needs of both field workers and first responders.",
  "pros": [
    "Hot-swappable batteries",
    "Programmable physical buttons",
    "Expandable",
    "Bright display for outdoor use",
    "Dual SIM support"
  ],
  "cons": [
    "Android 9.0",
    "Expensive"
  ],
  "article": [
    "Field workers often find themselves in harsh environments where a standard consumer grade tablet just wouldn’t be able to withstand the cold, heat, rain or other conditions they encounter which is why they turn to rugged tablets such as Panasonic’s new Toughbook A3.",
    "The company’s latest rugged tablet is the successor to its Toughbook A2 that launched back in 2016 and a number of upgrades have been made to the device that make it an even better fit for those in working in industries such as the military, construction, government, law enforcement, healthcare and enterprise.",
    "We’ve spent the last few weeks trying out the Toughbook A3 and getting a feel for how first responders and other mobile workers could benefit from Panasonic’s most rugged Android tablet yet. In this review, we’ll take a closer look at the hardware, software and experience of using this rugged tablet.",
    "As Panasonic’s latest rugged tablet bears the Toughbook name, it shares the same silver and black color scheme found on many of the company’s rugged laptops. Although the device weighs 1.98lbs it doesn’t feel overly heavy and Panasonic did manage to shave off .2lbs when compared to its predecessor the Toughbook A2. The tablet is a little bit more than half an inch thick at 1.65cm and the device feels very sturdy with no bending or give whatsoever.",
    "The 10.1-inch screen takes up most of the front of the device and is protected by a metallic bezel that wraps all the way around which also houses a 5MP front-facing camera, microphone and ambient light sensor. A hard plastic shell protects the edges of the Toughbook A3 from drops and here you’ll find a total of eight physical buttons with five of these being completely user customizable along with a volume up, volume down and power button.",
    "On the left side of the device there is a 16v DC In charging port along with a full USB 2.0 Type-A port and a USB 3.0 Type-C port. On the right side of the Toughbook A3 you’ll find an audio jack, security lock and a slot to hold the included stylus. The bottom of the device contains a Cradle I/F connector along with optional dual pass through connectors.",
    "If you flip the Toughbook A3 over, you’ll find two hot swappable 3,200mAh batteries that are locked in place with two slidable tabs. Underneath each battery there is a nano SIM slot and the tablet can be outfitted with two SIM cards.",
    "Panasonic’s xPak expansion area can be found at the top of the backside of the device and while our review unit came with a barcode reader, businesses can also choose to outfit their workers’ Toughbook A3’s with a smartcard reader or even an additional USB Type-A port.",
    "As a fully rugged device, the Toughbook A3 has an IP65 rating which means the device is water and dust resistant but not waterproof. It is also certified to the latest MIL-STD-810G standard and can withstand six-foot drops. Panasonic has even tumble tested the A3 by putting it through 500 tumbles from 3.3ft at a rate of 5 rpm.",
    "The device’s 10.1inch WXGA display runs at around 500 nits of brightness indoors but is capable of going all the way up to 800 nits so that it can be easily used outdoors in direct sunlight. Panasonic has also given the display an anti-reflective screen treatment for improved outdoor visibility. The 10-point capacitive touchscreen can be used with gloves and the display is even able to distinguish between finger touches and rain.",
    "The Toughbook A3 is powered by Qulacomm’s SDM660 octa-core CPU clocked at 2.2GHz and by 4GB of LPDDR4 RAM. There is 64GB of eMMC storage built into the device but this can be boosted by up to 64 GB with a microSD card.",
    "In terms of connectivity, the device’s Qualcomm WCN3990 chip provides support for Bluetooth 5.0 and Wi-Fi a/b/g/n/ac/d/h/i/r/k/v/w. The device has NFC as well as support for a wide variety of Global Navigation Satellite Systems (GNSS) including GPS, GLONASS, Galileo, Beidou and QZSS. Since the Toughbook A3 has been designed with first-responders in mind, there is also support for Band 14 and FirstNet.",
    "Battery life is one of the A3’s biggest strengths and the tablet lasts for up to 9 hours with the two standard 3,200mAh batteries. However, Panasonic also offers dual extended life 5,580mAh batteries that allow the device to run for up to 15.5 hours on a single charge. The included DC charger is fairly slim and can fully charge both batteries in 4 hours but you can also use the USB Type-C port for charging if the input source is 100mA or higher. For organizations with multiple Toughbook A3 tablets, Panasonic sells a 5-bay battery charger and additional standard and extended batteries are also available for purchase.",
    "The Toughbook A3 ships with Android 9.0 and Panasonic’s bundled apps which include a note taking app, a file copy utility, a whitelisting/blacklisting app, a hardware diagnostic app, a rapid configuration app for enterprise deployment and a barcode reader app.",
    "Of the preinstalled apps, we were quite impressed with the User Button Manager app which allows for the physical buttons on the left and right side of the device as well as buttons A1-A3 to be assigned to perform various functions or open apps. Multiple apps or functions can also be assigned to each button depending on whether a user short presses or long presses it and users can also assign actions to two buttons at once.",
    "The Toughbook A3 comes with a standard 3-year warranty which includes free overnight delivery of parts and repaired units, access to Panasonic field service personnel and protection against manufacturing defects. Organizations can purchase additional services for deployment, personalization, installation and the company also offers First Responder Solutions to help keep firefighters, law enforcement and medical personnel connected.",
    "The Toughbook A3 may only have 4GB of ram and be powered by a Qualcomm chip from 2017 but during our time with the device, it performed quite well and was able to boot up from a powered off state in just over twenty seconds. Apps opened quickly and there were never any crashes or hang ups during our testing. The A3 also received several security updates while in our possession.",
    "When using the A3 outside, the display was bright and easy to read even in direct sunlight. The rear and front-facing cameras may not be able to compete with those found in high-end smartphones but they were more than capable enough for taking photos in the field. The Toughbook A3 was also able to get quite loud in our tests thanks to the device’s 94db loud speaker.",
    "Battery life was never a problem in our experience and we like the addition of the dual LEDs on the rear of the device which show the state of each battery and blink red when battery power is running low. Removing a depleted battery and swapping in a new one took less than ten seconds and organizations with a fleet of Toughbook A3’s will have no trouble keeping them charged and ready to go.",
    "Panasonic’s Toughbook A3 is an expensive device starting at $2,699 though the price can go higher depending on the configuration. The fact that this rugged tablet ships with Android as opposed to Windows could be a dealbreaker for organizations that still rely on Windows to run their custom or legacy apps.",
    "For organizations that require a rugged tablet running Windows, the Durabook U11 starts at just under $1,800 and runs Windows 10 Pro on an Intel’s 10th gen CPU. The device sports an 11.6-inch FHD screen with a 1,000 nit brightness for enhanced outdoor viewing. Like the Toughbook A3, it can also be used with gloves and while wet. The Durabook U11 has just one hot swappable battery but the quick-release SSD makes it easy to quickly take files off of the tablet.",
    "Panasonic also makes a rugged tablet that runs Windows 10 Pro with its Toughpad FZ-G1. The fully rugged device is a bit heavier at 2.4lbs with the standard battery and its battery life can be extended even longer to 22 hours with an optional long life battery. The Toughpad FZ-G1 is powered by a Core i5 vPro processor and is also MIL-STD-810G and IP65 certified.",
    "For those looking for a smaller rugged tablet running Android, Acer’s Enduro T1 could be a good fit if you’re okay with losing the ability to quickly swap in a new battery. This 8-inch tablet is MIL-STD-810G and IP54 certified and can survive drops from 4 feet. The Enduro T1 also comes with a built-in barcode scanner and the included hand strap makes the device easy to use in the field.",
    "The Panasonic Toughbook A3 checks all the boxes when it comes to what a large organization would look for in a rugged tablet for its employees. The built-in software makes device management easy for IT teams while the optional add-ons can allow the A3 to be used in a wide variety of situations. The included dual batteries offer more than enough power for everyday use and the fact that Panasonic offers extended batteries is an added bonus. The bright display and anti-reflective coating make the A3 well suited for outdoor use and the loudspeaker can easily be heard in noisy environments like busy warehouses or out in the field.",
    "Overall we were quite impressed during our time with the Toughbook A3 and could easily see field workers, first responders and other professionals relying on this tablet every day to get their jobs done."
  ],
  "headers": {
    "3": "Design",
    "8": "Hardware",
    "13": "Software and support",
    "16": "Performance and in use",
    "19": "The competition",
    "23": "Final verdict"
  },
  "links": {
    "rugged tablets": "https://www.techradar.com/news/the-best-rugged-tablets",
    "Durabook U11": "https://www.durabook.com/us/products/u11-tablet/#1528712263513-1b1ce11b-4e97951c-4815",
    "Toughpad FZ-G1": "https://na.panasonic.com/us/computers-tablets-handhelds/tablets/tablets/toughpad-fz-g1",
    "Enduro T1": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3007276092154228700&xs=1&url=https%3A%2F%2Fwww.acer.com%2Fac%2Fen%2FUS%2Fcontent%2Fprofessional-series%2Facerendurot1et110&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpanasonic-toughbook-a3-rugged-tablet"
  }
}