{
  "source": "https://www.techradar.com/reviews/mad-catz-rat-air",
  "title": "Mad Catz RAT Air review",
  "category": "gaming",
  "updated": "2020-07-06T15:33:59Z",
  "author": "benjamin-abbott",
  "summary": "Mad Catz RAT Air sadly disappoints",
  "verdict": "Even though the mouse itself is OK, various technical issues, a low DPI, and an enormous price tag bring the Mad Catz RAT Air down.",
  "pros": [
    "Wealth of programmable buttons",
    "Mouse mat is great in theory"
  ],
  "cons": [
    "Mouse mat's wireless connection doesn't work properly",
    "Only 12,000 DPI"
  ],
  "article": [
    "The Mad Catz RAT Air reminds us of an F1 racer, or a kit-bash. Angular, edgy, and with exposed workings, it's a rodent that clearly means business. A plethora of buttons also establish its gaming capabilities better than words could.",
    "Is it the best gaming mouse of 2020 so far, though? Unfortunately, no. Despite its best efforts, the Mad Catz RAT Air - inheritor of the RAT legacy - doesn't do the brand justice.",
    "Sitting at almost $200 in the US and £200 in the UK (the Australian price hasn't been listed yet, but a rough translation puts it at AU$290), this is one hell of an expensive pointer.",
    "You'd expect great things as a result, but we're not sure it does enough to make that astronomical price worthwhile. This will be a disappointment for fans, and they should take heart in the fact that there are positives underneath all this negativity. They just can't compete with the drawbacks.",
    "Most of it stems from the mouse mat that comes with the RAT Air itself. Once the mat is plugged in to your computer's USB port, you can use the mouse wirelessly. In fact, the mouse doesn't even have a battery pack in an effort to keep its weight down; these have been replaced by advanced capacitors, powered by a magnetic field.",
    "And it's a great idea - in theory. In reality, the wireless connection is unreliable and we found the mouse often struggling to connect. It frequently disconnected if we moved it too far left, for example.",
    "Because the issue was never consistent enough to suggest a fault, we initially suspected competing wireless signals were to blame. The trouble was, turning everything else off didn't necessarily help. Indeed, the mat then started to turn off our monitor, which can be controlled via remote. As soon as we disconnected the RAT Air or used its wired connection instead, the monitor went back to normal. Bizarre is an understatement.",
    "Upon raising the issue with Mad Catz, we were informed that others had experienced similar issues. What's more, they recommended making sure there was no metal nearby to disrupt the mat's magnetic field. Considering the fact that laptops, computers, or desks - all of which must be close to the RAT Air by necessity - will feature more than a few metal parts, that seems like a tremendous design flaw.",
    "It's a shame. The concept itself is sound, particularly because the mat is reversible for your choice of hard or soft surface. You can even remove the surface entirely and swap it for something else if you'd prefer, all while keeping the wireless connection to your RAT Air.",
    "Still, let's look on the bright side - you can always connect the RAT Air by USB to your device, which competitive users may want to do anyway. That's when it comes into its own. The ability to extend the rear end helps it to accommodate any grip type, while the collections of buttons don't get in the way as much as I thought they might. And even though the left click is a tiny bit spongier than I'd like, the action on everything else was excellent. It's crisp and satisfying, to be exact.",
    "The scroll wheel is another winner. It's got grip to spare, and feels like a Range Rover tyre or Doc Martin boot underhand. The side scroller is similarly excellent for navigating spreadsheets and the like. After seeing its potential, I'm reluctant to go back.",
    "What's more, the RAT Air's customisable nature is appealing. After downloading the Mad Catz software, it's easy to assign keys or commands to the mouse's wealth of buttons. That allows you to tweak it to your specific needs and tastes, or even specific genres of game - you can assign different commands for different profiles, for example.",
    "The downside? A DPI of just 12,000. Although that's not the end of the world (and it's quite enough to be going on with), it's low for a modern mouse. Especially one that costs this much. For instance, competitors in the same price bracket are hitting 20,000 DPI in some cases.",
    "Subsequently, we can't recommend the Mad Catz RAT Air as things stand. It's good, yes, but it's also tremendously flawed. In addition, it doesn't offer enough for such an astronomical price tag."
  ],
  "headers": {
    "0": "Two-minute review",
    "14": "Don't buy it if..."
  },
  "links": {
    "best gaming mouse": "https://www.techradar.com/news/best-gaming-mouse"
  }
}