{
  "source": "https://www.techradar.com/reviews/homebank-personal-accounting",
  "title": "HomeBank personal accounting review",
  "category": "computing",
  "updated": "2020-09-25T19:53:27Z",
  "author": "rob-clymo",
  "summary": "A free and easy accounting solution from HomeBank",
  "verdict": "With its impressive graphical reports HomeBank is handy for users that need a simple but effective visual solution for tracking and organizing their finances.",
  "pros": [
    "Free software",
    "Visual appeal",
    "Reports"
  ],
  "cons": [
    "Lack of support"
  ],
  "article": [
    "HomeBank is a completely free accounting software package aimed at helping people get their personal finances in order and who subsequently want to keep them that way. Very relevant given the current situation with coronavirus. It features an easy-to-use interface that comes complete with lots of cool visual tools that let you produce charts to illustrate your current state of monetary play.",
    "Admittedly, HomeBank doesn’t come with quite the same level of sophistication found within rival paid-for applications, but as a quick accounting resource for folks with basic requirements it ticks a lot of boxes. Other comparable products include Mint, You Need a Budget (YNAB), BankTree, AceMoneyLite, Money Dashboard, Buxfer or Moneydance.",
    "With no price tag attached to it HomeBank lets you install, launch and use its full set of features without parting with any cash. However, like many software applications that have been developed in this way there’s an invitation to make a donation if you’re pleased with the way if performs. The HomeBank website has a page specifically for this task, with a €20 radio button being selected by default, which seems reasonable enough but you’re free to donate what you like.",
    "For a free program the feature set found inside HomeBank is generally impressive. If you’re starting out then it lets you import data from the likes of Quicken, Microsoft Money and other comparable products. However, you’ll find that this does require quite a lot of manual intervention, which is perhaps one of the downsides of a completely free application.",
    "Bank statements using common OFX/QFX, QIF and CSV formats can be imported too, while HomeBank can also handle multiple currencies. The software can be tailored to work with a variety of different account types including bank, cash, asset, credit card and liability options.",
    "You can schedule transactions and use a transaction template for simplified workflow. Topping it all off is the range of reporting options that let you turn your finances into a series of visual charts, so understanding your money matters becomes that little bit easier.",
    "HomeBank has been honed primarily for Windows users, although it does work on other platforms such as GNU/Linux and can be also be used on Mac OS X with a bit of fettling. Installation on a Windows machine proved largely seamless, with the option to launch on a desktop or a portable or mobile drive being part of the process.",
    "We did get a random error at the tail-end of setup, however, although the program went on to launch and work as expected. We found one of the best ways to get to know the ropes and see how the software performed with a decent chunk of existing data was to use the test files within HomeBank. This option can be selected when you launch the program initially.",
    "Launching HomeBank within the Windows environment reveals a rudimentary but practical interface that comes with all of the common tools you’d expect from a basic-level accountancy bundle.",
    "After a quick familiarization exercise you’ll be able to manage all of the features and functions via a top menu, which takes you into core functions such as money management, the checking of transactions and report generation.",
    "Just as easy to monitor are the status of your accounts, which are contained in a central screen area, along with a neat visual pane on the right that shows the distribution of your finances. It’s all relatively plain sailing, though does require a bit of time to get fully acquainted with which menu does what.",
    "Just like many other free software programs out there, HomeBank doesn’t come with the same levels of support that are found with paid-for applications. There’s a pretty solid area on the HomeBank website that covers most, if not all frequently asked questions, which should be enough to answer most queries.",
    "While this information of pretty comprehensive, it might be a bit of a handful for less experienced users, although if you’ve got time and a bit of patience you can generally get to the bottom of most HomeBank-related quandaries. Alternatively, you’ll just have to pick your way through the program and basically figure it out for yourself.",
    "HomeBank bills itself as free, easy, personal accounting for everyone and it manages to live up to that without any problems. While it's got a small mountain of useful tools, plus dependable functionality, HomeBank really comes into its own on the reporting front.",
    "If you get befuddled with figures and find things much easier to digest via a colourful pie chart or an impressive bar graph then you’ll warm to this sizeable aspect of the software. Alongside that, there are powerful menu options that break down all of your spending into neat and tidy categories, so HomeBank is an organizational mini marvel considering it doesn’t cost anything to use."
  ],
  "headers": {
    "2": "Pricing",
    "3": "Features",
    "6": "Performance",
    "8": "Ease of use",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "HomeBank": "http://homebank.free.fr/en/index.php",
    "personal finances": "https://www.techradar.com/best/best-personal-finance-software",
    "Mint": "https://www.techradar.com/reviews/mint",
    "You Need a Budget (YNAB)": "https://www.techradar.com/reviews/you-need-a-budget-ynab",
    "BankTree": "https://www.techradar.com/reviews/banktree-personal-finance",
    "AceMoneyLite": "https://www.techradar.com/reviews/acemoney-lite",
    "Money Dashboard": "https://www.techradar.com/reviews/money-dashboard-finance-management",
    "Buxfer": "https://www.techradar.com/reviews/buxfer-personal-finance",
    "Moneydance": "https://www.techradar.com/reviews/moneydance"
  }
}