{
  "source": "https://www.techradar.com/reviews/lytx",
  "title": "Lytx fleet management review",
  "category": "computing",
  "updated": "2021-07-02T10:39:35Z",
  "author": "jitendra-soni",
  "summary": "Robust fleet management solution focused on safety",
  "verdict": "A robust telematics firm that has immense experience in fleet management, and a commendable focus on safety.",
  "pros": [
    "Collision prediction",
    "Focus on driver safety",
    "Impressive customer support"
  ],
  "cons": [
    "Pricing not mentioned online"
  ],
  "article": [
    "Lytx is a unique fleet management platform with a keen focus on improving safety, efficiency and productivity by leveraging the data it receives from fleet tracking. Founded in 1998, the company takes pride in having helped over 1.3 million drivers (and has accumulated over 120 billion miles of driving data).",
    "Based in San Diego, California, Lytx makes and sells video-based telematics solutions across the globe. It uses the driving data to train its AI and machine vision-based solution to accurately highlight improper driving.",
    "The company offers detailed insights around various aspects of the fleet to help decision-makers keep their focus on the more important tasks at hand.",
    "Lytx does not list its pricing and contract details on its website, a common trend with telematics SaaS-based companies. It seems like the company has deliberately not listed the pricing information on the website since the price varies based on the client’s requirements, the solution they opt for, their fleet size, and also on the industry-specific requirements.",
    "Hence the company prefers prospective buyers to directly reach out to the sales team, who can assist in getting the perfect solution matching their needs.",
    "Apart from pricing, the company has also chosen not to list basic details like the minimum vehicles limitation, or even the minimum contract length. However, going by industry standards one can expect the availability of a monthly payment plan, and the long-term contract options may typically range from 12 to 36 months.",
    "Lytx uses video telematics to provide insights for operators and decision-makers. The foundation of its fleet management solution is connected devices like cameras, sensors that are hardwired or plugged into the vehicle, and video data.",
    "The company claims that its solution uses a mix of video data, vehicle data and machine vision technology to prepare consumable insights. It also offers far more comprehensive and detailed insights than those provided by a regular telematics solution.",
    "Here are a few key features of Lytx’s fleet management solution:",
    "Fleet Dashcams: Dashcams help in increasing the fleet's efficiency, improving driver safety by providing video evidence in case of an incident, and providing proof of service/delivery. They also help in giving effective coaching to drivers by offering real-time in-cab alerts reminding them to stay focused while driving.",
    "These dashcams offer a 360-degree view of the vehicle and come with a built-in trigger to record videos of incidents like harsh braking, swerving, cell phone usage while driving the vehicle, or any other risky driving behavior.",
    "In case a driver feels the need to record a specific incident, the dashcams come with a capability to record continuously for up to 100 hours. This continuous recording can be triggered remotely from the dashboard as well.",
    "Fleet safety solution: Coupled with the data provided by the dashcams and other sensors, as well as with the help of the intelligence gathered via video data, the system can predict and reduce the chances of collisions. It can also suggest when a driver needs coaching based on driving habits, thus helping improve overall fleet safety and uninterrupted service.",
    "The company offers two different programs that use its proprietary machine vision and artificial intelligence (MV+AI) technology to examine and detect more than 60 risky driving behaviors both inside and outside of the vehicle. With the Risk Detection Service, Lytx's MV+AI categorize and deliver video as comprehensive insights within a company dashboard, helping fleets track and monitor driver risk. With this program, fleets are aware of driver habits most likely to lead to a collision.",
    "The more comprehensive Driver Safety program offers highly effective coaching workflows and comprehensive reporting, along with human validated review, so that fleets and create lasting behaviour change and improve their fleet performance.",
    "GPS Tracking: Real-time GPS tracking lets operators locate, track and manage the fleet at any time. Coupled with the feed from the dashcam, the people managing the fleet can be 'virtually' present with the driver during their drive. It also enables them to schedule technicians in case required.",
    "Effective use of GPS tracking helps a business provide faster and better customer service, increased efficiency, as well as boosted productivity by ensuring that the drivers follow the route assigned (further helping on the cost-saving front, with reduced fuel consumption).",
    "The company offers two different plans for GPS fleet tracking. Basic Fleet Tracking includes features that most other service providers offer, such as the GPS location of the vehicle, optimized driver routing, preset geofences with alerts based on the vehicle entering and exiting the geofenced area, and third-party integration.",
    "The more advanced Fleet Tracking with video offers all the features of the base plan but also comes with additional video intelligence like visual service confirmation, vehicle/equipment monitoring and collision evidence.",
    "Compliance: Lytx offers a web-based automated solution to help the business stay compliant with the DOT norms like ELD, Hod, CSA data analysis, DVIR management and more.",
    "Its 'Hours of Service Management' feature helps businesses to compile and audit ELDs, paper logs, timesheets, or all three, in a single system to help them track driver compliance.",
    "Lytx offers support through email, online chat and telephone. The company has local helpline numbers for the UK, France, Ireland and South Africa.",
    "The Lytx suite of training material includes an online knowledgebase, online training events, online courses and webinars, and Lytx Compliance Services Portal. The contact details and links are all provided on the site and the content is easily accessible.",
    "Its social media accounts on Facebook, Twitter, and the like are regularly updated, and the official YouTube channel also gets updated with a regular stream of content.",
    "Lytx offers a comprehensive solution that helps in weeding out vehicles that may turn out to be costly in terms of maintenance and operation. This established service leverages AI and machine learning to predict collisions and alert drivers as well as operators.",
    "The business has been accredited on Better Business Bureau with an A+ rating. For a company as old as Lytx, not having any complaints on Better Business Bureau is commendable, but that said, there are no user reviews on the website either."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "21": "Support",
    "24": "Final verdict"
  },
  "links": {
    "Lytx": "https://www.lytx.com/",
    "fleet management platform": "https://www.techradar.com/best/best-gps-fleet-tracking-solutions",
    "fleet tracking": "https://www.techradar.com/best/best-gps-fleet-tracking-solutions"
  }
}