{
  "source": "https://www.techradar.com/reviews/pcloud",
  "title": "pCloud cloud storage review",
  "category": "computing",
  "updated": "2021-11-11T18:12:23Z",
  "author": "mayank-sharma",
  "summary": "Easily sync and share your files",
  "verdict": "While it can share and sync all types of files, pCloud is especially suited for multimedia content. The feature-unrestricted free plan gives you enough space to sample all the features of the service.",
  "pros": [
    "Feature-unrestricted free plan",
    "Integrate with social media",
    "Block-level sync",
    "Family account"
  ],
  "cons": [
    "No document editor",
    "No add-on services"
  ],
  "article": [
    "While you could always share files and sync them between several computers and different devices, it wasn’t until the arrival of Dropbox that cloud storage and file syncing services really took off.",
    "But Dropbox isn’t the only player in town. The Swiss-based pCloud has an impressive list of features at a price point that make it a very appealing choice for sharing large files with friends and family or to sync them across all your devices.",
    "If you’ve never been to Switzerland, we were struck by how clean and tidy the whole place is, as it’s immaculate for the most part. We mention that because the company behind pCloud are based there, and this product has the same regimented and refined air as a typical street in Geneva or Zürich. Note that as of August 2020, pCloud now allows its users to choose where they want their data to be stored, either EU or US.",
    "But can a product that was only launched in 2013 take on the mature platforms like Dropbox, Google Drive, One Drive, Box and the rest of the field?",
    "pCloud offers all the essential features you’d expect from a sharing and syncing service. To begin with, in addition to an intuitive web interface, pCloud also has clients for all the major desktop operating systems including Windows, macOS, and Linux as well as apps for Android and iOS.",
    "The service makes it easy to share individual or groups of files and folders without much effort. There is also no restriction on the size of the files you share as long as they are within the storage limits of your subscription plan.",
    "Besides sharing, you can also use the desktop app to sync any local folder from your desktop to your pCloud account. On top of it, the service does block level syncing, which means the transfers will be a lot faster as only parts of the files that have changed need to be synced.",
    "In terms of security, all the file transfers are conducted over a TLS/SSL encrypted channel to ensure that your data remains secure. pCloud also claims to replicate your files in five different server locations to safeguard against data loss and ensure availability. The service also offers two-factor authentication for added security.",
    "While you can share all kinds of files on pCloud, its handling of media files deserves special mention. The web interface of the service includes audio and video players that enable you to play the shared media files straight from pCloud itself.",
    "For starters, you can use the audio player to create and manage playlists. Then there’s the video player that allows you to watch the videos in picture-in-picture mode to help you continue using your browser while watching the video. It’ll also create slideshows for any shared images.",
    "Social media backups are also one of pCloud’s specialties. Without much effort, you can connect your pCloud account to popular social media services such as Facebook and Instagram among others, to backup media from your social media accounts into your pCloud account.",
    "Another draw for pCloud are its competitively priced plans. You can register for a Free account that enables you to share and sync files up to 10 GB. You can also freely use the service to send files up to 5GB in size that can optionally be encrypted as well.",
    "Broadly speaking there are two paid plans depending on the amount of data you need to share. The premium plan offers 500 GB and costs $3.99/month or $47.88 if you choose to pay for the year. Then there’s the 2 TB Premium Plus account that’ll cost $7.99/month or $95.88 if you pay for the year.",
    "It’s also worth noting that unlike most of its peers, pCloud offers a one-time payment lifetime plan that’s valid for 99 years. The Premium and Premium Plus cost $175 and $350 respectively if you decide to make a one-time lifetime payment.",
    "There’s also a Family plan that’s only available as a lifetime plan. It costs $500 and enables you to share 2 TB of space with four other pCloud users. If you are an Enterprise customer, there is a pCloud for business service.",
    "All pCloud accounts, whether free or paid, offer the same set of features. However there are a couple of add-on services that you can subscribe to for added benefits.",
    "One is called Extended History. By default pCloud retains files you’ve deleted for 15 days in the Free plan and 30 days with the Premium plans. However you can extend this period to 360 days by shelling out $39/year. Then there’s pCloud Crypto, which adds client-side encryption to your account for $47.88. With this add-on you have the ability to encrypt your data using a multi-layered algorithm. In fact, pCloud are so confident of their security, they offered $100,000 to anyone to break their system, which none of the 2860 participants could even after six months of trying.",
    "To get started you can register with the service manually or use the single sign-on to log in with your Google or Facebook accounts. Out of the box, the service has a handful of folders with sample data to help you get started by exploring its sharing features.",
    "The service has impressive file management skills and allows you to sort and search through your shared files with relative ease, pretty much using the same options as you get with the file manager in your operating system. You can also search for files and filter the results based on file types if you have loads of files of various types inside a folder.",
    "You can drag and drop files from your desktop into the pCloud web app or use the upload manager, which also helps you keep an eye on the files as they are being uploaded into your pCloud account.",
    "To ensure you are using the service to the fullest, pDrive’s web interface has a six-step wizard at the top of the interface. Its job is to ensure you utilize each and every function of the service. For instance, it’ll guide you to install the desktop and mobile apps. As an incentive, completing each step will unlock additional storage space.",
    "The multi-platform desktop client is pretty intuitive and installs as a desktop applet in the status bar. It adds a virtual drive in your file manager, which is a mirror copy of your pCloud account",
    "Any files placed in this drive will automatically be synchronized with your pCloud account and can be accessed from anywhere using the web interface.",
    "There’s also an offline mode that makes the shared files available to you on your computer even when you aren’t connected to the internet. This allows you to work on the files while you are offline and then automatically sync the changes as soon as you're connected to the Internet.",
    "You can also directly share files with your friends and family from the pCloud virtual drive. To share a folder you can send email invitations using pCloud and select whether you want to allow them to edit the contents of the shared folder or just view its contents. pCloud lists two separate URLs if you want to share using links. There’s one that’ll allow the recipients to download the contents of the folder and another if you want them to be able to upload content into the folder as well.",
    "The mobile app offers one additional option -- a setting to upload videos and photos to pCloud directly from your phone. By default it’ll upload all photos and videos but you can tweak its settings to restrict uploads.",
    "Besides their desktop client, pCloud also offers browser extensions for Firefox, Chrome and Opera. Once installed, you can use the extension to save audio, video and pictures directly from a web page to your pCloud account. You can also save a selection of text, which is automatically saved as a text file.",
    "pCloud has a clean and surgical application that does what most people want from a Cloud storage service, and the current pricing plan structure is a bargain across the board.",
    "Our only reservation is that it doesn’t have any collaboration modes for business users, but the number of customers that will want that isn’t high.",
    "More people need to try pCloud because for many of them it might be the perfect solution."
  ],
  "headers": {
    "4": "Features",
    "8": "Media support",
    "11": "Pricing",
    "17": "Interface",
    "21": "Apps",
    "27": "Final verdict"
  },
  "links": {
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "file syncing services": "https://www.techradar.com/best/best-file-syncing-solution",
    "pCloud": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1384404383787489800&xs=1&url=https%3A%2F%2Fwww.pcloud.com%2Fcloud-storage-pricing-plans.html&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpcloud",
    "Windows": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "macOS": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Android": "https://www.techradar.com/best/best-android-phones",
    "iOS": "https://www.techradar.com/news/best-iphone",
    "they offered $100,000": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5796355502019754000&xs=1&url=https%3A%2F%2Fwww.pcloud.com%2Fchallenge%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fpcloud",
    "file management": "https://www.techradar.com/best/the-best-file-manager"
  }
}