{
  "source": "https://www.techradar.com/reviews/yamaha-yas-209-soundbar",
  "title": "Yamaha YAS-209 Soundbar review",
  "category": "audio-visual",
  "updated": "2020-02-21T02:24:54Z",
  "author": "stephen-withers",
  "summary": "An affordable virtuoso sonic performer",
  "verdict": "The Yamaha YAS-209 is a well-designed soundbar and subwoofer combination that produces as surprisingly big sonic presence, and thanks to Amazon Alexa it also doubles as a fully-functioning smart speaker. The lack of MusicCast is disappointing but ultimately forgivable at this price.",
  "pros": [
    "Big soundstage",
    "DTS Virtual:X",
    "Amazon Alexa",
    "Sensible design"
  ],
  "cons": [
    "No MusicCast",
    "Not a true surround experience"
  ],
  "article": [
    "The Yamaha YAS-209 is an entry-level 2.1-channel soundbar and subwoofer combination that benefits from the company’s years of experience in the soundbar market, and includes DTS Virtual:X psychoacoustic processing to create a more immersive sonic experience.",
    "To hit a lower price point Yamaha has dropped its MusicCast multiroom system - which is a bit disappointing - but in its place has added Amazon Alexa compatibility, making the YAS-209 smarter than your average soundbar.",
    "The result is a soundbar that's a bit under-specced compared to other products in its price range, but at just $349 / £429 / AU$599, it's well worth the money.",
    "The Yamaha YAS-209 is the company's mid-level 'bar from 2019 and comes at $349 / £429 / AU$599. That sounds a bit expensive if you're coming from your TV's built-in speakers but, compared to the competition, it's fairly affordable and offers excellent value for money thanks to a solid selection of features and superior sound quality.",
    "While other 'bars might skimp on a sub, the inclusion of a separate subwoofer ensures this system is capable of mining the low frequency depths, and the addition of Alexa makes the YAS-209 smarter the your average soundbar.",
    "The Yamaha YAS-209 is an exercise in minimalism, with curved edges and a wrap-around black fabric grille. The top is also matte black, so no danger of annoying reflections from the TV screen. The build quality is good and the design will pair well with TVs that are between 55 to 65 inches. There’s a choice between stand or wall mounting, with screw holes and a template for the latter.",
    "This minimalism extends to the display, which is simply a series of small LEDs on the top panel. These LEDs register which input you have selected – HDMI, TV (ARC), Bluetooth and Net – along with indicators to show if the surround mode or clear voice has been selected. There’s also an indicator for the Wi-Fi connection, and one that shows Alexa is working.",
    "To the right of these indicators, you’ll find some basic touch-sensitive controls for source selection, volume up/down, and power on/off. Thanks to Alexa now being built-in, there’s also a button to wake it up and another to mute the far-field microphones, two of which are located above the indicators and controls.",
    "The connections are in a recessed area at the left rear of the soundbar, where you’ll find an HDMI input and output. Both pass 4K and HDR, while the latter supports ARC. There’s also an optical digital input for connecting to TVs that don’t support ARC, and an Ethernet port for a wired connection. In terms of wireless connections there’s Wi-Fi (2.4GHz), and Bluetooth (Ver 4.2).",
    "The included remote is small and fiddly, but boasts all the controls you’ll need to setup and operate the soundbar. There’s an Alexa wake-up button, along with a selection of surround modes, and the clear voice feature. As an alternative to the remote, there’s also the Soundbar Controller app, which is available for iOS and Android.",
    "Design TL;DR: Yamaha keeps things simple with a minimalist black wrap-around fabric grille, and a small but effective remote control, along with an HDMI input and output with ARC.",
    "The Yamaha YAS-209 boasts plenty of features for what amounts to an entry-level soundbar: For a start, there’s a strong emphasis on sound quality thanks to two front-firing speakers, each composed of a 4.6cm woofer and a 2.5cm tweeter. There’s also a separate wireless subwoofer, which ensures the combined system can deliver deep and well-integrated bass.",
    "The sub is made of MDF, and matches the styling of the soundbar with a matte black finish and a black fabric grille. It is front ported, and uses a side-firing 6.5-inch driver that’s powered by 100W of built-in amplification. There’s also 50W of amplification for each of the speakers in the soundbar itself, resulting in a total of 200W for the entire system.",
    "The YAS-209 supports lossy Dolby Digital, Dolby Pro Logic II, and DTS Digital Surround, but also includes DTS Virtual:X. This is described as 3D surround sound processing for a single soundbar solution, which basically means it uses psychoacoustic processing to create the illusion that the soundbar has more than its 2.1 channels.",
    "In addition to DTS Virtual:X, there are a number of other surround modes, including Music, TV Program, Movie, Sports, and Game – the purpose of which should be self-explanatory. There’s also a stereo mode, a bass extension mode, and a clear voice feature designed to boost the clarity of dialogue in TV shows and movies.",
    "The YAS-209 supports WAV (PCM format only) and FLAC up to 192kHz, ALAC up to 96kHz, and MP3/WMA/MPEG-4 AAC up to 48kHz, and you can stream music from smart devices, PCs or media servers. The inclusion of Alexa not only allows you to stream from Spotify and Amazon Music, but also turns this soundbar into a smart speaker, with full interaction and voice control.",
    "Features TL;DR: There’s a decent set of features, including support for Hi-Res Audio and DTS Virtual:X. There’s also built-in Amazon Alexa, turning this soundbar into a smart speaker.",
    "The Yamaha YAS-209 is exceptionally easy to setup - simply place it under your TV or wall mount it using the rear screw holes and provided template. The subwoofer is best positioned at the front of the room, either to the left or right of the soundbar (whichever is convenient). Then all you need to do is connect your sources using HDMI, optical digital or Bluetooth.",
    "The HDMI connections offer the best sound quality and the greatest convenience. Despite there being an HDMI input, you can simply connect all the HDMI sources to your TV and then send the audio back via ARC (audio return channel). This approach also allows you to take advantage of CEC (consumer electronics control) and operate the soundbar with your TV remote.",
    "You can connect the Yamaha to your network using either a wired or wireless connection. For the latter you will need to use the Soundbar Controller app. The process is very easy, and you should be up and running in no time. Once that’s done you can setup Amazon Alexa, which you do by simply selecting the YAS-209 as a device in the Alexa app.",
    "As a smart speaker, this soundbar proves surprisingly effective. The built-in far-field microphones are suitably sensitive, allowing for seamless interaction with Alexa. The smart assistant is clear and precise when answering questions, and the ability to easily stream music is a great feature. There’s even limited voice control, which is useful when the remote isn’t to hand.",
    "The Yamaha is a stellar performer when it comes to audio quality, no doubt thanks to the decent speakers and powerful amplification. The inclusion of a separate subwoofer also helps, giving the soundstage plenty of low frequency impact. The two are also well integrated, ensuring a smooth crossover from the sub’e woofer to the bar’s midbass drivers.",
    "When watching TV shows, the YAS-209 is genuinely impressive. Despite the lack of a dedicated centre speaker, vocals remain crisp and clear, although if you’re struggling to understand what someone is saying, the clear voice feature will help. Title scores and background music are nicely rendered, and effects are placed either side of the TV screen with a pleasing degree of precision.",
    "The YAS-209 has sufficient size and power to produce a big soundstage, allowing it to handle movies with ease. Where appropriate the bass has some serious kick, and the system combines to create a big and compelling soundstage that delivers an epic sense of scale when watching a modern blockbuster like Avengers: Endgame.",
    "The only thing lacking is a sense of surround envelopment, with the sonic delivery largely focused at the front of the room. However you can give the audio greater presence by engaging the DTS Virtual:X mode. This uses psychoacoustic precessing to give multi-channel audio a more immersive presence, and works surprisingly well, creating a greater sense of dimensionality.",
    "Performance TL;DR: The audio might be limited to 2.1-channels but the soundstage is big, the bass is deep and DTS Virtual:X proves effective at adding greater presence.",
    "The Sonos Beam is an obvious contender, it costs about the same and makes sense if you’re already invested in the Sonos ecosystem. The Beam is also a good soundbar in its own right, with an easy setup, the ability to work with Alexa and Google, an HDMI connection with ARC, and support for AirPlay 2. There’s no separate subwoofer, so the bass is limited, but the overall soundstage is excellent, making the Beam a great all-rounder.",
    "If you really want MusicCast, then the Yamaha BAR 40 SW (or Yamaha BAR 400 in the US) is the obvious alternative to the YAS-209. It’s considerably more expensive, but does include Yamaha’s excellent multiroom system. That aside from that the two are very similar, with virtually the same set of features. However the BAR 40 doesn’t have Amazon Alexa built-in, it just works with it, so unless you have your heart set on MusicCast it’s hard to justify the price premium.",
    "The Yamaha YAS-209 does a fantastic job of upgrading the sound quality of your TV without drawing attention itself. Hidden in the minimalist chassis is a decent set of speakers and some powerful amplification. Once you add the separate subwoofer, you have a complete sonic experience that sounds big and goes deep. The system might only have 2.1 channels, but the inclusion of DTS Virtual:X also manages to create a greater sense of surround presence.",
    "The lack of support for Yamaha’s MusicCast multiroom system is a shame, but something had to give at this lower price point. However, the inclusion of Amazon Alexa makes up for it to a degree, and turns this soundbar into a fully-functioning smart speaker.",
    "Overall the YAS-209 is a competitively priced bar and sub combo that covers all the important bases, and manages to sound acoustically accomplished at the same time."
  ],
  "headers": {
    "3": "Price and release date",
    "5": "Design",
    "11": "Features",
    "17": "Performance",
    "26": "Other soundbars to consider",
    "28": "Verdict"
  },
  "links": {
    "Sonos Beam": "https://www.techradar.com/reviews/sonos-beam-review",
    "Yamaha BAR 400": "https://www.techradar.com/reviews/yamaha-musiccast-bar-400"
  }
}