{
  "source": "https://www.techradar.com/reviews/a-small-orange",
  "title": "A Small Orange review",
  "category": "computing",
  "updated": "2020-10-15T08:43:05Z",
  "author": "nate-drake",
  "summary": "Web hosting plans from a community orientated provider",
  "verdict": "A Small Orange has a decent range of products with responsive live chat support, and we like the 90-day money-back guarantee, but it doesn't quite have the features, the speed, the prices or any other compelling reason to choose it above the top competition.",
  "pros": [
    "90-day money-back guarantee",
    "Softaculous auto-installs WordPress and 100s of other apps",
    "cPanel website management",
    "Helpful live chat support"
  ],
  "cons": [
    "Above average prices",
    "Bandwidth and storage limits on most plans",
    "Signup hassles",
    "Disappointing shared hosting speed test results"
  ],
  "article": [
    "A Small Orange was initially founded in 2003 in Atlanta, Georgia with one of their aims being to provide top customer service. They also believe in giving back to the community by offering discounts to approved non-profits and charities. A Small Orange was acquired by the behemoth of web hosting which is the Endurance International Group (EIG) in 2012. EIG own some of the largest and most well-known web hosting companies such as Bluehost, HostGator and iPage.",
    "The company's four shared hosting plans are reasonably well specified. Even the cheapest supports unlimited email and FTP accounts, NGINX-powered WordPress-optimized servers, cPanel management and Weebly Cloud for simple drag-and-drop website building. There's 24/7 email and live chat support if anything goes wrong.",
    "Unusually, A Small Orange has storage and bandwidth limits on all shared hosting plans. If you're looking for unlimited hosting, that may seem to be a problem, but keep in mind that no host really offers 'unlimited' anything; it's just a marketing term. At least A Small Orange tells you up-front what its limits are.",
    "The Tiny plan has some extreme limits, at 500MB storage, 5GB bandwidth and support for a single website. It looks a little overpriced at $6.51 a month on the annual plan.",
    "The Small plan offers a more reasonable 5GB storage and 50GB bandwidth, supports as many websites as you can squeeze into your web space, and throws in a free domain. It's yours for $8.80 a month billed annually, a smarter choice, though still more expensive than some competitors.",
    "The $16.50 Medium plan upgrades you to 15GB storage and 150GB bandwidth, while the $27.50 Large plan ramps up your allowance to 30GB storage and 500GB bandwidth. Both are billed monthly, not annually.",
    "If shared hosting isn't enough, VPS plans range from 1 core, 30GB storage, 1GB RAM and 5GB bandwidth from $24.20 a month, to a monster 8-core, 250GB storage, 10GB RAM and 5TB bandwidth product from $181.50.",
    "The company has a range of managed dedicated server plans, too, starting at $119.90 a month for a single CPU system with 4GB RAM, 1TB storage, 5 IPs and 5TB bandwidth.",
    "If you're unsure whether these plans are right for you, good news: A Small Orange effortlessly outperforms the usual 30-day money-back guarantee, giving you a generous 90 days to make your mind up on shared web hosting, reseller packages, Cloud VPS and Semi-Dedicated plans. There are some restrictions, but nothing surprising: you're not covered for domain registrations, setup fees, dedicated servers or if you've had an account before, for instance.",
    "Signing up with A Small Orange seems easy, at least initially. Choose your hosting plan, decide on the domain you're going to use (you can register a new one, or use a domain you own already), then pay your fees via card or PayPal: simple, right?",
    "Not so fast.",
    "After paying, we received a verification email, clicked the link, but found we couldn't log in. Maybe this would all be explained in a 'Welcome' email, we wondered? Nope: nothing arrived.",
    "The next time we heard from the company was a day or two later, when it sent us 'a friendly reminder' that the invoice we'd paid already (and had the PayPal receipt to prove that) was, ummm, overdue, and apparently expected us to pay it again.",
    "Concerned, we reset our password, logged into the website and created a support ticket explaining the problem and including our PayPal receipt. That would surely solve the problem, we thought.",
    "Nothing happened for two days, but finally A Small Orange got in touch, with... A second reminder to pay the invoice we'd paid already.",
    "We rushed off to live chat early the next morning, and an agent quickly appeared. We explained the problem, he apologized, said they were checking their payment records, and we'd receive an email very soon with an update.",
    "When nothing had arrived by the early evening, we updated our support ticket - now more than three days old, without a single response - and finally, 20 minutes later, a reply arrived apologizing and saying the payment had been applied to our account.",
    "The agent also said he understood the delay was 'frustrating', but they were working through the tickets as fast as they could. That's hardly encouraging, as it suggests our three-days of silence wasn't some fluke, but the standard ticket wait time. That's well below the standards we'd expect for even simple consumer hosting.",
    "The A Small Orange web management console couldn't be more standard: a regular WHMCS front end for billing and account management, the usual handful of icons pointing to common tasks and areas (create an email account, run a backup, launch the File Manager), and an option to launch the full-strength cPanel with a click.",
    "This might seem a little baffling to hosting newbies. If you're just looking to install WordPress or use Weebly's Website Builder to create your site, for instance, there's no obvious icon or shortcut to point you in the right direction. Fire up cPanel, though, and the Software area contains the key functions you need.",
    "Softaculous enables automatic installation of WordPress, Drupal, Joomla, PrestaShop, osCommerce and hundreds of other top apps. It's an excellent platform, and probably the best of its type.",
    "Weebly support gets you the ability to create one site with its easy-to-use drag-and-drop editor. (Even though A Small Orange's high-end plans support creating multiple websites, only one of these can be built using Weebly.)",
    "You can also use cPanel's file manager to upload a static website with little more than a drag and drop.",
    "A Small Orange knowledgebase is on hand if you need instant help with any issues. It's not as detailed or clear or comprehensive as we'd like, but the articles seemed reasonably well organized, and the search system generally pointed us in the right direction.",
    "Search for WordPress, for instance, and the website points users to Softaculous and explains how it works. And if you search for 'Import WordPress', the top three hits are 'Softaculous Overview', 'Move your WordPress site to A Small Orange' and 'Install a new WordPress instance', which seem to cover all your options.",
    "Browsing these articles highlighted a potential problem, though: some of them are ancient (the three WordPress articles we mentioned above are dated 2012-2014.) We didn't work through these to look for issues, but it's likely that some of the content will be outdated.",
    "Although we had major issues earlier with support tickets, when using live chat to ask a simpler question - how do I do this, why am I seeing this error - we found A Small Orange delivered better results. Wait times were short, with a first response within a couple of minutes, and the agents did a good job of telling us whatever we needed to know.",
    "We completed our review by setting up a small static website with A Small Orange' starter Tiny plan, then using Uptime.com to monitor its availability and response times over the course of a week.",
    "Our site achieved a perfect 100% uptime, but average response time was a slightly disappointing 388ms (most shared hosting product achieve somewhere between 200-400ms.)",
    "While that's not good news, remember that our comparisons are only based on the cheapest shared hosting plans for each provider. They can't tell you the results you might see if you're upgrading.",
    "A Small Orange scores in some areas - quick and helpful live chat support, 90-day money-back guarantee - but the lack of features, above average prices, disappointing test results and our major signup hassles have to be a concern. Check it out if a plan fits your specific needs, but otherwise look elsewhere."
  ],
  "headers": {
    "9": "Setup hassles",
    "18": "Creating a website",
    "23": "Performance",
    "30": "Final verdict"
  },
  "links": {
    "A Small Orange": "https://asmallorange.com/",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "iPage": "https://www.techradar.com/reviews/ipage",
    "shared hosting plans": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "Tiny plan": "https://asmallorange.com/hosting/shared/",
    "Small plan": "https://asmallorange.com/hosting/shared/",
    "Medium plan": "https://asmallorange.com/hosting/shared/",
    "Large plan": "https://asmallorange.com/hosting/shared/",
    "VPS plans": "https://www.techradar.com/news/best-vps-hosting",
    "dedicated server plans": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "some restrictions": "https://asmallorange.com/legal/terms",
    "knowledgebase": "https://customers.asmallorange.com/index.php/knowledgebase"
  }
}