{
  "source": "https://www.techradar.com/reviews/wahoo-elemnt-rival",
  "title": "Wahoo Elemnt Rival review",
  "category": "wearables",
  "updated": "2020-12-04T16:02:31.221Z",
  "author": "sarah-finley",
  "summary": "Wahoo's first sports watch helps track triathlons and runs in detail with ease",
  "verdict": "The Wahoo Elemnt Rival is a lightweight watch which sits comfortably on your wrist without feeling like a foreign object. The lack of touchscreen is one of its downfalls, but the detailed tracking via the app is valuable for athletes who want to progress.",
  "pros": [
    "Lightweight",
    "Excellent GPS",
    "Detailed in-app tracking"
  ],
  "cons": [
    "No touchscreen",
    "Sensors hard to pair",
    "Chunky design"
  ],
  "article": [
    "The Wahoo Elemnt Rival offers triathletes and runners functionality for which Wahoo products have always been known. Powered by Wahoo's Elemnt technology and incorporating multisport features the watch simplifies your fitness results, allowing you to focus on your performance.",
    "Its built-in GPS will record your progress through different stages of a multi-sport event. We love its unique transition technology, which means you don’t even have to inform, or touch the watch, when you swap from swim to ride to run.",
    "The 14-day battery life is also a plus, while its in app performance tracking will have any athlete glued to their results for hours afterwards – calculating how they can perform better next time.",
    "Although it is primarily a sports watch, it would be great to see some more smartwatch features to give athletes an all-round picture of what other lifestyle habits could be affecting their performance.",
    "The Wahoo Elemnt Rival was released in November 2020, and is available direct from Wahoo.",
    "Priced at $379 / £281 / AU $510, it's on the expensive side for a sports watch, but if you’re keen on multi-sports tracking then it could be worth the investment. It matches the price of Polar’s Grit X outdoor watch, which does also offer triathlon-friendly features. It comes in $100 cheaper than the Garmin Forerunner 745, Garmin’s cheapest triathlon-friendly watch.",
    "The design of the Wahoo Elemnt Rival is very much designed around practicality for sportspeople. Despite nods to style, it's clearly not a ‘fashion’ watch – unlike some of the other smartwatches on the market.",
    "The Rival is It's available in two colorways (Kona White and Stealth Gray) and at first glance looks much like your standard sports watch – a chunky circular case with five buttons on the sides. What sets the Elemnt Rival apart is its smart angled ceramic bezel, which is theoretically more resistant to scuffs and scratches than metal or plastic, and is topped off with Gorilla Glass.",
    "It's also light (weighing 53g – the same as the Garmin Instinct Solar) and extremely comfortable. The silicone strap is sturdy but not too stiff, and even when its fitted tight on to your wrist it doesn’t dig in – you barely feel as though you’re wearing it.",
    "The watch face has four different options, including two digital versions and two analog ones, but we preferred the simple digital version, which included large numbers and smaller lettering for steps and heart rate monitoring. The colours and widgets can also be changed, via the app.",
    "The watch has two buttons to the left of the clockface and three to the right. The buttons were confusing to start with and it took a while to figure what did what - while the lack of touchscreen was very apparent when you were using it on a day to day basis.",
    "The light, which can be activated by a quick tap of the top left button, is bright enough to see the screen clearly, but not over bearing – and also handy if you’re running in the dark.",
    "We liked how large the displays were while monitoring your progress. The last thing you want to do in the middle of a run or ride is take your eyes off the road – so a quick glance is enough to know if you’re on track.",
    "The water resistant watch also has a middle right button, which acts as a menu for the different exercise choices, while it also selects and starts the workouts. The bottom left can be tapped three times to show different levels of your activity on race day or when your training, including your heart rate, elevation and timings.",
    "While the light button, top left, also acts as a lock if you hold it down – which is great if you’re transitioning from running to the bike or a swim and you are likely to knock it.",
    "Once charged, the Elemnt Rival's battery will last up to 14 days (depending on usage) – an impressive period that makes it a solid choice for multi-day events.",
    "We found the charging cable a little tricky to clip in at first, the gold sensors at the back clip into the port, after you release the lever. The watch lights up when its fully connected and informs you how much charge it has left.",
    "The Elemnt Rival has ball-day hear rate monitoring, step count, and calories burned. It isn't intended to compete with an Apple Watch 6 or Samsung Galaxy Watch 3. You won't find contactless payments, third-party apps or music integration here; this is a watch for workouts first and foremost.",
    "You will, however, receive call and text notifications mid-workout, which is a feature we always appreciate. You can also get email alerts, but only if you're an iPhone user.",
    "We’d love to see some other features on it though, such as stress and sleep monitoring as found on Polar and Garmin's latest multi-sports watches. As any athlete knows these are some of the factors which help or hinder your performance on the day, and a 'recharge' score can be a useful training tool.",
    "The Wahoo Elemnt Rival is designed with triathletes in mind, and as such, most of its sports tracking modes are dedicated to cycling, swimming and running (both indoor and outdoor), with only strength training and yoga included as alternatives. Its key selling point, however, is its dedicated tri mode, which can detect when you're making a transition and change tracking modes automatically.",
    "In our tests, we found that it took a few seconds for the watch to recognize that we were switching between stages, but we didn't lose data while this was happening and it wasn't a major issue.",
    "The Element Rival can also transmit data from the watch to your Wahoo bike computer and back again during transitions. We haven't had the opportunity to test this particular feature yet, but will update this review when we do.",
    "If you want to check how you’re doing mid-workout, tap the bottom left button - each press will give you different results including your heart rate, elevation and how many miles you’ve run. An ambient light sensor automatically adjusts the display, making it easy to read in dark and light conditions.",
    "Once the Elemnt Rival achieves a GPS lock, the circle will turn green and the workout button will also turn green – meaning you’re ready to go. We found the GPS tracking accurate and consistent, with no loss of signal in built-up areas.",
    "The Wahoo Elemnt Rival can also be connected to additional sensors like heart rate monitors and footpads via Bluetooth and ANT+. though we found this process somewhat tricky, which was a shame considering how intuitive the interfaces is otherwise.",
    "We appreciated the detailed breakdowns provided in Wahoo’s app, which for running included pace, elevation, cadence and laps (all synced automatically). Pace, HR and cadence are represented in a graph, which can be tapped on for extra information on specific times.",
    "The laps feedback also gives you a detailed breakdown of how you performed at each mile. However, it doesn’t allow you to compare the detail for different laps side by side. Heart rate zone information is also broken down into time and percentages of when you were in a fat burning, cardio and hard HR zones.",
    "The app also lets you enable live tracking, which is not only useful for friends and family who want to follow you during a race, but also for safety when you're out training alone.",
    "First reviewed December 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "4": "Price and release date",
    "6": "Design and display",
    "15": "Everyday use",
    "20": "Fitness tracking",
    "26": "Companion app",
    "29": "Don't buy it if"
  },
  "links": {
    "direct from Wahoo": "https://www.wahoofitness.com/",
    "Polar’s Grit X": "https://www.techradar.com/reviews/polar-grit-x",
    "Garmin Forerunner 745": "https://www.techradar.com/reviews/garmin-forerunner-745",
    "Garmin Instinct Solar": "https://www.techradar.com/reviews/garmin-instinct-solar"
  }
}