{
  "source": "https://www.techradar.com/reviews/bvpn",
  "title": "b.VPN review",
  "category": "computing",
  "updated": "2020-10-20T16:11:48Z",
  "author": "sead-fadilpasic",
  "summary": "Ultra-fast VPN that bypasses DPI with its Smoke Tunnel technology",
  "verdict": "Unblocking geo-restricted VOD channels, supporting P2P, and beating DPI with customized tools, b.VPN is good but ultimately too expensive. Its shortcomings, like a very limited server network, lack of a refund guarantee, and some logging, make it not really worth the price it’s asking.",
  "pros": [
    "Unblocks Netflix and BBC iPlayer",
    "Top speeds",
    "Implements customized Smoke VPN tunnel",
    "Can be installed on a router"
  ],
  "cons": [
    "Expensive",
    "Some logging",
    "Not many servers",
    "No refund guarantee"
  ],
  "article": [
    "b.VPN is a simple VPN platform that is capable of getting its users through regional blocks and deploys its custom-developed Smoke Tunnel to bypass DPI obstacles and enable torrenting.",
    "Despite its advantages, however, b.VPN doesn’t come anywhere near the best VPN solutions we had the chance to test.",
    "b.VPN comes in three plans. As usual, the most expensive option is monthly at $9.99/month. It is followed by the 6-month subscription at $8.33/month and finally, the annual plan at $7.50/month, placing this provider among the more expensive VPNs on the market.",
    "With one account, you can run this VPN on up to six devices at the same time. Payments can be made using PayPal, credit/debit cards, Alipay, Webmoney, BlueSnap, Western Union, UKash, CASHU, vouchers, Bitcoin, and other methods.",
    "There’s a free trial on all supported operating systems, but it’s a bit short - giving you only one hour to see if you like the platform. As of September 2019, this VPN no longer provides refunds for purchases made on its website, citing abuses. However, it does say that refunds might be considered “in case you provided a proof that you have significant problems using the service but with no guarantees of a refund.”",
    "While b.VPN may be a good choice for some, the fact remains that it’s too expensive while it doesn’t offer as much as its cheaper counterparts like CyberGhost, IPVanish, or NordVPN. Even the famed ExpressVPN, considered the best VPN provider on the market, is cheaper at the moment - being offered with three extra months for free if you opt for its annual plan. Even without the discount, you’d need to add less than a dollar per month to what you’d be paying for b.VPN and you’d get a richer and more advanced VPN service.",
    "Thanks to its VPN servers in the US and UK, b.VPN allows you to unblock geographically limited streaming services like Netflix, BBC iPlayer, Hulu, HBO, and others, from any location in the world.",
    "b.VPN is headquartered in the Netherlands. The company offers its services on 40 servers in 17 countries, including Australia, Singapore, Ukraine, Saudi Arabia, India, and so on.",
    "b.VPN supports OpenVPN, L2TP, and SSH protocols, as well as the custom-developed Smoke VPN tunnel that is capable of defeating “the strongest DPI firewalls”. The Smoke Tunnel also makes this provider a great choice for P2P traffic and torrenting.",
    "Additionally, the platform uses an optional VPN kill switch, a tool that completely shuts off your Internet connection if the VPN connection fails. There’s also the optional IPv6 leak protection you can turn on in the app’s settings.",
    "This vendor strictly claims it does not collect any data about how you use its VPN, meaning which “applications, websites, addresses, or services you reached using bVPN for any amount of time or purpose”. It does, however, record VPN connection data - the server you connected to, connection time stamps, as well as the originating IP - but states that it is only collected to improve service speed and availability in different geo locations and is “accessed only by the highest level of administrators that operates bVPN.” That said, the only way to really know for sure what exactly is and isn’t logged is to have an independent company conduct an audit and publish its findings.",
    "b.VPN has its OpenVPN apps for iOS, Android, Windows, Mac, and Linux which you can download from the website, but it can also be enabled on PlayStation, Xbox, Chromium OS, Apple TV, Windows Phone, TV Box, and DD-WRT router, the latter removing the limitation on six simultaneous connections.",
    "All the installation guides are available on the website’s help center, where you can also find more information about speeding up your VPN connection, fixing the familiar TAP driver error on Windows, using a third-party software to connect to b.VPN servers, and more.",
    "Its Android app has been downloaded over 100,000 times and has gotten a rating of 4.1 stars out of 5 according to the opinion of 1,333 users. It was last updated on June 19, 2020. The iOS app has an even higher score - 4.5 as rated by 759 people. It was updated last time on November 20, 2019.",
    "If the help center fails to address your concerns, then human customer support is the next logical choice. You can reach it 24/7 via web form, email, phone, and online chat.",
    "We first tested the service by connecting to a server in France, and the download speeds were outstanding - 35Mbps on a 50Mbps testing connection. The next speed test was run for US-California server, bringing speeds of up to 21Mbps, which is very good considering it’s pretty far away from our location. Our final test was for a bit more exotic location - Malaysia, Kuala Lumpur. The app struggled a bit with it, only reaching 3-4Mbps, but to be fair, we were warned, as the app itself lists all the servers along with their ping.",
    "Installing and using the Windows app was a piece of cake. The only inconvenience was the fact that server switching isn’t very quick - you first need to disconnect from the current server, then open the server list, select a new one, and click “connect”.",
    "b.VPN does what it’s supposed to - enables torrenting, removes regional blocks imposed by the likes of Netflix and BBC iPlayer, as well as deploying its custom protocol in countries that implement DPI technologies. However, it is expensive if we take into account how little servers it has, the amount of logging that takes place, as well as the lack of a clear money-back guarantee.",
    "All things considered, a top-performing provider such as ExpressVPN is a much more logical and cost-effective choice."
  ],
  "headers": {
    "2": "Price",
    "5": "Alternatives",
    "6": "Streaming",
    "7": "About the company",
    "8": "Privacy and encryption",
    "11": "Support",
    "15": "Speed and experience",
    "17": "Verdict"
  },
  "links": {
    "b.VPN": "https://www.bvpn.com/en/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "IPVanish": "https://www.techradar.com/reviews/ipvanish-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-3328633065097972000"
  }
}