{
  "source": "https://www.techradar.com/reviews/pearlvpn",
  "title": "PearlVPN review",
  "category": "computing",
  "updated": "2020-12-11T15:46:16Z",
  "author": "sead-fadilpasic",
  "summary": "User-friendly but very limited",
  "verdict": "PearlVPN is simple to use and will provide you with a VPN connection, but don’t expect much else. It has no mobile apps, there’s only one server, it has painfully limited information on its website, and customer service didn't respond to our queries.",
  "pros": [
    "Easy to use",
    "Money-back guarantee"
  ],
  "cons": [
    "Limited platform coverage",
    "Only one server can be used",
    "Very little information on the website",
    "Just two pricing options"
  ],
  "article": [
    "PearlVPN is a VPN services that does what it’s supposed to, but nothing more. It provides military-level encryption and tunnels your traffic through its secure server, but that’s about it.",
    "We wanted to know more about what it can offer, but unfortunately we were prevented from doing so by the lack of information on its website and a total absence of communication on the provider’s side.",
    "If you want to purchase this provider’s services you’ll only be offered two choices - a monthly or annual plan. The monthly subscription is charged at $9.99/month, while the annual one costs $71.88/year (or $5.99/month).",
    "Each account allows up to 5 simultaneous VPN connections.",
    "No free trial is offered, but its 30-day money-back guarantee is more than enough to test this service out and see if it suits your requirements. However, there is contradictory information about the length of the guarantee; PearlVPN’s Terms of Service state the guarantee lasts only 7 days.",
    "You can pay using credit/debit card or PayPal.",
    "While not horribly bad, PearlVPN is certainly no match for the likes of ExpressVPN, whose exceptional platform is light years away in almost all areas.",
    "And let’s not forget to mention NordVPN, Surfshark and CyberGhost, all of which offer a much more advanced service with thousands of servers, beautiful native clients, detailed information on their websites and more.",
    "Many VPNs proudly boast their capability to provide their users with access to popular streaming platforms like Netflix or BBC iPlayer, that are otherwise unavailable in some regions.",
    "PearlVPN doesn’t unblock these popular platforms, so if this is a deal-breaker for you, you might want to look for another service.",
    "According to the provider’s Terms of Service, “all intellectual property rights on PearlVPN.com are owned by London Trust Media, Inc. and are protected by United States and International copyright, trade dress, patent, and trademark laws, international conventions, and other laws protecting intellectual property and related proprietary rights.”",
    "PealVPN claims to offers access to servers across 33 cities in 25 countries, including in Saudi Arabia, Vietnam, Iceland, Isle of Man, Hungary, and more. However, upon signing up, we were only given access to one server in the US.",
    "To keep your sensitive information private from snoopers, PearlVPN uses OpenVPN, IPSec, and PPTP, as well as the “military” encryption (we’re guessing 256-bit but cannot be sure).",
    "There’s no information on torrenting or P2P traffic anywhere on the website, so it’s safe to assume that such activities aren’t supported by this provider. Add to this the fact that the company seems to be registered in the US, where these activities are illegal, and such policies make perfect sense.",
    "The provider’s Privacy Policy states that it “does not collect or log any traffic or use of its Virtual Private Network (VPN) or Proxy” and this is the only sentence that even mentions logs. Everything else is devoted to collecting personal information from the website and email.",
    "Since there hasn’t yet been a detailed analysis of the truthfulness of these claims by an independent auditor, we have no choice but to trust the provider, even though we have no idea what else may be collected outside of the “traffic” - like your IP address, connection times, or bandwidth data.",
    "PearlVPN only has clients for Windows and Mac, but it can be manually installed on Chrome OS as well with the help of OpenVPN config file, or the device’s own built-in VPN via PPTP or IPSec protocols. No mobile platforms - sorry.",
    "The website is rather limited, only offering the most basic and necessary details, such as Terms of Service, Privacy Policy, and short installation manuals. Should you run into any problems or simply need information that isn’t available on the website (which is quite possible), you can try contacting customer support via contact form or email.",
    "We tried contacting the provider directly with some questions about its platform, and received nothing back.",
    "We tried connecting to several server locations provided in the app but we couldn’t seem to connect. It took us a while to realize that for some reason, we could only connect to a server in the US (even though other servers were clearly shown in the app), which gave us a pathetic 3.50Mbps on a 36.60Mbps testing connection.",
    "By installing the service manually using third-party OpenVPN software and a config file we connected automatically to a server in Illinois, US, which gave us a more acceptable 12.57Mbps.",
    "PearlVPN has plenty of issues that stand in the way of it becoming a celebrated VPN provider. It has a limited server network, no mobile apps, lacks information on the website, doesn’t respond to emails, and has only two pricing options.",
    "Its only redeeming features are the user-friendliness of its apps and the existence of a money-back guarantee (although even this is unclear)."
  ],
  "headers": {
    "2": "Price",
    "6": "Alternatives",
    "8": "Streaming",
    "10": "About the company",
    "12": "Privacy and encryption",
    "16": "Support",
    "19": "Speed and experience",
    "21": "Verdict"
  },
  "links": {
    "PearlVPN": "https://www.pearlvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Terms of Service": "https://www.pearlvpn.com/terms-of-service.html",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://www.pearlvpn.com/privacy-policy.html",
    "contact form": "https://www.pearlvpn.com/contact/",
    "email": "mailto:support@pearlvpn.com"
  }
}