{
  "source": "https://www.techradar.com/reviews/invisible-browsing-vpn",
  "title": "Invisible Browsing VPN review",
  "category": "computing",
  "updated": "2020-07-20T13:23:39Z",
  "author": "mike-williams",
  "summary": "Now you see me, now you don't…",
  "verdict": "The Ultimate plan offers a stack of advanced features, but clients can be awkward to use, and we found speeds were poor in some locations. Test carefully before you buy.",
  "pros": [
    "Low prices",
    "Stacks of features",
    "Unblocks US Netflix, iPlayer, Amazon, Disney+",
    "Bitcoin supported"
  ],
  "cons": [
    "Apps can be awkward to use",
    "Windows app has some annoying issues",
    "Below average speeds in some locations",
    "No security audit"
  ],
  "article": [
    "Invisible Browsing VPN (ibVPN) is a small Romanian-based company which offers an array of interesting privacy and VPN features.",
    "The service has a capable network of servers spread over 46 countries (some supporting P2P), more than you'll see with many providers, and with some not-so-common locations, too: Chile, Colombia, Iceland, Israel, Malaysia, Russia, UAE, Ukraine and more (see the full list and their current status here).",
    "A wide range of apps covers you on Windows, Mac, iOS and Android. Chrome, Opera and Firefox extensions are available, you can manually set up the service on other platforms, and there's support for connecting up to five devices simultaneously.",
    "IbVPN supports a host of connection technologies, from standard protocols such as L2TP and OpenVPN, to stealth technologies which might help you bypass VPN blocking (Obfsproxy), to proxy and proxy variations (Shadowsocks, Socks5), TOR over VPN, Double VPN (pass traffic through two VPN servers), SmartDNS for website unblocking, and more.",
    "And of course, there's plenty more, from a no-logs promise to 24/7 support, and even an option for remote assistance.",
    "IbVPN's pricing scheme is complicated, with four plans available, each with their own mix of features and aimed at a different audience.",
    "The best offering by far, the Ultimate plan, offers all the features we've described, for $10.95 billed monthly, or $4.84 on the annual plan.",
    "The others - Standard, Torrent, SmartDNS are significantly cheaper at $4.95 billed monthly, $3.08 on the annual plan, but have some major limits. They only support one device at a time, for instance, and they drop several other features. The Standard plan doesn't have SmartDNS or P2P; the Torrent plan drops the browser extensions and proxy servers; the SmartDNS plan is all about website unblocking via SmartDNS, and isn't a VPN.",
    "Ultimate VPN is the best all-purpose plan, then. If you're intrigued, a 24-hour trial enables checking out how the service works for you. And if you decide to sign up, you're able to pay via cards, PayPal, Bitcoin and a host of other payment types.",
    "IbVPN's privacy policy is a well-designed document which ditches the usual legal jargon, replacing it with short, clear paragraphs which you might actually want to read.",
    "Arguably, the document is a little too short. This is the entire logging policy, for instance:",
    "\"ibVPN does not collect or log any traffic or use of its Virtual Private Network service.",
    "We cannot relate any specific activity with any specific user. If any legal notices are forwarded to our legal department we will comply with that notice. However, we cannot be compelled to hand over information which we do not have.\"",
    "We have some questions about that. Does a commitment not to log the 'use' of the VPN rule out any form of session logging, for instance, such as recording connect and disconnect times, bandwidth use, incoming and outgoing IP addresses? We're not completely sure, which is why it's better for privacy policies to specifically rule out various logging types.",
    "Even the best written privacy policies are still just words on a website, of course. That's why some VPNs, including the likes of NordVPN, TunnelBear and ExpressVPN, put themselves through security and privacy audits, to provide independent verification that they're living up to their promises. Hopefully ibVPN will do the same, in future.",
    "IbVPN gives you just a 24-hour trial, as mentioned, but it's unrestricted and doesn't require any credit card details. Just enter your name, email address and a password and your new account should be activated within minutes.",
    "We signed up and the website presented us with a lengthy list of downloads. IbVPN has clients for Windows, Mac, iOS and Android, as well as simple extensions for Chrome, Firefox and Opera. There are also guides on setting up proxies, SmartDNS and more.",
    "We grabbed a copy of the latest Windows client. The installer downloaded quickly, and set itself up with no hassles or complications.",
    "The Windows client opens with a surprisingly cluttered dashboard. The Servers tab, for instance, has connection status information, buttons to view the log, enable or disable the kill switch or ibVPN's DNS, even pointless company-related information (links to the News page and social media), but doesn't initially list any servers. The client displays these in a separate panel with three tabs: one for servers, one for protocols, and another for a Connection wizard.",
    "Even the server list is more complex than usual. This has server categories at the top (Fastest, P2P, Gaming, Tor over VPN, Double VPN), then lists countries, but not in alphabetical order (Italy, Canada, Spain, Australia, Germany.) There is genuine power here - so for example you can view the servers within a country and see their current load, then mark commonly used servers as Favorites - but it takes some time and effort to find your way around.",
    "A Connection Wizard could be a smarter choice for the beginner. Select the option that most represents what you need (speed, UK streaming, US streaming, P2P support, to get online in China) and the client will connect you to the best server in a couple of clicks. This is a good idea, but ibVPN still makes it more difficult than it needs to be. Previous CyberGhost apps have done something similar by displaying colored tiles with two or three words describing their purpose; this client uses lengthy captions and some technical jargon.",
    "Opening the Settings screen revealed some neat touches you don't often see elsewhere.",
    "A Rotating Favorites scheme changes your location from one favorite to the next every few minutes.",
    "Two kill switches to help you control what happens if the connection drops. A standard system-level switch blocks all internet traffic, or you can opt to close specific applications, and even restore them when the VPN reconnects.",
    "There are two layers of DNS protection, and an option to disable IPv6 traffic.",
    "The client is exceptionally configurable. You're able to decide when it launches, whether it reconnects immediately, how its window is displayed, whether you see notifications, or the client asks you for confirmation about various actions. For example, initially you get an \"are you sure?\" message whenever you change locations, but if that gets annoying you can turn it off with a click.",
    "If you're mostly looking for point-and-click simplicity, then none of this will matter much, and ibVPN's Windows client will feel like an overcomplicated mess.",
    "Even experienced users will occasionally get confused. If you'd like to change protocol you'd click Settings, right? Wrong; here, the Protocols list is alongside the Servers list.",
    "Once you've found the protocols list, though, it's hard not to be impressed by the number of options: OpenVPN UDP and TCP, L2TP, SSTP, a custom stealth protocol, Shadowsocks, and PPTP if you really must (the client warns it's outdated and less secure.)",
    "If you'll appreciate this level of configurability, if you'll use the client's more advanced features, you might feel able to forgive its various interface issues. It's definitely worth a closer look.",
    "IbVPN's app doesn't just look complicated; it behaves in some surprising ways, too.",
    "When we set up the VPN to connect to the fastest server, we expected it to choose the nearest location to us, in the UK. Sometimes it did, but it also connected us France, and Belgium.",
    "This gets particularly confusing if the connection drops. Once, we were connected to the UK when the VPN went down. The client quickly reconnected, but to Belgium, potentially causing real problems (you might find you're suddenly blocked on a streaming site, say, or an online store won't allow you to check out.)",
    "As the app connected, Windows sometimes asked if we wanted our device to be discoverable by other devices on the network (that is, should Windows treat this as a Public or Private network.) That's not as massive a choice as it sounds - selecting Yes doesn't somehow mean other users can see your traffic or hack your hardware - but it's sure to confuse and alarm novice users, and there's no real need to ask the question at all.",
    "IbVPN's app-based kill switch worked as advertised, quickly closing the processes we chose whenever the VPN dropped.",
    "The system-wide kill switch wasn't as effective, leaving a brief delay between the VPN going down, and the app blocking our network access. The vulnerability typically lasts only two or three seconds, though, and otherwise the kill switch worked well, resisting all our attempts to break it, and reconnecting as quickly as possible.",
    "IbVPN's Ultimate plan gets you a VPN and Smart DNS service, which should make it ideal for unblocking websites. But how does it perform in the real world?",
    "Perfectly, at least according to our tests, with the VPN getting us access to everything from BBC iPlayer, to US Netflix content, Amazon Prime Video and Disney+.",
    "We normally begin our speed tests by allowing the VPN app to connect to the fastest server. But in this case, although we were in the UK, the app kept choosing Belgium, which could only manage a poor 15Mbps.",
    "Performance picked up when we manually switched to the UK, and we hit a more acceptable 45-55Mbps on our 75Mbps test line. But that's still 15-20Mbps less than the best VPNs.",
    "VPN speed can vary considerably depending on where you are, though, so we ran a second set of tests from a European data center with a fast 350Mbps+ connection.",
    "This time ibVPN did much better, hitting 130-150Mbps. That can't entirely make up for our below-average UK performance, but it shows ibVPN is capable of some impressive speeds, and hopefully that's the way it'll be on the routes you need.",
    "IbVPN's stack of features and configurable clients have a lot of appeal, especially for experts. It's not always easy to use and we found speeds could be below average on a few locations, but it's worth taking the 24-hour trial for a spin, to see how the service works for you."
  ],
  "headers": {
    "9": "Privacy",
    "15": "Apps",
    "30": "App testing",
    "36": "Performance",
    "42": "Final verdict"
  },
  "links": {
    "Invisible Browsing VPN": "https://www.ibvpn.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "see the full list and their current status here": "https://www.ibvpn.com/server-list",
    "four plans available": "https://www.ibvpn.com/plans-vpn-smartdns/?utm_expid=.zBFa7eLIQ1m-cprYkQ1-fw.1&utm_referrer=https%3A%2F%2Fwww.ibvpn.com%2F",
    "Ultimate plan": "https://www.ibvpn.com/plans-vpn-smartdns/?utm_expid=.zBFa7eLIQ1m-cprYkQ1-fw.1&utm_referrer=https%3A%2F%2Fwww.ibvpn.com%2F",
    "annual plan": "https://www.ibvpn.com/plans-vpn-smartdns/?utm_expid=.zBFa7eLIQ1m-cprYkQ1-fw.1&utm_referrer=https%3A%2F%2Fwww.ibvpn.com%2F",
    "billed monthly": "https://www.ibvpn.com/plans-vpn-smartdns/?utm_expid=.zBFa7eLIQ1m-cprYkQ1-fw.1&utm_referrer=https%3A%2F%2Fwww.ibvpn.com%2F",
    "privacy policy": "https://www.ibvpn.com/privacy-policy/",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "TunnelBear": "https://www.techradar.com/reviews/tunnelbear-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn"
  }
}