{
  "source": "https://www.techradar.com/reviews/keap",
  "title": "Keap email marketing software review",
  "category": "computing",
  "updated": "2021-09-22T16:26:14.206Z",
  "author": "richard-sutherland",
  "summary": "A complete sales, marketing, and CRM tool for small businesses",
  "verdict": "Keap is an excellent, all-encompassing customer relationship and marketing solution for small businesses, but it has a high price and steep learning curve compared to most email marketing tools.",
  "pros": [
    "Outstanding interface for complete customer management",
    "Excellent support and coaching packages"
  ],
  "cons": [
    "Keap lacks the deep data mining features of Infusionsoft",
    "Expensive if all you need is email marketing"
  ],
  "article": [
    "In 2018, customer relationship management (CRM) software company Infusionsoft was rebranded as Keap. Now, it sells two solutions—Keap and Infusionsoft. Infusionsoft is the company’s original product and has the most advanced features. The new product, Keap, uses a streamlined, small-business-friendly interface suitable for rapid deployment of sales pipelines, marketing automation, and customer management.",
    "In our Keap email marketing review, we take a close look at the platform’s offerings to decide whether it competes with the best email marketing services available today.",
    "The Keap product is divided into two pricing plans with different features—Keap Grow and Keap Pro. Both have a 14-day free trial.",
    "Keap Grow ($79/month) is a basic CRM with tools for client management, email marketing, appointments, and invoicing. Keap Pro ($149/month) adds marketing and sales automation features, a landing page builder, sales pipelines, reports, and API integration.",
    "Infusionsoft ($199/month) is a more powerful CRM software platform with a rather outdated interface. Besides having most of the features available in Keap, it also has a customizable dashboard, lead scoring, shopping carts, and order forms, but it’s not as easy to use.",
    "These base prices include 500 contacts and one user license. Additional user licenses cost $30/month, and additional contacts cost $30 per 1,000. Buying more contacts means a significant discount. For example, 10,000 contacts cost $200 per month, and 50,000 contacts just $350 per month.",
    "What sets Keap apart from competitors is its tightly integrated customer management tools. List management, sales pipelines, marketing campaigns, appointment management, metrics, and invoicing are all readily available in an impressively intuitive interface that gives you an excellent high-level view of your business.",
    "We found Keap to be one of the easiest email marketing solutions to set up, especially considering how many interesting features it includes such as invoicing and appointment management.",
    "Keap has a 14-day free trial, whereas Infusionsoft doesn’t. When we initially tried to sign up for a Keap trial with a Gmail address, it declined us, stating our email’s reputation wasn’t good enough. This may seem a nuisance, but it’s quite common for email marketing software to decline free email addresses to reduce the chances a free trial will be used to send spam. When we signed up with a company email address, it was accepted immediately.",
    "A dedicated Getting Started section of the interface suggests tasks you should do to get Keap set up for your business. These tasks include importing your contacts, syncing your Google calendar for appointment booking, and downloading the Keap mobile app for iOS or Android. Thanks to Keap’s highly intuitive, card-based interface, performing these tasks is a breeze.",
    "Email marketing is just one of Keap’s functions, yet the software includes a wealth of useful tools for designing and automating email campaigns. You can leverage an extensive library of email templates to create great-looking emails using an intuitive drag-and-drop editor.",
    "For contact management, your contacts can be segmented into lists based on how the customer has interacted with your past marketing efforts. You can also perform A/B split testing to see which of your marketing efforts perform better. Email reports are relatively basic, but they include enough to give small business owners an overview of what’s working and what’s not.",
    "Keap boasts a 20% open rate and a 13% click rate on emails, far higher than the industry standard.",
    "Keap’s commitment to data security impressed us. It has PCI DSS level-one on-site assessment certification validated against the Payment Card Industry Data Security Standards. The data centers the company uses have completed Service Organizational Controls (SOC) 2 Type II audits, and servers are protected by biometric physical access control systems.",
    "Keap’s support site is outstanding, with an enormous help center, video tutorials, active user community, live demos, and customer webinars.",
    "Live chat support is available Monday to Friday 6 AM–7 PM PDT, and toll-free support numbers in USA/Canada, the UK, and Australia follow similar hours.",
    "You can also buy expert coaching packages to get you up to speed on the software quickly. The Keap Grow Coaching package ($99) includes access to training webinars and help integrating the software with Gmail, QuickBooks Online, and Outlook.",
    "Meanwhile, the Keap Pro Coaching package ($499) includes three one-on-one coaching sessions with an expert coach. Infusionsoft Coaching ($999) has five sessions and includes the setup of sales and e-commerce.",
    "Keap is a full-featured CRM with features like appointment management and invoicing. If you just want email marketing without all the trimmings, MailChimp is very easy to use and is free if you have fewer than 2,000 subscribers.",
    "Another option focused on email marketing is ActiveCampaign. Although it doesn’t have the flexibility of Keap, ActiveCampaign’s Plus plan is comparable to Keap’s Pro plan in features while being significantly cheaper.",
    "With Keap, the developers have taken the best features of Infusionsoft and streamlined them, making a modern CRM that’s great for small businesses. The interface is highly intuitive, marketing campaigns are easy to build, and the automation tools are immensely powerful once you’ve gotten over the learning curve.",
    "Infusionsoft users may miss the features that have been stripped out in service of Keap’s simplicity, but Infusionsoft is still offered if you prefer it."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "7": "Setup",
    "10": "Performance",
    "13": "Security",
    "14": "Support",
    "18": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "email marketing": "https://www.techradar.com/best/best-email-marketing-software",
    "invoicing": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "landing page builder": "https://www.techradar.com/best/landing-page-creator",
    "CRM software platform": "https://www.techradar.com/best/the-best-crm-software",
    "emails": "https://www.techradar.com/best/best-email-clients",
    "small business": "https://www.techradar.com/best/best-small-business-software",
    "webinars": "https://www.techradar.com/best/best-webinar-software",
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "MailChimp": "https://www.techradar.com/reviews/mailchimp",
    "ActiveCampaign": "https://www.techradar.com/reviews/activecampaign"
  }
}