{
  "source": "https://www.techradar.com/reviews/mailerlite",
  "title": "MailerLite email marketing software review",
  "category": "computing",
  "updated": "2020-10-29T21:56:21Z",
  "author": "richard-sutherland",
  "summary": "An intuitive email marketing tool",
  "verdict": "MailerLite has an intuitive interface and an impressive set of powerful features, making it an excellent tool for small businesses with a modest marketing budget. However, it lacks the comprehensive reporting and complex automation of more involved email marketing services.",
  "pros": [
    "Simple, intuitive interface",
    "Landing page editor"
  ],
  "cons": [
    "Middling email deliverability rates",
    "Lacks social media reporting"
  ],
  "article": [
    "MailerLite is an email marketing software platform for creating newsletter campaigns, landing pages, forms, surveys, and promotional pop-ups. What makes it potentially one of the best email marketing services is how intuitive its powerful features are compared to the competition.",
    "In our MailerLite email marketing review, we test whether it can compete with more established email marketing services.",
    "MailerLite has a free plan for up to 1,000 subscribers with a limit of 12,000 emails per month. However, it lacks several of the features of the paid plan, such as 24/7 live chat support, custom HTML editor, newsletter templates, custom domains, and promotion pop-ups.",
    "The paid plan includes unlimited emails per month and has a price that increases based on your subscriber count. For example, if you have fewer than 1,000 subscribers, it costs $10/month, and at 20,000 subscribers, it costs $100/month. At 50,000 subscribers, you’ll pay $210/month. This is cheaper than Mailchimp’s Standard plan ($299/month for 50,000 subscribers), and MailerLite offers more features.",
    "By paying annually, you can save 30% on plans with fewer than 100,000 subscribers. Priority support costs an additional $100/month, a dedicated IP address is $50/month, and if you want to publish more than one website, there’s a $10/month charge.",
    "You can create email marketing campaigns with MailerLite using a drag-and-drop editor, rich text editor, or custom HTML editor. With a paid plan, you have access to 63 templates. They’re OK designs, but most of MailerLite’s competition offers more variety.",
    "However, MailerLite goes beyond email newsletters with a robust set of tools for creating landing pages, forms, pop-ups, and even entire websites using a drag-and-drop editor. There are also strong campaign reports that can show you how many people have opened your emails based on their location.",
    "You can optimize campaigns with A/B split testing, time zone delivery, personalization, and segmentation. We particularly like how easy it is to tweak and resend a campaign to people who didn’t open the email the first time.",
    "Registering for MailerLite is straightforward. Before you’re able to send emails, you need to complete your profile page and wait for approval. In our testing, this took less than an hour, and you can use all the features of the software in the meantime.",
    "MailerLite has a simpler interface than other email marketing software such as Mailchimp and Infusionsoft. A single top menu is your gateway to campaigns, subscribers, forms, sites, and automation, and though a lot of powerful options are available, the interface never feels overbearing.",
    "We found MailerLite particularly intuitive to use. Its simple interface and well-designed editors meant we spent less time learning the product and more time actually marketing. MailerLite is organized so that features like automation workflows, the landing page editor, and segmentation aren’t a distraction when you don’t need them.",
    "However, in our testing, MailerLite performed rather poorly in deliverability, achieving around 80% deliverability with a 20% chance of being flagged as spam. In comparison, Sendinblue achieved a 95% deliverability rate.",
    "MailerLite is hosted on data storage centers with ISO 27001 and ISO 20000 security certifications, so subscribers’ data should be safe. MailerLite doesn’t sell or share your customer data, but it reserves the right to monitor your content to ensure it complies with the company’s terms of use.",
    "MailerLite has several help articles, tutorial videos, and guides on every aspect of the software. We particularly liked the video tutorials, which are available directly within the software interface. There are over 100 videos, each focusing on a particular MailerLite feature, so if you prefer learning about a product on your own then MailerLite will work for you.",
    "The free plan includes 24/7 email support and upgrading to a paid plan adds 24/7 live chat. For $100 per month you can get personalized, priority support from a dedicated account manager, who can give advice on email marketing strategy and will even build custom email templates and landing pages for you.",
    "Keap is a customer relationship management service that, like MailerLite, has a clean interface and is easy to use. Consider Keap as an alternative to MailerLite if you want to handle more than just email marketing, as Keap also handles appointments, invoicing, and SMS messaging.",
    "If you’re concerned about MailerLite’s unimpressive email delivery stats, we recommend Sendinblue and ActiveCampaign. In our recent tests, these two services performed the best, with less than 10% of sent emails labeled as spam.",
    "The developers of MailerLite have done a marvelous job of streamlining and simplifying marketing processes, making for a highly intuitive product that’s easy to use. Though professional marketers might find the reporting and automation tools lack a few of the more advanced features of tools like Infusionsoft, most small businesses, freelancers, bloggers, and beginners will find MailerLite has more than enough power and versatility for their email marketing campaigns."
  ],
  "headers": {
    "2": "Plans and pricing",
    "5": "Features",
    "8": "Setup",
    "10": "Performance",
    "12": "Security",
    "13": "Support",
    "15": "The competition",
    "17": "Final verdict"
  },
  "links": {
    "email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "HTML": "https://www.techradar.com/best/html-online-courses",
    "landing pages": "https://www.techradar.com/best/landing-page-creator",
    "Mailchimp": "https://www.techradar.com/reviews/mailchimp",
    "marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "workflows": "https://www.techradar.com/best/best-flowchart-software",
    "Keap": "https://www.techradar.com/reviews/keap",
    "Sendinblue": "https://www.techradar.com/reviews/sendinblue",
    "ActiveCampaign": "https://www.techradar.com/reviews/activecampaign"
  }
}