{
  "source": "https://www.techradar.com/reviews/fujifilm-x-t4",
  "title": "Fujifilm X-T4 review",
  "category": "cameras",
  "updated": "2020-05-17T23:02:48Z",
  "author": "tim-coleman",
  "summary": "Fujifilm's retro flagship evolves into a truly modern hybrid",
  "verdict": "The Fujifilm X-T4 is the best APS-C mirrorless camera you can buy right now. There’s enough here to persuade both photographers and filmmakers over the X-T3, including the significantly improved battery life, in-body image stabilization, quieter shutter, and design tweaks that make a big difference to the handling. The X-T4's design is both charming and intuitive, while its class-leading photo and video specs are backed up by powerful performance. This is truly two cameras in one, and very fine hybrid all-rounder.",
  "pros": [
    "Solid as a rock",
    "Class-leading APS-C sensor",
    "IBIS is a big bonus for video and stills",
    "Good battery life",
    "Sensible menu system"
  ],
  "cons": [
    "AF performance potential limited by choice of lens",
    "EVF behavior in low contrast light",
    "No headphone jack"
  ],
  "article": [
    "The Fujifilm X-T4 is a mirrorless camera with a split personality – on the outside it's all retro dials and analogue chic, but inside it's packed with more advanced features than we've seen from any Fujifilm X-T camera so far.",
    "It's a compelling combination. Like the Fujifilm X-T3 (which remains on sale), the X-T4 is for keen amateur photographers and pros who want the latest mirrorless power in a fun, desirable package. The difference this time is that the X-T4 has cranked its 'all-rounder' dial up to 11.",
    "The headline news is the inclusion of in-body image stabilization (IBIS), making this only the second Fujifilm camera to have this feature, the other being the Fujifilm X-H1. Both video and stills shooters can benefit from IBIS, and its inclusion here brings the X-T4 up to speed with rivals like the Sony A6600.",
    "The rest of the X-T4's new features read like a checklist of responses to requests from Fujifilm shutterbugs: a bigger battery (check), improved autofocus (check) and, naturally, a new Film Simulation effect (called Bleach Bypass).",
    "However, these exciting additions are teamed with the same sensor and processor combo as its predecessor. Which leaves us asking, could you just stick with the Fujifilm X-T3? And what of the video-centric X-H1?",
    "To help clarify that, our review focuses a little more on the X-T4's changes and the impact of those additions. For most other matters, our Fujifilm X-T3 review still applies.",
    "What we will say now is that the Fujifilm X-T4 is one heck of a camera that possesses wonderful charm and immense power under the hood. Now, more than ever, we have a true photography-video hybrid from Fujifilm.",
    "The Fujifilm X-T4 is available to buy right now in various bundles. If you just want a body-only X-T4, it costs $1,699 / £1,549 / AU$2,999 in either black or silver.",
    "A bundle with the excellent XF18-55mm f/2.8-4 R LM OIS kit lens costs $2,099 / £1,899 / AU$3,298. Or, if you'd rather get the X-T4 with the new XF16-80mm f/4 R OIS WR lens, that will set you back $2,199 / £1,949 / AU$4,099.",
    "If these prices are a bit too steep for you then it's worth noting that the Fujifilm X-T3 will remain on sale for some time yet. That camera now costs $1,299 / £1,199 / AU$1,823, making it a more affordable alternative if you don't need IBIS or any of the X-T4's other new features.",
    "Of course, the Fujifilm X-T4's price means it's now also up at the level of many full-frame cameras, including the Nikon Z6 and Sony A7 III; but while it has a smaller sensor than those cameras, it does also have some superior features, as we'll discover.",
    "Fujifilm doesn't often make dramatic departures from its retro blueprint, and the X-T4 is no different. Let's just say that if you've picked up an X-T series camera before, you'll feel right at home here.",
    "We are fans of the premium Fujifilm X-T ethos. It centers around those bold analogue-style dials on the top plate. The dedicated dials are for ISO, shutter speed and exposure compensation.",
    "Paired with an aperture ring found in many of Fujfilm's lenses, this provides you with all the key exposure controls at your fingertips. Not only are these dials no slower than using the modern generic control dials, they are arguably more methodical and hands-down more charming.",
    "If the design of a camera entices you to use it more, then the X-T4 could well be your constant companion. There is definitely an emotional connection for camera fans.",
    "Build quality is second-to-none. The X-T4’s full-metal body is weather-sealed and solid as a rock. With its new IBIS unit, the X-T4 is a fraction larger and heavier than the X-T3, but at 603g it’s still much lighter compared to an enthusiast-level DSLR.",
    "A slightly bigger handgrip houses a larger battery unit that boasts almost double the shot life of its predecessor, up to 600-shots in economy mode. It’s a significant step up, plus you have the option of on-the-go charging via the USB-C port.",
    "A change in size also means a new optional vertical grip. This holds up to three of those new batteries and features a dedicated headphone jack, which is missing on the X-T4 body. A USB-C-to-3.5mm dongle comes in the box to attach headphones, but you won’t therefore be able to charge the camera at the same time.",
    "For us, the larger handgrip is still simply not big enough. The X-T4 is already a DSLR-style camera, so why not offer an even deeper grip that is more comfortable to hold? That said, it does depend a little on what your favorite lenses are.",
    "The switch under the shutter speed dial no longer controls metering, but moves between Still or Movie shooting. Removing the metering switch will irritate some dedicated photographers, but the change makes complete sense whether you are using the camera for photos or for video.",
    "Because of this change, new dedicated menu systems are opened up for both Still and Movie shooting. For example, in Still mode the Q menu (or 'quick' menu) and the in-camera menu system only contains photography options. Flick to video and the menus change to video options, plus the analogue dials become inactive.",
    "To make exposure changes when shooting video, you use the front and rear clicked control dials. These changes can be made during capture and in conjunction with the touchscreen.",
    "We love the logical separation between the two disciplines and the easy-to-navigate menus. What appears as a minor tweak to the design is indeed a bold move that emphasizes the X-T4's status as a true hybrid camera.",
    "Now we come to the LCD touchscreen. The resolution of the 3-inch display is upped to 1.62-million-dots, and now the unit is fully articulated rather than a tilt type.",
    "With the LCD screen flipped out to the side, it can be rotated and viewed in ’selfie’ mode. A front-facing screen is particularly useful for filmmakers that work alone. The screen can also be safely folded away to reveal a lovely faux-leather finish. We have particularly enjoyed a screen-less experience and focusing on the EVF instead.",
    "Some say an articulated screen design is more fragile than the tilt-type when flipped out. It can get in the way of the ports on the side of the camera (Fujifilm has redesigned the port covering in the X-T4 as two pull-out rubber doors), plus you are viewing it off-centre and it may not be compatible with an L-Bracket support.",
    "In the context of the flagship X-T series, we’re on the fence with which screen design we prefer, but it’s no deal-breaker either way. The X-T4 screen slightly favors video, because it's a little trickier than a flip screen when shooting from the hip.",
    "As before, the X-T4 records onto an SD card and both slots are compatible with the ultra-fast UHS-II type that is needed for high-speed continuous shooting and high-resolution videos.",
    "It might look remarkably similar to its X-T predecessors, but the Fujifilm X-T4 is the biggest leap forward for the series yet, thanks to three main new features: IBIS, a new battery, and a new shutter mechanism.",
    "Otherwise, the X-T4's headline features are virtually identical to the X-T3, a camera that is 18 months older. You get the same 26.1MP back illuminated APS-C sensor, which is class-leading in terms of detail and low light performance. If it ain’t broke, don’t fix it.",
    "Then there is a movie shooting spec that stands firm today too; Cinema 4K movies up to 60fps, 10-bit internal recording plus HDMI out, up to 400Mbps bit-rate and with F-Log and HLG profiles included as standard. Slow motion Full HD movies are possible up to 240fps, too. If you want great looking videos, the X-T4 will achieve that.",
    "The really big news, though, is that in-body image stabilization (IBIS). On paper, the sensor shift unit beats the one in the Fujifilm X-H1 by one stop, providing up to 6.5EV (or exposure value) of stabilization when used with one of Fujifilm’s stabilized lenses. This includes 18 out of Fujifilm's total of 29 lenses and is particularly exciting if you own classic prime lenses like the XF35mm f/1.4 or XF56mm f/1.2.",
    "Image stabilization is of particular interest to run-and-gun filmmakers who want steady handheld shots without relying on a gimbal. We’ll share our experience of it further down in the 'Performance' section.",
    "The shutter has benefitted from a few improvements – it’s more robust with a 300,000-shot life, it’s quieter than the one in the X-T3 by about 30%, and it’s faster with a new 15fps top speed.",
    "Of course, this speed isn't particularly helpful if the autofocus can't keep up with the action, and luckily Fujifilm has fine-tuned its AF system for the X-T4 too. Fuji claims that the X-T4's tracking success rate is twice as good as the X-T3, which wasn't exactly a slouch in this department, and the Face / Eye AF has also been improved. You can find our thoughts on this in the 'Performance' section below.",
    "As before, the camera maxes out at 30fps when using the electronic shutter. You get a PreShot mode, interval timer, panorama, HDR, bracketing and a range of advanced filters. Again, Raw images can be edited in-camera and uploaded wirelessly using Fujifilm’s app with Bluetooth, Wi-Fi and NFC connectivity.",
    "In short, the X-T4 is the most capable hybrid APS-C camera around, bar none.",
    "So what is the Fujifilm X-T4's image stabilization actually like? We had the 16-80mm f/4 WR lens for our test, which is listed as obtaining up to 6EV (or stops) of stabilization when both optical stabilization (OIS) and sensor shift stabilization (IBIS) are active.",
    "After multiple efforts with a steady hand, we experienced effective stabilization more like 4EV (or four stops). The same can be said of the 35mm f/1.4 lens. We’d be interested to try more lenses, but for photography, those 6.5EV claims might be a little generous. The Olympus OM-D E-M1 Mark III stabilization is much better.",
    "Still, the stabilization for photos is a minor improvement over the X-T3. And it is a game-changer for those using an X-T camera without an optically stabilized lens.",
    "As for video, the sensor shift stabilization is an improvement on no stabilization at all, obviously. Shake caused by vibrations from walking are reduced, but still evident. This is certainly not the best IBIS we have seen, but it is certainly a bonus over the X-T3.",
    "Activate the digital stabilization in addition to OIS and IBIS and things improve a lot. Shake is almost virtually gone. The trade-off with digital stabilization is that a 1.1x crop factor is applied and somehow the feel of the footage isn’t quite the same.",
    "In short, the X-T4 IBIS does not completely replace the need for a gimbal, but it is very welcome and the performance is especially good when digital stabilization is added.",
    "Autofocus is still the 425-point hybrid system that is quick and reliable across a variety of scenarios. However, the autofocus experience does vary depending on the lens in use. For example, we had the older 35mm f/1.4 lens which does not perform to the same standard as the 16-80mm f/4 lens.",
    "There was a time that AF performance was a weakness of the Fujifilm system. That’s certainly not the case with the X-T4, though you will need a more recent lens to make the most of its powers.",
    "Fujifilm claims that Face and Eye detection AF is improved. Certainly, we were very impressed with the reliability – in our portrait pictures the eyes are virtually always pin sharp, even in low contrast light and with subjects turning their face in and out of view.",
    "Tracking AF is linked to the wide AF area only. We actually found the Zone AF mode without tracking gave a higher hit ratio of sharp shots in action sequences.",
    "The X-T4 also offers an improved 15fps 'continuous high' mode when using the mechanical shutter. Recording at this speed onto a UHS-II card, we have been able to capture 37 Raw images in a burst, or 65 images in JPEG only.",
    "If you shoot JPEG only in 8fps 'continuous low' mode, the camera will keep shooting sequences well into the hundreds – there’s no real limit.",
    "In general, the buffer processes those 'continuous high' Raw files in around 20-25 seconds before the camera returns to full performance again, whereas for JPEG-only it’s more like five seconds.",
    "For action sequences, the X-T4 is truly a very capable performer, but it may not meet the demands of pro action photographers. You will probably want to shoot in 8fps JPEG-only for an uncompromised performance.",
    "Our Fujifilm X-T3 review covers a lot of our thoughts on the X-T4's image quality, but it's worth doing a recap and also noting the positive impact of image stabilization and this camera's enhanced shooting performance.",
    "The X-T4 uses the same 26.1MP APS-C sensor as the X-T3, with the same native ISO 160 to ISO 12,800 range, video resolution and frame-rates.",
    "We would have no hesitation in using any sensitivity setting up to ISO 6400 because there is no visible sign of luminance noise in well-exposed images. Even the extended ISO 80 to ISO 51,200 range is usable – it’s not just there for the numbers.",
    "The bottom line is that no other camera in this class matches the X-T4 (and X-T3’s) low light performance or resolved detail (depending which lens you use). If you want excellent quality photos, the X-T4 will not disappoint.",
    "We’re big fans of the 'color science’ behind Fujifilm’s unique sensor design. Each color profile (or ‘film simulation’) references Fujifilm's film stock. The standard ‘Provia' profile has a lovely natural look to it, while Eterna is a staff favorite too.",
    "Monochrome shooters are well catered for, too. Acros with Red filter makes the skies pop in landscapes decorated with blue skies and intermittent cloud.",
    "A new color profile called Eterna Bleach Bypass has been added, offering a high-contrast, desaturated look. It’s not our favorite, but we’ll leave it up to you what you think of the new profile. There are 12 color profiles in all now and these can be applied in-camera to Raw files.",
    "In video mode, you get Cinema 4K videos up to 60fps and up to 400Mpbs, depending on the frame-rate. There are F-Log and HLG color profiles included at any of those settings. We’ve shot some lovely looking video clips in the F-Log profile that only really needed a contrast and vibrancy tweak for a great looking grade.",
    "It’s worth knowing that ISO 640 is the lowest sensitivity setting available in F-Log profile, making an ND filter a mandatory extra if you want to shoot with the log profile.",
    "Overall, it's fair to say that outright image quality is definitely a strength of the X-T4.",
    "The Fujifilm X-T4 is now the best APS-C camera you can buy.",
    "It's an attractive, robust camera with analogue dials that both stand out from the crowd and work incredibly efficiently. This means it particularly appeals to those who love camera gear as much as taking pictures.",
    "Not that it isn't also great at doing the latter. Beyond its aesthetics, the X-T4 boasts unparalleled photo and video performance (at least among APS-C cameras), ticking all of the boxes that matter the most.",
    "The X-T4 is also more than a X-T3 with IBIS. You get a much higher capacity battery, more robust shutter and some design changes that make complete sense for a hybrid camera.",
    "Yes, almost all of the changes improve video capacity. But photographers are not left behind, benefitting from that better battery life, improved stabilization for non-stabilized lenses, plus a menu system and controls that are clearly distinguished for photo or video use.",
    "We feel that there is enough in the X-T4 to merit the extra cost over the X-T3. Though it is still worth considering the latter and watching its price – if IBIS is the main feature you're after, you could use the savings to buy an X-T3 with a gimbal. There are also no image quality improvements aside from the impact of the X-T4's enhanced power.",
    "In its own right, the X-T4 claims the crown of the best APS-C mirrorless camera you can buy. It’s two powerful cameras in one, both of which you'll have great fun using for many years to come."
  ],
  "headers": {
    "7": "Fujifilm X-T4 release date and price",
    "11": "Build and handling",
    "28": "Features and autofocus",
    "37": "Performance",
    "51": "Image quality",
    "61": "Verdict",
    "68": "The competition"
  },
  "links": {
    "Fujifilm X-H1": "https://www.techradar.com/reviews/fujifilm-x-h1",
    "Sony A6600": "https://www.techradar.com/reviews/sony-a6600",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Fujifilm X-T3 review": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Nikon Z6": "https://www.techradar.com/reviews/nikon-z6-review",
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Olympus OM-D E-M1 Mark III": "https://www.techradar.com/reviews/olympus-e-m1-mark-iii"
  }
}