{
  "source": "https://www.techradar.com/reviews/surepayroll",
  "title": "SurePayroll review",
  "category": "computing",
  "updated": "2021-07-05T14:23:02Z",
  "author": "rob-clymo",
  "summary": "Use SurePayroll to make light of your business tasks including paying staff and contractors",
  "verdict": "SurePayroll has been nicely honed over time and makes a complex business task like running payroll seem much less stressful and all for a decent price too.",
  "pros": [
    "Versatile feature set",
    "Affordable pricing",
    "Great user experience"
  ],
  "cons": [
    "Additional costs for extra features"
  ],
  "article": [
    "SurePayroll has been around in one form or another for the last couple of decades. It’s a cloud-based software package that can be used primarily to tackle payroll for small business needs. However, SurePayroll is now under the ownership of Paychex and, following its acquisition a few years ago has gone from strength to strength.",
    "As a result the software has been gradually evolving and now lets business owners tackles numerous finance-related tasks. Alongside payroll processing SurePayroll offers related tax issues while an even more recent update has added in other new features, including tools for handling coronavirus paperwork issues. With a less expensive edition now available too SurePayroll will have plenty of appeal for the small business community, backed up by the might of the Paychex organization.",
    "The pricing for SurePayroll has been given a dusting down and there are now a couple of key options for businesses to choose from, with no set up fees to worry about either. For the self-service package, which lets you process unlimited payroll runs and process your own tax filing the current cost is down from $29.99 to $19.99 a month, plus $4 per employee.",
    "Core features packed inside this one include the ability to pay employees with unlimited payroll runs and the capacity to e-file taxes yourself. Employee paychecks are also calculated and this comes with a Tax Calculation Guarantee from SurePayroll. There’s also state-required new hire reporting, which is carried out for you plus a 4-day payroll processing period.",
    "The other package option is a full service one, which is currently down from $39.99 to $29.99 a month plus $5 per employee. This edition offers a full service payroll that benefits from unlimited runs. Payroll taxes are done for you and also feature a No Penalty Tax Guarantee. There’s the additional benefit of 2-day payroll processing, which adds a $7.99 per month value. One other core feature is access to up-to-date HR resources, which adds another $9.99 per month in value.",
    "Having been offering payroll services for a couple of decades means that SurePayroll has its feature set nicely honed. Each plan comes with a similar set of features and functions, which include the likes of deductions for social security, medicare, unemployment and other key areas that need covering. It’s also possible to handle multiple pay rates plus bonuses too. Businesses get the benefit of being able to carry out unlimited payroll runs, without incurring any additional fees.",
    "We like the way that SurePayroll has made sure its wizard system has been designed to help ensure navigating the configuration process is that little bit easier. Combining that with the cloud-based back-end system means SurePayroll performance is by and large perfectly fine.",
    "Considering just how much data and processing is involved with running payroll then the fast and efficient manner that keeps SurePayroll going is testimony to just how much the company has fine-tuned its packages over the last couple of decades.",
    "The designers working on SurePayroll have done a fine job at evolving its user interface over time. Right now, the features and functions fall easily to hand, with a slick and stylish experience on hand whichever menu route you head down. Considering just how much of a minefield handling payroll can be the SurePayroll experience is a relatively stress-free one.",
    "The good news is that there’s plenty of hand holding during the initial setup procedures, including a wizard-style offering that lets you ensure that everything is put into the right place. Getting all of your employee and their payroll details correct early on is vital and full marks should go to SurePayroll on this point as this is an area it’s become particularly adept at.",
    "Of course, logging in and getting set up involves time and effort, but once you’ve got SurePayroll configured it rewards you by shaving plenty of time off ongoing payroll duties.",
    "Doubtless you’ll be looking for some assistance during the initial setup phase of using SurePayroll and that’s where this software really comes into its own. Support staff members are available to help you pick your way through the initial stages of setting up SurePayroll. Even with the help of the wizard system the step-by-step configuration process can be arduous.",
    "Granted, there’s quite a lot of legwork involved, but with guidance from SurePayroll staff you should be able to navigate your way successfully through all of the twists and turns of the setup process. In terms of day-to-day help moving forwards then it’s possible to get hold of customer support from Monday to Friday between 7am and 8pm, along with Saturdays 9am to 1pm Central time. SurePayroll also has a chat option on its website.",
    "SurePayroll might not offer an exhaustive list of features and functions that make it an outright winner in the payroll software stakes, but it’s an attractive package. With clear and affordable pricing options the features come thick and fast, with options to either take control of everything yourself or get help from people who really know how the software ticks.",
    "There have been practical changes implemented to help employers combat the fallout from COVID-19, although some other features incur additional charges. This might be offputting to some businesses looking to save rather than spend more money in the current climate.",
    "Nevertheless, if you’re looking to take the easy route towards payroll efficiency then SurePayroll’s Full Service continues to be a great option. However, if you’re happy to do more legwork yourself then its neat Self Service edition is a very worthwhile, not to mention cost-effective option to consider."
  ],
  "headers": {
    "2": "Pricing",
    "5": "Features",
    "6": "Performance",
    "8": "Ease of use",
    "11": "Support",
    "13": "Final verdict"
  },
  "links": {
    "SurePayroll": "https://www.surepayroll.com",
    "payroll": "https://www.techradar.com/best/best-payroll-software",
    "tax issues": "https://www.techradar.com/best/best-tax-software",
    "self-service package": "https://www.surepayroll.com/thankyou",
    "full service one": "https://www.surepayroll.com/thankyou"
  }
}