{
  "source": "https://www.techradar.com/reviews/dji-mavic-2-zoom",
  "title": "DJI Mavic 2 Zoom review",
  "category": "cameras",
  "updated": "2020-08-20T12:03:00Z",
  "author": "james-abbott",
  "summary": "The best drone for those who need to get closer to the action",
  "verdict": "Filming groups of people with drones can be tricky due to the minimum flying distances required by law, but the Mavic 2 Zoom solves this thanks to its optical zoom lens. Its smaller 12MP 1/2.3-inch CMOS sensor means its overall image quality isn't quite up to the level of the Mavic 2 Pro, but it isn't far off and can shoot both Raw stills and video. Throw in DJI's sophisticated flight modes and the Mavic 2 Zoom's lightweight, foldable design and you have a drone that remains one of the best and most versatile out there.",
  "pros": [
    "Easy to fly",
    "Intuitive app for camera control",
    "Impressive image quality",
    "24-48mm optical zoom lens",
    "Foldable design"
  ],
  "cons": [
    "Comparatively small 12MP sensor",
    "Fixed f/2.8 aperture",
    "Noise is problematic above ISO 100"
  ],
  "article": [
    "The DJI Mavic 2 Zoom is a slightly different take on the high-end consumer drone – rather than the large, one-inch sensor seen on its Mavic 2 Pro sibling, it packs a 2x optical zoom lens.",
    "This was a pretty novel approach when both drones launched in August 2018 – we're used to seeing camera manufacturers introduce slightly different variants on the same body design, but this was a new strategy for drones and reflected their growing status as serious photographic tools, rather than just sky-based playthings.",
    "Both the Mavic 2 Zoom and Mavic 2 Pro remain senior figures in DJI's consumer drone lineup, so what's the case for buying this optical zoom variant? As its name suggests, this drone features an optical zoom lens with a smaller sensor than the Mavic 2 Pro, but it's particularly handy for aerial photographers who need to get closer to their subjects than current drone laws allow.",
    "It's not simply about getting closer either – a zoom lens brings with it creative opportunities that simply aren't possible with a prime lens.",
    "Apart from their cameras, the two Mavic 2 Zoom and Mavic 2 Pro are identical and offer a range of improvements over their predecessor, the Mavic Pro. The question is, should you go for the 20MP one-inch sensor model or the one with a 12MP sensor and optical zoom lens? Let's find out.",
    "The Mavic 2 Zoom offers the same foldable design as the Mavic 2 Pro, which means the drone can be easily folded down to almost half of its flying size for transportation.",
    "Add the fact that it weighs only 905g and it quickly becomes clear how portable this drone actually is. Of course, you can by even smaller drones with the same 1/2.3-inch sensor, but they don’t offer an optical zoom lens and being smaller means they won’t be as stable in the air as the Zoom when there’s even a small amount of wind.",
    "The Mavic 2 Zoom's body is compact and rectangular – its front arms rotate outwards, while the rear arms twist up and into position. It's well worth using the bundled gimbal guard when you're carrying the drone in between shoots, because it can be a little vulnerable when left unprotected.",
    "That said, when you turn on the drone you need to remember to remove the gimbal guard, because the drone calibrates the gimbal as soon as it’s turned on. To turn on the Zoom you just press and hold the button on the top of the battery.",
    "The Mavic 2 Zoom has the same controller as its Mavic 2 Pro sibling. This has room for smartphones of all sizes (up to a max length of 160mm, or max thickness of 8.5mm), which slots into the folding arms and plugs into the controller via the provided data cables. With the DJI Go 4 app installed on your phone, this will allow you to access drone settings, take control of the camera and see the camera view.",
    "You can control the drone in flight by using the two joysticks – anyone who has used a radio-controlled car in the past will feel relatively at home here. Naturally, the moves you'll be pulling off will differ from an RC car, though, so it's worth familiarizing yourself with them before your first flight.",
    "As well as the joysticks, there are a number of direct access controls that can be used to control the gimbal, camera zoom and exposure. Most camera controls are accessed via the DJI Go 4 app, though, which is an incredibly well laid out and intuitive bit of software. Anyone who is familiar with even a compact camera will feel comfortable here as the camera controls are similar to those of a premium compact. In total, there are 11 direct access controls that can be configured to your liking.",
    "Flying the Mavic 2 Zoom is identical to the Mavic 2 Pro, and incredibly easy thanks to the onboard tech employed by DJI.",
    "GPS allows you to see the drone’s position on a map within the app, as well as holding it in position when hovering in the air. In 'Atti Mode', drones will hold their altitude but can be blown out of position by the wind, so GPS mode is incredibly useful.",
    "Another handy safety feature is collision avoidance, which uses omnidirectional obstacle sensing to help you to avoid crashing. But like any safety feature, it's not foolproof and you can’t solely rely on it to keep you and our drone safe from harm.",
    "Collision avoidance will in many (but not all) cases, make the controller produce visual and audio warnings to alert you to potential danger, while the drone will brake to avoid a collision when you get too close to an object. According to the specs, the Mavic 2 Zoom can fly for up to 31 minutes, which is more realistically 20-25 minutes, with a maximum speed up 45mph / 72kph, so losing control or crashing isn't something to be taken lightly.",
    "One feature that does help in this respect is the controller's default setting to return the drone home when its battery drops to 25% capacity. This can be changed, but it’s best to keep it at a minimum of 15% and above to avoid the drone automatically landing in an undefined area due to a low battery. When the battery gets to the lowest point possible the drone will land wherever it is and this is far from ideal.",
    "The three main manual flying modes can be accessed from within the DJI Go 4 app or using a switch on the side of the controller. Tripod Mode (T) slows the drone and makes it less responsive to allow for smoother video. Positioning Mode (P) is the standard flight mode and provides a medium level of control, while Sports Mode (S) makes the Mavic most responsive and allows it to fly at its fastest speed.",
    "For manual flying, these modes cover all bases, but if you’re looking for some assistance, there are also a number of automated flight modes that are designed to make shooting specific types of stills and video as easy as possible. All of these can be achieved manually, and the results are often better when achieved this way, but to get you started 'intelligent flight modes' take control of a number of filming and flying maneuvers for you.",
    "Intelligent flight modes for video include Hyperlapse, Quickshot, Active Track, Point of Interest, Waypoints, TapFly and Cinematic Mode. Stills shooting modes are more about in-camera shooting modes than intelligent flight modes, with the exception of Pano which does take care of flying for you. These include Single Shot, Burst Mode, HDR, AEB, HyperLight (night mode), Interval and Pano, which offers a number of different panoramic shooting options including one that’s exclusive to the Mavic 2 Zoom – Super Res.",
    "Super Res mode takes nine shots which are stitched together as a high-resolution 48MP JPEG. If you’d like to be able to do this with Raw files, you have to set the camera to save the original pano images in Raw, and then process the Raw files manually in Lightroom, for instance, before merging the images together in Photoshop.",
    "It’s a shame that the Mavic 2 can’t produce stitched Raw files in-camera, but at least there’s a way around it if you want and need more control. One thing to consider is that scenes with moving elements may not merge together well regardless of whether you use the in-camera JPEG or blend Raw files manually.",
    "Image and video quality is impressive considering the size of the sensor, but it’s overall not quite on par with the DJI Mavic 2 Pro or a standard stills camera.",
    "The 12MP 1/2.3-inch CMOS sensor is similar to what you'd get in a smartphone, but image quality is generally superior thanks to the lens used by the Mavic 2 Zoom, which provides a full-frame equivalent focal range of 24-48mm. This is incredibly useful for getting closer to people when photographing or filming them, and this alone could be a deciding factor for many people who are in the market for a drone.",
    "The zoom quality is good and shows minimal distortion in the images that measure roughly 13x10in/34x25cm. As a result of the small camera, sensor and lens, the Mavic 2 Zoom provides a fixed aperture of f/2.8, which provides a large enough depth-of-field for landscape shots.",
    "For videographers, this does mean any exposure changes while flying will require the changing of ND filters to maintain the desired shutter speed. But this is, of course, balanced against the ability to zoom into subjects, maintain a safe working distance from the subject, and to perform special camera movements such as dolly zoom (see below).",
    "Just like the Mavic 2 Pro, which houses a larger one-inch sensor, the Mavic 2 Zoom exhibits noise at even ISO 100, although this is easily dealt with in Raw processing software for stills and isn’t really a problem for video.",
    "This does, however, mean that the drone doesn’t perform well above ISO 100 compared to the Pro, which isn’t great itself above this setting. But with the fixed f/2.8 aperture, maximum amounts of light are always reaching the sensor, so even in lowish light, reasonable shutter speeds can be achieved.",
    "Before we tested it next to the Mavic 2 Pro, we'd assumed that the Zoom's image quality would be very limited in comparison to its sibling, but this really wasn't the case. Of course, the Mavic 2 Pro is noticeably better and print sizes much larger, but the Zoom isn’t as far behind as you might expect and can produce impressive stills and video. The main differences between the two simply come down to sensor size, resolution and the conundrum of aperture control (on the Mavic 2 Pro) versus a zoom lens here.",
    "Video can be shot in the video equivalent of JPEG, using picture profiles to set color styles, if you simply want to be able to download your footage from the memory card without the need for color grading. But if you’re planning to incorporate footage into a professional workflow, you can also shoot in D-Cinelike, which is a Raw video format allowing for color grading and easier color matching to footage shot in this or another Raw video format.",
    "In terms of video formats, video can be shot in 4K at up to 30p (including both 24p or 25p options), 2.7K at up to 60p, and Full HD at a maximum of 120p. Video can be captured in MP4 or MOV (MPEG-4 AVC/H.264, HEVC/H.265) formats, so it's identical to the Mavic 2 Pro in this area, although it uses D-Cinelike rather than D-Log M, and lacks 10-bit HDR.",
    "Like its sibling, the Mavic 2 Zoom remains the best consumer drone for anyone who needs pro-level footage from a travel-friendly form factor. Deciding between this and the Mavic 2 Pro depends on the kind of subjects you're likely to shoot.",
    "If you don't mind having a fixed 24mm focal length – and this wide-angle field of view does well for most aerial photography – then your might prefer the Mavic 2 Pro's slightly superior image quality.",
    "But for situations where you need a tighter shot of a subject, whether that's a person or an inanimate object, the Zoom lets you shoot some great stills or video while staying within the law's minimum distances for people and buildings. If most of your drone shooting is likely to involve crowds, whether that's at weddings or sporting events, then the Zoom is likely the best choice for you.",
    "The Mavic 2 Zoom is easy to fly thanks to its onboard tech, and the intelligent flight modes make certain video effects possible at the touch of a button. Image quality, for both stills and video, is also good enough for professional use despite the small sensor, but the real jewel in the Mavic 2 Zoom's crown is that optical zoom lens. In this sense, it remains pretty unique in the field of folding, consumer drones."
  ],
  "headers": {
    "5": "Design and controller",
    "12": "Features and flight",
    "22": "Video and photo quality",
    "31": "Verdict"
  },
  "links": {
    "Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "drone laws": "https://www.techradar.com/news/uk-drone-laws-where-can-and-cant-you-fly-your-drone",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro"
  }
}