{
  "source": "https://www.techradar.com/reviews/lenovo-yoga-9i-review",
  "title": "Lenovo Yoga 9i review",
  "category": "computing",
  "updated": "2021-09-14T11:15:17Z",
  "author": "john-loeffler",
  "summary": "A powerful, stylish 2-in-1 that can go the distance",
  "verdict": "A surprisingly powerful laptop, the 11th-generation, Intel Evo-certified Lenovo Yoga 9i is plenty capable of handling just about anything you can throw at it and has a phenomenal battery life to keep you going long after it's competitors throw in the towel.",
  "pros": [
    "Phenomenal performance",
    "Outstanding battery life",
    "Garaged stylus",
    "Great sound"
  ],
  "cons": [
    "Expensive",
    "16:9 screen ratio"
  ],
  "article": [
    "The Lenovo Yoga 9i comes in strong at the tail end of 2020 as one of the best laptops of the year, giving us an early look at what Intel Evo is capable of while keeping things stylish and functional. Though it's a bit on the pricey side – especially with higher-end specs – it's hard to argue that the extra expense is pretty justified given the price.",
    "It's hard to argue with the design of the Yoga 9i, which is definitely one of the most stylish laptops we've seen this year, battling it out with the Dell XPS 13 (2020) and Dell XPS 13 2-in-1 (2020) on the design front.",
    "On performance, the Yoga 9i's 11th-generation i7 outperforms just about everything else from this year, falling just short of the XPS 13 (2020) with 11th-generation Intel Evo on CPU performance, but beating it in terms of its graphics performance.",
    "We didn't get to test the Dell XPS 13 2-in-1 with an 11th-gen Intel chip with Iris Xe graphics this year, so we can't say specifically how well the Yoga 9i stacks up against it's rival 2-in-1 in a fair fight, but this much we can say: the Yoga 9i is unquestionably in the title fight for 2-in-1 of the year.",
    "Battery life is absolutely astounding, beating out the Apple MacBook Air (M1) by nearly four hours (lasting just over 15 hours total in our movie test), so this is a pretty impressive given that we typically consider 10 hours to be a reasonable battery life for an ultra-thin 2-in-1 laptop.",
    "Throw in a garaged, rechargeable stylus and you have one of the best, most functional 2-in-1 laptops you can buy right now.",
    "It isn't without its faults, obviously. Its 16:9 screen ratio makes note taking and annotating somewhat more awkward than you'd find on a 3:2 ratio 2-in-1 like the Acer Spin 5 or the 16:10 ratio on the XPS 13 2-in-1.",
    "It's also an expensive 2-in-1, starting at $1,299 (£1,199, about AU$1,820), so it starts off well into the mid-range for a 2-in-1 and it only gets more expensive as you upgrade the specs.",
    "Still, given it's performance, design, and stellar battery life, the expense is definitely justified given that less powerful and less efficient laptops can cost you just as much, if not more. Plainly put, if it's in you budget, the Lenovo Yoga 9i is going to match or beat any other 2-in-1 laptop on the market right now, hands down.",
    "The Lenovo Yoga 9i is available now in the US and UK, with an Australian release coming soon but no specific date is set at this time. The base model of the Yoga 9i comes with an 11th-generation Intel i5-1135G7 CPU with Iris Xe graphics, 8GB RAM, 256GB PCIe SSD, and a 14-inch full HD touchscreen for $1,299/£1,199, and likely around AU$1,800 when it releases in Australia.",
    "Upgrade the specs and the price understandably climbs, but not out of line with expectations. For example, the highest-spec configuration available right now in the US will get you an 11th-generation Intel i7-1185G7 with Iris Xe, 16GB RAM, 1TB PCIe SSD, and a 14-inch 4K, HDR 400 display for $1,849.",
    "In the UK, you can get all the above with a full HD screen for £1,649 and we don't know yet what configurations are going to be available in Australia, but if they're in line with the above, it'll probably be around AU$2,750 on the high end, give or take AU$250.",
    "We've reached out to Lenovo for details on an Australia release date and pricing, so we'll be sure to update this review once we hear back from the company.",
    "The Lenovo Yoga 9i is absolutely one of most well-designed 2-in-1 laptops we've seen this year – losing out only to the Dell XPS 13, in our opinion – and even then it's a close call.",
    "The chassis of the laptop is a machined-aluminum alloy, which is pretty standard for ultra-thins nowadays, but the palm rest, edge to edge, is actually made from tempered-glass which helps keep it feeling cool even under strain.",
    "The keys on the keyboard are well-spaced and responsive, as is the trackpad. While neither are exceptional, as far as laptop keyboards and trackpads go, they definitely feel more comfortable and functional than others we've experienced – especially those on cheaper laptops.",
    "The lid opens and rotates with ease, pivoting around the laptop's sound bar, which keeps the speakers free from obstruction and firing outward whether you're using it like a laptop or a tablet. As sworn enemies of the downward firing speaker, we definitely appreciated this design choice and the sound quality is some of the best we've heard on a laptop thanks to Dolby Atmos technology.",
    "Heat is managed pretty well on the Yoga 9i, with venting at the sides and behind the keyboard to help bleed off the hot air from its two internal fans and heat pipe. The fans mean that it doesn't run completely silent, but even under strain, it's not particularly loud.",
    "The webcam isn't all that great (it's only 720p) but the bezels around it are fairly slim, save for the noticeably thick bottom bezel. The XPS 13 2-in-1, however, has much slimmer bezels all around which helps it pact in a 16:10 FHD+ display, so Lenovo could have done better here.",
    "There are only three ports and a 3.5mm headphone/microphone combo jack, but fortunately two of those ports are USB Type-Cs with Thunderbolt 4 support which also features charging.",
    "The other USB Type-A port is also appreciated since we aren't out of the USB Type-A thumb drive era just yet. There's no HDMI output, so you'll have to rely on one of the Thunderbolt ports to output to an external display but it does feature DisplayPort 1.4 support.",
    "Finally, there's the garaged Lenovo Active Pen on the back that charges in the dock, getting 40 minutes of use off 15 minutes of charge. This is far shorter than the Acer Spin 5's charging dock can do – which gets 90 minutes of use out of a 15-second charge in the dock. Still, it's also far and above what a lot of other 2-in-1 pens offer.",
    "The Active Pen itself feels pretty delicate compared to other styluses out there, so it's definitely something you'll want to keep docked while not in use. It does offer 4096 levels of pressure sensing, so it's capable of more fine graphic art work than other styluses might be capable of and it is comfortable enough to use for note-taking and annotations.",
    "Performance is where the Yoga 9i really, really shines - particularly the Iris Xe graphics. On all of our benchmarks but one, it beat out every other competing 2-in-1 and usually by a massive margin.",
    "Only the Asus Vivobook Flip 14 scored a sizeable win over the Yoga 9i, and that was in our CinebenchR20 multicore benchmark where the Flip 14 scored 2,536 points to the Yoga 9i's 1,975. Clearly, the Flip 14's AMD Ryzen 7-4700U CPU is capable of some impressive multicore performance, but it's not as cut-and-dry, since the Flip 14 got blown out by the Yoga 9i on Geekbench 5's multi-core benchmark, 3,824 to 5,135.",
    "As for the Yoga 9i's Iris Xe graphics, there's simply no comparison other than the Dell XPS 13, which runs the 11th-generation Intel i7-1165G7 processor, and the Yoga 9i still beats it in every one of our benchmarks though, sometimes, it's a closer contest than it is with its 10th-gen Core i7 or Ryzen 7 competition.",
    "When it comes to battery life, the Yoga 9i sweeps the field of any serious competition. Sure, the Lenovo Flex 5G's battery lasted an average of 29 hours-plus, but it was only able to run the HD movie benchmark (during which the Yoga 9i recorded 15 hours and two minutes of battery life) and it's compatibility issues kept us from running all but Geekbench 5, and there the Yoga 9i scores are twice those of the Flex 5G's.",
    "Meanwhile, the Apple MacBook Pro with a comparably-sized battery and running the ARM-based M1 processor lasted 13 hours and 22 minutes in our HD movie battery benchmark, while the MacBook Air with M1 made it 11 hours and 15 minutes in the same test.",
    "It's not a fully apples-to-apples comparison though. The M1 is an eight-core processor, while the i7-1185G7 has only four cores, so even with the more efficient ARM architecture, it still has to power twice as many cores – even if four of those are so-called \"efficiency\" cores.",
    "So, in the 2-in-1 class where the Yoga 9i's actual competition is, there just isn't anything close. The battery life on this thing is otherworldly and does it without sacrificing performance in the slightest. It's definitely a testament to the new Intel Evo platform as much as it is Lenovo's engineering.",
    "Fortunately, there's not a lot of bloatware on the Yoga 9i, something we definitely appreciate given the price point. In this range, you shouldn't get a lot of bloat, but we're seeing it more often than we should unfortunately.",
    "The biggest offenders here are McAfee and Lenovo Vantage, but McAfee is arguably useful – even if it doesn't make it onto our list of best antivirus software. Lenovo Vantage, meanwhile, helps manage the screen rotation as you're rotating and flipping the screen every which way, and it doesn't soak up a lot of overhead either, so it doesn't take away from the user experience.",
    "The other important preinstalled software of note is Lenovo Q-Control 3.0, which lets you adjust system performance and heat management pretty easily, so it'll probably be something you'll want to keep."
  ],
  "headers": {
    "0": "Two minute review",
    "9": "Price and availability",
    "13": "Design",
    "23": "Performance",
    "30": "Software and features",
    "33": "Don't buy it if..."
  },
  "links": {
    "Dell XPS 13 (2020)": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Dell XPS 13 2-in-1 (2020)": "https://www.techradar.com/reviews/dell-xps-13-2-in-1-2020",
    "Apple MacBook Air (M1)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "Acer Spin 5": "https://www.techradar.com/reviews/acer-spin-5-2020",
    "Apple MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "best antivirus software": "https://www.techradar.com/best/best-antivirus"
  }
}