{
  "source": "https://www.techradar.com/reviews/moto-g-pro-review",
  "title": "Moto G Pro / Moto G Stylus review",
  "category": "phones",
  "updated": "2020-09-11T13:03:13Z",
  "author": "andrew-williams",
  "summary": "An affordable Android with a slot-in stylus",
  "verdict": "The Moto G Pro is one of the more interesting budget phones. It has a stylus and an action camera made just for video. You pay a little more as a result, pushing the cost close to a few even more capable phones. Read up on the limitations of the stylus before buying, but it’s a refreshing change among a mass of very similar, very good affordable Androids.",
  "pros": [
    "Great stereo speakers",
    "Good battery life",
    "Unusual slot-in stylus"
  ],
  "cons": [
    "Stylus is basic",
    "Close in price to beefier phones",
    "Action video cam could be better"
  ],
  "article": [
    "The Moto G Pro / Moto G Stylus looks like an ordinary affordable phone, but is anything but. It has two features not found in any of the lead competition, a stylus that slots into the frame, and an action video camera that shoots widescreen video when the phone is held upright.",
    "Not bothered about either? You might as well spend less on the Moto G8 Plus or Moto G8 Power. Or just a tiny amount more on the higher end Realme X50 5G, which as the name suggests will also get you 5G.",
    "However, the Moto G Pro / G Stylus is a sensible choice if you wish you could buy a Samsung Galaxy Note 20 but simply can’t afford one. The Moto G Pro's stylus isn’t nearly as good as the Note’s, but it does let you scribble notes and offers optical character recognition to replace the virtual keyboard.",
    "For some, this phone is called the Moto G Pro (markets like the UK) while the phone is called the Moto G Stylus for those in the US. Throughout this review we'll refer to it as the Moto G Pro, but this device is the same as the Moto G Stylus if you're living in the US.",
    "The Moto G Pro has good battery life too. Some other phones in the range last even longer between charges, but there’s little to dislike here. The Moto G Pro lasts a full day, every day, and usually has a good chunk of charge left by midnight.",
    "Its performance is solid as long as you don’t expect to play Fortnite with the graphics maxed out. And the Moto G Pro has Motorola’s low-light photography mode, missing from the Moto G8 Power. It dramatically improves the dynamic range of your low-light images.",
    "There is a huge amount of competition in this category though. The Xiaomi Redmi Note 9 Pro, Realme X50 5G, Samsung Galaxy M31 and Moto G8 Plus are all either cheaper or do something significantly better, so only choose the Moto G Pro if you’ll really appreciate the stylus. It does not come for free.",
    "The Moto G Pro was announced in May 2020, a time of a whole heap of Motorola phones.",
    "There are really too many Motos these days for normal people to keep track. But the Moto G Pro is one of the higher-end ones. It sits just below the Moto G 5G Plus, and above the all-rounder Moto G8 Plus.",
    "It costs $299 / £289.99 (around AU$260) without any discount. That is a little more expensive than many phones in this class, but the phone does have 128GB of storage and the pen, which can’t just be slotted into an existing design.",
    "The Moto G Pro looks remarkably similar to the G8 Power. It’s a mid-size phone, not super-slim but has curves that don’t make its 9.2mm thickness too apparent.",
    "Its back and sides are both plastic. There are no metal plates here and only the screen and camera covers are glass. However, this is now the norm for sub-$300/£300 phones.",
    "Only a few affordable phones use glass and metal these days. Still, the Moto G Pro has a nice finish. A subtle dark blue to black gradient is cast across the back. It’s color, but moody color.",
    "The stylus is the Moto G Pro’s key hardware feature, and the reason for the ‘Pro’ part in the name.",
    "It’s nicely handled. A metal stylus with a plastic cap slots into the phone, so you don’t need to find somewhere for it to live.",
    "However, this is not as clever as the styluses bundled with the Galaxy Note phones, or a stylus tablet. A little dome of metal mesh makes up the tip, which tells us how the pen works.",
    "It’s a capacitive stylus, not one that uses a digitizer to gauge pressure. Use it with the Autodesk SketchBook app and there is zero pressure sensitivity. However, strangely, there is a very basic form of it when you use the Moto G Pro’s own sketching software.",
    "This pops up when you pull the stylus out. Use one of the sketch app pen tools and you can make its line thicker by pressing a little harder. Our guess is this causes a little more of the mesh to touch the screen, and that the capacitive layer can sense the larger contact area.",
    "It’s a clever workaround, but the Moto G Pro isn’t perfect for sketching. There’s slight lag between pen input, and Motorola’s sketching software is very basic. No layers mean you can’t create remotely serious pieces of work with the thing.",
    "Most other outer pieces of the Moto G Pro’s hardware are fairly conventional. It has a good rear fingerprint scanner, and plastic volume and power buttons.",
    "There is one more stand-out, though. The Moto G Pro has excellent stereo speakers for its class. We had a chance to put them up head-to-head with those of the Moto G8 Power, the Xiaomi Redmi Note 9, Samsung Galaxy M31, TCL 10L, Realme X50 5G and Oppo A52.",
    "The Moto G Pro’s are, all considered, the best of the lot. You get excellent top volume, a desirable stereo soundstage thanks to the second front driver, and decent lower frequency substance. The Realme X50 5G’s speaker is perhaps a little smoother, but it has just one driver so can’t really compete.",
    "Podcasts and games sound great through the Moto G Pro, for a budget phone.",
    "The Moto G Pro has a 6.4-inch LCD screen with a single punch-hole. That inch count may sound huge if you are upgrading from an old 16:9 phone, but this is actually one of the smaller displays in its class.",
    "For some reason, most great 200-300 dollar/pound phones are quite large.",
    "The screen is solid, with the usual budget caveats. Its peak brightness is only just good enough to make outdoors use comfortable, and it doesn’t have the chops to display wide gamut colors. You’ll see a slight backlight glow in black areas of the screen if you watch a YouTube video in the dark.",
    "This is a standard 60Hz refresh rate screen too, not the 90Hz or 120Hz kind that is beginning to filter down to cheaper mobiles.",
    "Still, there’s plenty of good stuff to mention. The Moto G Pro supports HDR and the 1080 x 2300 resolution makes everything appear sharp. HD Netflix support is in place at launch too, which is reassuring.",
    "You have a choice of three color profiles, namely Natural, Boosted and Saturated. The difference between them is not huge, however, as the Moto G Pro’s LCD screen just doesn’t have the color depth for wild-looking saturation.",
    "The phone runs Android One rather than the custom Motorola profile seen in the G8-series phones. This is an interface that allows for only minor manufacturer customizations, but it already has some important additions, like Dark Mode.",
    "As this is Google’s version of dark mode, it extends to apps like Mail rather than just flipping the colors of the Settings menu and app drawer. Android One is a great interface.",
    "Moto’s Active Display is the main change here. It brings up a notifications display when the phone is sleeping and senses motion changes, and is perhaps the most recognizable part of the Moto Android interface.",
    "Many mid-range phones have quad rear camera arrays, usually featuring one good camera, one okay one, and two that barely justify the disc of glass used to protect the lens. Motorola takes a much less cynical approach, by exploring what can be done with a tight budget.",
    "The Moto G8 Power has a 2x zoom for its third camera, for example, but the Moto G Pro has three cameras that include a dedicated 16MP GoPro-style wide-angle video camera instead.",
    "It is highly unusual because it captures widescreen footage when the Moto G Pro is held upright. This 90-degree-rotated sensor and extra strength electronic stabilization let you shoot totally carefree single-handed and still see usable results.",
    "There is a question of whether this hardware is really suited to the way we use phones, though. A lot of social media footage is shot in portrait these days, and the Moto G Pro’s action camera can’t shoot photos. It’s the same implementation of this idea we saw way back in 2019’s Motorola One Action and more recently in the Moto G8 Plus.",
    "The other two rear cameras are the 48MP main sensor and a 2MP macro sensor. Macro images aren’t usually worth taking. While you can get significantly closer to your subject, the low-spec hardware produces limited detail, dynamic range, and contrast. Your macro shots will look weak.",
    "As there is no depth sensor you can only take background blur portrait images of people. The phone uses an algorithm to work out the outline of their head and body. It works okay, but there’s often a bit of blurring around the edges of their clothing or hair.",
    "Want the nerdy specs? The main Moto G Pro camera is the Samsung GM1, a large 1/2-inch sensor.",
    "The others use OmniVision hardware. Our selfie camera is the 1/30.6-inch ov16885, the macro the tiny 1/5-inch ov02a, and the video camera the 1/3.06-inch ov16a1q. We may have the selfie and video cameras the wrong way around, but the two sensors are similar.",
    "You can also see where the fourth camera would go if the Moto G Pro had four rear cameras, presumably because it uses the same camera lens housing component as the Moto G8 Power to keep costs down.",
    "Thankfully, the primary camera is reasonably good. You can take solid shots in daylight with minimal shutter lag, color is fair, and the Moto G Pro has a mostly reliable Auto HDR that takes some of the thought out of image composition.",
    "It has Motorola’s Night Vision mode too. This takes 2-3 seconds to capture low-light images. It does not notably improve sharpness and detail, but it increases dynamic range hugely, bringing out the colors in dark clouds, and lifting other dark areas of the scene.",
    "Just don’t look too close as the Moto G Pro’s night shots still appear quite soft, with most natural textures left mushy. It’s nowhere near as good as the Google Pixel 4a’s night mode, but we’re glad it’s here.",
    "We were left wishing the Moto G Pro had the superior Sony IMX586 sensor, which does not seem an unrealistic ask at the price. It has greater native dynamic range and is simply a better-performing sensor.",
    "You can see the limitations of the Samsung GM1 sensor in the shadowy areas of the phone’s HDR shots, which can look either soft or grainy. The Moto G Pro also tends to push the exposure too high in nature close-ups, or where the sky is partially covered by tree branches.",
    "Moto phones have had this habit for years, and it is easily remedied by a quick flick of the exposure control. However, most people won’t do this, and you can’t recover blown highlights if you try to tone the JPG image down post-shoot.",
    "What’s the video like? The Moto G Pro's action video camera shoots video more grainy than the primary camera, and the relatively small sensor results in frame blurring when you shoot under tree cover. This is not helped, again, by the Moto G Pro’s tendency to boost brightness more than is necessary at times, nudging it towards slower shutter speeds or higher ISO sensitivity.",
    "You’ll also see some strange wobble at the frame corners at times, an effect of the electronic stabilization attempting to deal with motion and lens distortion. The wide camera shoots up to 1080p.",
    "A lot of the time you may be better off using the Moto G Pro’s main camera and sticking to 1080p. While this camera can shoot at 4K, you only get stabilization at up to 1080p. Unstabilized footage looks rough.",
    "And the 16MP selfie camera? It's decent. The Moto G Pro picks up plenty of fine facial detail in good lighting, and uses pixel binning to hold on to it as best it can in low light. And when lighting is bad enough to reduce facial hair to a smudge, you can use the screen as a makeshift flash, which significantly improves matters.",
    "The Moto G Pro has a good Qualcomm Snapdragon processor, but it's not the most powerful phone available at the price. Its chipset is the Snapdragon 665, as seen in the much cheaper Xiaomi Redmi Note 8T.",
    "It’s a reminder of quite how hard Chinese phone manufacturers push the value angle.",
    "General performance is not quite as nippy as the Realme X50 5G, which has the step-up Snapdragon 765G chipset. But most will be happy with how the Moto G Pro operates.",
    "It’s smooth enough, if not quite as responsive as a flagship phone. You see this in the performance of its RAM and storage (which come in at 4GB and 128GB respectively) too. RAM speeds of 5500MB/s are just over a quarter the pace of the top phones, and the storage reads of 272MB/s are good, but not great.",
    "The Moto G Pro’s app speed loads are a little slower than the Realme X50 5G, a phone with 18700MB/s RAM according to the A1 SD Bench test app. However, the Moto runs just fine as long as you don’t come expecting that 10% extra zip of a top-end phone.",
    "Almost all games run very well, although you see the limits of the Snapdragon 665 when you fire up Fortnite. The Moto G Pro runs the game better than phones with equivalent MediaTek or Samsung Exynos chipsets, but it only performs comfortably if you use ‘low’ graphics and some dynamic resolution scaling.",
    "Big Fortnite fan? You may want to hunt down a phone with a Snapdragon 7-series processor with a ‘G’ graphics boost. Options around the price include the Xiaomi Redmi Note 9 Pro and the Redmi X50 5G.",
    "The Moto G Pro scores 1372 (312 per core) in Geekbench 5, a result very similar to almost every other Android in this category, whether it uses a Qualcomm, MediaTek, or Samsung processor.",
    "But, having used all three kinds recently, Qualcomm Snapdragons in this class tend to provide the most consistent gaming experience.",
    "Don’t forget the Moto G Pro’s speakers here. A good stereo array as seen here is a major benefit for on-the-sofa sessions, when you might not bother to plug in a pair of headphones.",
    "The Moto G Pro has a 4,000mAh battery and includes an 18W TurboPower charger. This is a relatively low-end form of fast charging.",
    "It takes the phone from completely flat to 50% charge in 45 minutes, not within 30 minutes like plenty of higher-end models. A full charge takes two hours and two minutes. Not slow, but not lightning fast either.",
    "The Moto G Pro lasts perfectly well through a day of moderate, not just light, use. We tended to have around 30% charge left over by the end of the day.",
    "However, you can get extremely long-lasting phones when shopping at this end of the market. Several have roughly 5,000mAh batteries, like the Xiaomi Redmi Note 9 and the Moto G8 Power. The Samsung Galaxy M31 has a huge 6,000mAh cell, and yet is still slimmer than the Moto G Pro.",
    "How much difference does that make? A 90-minute video played at full brightness takes 15% charge off the Moto G Pro, and just 9% off the 5,000mAh Moto G8 Power.",
    "This phone is not the obvious choice if battery life is one of your top two priorities, but only because sensational stamina is on offer elsewhere. The Moto G Pro’s battery life is just ‘very good’.",
    "First reviewed: September 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "7": "Moto G Pro / Moto G Stylus price and release date",
    "10": "Design",
    "23": "Display",
    "32": "Camera",
    "51": "Specs and performance",
    "61": "Battery life",
    "67": "Don't buy it if..."
  },
  "links": {
    "Moto G8 Plus": "https://www.techradar.com/reviews/moto-g8-plus-review",
    "Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Moto G 5G Plus": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "Motorola One Action": "https://www.techradar.com/reviews/motorola-one-action-review",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Xiaomi Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t-review"
  }
}