{
  "source": "https://www.techradar.com/reviews/msi-optix-mag272cqr",
  "title": "MSI Optix MAG272CQR review",
  "category": "computing",
  "updated": "2020-02-20T16:51:02Z",
  "author": "jeremy-laird",
  "summary": "Fast, but not the fastest",
  "verdict": "MSI’s new 27-inch 165Hz 1440p panel is a great all-rounder, but its VA panel doesn’t quite make for the quickest gaming monitor on the market despite claimed 1ms pixel response.",
  "pros": [
    "Great feature set",
    "Punchy colors and contrast",
    "165Hz refresh and adaptive sync"
  ],
  "cons": [
    "Patchy response from VA panel",
    "Not a true HDR display"
  ],
  "article": [
    "In an increasingly crowded market for high-refresh gaming monitors, the new MSI Optix MAG272CQR has its work cut out. As a 27-inch curved model with 165Hz refresh and the popular 1440p resolution, it’s something of a middle market specimen of the gaming panel breed. The 1080p masses lie below, while both 4K and even higher refresh screens occupy more exclusive territory.",
    "If all that is reflected in the $399 (£399/around AU$600) price, what isn’t necessarily an assumption is the question of LCD panel type. For the MSI Optix MAG272CQR, the weapon of choice is a VA rather than TN or IPS screen. That has certain implications when it comes to image quality. VA isn’t exactly renown for fast pixel response.",
    "But first, let’s cover off the main specifications. As a 1440p monitor, you get 2,560 by 1,440 pixels running at a maximum refresh of 165Hz. That’s a good compromise between the speed of a 1080p panel and the detail of 4K. You really do need some serious graphics hardware to drive a 4K panel at high refresh rates, so 1440p makes for a good match with most middle to upper-middle tier 3D cards.",
    "Speaking of refresh rates, the MSI Optix MAG272CQR comes complete with AMD’s FreeSync adaptive syncing technology. It’s latterly been made compatible with Nvidia graphics cards, too, and our test rig powered by an Nvidia GeForce GTX 1080 had no problems recognising the MSI Optix MAG272CQR and enabling the equivalent G-Sync functionality.",
    "Elsewhere, the panel’s curvature is a pretty tight 1500R radius, USB-C single-cable connectivity is included and MSI also advertises this monitor as ‘HDR Ready’.",
    "However, with a peak brightness of just 300cd/m2 and no local dimming capability, this isn’t a true HDR display. That said, it is a high quality item in terms of build, with an attractive chassis, slim bezels on three sides of the panel and both tilt and height adjustment.",
    "But how does the MSI Optix MAG272CQR actually look? The upsides include punchy colors and loads of contrast. The Samsung-supplied panel boasts static contrast performance of 3,000:1 and that’s immediately obvious in darker game scenes where plenty of shadow detail is evident. The 165Hz refresh is likewise as snappy as all but the most demanding esports addicts will require.",
    "More problematic is this monitor’s actual pixel response. Poor response has long been a characteristic of VA panels and, ultimately, the MSI Optix MAG272CQR is no exception.",
    "MSI includes three levels of response-accelerating pixel overdrive in the OSD menu. Unfortunately, the two faster modes also entail the unmistakable hallmarks of inverse ghosting.",
    "Unmistakable, that is, but not necessarily always noticeable in-game. The extent to which inverse ghosting bothers you is ultimately subjective. But it is present in this monitor. To that extent, MSI’s claims of 1ms response performance are a little misleading. Compared, say, to a 1ms TN gaming monitor, the MSI Optix MAG272CQR is clearly not as quick.",
    "That aside, the 1440p resolution makes for plenty of detail on a 27-inch panel, the build quality is great and if RGB mood lighting is your bag, you also get MSI’s Mystic Light ambient lighting technology, which can be synced with similarly equipped peripherals like mice and keyboards."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don't buy it if..."
  },
  "links": {}
}