{
  "source": "https://www.techradar.com/reviews/bang-and-olufsen-beoplay-e8-sport",
  "title": "Bang & Olufsen Beoplay E8 Sport review",
  "category": "audio-visual",
  "updated": "2020-12-15T12:29:49.949Z",
  "author": "michael-sawh",
  "summary": "Stylish buds that deliver bright sound to get sweaty with",
  "verdict": "The B&O Beoplay E8 Sport are truly wireless earbuds that tick all of the right boxes. They look good, stay in place, have a solid battery life and offer great, detailed sound quality. While you do have to work a bit harder and tinker with the equalizer to make sure it’s a good fit for all music genres, these are overall great buds to live with.",
  "pros": [
    "Good design and secure, comfortable fit",
    "Detailed sound quality",
    "Quick charge support"
  ],
  "cons": [
    "Not the smallest case",
    "That price tag"
  ],
  "article": [
    "Bang and Olufsen is a brand with a reputation for making great sounding audio hardware that looks the part too. It launched the Beoplay E8 2.0 truly wireless earphones at the beginning of the year and then followed it up months later with the E8 Sport.",
    "As that name quite clearly suggests, these are true wireless earbuds built for fitness and marks B&O’s first pair of sporty wireless earbuds. Offering a similar design to the E8, they've been built to better withstand sweaty conditions and promise to offer a similarly pleasing sound profile it promises with its newest non-sporty E8 buds.",
    "Like previous models, these earbuds do not come cheap and you’ll need to pay quite a premium to get them into your ears and make them your audio workout partner.",
    "With the E8 Sport, you get what you pay for. Good-looking buds where there’s audio substance to match those good looks and it offers a detailed sound profile overall. We do think you need to spend some time in the in-app equalizer to get something more fitting for higher tempo, bassier music if that fills up your workout playlists.",
    "As sporty earbuds, they thankfully stay put in pretty much all of the exercise we could throw at them and you have room to adjust that fit to get something to sit more snug and comfortable too. The touch sensitive controls work well on the whole though physical controls for exercise still feel like the best solution.",
    "There’s no getting away that these are expensive and less money could get great sounding sporty truly wireless earbuds from the likes of the Jabra Elite Active 75t, and even Apple’s AirPods Pro for iOS users. If you’re happy to spend the money though and want earbuds with stylish looks and good quality sound, the E8 Sport are worth looking at.",
    "B&O announced the E8 Sport in June 2020, and they then went on sale in July. The launch price for the E8 Sport was a very high end $350 / £300 / AU$550, and while you can find them at some retailers for a little less than that, they have pretty much stuck to that pricing in most places.",
    "They come in four model options giving you your pick of Black, Oxygen Blue and a special Fernando Alonso edition, which is pricier than the standard Sport, though a limited run of just 66 units means you'll likely struggle to find these exclusive buds . There’s also an edition made with cycling brand Rapha, which aren't more expensive than the usual price.",
    "So what kind of earbuds does $350 / £300 / AU$550 get you these days? Well, unsurprisingly in typical B&O fashion, earbuds that look very nice to own and wear. The E8 Sport comes in three different looks including an eye-catching Oxygen Blue option and all come with the same round design made up of a mix of aluminum, polymer, and silicon.",
    "Each earbud weighs 6.4g and they really don’t feel heavy in the ears inside and outside of exercising with them. To make them a better fit for most, there’s four pairs of silicone tips, and three pairs of silicone earfins that are designed to lodge them into your ears securely. They thankfully never felt uncomfortable even in workouts well over an hour or on shorter, cardio burning sessions either. B&O also throw in the box some Comply Foam tips to offer improved noise isolation.",
    "The big factor that makes these better suited for workouts is the IP57 water and sweat-resistant rating. That doesn’t mean you can go swimming, though Bluetooth buds wouldn’t be useful in that scenario anyway (check out our guide to waterproof headphones for our top picks). It does mean they should handle the rigors of a good workout or getting caught out in the rain on your run. It also means you can give them a quick rinse under the tap as well when they get really sweaty.",
    "To keep you from touching your phone, the E8 Sport builds controls into the outer casing of the buds. That means you can use single and multiple taps to do things like skip tracks, use the onboard microphones to access voice assistants like Siri and Google Assistant, handle calls and you can also adjust volume by holding down on either bud.",
    "Outside of exercise scenarios, these touch controls work well and register without issue. During a run or some indoor workouts, trying to triple tap is a little tricker to do. If you care about turning the volume, skipping track or turning on the Transparency mode, then it handles those quick simple taps easier.",
    "The other component of the setup is the case, which doubles up as your place for charging the buds. It securely holds the buds in place when not in use, though it’s fair to say it’s not the smallest case you’ll find with a pair of sporty wireless earbuds. It feels a little big to slip into a running belt or a shorts pocket and is certainly more at home being thrown into your gym back or a jacket pocket.",
    "When you need to get up and running, you’ll need to download the Bang & Olufsen companion app, which is available for iOS and Android devices. We tested the Sport on both platforms as well as pairing them to a MacBook and are happy to say there were no issues from a pairing point of view.",
    "Once they’re charged and you pop them out of the case and tap the sides of the buds to enter pairing mode, you’re ready to partner them up with your device. We didn’t experience any connection issues or drop outs in our time, whether that was during exercise or using them like a normal pair of buds.",
    "The companion phone app is a place where you can do a few things. The first is to check in on the battery status of the buds individually and you also have a big volume button if for some reason you don’t want to use the one on your device.",
    "It’s also where you’ll find a series of Listening modes, which are essentially preset sound profiles to better adjust the sound profile to what you’re listening to. So there’s a dedicated Sports option, something for Commutes and there’s an equalizer available to create your own one. For us, that Sports profile wasn’t that well tailored to our music, but it is easy at least to create something that is and save it as an additional profile you can use again.",
    "Powering the sound performance are 5.7mm electrodynamic drivers that deliver an overall very polished sound. These buds definitely excel more on some music genres more than others out of the box in our experience though. You’re getting great levels of clarity and detail, particularly on vocals and dialogue with a nice sense of instrument separation and a pleasing amount of warmth here too.",
    "These are earbuds designed for working out of course and our general preference for something more high tempo and bassy meant we had to venture into the companion app and bypass Bang and Olufsen’s own preset Sport listening modes to get something a fair bit brighter and with a warmer bassy sound. It definitely pays to spend some time here to get a sound profile that works and you should find something that does cater better to your ears and music choice.",
    "For the price, it’s a little disappointing to find there’s no active noise cancellation to be found with passive noise cancellation present instead. So the E8 Sport aren't going to entirely drown out the world around you on a run outdoors or battling with the speaker system in the gym. They certainly aren't the worst performers in keeping that sound at bay, and the snug fit and the right pair of buds plays their part here, but if you like to hear your music or audio only, you’re better off looking at another pair of sporty earbuds.",
    "In terms of how much listening time you have to play with, the E8 Sport will give you up to seven hours off a single charge. To compare those numbers to other sporty wireless earbuds, the significantly cheaper Jabra Elite Active 75t manage seven-and-a-half hours, while the Bose Sport Earbuds deliver five hours, and the Beats Powerbeats Pro give you nine hours. So it’s not quite a class leading battery life, but it’s nearer the higher end with those numbers and we didn’t find they fell short of those numbers.",
    "When it’s time to charge, you’ve got that charging case that has a 450mAh battery capacity, and when fully charged give you a total of 30 hours in total until that case needs charging again. It uses a USB-C to get it powered up again and the buds themselves take around 2.5 hours to get from 0-100%.",
    "B&O do also offer an additional wireless charging pad that comes in a range of colors that you can drop that case onto instead of plugging them into the charging cable. That will cost you an extra $125 / £110 (about AU$160) to own though.",
    "A nice touch is that a 20-minute charge will give you an one-and-a-half hours of playback time, which should see you through a decent run or gym session."
  ],
  "headers": {
    "0": "One-minute review",
    "6": "Bang & Olufsen Beoplay E8 Sport price and release date",
    "8": "Design",
    "14": "Setup",
    "18": "Audio performance",
    "21": "Battery life",
    "25": "Don't buy them if..."
  },
  "links": {
    "Beoplay E8 2.0": "https://www.techradar.com/reviews/bang-and-olufsen-beoplay-e8-20-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Jabra Elite Active 75t": "https://www.techradar.com/reviews/jabra-elite-active-75t",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "waterproof headphones": "https://www.techradar.com/best/best-waterproof-headphones",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Beats Powerbeats Pro": "https://www.techradar.com/reviews/beats-powerbeats-pro"
  }
}