{
  "source": "https://www.techradar.com/reviews/debut-video-capture",
  "title": "Debut Video Capture review",
  "category": "computing",
  "updated": "2020-01-29T13:01:36.718Z",
  "author": "cat-ellis",
  "summary": "An amazingly capable free screen recorder, and much more",
  "verdict": "This free screen recorder is packed with tools you'd expect to find in premium software, including scheduled recordings and flexible output options. It's easy to use and reliable, and is a great choice if you're looking for a free app for making and backing up recordings from a home security camera. Highly recommended.",
  "pros": [
    "Free for personal use",
    "Can record from external cameras",
    "Scheduled recordings",
    "Highly customizable"
  ],
  "cons": [
    "Interface looks a little dated"
  ],
  "article": [
    "There are dozens of free screen recorders available to download, but most are blighted by time restrictions, watermarks, bundled junk software and limited export options. Debut Video Capture, from NCH Software (developer of the excellent VideoPad Video Editor) is an exception.",
    "Debut is free for home use, and has everything you need to capture footage from your screen, a webcam, or other connected devices like security cameras – including a wealth of features you’d normally only expect to find in premium software.",
    "It isn’t designed for recording games (that requires something like OBS Screen Recorder, which can handle full-screen, hardware-accelerated programs with ease), but for everything else it’s ideal.",
    "When it comes to recording your screen, Debut offers all the usual options, letting you capture your entire display, a selected window, or a custom region. You can choose to show or hide the cursor, and even highlight it when you click, which is extremely useful if you’re recording a software demo or tutorial.",
    "Once you’re ready, either tap the red button or minimize Debut and hit one of its keyboard shortcuts ([F5] or [Ctrl]+[F9]) to start recording. This is a really thoughtful touch, giving you a choice of shortcuts to avoid conflicts with other programs that use the same key bindings.",
    "You can record from your PC’s soundcard, an external microphone or both, and there’s even picture-in-picture support, so you can overlay a recording from your webcam on top of footage from your desktop.",
    "Debut doesn’t includes a tool for editing your videos after they’re saved, but you can adjust colors, apply filters, and add captions and watermarks while they’re recorded. Just take your pick from the buttons on the lower right, and check the preview pane to see the effect before you start recording.",
    "However, Debut can do much more than just capture what's happening on your monitor – it can also record video from your webcam and, most usefully, connected devices like IP cameras.",
    "This is particularly useful when combined with its ability to schedule recordings. For example, you could set the software to record from a security camera overnight, or capture your PC’s screen while your child uses it to make sure they’re behaving sensibly.",
    "Debut can export recordings in all the most popular video formats, includiong MP4, MOV, WMV and AVI. You can also capture screenshots in PNG or JPG format by clicking the camera button at the bottom right.",
    "You can choose a custom filename convention, pick the destination for saved files, and even mirror recordings to a separate network or drive. This is a particularly good idea if you’re using Debut to save footage from a network-attached security camera, and you need to be sure you have a backup.",
    "Debut’s interface isn’t the most attractive, but what it lacks in gloss, it makes up for in clarity. Everything is clearly labelled, and you’ll never be left casting around for the option you need. It’s also worth noting that the software is currently in beta, so the final release might look a little more polished. NCH Software’s VideoPad video editor has recently benefited from the addition of a stylish new dark mode, so the developer is clearly aware that looks matter.",
    "The design really doesn't matter, though – Debut is exceptionally capable video capture software, and can easily serve as the heart of a home security system."
  ],
  "headers": {
    "3": "Screen recordings",
    "7": "Security systems",
    "11": "More than looks",
    "13": "You might also like"
  },
  "links": {
    "free screen recorders": "https://www.techradar.com/news/the-best-free-screen-recorder",
    "Debut Video Capture": "http://geni.us/vLwSe",
    "VideoPad Video Editor": "https://www.techradar.com/reviews/videopad-video-editor",
    "OBS Screen Recorder": "https://www.techradar.com/reviews/obs-studio"
  }
}