{
  "source": "https://www.techradar.com/reviews/coros-pace-2",
  "title": "Coros Pace 2 review",
  "category": "fitness",
  "updated": "2021-03-23T16:03:35Z",
  "author": "cat-ellis",
  "summary": "The Coros Pace 2 is a super lightweight sports watch with a surprisingly competitive price tag",
  "verdict": "A lightweight mid-range sports watch that's ideal for anyone who's looking for a more stylish alternative to the Garmin Forerunner 245, with the benefit of triathlon tracking and a slightly lower price tag. It's super lightweight too, and offers impressive GPS accuracy. It can even calculate your stride length so you can keep measuring your cadence while running through tunnels, and the 'AI trainer' helps you manage your training load. The screen could be brighter, but for the price, the Pace 2 is otherwise hard to fault.",
  "pros": [
    "Super lightweight design",
    "Excellent satellite positioning",
    "High-resolution display"
  ],
  "cons": [
    "Screen is dark when not using backlight",
    "App lacks some features"
  ],
  "article": [
    "The Coros Pace 2 is an excellent mid-level fitness watch with similar specs to the Garmin Forerunner 245, and a great choice if you’re looking to upgrade from a Fitbit to something more capable. Its light weight and slim design, with thoughtfully designed controls, make it particularly well suited to smaller wrists and activities where flexibility is essential.",
    "It also boasts impressive location-tracking credentials for runners, cyclists and swimmers, with GPS supported by two (soon to be three) additional satellite positioning systems. While serious athletes may be better served by the higher-end Coros Apex, this is an excellent choice for anyone who wants a dependable device that will help keep their training on track.",
    "The Coros Pace 2 is available in two colors at launch – navy and white – with either a nylon or silicone band. The case is plastic, but with a matte finish that means it doesn’t look cheap, and it’s surprisingly light on the wrist. Whereas the original Pace tipped the scales at 48g, the Pace 2 weighs a mere 29g if you opt for the nylon strap. Fancy a change? Turn the watch over and you’ll see a pair of quick-release pins that are large enough to undo with a fingernail – no screwdrivers necessary.",
    "Like the original Pace, the Pace 2’s 64-color memory-in-pixel screen is very impressive for a fitness tracker. We recommend activating the gesture backlight (easily toggled through the settings menu) to make it easier to read in bright daylight, but its 240x240 pixel resolution is one of the best you’ll see on a mid-range sports watch.",
    "At the time of writing there are only three different watch face designs to choose from, but a forthcoming firmware update may well add more options. We found we preferred the ScoreBoard face for everyday use, which shows the time, date, current steps, calories burned, time spent exercising, heart rate, and progress towards goals – all without looking cluttered.",
    "Whereas the Coros Pace was controlled using a Garmin-style quartet of buttons, the Pace 2 uses just two: a crown-style dial for scrolling through menus and selecting options, and a back button. It’s the same setup used by the recently released Coros Apex, and is very simple to navigate. We particularly like the way the watch is unlocked: press the crown once, then turn it until a small meter is filled and the watch buzzes approval. It’s easy, but almost impossible to do accidentally.",
    "The Pace 2 is charged using a small USB cable that attaches securely to the back. We’ve mentioned it before, but we much prefer this type of charging cable to Fitbit’s awkward clamps that have to be lined up just so for the connectors to meet.",
    "The Coros Pace 2 launched on August 25, 2020, with a recommended sale price of $199.99 / £179.99 (about AU$280). That’s the same price as the original Coros Pace at launch.",
    "This is a multi-sports watch first and foremost, so you won’t find features like period tracking, music and NFC here. If you’re looking for something that could reasonably replace your phone on a workout, you’d be better off with a Fitbit Charge 4 – or a smartwatch like the Samsung Galaxy Watch or Apple Watch 4.",
    "The Coros Pace 2 still has a lot to offer in regular wear, though. If you choose to wear it all day, you’ll benefit from app alerts on your wrist, with that high-res screen allowing you to read a good deal of the message, and the rotating crown making it easy to scroll down.",
    "It works well for alerting you to incoming calls, texts and emails though we had to turn off WhatsApp notifications because the watch began buzzing like an irate wasp each time our messages synced. You can also set a ‘Do not disturb’ window so you can work without interruptions.",
    "The Coros Pace 2 also offers sleep tracking, and will record periods of light, deep and REM sleep. These can then be used to calculate how well you’ve recovered from your workouts – more on that shortly.",
    "Our review unit featured the nylon band, which is secured using hook-and-eye (ie Velcro) rather than the typical buckle. This won’t be to everyone’s liking, and after time you might find that fibers from your clothes become stuck in the hooks, but it certainly makes the Pace 2 easy to slip on for daily wear.",
    "We were impressed with the Coros Pace 2’s fitness tracking, which compared favorably with a rival sports watch costing almost twice the price.",
    "The Pace 2 features the usual set of fitness tracker sensors, including an optical heart rate monitor, altimeter, accelerometer, compass, gyroscope and thermometer. What sets it apart from the competition is its accurate on-board GPS, which is supported by GLONASS and BEIDU (the Chinese equivalent), with support for GALILEO coming in a future update. It's impressive for the price, and many similarly priced watches have no satellite positioning at all.",
    "Workout modes include run, indoor run, track run, bike, indoor bike, pool swim, open water, triathlon, strength, gym cardio, and GPS cardio. It’s disappointing that some of the original Pace watch’s off-road modes (namely trail running and hiking) are now missing, but this might be due to the recent release of the Coros Apex, which is designed for serious outdoor exploration first and foremost.",
    "We tested the Pace 2 against one of Garmin’s latest watches, the Garmin Instinct Solar, and the two produced almost identical results when it came to heart rate, only differing by 1bpm, with no unexpected drops or spikes. Results for distance and cadence were also almost identical – the only significant difference was estimated elevation, but elevation measured using GPS has a high margin of error, so this isn’t a sign that either device is performing poorly.",
    "Despite its cheaper asking price, the Coros Pace 2 includes a handful of smart features that the Garmin lacks. One of the most impressive is its smart stride length detection. It’s a simple idea – while you have GPS connectivity, the watch uses your cadence and speed to calculate the length of your stride. Then, if you happen to lose connection with the positioning system (while running through a tunnel, for example), it will be able to approximate your cadence when it reconnects.",
    "We particularly liked the Pace 2’s AI trainer function, which is accessible through the watch’s main menu and allows you to easily scroll through previous workouts and see whether you’ve had sufficient time to recover from each effort. In other words, whether you’re ready to head out for another training session without burning yourself out.",
    "The Pace 2 was light and comfortable (noticeably more so than the chunkier Instinct Solar) and was barely noticeable while working out. Its slim profile means it won’t snag the cuff of longer-sleeved tops, and it’s well suited to all wrist sizes. Some devices, such as this year’s Fitbit Charge 4. Come with two different straps to accommodate smaller and larger wrists, but Coros’s practical use of nylon and Velcro means one size fits all.",
    "The Coros app is quite minimalist in design, presenting information about your daily workouts without any extraneous detail. There’s no calorie counting or water intake logging here, so your activity levels are shown front and center, including heart rate throughout the day, steps, and fitness level. If you’re under-training, or your fitness level is rated as low, the app makes no bones about telling you so.",
    "You can add your own training routes to the app, which is quite a simple process, though it currently only supports GPX files. These can be created using previous workouts recorded using a Coros device, or using a third-party app. Sadly there's no way to create routes within the app.",
    "The Coros app also doesn't offer any way to make connections with other users eighter, though this isn't too likely to be a problem since third-party connectivity is an area where Coros excels. The app is easy to connect to Strava – essential for any keen cyclist or runner – and can also be linked to TrainingPeaks, Relive and a clutch of other activity analyzing services.",
    "There are lots more third-party options available than you’ll get with most fitness tracker companion apps, which helps fill the gaps in the Coros app itself."
  ],
  "headers": {
    "0": "Two-minute review",
    "2": "Design",
    "7": "Price and availability",
    "8": "Everyday use",
    "13": "Fitness tracking",
    "20": "Companion app"
  },
  "links": {
    "Garmin Forerunner 245": "https://www.techradar.com/reviews/garmin-forerunner-245-review",
    "Coros Apex": "https://www.techradar.com/reviews/coros-apex",
    "TrainingPeaks": "https://www.trainingpeaks.com/",
    "Relive": "https://www.relive.cc/?hl=en"
  }
}