{
  "source": "https://www.techradar.com/reviews/silicon-power-stream-s07-6tb-external-hard-drive",
  "title": "Silicon Power Stream S07 6TB external hard drive review",
  "category": "computing",
  "updated": "2020-06-08T16:09:03Z",
  "author": "desire-athow",
  "summary": "SMR or CMR: Who knows?",
  "verdict": "The Silicon Power Stream S07 6TB external hard drive is a good storage product when considered on its own when compared to other SMR drives. However, its price is far higher than the competition and is the main contributor to its average score.",
  "pros": [
    "Three year warranty"
  ],
  "cons": [
    "Bit of a lottery",
    "High price",
    "Atrocious write speeds",
    "Divisive design",
    "Uses dual Type-A cable"
  ],
  "article": [
    "Direct attached storage or DAS have become more popular as users are managing bigger files than ever before. Games are growing in size and so are video footage: 8K resolution followed 4K which itself took over from full HD.",
    "Storage specialist Silicon Power still believes that there is life in external hard drives - and we do too - but a worrying trend we have witnessed recently makes it more challenging for consumers to understand how to choose their ideal storage product.",
    "We are reviewing their Stream S07 6TB, an external hard disk drive that is available in 3TB, 4TB and 8TB capacities. It runs off a USB 3.2 Gen 1 interface, in other words, it will only reach up to 5Gbps (in theory) although in practice, hard drives are unlikely to reach even a quarter of that.",
    "The drive comes in a black plastic enclosure with a stone-like texture (i.e rough); to make it even more realistic, the chassis has an opening that looks like a crack and is used for cooling . The opening is used for cooling and it also has a stylish blue LED that is used as a transfer status indicator.",
    "It comes with a power supply unit and a 60cm Type-A to Type-A cable which is atypical for a storage device where we’re more accustomed to see either square USB connectors or Type-C ones. The issue with such cables is that they’re a rarity; you’re unlikely to have one lying around.",
    "At 171.0 x 113.6 x 34.9mm and a weight of just under 1kg, it is reasonably hefty, something we’d recognise given the amount of electronics that goes into it.",
    "6TB hard disk drives have been with us for almost seven years now with 20TB hard drives already in operation in 2020.",
    "Silicon Power used a 3.5-inch hard disk drive, the Seagate Barracuda ST6000DM003 with a rotational speed of 5,425RPM and 256MB cache. Now, one of the biggest controversies in the world of storage at the moment is the use of SMR (Shingled Magnetic Recording) technology in hard disk drives.",
    "What this technology does is increase storage capacity and sustained read speeds but has a very detrimental effect on random write speeds and one of the telltale signs of SMR drives is the large cache, which this one has. Despite no mention of SMR in the marketing literature, we are almost certain that Silicon Power uses such a drive given the performance that we witnessed.",
    "So no surprise there that the Stream S07 delivered some great numbers when it comes to read speeds, surpassing 200MBps on read speeds, making it faster than all external hard disk drives we’ve tested to date. On the other hand, write speeds were painful, struggling to reach 38MBps, that’s compared to 130MBps that we recorded on the Seagate Backup Plus, a 2.5-inch 5TB portable hard drive.",
    "Real life numbers are cringeworthy to say the least. It took 386 seconds to transfer a 10GB file or just below 27MBps. Elsewhere, we noted that the drive was slightly noisy and was warm under load. A free software package is also available for download to provide useful functions such as data backup and restore, syncing, AES 256-bit encryption, and cloud storage for efficient data management.",
    "As it is usually the case, we urge people to get a cloud backup (or cloud syncing or cloud storage solution) to protect their data with a multi-terabyte provider, perhaps a lifetime option, is likely to be the best option.",
    "Silicon Power issued this statement to us “S07 can be found in two configurations with the SMR drive from Seagate or PMR drive from WD. For the S07; to be fair transfer speeds are not the main consideration for this product, rather large quantities of storage for the cheap. The idea is to provide a solution where you can upload large datafiles which you usually do not have to handle a lot (cold/long term storage). In other words it is an archive drive, which is part of the reason some feature SMR drives.”",
    "The S07 is not available from Amazon or Newegg; the only place we could find it was in Taiwan where it sells for the equivalent of $185 which is vastly more than the competition. 6TB as a storage capacity is rapidly disappearing as it is sandwiched between 4TB and 8TB, two more popular sizes.",
    "At the time of writing, the most obvious alternative to the Silicon Power Stream S07 is the Seagate Expansion Desktop 6TB external hard disk drive which retails for $105 at Amazon, that’s about $17.50 per TB, the cheapest on the market. This is a no-frill drive with a much shorter 1-year warranty and a claimed transfer rate of 160MBps.",
    "If Seagate is not your cup of tea, then why not try the 8TB WD Elements desktop hard drive. Why 8TB? Because this capacity is a smidgen more expensive than its 6TB counterpart and matches Seagate drive on a per Terabyte value. For $140, it is an exceptionally good deal especially as it comes with a two-year warranty.",
    "Given the choice, there’s little reason to purchase the Silicon Power Stream S07. As it is often the case with storage devices, vertically integrated companies like Seagate, Toshiba and WD simply stand a better chance to build cheaper products as they manufacture the drives themselves.",
    "On the subject of SMR, the main manufacturers are all doing it and there’s little that end users can do about it especially if they want cheap external storage. You could build your own external hard disk drive using a traditional hard disk drive but that’s likely to be more expensive. Even laptop hard disk drives like the ST5000LM000, a 5TB drive, use SMR.",
    "How could Silicon Power improve the S07? We are afraid that there’s not much that can be done; maybe the company could start trialling JBOD (just a bunch of disks) enclosures that take two 2.5-inch hard disk drives, these are likely to be smaller and lighter than the S07 and achieve capacities of up to 10TB."
  ],
  "headers": {
    "3": "Design",
    "6": "Performance",
    "13": "The competition",
    "16": "Final verdict"
  },
  "links": {
    "external hard drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "20TB hard drives": "https://www.techradar.com/news/you-will-be-able-to-buy-a-20tb-hard-drive-in-2020",
    "S": "https://www.techradar.com/reviews/seagate-backup-plus-portable-5tb-hard-drive",
    "eagate Backup Plus, a 2.5-inch 5TB portable hard drive": "https://www.techradar.com/reviews/seagate-backup-plus-portable-5tb-hard-drive",
    "free software package": "https://www.silicon-power.com//web/software",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "cloud syncing": "https://www.techradar.com/best/best-file-syncing-solution",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Seagate Expansion Desktop": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSeagate-Expansion-Desktop-External-STEB6000403%2Fdp%2FB07CX8QBG4%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2045469290982766300-20"
  }
}