{
  "source": "https://www.techradar.com/reviews/ebby",
  "title": "Ebby review",
  "category": "computing",
  "updated": "2020-11-19T12:02:00Z",
  "author": "mark-pickavance",
  "summary": "Flat fee transcription",
  "verdict": "Good quality transcription service at an easy to understand flat fee price. The speed of processing and accuracy is excellent, but it lacks any collaboration tools for those working as part of a team.",
  "pros": [
    "100+ languages and dialects",
    "Fast transcription",
    "Good accuracy",
    "Affordable"
  ],
  "cons": [
    "Odd in-app advice",
    "No collaboration tools"
  ],
  "article": [
    "A relative newcomer to the transcription gig, Ebby is an Israel-based business that first appeared in 2018.",
    "Instead of overly-elaborate feature tiers and payment options, Ebby has gone with a one-size-fits-all approach to transcription, offering a single service at a standard pay-per-hour fee.",
    "We’re all for simplicity, but does Ebby offer the service that is simple enough for the majority of users to find it delivers the transcription they need?",
    "The pricing model for Ebby is straightforward to follow, as it is a flat fee of $6 per hour of audio, and there is no monthly subscription or commitment whatsoever.",
    "Your account is credited with transcription time when you need it, and it never expires, making it ideal for occasional users who don’t need this facility every day, week, or month.",
    "And, for those wanting to test it out, you get two free transcriptions where the first two minutes of any audio is converted for you to check.",
    "If only all transcription services made their costs so transparent.",
    "Ebby is a SaaS offering where there is no necessity to download and install any software to the connecting system, allowing it to be accessed from any operating system that supports a modern browser.",
    "The web service provides a basic pipeline to process audio files and deliver transcription that starts begins with a quick checklist of things Ebby would like to know. These include stating if the recording is free of background noise, the speakers are close to the microphone, the recording includes cross-talking and if the speakers have clear accents.",
    "With those boxes ticked, or unticked, the file can be uploaded directly from the computer or sourced from within Google Drive or Dropbox.",
    "It would be nice to see other online storage services supported, but at this time, those are the ones that Ebby supports.",
    "Once Ebby has the file a language must be selected as the one the audio is spoken in. This choice has some oddness that we’ll talk about later, but choosing the wrong language will undoubtedly impact on the attempt to transcribe what is being said.",
    "Transcribing is relatively fast by the standards of these services. Our first 2-minute test file was processed in less than 90 seconds, making it one of the quickest we’ve tested.",
    "Once it is transcribed it can be opened in the Ebby online editor where you can assess how well it did, review the audio for sections you’re unsure about and make any alterations.",
    "The final stage of the process is that you can export the transcription in Word (.docx), .pdf, .txt, HTML (.html) and beta options are available for subtitles that include .vtt and .srt.",
    "And, when you export, the option to include timestamps is available.",
    "The only other feature of note is that worlds can be colour marked based on the percentage of confidence that Ebby has in their transcription. This feature could be useful in focusing an editor on those parts of the transcription that they should check first.",
    "Given the vagaries of human speech, Ebby does a very respectable job of transcribing language, or at least the ones we tried.",
    "However, one rather curious thing happened when we went to process our first test file and we selected English (United Kingdom) as the language.",
    "An alert symbol appeared on the settings panel and informed us that we should choose a ‘non US dialect only for speaker(s) with extreme accent’. As, according to Ebby, usually English US will provide a better and more accurate transcription.",
    "We took its advice, transcribed and the results weren’t good. Switching to the correct language option and re-transcribing produced significantly better results, and the speaker in our test didn’t have an ‘extreme accent’ or anything approaching one.",
    "We’re unsure why the service is handing out such poor advice, but when we selected the correct language, it managed better than 90% accuracy on our tests, making it one of the more successful transcription tools.",
    "We can only vouch for English, but the accuracy of the system is good enough for us to recommend it for those that want to convert audio into text and not end up with a mountain of editing fixes to make the output useable.",
    "Ebby isn’t the absolute best transcription we’ve seen, but it's dramatically better than many expensive services and the results appear to be consistent. It’s also quick at processing the audio, emailing the user back when the file is ready to be reviewed.",
    "Ignoring the weird advice that it gave us about using English US as a default for all English transcription, the service is easily worth the relatively low cost of using it.",
    "Some business users will be irked that you can’t bulk purchase transcription time or have unlimited tier options, but for occasional users, the pricing is ideal.",
    "At just 10 cents a minute of recording, Ebby is one of the cheapest online transcription services around.",
    "The only weaknesses we’ve noticed is that the web interface isn’t constructed to handle numerous files, as it has no folder structure to organise them once you’ve got more than would neatly fit on a web page.",
    "There also isn’t any consideration of co-worker scenarios where one person loads the audio on the system and clicks ‘transcribe’, and another reviews the output and fixes any glaring errors.",
    "The developers need to consider how Ebby might work in a business workflow and incorporate some collaboration features and linked accounts.",
    "But for now, what Ebby does is sufficient for many people who need fast, accurate transcription and don’t want to pay a subscription for sporadic use."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Design",
    "17": "Accuracy",
    "23": "Final verdict"
  },
  "links": {}
}