{
  "source": "https://www.techradar.com/reviews/ally-invest",
  "title": "Ally Invest review",
  "category": "computing",
  "updated": "2020-03-12T17:50:11.823Z",
  "author": "jitendra-soni",
  "summary": "Full service investment platform",
  "verdict": "Best suited for people looking at no frills account offering wide variety of services",
  "pros": [
    "Wide variety of investment options",
    "Strong Forex platform",
    "Cash-Enhanced Managed Portfolios",
    "24/7 customer support by phone and live chat"
  ],
  "cons": [
    "Purely an online broker with no physical locations",
    "No demo account"
  ],
  "article": [
    "Ally Financial is a leading U.S digital financial services company, and is also ranked 19th among the largest banks in the United States. Ally Invest is their investment trading arm, though the name is considerably new in the stockbroker space. In 2016, a service called TradeKing was bought over by the parent company and was rebranded as Ally Invest. Ever since then, new features and benefits have been added to it along with the rebranding, turning it into a professional and reliable investment services platform.",
    "Since Ally Invest is a full-service firm, it provides diverse options to meet the requirements of investors and industry standards.",
    "Among the key products that it offers are:",
    "It also offers managed investments (robo-advice) through a service called Ally Invest Managed Portfolios. Going with the trend in the industry, Ally Invest has removed commissions from most of the U.S exchange-listed stock, options and ETF trades.",
    "Ally Invest comes with a browser-based trading platform and does not require you to download any application. This works best for users who work from different locations. Both bank and brokerage can be operated using a single cloud-based application.",
    "Ally also offers apps to trade via mobile devices. These apps are known as Ally Mobile or Ally Forex. These apps are custom mobile trading platform and are available for both Android and iOS. The apps offer similar features compared to the web-based platform.",
    "While these apps offer most of the functionalities, they are not the among the best available in the business.",
    "Ally Invest provides a range of different tools to help traders, such as:",
    "As of now Ally Invest only allows users from the United States to sign up on the platform While the required minimum deposit to open an account at Ally Invest is $0, minimum deposit for various accounts can be found below:",
    "Ally Invest doesn't charge for trading in stocks and ETFs. For Options Trading, they have the tiered commission plans which can be availed at a slightly lesser fee based on the volume.",
    "Signing up for an Ally Invest Account is easy - just go to their homepage and click Open Account. The process of signup requires that a user makes a decision on what type of account they need. The system takes you through an automated process once you decide.",
    "The different account types that are offered include:",
    "Accounts can be funded via check, ACH or wire transfer. Ally Invest doesn’t charge for funding an account and doesn’t offer an option of funding through wallets, credit cards or debit cards. ACH withdrawals are free but wire transfers are chargeable at $30.",
    "Talking about trading charges, while online stock options and ETF trades are available at zero commission, Options Trades are available at $0.50 per contract. The $9.95 mutual fund trades from Ally Invest are lower when compared to any other full-service brokerage. Because of its charges, Ally Invest is not a ideal for penny stock trading.",
    "One of the highlights is that Ally Invest provides 24/7 customer support via a telephone helpline, email or live chat.",
    "Since Ally Invest is a full-service online brokerage platform, you can use it as a regular trading platform or even use it’s Enhanced Managed Portfolio to manage your funds.",
    "A wide range of services and zero fees makes Ally Invest one of the better platforms to trade on. However, negatives include that it only allows trading in US markets, and the lack of physical offices might put some users off."
  ],
  "headers": {
    "1": "What to expect from Ally Invest?",
    "4": "Mobile platform",
    "7": "Tools",
    "8": "Accounts",
    "14": "Support",
    "15": "Final verdict"
  },
  "links": {
    "Ally Invest": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1018384029116046700/https://www.ally.com/invest/"
  }
}