{
  "source": "https://www.techradar.com/reviews/viewsonic-vp3881-monitor",
  "title": "Viewsonic VP3881 monitor review",
  "category": "computing",
  "updated": "2020-09-22T08:46:36Z",
  "author": "jeremy-laird",
  "summary": "It's all about productivity",
  "verdict": "Viewsonic’s superwide 38-inch monitor is an excellent productivity workhorse, but lacks some capabilities that content creators will demand at this price point",
  "pros": [
    "Huge 38-inch panel",
    "Fantastic for multitasking",
    "USB-C with charging support"
  ],
  "cons": [
    "Not a true HDR panel",
    "Very expensive",
    "Relatively low pixel density"
  ],
  "article": [
    "Once upon a time, maximum productivity equaled multiple business monitors. But not in this age of superwide screens. Enter the Viewsonic VP3881. With a 38-inch curved panel and 3,840-by-1,600 pixel native resolution, this superwide monitor is very much a realistic alternative to dual displays.",
    "You’ll pay more for the convenience, a lot more, though. This is roughly a $1,000 / £1,000 display. That makes for a tricky value proposition, even if it does pack some very useful extras, including USB-C with charging support.",
    "What you don’t get is anything by way of snazzy HDR or high refresh capabilities. This is essentially an SDR display out of the 60Hz old school. Yes, it does support HDR10 decoding. But with a peak brightness of just 300cd/m2 and no local dimming, it can’t render a true HDR image.",
    "That’s not a problem for a panel squarely aimed at maximizing productivity. Potentially more problematic is the Viewsonic VP3881’s lack of wide gamut support. We’ll come to the details momentarily, but it raises questions over this display’s suitability for really demanding content creation workflows.",
    "Of course, this isn’t the first 38-inch superwide monitor on the market. But it is one of if not the most unambiguously productivity orientated models yet launched into this class. So, the question is whether this format makes sense for getting serious work done? Or is it better suited for multimedia fun?",
    "38-inch superwide monitors have been on the market for several years. The original, LG’s 38UC99, launched back in late 2016. Four years later, there’s little sign of this class of monitor getting any cheaper.",
    "The Viewsonic VP3881 is priced around $999 / £1,100, which is pretty serious money, but very much in line with comparable displays. It feels particularly pricey given you don’t get true HDR capability or high refresh.",
    "However, the only 38-inch superwide monitor to currently offer those features is the LG UltraGear 38GL950G, which commands a huge premium of around 80 per cent over this already pricey Viewsonic panel. Put simply, this class of screen is costly.",
    "The Viewsonic VP3881’s basic form factor is familiar enough. It sports the same 38-inch diagonal, 3,840 by 1,600 resolution and 2300R curvature as pretty much every other monitor from this category. That’s because, as far as we are aware, all of these 38-inch superwide monitors use LG-sourced LCD panels.",
    "The VP3881 likely has the same LG-made IPS panel as the original LG 38UC99. That explains what is essentially an SDR feature set. Strictly speaking, it supports HDR10 and so will process an HDR signal. However, with a peak brightness of 300cd/m2, contrast of 1,000:1 and no local dimming, this is not a screen capable of HDR visuals. The refresh rate of 60Hz and absence of adaptive sync also positions it as a straightforward productivity machine, rather than a gaming monitor with any pretensions.",
    "That won’t be an issue for most productivity workflows. What could present a problem is the VP3881’s relatively modest color space support. Viewsonic says it’s good for 79% of DCI-P3 and offers 76% coverage of Adobe RGB. That’s not terrible. But it’s less than you might expect at this price point and limits utility from a content creation perspective such as graphic design or video editing. Again, it’s likely a consequence of what is a somewhat elderly IPS panel sourced from LG.",
    "On the other hand, the Viewsonic VP3881 does come calibrated with a factory report and claimed Delta Es below two across the board, not to mention 10-bit color support (8-bit native plus dithering) and a 14-bit LUT. So, the overall image precision and fidelity picture is a little mixed.",
    "Minutiae of color rendering aside, the VP3881’s most compelling feature is probably connectivity. Along with a DisplayPort 1.4 socket and a pair of HDMI 2.0 ports, there’s also USB-C with 60W of charging support. That means you can drive the display, charge your laptop and connect peripherals with a single cable. For laptop users, that’s incredibly useful.",
    "The rest of the Viewsonic VP3881’s design and feature elements are somewhat mixed. On the plus side, the stand feels very stable and robust and offers height, swivel and tilt adjustment. However, the external power brick won’t be entirely welcome, especially to those hoping to achieve and clean and uncluttered an installation as possible thanks to the USB-C connectivity.",
    "The OSD is likely a tale of pluses and minuses. For the most part it’s pretty comprehensive, with full color controls and even extending to options that productivity-focused users will probably see as superfluous, such as input lag and response adjustments. However, the color space presets leave off some pretty important options, including DCI-P3 and Adobe RGB. And the five-button control interface can be pretty baffling compared to the joystick controls from competing brands.",
    "A slightly old school IPS experience pretty much sums up the Viewsonic VP3881’s image quality. Pluses include great viewing angles and a natural, nicely calibrated feel to the colors.",
    "We happened to have an LG 38UC99 to hand and the Viewsonic VP3881 subjectively pips it for contrast and also suffers from less obvious IPS glow. On paper the displays are essentially the equivalent and likely use the same LG-sourced panel. But perhaps the intervening years have allowed for a few refinements that don’t show up in the spec sheets.",
    "Anyway, the Viewsonic VP3881 remains a resolutely SDR monitor despite the HDR10 support. It’s bright enough from a pure productivity perspective, but conspicuously lacks the punch and power of anything with true HDR capability. It still looks great out of the box, however, and the factory calibration and inherent panel quality means that it performs well in all our test images. Gradients are smooth and there’s no evidence of compression in black or white scales.",
    "Of course, with the relatively limited coverage of several key color gamuts, including DCi-P3 and Adobe RGB, the VP3881 will be somewhat compromised for content creation specialists. However, the size and scale of the panel with its 3,840 by 1,600 pixels ensures it’s a hugely useful tool for general workflows. Just be aware that with the 38-inch screen diagonal, this is certainly not a high DPI display. With a DPI of around 110, it has nowhere near the pixel density to be included in that class.",
    "Ultimately, what the VP3881 mostly has going for it is that 38-inch scale and the wrap-around curvature. On HDTVs, curved panels were largely a gimmick. Which is why they eventually fell out of fashion. For a monitor where the user is much more likely to be sitting dead center in front of the display and at something close to the optimal distance, it’s different.",
    "Not everyone ‘gets’ curved monitors. But for those who do, this 38-inch class works particularly well. It really is a lovely thing for viewing and managing documents or for multitasking with a browser window, document window and some other app running in parallel and all viewable on a single panel.",
    "For the record, the Viewsonic VP3881 includes integrated stereo speakers which will get you by in a pinch. But they lack both volume and dynamic range, which is a pity, again because of the promise of single-cable connectivity. If you want even half-decent sound, you’ll need to use dedicated speakers.",
    "Viewsonic’s VP3881 feels surprisingly old school despite its huge 38-inch curved LCD panel. That’s largely because the image quality is a little old school. The on-paper HDR10 support doesn’t translate into anything approaching an HDR viewing experience.",
    "However, if it’s a serious SDR workhorse you seek, the VP3881 is certainly worth a look. It’s nicely calibrated from the factory. There’s loads of desktop space for multi-tasking. And the single-cable USB-C connectivity is a very nice feature, too. Of course, it’s no less than you would expect given the price point. And some users will question the long term value of paying quite so much for a monitor that lacks true HDR capability here at the present time."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Design and features",
    "15": "Performance",
    "22": "Verdict"
  },
  "links": {
    "business monitors": "https://www.techradar.com/news/best-business-monitor",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "LG’s 38UC99": "https://www.techradar.com/news/computing-components/lg-offering-up-huge-21-9-curve-gaming-monitor-1327357",
    "LG UltraGear 38GL950G": "https://www.techradar.com/news/lg-claims-its-ultra-fast-lg-ultragear-monitor-is-a-gamers-dream-come-true",
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor",
    "graphic design": "https://www.techradar.com/best/best-graphic-design-software",
    "video editing": "https://www.techradar.com/best/free-video-editing-software",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "managing documents": "https://www.techradar.com/best/best-document-editing-management-software"
  }
}