{
  "source": "https://www.techradar.com/reviews/expensepath-expense-tracker",
  "title": "ExpensePath expense tracker review",
  "category": "computing",
  "updated": "2021-02-17T17:13:21Z",
  "author": "rob-clymo",
  "summary": "Tracking company expenditure with ExpensePath is quick and simple",
  "verdict": "Small business owners will enjoy the competitive price tag and user-friendly interface backed up by solid app functionality for employees to use.",
  "pros": [
    "Simple to use",
    "Keenly priced",
    "Plenty of admin options"
  ],
  "cons": [
    "Receipt capture weak",
    "Quite labour intensive"
  ],
  "article": [
    "ExpensePath is an expense reporting tool that is suitably lean and affordable so that it’ll appeal primarily to small businesses, especially during coronavirus. Perhaps the best thing about this software as a service product is its flexibility, with pricing that will suit smaller ventures that don't need all of the trimmings that some other rivals provide at a higher price.",
    "With a strong presence on the app front ExpensePath is also tailored to suit employees looking to get on top of expenses while they're out and about, with a learning curve that won't put them off either. In fact, ExpensePath has lots to offer employees and office administrators alike, thanks to its simple-but-effective arsenal of features and functions, designed to basically get the job done in no-frills fashion. Similar products include QuickBooks, Expensify, Hurdlr and Zoho Expense.",
    "ExpensePath appeals largely because of its pricing plans, which are highly competitive and there’s a strong start with a trial period too. You can request a demo, which can be quickly set up so you can peruse what’s on offer. As for spending money then pricing is based around the number of users you have and the amount of reports generated.",
    "It’s the lesser of the two and the system can dynamically adjust this based on expense reports that are produced moving forwards. This effectively means that pricing is very keen, with overheads starting out at around $5 per month. Overall, the Expense Path pricing seems pretty fair in that you’re only really paying for what gets used.",
    "While ExpensePath doesn't come with lots of tools that you might not ever need, the slimmed down and highly intuitive feature set works a treat for the smaller business owner. ExpensePath does a great job of letting office administrators set up expense criteria, which employees can then follow when they’re out in the field.",
    "ExpensePath also has the capability to work with other business tools, including the likes of SageIntacct, NetSuite, Netchex, Quickbooks and more besides. For small business users who spend much of their time in something like Quickbooks, the integration possibilities are very useful for pulling different batches of data together.",
    "The software as a service also ties in easily with Mastercard, Visa and American Express too, so there’s plenty of ways to join up the dots of your business activities.",
    "With its pretty basic interface and user-friendly persona ExpensePath doesn't have too much baggage to cause performance issues. While the desktop administration aspect seems largely faultless, there are some minor obstacles on the performance front via the app.",
    "You’ll need to input more details manually than you might have been expecting, even though the system does let you capture images of receipts like so many others in the expense software marketplace. The lack of OCR capability mean that some aspects of the expense filing process are rather more labored. But, smaller companies that need to process relatively minimal expense claims shouldn’t find this too offputting for their employees.",
    "Getting to grips with ExpensePath is certainly easy with a neat and tidy interface that provides novice users with little in the way of obstacles. Office-based users, or indeed those on laptops can dip into the web dashboard, which delivers a quality experience thanks to no-nonsense menus that cover all of the main expense topics, along with options for producing those all-important reports.",
    "Administrators can have a field day with the configuration tools inside here. Employees should also revel in the app, a version of which is available for both iOS and Android.",
    "This has been very nicely put together and works without fuss. Just what you want so that employees don't let their expense tracking duties slip over time. Usefully, they can get receipts and the associated information into the system from wherever they may be, which means receipts get filed in a timely fashion.",
    "Despite the fact that ExpensePath doesn’t deliver too much in the way of a steep learning curve, the support options within your chosen package might prove useful. You get the usual phone and email options, plus a knowledge base to pick through if there’s an outstanding query you’re looking to solve on your own. ExpensePath gets off to a strong start too, with a guided demo being the first thing you experience from the support team, plus help with getting up and running during the initial stages.",
    "ExpensePath keeps things simple on all fronts. If you're a small business owner that needs to keep a tight reign on overheads then this is a package worth exploring. The pricing comes across as very reasonable, given that you only really pay for what you use. The boffins have also done a very good job with the design of ExpensePath with a desktop dashboard that offers up plenty of tools for office administrators.",
    "Similarly, the app has been improved to make expense reporting on the go even more easy than before. There are one or two rough edges, such as the lack of OCR for speedier expense filing. However, the trade-off is that ExpensePath remains very affordable, and will probably offer many SMBs almost everything they need to keep track of costs."
  ],
  "headers": {
    "2": "Pricing",
    "4": "Features",
    "7": "Performance",
    "9": "Ease of use",
    "12": "Support",
    "13": "Final verdict"
  },
  "links": {
    "ExpensePath": "https://www.expensepath.com",
    "expense reporting": "https://www.techradar.com/best/best-expense-trackers",
    "small businesses": "https://www.techradar.com/best/accounting-software-small-business",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks-pro",
    "Expensify": "https://www.techradar.com/reviews/expensify-budget-manager",
    "Hurdlr": "https://www.techradar.com/reviews/hurdlr-expense-tracker",
    "Zoho Expense": "https://www.techradar.com/reviews/zoho-expense-budget-manager",
    "pricing plans": "https://www.expensepath.com/DemoRequest",
    "OCR": "https://www.techradar.com/best/best-ocr-software"
  }
}