{
  "source": "https://www.techradar.com/reviews/lg-sk8-soundbar",
  "title": "LG SK8 Soundbar review",
  "category": "audio-visual",
  "updated": "2020-06-04T10:52:30Z",
  "author": "john-archer",
  "summary": "Compact design, great value, good sound",
  "verdict": "The LG SK8 sits elegantly and compactly beneath your TV, and delivers a clean, detailed and open sound. It supports loads of sources, including Chromecast, and is easy to use. Its Dolby Atmos ambitions are limited by the lack of any rear channel sound and an overly polite subwoofer, but it’s still a handy improvement over your built-in TV sound system.",
  "pros": [
    "Stylish, compact design",
    "Open, clear soundbar audio",
    "Lots of source options",
    "Good value"
  ],
  "cons": [
    "Rather ‘flat’ subwoofer sound",
    "No rear channel sound",
    "Only one HDMI input",
    "No 4K passthrough"
  ],
  "article": [
    "The LG SK8 may be getting on a bit now, but it's still a great value soundbar.",
    "Despite costing less than $400/£400, it supports Chromecast Built-in connectivity, Google Assistant control, and - even though it only boasts a 2.1 speaker configuration – decoding of the fantastic ‘object-based’ Dolby Atmos sound system.",
    "While Samsung and Sony have similar options in their lineups, the SK8 (called the SK8Y in the US and Australia) delivers a clean, detailed, open sound and it's a handy improvement over your built-in TV sound system.",
    "The SK8 system provides one of the most attractive soundbars in town - and, at less than 60mm high, it’s slim enough to fit underneath almost any TV without impinging on the screen. It doesn't hurt that it has a beautifully smooth finish and elegantly rounded corners that give it some genuine glamour ... unfortunately, however, the wireless subwoofer provided alongside the soundbar is less elegant.",
    "The sub is just a rectangular black box you’ll probably want to hide behind a sofa or under a side board. It still looks and feels well made, though. And to be honest, many of the best-sounding bass speakers aren’t exactly supermodels to look at.",
    "There are a couple of aspects of the SK8’s design that remind you of how affordable it is, though. First, the soundbar features no up-firing speakers. Second, the package includes no rear speakers. So its Dolby Atmos effect will be have to be largely created by audio processing, not by actual speakers.",
    "Overall, while the SK8’s subwoofer isn’t especially easy on the eye, the main soundbar is both petite and beautifully finished. So far, so good.",
    "The SK8’s Dolby Atmos decoding is a very unusual find for the price - even if it has to rely on audio processing rather than physical speakers to provide many of its Atmos sound channels.",
    "A sore spot, however, is that the SK8 isn’t compatible with any optional extra wireless rear channels speakers, and doesn’t support decoding of the other ‘object-based’ audio system, DTS-X. DTS:X streams are ‘downgraded’ to DTS Digital Surround.",
    "To make up for its faux-Atmos-ness, we were impressed to find the SK8 supporting Chromecast as well as Bluetooth, HDMI, optical and Wi-Fi connectivity. Chromecast Built-in support means the SK8 can play content directly from services such as Tidal, Spotify, YouTube, TuneIn, Google Play Music and Deezer. For Hi-Fi enthusiasts, various high resolution audio files can be played, too, up to 24-bit/92kHz, including FLAC, Apple Lossless, WMA and WAV.",
    "The SK8 can also listen to you as well as making its own noise as long as you connect it to a Google Assistant-compatible speaker. (Funnily enough, LG has models of its own that fit this bill in the shape of its ThinQ speaker series, but that's OK.)",
    "The SK8 ships with a small but tidy remote control, while the soundbar sports a small but legible LED to help you track which input you’ve selected and which sound format you’re playing. The display useful, in fact, it’s hard to think how the SK8 could be much easier to use.",
    "LG has even kept things simple with its sound settings: There are basic Music and Movie options, as well as an Adaptive Sound Control option that attempts to automatically adjust playback to suit whatever you’re playing - sports, dramas, movies and so on. This works pretty well for the most part, though there’s a slight sound advantage - especially in terms of consistency - to manually switching between the Movie and Music modes if you can be bothered.",
    "The SK8’s 2.1 sound system delivers 360W of power, broken down into 2 x 80W for the front left and right channels, and a whopping 200W for the subwoofer. The soundbar’s bodywork, meanwhile, is optimised for TVs above 49 inches in size, and goes especially well with LG’s own 2018 TV designs - though, you certainly don’t have to use the SK8 with an LG TV.",
    "Unfortunately, the SK8’s connections are a little limited, in that there’s only one HDMI input and no 4K HDR pass through support - so you’re limited in terms of how much external equipment you can attach to it unless you route everything through your television, and you can’t connect a 4K Blu-ray player to it and expect the HDR and 4K from that 4K Blu-ray player to pass through to your TV.",
    "Don’t forget that the SK8’s optical digital audio input doesn’t support Dolby Atmos, while the HDMI’s Audio Return Channel functionality only supports compressed Dolby Atmos rather than the lossless Dolby Atmos you can get if you feed a 4K Blu-ray player in via the HDMI input.",
    "While we love the look of the SK8’s soundbar component, we were a little worried that such a slender, elegant bit of kit would lack the raw grunt to bring action movies to life. Happily, our worries proved largely unfounded.",
    "Right away you notice how lively and open it sounds. Its mid range is packed with harshness-free detailing, and voices sound rich, warm and well rounded but also clear and defined. The SK8’s sound processing also cunningly manages to lift the voice channel up slightly so that speech sounds like it’s coming from the picture on the screen, where it should be, rather than from the speaker beneath the screen.",
    "Dialogue isn’t the only thing the SK8’s soundbar lifts, either. Its Dolby Atmos processing manages to deliver a wall of sound that has genuine height to it, as well as width. Helicopters flying over head or volcanic rocks hurtling through the air actually do sound like they’re in the sky above the main soundtrack action.",
    "You can even hear high objects crossing from left to right or right to left in front of you as they travel above the main action. All despite the soundbar having no up-firing speakers. Impressive.",
    "The sound still has plenty of room-filling directness and power despite its vertical elements, too, and you can drive it louder than you’ll probably comfortably want to without any sign of the SK8’s speakers falling prey to distortions or drop outs.",
    "The SK8’s fairly small size limits the amount of bass it can crank out. But that’s where the subwoofer comes in, underpinning the action with some credible rumbles.",
    "While the subwoofer can rumble, though, it doesn’t do so with as much liveliness as we’d like. Its tone and volume remains pretty much constant throughout a film, rather than shifting through gears like the bass channels of Atmos-capable sound systems typically do.",
    "There are limits, too, to how the SK8 handles other aspects of its Atmos capabilities. For instance, the height effects are strictly a front of house phenomenon. By which I mean they all appear before you, above the soundbar, rather than truly appearing right overhead. As a result, height channel information only has left/right transitions; there’s no sense of overhead effects passing from front to back or back to front.",
    "Actually, there’s no sense of ‘back’ sound, full stop. While the SK8’s speaker configuration and processing can create a sense of height, we never really noticed any sound effects appearing to come from behind me.",
    "The tone of the SK8’s sound changes slightly at high volumes, too, becoming a touch more terse, and finally, when there are especially aggressive height effects in an Atmos mix, the SK8’s processing starts to struggle a little, losing some of the refinement that usually characterises its audio tone.",
    "The silver lining here is that the SK8 is a pleasing music player and, while Atmos tracks can occasionally cause trouble, it handles non-Atmos movie sources very nicely and consistently - aside from not delivering any surround sound effects.",
    "Spending more than the SK8’s $499/£399/AU$699 asking price can certainly get you handy extra features such as 4K HDMI loopthrough, true up-firing Atmos speakers and at least the option of adding extra rear channel speakers.",
    "On the other hand, it’s hard to imagine how anyone who buys an SK8 feeling shortchanged by the sound quality and source flexibility it has to offer.",
    "If money’s no object, the Samsung HW-N950 is a beast of a system. It ships with rear speakers that have up-firing drivers as well as front firing drivers, while its main soundbar has side-firing and up-firing speakers. And its subwoofer is brutally, brilliantly aggressive ... of course the N950 costs $1,699/£1,499.",
    "If you can live without any Dolby Atmos decoding and want an ultra-tidy sound solution, Samsung has an extremely powerful one-box solution (as in, just a soundbar, without any subwoofer) in the shape of the Samsung HW-MS650.",
    "A more direct competitor to the SK8 is the Sony HT-ZF9, which uses a 3.1-channel speaker configuration and proprietary Dolby Atmos processing. It costs significantly more than the LG SK8 at $899/£650, but as well as its extra physical speaker channel, it carries two HDMI inputs and 4K loopthrough.",
    "Although you have to treat the LG SK8’s Dolby Atmos claims with something of a pinch of salt due to its lack of ‘real’ sound channels and a slightly reticent subwoofer, it still has plenty to offer for its money: It supports lots of sources, it looks attractive, it sounds more powerful than it looks, and it’s just as adept with music as it is with movies. An on-soundbar display and Google Assistant compatibility make it easy to use, too."
  ],
  "headers": {
    "3": "Design",
    "7": "Features",
    "16": "Performance",
    "27": "Other soundbars to speculate",
    "32": "Verdict"
  },
  "links": {
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Samsung HW-N950": "https://www.techradar.com/reviews/samsung-hw-n950-soundbar",
    "Samsung HW-MS650": "https://www.techradar.com/reviews/samsung-hw-ms650-soundbar",
    "Sony HT-ZF9": "https://www.techradar.com/reviews/sony-ht-z9f-soundbar"
  }
}