{
  "source": "https://www.techradar.com/reviews/ringcentral-glip",
  "title": "RingCentral Glip review",
  "category": "computing",
  "updated": "2020-10-19T12:45:20Z",
  "author": "john-brandon",
  "summary": "A streamlined messaging app with powerful video calling features",
  "verdict": "Glip is an unheralded collaborative messaging app that is a good match for those who might need to make video calls as much as they chat and share files. It’s sleek and streamlined for busy working professionals, but there is power under the hood as well.",
  "pros": [
    "Close ties to RingCentral Meetings for voice calls",
    "Clean and simple interface",
    "Loads of integrations"
  ],
  "cons": [
    "Video calls use a seperate app"
  ],
  "article": [
    "You’re going to like Glip, the collaborative messaging app that is a delight to use. Made by RingCentral and with the same penchant for immediate instant communication, Glip looks and functions like Slack and has the same aesthetic - effortless communication. It can’t compete with Microsoft Teams on features in any way and Slack is arguably a better choice since it is so widely known but with Glip the video and voice messaging is extremely appealing.",
    "Interestingly, all of these exceptional features and clean design don’t come at an exceptional price. Glip is mostly free, and the only reason to upgrade to the low $5 per month per user price for the premium version is if you want to add more minutes (1,000 per user).",
    "The basic version that’s free only provides 500 minutes total for all employees. That’s not bad though -- some companies might want to use the video chats constantly, but if they tend to share files, chat, and collaborate with each other in teams more than anything, it won’t matter too much.",
    "Collaborative messaging apps make your business run smoother. In an age where email has stuck around for longer than anyone expected, there is a desperate need for more real-time collaboration. Many email conversations descend quickly into a back-and-forth. One person sends an email, then the responses start flying, then the mountain of clutter overwhelms us.",
    "One of the problems with this predicament is that email is only a text and graphical form of communication. If you want to start a phone or video chat, you can copy and paste a phone number on your phone, but that is clunky at best and inefficient at worst.",
    "One of the best apps that integrates phone calls and video chats (including screen-sharing) is RingCentral Glip. At an extremely low cost, you can add 1,000 minutes of video calls per user, but otherwise the app is entirely free and runs as a desktop app, in a browser, or on mobile. It’s powerful enough to change how you work because of the easy voice and video calls.",
    "Glip is intended to look and feel streamlined. There is very little clutter, which can almost make you feel like the app doesn’t do that much at first. You can chat with people in groups or in a private chat, which is so similar to Slack it’s almost disconcerting.",
    "However, the app does reveal some serious power after you use it for a while. What looks to be a clean and white interface becomes more of a workhorse which we’ll explain below. However, the clean interface is a major benefit in the browser, the desktop app and on mobile.",
    "As mentioned, the most powerful features are related to voice and video chats, which is no surprise considering this app is made by RingCentral. You could make the argument pretty easily that, as a Slack and Microsoft Teams competitor that’s relatively unknown, Glip is meant as a lead generator for RingCentral as a company voice and video service.",
    "That sells it short, though. If you want a simple summary of how Glip is different from most messaging apps, it’s this: You can video chat quickly with anyone. (Glip also lets you talk by voice and disable video.) This is not exactly seamless once you start using the feature, although accessing a video call is quick. Essentially, initiating a video call means you switch over to RingCentral Meetings. Another point to make here is that Zoom is a partner for this, so you are really starting a Zoom call. However, Glip authenticates the person or team that is connecting quickly so there isn’t the usual back and forth about meeting codes and passwords.",
    "Beyond that, Glip has some handy extras. Creating teams is much easier in Glip than in other apps like Slack. With just a few clicks, you can start a new team that’s either temporary and meant for a new project (such as creating a website with the dev and marketing teams) or lasts for the entire time you use Glip. Ask anyone who has used Slack or other collaborative apps and you know one of the ways to be efficient is to encourage temporary groups and teams who chat for a while and make decisions, then close them down. This is similar to a pop-up meeting that might occur in person and it works wonders.",
    "Glip excels at basic communication-related functions such as setting up tasks for team members (so they know what to do) and meetings (so they know when to meet). Like Slack, there is basic file-sharing and you can connect file storage services such as Box or Google Drive. One unusual feature is that Glip supports electronic fax through RingCentral.",
    "One benefit to Glip is that you don’t have to learn anything new if you are used to Slack. Unlike Microsoft Teams which emphasizes power and extensive features, with integrations into the Microsoft ecosystem of apps, Glip is more like a sip of collaborative messaging which you can start gulping if you so desire. You can use it almost like a text messaging app on your phone and make commands from on high to your team, discuss projects, or just check-in with people during the stay-at-home lockdown we find ourselves in right now.",
    "It’s wonderful to open a new app, invite other team members, and not have to explain anything. It “just works” because the most advanced features do not clutter up the interface although they are easy to find if you start looking for them.",
    "Glip might be a lead generator for RingCentral to make voice and video calls, but it is also well-designed, easy to use, and powerful. In terms of what the intent is behind the app, it works for getting team members to communicate quickly and resolve issues. That’s mostly thanks to the clean interface and that anyone can start using it in a few minutes. Unlike Microsoft Teams or more powerful apps, you likely won’t need to do any training at all.",
    "Glip is powerful and easy to use, which makes it one of the best collaborative messaging apps. The main downside to this app is the video and voice features use another app entirely and is not built-in, but that’s only a minor complaint among many advantages."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Interface and performance",
    "8": "Features",
    "12": "The competition",
    "14": "Final verdict"
  },
  "links": {
    "Glip": "https://glip.com/",
    "collaborative messaging app": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "premium version": "https://glip.com/pricing",
    "basic version": "https://glip.com/pricing",
    "RingCentral Meetings": "https://www.techradar.com/reviews/ringcentral-video",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "electronic fax": "https://www.techradar.com/best/best-online-fax-service"
  }
}