{
  "source": "https://www.techradar.com/reviews/monvpn",
  "title": "monVPN review",
  "category": "computing",
  "updated": "2020-12-10T23:01:14Z",
  "author": "sead-fadilpasic",
  "summary": "Average performance, but plenty of other advantages",
  "verdict": "monVPN is a budget-friendly service that leaves plenty to be desired in terms of download speeds and no-logging assurances. But it does support up to 10 simultaneous connections, unblocks plenty of geo-restricted content, allows torrenting, and goes out of its way to help its customers.",
  "pros": [
    "Unblocks BBC iPlayer, Netflix",
    "Very affordable",
    "Allows 10 simultaneous connections",
    "Teamviewer support"
  ],
  "cons": [
    "Speeds could be better",
    "Lacks details on no-logging",
    "Small server network"
  ],
  "article": [
    "monVPN is a VPN service that has been around since 2010, mainly focused on its French-speaking customers. For its customers in China, however, it can also help bypass the Great Firewall, thanks to a special protocol and dedicated applications.",
    "You can purchase this provider’s services under several subscription options.",
    "The first is the monthly plan at €4.99 or $5.91 per month, followed by the quarterly (3-month) option at €13.99 or $16.56 ($5.52/month) and the annual plan at €39.99 or $47.35 ($3.95/month).",
    "There's also the biannual subscription at €59.99 or $71.03 ($2.96/month), which is very acceptable, especially considering that 10 simultaneous VPN connections are supported under one account.",
    "There’s no free trial, but a 7-day money-back guarantee should be enough for you to check if this VPN is the right fit for you. Just be careful not to spend more than 1GB of bandwidth during this time as this is another condition to meet in order to qualify for a refund.",
    "Accepted payment methods include credit/debit cards and PayPal.",
    "Although monVPN shows great dedication and effort, it still has some issues to attend to if it wants to be considered one of the best VPN solutions out there.",
    "ExpressVPN may be expensive, but it comes equipped with thousands of servers, gorgeous and feature-rich apps, support for almost any device in existence, and more.",
    "NordVPN isn’t far behind, with its cheapest plan just slightly more expensive than monVPN’s, but with far superior features nonetheless. And let’s not forget CyberGhost and Surfshark, both of which currently offer cheaper plans than monVPN.",
    "That said, monVPN supports up to 10 simultaneous connections, which is its advantage over all of the above-mentioned VPNs, except Surfshark.",
    "Being able to unblock the popular streaming channels that might not be available everywhere is a feature many users seek in their VPN of choice. monVPN is capable of unblocking BBC iPlayer, Netflix, Amazon Prime Video, Disney, Hulu, ABC, all the French channels including the tricky 6Play, the Swiss RTS, the Belgian RTLplay, and others.",
    "monVPN is a VPN service owned by Mantra Communications S.A., based in Victoria, Seychelles. It provides access to between 30-40 servers in 20 countries, including Russia, Luxembourg, Japan, Israel, and others. Some of these servers are intended specifically for countries with increased censorship. The website can be viewed in English and French language.",
    "monVPN uses dedicated servers with a RSA 4096-bit encryption and a variety of protocols, including OpenVPN, OpenVPN+XOR, OpenVPN+TOR, VMess, SSTP, and SOCKS5. There’s also a special protocol that helps customers in China bypass the Great Firewall.",
    "P2P traffic is allowed, as the provider claims it “does not block software using the Bittorrent network. You can use Bittorrent, Vuze, Utorrent etc. on servers in Canada, Luxembourg and Netherlands. P2P is blocked on all other servers. Emule is blocked on all our servers, sorry.”",
    "However, since the list of servers on the website seemed to indicate that none of them are P2P-friendly, we turned to customer support for clarification. We were told that P2P traffic is indeed allowed on the vendor’s dedicated servers.",
    "The apps come equipped with a kill switch - the safety mechanism that is activated whenever the VPN connection drops, blocking your internet access and preventing any of your sensitive information from leaking into the wrong hands.",
    "monVPN’s Privacy Policy details no information about its logging practices, so it’s impossible to know whether any of your data or activities are being recorded while using this VPN. There’s only one, vague statement: “We process only minimal user data - only as much as it is absolutely necessary to maintain our services”.",
    "monVPN has native apps for Windows, Mac, Android, Linux, and Android TV, and it can be set up manually via third-party software (like OpenVPN Connect) on iOS, Asus routers, and all other supported platforms.",
    "Its Android app has recorded 100+ installs so far and it was last updated on November 8, 2020. There have been no official ratings yet but there are three positive reviews, all giving it five stars.",
    "If you need help with anything related to the platform’s installation and use, there’s a solid FAQ/Tutorial section on the website with all the installation manuals, recommendations, error codes, and more. Additional information may be provided on monVPN’s Twitter profile and Facebook page.",
    "Customer support can be contacted directly via online chat on the website, contact form, or support ticket through the client area. Since the contact form wouldn’t work for us for some reason, we decided to hit the company with an email message, to which we got a speedy response from none other than the CEO himself.",
    "As the last resort in cases where you simply cannot solve your problem alone, you can arrange remote assistance via Teamviewer - a program that allows secure remote access to your machine in your presence and under your control. It is available on Windows, Mac, and Android.",
    "After we installed and ran the app, we decided to test its performances in terms of download speeds. The testing connection we used on this occasion measured 43Mbps.",
    "The first server we chose to test was in The Netherlands. The app got us connected in a few seconds, but unfortunately the download speeds weren’t impressive, delivering barely 5Mbps. Then we tried a server in the UK, which did better, but only but a modest margin: 9.24Mbps.",
    "Leaving the European continent, we decided to give the US West Coast a chance, and got an average but very acceptable 7.29Mbps.",
    "Hong Kong, despite the extreme distance from our location, yielded a very good 8.40Mbps.",
    "For our final test, we decided to check what the “Jump” button does, and we were amazed. It got us an awesome and highly unexpected 25Mbps on a UK server, which led us to conclude that this button selects the fastest possible serve for your location.",
    "monVPN is a solid and inexpensive VPN solution that unblocks a lot of geographically restricted streaming content, provides average speeds with some solid spikes on specific servers.",
    "It also allows torrenting, provides remote assistance, and supports an above-average number of simultaneous VPN connections.",
    "If it aims to become an industry giant such as ExpressVPN, however, it needs to address problems like the lack of details in its no-logging policy, limited server network, and download speeds."
  ],
  "headers": {
    "1": "Price",
    "6": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "12": "Privacy and encryption",
    "17": "Support",
    "22": "Speed and experience",
    "27": "Verdict"
  },
  "links": {
    "monVPN": "https://monvpn.com/en/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "Privacy Policy": "https://monvpn.com/en/privacy-policy",
    "Android app": "https://play.google.com/store/apps/details?id=com.monvpn.ovpn",
    "FAQ/Tutorial": "https://monvpn.com/en/tutorials/",
    "Twitter profile": "https://twitter.com/monVPN",
    "Facebook page": "https://www.facebook.com/MonVPNcom/",
    "contact form": "https://monvpn.com/en/contact/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1266531861697294000"
  }
}