{
  "source": "https://www.techradar.com/reviews/msi-gk50-vigor-mechanical-keyboard",
  "title": "MSI GK50 Vigor Mechanical Keyboard review",
  "category": "computing",
  "updated": "2020-05-12T17:03:11Z",
  "author": "taylor-clemons",
  "summary": "A compact and low-profile keyboard that works and plays hard",
  "verdict": "A great low-profile mechanical keyboard, but uncomfortable to use with larger hands.",
  "pros": [
    "Smooth mechanical switches",
    "Customizable RGB lighting",
    "Stylish design"
  ],
  "cons": [
    "No wrist rest",
    "Feels cramped when used for typing-heavy work",
    "Mechanical keys are on the loud side"
  ],
  "article": [
    "Low profile keyboards like the MSI GK50 Vigor are ideal for anyone who has limited desk space or wants a streamlined look for their peripherals. This is a stylish, compact keyboard that offers plenty of features and functionality despite its small size. With a brushed metal faceplate, customizable RGB lighting, and fully mechanical keys, it's built from the ground up for durability, sophistication, and efficiency.",
    "The MSI GK50 Vigor retails for $79.99 (£64.00, AU$112.00), making it one of the more affordable fully mechanical keyboards on the market. The price also puts it on the level of similar low-profile mechanical keyboards like the Corsair K70 Rapidfire which retails for $89.99 (£72.00/AU$137.00) and the Razer Ornata that sells for $64.99 (£52.00/AU$99.00).",
    "Each of the 104 keys uses a Kailh low profile mechanical switch which has smooth action and a satisfying, audible click. With a total travel distance of just 3mm per switch, this keyboard makes typing faster and easier. However, the compact size of this keyboard may pose a problem with folks who have larger hands or want to use it for typing-heavy work, especially if you have the foldable feet flipped out for an angled typing position.",
    "Typing on a flat position is marginally more comfortable for long-term work, but still feels cramped. The entire keyboard measures just 17.1 inches long and 5.6 inches wide, making it a great size for smaller desks or even slipping into a laptop or tote bag for travel. It also measures just 1.3 inches thick, which is perfect for anyone looking to give their work or gaming space a sleek, streamlined look.",
    "It's clear that the GK50 Vigor was designed primarily with gaming in mind, rather than day-to-day work. The smaller typing area combined with the lack of wrist rest puts a lot of strain on your wrists, forearms, and hands after awhile, making typing for long periods of time very uncomfortable. But if you're looking for a solid, affordable mechanical keyboard for gaming, this is a great choice. We tested the GK50 Vigor with Sayonara Wild Hearts, a frenetic and fast paced game that demands flawless performance from any keyboard.",
    "The GK50 Vigor did a wonderful job keeping up with the frantic and sometimes chaotic gameplay, quickly registering input from several keys at once without any issues. As satisfying as the mechanical switches are to use for both work and gaming, the Kailh low profile switches are on the louder side, making this keyboard more in line with keeping in a dedicated gaming space or home office as the loud clicks and taps could be distracting or downright annoying to coworkers or those you share a space with.",
    "The keyboard is also packaged with extra convex keycaps for your control and shift keys, as well as a keycap puller to quickly change them out. The convex keycaps make it easier to tap shift or control if you use them frequently in games for commands. Changing the keycaps is quick and easy, especially with the included removal tool, letting even the most inexperienced keyboard modders feel comfortable.",
    "Now, while this keyboard is very small, it’s one stylish piece of kit. The top plate of the keyboard is made of a brushed metal to give it a sleek, futuristic look. And with the MSI dragon logo etched near the arrow keys as well as on the right ALT key, you can show off your brand loyalty.",
    "The keyboard also has customizable RGB lighting that requires the use of MSI's Dragon Center app to choose per-key lighting and color effects. The lighting is bright and features vivid colors that are an absolute joy to look at either while you game and work or just show off with your gaming or workstation setup. Dragon Center is similar to Razer Synapse and other peripheral support software: you can set up multiple profiles to save custom lighting setups and hotkey configurations. You can also use it in conjunction with any other MSI hardware to sync RGB effects and quickly access hardware settings to make changes on-the-fly.",
    "However, the Dragon Center app is a bit clunky and unintuitive for those who just want to make small color changes or quick-change lighting effects. Complicated menus use technical jargon that can be confusing for the uninitiated. Fortunately, the GK50 Vigor has built-in hotkeys meant to make RGB lighting effect changes. By holding down the MSI logo ALT key, you can adjust brightness, color and effects – or even turn off lighting altogether – without the need for the Dragon Center app. There are also integrated media hotkeys for controlling volume and playback.",
    "If you're a die-hard MSI fan, the GK50 Vigor has a hotkey for accessing MSI Afterburner. This allows you to change your overclocking settings for your graphics cards as well as access your MSI motherboard BIOS without having to restart your computer. It's a nice feature to have, but if overclocking is either beyond your technical capabilities or something you're just not interested in, you won't be using the hotkey much, if at all.",
    "The GK50 Vigor is a decent compact, low profile keyboard. Its sophisticated style and vibrant RGB lighting will make it at home in a wide variety of gaming and work spaces, and the mechanical switches are rated for a 50 million click life cycle, ensuring long-lasting durability and reliability. If you're in the market for an affordable, fully mechanical keyboard, the MSI GK50 Vigor is worth buying."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Don't buy it if..."
  },
  "links": {
    "Corsair K70 Rapidfire": "https://www.techradar.com/reviews/pc-mac/peripherals/input-devices/keyboards/corsair-k70-rgb-1266570/review",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}