{
  "source": "https://www.techradar.com/reviews/vistaprint-website-builder",
  "title": "Vistaprint Website Builder review",
  "category": "computing",
  "updated": "2020-11-18T09:39:23Z",
  "author": "mike-williams",
  "summary": "The big-name printing company can help with your website, too",
  "verdict": "It's easy to use, but has very few features - for beginners and simple websites only.",
  "pros": [
    "Great editor",
    "User-friendly",
    "Comes with SSL Certificate"
  ],
  "cons": [
    "Limited ecommerce ability",
    "Base plan doesn’t include personal domain name"
  ],
  "article": [
    "Vistaprint is a popular brand best known for its custom printing products: business cards, calendars, invitations, posters, photo gifts, t-shirts and more. The company also provides some interesting digital services, including what it hopes is one of the best website builder platforms to enable anyone to quickly create their own professional website.",
    "Vistaprint is designed to help anyone build a simple website and maintains all the basics you need: a drag-and-drop editor, unlimited pages, support for all the regular content types (text, images, videos, maps, contact forms, menus, more), and responsive templates to ensure your site looks good on all device types.",
    "There's an unusual plus for anyone who already uses Vistaprint to produce other business products. The website builder can access images or logos you've previously uploaded, making it simple to coordinate the website with any other marketing materials.",
    "Vistaprint has three main plans available, all of which you must pay for. You can test any of the plans free for up to 30 days, but after that you’ll need to choose a plan and start paying either by month or by year. All plans are cheaper when purchased annually.",
    "The Get Personal plan costs $2.81 per month when you sign up for the yearly plan. It includes access to a Vistaprint subdomain, free stock images in the library, an SSL Certificate, and access to Google Analytics and Webmaster Tools. This plan works great for building a website to showcase your resume, or sharing a personal portfolio or blog.",
    "The Get Professional plan is perfect for small businesses who are looking for support with their SEO. This plan costs $10.12 per month when paid annually. It includes better tools for SEO, website activity reports, an email address, and your own domain.",
    "The Get Paid plan has a lot more features than any of the other plans and is surprisingly affordable. It costs $14.06 per month when you use the yearly subscription. This plan includes everything the other plans have but also has ecommerce capabilities.",
    "You can create an online store, add shopping carts, and there’s room for a donation area too. This plan has everything you need to sell products and services online or market your business to a wide audience. This plan allows you to add unlimited products to your website. You can change your plans at any time (downgrade or upgrade).",
    "Vistaprint's interface is clear and simple, and it's easy to compare plans and see what you're going to get. Select the most appealing option and you're prompted to hand over your contact details: name, email and physical address, and your phone number, or simply login if you already have a Vistaprint account.",
    "The Vistaprint design process starts by choosing a template. These are organized into 24 industries, many of which are further broken down into subcategories, which initially looks very impressive. You don't just get an Animals & Pet Care industry, for instance: subcategories include Boarding Kennels & Catteries, Animal Grooming, Dog Breeder, Pet Sitting & Dog Walking, Pet Supply Shop, Pet Training, and Veterinary.",
    "The editor enables building sites from pre-formatted content blocks, rather than the more common individual widgets. Select Add Content > Text, for instance, and you're offered no less than 16 layouts, including text with icons, captions, images, as quotes, in boxes, grids and more. Drag your preferred option onto the page, the editor shows where it can be placed, and when you drop it, the block takes up the full width of the page at that point.",
    "Other content blocks include headers, images, videos, a calendar, social links, a contact form, a web store and more. These cover the basics, but little more, and there's very little integration with other services. You can display a bar with links to your social media accounts, for instance, but there's no option to embed content such as a tweet or a Facebook post.",
    "This block-based approach makes it very simple to build a site. You don't have to drag in a layout widget, set a number of rows or columns, insert whatever text or images you need and set their properties manually, because the content block has everything you need built in.",
    "There are many other website builders available - Wix, Squarespace, and Webnode are just a few of the options. If you compare Vistaprint (just the website builder) with other web hosts on the market, then it’s definitely a web host for beginners. However, Vistaprint offers many more services besides web building that not many other web hosts do - you can create your own business cards, put your company’s logo on T-shirts, or personalize your website. The wide variety of marketing tools Vistaprint provides for your business makes it very different from other website builders.",
    "Vistaprint website builder is great for anyone looking to build a basic site. For anyone still in the learning stage of website building, you can easily get started without taking too much time. You can even use the free 30 day trial to help you decide if it’s the right platform for you.",
    "You might also want to check out our other web hosting buying guides:"
  ],
  "headers": {
    "3": "Plans and pricing",
    "8": "Interface",
    "10": "Features",
    "13": "The competition",
    "14": "Final thoughts"
  },
  "links": {
    "Vistaprint": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7082470928011182000/https://www.vistaprint.com/digital-marketing/websites?couponAutoload=1&GP=10%2f20%2f2020+14%3a35%3a43&GPS=5801214185&GNF=0#VistaprintBuilder",
    "best website builder": "https://www.techradar.com/news/the-best-website-builder",
    "three main plans": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9510915892743666000/https://www.vistaprint.com/digital-marketing/websites?couponAutoload=1&GP=10%2f20%2f2020+14%3a35%3a43&GPS=5801214185&GNF=0#Price",
    "Get Personal": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-5464736204659001000/https://www.vistaprint.com/digital-marketing/websites?couponAutoload=1&GP=10%2f20%2f2020+14%3a35%3a43&GPS=5801214185&GNF=0#Price",
    "Get Professional": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3241113267043070000/https://www.vistaprint.com/digital-marketing/websites?couponAutoload=1&GP=10%2f20%2f2020+14%3a35%3a43&GPS=5801214185&GNF=0#Price",
    "Get Paid": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9786891830464186000/https://www.vistaprint.com/digital-marketing/websites?couponAutoload=1&GP=10%2f20%2f2020+14%3a35%3a43&GPS=5801214185&GNF=0#Price",
    "Wix": "https://www.techradar.com/reviews/wix",
    "Squarespace": "https://www.techradar.com/reviews/squarespace",
    "Webnode": "https://www.techradar.com/reviews/webnode-website-builder"
  }
}