{
  "source": "https://www.techradar.com/reviews/wix-shoutout",
  "title": "Wix ShoutOut review",
  "category": "computing",
  "updated": "2020-08-07T06:44:34Z",
  "author": "kieron-allen",
  "summary": "Easy to use but light on features",
  "verdict": "Wix ShoutOut is easy to use, affordable, and a great tool for existing Wix users, but it doesn’t quite cut it as a standalone email marketing service.",
  "pros": [
    "Competitively priced",
    "Easy to use"
  ],
  "cons": [
    "Lacking features",
    "Aimed at Wix website owners"
  ],
  "article": [
    "Wix is best known as a user-friendly website creation platform, but it facilitates email campaigns too. Wix’s email marketing softare, Wix ShoutOut, has over 1.5 million users and, like its website builder, is also aimed at non-technical users.",
    "In our Wix ShoutOut email marketing services review, we take a deep dive into this basic business email software to see if it matches the usability and fluidity of Wix's website creation tools and can compete against the best email marketing services available.",
    "Wix ShoutOut has a free option that enables users to create three email marketing campaigns per month and send a maximum of 5,000 emails.",
    "There are three paid plans. The Basic plan costs $4.90 per month on a monthly contract and $4.35 per month on an annual subscription, while the Business Essential plan costs $12.90 per month on a rolling contract and $8.60 per month when paid annually. Finally, the Pro Unlimited plan costs $44.90 per month on a monthly contract and $32.75 per month when billed annually.",
    "The Basic plan includes five email campaigns per month and a limit of 9,500 emails. With the Business Essential plan, the limits increase to 20 campaigns per month and 50,000 emails. Meanwhile, the Pro Unlimited plan enables users to create an infinite number of campaigns with a monthly email quota of 1,000,000. This plan also includes access to a VIP support line,",
    "All paid plans include ad removal, free images, premium support, and mobile optimization.",
    "Wix ShoutOut is a basic email marketing service and is particularly light on features. It does provide an easy way to create and distribute emails, but beyond that, there is very little else.",
    "The standout feature is its email editor. Similarly to Wix’s popular website builder, ShoutOut’s email editor enables users to drag and drop elements into the body of an email, change designs with a single click, and link to existing web sites.",
    "Beyond this, there is integrated social media connectivity, pre-made email templates, a basic status tracker, mobile-responsive templates, and an email marketing guide—although this service is also publicly available.",
    "Finally, we logged out of our Wix account, typed in the URL for Wix ShoutOut into our browser and selected the Get Started for Free button. This time, we were able to access a standalone email service not connected to an existing Wix website. In our opinion, Wix ShoutOut is better understood as a component of the Wix platform and a potentially useful marketing tool for existing Wix users.",
    "To use Wix ShoutOut you need to sign up to Wix first. After signing up, we were instantly redirected to an introduction page and encouraged to start building our first website. We declined and instead persevered in our attempt to access the Wix ShoutOut dashboard.",
    "This is where things began to get confusing. There was no email marketing option on the user account homepage, so we were required to select the Help tab and search until we found a related topic. Eventually, we found a help topic with direct links to the email marketing dashboard.",
    "Unfortunately, every time we clicked the link, it just refreshed the homepage we were on and we were never redirected.",
    "We decided to create a mock website and see whether that would give us a better result. It did, but it wasn’t what we expected. After accessing the new website's standalone dashboard, we found an Email Marketing option in the left hand column, but this linked email campaigns directly to the website we had created.",
    "Wix ShoutOut’s interface is refreshingly simple. At the top of the page, there is the option to utilize one of the platform’s pre-made, well-categorized templates, an option that's also offered every time you create a new campaign.",
    "This would be a useful opportunity for businesses with little time and money to spend on marketing, but the email editor makes producing and sending custom emails very straightforward too.",
    "We found the email editor easy to use. It’s self-explanatory, a simple case of editing the existing boxes or adding elements like videos, images, or links. It’s even possible to change the style of the email with a single click.",
    "After completing the email, you are directed to step two—adding recipients—which can be done manually or by importing contacts in bulk.",
    "Finally, it's a case of publishing and sending. Wix has managed to replicate the simplicity of its website building platform into its email marketing software, and we were impressed by its usability.",
    "As Wix is primarily a website creation platform, we weren’t surprised to find a dedicated security section on its support site.",
    "Websites are a prime target for cybercriminals, so as expected, Wix employs full-time, third-party security staff to secure its services.",
    "Wix is also Payment Card Industry Data Security Standards (PCI DSS) compliant, meaning it adheres to information security standards for companies that deal with credit card processing.",
    "The platform also performs regular internal security audits.",
    "In the Wix ShoutOut interface, you can click the question mark at the bottom left of the page to be sent directly to the Wix Email Marketing support page.",
    "Otherwise, Wix has a dedicated support site covering all help topics. We were impressed by the size and complexity of this support site and every test question we could come up with had an adequate answer.",
    "Failing this, there is the option to contact a customer service agent directly and arrange a callback in a choice of languages.",
    "Although Wix ShoutOut's free option may be appealing to small business owners, MailChimp offers a free alternative that is a far better choice, offering a much wider range of features and advanced functionality.",
    "Wix ShoutOut's paid plans are very reasonably priced, but the features you receive are very limited. If you need more out of an email marketing service, VerticalResponse offers a Basic package starting at $11 per month and is packed with features including live support and access to an image library.",
    "We felt Wix ShoutOut performed badly as a standalone service, but we can see the benefit of using it alongside an existing Wix website.",
    "It's reasonably priced and simple to navigate, so for very basic email campaigns it could be useful, but for anything more comprehensive you’ll need to look elsewhere."
  ],
  "headers": {
    "2": "Plans and pricing",
    "6": "Features",
    "9": "Setup",
    "14": "Performance",
    "19": "Security",
    "23": "Support",
    "26": "The competition",
    "28": "Final verdict"
  },
  "links": {
    "email marketing softare": "https://www.techradar.com/best/best-email-marketing-software",
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools",
    "emails": "https://www.techradar.com/best/best-email-clients",
    "credit card processing": "https://www.techradar.com/best/best-credit-card-processing-service",
    "MailChimp": "https://www.techradar.com/reviews/mailchimp",
    "VerticalResponse": "https://www.techradar.com/reviews/verticalresponse"
  }
}