{
  "source": "https://www.techradar.com/reviews/sony-xperia-10-ii",
  "title": "Sony Xperia 10 II review",
  "category": "phones",
  "updated": "2020-06-18T13:59:09Z",
  "author": "jon-mundy",
  "summary": "A cheap ticket to widescreen media",
  "verdict": "The Sony Xperia 10 II offers a great media-viewing experience for around £319 / $399, courtesy of its super-wide OLED display. It doesn’t excel in any other regard, and you can get faster phones with better cameras for the money. But it’s an all-round solid option with few glaring compromises.",
  "pros": [
    "Solid, understated design",
    "Balanced, notchless 21:9 OLED display",
    "Reliable side-mounted fingerprint sensor"
  ],
  "cons": [
    "Camera sluggish and poor at low light shots",
    "Snapdragon 665 fine but not setting any speed records",
    "21:9 still a niche standard"
  ],
  "article": [
    "The Sony Xperia 10 II (pronounced Sony Xperia 10 Mark 2) offers a movie-friendly widescreen OLED display for just £319 / $399. That marks it out as something quite unique.",
    "While the 21:9 aspect ratio of this screen doesn’t lend itself perfectly to general portrait usage - or even all landscape media - it undoubtedly enhances films and games that can make use of the extra width.",
    "It’s also a phone that’s easy to wield, despite its unusual display. The combination of a slightly smaller 6-inch screen and a robust yet lightweight design mean it slips into the pocket without issue.",
    "Sony seems to value practicality over following flashy design trends, which results in touches like a reliable side-mounted fingerprint sensor, a flat notchless display, and a relatively uncluttered UI. It’s a very easy phone to use day to day.",
    "It’ll last you all through the day and through much of the next, too, if you don’t go too crazy on the media consumption. Sony has really upped its battery game since the original Sony Xperia 10, it seems.",
    "We don’t see an awful lot of Sony’s camera expertise on display, but the Xperia 10 II isn’t bad at taking snaps. Its triple camera system includes the holy trinity of wide, ultrawide and telephoto, and it’s capable of taking well-balanced shots with accurate colors.",
    "But the camera app feels oddly sluggish here, and it strolls to cope with both very bright and very dark conditions. It’s fine, but the Google Pixel 3a gets you better results for the money.",
    "You can also get better performance for the money, if that’s your priority. We were perfectly happy with the performance laid on by the Sony Xperia 10 II’s Snapdragon 665 CPU, but the fact remains it’s the kind of chip you’ll find in significantly cheaper phones.",
    "The likes of the Huawei Nova 5T and the Realme X2 sport faster silicon, so if you’re a dedicated gamer, you might want to look elsewhere.",
    "However, if you’re after a balanced, robust and affordable smartphone that pushes media legibility to the fore without sacrificing everyday usability, then the Sony Xperia 10 II is worth a second viewing.",
    "The Sony Xperia 10 II is an affordable phone with a little more poise than the Moto G family, but not quite as much punch or panache as the iPhone SE class.",
    "It’s priced accordingly at £319 (around $399 / AU$587), making it a tempting proposition to anyone looking for a little more than the absolute basics. And with a colorful OLED display, a neat design, and a balanced triple camera, it certainly lifts the smartphone essentials beyond the bare minimum.",
    "Having launched in the UK On June 15, 2020, it’s a competitive package for the budget conscious. But it finds itself up against some highly capable competition in the Google Pixel 3a and the Motorola One Zoom.",
    "There's currently no word on whether the Sony Xperia 10 II will be coming to the US or Australia.",
    "The Sony Xperia 10 II’s in-betweener pricing is perfectly reflected in its in-betweener design. It’s a neat combination of sleek glass surfaces and rugged plastic frame.",
    "While you might find yourself pining for the feel of metal, we found the effect to be rather appealing. No, it doesn’t look or feel as premium as the OnePlus 8 or the Motorola Edge, but this approach does lend the Xperia 10 II a refreshingly stealthy look, at least on our all-black test model. You can also get it in White, Mint Green, and Berry Blue, which aren’t quite so understated.",
    "That plastic frame also serves a couple of practical purposes beyond lowering the price. The matte material provides ample grip, while it also contributes to the phone’s lightness. It’s a mere slip of a thing at just 151g.",
    "Sony’s no-nonsense design language adds to this understated vibe. There are no curved edges, waterfall displays, or even screen notches present here. The Xperia 10 II resembles what you’d probably come up with if we asked you to sketch a phone in five seconds.",
    "It’s as robust as it looks, too. Our test handset survived an accidental tumble off a kitchen table onto hard vinyl flooring without so much as a dink or a scrape.",
    "Another welcome in-betweener feature (though one it shares with the premium Sony Xperia 1 II) is a side-mounted fingerprint sensor. While rivals are tripping over themselves to include in-display fingerprint sensors that largely prioritize form-over-function, Sony has quietly nailed it with this quicker and more reliable method housed underneath a chunky power button on the right-hand edge.",
    "Oh, and guess what? The Xperia 10 II has a 3.5mm headphone jack. Most people are moving to wireless headphones, but we’re still glad of the provision. Sony is pretty much the only mainstream manufacturer that doesn’t insist on a SIM-tool/paperclip to access the SIM tray, too. Again, its hatch-like solution isn’t as pretty, but it sure is convenient.",
    "You still get an IP65/IP68 dust/water resistant rating too, so the Sony Xperia 10 II will survive a dip into a 1.5m body of water for 30 minutes.",
    "The Sony Xperia 10 II sports a 6-inch OLED display, which is fairly small by modern standards. Combined with a standard FHD+ resolution, that results in a nice sharp picture. It’s far from the 4K standard of its big brother, the Sony Xperia 1 II, but (whisper it) that’s probably a little OTT anyway.",
    "That OLED tech is key to some punchy colors, with Sony’s customary icy cool tint on display in the default Standard setting. Original mode warms things up a little and dials back the colors, if you prefer a more natural look. Either way it gets bright enough in most conditions, though we did miss that extra level of brightness you get with more expensive phones, which really helps outdoors during these long summer days.",
    "It’s also a particularly tall and narrow display, courtesy of Sony’s preference for a 21:9 aspect ratio. Sony goes with this stretched-out form factor to bolster landscape media content, particularly movies.",
    "There’s increasing 21:9 support from streaming services such as Netflix and Amazon, too, so this isn’t quite the out-there feature it used to be. Of course, this is still not the normal aspect ratio (that’d be 16:9), and it can be jarring when you do encounter a piece of media that doesn’t capitalize on it. Chunky black borders are not a good look.",
    "Landscape games also tend to benefit from the super-widescreen treatment, particularly visually dense action games like CoD Mobile.",
    "Whatever the media, though, it’s refreshing to come across a media-focused phone without a notch. Sony has stashed the selfie camera above the display, which might not make the Xperia 10 II look particularly modern, but it’s worth it if you value completely unobstructed media playback - or symmetry, for that matter.",
    "All that said, 21:9 still isn’t ideal for portrait usage, no matter how prominently Sony places its 21:9 Multi-window app on the home screen. This app lets you run two apps concurrently, one on top of the other. It works quite cleanly and smoothly, but will the kind of power user that would make use of such a feature be considering a £320/$400 Sony phone? We highly doubt it.",
    "The Sony Xperia 10 II’s triple camera system is almost as balanced and symmetrical as its design. You get three ostensibly similar sensors, with none of the attention-grabbing megapixel claims of many rival efforts.",
    "That includes a 12-megapixel f/2.0 main sensor, an 8-megapixel f/2.4 telephoto, and an 8-megapixel f/2.2 ultrawide. The front-facing camera, too, is an 8-megapixel f/2.0 unit.",
    "With the rear camera array in particular, Sony wins extra brownie points for resisting the urge to include a pointless macro camera in place of a proper telephoto. We’ve spotted a few phones doing this of late (hello OnePlus 8), seemingly as a cost-cutting exercise.",
    "When it comes to the quality of the shots, there’s nothing here that makes us think the Xperia 10 II is punching above its weight like with the Pixel 3a. But there’s a general sense of competence.",
    "In bright, crisp conditions, the image quality is decent and the colors pleasingly accurate. You can see Sony’s camera expertise in simple moments like the capturing of a red letterbox against a dark green bush, where everything just looks as it should.",
    "There’s a tendency for the Xperia 10 II to drop the ball when it comes to HDR, though, with a nasty habit of overexposure and an inability to cope with bright skies. But that’s hardly uncommon in cheaper phones.",
    "While the specs appear similar on paper, there’s a slight disparity between the three rear cameras. The telephoto isn’t quite as good as the main sensor, which we saw manifest itself with some slightly noisy, grainy skies. But they’re not a million miles away in tone, and it’s better than cropping in to get your 2X zoom shots.",
    "The Telephoto sensor, tends to create a slightly different tone to the other two, though of course it’s incorporating and adapting to a much wider range of information and colors.",
    "More annoying for us was the slight wallowiness of the camera app, which particularly manifests itself in slight but noticeable shutter lag, and a less than snappy autofocus system.",
    "Another weakness is Night Mode. Put simply, it’s not particularly good, creating noisy, grainy shots that strip scenes of detail. In fact, I generally preferred the camera AI’s ‘low-light’ selection to the forced Night Mode. But it will at least add more brightness to those lost cause scenarios where there really is virtually no illumination.",
    "The front camera is pretty sharp for selfies, but again it can struggle with dynamic range. On the video front, you can shoot up to 4K video at 30fps here.",
    "The Snapdragon 665 that drives the Sony Xperia 10 II isn’t a massively impressive component within its price category. We’ve seen it in much cheaper phones like the Moto G8 Power, the Nokia 5.3 and the Realme 5.",
    "But it isn’t massively underpowered for its price either. The Google Pixel 3a runs on the Snapdragon 670, and the Motorola One Zoom packs the 675 sibling. These are three essentially similar processors.",
    "What this tells you is that - apart from older phones and outliers like the Huawei Nova 5T - you have to spend a little bit more money to get a step up in performance.",
    "And for the most part, this chip is sufficient. Slick 3D games like CoD Mobile and Grimvalor run smoothly here, defaulting to High (though not quite top) graphical settings.",
    "In general use, too, we didn’t encounter any glaring performance issues. Android 10’s menus and multitasking (with Sony’s customary light UI) flick by swiftly with no halt to the animations. Jumping into the camera isn’t the swiftest experience, but as we’ve already discussed, nothing about that app seems to be especially snappy on the Xperia 10 II.",
    "While the 4GB of RAM that’s been provided here is hardly plentiful any longer (top end Android phones sport 6GB and upwards), it’s still plenty to run everything well.",
    "A Geekbench 5 multicore score of 1347 is about equal to the Motorola One Zoom with its Snapdragon 675, though 307 for the single core is well short of that rival phone’s 478. A solid but unspectacular performer, then.",
    "The Sony Xperia 10 II follows the Xperia 1 II in sporting decent battery life. And that despite the fact that it’s a pretty modest (by modern standards) 3600mAh unit.",
    "We were frequently able to get through a day of moderate usage with plenty of room to spare. Indeed, if you’re not a heavy user, and only tend to hit around 3 or 4 hours of screen on time with little in the way of heavy media usage, this could be a two-day phone for you.",
    "Given that this is a Sony phone clearly geared toward media usage, however, that may not be how you use your phone. And media consumption does tend to level things out somewhat.",
    "Our standard battery test of a 90-minute looping 720p video with the screen brightness at full sapped 13% of a full charge. That’s the same as the Realme X2 Pro and is inferior to the TCL 10 Pro (10%). That’s perfectly reasonable, but not a media hound’s dream.",
    "There’s no wireless charging here, which you’d expect given the price. But you do get 18W fast charging out of the box.",
    "First reviewed: June 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "10": "Sony Xperia 10 II price and release date",
    "14": "Design",
    "22": "Display",
    "29": "Camera",
    "40": "Specs and performance",
    "47": "Battery life",
    "52": "Don't buy it if..."
  },
  "links": {
    "Sony Xperia 10": "https://www.techradar.com/reviews/sony-xperia-10-review",
    "Google Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Huawei Nova 5T": "https://www.techradar.com/reviews/huawei-nova-5t",
    "Realme X2": "https://www.techradar.com/reviews/realme-x2-review",
    "Moto G": "https://www.techradar.com/reviews/moto-g8-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "Motorola One Zoom": "https://www.techradar.com/reviews/motorola-one-zoom-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "CoD Mobile": "https://www.techradar.com/news/call-of-duty-modern-warfare-season-4-and-cod-mobile-season-7-have-been-postponed-indefinitely/news/call-of-duty-mobile-season-7-start-date-delay-and-new-battle-royale-map",
    "Moto G8 Power": "https://www.techradar.com/reviews/moto-g8-power",
    "Android 10’s": "https://www.techradar.com/news/android-q",
    "TCL 10 Pro": "https://www.techradar.com/reviews/tcl-10-pro-review"
  }
}