{
  "source": "https://www.techradar.com/reviews/hid-access-control-systems",
  "title": "HID Access Control Systems review",
  "category": "computing",
  "updated": "2020-10-08T18:20:59Z",
  "author": "jonas-p-demuro",
  "summary": "Powering trusted identities",
  "verdict": "HID has an attractive portfolio of class leading products, but the per device licensing fees are a stumbling block.",
  "pros": [
    "Multiple support methods",
    "Biometric security options",
    "Software based security credentials",
    "High level of data security"
  ],
  "cons": [
    "Opaque pricing",
    "Company credential requirement for sales contact",
    "Pricing by the downloaded app",
    "Local server requirement"
  ],
  "article": [
    "HID Global can trace its origins back to 1991 as Hughes Identification Devices, as a division of the Hughes Aircraft Company. While it originally focused on technology to identify radio frequencies, it soon devoted itself to access control and proximity card readers. It currently has its headquarters in Austin, Texas, with production at multiple worldwide facilities, and a design location in Chennai, India. Currently, HID products are used across the globe, in over 100 countries.",
    "HID offers a full complement of access control services. This includes mobile access solutions, real-time monitoring, scalability, and cost control functions.",
    "Typically access control systems provide security with ID cards, or more recently via mobile phone apps. However, to take security to an even higher level requires a biometric approach. As security cards can be stolen or copied, biometric is considered more secure. This is because it is based upon the user’s body, which then becomes the key for access.",
    "HID indicates that it can provide “The highest level of tamper proofing,” with “World class liveness detection, spoof prevention and proof of life.” This technology is used worldwide, from banking in Brazil, to border control in Hong Kong, and to secure medical records in the US.",
    "With biometric security, which gives a unique physical identity, along with a secure card, the individual can be successfully identified. One technology that can accomplish this ultra high level of security, that HID offers is its Lumidigm Multispectral Fingerprint Imaging. This captures the fingerprint, on both a surface, and subsurface level via multiple wavelengths, angles and orientations, and also analyzes the image to make sure that the fingerprint is acquired from living skin. This technology is so accurate is that even a patient with Epidermolysis Bullosa Dystrophica, a rare genetic disorder with multiple skin blisters, can use the Lumidigm Multispectral Fingerprint Imaging to verify their identity as the imaging can acquire the fingerprints that dwell beneath the blisters on the surface of the skin.",
    "Biometrics aside, the other part of verifying identity is based upon a secure credentials card. HID offers a next generation solution, known as Seos, that is a step ahead compared to current and legacy solutions. It starts with “Best-in-class cryptography,” that offers a higher level of security and privacy than other solutions. There is also flexibility built in, and as Seos is based in software, the credentials can be provided on a range of devices that includes cards, tags and mobile devices such as smartwatches. Seos can also be used for more than access control, including applications specifically targeted to specific markets, for example education, and hospitality uses.",
    "A downside of the HID solution is that it is run locally, and does not connect to the cloud. This means it has to be locally hosted, and therefore a local server needs to be run.",
    "HID excels at securing the data and providing a high level of privacy. Rather than going the proprietary route, it rather uses open standards, the same ones that secure electronic passports, and credits cards including Mastercard and Visa. HID touts that the advantage of using these open standards is that they continue to evolve, while proprietary algorithms tend to stagnate and be fixed. For example, the cards use a process of mutual authentication, with ‘Message integrity protection,’ that each time the card is used, it gets validated by the reader, which forms the basis for a session key.",
    "HID offers customer support via a variety of methods. We appreciate that there is an offer for toll free support, as well as different non toll free phone numbers available for different languages, which include English, Spanish and Portuguese (although for the Portuguese option it is an international call). There is also a direct email provided, which can be a good option for simplicity, and including attachments such as images.",
    "There is also a technical support customer portal, for submitting directly to the company.",
    "Additional support materials are provided, with downloads of product manuals, drivers and related files. There is also a Knowledge Base of commonly asked questions that is of use to newbies.",
    "HID, as many of its access control brethren do, is not forthcoming at all of the costs involved for a system. There are no prices on any components, whether for just the hardware, or installed.",
    "Needless to say, we would much prefer to have some pricing transparency available on the company’s website.",
    "Rather, the closest we can get is an offer that if we provide our contact credentials, including an email and telephone number, that someone will be in touch.",
    "This may not be by accident, as some companies are priced by the number of doors, and the server software for a maximum number of users. However, annoyingly, HID bases pricing on each downloaded key, with a charge for each and every one. Even more bothersome, is that for HID Mobile, where each user downloads an app to their mobile phone, when the user upgrades the device, another app will need to be downloaded, with an additional charge each and every time. This is pretty janky, and also not cost effective, so we don’t encourage this type of pricing model.",
    "HID offers an expansive catalog of access control devices and software. We like the flexible credential devices including smartwatches, the level of security encryption that can match an electronic passport, and the use of open security standards that evolve and get updated. However, it is hard to get past the opaque pricing structure with licensing by the device and not for a predetermined number of users, and the requirement of running a local server, which can be a downside, particularly for smaller organizations."
  ],
  "headers": {
    "1": "Features",
    "8": "Support",
    "11": "Pricing",
    "15": "Final verdict"
  },
  "links": {
    "HID Global": "https://www.hidglobal.com/solutions/access-control-systems",
    "access control": "https://www.techradar.com/news/best-access-control-systems",
    "Knowledge Base": "https://www.hidglobal.com/support/hid-knowledge-base"
  }
}