{
  "source": "https://www.techradar.com/reviews/huawei-p30-pro",
  "title": "Huawei P30 Pro review",
  "category": "phones",
  "updated": "2020-10-21T16:35:37Z",
  "author": "john-mccann",
  "summary": "Rewriting the rules for smartphone photography",
  "verdict": "The P30 Pro not only sets a new standard for Huawei, it sets a new standard for the entire mobile industry. Its four rear cameras are quite simply astonishing, the design is eye-catching and the power plentiful. It’s a true flagship smartphone.",
  "pros": [
    "Fantastic cameras",
    "Eye-catching design",
    "Plenty of power available"
  ],
  "cons": [
    "EMUI still lacks class",
    "Display 'only' Full HD",
    "Design offers little grip"
  ],
  "article": [
    "Update: After Google suspended Huawei's future access to Android Play Store and security updates, there are serious question marks over the future of Huawei and Honor phones.",
    "While Google and Huawei have promised to support phones currently on the market, it's not clear how long they'll receive Android updates or access to the Google Play Store, which would severely curtail their usefulness compared to the competition.",
    "The P30 Pro is a statement from Huawei, with the Chinese smartphone manufacturer declaring that its new flagship will \"rewrite the rules of photography\".",
    "It aims to do that with its quad camera system which offers a 5x optical zoom, 10x hybrid zoom and huge 50x digital zoom, along with bold claims for low-light performance.",
    "Elsewhere the P30 Pro packs in the features you'd expect from a modern flagship phone including a premium design, in-display fingerprint scanner, wireless charging, plenty of power under the hood, a big screen and a decent-sized battery.",
    "Huawei has gone from strength to strength in recent years, and the P30 Pro is its most accomplished smartphone to date.",
    "The Huawei P30 Pro price started at £899 or AU$1,599 (around $1,140), making it one of the most expensive handsets on the market, matching the price of the Samsung Galaxy S10 Plus, but it was cheaper than the iPhone XS Max. In the UK the 512GB Amber Sunrise P30 Pro cost £1,099 (around AU$2,000, $1,400).",
    "Now the Huawei P40 Pro is official, we've seen the price of this handset drop to around £600 / AU$899. We'd expect to see that price drop lower as time goes on, and it's likely we'll see some deals for the handset around Black Friday and Cyber Monday.",
    "As well as Amber Sunrise - aka an orange/red - (exclusive to the 512GB model), the 128GB P30 Pro is available in Breathing Crystal (our light blue/purple review unit), Aurora (a darker blue/purple finish) and Black. In Australia you only get the choice of Breathing Crystal and Aurora, with no 512GB version.",
    "The Huawei P30 Pro is widely available from major carriers and retailers in the UK and Australia, while those in the US will find it difficult to get hold of as the firm’s handsets aren’t officially stocked in the country.",
    "The Huawei P30 Pro design has been developed and refined over the handset it’s replacing, the Huawei P20 Pro.",
    "Huawei has stripped back the bezels above and below the screen to the bare minimum, reducing the size of the notch at the top of the display to just what’s required to house the front camera, while at the bottom the fingerprint scanner is embedded in the display, allowing the screen to extend further to the base of the handset.",
    "Setting up fingerprints on the scanner is a little time-consuming, with a number of scans required for each digit you register – we’d recommend both thumbs and forefingers for ease of use. Once set up though, the scanner works with great accuracy and speed.",
    "There’s not much in it, but it felt like the P30 Pro’s scanner was a beat quicker than the one in the Galaxy S10 Plus.",
    "The screen, and the protective Gorilla Glass glass covering it, are now curved, allowing for a slimmer-feeling profile in the hand, and a look which is very similar to that of the Samsung Galaxy S10 Plus.",
    "The overall aesthetic is one of premium styling, and as well as looking good it feels classy in the hand.",
    "The Huawei P30 Pro measures 158 x 73.4 x 8.4mm, making it thicker than both the Galaxy S10 Plus and iPhone XS Max, but it feels thinner and narrower than you might expect thanks to the curved edges of the screen and the curved rear glass.",
    "It’s still a large and tall device though (it tips the scales at 192g), and those with smaller hands will struggle to use the P30 Pro one-handed. Even those with larger hands will find it a little tricky to handle, as the all-glass finish provides little in the way of grip.",
    "Huawei appears to be aware of this, sort of, as in some markets it provides a translucent silicone case in the box with the phone, providing some much-needed grip and light protection while not spoiling the design. However, those in the UK won't get this in the box.",
    "Our review unit came in Breathing Crystal, which sees the rear boast a pink/green/blue pearlescent finish which changes with the light. It’s an eye-catching look which was well received by everyone we showed the phone off to.",
    "The case also offers another benefit: it prevents the rear of the P30 Pro getting covered in fingerprints, for which it’s something of a magnet.",
    "There's no headphone jack on the Huawei P30 Pro, which means you’ll either have to get a USB-C to 3.5mm adapter, use a set of headphones with a USB-C connection (a pair of USB-C buds is included in the box) or plump for a wireless set of headphones to listen to audio privately, such as the new Huawei FreeLace which launched at the same time as the P30 Pro.",
    "On the base of the P30 Pro a central USB-C port is flanked by a speaker on one side and the SIM tray on the other. The SIM tray can hold two nanoSIM cards, providing dual-SIM capabilities, but you can opt to use the second slot to expand the storage on the handset instead.",
    "The Huawei P30 Pro takes nanoSD cards – this is a new expandable memory format, pioneered by Huawei, which uses cards that are smaller than microSD cards. The cards aren’t readily available, and they are pricey, but Huawei hopes the new format will catch on in the coming years.",
    "On the right side of the phone are the power and volume keys, which fall nicely under thumb or finger, although volume up can be a little bit of a stretch.",
    "Finally, the Huawei P30 Pro comes with an IP68 rating, meaning it’s dust- and water-resistant, and able to withstand being submerged for up to 30 minutes in fresh water.",
    "The Huawei P30 Pro packs a sizable 6.47-inch OLED display with a 1080 x 2340 resolution, 19.5:9 aspect ratio and 398ppi pixel density.",
    "It produces bright, clear and colorful imagery and text, which makes for an enjoyable viewing experience, although it isn’t the best display on the market.",
    "Many of its flagship rivals have higher-resolution displays, with Samsung, HTC and LG all equipping their top-tier phones with QHD panels, while the Sony Xperia 1 goes a step further with a 4K display.",
    "Even the iPhone XS Max has a higher-resolution screen (1242 x 2688, 458ppi) than the P30 Pro – and Apple has famously not followed the pixel push of its Android rivals over the years.",
    "It’s worth noting, though, that phones such as the new Galaxy S10 and S10 Plus have their displays set to Full HD+ as default when you’re not viewing higher-resolution content, so for the most part the P30 Pro isn’t at much of a disadvantage.",
    "If you do opt to watch a 4K video, or play a graphically intensive game on the highest settings, the quality on the Huawei P30 Pro won’t quite match other handsets; however, it still looks fantastic, and only the highly critical will notice any issue.",
    "We quickly forgot about the notch at the top of the display, as its small size means it fades nicely into the notification bar. There will be some who just don’t like the way it looks, but we didn’t find it intrusive during our time with the P30 Pro."
  ],
  "headers": {
    "6": "Huawei P30 Pro price and availability",
    "10": "Design",
    "26": "Display"
  },
  "links": {
    "Google suspended Huawei's future access to Android Play Store": "https://www.techradar.com/news/huawei-ban",
    "Samsung Galaxy S10 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s10-plus",
    "iPhone XS Max": "https://www.techradar.com/reviews/iphone-xs-max-review",
    "Huawei P40 Pro": "https://www.techradar.com/reviews/huawei-p40-pro-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Huawei P20 Pro": "https://www.techradar.com/reviews/huawei-p20-pro-review",
    "Huawei FreeLace": "https://www.techradar.com/reviews/huawei-freelace",
    "Sony Xperia 1": "https://www.techradar.com/reviews/sony-xperia-1-review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10"
  }
}