{
  "source": "https://www.techradar.com/reviews/pc-mac/software/avira-phantom-vpn-1325506/review",
  "title": "Avira Phantom VPN review",
  "category": "computing",
  "updated": "2020-06-27T22:20:52Z",
  "author": "mike-williams",
  "summary": "A simple VPN for the novice or casual user",
  "verdict": "Avira's VPN offering is easy-to-use and a reliable performer, albeit a little overpriced for what you get.",
  "pros": [
    "Free account doesn't require registration",
    "Reasonable performance",
    "Connect as many devices as you need",
    "Unblocks US Netflix, Disney+"
  ],
  "cons": [
    "Free account limited to 500MB/ 1GB a month",
    "Can only be used with the official apps",
    "Few features",
    "Can't unblock BBC iPlayer, Amazon"
  ],
  "article": [
    "Avira Phantom VPN is aimed very much at the novice user. The website landing page ignores almost every technical detail, and instead focuses on generic descriptions of the benefits of a VPN: anonymity, encryption and accessing geoblocked content. But dig into the small print, and there are some details to be found.",
    "The network has a minimal 150 servers spread across 37 countries, for instance. There are multiple locations in North America and Europe, and more in Australia, Brazil, Chile, Hong Kong, India, Japan, Mexico and Singapore.",
    "There are native apps for Windows, Mac, iOS and Android, as well as a Chrome extension. That's not bad, although there's no direct support for setting up routers, smart TVs, games consoles or anything else that might require custom OpenVPN configurations.",
    "Avira Phantom VPN makes its connections using the industry-standard OpenVPN and AES-256 encryption. That's good, too, but there's another 'but': you can't tweak OpenVPN in any way (switch between UDP and TCP connections, for instance), and you can't switch to another protocol, which can sometimes be useful if you can't get connected.",
    "Avira doesn't mention P2P support at all on the website, as far as we could see. A quick check shows torrenting seems to be available on all servers, although as the company seems so unenthusiastic about it, Phantom VPN wouldn't be our preferred torrent choice.",
    "The service does have one unusual plus, with no 'buts' at all: you can connect to it with as many devices as you like. That's a notable improvement on many VPNs, which typically restrict you to 5 devices, although how many people really need to connect with more than that simultaneously is open to question.",
    "Whatever you think of Phantom VPN's features, there's a definite benefit in its free account. This has by default a crippling 500MB/month data cap (plus you get five additional free minutes after hitting the limit, before disconnection), and you're not able to choose a location - the app automatically connects to your nearest server. Still, it doesn't require registration or an email address: just download, install and connect. Register with your email address and you'll get 1GB. You still won't be able to stream anything much, but for occasional low-bandwidth use, perhaps while travelling, it might be enough.",
    "Upgrading to a paid account gets you unlimited data, a kill switch to reduce the chance of a data leak if the VPN connection drops, and technical support to keep everything running smoothly.",
    "The service is priced at $10 billed monthly, dropping to $6.50 if you pay for a year up-front, or $5.99 to cover Android and iOS devices only.",
    "Buy the service this way, and it looks expensive. Private Internet Access' annual plan 'only' covers up to 5 devices (mobile or desktop), but it's much cheaper at an effective $2.85 for the first term, $3.33 on renewal.",
    "Avira's best deal comes in the form of its Avira Prime package, a full bundle of every application and service it sells: antivirus, internet security, password management, device cleanup and more. You can buy this for $75 in year one, so cheaper than the VPN alone, rising to a still decent $100 a year after that.",
    "It's a powerful package - read our full review here - and if you're looking for a VPN and a new antivirus or security suite, getting them in a bundle like this could save you plenty of cash.",
    "Avira Phantom VPN gets off to a good start in privacy terms with its no-registration-required free account.",
    "The service does a decent job of protecting your traffic with its OpenVPN protocol support, although your inability to change or tweak these in any way (choose new ports, for instance) might be an issue for experts.",
    "Avira's free plan doesn't give you a kill switch, which means there's a small chance your identity might be given away if the VPN connection drops. That's not a problem if you upgrade, though, and the free and paid editions both give you capable DNS leak protection. We checked the desktop and mobile clients with IPLeak, DNSLeakTest and DoILeak, and found no privacy leaks of any kind.",
    "Avira has a tiny amount of no-logging detail in its privacy policy. How tiny? This is what it says:",
    "'If you use Avira Phantom VPN we do not collect any data about the web pages you visit or the services you use on the internet. The information we require for our billing system only tells us when someone was online and what data volume was utilized.'",
    "In other words, there's limited session logging (connect and disconnect times, data used), but the company doesn't record any details on exactly what you're doing online. We'd like to see this spelled out in a little more detail, but it's still good news overall.",
    "Installing Avira Phantom VPN on a PC is easy, although it does have the same issue as all other Avira software: you also get the standard Avira launcher, whether you want it or not.",
    "(There's nothing wrong with the launcher - it's a simple way to view and manage all your Avira products from one place - but if you're only using Phantom VPN, it's just not necessary.)",
    "The launcher can be safely ignored, though, and otherwise the client looks and feels much as you would expect. Launch it from a system tray icon, and click a button to connect to the nearest VPN server, or, if you have the paid version, choose your preferred option from a list. Easy.",
    "The location picker is relatively basic, with no ability to view servers within a country, and no Favorites system. Location ping times help choose the best server for you, though, and switching servers is also very simple. There's no need to close the current connection before you can start another, just choose a new location and Avira automatically reconnects for you.",
    "Avira Phantom VPN has expanded its Settings dialog since the service launched, and it now has a handful of useful options. The client can be set to launch when Windows starts, for instance, and automatically connect the VPN when you access specific networks. There's built-in blocking of malicious sites and content, a welcome touch as that's one of Avira's antivirus strengths, and the paid edition also gets a kill switch to block internet traffic if the VPN drops.",
    "Connection handling is surprisingly poor, with the client not using notifications to tell users when it connects or disconnects.",
    "When we forcibly closed the VPN, the client displayed a warning on its console, but that was all. If the VPN dropped while the client window was minimized, you'd have no clear way to tell that your traffic was now unprotected.",
    "If you're using the paid plan, you can mostly avoid this by turning on the kill switch. Once it's active, we found the client noticed when the VPN dropped, instantly blocked our internet access, and displayed an alert with options to reconnect or unblock internet traffic.",
    "Beware, though, the kill switch has one small weakness. If you select a new server while you're connected to another, the client disconnects from location #1, then begins reconnecting to #2, and traffic between the two sessions isn't protected. That's likely to be only for a second or two, maybe less, and you probably won't be switching while you're in the middle of some sensitive banking transaction, anyway. But it is vulnerability which we don't see with every VPN.",
    "Turning to Avira Phantom VPN's Android app, we noticed one welcome advantage over its Windows cousin: a 7-day free trial, a more realistic way to properly test the service than the desktop's limited data allowance.",
    "Otherwise, though, the mobile apps work much the same, though with many less features (no ping times on the location list, no malware blocking), although you can still have the app automatically protect connections on insecure wireless hotspots.",
    "Experienced users might be a little frustrated by the lack of control, but Avira's target consumer audience will probably appreciate the app's simplicity, and it's certainly easy to use.",
    "Avira doesn't make any specific claims about its unblocking abilities, so we put it to the test by checking out a number of popular sites.",
    "The results weren't bad at all. Sure, Phantom VPN failed with Amazon Prime Video and BBC iPlayer, but its US Streaming location did allow us to access US Netflix content, US YouTube and Disney+, and that's better than we see with some specialist providers.",
    "UK download speeds were a little below average at 50-55Mbps on a 75Mbps test line. Top VPNs typically manage 10-15Mbps more.",
    "Performance was always very usable, though, for example peaking at 40Mbps for UK-US connections, and even UK-Australia round trips averaged 17Mbps.",
    "We cross-checked our results by re-running the tests from a European data center, but despite a connection capable of 350Mbps, downloads peaked at 70-90Mbps.",
    "Avira Phantom VPN isn't going to break any speed records, then, but it was always acceptable, with every location we tried giving us more than enough performance for most tasks.",
    "Avira Phantom VPN's lack of features and underpowered apps will be a big issue for experts, but if you only need the VPN basics, or can live within the limits of the free plan then it might be worth a look."
  ],
  "headers": {
    "6": "Plans and pricing",
    "12": "Privacy and logging",
    "18": "Apps",
    "30": "Performance",
    "36": "Final verdict"
  },
  "links": {
    "Avira Phantom VPN": "https://www.prf.hn/click/camref:1011ldAfo/pubref:trd-us-2556291080954824000/destination:https%3A%2F%2Fwww.avira.com%2Fen%2Ffree-vpn",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "billed monthly": "https://www.prf.hn/click/camref:1011ldAfo/pubref:trd-us-4873233082232434000/destination:https%3A%2F%2Fwww.avira.com%2Fen%2Fvpn-pro",
    "Avira Prime package": "https://www.prf.hn/click/camref:1011ldAfo/pubref:trd-us-5126555904115087000/destination:https%3A%2F%2Fwww.avira.com%2Fen%2Fprime",
    "read our full review here": "https://www.techradar.com/reviews/avira-2020-antivirus-solutions#section-avira-prime",
    "privacy policy": "https://www.prf.hn/click/camref:1011ldAfo/pubref:trd-us-1339733388028336000/destination:https%3A%2F%2Fwww.avira.com%2Fen%2Fprivacy-policy%2Fproduct"
  }
}