{
  "source": "https://www.techradar.com/reviews/newsdemon",
  "title": "NewsDemon review",
  "category": "computing",
  "updated": "2020-11-25T04:23:24Z",
  "author": "desire-athow",
  "summary": "Affordable, but no more free newsreader",
  "verdict": "NewsDemon is a reseller of Newshosting and offers similar service levels. A provider that resells another service is only as good as the underlying service being resold, as long as it gets full access to the service and if the reselling service does not add limitations to the service being resold.",
  "pros": [
    "Great retention levels",
    "Free VPN with subscriptions",
    "Subscription pause feature"
  ],
  "cons": [
    "Free newsreader no longer available"
  ],
  "article": [
    "Usenet providers differ in terms of price, features, and presentation. Many skimp on presentation, offering subscribers the bare bones of a service; others claim 3000-ish days retention is enough; some charge a lot for very little.",
    "NewsDemon is a big name in Usenet provision, offering a full roster of features since the mid-2000s. Does it match the bold claim of being \"America's Premium Usenet Provider\"? UK's Premium Usenet Provider? Or Europe's Prime de Usenet Provider?",
    "With offices in the USA and UK, NewsDemon was registered in 2004. It boasts two servers, one in the USA, one in The Netherlands, and general DNS server name to automatically select the server nearest you.",
    "With the region-targeted \"Premium Usenet Provider\" tagline, NewsDemon offers a full set of Usenet features, with the addition of a VPN and a Warrant Canary.",
    "NewsDemon is curiously reluctant to boast its features. Whereas other Usenet service providers promote retention and connections, speed, and data, NewsDemon seems more interested in underlining its value and plans.",
    "Signing up to NewsDemon you can expect to enjoy over 4435 days retention, and 50 simultaneous connections. Unlimited download speed is also available.",
    "Posting is free with NewsDemon, too, so you can upload your own binaries, or even contribute to newsgroup discussions (not common in these days of Facebook groups).",
    "NewsDemon also features a free VPN service, SlickVPN. Usage of this no-logging VPN is optional, so if you're already using a VPN that you trust, you might prefer to stick with that.",
    "A detailed FAQ is available for prospective customers of NewsDemon, along with a help and support page. 24/7 customer support is available for subscribers detailed setup guides for newsreaders. A Status page is listed on the site, although this doesn't appear to have been updated since 2015. It's unlikely that the intervening years have been downtime-free.",
    "Retention is key for most Usenet users. It relates to the size of the Usenet archive served by the provider. In the case of NewsDemon, this is over 4435 days, equivalent to more than 12 years. So, you gain access to binaries uploaded to Usenet as far back as 2008.",
    "Hand in hand with retention is completion. This is the degree to which the archive of newsgroups and their constituent text and binary uploads are available. NewsDemon's archive is 99.9% complete, giving you access to a vast and almost intact collection of files.",
    "It's important to note that where there is a 0.10% shortfall it is usually down to file corruption or DMCA takedowns.",
    "Online privacy is increasingly important for Usenet subscribers. While NewsDemon bundles the Slick VPN service into its Usenet packages, its focus on security and privacy doesn't end there.",
    "SSL is an expected feature for Usenet subscribers. NewsDemon offers four SSL ports on its servers, each capable of handling 50 connections. Four NNTP and four SSL/NNTP server addresses are provided.",
    "Signup requires just an email address. Meanwhile, among the various payment options, there is the ability to pay for your subscription with Bitcoin. This keeps your access to Usenet completely under wraps.",
    "NewsDemon's privacy policy, meanwhile, is clear, if curious. It states that it \"collect[s] information when you create or update your account\" so anyone using an email address and Bitcoin should be able to remain anonymous. However, with more information comes more recording; then there is the curious \"This also includes vehicle or insurance information of drivers.\" Obviously this seems completely superfluous to any reasonable data collection for an online service.",
    "NewsDemon states that it does not sell or share subscribers' details. Further, it has a Warrant Canary system for highlighting when it has been subpoenaed into providing data to law enforcement.",
    "It may be useful to know that NewsDemon has offices in the USA and UK.",
    "Testing over a five-day period on a 55Mbps connection, NewsDemon was used to download files of all types, sizes, and retentions. Performance was overall fast, with one example, a 55-day old Ubuntu Studio ISO file of 383MB downloading at an average speed of around 2100Kbps.",
    "Searches were also fast, underlining NewsDemon's commitment to a speedy service with optimised servers.",
    "Four packages are listed by NewsDemon, aimed at different usage levels. All meet the 4435+ days retention, and have 50 connections, header compression, free headers, unlimited speed, 24/7 customer support, free posting, and Slick VPN access.",
    "The difference is in how much you expect to download. The Beginner bundle is just $3 a month (£2.58, €2.79) and has a 50GB limit while Basic is $4 (£3.43, €3.72) with a 100GB limit and Veteran maxes out at 200GB for just $5 a month (£4.29, €4.65). The most popular bundle, the Unlimited plan, is $10 a month (£7.74, €8.53) with unlimited download data as the name suggests.",
    "While the basic provision of bundles is welcome, NewsDemon does manage to complicate things with it's confusing array of six month and annual plans (available for the 50GB and Unlimited bundles). There is also the collection of nine Block plans with shorter retention limits, ranging from $3 to $70. It's good to have a Block option, but 17 different pricing options is bizarre. Further, NewsDemon claims to have 20 plans in total, but we couldn't find the other three.",
    "Giving subscribers the same overall features with a simple difference in data limits makes good sense. It's surprising more Usenet providers don't follow this strategy.",
    "In its battle against other providers, NewsDemon also offers a price matching service.",
    "Payment options cover all credit cards, PayPal, SEPA, IDEAL, and Bitcoin. NewsDemon also offers a 30-day money back guarantee if you're not satisfied.",
    "Bold claims require compelling evidence to back them up. Simply declaring to be the \"premium Usenet provider\" isn't enough. Fortunately, NewsDemon has enough quality features and a smart attitude to privacy to back up these assertions.",
    "A slick, seamless Usenet experience, NewsDemon almost certainly is the Premium Usenet Provider - wherever you are."
  ],
  "headers": {
    "4": "Features",
    "9": "Retention",
    "12": "Security and privacy",
    "18": "Performance",
    "20": "Pricing",
    "26": "Final verdict"
  },
  "links": {
    "Usenet providers": "https://www.techradar.com/best/best-usenet-providers",
    "NewsDemon": "https://www.newsdemon.com/",
    "free VPN": "https://www.techradar.com/vpn/best-free-vpn",
    "SlickVPN": "https://www.techradar.com/reviews/slickvpn",
    "privacy policy": "https://www.newsdemon.com/newsdemon-privacy-policy.php",
    "Beginner bundle": "https://www.newsdemon.com/usenet-access.php",
    "Basic": "https://www.newsdemon.com/usenet-access.php",
    "Veteran": "https://www.newsdemon.com/usenet-access.php",
    "Unlimited plan": "https://www.newsdemon.com/usenet-access.php"
  }
}