{
  "source": "https://www.techradar.com/reviews/tradecom",
  "title": "Trade.com review",
  "category": "computing",
  "updated": "2020-03-11T10:51:43Z",
  "author": "jitendra-soni",
  "summary": "Wide variety of instruments to invest in",
  "verdict": "Best suited for experienced traders",
  "pros": [
    "Demo account",
    "Standard MT4 trading platform",
    "Support",
    "Multi-language support"
  ],
  "cons": [
    "Minimum withdrawal limits",
    "Limited Bonuses or Promotions",
    "Not easy to add stop loss"
  ],
  "article": [
    "Trade.com is one of the most popular trading platforms out there. The company was founded back in 2009, and so far, it has become one of the leading players in the trading world, and the platform has surpassed a user base of 100,000 active traders.",
    "Moreover, the multi-asset brokerage also features over 2,100 assets across five categories and is regulated by three jurisdictions. On this platform, you have access not just to CFD trading, but you can also trade with direct market access or DMA, with over 100,000 assets across 125 markets are available.",
    "The company is headquartered in Cyprus and regulated by the financial authorities at the Cyprus Securities and Exchange Commission. Also, through this platform, you will get access to forex, commodities, shares, and cryptocurrency markets.",
    "Its parent company, Leadcapital Markets Ltd owns multiple similar ventures such as Forexyard.com, Excellence Option, Prestigeoption.com, and Optionsclick.com.",
    "However, traders from countries like Japan, Canada, and the US, are restricted from joining up to Trade.com.",
    "Trade.com is considered to be one of the top CFD and Forex broker in the industry. It offers a total of 55 currency pairings to trade-on including majors, minors, and a few exotics as well. It has a wide variety of investment option as it allows traders to invest in over 2100 companies, 26 global indices, commodities or bonds.",
    "The platform does not have such a wide choice when it comes to cryptocurrencies, which is a compromise for most new-age investors.",
    "Signing up to Trade.com is pretty easy and the entire process takes only 5-10 minutes. To create an account, go to the signup page, after that, you will need to choose your username, enter your email and create a preferred password. After selecting a default trading currency, your account is set and ready.",
    "The platform offers a demo account to do a test run before risking your hard-earned money. As soon as the registration process is done, you receive £10,000 demo account funds which allow you to experience the platform and process dummy transactions.",
    "The sign-up process requires the user to provide details such as gross income estimate, basic education background and trading experience. Once you’ve made up your mind to invest with Trade.com, then you can switch to the live account which requires you to fund your account. The account goes live after the identity verification process, which may take up to 24 hours.",
    "There are 4 different accounts that one can sign up differentiated by the initial amount you need to deposit and features available for each:",
    "Trade.com has a couple of platforms to trade on. It has its own custom web-based trading platform alongside the industry favored MT4. For the users who prefer trading online then the cloud platform, which doesn’t require any downloads, and is platform-independent, is the way to go. Though custom platforms are fast and easy to operate, they generally do not offer the flexibility and trading options that MT4 offers.",
    "There is a custom mobile platform as well which is built on MT4 and offers an almost similar experience as the desktop platform, though with a few limitations. It does offer access to important details like trading instruments, advanced order types, a favorites watch list, charts and account information. The availability of mobile apps is dependent on your local trading policies.",
    "Deposits can be done using credit cards, internet banking, Skrill, Neteller, and Safeguard to deposit funds. Also, the best part is that the withdrawal requests are handled quickly, but do allow for the time requirements of payment intermediaries.",
    "Trade.com charges you an inactivity fee of $25 for a period of 90 days of inactivity. There is an additional charge of $100 for a year of inactivity. Among other fees, overnight swap charges are applicable. The extensive list of charges can be found on the website.",
    "Trade.com offers support during market hours throughout the week, and you can contact customer support through live chat, email, and direct phone.",
    "Also, Trade.com has set up direct toll-free phone lines in 30 countries for its traders’ convenience. The website is available in 19 different languages. Along with that, you will get support materials for all levels of trader.",
    "The trading platform is fast and responsive, and so is the support",
    "Even though the asset selection on Trade.com is very good, the fees charged by the platform is on the slightly higher side if you don't plan to be actively trading from month to month. Research is offered on an account with $10,000 and above, which may be a turn off for novices and traders with less experience.",
    "Limited choice in cryptocurrencies can be overshadowed by the wide variety of trading options on offer"
  ],
  "headers": {
    "5": "What does Trade.com offer?",
    "11": "Platforms",
    "13": "Fees and charges",
    "15": "Support",
    "17": "Final verdict"
  },
  "links": {
    "Trade.com": "https://www.trade.com/"
  }
}