{
  "source": "https://www.techradar.com/reviews/asus-zenbook-flip-15",
  "title": "Asus ZenBook Flip 15 review",
  "category": "computing",
  "updated": "2020-03-10T16:50:27Z",
  "author": "rob-dwiar",
  "summary": "A capable and premium 2-in-1 laptop",
  "verdict": "A great do-it-all laptop that ticks a lot of boxes. It's a quality 2-in-1 device that will handle anything from work to light gaming, and features one of the best screens going on a portable machine.",
  "pros": [
    "Exquisite design",
    "Great all-round performance",
    "Excellent screen and features"
  ],
  "cons": [
    "Quite expensive",
    "No Ethernet port",
    "More competent gaming laptops offer better value"
  ],
  "article": [
    "The Asus ZenBook Flip 15 is, in short, a brilliant machine. A great laptop for work, entertainment, productivity and even some light gaming; it really can do it all.",
    "However, we expect that for its north-of-four-figures list price, that this should be the case – and for everything that we ask of it, it does succeed... And usually with a flourish. It features genuine versatility in interaction and use, and one of the best screens on a Windows 10 laptop we've experienced.",
    "Design-wise, this brushed metal laptop is solidly built and has a smooth, sleek design for a 15-inch laptop. It's weighty and robust, but slim enough to easily hold in one hand.",
    "Housed within the body is a satisfying keyboard and excellent touchpad. The touchpad is also a second screen and can be used to launch tasks and shortcuts - Asus call it a ScreenPad and it's a feature that enables the ZenBook Flip 15 to stand out above other laptops.",
    "It's both - genuinely - a bit of a gimmick as well as useful, and fits with the premium nature of this machine. Launching apps and programs, and programming simple tasks like screengrab or copy into its Quick Key function, and using the handwriting function are particularly impressive, and can really help with productivity.",
    "Meanwhile, the main screen is a total joy: its 4K resolution provides a roomy and crisp display for the 15-inch panel. Add in the excellent touch-screen functionality to this and the interaction that the Flip 15 offers goes through the roof.",
    "And using the laptop through that screen and the solid keyboard-touchpad combo is great. The flip screen is a great feature that we are really fond of in modern 2-in-1 laptops and Chromebooks. It adds a whole new dimension to how we can use these already-excellent machines; allowing us to go from work or productive-task machine, to sofa-bound browser in a simple and satisfying motion.",
    "The gaming performance offered by the Asus ZenBook Flip 15 - due to that Nvidia GeForce GTX 1050 graphics card under the hood - is good but well within expected limitations of the modest output the GTX 1050 is capable of.",
    "It performs adequately on lower settings on the games we tested, and would still be good enough for games like Rocket League. However, we're not sure you'd buy this laptop for gaming. The premium nature of everything else is not matched by the gaming performance, which jars a little.",
    "Given that Asus makes some of the best gaming laptops going, it's eyebrow-raising as to why such a dated card was put into this premium machine. Or, more pointedly, whether it needs one at all, and if it needs to pitch itself as a gaming machine.",
    "When it comes to ports, there's no Ethernet for wired internet, but otherwise the range of ports is as expected; a few USBs present to handle external devices, as well as HDMI for hooking up to an external display and an SD card reader.",
    "All-in, the Asus ZenBook Flip 15 offers a very competent, all-round package that can handle pretty much anything. The folding 4K, touchscreen panel and its ScreenPad are some of the best laptop features we've seen, and it's got a decent array of components powering it all, which offers a very good level of performance. It does have a high asking price, but if that were to drop, this would be an easy recommendation for those looking for a truly versatile laptop.",
    "Right off the bat, we feel it important to say that the Asus ZenBook Flip 15 is expensive. The ZenBook Flip 15 has clearly been designed as a premium laptop, and it has a price tag to match.",
    "Weighing in at $1,500 / £1,500 (around AUD$2,250, import fees and specifics dependent) this is a pricey laptop.",
    "To be fair, for that asking price you're getting that handy ScreenPad, a 4K touchscreen and 2-in-1 versatility, and these go some way to justifying the high cost.",
    "In our view, and compared to competitors like the HP Spectre x360, as 2-in-1 laptops go, it's pitched at about the right price. It also makes it a great contender for future sales: getting this, with all its bells and whistles for $1,000 or, whisper it, under $1,000, would be a steal.",
    "The exquisite brushed metal – US Military grade quality allegedly – aesthetic makes a big impact as soon as you take the Asus ZenBook Flip out of the box.",
    "The material makes for a solid machine, and its finish provides a subtle design aesthetic that is both sleek, and makes a nice change from the basic black and silver designs we often see in modern laptops.",
    "This design aesthetic makes the Asus ZenBook Flip 15 one of the nicest laptops we've ever used. It feels very robust too; teamed with a decent weight the ZenBook Flip 15 feels like it could survive a knock or two – although we'd never want to risk denting that beautiful brushed metal.",
    "The design houses a glorious 4K screen with an impressive 90% screen-to-body ratio. This is thanks to the ultra-thin 4.5mm bezels that surround the display and help maximise the amount of screen the laptop packs into its chassis. It's impressive stuff",
    "Seriously, the screen is glorious, and made us genuinely gasp upon opening the laptop for the first time. The 'other' screen that's key in the laptop's design is that of the touchpad-meets-screen feature: the ScreenPad.",
    "Above the ScreenPad is a keyboard that is stacked; it's a full keyboard with a numpad to the right too. That's quite the achievement on a 15-inch laptop. However, there's a compromise to be made for getting a full keyboard and numpad and ScreenPad into the laptop: everything feels a little cramped.",
    "The Zenbook Flip 15 tries to give you everything plus its own toys which means there's a competition for space – we found it was easy to miss keys or hit the wrong ones.",
    "Elsewhere, the design incorporates some impressive audio for a laptop: the Harman Kardon front-facing speakers provide genuinely good sound. The ports are neat and tidy too, running along either side of the laptop and offer a good, but not enormously wide, set of options.",
    "You'll get two USB-As; one USB-C; one HDMI; one SD card reader; and an audio jack. The glaring omission here is the absence of an Ethernet port. The Asus ZenBook Flip 15 would, seemingly, not be impacted too much by granting the extra smidgen of height necessary to house one, and it would give a connection option that we expect from a premium laptop.",
    "Unsurprisingly, the Asus ZenBook Flip 15 is a high-performing 2-in-1 laptop. Whatever we use the machine for, it handles it; however we use the machine, it works and performs. And, genuinely, our criticisms are few and far between.",
    "One of them, however, does reside in the layout of the keyboard. Because it's so cramped, particularly toward the top rows of keys and the right hand side with the numpad, it is quite easy to smash the wrong button or flick the wrong keys to interrupt functions. The delete key, for example, proves very easy to miss. Also, the power button is a little too indistinct and the actuation is poor, too.",
    "It's also a bit of a shame that there's no Ethernet port, but to be fair the ZenBook Flip 15 does counter that with very strong and reliable Wi-Fi connectivity and strong Bluetooth 5.0 support, the latter being a particularly solid and welcome addition.",
    "The screen is a true joy to use, without fault, however. It's a roomy, bright, crisp and clear display that is good for any function or task. Films and YouTube videos are vibrant and punchy; games are vivid, and even day-to-day software like Chrome and Microsoft Office look great. The 100% sRGB quality of the screen certainly helps with the top-notch image quality.",
    "There is also something very satisfying in simply flitting between regular laptop touchpad and keyboard use, to scrolling down programs and opening up files by using the touchscreen itself, with only a lazy change of arm position.",
    "Thanks to the powerful components within, daily use of the laptop, which included running multiple programs and apps at once, was incredibly smooth on the ZenBook Flip 15. It has more than enough grunt to handle everything that work or medium productivity such as photo editing, word processing, spreadsheet and web browsing all at once.",
    "Meanwhile, the gaming benchmarks we ran reveal results that are both expected and pleasantly surprising.",
    "They are not cripplingly slow, as you might expect from the aging graphics card housed in the laptop, but the Asus ZenBook Flip 15 also doesn't provide anything near a 'good' gaming experience.",
    "Naturally, we ran benchmarks and played games at 1080p given its a modest card, which would in no way handle the screen's native 4K resolution. However, the results do show you could still enjoy a bit of gaming on the go, albeit at lower settings.",
    "This ZenBook might not be a gaming laptop per se but it is a laptop that can play games... at a push. If only Asus had been able to work in a 16-series card into this ZenBook then we would almost certainly have given it a higher overall score.",
    "Away from the gaming performance, the ZenBook Flip 15 manages to feel so much more than the sum of its parts. While the components do a fine job of powering the laptop, it's the extra features that really make it stand out.",
    "In fact, the more you use it, the more true this becomes, and things like the ScreenPad, which many will dismiss as simply a gimmick or curio, start making a lot more sense.",
    "You'll quickly embrace the ScreenPad with its built-in technology that supports smart gestures; you'll start to seamlessly rely on the IR camera's facial recognition to log you in with Windows Hello; it'll slip easily into your wider smart home setup through its built-in Amazon Alexa functionality; and swapping between tablet and regular laptop modes soon becomes second nature.",
    "These features, backed up by the quality components under the hood means the Asus ZenBook Flip 15 is an all-round quality machine. Everything about the laptop performs really well - even the speakers are pretty good! If you can stomach its slight drawbacks, you absolutely will not regret acquiring one of these beauties."
  ],
  "headers": {
    "0": "Two-minute review",
    "12": "Price and availability",
    "16": "Design",
    "25": "Performance",
    "39": "Don't buy it if..."
  },
  "links": {
    "Windows 10 laptop": "https://www.techradar.com/news/best-windows-laptop",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Nvidia GeForce GTX 1050": "https://www.techradar.com/news/leaked-gtx-1050-benchmarks-reveal-budget-cards-1080p-power",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "HP Spectre x360": "https://www.techradar.com/reviews/hp-spectre-x360-2020",
    "15-inch laptop": "https://www.techradar.com/news/best-15-inch-laptop",
    "Windows Hello": "https://www.techradar.com/how-to/software/how-to-use-windows-hello-1301455"
  }
}