{
  "source": "https://www.techradar.com/reviews/8x8-video-meetings",
  "title": "8x8 Video Meetings review",
  "category": "computing",
  "updated": "2020-05-11T13:42:07Z",
  "author": "michael-graw",
  "summary": "Free unlimited video conferencing",
  "verdict": "8x8 Video Meetings is a good free video conferencing service that doesn’t put limits on your meetings. We liked the calendar integrations and didn’t feel like the software missed any key features.",
  "pros": [
    "Free unlimited video meetings",
    "Simple browser extensions and calendar plugins"
  ],
  "cons": [
    "No survey tools, even in paid version",
    "Limited security details and technical support"
  ],
  "article": [
    "8x8 Video Meetings offers a free platform for video conferencing. The software doesn’t impose time limits on your free meetings and includes helpful calendar plugins. If you need closed captioning or transcription, a paid plan is impressively inexpensive. Our 8x8 video conferencing review will cover everything you need to know to decide if this software is right for you.",
    "8x8 Video Meetings is free to use for the vast majority of people. There are no limits on how many meetings you can host or join for free, and no time limits on your meetings.",
    "8x8 does offer a paid plan for $9.99 per user per month. The main thing you get with this is speech-to-text technology, which enables real-time closed captioning and produces transcripts for your meetings. A paid plan also comes with 60 days of cloud storage for meeting recordings.",
    "For a free software, 8x8 Video Meetings has an impressive array of features. The one that most users will turn to immediately is calendar app integration. 8x8 has custom browser extensions for Chrome and Firefox and plugins for Google Calendar and Office 365, any of which you can use to quickly schedule meetings and invite participants.",
    "Within meetings, you can easily share your screen, chat with other participants, or raise your hand to signal that you have a question or want a chance to speak up. You can also record any meeting or create a live stream, even without a paid subscription. The only advanced feature that 8x8 Video Meetings was missing was an in-meeting survey function, although we haven’t seen this functionality for free in any video conferencing software.",
    "Getting started with 8x8 Video Meetings is extremely simple. Just create an account with your email or login with Google. You’ll be prompted to install the 8x8 browser extension, which enables you to integrate with Google Calendar or Office 365.",
    "One minor layout option that makes setup slightly less seamless is that administration settings open in a separate window from the rest of the platform. This isn’t a huge deal, but it makes it a little more difficult to add other employees from the same business to your account. It’s also worth noting that 8x8 doesn’t include an address book.",
    "8x8’s video conferencing interface is entirely browser-based and it’s fairly streamlined. When you log into your account, a window will show you your upcoming scheduled meetings and provide links to easily access them when the time comes.",
    "You can also start your own meeting at any time. The platform enables you to copy the meeting information, including the URL and dial-in number, with a single click to send to others. For business meetings, it’s also helpful that you can opt to start with your audio and video on or off when entering a meeting.",
    "The video quality in 8x8 is good, but not the best we’ve seen. It’s noteworthy that in the age of 4K video, this platform only supports HD resolution. That said, we appreciated that you can choose from three lower-resolution video settings within a meeting to save on bandwidth when necessary.",
    "8x8 is powered by Jitsi.org open-source video conferencing, with third-party verified security as standard. In other words, the platform has been closely scrutinized by the Jitsi developer community and prides itself on strong levels of privacy and security for all users - free and paid.",
    "The platform also offers end-to-end encryption, randomized meeting names and password protection to preserve the privacy of participants.",
    "The platform hasn't suffered from the same code flaw that has previously allowed unauthorized access into meetings on platforms like Zoom and RingCentral. But, it also doesn’t support two-factor authentication and browser extensions are notoriously unsecure.",
    "8x8 claims to offer 24/7 technical support by phone, email, and live chat. But, we had a hard time finding any contact information for the support team. We ended up calling the sales team number in order to get connected. In addition, we found that 8x8’s documentation center doesn’t include any information about 8x8 Video Meetings specifically.",
    "If the idea of video conferencing for free appeals to you, it’s worth taking a look at Lifesize. Like 8x8 Video Meetings, this platform lets you host an unlimited number of meetings for free with no time limits. In addition, it integrates with not only calendar apps but also productivity tools like Slack and Microsoft Teams. Just beware that upgrading to a paid plan with Lifesize can be very pricey.",
    "If you’re looking for a free video conferencing solution, 8x8 Video Meetings is a great choice. The integrations with Google Calendar and Office 365 are easy to use. Plus, the video quality is reliably good enough for professional use and having the option to record any meeting and share your screen is also helpful. We especially like the fact that you’re not missing out on key features with a free plan, since upgrading mostly serves to unlock speech-to-text for transcription. The only minor complaint we have is that we’d like to see more details about the platform’s security and better support."
  ],
  "headers": {
    "1": "Plans and pricing",
    "3": "Features and utilities",
    "5": "Setup",
    "7": "Interface and performance",
    "10": "Security",
    "13": "Support",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "8x8 Video Meetings": "https://refer.8x8.com/wp/TechradarUS",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "speech-to-text": "https://www.techradar.com/news/best-speech-to-text-app",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "calendar app": "https://www.techradar.com/best/best-calendar-apps",
    "email": "https://www.techradar.com/news/best-email-provider",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "RingCentral": "https://www.techradar.com/reviews/ringcentral-video",
    "Lifesize": "https://www.techradar.com/reviews/lifesize",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "transcription": "https://www.techradar.com/best/best-transcription-services"
  }
}