{
  "source": "https://www.techradar.com/reviews/asus-zephyrus-duo-gx550",
  "title": "Asus Zephyrus Duo 15 GX550 review",
  "category": "computing",
  "updated": "2020-06-22T13:00:44Z",
  "author": "bill-thomas",
  "summary": "Is this the future?",
  "verdict": "The Asus Zephyrus Duo GX550 is an absolute powerhouse of a gaming laptop with one of the most imaginative designs we've seen in a while. However, a couple of missteps and a high price make it hard to recommend to anyone but a very specific type of user.",
  "pros": [
    "Extremely powerful",
    "Inventive design",
    "Gorgeous display"
  ],
  "cons": [
    "Bloatware",
    "Bad trackpad",
    "Very expensive"
  ],
  "article": [
    "There's something kind of magical about the simplistic design that most laptops on the market follow. Just a device that folds down into a simple rectangle that's easy to carry around, that you can just open up to find a keyboard, trackpad and screen to do some work or gaming on.",
    "The Asus Zephyrus Duo joins several future-gazing new gaming devices from companies like Asus and Acer - particularly the Asus Mothership and Acer Predator Helios 700 - that seek to revolutionize how gaming laptops are built, especially at the high end.",
    "And, at an eye-watering $3,699 (about £2,990, AU$5,410), the configuration of the Asus Zephyrus Duo GX550 we reviewed here is only for people that either have a ton of cash to burn or absolutely need the best performance they can possibly get.",
    "If you were to ask us, one of the biggest things contributing to this high price tag is the inclusion of a second screen that lifts up at an angle above the keyboard when you open the laptop. This is a touch screen with a super-sharp 4K resolution, and generally looks pretty excellent. But again, it's definitely a luxury you can live without if you want to save some cash.",
    "Beneath this display are some pretty powerful fans that, when combined with the liquid metal TIM (thermal interface material), allow both the CPU and GPU to hit turbo speeds and stay there more often, which results in better performance.",
    "So, in a many ways, this is a laptop that is designed first and foremost to the kind of hardware geeks that want to show off some futuristic design language, while eking out every little ounce of performance possible in current mobile hardware.",
    "The configuration we reviewed to the right will set you back $3,699 (about £2,990, AU$5,410), but isn't quite the entry-level spec. According to the notes Asus sent over, the Zephyrus GX550 starts off with an Intel Core i7-10875H and an Nvidia GeForce RTX 2070 Super, but we don't know the pricing of this entry-level model. This isn't budget hardware either, though, so you shouldn't expect the laptop's price to be cheap.",
    "You can definitely get this level of hardware for less, with something like the MSI GS75 Stealth coming in at 'just' $2,999 (about £2,430, AU$4,390) at the time of writing in a much more portable chassis with comparable hardware. However, while we haven't tested that laptop, cooling will absolutely not be at the same level.",
    "This all kind of begs the question: who is the Asus Zephyrus GX550 even for? Well, with this level of hardware, it's obvious that gamers will appreciate being able to run their games at max settings, but it goes deeper than that.",
    "The way we look at it, the people that should be seriously considering this laptop are the folks that do gaming on top of creative and professional work. If, for instance, you're a video producer that wants to get through your video projects fast, and play Cyberpunk 2077 at max settings when that comes out, this laptop is going to be right up your alley. Plus, we can imagine that second screen will definitely come in handy while you're working, too.",
    "For years, gaming laptops have always had kind of an edgy design, with either black or gunmetal gray designs, red accents and RGB lighting. While the Asus Zephyrus Duo definitely takes some of these design elements and runs with them, we can't help but feel like it's a bit more refined than a lot of other gaming devices.",
    "The lid of the laptop is this sleek gunmetal gray color, with the Asus ROG logo being the only thing that stands out. And, rather than that logo being some garish shade of red, it's simply chrome, which means you won't have to hide it in your meetings.",
    "That gunmetal gray color covers most of the chassis, too, but when you open the laptop, the truly notable design elements will immediately catch your attention.",
    "Upon opening the laptop, the second screen will immediately pop up, but it won't actually turn on until you unlock the device. Once you do, though, the display pops. Not only is the image really sharp, but the screen has this really nice matte finish that makes it look super premium. After all, you don't want a glare reflecting directly in your eye in the middle of a game or creative project.",
    "However, because of the sheer amount of space the second screen takes up, the keyboard can't help but feel a bit condensed. It gets moved to the bottom of the laptop, which makes for a bit of an uncomfortable typing experience. Asus combats this a bit by including a wrist rest in the box, but this is definitely not a laptop that you're going to want to sit on your couch and type on.",
    "Remarkably, even with this ridiculous level of hardware, the Asus Zephyrus Duo GX550 isn't that obnoxious to carry around. Sure, it's not going to slide into your backpack as easily as something like the Dell XPS 15, but nobody was expecting that anyway.",
    "This laptop weighs 5.29 pounds and measures just 0.82 inches thick, that's not light by today's standards, but it's certainly not heavy either. Alongside the Gigabyte Aorus 17G we reviewed earlier this year, desktop replacement gaming laptops are getting sleek, and we're definitely here for it.",
    "Everything isn't rosy with the Zephyrus Duo, though. The trackpad is shoved off to the right-hand side of the laptop, which definitely takes some getting used to. That's not a dealbreaker on its own, but it's also one of the smallest we've seen in a premium laptop in years. There are two dedicated clicker buttons below the trackpad, and they're not the most reliable, which makes us wonder why Asus didn't just get rid of those and put a clicker below the trackpad like most laptops these days.",
    "We get that most people using this laptop are going to be using an external mouse, but that actually reveals another problem with this laptop: ports. One of the biggest selling points of a thicc desktop replacement device is that there should be a wealth of different ports.",
    "And, while this laptop does have 3 USB-A ports, a Gigabit LAN port and an HDMI port, it's definitely missing the SDXC port that a lot of creators rely on. Instead, if you want SD support, you're going to have to live the dongle life - something you shouldn't have to do with a laptop that weighs upwards of 5 pounds.",
    "This ultimately probably has to do with the two giant vents on either side of the laptop, which is necessary for cooling a Core i9 and a 2080 Super in such a small chassis, it's just something to be aware of if you need more varied ports in your laptop.",
    "We have to give credit where it's due, though. The HDMI, Ethernet and one USB-A port are on the back of the device, which means you won't have to worry about a tangle of cords getting in your way while working or gaming.",
    "The Asus Zephyrus Duo GX550 is also guilty of one of our biggest laptop pet peeves: down-firing speakers. This is also due to the real estate dedicated to the second screen, so we won't hold this too much against the laptop, especially because the speakers manage to actually sound pretty good. This is something Asus could have half-assed and probably got away with, but we're pretty pleased with how this laptop sounds.",
    "The main display, however, is excellent. It clocks in with a 3,840 x 2,160 resolution with a 60Hz refresh rate, and manages to hit 113% of the DCI-P3 color gamut. Along with an average screen brightness of 402 nits, this is a bright, detailed and super colorful display, which adds even more credence to our recommendation that only creators should really consider this hardware.",
    "Though, we do have to say that games really pop on this thing. Playing Final Fantasy XIV at 4K on a screen this beautiful is certainly a treat. That's an extremely colorful game, and seeing all the crystals here is definitely nice - along with all the glamours we're constantly spending time swapping around.",
    "That second display is close to the primary in terms of quality, but doesn't hit the same levels. Because it's basically a 4K display cut in half, it's resolution comes in at 3,840 x 1,110, and has a screen brightness of 351 nits and hits just 75% of the DCI-P3 color gamut. Still, this isn't where you're going to be doing your primary work, and the fact that it looks as good as it does is worth praise.",
    "When you look underneath that second display, you'll get how Asus managed to get such powerful hardware to run so well in such a small chassis. You get two giant fans that serve as intakes, which allows for cooler air to be drawn in from the top of the laptop, which is way better than having air drawn in through the bottom of the laptop, which is generally warmer.",
    "For the Asus Zephyrus Duo GX550, design is clearly a large part of what you're paying for. And, if having a second screen above the keyboard appeals to you, there's definitely a lot to like. Even just for gamers, being able to play your game and have, like, Discord open at the same time echos why dual-monitor setups are so popular for the best gaming PCs.",
    "At the same time, however, if this reads as a gimmick to you, and we couldn't blame you for that, the inclusion of the second screen leads to some discomfort when it comes to typing and using the trackpad. The GX550 is definitely a laptop you're going to want to make sure you want before you throw down the considerable amount of cash required.",
    "Packed with an Intel Core i9-10980HK, an Nvidia GeForce RTX 2080 Super with Max-Q and 32GB of RAM, the Asus Zephyrus Duo GX550 is obviously a powerhouse. However, the creative cooling solution leads to performance that is similar to what you would see in a desktop.",
    "For instance, in Cinebench R20, this laptop scores 4,045 points, which is just 17% slower than the Intel Core i9-9900K - a processor with a TDP that is more than twice the 45W that the 10980HK in this laptop is configured to.",
    "The story is similar for gaming, too. In Metro Exodus at 1080p Ultra, the Zephyrus Duo scores 59 fps, which is the highest of any gaming laptop we've ever tested at TechRadar. Even in 3DMark Time Spy with a score of 7,641, it wipes the floor with the Gigabyte Aorus 17G, which has the same GPU.",
    "If performance is all you care about, the Zephyrus Duo GX550 has that in spades. But, again, you're definitely paying for that increased performance, but there are definitely those that will be willing to make that jump.",
    "It shouldn't come as too much of a surprise that you're not going to get all-day battery life out of the Asus Zephyrus GX550, but we're still impressed with how close it gets.",
    "You see, laptops like this don't even need long battery life. Typically, they're always plugged into the wall anyways, but with 5 hours and 3 minutes of battery life in the PCMark 10 battery test, you can definitely get some work done without needing to be plugged in.",
    "Even in the movie test, this laptop gets 4 hours and 37 minutes, which is super impressive for this type of laptop, doubly so when you consider the 4K display.",
    "Again, the Zephyrus GX550 absolutely didn't need to nail battery life, but the fact that it does is just another point in its favor.",
    "We simply don't understand why a laptop that costs as much as the Asus Zephyrus Duo GX550 would have bloatware installed. The people that are going to be paying this much for a laptop are likely to be proficient enough with tech to know what software they want on their device - so why the hell is McAfee LiveSafe installed?",
    "Until you uninstall this piece of software, it will boot up with Windows 10 and pester you to buy a subscription. This is an inconvenience you accept when you buy that cheap laptop at Best Buy, but it's absolutely not something we should ever see in a laptop that costs almost four grand. The inclusion of this software is absolutely insulting, and if you get this laptop you should immediately uninstall it and replace it with one of the best antivirus programs that isn't going to try and extort money out of you every time you open your laptop.",
    "The rest of the included software is thankfully not nearly as egregious, with Armoury Crate being extremely useful for managing your hardware. By default it will open on the second display and allows you to monitor temperatures, clock speeds and voltages. It will also let you swap between performance profiles, so you can choose whether to prioritize silence or raw performance with Turbo Mode.",
    "Asus Armoury Crate may just be one of the best hardware management programs we've seen included with a gaming laptop, and having it running on that second screen seems like a no-brainer. Now, if only Asus didn't include that annoying piece of antivirus."
  ],
  "headers": {
    "6": "Price and availability",
    "10": "Design",
    "29": "Performance",
    "33": "Battery life",
    "37": "Software and features",
    "41": "Don't buy it if..."
  },
  "links": {
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Asus Mothership": "https://www.techradar.com/reviews/asus-rog-mothership",
    "Acer Predator Helios 700": "https://www.techradar.com/reviews/acer-predator-helios-700-review",
    "gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "MSI GS75": "https://www.techradar.com/reviews/msi-gs75-stealth",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Dell XPS 15": "https://www.techradar.com/reviews/dell-xps-15-2020",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g",
    "Intel Core i9-9900K": "https://www.techradar.com/reviews/intel-core-i9-9900k-review",
    "best antivirus programs": "https://www.techradar.com/best/best-antivirus"
  }
}