{
  "source": "https://www.techradar.com/reviews/potensic-dreamer-4k",
  "title": "Potensic Dreamer 4K review",
  "category": "cameras",
  "updated": "2020-09-27T09:00:00Z",
  "author": "sam-kieldsen",
  "summary": "The starter quadcopter you’ve been dreaming of? Not quite…",
  "verdict": "The Potensic Dreamer 4K's impressive presentation isn’t quite matched by its performance, but this is still an enjoyable drone to fly – even if the quality of its camera leaves a lot to be desired.",
  "pros": [
    "Good build quality",
    "Easy set up",
    "Decent battery life",
    "Responsive controls"
  ],
  "cons": [
    "Short range",
    "Poor image quality",
    "No image stabilization"
  ],
  "article": [
    "Let’s get something out of the way: despite its name, the Potensic Dreamer 4K does not record 4K video. The drone’s camera sensor allows it to capture still photos at a 4K resolution (not a particularly big deal), but video tops out at 2.7K, or 2688 x 1512 resolution. Still, despite this unfortunate marketing bluster, this affordable quadcopter does have plenty going for it.",
    "The Dreamer's build quality and presentation are impressive right out of the box. Made of a similar tough white plastic to DJI’s beloved Phantom drones, there’s a premium feel here that you don’t get with most beginner drones.",
    "It’s sleek and lightweight too, with a high capacity 3,000mAh battery that gives you an instant indication of its approximate charge level via four LEDs. The battery provides “up to 31 minutes” of flight according to the manufacturer, but in practice we’ve found it’s a little less. Still, 25 or so minutes of flying time per charge is not to be sniffed at.",
    "The controller is similarly admirable, with removable thumb sticks that unscrew for storage under a rubber flap, and a smart spring-loaded sliding mechanism to firmly accommodate your smartphone when in use. It also sports a four-LED charge indicator, and its built-in battery is recharged via a supplied USB cable. Potensic claims a full charge will give you about four hours of use, and that fits with our experience.",
    "When you take flight, however, the Dreamer’s budget roots show. Because it uses Wi-Fi for its camera-to-smartphone video feed, its control range is quite limited. Potensic claims it’ll work up to around 300m, but in our tests video link became choppy at more like 50m. The controller will still fly the drone at further ranges than this, but you’ll be relying on your eyes rather than the app’s video feed.",
    "There’s a GPS-powered return-to-home function too, but it simply didn’t work every time we tested it – at one point, the drone stubbornly stayed put rather than flying back to its take-off location, so we had to bring it home manually.",
    "The app does feature a map that plots the drone’s (and pilot’s) position, which could help relocate it if it was ever lost, but there are no anti-collision measures here. If you fly it towards a tree or wall, be warned: unlike DJI’s drones, it won’t stop of its own accord. There’s a nod to beginners, though, with a setting that allows you to limit maximum height and distance and keep the drone nearby.",
    "Actual manual flight is enjoyably responsive when using the controller. The drone doesn’t shift with any particular urgency, but it does react quickly to your inputs. Also, the inclusion of GPS helps to keep it in place when you take your hands off the controls. It does drift around a little in breezy conditions, but most of the time it stays in the same general position.",
    "The aforementioned “4K” camera looks the part with a fetching aluminum-style finish. It has a slot for a microSD card and can be tilted up and down through about 90 degrees, but the lack of a gimbal or any form of electronic image stabilization means that your videos will be extremely shaky if the drone is moving at all, while photos are unlikely to have a nice level horizon.",
    "These are things you’ll need a gimbal-equipped drone for, which will likely mean paying a lot more money – but it’s worth pointing out that, while the Dreamer might look a lot like the DJI Phantom, it doesn’t come close to replicating its camera capabilities.",
    "Even setting aside the lack of camera stability, the imaging quality itself is not particularly impressive. The 2.7K resolution of the video might sound fairly detailed on paper, but clips lack dynamic range and suffer from too many compression artifacts. These things greatly reduce the perceived detail in the footage. Still photos suffer a little from the same issues, but with a higher starting resolution they do appear to be a little sharper.",
    "If you’re looking for an affordable drone that can also produce great-looking photos and video, the DJI Mavic Mini is a far better candidate. It does cost a little more than the Dreamer, but it’s got a gimbal-mounted camera for excellent stability, much longer range and a foldable design that’s also lightweight enough to sidestep most drone registration laws.",
    "Anyone who purchases a drone over 250g has to register it with the likes of the Federal Aviation Administration (in the US) or Civil Aviation Authority (in the UK), and the Dreamer 4K certainly falls into that category."
  ],
  "headers": {
    "13": "Don't buy it if..."
  },
  "links": {
    "DJI Mavic Mini": "https://www.techradar.com/reviews/dji-mavic-mini"
  }
}