{
  "source": "https://www.techradar.com/reviews/microsoft-surface-go",
  "title": "Microsoft Surface Go review",
  "category": "tablets",
  "updated": "2020-12-11T02:59:03Z",
  "author": "joe-osborne",
  "summary": "The ultimate 10-inch tasker’s tablet",
  "verdict": "The Surface Go is a gorgeous machine that brings you an excellent Windows 10 experience in a 10-inch tablet.",
  "pros": [
    "Excellent design",
    "Surprisingly strong graphics",
    "Decent price",
    "Fantastic display and speakers"
  ],
  "cons": [
    "Still no accessories included",
    "Less powerful than an iPad",
    "Screen could be sharper",
    "Windows desktop mode feels cramped"
  ],
  "article": [
    "The Microsoft Surface Go knocks it out of the park completely, and in the race for the ultimate small tablet, it’s poised for a win. This little tablet puts everything we love about the Surface Pro 6 in a smaller and much more affordable package.",
    "While there’s not a lot of major surprises of fresh features here, the Microsoft Surface Go still has a few aces up its sleeves. There are no half-baked operating systems and no strange app compatibility issues, thanks to Windows 10 S Mode being enabled out of the box. With new updates and accessories to come to the operating system, this tablet’s functionality should only improve from here.",
    "Essentially, the Microsoft Surface Go is what the Surface 3 should have been, and it’s proof that a portable can be one of the best Windows tablets while also being affordable to most people. And, depending on what your workload looks like, the Microsoft Surface Go might just be ideal for your productivity and entertainment needs.",
    "The Surface Go configuration we reviewed here will set you back $549 (£509, AU$839, AED 2,399), and it’s the highest-end version of the tablet offered by Microsoft. Meanwhile, you can get the Surface Pro for as little as $399 (£379, AU$599, AED 1,699), with 64GB of eMMC storage and 4GB of memory, with the rest of the specs remain the same.",
    "Annoyingly, Microsoft continues to sell the tablet’s all-but-essential accessories separately. The Surface Pen goes for $99 (£99, AU$139), while the new Alcantara fabric Type Covers designed for Surface Go ask for $129 (£124.99, AU$199, AED 399). These come in burgundy, cobalt and platinum colors.",
    "Finally, a standard black nylon Type Cover is available for a more palatable $99 (£99, AU$149), bringing all of the same features in a slightly less premium feel and look.",
    "The Surface Go’s biggest rival, Apple’s iPad 2018, starts at $329 (£319, AU$469, AED 1,349) to start, which gets you 32GB of flash storage and 2GB of memory – half as much as the starter Surface Go in either case, but with a sharper display. If you want the iPad to match the Surface Go in storage, the 64GB model will set you back $429 (£409, AU$599), though memory stays at 2GB in all configurations.",
    "If you’re after a Windows 10 device, there’s the Asus Transformer Mini, which is extremely similar to the Surface Go in that it offers a 10.1-inch Windows tablet with a kickstand. Plus, both the stylus and keyboard cover are included for just $399 (about £300, AU$534) to get the model with 128GB of storage. But, the display isn’t quite as good as either alternative, and it’s limited to 4GB of RAM as its only configuration.",
    "At first glance, the 1.15-pound (0.52kg) Surface Go appears simply to be the Surface Pro shrunken down by 2.3 inches on the diagonal, and that’s largely true – excellent kickstand and all. However, Microsoft clearly put some design effort into this version, opening it up to a larger audience, specifically students.",
    "The first major hint toward the Surface Go’s intended audience is the rather prominent rounding of the edges and angles that Microsoft has applied to the device. Gone are the stark, angled edges of the Surface Pro in lieu of rounder, softer edges that help give this version of the Surface its own distinct identity.",
    "Beyond that, this device is largely the same in design as its forebears, except smaller. The excellent hinge returns and can bend nearly 180 degrees like before, making this device an ideal canvas for digital drawing and note taking.",
    "Microsoft still managed to cram a USB-C port and microSD card reader into the smaller Surface Go, neither of which the latest iPad has. This means that not only can this tablet’s storage be expanded, but it has two ways to hard-wire a dock and expand displays compared to the iPad’s single method, thanks to the mainstay Surface Connect port.",
    "As for the new, obviously smaller, Type Cover, Microsoft manages to deliver full-sized keys (now with more pronounced curves) within a smaller amount of space, and has included a glass trackpad that’s larger in depth than that of the Surface Pro. All told, the Type Cover feels just as snappy as it has before – we would say ‘only smaller,’ but it doesn’t feel that much more cramped when typing.",
    "That said, you will need to get used to a slightly tighter typing experience, especially when the device is on your lap. The keys are spaced closer together than normal keyboards, which alters exactly where your fingers naturally rest, so as to keep your index fingers on the F and J keys.",
    "Otherwise, typing on the Surface Go is much more comfortable than on other 10-inch devices, which should be lauded. For what it’s worth, the iPad Smart Keyboard uses strange, completely round, keys and doesn’t even feature a touchpad – because iOS doesn’t support mouse input.",
    "Microsoft’s display game continues to be top notch on the Surface Go. At 1,800 x 1,200 pixels, it’s not the sharpest 10-inch tablet display by a long shot, with the latest iPad coming in at 2,048 x 1,536 pixels.",
    "Still, though, the Microsoft Surface Go’s display is beautiful in everyday use. The display is extremely color accurate, and movies and photos look amazing on it. Of course, that 3:2 aspect ratio is great for work and web browsing, but gives full-screen 16:9 videos some wasted space with black bars.",
    "Like most tablets, the bezels around the screen are pretty large, but that just allows users to grip the device from any side without accidentally triggering anything on the screen. It also allows for the Type Cover to connect to the bottom bezel via magnet for a better typing angle.",
    "Regarding the relatively thick bezels, the Surface Go’s speakers reside within them on both sides of the screen. For such tiny drivers, these speakers sound surprisingly powerful, deep and nuanced in the amount of channel separation they can deliver. This makes the Surface Go just as good of a multimedia tablet as it does a mild productivity device."
  ],
  "headers": {
    "3": "Price and availability",
    "8": "Design",
    "15": "Display and audio"
  },
  "links": {
    "Surface Pro 6": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "Windows 10 S Mode": "https://www.techradar.com/news/windows-10-cloud-release-date-news-and-rumors",
    "Surface 3": "https://www.techradar.com/reviews/pc-mac/tablets/surface-3-review-1289839/review",
    "best Windows tablets": "https://www.techradar.com/news/mobile-computing/tablets/windows-8-tablets-release-date-specs-and-prices-916134",
    "iPad 2018": "https://www.techradar.com/reviews/new-ipad-2018-review"
  }
}