{
  "source": "https://www.techradar.com/reviews/shellfire-vpn",
  "title": "Shellfire VPN review",
  "category": "computing",
  "updated": "2020-11-18T20:18:57Z",
  "author": "sead-fadilpasic",
  "summary": "Proprietary VPN router and unstable connections",
  "verdict": "Shellfire is a decent VPN service on the surface, but it has a fair few problems. The user interface is clunky, the VPN connection is patchy and the speeds are average at best. However, we did like that it has a free tier, as well as the proprietary VPN-equipped router.",
  "pros": [
    "Has a free version",
    "Unblocks BBC iPlayer",
    "Proprietary router",
    "14-day money-back guarantee"
  ],
  "cons": [
    "Unstable connections",
    "Doesn’t unblock Netflix",
    "Awkward UI",
    "Only 1 concurrent connection"
  ],
  "article": [
    "Shellfire is a German VPN vendor, used by more than 250,000 netizens as their anonymity service of choice.",
    "It provides a proprietary VPN router for anyone who lacks the expertise to manually install the service, as well a free tier that can come in handy in situations when you need an emergency VPN.",
    "The platform looks alright on the surface, but the apps leave much to be desired in terms of features and usability, as well as connection stability, so you might prefer one of the best VPN solutions we had the chance to experience",
    "This provider has no traditional free trial, but you’ll still be able to test it out and ask for a refund within 14 days after the purchase. It will be granted to you quickly, no questions asked.",
    "There's also a free version of the platform that is slightly less secure, which offers 128-bit instead of 256-bit encryption, limits the speed to up to 1,000Kbps, and provides access to servers in only two countries: Germany and the USA).",
    "The subscription plans range from the 1-month option at $11.95/month to the 12-month one at $7.58/month and the 24-month subscription at $5.66/month. This is far from the cheapest on the market, but there are a few more expensive products out there too.",
    "You can also purchase the provider’s proprietary Shellfire Box VPN router under the 12-month plan, costing $133.95 for the first 12 months ($11.16/month), after which it renews at the regular price of $90.95 ($7.58/month).",
    "The 24-month subscription costs $187.95 ($7.83/month) for the first billing term, after which it renews at $135.95 ($5.66/month) billed every two years.",
    "Payments can be made using credit/debit cards, PayPal, bank transfer, HiPay, or Bitcoin. You can connect as many devices as you like under one VPN account but only one concurrent connection is possible. This limitation can be overridden if you purchase the provider’s proprietary VPN router.",
    "Shellfire has a lot of issues that need addressing, so we would suggest checking out NordVPN, Surfshark or CyberGhost, all of which are better performers and come at a lower cost.",
    "However, if you don’t mind paying more for a truly ultimate VPN service, then look no further than ExpressVPN - it features thousands of servers all over the world, stable and fast connections, dozens of extras and customization options, and unblocks all geo-restricted websites and services.",
    "Many popular video-on-demand services, like Netflix or BBC iPlayer, are often blocked in certain regions.",
    "Shellfire’s Windows app can give you access to US streaming services including Hulu, ABC, CBS, NBC, Fox, Crunchyroll - but Netflix is missing from the list.",
    "We consulted with the provider’s customer service and were told that it currently cannot offer access to Netflix but that BBC iPlayer works just fine.",
    "The official name of the company providing these VPN services is Shellfire Gattung und Behr Gbr, registered in Bad Vilbel, Germany. It offers access to its worldwide network of servers and around 500 IP addresses in 37 countries, including in Iceland, South Africa, Isle of Man, India, Turkey, the US, etc.",
    "Shellfire protects your privacy online with 256-bit encryption and the usual list of protocols - OpenVPN, PPTP, and L2TP/IPSec - while its VPN router (Shellfire Box) uses the innovative Wireguard protocol.",
    "Torrenting is possible, although you’ll need to contact the customer support for the information on which servers are suitable for such purposes. We were told that P2P traffic is possible on servers in the Netherlands, Canada, and Finland.",
    "The company claims it doesn’t record any of your data. However, it warns its users that this doesn’t mean they can commit crimes online without punishment. \"In the case that a valid warrant is presented, we will cooperate with German law enforcement agencies and grant them access to specific user’s live data streams,\" says the firm.",
    "Shellfire has apps for Windows, Android, Mac, and iOS, as well as supporting additional platforms (like Linux) with its manual setup instructions and configuration files.",
    "The proprietary Shellfire Box 4K VPN router enables 4K video streaming and downloads of up to 50Mbps. It also allows you to protect many more additional devices, including Apple TV, Amazon Fire Stick, Playstation, Xbox, and others.",
    "If you have any questions, you can first try the website’s help section and if you still have any doubts or concerns, contacting customer support is possible via web form, email, Twitter, and Facebook.",
    "Although there’s no live chat option, we received email responses (and a refund) within 10 hours. You can also find useful information on the provider’s blog.",
    "The Windows app is rather clunky and sometimes doesn’t even respond to commands unless you click twice or even three times on a specific button.",
    "There’s a handy list of servers showing their encryption level and speeds, but they can’t be filtered according to those metrics. You can also choose servers on a map but the map is awkward and expands the app window beyond the screen’s boundaries.",
    "We first connected to a server in Austria which gave us a low download speed of 14Mbps on a 47Mbps testing connection. Switching to a different server required disconnecting from the current one and selecting a new one.",
    "A server in Poland yielded 21Mbps, a US server gave us 12Mbps, while a server in India was only able to perform at 2.2Mbps.",
    "Shellfire is a decent provider, but it doesn't stand out from the pack beyond its proprietary VPN-equipped plug-and-play router, which deploys the new Wireguard protocol.",
    "It also has a free tier that's a bit slow and limited, but works well in an emergency. Other than that, there isn’t much to write home about; the apps are substandard and connections easily interrupted, which isn't the case with top VPNs such as ExpressVPN."
  ],
  "headers": {
    "3": "Price",
    "9": "Alternatives",
    "11": "Streaming",
    "14": "About the company",
    "15": "Privacy and encryption",
    "18": "Support",
    "22": "Speed and experience",
    "26": "Verdict"
  },
  "links": {
    "Shellfire": "https://www.shellfire.net/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "help section": "https://www.shellfire.net/help/",
    "web form": "https://www.shellfire.net/contact/",
    "email": "mailto:hosting@shellfire.de",
    "Twitter": "https://www.twitter.com/shellfire_en",
    "Facebook": "https://www.facebook.com/shellfire.de/",
    "blog": "https://www.shellfire.net/blog/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-1247967905394710000"
  }
}