{
  "source": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
  "title": "Motorola Edge Plus review",
  "category": "phones",
  "updated": "2020-11-06T10:17:08Z",
  "author": "david-lumb",
  "summary": "Motorola returns to the big leagues",
  "verdict": "The Motorola Edge Plus is the first phone Motorola's produced in years to compete with the leading flagship phones, and it's an impressive handset. With three rear cameras and a waterfall display, the Edge Plus is an impressive phone. It's only unfortunate that it's an exclusive phone to Verizon, which reduces its accessibility to those who, well, can only sign up to that US carrier. Pity.",
  "pros": [
    "Great display",
    "sub-6 and mmWave 5G connectivity",
    "Great specs"
  ],
  "cons": [
    "Verizon-only, US-only – for now",
    "Limited zoom capability",
    "Pricey"
  ],
  "article": [
    "The Motorola Edge Plus is Motorola’s first genuine flagship in years, boasting top specs, a gorgeous display, and a trio of rear cameras. With 5G connectivity on tap as well, the phone checks all the boxes to be a serious contender against heavyweights from Samsung, Apple, and OnePlus.",
    "Unfortunately for Motorola, the pricey Edge Plus is launching into a market in which smartphone sales are plummeting – and worse, its limited availability makes it hard to get in the US and elsewhere.",
    "Which is a shame. While the Edge Plus is expensive for a Motorola phone, costing as much as a baseline Samsung Galaxy S20 (in the US at least), it keeps up with its rivals in almost every category – and offers a few unique extras to boot.",
    "Motorola veterans will especially appreciate the brand’s iconic Android skin, which has been faithfully translated to the new phone, along with the traditional Moto Actions: it’s nice to be able to open the camera app with a quick double wrist-twist and take advantage of the triple rear camera, especially the whopping 108MP main shooter, although its 16MP ultra- wide camera and 3x telephoto aren’t bad, either.",
    "The zoom capabilities are on par with those on some other flagships, though not to the length of the best top-tier handsets, making it one of the few obvious areas where the Motorola Edge Plus doesn’t quite outperform the best smartphones out there.",
    "However, as mentioned, in the US at least it’s the same price as the Galaxy S20 – and that means it’s more affordable than the Galaxy S20 Plus or Samsung Galaxy S20 Ultra, while packing the same powerful Snapdragon 865 chipset, 12GB of RAM, and 5G connectivity.",
    "It can connect to both sub-6 and mmWave 5G networks, which should make it even more attractive for customers of multiple carriers. Sadly, though, this is where the phone’s availability undercuts its value – it’s only sold through Verizon in the US, with no plans to release an unlocked version, and global availability hasn't been announced beyond vague plans to release in the UK.",
    "Motorola’s close ties with Verizon have kept its Moto Z-series phones from being sold outside the carrier in the US, but that product line became something of a novelty with its Moto Mod compatibility. Locking the Motorola Edge Plus to Verizon may doom it to the same niche status, which would be great for Motorola fans that stayed with the carrier, but not for folks signed up with Sprint, T-Mobile, or MVNOs.",
    "It's entirely possible that the lower-specced Motorola Edge, which was released in the UK and will be coming to the US soon, could be a lower-priced alternative for consumers who don't want to fork over the cash.",
    "The Motorola Edge Plus is available starting April 30 in the US. It starts at $999 (around £800 / AU$1,550), although in the US it’s only available through Verizon.",
    "In June, Motorola announced that the Edge Plus would be sold in the UK for £1,050, though release date and carrier availability hasn't been released. The brand also hasn’t stated when the Edge Plus will be available in Australia, or elsewhere outside the US.",
    "There’s just one version of the Motorola Edge Plus, so unlike other flagships there’s no pricier model with more storage or RAM. It comes in two colors: a pinkish Smoky Sangria and a dusky, bluish Thunder Grey.",
    "The Motorola Edge Plus has the look and feel of a flagship phone. Gone are the flat glass backs of the Moto Z-series with their Moto Mod-connecting contact strip and the circular camera block. The Edge Plus takes its cues from the Motorola One series, from its sleek designs to its string of multiple rear cameras.",
    "The first thing to notice about the Edge Plus is its size. Or rather, its perceived size: the phone is bare millimeters longer, and actually smaller in width, than the Moto Z4, but its curved-edge display and smaller top -and -bottom bezels make its actual display real estate larger than that of its predecessors.",
    "The display wraps around the sides of the phone to a far greater degree than onin other flagship handsets: while the ‘waterfall’ design is typically associated with Samsung phones, the Edge Plus’s screen actually extends further down the sides than on the Galaxy S20 handsets. Simply put: it looks slick.",
    "That leaves less room for side-mounted physical buttons than on other phones, and the Edge Plus has a razor-thin volume rocker and power button, with ‘razor-thin’ being an appropriate description: they feel just as sharp as those on the new Motorola Razr, although they’re less uncomfortable to press given the larger size of the Edge Plus. In fact, the Edge Plus is larger and thicker than many phones. It’s 9.6mm thick, which is noticeably more than other handsets (the Galaxy S20, by contrast, is 7.9mm), although it’s not overly cumbersome, and you’ll get used to it after handling the phone for a bit.",
    "Freed from the need to be compatible with Moto Mods, the Edge Plus follows the lead of the Motorola One family of phones by stacking its rear cameras at the top-left in a vertical column. It’s not the most elegant arrangement we’ve seen, with the differently-sized lenses jutting out from the camera block, but it’s far from the ugliest we’ve seen. (At least they don’t look like an electric shaver.)",
    "A depth sensor and flash sit adjacent to the camera block, and aside from a polished Motorola logo in the middle, the rest of the back is glass. Very sleek glass. The phone fell off our desk multiple times, and lest we repeat our last terrible mistake, we wedged the Edge Plus behind a keyboard to ensure that it wouldn’t plummet to an ugly end.",
    "The premium finish extends to the top and bottom of the phone, which actually curve inward, a scalloping that nicely complements the waterfall display arcing over the sides. One the bottom of the phone there’s a central USB-C port, flanked by a speaker on the right and a microSD card slot on the left.",
    "On the top there’s just the 3.5mm jack, which will be a welcome feature for many, even if plugged-in headphone cords get in the way when the phone is held sideways (say, when you’re gaming or watching media).",
    "The Motorola Edge Plus’ 6.7-inch OLED display is sharper than its Full HD+ (2340 x 1080p) resolution would suggest.",
    "Aside from its clarity, the display’s notable feature is its curved ‘waterfall’ sides. Motorola has called its version of this feature ‘Endless Edge,’ and it deserves the name more than Samsung’s ‘Infinity Edge’ screens. The Edge Plus’s screen curves down far more on each side than the display on the Samsung Galaxy S20 line, and a little more than the display on the OnePlus 8 handsets. We have a new waterfall screen champion.",
    "Do those curved edges add anything to the phone experience beyond looks? By default, all apps extend over the sides, and we enjoyed the effect – it creates a sense of extra dimensionality, suggesting the display was larger than it looked (you can turn this off for individual apps, if you want).",
    "But you can also set up extra digital buttons on one side while playing games – specifically, two customizable ‘shoulder’ buttons. Other phones have done this before, like the LG V60 ThinQ, though never this successfully, given how much easier it is for your fingers to rest on the side of the Edge Plus’ extensively-curved display. They aren’t especially helpful, but it’s the best implementation of this feature we’ve seen in a phone.",
    "In keeping with other 2020 flagships, the Edge Plus’ display has a 90Hz maximum refresh rate, which can be dialed down to 60Hz – not as fast as the 120Hz on the Samsung Galaxy S20, but faster than the 60Hz standard on most smartphones. This makes scrolling through apps or browsing online articles a much smoother experience, and Motorola seems to have pulled it off a bit more successfully than its competitors: you can’t scroll too fast, making its smoother navigation more noticeable.",
    "The screen also contains an in-display fingerprint sensor, which is fast and reasonably accurate. There’s the odd misread, but for the most part it will pick up registered fingers, in whichever orientation (the same can’t be said for all in-screen sensors: the LG V60’s, for example, requires fingers to be upright in relation to the phone when reading prints).",
    "Previous upper-tier Motorola phones have had decent but not impressive cameras, but the Motorola Edge Plus takes things to the next level with an array of rear cameras fit for a flagship phone.",
    "The standout shooter is the 108MP main camera, which like other 2020 flagship phones can use pixel binning to effectively combine four pixels in one to capture more light at the expense of detail (the resulting photos are 26MP).",
    "The other two cameras are 16MP ultra-wide and 8MP 3x optical telephoto, which extends up to 10x digital zoom. As with most other phones, photos at the long end of the zoom range are somewhat blurred, but herein lies one of the phone’s shortcomings, at least compared to other flagships that manage much farther distances.",
    "Both the Samsung Galaxy S20 and the OnePlus 8 Pro pack a 30x digital zoom – and while nobody’s likely to shoot at these extremes very often, it means photos taken at shorter zoom ranges (like 10x or 20x) come out looking sharp enough to share and post.",
    "For photography at more typical ranges, though, the Edge Plus’s suite of cameras perform well, and it’s only in comparison with other flagships that they don’t quite match up. Much like on previous Motorola phones, the cameras lose clarity in low light: bricks, blades of grass, and other such details are less distinguishable in shadow than they would be in photos taken with a Samsung Galaxy S20, say.",
    "But as long as you’re not taking most of your photos after dusk, the Edge Plus’s cameras keep up. The 25MP front-facing camera similarly struggles more than those on comparable handsets in low light, but is otherwise capable and takes sharp photos.",
    "Motorola has kept its usual interface for its camera app – that is to say, it’s sparse. If you want a mode other than standard photo or video, you’ll have to open a menu to find it. Zooming via the virtual button increments on the left side (0.5x, 1x, 3x) is oddly difficult to tap between these, so we recommend pinching to zoom, but there are some bright spots: it’s easy to activate manual photo mode (tap the ‘M’ button at the top next to the settings cog), and tap the arrow at the bottom to adjust the various settings, from ISO and white balance to focus.",
    "The Motorola Edge Plus packs the same Snapdragon 865 chipset that powers all the Android flagships we’ve seen thus far in 2020. Combined with TKRAM and 256GB of storage (which is not expandable, unlike the Motorola Edge), the Edge Plus has mostly comparable specs to rivals like the Samsung Galaxy S20 range. Its storage limit is a bummer, though.",
    "Thanks to that power the phone is swift in use, breezing through apps and games without a hitch. Its multi-core Geekbench 5 average score of 3,344 is higher than that of the Samsung Galaxy S20 Plus (which returned an average score of 3,304). In real-world terms, that means it can handle anything you throw at it without any sort of hiccup.",
    "There’s no lag when switching between apps, and hardly any when firing up a media stream. Combine this with the dual speakers, tuned by the audio company Waves for a sound that emanates evenly no matter how you spin the phone around, and the Edge Plus is a great media-watching device.",
    "Given that in the US it’s a Verizon-exclusive phone, the Edge Plus can connect to both mmWave and sub-6 5G networks. Since it’s not yet available to purchase in unlocked form, it’s unclear if the phone can connect to 5G networks run by other carriers, whether in the US or elsewhere. Given that there aren’t any global release plans thus far, we can’t say whether we’ll find out if it can work across distinct 5G networks particular to different carriers anytime soon.",
    "The Edge Plus runs Android 10 out of the box, and Motorola fans will be pleased to find that the familiar software skin is back, with many Moto Actions present, from chop-chopping to turn on the (blinding) flash to the twist-twist action that opens the camera.",
    "There’s even a new option for dealing with the tall screen – Action Bar, a floating button hanging over the display’s Endless Edge that you can swipe up or down to navigate or swipe in for app shortcuts. It’s hard to engage, though, leaving us wishing for similar but easier-to-access shortcut tabs on phones like the Galaxy S20 series.",
    "The 5,000mAh battery is another strong feature of the Motorola Edge Plus. We easily got over a day’s use out of the phone before needing to recharge, and that was while running on higher settings: we were able to eke out even more battery life if we tuned the refresh rate down to 60Hz, dialed down the resolution, and lowered the brightness.",
    "The phone’s weakness here is its charger: the 15W Turbo Charger included in the box recharges at about 1% a minute, meaning it’ll take the better part of two hours to fully recharge from empty. Other handsets come with faster chargers can do the same in half the time, or less: we managed to recharge the OnePlus 8 from 10% to full in around 30 minutes.",
    "First reviewed: May 2020"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Motorola Edge Plus price and release date",
    "12": "Design",
    "20": "Display",
    "26": "Cameras",
    "33": "Performance",
    "39": "Battery",
    "41": "Don’t buy it if..."
  },
  "links": {
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Snapdragon 865": "https://www.techradar.com/news/snapdragon-865-phones-list-specs-and-5g-capabilities",
    "Motorola Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "terrible mistake": "https://www.techradar.com/news/why-samsung-galaxy-note-10-needs-a-case",
    "Android 10": "https://www.techradar.com/news/android-q"
  }
}