{
  "source": "https://www.techradar.com/reviews/technics-eah-f70n",
  "title": "Technics EAH-F70N noise-cancelling headphones review",
  "category": "reviews",
  "updated": "2020-04-06T02:32:34Z",
  "author": "harry-domanski",
  "summary": "Great noise-cancelling cans, but no contest for Sony",
  "verdict": "While the Technics EAH-F70N are excellent headphones in their own right thanks to their solid noise-cancelling and stellar audio, they don't quite match up to Sony's competition and aren't as affordable.",
  "pros": [
    "Premium style and comfort",
    "Truly solid sound",
    "ANC almost as good as Sony’s"
  ],
  "cons": [
    "Dated micro-USB port",
    "Uncompetitive battery life",
    "Build doesn’t seem rugged"
  ],
  "article": [
    "Perhaps best known for dominating the DJ turntable industry for the last few decades with its SL-1200 range, Technics has now entered a few pairs of headphones into the fray. The sub-brand of Panasonic was discontinued in 2010 and then revived for its 50th anniversary in 2015. Part of the refresh strategy since then has been to offer up the EAH-F70N as a competitor to the likes of Sony’s WH-1000XM3 and Bose’s QC 35 II – a premium set of noise-cancelling, wireless cans – but can the resurrected Technics compete?",
    "Although the EAH-F70N are well and truly aimed at entering the market alongside Sony and Bose's flagships, they're doing so at a higher retail price these competitors (which, in the US, both retail for $349).",
    "While it could be possible to justify the change given the more 'designer' aesthetic of these cans and the heritage of quality audio that the Technics brand is known for, it's a little harder to justify the increased price when comparing other features such as battery life and the use of a dated charging port.",
    "The F70N certainly looks the part, with the black, silver, and copper colour options all offering a refined, clean aesthetic that exudes class. Tidy lines and minimal metallic trim on smooth plastic makes for quite a striking headphone design – stylish and premium while avoiding anything more garish. The Technics branding is laser-engraved and colored in on the metal exterior plate.",
    "It’s certainly a safe look overall and doesn’t seem as ‘designer’ as the Bose Noise Cancelling Headphones 700, for instance, but it won’t clash or date as easily either. The same is true for its faux-leather softshell case, which offers two neat internal pouches for any cabling and smaller adapters that you may want to take on the go.",
    "The headphones collapse in order to fit in their case and do get rather compact when folded, although when worn around the neck, the earcups swivel outwards rather than inward so they won’t rest flush with your chest.",
    "Overall, the construction of these Technics cans is on the light side – predominantly made from plastic, they sit comfortably on the head but it’s hard to say how long they’d withstand the wear and tear of everyday use. We’re especially wary of the hinges, with both the swivelling joints that connect the band to the cans and the 3D ball joint mechanisms that allow the cups themselves to freely swivel offering potential weak points. These same hinges are responsible for some unfortunate squeaking and creaking noises when walking or even simply rotating your head, although this is obviously less evident when cranking up the tunes.",
    "They weigh in at only 292 grams and this, in combination with the pleasant cushioning in both the headband and ear cups, makes for one of the more comfortable cans on the market. The shape of the cups may feel a little snug for some, but their passive noise-isolating abilities are top notch as a result and the relatively low weight of the headphones don’t lead to the sensation of your skull being crushed.",
    "To match its sleek aesthetic, the F70N has a minimal control scheme as well. This does wonders for their appearance but can be rather finicky to locate and use when wearing the headphones. There’s a volume rocker that you can slide up or down to adjust levels, and this same control is clicked in to play, pause, skip, or rewind tracks. While we appreciate the focus here, the lever itself is a little on the loose side – dedicated transport controls would’ve gone a long way.",
    "Naturally, the audio quality of a pair of headphones is going to make or break them when it comes to a value proposition, and if it’s exceptionally good it can help forgive other design flaws. These Technics sound great overall, offering a well-balanced sound that doesn’t lean too far in any extreme to raise concern.",
    "The bass isn’t quite as prominent as the warmer signature of most Sony competition and certainly won’t satisfy those seeking head-shakers, but it’s still clear, clean and separated well in the mix. Similarly, the sub-bass never feels too overbearing and doesn’t distort or muddy the mix. The low-mid frequencies are a little recessed and the upper mids are comparatively boosted, while the top-end is missing some of its airy quality, giving it a similarly compressed feeling to a pair of Beats by Dre.",
    "This combination makes these headphones great for listening to tightly produced, modern electronic pop music, with tracks like Stardew by Purity Ring offering plenty of power when switching from delicate and spatially separated moments to the lush and driving choruses. Tracks with a more classic hip-hop bent really shine as well, with Four Tet’s remix of Great Day by Madvillain offering clearly present vocal verses and delivering real impact when the punchy sampled drum breaks land.",
    "The overall clarity and sense of space offered by the F70N is impressive and definitely holds up against Sony and Bose competitors. While this reviewer prefers the Sony WH-1000XM3 profile overall, the Technics offers some middle-ground between the somewhat treble-skewed sound of Bose’s latest cans and the punchy, squashed signature of Beats.",
    "This solid audio quality is, at least in part, thanks to the F70N’s support for a wide variety of audio codecs. This includes Qualcomm’s aptX and aptX HD, Sony’s LDAC, and Apple’s AAC, amongst others. If your source audio is uncompressed, this is great news for those connecting over the headphones’ Bluetooth 4.2 connection.",
    "In our experience testing these Technics, we never once experienced a drop-out, stutter or other interruption to the Bluetooth signal – even at our go-to busy intersection that forces many other Bluetooth devices to falter – so we don’t expect the stability of wireless connectivity to be an issue.",
    "As for other connectivity, there’s a 3.5mm port if you’d prefer to hook up with any of your cabled audio kit or if the battery’s out of juice. The battery takes 20 hours to deplete with noise cancelling enabled, which is fair but not as impressive as Sony’s 30 hours on the WH-1000XM3.",
    "To charge the F70N, you’ll need to plug in via micro-USB, which is disappointing to see in a pair of cans that are supposed to be in the more premium end of the market. Compared with USB-C, this format isn’t as sturdy in its physical connection, lacks the fast-charging capabilities, and is less future-proofed as more devices move towards USB-C as a standard.",
    "For those seeking some quietude from the outside world, we’re pleased to say that these headphones offer excellent active noise cancelling. While it isn’t quite as powerful as the adaptive variant found on Sony’s WH-1000XM3, it’s as close as we’ve found on the market today. With that said, it’s worth noting that they seem significantly more susceptible to wind noise when in an environment with anything beyond a gentle breeze, likely due to the positioning of the external microphones.",
    "The ANC is available in three different intensity levels, so if you’re not such a fan of the vacuum-like extreme setting, you can dial it back a notch or two. Functioning much the same way as the rival Sony’s, the Technics have an Ambient Sound Enhancer that’s activated when you cover the right ear cup with your hand. This allows you to hear any amplified signal of sound detected by the external microphones to quickly pay attention to your environment. This works remarkably well and should be a standard feature on all ANC headphones.",
    "Another feature that is increasingly showing up on wireless headphones is a playback sensor that pauses or plays your music when it detects that you’ve removed them from your head. In almost all cases we’ve tested this feature, the results weren’t reliable enough to deem it genuinely helpful and so we eventually disabled it – unfortunately this is true of the Technics as well, although we couldn’t find a way to turn it off. We found music arbitrarily pausing when the F70N were still on our head, and occasionally continuing to play when we took them off and placed them on our desk. This is one of those features that requires total trust in order to become a natural part of using the device, and it isn’t quite there yet.",
    "There’s a lot going for these Technics cans, but they’ve joined a market that has a very clear leader – the Sony WH-1000XM3. Nothing that’s come out in its price bracket over the last 20 months has shaken it from its dominant position, and unfortunately that’s true of the F70N as well.",
    "Design choices such as the micro-USB port and creaking plastic hinges definitely diminish its otherwise premium sheen. Other misses like the flaky playback sensor and the susceptibility to wind noise are much easier to forgive but might tip the scales for some buyers.",
    "That said, they’re great headphones in their own right, sporting excellent punchy sound, lightweight comfort, tidy portability, and a premium aesthetic, so if you find them discounted and are chasing a tasteful alternative to the Bose and Sony options, they’re definitely worth checking out."
  ],
  "headers": {
    "1": "Pricing",
    "3": "Design",
    "9": "Audio",
    "13": "Features",
    "20": "Final Verdict"
  },
  "links": {
    "SL-1200 range": "https://www.techradar.com/news/technics-upgrades-its-famous-dj-turntable-with-the-sl-1200-mk7",
    "Sony’s WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Bose’s QC 35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review"
  }
}