{
  "source": "https://www.techradar.com/reviews/teamgroup-pd400-960gb-external-ssd",
  "title": "Teamgroup PD400 960GB external SSD review",
  "category": "computing",
  "updated": "2020-07-02T15:01:03.056Z",
  "author": "desire-athow",
  "summary": "An intriguing newcomer to our test lab",
  "verdict": "The Teamgroup PD400 earns some great marks thanks to a combination of great design, ruggedness, good performance and rock bottom price. If anything, this entirely adequate unit proves that you can't really go far wrong when purchasing an external SSD.",
  "pros": [
    "Cheapest external SSD per GB",
    "IP66 rating",
    "Great design"
  ],
  "cons": [
    "Average performance"
  ],
  "article": [
    "External solid state drives are slowly taking over from portable hard disk drives; there is still a price premium but the performance gains, the power savings, the significantly smaller footprint and superior resistance to shock (and elements) means that even a $40 price difference for a 1TB model can be seen as an acceptable compromise.",
    "We have covered Teamgroup a fair few times in the past in our deals section but have never actually reviewed them. That’s now changed with the PD400 which they sent over to us; this is their mainstream external solid state drive with a top capacity of 960GB, which is the one we’re reviewing today. In addition, the PD400 is available in 240GB and 480GB models.",
    "At $89.99 (after a coupon) at Amazon at the time of writing, the one we reviewed today is the cheapest SSD per Terabyte, a position it jointly holds with the Silicon Power PC60. And yes, this is no typo, those two drives cost less than the cheapest internal solid state drive right now and that’s down to the economies of scale.",
    "The drive looks like a bigger version of the Samsung T5; they share the same brushed metallic finish, the minimalist design, the Type-C connector and the rounded edge chassis. At 83.1 x 65.5 x 13.2 mm and weighing 100g, it is heavier and bigger with a navy blue and gold colour scheme. The PD400 comes with two cables, one with a Type-C connector and the other one with a type-A for legacy compatibility. Both are braided for added strength and are around 30cm in length.",
    "The drive is IP66 rated, meaning that it is water repellent (but not waterproof), dustproof and also shockproof. It is resistant to accidental spills from common liquids, such as soda, beer, coffee, tea and juice. In the event of a spill, Teamgroup suggests wiping the affected area gently with a wet paper towel, then wipe dry the external hard drive.",
    "We can’t open the drive but based on the capacity and the rated performance (430MBps/420MBps on read/write speeds), we can posit that it is a variant of the L5 Lite 3D, an entry level Teamgroup SSD, which sports similar performance.",
    "The latter comes with a Silicon Motion SM2258G controller that is not DRAMless and comes in capacities that are multiples of 120, similar to the PD400 with the 3D NAND chip inside likely to originate from Kioxia, formerly known as Toshiba.",
    "Note that the drive comes with a three-year warranty and although the endurance of the drive is not disclosed, one can assume that it will be around 120TB written or roughly, 0.11 drives per day written (DPDW). Remember that the PD400 only offers USB 3.2 Gen 1 which is limited at 5Gbps and that it doesn’t include any bundled software",
    "Formatting the drive left us with 894GB of usable storage space. The PD400 managed to hit 457/437MBps on Crystal Disk Mark, which as usual, was our most optimistic benchmark. On AJA, numbers were a bit more muted at 406/415MBps while Teamgroup’s entry reached 416/438MBps on ATTO on the default settings. AS SSD numbers were slightly worse at 405/422MBps.",
    "To cap it all, transferring a 10GB file took 37 seconds which translates into a real life sustained transfer speed of 270MBps which should be sufficient for most mundane jobs. If you want more oomph, you will have to go for either a USB 3.2 Gen 2 drive or a Thunderbolt 3 model, both of which are, well, far more expensive.",
    "There’s hardly any competition at this price point; the Silicon Power PC60, an Editor’s choice, is the only one that we know of, that can match the PD400. It has a more conservative design with a plastic finish, a keyhole design and better overall performance. It is rugged but sadly not IP-rated.",
    "For an extra tenner, the Adata SD600Q is lighter and meets the MIL-STD-810G 516.6 standard. It is a smidgen faster than the PD400 on paper but does not have a Type-C connector. On the flip side, it comes in three colours.",
    "If you want speed but don’t want a big price tag, then consider the SE800 from Adata, We gave this external SSD a 5/5 rating because it is fast, compact, has a Type-C connector, is reasonably sturdy and waterproof. At $140 at Newegg at the time of writing, it is also damn affordable, the cheapest fast 1TB SSD on the market.",
    "Teamgroup’s mainstream external solid state drive is aimed at those who want to get a portable storage device on a tight budget and to be honest, it is a toss between the PD400 and the PC60 at the moment with the latter winning thanks to the performance difference.",
    "We like the fact that the PD400 is very well built and that its metal, aluminum alloy chassis is great to dissipate heat coming from the NAND chips inside. Remember that they are both priced the same and come with the same 3-year warranty.",
    "The PD400 has been tested to withstand weights of up to 1,000kg, something that PC60 can’t match. If speed is of the essence then we’d suggest taking a look at the just released PD1000 which is totally waterproof (IP68 rated) and can reach up to 1GBps thanks to its USB 3.2 Gen 2. Oh and it looks a bit like the Adata SE760."
  ],
  "headers": {
    "3": "Design",
    "5": "Hardware",
    "8": "Performance",
    "10": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "External solid state drives": "https://www.techradar.com/news/best-portable-ssd",
    "portable hard disk drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Silicon Power PC60": "https://www.techradar.com/reviews/silicon-power-pc60-960gb-portable-ssd",
    "Samsung T5": "https://www.techradar.com/reviews/samsung-portable-ssd-t5",
    "Adata SD600Q": "https://www.techradar.com/reviews/adata-sd600q-ruggedized-external-ssd",
    "At $140 at Newegg": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1350688845854679800&murl=https%3A%2F%2Fwww.newegg.com%2Fadata-se800-1tb%2Fp%2FN82E16820215332",
    "Adata SE760": "https://www.techradar.com/reviews/adata-se760-external-ssd"
  }
}