{
  "source": "https://www.techradar.com/reviews/sony-srs-xb23-portable-bluetooth-speaker",
  "title": "Sony SRS-XB23 Portable Bluetooth Speaker review",
  "category": "audio-visual",
  "updated": "2020-05-18T20:40:19Z",
  "author": "nick-pino",
  "summary": "Sony’s much-improved Bluetooth speaker can hang with the best of ‘em",
  "verdict": "The entry-level Sony SRS-XB23 boasts a new design that moves the passive radiators to the top and bottom of the speaker with promising results. It doesn’t have the best sound quality in its class, but despite that it seems like an affordable outdoor speaker that most people will love.",
  "pros": [
    "Good sound quality...",
    "Competitive price",
    "Stereo pairing and Party Mode"
  ],
  "cons": [
    "...but not the absolute best",
    "Lower peak volume",
    "Unclear battery level alerts"
  ],
  "article": [
    "It hasn’t been long since Sony unveiled its updated line of 2020 Bluetooth speakers, but they’ve quickly garnered a lot of attention for their performance and value.",
    "The zenith of that performance-to-dollar ratio is the entry-level Sony SRS-XB23, a $99 (around £80, AU$150) portable outdoor speaker that features an IP67 rating and a 12-hour battery life.",
    "It might not sound quite as good as, say, the Ultimate Ears Wonderboom 2, one of the best Bluetooth speakers in 2020, the Sony SRS-XB23 is still an affordable outdoor speaker with a few hidden features that most people will love.",
    "The Sony SRS-XB23 will launch this summer– most likely June or July – for $99 (around £80, AU$150) and will be available in five colors: Coral Red, Olive Green, Light Blue, Taupe and Black.",
    "Along with the Sony SRS-XB33 and Sony SRS-XB43, the Sony SRS-XB23 makes up Sony’s 2020 Extra Bass Bluetooth speaker lineup and will probably be around until May 2021 when it's be inevitably replaced with the XB24.",
    "Sony has made some major modifications to its entry-level speaker in 2020. For starters, the design is a cylinder instead of an elongated oval and the passive radiators have been moved to the top and bottom for maximum dispersion.",
    "The outside of the speaker is covered with a mesh grille that covers two Mica Reinforced Cellular (MRC) speaker cone drivers that are now more oblong-shaped than circular that Sony, in an interview with TechRadar, say are key to the speaker’s improved performance.",
    "In terms of size and weight, the speaker is fairly manageable at 3 x 8.6 inches (76 x 218mm, D x H) and 1.3 lb (580g). It’s pretty much the perfect size for a cup holder or an arm rest’s drink holder and weighs so little that it won’t slow you down on a long hike.",
    "Around the back you’ll find the speaker’s playback controls (play/pause and volume up/down) as well as two neat features like Stereo Pairing that allows you to assign each speaker to a left-right channel and Party Mode that allows you to chain up to 100 Sony speakers together. Obviously, you’ll need to buy additional speakers to make these modes work, but their inclusion allows you to get pretty creative with your setup.",
    "While Sony would never admit to it, it feels like it’s taken a lot of design cues for this year’s entry-level SRS-XB23 from Ultimate Ears’ lineup, especially with the new top bungee strap that allows you to hang the speaker from a carabiner, shower nozzle, tree branch or fencepost depending on where you use it. Ultimate Ears wasn’t the first to use it and can’t claim any exclusivity over a primarily utilitarian feature, but it’s worth calling attention to the design inspiration for the sake of transparency.",
    "Another point worth calling attention to is the speaker’s IP67 rating that makes the new XB23 completely dustproof and waterproof up to one meter – this has some obvious advantages in an outdoor speaker, so it’s great Sony has kept up the specifications.",
    "Speaking of updated specifications, this is the first year the Extra Bass speakers are using USB Type C connectors instead of Micro-USB, which allow most of us to carry around a single charging cord for both our phone, headphones and Bluetooth speakers instead of carrying one for every device.",
    "Last but not least, the XB23 uses Bluetooth 5.0, the latest standard, and supports three major codecs – SBC, AAC and LDAC, the latter of which you’ll find on newer Android devices and sounds absolutely great.",
    "To put the Sony SRS-XB23 through its paces, we lined it up against some of the competition and asked family and friends to tell us which of the speakers sounded better, without telling them which of the speakers were which. It was unanimously agreed that the Wonderboom 2 sounded better than the Sony XB23, but only because it seemed to have a larger soundstage, higher peak volume and better bass response that filled the room.",
    "If you don’t have another Bluetooth speaker in the same room to compare it to, however, you’ll probably be blown away by the SRS-XB23 – it can get pretty loud without a massive amount of distortion and the passive radiators help the bass to sound clearer than it has on any of Sony’s previous models.",
    "Connecting it to a Google Pixel 3a XL allowed us to test the speaker with the LDAC codec streaming MQA files from Tidal – all of which sounded full, robust and powerful. As hard as this is to believe, we could’ve actually used a bit more bass from Sony’s Extra Bass lineup but, for its first outing, the two cone driver, two passive radiator system is a big success.",
    "In terms of battery life, Sony promises about 12 hours of playback on a full charge but that’s the average when listening to music at 50% volume. Because of the strenuous testing we put the speaker through we only got around seven to eight hours off the first charge – but that was with the sound at 80-90% max volume. Keep these to a dull roar and you should probably hit close to the expected 12-hour battery life Sony’s promising on the box.",
    "What did chafe us a bit, though, was the speaker’s inability to tell us exactly how much juice was left, only telling us repeatedly to charge the speaker when it crossed below the 30% battery life mark. Not only was it annoying to have the speaker constantly interrupt us to say that it needed to be charged, but we were even more annoyed by the fact that the speaker didn’t simply tell us that there was, say, 10% battery life left.",
    "The good news is that the speaker charges slightly faster than Sony claims it will in the instructions (it said four hours in the instructions, but only took around two) and, if you absolutely need the extra juice, you can use the Sony Music Center app to put the speaker into Stamina Mode that conserves the battery at the cost of sound quality.",
    "Having tested a Sony Extra Bass Bluetooth speaker every year for the last four years, we can say with confidence that this is the company’s best yet in terms of performance-per-dollar. Moving up the chain to the Sony SRS-XB33 or SRS-XB43 are sure to bring even better performance and probably do sound as good or better than the competition. That said, the XB23 is a great value option for all."
  ],
  "headers": {
    "3": "Price and release date",
    "5": "Design",
    "13": "Performance",
    "19": "Final verdict"
  },
  "links": {
    "2020 Bluetooth speakers": "https://www.techradar.com/news/sonys-2020-portable-bluetooth-speaker-lineup-brings-the-bass-with-side-firing-subwoofers",
    "Ultimate Ears Wonderboom 2": "https://www.techradar.com/reviews/ultimate-ears-wonderboom-2",
    "best Bluetooth speakers in 2020": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Google Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "MQA files": "https://www.techradar.com/news/phone-and-communications/mobile-phones/mqa-explained-brilliant-quality-tunes-in-tiny-file-sizes-1322754",
    "Tidal": "https://www.techradar.com/reviews/tidal"
  }
}