{
  "source": "https://www.techradar.com/reviews/ifi-hip-dac",
  "title": "iFi hip-dac review",
  "category": "audio-visual",
  "updated": "2020-08-20T16:21:14Z",
  "author": "olivia-tambini",
  "summary": "The iFi hip-dac really hits the spot",
  "verdict": "The iFi hip-dac is a great choice if you’re looking for a portable DAC that looks as good as it will make your music sound. With plenty of connectivity options and codecs supported, it’ll make the best headphones sound even better, thanks to ‘bit-perfect’ digital-to-analogue conversion and a nifty bass-boosting button. It’s a shame that it doesn’t also have Bluetooth support and that Apple users need to buy an additional cable to use it, but overall, the hip-dac is a fantastic piece of audio kit.",
  "pros": [
    "Great design",
    "Support for lots of Hi-Res Audio codecs",
    "Balanced output as well as 3.5mm"
  ],
  "cons": [
    "No wireless connectivity",
    "A little big compared to competitors"
  ],
  "article": [
    "The iFi hip-dac, is simply put, the best-looking portable DAC we’ve ever seen – and it performs pretty well too.",
    "iFi is a big player in the world of portable DACs (digital-to-analogue converters), which for the uninitiated, are designed to improve the sound quality of your smartphone, laptop, tablet, or MP3 player.",
    "While these devices contain DACS themselves, an external DAC is designed to make your music sound great, as well as driving power-hungry premium headphones – in short, a portable DAC is a crucial part of any audiophile’s arsenal.",
    "Coming in at $149 / £149 / AU$249, the iFi hip-dac isn’t too pricey for the specs it offers, and it looks great, to boot. Its luxurious petroleum-blue and copper finish alongside its hipflask-like design (hence the name) means it is, weirdly enough, a DAC you really want to show off – and it’s small enough to slip into your pocket with ease.",
    "While there’s no support for Bluetooth, there are lots of connectivity options and it supports pretty much every codec you could think of, meaning all your Hi-Res Audio needs should be met.",
    "The iFi hip-dac also employs a Burr-Brown DAC chip, which the company claims ensures audio formats stay \"bit-perfect\" right through to analogue conversion, as well as eradicating digital distortion.",
    "A PowerMatch button means that the iFi hip-dac can drive just about any headphones with ease – although very power-hungry cans can reduce the stated battery life of 8 – 12 hours significantly.",
    "We were impressed by just how much of a difference the hip-dac made to the sound of our headphones; even when using some of the best headphones we’ve ever tested, the not-quite-audiophile grade Sony WH-1000XM3s, the uptick in audio quality was palpable. The soundstage was wide, with clear, detailed trebles, smooth mids, and powerful bass frequencies.",
    "We chose these wireless headphones in particular because while they’re popular and widely available, they offer decent-enough sound quality to appeal to anyone who’s serious about audio, as well as casual listeners who may be in the market to buy their first portable DAC.",
    "A word on the bass – there’s a nifty ‘X Bass’ button on the hip-dac that elevates the lower frequencies, and it works really, really well. Sure, you may find the resultant sound a little bass-heavy, but don’t we all love blasting the bass from time to time?",
    "Arguably, there are better portable DACs on the market, in terms of price, size, connectivity, and extra features like Bluetooth support. But in terms of style and sound? To the audiophile, the iFi hip-dac is just as a fine glass of whiskey is to the drinker – it hits the spot.",
    "The iFi hip-dac was launched in February 2020, and is available to buy for $149 / £149 / AU$249.",
    "That's cheaper than our top-rated portable DAC, the iFi xDSD, however, the XDSD does offer Bluetooth connectivity, so that lower price is to be expected.",
    "Saying that, the hip-dac is the same price as the Audiolab M-DAC Nano, which provides wireless connectivity with aptX, aptX Low Latency and AAC codecs all accounted for.",
    "The iFi hip-dac takes its name from its design; it looks just like a hip flask, but instead of finding alcohol inside, you’re getting a high-spec DAC, complete with volume control dial that looks just like the cap on the top of a flask.",
    "It’s small enough to slip into your pocket, though not as compact as the M-Dac Nano; saying that, you’ll probably want to show off this good-looking headphone amp.",
    "Kitted out in an opulent petrol-blue finish with copper accents, the hip-dac looks pretty different from most of its counterparts, imparting a sense of luxurious style alongside its high-spec innards.",
    "At the top of the iFi hip-dac, you’ll find a power match and bass-boosting buttons, the aforementioned volume control dial, and two headphone ports; one conventional 3.5mm headphone port, and one 4.4mm balanced headphone port, for use with a balanced connection.",
    "Unusually, the bottom of the DAC features a ‘male’ USB Type A port, which iFi claims provides \"greater mechanical integrity\" than the more common ‘female’ USB ports found in its competitors.",
    "For Apple users, you’ll need to use a Lightning to USB camera adaptor to hook the hip-dac up to your iPhone (sold separately by Apple itself), while Android users will be able to use the included USB OTG (on-the-go) cable. It’s slightly annoying that there’s an extra cost involved for iPhone users, but you do also get a USB Type A and USB Type C cable in the box, so most devices should be covered. iFi shouldn’t be penalized for Apple’s insistence on proprietary cabling, though.",
    "Like other portable headphone amps, the hip-dac is made to replace the amp circuitry inside your smartphone, tablet, laptop, or computer, to improve the sound of your wired headphones.",
    "Using a Burr-Brown DAC chip, the iFi hip-dac ensures digital audio formats stay \"bit-perfect\" right through to analogue conversion, which is unusual for headphone amps – and with support for PCM, DSD (both of which are supported at sampling rates up to 384kHz), MQA (the Hi-Res Audio codec used by Tidal Masters), and other codecs, so you’ve got pretty much the entire world of music listening at your fingertips here.",
    "This DAC chip, alongside 'clock-locking' technology and iFi's own firmware, is designed to eradicate digital distortion, keeping the signal intact until it's converted to analogue.",
    "iFi claims that the hip-dac is capable of delivering over 700mW from the balanced output – while this depends on the impedance of the headphones you're using, it's an impressive number.",
    "Using the Power Match button, you can tailor the level of drive to whatever headphones you're using; for example, if you're using over-ear headphones, which typically require more drive, you can press the 'PowerMatch' button on the front of the DAC to increase the gain.",
    "There's also a bass boost button that enhances lower frequencies in the analogue signal, rather than using digital signal processing, which can reduce the accuracy of the resulting sound.",
    "Battery life comes in at 8 – 12 hours, varying depending on how power-hungry your headphones are – for the most insatiable cans, you might not get more than four hours. An LED on the top of the hip-dac gives you an indication of how much juice you have left, so you shouldn’t be caught out with no battery left.",
    "We hooked the iFi hip-dac up to our Sony WH-1000XM3s, using the USB OTG cable to connect it to our Nokia 7.2 (which, incidentally, is also a petrol-blue color, making the whole setup pretty pleasing to the eye).",
    "There’s not much point in using a DAC with these capabilities unless you’re going to check out its Hi-Res Audio offerings, so we loaded up the Qobuz app and set it to play in Hi Res 96.0 kHz.",
    "The hip-dac provides a detailed, well-balanced sound, and while listening to Miles Davies’ Yesternow, we were impressed by how the portable DAC worked in tandem with our XM3s to accurately navigate complex harmonic changes, lightly brushed percussion, and wah-wah laden guitar licks.",
    "Jagged trumpet accents never sounded too harsh, with just the right amount of punch behind them.",
    "Moving on to Joanna Newsom’s Sawdust & Diamonds, intricate harp melodies had a sweet, mellow quality, while Newsom’s distinctive vocal sounded rich and clear.",
    "If you like your music really bassy, the X Bass button does a fantastic job – listening to The Knife’s Heartbeats, it was incredibly thumpy and powerful. Now, for most audiophiles, those lower frequencies will be far too pronounced, but we’d be lying if we said we didn’t enjoy turning the bass up to full whack.",
    "In any case, the soundstage is wide enough to handle it, with plenty of room for all the instruments to really shine. Of course, a lot of the hard work is done by the headphones you use, and mileage will vary based on the quality of the headphones you pair with the DAC, but the boost in audio quality when using the hip-dac is palpable."
  ],
  "headers": {
    "0": "One-minute review",
    "11": "iFi hip-dac price and availability",
    "14": "Design",
    "20": "Features",
    "27": "Audio performance",
    "34": "Don't buy it if..."
  },
  "links": {
    "portable DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629",
    "MP3 player": "https://www.techradar.com/news/best-mp3-players-techradars-guide-to-the-best-portable-music-players",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Nokia 7.2": "https://www.techradar.com/reviews/nokia-72",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}