{
  "source": "https://www.techradar.com/reviews/hp-omen-obelisk",
  "title": "HP Omen Obelisk review",
  "category": "computing",
  "updated": "2020-11-14T00:49:37Z",
  "author": "michelle-rae-uy",
  "summary": "Tricked out stunner for the hardcore gamer",
  "verdict": "If splurging on a gaming PC is your next investment move, the HP Omen Obelisk is a powerhouse to consider. Its very modern chassis touts a twist of nostalgia as well as powerful, high-end specs that diehards demand in their gaming machine.",
  "pros": [
    "Lots of power",
    "Appealing, tool-less design",
    "Highly upgradable"
  ],
  "cons": [
    "Software offer minimal personalization",
    "Base model hardly future-proof"
  ],
  "article": [
    "For something so simple, the HP Omen Obelisk is surprisingly attractive. With its glass side window and obelisk-inspired facade trimmed with the renegade Omen logo, it’s got a lot of style in its otherwise straightforward chassis. This is an appealing gaming PC that isn’t so over-the-top in its gaming aesthetic that it ends up looking gaudy.",
    "But, how does it fare against its powerhouse brother, the HP Omen Desktop PC. The Obelisk looks good, for sure, and it fits perfectly on the desktop of a gamer who values elegant design, but a gaming PC can’t just get by on looks alone. Can it match the Omen Desktop’s brute strength when you're playing the best PC games?",
    "Short answer is yes. The long answer… well, it’s more complicated once you look at pricing, specs and its available configurations. The Omen Obelisk plays games like butter, but only if you’ve splurged on its innards. If you only have enough budget for one of the cheaper configurations, it might not be powerful enough.",
    "The good news is the HP Omen Obelisk is expected to get some decent discounts on Black Friday and Cyber Monday. If you're not completely convinced, we recommend waiting until then to hit that buy button until Black Friday and Cyber Monday roll around at the end of November.",
    "Thundering specs help put our review model of the HP Omen Obelisk on the gaming PC map. It swaggers with an 8th generation Intel Core i7, 32GB RAM, 512GB SSD + 1TB HDD storage and the Nvidia GeForce RTX 2080 – a GPU far superior than the 1080 and has advantages over the 1080 Ti that was in the Omen Desktop we reviewed a while back. This configuration is unsurprisingly expensive at $2284, which includes the glass side window so you can showcase those amazing specs every chance you get. Although, at the time of the review, HP did knock $200 off the price and will most likely do so again.",
    "A similar configuration is on hand in the UK with a couple of differences: it has half the memory, at 16GB, and a storage combo of 256GB SSD + 2TB HDD. That configuration, which is the most expensive in the UK, sets you back £1,899, which makes it more or less $100 pricier than its US counterpart.",
    "Unfortunately, Australian buyers won’t find a similar configuration. The closest you can get is an HP Omen Obelisk at AU$2,999, with considerably lower specs: AMD Ryzen 7 2700, Nvidia GeForce GTX 1060, 16GB RAM and 256GB SSD+2TB HDD storage. It’s the most expensive option as well as one of the only two configurations available in Australia, the other being featuring an AMD Ryzen 5 2600 CPU, 128GB SSD+1TB HDD storage, along with the same GPU and RAM for AU$2,799.",
    "If you want to completely splurge on the specs in the US, you can kit the HP Omen Obelisk out with an Intel Core i9, 64GB of RAM, 512GB SSD + 3TB HDD + 3TB HDD, and the Nvidia GeForce RTX 2080 Ti for a whopping $3,723.",
    "Going down to the entry-level in the US, and you’ll find a $700 configuration featuring an AMD Ryzen 5 2500X CPU, Nvidia GeForce GTX 1060, 8GB RAM and 1TB of HDD storage. It’s far from being a game-changer. If you want to save some money and still have a quality gaming experience, upgrading this to boast an AMD Ryzen 5 2600 CPU and 16GB RAM will only cost you $190 more and give you solid AAA gaming on medium to high settings.",
    "On the other hand, the entry model in the UK has an Intel Core i5, Nvidia GeForce GTX 1060, 8GB RAM, 128GB SSD+1TB HDD storage and the glass side window. It will set you back £899.",
    "Those who are more partial to over-the-top gaming looks might find the HP Omen Obelisk’s aesthetic a tad underwhelming. Not that it doesn’t have gaming flair of its own – you can upgrade to a glass side panel so you can show off the innards, spotlighted by the RGB lighting on the chassis ceiling. The facade has its upper and lower sections tapered, reminiscent of the type of monument its named after, with the RGB-lit Omen logo etched on the upper section. Finally, the RGB lighting in both spots are customizable via the Omen Command Center software, which we will discuss in detail later.",
    "Beyond that, however, the Omen Obelisk doesn’t have any design frills, which we honestly appreciate. We also like it better than the Omen Desktop’s aggressive Decepticon look. It reminds us of the old towers we use to have in the '90s, in that it’s a straight up rectangular tower – except it’s painted black, it’s classier and has the aforementioned trims for a modern aesthetic. Additionally, unlike the Omen Desktop, it’s slim rather than bulky.",
    "Like the Omen Desktop, it boasts a tool-less design, even if it isn’t as extensive. The side panel pops open effortlessly; all you need to do is press the large, textured button on the back. This gives you easy access to the interior, especially if you’d like to upgrade or customize. The two hard drive bays located behind the front panel use tabs to lock the hard drives in place and pop them out quickly should you need to. In the spirit of upgradability, it’s made to micro-ATX standards so you can easily do so with many aftermarket parts.",
    "The HP Omen Obelisk has a diverse number of available ports, also like the Omen Desktop, with some in the front and a few others in the back so you have several different ways of connecting your different peripherals and devices.",
    "The only thing we don’t like about the Omen Obelisk’s design is the fact that it’s missing the top handle, perhaps to maintain the minimalist aesthetic. This exclusion is a little disappointing, as it makes the PC much harder to pick up and carry around. To do so, you’d have to pick the whole thing up from the bottom.",
    "Our review unit does come with its own keyboard and mouse. They’re definitely not ideal for gaming, but since most, if not all, gamers invest in peripherals specifically designed for gaming, anyway, getting into details about these isn’t necessary.",
    "Because the HP Omen Obelisk has three main configurations that are pretty distinct, it’s hard to generalize the performance of this gaming PC. For this review’s sake, therefore, we’ll focus on our review unit, which, while souped up, isn’t the most expensive option available in the US.",
    "One awesome thing about this Omen Obelisk configuration is that it touts the new Nvidia GeForce RTX 2080. This, we want to mention again, is a GPU far superior than the 1080 and has certain advantages over the 1080 Ti that the Omen Desktop has. Not only does it run faster, but its Turing architecture also allows for real-time ray tracing and deep learning supersampling (DLSS), which is an improvement over traditional Temporal Anti-Aliasing.",
    "While ray tracing is not currently being utilized in many games, this functionality does make the RTX 2080 future-proof, as well as a powerhouse when handling demanding, AAA games on Ultra settings and high resolutions.",
    "HP pairs this GPU with an 8th Generation Intel Core i7 and 32GB RAM, both designed to handle very demanding games and applications, to guarantee top-notch gaming performance.",
    "We do see some minor frame drops in Total War: Warhammer II, but it also averages close to 65 frames per second (fps) on Ultra, which is good. There are also a couple of frame drops in Shadow of the Tomb Raider, but it also averages at 117 fps on Ultra.",
    "In other AAA games, however, everything plays like butter. Whether we’re playing Shadow of the Tomb Raider, Final Fantasy XV, The Witcher 3, Sekiro, Far Cry 5, Assassin's Creed Odyssey, Total War: Warhammer 2 or Hitman 2, we run into almost zero issues, even with all maxed out settings. That is, we don’t experience any latency or tearing, only smooth movements and rock-solid performance. Hitman 2 did crash on us just once, but only once.",
    "Honestly, our only regret is that we can’t test it with the HP Omen 27 Gaming Monitor, which can be overclocked to 165Hz and has G-Sync technology.",
    "Not all of the HP Omen Obelisk’s configurations are future-proof, but our review configuration definitely is, as well as some higher end configurations that are not as pricey. It is, however, highly upgradeable, not only because it has a tool-less design, but also because of its micro–ATX compatibility. This allows you to configure and upgrade with aftermarket parts, or at least those that are micro-ATX compatible.",
    "There’s also space for a liquid cooled radiator to help keep CPU thermals in check, making it better for overclocking. And, the HP Omen Obelisk supports up to a 1300W power supply in case you want to upgrade with parts that require more power.",
    "Unfortunately, as far as customizations via the Omen Command Center, there’s not much you can do.The Omen Obelisk only has Lighting Control and Network Booster on hand, the former to let you set the animation and color for the RGB lighting in front and inside the chassis, the latter allowing you to set network priorities and boost bandwidth usage for running programs.",
    "It doesn’t, however, give access to overclocking, and only displays GPU, CPU and memory utilization for monitoring. It’s missing the Overclocking section that the Omen Desktop has access to.",
    "The HP Omen Obelisk configuration reviewed here is an excellent, future-proofed gaming machine that looks good and feels good in-game. Simply put, it’s a powerhouse, capable of running any processor-hungry, graphics-heavy AAA game seamlessly, so that your gaming experience is completely immersive. That applies to similarly-demanding applications like video editing programs.",
    "Yes, you’ll have to shell out more cash than you would if you were looking for a budget gaming PC, but if you’re looking to have a smooth and easy gaming experience on Ultra settings, you’re not really doing any gratuitous spending, especially since you’re essentially investing for the future as well as the present.",
    "If you can’t spare more than $1,500, that’s OK as well. There are a few configurations that will set you back less than $1,000 and get you through medium settings beautifully. And since it is designed to be very upgradeable, you can just upgrade later on when you can afford to.",
    "First reviewed May 2019",
    "Image Credits: TechRadar"
  ],
  "headers": {
    "4": "Price and availability",
    "10": "Design",
    "16": "Performance",
    "23": "Upgradability and the Command Center",
    "27": "Final verdict"
  },
  "links": {
    "HP Omen Desktop PC": "https://www.techradar.com/reviews/hp-omen-desktop-pc",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "a GPU far superior than the 1080": "https://www.techradar.com/news/nvidia-geforce-rtx-2080-vs-nvidia-geforce-gtx-1080",
    "Turing": "https://www.techradar.com/news/nvidia-turing"
  }
}