{
  "source": "https://www.techradar.com/reviews/forexcom",
  "title": "Forex.com review",
  "category": "computing",
  "updated": "2020-07-24T13:29:54Z",
  "author": "jitendra-soni",
  "summary": "The trusted market leader",
  "verdict": "Trusted trading platform offering a wide variety of assets to trade on.",
  "pros": [
    "Competitive pricing",
    "Advance research and technical tools",
    "Variety of currency pairs",
    "Robust mobile and desktop functionality"
  ],
  "cons": [
    "High spreads",
    "Less rebate to active traders",
    "No cryptocurrency trading in the US"
  ],
  "article": [
    "Forex.com is one of the worlds leading forex trading apps, especially in currency markets. To be more accurate, it allows you to trade in over 180 foreign currencies, forex pairs, stocks, commodities, and cryptocurrencies.",
    "A global leader in its category, Forex.com saw a trade of over $1.3 billion last year with over 71,000 clients. It’s parent company GAIN Capital Holdings employs over 800 staff and caters to over 200,000 retail and institutional clients.",
    "Established in 1999, it operates with a licence from various regulatory authorities located in countries like the US, UK, Canada, Japan, and Australia. Forex.com is open 24 hours a day and five days a week except for holidays.",
    "Forex.com offers forex, stock indices, ETFs, CFDs and a wide variety of cryptocurrencies to trade on.",
    "Forex.com has multiple trading platforms – a custom Advanced Trading desktop Platform as well as the industry-standard MetaTrader 4 platform. The Advanced Trading Platform is a very novice-friendly platform and comes with 100 inbuilt technical indicators that help the traders in customizing the ability to set the trade preferences.",
    "This platform has been developed to offer fast, reliable, and stable performance across browsers. The Advanced Trading Platform also includes integrated trading tools as well as analysis and market accounts.",
    "While the MetaTrader 4 platform is one of the most popular trading platforms among the FX traders. It allows executing more complex strategies, such as automatically copying deals of other traders, and gives you access to MT4 brokers across the world.",
    "It is a matured environment for optimizing algorithmic trading programs and offers real-time account data without any third-party interference.",
    "The mobile app, AdvantageFX, is one of the best and most full-featured forex apps in the market. It offers you easy navigation and a plethora of information right in your palm. Features like an economic calendar, integrated research, and signals from Trading Central, alerts, market updates make it a very handy and useful application.",
    "The charts are available in a landscape mode making it very easy to consume information. For the users who prefer the standard MetaTrader, MT4 and MT5 apps are available as well.",
    "To open an account with Forex.com you simply need to submit a valid govt-issued photo ID. This is used to verify the residential address, date of birth, and name listed on the application. You can also submit a separate document for proof of residence, such as a utility bill, credit card or a bank statement. As with similar platforms, this is all to comply with anti-money-laundering regulations.",
    "Forex.com accepts deposits directly from your bank account. It even accepts debit or credit cards as a mode of payment. It requires a minimum of 50 units of the base currency as initial funding. But still, it is recommended to deposit at least 2,500 for ease and flexible investing.",
    "Forex.com also offers a demo account to test and understand the platform. However, the demo account only runs for 30 days, whereas many other platforms offer an unlimited demo account.",
    "Now, Forex.com provides 3 types of trading accounts- Standard trading account, commission account, and DMA. Here you need to understand which type of account is right for you.",
    "Standard trading account: It is the easiest and the most commonly used account. It gives the user access to standard lots of currency. The standard account requires sufficient capital to trade full lots. Standard trading accounts are for experienced, well-financed traders.",
    "Commission account: It is a trading account that allows users to make transactions using a mini lot. Even an inexperienced trader can trade with this account. The mini trading account also gives flexibility to trading a risk management plan and sticking to it without risking too much capital.",
    "DMA: This is for serious traders who deal in high volume of forex. This account offers a greater control on your transactions and is suitable for people who know the tricks of the trade. It requires a minimum balance of $25,000 and a minimum trade size 100,000.",
    "The charges of Forex.com are comparatively less than its competitors and the pricing policy is pretty straight forward. The platform offers free forex trades; however, they make money via spreads.",
    "It profits via charging at several events for several rates. The minimum spread is 1 for EUR/USD with a typical spread of 1.3 and margins from 0.5 per cent.",
    "General fees are as follows:",
    "Support is available from 10 a.m. ET Sunday to 5 p.m. ET Friday. It offers several methods to connect with the customer support team. There is a choice of phone numbers to directly call to connect with the support team.",
    "You also have regular live chat support at the top of the website and lastly, you can also reach out to the support team via email. Also, you can use email and phone to connect for account opening as well. Social media support is not available.",
    "Forex.com provides forex trading: low forex fees, and many currency pairs with lots of technical research tools to help the traders. It is a good fit for active traders since it costs slightly less when you trade actively.",
    "Forex.com is one of the best forex brokers in the market which is regulated by the top financial authorities. It is one of the most trusted brokers with thousands of users and offers an excellent trading platform on mobile as well as web."
  ],
  "headers": {
    "3": "Features",
    "8": "Mobile apps",
    "10": "Accounts",
    "17": "Charges and fees",
    "20": "Support",
    "22": "Final verdict"
  },
  "links": {
    "Forex.com": "https://www.forex.com/",
    "forex trading apps": "https://www.techradar.com/news/best-forex-trading-apps"
  }
}