{
  "source": "https://www.techradar.com/reviews/orion-file-recovery-review",
  "title": "Orion File Recovery review",
  "category": "computing",
  "updated": "2020-04-17T09:08:15Z",
  "author": "michael-graw",
  "summary": "Our Orion File Recovery review will help you decide if this data rescue software is worth the money",
  "verdict": "Orion File Recovery is a powerful and inexpensive tool for saving deleted files. But, the lack of a preview function and slow scan speeds prevent it from standing out.",
  "pros": [
    "Inexpensive option for deep hard drive scans",
    "Comes with permanent data scrubber tool"
  ],
  "cons": [
    "No preview of recovered files",
    "Quick scan isn’t all that fast"
  ],
  "article": [
    "Searching for the best data recovery software? Then it’s worth taking a close look at Orion File Recovery from NCH Software. With this hard drive data recovery tool you can rescue accidentally deleted files on Windows systems. In addition, as a security measure for sensitive documents, you can use the software to permanently delete files so they can’t be recovered.",
    "In our Orion File Recovery review, we’ll take a closer look at everything this software has to offer.",
    "NCH Software offers a free trial of Orion File Recovery, but the number of files you can recover is limited. To unlock the software, you’ll need to purchase a lifetime license for $17 for non-commercial use or $20 for commercial use. You can install the software on as many computers as you want.",
    "Alternatively, you can purchase a monthly subscription that costs $0.83 per month. The advantage of this is that you get access to upgrades for free as they are rolled out.",
    "Orion File Recovery is designed to work with a wide variety of file types and Windows file systems. Helpfully, you can run the software not only on an internal drive but also on external hard drives, USB flash drives, and SD cards.",
    "The software also offers both file recovery and file erasure. For either purpose, the software splits up scanning into two steps. When you first scan a hard drive, it runs a quick scan. If you don’t see the files you’re looking for, you can then opt to run a deep scan.",
    "One important thing to note about Orion File Recovery is that it doesn’t include a preview feature. That means you can’t see what’s inside the files your scan turns up before you either recover or permanently delete them.",
    "You can download Orion File Recovery from the NCH Software website, but note that it needs to be installed on your system. That’s less than ideal if you’re worried about further overwriting data on your computer’s hard drive.",
    "The user interface itself is easy to navigate, if not all that modern. Thankfully, it’s not hard to figure out how to recover deleted files. When you first open the software, a dialog box pops up to walk you through the process.",
    "All of the text in the interface, including file names and paths, is pretty small. This is a minor complaint, but we were disappointed to find that there aren’t options to change the view settings.",
    "We tested out Orion File Recovery on a 1 TB internal hard disk drive. Scanning the drive initially for all recoverable deleted files took about 50 seconds, which was surprisingly long compared to other undelete software. Still, it did a fairly good job of pulling out files that had been deleted up to two months ago.",
    "Running a follow-up deep scan for document files on the same hard drive took about 12 minutes and uncovered a trove of files that were several months old. By default, these files have to be saved to another drive (not the drive you’re recovering from) during the scan process. We found that many of the recovered text files were intact, although results were more variable for some old Word documents.",
    "Orion File Recovery primarily helps you save time during scans by allowing you to focus on specific subsets of file types. This is possible, although not the default, for quick scans, these being superficial enough that file type selection doesn’t save more than a few seconds.",
    "However, for deep scans, the software recommends limiting your search by file type since comprehensive scans can take a while. Orion File Recovery doesn’t display an estimated time remaining for your scan, so it can be hard to tell how long a scan may take.",
    "NCH Software provides support for Orion File Recovery by email only, and only if you have a paid license. There is some online documentation, including answers to frequently asked questions, but it’s not very comprehensive. There’s also a user forum, but the last post was over six months ago at the time of writing.",
    "Orion File Recovery is inexpensive and relatively powerful software for rescuing your files from erasure on Windows systems. The deep scan feature is a major advantage for the price of this software, as most competitors charge significantly more for similar scanning capabilities. While it would be nice to see a more modern user interface and a preview window, we were generally happy with Orion File Recovery’s usability and success at file recovery.",
    "Orion File Recovery is very similar in a lot of ways to Auslogics File Recovery, another inexpensive undelete software for Windows users. Auslogics File Recovery also enables both quick and deep hard drive scans and comes with a permanent file eraser tool built in.",
    "To be sure, Orion File Recovery is cheaper—Auslogics charges $25.46 per year on a subscription basis. But, we much preferred the modern user interface of Auslogics File Recovery, which comes with a high-resolution preview window. We also liked that Auslogics File Recovery is capable of scanning multiple drives at once, and both quick and deep scans proceeded much more quickly for the same hard drive compared to Orion File Recovery.",
    "Looking for other alternatives to Orion File Recovery? Read our guide to the Best data recovery software."
  ],
  "headers": {
    "2": "Orion File Recovery: Plans and pricing",
    "4": "Orion File Recovery: Features",
    "7": "Orion File Recovery: Client and client setup",
    "10": "Orion File Recovery: Performance",
    "12": "Orion File Recovery: Efficiency",
    "14": "Orion File Recovery: Support",
    "15": "Orion File Recovery: Final verdict",
    "16": "Orion File Recovery: The competition"
  },
  "links": {
    "best data recovery software": "https://www.techradar.com/best/best-data-recovery-software",
    "Orion File Recovery": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4507903331566442000/https://www.nchsoftware.com/data-recovery/index.html",
    "purchase a lifetime license": "https://secure.nch.com.au/cgi-bin/register.exe?software=orion",
    "Auslogics File Recovery": "https://www.techradar.com/reviews/auslogics-file-recovery-review",
    "Best data recovery software": "https://www.techradar.com/best/best-data-recovery-software"
  }
}