{
  "source": "https://www.techradar.com/reviews/skype",
  "title": "Microsoft Skype review",
  "category": "computing",
  "updated": "2020-04-22T16:50:02Z",
  "author": "darcy-french",
  "summary": "Hoping for a comeback in the video-conferencing market",
  "verdict": "Skype is a solid choice for all small and mid-sized companies looking to up their video-conferencing game",
  "pros": [
    "Affordable",
    "Seamless user experience"
  ],
  "cons": [
    "Privacy concerns",
    "Lack of customized business support"
  ],
  "article": [
    "Skype has been a mainstay in the video conferencing market since its launch in 2003. The Skype brand has become so synonymous with video calling that it is now recognised as a verb in most English dictionaries. Now Skype is owned by Microsoft, and over 300 million users rely on it for their video conferencing needs each month (that number was from 2015 and hasn't been updated since by Microsoft). With a raft of features and new encrypted messaging options, Skype remains a key player in the market.",
    "If you’re wondering whether Skype is the best video conferencing software for your business, then take a look at this Skype review, in which we discuss its strengths, weaknesses, and main features.",
    "Skype functions through a freemium pricing model and for most of its 13-year history has offered a suite of both personal and business plans. However, in 2020 Microsoft began to phase out Skype’s business options in favor of its recently announced Microsoft Teams. Skype now offers one product for both individuals and businesses.",
    "Skype’s merged audio and video-conferencing platform can be used free of charge and enables up to 50 users to benefit from the full range of Skype features. Although Skype’s free services will suffice for many businesses, there is also the option to purchase either a one-off package or a recurring subscription of Skype Credits. With Skype Credits, users can call landlines and mobile numbers, as well as send SMS messages.",
    "Skype is loaded with features and is constantly adding new and innovative functionalities for individuals and businesses. Like many teleconferencing providers, Skype enables you to record calls and will save recordings for up to 30 days after the conclusion of the teleconference. In addition, the software makes it easy to share multimedia files, chat with other participants, or share your screen.",
    "However, one of the platform’s greatest strengths is that it goes far beyond these basic video conferencing features. Skype now enables users to add live captions to video calls, offers end-to-end encrypted chat functionality, and has even introduced a live translating option that facilitates video calls with up to ten languages spoken simultaneously.",
    "Special praise must also be given to Skype’s in-call chat window, which far surpasses that of competitors such as Join.Me and Zoom. Users can create polls, insert files from OneDrive or their computer, and even share music from Spotify.",
    "More recently, Skype introduced its new Meet Now product, which enables hosts and participants to create and join a video call without making an account or downloading the app. This makes it easier for participants to join a video conference either directly from a web browser or from the Skype app on a supported device.",
    "One of the greatest strengths of Skype is its functionality across multiple platforms and devices. Skype offers applications for iOS and Apple, Windows, Android, Xbox, and even Amazon Alexa. Easily downloaded and installed, the Skype app will guide you through the features and functionality of the application upon first launch.",
    "Skype has an exceptionally clean user interface. Navigating the application is intuitive, and the huge range of features and functionalities coexist seamlessly. Within a video call, users can blur or unblur their background, which is great for when we’re on the move or video conferencing from home.",
    "The Skype application runs smoothly on all the devices we tested. The only issue we noticed was that on occasion, when changing from a mobile device to a laptop or desktop, notifications and data were slow to sync. However, this was only on occasion.",
    "In terms of performance, Skype did well when tested in a four-way call. With two participants connected to WiFi (approx. 25 Mbps), and two relying on mobile data (approx. 15 Mbps), there was minimal lag or distortion of either the audio or video.",
    "As far as video conferencing software goes, Skype is a relatively secure service. However, the legacy of a 2013 data leak, in which it was exposed that Skype had provided personal data and communications to the US National Security Agency, may make some users wary.",
    "For a long time, Skype has offered 256-bit encryption for all messages and calls. This protects data from third-parties. It does not, however, stop Skype and Microsoft from accessing messages and data. Fortunately, in 2018 Skype added an end-to-end encrypted messaging service. This opt-in service means that users can be more confident in sending sensitive personal or business information through Skype. The downside is that users can only maintain one private conversation at a time.",
    "Skype offers a number of support options to its customers, but attempts to automate this process wherever possible. On its website, you’ll find answers to a large number of frequently asked questions, while user guides explain Skype’s features and how to make the most of the application. Like many tech companies, Skype and Microsoft have also begun experimenting with artificial intelligence support.",
    "Due to Skype discontinuing its business products, however, there is no dedicated phone helpline for business customers. For specific assistance, businesses will need to navigate through the support site until they find the live chat support. Here we were able to speak to a real person. After a wait of only one minute, a Skype representative was helpful in resolving a connectivity issue.",
    "Skype operates in a crowded market with competitors constantly looking to one-up Skype’s product and capture market share. Whilst Skype has long been the brand synonymous with video calls, it has recently lost ground to alternative services such as Zoom, join.me, or ClickMeeting, who have integrated features not yet offered by Skype.",
    "Zoom, for example, enables hosts to livestream video conferences to Facebook or YouTube. In addition, it provides personalized support and account management, as does Join.Me, although you need to have a paid plan to access phone support.",
    "Skype is a high-performing video-conferencing application that is available at only a fraction of the cost of its competitors. In fact, for most business purposes, Skype can be used completely free. It comes equipped with market-leading features as well as a seamless and intuitive user interface. Whilst there have been past concerns about its security, recent updates such as an end-to-end encrypted messaging service mean Skype is more secure than many of its competitors.",
    "Overall, Skype is a solid choice for all small and mid-sized companies looking to up their video-conferencing game."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features and utilities",
    "8": "Setup",
    "9": "Interface and performance",
    "12": "Security",
    "14": "Support",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Skype": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1146654251296913800&xs=1&url=https%3A%2F%2Fwww.skype.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Freviews%2Fskype",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "join.me": "https://www.techradar.com/reviews/joinme"
  }
}