{
  "source": "https://www.techradar.com/reviews/netgear-orbi-ac1200-rbk13",
  "title": "Netgear Orbi AC1200 (RBK13) review",
  "category": "computing",
  "updated": "2020-02-10T12:55:12.043Z",
  "author": "cliff-joseph",
  "summary": "A new dual-band system offers speedy mesh wifi at a lower price",
  "verdict": "It’s good to see Netgear offering a more affordable dual-band version of its Orbi mesh systems, and this AC1200 model doesn’t disappoint on speed. However, Netgear needs to improve the parental controls in the Orbi app – rather than relying on Disney’s Circle subscription service.",
  "pros": [
    "Affordable dual-band mesh Wi-Fi system",
    "Good performance",
    "Easy to set up and use"
  ],
  "cons": [
    "Free parental controls are limited",
    "Few Ethernet ports for wired connections",
    "Security features require subscription"
  ],
  "article": [
    "Netgear’s Orbi range is a popular choice for many people who need a mesh networking system that can provide wider and more reliable Wi-Fi coverage than you can get from a single router on its own. They are some of the best mesh routers in the world right now.",
    "However, the Orbi products are all pretty expensive and generally aimed at very large homes, so Netgear has finally released a more affordable model called the Orbi AC1200 (RBK13) for those of us that don’t live in Downton Abbey country mansions.",
    "The model we test here (model RBK13) consists of a primary router and two satellite routers. This three-piece kit is suitable for homes up to 3,250sq.ft and costs $229.99/£169.00 (around AU$350).",
    "People in the UK obviously live in more humble abodes than their US and Australian counterparts, as they also get a less expensive two-piece kit (RBK12) that includes just the primary router and a single satellite for £129, although that model isn’t currently on sale in other territories.",
    "Most Orbi kits use tri-band Wi-Fi, transmitting data via the 2.4GHz band and two separate 5GHz bands. However, this AC1200 model opts for a more affordable dual-band system, with just one 2.4GHz and one 5GHz band offering a maximum theoretical speed of 1.2Gbps.",
    "It also saves a few pennies by cutting back on additional features, such as Ethernet ports that can provide a wired connection. The primary router has just two Gigabit Ethernet ports, with one being used to connect the Orbi to your existing broadband router or modem (in order to use its Internet connection), while the second port can provide a wired connection for a single device.",
    "There are no Ethernet ports on the secondary satellite units at all – whereas more expensive Orbi models tend to have four Ethernet ports for wired devices. However, the compact little cubes a neatly designed and will sit easily on a shelf or desk, so it’ll be easy to find a convenient location for each device in rooms throughout your home.",
    "The initial set-up process is fairly straightforward, as the Orbi app can simply scan a QR code and then automatically connect the primary router and satellites for you. But while the Orbi app is quick and easy to use, it doesn’t offer a particularly impressive range of additional features.",
    "As we’ve seen before with even tri-band Orbi models, the Orbi app creates just a single, combined network using the 2.4GHz and 5GHz bands, with no option to choose separate networks for those two bands. And while Netgear’s web site boasts about its parental control features, clicking the Parental Control button in the Orbi app simply prompts you to download a separate app – called Circle – that is supplied by the mighty Disney corporation.",
    "Unfortunately, this only provides basic parental controls for free, such as a 'Pause' option that temporarily suspends internet use. Its more advanced controls – such as setting time limits for your kids’ Internet access – require an additional subscription of $4.99 (around per £4, AU$7) month (or $49.99 annually – which translates to around £40 and AU$75).",
    "The Armour security features sound good too, offering anti-virus and malware protection for all your devices, including PCs, Macs, iOS and Android. Unfortunately, you only get a 30-day free trial with Armour and then need to pay $69.99 (around £50, AU$100) a year to keep using it.",
    "There are many rival routers and mesh systems that provide better parental controls and other features at no extra cost, so Orbi systems aren’t the best option for parents who want to monitor and protect their kids online.",
    "But if the Orbi app is rather limited, we weren’t disappointed by the speed of this affordable mesh Wi-Fi system. Admittedly, a dual-band system such as this can’t match the performance of its more expensive tri-band rivals, but a maximum speed of 1.2Gbps is still more than fast enough for the Internet connections available in most homes.",
    "Our devices in the same room as the Orbi’s primary router recorded download speeds of 58.5Mbps, which were similar to the normal router that we use for our internet connection.",
    "However, the weak spot for Wi-Fi in our building is the back office where the download speed drops to around 45Mbps. That’s where the Orbi proved its worth, boosting the download speed to 58.4Mbps once more.",
    "That’s about as good as it gets for the 50Mbps Internet connection we have, so the Orbi AC1200 will be a really good option for smaller and medium size homes that need to improve their Wi-Fi coverage."
  ],
  "headers": {
    "0": "Two minute review",
    "16": "Don’t buy it if…"
  },
  "links": {
    "best mesh routers": "https://www.techradar.com/news/best-wireless-mesh-routers"
  }
}