{
  "source": "https://www.techradar.com/reviews/bose-portable-home-speaker",
  "title": "Bose Portable Home Speaker review",
  "category": "audio-visual",
  "updated": "2020-01-16T16:47:01Z",
  "author": "olivia-tambini",
  "summary": "Bose’s portable speaker takes on the Sonos Move",
  "verdict": "There’s a lot to like about the Bose Portable Home Speaker; it’s super smart, and its design blends functionality with minimalist chic. It may not sound quite as powerful as the Sonos Move, but it’s still a solid choice if you don’t want to sacrifice audio fidelity for portability.",
  "pros": [
    "Great design",
    "Choice of Alexa or Google Assistant",
    "Warm, well-balanced sound"
  ],
  "cons": [
    "Bass lacking compared to Sonos Move",
    "Expensive"
  ],
  "article": [
    "Bose has long been a huge player in the world of Bluetooth speakers – and its latest model, the Bose Portable Home Speaker, is on course to cement that reputation even further.",
    "If 2019 was the year of the smart speaker, then 2020 is set to be the year of the portable smart speaker – and with the Bose Portable Home Speaker, along with competing models like the Sonos Move offering the smarts of Google Assistant and Alexa alongside Bluetooth connectivity, the market is already growing fast.",
    "So, can Bose stave off the competition from Sonos? We put its latest portable speaker to the test.",
    "The Bose Portable Home Speaker, which comes in black and silver, is available to buy for $349 / £369.95 / AU$499.95, making it slightly less expensive than the $399 / £399 Sonos Move (unless you’re in Australia, where it costs AU$649).",
    "While cheaper than its biggest rival, the Bose Portable Home Speaker is not cheap by any stretch of the imagination – it’s predecessor, the Bose Soundlink Revolve, costs $200 / £200, while the runner up in our best portable speakers list, the UE Boom 3, is just $129.99 / £129.99 / AU$199.95.",
    "Everything about the design of the Bose Portable Home Speaker oozes portability, from its lightweight, compact build, to its convenient bucket-like carrying handle and IPX4 water-resistant housing.",
    "Measuring 7.5 inches tall, the Portable Home Speaker is wrapped in an anodized aluminum enclosure, coming in silver or black finishes – we prefer the futuristic -looking silver model, but the black version is a good choice if you like the minimalist look.",
    "The overall effect is sleek and sophisticated, and it’s truly convenient to carry around – you’d be surprised how many portable speakers are a real hassle to take on the road, with bulky builds and non-existent handles.",
    "The bottom third of the speaker sports a wraparound grille that’s designed to blast your music in all directions, while a second, much smaller grille can be found at the top of the speaker, encircling the rubberized control pad. This is also where a built-in microphone array is housed, to pick up your voice when you summon your voice assistant.",
    "On the top of the speaker, you have power, Bluetooth pairing, volume, and play/pause buttons, as well as a button to turn the microphone off – handy if you’d rather your voice assistant wasn’t listening in at all times.",
    "At the back, you’ll find a USB-C charging port and… that’s it. No AUX connectivity here. You can also top up the Portable Home Speaker using Bose’s charging cradle, which is sold separately for $29.95 / £24.95 / AU$39.95 and provides a base for your speaker to sit on.",
    "When it comes to portable speakers, battery life is everything and this Bose model comes with a respectable 12 hours of playback from a single charge. That’s more than the Sonos Move, but it pales in comparison to the 24 hours offered by the Tribit XSound Go. Still, the latter can’t compete with Bose or Sonos in terms of sound quality.",
    "Setting up the Bose Portable Home Speaker is really easy; simply download the Bose Connect app and follow the steps to hook it up to your WiFi, choose your voice assistant of choice, and select your music and radio services. These include Spotify, Deezer, YouTube, Amazon Music, TuneIn, and more, as well as AirPlay 2 for iPhone and iPad users.",
    "As well being designed for life on the move, the Bose Portable Home Speaker is a smart speaker; with both Google Assistant and Alexa built-in, you get a choice between the two best voice assistants depending on which ecosystem you already use.",
    "As well as asking your voice assistant of choice to play music, you can ask it for weather updates, to check your calendar, and control your connected devices, turning the Bose Portable Home Speaker into the hub for your smart home.",
    "We used Google Assistant during our tests, and found it to work seamlessly, whether we were requested songs from Spotify or asking for news updates; the inbuilt microphones had no trouble picking up our voice, even with music playing.",
    "The audio quality offered by the Bose Portable Home Speaker is very good indeed, with a warm, well-balanced soundstage.",
    "We started our tests by listening to Fleet Foxes’ Hummingbird; natural-sounding guitar with gently-thumbed bass strings resonate around the room without overpowering the intricately plucked treble melodies. It doesn’t quite have the pure fidelity of the Sonos Move, or the detail, but as the lead vocal melts into Appalachian-style harmony, every voice blends together seamlessly.",
    "In Little Dragon’s After The Rain, thumping bass lines feel tight and controlled while hi-hats jangle above with toe-tapping musicality; meanwhile, punchy organs and brass lines pulse beneath smooth jazz vocals. It’s a complicated mix, but the Bose Portable Home Speaker performs well, if not with the assertiveness of the Apple HomePod, which sounds altogether more exciting.",
    "Moving on to Stormzy’s Heavy is The Head, soft piano, haunting beats, and gospel-inspired backing vocals cushion crunching beats and compelling vocals. Sub bass lines move moodily through the mix, adding depth and warmth – they sound powerful enough for a portable speaker, but bass heads will likely prefer the expansive lower frequencies provided by the mains-powered Apple HomePod.",
    "The Sonos Move too, is better-suited to bass, but that’s to be expected – it is, after all, double the size of the Portable Home Speaker and perhaps less convenient to use on the go.",
    "The Bose Portable Home Speaker isn’t the brand’s first outdoor-friendly speaker, and it shows: gorgeous minimalist design meets weather-ready robustness, with a light build that lends itself to listening on the go. Having that bucket-like handle rather than the concave finger-grip of the Sonos Move is the icing on the portability cake.",
    "Connectivity, battery life, and smart features are all good, and we like the flexibility of having both Alexa and Google Assistant built-in.",
    "Compared to many cheaper portable speakers, it sounds fantastic, with a well-balanced, resonant soundstage. However, the Bose Portable Home Speaker doesn’t quite meet the dexterity of the Sonos Move, or the power of the Apple HomePod – so, if audio quality is your main concern, you may want to look at these options first.",
    "In terms of pure portability though, the Bose Portable Home Speaker is a clear winner, and we have no trouble recommending it."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "11": "Features",
    "16": "Performance",
    "21": "Final verdict"
  },
  "links": {
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Bose Soundlink Revolve": "https://www.techradar.com/reviews/bose-soundlink-revolve",
    "UE Boom 3": "https://www.techradar.com/reviews/ultimate-ears-boom-3",
    "Tribit XSound Go": "https://www.techradar.com/reviews/tribit-xsound-go",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review"
  }
}