{
  "source": "https://www.techradar.com/reviews/toshiba-canvio-flex-2tb-external-hard-disk-drive",
  "title": "Toshiba Canvio Flex 2TB external hard disk drive review",
  "category": "computing",
  "updated": "2020-11-23T16:27:13Z",
  "author": "desire-athow",
  "summary": "Making something new out of a very mature technology",
  "verdict": "Toshiba hit a nice sweet spot with the Canvio Flex 2TB. Not too expensive, good enough in terms of performance and offering two not-so-insignificant USPs, namely a 3-year warranty and a Type-C connector, this portable external hard drive is an excellent choice for those looking for a great value for money device.",
  "pros": [
    "Type-C cable",
    "Great value for money",
    "3-year warranty"
  ],
  "cons": [
    "Micro-B USB port",
    "No bundled software"
  ],
  "article": [
    "External hard disk drives are still a hot commodity but while they are still best selling products on Amazon, the writing is on the wall as shown by the search interest over time from Google Trends. Amidst plunging solid state storage costs, superfast wireless broadband, the move away from traditional computing and ubiquitous cloud storage, demand is past its peak. That hasn’t slowed down the enthusiasm of some vendors though.",
    "Toshiba for example has released the Canvio Flex, a family of portable external hard disk drives (that is in 2.5-inch form factor rather than 3.5-inch ones). It is available in 1TB, 2TB and 4TB capacities with a silver finish, with prices at the time of writing of $55.99, $67.99 and $102.99 respectively. The Canvio Flex is categorized as specialty storage because it carries a long three-year warranty and comes with a Type-C cable.",
    "The model we’re looking at in this review, the HDTX120XSCAA, is a 2TB model. It is a bog-standard model without any salient design features; the white plastic case is covered by a silver facia with the company’s name Toshiba, in white. There’s a status light that comes to life when transferring data and a micro-B USB connector that, we believe, should have long been sent to the bins of obsolescence.",
    "It is reasonably compact (80 x 111 x 13.5mm) and light (149g) but its dimensions are constrained by the fact that it is, at its heart, a 2.5-inch hard disk drive. Two USB cables, one with a Type-A connector and the other one with a Type-C connector are bundled with the Canvio Flex.",
    "Crystaldiskinfo shows that the drive inside is the MQ04UBD200, not one from the standard Toshiba L200 series, although we guess that it is an exact copy of the HDWL120, a 2TB internal hard drive. They both use drive-managed SMR technology, with a 5400RPM spinning speed and 128MB cache. They have a shock sensor as well as Toshiba’s proprietary cache and ramp loading technology. We assume that it is a 2-platter model.",
    "The drive doesn’t come with any utilities like some of its competitors; there’s no free backup software, no cloud backup services and no Adobe creative cloud trial (like for Seagate).",
    "When it comes to sheer performance, the Canvio Flex performed in line with the rest of the competition, including the older Toshiba Canvio drives. It reached about 150MBps on average, on read/write speeds across our suite of benchmarks which is more than decent but still around a third compared to the slowest external solid state drives.",
    "A 10GB file was transferred at a respectable 80MBps average transfer rate is one of the fastest we’ve recorded for an external hard disk drive. Not too shabby then. Still, it can’t hide the fact that traditional hard drive technology has reached a plateau both in terms of throughput, access time and sheer speed, something that doesn’t remove the intrinsic quality of the Canvio Flex.",
    "Models that will compete with the Toshiba Canvio Flex will have a longer-than-average warranty as well as a Type-C connector at one end. Note that you could always buy a Micro-B to Type-C cable.",
    "Western Digital has the classic MyPassport, which is available for fractionally less from Amazon where dynamically controlled prices means that comparison would only be valid at the price of writing. That 2TB drive also comes with a 3-year warranty, proprietary backup software but alas, no Type-C cable.",
    "If you only want the cheapest portable external hard drive around, then Seagate has the Portable 2TB, which at $54.99 at Amazon at the time of writing, undercuts the Canvio Flex by almost 20 per cent (or $13). It comes with a lower warranty and no Type-C cable. On the other hand, it does come with one-year Rescue Data Recovery Services.",
    "A third potential candidate is the rugged Silicon Power Armor A60. It comes with a three year warranty, is cheaper than the Canvio Flex (as well as being waterproof) but is also a tad thicker, has a rare (and therefore expensive) type-A to type-A cable. At the time of writing, it was also bundled with a free 10,000mAh battery charger.",
    "If you are in the market for an affordable, large capacity portable external hard drive with a long warranty and a Type-C connector (useful for connecting to a smartphone or tablet), the Canvio Flex fits the bill. It is keenly priced, reasonably built and performs as expected. Our only slight concern is the fact that it uses a Micro-B USB port for which there is no real need.",
    "We’d love to have seen Toshiba use a USB Type-C connector here, but every cent counts at the lower-end of the market.",
    "In the grander scheme of things though, the price premium between a 2TB hard drive and a 2TB portable solid state drive is shrinking albeit not at the pace that some of us were expecting. You can expect to pay $230 for an external SSD, which is almost 4x more than the Canvio Flex, which is a still lot but for many, wholly justified by the ruggedness, the shock resistance, the performance gain and the drop in size."
  ],
  "headers": {
    "2": "Design",
    "4": "Hardware",
    "5": "Performance and in use",
    "8": "Competition",
    "12": "Final verdict"
  },
  "links": {
    "External hard disk drives": "https://www.techradar.com/news/best-external-desktop-and-portable-hard-disk-drives",
    "Canvio Flex": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FToshiba-Canvio-Portable-External-Silver%2Fdp%2FB08DDC36S1%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3165223524359620600-20",
    "free backup software": "https://www.techradar.com/best/best-free-backup-software",
    "cloud backup": "https://www.techradar.com/best/best-cloud-backup",
    "Adobe creative cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "Toshiba Canvio": "https://www.techradar.com/reviews/toshiba-canvio-4tb-external-hard-disk-drive-2019-edition",
    "MyPassport": "https://www.techradar.com/reviews/wd-my-passport-2020-edition-portable-ssd",
    "Silicon Power Armor A60": "https://www.techradar.com/reviews/silicon-power-armor-a85"
  }
}