{
  "source": "https://www.techradar.com/reviews/microsoft-surface-headphones-2",
  "title": "Microsoft Surface Headphones 2 review",
  "category": "audio-visual",
  "updated": "2020-07-02T10:06:09.066Z",
  "author": "olivia-tambini",
  "summary": "Microsoft has created some of the best noise-cancelling headphones of 2020",
  "verdict": "The Microsoft Surface Headphones 2 mark a triumphant return to the world of personal audio for the tech giant, making some key improvements upon the brand’s first noise-cancelling headphones – and all for a lower price.",
  "pros": [
    "Warm, wide soundstage",
    "Great controls",
    "Fantastic noise cancellation"
  ],
  "cons": [
    "Sound could be more detailed",
    "Slightly boring look"
  ],
  "article": [
    "The Microsoft Surface Headphones 2 are the tech giant’s second pair of noise-cancelling headphones, and they offer a ton of great improvements over the original Surface Headphones, while retaining some of their best qualities.",
    "In spite of those improvements – which includes a longer battery life and a more comfortable design – the Surface Headphones 2 are considerably cheaper than their predecessors, making them the obvious choice if you’re trying to choose between the two.",
    "That lower price also makes them a great alternative to the best headphones of 2020, the Sony WH-1000XM3, especially as they’ve retained the winning design features of the original Surface Headphones, with built-in dials on each earcup to control your music and the active noise cancellation.",
    "While the audio quality on offer here doesn’t quite live up to the standards set by the XM3s, the Surface Headphones 2 certainly hold their own. A warm, wide soundstage makes for an enjoyable listening experience, and allows plenty of space for different instruments to grow within a track.",
    "That warm soundstage means that you do lose a little attack in the higher frequencies, but these wireless headphones still offer enough detail that you’ll probably be able to identify elements that you’ve never noticed before in your favorite songs.",
    "Battery life has been increased by five hours from the original Surface headphones, bringing the total playback time to 20 hours. This, alongside their great connectivity and stellar noise cancellation, makes the Surface Headphones 2 ideal for use while commuting or on long-haul flights.",
    "The noise cancellation offered by these headphones is very impressive – and with 13 levels to choose from, you can block out as much or as little as you want.",
    "According to Microsoft, the ANC has been specifically tuned to block out the human voice, and this makes them ideal for working from home when you need to tune out the washing machine, shouting kids, or noisy neighbors.",
    "Overall, we think the Surface Headphones 2 are a worthy and welcome improvement upon the original over-ear headphones, and that reduced price demonstrates that Microsoft is starting to find its place in the world of personal audio – no, these aren’t the best headphones you’ll ever hear, but they’re damn good all the same, and represent great value for your money, too.",
    "The Microsoft Surface Headphones 2 were launched on May 6, 2020, nearly two years after the original noise-cancelling headphones were released.",
    "They cost $249.99 / £239.99 / AU$399.95, which is significantly cheaper than the original Surface Headphones, which cost $349.99 / £329.99 / AU$499. Despite a price reduction of $100 / £110, a spokesperson for Microsoft told us that the company hasn’t opted to use cheaper materials to bring that cost down.",
    "So, these latest cans offer far better value than their predecessors, as they only build upon the original Surface Headphones’ already impressive specs.",
    "They’re also considerably less pricey than the best headphones of 2020, the Sony WH-1000XM3, which means they could make a compelling alternative if you’re on a stricter budget than the Sony headphones allow for.",
    "The look and design of the Microsoft Surface Headphones 2 are very similar to those of their predecessors; these over-ear cans have a pleasingly solid feel, but are lightweight enough to be comfortable throughout the longest listening sessions.",
    "Memory foam padding on the earcups adds to this comfortable feel, and makes them suitable for using during long haul flights – we could easily see ourselves falling asleep with these wrapped around our ears.",
    "The sliding headband reveals a flash of shiny aluminum when you adjust it – alongside the reflective Microsoft logo on the outside of the headband, it provides a welcome touch of luxe design to the otherwise matte finish, which comes in light gray or black.",
    "Unlike the original Surface Headphones, the earcups now rotate 180 degrees, making them feel more comfortable when wearing them on your ears and around your neck.",
    "Now onto the controls; we loved the inbuilt dials on the earcups of the original Surface Headphones, and we’re so glad Microsoft has stuck with this winning design.",
    "You can turn the left dial backwards and forward to control the level of noise cancellation, while the right dial controls the volume of your music.",
    "Tapping once on either housing stops or starts your music, while two taps skips to the next track, and three taps will take you back to the previous song. A long tap on either touchpad will activate the voice assistant on your device, and you can use the touch controls to answer, decline, end, or mute a phone call.",
    "On the bottom of the right cup you’ll also find a power button, a button to mute the inbuilt microphone, a USB-C port for charging (an upgrade on the original headphones’ micro-USB port), and a 3.5mm port if you prefer to listen to your music with a wired connection.",
    "Microsoft says that the Surface Headphones 2 deliver what it calls \"Omnisonic sound\", powered by 40mm drivers.",
    "Listening to Ducter by black midi, we noted that the bass sounds robust, but tightly controlled though these cans don’t quite have the dexterity of the Sony WH-1000XM3 when it comes to handling complex rhythmic changes.",
    "That’s not to say the Surface Headphones 2 don’t sound accurate or detailed – you’ll be able to pick out plenty of new details from your favorite tracks – their warm sound just means that some of the attack and detail you may crave from the treble and mid frequencies is reduced.",
    "Instead, you get a generous, enveloping bass response, which makes for a really enjoyable, easy listen – it’s all down to personal taste, but audiophiles who seek sonic fidelity above all else may find these headphones impart a little too much of their own character onto the music.",
    "Moving onto something a little more pop-influenced, we tested the Surface Headphones 2 with Everything Everything’s latest single, Planets. Video game-style synth arpeggios pulse in decadent Baroque harmony without overpowering the soaring falsetto vocals; the Surface Headphones 2 handle all these complex textures with aplomb, with every instrument given the space to swell and grow within the mix.",
    "The soundstage feels fairly wide; we never get that closed-off feeling that over-ear headphones can sometimes struggle with, and there’s a good degree of separation between the different frequencies.",
    "The noise cancellation offered by the Microsoft Surface Headphones 2 is fantastic – and with 13 levels to choose from, you can block out as much or as little as you want.",
    "According to Microsoft, the ANC has been specifically tuned to block out the human voice, and the Surface Headphones 2 certainly deliver in this respect, making them ideal for use while working from home or in a busy office.",
    "You can control the noise cancellation by turning the left dial backwards and forwards – you’ll hear a beep when you’ve reached the highest level of noise cancelation, and another when it’s off completely.",
    "Otherwise, there’s no indication of what exact level of noise cancellation you’re using – it would be nice to have a series of beeps for each level, but on reflection, we can see how this could be annoying in practice.",
    "The Microsoft Surface Headphones 2 offer a 20-hour battery life, an improvement of five hours compared to their predecessors. It’s not the longest battery life we’ve seen for noise-cancelling headphones, but it’s still more than enough to get you through a week’s worth of commuting or a long-haul flight.",
    "Connectivity is also very good; Bluetooth 5 and support for Qualcomm’s aptX codec means that pairing these headphones with your device is a breeze, and you shouldn’t experience any significant lag when watching video or gaming. If you do find that lag is a problem when using Bluetooth, you can also use the included 3.5mm audio cable to hook the cans up to your device directly.",
    "Unsurprisingly, the Surface Headphones 2 are optimized for use with Microsoft products; for example, the company says that you can connect them to your Windows 10 PC “right out of the box” when you enable Swift Pair3."
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Microsoft Surface Headphones 2 price and release date",
    "13": "Design",
    "21": "Audio performance",
    "27": "Noise cancellation",
    "31": "Battery life and connectivity",
    "34": "Don't buy them if..."
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Surface Headphones": "https://www.techradar.com/reviews/microsoft-surface-headphones",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review"
  }
}