{
  "source": "https://www.techradar.com/reviews/ring-video-doorbell-2",
  "title": "Ring Video Doorbell 2 review",
  "category": "appliances",
  "updated": "2021-12-05T22:57:19Z",
  "author": "christian-de-looper",
  "summary": "A smarter way to see who's calling",
  "verdict": "The Ring Video Doorbell 2 has its drawbacks, but its excellent app and great motion tracking may make it the best choice for you.",
  "pros": [
    "Nice design",
    "Great motion tracking",
    "App is easy to use"
  ],
  "cons": [
    "No free video storage",
    "A little bulky"
  ],
  "article": [
    "Ring, an Amazon-owned company, has come a long way in the world of video doorbells (and wider security cameras ) and its recent range are quickly becoming the de-facto name in making sure your home is secure through your smartphone.",
    "The more recent devices don't even need to be hardwired (such as the Ring Door View Cam) which makes them easier to use, and as such there's a greater interest in the wider product range, and in our eyes they're some of the best video doorbells you can buy right now.",
    "So, does the Ring Video Doorbell 2 perform well enough to outdo other smart doorbells? We put it to the test to find out - and it's something a few will be wondering ahead of its likely price drop come Prime Day 2020, which is happening on October 13 and 14.",
    "The first thing you’ll notice about the Ring Video Doorbell 2 is its design: it’s a good looking device. In the box we were treated to two face plates – a silver one and a dark gray one, and we ended up going with the dark gray one.",
    "The doorbell itself is somewhat large, and that may be a problem for those that want to install it in a small space or doorframe. It’s certainly too big for a doorframe, coming in at 5.05-inches tall, 2.50-inches wide, and 1.08-inches thick.",
    "That said, it doesn’t look too out of place on a wall next to the door, and while large the trade-off is that the battery can be a little bigger – which is always nice. In fact, Ring claims the battery will last between six months and a year.",
    "For obvious reasons we couldn’t fully test that, but we haven’t heard of any customers claiming the battery did not last that time.",
    "Setting up the smart doorbell is really quite easy, but there were a few bumps along the way. You’ll need to download the app on your Android and iOS device, then create an account, if you don’t already have one. Then, simply follow the in-app instructions to install it.",
    "There are a few options for installing the device – you can choose to wire it to replace your existing doorbell, or simply use it separately from your existing doorbell.",
    "If you do that, however, you may want to pair it with the Ring Chime or Ring Chime Pro, which will, as the name suggests, chime when someone presses the doorbell. We installed the Chime Pro, which also extends your Wi-Fi range.",
    "And while we were pleased with the results, setting up the Chime Pro wasn't a flawless experience. We had to go through the instructions more than a few times, as the device was unable to connect to the Wi-Fi network.",
    "Once installed, the Ring Video Doorbell 2 is a breeze to use. When someone presses the button or approaches your door, you’ll get a notification on your phone, and if they press the button, the chime will sound and a video call will appear on your phone.",
    "That’s particularly helpful if you’re away from your home - as you can initiate a two-way call with whoever is at the door.There are a few settings in the app that you may want to tweak, however.",
    "For starters, the Ring video doorbell has motion tracking and initiates video recording if it detects motion. By default, it was a little too sensitive for our use - especially considering it was facing another nearby condo and would initiate recording when people went to their door as well.",
    "Thankfully, that can be changed in the app simply by heading to the 'My Devices' section and hitting the 'Motion Settings' option.",
    "The motion tracking really worked quite well, and we loved the integration with our smartphone. When the sensitivity options are all set up, we picked up a few things we wouldn’t have otherwise seen - like delivery drivers delivering packages, people approaching the door for unknown reasons, and so on.",
    "In the app, you can also go through all the recent activity, and you can sort activity based on things like rings, motion, and “starred.” That last option is helpful if, say, you see something particularly suspicious, then you can “star” it and easily return to it later.",
    "Other features we would expect are present too. You can check the battery status of your connected devices pretty easily, change the chime sound to a noise you actually like, and so on. You can also easily add another user - so if you live with someone else they can access the doorbell as well.",
    "As is the case with most video recording security devices, you are prompted to subscribe to the video recording service - and if you don’t you won’t be able to use the Ring Video Doorbell 2 to its full potential.",
    "You won’t, for example, be able to watch back video recorded when motion tracking is activated, and your previously recorded video will be deleted from your account.",
    "It’s kind of a bummer that there’s no free subscription available. For example, some services allow you to watch back video within 24 hours before it’s deleted, and SkyBell offers free cloud video storage to its customers, which is very helpful.",
    "With Ring, you’ll have to pay $3/£2.50/AU$4 per month or $30/£25/AU$40 per year for one device, or $10/£8/AU$15 per month or $100/£80/AU$150 per year for multiple devices - which comes in handy if you have Ring security cameras too.",
    "It’s not overly expensive - but it would have been nice to be able to use a premium doorbell for its intended purpose without having to pay extra.",
    "The Ring Video Doorbell 2 is a solid device. Setup is easy, the app is a breeze to use, motion tracking works great, and the battery lasts long enough to not be a hassle.",
    "We really liked the layout of the app, and the fact that the system can be integrated with Amazon Alexa and Google Assistant only makes things even better for smart home enthusiasts.",
    "But should you buy it? If you don’t mind the size and want a battery-powered device, then this is the one for you. If, however, you would prefer something a little smaller or you don’t want to have to pay to store video recordings, you may want to look elsewhere.",
    "If motion tracking or security features are at the top of your priority list, though, Ring Video Doorbell 2 has you covered and in a way that we found useful rather than irritating.",
    "You might also want to check out the Blink vs Ring comparison."
  ],
  "headers": {
    "3": "Design and setup",
    "11": "Day-to-day use",
    "18": "Subscription costs",
    "23": "Final verdict"
  },
  "links": {
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Ring Door View Cam": "https://www.techradar.com/reviews/ring-door-view-cam",
    "best video doorbells": "https://www.techradar.com/best/best-video-doorbells",
    "Prime Day 2020": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Blink vs Ring": "https://www.techradar.com/news/blink-vs-ring-what-are-the-differences-between-amazons-cams"
  }
}