{
  "source": "https://www.techradar.com/reviews/prognocis",
  "title": "PrognoCIS review",
  "category": "computing",
  "updated": "2020-04-06T18:00:51Z",
  "author": "jonas-p-demuro",
  "summary": "The integrated EHR and Telehealth solution",
  "verdict": "PrognoCIS provides a medical practice management software that fits into their larger milieux of medical software, but we wish the mobile apps had a better rating.",
  "pros": [
    "Support via toll free number, and email",
    "Integrates with multiple billing clearinghouses",
    "Internal communications via Task Assignment feature",
    "Cloud based"
  ],
  "cons": [
    "Opaque pricing",
    "Poorly rated mobile apps",
    "Service outages",
    "Software for Windows only"
  ],
  "article": [
    "The developer of the PrognoCIS family of medical software is Bizmatics, Inc, with headquarters in San Jose, California, popularly known as Silicon Valley. From this HQ, a full suite of software is offered, including Electronic Health Records (EHR), Telemedicine, and Medical Billing, which are offered as local hosted, or cloud based solutions. This PrognoCIS application serves in excess of 15,000 medical professionals, for over 25 million patient interactions. Finally, it is an accredited business with the Better Business Bureau.",
    "Among its many modules, PrognoCIS does offer Practice Management Software, which is designed to “Seamlessly integrate” with their EHR and billing modules. While it does provide for “Easy scheduling,” going through its feature set reveals a definite tilt towards the billing side of the equation. Through the scheduling piece, appointment reminders can be transmitted via text to patients.",
    "PrognoCIS offers the capability to identify a patient’s insurer, to verify eligibility for the service to be provided on that visit, and to determine a copay amount. The software solution is also able to work with multiple different clearinghouses, can reconcile simply patient accounts factoring in the insurance billing, and also create customized statements for a professional look. Cash flow gets fully optimized, via the included online patient payments, and EOB/ERA processing.",
    "PrognoCIS has a Task Assignment feature, for trackable, and enhanced communication between the billers and the clinical staff. Long gone are the days of billing staff putting out endless pages to busy doctors and awaiting a callback for communication on a coding or billing challenge. Rather, documentable communication gets sent from the biller to the clinician, to clarify these issues, which can then be addressed at their convenience.",
    "A challenge of any medical practice is integrating in fax communications, and while many other businesses have gotten away from those pesky faxes that hail from yesteryear, they persist in healthcare. This is due to the fact that fax communications are considered HIPAA compliant, while some other modalities, like email and texting are not. Thankfully, PrognoCIS has this need covered with a feature that is dubbed PrognoFax. Rather than use a separate fax machine, PrognoFax is an in-cloud e-faxing service. With no additional hardware, from within the PrognoCIS software, faxes can be sent and received via a secure fax technology. This also avoids the need for a separate fax service.",
    "There is a free demo available.",
    "PrognoCIS can be installed onto a Windows computer only, or used via a web browser on any platform as a SaaS. A limitation is the MacOS has no software available. While there is mobile app support for iOS or Android, both are low rated, with a score of 1.4 out of 5 on the iOS App Store.",
    "One drawback listed is that on the cloud based version, there were unexpected outages. While the outage was short, and did not last but for a few minutes, it did happen to this user more than once, although not frequently. However, for a clinician with a busy office full of patients, the goal should be zero downtime. We find this surprising as it is hosted by cloud giant Amazon Web Services (AWS), which has an excellent track record.",
    "Unfortunately, there is a lack of a free trial.",
    "In the ‘Contact Us’ section of the PrognoCIS site, we found two options for contacting them for support. The first is a toll free number, and we appreciate this option as sometimes a more complicated issue is just simpler to explain this way. Unfortunately, the hours of operation are not listed, although elsewhere it is indicated that it is indeed available 24/7.",
    "The other option is a direct email address. While we like to have this option for more general queries, we remind you that email is not considered HIPAA compliant, so we would not send screenshots with Protected Health Information (PHI), nor specific billing issues on patient accounts via this method of contact.",
    "We lament that there are no other options provided, such as chat, or an online portal. There are webinars available for training as well. In user reviews, it is pointed out that at times it takes a while to get a response to a trouble ticket, and that tickets get closed out without a satisfactory resolution.",
    "The pricing for PrognoCIS, as unfortunately is too common for medical practice software products, is quite opaque with no specifics on their website. This company takes the stance that “Without a full demonstration you will never fully realize the full potential and benefits of PrognoCIS,” and we can get that pricing needs to be individualized to the particular needs of the practice.",
    "On the other hand, we would prefer to get some idea of pricing, without having to provide our contact details, and dealing with sales without knowing the cost. Elsewhere, we found that the PrognoCIS pricing starts at $250 (£201) per month for each provider.",
    "PrognoCIS offers a powerful piece of medical practice management software. The pros are compelling, including that it is cloud based, the integrated faxing, and the robust internal communication for tracking tasks to be completed. The negatives to keep in mind include the lack of a free trial, the opaque pricing, and the lack of some options for support such as chat. In summary, PrognoCIS does offer plenty of functions for managing a busy medical practice, but practices should be plenty cognizant of these shortcomings before signing up for this service."
  ],
  "headers": {
    "1": "Features",
    "6": "Drawbacks",
    "9": "Support",
    "12": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "PrognoCIS": "https://prognocis.com/home-page-test/?utm_expid=.s4xF2Kc5TKuBksv7xQX9Aw.1&utm_referrer=https%3A%2F%2Fprognocis.com%2Fhome-page-test%2F",
    "EHR": "https://www.techradar.com/best/best-electronic-health-record-ehr-software",
    "Telemedicine": "https://www.techradar.com/best/best-telemedicine-software",
    "Medical Billing": "https://www.techradar.com/best/best-medical-billing-services",
    "Practice Management Software": "https://www.techradar.com/best/best-practice-management-software",
    "fax service": "https://www.techradar.com/best/best-online-fax-service",
    "AWS": "https://www.techradar.com/news/aws"
  }
}