{
  "source": "https://www.techradar.com/reviews/formstack",
  "title": "Formstack review",
  "category": "computing",
  "updated": "2020-05-13T08:53:38Z",
  "author": "michael-graw",
  "summary": "Advanced data collection for businesses",
  "verdict": "Formstack is one of the most powerful data collection tools available for businesses. The price tag is high, but you get tons of integrations, data analytics, and a user-friendly form builder.",
  "pros": [
    "Conditional logic allows multi-faceted forms",
    "Data analytics allows A/B testing",
    "Integrates with CRMs and payment processors"
  ],
  "cons": [
    "Plans are very expensive",
    "Pricing for add-ons is unclear",
    "Not well-suited for small businesses"
  ],
  "article": [
    "Formstack is a survey builder and data collection platform designed with businesses in mind. The platform makes it easy to build advanced forms thanks to conditional logic, A/B testing, and a wealth of other features. Plus, Formstack integrates with payment processors and a variety of lead and sales software tools. Unfortunately, many of these features are costly and Formstack doesn’t offer a free plan.",
    "Is Formstack the right tool for your needs? Let’s take a closer look at this data collection platform to find out.",
    "Formstack offers a 14-day free trial for any of its plans, but there is no free plan available. The Bronze plan costs $19 per month and allows you to create up to 5 forms. But, you can’t remove the Formstack branding from your forms with this plan.",
    "The Silver plan entails a significant price jump, up to $59 per month. For that, the main things you get are the ability to create up to 20 forms and to add your own branding to your surveys.",
    "The Gold and Platinum plans, for $99 and $249 per month, respectively, offer more functionality. You can have up to 5 users and 100 forms on the Gold plan or up to 10 users and 1,000 forms on the Platinum plan. These plans also allow you to approve or deny form submissions and to customize PDF reports. Note that there is also an Enterprise plan, although you’ll need to contact Formstack for pricing and options.",
    "All Formstack plans impose limits on the number of submissions that can be stored in your account database. But, these aren’t hard limits on how many form submissions you can have—if you don’t clear out your response database from time to time, new submissions will simply be pushed to your email.",
    "There are also add-on packages available, although Formstack doesn’t publicize much information about these. They contain integrations for creating automated workflows, attracting more form responses, or analyzing form data offline. You’ll need to contact Formstack for pricing for any add-on package.",
    "Formstack is a very advanced tool, with a number of features designed to increase productivity and enhance the utility of your forms.",
    "Conditional Logic",
    "One of the best features that Formstack offers is conditional logic. This feature allows you to design forms that adapt to individual respondents based on their answers to previous questions. The customized experience can help improve responses by creating more engaging surveys, not to mention it allows people to skip irrelevant questions.",
    "Conditional logic is also a big plus because it allows you to do more with fewer surveys. For example, you could have just one data collection portal on your website and use it for everything from lead generation to customer support. That also saves you money if you’re worried about having to upgrade your Formstack plan to get access to more forms.",
    "Integrations",
    "There’s no shortage of integrations in Formstack, which makes the platform very versatile. Businesses will appreciate that it works seamlessly with CRM platforms like Salesforce, Hubspot, and more. Better yet, you can map fields between your online forms and cloud-based CRM for lead generation, and Formstack will automatically capture partial form entries so you can follow up with potential leads.",
    "Formstack also integrates with a variety of payment processors, including PayPal and Stripe. You can set forms to calculate sales totals and accept discount codes, so it’s easy to manage basic e-commerce using Formstack.",
    "Data Analysis",
    "It’s also worth highlighting Formstack’s data analytics capabilities, since it’s much more powerful in this respect than many competing form builders. To start, the platform makes it simple to A/B test forms and spot bottleneck questions where people are leaving your forms.",
    "Reporting is available in the form of customizable PDFs and an online data visualization tool. Plus, you can integrate Formstack with Google Analytics to get more insight into how respondents are accessing your forms.",
    "For all the advanced features that Formstack offers, the platform is impressively friendly to use.",
    "You can design basic forms using a drag-and-drop editor, first laying out the skeleton of your questions. Advanced settings for conditional logic, A/B testing, and response validation can be accessed just by clicking on a form field. A simple undo button and revision history are extremely helpful when you’re working on a more complex form or collaborating with other designers.",
    "All of Formstack’s surveys are mobile-friendly, which is a big plus for boosting your response rates. By default, the platform display one question per page on mobile devices, but you can easily change this or apply the same settings to desktop versions of your forms.",
    "Formstack primarily offers customer support via email, although Platinum and Enterprise subscribers are able to get phone support. The company’s online resource center is very thorough, however, so it’s possible to find answers to a huge range of questions on your own. There’s also a community forum, which Formstack’s help team monitors, where you can post questions.",
    "Formstack offers a huge range of capabilities, but the platform is also quite expensive. Competitors like Typeform offer conditional logic at a more reasonable price, as well as comparable support for business integrations. If you just need simple surveys without advanced options like conditional logic and incomplete data capture, Jotform and Google Forms are both strong and relatively inexpensive alternatives to Formstack.",
    "Formstack is an incredibly versatile survey builder and data collection tool that’s carved out a niche for itself in the business world. The platform is very expensive, but it’s hard to argue over the price when you get powerful features like conditional logic, A/B testing, and partial data capture. Formstack’s wealth of integrations, including with CRMs and payment processors, and user-friendly form builder only add to the attractiveness of this software."
  ],
  "headers": {
    "2": "Plans and pricing",
    "7": "Features",
    "17": "Interface and in use",
    "20": "Support",
    "21": "The competition",
    "22": "Final verdict"
  },
  "links": {
    "survey builder": "https://www.techradar.com/best/best-survey-tools",
    "build advanced forms": "https://www.techradar.com/best/best-online-form-builder"
  }
}