{
  "source": "https://www.techradar.com/reviews/philips-9435-lcd-tv-review",
  "title": "Hands on: Philips 9435 LCD TV review",
  "category": "televisions",
  "updated": "2020-01-29T16:28:35Z",
  "author": "gerald-lynch",
  "summary": "Great sound – but what about the picture?",
  "verdict": "Philips’ latest collaboration with Bowers and Wilkins puts an ace sound-system in a mid-range TV, and the results so far seem positive.",
  "pros": [
    "Punchy sound system",
    "Attractive design with Ambilight",
    "Android OS"
  ],
  "cons": [
    "Bowers and Wilkins unproven with Atmos",
    "Possible motion issues"
  ],
  "article": [
    "It was one of the big TV talking points of last year – Philips was teaming up with much-lauded audio brand Bowers and Wilkins to build its sound systems into top-end OLED televisions. The results were marvelous, with the Philips OLED+984 Ambilight TV receiving a rare 5-star award from TechRadar.",
    "2020 rolls in, and the premium tech rolls down. This year, Philips is continuing the collaboration by bringing Bowers and Wilkins sound to its LCD range – plus, overhead Dolby Atmos smarts thrown in for good measure, too – with the Philips 9435. We had some brief hands-on time with the set at a recent European launch event – here are our first thoughts.",
    "No pricing has been announced for the Philips 9435 TV yet, though we do know it will launch at some point in Q2 in Europe, with both 55 and 65-inch sizes available. Given the LCD technology onboard, we’re hoping it they will come in at a reasonably attainable price point, with the 55-incher a shoe-in to come in at under £1,000.",
    "However, the Bowers sound system will put a premium on these sets that other LCD screens won’t have to account for.",
    "Note that, as ever with Philips better sets, these are TP Vision-built, meaning they won’t be shipping to the US, where the branding is instead held by manufacturer Funai.",
    "It’s also worth mentioning that a smaller Philips 9235 model is also launching with Bowers and Wilkins sound included – we’ve yet to see it in action, but it’s a 43-inch display with a more modest 2.1 sound system built in.",
    "As you’d expect from a screen that essentially has a soundbar attached to the front of it, the Philips 9435 looks a little different to your average set. Sure, it’s got a fairly standard chrome edge, but its stand and rear are a bit unusual.",
    "The Philips 9435 has a central foot that doubles up as its sound system, as well as a stabilizing point. Note that it’s not really a soundbar – it cannot be separated from the set, with the audio processing tech housed within the screen’s electronics. That gives that bar more room for chambers that push air around, making for a more robust sound. It’s finished with Kvadrat cloth, a blueish grey in the preproduction model we saw, which softens the look nicely.",
    "That sound system also means that the screen sits a little higher than your average stand-mounted set, as it’s compensating for the height of the audio unit as to not obscure the image. Don’t stress about wall mounting it all either – Philips will provide a bracket that accommodates wall hanging.",
    "With the added soundbar and Philips Ambilight lighting system onboard (projecting colors that match the onscreen action on the wall behind the set), the P435 take up a bit more real estate than your average flatscreen TV. But the feature trade-offs make it worthwhile.",
    "So, it's got a soundbar and Ambilight built-in; what else is special about the Philips 9435?",
    "Well, for starters it comes with the Android OS (in its 9.0 variant, at least until Philips decides 10.0 is in a ‘stable’ state), and that gives you access to built-in Chromecast, Google Assistant (Amazon Alexa voice control is also available), and all the streaming services and apps you could hope for, powered by a quad-core chip.",
    "A great thing about recent Philips TVs is that the company is open to all HDR formats. So you’re getting Dolby Vision as well as HDR10+, alongside HDR 10 and HLG.",
    "Four HDMI ports are onboard, but note they’re not the newer 2.1 standard. You’ll still get some of their features, such as Auto Low Latency Mode, but the variable refresh rate benefits, for instance, will be missing. That’s an important consideration if you’re thinking of upgrading to a PS5 or Xbox Series X console later this year. Rounding off the ports are two USB inputs, an optical audio output and headphone socket.",
    "It’s the sound that’s going to set the Philips 9435 apart, thanks to that Bowers and Wilkins sound system, and even without extensive critical analysis, it’s easy to hear that it’s miles ahead of what your average TV’s built in speakers can manage.",
    "The Philips 9435’s sound system makes use of five drivers, arranged in a 2.1.2 configuration, capable of pumping out 50W of power. That extra “2” on the end is important – you’re not only getting two front-facing drivers and a subwoofer for low frequencies, but two up-firing driver for Dolby Atmos’s room-filling overhead sound.",
    "Two demos showed off the kit in its Atmos configuration – a full-on scene from Netflix’s ‘Lost in Space’, and a more gentle musical cut from recent Elton John biopic ‘Rocketman.’",
    "The Lost in Space scene saw a giant ship trying to dock with a space station in the middle of an intergalactic storm and had dramatic, thundering sound effects throughout. The Bowers and Wilkins system added full-bodied weight to the action, with crips details and tight bass. It was however more difficult to discern a sensation of height from the Atmos effects – though admittedly the environment wasn’t ideal for critical listening.",
    "‘Rocketman’ was fully appreciable though, showing the scene where Elton John composes his hit ‘Your Song’. There was a great sense of dynamism as the song eventually began to swell, with wonderful separation between elements and width to the soundstage.",
    "The focus of the demo being the sets top-notch audio credentials, picture performance wasn’t something we had a huge opportunity to critique. But with Philips P5 Perfect Picture Engine on board, we’ve got high hopes from the set, following its blanket HDR support and solid edge-lit LED panel.",
    "One concern however lies with motion processing. There was a fair degree of blur and artifacting to the more fast-paced moments of the Lost in Space clip. Now, having spent time recently with other Philips TV models, we’re aware that by default the motion processing can be overly aggressive, which could lead to results like this, and can be easily remedied with some setting tweaks. We’re willing to give the benefit of the doubt here then (the image was otherwise vibrant and naturally colorful and as previously stated, this is a pre-production unit with time for some polish to be applied), but we’ll reserve final judgement for the full review process.",
    "The Philips 9435 has a ballsy, room-filling sound that other brands’ mid-range sets can only dream of. The Bowers and Wilkins collaboration is proving a fruitful one for Philips, then and we look forward to seeing it continue across the range.",
    "But can Bowers and Wilkins apply their audio mastery convincingly to the relatively new realm of Dolby Atmos? And can the picture quality match the gravity of the dramatic sound system? We’ll need more time for a definitive verdict, but Philips and Bowers quality combined with what’s expected to be an approachable price point is an attractive proposition."
  ],
  "headers": {
    "2": "Price and availability",
    "6": "Design",
    "10": "Features",
    "14": "Sound",
    "19": "Picture",
    "21": "Early verdict"
  },
  "links": {
    "OLED televisions": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Philips OLED+984 Ambilight TV": "https://www.techradar.com/reviews/philips-oled984-tv",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "Philips TVs": "https://www.techradar.com/news/philips-tv-2021-every-oled-miniled-and-ambilight-tv-coming-this-year",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}