{
  "source": "https://www.techradar.com/reviews/sony-a6600",
  "title": "Sony A6600 review",
  "category": "cameras",
  "updated": "2020-01-20T15:51:24.625Z",
  "author": "amy-davies",
  "summary": "Can Sony's flagship APS-C camera see off a competitive field?",
  "verdict": "On paper, the a6600 should be the APS-C camera to beat, with a top-performing sensor and a range of features that will appeal to a broad swath of photographers. However, Sony has resolutely stuck with a form factor that’s not as comfortable as rival cameras, with a convoluted menu system, and options that don’t always work as you’d expect them to.",
  "pros": [
    "Excellent tracking mode (with some limitations)",
    "Wide range of compatible lenses",
    "Fantastic battery life"
  ],
  "cons": [
    "Awkward controls",
    "Convoluted menu system",
    "Touchscreen control still limited",
    "Single UHS-I card slot",
    "Small preview area on screen"
  ],
  "article": [
    "Sitting right at the top of Sony's APS-C lineup for enthusiast photographers, the Sony A6600 is aimed at those who want a top-spec camera, but can't quite stretch to full-frame options like the Sony A7 III.",
    "Sony is known for releasing similar cameras in quick succession, and the A6600 comes not too long after the Sony A6400, and shares the same 24.2 MP APS-C sensor, along with the Bionz X processor that's also found in the flagship A9 II.",
    "The A6600 has inherited quite a few features from the A6400 (more on that below), but it also brings some new functionality, including in-body image stabilization and a bigger battery.",
    "Those features would once have been enough to see the A6600 dominate the mid-range mirrorless space, like the highly acclaimed NEX series and wildly popular Sony A6000 before it. But competition has grown increasingly hot in the last year, with new models from the likes of Fujifilm, Canon and Nikon, which recently launched its own APS-C mirrorless model, the Nikon Z50.",
    "So, with Sony clinging onto the same form factor it’s been using for the past decade for its APS-C series cameras, are the impressive specs of the A6600 enough to keep it competitive?",
    "A 24.2MP sensor sits at the heart of the Sony A6600. It’s the same sensor as the one in the Sony A6400 and the Sony A6100, which was the entry-level model announced at the same time as this camera. There's also the same Bionz X processor as found in the full-frame A9 II, and this helps to enable an impressive burst speed of 11fps, again in the A6400.",
    "And the similarities don’t end there. Another like-for-like spec is the 0.39-inch, 2.36 million-dot viewfinder, which is joined by a 3-inch tilting touch-sensitive screen. A hybrid autofocus system boasting 425 phase- and contrast-detection points, which cover 84% of the scene, is another shared spec. 4K video, up to 30fps, with full pixel readout and no pixel binning, is also present across both the A6400 and the A6600, as well as the A6100.",
    "So what extras does this flagship model bring? New features include in-body image stabilization, which means you don't have to rely solely on lens-based stabilization, plus the addition of HDR video and Real-time Eye AF for movies - features the A6600 shares with another full-frame Sony camera, the Sony A7R IV.",
    "There have also been a few tweaks when it comes to build and handling, which we’ll cover in the next section, while the new battery in the A6600 boosts the battery life to an impressive 720 shots per charge. There’s also a headphone socket, which is likely to come in handy for video shooters.",
    "In short, the A6600 can arguably be described as an 'A6400 plus' model. It’s mostly the same as that camera, but with a few fairly small, but important, upgrades that you may or may not consider worthy of the extra outlay, depending on the type of shooter you are.",
    "The A6600 comes in a kit package with the 18-135mm lens, which we've used for most of the shots in this test. One of the best things about using a Sony camera is that you have access to a huge range of optics, including specialist lenses for macro and wide-angle work, as well a lot of primes.",
    "Sony is a real pioneer when it comes to camera technology, bringing us many innovations over the past decade. Frustratingly, though, in the case of the Sony A6000 series, it's chosen to continue housing that tech in a body that's feeling more and more outdated as the years tick by.",
    "As we’ve seen with all the other cameras in the line, the A6600 uses a flat design, with the viewfinder over to the left. Compared to other APS-C models, such as the Fujifilm X-T3, Nikon Z50 and Canon EOS M50, it’s quite a big differentiator – and in our opinion, not for the better. One plus point is the addition of a deeper grip compared to the one of the A6400, which houses the larger battery for impressive stamina.",
    "On the top of the camera are two dials: one for selecting the exposure mode, and the other for changing settings depending on the shooting mode you’re in. We’d prefer to see a secondary dial at the top of the grip for changing another setting, which is handy if you like shooting in manual mode; as it is, you need to use the scroll wheel on the back of the camera in conjunction with the top dial to do this, which is awkward, especially when shooting through the viewfinder.",
    "Elsewhere, there’s a range of other buttons clustered towards the right-hand side of the camera, as well as two customizable buttons on the top. The buttons are a little on the small side, but they're not too badly cramped. For the price point, though, we’d like to see a joystick for controlling the focus point and navigating around menus.",
    "A function menu gives you quick access to commonly used settings, and this is also customizable, giving you the option to switch out anything you don’t use all that often.",
    "Sony has garnered a bit of a reputation for its convoluted menu systems – and things aren't much better on the A6600. There’s a bewildering array of tabs to navigate through, while some functions are hidden under bafflingly-named settings (Audio Signals to switch off the AF beep for instance). One thing we had to do a little too regularly was delve into the main menu to switch between Human Eye AF and Animal Eye AF, because the camera isn’t (yet) clever enough to do that by itself.",
    "It took Sony a long time to embrace touchscreen technology, and even now it refuses to implement it properly. You can tap to set the AF point, but you won’t be able to use the touchscreen to navigate menus, swipe through images in playback, or pinch-to-zoom – all things we tend to take for granted on other cameras, and on our phones.",
    "The A6600’s screen tilts upwards and downwards. You can also lift it up to face forwards, and while this leaves it a little bit obstructed by the viewfinder, it's a better solution for videographers than having the screen tilt at the bottom, which leaves you unable to use a tripod.",
    "The screen is three inches in size, but with a 16:9 aspect ratio it means that only the central portion is used to display the image preview when shooting in 3:2, making it appear much smaller. The viewfinder is serviceable, but despite having the same resolution and physical size as the Nikon Z50's, it doesn't feel as comfortable as its rival.",
    "One area where Sony excels is sports and action photography, with its class-leading A9 II full-frame camera in particular earning plaudits. Naturally, what’s on offer here isn’t quite as dazzling, but the A6600 does offer a lot for the enthusiast or amateur with a penchant for photographing moving subjects. The camera can muster 11fps, or 8fps if you wish to shoot silently. There’s a buffer capacity of 116 shots in JPEG, or 46 in raw – so you should find that short bursts for capturing fast-moving action are easily achievable.",
    "After you’ve captured a burst, you’ll see a display on screen indicating that the images are being processed; it’s disappointing not to have UHS-II card compatibility here to speed up that process, as you can be left waiting a while if you’ve held down the shutter for a few seconds.",
    "Focusing is very speedy, with both Eye AF and Animal Eye AF impressively quick at picking out an eye and locking onto it. It’s a shame that you have to switch between the Human and Animal modes in the main menu, particularly if you’re photographing both in close proximity (for example, kids and pets), but hopefully a future firmware upgrade will see the camera able to switch automatically.",
    "It’s also worth noting that Animal Eye AF doesn’t seem to work with every animal – you’ll likely get the best results with domestic pets such as dogs and cats. It completely ignored birds (swans, ducks and geese) during our tests, so it’s arguably less useful for wildlife photographers than it might appear.",
    "Tracking focus does a fantastic job of following a subject around the scene, especially if it’s not moving in an erratic fashion. Again, there’s a touch of disappointment here that tracking focus won’t work if you have Animal Eye AF activated – it would be hugely useful to be able to track a running animal, but again perhaps this will come with a firmware upgrade. Still, the AF does a fairly good job of tracking a moving animal without the Eye option enabled, if perhaps not quite so much the eyes.",
    "Mirrorless cameras have traditionally trailed DSLRs when it comes to battery life, but Sony has reduced the gap here by using a bigger battery, and you can reasonably expect the battery to last a full day of even fairly intense shooting. The fact that you can charge the battery in-camera also means you shouldn't have to carry extra chargers for traveling, which is always a bonus.",
    "It’s a little surprising to see Sony sticking with a 24MP sensor in the A6600, considering how far it's pushed sensor technology in the rest of its lineup. Its APS-C cameras have been using 24MP sensors since the days of the NEX-7, which was announced back in 2011.",
    "Presumably, Sony believes the average photographer doesn’t need any higher resolution – and, in fairness, 24MP is roughly in line with rival models, with only the Fujifilm X-T3 going a little higher with its 26.1MP sensor.",
    "And in use, the A6600’s sensor puts in an excellent performance. Overall levels of detail are fantastic, while colors are nicely saturated without looking unrealistic.",
    "The 18-135mm kit lens is a solid all-round performer, and gives you good scope to capture a diverse range of subjects. With its equivalent focal length of 27-202mm, it’s ideal for everything from landscapes at the wider angle to nature and wildlife at the long end.",
    "We’ve also been using a 70-350mm f/4.5-6.3 G OSS lens, which is even better for wildlife – especially when you consider that the crop factor of an APS-C sensor boosts the reach of this lens to 105-525mm.",
    "In most situations, the A6600’s all-purpose metering system does a great job of producing well-balanced exposures, although they can occasionally be a little on the dark side, so it’s worth keeping an eye on exposure compensation in some situations. It’s also worth keeping Dynamic Range Optimizer switched on and set to Auto, as this does a good job of balancing out shadows and highlights.",
    "The A6600 performs extremely well in low light. Noise is well managed up to around ISO 6400, when it starts to become evident even at relatively small sizes, such as A4. However, if you're sharing images online via social media, even images shot at ISOs as high as 25600 can be usable; we’d suggest avoiding ISO 51200 and higher unless you're absolutely desperate, though.",
    "Having in-body image stabilization gives you scope to shoot at slower speeds than you might otherwise be able to; so if you often shoot in low light, the A6600 should be higher on your shopping list than the otherwise fairly similar A6400.",
    "The Sony A6600 has something of a split personality. It's capable of producing some excellent shots, with very useable and useful autofocus and tracking capabilities; there’s also a lot to be said for its burst-shooting capabilities, and for the battery life, which is pretty remarkable for a mirrorless camera.",
    "However, using the camera can be a frustrating experience, thanks to the A6600's various handling quirks, and this means it's easy to recommend other models that offer similar performance in a more user-friendly body. The Fujifilm X-T3 is the obvious contender here, although it's worth bearing in mind that there are rumors of a Fujifilm X-T4 launching soon.",
    "Unless you really need that in-body image stabilization for video and low-light shooting, it’s also difficult to recommend the A6600 over its older sibling, the Sony A6400: it gives you the same image quality, the same frame rates, and indeed the same sensor in a cheaper body, albeit one with inferior battery life.",
    "It's also disappointing to see a fairly pedestrian screen and viewfinder, and just a single UHS-I SD card slot, on a camera which doesn’t leave you with much change from $1,400 / £1,500 / AU$2,400.",
    "On a more positive note, the range of lenses available for Sony’s cameras is extensive, so you’ll never be short of glass to pair with the A6600, and the bundled 18-135mm lens is a good option for covering a range of subjects, and for travel. That said, since Sony shares its optics across its full-frame and crop-sensor cameras, relatively few have been specifically designed for APS-C cameras.",
    "We can’t praise Sony highly enough for its commitment to advancing camera performance with its innovative approach – we just wish it would extend that innovation to body design for APS-C cameras like the Sony A6600."
  ],
  "headers": {
    "5": "Features",
    "11": "Build and handling",
    "20": "Performance",
    "26": "Image quality",
    "34": "Verdict",
    "40": "The competition"
  },
  "links": {
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Sony A6400": "https://www.techradar.com/reviews/sony-alpha-a6400-review",
    "A9 II": "https://www.techradar.com/reviews/sony-alpha-a9-ii",
    "Sony A6000": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/sony-alpha-a6000-1223772/review",
    "Nikon Z50": "https://www.techradar.com/reviews/nikon-z50",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Fujifilm X-T3": "https://www.techradar.com/reviews/fujifilm-x-t3",
    "Canon EOS M50": "https://www.techradar.com/reviews/canon-eos-m50-review",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4"
  }
}