{
  "source": "https://www.techradar.com/reviews/xbox-games-pass",
  "title": "Xbox Game Pass review",
  "category": "gaming",
  "updated": "2021-08-02T11:01:48.457Z",
  "author": "lloyd-coombes",
  "summary": "Xbox Game Pass is only getting better",
  "verdict": "If you’re an Xbox One or Windows PC gamer, there’s no doubt in our mind that Xbox Game Pass has a lot to offer you. With the library growing month by month, a big year of first-party releases, and even a new Xbox Series X console and cloud streaming on the way, we can’t wait to see what happens next.",
  "pros": [
    "First-party titles on day one",
    "Redesigned PC app is much more stable",
    "Great mix of titles",
    "EA Play added at no extra cost",
    "Stream to Android devices for free"
  ],
  "cons": [
    "Fewer titles than PS Now",
    "Price bump for both PC and console"
  ],
  "article": [
    "Xbox Game Pass may have launched all the way back in 2017, but it’s undeniably the ‘killer app’ for Microsoft’s new Xbox Series X and Xbox Series S hardware.",
    "It’s often referred to as a ‘Netflix for games’, and it’s a moniker that’s actually pretty accurate – just as the now ubiquitous streaming service means you could never buy a DVD or 4K Blu-Ray ever again, Microsoft’s subscription means you may never need to buy a game either.",
    "At a reasonable monthly price, players get access to a wealth of third-party games, with Microsoft’s own first-party offerings landing on day one, too. With the launch of the Xbox Series X and S, the service is expanding to include EA Play, too, meaning players can enjoy a wealth of the publisher’s back catalog as well as grabbing free 10-hour trials of new releases.",
    "Also new is the addition of Cloud Gaming (formerly known as Project xCloud), which has left beta and allows players to stream games to their mobile devices – at least as long as they’re on Android. Here’s hoping Apple and Microsoft can work out a way to get the service on iOS and iPadOS in the near future.",
    "Here’s everything you need to know about the service, from the price to the contents, to the platforms available.",
    "Xbox Game Pass is a service that offers a huge number of Xbox and PC titles for players to download and play on their Xbox console or Windows PC (or stream to their Android phone or tablet) at the cost of a single monthly fee ($9.99 / £7.99 / AU$10.95 on console, or the same on PC).",
    "While the PC subscription cost has essentially doubled since leaving beta, it’s all part of Microsoft’s way of nudging users towards the Xbox Game Pass Ultimate subscription, which includes both platforms for $15 / £10.99 / AU$15.95 per month.",
    "Whichever membership you go for, you’re in for a wide array of titles from both first and third-parties from every generation of Xbox hardware. Thanks to backward compatibility, you can jump from the latest releases like DOOM Eternal to classics like Alan Wake and Ninja Gaiden 2, to the likes of Fuzion Frenzy, a game that launched alongside the original Xbox console.",
    "While PC players don’t get quite as many titles, they do get access to a wealth of indie darlings like Katana Zero, AAA-quality games like Gears 5, and everything in between.",
    "While playing any of the games on each platform, you’ll earn Achievements and Gamerscore as you would usually, and a “Quest” system lets you turn in rewards based on trying new games or completing set tasks.",
    "EA Play offers over 60 EA titles, too, and will be available as a free perk. Usually a $4.99 / £4.99 a month purchase on its own, EA Play is just another string to Game Pass’ bow.",
    "It’s a fun way to incentivize breaking out of your gaming comfort zone, and there’s no risk of buyer’s remorse since the games are included with your membership.",
    "Of course, you can opt to purchase games outright. First-party games appear to stay indefinitely, but others don’t – and a 10% discount for those at risk of leaving Game Pass is a good incentive to pick it up for good. You’ll also save on DLC and any add-ons or microtransactions, too.",
    "So that’s console and PC, but what about Cloud Gaming? Well, Microsoft’s game-streaming service doesn’t cost anything extra but is now available in 22 countries. So as long as you have an Android phone running version 6.0 of Google’s OS or later, you’ll be able to stream your favorite titles on the move.",
    "Of course, you’ll need a strong internet connection, and iOS fans will be disappointed to know they can’t use the service yet – although Microsoft is looking into ways to circumnavigate Apple’s App Store policies.",
    "While Sony has made decent strides in catching up with its PlayStation Now service, it still lags behind. It’ll cost you $9.99 / £8.99 per month (with no Australian release yet), and you’ll need to pay an additional $9.99 / £6.99 a month for online play as there’s no bundle that includes PlayStation Plus.",
    "Previously tucked away in a corner of the Xbox Store, Xbox Game Pass can be found almost front and center on the Xbox dashboard.",
    "Simply scroll down to find a handful of content blocks with recently added titles, suggestions, or even a kind of “shuffle” feature for when you’re not sure what you’re in the mood for.",
    "Within the Game Pass menu, you can check out games by genre, or look at the full list of included titles to pick your next title. There’s also a “Leaving Soon” section, so you can plan any purchases you may want to make.",
    "As we noted earlier, quests also give players rewards points to turn in, which in turn can be redeemed towards giveaways and gift cards from retailers. Sure, it’ll take you a while to grind for the rewards with more monetary value, but it’s a great way to keep players invested in the service as well as the games within it.",
    "When exploring your “My Games and Apps” page, you’ll also spot which games are part of Game Pass (or EA Play) membership, so you’ll know which service each game comes from.",
    "From “My Games and Apps”, you can head into your full library and access Game Pass content there, too. Microsoft really wants to get the service under your nose, and it does so in a pretty tactful way.",
    "Each game has a description, trailer and screenshots, making it easy to narrow down your choice. You can also see the size of the download, which is handy if you have a usage cap or simply want to squeeze as much as you can on your hard drive.",
    "While jumping into a PlayStation Now session without needing to download a game is inevitably going to be quicker than downloading a huge title, the increased stability and reduced input lag make Game Pass feel sturdier.",
    "On the PC front, Microsoft has greatly improved the app experience. Further refined from the beta period, the Xbox app now offers a clean menu that shows off all of the games available, as well as what your friends are playing.",
    "There are some occasional hiccups (phantom notifications seem to be common), but for the most part it’s much better than the prior version.",
    "Once you install a game, it’s added to your PC as if it were purchased from the Microsoft Store. So, while you can launch Game Pass games in the Xbox App, it’s not mandatory, and it feels refreshing to not have to deal with a launcher.",
    "It sounds like a cliche, but Xbox Game Pass really does offer something for everyone within its 200-or-so strong lineup.",
    "PlayStation Now offers over 800 titles, but with many of them only available through streaming, your mileage may vary.",
    "As noted earlier, DOOM Eternal was recently added to the console version of the service, while the likes of Forza Horizon 4, Halo: The Master Chief Collection, and Gears 5 all bulk out an impressive first-party showing.",
    "Third-party titles are spread between single and multiplayer games of both indie and AAA varieties. Players can jump into the entire Kingdom Hearts franchise, or play a few rounds of multiplayer juggernaut Rainbow Six: Siege.",
    "Bungie’s Destiny 2 is available on Game Pass, too, with all expansions included and Beyond Light, due in November, also arriving on day one.",
    "Then there are Xbox 360 and original Xbox classics, with Fable, Fallout New Vegas, and Mass Effect at your fingertips.",
    "EA Play will only bolster the lineup further, adding recent releases like Need For Speed: Heat and Battlefield V, as well as classics like Dragon Age: Origins and Skate 3. Microsoft's acquisition of Bethesda, too, should mean we get an extensive supply of Fallout and Elder Scrolls games for the service.",
    "While the PC list is a little slimmer (but still stands at over 150 titles), players can enjoy the likes of ARK: Survival Evolved, Crusader Kings III, Forza Motorsport 7, and more.",
    "Xbox Game Pass is what Microsoft is looking to hang its hat on with the next console generation, and it’s easy to see why.",
    "Between all of the publisher’s first-party titles landing on the service on day one, to impressive third-party support, and the addition of EA Play, the service feels just as crucial to the platform as an Xbox Gold membership.",
    "Android users can play a huge number of games on the go, too, meaning you may want to dip into the service just to play games on the go. Microsoft is building Game Pass into its base platform and tying all of its hardware and software to it, and that commitment can only be a good thing."
  ],
  "headers": {
    "5": "What is Xbox Game Pass?",
    "16": "Design and interface",
    "27": "Xbox Game Pass content library",
    "35": "Verdict"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "4K Blu-Ray": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481/uk/news/video/blu-ray/the-best-4k-ultra-hd-blu-ray-movies-1329414",
    "expanding to include EA Play": "https://www.techradar.com/news/microsoft-has-made-xbox-game-pass-ultimate-even-better",
    "Project xCloud": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "DOOM Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Microsoft's acquisition of Bethesda": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "Elder Scrolls": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors"
  }
}