{
  "source": "https://www.techradar.com/reviews/amd-radeon-rx-5600-xt",
  "title": "AMD Radeon RX 5600 XT review",
  "category": "computing",
  "updated": "2021-10-12T11:19:15Z",
  "author": "bill-thomas",
  "summary": "Nvidia better watch out",
  "verdict": "The AMD Radeon RX 5600 XT is exactly what we want in a 1080p graphics card: high frame rates, affordable price tags and plenty of software features. The only thing holding it back from a perfect score is the lack of ray tracing.",
  "pros": [
    "Generation-defining performance",
    "Affordable",
    "Doesn't take too much power"
  ],
  "cons": [
    "No ray tracing",
    "Only 6GB of VRAM",
    "Messy launch with VBIOS"
  ],
  "article": [
    "Voted Best GPU at the TechRadar Choice Awards 2021",
    "Editor's note: We've retested the Sapphire Pulse Radeon RX 5600 XT after installing the new VBIOS, and have updated the review with updated performance information and whether it impacts our recommendation.",
    "The AMD Radeon RX 5600 XT arrives in an odd state for the graphics card industry. Right now Nvidia has five graphics cards aimed at the 1080p segment. That's a little confusing for the average consumer, but luckily AMD has finally been able to put out a GPU that stands completely alone in the forefront of the 1080p segment.",
    "The performance is strong enough here to make it the de facto recommendation for the type of user that's still on 1080p in 2020, but really wants to take that resolution to the limit. Even compared to the Nvidia GeForce RTX 2060, a graphics card that straddles the line between 1080p and 1440p gaming, the Radeon RX 5600 XT beats it at a lower price.",
    "So, while Nvidia has absolutely saturated its market with four graphics cards targeting the same resolution, AMD has done the same with just two cards, and still beats Nvidia at every price point. And sure, with the RTX 2060 Nvidia offers ray tracing and deep learning supersampling (DLSS), but when you're after raw performance for the price, it makes more sense to go with a Radeon graphics card in 2020 than ever before.",
    "The AMD Radeon RX 5600 XT is available right now, starting at $279 (about £215, AU$400) with some cards obviously going higher in price, depending on manufacturer and model. The Radeon RX 5600 XT we were provided with for review is the Sapphire Pulse model, which carries a slight factory overclock and a dual BIOS, and retails for $289 (about £220, AU$420).",
    "When we were briefed on the Radeon RX 5600 XT, AMD made sure to compare it against the Nvidia GeForce GTX 1660 Ti, which launched for the same $279 price point, though you can find it for around $269 (£244, AU$439) these days. At this price point, AMD absolutely comes out on top, but what's more impressive is how the card compares with the more expensive GeForce RTX 2060.",
    "After the RTX 2060 Super came out in July, the original RTX 2060 saw price cuts down to $349 (£269, AU$549), but prices have fallen even more since then. You can get a standard non-overclocked RTX 2060 from the likes of EVGA for around $299 (about £230, AU$430) right now on Newegg. However even at that lower price point, Nvidia's entry-level ray tracing card fails to topple the Radeon RX 5600 XT. Performance is about on the same level, with both Nvidia and AMD carrying away wins in some tests, so the key difference here is the ray tracing.",
    "Don't get us wrong, we're actually fans of Nvidia's RTX tech here at TechRadar, but when the question is spending an extra $30 on a PC component for a graphics feature you may not use, it's hard to recommend. Really, you should take a look at the games that support ray tracing to see whether or not you need Nvidia's tech. If you don't play any of the games currently supported, the AMD Radeon RX 5600 XT is the bargain here, and would definitely be our recommendation.",
    "The AMD Radeon RX 5600 XT falls right between the Radeon RX 5500 XT and the RX 5700, which of course means it's based on the same 7nm rDNA graphics architecture.",
    "What's surprising, though, is how much beefier the RX 5600 XT is than the RX 5500 XT. Looking back at the latter card, it's only equipped with 1,408 Stream Processors in 32 compute units. But the RX 5600 XT bumps that all the way up to 2,304 – the same amount in the AMD Radeon RX 5700.",
    "That should immediately give you a clue as to the kind of performance you can expect with this graphics card, but you should temper your expectations at least a little bit. Unlike the Radeon RX 5700, memory capacity and the memory bus get a cut to 6GB and 192-bit, respectively. That means the RX 5600 sees a big cut in 1440p performance, but it is still playable.",
    "The 6GB of GDDR6 memory is more than enough for 1080p gaming, even in 2020, but it may become a problem when you try to turn that resolution slider up, especially here in a few years.",
    "That memory capacity is an odd choice, though. We get that's the same amount of VRAM found in the GeForce GTX 1660 Ti, but AMD already packed the Radeon RX 5500 XT with up to 8GB, so we can't imagine why the cut was made here. If we had to guess, we'd say it's a measure to keep the price low, but it's still disappointing.",
    "And of course, we can't talk about graphics cards in 2020 without bringing up ray tracing. Now, we know that AMD will have ray tracing in some capacity at some point – Team Red will be behind the next generation consoles, after all. However, right now if you want to jump in on these graphical bells and whistles, you're still stuck with Nvidia. The amount of PC games out there that will let you enable ray tracing grows with each passing day, and AMD graphics cards simply can't handle these effects.",
    "So, even if you have a passing interest in ray tracing right now, you're going to want to go with the Nvidia GeForce RTX 2060. The performance is about equal between the RTX 2060 and the Radeon RX 5600, so really what you're picking is either raw performance or spending $20 more to get in on the ground floor of Nvidia's ray traced future. This all depends on your own priorities, though.",
    "Don't think this means that AMD doesn't have plenty of its own tricks, though. Over the last few months, AMD has worked in a ton of software features into its Radeon Software and it actually might be enough to convince some folks to go with Team Red.",
    "The most impressive new feature here is Radeon Boost. Now, when you're playing ultra-competitive games like Overwatch or Counter-Strike, frame-rate is king 100% of the time. Features like ray tracing and DLSS simply don't matter. What Boost does is sense when your camera is moving quickly and intelligently lowers the resolution of background areas of the scene, greatly improving framerate when it matters: high movement scenarios.",
    "We were able to test this feature in Overwatch, and with it enabled, we legitimately did not notice a difference when in the middle of gameplay. The resolution on things like your gun, other characters and the UI remains the same, which means only things that you're not paying attention to get cuts to resolution.",
    "When paired with something like Radeon Anti-Lag, which cuts the amount of time needed to synchronize frames between your GPU and CPU, AMD Radeon starts to look like the right platform for folks that just want to play esports at high framerates. Nvidia definitely has more powerful (and expensive) GPUs out there, but this combination of competent hardware and software makes an excellent sales pitch for any competitive gamers out there.",
    "That's kind of where we think that \"Nvidia vs AMD\" war is right now. People that just want the eye candy turned all the way up should probably go with Team Green, as ray tracing is simply too cool to live without, especially since it's so affordable these days. However, there's a wide swath of gamers that don't care about that at all and just want some killer frame rates in their favorite competitive games, and for the first time in a long time, AMD has won that segment of the market.",
    "Before we dive into the performance of the Radeon RX 5600 XT, we want to take a brief look back into the past. Remember the Nvidia GeForce GTX 1060 6GB? When we were briefed on the RX 5600 XT back at CES 2020, AMD brought up the aged graphics card, and we've been thinking about it ever since.",
    "It was a graphics card that allowed anyone to play pretty much every then-current game at 1080p with a high frame rate. We genuinely think that card will go down in history as one of the best pieces of PC component hardware of all time, and we think the RX 5600 XT really does follow in its footsteps.",
    "That's exactly the claim that AMD made to us, and we almost laughed at the time. We thought to ourselves: \"yeah, ok, you're claiming that this new card is the true successor to one of the most popular cards ever.\" But after the benchmark results, well, AMD has a point.",
    "Starting off with the synthetic benchmarks via 3DMark 11, the AMD Radeon RX 5600 XT is an absolute behemoth. In Firestrike Ultra, not only is the 5600 XT a whopping 30% faster than the GTX 1660 Ti – which, again, is the same price – but it beats the RTX 2060 by 13%.",
    "The Nvidia GeForce RTX 2060 does pull ahead in the Time Spy tests, by 8% and 12% in Time Spy and Time Spy Extreme, respectively. But, the fact that these graphics cards are this close in the first place is pretty amazing.",
    "Gaming performance follows a similar pattern, too. In Metro Exodus with Ultra Settings, the AMD Radeon RX 5600 XT is 5% faster than the RTX 2060 and 20% faster than the GeForce GTX 1660 Ti. But, in Middle Earth: Shadow of War, Nvidia's hardware does much better, with the RTX 2060 pulling ahead by 12% at 1080p. But, it's important to note that the GTX 1660 Ti doesn't beat the RX 5600 XT in a single test.",
    "However, there's an elephant in the room, and it's the VBIOS controversy. Essentially in response to Nvidia's price drop of the RTX 2060, AMD released a VBIOS update to its aftermarket partners. Now, originally, we reviewed the RX 5600 XT in its out-of-the-box configuration and that's what the numbers we've mentioned above are from.",
    "But after updating the VBIOS, we found performance jumped up significantly to the point where it absolutely dominates the RTX 2060 whenever the 6GB of VRAM in the Sapphire Pulse RX 5600 XT wasn't the limiting factor.",
    "After updating to the new VBIOS, we found that performance jumped by around 8% in all testing, further widening the gap over the card's original target, the Nvidia GeForce GTX 1660 Ti. We could go on all day about why AMD's choice to do this last-minute update was shady and harmful to consumers, but we've been assured that unless you picked up a graphics card on release date, you likely won't have to worry about updating the VBIOS yourself.",
    "We could probably go on at length about how the Nvidia GeForce GTX 1660 Ti is essentially obsolete at this point and should be ignored, but the fact is that Nvidia is still selling it, even if at its price point it simply doesn't make sense. The AMD Radeon RX 5600 XT shows users what kind of performance they should expect at this price level, and for that we have nothing but props to give Team Red.",
    "If you've been on the market for a 1080p graphics card recently our hearts truly go out to you. The marketplace is legitimately super confusing right now, what with Nvidia's four graphics cards that all do essentially the same thing and AMD's old Polaris cards confusing the market even more.",
    "But with the AMD Radeon RX 5600 XT, we feel like the competition is finally there to clear things up, and it may just be the best 1080p gaming card out there if you're after raw performance.",
    "The only people we would refrain from recommending the RX 5600 XT to would be anyone that wants to take advantage of Nvidia's ray tracing technology. We're still disappointed that AMD hasn't done anything in this arena yet, and with some models of the Nvidia GeForce RTX 2060 being so close to the 5600 XT in price, it makes a lot of sense to take that small step up if you want to live your life ray traced."
  ],
  "headers": {
    "5": "Price and availability",
    "9": "Features and software",
    "21": "Performance",
    "31": "Final verdict"
  },
  "links": {
    "TechRadar Choice Awards 2021": "https://www.techradar.com/news/dell-g15-ryzen-edition-voted-best-budget-laptop-at-techradar-choice-awards-2021",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "Nvidia GeForce RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Nvidia GeForce GTX 1660 Ti": "https://www.techradar.com/news/best-nvidia-geforce-gtx-1660-ti",
    "RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "AMD Radeon RX 5700": "https://www.techradar.com/reviews/amd-radeon-rx-5700",
    "Nvidia vs AMD": "https://www.techradar.com/news/computing-components/graphics-cards/amd-vs-nvidia-who-makes-the-best-graphics-cards-699480",
    "Nvidia GeForce GTX 1060 6GB": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/nvidia-geforce-gtx-1060-1325075/review",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review"
  }
}