{
  "source": "https://www.techradar.com/reviews/jbl-bar-91",
  "title": "Hands on: JBL Bar 9.1 review",
  "category": "audio-visual",
  "updated": "2020-01-07T18:17:46Z",
  "author": "olivia-tambini",
  "summary": "JBL impresses with its Dolby Atmos soundbar",
  "verdict": "We've only spent the briefest of times with the JBL Bar 9.1 – but so far, we're impressed with this powerful Dolby Atmos soundbar, thanks to innovative design, great sound, and good connectivity.",
  "pros": [
    "Innovative design",
    "Immersive Dolby Atmos sound",
    "4K and Dolby Vision compatibility"
  ],
  "cons": [
    "Small 'sweet spot'"
  ],
  "article": [
    "Only the very best soundbars can replicate the immersive sound of the cinema in the home – and JBL's latest Dolby Atmos soundbar, the JBL 9.1 Bar, seeks to do just that.",
    "Announced at CES 2020 in Las Vegas, the JBL Bar 9.1 comes with upward-firing drivers, detachable wireless surround speakers, and a 10-inch wireless subwoofer, that work together to create virtual surround sound – without the need for a true 9.1 speaker set up.",
    "We spent a little time getting to grips with the soundbar – and so far, we're very impressed.",
    "Available in April, the JBL 9.1 Bar will cost $999 – that works out at around £760 / AU$1450 based on current conversion rates.",
    "For comparison, our current favorite soundbar, the Samsung HW-Q90R costs $1399 / £1499 (around AU$2000) – for a Dolby Atmos soundbar, subwoofer and wireless rear speakers, $999 isn't a bad price at all.",
    "At first glance it looks like your average, slightly boring soundbar, but look a little closer and you'll notice that the JBL 9.1 Bar is actually quite different from its counterparts, thanks to nifty detachable rear wireless speakers.",
    "Magnets on each end of the soundbar hold these rear speakers in place when not in use; docking them with the main central bar unit allows them to charge, and when detached they automatically assign themselves as rear channels, and are good for 10 hours of playback.",
    "On the top of the soundbar you'll find power and volume buttons, and well as a button to select your audio source; a subtle LED display that's integrated into the front grille of the soundbar tells you the volume you're at.",
    "The subwoofer is also pretty unassuming; like most subwoofers, it looks like a big black box that sits to the side of your soundbar.",
    "This high-spec soundbar comes with support for Google Chromecast and Apple AirPlay 2, and can play music from Bluetooth or over your Wi-Fi network. In terms of connectivity, you have HDMI in and out – the latter has HDR passthrough, making the JBL 9.1 Bar Dolby Vision and 4K-compatible.",
    "We heard the soundbar in action, and were impressed by the crisp, immersive soundstage it offers, despite its compact size.",
    "The Dolby Atmos audio feels truly spacious thanks to those upwards firing drivers that bounce sound off of your ceiling, while the wireless subwoofer provides powerful, pounding bass. As we listened to a demo of rainstorm, it felt as though the rain were falling all around us, while thunder clapped in the distance – in short, the Dolby Atmos surround sound was very convincing indeed.",
    "As the JBL Bar 9.1 is on the smaller side, the sonic 'sweet spot' is somewhat limited– unless you're planning on roaming your living room as you watch TV though, it's not a huge drawback.",
    "So far, we're very impressed by this diminutive soundbar; the Dolby Atmos audio is powerful and super immersive, we really liked the way the wireless rear speakers integrate into the soundbar itself, and it has enough connectivity options to keep even the biggest cinephile happy.",
    "We'll need to carry out further tests before we can give a definitive verdict, but don't be surprised if you see the JBL 9.1 Bar in our round up of the best soundbars of 2020 in the near future."
  ],
  "headers": {
    "3": "Price and availability",
    "5": "Design",
    "9": "Features and performance",
    "13": "Early verdict"
  },
  "links": {
    "best soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "CES 2020": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Samsung HW-Q90R": "https://www.techradar.com/reviews/samsung-hw-q90r-soundbar",
    "best soundbars of 2020": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008"
  }
}