{
  "source": "https://www.techradar.com/reviews/google-nest-hub-max",
  "title": "Google Nest Hub Max review",
  "category": "audio-visual",
  "updated": "2020-10-01T09:31:56Z",
  "author": "andrew-williams",
  "summary": "The Google Nest Hub Max is a great smart display",
  "verdict": "The turbo-charged version of the Google Home Hub is better for video, music, podcasts and just about everything else. It may not be perfect, but what’s not to like about that summary?",
  "pros": [
    "Excellent screen",
    "Good, music-friendly speaker",
    "Neat design",
    "Well-priced"
  ],
  "cons": [
    "Display isn’t as sharp as Lenovo’s",
    "Nest integration wobbly at launch"
  ],
  "article": [
    "The Google Nest Hub Max is a larger version of the Google Home Hub, a smart speaker with a screen – also known as a smart display.",
    "So why isn’t it called the Home Hub Max? The Nest Hub Max also has a front-facing camera, and can plug into the Google-owned Nest platform to act as a smart home camera. Google has also renamed the original Home Hub to bring it into the Nest family.",
    "This part of the Google Nest Hub Max needs a little work judging by our experience. But this is otherwise a great smart speaker. It sounds good enough to act as a mini Hi-Fi, Google Assistant feels responsive and the large screen lets you watch YouTube while you cook.",
    "[Update: The Google Nest Hub Max has a new competitor in the form of the Amazon Echo Show 10 (2020) – and it comes with Netflix support and an audio-focussed design.",
    "There's also a new Google Nest speaker in town – the Google Nest Audio comes with upgraded sound quality, a new design, and costs $99 / £89 / AU$149. It launched alongside the Pixel 5 and a new Chromecast at the company's Launch Night In event on September 30.]",
    "The Google Nest Hub Max was released in September 2019, around a year and a half on from the original Google Home Hub.",
    "It costs $229 / £219 / $349, similar to the original price of the 10-inch Lenovo Smart Display. These devices age quick enough to ensure you can now buy the Lenovo for significantly less. But which is better?",
    "The Lenovo has a sharper screen and a privacy cover for its camera. But we think the Google Nest Hub Max looks better.",
    "Most people think of Amazon when the subject of smart speakers comes up. However, Google set the standard for their aesthetics, and there’s plenty of this style in the Google Nest Hub Max.",
    "It looks like a curvy Android tablet bolted onto a dark grey cloth-lined base. To some it might look like a touchscreen interface you’d find in a museum exhibit, but we think it looks better than the blocky Lenovo Smart Display.",
    "Its footprint is economical too. There’s no huge bulge at the back, no hidden curves. The Google Nest Hub Max is easy to fit onto a kitchen work surface, which is one of the best places for this smart speaker.",
    "Of course, compare the Google Nest Hub Max’s speaker part to the iPad Pro or Samsung Galaxy Tab S6 and it doesn’t seem as glossy. There are fairly chunky borders. This is the look of a tablet from years ago. But this unit costs far less than those high-end tablets, and has much better-sounding speakers.",
    "Do note that you can’t remove the tablet part. The design may encourage you to think of the Nest Hub Max as a Google tablet with a speaker attached, but it’s really nothing of the sort. There’s a touchscreen and you can partially control the unit with it, but to remotely unlock its potential you’ll need to talk to it, or at least “cast” content from your phone.",
    "The Google Nest Hub Max has a 10-inch LCD screen, much larger than the 7-inch display of the original Home Hub.",
    "This is a huge upgrade if you want to watch video on this smart speaker, which is a natural fit if you put the Google Nest Hub Max in a bedroom or kitchen rather than your living room.",
    "We wouldn’t be too pleased with this screen if it were packed into a tablet, though. Resolution is 1280 x 800 pixels, which leaves fairly clear pixellation when you look up close.",
    "Here’s the thing: most owners aren’t going to look at the Google Nest Hub Max screen too intently that often. You might check the weather every morning, but if you end up watching YouTube videos on this display, it will most likely be while you do something else. Smart displays are not TVs.",
    "If you are after a beside YouTube machine, consider the Lenovo Smart Display while it is still available. That 10-inch Google Assistant box has a 1080p screen, and is both sharper and cleaner-looking than this one.",
    "What you can actually stream to these screens is limited. The software the Google Nest Hub Max uses is not like Android. There’s no homescreen of apps to tap and it cannot stream video from Netflix. While you can link the speaker to your Netflix account in the Google Home app, it simply refuses to play any Netflix content when you ask it to.",
    "So what can you play? YouTube and Google Play video content are the two top sources. Again, though, YouTube navigation on the Google Nest Hub Max’s touchscreen has been deliberately limited to stop it from seeming like a tablet that you happen to be able to talk to. You can’t rifle through categories as you might do on a tablet, phone or smart TV interface.",
    "The mission of devices like these is to make us feel comfortable talking to the disembodied voice of Google Assistant.",
    "Not comfortable yet? You can avoid this partially by using Chromecast, Google’s content streaming standard. The Google Nest Hub Max does show up in the Spotify app as a connected speaker, though. It’s near-perfect for audio, but video could be improved.",
    "The Google Nest Hub Max’s behavior in low light probably couldn’t, though. This screen looks almost bizarrely good when dimmed to match a moodily lit room. Screensaver photos almost appear to be printed behind the display glass. And when the lights go out completely, the screen backlight is able to limbo all the way down to the level you might expect of a dedicated higher-end LCD alarm clock.",
    "This isn’t a normal LCD screen. And you can’t really appreciate these extra powers from the spec sheet, which makes the Google Nest Hub Max’s display sound mediocre. The color temperature also changes to match ambient light. Most domestic lightbulbs have a very warm white hue, so the screen tilts towards a warmer, yellowy tone. You can turn this feature off if you find the look too soft.",
    "If the Google Nest Hub Max does not run Android, what does it run? Google doesn’t tend to refer to it in the same manner as the software of phones and tablets, but this is Home.",
    "What the screen shows when not in use is your main customization choice. You can have a slideshow of Google Earth images, pics from the Google Arts archive, or those of your own Google Photos collection. Or a clock face, which is much less distracting if you’ll put the Google Nest Hub Max in the corner of a room in which you’ll work or watch TV.",
    "Swipe down from the top of the screen and you’ll see the shortcuts panel. Swipe from the bottom and the settings panel appeals. There’s not too much to do here, in terms of touchscreen interaction.",
    "However, we would not be surprised if some people never discovered some of these interface parts. You can treat this as a pure voice-controlled speaker, and only use the touchscreen to select videos in YouTube.",
    "Setup is very similar to that of any Google Assistant speaker. You install Google Home on your phone, agree to a small army of terms and conditions screens, and you’re done. It’s very quick and easy.",
    "You will also need to install the Nest app if you want to use the Google Nest Hub Max’s camera properly, though. Nest was one of the original smart home pioneers in the current wave, which made home automation cheap and accessible, and was bought by Google back in 2014.",
    "Setup this side of the Google Nest Hub Max by downloading the Nest app on your phone and its 6.5-megapixel camera can act like a smart home camera. The Google Nest Cam, a dinky little home camera, cost £159 / $199 on its own, making this box seem an even better deal.",
    "When working as a Nest camera, the Google Nest Hub Max captures clips whenever it senses movement or unusual noise. And you can link your phone so Nest knows when you are at home or out, and act accordingly.",
    "You need a Nest subscription to make the most of this security feature. $5 / £4 a month keeps a 5-day cloud store of these recorded clips, $10 / £8 offers a 10-day archive and $30 / £24 a month stores clips for a full month. These subscriptions are called Nest Aware.",
    "Without Nest Aware, any clips disappear after 24 hours. You can also check out the live view of your Google Nest Hub Max from anywhere without the subscription.",
    "We had some trouble with this side of the Google Nest Hub Max. While it recorded clips, the app consistently said the camera was “offline” when we tried to have a peek at the live view. We were also unable to access the camera directly, from the touchscreen. An “unavailable” pop-up appeared. That’s right, the Google Nest Hub Max can’t find its own camera.",
    "The camera is not only used for the Nest feature. You can also video call, using Google Duo. You can think of this as an alternative to Skype or Apple’s FaceTime. There’s an interesting extra feature that makes use of the camera’s wide-angle display too; Auto Framing.",
    "This crops the image to suit the number of people on-screen. It seems impressive until you consider how long Google has worked on image analysis and face recognition. Real-time image cropping is far from the most technically challenging thing Google’s engineers are working on. But the effect is neat in person.",
    "Does the idea of a camera that watches you 24/7 worry you? Some smart displays have physical sliders that block the cameras but the Google Nest Hub Max does not.",
    "However, there is a slider on the back that disables both the microphones and camera. Some smart home gadgets actually use a physical circuit disconnector for such controls. We’ll have to wait for a comprehensive Google Nest Hub Max teardown to see if this one does too. There are also software switches to let you turn the camera and mics off independently.",
    "Amazon’s standard Echo speakers have 7-mic arrays designed to be able to hear you from any direction. The Google Nest Hub Max only has two because you’re more likely than not going to place it against a wall.",
    "Speech recognition sensitivity is still brilliant. The Google Nest Hub Max can understand you when you talk at a normal speaking volume even when competing with music that seems just as loud, or perhaps even louder.",
    "The Google Assistant speech recognition is great as ever, and you can see its use of context cues, the interpretation of your words often changing slightly as the sentence plays out. Those words actually appear on the Google Nest Hub Max’s screen.",
    "Sound quality is good too. The Nest Hub Max has two 18mm tweeters and a 75mm bass driver. There’s no passive radiator but the bass driver is a similar size to that of the Sonos One.",
    "Bass depth is great for a smart display – your music doesn’t seem to come from a narrow space and the Google Nest Hub Max will deliver the tracks you know and love with enough punch and vitality.",
    "We would not suggest getting rid of your Hi-Fi and replacing it with this. It’s not as muscular as the Google Home Max and the mids are not as well fleshed-out as those of the Sonos One. However, it’s radically better for music than the 7-inch Google Home Hub.",
    "For cramped student flats, bedrooms and kitchens, the Google Nest Hub Max is more than good enough.",
    "There are a couple of issues, though. The Google Nest Hub Max’s volume is measured on a 1-10 scale. It sounds great up to 9, but 10 is a step too far. It becomes a bit “shouty” and harsh. These volume gradations are also too wide. You may find it ends up slightly too quiet, or slightly too loud. Google may address this in an update if enough people agree.",
    "The Google Nest Hub Max has some slight issues at launch. Nest platform support is not quite there yet in our experience and the volume control needs an update to make up for the extra power on offer. This speaker is much more powerful than the Google Home Hub, and deserves more fine-grain control.",
    "Screen resolution is slightly low too, though the introduction of Netflix support is a great addition.",
    "All in all, the Google Nest Hub Max is still not just a great smart display but a great smart speaker and a way to stay entertained while you wait for your onions to sauté."
  ],
  "headers": {
    "5": "Price and availability",
    "8": "Design",
    "13": "Display and video quality",
    "24": "Software",
    "30": "Nest and Camera",
    "39": "Features and audio performance",
    "47": "Verdict"
  },
  "links": {
    "Google Home Hub": "https://www.techradar.com/reviews/google-home-hub",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "smart display": "https://www.techradar.com/best/best-smart-displays",
    "Google Assistant": "https://www.techradar.com/news/9-things-google-assistant-can-do-that-you-may-not-know-about",
    "Amazon Echo Show 10 (2020)": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "a new Chromecast": "https://www.techradar.com/news/google-chromecast-ultra-2-release-date-price-news-and-rumors",
    "Launch Night In event": "https://www.techradar.com/news/google-pixel-5-launch-event-recap",
    "Lenovo Smart Display": "https://www.techradar.com/reviews/lenovo-smart-display",
    "iPad Pro": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-pro-9-7-1317466/review",
    "Samsung Galaxy Tab S6": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-review",
    "Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Echo speakers": "https://www.techradar.com/news/best-amazon-echo-speaker-the-lineups-dots-spots-shows-and-pluses-compared",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Google Home Max": "https://www.techradar.com/reviews/google-home-max"
  }
}