{
  "source": "https://www.techradar.com/reviews/banggood-t98-android-thin-client-stick",
  "title": "Banggood T98 Android thin client stick review",
  "category": "computing",
  "updated": "2020-10-06T15:33:53Z",
  "author": "desire-athow",
  "summary": "A personal computer barely bigger than a USB drive",
  "verdict": "The Banggood T98 is a jolly good Android HDMI thin client PC provided you can live with its idiosyncrasies. It is affordable, runs a recent version of Android and is so small you could hide it almost anywhere.",
  "pros": [
    "Cheap",
    "Reasonable hardware configuration",
    "Very small",
    "Android 9"
  ],
  "cons": [
    "No 802.11ac",
    "Interface could be better",
    "MicroUSB ports are obsolete",
    "No power adaptor"
  ],
  "article": [
    "HDMI PC is a format that has become more prevalent over the past decade thanks to the advanced levels of miniaturization that the smartphone era brought to us. Computers no longer needed to live in beige towers and could be found in an array of form factors.",
    "The Banggood T98 that we review today is the smallest HDMI PC we’ve tested to date and the first one that runs on Android; in comparison the likes of the Minisforum S41 or the Azulle Access4 Mini PC run on Windows 10.",
    "The T98 Android HDMI thin client stick can be purchased from Banggood for $46.99 at the time of writing.",
    "You could have easily mistaken the T98 for a bigger-than-average USB flash drive had it not been for the HDMI connector that protrudes from its base. At 38 x 15 x 89mm (excluding the HDMI connector) for a weight of just 48g, it is the smallest computer we’ve tested to date.",
    "The body of the device is plastic and doesn’t try to win any design prizes; not surprising given that it only consumes 6W and will likely spend most of its life hidden away from the public eye.",
    "An Allwinner H6 system-on-a-chip powers the T98; it combines four Arm Cortex A53 cores clocked at 1.8GHz with a 5-core Arm Mali T720 GPU which, the vendor claims is powerful enough to decode 6K content. Alongside it are 4GB of RAM and 32GB eMMC storage, Bluetooth connectivity (only v4.0) and 802.11n (no Wi-Fi 5 or 6 here).",
    "Note that (a) it comes with a bundled remote control that is far bigger than the device itself. Fortunately, you don’t need the remote control to make it work (b) there is no power supply unit and instead you have a short microUSB cable that will connect to any compatible USB port that can provide at least 1.2A. That means basically almost everything, including the USB ports of television sets, laptops and even portable battery chargers.",
    "There are actually two micro USB ports with no clear indication as to which one should receive the power supply until; it’s the one next to the full Type-A USB 3.0 port. There’s also a microSD card slot and the device supports HDMI 2.1.",
    "We plugged the T98 into a XGIMI MoGo Pro projector for our hands-on and connected a Rapoo K2800 keyboard with an integrated touchpad. It runs on a non-stock version of Android 9, one that is designed for access using a remote control and complete with made-up logos of your favourite apps.",
    "Its target audience is self-evident - couch surfing consumers - and explains why, for a business, it would make little sense to use it as a shoe-in replacement for a traditional computer. However, as a very low power device that can run off almost any power source, it has some very clear potential if you are able to live with its shortcomings.",
    "We found it to be unresponsive at times, probably due to the fact that the interface is not tweaked for a keyboard/mouse input peripheral. Cursors tend to freeze from time to time while the ubiquitous two-finger scroll was temperamental to say the least, something made worse by the irritating phantom click syndrome.",
    "The keyboard on some applications (e.g. Google Docs) took up to half the screen and had a particularly nasty bug that meant we couldn’t have a carriage return, essential when you’re writing anything that is remotely long..",
    "The Banggood X96S is an even smaller HDMI Android thin client stick. At 88 x 13 x 33, it is probably the smallest PC on the market. It is slightly more expensive at $52.99 - with a different CPU but roughly the same configuration otherwise - but comes with a power plug and an IR adapter, ideal for when there is no line-of-sight between the remote and the device. It has one weakness though; it runs on Android 8.1.",
    "The T98 does the job; It is affordable, runs on a fairly recent, full fat version of Android and is absolutely minuscule. Like all other similar Android thin client PCs that we’ve tested over the past few years, its interface is more geared towards a consumer market but the potential for B2B (e.g. for digital signage, window displays or interactive kiosks) is real.",
    "That’s not to say that it is without flaws; the UI - with its bugs and quirks - remains a particularly sore point as is the fact that it lacks any long term visibility on firmware updates, a concern that could be a potential turn off for business buyers.",
    "We would have preferred to have a more versatile Type-C port rather than a micro USB one. Having the former might have allowed a user to connect a second monitor to increase its usefulness. Last but not least, we find it surprising that there’s no power supply unit especially on a device in that price bracket.",
    "As a postscriptum, we would love to see someone develop a truly robust business-focused low-price Android thin client that could replace Windows or ChromeOS devices; after all, Samsung already showed the potential of Dex and Android has a built-in desktop mode.",
    "Another challenge worth taking is building an even smaller HDMI PC, maybe one that could even take the shape of a more flexible rubber cable which would reduce the stress (and therefore the likelihood of physical damage) on the HDMI port if the latter is located on the side of the display."
  ],
  "headers": {
    "2": "Price",
    "3": "Design",
    "5": "Hardware",
    "8": "Performance",
    "12": "The competition",
    "13": "Final verdict"
  },
  "links": {
    "Minisforum S41": "https://www.techradar.com/reviews/minisforum-s41-hdmi-thin-client-pc",
    "Azulle Access4 Mini PC": "https://www.techradar.com/reviews/azulle-access4-mini-pc-hdmi-stick",
    "T98": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-1281690579093948700&ulp=https%3A%2F%2Fwww.banggood.com%2FT98-Mini-Allwinner-H6-4GB-RAM-32GB-ROM-2_4G-WiFi-bluetooth-4_0-Android-9_0-4K-6K-H_265-HDR-Smart-TV-Stick-Portable-Streaming-Media-Player-p-1654222.html",
    "USB flash drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "XGIMI MoGo Pro projector": "https://www.techradar.com/reviews/xgimi-mogo-pro-portable-projector",
    "Banggood X96S": "https://www.techradar.com/news/this-is-probably-the-smallest-android-pc-you-can-buy-right-now"
  }
}