{
  "source": "https://www.techradar.com/reviews/convertkit",
  "title": "ConvertKit email marketing software review",
  "category": "computing",
  "updated": "2020-10-29T21:55:48Z",
  "author": "michael-graw",
  "summary": "Visual automation for your email campaigns",
  "verdict": "ConvertKit delivers excellent email marketing automation tools and detailed list management, but it can get very expensive as your subscriber base grows.",
  "pros": [
    "Extensive contact tagging",
    "User-friendly automation designer"
  ],
  "cons": [
    "Expensive for large subscriber databases",
    "No phone or live chat support"
  ],
  "article": [
    "Looking for the best email marketing services for your business? Maryland-based ConvertKit offers an easy-to-use email marketing platform with a visual designer for building automated strategies.",
    "It does a little bit of everything well, although it can be pricey, and the email designer isn’t the most flexible. In our ConvertKit email marketing services review, we’ll help you decide whether this tool is right for you.",
    "ConvertKit is free to use for managing up to 500 email subscribers, which is on the low side compared to many competitors. The free plan includes unlimited landing pages and sign-up forms with unlimited traffic. But, you miss out on strategy automation, the visual designer, and integration with most website builders and eCommerce platforms.",
    "For those features, you’ll need a paid Complete plan. Pricing varies based on how many subscribers you have. Options start at $29 per month for 1,000 subscribers and increase to $49 per month for 3,000 subscribers and $79 per month for 5,000 subscribers.",
    "Few of ConvertKit’s features are truly unique, but this platform does a nice job with versatility and ease of use.",
    "To start, every ConvertKit user gets access to customizable sign-up forms and landing pages. The platform comes with more than 30 templates that can be tailored to fit your brand. There’s no limit to how many custom fields you can add.",
    "The more exciting aspect of ConvertKit, which is only available to paid users, is campaign automation. You get access to a visual designer in which you can create logical progressions for campaigns. For example, if someone signs up for your newsletter, you can specify what to follow up with based on where they signed up or what fields they filled in. These logic trees can be as complicated as you need to tailor your message to different audiences.",
    "Of course, ConvertKit also includes an email designer to help you with this messaging. All emails are crafted in plain text and are mobile-responsive by default. You can easily fill in any field from your subscriber database to tailor emails to individuals. ConvertKit also supports A/B testing and enables you to save an unlimited number of your email designs as templates for future use.",
    "ConvertKit makes it easy to get started, especially if you already have a list of email subscribers. You can import subscribers from a CSV, and the platform will automatically create custom fields to match your headers. If you’re migrating from another email marketing platform, ConvertKit offers tutorials for how to import data from several major competitors.",
    "There’s no limit on how many custom fields you can add to your database. In addition, you can take advantage of tags and segments, as well as sub-tags and sub-segments, to fully organize your subscribers.",
    "ConvertKit is extremely easy to use, which is what a lot of business users are looking for in email marketing software.",
    "When you go to make a new form, for example, you’re presented with a few simple templates to choose between. The designer then enables you to click on any element to see your customization options. It only takes a few minutes to design a branded form, and you can place it on your website quickly and easily using Javascript, HTML, or ConvertKit’s WordPress plugin.",
    "It’s worth noting that the design options aren’t all that varied. You can only choose from three formats for sign-up forms, and your options for customization are limited to basics like font and color scheme.",
    "That said, we found the automation process to be straightforward as well. The visual designer includes a list of triggers and response actions, which you can customize and connect using any number of logical operators.",
    "Part of what’s so nice about the automation in ConvertKit is that you can use it to keep your subscriber database organized. For example, a possible response is to Add Tag—so you can use automated workflows to tag users for future marketing campaigns.",
    "ConvertKit is fully GDPR compliant, meaning that you’re safe to use this email marketing software if you have subscribers in Europe. On top of that, the platform enables you to add security to your account by turning on two-factor authentication.",
    "ConvertKit also protects your email marketing list through CAPTCHA and double opt-in. CAPTCHA automatically screens users for abnormal behavior to eliminate bots. Double opt-in means that users get an email to confirm they intentionally signed up for your marketing list.",
    "ConvertKit offers support by email only, but the company’s extensive documentation center provides an answer to most questions. You’ll find walkthrough guides with videos for hundreds of common tasks. Plus, ConvertKit offers weekly live workshops to help you get the most bang for your buck out of the service.",
    "If you sign up for a plan with 5,000 subscribers or more, the company will also assign you a staff member to help you migrate from another platform.",
    "If you’re looking for a cheaper alternative to ConvertKit, it’s worth looking to one of the biggest names in the email marketing space—MailChimp. MailChimp is free for managing up to 2,000 subscribers. For $9.99 per month, you can have up to 50,000 subscribers ($379 per month at ConvertKit). This platform doesn’t include visual automation workflows, but you can still create automations to manage your campaigns.",
    "ConvertKit is a capable and easy-to-use email marketing platform. The visual automation designer and the ability to flexibly segment your audience are key features. Plus, this platform integrates with most popular website builders and comes with a WordPress plugin for publishing forms and landing pages. The biggest downside to ConvertKit is the price, which is on the high side for an email marketing platform."
  ],
  "headers": {
    "2": "Plans and pricing",
    "4": "Features",
    "8": "Setup",
    "10": "Performance",
    "15": "Security",
    "17": "Support",
    "19": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "best email marketing services": "https://www.techradar.com/best/best-email-marketing-software",
    "landing pages": "https://www.techradar.com/best/landing-page-creator",
    "website builders": "https://www.techradar.com/news/the-best-website-builder",
    "eCommerce platforms": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "database": "https://www.techradar.com/best/best-database-software",
    "Javascript": "https://www.techradar.com/best/best-online-courses-to-learn-javascript",
    "HTML": "https://www.techradar.com/best/html-online-courses",
    "WordPress plugin": "https://www.techradar.com/best/best-wordpress-plugins",
    "workflows": "https://www.techradar.com/best/best-flowchart-software",
    "two-factor authentication": "https://www.techradar.com/news/what-is-2fa",
    "marketing": "https://www.techradar.com/best/best-online-marketing-services",
    "MailChimp": "https://www.techradar.com/reviews/mailchimp"
  }
}