{
  "source": "https://www.techradar.com/reviews/msi-ge66-raider",
  "title": "MSI GE66 Raider review",
  "category": "computing",
  "updated": "2020-08-06T19:00:59Z",
  "author": "ural-garrett",
  "summary": "Great power and battery life",
  "verdict": "Though it sounds like a fighter jet under heavy stress, the MSI GE66 Raider 10SGS offers a gorgeous 300Hz screen and good all-around gaming performance.",
  "pros": [
    "Good Performance",
    "Much improved battery life",
    "Beautiful 15.6 inch 300Hz Screen"
  ],
  "cons": [
    "Laptop design is still visually unattractive",
    "Sounds like a jet engine at higher performance levels",
    "Speakers still unimpressive"
  ],
  "article": [
    "The MSI GE65 Raider was called “a beast” in our review earlier this year. From its powerful specs, stunning 240Hz display and great overall gaming performance, there was much to love about the gaming laptop. However, below standard speakers and battery life hurt the already outdated design. For its follow-up, the GE66 Raider 10SGS, there are three main enhancements that leave the GE65 in the dust. Gaming performance is fairly top-notch, the 15.6 inch FHD screen running at 300Hz is gorgeous and the battery improvements are significant.",
    "On paper, it’s a pretty powerful gaming laptop. The eight-core Intel Core i9 pumps out 2.4Ghz and Nvidia GeForce RTX 2080 Super allows it to play visually impressive games at solid frame rates. Having 32GB of DDR4 ram upgradable to 64Gbs doesn’t hurt either. Meanwhile, 1TB of NVMe SSD storage can fit a handful of 100gb AAA games with plenty of room to spare. The internal laptop features are even more impressive, due to its huge battery, improved 1080p webcam and perfectly arranged ports. A powerful gaming centered laptop that’s more substance over sleek styling, the GE66 is highly recommended.",
    "If you’re looking for something sonically discrete, you may find disappointment in the noise levels, especially during heavy performance moments. The GE66 is loud enough to interrupt the already weak speakers making headphones an absolute requirement. Design-wise, the ultra-angular laptop is solidly built and heavy. Thankfully, the GE66 does give off a nice lightshow through the individual light keys and bottom lightbar. Of course, both are customizable through MSI’s SteelSeries Engine software.",
    "At $2,699 (£2,292, AU$3779), the GE66 Raider competes against similarly priced gaming laptops including the Razer Blade and Gigabyte Aorus 17G. MSI’s device fits neatly as a third option. More powerful than both, the GE66 Raider lacks their sleekness and better internal audio set-ups. Who cares when neither offer that stunning 300Ghz display? Competitive gamers looking for a practice laptop at this price shouldn’t look anywhere else. Movies look phenomenal on the screen as well.",
    "An aesthetic that looks inspired by gas station quality Lamborghini miniatures with neon underglow, the MSI GE66 maintains the same bulky and angular form from the GE65. It’s also heavier at 5.2lbs (2.38kg) than the original’s 4.9Lbs (2.2kg).",
    "However, port layout is solid with the MSI GE66 Raider. The right side features an SD Card port sandwiched between two USB type-A ports while one audio jack, USB type-C and USB type-A port hold up the left. Having the charging port, Mini-Display port, HDMI, ethernet port, USB type-C and USB type-A ports at the rear means that cable management will be perfect for anyone who wants to set the laptop up in a living room or office.",
    "Visually demanding games maintain great frame rates on the GE66. Total War: Three Kingdoms at 1080p on Ultra ran at 69 fps while earning 227.5 on low with the same resolution.",
    "The more visually spectacular Metro: Exodus delivers a respectable 65 fps at 1080p on Ultra and 115 fps with on low settings. Other AAA games like Doom Eternal and Gears 5 also ran exceptionally well at ultra settings.",
    "RTX settings were a bit inconsistent. Utilizing RTX on Metro:Exodus with similar settings gave an average of 48 fps and 91 on low. Games utilizing Ray Tracing like Control and Wolfenstein:Youngblood maintained 60-plus frame rates on Ultra with the RTX setting toggled. Like mentioned above, all of that mobile performance comes at the cost of some noisy fans.",
    "Anyone disappointed by the GE65’s battery will be happy to hear that the GE66 doubled its battery life on every test. The GE66 Raider lasted 4 hours and 50 minutes on the PCMark 10 Battery Life test. Our own anecdotal video test lasted 5 hours and 20 minutes before shutting down. Without a powersource, general laptop usage should definitely survive a coast-to-coast flight in the U.S. Though performance is at its best when plugged in, it’s still possible to get a couple of hours unplugged at playable frame rates if settings are lowered.",
    "An improvement over the original in more ways than one, MSI’s GE66 Raider 10SGS is a powerful gaming laptop with a jaw-dropping screen and strong battery life."
  ],
  "headers": {
    "0": "Two-minute review",
    "11": "Don’t buy it if..."
  },
  "links": {
    "“a beast” in": "https://www.techradar.com/reviews/msi-ge65-raider-9sf",
    "Nvidia GeForce RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "the Razer Blade": "https://www.techradar.com/reviews/razer-blade-2019-review/2",
    "Gigabyte Aorus 17G": "https://www.techradar.com/reviews/gigabyte-aorus-17g",
    "Metro: Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Control": "https://www.techradar.com/reviews/control-review",
    "Wolfenstein:Youngblood": "https://www.techradar.com/reviews/wolfenstein-youngblood"
  }
}