{
  "source": "https://www.techradar.com/reviews/giganews",
  "title": "Giganews review",
  "category": "computing",
  "updated": "2020-11-22T20:27:43Z",
  "author": "desire-athow",
  "summary": "A premium Usenet service for the more demanding user",
  "verdict": "There are cheaper Usenet providers around, but Giganews scores with us for its reliable network, performance and support.",
  "pros": [
    "Fast VPN",
    "US and European data centers",
    "Wide range of plans",
    "Free 14-day/10GB trial"
  ],
  "cons": [
    "Above average prices",
    "No Bitcoin payments"
  ],
  "article": [
    "One of the oldest names in Usenet, Giganews has a good reputation. But does it offer the features you need to download files quickly and securely?",
    "Operating since 1994, Giganews promises no maintenance outages and no downtime. Unlike some other providers, Giganews owns its servers, writes the code running on them, and built its own Usenet network. It boasts \"four server locations on multiple continents\" which helps with providing a reliable service around the world.",
    "Giganews also offers a free month of access by sharing a special link with friends. If they sign up, you get the free access. A detailed testimonial page is provided, and the Mimo Usenet browser is available to Diamond-level accounts.",
    "Offering a feature-packed Usenet experience, Giganews offers three plans with unlimited Usenet downloads, speed, and 100 connections.",
    "Binary retention is 3 years, packages come with SSL encryption, an optional VyprVPN subscription, and the ability to post to Usenet - these last two features are available only once the trial period is complete.",
    "Giganews also comes with a comprehensive customer support system, operating 24/7, 365 days of the year. Support contact is via a live chat window, but there is also a detailed knowledgebase and separate support paths for Usenet, VyprVPN, and Mimo. Support tickets can also be manually logged.",
    "Behind the scenes you'll find a smart control panel to oversee your account and Usenet access. From here you can check activity, upgrade your account, manage VyprVPN, and access to Usenet via the Mimo Usenet browser.",
    "Usenet has been around since the 1980s. Most Usenet providers don't offer access to uploaded material from before 2005. This data isn't lost, however, as it is mostly available via online archives and Google Groups.",
    "Retention is the term used to describe the length of time data is retained on Usenet servers. Giganews may have been operating since the 1990s, but its data retention unfortunately isn't that long. Giganews offers full speed across its entire binary retention, with multiple article copies.",
    "Text retention - from Usenet discussion groups - is over 17 years. However, binary retention is around 3 years. Clearly there is a marked difference between these rates.",
    "On the plus side, Giganews should be applauded for being specific about its retention rates. We tried to download a file from around three years ago, with no success. A similar binary uploaded within the last year, meanwhile, downloaded without problem.",
    "As standard with Usenet providers, SSL is provided as a privacy enhancement to ensure a secure connection. Access to Usenet via Giganews through your newsreader works with and without SSL (via port 563).",
    "Non-trial accounts offer logless VPN access via VyprVPN. This is a free bundled extra when you take out a long-term subscription (monthly, 6-monthly, or annually).",
    "Giganews has published a Privacy Policy which states \"Giganews has never sold or rented member lists or any other member information, and Giganews will never do so.\" Customer data is not released unless \"ordered by a court of competent jurisdiction to do so.\"",
    "As for usage: \"Giganews does not monitor or record your activities online. We do not monitor which newsgroups you post to or download from or what you put in news articles that you post.\"",
    "This is all satisfactory, not to mention clearly presented. However, Giganews has an additional security process to highlight. Upon registration they send an email to confirm personal details to counter fraudulent accounts. In our account signup, the location, bank name, and final four digits of the card number were requested before account approval could be completed.",
    "Access to Giganews was conducted via a VPN server in the Netherlands. This was tested with Ookla’s Speedtest at 41Mbps.",
    "A 1.4GB file of 945 days old was initially selected, but this returned an \"Article not Found\" response. Moving onto another file in the same search term (\"John Cleese\") a 1.5GB binary of 333 days old was selected. This downloaded at an average rate of just under 400Kbps, maxing at 486Kbps.",
    "The conclusion of this test is that Giganews provides average speeds.",
    "Every Giganews plan offers unlimited downloads, unlimited speed, 100 simultaneous connections, SSL encryption, and Vypr VPN. Note that the VPN is not available in the 14-day free trial.",
    "A one month rolling subscription to Giganews is $17.99 (equivalent to £13.84 or €15.26).",
    "If you prefer to pay for six months up front, you'll pay $89.94 (£69.20 or €76.29) which breaks down to $14.99 a month (£11.53 or €12.72). This works out as a 17% saving.",
    "For 12 months' up-front access, you would pay $150 a year (£115.42 or €127.24), a 31% saving ($12.50 a month, equivalent to £6.92 or €10.60).",
    "It's worth highlighting that there is some confusion about Giganews package names. At the signup point, they're simply described by price. Once you're about to commit, however, they're given names (\"Diamond\" and \"Platinum\") without any context. This is a strangely confusing element that could be avoided by simply assigning the names to the subscription packages on the signup page.",
    "Subscription payment is via credit card only. There is no PayPal option (despite reference to PayPal elsewhere on the site) and no option to sign up anonymously and pay by Bitcoin or similar.",
    "Giganews is one of the biggest names in Usenet, and with a great reputation comes great responsibility. In terms of being a provider that makes the whole Usenet experience simple, Giganews should certainly be commended. Its privacy policy, meanwhile, is clear, and the sign-up process robust.",
    "Meanwhile, Giganews leads the way in providing a clear retention policy, specifying what type of data is retained for what length of time. Sadly, our testing didn't deliver the best download speeds.",
    "While not the cheapest Usenet provider, the addition of free access to VyprVPN certainly makes up for it."
  ],
  "headers": {
    "3": "Features",
    "7": "Retention",
    "11": "Security and privacy",
    "16": "Performance",
    "19": "Pricing",
    "25": "Final verdict"
  },
  "links": {
    "Usenet": "https://www.techradar.com/best/best-usenet-providers",
    "Giganews": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1203720192360129300/https://www.giganews.com/",
    "VyprVPN": "https://www.techradar.com/reviews/vyprvpn",
    "Privacy Policy": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1663694498941960400/https://www.giganews.com/legal/privacy.html",
    "Speedtest": "http://www.speedtest.net/",
    "one month rolling subscription": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7097924835340691000/https://www.giganews.com/signup/",
    "six months up front": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1378670530031403500/https://www.giganews.com/signup/",
    "12 months' up-front access": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2101530628707900400/https://www.giganews.com/signup/"
  }
}