{
  "source": "https://www.techradar.com/reviews/site5",
  "title": "Site5 review",
  "category": "computing",
  "updated": "2020-10-15T08:50:51.612Z",
  "author": "mike-williams",
  "summary": "Is this really 'hosting for serious developers'? (Hint: no)",
  "verdict": "Site5's 100% uptime during testing is a small plus, but otherwise it’s an underpowered and overpriced service which can't begin to match the best of the competition.",
  "pros": [
    "45-day money-back guarantee",
    "cPanel website management",
    "100% uptime during testing"
  ],
  "cons": [
    "Relatively high prices",
    "No monthly billing",
    "Poor website",
    "Limited product range"
  ],
  "article": [
    "Tired of unprofessional web hosting companies that have no idea what they're doing? The Endurance International Group-owned Site5 claims to be very, very different. This is 'hosting for serious developers', the website says, 'built for designers and developers.' Impressive.",
    "Site5's Basic shared hosting plan isn't cheap at $6.95 over two years, $8.95 annually (there's no monthly option), but maybe you'd expect that for such a demanding audience.",
    "The plan offers 'unmetered' storage and bandwidth. That doesn't mean unlimited, though, and Site5 suggests it's only suitable for around 10,000 visitors a month. For comparison, Namecheap's EasyWP Starter WordPress plan only includes 10GB storage, but claims to handle 50,000 visitors, and is priced at $3.88 a month, no long-term contract required.",
    "Elsewhere, hostBasic has a plus with its bundled backup service (a $1-$2 a month extra with many hosts), but there's no free domain, no live chat support (it's ticket only for this plan) and you can host one domain only. Site5 will migrate an existing site for free, there's cPanel site management and - the website claims - Softaculous-powered one-click installs for WordPress and hundreds of other apps.",
    "(Softaculous turned out not to be available with our plan, but more on that later.)",
    "The $10.95 a month hostPro plan supports up to 25,000 monthly visits and can host unlimited websites, and the $13.95 hostPro+Turbo gets you better performance, the power to handle 100,000 visitors a month, and - finally - 24/7 support via live chat (both prices are for the two year plan, but are also available billed monthly at $12.95 and $19.95.)",
    "Apart from having backups as standard, these plans look very ordinary, and you can get much more, from very capable companies, for very similar money.",
    "For example, HostGator's Baby plan includes unmetered storage and bandwidth, and unlimited domains, and live chat support, for $3.95 a month over three years, $6.95 on renewal (that's $5.95, renewing at $11.95 on the annual plan.)",
    "Although it doesn't begin to justify the price, Site5 does have one standout feature: a 45-day money-back guarantee for its shared hosting, 'no advanced notification required, no paperwork, no red tape, no catches whatsoever.' You'll get 90 days from InMotion Hosting, but in a world where most hosts stop at 30 days, and some (hello, GoDaddy) drop to 48 hours on monthly billed plans, Site5's hassle-free 45-day guarantee is a welcome touch.",
    "Site5 doesn't have any managed WordPress hosting or dedicated server products, but there is a small range of VPS plans.",
    "As with the shared hosting, these look a little expensive. The baseline 2 core, 2GB RAM, 50GB storage and 1TB bandwidth product costs $64.80 a month billed annually, for instance, a serious chunk of cash.",
    "The plan specs aren't bad. This is a managed VPS, which means Site5 looks after the low-level technical management of the server, and a bundled cPanel license means it's almost as easy to run as a shared hosting product.",
    "If you're happy to manage your server from the command line, though, there are huge savings to be made.",
    "For instance, Namecheap's unmanaged, no-cPanel Pulsar package - 2 core, 2GB RAM, 40GB storage and 1TB bandwidth - is only a monthly $11.88. And even if you add cPanel and full server management, it's still only $44.76.",
    "Hostwinds has a wider range of VPS plans, far more configurable and with support for Windows hosting, but it also offers great value. Its cheapest unmanaged VPS starts at $4.49 billed monthly (1 core, 1GB RAM, 30GB storage, 1TB bandwidth), while a 4 core, 8GB RAM, 150GB storage and 3TB setup, fully managed and with cPanel thrown in, is $95.",
    "It looks like Site5's VPS range has a significant price premium, then. Is there something about the service that justifies any extra costs? Maybe signing up would help us find out.",
    "The Site5 purchase process is simple, straightforward, and works precisely as we expected. We chose a plan, provided all the usual contact details, and paid via PayPal (there's support for cards, too.) An email arrived moments later with login details and some useful advice on getting started, and our account was ready to use immediately.",
    "Well, almost immediately. Site5's account information email told us to point our existing domain to its webspace, we must use the nameservers 'Nameserver 1: (), Nameserver 2: ()', which was less than helpful. We searched Site5's support knowledgebase for 'nameservers', though, and two articles pointed us to the names we thought we needed (more on that in a moment): dns.site5.com and dns2.site5.com.",
    "Site5's web account management system is powered by WHMCS, a hugely powerful platform used by many web hosts. It's far from perfect, but if your previous host used the same system, you'll immediately know how to find your way around the interface.",
    "As we looked around, we noticed that the Site5 account pages are distinctly short on annoying ads and all the other upselling efforts that plague some hosting provider dashboards. That's not the biggest of deals, but it's an approach we prefer. Sure, hosts can push products all they like on the main site, but paying customers should get a functional interface designed to benefit them, not a virtual marketplace aimed at selling them even more stuff.",
    "Site5's major site building and management tools are tucked away in a full-featured cPanel setup, just a click away from the web dashboard.",
    "Although Site5's website claims Softaculous is available with all shared hosting plans, it wasn't included in our HostPro account. Advertising a major feature like that, and not delivering it, has to be a major black mark.",
    "Fortunately, you're still able to set up WordPress via a Mojo Marketplace-powered QuickInstall feature.",
    "QuickInstall can set up a bunch of other apps, too: Drupal, Joomla, Magento, PrestaShop, ZenCart and many more.",
    "Site5 doesn't include any website builder, but as this is apparently 'hosting for serious developers', maybe that's not necessary.",
    "CPanel's other modules cover all the setup and maintenance features you're likely to need: domains, databases, email accounts, FTP and SSH, backups, and when your site is up-and-running, detailed stats on your visitors, where they came from, and exactly what they're looking at.",
    "This is a reasonable set of tools, but it doesn't live up to Site5's claim of 'hosting for serious developers.' If anything, it's less capable than some consumer hosting.",
    "Site5's shared hosting doesn't include the excellent Softaculous auto-installer, for instance as we've pointed out, but that is available in Namecheap's ultra-budget starter plan ($1.44 a month in year one, $2.44 on renewal.)",
    "Site5's support begins on its website, where features include a knowledgebase and a Q&A page where you can post public questions, and browse questions and answers from other views.",
    "The knowledgebase has plenty of content, with 560 articles organized into 73 categories.",
    "There's some depth here, too. The cPanel section links to more than 50 articles covering all the major aspects of managing your site.",
    "Unfortunately, a lot of this content was written some time ago, often around 2011-2015. And we mean a lot; the Latest Articles section features only three articles written since 2015, and top of the Recent Comments list is a post from August 2016.",
    "This makes for some dated-looking content. There's an article titled 'How to setup a POP account in Windows Mail', for instance, but it's not about the app which comes with Windows 10; this is the Windows Vista edition.",
    "Live chat was better, at least for simple queries. We've seen complaints that it's rarely available, but an agent responded to us in around 30 seconds. We posted a product question and he answered it immediately, with none of the 'give me your email address, and your support PIN, and your domain, and your account number, and...' hassles you'll sometimes get elsewhere.",
    "We had a chance to test ticket support, too, when our website still wasn't available from our domain, three days after setting its nameservers with the domain registrar.",
    "We raised a ticket explaining the issue, and around twelve hours later, a reply told us the problem was our domain hadn't been registered. That wasn't true, as a quick Whois check confirmed, but it's easy to imagine how a hosting newbie now might waste more time going back to their domain registrar, trying to confirm this.",
    "Fortunately, the ticket response also included the real Site5 nameservers, ns1.site5.com and ns2.site5.com, and so the agent had accidentally answered our question. Our domain wasn't working because we'd used the incorrect nameservers we'd found on the Site5 support site, when we should have used these.",
    "It's unusual to see a triple whammy of bad support: an email which doesn't include Site5's nameservers, then two articles providing incorrect information, followed by an agent who not only failed to diagnose the problem, but pointed us in entirely the wrong direction.",
    "We replied to the ticket explaining Site5's errors, giving the agent the support site URLs with the incorrect nameserver information, but no-one appeared to care. Site5 didn't reply and the ticket was closed.",
    "Getting your site online is just the start of a web host's task; keeping it there, ensuring it doesn't go down, is the real challenge.",
    "To measure reliability, we use Uptime.com to monitor a test site over a seven-day period. Every five minutes, Uptime attempts to download a page from our site, logging its success or failure and the server response time.",
    "Site5 passed our week of testing without a single outage, a perfect 100% uptime.",
    "Average response time was 337ms. The best hosts are somewhere in the 200-300ms range, with most of the rest trickling in from 300-400ms, putting Site5 towards the rear of the pack (though if your needs are simple, you might not even notice.)",
    "There was better news with consistency, as Site5's times fell into a narrow 302-469ms range, beating most of the plans we've tested. Even if we look at our top ten hosts, only four performed better.",
    "(Be careful how you interpret these figures, though. Our test account was based on Site5's cheapest shared hosting plan, and they can't tell us anything about the speeds you'll get from VPS, dedicated or other more advanced plans.)",
    "Site5 isn't a terrible web host, it's just distinctly short on reasons to sign up. Whether you're interested in price, product range, features, speed or support, Site5 lags behind most of the competition."
  ],
  "headers": {
    "9": "Servers",
    "16": "Creating a website",
    "28": "Support",
    "39": "Performance",
    "45": "Final verdict"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "Site5": "https://www.site5.com/",
    "shared hosting plan": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "EasyWP Starter WordPress plan": "https://www.techradar.com/reviews/namecheap",
    "hostPro plan": "https://www.site5.com/",
    "hostPro+Turbo": "https://www.site5.com/",
    "Baby plan": "https://www.techradar.com/reviews/hostgator",
    "InMotion Hosting": "https://www.techradar.com/reviews/inmotion-hosting",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "WordPress hosting": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "dedicated server products": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "VPS plans": "https://www.techradar.com/news/best-vps-hosting",
    "Hostwinds": "https://www.techradar.com/reviews/hostwinds",
    "knowledgebase": "http://kb.site5.com/",
    "cPanel section": "http://kb.site5.com/control/cpanel/cpanel-overview"
  }
}