{
  "source": "https://www.techradar.com/reviews/banggood-t95-c1-android-thin-client-pc",
  "title": "Banggood T95 C1 Android thin client PC review",
  "category": "computing",
  "updated": "2020-10-09T16:14:16Z",
  "author": "desire-athow",
  "summary": "A computer with a very, very special feature",
  "verdict": "The T95 C1 held so many promises but failed to deliver; it is a very enticing concept but is poorly executed. The design and the webcam are probably the only bright spots with the rest lagging behind. Too many corners cut in what could have been a great product.",
  "pros": [
    "The webcam",
    "The design",
    "Relatively affordable",
    "Webcam performance is decent"
  ],
  "cons": [
    "A bit short on the memory and storage",
    "USB 2.0 ports",
    "10/100Mbps port"
  ],
  "article": [
    "The COVID-19 pandemic caused certain tech categories to surge abruptly and business webcams have been such a vertical; despite the overwhelming number of laptops and smartphones having a front facing or selfie camera, webcams sold by the thousands worldwide, resulting in price surges and chronic out-of-stock status.",
    "It it in that context that we’re reviewing the Banggood T95 C1; it is the first Android computer that we know about that comes with an integrated webcam and is designed in such a way to perch on top of a TV set or a monitor.",
    "The T95 C1 - which is sold by a number of ODM - is on sale at the online tech retailer Banggood for $73.99. Note that, while this price includes delivery, it is exclusive of any taxes that may be levied by the relevant authorities or the courier companies on behalf of the vendor.",
    "As an Android-based thin client, the T95 C1 is like nothing you’ve seen before. From afar, it looks like an anthracite-colored, one-eye Cyclop bust. Move closer and it is essentially an oblong plastic enclosure that has the webcam bang in the middle and sits on a special clever clip that acts as a stand.",
    "Open its plastic jaws to secure it on the top bezel of any monitor or TV without fear of it crashing down. The T95 C1 can rotate but not tilt on its stand. At 175 x 60 x 40mm for a weight of around 400g, it is a relatively lightweight product.",
    "There’s plenty of ports at the rear of the device: from left to right, there’s a power input, an audio connector, one USB 2.0 port, a 10/100Mbps Ethernet port, a HDMI connector, a second USB 2.0 port and finally a microSD card slot.",
    "The T95C1 runs on a surprisingly powerful system-on-a-chip, the octa-core Rockchip RK3368 that combines eight Arm Cortex-A53 cores with a PowerVR G6110 GPU . Sadly, this is paired with only 2GB of RAM and 16GB onboard storage, which will have an impact on performance.",
    "That is a real shame given that these two components have fallen in price on average and 4GB RAM/64GB storage should now be the absolute minimum on Android devices to ensure compatibility with future versions of Android.",
    "The webcam has a sensor with eight million pixels (or so it claims) plus a pair of built-in microphones, two small speakers, 802.11n Wi-Fi and Bluetooth 4.2.",
    "There’s also a Roku-esque remote control with a bright orange color scheme and a 10W (5V,2A) power supply unit. Sadly given that the connector it uses is proprietary in nature (as opposed to microUSB or USB Type-C), you won’t be able to connect it to say, a portable battery pack.",
    "The T95 C1 runs on a customized version of Android (Android 9.0), one that is designed for access using a remote control. There was a 1GB firmware update waiting for us; dated 25/9/2020, it optimized the system and fixed some minor bugs. We wouldn’t hold our breath to get another firmware update for that one so businesses need to bear that in mind when adding the T95 C1 to their buying list.",
    "The home screen is a bog-standard one based on an assemblage of quadrilaterals (rectangle and squares) with icons and labels. The camera is accessible by pressing on an icon and there’s a number of other consumer-focused apps like Netflix or Kodi.",
    "You won’t find Google Meet or Zoom or even Microsoft Teams here which is a bit of a missed opportunity. You do have Skype though although we’re not sure how popular it is as a video conferencing tool. In use, the webcam proved to produce fluid images throughout, a credit to the processor, and the photos in this section do not fully show how vibrant and colourful the pictures it delivered are because they were displayed by an XGimi Mo GoPro projector on an uneven wall. Hardly ideal conditions.",
    "Sadly, we also suffered from the phantom click syndrome when we connected our Rapoo wireless keyboard with integrated touchpad and overall the typing experience was underwhelming, both because of the lag and the awkwardness of using an un-optimized version of Android. This almost certainly precludes the use of the T95 C1 as an office machine.",
    "We haven’t been able to find any rival to the T95 C1. At the time of writing, there are no Android devices - to our knowledge - that offer an integrated webcam. It is not the first computer however as almost four years ago, we reviewed the Cenovo King Kong Mini PC, the first - and only - Windows 10 Mini PC we’re aware of that comes with a built-in webcam. The closest thing to this unique product has to be all in one devices like the MSI Pro 24X that comes with a screen.",
    "The T95 C1 is a promising yet flawed Android computer. On paper, the webcam is an alluring prospect and the overall design actually works but the execution is sub-par. Having a powerful processor makes sense but everything else just fell through the cracks because of the amount of corner cutting.",
    "The presence of USB 2.0 ports, the non-Gigabit Ethernet port, low amount of memory and storage and slow Wi-Fi produced a device that is usable without being great to use. And as it is the case for almost all Android computers we’ve tested over the years, the user experience is at its optimum with the bundled remote control, not a keyboard."
  ],
  "headers": {
    "2": "Price",
    "3": "Design",
    "6": "Hardware",
    "10": "Performance",
    "14": "The competition",
    "15": "Final verdict"
  },
  "links": {
    "business webcams": "https://www.techradar.com/best/best-business-webcams",
    "webcams": "https://www.techradar.com/news/computing-components/peripherals/what-webcam-5-reviewed-and-rated-1027972",
    "T95 C1": "https://ad.admitad.com/g/e8f129b05ecf955d81ea6213826a88/?subid=trd-us-4469914175108898300&ulp=https%3A%2F%2Fwww.banggood.com%2FT95-C1-RK3368-DDR-2GB-RAM-16GB-ROM-bluetooth-4_2-5G-WIFI-Android-9_0-4K-UHD-TV-Box-8MP-1080P-HD-Camera-with-Microphone-for-PC-Conference-Online-Course-p-1711333.html%3Frmmds%3Dsearch%26ID%3D224%26cur_warehouse%3DCN",
    "thin client": "https://www.techradar.com/best/best-thin-client",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Skype": "https://www.techradar.com/reviews/skype",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Cenovo King Kong Mini PC": "https://www.techradar.com/reviews/cenovo-king-kong-mini-pc",
    "MSI Pro 24X": "https://www.techradar.com/reviews/msi-pro-24x-10m042eu-all-in-one-computer"
  }
}