{
  "source": "https://www.techradar.com/reviews/hellofax",
  "title": "HelloFax review",
  "category": "computing",
  "updated": "2020-04-20T08:36:30Z",
  "author": "michael-graw",
  "summary": "Online fax with cloud integration",
  "verdict": "HelloFax is a great online fax provider if you value integration with your cloud storage spaces, security, and privacy. But, plans are expensive compared to HelloFax’s competitors.",
  "pros": [
    "Integrates with major cloud storage services",
    "Multiple team members on a single account"
  ],
  "cons": [
    "Plans are expensive for frequent fax use",
    "No address book"
  ],
  "article": [
    "In the market for the best online fax services? Then it’s worth giving HelloFax a close look. This electronic fax provider enables you to send and receive faxes using your existing fax number. Better yet, HelloFax integrates with a variety of cloud storage services. Unfortunately, though, it is relatively expensive, especially if you primarily need to send rather than receive faxes.",
    "HelloFax offers a free plan and three paid plans. The Free plan is essentially a trial, as you can only send five faxes per month and can’t receive faxes with this option. The Home Office plan costs $9.99 per month and lets you send or receive up to 300 pages per month. You can also create up to five sender accounts, but you cannot port your existing fax number.",
    "If you want to keep your existing fax number, you’ll need a Professional or Small Business plan. The Professional plan costs $19.99 per month and includes 500 monthly fax pages (sent or received) and 10 sender accounts. The Small Business plan costs $39.99 per month and includes 1,000 monthly fax pages and 20 user accounts.",
    "If you exceed your monthly page allowance, HelloFax charges $0.05 per extra page sent or received.",
    "HelloFax offers a handful of features that make this online fax service easier to use. First and foremost, it works well with your existing document services and processes. You can send a fax right from your email by sending attachments to the recipient’s fax number @hellofax.com. HelloFax also integrates with a variety of cloud storage services, including DropBox, Google Drive, OneDrive, and Evernote.",
    "Another major advantage to using HelloFax lies in the way the service deals with fax numbers. You can port your business’s existing fax number to HelloFax with a Professional or Small Business account. In that case, when someone sends you a fax, it’s automatically converted to a PDF document and emailed to you.",
    "In addition, if you create multiple sender accounts, every account can have its own fax number. That way, incoming faxes can go only to a single recipient instead of to everyone in your business.",
    "Getting started with HelloFax is extremely simple. You just need an email to sign up for an account, and you can invite others to create sender accounts from a Teams pane in your dashboard.",
    "Integrating with cloud storage services is also easy. In the Integrations dashboard panel, you’ll find a list of all the providers that HelloFax currently works with. Just click Activate and sign into your cloud account to link it to HelloFax.",
    "The HelloFax interface is very user-friendly. When you log into your account, you’ll find a menu on the left-hand side of the screen displaying your options. Notably, one of the dashboard panes enables you to see your entire fax history, which is helpful for monitoring what you sent and to whom, and whether it was received. Unfortunately, admins cannot easily monitor fax history for every user on a single HelloFax account.",
    "The other thing that HelloFax is missing is an address book. You can’t store contacts, so you’ll need to enter the recipient’s fax number manually for every fax. It’s not a huge deal, but this seems like something that the developers should have thought of.",
    "As for performance, we found that HelloFax works well. It struck us as odd that you can enter an email for the recipient’s address, since this is functionally the same as email. But, when we sent a fax to a phone number, the system started dialing in about 20 seconds. We could also monitor the progress of the delivery using the fax history panel.",
    "HelloFax takes security extremely seriously. To start, the company makes clear that it collects minimal data from users and doesn’t store the content of faxes. Moreover, you can contact the HelloFax support team at any time to request that any stored data the company has about you be deleted.",
    "When faxing, all documents are secured with transport layer security. For the short time that documents are resting on HelloFax’s servers, they’re secured with 256-bit AES encryption.",
    "Perhaps most importantly, HelloFax has an entire section of its website dedicated to security. The company is impressively transparent in this area.",
    "HelloFax offers technical support over email only during US Pacific business hours. The company’s website has a wealth of documentation, including a video library that contains walkthroughs of many of HelloFax’s team features. Just note that HelloFax’s documentation is mixed in with that for HelloSign, its sister platform, and it can be difficult to figure out what settings are shared between the two services.",
    "HelloFax has some stiff competition in MetroFax and RingCentral Fax. MetroFax offers virtually all the same features except for cloud storage integration and charges a lot less. For example, sending and receiving 1,000 pages per month costs just $12.95 per month with MetroFax.",
    "RingCentral is better suited for high-volume faxing, since plans start at $22.99 per month for up to 1,500 pages sent and received. Both of these online fax services let you keep your existing fax number, just like HelloFax.",
    "Our HelloFax online fax review found that this service is a good option for most electronic fax users. Integration with widely used cloud storage services is a significant advantage, as is being able to keep your existing fax number. Still, the service is somewhat pricey if you send and receive faxes regularly, and it was missing simple features like an address book."
  ],
  "headers": {
    "1": "Plans and pricing",
    "4": "Features and utilities",
    "7": "Setup",
    "9": "Interface and performance",
    "12": "Security",
    "15": "Support",
    "16": "The competition",
    "18": "Final verdict"
  },
  "links": {
    "best online fax services": "https://www.techradar.com/best/best-online-fax-service",
    "HelloFax": "https://www.hellofax.com/",
    "cloud storage services": "https://www.techradar.com/news/the-best-cloud-storage",
    "document services": "https://www.techradar.com/best/best-document-management-software",
    "PDF document": "https://www.techradar.com/best/best-pdf-readers-for-windows",
    "an email": "https://www.techradar.com/best/best-email-clients",
    "MetroFax": "https://www.techradar.com/reviews/metrofax",
    "RingCentral Fax": "https://www.techradar.com/reviews/ringcentral-fax"
  }
}