{
  "source": "https://www.techradar.com/reviews/kantech",
  "title": "Kantech review",
  "category": "computing",
  "updated": "2020-10-10T19:30:31Z",
  "author": "jonas-p-demuro",
  "summary": "Committed to protecting people, property and businesses",
  "verdict": "Kantech provides a viable access control solution, and we appreciate the choice of software options so it can be tailored to the application, but it leaves us wanting for more.",
  "pros": [
    "Simplified configuration via kits",
    "Toll free phone support",
    "Choice of software programs"
  ],
  "cons": [
    "Almost opaque pricing",
    "Fragmented support",
    "Unclear hours of support",
    "Single biometric option"
  ],
  "article": [
    "Kantech is a subsidiary of Tyco Security Products, and was founded as a company in 1986. It provides access control solutions, for small businesses, on up to larger scale enterprise solutions. These access control solutions integrate well with the Tyco portfolio that includes a full range of security products, from fire protection to video security products. Tyco is a company that was formed in 1960 with its headquarters in Princeton, New Jersey.",
    "Kantech smartly takes the tack that it should not be so complicated to configure an access control system. Therefore, rather than a la carte pricing for each bobble and doo dad, Kantech offers access control kits that remove some of the guesswork, and come with the necessary hardware with appropriate software to get things up and running with minimal fuss.",
    "For example, there is a Starter Kit that is designed for ease of installation. On the software side, it is compatible with EntraPass Special Edition or Corporate Edition. For hardware, this kit contains either the ioProx P225XSF readers or ioProx P325XSF readers. Most importantly, it has all the pieces to be functional, specifically the ioProx P40KEY keyfobs, USB-485 converter, KT-BATT-12 battery, TR6175 transformer or TR1640P/UL transformer, and KT-RM1 relay.",
    "For those that need a different kit to suit their needs, there are plenty of choices. In addition to the Starter Kit that is detailed above, others include the larger Expansion Kit, the aptly labeled Multi-door Kit, and the self-contained and portable Demo Kit.",
    "Those looking for a biometric security option will find it among the Kantech offerings. On the plus side, we did find the option, but the downside is that it is only a single option, and we would have preferred to see some additional choices. The HandKey II (Hand Geometry) Reader actually uses the shape of the hand for an identification, and according to the company utilizes “Field-proven hand geometry technology that maps and verifies the size and shape of a person’s hand all in less than one second.” While this sounds quite promising, the downside is that there are no other options, namely fingerprint, nor ocular scanning (retina or iris) which offer advantages in some situations. Furthermore, this hand geometry reader is a larger device, making it a challenge to install. Finally, it is limited to only indoor use.",
    "We take note that there is a choice of software to run the Kantech system, namely three different programs. At the bottom is the Special Edition, that is limited to a single system, but still can control up to 128 card readers, and an unlimited number of users. The next software up is Corporate Edition, with up to 10k card readers or keypads, and up to two additional operator workstations. At the top of the software heap is the Global Edition, which has support for up to 4 operator workstations, and adds all sorts of features including up to 512 VideoVault connections for integration of video, and support for a redundant server.",
    "Support for Kantech fits into a few different categories. There is Sales Support, which is used to price out and purchase a system. Less intuitively obvious is Presales Support, for application engineering, and can be reached via email, toll free phone, or another phone number.",
    "Then there is the support that most folks think of when they think of support, namely Customer Support. For this option, there is only a toll free number, or email, which is more of a contact portal. We find it lacking the more direct email, fax, and chat options, not to mention epapers, webinars or online support videos are not present either. However, in all fairness, we did find a Technical Library of supporting documents. Unfortunately, there are no hours of support indicated on the site.",
    "Finally, there is Technical Support. This also does not have the hours of availability indicated. This category is also limited to an 800 number, and an online support portal.",
    "We overall find the fragmentation of support into so many categories confusing, and also have concerns of consumers being shifted from one department to another for resolution of an issue.",
    "Kantech does not provide any pricing on its site, for either the software nor the hardware components of its access control system.",
    "However, unlike many of its competitors, pricing for Kantech products is available with some internet searches. For example, the Kantech Prox Ii Cards can be purchased for $6.87 (£5.30), the Kantech 151Sgcheckpoint Reader for $585.69 (£452), and the Hid Reader Cover, for Hid-Mp5365, gray for $37.34 (£29).",
    "We do appreciate that there is some type of pricing available to at least get an idea of the costs involved. Potential purchasers should be sure though to contact the company so that a proper system is designed, and compatible components are combined.",
    "For North America, sales can be contacted via either a toll free number, a direct toll number, or email. The hours of operation for sales are not provided.",
    "Kantech offers a decent security solution. Highs include the choice of support options including toll free phone support, the availability of some pricing online, and the kit approach to simplify the configuration. However, there are also significant lows that encompass the support that we find to be both fragmented and with unclear hours, the too opaque pricing, and the lone biometric security option. Overall, these lows of the Kantech access control system would have us considering other options."
  ],
  "headers": {
    "1": "Features",
    "6": "Support",
    "10": "Pricing",
    "14": "Final verdict"
  },
  "links": {
    "Kantech": "https://www.kantech.com/",
    "access control": "https://www.techradar.com/news/best-access-control-systems",
    "Starter Kit": "https://www.kantech.com/Products/kits_starter.aspx",
    "Expansion Kit": "https://www.kantech.com/Products/kits_expansion.aspx",
    "Multi-door Kit": "https://www.kantech.com/Products/controllers_multidoor.aspx",
    "Demo Kit": "https://www.kantech.com/Products/kits_demo.aspx",
    "HandKey II (Hand Geometry) Reader": "https://www.kantech.com/Products/rkc_handkey-2.aspx",
    "Special Edition": "https://www.kantech.com/Products/software_entrapass_se.aspx",
    "Corporate Edition": "https://www.kantech.com/Products/software_entrapass_ce.aspx",
    "Global Edition": "https://www.kantech.com/Products/software_entrapass_ge.aspx"
  }
}