{
  "source": "https://www.techradar.com/reviews/data-deposit-box-review",
  "title": "Data Deposit Box cloud storage review",
  "category": "computing",
  "updated": "2020-08-28T12:20:06.680Z",
  "author": "david-nield",
  "summary": "Data Deposit Box has its pros and cons",
  "verdict": "Data Deposit Box impresses us in certain areas but not in others – while it's a reliable and functional way of getting your data up to the cloud, we have come across other cloud storage services that have more useful features and come with a more intuitive interface.",
  "pros": [
    "One central web portal",
    "Works on multiple devices",
    "Speedy in operation"
  ],
  "cons": [
    "Interface looks dated",
    "Occasional online bugs",
    "Takes a while to learn"
  ],
  "article": [
    "Data Deposit Box is a cloud storage service that lets you manage everything through one web page – all your devices and backups are handled here, and that makes it relatively straightforward to stay on top of all the devices currently hooked up to your account.",
    "You get an impressive number of features to play around with as well, though Data Deposit Box is not without its weaknesses too. Here we'll cover the key points you need to know about the cloud storage service, and how much it'll cost you if you want to sign up.",
    "Data Deposit Box takes a 'one app to rule them all' approach to cloud backups – those backups can be from computers, mobile devices and network devices, with the data transfer happening all the time in the background. While individual clients need to be added to each device, the various backup settings are all managed through a central hub that you get at through a web browser.",
    "That makes Data Deposit Box a simple service to get to grips with. You can add an unlimited number of devices to your account – the only limitation is the amount of cloud storage you've paid for – and the platform also supports file and folder sharing, which again is managed in a straightforward and accessible way.",
    "You can schedule backups or have them running constantly, throttle CPU use on the devices you've registered, and roll back to previous versions of your files, should you need to. It's a comprehensive solution that will suit many individuals and small businesses, and all of this can be managed through the My Data Portal on the web.",
    "You get a reasonable level of management in terms of devices and users – it's not the easiest service to manage a team with, but the basics are here, and they should be enough to cover the needs of most users. You can split your users up into departments if necessary, but the service is also perfectly fine if you're a one-person operation or using the service in a personal capacity.",
    "From the very first interaction, Data Deposit Box gets down to business: as soon as you've entered your login details, you'll be prompted to download the client software for whatever device you're currently on. A few minutes after that, you can be taking a tour of the all-important web portal, where you can manage your backups and devices.",
    "Admittedly the online software interface isn't as polished as some others out there – Data Deposit Box could really take a few lessons from the likes of Dropbox and Google as to how a web app should look and feel in the modern era – but in terms of the main functionality we don't have too many major complaints. We like the idea of being able to manage everything through one portal.",
    "Some of the screens look a bit on the clumsy side, and Data Deposit Box is sometimes not as responsive as we would like on the web, but it works as advertised in terms of getting your data up to the cloud and letting you share it with others. It would be even better if it had a bit of a revamp in the looks department, but it works fine as it is.",
    "Upload and download speeds are impressively quick, and about the maximum we could expect given our home broadband connection. As for the mobile apps, they pretty much follow the lead of the desktop clients and the web interface – they get the job done but they do look like they haven't had a redesign in about a decade.",
    "Data Deposit Box deploys what it describes as military grade encryption – that's 448-bit Blowfish encryption to be exact, so if your data should fall into the wrong hands then there's very little chance of those parties being able to make sense of it. There isn't end-to-end encryption though, so Data Deposit Box staff can access your files should they be so inclined (there's no suggestion that they do – but they could).",
    "Two-step verification is available, but you'll need to remember to switch it on after opening your Data Deposit Box account (the software does prompt you to do this). Overall, Data Deposit Box is something of a mid-range offering when it comes to security – it does well in certain areas and not in others.",
    "Data Deposit Box uses one of the simplest pricing structures that we've come across – the starting point for the service is 200GB of data for $20 (about £15) a month. Anything above that is going to cost you an extra $0.10 (about £0.08) a month for each additional gigabyte, so if you need 500GB of room then that's another $30 (about £23) every month. There's no free tier, but a 14-day trial is available, with no payment details required.",
    "These are expensive prices when you consider that the most popular cloud storage services for consumers are offering 1TB or 2TB a month for half of what Data Deposit Box charges for 200GB. We should mention that the service does offer a 100% money back guarantee – if your data can't be restored from a particular device, then you'll get a refund for all the money you've spent backing up that device.",
    "We're a bit split on what to think of Data Deposit Box: on the one hand, we like the idea of managing everything through a central portal, and there are plenty of features to make use of. You get file versioning, and the option to throttle CPU use, and the ability to block out certain blocks of time when the backup mechanisms aren't being run.",
    "On the other hand, the software interface isn't terribly impressive, the security protections don't stand out, and you aren't really getting much room in the cloud for what you're paying. We'd encourage you to take advantage of the 14-day free trial to see if Data Deposit Box suits you or your business – it might do, but it might not."
  ],
  "headers": {
    "2": "Data Deposit Box features",
    "6": "Data Deposit Box interface",
    "10": "Data Deposit Box security",
    "12": "Data Deposit Box pricing",
    "14": "Data Deposit Box verdict"
  },
  "links": {
    "Data Deposit Box": "https://datadepositbox.com/",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}