{
  "source": "https://www.techradar.com/reviews/pc-specialist-lafite-pro-business-laptop",
  "title": "PC Specialist Lafité Pro business laptop review",
  "category": "computing",
  "updated": "2020-07-08T10:19:35Z",
  "author": "desire-athow",
  "summary": "Clevo delivers a stunning piece of hardware with a card up its sleeve",
  "verdict": "The PC Specialist Lafité Pro is an excellent laptop showing the maturity that Clevo has reached. It is cheaper than the competition and offers some great features. Shame that it is not available as widely as some of the better known brands.",
  "pros": [
    "Relatively affordable",
    "One of the best battery life on a light laptop",
    "MIL-STD-810G certification",
    "Very, very light"
  ],
  "cons": [
    "Charges £5 extra for a normal warranty",
    "No Thunderbolt 3",
    "No fingerprint reader",
    "Power-on button on the side"
  ],
  "article": [
    "In the shadows of the big laptop manufacturers lurks a small group of notebook vendors that rebadge and sell products from one of the most well kept secrets in the portable computer industry: Clevo. What has kept them alive and thriving is the fact that they can tweak and customize their products in ways that would be financially not viable for big vendors.",
    "We’ve been lucky to get hold of one of its most promising products to date, the Clevo L141CU which is also known as the PC Specialist Lafité Pro.",
    "This is probably one of the best designed Clevo laptops we’ve handled to date. By design, modularity is baked in the chassis, which de facto removes the sort of very tight integration you see on the Apple MacBook Air or HP Spectre Folio 13.",
    "Thus, previous Clevo laptops lacked the finesse and the finish of the Lafité Pro; gone - at least for this Clevo sub-brand - the chunkiness and utilitarian looks. Say hello to a laptop that weighs 1.12Kg with a thickness of 16.5mm and a footprint that’s slightly bigger than an A4 sheet of paper.",
    "What’s even more impressive is that it has a MIL-STD-810G certification, something that’s not fully explained to us beyond the sticker on the case. Needless to say that this, unlike rugged smartphones that do carry the certification, is not a license to start using this laptop in the rain.",
    "Other than the PC Specialist logo on top plus a handful of stickers, there’s barely anything that interferes with the minimalist approach of that laptop. PC Specialist didn’t even bother hiding the fact that this is a Clevo product, all the details are clearly printed on a sticker found on the bottom of the laptop. Two speaker grills are located there as well.",
    "Even though this is technically an Ultrabook, it didn’t skimp on connectors: there’s two USB Type-A ports (one on each side), a microSD card reader, an audio connector, a Type-C port (with DisplayPort Alt mode) and a full-size HDMI connector. The proprietary power connector is fed by a tiny 65W (19v, 3.42A) charger that’s barely bigger than a pack of cigarettes.",
    "Note that unlike most laptops, the power button on the Lafité Pro is on the right hand side of the laptop. We like the protruding “lip” on the display lid; one that houses a pair of microphones as well as a 1-megapixel camera. The extra bit of bezel makes it far easier to open the lid with one hand.",
    "The PC Specialist Lafité Pro costs as little as £673 ($840) including VAT (£568.83 excl. VAT) with an Intel Core i5-10210U, 8GB RAM, a 128GB PCIe NVMe SSD, no operating system, default delivery and after sales services. Our review sample model came with Windows 10 Pro, 16GB RAM and a 1TB SSD (Samsung 970 EVO Plus), pushing the price to £1,048 ($1,308).",
    "A Core i7 option is available but will provide only marginal performance improvements. There’s 8GB DDR4 memory soldered with the ability to add another 16GB of memory to boost it to 24GB. You should be able to add a 32GB memory module as we have seen other European resellers of the L141CU offer this option.",
    "The laptop can accommodate two M2.2280 solid state drives; one slot is SATA/PCIe while the other is SATA only. Wi-Fi and Bluetooth are handled by an Intel Wi-Fi 6 AX200 wireless module. Although the device comes with Windows 10 Home, you can choose to upgrade to Windows 10 Pro or remove the OS altogether.",
    "The battery life of the Lafité Pro is the best we’ve seen on a business laptop at more than 10 hours thanks to a 73Whr battery, the biggest we’ve seen on a laptop of this weight, more than the 72Whr found in the LG Gram 14 (2020). We reached that all-time high despite the fact that our battery forces the laptop to run at maximum speed with the screen set of 100% brightness and without any power saving settings on.",
    "The keyboard experience was quite enjoyable as well; this backlit model has a very short travel and was quite noisy during our test; it takes a bit of adjusting but in the end, it was just as pleasurable despite providing sharper/harder feedback. Note that the keys are slightly, very slightly, concave as opposed to the more widely available convex keys.",
    "The touchpad is a run of the mill model; it doesn’t have a fingerprint reader or dedicated hardware buttons. It could have been a bit bigger but given the dimensions of the beast, that’s understandable. It lacked firmness on the lower two corners (more pronounced on the right hand side), a common weakness amongst laptops that don’t have physical buttons.",
    "The 60Hz screen is matte and the barrel hinge allows it to be laid flat to share the screen content effortlessly. Just bear in mind that there is a bit of flex (both in the lid and the keyboard) due to the use of magnesium alloy. The panel delivers some punchy colours with good brightness and decent contrast. The coverage of the sRGB color gamut reaches about 72% of the NTSC range.",
    "As for performance, well, it outperformed most laptops that we tested in this category except for the (far more expensive) Dynabook Portégé X30L-G and the Dell Vostro 14 5490, both sporting a more powerful Core i7-10510u. Its storage subsystem produced the best numbers we ever came across in our standard CrystalDiskMark test. Altogether, it is a very, very capable device that will munch through any office task, big or small.",
    "At the time of writing, we couldn’t source the Clevo L141CU in the US which is a real shame given the potential of this laptop.",
    "The Dell XPS 13 is one of the best laptop money can buy; if you want to get it as a 1TB model with 16GB memory, there’s only one way to go; one that lands you a Core i7 with a 4K touch display with a 16:10 aspect ratio, one year ProSupport and next business day onsite service, a smaller 52Whr battery, two Thunderbolt ports and a weight of 1.2Kg. Oh and it costs £1,449 plus VAT compared to £877.33 for the PC Specialist model, nearly two-thirds more expensive.",
    "Much closer to the Lafité Pro is the LG Gram 14 which features a Core i7, half the storage and a 72Whr battery. Also lacking is Windows 10 Pro but it does weigh a staggering 999g and comes with a two-year warranty via Costco’s Concierge Services. It does have a fingerprint scanner, a LAN port, a Thunderbolt 3 connector and like the PC Specialist laptop is MIL-STD-810G rated. A very, very close one; price? £1289.89 (including VAT) at Costco UK",
    "The HP Envy 13-ba0010na is a touchscreen model, the only one in this list of competitors. It offers a discrete GPU, the Nvidia Geforce MX350, a camera shutter, a fingerprint reader, HP’s 3-year care pack with pickup and return and a 51Whr battery. While it is the one with the best aftersales and the cheapest at £1,249 direct, it is also the heaviest.",
    "We have been pleasantly surprised by the Lafité Pro; never have we seen a Clevo laptop more balanced than this one. Despite its diminutive size and featherweight, it sports a battery capacity that almost defies the laws of physics. What it lacks in terms of brand cachet, it makes up in terms of features like the ability to pack two SSDs, MIL-STD-810G rating and Wi-Fi 6 wireless connectivity.",
    "It’s not to say that it is without flaws, we don’t like the button on the side, the lack of Thunderbolt 3 capabilities, the absence of a fingerprint reader but above all, the fact that you have to pay a fiver to get what is considered to be standard warranty elsewhere (1-year collect and return, 1-year on parts). But then again, you probably need to check the price."
  ],
  "headers": {
    "2": "Design",
    "8": "Hardware",
    "11": "Performance and in use",
    "16": "The competition",
    "20": "Final verdict"
  },
  "links": {
    "PC Specialist Lafité Pro": "https://www.pcspecialist.co.uk/notebooks/lafite-pro-14/",
    "Apple MacBook Air": "https://www.techradar.com/reviews/macbook-air-2020",
    "HP Spectre Folio 13": "https://www.techradar.com/reviews/hp-spectre-folio-review",
    "rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "Dynabook Portégé X30L-G": "https://www.techradar.com/reviews/dynabook-portege-x30l-g-business-laptop",
    "Dell Vostro 14 5490": "https://www.techradar.com/reviews/dell-vostro-14-5490-business-laptop",
    "Dell XPS 13": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1203578642190823000/https://www.dell.com/en-uk/work/shop/laptops/new-xps-13/spd/xps-13-9300-laptop/bnx93009sb",
    "LG Gram 14": "https://www.costco.co.uk/Computers/Laptops-MacBooks/LG-Gram-Intel-Core-i7-16GB-RAM-512GB-SSD-14-Inch-Ultra-Lightweight-Laptop-14Z90N-VAA75A1/p/328843",
    "£1,249 direct": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-8167558676418432000&p=https%3A%2F%2Fstore.hp.com%2FUKStore%2FMerch%2FProduct.aspx%3Fid%3D133S9EA%26opt%3DABU%26sel%3DNTB"
  }
}