{
  "source": "https://www.techradar.com/reviews/google-pixel-4-review",
  "title": "Google Pixel 4 review",
  "category": "phones",
  "updated": "2020-10-21T16:29:11Z",
  "author": "james-peckham",
  "summary": "Google Pixel 4 still has top camera software",
  "verdict": "If you’re in the market for one of the very best camera phones out there, the Pixel 4 should be at or close to the top of your list. If you’re looking for an all-round feature-packed phone, you may be a bit disappointed, and the battery life is mediocre at best, but it’s a solidly built device with an interesting design and powerful internals.",
  "pros": [
    "Great camera is now even better",
    "Solid easy-to-grip design",
    "Beautiful 90Hz display"
  ],
  "cons": [
    "No fingerprint scanner",
    "Battery life is poor",
    "Motion Sense is very basic"
  ],
  "article": [
    "The Pixel 4 was Google’s late-2019 attempt (alongside the Google Pixel 4 XL) at making a phone that shows off the very best of Android and offers up a cocktail of flagship photography features, including machine learning and other AI wizardry.",
    "Since its release we've also seen the Pixel 4a and 4a 5G, two very different interpretations of 'affordable Pixel 4', as well as the Google PIxel 5, the company's follow-up to this phone.",
    "The Google Pixel 4 was undeniably one of the very best camera phones you could buy on release, taking on that mantle from Google Pixel 3, but the upgrades are minimal elsewhere. Google hasn't tried to break the mold with the Pixel 4, instead playing things safe with an incremental update.",
    "The Pixel 4 remains novel amid smartphones, as it's a compact device that offers a unique design you won’t see in other flagships. This uniqueness comes from its appearance, the materials it uses, and the fact that it’s smaller than a lot of other top-end devices, which can sometimes be a little on the large side for the average user.",
    "Google has boosted the screen with a 90Hz refresh rate that offers a smoother experience when scrolling through social media or playing video games, and there’s plenty of power on tap, with a recent chipset paired with 6GB of RAM.",
    "One area where you’ll likely find the Pixel 4 frustrating is its battery life, which at best is mediocre and at worst can be infuriatingly quick to drain. The Pixel 5 has improved its battery so much (with 4,000mAh capacity) that it bears mentioning, even if the phone doesn't inherit all the Pixel 4's top-tier features.",
    "This radar technology is called Soli, and it’s designed to identify where you are in order to predict when you’ll reach for your phone, so that the screen is on, and ready and waiting for you. It’s an interesting idea, but so far it’s limited.",
    "The good news is that the Pixel 4's starting price is lower than that of the Pixel 3 in some countries, which could help to compensate for any perceived lack of overall innovation on Google’s part. And it's bound to get even more affordable with sales leading up to Black Friday on November 27 and into Cyber Monday thereafter.",
    "The Google Pixel 4 was announced in early October 2019, and it was then put on sale on October 24 that same year. You can easily buy this device in the US, UK, Australia and a variety of other markets around the world.",
    "For the first time, a Pixel phone is on sale at all major carriers in the US as often Google's phones are just available on Verizon. The Pixel 4 is also available on AT&T, Sprint, T-Mobile, Xfinity, Spectrum and Google Fi. In the UK it’s available through Vodafone, EE, O2 and Three, as well as a selection of other smaller providers.",
    "It’s also available in Australia, where it's available on Telstra, Vodafone, Optus and other carriers.",
    "If you want to buy the phone outright the Google Pixel 4 price started at $799 / £669 / AU$1,049 for the 64GB of storage model, while the 128GB Pixel 4 is $899 / £769 / AU$1,199.",
    "Certain markets can only access some models though – for example, in the UK the orange variant is only available in 64GB, while both 64GB and 128GB are available in the US.",
    "This all means the Pixel 4 has the same launch price as the Pixel 3 had in the US, while in the UK and Australia the new handsets actually have a lower launch price than their predecessors. It's unclear why it's cheaper in those two markets and not the US, but it's a nice bonus if you’re interested in this phone.",
    "If you find this price too expensive, you may be interested in the Google Pixel 4a that is rumored to be launching in the first half of 2020 and should offer a similar experience for a much lower price.",
    "While there's not a whole lot that's new about the Pixel 4 compared to the Pixel 3, the design has been significantly updated. It immediately feels like a different device, especially if you opt for one of the matte finishes.",
    "The handset has an aluminum frame which runs round the circumference of the device providing a solid structure, finished with a rubberized black coating.",
    "Initially this feels a little odd to the touch. We're used to the cool, premium feel of metal or glass when we pick up a flagship smartphone these days, and the duller finish on the sides of the Pixel 4 doesn't ooze the same high-end appeal.",
    "However, after a couple of minutes of handling the Pixel 4 the finish starts to make more sense. It provides an awful lot of grip compared to all-glass/metal rivals, and allows the phone to sit comfortably in the hand.",
    "It won’t be to everyone’s taste, as it doesn’t feel as premium as most other high-end devices on the market, but it does offer a more secure grip on the phone, and it’s something we grew to like more and more throughout our time with the phone.",
    "The rear of the phone is made of glass, but certain colors have different finishes. The Oh So Orange variant of the phone that we’ve been using for our review has an odd, ceramic finish, but it’s something we grew to like more and more over time too. The Clearly White version also has the same rear design.",
    "If you opt for the glossy Just Black variant (yes, those are the official names from Google) you’ll find the rear of the phone has a more traditional glass-like feel to it.",
    "With its 5.7-inch display, the Pixel 4 is one of the smaller flagship devices around, and will thus be usable one-handed for many, with the extra grip on the sides helping it to feel secure. The Pixel 4 measures 147.1 x 68.8 x 8.2mm and weighs 162g.",
    "It's not a 'compact' device – those with smaller palms may still need to employ both hands to comfortably use the Pixel 4 – but it’s certainly easier to use one-handed than its larger sibling.",
    "The display takes up most of the front of the phone, but there's still a bezel above and a smaller, but still noticeable, chin below, with Google once again opting not to use a notch on its standard flagship model (the Pixel 3 XL did sport a notch, but for the Pixel 4 XL Google has reverted to a bezeled design).",
    "It’s an odd choice that we don’t particularly appreciate, as it cuts into the amount of display that’s on offer. It’s particularly noticeable when you’re watching video, as it makes the black bars at the side of what you’re watching lopsided with a particularly thick area of black on one side.",
    "On the right side of the phone you'll find the power and volume buttons, with the former flaunting a contrasting color to the black trim of the Pixel 4 for a little visual interest. We found the people noticed this, and it adds to the phone’s distinct look.",
    "There's also a change on the rear, with a large, square camera block sitting in the top-left corner – it's a similar aesthetic to that of the new iPhone 11 series. This sits out from the phone a few millimeters, but we didn’t find it uncomfortable when the phone was in a pocket, and it didn’t cause any issues when it was laying flat on a desk.",
    "It's not an especially stylish implementation, but it has allowed Google to group two cameras (the first time it's included a second snapper on the rear of a phone), the flash and sensors into one area.",
    "The Pixel 4 has stereo speakers, which we found to work well but which don’t offer anything groundbreaking in the world of smartphone audio.",
    "The phone can survive a short submersion in water thanks to its IP68 water resistance rating, which we tested by dunking it in a park fountain without issue.",
    "The other thing you need to be aware of design-wise is that this phone lacks a fingerprint scanner. Google has decided to go all-in on face unlock, which it claims is quick and easy to use, and we found it to work accurately and speedily.",
    "However, while Apple has had success with Face ID on the iPhone X and newer iPhones, the Android ecosystem (and especially the apps available on the platform) isn't quite at the same stage.",
    "If you currently use your fingerprint to sign into Android apps like banking apps, you won’t be able to do so on the Pixel 4. Google says it’ll work with app developers to bring in face unlock for logins, but this could take a while to appear on the apps which matter to you.",
    "This is something you should bear in mind for services like your banking apps – for which face unlock is unlikely to be supported at launch – and it’s likely to be an issue elsewhere too.",
    "The Pixel 4 display is smaller than those on most Android flagship phones, but that doesn’t mean it isn’t a top-level piece of tech.",
    "It has a Full HD+ resolution and, more importantly, it’s a bright and colorful OLED panel – Google has learned its lesson from that desaturated Pixel 2 display debacle. While the Pixel 4 XL does pack a higher resolution, you won’t notice the difference at this size.",
    "We found the display of the Pixel 4 big enough for most things we wanted to do, although it does sometimes feel a little cramped when you’re watching videos or playing games. Size aside, it’s still beautifully bright and the 1080p resolution is good enough now that Google isn’t promoting its VR efforts.",
    "The highlight of the display tech is a higher refresh rate that’s higher than you’ll find on most other devices. In a similar vein to the OnePlus 7 Pro and OnePlus 7T, the Pixel 4 comes with 90Hz refresh rate, which results in a smoother experience when scrolling through social media or playing games.",
    "Smartphones typically have a refresh rate of 60Hz, but the Pixel 4 (along with a few others such as the above OnePlus handsets) refreshes 1.5x faster. We found the difference especially noticeable when scrolling through our Twitter feed or using Instagram. It’s something you get used to quickly, but which you’ll quickly miss if you switch back to a 60Hz device.",
    "As mentioned, the big upgrade on the Pixel 4 is the inclusion of a second rear camera – this is the first time Google has put more than one lens on the rear of a handset.",
    "Two rear cameras is still pretty modest these days though, with most high-end flagships boasting three, four and in some cases even five.",
    "Google likes to keep things simple in terms of hardware though, and there's a 12MP main camera (f/1.7, 77-degree field of view), assisted by the new 16MP telephoto lens (f/2.4, 52-degree field of view), allowing for improved zoom, better low-light shots and enhanced portrait photography.",
    "The photography hardware isn’t remarkably different compared to the Pixel 3, but Google has delivered another impressive camera setup here, with shots looking even more detailed than before.",
    "The addition of the telephoto lens is notable too, enabling you to zoom in on subjects without losing quality. We’ve found this to work well, but it’s not as impressive as on some other top-end Android phones such as the Huawei P30 Pro – don’t expect this to be the ultimate zoom camera on the market right now.",
    "Round the front you get an 8MP selfie snapper (f/2.0, 90-degree field of view). It works perfectly well for selfie shots, though it’s missing the wide-angle front camera innovation we saw on the Pixel 3.",
    "Google has looked to software rather than hardware to give its cameras the edge in recent years, and here it's added an improved ‘neural learning’ AI chip for improved software manipulation of images.",
    "Google has also brought live HDR+ to the Pixel 4, which gives you a real-time on-screen preview of what your final image will look like, rather than simply applying the enhancements after you've snapped a photo.",
    "This tech leads to another new camera feature called Dual Exposure. It decouples the brightness controls of the background and the shadows controls in the foreground. We were able to adjust them independently via two on-screen sliders and, with a solid minute of tinkering, reduce the blown out backgrounds and see our once-shadowy subject. It’s not the perfect cure-all, but it offers more versatility than the iPhone controls if you have patience.",
    "Portrait mode is notably better than ever, with the Pixel 4 able to distinguish the subject we were shooting from its background very effectively. You can see in the two examples below where the camera has identified what we wanted to keep in focus, and it could have been difficult with these subjects.",
    "Google's Night Sight mode, which sees the camera pull light seemingly from nowhere in ultra low-light situations for surprisingly bright, clear shots, gets an upgrade on the Pixel 4 as well – and it needs it, as competitors have caught up, with Huawei and Apple both now offering similarly strong night modes.",
    "We found this to work fantastically well in our testing and you can see an example of the results below.",
    "The Pixel 4 also comes with a new astrophotography mode, which allows you to take bright, clear images of the moon, stars, and galaxies.",
    "Google says you'll need to head out of light-polluted cities and into the countryside to take advantage of this new mode, and you'll also need to brace the Pixel 4 against a stable surface, or mount it on a tripod or other support – only when the phone detects that it's fully stable will it be able to capture the 15 long-exposure shots required to produce a well-exposed and detailed image.",
    "The examples we were shown during our brief hands-on time with the handset looked impressive, but we’ve yet to be able to test this feature out properly – we’ll be sure to include it in a future update to this review.",
    "The Google Pixel 4 packs Qualcomm's flagship Snapdragon 855 chipset, giving it plenty of grunt, and that's complemented by Google's first ever bump in RAM for a Pixel phone.",
    "The first, second and third generations of the Pixel range have all come with 4GB of RAM, but the Pixel 4 sees that increased to 6GB, bringing the phone more in line with the Android competition (although there are still plenty of rivals packing 8GB, and even, in some cases, 12GB of RAM).",
    "We found in our time using the phone that it was speedy, able to load apps and games with ease as well as offering everything we need from a modern smartphone.",
    "We ran benchmarking stats with Geekbench 5 on the device and found it scored on average 2,183. Compared to other top-end phones at the moment that’s good but not great, with the Samsung Galaxy S10 Plus 5G scoring a similar 2,197 but both of these devices being beaten by the OnePlus 7T Pro at 2,584.",
    "This isn’t the best chipset available on the market at the time of writing – that honor goes the Snapdragon 855 Plus chipset that’s designed to be slightly better for gaming – but we found that the Pixel 4 loaded demanding apps and games without any issues.",
    "The software on the Google Pixel 4 also works smoothly. On-screen you'll find Android 10, the latest version of Google's mobile operating system, which features the firm's smart assistant baked into its core and new gesture controls.",
    "Google Assistant has been improved in Android 10, and the Pixel 4 showcases the smarter voice assistant. You can now request it to open apps, and perform searches in them – for example, saying \"Hey Google, show me Beyonce on Instagram\" will open the social app and take you to the pop star's profile page.",
    "There's a new way to activate Assistant too: with a swipe-up gesture from the bottom-right corner of the screen. Alternatively, you can still use the wake word \"Hey Google\" or squeeze sides of the Pixel 4 – as you can on the Pixel 3 and Pixel 2 – to bring the voice assistant to life.",
    "Assistant in Android 10 is also context-aware, and if you bark a second command within 15 seconds of your first question, you won't need to wake it – it'll already be listening. You’ll notice that the bottom software keys have changed in the jump from Android 9 Pie to Android 10 – Google’s traditional recent, home and back buttons have been replaced by a slim bar by default – although you can change it back in the Settings menu.",
    "The bottom bar takes up less screen height and the iPhone-esque controls, once you get used to them, work well, forcing you to swipe up from the bottom to return to the home screen or open recent apps. But the now-hidden back button gesture is still something you won’t find on an iPhone: swipe from the right side to the left to go back on any page.",
    "The Pixel 4 marks the end of Google’s free unlimited original-resolution cloud storage perk, a treat we’ve been enjoying since the original Pixel. It’ll back up your photos and videos at ‘high quality’ (capped at 16MP and 1080p HD) just like any other smartphone, and of course Twitter is outraged. This deal expires for the Pixel 2 and Pixel 3 in 2021, while the original Pixel was introduced with lifetime support.",
    "Overall, the Android 10 software itself is easy to use if you’ve used an Android device, and we found it to work smoothly throughout our testing period. All the top Google apps are provided here out of the box, and everything just works well.",
    "Another new feature on the Pixel 4 is Motion Sense. This enables you to use gesture controls to perform simple tasks when touching the screen of your smartphone isn't convenient, such as when you're driving, cooking or working out.",
    "We've already seen gesture control built into smartphones, with the LG G8 one of the more recent devices to offer it, but instead of using a camera for this, the Pixel 4 comes with a radar chip embedded into the bezel above the screen.",
    "The radar chip provides a wider, 180-degree field of view that allows the Pixel 4 to detect your hand from further away. Google says it's been working on the tech for five years – however, its first public outing is extremely limited.",
    "Motion Sense can detect three things: presence, reach and gestures. With presence, the phone detects whether you're near the device. If you are, it'll power-on the always-on display, and when you move away it'll turn the display off to preserve power.",
    "We found this to be useful throughout our testing period, but it can also be frustrating when you have your device facing you. That’s because it notices you, and then activates the face unlock when all you wanted was to be able to see the stats on the always-on display.",
    "This is a rare frustration, but it’s still something we think you should bear in mind with this device.",
    "Reach will wake the phone to display the lock screen (and show any notifications you may have) when you move your hand towards it to pick it up. This is a particularly useful feature which you’ll soon forget about, as it just works intuitively.",
    "The most interesting of the trio is gesture detection, which lets you wave a hand over the handset to perform certain functions. For now, this only allows for basic control such as skipping between music tracks (you can't use gestures to play/pause or adjust volume), silencing alarms/timers and hanging up calls.",
    "Gestures are also only supported by a handful of applications at launch, including YouTube Music, YouTube, Spotify, the phone app and the clock app. Apps that are compatible will display a glowing white border at the top of the screen, giving you a visual cue that the feature is available.",
    "We often used this feature in our time testing the phone, when listening to music on Spotify, but it’ll likely take you a few attempts to get the hang of it – we did, after a while, but it we didn’t find it consistently accurate enough to make it a feature we’d often look to use.",
    "There is one more area where gestures are supported, and that's on the home screen. Another new addition for the Pixel 4 series is animated Pokémon wallpapers, and if you wave your hand over the phone the pocket monster on the screen will react with a wave or a loving smile.",
    "These actions are fun to use, but the animated display drains battery, and we often found waving at the Pokémon while we were listening to music would cause us to skip tracks, as it’s a similar gesture to the wave described above.",
    "You can double-tap the Pokémon to cycle through different characters, with Pikachu and Eevee among those on board. It's a fun inclusion, especially if you're a Pokémon fan, but again it's fairly basic interaction.",
    "We’re excited to see what Google can do in the future with its Motion Sense technology, but so far it hasn’t been the game-changing feature the company would like it to be",
    "Battery life is one of the weakest elements of the Pixel 4, and it’s quite a let-down to find such poor performance in this area on a modern flagship phone.",
    "We often found the Google Pixel 4 wouldn’t last a full day after we took it off charge often at around 7am, with the phone dying by the early evening – and with intensive usage it often didn’t last longer than the early afternoon.",
    "This sub-par performance is arguably down to the 2,800mAh cell that powers the Pixel 4 – even though this device doesn’t have the biggest screen to power that’s a particularly smaller battery to include. The Pixel 3 didn’t have great battery life either – and that phone had a larger battery at 2,915mAh.",
    "In our battery life test - that’s where we run a 90 minute video with the phone of full brightness - we found the phone dropped 19%. That’s not terrible, but also not the best we’ve seen as phones like the OnePlus 7T Pro have previously scored only 10% battery drop.",
    "A saving grace here is that the Pixel 4 comes with some impressive fast-charging technology, which we found could charge the phone from 0-50% in 38 minutes if you use the USB-C charger included in the box.",
    "The phone took an hour and 53 minutes to entirely recharge – as with other fast-charging technologies, Googles focuses on speed initially to give you a quick top up, then slows down to finish charging your device.",
    "This Pixel 4 also supports wireless charging, which we found useful when sitting at a desk, as we could prop the device up on a wireless charging stand or place it on a charging mat to ensure it was topped up throughout the day.",
    "Overall, however, the battery life on the Pixel 4 just isn’t good enough for anyone who intensively uses their phone – the Pixel 4 XL is a far better option here, with its larger battery and longer life, but these days you shouldn’t have to upgrade to a plus-sized device from a leading smartphone brand in order to get what most people would consider routine day-long battery performance.",
    "First reviewed: October 2019"
  ],
  "headers": {},
  "links": {
    "Google Pixel 4 XL": "https://www.techradar.com/reviews/google-pixel-4-xl-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "4a 5G,": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Google PIxel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "Snapdragon 855 Plus": "https://www.techradar.com/news/snapdragon-855",
    "Android 10": "https://www.techradar.com/news/android-q",
    "LG G8": "https://www.techradar.com/reviews/lg-g8-review"
  }
}