{
  "source": "https://www.techradar.com/reviews/qbittorrent",
  "title": "qBittorrent torrent client review",
  "category": "computing",
  "updated": "2020-06-12T16:18:29Z",
  "author": "jitendra-soni",
  "summary": "Open source torrenting magic",
  "verdict": "qBittorrent offers a clean and minimal interface, and is free to use. It may look dated, but its open source nature is a major plus point, and is very much helping it stay alive.",
  "pros": [
    "Clean interface",
    "Free",
    "Open source"
  ],
  "cons": [
    "Slightly dated design"
  ],
  "article": [
    "qBittorrent is a free and open source torrent client that helps users download content off the internet. It is one of the very few torrent clients that offers a minimalist and ad-free user interface, while the application itself is lightweight.",
    "qBittorrent started in 2006 and is one of the oldest torrent clients that is still being actively developed. It is available for all the major operating systems, including Windows, macOS, and Linux, offering a similar torrenting experience across these platforms.",
    "One of the key highlights of qBittorrent is that it is entirely free and doesn’t have a premium version that promises additional features at a cost.",
    "qBittorrent is managed and developed by individual volunteers, and since it is developed as an open source program, it has been kept free to use.",
    "The official Microsoft Store has a qBittorrent application priced at $1.89. However, the developers have stated that this is not an official release (hence the price tag on free software), and not to use it (it does not appear to be the latest version of the client, either).",
    "In case users want to support development of the software, the devs accept donations in the form of cryptocurrency.",
    "The good news for fans of lightweight apps is that qBittorrent is very compact indeed. The Windows 10 64-bit installer is just 24.8MB in size, while the macOS version is even less at 17.2MB, with the Linux version weighing in at only 7.2MB. So let’s put it this way – you won’t be waiting long for it to download.",
    "The interface is impressively minimalist, and what’s more it isn’t burdened with any adverts or other unnecessary bloat. Compared to most torrent clients, it’s relatively fast and light.",
    "The feature-set of qBittorrent is pretty broad and includes built-in RSS feed support, which lets users download content by just adding a feed to the list. The client then automatically downloads the content as soon as the RSS feed gets updated.",
    "You also get a built-in search engine that lets users search for their favorite content right from inside the client. This can be achieved by installing the relevant search plugin for the preferred torrent site. These plugins are available for free and increase the functionality of the torrent client. Furthermore, using this integrated search engine helps keep the user’s activity away from the prying eyes of ISPs or other trackers.",
    "That said, while this makes for a more secure torrenting experience on the whole, note that the downside is that user comments are unavailable in most cases – so that makes judging the relevance of the file being downloaded a trickier proposition.",
    "Another impressive feature is remote torrent management. This allows the user to fire up torrent downloads remotely using qBittorrent. In other words, the torrent client installed on your home PC can be managed from virtually anywhere – all you need is to be able to access a web browser.",
    "Furthermore, qBittorrent has created an Ajax-based custom UI resembling the standard interface that allows users to implement a secure login ID and password. These login credentials are important for remotely controlling activities like adding, pausing or resuming a torrent download.",
    "Like most torrent clients, qBitttorrent allows you to limit the bandwidth employed for downloading or uploading content, so you can ensure that your connection isn’t bogged down if you’re trying to do other things online while torrenting.",
    "Other features include the possibility of sequential downloading, which downloads the content in a predefined order. You also get a torrent creation tool, IP filtering, and UPnP/NAT-PMP port forwarding support.",
    "Finally, as we’ve already mentioned, another major plus for qBittorrent is that it’s open source, so anyone can review the code, and even contribute to the development of the software. This can help in terms of spotting bugs and fixing them, effectively providing an additional level of security.",
    "As mentioned above, the software has a clean and uncluttered interface, making it easy for anyone to use and download content off the internet. It allows users to download multiple files simultaneously and is considered to be the closest equivalent to µTorrent.",
    "While the interface is similar enough to most regular torrent clients, some design-focused people may find the layout looks slightly dated. Still, the software does the job that it is supposed to.",
    "The settings menu has options similar to other platforms. With relevant icons clearly defining their functions, first-time users will find everything easy to navigate.",
    "qBittorrent’s latest version was released in April 2020 and is available for all major operating systems: Windows 7, 8 and 10, macOS High Sierra, Mojave, and Catalina, as well as Linux. There is no mobile OS support as yet.",
    "Using torrents and downloading content via a torrent client can be risky if fundamental security measures are not followed. The first and most basic step is to ensure that the client is downloaded from an official source.",
    "Since qBittorrent is open source software, the chance of it being laden with some kind of malware is minimal. Still, we ran the installer file of the latest version (4.2.5) through VirusTotal and it picked something up, but a quick Google showed the single flagged threat was a false positive, which could be ignored.",
    "Further note that the interface exposes the IP address of all participants, which underlines the importance of using VPN software with a torrent client. Fortunately, we have an exhaustive guide to the best VPN for torrenting and torrents.",
    "While torrents allow users to download their favorite content off the internet, and clients like qBittorrent make the process easier, remember that there is, of course, copyrighted material online, and downloading that is breaking the law. Naturally, TechRadar does not support or endorse piracy or illegal downloads.",
    "qBittorrent is an easy to use torrent client with all the key features that you need for torrenting. The fact that it is free for all and does not have an ad-laden interface is the icing on the cake. The ability to add external plugins makes the software more robust and powerful."
  ],
  "headers": {
    "3": "Pricing",
    "6": "Features",
    "16": "Interface",
    "19": "Platform support",
    "20": "Safety",
    "23": "Piracy",
    "24": "Final verdict",
    "25": "You might also like"
  },
  "links": {
    "qBittorrent": "http://qbittorrent.org/",
    "torrent client": "https://www.techradar.com/best/torrent-client",
    "best VPN for torrenting and torrents": "https://www.techradar.com/vpn/best-vpn-for-torrenting"
  }
}