{
  "source": "https://www.techradar.com/reviews/samsara",
  "title": "Samsara review",
  "category": "computing",
  "updated": "2021-09-09T09:38:58Z",
  "author": "jitendra-soni",
  "summary": "Stellar performance from a trustworthy brand",
  "verdict": "A seriously comprehensive service is provided by one of the most reliable and trusted firms in the industry.",
  "pros": [
    "Trusted provider",
    "Free trial",
    "Comprehensive reports",
    "Customizable IoT solutions"
  ],
  "cons": [
    "Long contract lengths",
    "Slightly more costly compared to rivals"
  ],
  "article": [
    "Samsara is a cloud-based fleet management solution that offers assistance in organizing and managing vehicles and transporting assets. Its HQ is in San Francisco in the US, with offices in San Jose, Atlanta, and London. The company has over 1,500 employees and takes pride in having served over 15,000 customers globally.",
    "Founded in 2015, Samsara is one of the market leaders when it comes to offering complete fleet tracking solutions which include a combination of IoT devices to offer real-time visibility with AI to provide accurate analytics. The company serves customers of a broad variety and size, including transportation and logistics outfits, field services, food production, energy, construction, local governments, and manufacturing.",
    "It also offers a free trial before you decide to invest and even has a dedicated team to help build a custom solution according to the client’s requirements. Furthermore, Samsara is ELD compliant and is FMSCA approved.",
    "Samsara’s pricing is dual-layered. It charges you upfront for the hardware and has a monthly recurring subscription fee. The recurring fee includes the software license as well. Though the website does not list the fees, it does talk about charges like the basic initial investment for hardware and annual license etc.",
    "The upfront hardware starts at $129 per device and can go up to $399 per device depending on the product you choose. The recurring software licenses range between $13-30 per month as reported by a few customers on various online forums.",
    "However, the exact amount that the company may charge will depend on your fleet size, business type, the levels of service you opt for, and any other specific requirements. While many competitors do not charge an upfront fee, the fact that Samsara charges an upfront amount lets you own the hardware over a period of time.",
    "The website also offers an ROI chart where you can key in your requirements along with your expected contract tenure, and it returns with a detailed breakdown and indication of the amount that you’ll save after accounting for all the expenses.",
    "Among the many options available in the market, Samsara stands tall for the industry-leading features that it offers. It not only provides real-time traffic updates but also displays the best available route to drivers, helping them reach their destination on time.",
    "On the admin end, the software not only helps you to track the vehicle’s movements but also lets you keep a tab on unnecessary stops taken by the driver, as well as the vehicle’s overall performance, any breakdowns, and even reports about fuel waste.",
    "It goes way beyond what a normal fleet management app does, offering a wide variety of hardware integrations like integrating dashcams, wireless sensors, and digitization of paper; options which are not available in many other similar companies. The integrations with third-party software also make for a very extensive list.",
    "The Samsara software can be integrated with payroll, CRM, TMS, route planning, inventory management software, fuel cards, and many more, for compatibility with your existing software license(s), allowing you to get the maximum out of the solution.",
    "Among the key features of Samsara are:",
    "Samsara offers an extensive amount of data around the vehicle, and its vehicle diagnostics help businesses ascertain the vehicle's condition promptly. It keeps the driver as well as the admin informed about the upcoming preventative maintenance, vehicle fitness inspections, and services.",
    "The sensors can track rash driving and record incidents like sudden acceleration, harsh braking, speeding, harsh turns, accidents, and crashes. With the help of this data, business owners can easily ascertain if drivers need a coaching session to improve their driving skills. If you’ve opted for a dash cam in the vehicle, this makes life easier as it is connected with various sensors present in the vehicle.",
    "Once alerted by the sensors, these cameras can automatically capture video footage of both outside and within the vehicle, and upload them to the servers giving clear information to the support team in case of an incident. The driver can be communicated with instantly, or can be briefed later on depending on the incident.",
    "Samsara offers an aerial viewpoint of the actual location of the vehicle in real-time. This is immensely helpful and an innovative feature. Its software can automatically create an optimized route map for the driver which includes a customizable stop time at each delivery point, helping the business owners plan deliveries in an organized way. This should result in increased fuel efficiency and better overall performance.",
    "One of the main selling points of Samsara is the sheer number of reports you can get all thanks to the various sensors installed on the vehicle. That includes reports on vehicle performance, various driving-related reports, maintenance reports and most importantly fuel reports. The fuel reports by Samsara are highly detailed and comprehensive.",
    "The admins get to know very fine granular details of the vehicle, such as the name of the driver and vehicle ID, as well as precise information like the amount of fuel left in the vehicle, fuel consumption during specific intervals, engine run time, idle time, vehicle’s fuel consumption average and so on.",
    "Samsara offers multiple channels for customer support. This includes a 24/7 support center that can be reached via a helpline number, web chat, and the ability to email a query.",
    "As well as this, there are FAQs and videos that can help users solve their basic queries. Quite a few users have rated Samsara’s support team highly on various online feedback portals. If customers rate your support as “helpful” and “understanding”, that is obviously a good reflection on the quality of service delivered.",
    "Samsara is an industry leader when it comes to advanced fleet management services. It covers almost everything you could ask for, and also bear in mind that to test if all your requirements really will be met, there is a free trial to avail yourself of.",
    "Samsara is one of the most reliable and trusted service providers in the industry and meets all the major compliance requirements."
  ],
  "headers": {
    "3": "Pricing",
    "7": "Features",
    "12": "Safety for drivers and vehicles",
    "15": "Route optimization",
    "16": "Reporting and analytics",
    "18": "Support",
    "20": "Final verdict",
    "22": "Further reading"
  },
  "links": {
    "fleet tracking solutions": "https://www.techradar.com/best/the-best-fleet-management-software-and-services-2020"
  }
}