{
  "source": "https://www.techradar.com/reviews/xbox-one-x",
  "title": "Xbox One X review",
  "category": "gaming",
  "updated": "2020-11-05T15:55:30Z",
  "author": "nick-pino",
  "summary": "Xbox One X is a premium 4K HDR console with a storage issue",
  "verdict": "The Xbox One X does what no console has done before: native 4K HDR gaming. However, while games look stunning – with a fantastic level of detail accentuated by the console's HDR support – their larger file sizes will mean that the 1TB hard drive fills up fast. Memory issues aside, the Xbox One X fulfills the promise of 4K HDR gaming and offers the most premium gaming experience on a console, bar none.",
  "pros": [
    "Native 4K HDR gaming",
    "4K Blu-ray player built-in",
    "Improves 1080p experience"
  ],
  "cons": [
    "1TB HDD fills up fast",
    "Games aren’t always 60fps",
    "Skewed price-performance ratio"
  ],
  "article": [
    "The Xbox One X is no longer going to be produced, Microsoft announced earlier this year. Instead, the company is going to focus its production efforts on the Xbox Series X, the next-generation console that's about to launch around the world on November 10.",
    "Despite the Xbox One X's end-of-life announcement, you'll probably be able to find the console on store shelves for a little while longer while retailers clear house (should they have any units left). There's really no reason to buy this over the Xbox Series S or X at this point, but if you are curious, the window is closing on being able to get hold of one brand new.",
    "With Xbox Series X right around the corner, is it worth buying an Xbox One X now?",
    "Well, not really, but that's not to say it's a bad console. As of right now, it's still the most powerful console in the world. And all of this power is worth it because it allows the Xbox One X to play some titles in native 4K resolution, sometimes even at 60 frames per second. The console is capable of HDR playback for games in the HDR10 format and supports Dolby Vision video streaming, too. For AV fans, this is the only platform where you'll find a 4K Blu-ray player built into the box and support for Dolby Atmos, a more immersive audio format than 7.1 surround sound.",
    "And yet, in spite of all of this, the Xbox One X is not perfect.",
    "The console's hard drive, which currently is locked at 1TB, fills up faster now that most games require 4K texture packs. And even though Xbox Game Pass is a winning service, Xbox still doesn't quite come out on top when it comes to exclusives. And best/worst of all, you get a lot of the same functionality from the Xbox One S which you'll find comes in at a much lower price point (again, though, you're better off looking at the newer machines if you want a future-proofed purchase).",
    "For a look at what comes in the box check out our unboxing video below.",
    "Still want to buy one of the older Xbox units? Read on for everything you need to know to make your choice.",
    "If you’ve seen an Xbox One S at some point, you should be able to picture the Xbox One X – if it weren’t for the difference in color schemes, the two consoles would be nearly identical. It's a design style that Microsoft has now left behind for the blockier Xbox Series X and Series S models.",
    "If you’ve never seen a One S before, the Xbox One X is a rectangular box the size of a large Blu-ray player that’s coated with a matte space grey color. It’s a far cry from the bulky VHS player-stylings of the original Xbox One, and the design only becomes more impressive when you consider what’s under the hood.",
    "The noticeable differences here between Microsoft's last console and its latest one (if you can even notice them) are the color change from the white sheen of the Xbox One S to the space grey of Xbox One X, and the shifting of the disc tray from the top-left side of the console’s face to sitting discreetly lower down the front.",
    "These changes are aesthetic, however, and neither add nor take away any functionality from the system... which isn’t a bad thing considering how well-equipped the Xbox One S was.",
    "The aforementioned disc tray not only plays Xbox One games, but 4K Blu-rays as well. This might sound sort of mundane if you’re not totally up-to-date on what 4K Blu-rays are, but considering that Microsoft’s 4K consoles are the only ones on the market with that ability, you can understand why it’s worth pointing out.",
    "Round the back the similarities to the One S continue. From left to right you’ve got a power connector, HDMI out, HDMI in, two USB ports, an IR out, an Optical Audio port and an Ethernet port. To the surprise of no one, the console does not see the return of the original Xbox One's Kinect port – if you haven’t heard, Kinect (Microsoft's motion-sensing camera) has been officially dead for a long time, and Microsoft has even stopped selling the adaptors that allowed it to work on modern consoles.",
    "Controller-wise the new machine is packing a darker gamepad which, for all intents and purposes, is exactly the same mechanically as the one that currently ships with the Xbox One S. You can't fix what isn't broken, apparently.",
    "If controllers are a bit too imprecise for your liking, Xbox One X does support keyboard and mouse controls for some games (Gears 5, The Sims 4 and Metro Exodus as a few examples). It's not the first console to do so (that award goes to the Dreamcast, and even the SNES had its own mouse), but the feature will be welcomed by gamers who prefer this more accurate and responsive control scheme.",
    "If you’re looking to see the real differences between the Xbox One X and every other console that’s come before it, all you’d need to do is open the lid. It goes without saying, though, that this is no longer the console you want if you're looking for a top-of-the-line machine in 2020.",
    "The console comes equipped with an eight-core CPU clocked at 2.3GHz, alongside 12GB of GDDR5 RAM. It features a GPU clocked at 1172MHz leaving the console with 6 teraflops of graphical computing power. The specs in the Xbox One X are pretty extensive, and helped usher in a new era of 4K HDR gaming in the living room that the Series S and Series X will continue.",
    "Unlike a video card’s dedicated VRAM, the Xbox One X’s 12GB of RAM is split between the system and the GPU (i.e. you wouldn't be comparing apples to apples). So you can definitely buy a gaming PC that's better than this – especially in 2020.",
    "On the CPU side, the Xbox One X is running a custom chip with eight Jaguar CPU cores clocked at 2.3GHz. That’s a 76% increase compared to the CPU inside the original Xbox One and Xbox One S, but probably only puts it in the ballpark of a current-gen Intel Core i3 processor (remember, however, that these numbers don’t translate to PCs very well).",
    "The more important comparison for the Xbox One X specs, and the one Microsoft would rather you focus on, is those of the PS4 Pro. Both were released midway through the last generation, and each aims for 4K gaming, so they are directly comparable.",
    "Sony’s system is a fairly competent competitor – its GPU has 36 compute units at 911Mhz that work in tandem with a 2.1GHz CPU and 8GB of GDDR5 memory. That memory runs into a bit of a bottleneck at the buffer, which is limited to 218GB/s, but it still puts out around 4 Tflops of performance. Point, Microsoft.",
    "Where the Xbox One X's specs falter is with the hard drive – a small 1TB drive that comes standard in every system. It’s also non-negotiable, since the Xbox One is being phased out, and no 2TB model had emerged.",
    "This wouldn’t be such a huge sticking point if we knew Microsoft wasn’t capable of installing larger hard drives in its systems, but the existence of the 2TB Xbox One S proves that it is indeed possible and Microsoft willingly chose not to include one here.",
    "Of course, what’s the end-goal of all this extra horsepower if not a better gaming experience? Thankfully here we’re happy to report that the Xbox One X performs exactly as advertised: Games look great across the board. Whether you’re using a 1080p TV with the Xbox One X or playing in 4K HDR, games look fantastic on the most powerful console of the last generation.",
    "But let’s break down each use case individually.",
    "If you’re a 1080p TV owner, the Xbox One X will do something called supersampling to create better-looking images. Supersampling is a complex term but the basic idea is that the game renders itself in 4K thinking it’s connected to a 4K screen, which means objects are rendered with four times the detail. All this data can’t be displayed, because at the end it’s still being shown on a 1080p TV with a set number of pixels on its display, but the resulting image is one that's more detail-rich.",
    "In practice that means images are going to look a bit sharper. Trees, branches and foliage in general won’t look so jagged, for example, and basic fog on an Xbox One might become thicker and more realistic while using an Xbox One X.",
    "Once you see a game running in 1080p with supersampling it’s very obvious that it looks better than a game running in standard 1080p. But if you’re not the kind of person who takes a minute to smell the roses in games – the kind who can appreciate a fine edge on a shrub or a rich, dense fog in the morning – then Xbox One X isn’t going to impress you.",
    "That is, unless you upgrade to a 4K HDR TV.",
    "On a 4K HDR TV, the Xbox One X unleashes its full power. Games render at up to native 4K, offering offer four times the detail of regular 1080p. Better still, some of those games will have a wider array of color options thanks to a technology called high dynamic range or HDR. Skies look bluer, grass looks greener and colors drip from every scene. The results speak for themselves.",
    "But visual upgrades aren’t the only type of upgrades the Xbox One X offers. The other is performance – i.e. the frames per second at which a game runs.",
    "We’ll save you another long-winded explanation on the subject, but the basic idea here is that when scenes become really detail-rich and filled with a vast number of objects, the console becomes overwhelmed. Instead of being able to output, say, 60 frames per second, it drops down to 55 or even less. It was a big problem on the original Xbox One, but one that the Xbox One S seemed to do away with under all but the most extreme circumstances.",
    "Xbox One X tries its best to output games at 60 frames per second, a sort of golden number for the industry that matches the native refresh rate of most TVs and mainstream monitors. And while the results are noticeably better on Xbox One X, games still don’t always hit that 60 frames per second number – there are occasional dropped frames and slow downs.",
    "So what are you to make of all this? Well, Enhanced for Xbox games do look better on an Xbox One X console, whether you’re connected to a 1080p TV or not. Performance, also, is generally great on the console. Games don’t run at a perfect 60 frames per second like you’ll find on mid- to high-end gaming PCs, but most of the time it’s great.",
    "This is why, really, you should consider a newer console like the Xbox Series S and Series X in 2020.",
    "OK, Enhanced for Xbox One X games look great and play great. But what exactly makes a game Enhanced for Xbox One X? How many of these games are there?",
    "Microsoft itself hasn't set a minimum standard for what constitutes an Enhanced for Xbox One X title but there are three broad categories that developers are using: enhanced 4K visual assets, HDR visual processing or higher frame rate. And just one of three will suffice.",
    "To that point, it’s possible for a game to offer HDR or a 60 frames-per-second framerate, but not native 4K and vice versa. Developers can pick and choose which enhancements make sense for their games and roll with it.",
    "To make matters all the more complicated, Microsoft’s Xbox Chief, Phil Spencer, has gone on record saying that new games aren’t necessarily required to support the new hardware, i.e. there was no mandate for developers to take advantage of the Xbox One X’s capabilities.",
    "All of this would be more upsetting if developers didn't embrace the Xbox One X like they have - but, thankfully, that hasn't happened. These days, most games that are released have an Enhanced version associated with them. And that means there's plenty to play on your Xbox One X.",
    "Before we close out the review, we thought it'd be a good idea to examine the interface for the Xbox One.",
    "The Xbox One interface was previously a sort of mash-up of the Xbox 360 blade design and the Windows 10 block-and-pin-heavy design. The latter still applies as of its 2020 update, and it makes navigating between games and apps reasonably straightforward.",
    "One of its most unique features is turning the idea of pins – games or apps that you are really attached to – into full rows on the Home screen. This row might call attention to DLC, note how close you are to a particular achievement, or mention something else that's relevant to you. It’s a novel way to keep you thinking about a game long after you quit out and something we found ourselves appreciating every time we saw it.",
    "Coming into this final review we had some concerns. We thought Microsoft’s most premium console yet might not provide anything of value to the 1080p TV owners out there. We felt that its performance, however good, might not be able to justify its price. And we were scared that games might not get patches for long stretches of time, leaving Xbox One X owners without way of showcasing their hardware. On all accounts, we were wrong.",
    "As it turns out, the Xbox One X is a premium console through and through.",
    "Sure, you might need a discerning eye to spot the differences between supersampled games in 1080p and games played in 1080p on the original Xbox One, but there is a difference. With 4K HDR gaming, however, the proof is in the pudding so to speak. When hooked up to a decent 4K HDR screen, the console plays games at an astoundingly high level of detail. Throw on a 4K Blu-ray with Dolby Atmos sound, and you’ll be treated to the best cinematic experience this side of movie theater.",
    "For its time, the Xbox One X was the pinnacle of console gaming. Now, with the release of the Xbox Series X, that's no longer the case – but it's still no slouch.",
    "But while the Xbox One X has claimed the top spot during its generation, its closest competitors – the PlayStation 4 Pro and Xbox One S – aren’t far behind.",
    "Despite not being able to play games in native 4K, these consoles are around half the price and look nearly as good. Their better balance between affordability and performance will make them a better pick for the vast majority of gamers out there, save for the few who see and appreciate the minor differences in premium, high-octane video quality and lower grade, but-still-awesome upscaled 4K.",
    "Even if neither of these consoles had never existed, however, the Xbox One X wouldn’t be flawless. Its 1TB hard drive could theoretically fill up almost overnight thanks to 100GB-plus downloads for games like Gears of War 4, Forza Motorsport 7 and Quantum Break, if it weren’t for the fact that these massive games will take several hours to download. Microsoft could fix this down the road with a larger size hard drive but, as it stands right now, the world’s most premium console can only store around 10 triple-A games at a time.",
    "At the start of this review, we said there was a specific type of gamer the Xbox One X's sheer horsepower was designed for. Having read through our review, you're best placed to decide whether or not that gamer is you – or, to put it another way, whether you think you'd appreciate and make use of the extra processing heft and graphical improvements the Xbox One X offers.",
    "The Xbox One X is still a fine machine in its own right, then, but there's no real reason to buy one over an Xbox Series X now if power is what you're after – unless you can find the older console at a deep discount, as the generations change over.",
    "Ultimately, the Xbox One X shows that Microsoft had gotten back on track after the original Xbox One launch. But now, with more powerful machines on the market, it's been surpassed if you want a console that's going to last the distance.",
    "Original review published at 12:01 PST on November 3, 2017. Jon Porter contributed to this review."
  ],
  "headers": {
    "8": "Xbox One X design",
    "16": "Xbox One X hardware specs",
    "24": "Xbox One X game performance and library",
    "41": "Xbox One X interface",
    "44": "We liked",
    "48": "We disliked",
    "51": "Xbox One X final verdict"
  },
  "links": {
    "no longer going to be produced": "https://www.techradar.com/news/xbox-one-x-discontinued-ahead-of-xbox-series-x-release-reports-claim",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "4K resolution": "https://vanilla.tools/techradar/articles/y",
    "HDR playback": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "4K Blu-ray player": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox One S": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "has been officially dead": "https://www.techradar.com/news/microsoft-has-put-the-final-nail-in-the-kinects-coffin",
    "stopped selling the adaptors": "https://www.techradar.com/news/microsoft-has-stopped-selling-the-kinect-adaptor",
    "Dreamcast": "http://www.racketboy.com/retro/dreamcast-keyboard-mouse-be-prepared"
  }
}