{
  "source": "https://www.techradar.com/reviews/salto",
  "title": "Salto access control system review",
  "category": "computing",
  "updated": "2020-10-08T18:20:16Z",
  "author": "jonas-p-demuro",
  "summary": "Inspired access",
  "verdict": "Salto offers a comprehensive suite of hardware, focusing on locks, for deployment of an access control system in your facility, but the limited support and opaque pricing leaves us considering other options.",
  "pros": [
    "Online training options",
    "Wireless deployment",
    "Expansive hardware offerings"
  ],
  "cons": [
    "Opaque pricing",
    "Limited contact options",
    "Poor support in user reviews",
    "Proprietary locks only"
  ],
  "article": [
    "No newcomers to the access control segment, Salto started doing this back in 2001. Its goal was a simple one: to offer a great access control system, with an eye towards simplicity and efficiency, that could be completely controlled, without complicated wiring, and rather to be completely wireless. This resulted in the breakthrough SVN platform, a totally battery powered platform electronic lock for the access control market. Today, Salto is considered one of the top five manufacturers of access control systems with over 275 employees.",
    "Salto has grown through the years, with additional innovations such as the XS4 platform that can not only secure every opening in a facility, but also monitor each user.",
    "Salto is headquartered in the European Union, more specifically in San Sebastian, Pais Vasco, Spain. It has offices worldwide, including in Norcross, Georgia in the US, and Southam, Warwickshire in the UK. In general, it appears that Salto has more of a European focus, than for North America.",
    "The company continues to focus on R&D with over 30 employees devoted to further innovation. It also gives back with social responsibility, with its support of free2move.org, which fosters participation of people with disabilities in sports.",
    "Salto access control solutions has an entire range of products to build out a system for controlling access to a facility. It is highly scalable, and can cover needs ranging from a single entry point (although there is a server issue with a smaller setup- see below), to an entire building. It can provide all the needed hardware, from card readers, to wall readers and the RFID badges to open the entries. Furthermore, Salto offers a full range of door handles and locks, along with door strikes, and can also accommodate more complicated needs such as panic hardware.",
    "Of note, as Salto is in multiple markets, there are different locks that vary in different countries. A limitation of the Salto system is that it only works with the proprietary locks that Salto sells. Some of its access control competition can use locks that support an open standard, and then can work with different manufacturers. Unfortunately, with the Salto approach, you get locked into the locks of a single vendor, namely Salto.",
    "In a differentiating point from its competitors, Salto is based around wireless technology. Of course there are advantages to this, such as a potentially less expensive deployment, that can be done with ease, as there is no reason to run any wires that can be disruptive to operations. However, as any networking expert will tell you, while it may be harder to install, it is hard to beat the reliability, and the security, of a physically wired connection.",
    "Salto also takes a different approach with how its system gets controlled. Some modern access control systems can be totally controlled via the cloud, with essentially everything going to an offsite server. Rather, Salto has the requirement of a local server, to connect all the devices in a facility. The local server requirement can be less attractive to some that do not wish to maintain their own server hardware, and can also raise the upfront costs substantially for a smaller system.",
    "Another issue is the wireless communication between the locks and the server. Some locks communicate via an open, standardized protocol. This can have the advantage that locks from different manufacturers can be mixed and matched as needed for the specific situation. Salto uses a proprietary protocol, which can offer a higher level of security, but the downside is that it locks you into its devices only for compatibility.",
    "Support for Salto is limited. There is no direct support area of the Salto website, and a search for it on the US site did not find anything.",
    "Under ‘Contact Us,’ there is information on how to get in touch with the office located in your country. For the US, it then provides the corporate address in Georgia, with a direct phone number, a toll free number and a fax number. Missing are both an email address, an online portal, and a chat function.",
    "Training is more robust than the support. There is an online library of recorded videos on topics that range from “SALTO Keys as a Service (KS): The smart lock solution for your business,” “Deliver the tenant experience all tenants want with wire-free locks,” and “For Healthcare, Access Control is much more than security and mechanical key replacement.” There are also weekly live webinars that you can sign up for, the upcoming one is on “Cloud Based Access Control for Your Business.”",
    "A limitation is that Salto does not provide any pricing on its website. We find this unfortunate as it requires company contact for a custom quote to get any pricing.",
    "The published reviews for Salto in the US are quite limited. On one site, with a hotel deployment, users had a mixed experience. While the product did get recommended by some, others described premature failures of multiple locks in less than a year, and the company wanting to charge for replacements. Furthermore, what is concerning are the multiple reports that the vendor support was lacking.",
    "Salto access control is a bit of a mixed bag. We certainly like the expansive hardware catalog, and the wireless deployment for cost savings. However, the proprietary communication protocol, the limited support, the local server requirement, and the opaque pricing leave us looking at other solutions. Users should carefully consider if Salto meets their needs before committing to this solution for an access control system."
  ],
  "headers": {
    "4": "Features",
    "9": "Support",
    "12": "Pricing",
    "13": "Reviews",
    "14": "Final verdict"
  },
  "links": {
    "access control": "https://www.techradar.com/news/best-access-control-systems",
    "Salto": "https://www.saltosystems.com/en/",
    "one site": "https://hoteltechreport.com/guest-experience/keyless-entry/salto#:~:text=Ratings%20Snapshot,-Certificate%20of%20Excellence&text=In%20the%20last%2018%2Dmonths,is%20impacting%20their%20HT%20Score.&text=Salto%20has%20fewer%20than%2010%20reviews%20in%20the%20past%206%2Dmonths.&text=SALTO%20Systems's%20customer%20support%20processes,verified%20by%20Hotel%20Tech%20Report."
  }
}