{
  "source": "https://www.techradar.com/reviews/whoer",
  "title": "Whoer VPN review",
  "category": "computing",
  "updated": "2020-10-15T18:14:42Z",
  "author": "sead-fadilpasic",
  "summary": "Unblocks Netflix, but lacks a number of key features",
  "verdict": "Whoer may not offer plenty of features like some of its more famous contenders, but still provides a solid and secure anonymity service that will allow users to access geo-restricted content on their devices as well as get into some torrenting. Experts will certainly feel its lack of extras, but beginners might like this lack of additional features as it keeps the service simple and easy to navigate.",
  "pros": [
    "Unlocks Netflix and BBC iPlayer",
    "Simple to use",
    "Double VPN option",
    "VPN masking"
  ],
  "cons": [
    "Not many servers",
    "Short on features"
  ],
  "article": [
    "In this day and age, having a good VPN service is necessary to retain your privacy on the World Wide Web and experience the total freedom of information and entertainment, in spite of the ever-increasing restrictions on the kind of content that you can access in various regions.",
    "One of the platforms that makes all this possible is Whoer - a Cyprus-based VPN provider that has some strong privacy features, supports torrenting, and is capable of unlocking the well-known geo-blocked streaming channels and services.",
    "If you’d like to know which are today’s best VPN services, then check out our buying guide.",
    "Whoer’s services come in three packages, depending on the length of the subscription. The shortest is the 1-month option, at $9.90/month. It is followed by the 6-month subscription which entails a 35% discount and is paid $39.00 in a single payment ($6.50/month). The 1-year access will cost you even less in the long-term - $46.90 ($3.90/month), which is a 60% discount compared to the monthly subscription.",
    "If you’d rather try out the service first, there’s a free trial available, but it will only get you access to one server, and a very slow one - in the Netherlands. Specifically, the speed of the trial server is officially limited to up to 1Mbps, as the provider states this on its free trial page (and confirmed in our testing).",
    "This is far from ideal if your biggest concern is speed and you want to check how the provider performs in this area. There’s also a 30-day money-back guarantee, but the small print says there has to be an actual problem with the service for the company to grant you a refund. This is a lot different from the no-questions-asked policy by some other providers, but it’s better than nothing.",
    "To sign up for a free trial, you’ll only need to give the company your email address and you’ll receive the access code shortly. Should you decide to pay for the full service under any of the three pricing packages, you’ll find the process similar and exceptionally simple.",
    "Just pick out the plan on the website, type in your email address, a promo code if you have it, choose your preferred payment method - credit card, cryptocurrency, electronic currency, or PayPal, and finalize the payment. The next step is to enter the passcode you’ll receive from the provider, and you’re all set.",
    "Whoer has servers in only 17 locations. We’re never told how many servers there are exactly, but since it’s hiding this information, it’s safe to assume there aren’t a lot.",
    "This is why some of the more demanding users may like NordVPN, ExpressVPN, or Surfshark better, considering they have thousands of servers in hundreds of locations all over the world and are very transparent about them. They’ve even opened their doors to outside auditors to confirm they have nothing to hide and are devoted to their users’ privacy. CyberGhost is another great choice to consider, as it has recently upped its server count to a staggering 6,240+.",
    "Unblocking top streaming services like Netflix and BBC iPlayer in areas where they aren’t available is a sought-after feature in the VPN industry, and Whoer excels in this matter. Not only will it allow you to watch your favourite content on Netflix and BBC iPlayer, but you’ll also be able to do that on Hulu, Amazon Prime Video, and TalkTalk TV Store.",
    "Whoer is operated by WHOIX Ltd., a company registered in Lefkosia, Cyprus. It has an undisclosed number of servers scattered across 17 countries such as Russia, Singapore, Hong Kong, Turkey, Ukraine, and Poland.",
    "The Windows and Mac clients include app startup settings, updates control, a kill switch, an option to choose whether you want the app to use UDP instead of TCP (as UDP is faster), and one interesting tool - VPN connection hiding, which masks your VPN connection as a regular home or mobile connection, helpful in restrictive countries that block VPNs. The iOS and Android apps have fewer settings, including startup settings, traffic compression, and a handy speed test. You will even be able to share large files via P2P, although not on all of the servers.",
    "The privacy of your sensitive information and identity is secured with the use of regular and double VPN protection that uses two different encryption points to increase your level of anonymity and make it more difficult for third parties to spy on you. It also deploys the UDP and TCP protocols.",
    "Whoer uses protection against DNS and IP leaks to guarantee anonymity and security. For even more protection, you can enable a kill switch in the desktop apps. This mechanism will step in whenever the VPN connection is interrupted, effectively blocking your entire Internet access and preventing any of your information from leaking into wrong hands.",
    "According to the provider’s privacy policy, it doesn’t collect, store, or log your IP address, DNS requests, which apps or online services you use or the websites you visit. It only collects your personal data when you access the websites or services related to Whoer VPN or contact the provider regarding its services. Additionally, it will collect service data from its VPN clients, including OS version and Whoer VPN version, but this can’t be used to uncover what you’re using the VPN service for.",
    "This all sounds great, but we have no way to confirm this policy as there hasn’t been an outside audit yet. Some competitors have started to bring in independent auditors to examine their clients and give reports on adherence to the privacy and no-logs policies, and it would be beneficial for Whoer VPN to do the same.",
    "Whoer offers apps for all the major platforms and browsers. So you’ll be able to install it on Windows, Mac, Linux, Android, iOS, Mozilla, Chrome, and Opera, as well as use it on five devices simultaneously with just one account. Additionally, you can manually install the platform on a supported router, with some help from Whoer. This will allow you to expand the coverage beyond the five-device limit and protect each and every device connected to the network.",
    "All the apps can be downloaded from the website or the appropriate app stores which the website directs you to. Each has its own page where you’ll find detailed, step-by-step setup instructions, all accompanied by pictures for better understanding.",
    "That said, you probably won’t even need to look at the instructions as the installation process is as simple and intuitive as they come. Same goes for the interface which is small, sleek, and only has basic options.",
    "If you need assistance with anything related to the VPN service, online support is available in the form of live chat on the website and email. Additional information can be found on the provider’s blog and social media channels.",
    "Whoer’s Android app has been downloaded 5,000+ times and has received a rather poor score of only 3.3, as rated by 27 users. It was last updated on April 8, 2020. The rating is even worse on the iOS App Store - 1.0, although rated by only one user who complained that the app “keeps crashing”.",
    "We tested the provider’s Netherlands server and ended up disappointed - the speeds barely reached 1Mbps on our 50Mbps test connection. This, however, is because the Netherlands server is used as the trial server location and the provider throttles its use, whereas its other servers may perform better. While this makes sense, it doesn’t allow you to fully test the service, especially since the refunds are issued only if there is an unsolvable problem with the service.",
    "Whoer is a decent VPN provider that allows you to torrent, stream popular services, and do some good old-fashioned browsing, all under its robust privacy protection.",
    "Aside from the handy Double VPN and VPN hiding on its desktop clients, it doesn’t have lots of features and extras. This might bother some of the more experienced users, but beginners and more modest users might find this quite suitable.",
    "Those who cannot disregard the lack of features and servers, should instead try out a better solution, such as ExpressVPN, the best VPN on the market which excels in every part of its service and satisfies even the most demanding of users."
  ],
  "headers": {
    "3": "Price",
    "8": "Alternatives",
    "10": "Streaming",
    "11": "About the company",
    "12": "Privacy and encryption",
    "17": "Support",
    "22": "Speed and experience",
    "23": "Verdict"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Whoer": "https://whoer.net/",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "help": "https://whoer.net/blog/configuring-vpn-on-router/",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-7209759291475556000"
  }
}