{
  "source": "https://www.techradar.com/reviews/anonymousvpn",
  "title": "AnonymousVPN review",
  "category": "computing",
  "updated": "2020-10-28T18:10:11Z",
  "author": "sead-fadilpasic",
  "summary": "Competent but way too expensive",
  "verdict": "AnonymousVPN does what it’s supposed to - offering reliable and secure connections without terrible speed losses on most locations, as well as intuitive and straightforward apps anyone can use. That said, the service is grossly overpriced since its server network is very small, accepted payment methods limited, customer support slow, and there’s no app for iOS.",
  "pros": [
    "User-friendly apps",
    "Reliable connections"
  ],
  "cons": [
    "Expensive",
    "Cannot unblock Netflix, BBC iPlayer",
    "Not many servers",
    "Only accepts credit cards",
    "No iOS apps",
    "Its ‘trial’ is paid"
  ],
  "article": [
    "AnonymousVPN is a small VPN service that is shy when it comes to describing its platform and features on the website, so you have to pull the information out of its customer support agents.",
    "Despite being so mysterious, it has some good features to offer, like connection reliability, industry-standard security, and user-friendly apps.",
    "However, its price might be a turn-off, especially since the platform isn’t as good as many other VPNs that cost the same or are even cheaper. In addition to charging for its trial, the only accepted payment method is credit/debit card, it only has 25 servers, and can’t unblock popular streaming services.",
    "Instead, you might want to check out other products among today’s best VPN services.",
    "If you’d like to purchase this provider’s services, three options are at your disposal. There’s the annual subscription at the price of $99/year (equal to $8.25/month), monthly at $12/month, and some sort of a trial that costs $1 for the first three days, after which a $99/year subscription follows automatically.",
    "AnonymousVPN doesn’t restrict the number of devices or connections you run simultaneously using your subscription. Nevertheless, it reserves “the right to restrict to 3 simultaneous connections for one subscription if we see that our servers are overloaded, so all our users will be able to enjoy our protection.”",
    "If you end up disappointed with the service and you’d like to get a refund, you only need to email the customer support, but “no later than 14 days from the date on which you purchased the subscription”.",
    "There are also other conditions you’ll need to meet to get a refund, such as not having established more than 100 VPN connections, that your bandwidth usage was less than 500MB, and that it is your first time ordering AnonymousVPN’s services.",
    "Also, no refunds are offered for the 3-day trial - only for the subscriptions.",
    "AnonymousVPN may look great at first, but once you start digging, you’ll notice that it has some disadvantages that make other, bigger names in the industry more appealing",
    "Take NordVPN, CyberGhost and Surfshark - all of them cost less than AnonymousVPN and boasts thousands more servers.",
    "Being able to access geographically blocked streaming services like Netflix, BBC iPlayer, etc. is a feature many users hold in high regard when picking out a VPN service. Unfortunately, AnonymousVPN has no capabilities to provide access to these services.",
    "AnonymousVPN is owned by the company called Gate 100, which is located in Gibraltar. The vendor doesn’t have many servers - only 25, to be precise - in countries like Singapore, Russia, South Africa, Latvia, and others.",
    "All of the provider’s servers are P2P-friendly and support anonymous torrenting.",
    "There aren’t many details about the tools it deploys to ensure your anonymity, except one FAQ article where it explains the difference between PPTP, L2TP, and OpenVPN protocols. Presumably, these protocols are used by AnonymousVPN, along with 128-bit (for PPTP) and 256-bit encryption (for L2TP and OpenVPN).",
    "AnonymousVPN also deploys the industry-standard kill switch, a mechanism that is activated whenever your VPN connection drops, blocking your entire internet access to prevent the leaking of your original IP address.",
    "The privacy policy states that AnonymousVPN doesn’t collect “any kind of VPN activity logs, browsing behavior or any activity related to your VPN connection - hence, we DO NOT store details of, or monitor the data sent over our network or websites you log into while using our VPN Services. Which also means that this information is not available for us to share with anyone if anyone wants to revoke our users’ right to privacy”.",
    "The only thing that is collected is “data about a choice of server location, times when our VPN Services was used by user and amount of data transferred by one user in one day.”",
    "This sounds pretty good, but it would be better if the provider had enlisted an independent auditor to examine its platform and confirm the no-logging claims.",
    "AnonymousVPN’s user-friendly VPN clients can be downloaded from the website for Windows, Mac, and Android.",
    "Other devices and platforms, like Linux, iOS, or routers can be protected with the help of third-party software and configuration files.",
    "The app for Android has been installed over 10,000 times and is rated 2.8 (out of 5) by 126 people. It was last updated on February 25, 2020.",
    "If you run into any problems while using the platform, there’s a solid collection of FAQ and troubleshooting articles, along with setup manuals, that you’ll be able to consult. It’s not as rich as some other knowledge base/help centers we’ve seen but still addresses some essential issues.",
    "Should you want to talk to someone on the support team, you can do so by opening a ticket or sending an email. That said, we asked some general questions about the service via email but never got a response. We did, however, receive a speedy response when we asked for the account cancellation and refund.",
    "We had no problem installing and using the AnonymousVPN Windows app. Connecting worked without a hitch, and we only had a bone to pick with server switching.",
    "Namely, to switch servers you first need to disconnect from the active one, then select another and click ‘Connect’. Also, you can’t see which server exactly has been selected for you automatically until you check the IP.",
    "Our testing started with the automatically selected server, which we identified as being in Russia through an IP lookup. This server delivered a download speed of a solid (yet mediocre in comparison to some) 20.43Mbps on a 72.66Mbps test connection.",
    "We then connected to a server in the US, which gave us 9.34Mbps - a lot slower but still manageable - then finally, it was a turn for a more exotic location: Vietnam. Connecting to a server there expectedly delivered a much lower speed but way lower than we had anticipated - a measly 0.34Mbps.",
    "AnonymousVPN connects easily and without any hiccups, providing its users with a straightforward and reliable service.",
    "However, it is a rather average platform in most areas - download speeds, features, server network, and supported platform range. Considering this, and the fact that the price is exorbitant for what it offers, we recommend opting for a much better solution such as ExpressVPN."
  ],
  "headers": {
    "4": "Price",
    "9": "Alternatives",
    "11": "Streaming",
    "12": "About the company",
    "13": "Privacy and encryption",
    "19": "Support",
    "24": "Speed and experience",
    "28": "Verdict"
  },
  "links": {
    "AnonymousVPN": "https://www.anonymousvpn.org/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "such as ExpressVPN": "https://xvtelink.com/techradar?offer=3monthsfree&a_fid=744&data1=trd-us-2874456775539895300"
  }
}