{
  "source": "https://www.techradar.com/reviews/pandapow-vpn",
  "title": "PandaPow VPN review",
  "category": "computing",
  "updated": "2020-12-10T17:44:03Z",
  "author": "sead-fadilpasic",
  "summary": "Fast when it manages to connect",
  "verdict": "PandaPow can unblock some geo-restricted content - and does so with some impressive download speeds. However, you may have a hard time connecting to some server locations and the provider will also collect your IP address.",
  "pros": [
    "Unblocks some VOD content",
    "Excellent speeds on most (working) servers"
  ],
  "cons": [
    "Logs your IP address",
    "Expensive long-term subscriptions",
    "Small server network"
  ],
  "article": [
    "PandaPow is a small, multi-platform provider of VPN services that aims to offer quick and easy access to online anonymity and geo-restricted content.",
    "You can choose among three subscriptions of different lengths. The shortest one is the 1-month subscription, which costs $9.00, then the 3-month option at $24 (or $8.00/month) and the 12-month plan at $84 (or $7.00/month), which is rather expensive. Under one account, you can run up to 3 simultaneous VPN connections.",
    "When paying for the service, you can select whether you want to be charged automatically every term or make it a one-time payment only. This is a very practical option for anyone who wants to have more control over their payments, and something not many VPNs offer.",
    "There’s no free trial on the table, at least not in the traditional sense. There is, however, a risk-free, no-questions-asked 7-day money-back guarantee that aims to give you a taste of the service.",
    "Do note that refunds for purchases made through the Apple App Store need to be requested there and the result depends on Apple’s refund policies.",
    "Supported payment methods include credit/debit cards, PayPal, WeChat, Alipay, UnionPay, and Tempay.com.",
    "PandaPow also offers PandaPow WiFi, a small VPN router device that connects all of your devices on the provider’s network, for $99/year.",
    "While PandaPow is a good VPN solution, it is still far inferior to the likes of ExpressVPN, while costing approximately the same where long-term subscriptions are concerned.",
    "If you don’t feel like paying that much but you still want an advanced service, you can pick one of the other major players in the VPN field, like NordVPN, Surfshark, or CyberGhost, all of which have thousands of servers and connect to each of them quickly and effortlessly.",
    "Being able to provide customers with access to geographically restricted streaming services like Netflix or BBC iPlayer has become a highly sought-after feature in the VPN industry.",
    "PandaPow is capable of providing access to these services, although as we are told, “some services are only available from specific server regions”. For instance, Netflix is only working on the provider’s servers in Hong Kong.",
    "PandaPow VPN is a trademark of DoEnter Ltd., a company with headquarters in Hong Kong. Through its VPN service, this company enables access to 120+ VPN servers with around 150 IP addresses in 16 countries, including India, Russia, Thailand, Hong Kong, Canada, and others.",
    "To ensure the privacy and safety of your data, PandaPow’s apps use the standard OpenVPN (UDP or TCP) protocol, but you can also set up the service manually via PPTP or L2TP/IPSec. The provider deploys SSL and TLS 2048-bit encryption.",
    "Torrenting is safe and supported, but the provider recommends its servers in Asia for such purposes.",
    "In the Privacy Policy, users are informed that PandaPow may store their IP address, connection timestamps, the total amount of data transferred, as well as transfer speed. The provider’s logic behind keeping this information is that so it can provide the best possible service. To us, it seems like the IP address logging is a bit much and we aren’t told for how long this information is retained.",
    "PandaPow has easy-to-use apps for Windows, Mac, Android, iPhone, and iPad, in addition to supporting other platforms like Linux, Chromebook, and Blackberry, through manual installation.",
    "The iOS app has a rating of 5 stars (out of 5) although only 2 users have rated it so far. It was last updated on October 9, 2019, with a fix of an issue with iOS 13. On the other hand, the PandaPow Android app was rated by 151 users and has 3.5 stars. It was installed by 10,000+ users and last updated on October 27, 2019.",
    "Help, if needed, is available in the provider’s Troubleshooting Guide, FAQ section, as well as a Getting Started Guide where you’ll find everything you need to know about installing and using the service on various supported platforms. There’s also a large How To section where you can find all available information on the platform, including the information from other customer support sections on the website.",
    "If you want to establish direct contact with the provider’s customer service agents, you can do so by email or online chat, and there’s even phone support that is available during Hong Kong business hours.",
    "Do note that there seem to be two email addresses listed on the website, one that ends in .co and the other one that ends in .io. The welcoming email message came from the .co address. We sent an email to both but received our response from an agent’s Gmail address, rather quickly.",
    "Installing and using the service was simple, but we did encounter some connectivity problems while testing the provider’s download speeds on a 50Mbps testing connection.",
    "We opened our testing with a server based in Amsterdam, but the VPN wouldn’t connect at all. Specifically, it got stuck in a never-ending “connecting” loop. After we gave up on waiting, we decided it was time to give Stockholm a chance, but encountered an error message telling us to try a server somewhere else.",
    "Finally, we managed to connect to a server in Frankfurt which, considering the previous failures at connecting at all, delivered some very impressive results: 20Mbps.",
    "We then moved to North America, failing to connect to a server in New York, but the server in Seattle gave us a solid 9Mbps.",
    "Although the above speeds are considered very good, they weren’t quite as strong when we turned to the Far East, where Tokyo gave us a measly 500Kbps. This may be expected for a location so far away from our own, but we did manage to get better results from the same distance with some other VPNs.",
    "PandaPow is a decent provider with some very good speeds, support for torrenting, content unblocking capabilities and a 7-day refund policy that acts as a free trial.",
    "That said, it has some issues that hold it back, such as IP logging, small server count, high prices and connectivity problems."
  ],
  "headers": {
    "1": "Price",
    "7": "Alternatives",
    "9": "Streaming",
    "11": "About the company",
    "12": "Privacy and encryption",
    "15": "Support",
    "20": "Speed and experience",
    "25": "Verdict"
  },
  "links": {
    "PandaPow": "https://pandapow.io/",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "NordVPN": "https://www.techradar.com/reviews/nordvpn",
    "Surfshark": "https://www.techradar.com/reviews/surfshark",
    "CyberGhost": "https://www.techradar.com/reviews/cyberghost-vpn",
    "Privacy Policy": "https://pandapow.io/privacy/",
    "iOS app": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8994115967608274000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Fpandapow-vpn%2Fid1128648317",
    "Android app": "https://play.google.com/store/apps/details?id=org.pandapow.vpn&hl=en",
    "Troubleshooting Guide": "https://pandapow.io/trouble-shooting/",
    "FAQ section": "https://pandapow.io/faq/",
    "Getting Started Guide": "https://pandapow.io/getting-started-guide/",
    "How To": "https://pandapow.io/how-to/",
    "email": "mailto:support@pandapow.co"
  }
}