{
  "source": "https://www.techradar.com/reviews/dental-intelligence",
  "title": "Dental Intelligence review",
  "category": "computing",
  "updated": "2020-10-27T18:14:22Z",
  "author": "jonas-p-demuro",
  "summary": "The smart software built for dentists",
  "verdict": "Dental Intelligence offers plenty of next generation features to support a busy dental practice, but we are frustrated by the high pricing that is too opaque.",
  "pros": [
    "Choice of support methods",
    "Mobile app availability",
    "Real time data analysis"
  ],
  "cons": [
    "Expensive",
    "Startup fee",
    "No refunds on cancellation"
  ],
  "article": [
    "Dental Intelligence, based in American Fork, Utah is “On a mission to change lives,” via its dental practice management software. For over a decade, with real time data tracking and analysis, the goal has been to give dental practices a transparent look into how to maximize their practice’s revenue. It is currently used by over 4,000 dental practices, with 50,000 team member users, that serve over 11 million patients.",
    "While many dental practice management products promise to streamline operations, Dental Intelligence goes beyond the essential pieces of scheduling applications, and electronic billing.",
    "One example of this is what is dubbed ‘Call Intel,’ or more descriptively, the ‘Smart Caller ID.’ In a typical dental office, the front office answers the phone all day with the pedestrian “Dental Office,” of just the dentist’s name. Rather, with Call Intel, the Dental Intelligence software gets integrated with the incoming phone line, and can input the caller ID for incoming calls. This then displays useful information as the call is answered, via an instant on-screen popup, that includes the caller, the treatment needed, past due balances, and other information. Therefore, the front office can now answer the phone as “Hello Ms Smith, let’s get you scheduled for your next cavity to be filled” encouraging increased production by identifying missed revenue opportunities literally as fast as phone calls are coming in.",
    "It’s one thing to have data analysis, but the key for it to be useful is for it to be real time, and actionable. After all, why find out at the end of the month or quarter that volumes are down, or that there were a bunch of missed opportunities to increase income? Dental Intelligence answers that challenge with a feature called the ‘Morning Huddle.’ In just a few minutes, and without any report to run, Dental Intelligence can provide tons of useful information about yesterday, today, tomorrow, and even next week. It gives each team member a clear plan with concise and trackable goals for the day, and also can metric the performance of the team and how the plans are progressing.",
    "A challenge to both the front and back office of any dental practice are the follow ups. You know, the patients that are told to return in six months for their next visit, and never return? Well we can toss the plan of filling out postcards, and sending them out in favor of an internet solution. With Dental Intelligence, the software can create “Auto-generated call lists for appointment confirmations, hygiene recare, unscheduled treatment, and collections,” so those patients do not get lost to followup, and the care they need is provided by your practice.",
    "Just like any other service, not everyone is fully satisfied with all the aspects of Dental Intelligence.",
    "While Dental Intelligence does at least offer mobile apps, on the Android side of things, there is a report that the app does not open, and that the issue has not been addressed after some time. Over on iOS, things are similar, with Dental Intelligence garnering 3.8/5 stars with complaints ranging from that the app does not work, to that the app won’t login, and that it is not compatible with the latest version of iOS.",
    "Some users report success with the software, but a minority are frustrated to the Nth degree with Dental Intelligence. Searching the Facebook reviews finds more than one practice with a lack of satisfaction from the software, and they are further irked by the difficult cancellation policy (see below), and even a cancellation fee. This was after months of promises to address issues that clearly were not resolved to the practice’s satisfaction as they then wanted to leave.",
    "Dental Intelligence offers a full spectrum of options to receive support. The first is over the phone, which offers a direct, toll free number. However, we will mention that the hours are limited to 6 AM to 6 PM on Mountain Standard Time, and additionally, it is for weekdays only.",
    "Rounding out the options, are also email, and chat. We do not find any onboarding materials available, such as videos, eBooks, or whitepapers.",
    "As is too common for the product segment of dental practice software, Dental Intelligence provides no pricing information on their site. Rather, company contact is required for a custom quote which goes under the nomenclature of a “Free practice analysis.”",
    "Perhaps the reason that the pricing is not forthcoming, is that the cost is expensive, and somewhat higher than some other competing solutions. We found elsewhere online that Dental Intelligence has a $1,000 (£810) setup fee, and then a monthly subscription of $499 (£404) per month, although we also see other prices online in the same ballpark so we surmise that other variables are involved, including the length of the contract, and also the number of dentists in the practice.",
    "Additionally, Dental Intelligence has a restrictive cancellation policy that states that “No refunds or credits for partial months, quarters or years of service will be refunded to a customer upon cancellation.”",
    "Dental Intelligence offers a comprehensive suite of features that go beyond the competition for managing a successful dental practice. The highs include mobile app support, automated follow ups, and real time data analysis. Drawbacks to mention are the opaque pricing, the high startup fee, and the limited hours of support. For practices seeking a higher level of success, Dental Intelligence is a reasonable choice, although it comes at a higher price than its competition."
  ],
  "headers": {
    "1": "Features",
    "5": "Drawbacks",
    "8": "Support",
    "10": "Pricing",
    "13": "Final verdict"
  },
  "links": {
    "Dental Intelligence": "https://www.dentalintel.com/",
    "dental practice management software": "https://www.techradar.com/best/best-dental-practice-management-software",
    "Morning Huddle": "https://www.dentalintel.com/product.php"
  }
}