{
  "source": "https://www.techradar.com/news/gta-trilogy-remaster-takes-one-step-closer-to-hitting-your-consoles",
  "title": "GTA trilogy remaster takes one step closer to hitting your consoles",
  "category": "gaming",
  "updated": "2021-10-01T07:52:30Z",
  "author": "gerald-lynch",
  "summary": "Pump that neon-soaked Vice City into my veins!",
  "article": [
    "It looks as if that Grand Theft Auto trilogy remaster is getting ever closer to becoming a reality. A new rating listing for for Grand Theft Auto: The Trilogy - The Definitive Edition has been spotted on Korea's game rating board's website, giving us the best indication yet that the re-releases are happening.",
    "The site offers a few details of the title, stating it is via an application for an age rating from Take Two interactive, for an action game developed in the United States.",
    "And, as expected for the criminally-inspired Grand Theft Auto series, it's been awarded an 18 rating, keeping it out of the hands of Korean minors upon its now-inevitable release.",
    "This latest sighting of Grand Theft Auto: The Trilogy - The Definitive Edition follows months of speculation, fuelled by publisher Take Two's legal battles to take down existing Grand Theft Auto mods.",
    "Can you believe it's been eight years since Grand Theft Auto V originally released? Still hugely popular, especially with its Grand Theft Auto Online component, it remains the biggest entertainment property of all time, across any media, with over 150 million copies shipped worldwide as of July 2021.",
    "But there's a sense that the goodwill towards the game is finally starting to run dry, and that fans want something new. Recent showings of the upcoming Grand Theft Auto V PS5 remaster (the third console generation that the game will find itself on) were met with indifference, as the game finally starts showing its age.",
    "With a true sequel, Grand Theft Auto 6, still yet to be revealed, developers Rockstar and publisher Take-Two needs an easy-ish win, and there are none perhaps easy than adding a fresh lick of paint to some of the most fondly-remembered games of all time – the original 3D Grand Theft Auto trilogy.",
    "GTA III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas, paved the way for the modern free-roaming, free wheeling GTA games that we now all know and love. But they originally launched way back in the PS2 era, and though PC, newer console and mobile ports have followed, they weren't massive overhauls of the original games.",
    "If Rockstar has put together updated and improved versions of these three classics, with features and graphics more in line with modern sensibilities and expectations, it could have another mega hit on its hands."
  ],
  "headers": {
    "4": "Analysis: A big score needed"
  },
  "links": {
    "Grand Theft Auto trilogy remaster": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "Grand Theft Auto V": "https://www.techradar.com/news/gaming/gta-5-review-cvg-gives-its-verdict-1181444",
    "Grand Theft Auto V PS5 remaster": "https://www.techradar.com/news/gta-5-ps5-xbox-series-x",
    "Grand Theft Auto 6": "https://www.techradar.com/news/gta-6-release-date-news-and-rumors-mapping-the-path-to-grand-theft-auto-6"
  }
}