{
  "source": "https://www.techradar.com/news/should-you-cancel-amazon-prime-video-in-2021",
  "title": "Should you cancel Amazon Prime Video in 2021?",
  "category": "entertainment",
  "updated": "2021-04-24T12:00:40Z",
  "author": "samuel-roberts",
  "summary": "Let's examine whether the service is still worth it",
  "article": [
    "In 2021, you might be looking to cut down your pile of subscription fees a bit, particularly for streaming services that are waging a giant content war for your bucks. A little while back, we answered the question of whether you should cancel Netflix in 2021. Now, we're asking the same question of Amazon Prime Video.",
    "Amazon Prime Video comes as part of Amazon Prime membership, which is what Amazon presents as the default tier in the UK (£7.99 / $7.99 CAD / €7.99 / AU$6.99 AUD, with a discounted yearly option). Really, whether you want Amazon Prime in 2021 is a larger question of how much you use the next day delivery, and benefits like Twitch Prime's free gaming goods, or the free books on Prime Reading alongside the streaming part of it.",
    "Since you can subscribe to Amazon Prime Video on its own in the US and UK, however – for $8.99/£5.99 per month – in this piece we'll treat it like a separate service so we can dial in on its specific value. We'll look at the service's originals, licensed content, app experience and optional extras.",
    "Let's get started.",
    "Historically, Amazon Prime Video originals don't feel like they've had the cultural cachet that Netflix's have – but there are outliers to that, and over time it's gotten better and better. Shows like Fleabag (an Amazon Original in the US), The Marvelous Mrs Maisel and The Boys have definitely broken out.",
    "Over the past year, we were particularly fond of the comedy Upload and the thoughtful (but underappreciated) sci-fi show Tales From The Loop. Amazon has continued to be the home for The Expanse, one of the most acclaimed sci-fi TV shows of all time. More recently, Invincible and Them show that it's become a pretty solid home for genre content. You can see why it's betting big in the future on shows like Fallout, or The Lord of the Rings.",
    "Amazon Prime Video acts as an exclusive distributor for different shows around the world – if you live outside the US, for example, shows like Picard and American Gods are Prime Originals. If you live in the US, meanwhile, it's acted as the co-producer of Steve McQueen's acclaimed series of Small Axe movies.",
    "It's also bet big on movies, landing the worldwide rights to Coming 2 America, and being the streaming home for Oscar nominee Sound of Metal. UK subscribers also got to enjoy the likes of Andy Samberg's Palm Springs and Hustlers as originals.",
    "Along with a rotating suite of licensed titles, the service ends being a really good all-rounder, and a solid alternative to Netflix – in the UK, Prime Video offers an archive of South Park shows, as well as Fox series like 24, The X-Files, Buffy and Prison Break (many of which now live on Disney Plus, too). At a glance, the US is no slouch with licensed titles, either, particularly on the movie side.",
    "Really, though, your regional experience could differ massively on this depending on Amazon's broader offering where you are. In the UK, though, we feel comfortably like the range of stuff here is worth having access to for the price.",
    "Content-wise, Amazon isn't shotgunning out originals like Netflix, then, and overall the slate of shows is not as exciting, but it's not hard to find something to watch.",
    "We wrote a fairly tough teardown of Amazon Prime Video's interface last year, and a lot of those same criticisms still apply – it still feels like a refit of Amazon's storefront in a lot of ways, though the 'Free To Me' tab helps make it easy to navigate to the content you don't have to pay extra for. The fact that individual seasons of shows are still listed separately does feel like an odd hangover of Amazon's primary purpose as a storefront.",
    "Even with 'Free to Me' in the navigation bar, Prime Video is still a little too thirsty to have you check out the latest deals on movies and what's going on with other channels that you have to pay extra for. Since so many titles have launched on VOD mid-pandemic, though, that having some visibility of new product isn't the worst thing in the world. It's maybe just a little too prominent.",
    "Generally speaking, Amazon's accessibility options are pretty solid, with customizable subtitle sizes and choices in color and background for legibility. Sometimes, though, at least in the UK, a film will strangely lack subtitles – Gangs of New York, for example, or Oliver Stone's JFK.",
    "Amazon is also pretty great at offering its originals in 4K, too, when Netflix charges extra for the experience, and flagging when it's supported with little box icons within the app.",
    "Netflix's app experience remains best in class – and Amazon's isn't perfect. But it's not such a major drawback that it truly affects whether the service is worth having or not.",
    "Prime Video Channels might be a bugbear for some users, because Amazon isn't shy about serving you content from these different paid extras. While the hard sell isn't necessarily the best, the way they give the platform flexibility is pretty good. If your device of choice lacks the Shudder or BFI Player apps, for example, accessing that content within Amazon Prime Video is rather handy.",
    "Still, if you'd rather have an all-in-one app experience, you're more likely to see these optional extras as another way to drain extra cash from your bank account each month. This is where Netflix still reigns supreme – once you're in, it doesn't try to sell you on anything other than continually using the service.",
    "If you can only pay for one streamer per month, Netflix is the one to keep, which probably isn't that surprising. But Amazon Prime Video definitely complements it in our streaming lives, with an array of big – not always great – originals, decent library content and the opportunity to plug in more content via channels.",
    "Sure, the user experience isn't the best, thanks to the store-like way the app displays content, and generally we think the service is best enjoyed as part of a wider Prime subscription than a standalone sub. But given the low price of entry, however you get it, we think it's worth keeping Amazon Prime Video in 2021 if you can reasonably afford it."
  ],
  "headers": {
    "4": "Amazon Prime Video Originals are a solid bunch – but it's no Netflix",
    "11": "Amazon Prime Video's app experience still needs work",
    "16": "Amazon Prime Video channels add flexibility – but they're sold too hard",
    "18": "Should you cancel Amazon Prime Video in 2021?"
  },
  "links": {
    "should cancel Netflix in 2021": "https://www.techradar.com/news/should-you-cancel-netflix-in-2021",
    "fairly tough teardown of Amazon Prime Video's interface": "https://www.techradar.com/news/everything-wrong-with-amazon-prime-video",
    "Prime Video Channels": "https://www.techradar.com/best/best-amazon-prime-video-channels"
  }
}