{
  "source": "https://www.techradar.com/news/what-is-crowdfunding-and-how-can-it-help-your-business",
  "title": "What is crowdfunding, and how can it help your business?",
  "category": "computing",
  "updated": "2021-08-31T12:30:38Z",
  "author": "techradar-pro",
  "summary": "Master the art of community fundraising",
  "article": [
    "All the best businesses begin with a brilliant idea, but many just stop there. Ideas remain ideas. This is unpleasant but understandable – moving from an epiphany in the shower to a fully-fledged product takes nerve, perseverance and plenty of cash to start the ball rolling.",
    "Securing finance has, of course, become a lot more difficult since the credit crunch. Previously, banks would lend money with comparative abandon. Today, they’re more reticent, despite government interventions and encouragement. There is, however, another way of raising cash to fuel your business dream: crowdfunding.",
    "You’ve probably heard the term and maybe even explored sites such as Kickstarter. If not, crowdfunding enables you to present your business plan to a potentially huge audience of internet users. If they like what they see, they may help you finance your dream. As you read on, we’ll explore crowdfunding.",
    "We’ll look at how and why it started, and how you can use crowdfunding in its many different forms to finance your new business. We’ll explore how to access the crowd correctly and how to ensure your project makes the best possible start. We’ll also look at how you can invest in other people’s dreams. So, come with us as we explore the crowdfunding revolution.",
    "Crowdfunding – the business of borrowing cash from a pool or crowd of investors – is big business. In a report, crowdexpert.com claimed that the global crowdfunding industry raised $34 billion of investment capital during 2015, with $6.8 billion of that in Europe. Globally, crowdfunding’s vital statistics are simply astounding. Reliable figures are hard to come by, but Kickstarter’s own metrics suggest its users had pledged $2,834,673,213 as we went to press. That’s just Kickstarter; many other platforms have risen since its inception.",
    "If you want further persuasion that crowdfunding is a sector you need to understand and watch, take the case of Elevation Lab. The company wanted to make docking stations for Apple devices. Don’t imagine some kind of piano-black Apple pastiche here, though. Think manufacturing processes that would make Rolls Royce blush and products that would make Jonathan Ive cry tears of joy.",
    "Elevation’s Kickstarter funding drive was allegedly the first individual campaign to reach the $1 million milestone. In all, it pulled in a total of $1,464,706 from Kickstarter investors. A few months later – in April 2012 – Pebble Technology, maker of boutique smartwatches, drew in $1 million of investment in just 28 hours. Overall, Pebble pulled in an amazing $10,266,845 of funding.",
    "In some regards, it’s easy to pass off crowdfunding as a reaction to, and a symptom of, a recession mindset. Crowdfunding is, however, much more than just a new wave of business people looking to circumvent tarnished banks, which have lost their nerve for investment. Indeed, students of crowdfunding’s history often point to the Statue of Liberty as an early example of gathering investment from the masses.",
    "Back in 1885, funding for the statue dried up and work stopped. Determined to help, Joseph Pulitzer – a journalist and publisher – announced a drive to raise $100,000 in New York’s World newspaper. Pulitzer promised to print the name of anyone who contributed money to the statue project, no matter how small their donation. Money flooded in, Pulitzer generated his $100,000 and work began once again.",
    "Beyond tapping a crowd of people for small sums in the hope of generating a big tranche of capital, Pulitzer’s initiative was prescient for another reason, too. He gave a gift to the contributors and this, as we shall see, is a cornerstone of the way crowdfunding works today.",
    "Drummond Gilbert, founder of the London-based goCarShare car-sharing site, recounts how he worked with the funding platform Seedrs to rev up his business.",
    "Let’s start easy: why don’t you introduce your business goCarShare and tell us what’s so special about it?",
    "I had the idea for goCarShare when I was walking down the street close to where I live in west London. I noticed a stationary traffic jam, and nearly every car had only one person in it, and the whole situation didn’t really make a huge amount of sense. It was at the beginning of the credit crunch, and I just felt that it was an opportunity to help people travel in a more cost-effective, sustainable way. Specifically, you could help people find other people who were heading the same way and allow them to choose who they traveled with based on Facebook information, such as musical taste or shared friends.",
    "Is there something special about your business that makes it perfect for crowdfunding?",
    "Our business is a community and a marketplace. For it to work well, it is all about getting as many people as possible to get involved. I think it helps that goCarShare is an exciting concept – it is using Facebook and it is an online solution to solve real-world problems, such as high travel costs, congestion and carbon emissions. With crowdfunding, we are getting lots of investors involved who will become active proponents of the business, and who will help the concept spread by word of mouth.",
    "How was the experience?",
    "It was an amazing feeling when we reached our target – we managed to get 145 different people to invest in the company, so it is great validation. We’ve also had a lot of people tweeting about us, and the press seem very interested, which is helpful for us getting the word out.",
    "What advice would you give to somebody with a great idea and a need for funding?",
    "Be ready for it to take much longer than you expect; a lot of people, myself included, underestimated the amount of time it takes to fundraise.",
    "It was, however, the growth of the internet that gave crowdfunding a proper jumpstart. Back in 1997 – at around the time Internet Explorer 4 arrived on the scene – fans of the prog rock group Marillion raised $60,000 so the band could record a new album. The campaign was a success, Marillion made their record and continued to tap their fans to help finance their future projects. Fast-forward to today and crowdfunding is growing at a huge rate.",
    "To find out more about the sector, we spoke with Julia Groves, managing director of the UK Crowdfunding Association. “The UK Crowdfunding Association is a trade association formed in 2012 by 12 of the leading UK crowdfunding platforms,” Groves explained.",
    "“Our mission is to promote crowdfunding as a viable and valuable way for UK businesses, projects and ventures to raise funds from the contributions of the people… At present, we have 24 members who are operating UK platforms, and 10 affiliated members, which are pre-operational.”",
    "As we spoke, she explained that crowdfunding is very much an umbrella term for four key types of cash-generating approaches. The first, she told us, is referred to as the donation model. Here, supporters simply give cash to a start-up and don’t have any expectation of a return. Just Giving’s crowdfunding pages are a prime example of this style of working.",
    "Next up, we have reward-based crowdfunding, where givers donate with the expectation of receiving something in return. This style of funding was embraced by David Braben, a man famous in computer gaming circles as the comaker of the 1980s classic space-trading game, Elite. In an effort to fund a remake of the game – Elite: Dangerous – Braben launched a Kickstarter campaign.",
    "A donation of £10 bought you a regular newsletter and updates on the project. If you gave £30, you’d receive a digital copy of the finished game. Contribute more and you’d get bigger and better returns. In all, the project pulled in over £1.5 million in donations, and Elite: Dangerous is now on sale, with several expansion packs available too. If you’re interested in this kind of funding, Groves pointed to Crowdfunder, Indiegogo and Hubbub as firms that you could explore.",
    "Next up is the loan or debt model. Here a business borrows its funding and promises to repay the money with interest. Abundance Generation, Funding Circle, Funding Empire, Money&Co and Trillion Fund offer start-ups access to this kind of funding. The fourth type of crowdfunding is equity funding. Here, Groves told us, “Support is provided in return for an equity stake [or share] in the business.” Funding platforms such as Crowdcube, Seedrs, Angels Den and Syndicate Room embrace this kind of model.",
    "Choosing the correct crowdfunding platform can appear daunting, particularly when you add in another type of platform: hybrid. Here a funding platform might offer a mix of donation, gift, debt and equity-based deals. So, how do you pick the right fund for your business? Groves explained: “One of the real beauties of crowdfunding is that not only can you raise money but you can galvanize an army of ambassadors who will feel connected and part of your project. If you plan to operate your business in the UK, then having such a supporter base in the UK will probably better serve your needs than a US platform.”",
    "Beyond patriotism and convenience, there are also legal considerations to bear in mind. Groves told us: “Also, you need to be aware that in terms of equity crowdfunding, the UK is the world leader and this is largely down to supportive regulation. The US does not currently allow equity crowdfunding by ordinary investors, so you really need to consider where you intend to be based and, indeed, where your future customers will be based, who may well turn out to be your biggest investor fans.”",
    "It’s also worth considering how the individual crowdfunding platforms make their cash, too. Most of them charge commission. Rates typically vary from around 3.5 to 8 percent. So, when looking for a funding platform, you’ll need to choose between donation, gift, equity, debt and hybrid platforms. Which one is right for your business comes down to your personal ethics, ambition and the type of project you’re planning.",
    "Crowdfunding is a serious business. We talk with Luke Scanlon, a technology lawyer, about your legal duties and responsibilities when accessing crowd cash.",
    "Why don’t you introduce yourself?",
    "I’m a lawyer for Pinsent Masons and Out-Law.com, having spent most of my career looking into technology, data protection and intellectual property law issues. As the business models of more and more banks, insurers and other financial services firms become dependent on technology, I’m finding that I am spending more and more time assessing the legal implications of the intersect between technology and financial services.",
    "Is a crowdfunding campaign something a new entrepreneur can manage themselves without specific professional legal advice?",
    "In the UK, it is important to determine whether or not a crowdfunding platform is authorized to provide financial services in accordance with financial services regulation. Not all crowdfunding platforms necessarily need to be. For example, pure donation and rewards-based platforms may not. Other platforms can take advantage of statutory exemptions, which allow certain financial services related activities to be performed without authorization. But if entrepreneurs use unregulated platforms, they should make sure that they are not being involved in illegal activities, such as the making of unauthorized financial promotions, failing to provide adequate risk warnings, or issuing shares or other forms of financial security without authorization.",
    "What are the key responsibilities a start-up has towards people who fund it through a crowd-based platform?",
    "It depends on the type of platform. Generally, an entrepreneur must be clear about what he or she is committing to, and be prepared to honor those commitments. While it is often suggested that 50 to 70 percent of start-ups fail, this does not mean that an entrepreneur will escape liability if he or she fails to meet the commitments given. If, for instance, the entrepreneur has failed to set up a legal entity for the project, it is possible that funders could bring a claim against him or her personally.",
    "Do responsibilities change if you’ve raised funds by selling equity, as opposed to soliciting donations accompanied by the promise of a gift (perhaps a free copy of the product you’re trying to make)?",
    "The nature of your commitments will be different. Equity investments result in the creation of a particular type of legal relationship to which some specific obligations attach. Essentially, though, it is best to view all obligations to investors as legal obligations, no matter what incentive you have provided for investing. Be transparent about the risks of investing in your business, the barriers, and the likelihood of success. Ensure that you understand everything you have committed to in writing.",
    "What is the best way to protect yourself if your business fails?",
    "It is important to ensure that you have set up a legal entity that separates your personal liability from that of your business or project, and you should observe general principles of good business practice. For example, no matter what the project, it is preferable if you use a crowdfunding platform that enables investors to track their money, where it is kept and transactions that have taken place.",
    "And, looking down the other end of the rifle, what rights do you have if you’ve invested in a company that fails?",
    "Well, the risks can include a total loss of investment; the lack of a secondary market for investments means that funders could have to wait until a management buy-out, a flotation or the sale of the business takes place before getting a return. In some instances, an equity investment may be diluted. Given these risks, the Financial Conduct Authority is proposing that only certain categories of investors (‘sophisticated investors’, ‘high net worth investors, those who have received regulated financial investment advice, and some others) be able to engage in equity crowdfunding in the future. The FCA is consulting on this matter at the moment."
  ],
  "headers": {},
  "links": {
    "Kickstarter": "https://www.kickstarter.com/",
    "finance your new business": "https://www.techradar.com/how-to/create-a-business-plan",
    "Pebble Technology": "https://www.techradar.com/news/phone-and-communications/pebble-smartwatch-units-skipping-out-to-early-backers-today-1127087",
    "goCarShare": "https://gocarshare.com/",
    "UK Crowdfunding Association": "https://www.ukcfa.org.uk/",
    "Crowdfunder": "https://www.crowdfunder.co.uk/",
    "Indiegogo": "https://www.indiegogo.com/",
    "Hubbub": "https://www.hubbub.org.uk/",
    "Crowdcube": "https://www.crowdcube.com/",
    "Seedrs": "https://www.seedrs.com/",
    "Angels Den": "https://www.angelsden.com/en-gb/",
    "Syndicate Room": "https://www.syndicateroom.com/"
  }
}