{
  "source": "https://www.techradar.com/news/nikon-z9-expected-to-match-canon-eos-r3-for-resolution-and-speed",
  "title": "Nikon Z9 expected to match Canon EOS R3 for resolution and speed",
  "category": "cameras",
  "updated": "2021-07-16T09:34:26Z",
  "author": "mark-wilson",
  "summary": "Rumor suggests a 45MP sensor is on the cards",
  "article": [
    "Nikon's next flagship full-frame camera, the Nikon Z9, is expected to match the incoming Canon EOS R3 for both resolution and burst shooting speed, according to fresh rumors.",
    "So far, all we officially know about the Nikon Z9 is that it'll have a newly-developed stacked FX (or full-frame) sensor. Stacked full-frame sensors are exciting because they have faster read-out speeds than today's BSI (backside-illuminated) chips, which means superior burst shooting and autofocus skills.",
    "But now the pretty reliable Nikon Rumors has said that \"the Z9 will have a 45MP sensor that will allow up to 30fps\" burst shooting. This is significant for a couple of reasons: firstly, it's a step above previous rumors, which suggested that 20fps would be the continuous shooting limit, but it'd also mean the Z9 would likely match the Canon EOS R3 for both resolution and speed.",
    "Canon hasn't yet officially confirmed the resolution of the Canon EOS R3, its equivalent mirrorless camera for pro sports photographers, but rumors have strongly suggested that it'll also be a 45MP camera. We do already officially know that R3 will be able to shoot 30fps bursts and oversampled 4K video.",
    "These specs don't necessarily mean that both cameras will regularly hit those speeds or offer an identical shooting performance. Quoted burst speeds are always a theoretical maximum in ideal conditions, and other factors – including burst depth (the length of time it can maintain those speeds) and the file format you're shooting in – can have a big influence on the real-world experience.",
    "But the strong likelihood of the Nikon Z9 being a 45MP camera with Sony A1-level shooting power does give us a sense of the kind of powerhouse it's going to be. Earlier rumors had suggested that Nikon had been testing 50MP and 60MP sensors with the Z9, but it seems that 45MP is going to be the sweet spot for those looking to balance resolution and file size with the lightning-fast continuous shooting.",
    "Both the Nikon Z9 and Canon EOS R3 are part of a new breed of mirrorless full-frame cameras that trump the performance of pro sports DSLRs – and are likely looking to tempt professionals to make the DSLR-to-mirrorless switch.",
    "The impending battle between the two cameras is really a mirrorless re-enactment of the Nikon D6 vs Canon 1D X Mark III wars, which was going to be the main photographic tussle for the 2020 Olympics before they were postponed last year.",
    "The big difference this time is resolution. Pro sports cameras have previously tended to have lower-resolution sensors, in order to unlock fast burst shooting speeds and the convenience of smaller file sizes. For example, the Nikon D6 has a 20.8MP sensor, while the Canon EOS 1D X Mark III is even lower at 20.1MP.",
    "But the rumors that both the Nikon Z9 and Canon EOS R3 will both have 45MP with 30fps maximum burst shooting speeds suggests that the two cameras will take sports cameras to the next level.",
    "The only downside is that the two cameras will miss this year's Olympics, at least in an official capacity, with the Canon EOS R3 expected to get a full launch in September and the Nikon Z9 rumored to be debuting in November or December. But if you watch the Olympics carefully, it's possible you could see both cameras being tested in the wild."
  ],
  "headers": {
    "6": "Head to head"
  },
  "links": {
    "Nikon Rumors": "https://nikonrumors.com/2021/07/15/nikon-z9-45mp-and-30-fps.aspx/",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Nikon D6": "https://www.techradar.com/reviews/nikon-d6",
    "Canon 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "Nikon Z9 rumored to be debuting in November or December": "https://nikonrumors.com/2021/07/06/the-nikon-z9-is-rumored-to-be-announced-in-november-december.aspx/"
  }
}