{
  "source": "https://www.techradar.com/news/folding-iphone-may-be-further-behind-in-development-than-we-thought",
  "title": "Folding iPhone may be further behind in development than we thought",
  "category": "phones",
  "updated": "2021-02-18T09:26:10Z",
  "author": "tom-bedford",
  "summary": "It hasn't designed the screens yet",
  "article": [
    "There are two unique components of foldable phones that designers need to work on - the hinge, which lets the phone open and close plenty of times without breaking, and the screen, which needs to fold and unfold at ease.",
    "By the sounds of it, Apple's iPhone Flip might not have the latter yet and that suggests it's still a long way off.",
    "This comes from a report from Chinese website Digitimes which says, according to insider sources, Apple has commissioned LG Display to design (though not necessarily produce) the screens for its first bending smartphone.",
    "A point of clarity: this isn't LG Mobile, which makes LG smartphones but a separate company that has made screens for Apple and other companies in the past.",
    "If this report is true, it suggests that the iPhone Flip is very early in development. It'll presumably take a long time for LG to design a folding display that works well including testing, prototyping and patenting various versions of it, and even once that display is finalized, the phone itself has got to go through all those same stages.",
    "Even after that, the display and other components will have to be mass-produced, and by the sounds of it, LG isn't slated to do that. In other words, the release date of the folding iPhone is unlikely to be any time soon.",
    "We've heard quite a few folding iPhone release dates, but they give the rough impression of 'dartboard guesses' since they've only narrowed it down to a wide two-year window. At the moment, we're expecting a launch sometime in 2022 or 2023.",
    "However, this new rumor suggests we could be looking at the latter end of that spectrum or perhaps even later. It'll probably be the iPhone 15 series we see in 2023, so we could see Apple's first folding phone alongside that iPhone.",
    "Perhaps more useful is that, if true, this rumor tells us Apple doesn't already have a display for its foldable phone. This means we can discount, or treat with suspicion any leaks and rumors that bring detailed information on the screen, as it'll likely be speculation.",
    "Something no-one is doubting, though, is that the iPhone Flip (or iPhone Fold, we've no idea what it'll be called) is still likely years off. We'll have to wait until its debuted to get a solid idea as to what the phone will be like."
  ],
  "headers": {
    "6": "When will the iPhone Flip release?"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "iPhone Flip": "https://www.techradar.com/news/foldable-iphone",
    "Digitimes": "https://www.digitimes.com.tw/tech/dt/n/shwnws.asp?CnlID=1&id=0000604415_X8R35MB32OSSZB49EA761",
    "LG smartphones": "https://www.techradar.com/news/best-lg-phones"
  }
}