{
  "source": "https://www.techradar.com/news/coinbase-customers-up-in-arms-after-hackers-drain-crypto-wallets",
  "title": "Coinbase customers up in arms after hackers drain crypto wallets",
  "category": "computing",
  "updated": "2021-08-26T11:53:15Z",
  "author": "anthony-spadafora",
  "summary": "Another reason to store your crypto in a hardware wallet instead",
  "article": [
    "An increasing number of users of the highly popular cryptocurrency exchange Coinbase have found their accounts on the platform empty after hackers managed to gain access to them and drain their cryptocurrency wallets.",
    "According to a new report from CNBC, the news outlet interviewed Coinbase customers across the US to discover thousands of customer complaints. For instance, one couple logged onto the service to discover that $168k in cryptocurrency had vanished after hackers were able to take over their account.",
    "To add insult to injury, the couple was unable to reach Coinbase for support after the incident occurred. While banks now employ live chat as well as email and telephones to provide customers support, the popular cryptocurrency company only responds to customers via email.",
    "Although Coinbase did originally offer live chat for support, the feature was phased out around 2016 though according to a recent blog post, it plans to re-add live chat to its platform. Additionally, Coinbase plans to continue to expand its customer support team to better serve its customers.",
    "If money is accidentally transferred out of your bank account to another account, you can easily call your bank to have the transaction reversed. However, the same can't be said for cryptocurrency ; once it's transferred off an exchange to a bank, there's no way to recover the lost funds.",
    "While using two-factor authentication (2FA) and a password manager can help secure your crypto accounts, cybercriminals have begun using SIM swapping as a means to take over accounts.",
    "For those unfamiliar, SIM swapping involves a cybercriminal taking control of a victim's phone number and SIM card through their mobile carrier. From here, they can then intercept 2FA codes sent via text message to take over a victim's other online accounts.",
    "These hacked Coinbase accounts are then sold on the Dark Web for anywhere between $100 and $150 according to Etay Maor from Cato Networks who spoke with CNBC.",
    "For this reason, if you don't plan on exchanging your crypto for cash anytime soon, it is recommended that you store your cryptocurrency in a hardware wallet like the Ledger Nano X or the Trezor Model T instead of leaving it on a cryptocurrency exchange. This way, hackers won't be able to steal your cryptocurrency without first breaking into your home or apartment.",
    "Via CNBC"
  ],
  "headers": {
    "4": "Account takeovers"
  },
  "links": {
    "Coinbase": "https://www.techradar.com/reviews/coinbase-cryptocurrency-exchange",
    "cryptocurrency wallets": "https://www.techradar.com/news/best-bitcoin-wallets",
    "new report": "https://www.cnbc.com/2021/08/24/coinbase-slammed-for-terrible-customer-service-after-hackers-drain-user-accounts.html",
    "live chat": "https://www.techradar.com/best/best-live-chat-software",
    "blog post": "https://coinbase-consumer.sjv.io/c/221109/552039/9251?subId1=trd-us-5832558472982260000&sharedId=trd-us&u=https%3A%2F%2Fblog.coinbase.com%2Fcommitting-to-better-customer-service-during-this-time-of-heightened-interest-in-the-cryptoeconomy-5dc2637c4fa7",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "password manager": "https://www.techradar.com/best/password-manager",
    "SIM swapping": "https://www.techradar.com/news/t-mobile-data-breach-could-be-much-worse-than-previously-thought",
    "Dark Web": "https://www.techradar.com/news/over-15-billion-stolen-credentials-are-for-sale-on-the-dark-web-now",
    "Ledger Nano X": "https://www.techradar.com/reviews/ledger-nano-x-cryptocurrency-wallet-review",
    "Trezor Model T": "https://www.techradar.com/reviews/trezor-model-t-cryptocurrency-wallet",
    "CNBC": "https://www.cnbc.com/2021/08/24/coinbase-slammed-for-terrible-customer-service-after-hackers-drain-user-accounts.html"
  }
}