{
  "source": "https://www.techradar.com/news/jedi-battle-rumbles-on-as-judge-refuses-to-dismiss-aws-trump-claims",
  "title": "JEDI battle rumbles on as judge refuses to dismiss AWS Trump claims",
  "category": "computing",
  "updated": "2021-04-29T09:40:24Z",
  "author": "mayank-sharma",
  "summary": "Decision adds to growing Pentagon frustration on lack of movement regarding JEDI",
  "article": [
    "A US Federal Claim Court judge has declined to dismiss allegations that former President Trump interfered with the Joint Enterprise Defense Infrastructure (JEDI) contract.",
    "JEDI is the massive $10 billion project to migrate the Pentagon’s computing infrastructure to the cloud. It was awarded to Microsoft in 2019, but no work has begun as the decision was embroiled in a legal dispute even before it started.",
    "Amazon contends that Trump improperly influenced the U.S. Department of Defense (DoD) to award JEDI to Microsoft, affecting its own pitch.",
    "In response, the DoD and Microsoft had filed a joint motion to prevent Amazon from presenting these allegations in the court, but the new ruling means Amazon will be able to continue pursuing its argument.",
    "Amazon has welcomed the dismissal of Microsoft’s motion.",
    "“The record of improper influence by former President Trump is disturbing, and we are pleased the Court will review the remarkable impact it had on the JEDI contract award. AWS continues to be the superior technical choice, the less expensive choice, and would provide the best value to the DoD and the American taxpayer,” said an AWS spokesperson",
    "Amazon has already secured an injunction to prevent Microsoft from beginning work on the JEDI project.",
    "Earlier this year, a memo revealed that the Pentagon was frustrated with all the legal wrangling around the project. In fact the memo hinted that should Amazon’s complaint be upheld, the entire JEDI contract may be abandoned.",
    "Via GeekWire"
  ],
  "headers": {
    "4": "Cancellation on the cards?"
  },
  "links": {
    "JEDI": "https://www.techradar.com/news/pentagon-may-cancel-jedi-contract-and-start-over",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "AWS": "https://www.techradar.com/news/aws",
    "prevent Microsoft": "https://www.techradar.com/news/us-government-dollar10bn-pentagon-cloud-contract-put-on-hold",
    "GeekWire": "https://www.geekwire.com/2021/jedi-news-judge-wont-dismiss-amazons-claim-trump-interfered-10b-cloud-contract/"
  }
}