{
  "source": "https://www.techradar.com/news/apple-leaks-and-the-sony-xperia-1-iii-noise-cancelling-podcast-episode-60",
  "title": "Apple leaks and the Sony Xperia 1 III: Noise Cancelling podcast episode 60",
  "category": "phones",
  "updated": "2021-04-16T08:57:23Z",
  "author": "adam-vjestica",
  "summary": "Episode 60 of our tech podcast is here",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's episode is presented by Gareth Beavis, Global Editor-in-Chief of TechRadar, and Sherri L. Smith, Editor-in-Chief of Laptop Mag.",
    "Our guests are James Peckham, Phones Editor at TechRadar, and Mark Anthony Ramirez, Tech Journalist at Laptop Magazine, who join us (remotely, of course) to talk about the last seven days in tech.",
    "As usual, we're talking about a variety of topics from the world of tech.",
    "In this week's episode, we chat about Siri leaking the next Apple event, the new Sony Xperia 1 III, and reminisce about the biggest tech industry leaks we can recall. We also induct the Commodore 64 into our Gadget Hall of Fame and talk about our dream virtual concerts. Oh, and killer Furbies...",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple Podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 60:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/",
    "Tom's Guide": "https://www.tomsguide.com/",
    "Apple event": "https://www.techradar.com/news/apples-april-20-event-is-official-heres-what-to-expect-including-ipad-pro",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple Podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1045080553030126600&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}