{
  "source": "https://www.techradar.com/news/samsung-galaxy-buds-pro-unboxing-video-gives-in-depth-look-at-airpods-pro-rivals",
  "title": "Samsung Galaxy Buds Pro unboxing video gives in-depth look at AirPods Pro rivals",
  "category": "audio-visual",
  "updated": "2021-01-05T14:22:11Z",
  "author": "olivia-tambini",
  "summary": "The wireless earbuds are slated to launch on January 14",
  "article": [
    "The Samsung Galaxy Buds Pro may not be expected to launch until January 14, but an unboxing video from Digital Slang has already given us an in-depth look at the new wireless earbuds.",
    "In a video posted to YouTube, Digital Slang takes us through everything from the packaging to its initial thoughts on how well the Galaxy Buds Pro perform compared to their biggest rivals, the Apple AirPods Pro.",
    "You can watch the video for yourself below:",
    "The video confirms some of the specs we've already heard about, including an IPX7 water-resistance rating, active noise cancellation, a transparency mode, and support for wireless charging.",
    "According to Digital Slang, the noise cancellation isn't as effective as with the AirPods Pro, but the tester asserts that the transparency mode does work very well, and that it's \"one of the best\" that's been tested on the channel.",
    "As for the sound? Digital Slang says that the highs and mids are \"crystal clear\", while the bass sounds \"punchy\". The channel also reveals that the buds come with the ability to change their sound profile via an equalizer in the Galaxy Wearable app.",
    "One thing not mentioned in the video is whether the Samsung Galaxy Buds Pro support spatial audio like the AirPods Pro. It had been rumored that the new true wireless earbuds would come with Dolby Atmos support, having been first spotted by a Reddit user in a pre-release APK and then reported by XDA Developers.",
    "With spatial audio support, you'd be able to watch Dolby Atmos films with their full immersive surround sound quality – making the Galaxy Buds Pro a much more competitive pair of earbuds compared to their predecessors, the Galaxy Buds Live and the Galaxy Buds Plus.",
    "It could also go some way to justifying their rumored price tag. According to XDA Developers, the Samsung Galaxy Buds Pro will set you back $199, which works out at roughly £110 / AU$260. While that's a cheaper price than you'll get with the AirPods Pro, there are still lots of very impressive true wireless earbuds on the market for less.",
    "That 3D audio feature is said to come with head-tracking, which means the audio should stay ‘locked’ to your phone, even as you move your head around. Apple’s Spatial Audio feature works in a similar way, using gyroscopes and accelerometers built into the AirPods Pro and the AirPods Max to ensure that your film’s audio always sounds as though it's coming from the source of the action onscreen.",
    "We'll have to wait until the Galaxy Buds Pro are launched to find out whether they'll come with this nifty feature – but as they're expected to launch alongside the Samsung Galaxy S21 on January 14, we won't have to wait long."
  ],
  "headers": {
    "6": "Where's the spatial audio?"
  },
  "links": {
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Digital Slang": "https://www.youtube.com/channel/UC-HVXnpUxSsE5_ZFw0OTdaw",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "video posted to YouTube": "https://www.youtube.com/watch?v=VAGUMP0xsio&feature=emb_logo&ab_channel=DigitalSlang",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "XDA Developers": "https://www.xda-developers.com/galaxy-buds-pro-app-confirms-colors-design-features-samsung-next-gen-tws-earbuds/",
    "Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review"
  }
}