{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s8-gets-a-very-early-leak-from-samsungs-own-website",
  "title": "Samsung Galaxy Tab S8 gets a very early leak from Samsung's own website",
  "category": "phones",
  "updated": "2021-02-11T12:49:01Z",
  "author": "tom-bedford",
  "summary": "But without much information",
  "article": [
    "If the Samsung Galaxy Tab S8 follows the release schedule of its predecessor, it'll come out in August – you'd think, then, that it's too early for leaks and rumors to come out about the tablet, but it seems that's not the case, as Samsung itself has name-dropped the device.",
    "As spotted by Russian tech site Androidu.ro, in a guide on Samsung's website informing you as to which type of memory card your Samsung tablet supports, one of the slates listed is the 'Samsung Galaxy Tab S8 Enterprise Edition'.",
    "Typically 'Enterprise Editions' of Samsung devices are similar to their standard versions, but come with added tools to optimize them for use by employees across businesses. Some features include the ability to schedule OS updates, four years of security updates, and the facility to remotely control devices for the purposes of updates.",
    "While the Samsung Galaxy Tab S8 Enterprise Edition technically isn't the actual Galaxy Tab S8, it's likely to be identical in terms of specs, and of course there wouldn't be a Tab S8 Enterprise Edition if a Tab S8 wasn't also on the way.",
    "So does the listing tell us anything about the tablet? Well, yes, but not much – apparently it will have a microSD card slot allowing up to 1TB expanded storage.",
    "That's the same as the last few Samsung tablets, so it's not a huge surprise, but that information is about all you can expect from a guide to tablet external storage.",
    "When more Samsung Galaxy Tab S8 information comes out we'll be sure to bring it to you, though it's unlikely that we'll hear much soon with the launched expected to take place in the latter half of this year.",
    "Via GSMArena"
  ],
  "headers": {
    "3": "Is there any information here?"
  },
  "links": {
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "Androidu.ro": "https://www.androidu.ro/samsung-galaxy-tab-s8-in-versiunea-enterprise-edition-mentionata-pe-site-ul-oficial/",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_tab_s8_enterprise_edition_appears_on_company_website-news-47677.php"
  }
}