{
  "source": "https://www.techradar.com/news/halo-infinite-could-get-a-larger-pvp-focused-beta-before-launch",
  "title": "Halo Infinite could get a larger PvP-focused beta before launch",
  "category": "gaming",
  "updated": "2021-08-03T10:17:59Z",
  "author": "vic-hood",
  "summary": "Fingers crossed",
  "article": [
    "The Halo Infinite multiplayer beta may be over, but developer 343 Industries is already considering holding another one - this time focused on PvP.",
    "On Twitter, Halo Community Director at 343 Industries Brian Jarrard thanked Halo Insiders for participating in the Halo Infinite technical preview last weekend and explained the next steps the developer plans to take.",
    "Jarrard revealed that the developer is hoping to host another \"larger-scale flight\" that is \"properly focused on PvP and other elements of the [multiplayer] experience\". According to the Community Director, there is no timing for this second multiplayer beta but they have encouraged those who want to take part to sign up to the Halo Insider Program to be in with a chance of participating.",
    "Jarrard also explained that 343 Industries is now digging into the crashes, bugs and game data gathered from the recent beta and addressing any issues it deems necessary. Though Jarrard did reassure fans that the recent beta is from an earlier build of Halo Infinite, so many of the issues should have already been addressed.",
    "The first Halo Infinite beta (officially called a technical playtest) allowed players to try out the new Halo's multiplayer in a game of 4v4 Slayer. However, while players played alongside humans, they were battling against AIs rather than real players.",
    "While the Halo Infinite multiplayer beta has been generally well-received, a PvP (player-versus-player) multiplayer beta would allow participants to try out one of the series' cornerstones and could be the decider for many on whether they want to pick up Master Chief's next outing.",
    "Halo Infinite is set to include a 12v12 Big Team Battle mode as well as another long-rumored mode as part of its multiplayer offering, so we're hoping to go hands-on with these new modes in a PvP-focused beta."
  ],
  "headers": {
    "4": "Analysis: what could we see in the next multiplayer beta?"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Twitter": "https://twitter.com/ske7ch/status/1422266742869430273?s=20",
    "Halo Insider Program": "https://t.co/FpliK6rSHS?amp=1",
    "long-rumored mode": "https://www.techradar.com/news/halo-infinite-could-be-getting-a-battle-royale-mode-after-all"
  }
}