{
  "source": "https://www.techradar.com/news/quick-the-airpods-pro-just-dropped-to-dollar18999-in-epic-deal-at-amazon",
  "title": "Huge deal: the AirPods Pro are in stock and on sale for $189.99 at Amazon",
  "category": "audio-visual",
  "updated": "2021-07-19T13:52:53Z",
  "author": "mackenzie-frazier",
  "summary": "The best-selling AirPods Pro get a $59 price cut at Amazon",
  "article": [
    "If you're looking to snag a deal on the highly sought-after AirPods Pro - then you're in luck. We've just spotted Apple's best-selling AirPods Pro in stock and on sale for $189.99 (was $249) at Amazon. That's $8 less than last week's price and the best deal you can find right now.",
    "The AirPods Pro feature Apple's powerful H1 chip, which offers voice control with Siri so you can get directions, skip songs, and make calls completely hands-free. The wireless earbuds now include Active Noise Cancellation to block out unwanted noise, and the Transparency mode allows you to let outside noise in when you need it. The sweat-resistant AirPods also come with new silicon tips in three different sizes to provide a more comfortable and secure fit. While the AirPods have dropped as low as $169.99 during Black Friday, the earbuds have been steadily sitting at $197 for most of this year. We don't know how long Amazon will have the AirPods Pro at this new low price, so we'd take advantage now before it's too late.",
    "You can also shop for more offers with the best AirPod deals and sales and see the best AirPods Pro deals and sales that are happening now. You can also see more bargains with our roundup of the best back to school sales and look forward to upcoming offers during the Labor Day sales event."
  ],
  "headers": {
    "1": "AirPods Pro deal",
    "2": "More AirPods deals"
  },
  "links": {
    "on sale for $189.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MWP22AM-A-AirPods-Pro%2Fdp%2FB07ZPC9QD4%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3049508328896765400-20",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "best AirPod deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "best AirPods Pro deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "back to school sales": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}