{
  "source": "https://www.techradar.com/news/amazon-sale-slashes-the-apple-airpods-to-just-dollar12998-the-lowest-price-ever",
  "title": "Hurry! The latest model AirPods are on sale for $129.98 - the lowest price ever",
  "category": "audio-visual",
  "updated": "2021-09-16T18:18:20Z",
  "author": "mackenzie-frazier",
  "summary": "Snag this incredible AirPods deal while you can",
  "article": [
    "Amazon is slashing the price on Apple's best-selling AirPods, and we've just spotted an epic deal on the latest model AirPods with wireless charging case. Right now, you can get the 2019 Apple AirPods on sale for just $129.98 (was $199). That's a massive $69 discount and the lowest price we've seen for wireless earbuds.",
    "The 2019 Apple AirPods received an upgraded H1 Chip that results in faster pairing and seamless connectivity. The H1 chip also allows you to use your voice to ask Siri questions. You can adjust the volume, skip songs, and make calls completely hands-free. The earbuds also come with a wireless charging case that offers 24 hours of battery overall, with 5 hours of battery life (three hours of talk time) on a single charge. As we've mentioned above, this is the lowest price we've ever seen for the AirPods and $30 less than last week's sale price. Stock has been flashing in and out, so we'd recommend snagging this deal now before it's too late.",
    "You can also shop for more offers with the best AirPod deals and sales and see the best AirPods Pro deals and sales that are happening now. You can see more tech bargains with our roundup of the best Amazon deals and learn about the upcoming Labor Day sales event."
  ],
  "headers": {
    "1": "Today's best AirPods deal",
    "2": "More AirPods deals"
  },
  "links": {
    "on sale for just $129.98": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07PYLT6DN%3Fref%3Dods_ucc_kindle_B07PYLT6DN_rc_nd_ucc%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1144349573849423200-20",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "best AirPod deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "best AirPods Pro deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "Amazon deals": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}