{
  "source": "https://www.techradar.com/news/justice-league-aspect-ratio-why-the-snyder-cut-isnt-in-widescreen",
  "title": "Justice League aspect ratio: why the Snyder Cut isn't in widescreen",
  "category": "entertainment",
  "updated": "2021-03-18T23:59:05Z",
  "author": "samuel-roberts",
  "summary": "Why you'll be watching it in 4:3",
  "article": [
    "If you've started watching Zack Snyder's Justice League on HBO Max, you might've been disappointed to learn that the movie is not available in widescreen, and is instead presented in a 4:3 aspect ratio. An explainer card tells you why just as the four-hour Snyder Cut begins: 'This film is presented in a 4:3 format to preserve the integrity of Zack Snyder's creative vision.'",
    "Good for him! Unfortunately, for you at home, it's pretty annoying when you'd rather watch it in widescreen, like every other modern movie (barring outliers like The Lighthouse and Bait).",
    "So why has Zack Snyder decided to set the Snyder Cut aspect ratio in 4:3? The reason is actually very simple, but not particularly satisfying. We'll explain why you can't watch Zack Snyder's Justice League in widescreen below.",
    "We learned that the Snyder Cut would be in the 4:3 aspect ratio earlier in 2021. The reasoning was revealed in a Vanity Fair article on the making of the film: Snyder chose to present the film in 4:3 so it can eventually be watched on IMAX screens, where this format best suits the viewing experience.",
    "We're sure the film will look fantastic in this aspect ratio in that specific circumstance – it's just frustrating when the vast majority of people watching the film are likely going to see it at home on their TVs, on-demand, in the next few days.",
    "Still, the article makes it clear that Snyder is not worried about the reaction to this. It is his film, after all – it just would've been nice to have the option to watch it in widescreen.",
    "Honestly, while it's annoying to see the black bars on your screen at first, you do get used to watching the film in 4:3. After a while, your brain tunes into it, and you stop thinking about what you're not seeing. Zack Snyder's Justice League definitely has its problems as an overall film – but for the most part, it's a gorgeous-looking piece of work.",
    "That's not been compromised by the aspect ratio decision, here, even if it does seem a little baffling at first."
  ],
  "headers": {
    "3": "Zack Snyder's Justice League aspect ratio: why is it not available in widescreen?",
    "6": "Does the Snyder Cut aspect ratio ruin the viewing experience?"
  },
  "links": {
    "Zack Snyder's Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1312535492280803600&url=https%3A%2F%2Fwww.hbomax.com%2Fzacksnydersjusticeleague%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fjustice-league-aspect-ratio-why-the-snyder-cut-isnt-in-widescreen",
    "Vanity Fair article": "https://www.vanityfair.com/hollywood/2021/02/the-true-story-of-justice-league-snyder-cut"
  }
}