{
  "source": "https://www.techradar.com/news/microsofts-big-change-to-windows-10-updates-will-be-great-news-for-gamers",
  "title": "Microsoft’s big change to Windows 10 updates will be great news for gamers",
  "category": "computing",
  "updated": "2021-04-22T10:12:48Z",
  "author": "matt-hanson",
  "summary": "DirectX 12 updates will no longer be tied to Windows 10 updates",
  "article": [
    "In the past, updates to Microsoft’s DirectX 12 API, which provides various features and effects for compatible games and hardware, was tied to Windows 10 updates, but that looks set to change with the DirectX 12 Agility SDK (Software Development Kit).",
    "The idea behind this, according to Microsoft’s blog post, is that “developers can now add the newest DirectX 12 features to their games, and gamers can play games with these features without having to upgrade their OS”. This should mean that new DirectX 12 features in games get into the hands of gamers much quicker.",
    "The uncoupling of DirectX 12 updates with Windows Updates should – it is hoped – encourage developers to add these features to their games. As PC Gamer points out, some developers have been reluctant to use new DirectX 12 features, as it could mean many players don't get the benefit, as they are unable or unwilling to update Windows 10 to a newer version.",
    "With the DirectX 12 Agility SDK this can be avoided, as it will be compatible with Windows 10 November 2019 Update and later.",
    "It also means that developers don’t have to wait for a major Windows 10 update to include new DirectX 12 features in their games – instead the new features can be pushed out to gamers at any time. This should hopefully mean a more regular – and faster – stream of new features coming to games.",
    "Separating DirectX 12 updates from Windows 10 updates is a great move in our opinion, especially if it means new features come to games more often.",
    "It also stops Microsoft trying to get people to move to a new version of Windows 10 just to get those new features. While we generally recommend people always use the most recent version of Windows 10, there are many people who would rather stick with older versions – mainly due to the fact that it works for them, while new Windows 10 updates can sometimes remove features or apps they rely on, or introduce new bugs.",
    "Gamers who want to hold off on Windows 10 updates should no longer be penalized, then. The new features will be released as individual DirectX 12 Agility SDK updates, and they will likely appear in the Windows Update tool, so you don’t miss out."
  ],
  "headers": {
    "5": "Well played"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "according to Microsoft’s blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7311381808365032000&xs=1&url=https%3A%2F%2Fdevblogs.microsoft.com%2Fdirectx%2Fannouncing-dx12agility%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosofts-big-change-to-windows-10-updates-will-be-great-news-for-gamers",
    "As PC Gamer points out": "https://www.pcgamer.com/uk/directx-12-agility-sdk/",
    "individual DirectX 12 Agility SDK updates": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8122788564870067000&xs=1&url=https%3A%2F%2Fdevblogs.microsoft.com%2Fdirectx%2Fdirectx12agility%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosofts-big-change-to-windows-10-updates-will-be-great-news-for-gamers"
  }
}