{
  "source": "https://www.techradar.com/news/5-things-we-love-and-hate-about-the-google-nest-hub-2",
  "title": "8 things we love (and hate) about the Google Nest Hub 2",
  "category": "smart-home",
  "updated": "2021-03-22T15:27:05.545Z",
  "author": "carrie-ann-skinner",
  "summary": "From sleep tracking to the inexplicable lack of camera",
  "article": [
    "The Google Nest Hub 2, Google’s rumored replacement for the Google Home Hub, has finally been officially confirmed with the 7-inch smart display available to pre-order now and will go on sale on March 31, priced at $99.99 / £89 / AU$149.",
    "The Google Nest Hub 2 may look similar to its predecessor with a ‘floating display’ design, but it has some handy technology built-in that actually makes it Google’s most advanced smart display to date - not least because it can track how well you sleep without requiring you to wear a smartwatch or fitness tracker.",
    "It also has some handy features that can improve the amount and quality of sleep you get, such as dimming the display as the evening draws to a close and a Sunrise alarm that will slowly brighten the display before the alarm goes off so you’re not awoken with a start. These features are also being made available on the Google Nest Hub, previously known as the Google Home Hub, and the Google Nest Hub Max through a software update too.",
    "We've picked out some of the aspects that we love about the new Google Nest Hub 2, which could potentially make our list of best smart displays, as well as a couple that we were disappointed not to see included in Google’s latest smart display.",
    "The Google Nest Hub 2 comes with Soli radar technology built-in, a tech that already features in the Google Pixel 4 smartphone and the company’s newest Nest smart thermostat.",
    "Providing the basis of its sleep-tracking functionality, the radar is able to detect when you’re awake, asleep or absent from your bed at night, while also monitoring your breathing, and any coughing or snoring.",
    "The device analyzes this data and provides a daily report that details how well you slept, and the cause of any interruptions you may have experienced through the night.",
    "The Soli radar isn’t only useful for sleep tracking on the Google Nest Hub. Similar to the way it's utilized in Pixel smartphones, it also enables the Quick Gestures feature, enabling you to play and pause music and video by moving your hand in front of the 7-inch smart display. This is particularly handy if you’re cooking and have greasy fingers, as you can still control the device without having to make the screen dirty.",
    "When it comes to getting a good night’s sleep, the Google Nest Hub 2 doesn't just offer sleep tracking, it also has some handy features that will help you wind-down and wake-up gently. The display can be set to dim automatically as night draws in, while the ‘Your Evening’ page offers quick access to alarms, any smart lights you have in the room, and relaxing sounds playlists to make your bedroom as sleep-friendly as possible.",
    "There’s also a Sunrise Alarm that gradually brightens the display and increases the alarm volume so you’re woken with a start. All of these features can also be found on the original Google Nest Hub and the Google Nest Hub Max through a software update.",
    "However, the Google Nest Hub 2 has one extra feature here. As we’ve mentioned already, the Google Nest Hub 2 also features Quick Gestures, so as well as waving your hand in front of the display to control music and videos, you can also do this to snooze the alarm. That’s much easier when you’re half asleep than trying to find the right button to press to grab a few extra minutes of shut-eye.",
    "We found the original Google Home Hub’s sound quality lacking when it came to a powerful bass, so we’re pleased to see that Google has improved the audio on the Google Nest Hub 2. The tech giant claims the new smart display offers 50% more bass than its predecessor, and we look forward to testing this out. While the smart display won't be your primary way of watching TV, it may be your go-to speaker for the room it's located in. If the audio experience isn't up to scratch when you're listening to music or watching videos, the device could end up languishing in the corner, leaving you feeling disappointed with it.",
    "Google has included support for the wireless smart home protocol Thread in the Google Nest Hub 2. The relatively new technology allows smart home devices from different manufacturers to work together, without the need for a third-party service such as IFTTT, for example switching on smart lights if your smart weather centre detects it's a cloudy dull day. It also uses less power, so if any of your smart home devices are battery powered, they will last longer between charges.",
    "In addition, Google goes one step further, ensuring the Google Nest Hub 2 can act as a Thread Border router – this means you’ll still be able to control those smart home devices when you’re not connected to your home Wi-Fi network. So if you realise your smart lights are switched on but you’ve left the house, you’ll still be able to turn them off.",
    "Currently there are only a handful of smart home devices on the market that support Thread, including the Nanoleaf Essential range of smart light's and Eve smart plug and connected weather station. However, more are expected to be made available in the future.",
    "Google has given the Nest Hub 2 some eco credentials, too: the smart display’s fabric base is made from recycled plastic bottles.",
    "This is just like the Google Nest Mini 2, the tech giant’s most affordable smart speaker. The fabric is available in four colors: Chalk, Charcoal, Sand and Mist – a soft pastel blue that Google said was designed to give a calming presence in the bedroom.",
    "The original Google Nest Hub, or Home Hub as it was initially called, had one glaring omission – a camera for video calls. At the time of its launch, Google said it was protecting users' privacy by not including a camera.",
    "However, the company did add a camera to its bigger smart display, the Google Nest Hub Max. So, we’re disappointed to find that Google hasn’t included a camera on the Google Nest Hub 2.",
    "It’s a feature that all Amazon’s rival Echo Show smart displays offer, and would have been welcomed by those who want to use the smart display for video calls.",
    "Currently, none of Google’s smart displays – including the new Google Nest Hub 2 – have a web browser built-in, whereas Amazon’s range of Echo Show smart displays do offer the ability to surf the web.",
    "We believe this would have been a handy addition to the Google Nest Hub 2: if you want to quickly search for something on the web, and you don’t have a smartphone or tablet to hand, you wouldn’t have to stop what you’re doing to locate your device. Sadly, Google didn’t feel the need to include a web browser on this updated device."
  ],
  "headers": {
    "4": "Sleep tracking",
    "7": "Quick gestures",
    "8": "Wind down and wake-up gently",
    "11": "Better audio",
    "12": "Support for Thread",
    "15": "Sustainable materials",
    "17": "No camera",
    "20": "Web browser"
  },
  "links": {
    "Google Nest Hub 2": "https://www.techradar.com/reviews/google-nest-hub-2nd-generation-review",
    "Google Home Hub": "https://www.techradar.com/reviews/google-home-hub",
    "pre-order now": "https://www.techradar.com/news/google-nest-hub-2-with-sleep-tracking-available-for-pre-order-now",
    "Google Nest Hub Max": "https://www.techradar.com/reviews/google-nest-hub-max",
    "best smart displays": "https://www.techradar.com/best/best-smart-displays",
    "Thread": "https://www.techradar.com/news/what-is-thread-and-why-do-your-smart-home-gadgets-need-it"
  }
}