{
  "source": "https://www.techradar.com/news/look-upon-the-steam-deck-packaging-and-despair",
  "title": "This Steam Deck box teaser is fun, but the release date still feels so far away",
  "category": "computing",
  "updated": "2021-12-03T10:12:28Z",
  "author": "henry-st-leger",
  "summary": "After a shipping delay, this is all we're getting for now",
  "article": [
    "Valve's Steam Deck may have been delayed until February 2022, but you can start taking in the sight of its packaging right now.",
    "The handful of teaser images shows the inside of the cardboard packaging, including the carrying case containing the console itself, and the boxed USB-C charger you'll get with it – much like the one you get with a new Nintendo Switch.",
    "The innards of the box run through the many places you can feasibly play on your Steam Deck, such as \"on the subway\", \"on the moon\", \"in a hammock\", or \"in a test chamber\" – so, yes, any Portal fans should have a great time simply reading the text. But we think Valve really missed a trick by not calling the Steam Deck the 'Aperture Science Handheld Portal Device' instead. (It's right there, Valve!)",
    "The outside of the box contains some very useful and very serious guidance, with images asking you to treat the Steam Deck as carefully as you would your own companion cube, and not to use it as an umbrella, throw it in a rage across the room, or keep around any giant magnets. The carrying case itself is a sleek, black affair, like a shockproof chiffon scarf.",
    "The blog post accompanying the images says that \"We’ve recently completed our DV (Design Validation) manufacturing build of Steam Deck, and we'll be using these units for additional testing and developer kits. DV is the final prototype build before production, and it includes improvements from the EV2 build. After this build, there will be additional minor changes in the final product.",
    "\"One of the main differences between these units and the previous (EV2) prototypes is that we are now testing our packaging design. So before we start sending these out to developers, we wanted to give you a sneak peek of the final packaging that customers will see in February.\"",
    "The units shown in these pictures, then, are on their way to developers, and there could be some slight changes in appearance compared to the Steam Decks sent out to customers in the coming February.",
    "The handheld gaming PC has been currying plenty of interest since its unveiling earlier this year, and many will have been disappointed at supply chain issues pushing the console's release date a couple of months forward.",
    "The company announced the delay in a blog post on November 10, blaming the supply chain crunch for the delay in shipments, which are expected to now begin in February 2022.",
    "It means no one will be playing on their Steam Deck over the holidays, either for long journeys and flights, or just for some 'me time' when you get tired of arguing with your relatives over Christmas dinner. (Just me?)",
    "But Valve's loss is undoubtedly someone else's gain. December is a key time for gift shopping and console buying, and the reappearing PS5 restock and Xbox Series X restock, as well as improved availability of the new Nintendo Switch OLED, means gamers are still well served for now. Let's just hope Valve doesn't land too late to make it into some people's homes."
  ],
  "headers": {
    "7": "Analysis: Holding out for the Steam Deck"
  },
  "links": {
    "delayed until February 2022": "https://www.techradar.com/news/suppy-chain-crisis-hits-steam-deck-delayed-until-february-2022",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "companion cube": "https://theportalwiki.com/wiki/Weighted_Companion_Cube",
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "blog post": "https://store.steampowered.com/news/app/1675180/view/3084396982306430712",
    "PS5 restock": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X restock": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review"
  }
}