{
  "source": "https://www.techradar.com/news/how-can-spotify-keep-artists-happy-live-music-events-apparently",
  "title": "How can Spotify keep artists happy? Live music events, apparently",
  "category": "audio-visual",
  "updated": "2021-07-01T09:25:41Z",
  "author": "olivia-tambini",
  "summary": "Spotify is reportedly branching out into live music",
  "article": [
    "Spotify has never had a smooth relationship with artists, with accusations that it doesn't fairly compensate music creators – but the streaming platform is reportedly hoping to improve this relationship with the help of live music events.",
    "According to a report in The Information (via Engadget), Spotify is considering a move into live events, possibly selling tickers for \"both virtual and live concerts\".",
    "Apparently, the main goal of this exercise isn't to make money from ticket sales (at first, anyway) – instead, Spotify is hoping that it can use the lure of live events to woo artists.",
    "The Information suggests that Spotify could use the data is has on artists to help them plan concerts in places \"most promoters avoid\", showing them that it's devoted to the careers of its musicians.",
    "Of course, there are benefits for Spotify aside from keeping artists happy. Offering live music events would give it another way of standing out from an increasingly competitive music streaming market, which recently saw Apple Music and Amazon Music Unlimited offer hi-res audio to their subscribers at no extra cost.",
    "While Spotify has its own plans to introduce a higher-quality streaming tier with Spotify HiFi, it will still be limited to CD-quality audio (16 bit / 44.1kHz) ; by comparison, Apple Music now offers up to 24 bit / 192kHz.",
    "Spotify has delivered live music events in the past, for instance with a 2019 Spotify On Stage concert series in Jakarta and Bangkok and more recently, with a prerecorded virtual concert featuring The Black Keys and Leon Bridges.",
    "Still, delivering live music events and using artist data to help musicians plan successful tours will be a big move for Spotify, and it could help it to further distinguish itself against its biggest rivals."
  ],
  "headers": {
    "4": "Keeping artists happy"
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "The Information": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5771904506300384000&xs=1&url=https%3A%2F%2Fwww.theinformation.com%2Farticles%2Fspotify-explores-expansion-into-events%3Futm_source%3Dtwitter%26utm_medium%3Dpage&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-can-spotify-keep-artists-happy-live-music-events-apparently",
    "Engadget": "https://www.engadget.com/spotify-events-report-212328784.html",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "at no extra cost": "https://www.techradar.com/news/apple-music-gets-huge-upgrade-with-dolby-atmos-and-lossless-streaming",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog"
  }
}