{
  "source": "https://www.techradar.com/news/vodafone-launches-europes-first-5g-multi-edge-computing-service",
  "title": "Vodafone launches 'Europe's first' 5G multi edge computing service",
  "category": "computing",
  "updated": "2021-06-17T12:41:46Z",
  "author": "steve-mccaskill",
  "summary": "Vodafone teams with AWS for 5G MEC",
  "article": [
    "Vodafone has launched a Multi-Edge Computing (MEC) service in the UK, paving the way for business customers to deploy 5G applications, such as real-time data analytics and AI, IoT, and virtual reality (VR), that rely on guaranteed performance.",
    "5G networks promise faster speeds and greater capacity that will allow for more reliable mobile connections.",
    "However, it is the promise of lower latency that will enable the most revolutionary use cases such as smart city applications, telemedicine, and mixed reality.",
    "But in order to deliver this lower latency, operators are decentralising their infrastructure and virtualising network functions so they can be moved closer to the customer. Edge computing allows data to processed nearer to the point of collection, even at a base station level, which lowers the time of transmission significantly.",
    "Vodafone is one of several operators that senses a business opportunity, especially as it seeks to transition from being a mere telecoms provider into a genuine technology company.",
    "The Newbury-based operator’s MEC service is enabled by Amazon Web Services (AWS) Wavelength, which brings compute and storage capabilities to the edge of the network, meaning data can be collected, processed, and sent back within 10 milliseconds.",
    "London, Oxford, Cambridge, Bristol and Cardiff are the first cities to benefit, with Vodafone promising to extend availability to Scotland and northern England in 2022.",
    "“We are taking our business beyond the traditional boundaries of telecoms connectivity services so that we can bring customers amazing new services,” said Anne Sheehan, Business Director at Vodafone UK.",
    "“Edge Compute and 5G is a combination no other service provider can deliver in Europe, which means we can offer something unique to our customers. We’ve already seen new services being developed by our trialists – the potential for completely new ideas enabled by this combination is massive.”"
  ],
  "headers": {
    "3": "Vodafone 5G edge"
  },
  "links": {}
}