{
  "source": "https://www.techradar.com/news/netflix-is-trying-to-crack-down-on-account-sharing",
  "title": "Netflix might stop you from password sharing soon",
  "category": "entertainment",
  "updated": "2021-03-12T12:33:19Z",
  "author": "harry-domanski",
  "summary": "The streamer is changing its stance on account sharing",
  "article": [
    "The ability to share accounts across multiple households has long been an accepted reality for Netflix, but now the streaming giant has finally begun trialing a system to prevent people from getting this kind of free ride.",
    "As spotted by GammaWire, a number of Netflix users have received warnings that state \"if you don't live with the owner of this account, you need your own account to keep watching\", along with the offer to start their own account with a free 30-day trial.",
    "In order to verify it was indeed their account (or, you know, someone else who they're in touch with) these users were offered to have a verification code sent to the account holder's email address or phone number via text.",
    "For those rare cases where someone is using another's account without their knowledge, this would obviously pose some problems. But for (presumably) the large majority of cases, where the sharing is a known factor, this hurdle should only present the minor inconvenience of getting in touch with the account holder.",
    "Back in 2016, Netflix not only stated that it knew about the act of account sharing, but also endorsed it, presenting it as a net positive for the company, which assumed that any leechers would eventually get their own account. With the streaming giant's latest actions, it seems that 'eventually' is now.",
    "The intent of this messaging has been confirmed by The Hollywood Reporter, with a spokesperson for Netflix telling the outlet that \"This test is designed to help ensure that people using Netflix accounts are authorized to do so,\" and also referring to the inherent security concerns of sharing passwords.",
    "It is currently in the trial phase, and according to the spokesperson, is in effect in different degrees in various regions, so as yet, there's no guarantee that the restrictions will roll out on a more global basis.",
    "Still, it's definitely worth keeping in mind if you're currently sharing your password with friends and family.",
    "Jake Moore, a cybersecurity specialist at ESET, commented on the matter and how our otherwise strict attitudes towards password sharing changes when it comes to services like Netflix.",
    "\"If I were to ask people if they share their email account password with anyone else, the vast majority would probably say 'absolutely no chance!'… but when it comes to media services such as Netflix, Amazon Prime and Spotify, such password sharing is actually quite common. It may sound innocent, but when people are using the same password for their media service that they use for other accounts, it starts to become dangerous, and the risk of account compromises increases.\"",
    "ESET researched the matter (you can see their report here), discovering that a quarter of people it surveyed had shared their Netflix password deliberately. Moore points out that the obvious danger of sharing your password is that the next person could share it with someone else.",
    "Moore suggests there's an easy fix, though, if you ever worry someone has access to your account without your knowledge – which is hopefully rare. \"However, it is unrealistic to expect that people are going to stop sharing their accounts completely, so my advice would be to regularly change your passwords in order to flush out anyone who has gained access over the last year who shouldn’t have. Creating complex passwords, combined with a password manager, will reduce your risk of compromise.\""
  ],
  "headers": {
    "4": "Netflix's history of sharing",
    "8": "Is there a security risk in sharing your Netflix password?"
  },
  "links": {
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "GammaWire": "https://gammawire.com/netflix-to-start-testing-warnings-for-people-borrowing-login-info/",
    "Netflix not only stated that it knew about the act of account sharing, but also endorsed it": "https://www.techradar.com/news/home-cinema/here-s-why-you-shouldn-t-feel-guilty-about-sharing-your-netflix-password-1312951",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/live-feed/netflix-password-sharing",
    "you can see their report here": "https://www.welivesecurity.com/2020/11/11/why-you-should-keep-netflix-password-yourself/"
  }
}