{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-a-surprise-minecraft-integration",
  "title": "Microsoft Teams is getting a surprise Minecraft integration",
  "category": "computing",
  "updated": "2021-05-04T13:00:06Z",
  "author": "joel-khalili",
  "summary": "In a strange turn of events, Minecraft is coming to Microsoft Teams",
  "article": [
    "Microsoft has announced a series of upgrades to its collaboration platform Teams designed to improve the online learning experience for pupils and teachers alike.",
    "Although the company will make a number of important changes, one feature in particular will likely draw the attention of students: an expansion of Minecraft: Education Edition, which will now “integrate seamlessly” with Teams.",
    "According to Microsoft, the integration will allow teachers to embed quizzes, assessments and Flipgrid topics within Minecraft game sessions, although it’s unclear precisely what this might look like.",
    "As part of the update, Microsoft will also introduce a new subscription package, called Minecraft for Camps and Clubs, built for teachers operating outside the four walls of the classroom.",
    "“Beginning this summer, camps, clubs, homeschool organizations and nonprofits can purchase licenses for Minecraft: Education Edition to support critical thinking, collaboration, and game-based learning for all ages,” said Microsoft.",
    "TechRadar Pro has asked for further clarification over the specifics and scope of the new Minecraft integration for Microsoft Teams.",
    "In a blog post dedicated to Teacher Appreciation Day in the US, Microsoft set out its vision for the future of online learning, as well as the tools it hopes can help teachers deliver “the next chapter of learning”.",
    "“For the past year, teachers have leveraged technology in innovative ways to keep students engaged. Technology went from being a temporary lifeline to facilitate connection in remote and hybrid learning, to a fully integrated part of many virtual and in-person classrooms,” wrote Barbara Holzapfel, VP of Microsoft Education.",
    "“To continue to support teachers and students, today we’re introducing new tools and updates designed to support the five key areas that help teachers create a holistic learning environment and move education forward: student centricity, skills focus, social learning, safety & security and scalability.”",
    "Beyond the new Minecraft integration, Microsoft also unveiled a new tool for Teams for Education, designed to help teachers evaluate the reading progress of their students. Using the service, educators can create reading tasks for classes or individuals, which can be used to assess data points such as accuracy rate and correct words per minute.",
    "Teams for Education is also getting new collaboration tools that Microsoft hopes will help improve group work, integrate audio and video elements into assignments and make it easy for pupils to track their outstanding tasks. These enhancements are expected to be made available before the start of the next school year.",
    "Finally, the company announced a new security feature for the platform, called Supervised Chat. Available later this month, the feature prevents students from starting chats unless a designated “appropriate educator” is present to supervise.",
    "Hozapfel rounded out the announcement by thanking teachers for their herculean strength during the pandemic and celebrating the innovations that have been made possible as a result.",
    "“When schools moved online last year, teachers made superhuman efforts to help all students stay engaged in learning. They identified and filled gaps, found ways to connect with everyone in their classes, worked together to address challenges, and developed strategies to transform education for a new era,” she said."
  ],
  "headers": {
    "6": "Online learning with Microsoft Teams"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "online learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives"
  }
}