{
  "source": "https://www.techradar.com/news/intel-lunar-lake-spotted-again-but-rumored-14th-gen-cpus-may-not-arrive-for-ages",
  "title": "Intel Lunar Lake spotted again – but rumored 14th-gen CPUs may not arrive for ages",
  "category": "computing",
  "updated": "2021-03-09T10:25:12Z",
  "author": "darren-allan",
  "summary": "Lunar Lake chips could be set to debut in 2024",
  "article": [
    "We’ve caught another glimpse of what could be Intel’s 14th-gen processors, which will theoretically be the fourth in line successor to current 10th-gen Comet Lake CPUs (although even Intel’s internal roadmaps of the further future are likely to be sketchy at this point).",
    "As VideoCardz reports, Lunar Lake processors were sighted in Linux patches (by osuosl via Coelacanth’s Dream), with support introduced for a Gigabit Ethernet (network) driver, indicating that early development could have just begun on these chips which may not debut until 2024 (or possibly 2023). In other words, we are still a very long way out.",
    "As you might expect, at this point there are no details on Lunar Lake, but its second appearance – following a sighting of the codename in GPU drivers last November – coupled with other rumors buzzing around Intel’s future CPUs, give us at least an indication of how Team Blue’s processor line-up could play out over the next few years (take all of this speculation with a whole heap of caution, naturally).",
    "As mentioned, currently we are on Comet Lake or the 10th-gen of Intel’s Core processors, with the next range, 11th-gen Rocket Lake, due to be unleashed at the end of the March.",
    "Alder Lake 12th-gen chips will follow later in 2021, not giving Rocket Lake much breathing space, and possibly arriving in September from the latest we’ve heard.",
    "After that, the overall picture becomes much cloudier, but we had previously heard that the next CPU range would be Meteor Lake (finally moving to 7nm), possibly arriving in 2022 or even 2023 (again this was spotted via an Intel Ethernet driver in Linux code). That would theoretically be before Lunar Lake products pitch up in 2023 or 2024.",
    "However, going by another leaker, AdoredTV, Intel could be making Meteor Lake mobile-only (like current Tiger Lake chips, Meteor Lake may not be the new 13th-gen desktop family, but could be aimed solely at laptops).",
    "AdoredTV’s theory is that Intel has a new offering, Raptor Lake, which is a refresh of Alder Lake (staying on 10nm and just tweaking things, in other words) planned for 2022, and this is Intel’s 13th-gen on desktop. It could then be followed by Lunar Lake as 14th-gen products (with Meteor Lake launching for laptops in 2022, perhaps later in the year than Raptor Lake).",
    "All of this is guesswork based on vague rumors floating down from the ever-churning mill, of course. Whatever the case, at this point we really don’t know much at all about Lunar Lake and when (or if) it might be realized.",
    "Given that Alder Lake rumors and teasers are flying around thick and fast now, if Raptor Lake is indeed a refresh planned for next year, we should start hearing more from the grapevine about that prospect soon enough.",
    "One thing we know for sure is that there are big changes in the pipeline with Alder Lake, which will run with a whole new design featuring performance and low-power efficiency cores (similar to ARM’s big.LITTLE tech). The latest rumor to emerge is that those low-power cores won’t just be useful when it comes to laptops and battery preservation, but will have enough oomph to actually contribute meaningfully to performance in a desktop PC. Exciting times, potentially."
  ],
  "headers": {
    "6": "Mobile Meteor?"
  },
  "links": {
    "VideoCardz": "https://videocardz.com/newz/intel-deploys-first-patches-for-lunar-lake-possibly-the-14th-gen-core-series",
    "osuosl": "https://lists.osuosl.org/pipermail/intel-wired-lan/Week-of-Mon-20210301/023498.html",
    "Coelacanth’s Dream": "https://www.coelacanth-dream.com/",
    "following a sighting of the codename in GPU drivers": "https://www.techradar.com/news/intel-lunar-lake-14th-gen-cpus-already-spotted-could-intel-have-a-serious-gameplan-to-catch-amd",
    "11th-gen Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "unleashed at the end of the March": "https://www.techradar.com/news/intel-finally-confirms-its-new-rocket-lake-s-processors-will-launch-on-march-30",
    "possibly arriving in September": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september",
    "Intel Ethernet driver in Linux code": "https://www.techradar.com/news/weve-already-caught-a-glimpse-of-intels-13th-gen-meteor-lake-cpus",
    "AdoredTV": "https://adoredtv.com/exclusive-intel-client-cpu-roadmap-update-for-2021/",
    "Alder Lake rumors": "https://www.techradar.com/news/intel-adler-lake-s-will-support-ddr5-according-to-new-benchmark",
    "Alder Lake, which will run with": "https://www.techradar.com/news/intel-alder-lake-12th-gen-cpus-could-usher-in-a-new-socket-in-2021-leaving-z490-motherboards-out-in-the-cold",
    "but will have enough oomph": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought"
  }
}