{
  "source": "https://www.techradar.com/news/lgbtq-gaming-week-and-the-craziest-ces-tech-noise-cancelling-podcast-episode-48",
  "title": "LGBTQ+ gaming week and the craziest CES tech: Noise Cancelling podcast episode 48",
  "category": "phones",
  "updated": "2021-01-22T09:38:18Z",
  "author": "adam-vjestica",
  "summary": "Episode 48 of our tech podcast is here",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's show is presented by Gareth Beavis, TechRadar's Global Editor-in-Chief, and Sherri L. Smith, Editor-in-Chief of Laptop Mag.",
    "This week our guests are Jess Weatherbed, Computing Writer at TechRadar, and Ty Galiz-Rowe, Editor-in-Chief at Uppercut, who join us (remotely, of course) to talk about the last seven days in tech.",
    "As usual, we're talking about a variety of topics from the world of tech. We begin the show with this week's Big Question: which video game developer do you want to see take over a famous franchise?",
    "In the news section, we're talking about TechRadar's LGBTQ+ week, Marvel's WandaVision and Resident Evil Village. We also blitz through all the tech news, and discuss the Samsung Galaxy S21.",
    "Meanwhile, this week's Unpopular Opinions is replaced by a roundup of our best gadgets of CES 2021.",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 48:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/",
    "Tom's Guide": "https://www.tomsguide.com/",
    "TechRadar's LGBTQ+ week": "https://www.techradar.com/news/techradar-lgbtq-gaming-week-2021",
    "WandaVision": "https://www.techradar.com/news/wandavision-episode-9-release-date-on-disney-plus-when-is-the-season-finale",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "CES 2021": "https://www.techradar.com/ces-2021",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1372621728913353500&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}