{
  "source": "https://www.techradar.com/news/walmart-ps5-xbox-restock-time-12pm-and-9pm",
  "title": "Walmart PS5 and Xbox restock sold out in 50 minutes – here's when to buy it next",
  "category": "gaming",
  "updated": "2021-08-18T19:25:14Z",
  "author": "matt-swider",
  "summary": "Walmart had two restocks on Thursday – a rare move – and we were able to help over a thousand people secure the consoles with our Twitter tracker alerts.",
  "article": [
    "Update: If you missed the Walmart Xbox and PS5 restock double-header on Thursday, then you should follow our PS5 and Xbox restock tracker Matt Swider who will send you an alert – when they're in stock – if you follow his Twitter account and turn on notifications. Over a thousand people were able to buy PS5 and Xbox consoles at 12pm EDT during the first restock and 9pm EDT during the nighttime drop, and all were at MSRP. Deliver dates are slipping to October now at Walmart, but stores like GameStop – which may have the console next week (big news to come from there soon) – are delivering 3 to 5 days.",
    "Here's how to get an alert for the next PS5 and Xbox Series X restock:",
    "What to do today before the next restock: Click on this screenshot of this example of a Walmart PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts. This is what you'll see when there's the PS5 is in stock.",
    "The official Walmart PS5 and Xbox Series X restock time was 12pm EDT / 9am PDT, and the American retailer will be selling the consoles for MSRP. But that's not all.",
    "There was a second nighttime restock at Walmart, with another batch of PS5 and Xbox consoles that went live at 9pm EDT / 6pm PDT, which was appreciated by anyone who works during normal restock dates.",
    "These are abnormal PS5 and Xbox restock times for Walmart. While the retailer does do restocks on a Thursday (but not every Thursday), it's usually at 3pm EDT. Clearly, Walmart is switching up the times, breaking it into one-hour sessions to give more people a chance to buy the console if they're not able to get to a computer or phone at 3pm EDT.",
    "Like past Walmart restocks, these are online-only purchases with ship-to-home deliveries that have now pushed into early October 2021. The first morning restock did have dates a bit sooner, with September 22, 2021 being very popular. Sometimes Walmart does deliver sooner than the estimated date.",
    "This is where we taught people how to buy consoles: our Walmart PS5 and Xbox Series X restock live stream. The purchase process can be complicated, so it helps to have someone walk you through it on a YouTube live stream video.",
    "Update: While the times have changed, our Walmart guide remains the same. Here's what to do to get the PS5 and Xbox Series X in your cart.",
    "Walmart is the most popular retailer in the US, so consoles sell out quickly when the PS5 is in stock. This is one case in which the mobile app is the hero and the website is the sidekick. We'll explain how and why you should use both during a PS5 drop at Walmart."
  ],
  "headers": {
    "3": "Walmart PS5 and Xbox restock time double-header",
    "7": "Walmart PS5 and Xbox Series X restock live stream",
    "8": "Our Walmart PS5 buying guide remains unchanged"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 and Xbox restock tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Walmart PS5 and Xbox Series X restock live stream": "https://youtu.be/SIwk1Umuzro"
  }
}