{
  "source": "https://www.techradar.com/news/new-dyson-v15-detect-uses-lasers-to-shine-a-light-on-every-speck-of-dirt",
  "title": "Dyson V15 Detect uses lasers to highlight hidden dust",
  "category": "appliances",
  "updated": "2021-03-25T16:57:26Z",
  "author": "sharmishta-sarkar",
  "summary": "It will even measure the dust intake and graphically show you what it's sucking up",
  "article": [
    "Dyson has a new flagship cordless vacuum joining its ranks that will illuminate dirt and dust on your floors. The Dyson V15 Detect uses a laser dust-detecting system to shine a light on every last speck, even if you can't see it with the naked eye. This could make it one of the best vacuum cleaners on the market.",
    "The Dyson V15 Detect is priced at $699.99 / £599.99 and is available in the US now while in the UK it's listed as coming soon, although you can register to get an alert when it goes on sale through dyson.co.uk. There's no word on whether it will be made available in Australia yet.",
    "The dust-detection tech is housed within an upgraded Fluffy cleaning head (the soft roller brush designed for hard floors and comes with several Dyson handsticks) called the Slim Fluffy.",
    "It uses laser diodes, mounted at an angle of 1.5 degree and 7.2mm off the ground, to cast an eye-safe, short green beam of light in front of the cleaning head. These specifications, according to Dyson, offers \"the best contrast between dust and floor\", with the light highlighting specks of dirt and debris.",
    "While other vacuum cleaning heads use lights to show you where you're vacuuming, the Dyson V15 Detect is meant to instead show what you're vacuuming.",
    "The average size of dust, plant spores and mold is about 10 microns and, Dyson claims, the V15 Detect will, well, detect particles that small. Dyson said one of its engineers noticed airborne particles in their home glistened in the sun, which lead the brand to research how it could use this to identify the fine dust often missed in homes.",
    "The V15 Detect is also fitted with an acoustic piezo sensor to detect sounds and vibrations of particles. Alongside a new microprocessor, this sensor allows the appliance to monitor the size and quantity of dust it's sucking up. This is then displayed graphically on the V15's built-in LCD monitor on the back of the main handheld unit, giving you a clear picture of the condition your floors are in.",
    "The vacuum cleaner will also automatically increase the suction power if the piezo sensor detects high levels of dust, so you don't have to go over and over the same spot several times. Once the piezo sensor detects a drop in dust levels, it then reduces the suction back to the level it was previously at.",
    "The Dyson V15 Detect features a hyperdymium motor that spins at up to 125,000rpm to generate 230 Air Watts, which is 24% more suction than the V11 range offers. Dyson also claims the V15 detect the five-stage filtration system of the vacuum cleaner captures 99.99% of dust particles that are as small as 0.3 microns",
    "The V15 Detect also ships with a small conical brush designed specifically to clean hair and fur from upholstered surfaces (like car seats and furniture). The shape of the cleaning tool causes strands to move towards the slimmer end without tangling with the brush, from where they're sucked into the bin.",
    "According to Dyson engineers, this anti-tangle process works only on smaller-sized tools, so an additional carpet-cleaning head isn't an option. In theory, the small tool can be used on carpets, but it will take you longer because of its smaller footprint.",
    "They have, however, given High Torque Cleaner Head, which debuted on the V11 range, a makeover in a bid to reduce hair getting caught in it. More than 50 polycarbonate teeth are arranged in the cleaner head in a bid to stop hair tangling around the bristles of the cleaner head.",
    "These new innovations mean the V15 Detect is best used on hard floors, but we can't wait to test it to see if it performs just as well on rugs and carpets.",
    "According to Dyson, the V15 Detect is 'part of a new range of vacuums being launched by the brand, although it has yet to confirm how models in the range, and further details about whether these vacuums differ from the V15 Detect."
  ],
  "headers": {
    "5": "Light 'em up, Sparky",
    "9": "No more tangles"
  },
  "links": {
    "best vacuum cleaners": "https://www.techradar.com/news/best-vacuum-cleaners",
    "dyson.co.uk": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5859230237708893000&xs=1&url=https%3A%2F%2Fwww.dyson.co.uk%2Fcoming-soon&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnew-dyson-v15-detect-uses-lasers-to-shine-a-light-on-every-speck-of-dirt"
  }
}