{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-might-not-launch-this-year",
  "title": "Samsung Galaxy Watch Active 4 might not launch this year",
  "category": "wearables",
  "updated": "2021-06-25T08:59:06Z",
  "author": "james-rogerson",
  "summary": "Conflicting reports",
  "article": [
    "We’ve heard from a lot of leakers about the Samsung Galaxy Watch Active 4 lately, and yet one of the best leakers in the business has just suggested that they don’t think it’s coming.",
    "Evan Blass (who has an excellent track record) tweeted \"Remind me why we're expecting a new Galaxy Watch Active model....\", then in response to a reply saying \"Because leakers said it’s coming\" added “This leaker thinks it ain’t.”",
    "It’s not clear from that whether they mean at all or just this year, but without additional information, we’ll assume the latter.",
    "That said, despite the credibility of the source we’d certainly take this with a pinch of salt, given that we recently saw renders supposedly showing the wearable, which also came from a credible leaker (@OnLeaks). Yet another leaker with a good track record (@rquandt) has also recently tweeted that the Samsung Galaxy Watch Active 4 is on the way.",
    "So what’s going on here? Most leaks so far suggest that both the Samsung Galaxy Watch 4 and Samsung Galaxy Watch Active 4 are landing soon, probably at the same time.",
    "So it’s possible that actually we’re just going to see the Galaxy Watch 4, but perhaps in a number of configurations – and maybe with the option of a sporty band. That could potentially lead to confusion and assumptions that some configuration of it is the Samsung Galaxy Watch Active 4.",
    "Certainly, launching the two wearables at around the same time would seem a slightly odd choice, given that rumors suggest they’re quite similar. Indeed, typically Samsung spreads them out. The Samsung Galaxy Watch 3 for example was released around a year after the Samsung Galaxy Watch Active 2, and there hasn’t been a Watch Active 3, with Samsung thought to be skipping that number.",
    "So it would make sense if a Samsung Galaxy Watch Active 4 wasn’t landing anytime soon, except that it’s been so extensively leaked, and we wouldn’t think every leaker involved would simply be confusing it with some configuration of the Galaxy Watch 4.",
    "It’s also possible that Blass is trying to subtly suggest perhaps that we will see another wearable alongside the Galaxy Watch 4, but that it won’t be called the Samsung Galaxy Watch Active 4. But that seems a stretch from his comments.",
    "Most likely he really is saying that there’s only one upcoming Samsung smartwatch, and at this stage we’re really not sure whether he’s right about that or not. Hopefully we’ll find out soon, as Samsung is thought to either be announcing its upcoming wearable(s) on August 3, or possibly even on June 28, at a talk that’s thought to mostly be about smartwatch software."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "tweeted": "https://twitter.com/evleaks/status/1408207396397256705",
    "added": "https://twitter.com/evleaks/status/1408208286005043207",
    "saw renders supposedly showing the wearable": "https://www.techradar.com/news/samsung-galaxy-watch-active-4-renders-give-us-our-first-look-at-the-likely-design",
    "@rquandt": "https://twitter.com/rquandt/status/1407003855573815297",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Samsung Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "on August 3": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch"
  }
}