{
  "source": "https://www.techradar.com/news/a-new-sonos-ikea-symfonisk-speaker-could-land-in-june",
  "title": "A new Sonos IKEA Symfonisk speaker could land in June",
  "category": "audio-visual",
  "updated": "2021-05-24T14:05:50Z",
  "author": "olivia-tambini",
  "summary": "Is a new lamp speaker in the works?",
  "article": [
    "We've been hearing rumors of a new Sonos / IKEA collaboration for a while now, and a new leak may have revealed the date that new Symfonisk speakers will launch.",
    "According to a leaked document, which seems to be an internal IKEA marketing calendar and was shared on Reddit (via ExecutiveTraveller), a \"SYMFONISK Virtual Press Event\" will take place on June 14.",
    "Sonos and IKEA have teamed up in the past to create wireless speakers that look like pieces of furniture; in 2019, the companies launched a bookshelf speaker and a lamp speaker.",
    "Not too long ago, we heard that there would be more on the way. According to an FCC filing and a report from The Verge, it looks like the Symfonisk lamp speaker will be getting a refresh, with the newer model costing around the same price ($179 / £150 / AU$269).",
    "We may not just be getting one new speaker on June 14. Another item that Sonos and IKEA are reportedly planning to bring to the Symfonisk line will take the form of \"a piece of wall art with an integrated speaker\", if The Verge's sources prove accurate.",
    "As there hasn't been an official announcement yet, details on both products are light on the ground (outside of knowing that a cable will need to run up to the wall art), so we'll have to wait for the companies to unveil the products to learn more.",
    "A speaker that's built into a piece of art is an interesting concept, but as we said earlier this year, we think its success will depend on whether or not the product offers a set range of images, or if it allows customers to mount or frame their own pictures.",
    "Right now, you can buy a range of prints to furnish the home at IKEA, so it's certainly possible that the new Symfonisk will follow this model – but we hope it also offers the option of a 'blank canvas', so you can really take advantage of the unusual form factor."
  ],
  "headers": {
    "4": "Sound meets art"
  },
  "links": {
    "new Sonos / IKEA collaboration": "https://www.techradar.com/news/sonos-and-ikeas-next-collab-could-integrate-speakers-into-wall-art",
    "ExecutiveTraveller": "https://www.executivetraveller.com/news/ikea-to-launch-new-sonos-symfonisk-speakers-on-june-14",
    "wireless speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079/news/best-speaker",
    "bookshelf speaker": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-bookshelf-speaker",
    "lamp speaker": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-lamp-speaker",
    "FCC filing": "https://fccid.io/FHO-920-00632",
    "The Verge": "https://www.theverge.com/2021/4/6/22370130/ikea-sonos-symfonisk-2021-lamp-wall-art-artwork-speaker",
    "earlier this year": "https://www.techradar.com/news/sonos-and-ikeas-next-collab-could-integrate-speakers-into-wall-art"
  }
}