{
  "source": "https://www.techradar.com/news/why-you-should-wait-until-prime-day-to-buy-an-action-camera",
  "title": "Why you should wait until Prime Day to buy an action camera",
  "category": "cameras",
  "updated": "2021-06-16T10:47:02Z",
  "author": "andrew-williams",
  "summary": "Action camera bargains are on the horizon",
  "article": [
    "The Amazon Prime Day deals are one of the best times of the year to buy an action camera. Just like Black Friday, we tend to see some big price cuts over the shopping event, which this year lands on June 21-22.",
    "TechRadar spends the entire sale period on high alert each year. We sift through the tens of thousands of discounts to find the real deals, and we'll be doing the same for adventure-proof cameras.",
    "OLED TVs, fancy Sony headphones and Nintendo Switch sales may suck up much of the oxygen, but there are always some great action camera deals, too. And it pay may to forget the notion that GoPros are the only action cameras you should buy. Here’s why.",
    "We recently took a whole stack of cheap action cameras across fields and beaches to separate the best from the bad. Some were really bad, but some made a mockery of their low price tags. These cameras come from names which many of you may not be familiar with, but they make up the bulk of Amazon Prime Day action camera discounts.",
    "Among our favorites was the Apeman A100. It’s a 4K action camera that offers image quality not too far off a GoPro Hero Black. Its stabilization may not be as effective, but that doesn’t matter too much considering how much less money you have to spend. Last Prime Day, the Apeman A100 was on sale for 27% off its usual price. And the ‘usual price’ is less than a third of what you’d pay for a top GoPro.",
    "If you’re willing to spend a little more you should also look out for discounts on DJI and Insta360 action cameras.",
    "DJI set out to beat GoPro with its DJI Osmo Action. And, in some ways at least, it did. Last Prime Day, we got to save around 25% off the camera, and it was possibly the best mid-price action camera you could get at the time, at that price.",
    "The Osmo Action stood out when it arrived in 2019 thanks to its large front screen. It was high on many vloggers’ wish lists. Its image quality and stabilization effectiveness is pretty close to what you get from a top GoPro, too.",
    "We also hope to see a discount for the Insta360 Go 2 this Prime Day. It’s a relatively new camera, but last year we did see a tasty 20% off the original Insta360 Go.",
    "The second generation model is a big upgrade. It has much better image quality, which is particularly useful if you want to shoot under tree cover or in so-so lighting. And it comes with a charger case that has a little mode screen and built-in micro tripod. It’s a real go-anywhere action camera and another one to look out for.",
    "Okay, so we’ve given you some other options, but for many GoPro is still more-or-less synonymous with action cameras – and rightly so.",
    "Last Prime Day, the big GoPro discounts were bundles rather than solo cameras. That means things like extra batteries, mounts or the diver’s case. While GoPro cameras are water resistant you’ll still need to use a rubber sealed case for any proper underwater work. No official GoPro accessories come cheap, so these bundles are well worth considering if you’ll use your action camera a lot, or in a bunch of different scenarios.",
    "There’s also more scope for some hotter GoPro deals this year. Last year, Prime Day landed in the middle of October, just shortly after the release of the excellent GoPro Hero 9 Black.",
    "Now that we are the better part of a year away from that launch, higher Hero 9 Black discounts may be on offer as there’s less worry about devaluing a brand new product.",
    "Only interested in GoPro cameras without the accessories? Last year we saw some reductions of around 15% on the GoPro Hero 8 Black and Hero 7 Silver lines in some territories.",
    "We recommend the Hero 8 Black and Hero 9 Black this year for the more discerning would-be action camera user. The Hero 7 Silver does not quite reach the same image quality heights, but also makes for a solid casual use action camera. And it has 4K capture, unlike the previous Hero 7 White.",
    "Don’t forget 360-degree cameras. The best of these cost a little more than most standard action cameras, but let you create truly eye-catching effects by transitioning from different fields of view and tilting the scene in the edit. 360-degree cameras are not just about actually recording 360-degree footage.",
    "Out favorite of these is probably the GoPro Max. Its stabilization is out of this world, its small enough to mount in places you might put a regular action cam, and it makes for a decent standard wide-angle view camera, too.",
    "GoPro Max deals are very rare, although we did see a solid discount on it a week before Black Friday 2020. We may well get a classic GoPro Max bundle deal this Prime Day, where you effectively get some accessories for next-to free. A telescopic tripod stick is a must for the Max. And we’ll never say no to more batteries, or GoPro’s handy dual battery charger.",
    "Insta360 is the other major name to watch in 360-degree action cameras. And the models we want to see are the Insta360 One R and Insta360 One X2.",
    "The One X2 is a dedicated 360-degree camera. It’s an easy-to-use, chocolate bar-shaped camera that can at times produce slightly more detail than the GoPro Max, although we prefer GoPro’s color and the GoPro produces cleaner results at night. The One X2 has a handy HDR mode too, and a flat Log mode for those who use proper editing software. The GoPro Max records clearer audio, though.",
    "If we get a good Insta360 One X2 discount on Prime Day 2021, it could be worth buying instead of a GoPro Max.",
    "The Insta360 One R is rather different, and one of the most ambitious action cameras out there. It’s a modular camera. You can get standard wide-angle and 360-degree lens modules, and a slightly larger one with a massive 1-inch sensor.",
    "There’s a great opportunity for a Prime Day discount here, particularly for bundles that include two of these three imaging modules. It’s like having two different cameras, although we tend to choose a module before a shoot and stick with it, as you do have to deconstruct the thing to switch lenses. It only takes a handful seconds, but probably isn’t something you want do while taking a pitstop on your bike, or similar.",
    "Last year Prime Day discounts didn’t just pop up on Amazon, but on Insta360’s own store. You could get 15% off plus a free accessory, so it is well worth bearing mind mind stores outside of Amazon during the shopping event.",
    "Overall, then, there are lots of potential action camera bargains during the Prime Day sales, and we'll be on hand to point you towards the pick of them."
  ],
  "headers": {
    "3": "Prime time for cheap action cameras",
    "10": "What about GoPro action cameras?",
    "16": "Keep an eye on 360 cameras"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Apeman A100": "https://www.techradar.com/news/best-action-camera",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "Insta360 Go 2": "https://www.techradar.com/reviews/insta360-go-2",
    "360-degree cameras": "https://www.techradar.com/news/best-360-degree-camera",
    "GoPro Max": "https://www.techradar.com/reviews/gopro-max",
    "Insta360 One R": "https://www.techradar.com/reviews/insta360-one-r",
    "Insta360 One X2": "https://www.techradar.com/reviews/insta360-one-x2"
  }
}