{
  "source": "https://www.techradar.com/news/amazon-could-unveil-a-soundbar-and-new-15-inch-echo-show-on-tuesday",
  "title": "Amazon could unveil a soundbar and new 15-inch Echo Show on Tuesday",
  "category": "audio-visual",
  "updated": "2021-09-24T21:33:30Z",
  "author": "nick-pino",
  "summary": "A new report has all the details",
  "article": [
    "Amazon could use next week’s hardware and services event to show off a new soundbar for TVs, a 15-inch Echo smart display, a second-generation Echo Auto device and new wearables, according to a new report.",
    "The report comes by way of Bloomberg who has gleaned information about some of Amazon’s upcoming projects from its Lab126 division. If that name sounds familiar, that’s the division that constructed the original Echo and Echo Show devices, and is often hard at work building the next generation of flagship products.",
    "Among the devices we’ll purportedly see at next week’s briefing are a larger-screen display that could act as both a home control panel when it’s wall-mounted or a large screen tablet in the kitchen when it’s on a mount.",
    "The device sounds like it will share much of the same DNA as the smaller Amazon Echo Show devices but might have a special ability to help you track your Amazon packages on their trip to your doorstep.",
    "Also on the docket is a smart soundbar – something that other third-party companies already produce – but Amazon's in-house model could potentially come with a built-in camera for video chats similar to Facebook’s Portal Go devices.",
    "Lastly, Bloomberg’s report mentions more vehicle integrations and a potential second-generation Amazon Echo Auto device that could be mounted on the dashboard. That move could make Amazon a larger player in the automotive space, which has largely been dominated by Apple’s CarPlay and Google’s Android Auto.",
    "As TechRadar reported earlier this week, Amazon will be holding its annual hardware and services event on September 28 at 9 am PST / 12 pm EST / 5 pm BST.",
    "While Amazon isn’t making a livestream of the event available to the public, it has invited a number of mainstream technology publications who will be publishing the news as it becomes available.",
    "As for how much of Bloomberg’s reporting will show up on Tuesday, however, it's still a matter of debate. Amazon’s only likely going to show what’s ready to be sold before the end of the year – it really doesn’t show off its products too far in advance.",
    "That being said, we’d wager that the 15-inch Echo Show screen will likely be there as we’ve heard rumors about it since last year, as will the Alexa soundbar. The soundbar would be a nice pairing with the Amazon-branded Omni TVs that the company announced earlier this month and makes sense given Amazon’s previous experience developing speakers.",
    "As always we’ll take everything we hear with a grain of salt – but, if we know one thing, it’s that you can count on some decently sized announcements on Tuesday afternoon so be sure to keep your eyes peeled for news as it drops."
  ],
  "headers": {
    "6": "Analysis: Keep your eyes peeled for Amazon news on September 28"
  },
  "links": {
    "Echo Auto": "https://www.techradar.com/news/amazon-brings-alexa-to-your-car-with-the-echo-auto",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-09-24/amazon-working-on-large-wall-echo-sound-bar-and-new-auto-device?sref=wO5UIwAS",
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-8",
    "Facebook’s Portal Go": "https://www.techradar.com/news/the-new-facebook-portal-go-makes-video-calling-on-a-smart-display-even-better",
    "reported": "https://www.techradar.com/news/the-next-batch-of-amazon-echo-devices-will-be-unveiled-on-september-28",
    "Amazon-branded Omni TVs": "https://www.techradar.com/news/amazon-is-making-its-own-tvs-and-theyre-surprisingly-affordable"
  }
}