{
  "source": "https://www.techradar.com/news/bluehost-owner-snaps-up-wordpress-seo-tool-yoast",
  "title": "Bluehost owner snaps up WordPress SEO tool Yoast",
  "category": "computing",
  "updated": "2021-08-13T19:00:17Z",
  "author": "anthony-spadafora",
  "summary": "Acquisition will allow Newfold Digital to help its customers attract more visitors to their sites",
  "article": [
    "Newfold Digital, which owns Bluehost and many other web hosting companies, has acquired the WordPress SEO plugin provider Yoast for an undisclosed sum.",
    "The acquisition is part of web technology provider's long-term strategy to empower the online success of its customers by providing them with access to the best web presence tools and services.",
    "President and CEO of Newfold Digital, Sharon Rowlands explained in a press release why Newfold Digital decided to acquire the company behind the popular SEO tool, saying:",
    "\"SEO is a growing need in our customer base and essential to online success, especially as we see more businesses expand their online presence. Yoast is a well-known and respected brand in the WordPress community. We are excited to welcome them to the Newfold family and to help improve SEO and drive visitors to our growing customer base.\"",
    "Yoast is a popular WordPress plugin that powers more than 12m websites and helps site owners generate more visitors from search engines and social media while also increasing reader engagement.",
    "At the same time though, the company provides online courses on SEO, keyword research, ecommerce, WordPress and more through its online academy.",
    "Once the acquisition is complete, Yoast will continue to provide its world-class SEO services while joining Newfold Digital's growing portfolio of brands which include Web.com, Domain.com, HostGator and others. Additionally, all of Yoast's employees as well as its leadership team will join Newfold Digital.",
    "CEO of Yoast, Marieke van de Rakt provided further insight on how the deal will allow Yoast to remain one of the best WordPress SEO plugins, saying:",
    "\"We're excited to join Newfold Digital to continue our mission of SEO for everyone by leveraging the leading global portfolio of web presence brands. We are confident that the strength and leadership Newfold Digital provides will help to ensure Yoast remains the most used SEO plugin for WordPress for many years to come and will fuel future innovation.\""
  ],
  "headers": {
    "4": "Yoast acquisition"
  },
  "links": {
    "Bluehost": "https://www.techradar.com/reviews/bluehost",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "WordPress SEO plugin": "https://www.techradar.com/best/wordpress-seo-tools",
    "press release": "https://www.prnewswire.com/news-releases/clearlake-and-siris-backed-newfold-digital-acquires-yoast-to-help-customers-get-found-online-301354538.html",
    "SEO tool": "https://www.techradar.com/news/best-seo-tool",
    "WordPress plugin": "https://www.techradar.com/best/best-wordpress-plugins",
    "online courses": "https://www.techradar.com/best/online-class-sites-do-these-online-courses-from-the-comfort-of-home",
    "keyword research": "https://www.techradar.com/best/keyword-research-tools",
    "Web.com": "https://www.techradar.com/reviews/webcom",
    "Domain.com": "https://www.techradar.com/reviews/domaincom",
    "HostGator": "https://www.techradar.com/reviews/hostgator",
    "Newfold Digital": "https://www.techradar.com/news/theres-a-new-big-name-on-the-web-hosting-scene"
  }
}