{
  "source": "https://www.techradar.com/news/web-hosting-sector-could-be-facing-a-long-wait-for-component-deliveries",
  "title": "Web hosting sector could be facing a long wait for component deliveries",
  "category": "computing",
  "updated": "2021-07-20T14:54:47Z",
  "author": "abigail-opiah",
  "summary": "Server industry continues to face major shortages",
  "article": [
    "Businesses in the web hosting industry could be waiting up to a year for component deliveries as the server sector continues to face ongoing shortages.",
    "According to Mitac Holding president Billy Ho, the server industry is currently having to wait up to 52 weeks for its component deliveries, which is set to only get worse in the second half of 2021, and little chance of improvement until 2022.",
    "This is largely due to the fact that component demands from other industries will also be increasing this year.",
    "Some of the key components facing shortages include motherboards ICs, SSDs and processors. With the current tight supply, the shortages have also had a direct effect on the prices of these components as costs hit record high levels. COVID resulted in substrate and wafer shortages and reduced assembly capacity.",
    "Widespread shortages across the computing industry were first raised in April 2021, when Cisco Chairman and CEO Chuck Robbins, said the shortage of computer chips is set to last for most of this year.",
    "In the case of web hosting providers, in order for them to continue renting out their services and technologies to host websites on the internet, the components used to connect their computers to the servers that host websites must be readily available.",
    "Mitac Computing president Michael Lin said although the company's orders for the third and fourth quarters are almost equivalent to those in the second, the company's shipments in the second quarter may be the peak of 2021 because of component shortages, according to reports.",
    "Mitac Computing's server motherboard production is mainly handled in Taiwan and China, and the company's server assembly lines are in the US, Taiwan and China.",
    "Via DigitalTimes Asia"
  ],
  "headers": {
    "3": "Shortages all around"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "server": "https://www.techradar.com/news/best-small-business-servers",
    "motherboards": "https://www.techradar.com/news/computing-components/motherboards/best-motherboard-14-reviewed-and-rated-904229",
    "SSDs": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "processors": "https://www.techradar.com/news/best-processors",
    "DigitalTimes Asia": "https://www.digitimes.com/news/a20210719PD207.html?mod=2"
  }
}