{
  "source": "https://www.techradar.com/news/android-12-could-bring-back-a-hidden-shortcut-that-got-pulled-from-android-11",
  "title": "Android 12 could bring back a hidden shortcut that got pulled from Android 11",
  "category": "phones",
  "updated": "2021-01-23T12:00:14Z",
  "author": "david-nield",
  "summary": "Double-tap to launch",
  "article": [
    "All being well we should see Android 12 arrive later this year, and the latest rumor around the software release is that Google is bringing back a hidden shortcut that we first saw in the developer preview of Android 11 – at least on Pixel phones.",
    "The shortcut we're talking about is the double-tap on the back, which – according to information seen by 9to5Google – could launch the Google Assistant, take a screenshot, start and stop media, show your phone's notifications or open up the recent apps view, depending on how you want to use it.",
    "We were a little disappointed the the double-tap gesture got pulled from Android 11 after showing up in early versions of the code – although it was never fully enabled. By the time Android 11 launched in September, the feature had disappeared completely.",
    "It would seem Google has changed its mind again, though there's still no guarantee that the shortcut will make it all the way to the final release of the operating system, or be available for phones that aren't in the Pixel line. As per 9to5Google, the feature is codenamed Columbus.",
    "The new report says the double-tap gesture was originally slated to take over from the old Active Edge squeeze gesture on the Pixel 4 phones – noticeably missing from the Pixel 4a, Pixel 4a 5G, and Pixel 5 – but was found to be too sensitive to work properly.",
    "Now it would seem that those issues have been overcome, with the gesture only able to be activated with a firm double-tap on the back of a handset. As you would expect from the usually ultra-customizable Android, if you don't like the shortcut then you'll be able to turn it off and ignore it.",
    "If Google follows the same schedule as last year, then we might see a limited developer preview of Android 12 as early as February. We've already heard that the software update could include Wi-Fi sharing as one of its new features.",
    "A very similar gesture was added to the iPhone with the release of iOS 14, which Apple calls Back Tap – the shortcut can be customized to take a screenshot, open Control Center, and more. For Android, there is a third-party software option called Tap, Tap that you can use until Android 12 gets here."
  ],
  "headers": {
    "4": "Tap happy"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "9to5Google": "https://9to5google.com/2021/01/22/android-12-should-mark-return-of-columbus-double-tap-gesture-for-pixels/",
    "in early versions of the code": "https://www.techradar.com/news/android-11-could-let-you-double-tap-the-back-of-your-pixel-to-launch-apps",
    "the Pixel line": "https://www.techradar.com/reviews/google-pixel-5",
    "the Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "the usually ultra-customizable Android": "https://www.techradar.com/how-to/10-ways-to-customize-your-android-phone-to-make-it-feel-like-new",
    "could include Wi-Fi sharing": "https://www.techradar.com/news/android-12-looks-set-to-borrow-one-of-the-best-ios-features-wi-fi-sharing",
    "Tap, Tap": "https://forum.xda-developers.com/t/app-beta-0-9-tap-tap-double-tap-on-back-of-device-gesture-from-android-11-port.4140573/"
  }
}