{
  "source": "https://www.techradar.com/news/how-data-storage-and-management-must-evolve",
  "title": "How data storage and management must evolve",
  "category": "computing",
  "updated": "2021-02-16T11:32:11Z",
  "author": "w-curtis-preston",
  "summary": "How data storage & management must evolve",
  "article": [
    "According to American socio-biologist Edward O. Wilson, “The real problem of humanity is the following: we have Paleolithic emotions, medieval institutions, and god-like technology.”",
    "This might explain why some of us can’t help but hoard our belongings (new and old), despite the relative abundance of our environment. From old iPhone boxes and bills to more miscellaneous documents and files, we’ve all had that sense of ‘I should hold on to that’ even though we haven’t looked at whatever ‘that’ is, in years.",
    "The same goes for organizations and data storage. Businesses’ digital storage cabinets are bursting at the seams with a plethora of sensitive data - from floating files and old images to old passwords and ex-employee details.",
    "In her bestselling book and hit Netflix show, organizational expert Marie Kondo taught the world about “the life-changing magic of tidying up”, and that if you properly simplify and organize your home once, you'll never have to do it again. While we can’t quite say the same about data, organizations can certainly get a lot closer to achieving ‘zero touch data protection’ in 2021 if they adopt a similar mindset.",
    "One of the biggest challenges facing CIOs and CISOs is the sheer scale of data. After all, humans are somehow managing to generate 2.5 quintillion bytes of data every day, and more than half of all organizations have doubled their online data over the last two years.",
    "Without proper visibility, IT management teams are unable to optimize storage costs, enforce data retention policies, or respond quickly to data discovery requests. This situation, if left unchecked, will only get worse as more data is created and expose the organization to incredible amounts of risk. With millions of workers now dispatched to home offices and kitchen tables all over the world, organizations have had to abandon slower digital transformation plans and shift their operating models almost overnight.",
    "Cloud migrations and the adoption of virtual collaboration solutions have rapidly sped up to ensure the newly digital workforce has access to the tools and information they need to stay productive and secure. Consequently, data is being produced, shared and stored in more ways than before. This is creating cybersecurity and compliance challenges for companies as they navigate this new normal.",
    "While this is tough enough, ineffective approaches for storing data are exacerbating these challenges. Data sources are increasingly spread across a variety of systems and services, such as endpoints, physical and virtual servers, SaaS applications and AWS infrastructure. Protecting this data has traditionally required multi-vendor solutions, resulting in backup data silos, administrative complexity, and increased costs. Also, as organizations begin to transition workloads and services to the cloud, IT teams are left with a mix of on-premises and cloud data silos, which creates data protection gaps and strains already burdened resources.",
    "All of which is why 2021 is the year businesses must strike a better balance between storing data that’s critically important to the organization, and as Marie Kondo preaches, letting the rest go.",
    "The competitive advantages of upgrading your organization’s approach to data management in the cloud are massive. According to more than 700 IT leaders Druva surveyed across the US and UK, the benefits include increased usability of and accessibility to data, greater cost savings, and the ability to drive economies of scale.",
    "Specifically, 79 percent of IT decision makers now see data management and protection as a key competitive advantage. 73 percent rely more heavily on data for business decisions and 33 percent believe the value of data has permanently increased since the pandemic began.",
    "If the message for IT leaders regarding their pre-pandemic data strategies was to ‘get going’, in 2021 the message is ‘we need to go faster!’. Organizations must evolve to make data a pervasive part of everything from operational decision-making to customer experiences. Rapid availability and analysis will be vital. If businesses can do this successfully, the improved visibility into backup data will reduce administrative complexity and enable greater, more in-depth data insights. Simplified data protection with centralized policy management will also improve data governance, helping address legal and compliance demands. All of which has a material impact on the bottom line.",
    "This kind of advanced cloud storage infrastructure-as-a-service (IaaS) adoption in the enterprise reduces both CAPEX and OPEX, while increasing scalability and flexibility. In fact, our own findings indicate it’s possible to achieve up to 50 percent lower total cost of ownership (TCO) without the cost and complexity of onsite hardware, software, and dedicated resources.",
    "If businesses are to successfully embrace cloud technology for cleaning up data storage, some things will have to change. For example, the increased use of private and public cloud increases data usability and accessibility, but also requires everyone in the organization to have a stronger sense of shared responsibility for data protection and security. Cloud computing service providers must ensure availability of their infrastructure, but users must ensure they fulfil their end of the shared responsibility model. This requires clear company policies around data protection, alongside staff training and education.",
    "Lastly, organizations should look for ways they can embrace as-a-service models, including data protection as a service (DPaaS). Instead of trying to build internal expertise around evolving data compliance requirements, security threats, and cloud backup management, you can now partner with a team of experts that can help you protect your most valuable assets.",
    "If you can make progress in these key areas, in the words of Marie Kondo, your organization will be that much closer to sparking joy. With the right approach, CIOs and CISOs in 2021 can soon unlock the competitive advantage of simplified data management and achieve zero touch data protection."
  ],
  "headers": {
    "4": "An exponential challenge",
    "9": "The benefits of evolution",
    "13": "What must change in 2021"
  },
  "links": {
    "data": "https://www.techradar.com/best/best-data-migration-tools",
    "passwords": "https://www.techradar.com/best/password-generator",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "offices": "https://www.techradar.com/best/best-office-desks",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "IaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}