{
  "source": "https://www.techradar.com/news/the-full-iphone-13-series-is-now-available-to-buy-in-both-the-uk-and-us",
  "title": "You can now buy all four iPhone 13 devices in both the UK and US",
  "category": "phones",
  "updated": "2021-09-24T12:52:22Z",
  "author": "alex-hughes",
  "summary": "Plenty of next day deliveries on the iPhone 13, mini, Pro and Pro Max",
  "article": [
    "The week-long pre-order stage is over and now, all four of Apple's latest handsets are available to buy. Whether you're in the UK or US, there are already thousands of deals from all of the major retailers.",
    "Of course, if you've already done your research on Apple's new devices, you'll know they've stuck with their winning formula from last year. That means four devices - the iPhone 13, 13 mini, 13 Pro and Pro Max.",
    "For those who want something both affordable and smaller than the average flagship device, the iPhone 13 mini will be the way to go. It fits in the same processor as the rest of the devices and other than a smaller battery and screen size, there are no major differences between this and the 13.",
    "While the 13 sits in the middle, balancing costs and specs, both the iPhone 13 Pro and Pro Max are for those wanting the best of Apple and willing to pay for it.",
    "To buy these handsets, you can either use our deals guides or check out our lists of the best retailers below. For those in the UK, there will be a number of retailers offering next day delivery. In the US, you'll be able to get one within a couple of days.",
    "US retailers:",
    "UK retailers:",
    "iPhone 13 mini: The smallest of Apple's four new devices, the iPhone 13 mini is both the cheapest option and the one best suited for those after a more one-handed experience.",
    "Despite the smaller size, it features a lot of the same features as the iPhone 13. It has the A15 Bionic chip, Magsafe technology, a dual camera system with wide and ultrawide lenses and the same durable display with ceramic shield glass.",
    "iPhone 13: The iPhone 13 is the main device of the four, sitting in between the Pro models and the mini, offering a blend of affordability and specs, as well as a slightly larger design than the mini for those put off by its size.",
    "Just like the mini, the iPhone 13 includes Apple's A15 Bionic chip, the same durable glass display, dual camera technology and more. The main differences are its larger and slightly brighter display, as well as a larger battery. iPhone 13 Pro: Step up to the iPhone 13 Pro and you'll see a few key areas of the handset get improvements. Most obviously is the addition of a third camera lens and brighter and larger display.",
    "On the iPhone 13 Pro, you get three 12MP cameras that feature new sensors and lenses. Apple has made the claim that the main camera on this device is 2.2x better in low light than last year's iPhone 12 Pro - how specific!",
    "The display on the iPhone 13 Pro comes with a Super Retina XDR that has a 1200-nit peak brightness - up to 25% brighter outdoors. It also has an 120Hz refresh rate and a larger battery than the two smaller devices.",
    "iPhone 13 Pro Max: Finally, Apple's most powerful handset to date - the iPhone 13 Pro Max. In most ways, it is the same as the iPhone 13 Pro with a few minor improvements to earn its 'Max' title.",
    "The most obvious change is the screen size, bringing you all the way up to a whopping 6.7-inches. That makes this almost the same size as Samsung's Galaxy S21 Ultra.",
    "Other than the increase in battery size, there aren't many improvements over the Pro model. It has the same processing chip, camera and MagSafe functionality. You'll also find almost identical displays and glass strength."
  ],
  "headers": {
    "5": "Where to buy iPhone 13, 13 mini, Pro and Pro Max deals:",
    "7": "What's the iPhone 13 series like?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Pro Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review"
  }
}