{
  "source": "https://www.techradar.com/news/macbook-pro-16-inch-could-be-cooler-than-ever-even-with-more-powerful-gpu",
  "title": "MacBook Pro 16-inch could be cooler than ever, even with more powerful GPU",
  "category": "computing",
  "updated": "2021-07-23T13:51:11Z",
  "author": "darren-allan",
  "summary": "Rumor suggests 64GB RAM option might be on the table, too",
  "article": [
    "Apple’s revamped MacBook Pro 14-inch and 16-inch models theoretically landing later this year will feature an improved cooling system, and the larger laptop will have a more powerful GPU, with perhaps the ability to load up with much more RAM.",
    "Let’s start with the core components mentioned here, and according to LeaksApplePro, a regular Apple rumor peddler, the MacBook Pro 16-inch will exclusively have a more powerful GPU, namely a 32-core solution (on the system-on-chip, which will theoretically be the M1X).",
    "The leaker also adds that “64GB of RAM may also be exclusive to this model”, so that sounds uncertain. Avail yourself of heaps of condiments with all these claims, as always.",
    "The final rumor floated here is that the redesigned MacBook Pros will have improved cooling, and employ a single-piece solution, rather than the previous design of a thermal block welded to a pipe.",
    "That should allow for better cooling, which could be particularly important with the MacBook Pro 16-inch and its potentially more powerful configurations. LeaksApplePro doesn’t make it clear whether the new cooler will also be exclusive to the larger 16-inch revamp, like the aforementioned changes with the GPU and RAM loadout.",
    "Further note that the leaker has actually mentioned the rejigged cooler in the past, so perhaps this can be viewed as a firmer reassertion of that rumor. LeaksApplePro also mentions the Touch Bar being dropped, which is another nugget we’ve heard from the grapevine in recent times.",
    "Finally, the release date for these new MacBook Pros is ‘around’ October the leaker reckons, again in line with other rumors. Also perhaps noteworthy here is the lack of any mention of the Mini-LED screen which has been consistently rumored for the MacBook Pro redesign.",
    "A lot of what’s said in this latest piece of speculation is what we’ve already heard from the rumor mill, or indeed as we mentioned from LeaksApplePro themselves in the case of the cooling solution. However, it certainly makes sense that if there are going to be upgraded components and a more powerful chip in the MacBook Pro 16-inch, it’d be a clear benefit to be able to better keep a lid on temperatures.",
    "The 32-core GPU is an assertion we’ve seen before, with previous speculation from Mark Gurman pointing to a 10-core chip (M1X in theory) with both 16 and 32-core GPU configurations. Again, the latter being exclusive to the more powerful 16-inch model makes sense.",
    "Whether or not there will be a 64GB option on the MacBook Pro 16-inch seems to have become a bone of contention. While Gurman previously claimed this, and LeaksApplePro believes it might be the case now, another Apple leaker on YouTube has claimed that the maximum RAM configuration will be 32GB.",
    "It’s difficult to even guess which way things might go on this front, and LeaksApplePro sounds unsure too, but if 64GB isn’t available with the bigger MacBook Pro, that could be a source of disappointment for power-users. Then again, even 32GB, the alternative rumored spec, would be a sizeable step up from the maximum 16GB available with the current M1-powered machines, and doubtless plenty enough for most users.",
    "Via Notebookcheck.net"
  ],
  "headers": {
    "3": "Seamlessly cool",
    "7": "Analysis: How likely are these rumors?"
  },
  "links": {
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "LeaksApplePro": "https://www.leaksapplepro.com/post/exclusive-redesigned-macbook-pro-news-airpods",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "another nugget we’ve heard from the grapevine": "https://www.techradar.com/news/new-macbook-pro-could-kill-off-touch-bar-rumors-suggest",
    "again in line with other rumors": "https://www.techradar.com/news/new-macbook-pro-14-inch-and-16-inch-could-arrive-disappointingly-late-in-2021",
    "Mini-LED screen which has been consistently rumored": "https://www.techradar.com/news/powerful-new-m1-macbook-pro-models-expected-to-feature-mini-led-display",
    "previous speculation from Mark Gurman pointing to a 10-core chip": "https://www.techradar.com/news/apples-next-m1-macbook-pro-may-boast-a-huge-upgrade",
    "another Apple leaker": "https://www.techradar.com/news/new-macbook-pro-2021-rumor-delivers-both-good-and-bad-news",
    "even 32GB, the alternative rumored spec": "https://www.techradar.com/news/new-macbook-pro-2021-rumor-delivers-both-good-and-bad-news",
    "Notebookcheck.net": "https://www.notebookcheck.net/MacBook-Pro-16-to-come-with-exclusive-top-end-GPU-and-RAM-options-as-leaker-doubles-down-on-revamped-cooling-solution-claim.551993.0.html"
  }
}