{
  "source": "https://www.techradar.com/news/cyberpunk-2077s-multiplayer-game-has-been-cancelled",
  "title": "Cyberpunk 2077’s multiplayer game has been cancelled",
  "category": "gaming",
  "updated": "2021-12-02T11:19:12Z",
  "author": "rhys-wood",
  "summary": "And that could be a very good thing",
  "article": [
    "It looks like the Runners of Night City won’t be able to team up after all, as Cyberpunk 2077’s multiplayer follow-up has been cancelled following a strategy update in which president and CEO Adam Kiciński stated the plans for the game have been “reconsidered.”",
    "In the strategy update video released via CD Projekt Red’s YouTube channel, Kiciński stated: “Previously we hinted that our next triple-A would be a multiplayer Cyberpunk game, but we have decided to reconsider this now. Given our new more systematic and agile approach, instead of primarily focusing on one big online experience or game, we are focusing on bringing online into all of our franchises one day.”",
    "Kiciński’s comments come during the launch period of Cyberpunk 2077’s sizable 1.2 patch, which addressed hundreds of bugs and glitches plaguing the game, as well as throwing in some quality-of-life updates for good measure.",
    "Instead of creating a separate multiplayer experience for Cyberpunk 2077, CD Projekt Red’s strategy update will involve developing a new technology framework that will allow the company to instead integrate online functionality into its existing titles.",
    "Kiciński elaborated: “Let’s stress this here, CD Projekt Red makes single-player story-driven AAA RPGs – that is not changing. What is changing is our long-term approach to online.",
    "And by this, we mean ensuring we are properly prepared to implement online elements in our games where they make sense. We don’t want to go overboard or lose our single-player DNA.”",
    "Kiciński’s comments on the matter of online could be a welcome shift in attitude for CD Projekt Red fans, as they could hint that the company is refocusing its efforts on the current state of Cyberpunk 2077, rather than embarking on an entirely separate project while leaving the single-player experience in the dust.",
    "We don’t know exactly what Cyberpunk 2077’s online functions will now end up being, dataminers have previously unearthed code alluding to Deathmatch and Heist modes, the latter of which may have involved players selecting different classes to tackle co-op based missions.",
    "Whether or not these modes will still be added to Cyberpunk 2077 eventually remains to be seen. On the other hand, we could see a more asymmetrical approach to multiplayer, where players can influence the gameplay of others’ sessions in various ways. This could be similar to Death Stranding’s online functionality, or even the Dark Souls series’ sporadic invasion system, wherein players could warp into another’s world to potentially ruin their day.",
    "CD Projekt Red’s strategy update isn’t relegated to just Cyberpunk 2077, though, as The Witcher series will also be affected. As such, CD Projekt Red could work on future Cyberpunk and Witcher projects simultaneously. The Witcher 3’s PS5 and Xbox Series X update is also scheduled to arrive later in 2021."
  ],
  "headers": {
    "3": "Cyber security"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "CD Projekt Red’s YouTube channel": "https://www.youtube.com/watch?v=IIAiGI-v6Y8",
    "Cyberpunk 2077’s sizable 1.2 patch": "https://www.techradar.com/news/huge-cyberpunk-2077-patch-12-is-imminent-finally-adds-ray-tracing-for-amd-gpus",
    "Deathmatch and Heist modes": "https://www.techradar.com/news/what-will-cyberpunk-2077-multiplayer-be-data-miners-have-found-the-first-clues",
    "Cyberpunk and Witcher projects simultaneously": "https://www.techradar.com/news/cd-projekt-red-restructures-could-work-on-next-witcher-cyberpunk-games-at-the-same-time",
    "arrive later in 2021": "https://www.techradar.com/news/the-witcher-3-is-headed-to-ps5-and-xbox-series-x-and-you-could-even-get-it-for-free"
  }
}