{
  "source": "https://www.techradar.com/news/aws-jedi-bid-could-see-amazon-face-further-antitrust-probe",
  "title": "AWS JEDI bid could see Amazon face further antitrust probe",
  "category": "computing",
  "updated": "2021-05-05T08:22:29Z",
  "author": "mayank-sharma",
  "summary": "Calls come as Amazon continues to pursue similar allegations against Microsoft",
  "article": [
    "In a surprising move, two Republican lawmakers have written to the US attorney general to investigate potential anticompetitive behavior by Amazon, as the ecommerce giant pursues allegations that former President Trump interfered with the Joint Enterprise Defense Infrastructure (JEDI) contract.",
    "JEDI is the massive $10 billion project to migrate the Pentagon’s computing infrastructure to the cloud. It was awarded to Microsoft in 2019, but no work has begun as Amazon has secured an injunction to prevent Microsoft from beginning work on the JEDI project.",
    "Last week, a US Federal Claim Court declined a joint motion by the Department of Defense (DoD) and Microsoft to prevent Amazon from presenting these allegations in the court, leading to further delays and perhaps even cancellation of the entire JEDI project.",
    "Now, Senator Mike Lee and Republican Ken Buck, in letters reviewed by the Wall Street Journal, claim that Amazon might have violated antitrust laws and federal conflict-of-interest laws in its pursuit of the JEDI contract.",
    "“We are concerned that Amazon may have attempted to monopolize one or more markets relating to government and/or commercial cloud computing services by improperly influencing the Joint Enterprise Defense Infrastructure procurement process,” contend the lawmakers.",
    "According to WSJ, the lawmakers, in their letter, highlight undisclosed payments between an Amazon consultant and a DoD official.",
    "They also allege that a different DoD official who had previously worked as a consultant for Amazon helped draft the DoD’s cloud acquisition strategy, despite being asked to recuse himself from all Department matters regarding Amazon.",
    "\"These are the same false, tired, and meritless allegations that have been repeatedly rejected by every independent review -- from federal courts, to the GAO, to the DoD IG,\" an AWS spokesperson told TechRadar Pro.",
    "\"This is nothing more than an attempt by certain less capable AWS competitors to distract from the fact that by every objective measure AWS provides its customers with superior technology, more secure and reliable services, and deeper experience supporting classified government workloads.\"",
    "Via Wall Street Journal"
  ],
  "headers": {
    "4": "Conflict of interest"
  },
  "links": {
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "JEDI": "https://www.techradar.com/news/pentagon-may-cancel-jedi-contract-and-start-over",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "prevent Microsoft": "https://www.techradar.com/news/us-government-dollar10bn-pentagon-cloud-contract-put-on-hold",
    "declined a joint motion": "https://www.techradar.com/news/jedi-battle-rumbles-on-as-judge-refuses-to-dismiss-aws-trump-claims",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "Wall Street Journal": "https://www.wsj.com/articles/gop-lawmakers-urge-probe-of-amazons-pursuit-of-pentagon-contract-11620100134"
  }
}