{
  "source": "https://www.techradar.com/news/most-phishing-scams-targeting-online-shoppers-originate-in-the-us",
  "title": "Most phishing scams targeting online shoppers originate in the US",
  "category": "computing",
  "updated": "2021-11-24T11:45:56Z",
  "author": "mayank-sharma",
  "summary": "Be prepared for a deluge of spam, warn researchers",
  "article": [
    "An analysis of spam messages has revealed that most phishing scams targeting online shoppers originate from the US (44%) in the lead up to the holiday season.",
    "The figure is based on an analysis of global spam telemetry data collected by Bitdefender between November 1 and November 11, 2021 in anticipation of the approaching holiday shopping season.",
    "The research reveals that although phishers cast a wide net, their focus is on US shoppers, which emerged as the most attractive target to threat actors, receiving the largest share of spam emails, consisting of 44% of the entire global spam volume.",
    "The US is followed by the UK (8%), Australia (6%), South Africa (5%), Ireland (4%), Germany (4%), Sweden (3%), Denmark (2%), France (2%), Romania (1%) and Italy (1%).",
    "“With just a little over two weeks before the biggest shopping day of the year, there’s no shortage of fake deals and promotions for keen shoppers to fall for. No stone was left unturned, from household decorations and retail to tech and airplane tickets,” remarked Bitdefender.",
    "Bitdefender claims that its findings are in line with a recent survey that placed the US at the top of the list for the number of people who plan to shop on Black Friday this year.",
    "No surprise then that an overwhelming majority of the spam messages analyzed by Bitdefender were written in English.",
    "Based on their analysis of the spam, shopper rewards and gift cards or prizes associated with phony surveys and raffles are among the most commonly used tricks to lure recipients. Furthermore, with the easing travel restrictions, Bitdefender expects scammers to increase their use of travel deals to trick unsuspecting travel planners.",
    "“Bitdefender spam researchers expect more spam campaigns in the coming weeks, with spikes on Black Friday, Cyber Monday and winter holiday shopping deals. Scammers often take advantage of these events to spread phishing emails and deliver malware to targets in bulk,” warns Bitdefender.",
    "Batten down the hatches with the help of these best firewall apps and services, and ensure your computers are protected with these best endpoint protection tools."
  ],
  "headers": {
    "5": "Prepare for more"
  },
  "links": {
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "Bitdefender": "https://www.techradar.com/reviews/bitdefender-antivirus",
    "remarked": "https://bitdefender.evyy.net/c/221109/278689/4466?subId1=trd-us-9627438891213152000&sharedId=trd-us&u=https%3A%2F%2Fwww.bitdefender.com%2Fblog%2Fhotforsecurity%2Fspammers-use-holiday-scams-to-con-shoppers-out-of-data-and-money-2",
    "survey": "https://www.finder.com/black-friday-statistics",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday",
    "best firewall apps and services": "https://www.techradar.com/best/firewall",
    "best endpoint protection tools": "https://www.techradar.com/news/best-endpoint-security-software"
  }
}