{
  "source": "https://www.techradar.com/news/gpu-prices-back-on-the-upswing-indicating-stock-issues-not-going-anywhere",
  "title": "GPU prices back on the upswing, indicating stock issues not going anywhere",
  "category": "computing",
  "updated": "2021-08-30T22:58:07Z",
  "author": "john-loeffler",
  "summary": "Higher prices point to a tightening supply",
  "article": [
    "A recent market analysis is showing the price of the best graphics cards ticking back up after months of decline, meaning the market might not be ready to return to normal any time soon.",
    "Prices for AMD and Nvidia graphics cards analyzed by 3DCenter show an increase of about 9% for Nvidia cards and about 6% for AMD, putting the average price for Nvidia cards about 59% above MSRP and about 64% for AMD's.",
    "This is still much better than it was just a few months ago, however. Back in May, as TechPowerUp points out, the average price for an Nvidia card hit a high of around 304% above MSRP, with AMD cards seeing a 202% markup on average.",
    "It appears that even though China's cryptomining crackdown forced a lot of mining cards to be resold, this has helped ease prices, but not as much as we'd have liked as other factors keep upward price pressure on the graphics card market.",
    "While the bump in prices isn't as gobsmacking as it was earlier this year, it does indicate we've reached something of a floor for graphics card prices for the time being, and prices are only set to rise.",
    "With last week's news that TSMC is hiking the price of newly fabbed wafers, even if supply issues start to ease up later this year, it won't be enough to bring the price of the these cards down enough to their original MSRP if their MSRP gets bumped up as a result.",
    "What's more, the cryptomining boom looks like it's more durable than its critics believed, so there isn't going to be as much let up on that side of the ledge any time soon.",
    "All this points to a more prolonged graphics card shortage than we'd originally hoped for and even when they do get here, they're going to be more expensive regardless. How any of this eases is anyone's guess at this point."
  ],
  "headers": {
    "4": "Analysis: we're not nearly out of the woods yet on graphics card woes"
  },
  "links": {
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "AMD and Nvidia": "https://www.techradar.com/news/computing-components/graphics-cards/amd-vs-nvidia-who-makes-the-best-graphics-cards-699480",
    "3DCenter": "https://www.3dcenter.org/news/hardware-und-nachrichten-links-des-2829-august-2021",
    "TechPowerUp": "https://www.techpowerup.com/286150/gpu-market-pricing-back-in-uptrend-shattering-expectations-of-price-normalization",
    "China's cryptomining crackdown": "https://www.techradar.com/news/china-crypto-mining-crackdown-could-give-you-a-better-chance-of-getting-a-new-rtx-3080",
    "mining cards to be resold": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown",
    "TSMC is hiking the price of newly fabbed wafers": "https://www.techradar.com/news/graphics-cards-could-get-even-more-expensive-next-year-heres-why"
  }
}