{
  "source": "https://www.techradar.com/news/intel-alder-lake-makes-market-share-gains-against-amd",
  "title": "Intel Alder Lake makes market share gains against AMD",
  "category": "computing",
  "updated": "2021-12-09T21:36:10Z",
  "author": "allisa-james",
  "summary": "Intel looks like it's finally gaining traction",
  "article": [
    "It seems that Intel Alder Lake CPUs have finally started breaking through the AMD dominated market, as they now sit at one-third of German market share, according to that country's largest tech retailer MindFactory.",
    "Redditor ingebor, who compiles Mindfactory's sales figures every month, just posted the latest numbers for November 2021, and it’s apparent that Intel has been seeing plenty of success.",
    "The data shows that the Alder Lake brand in particular is seeing some robust sales, despite being just over a month old.",
    "The November numbers are a huge improvement over Intel's October sales, which were a far bleaker sub-5,000 units, before the 12th-generation products launched and discounts on various 11th- and 10th-gen CPUs helped turn things around.",
    "Despite Intel slowly clawing its way up the market ladder, AMD will most likely maintain its dominance thanks to the upcoming launches of its Zen 3+ and Zen 4 chips.",
    "However, Intel could keep the momentum going thanks to DDR5 memory becoming widely more available, as well as the launch of its Non-K lineup with B660 & H610 motherboards.",
    "AMD CPUs still holds the highest market share by far at a whopping 70%, with the Ryzen 7 5800X and Ryzen 5 5600X being its most popular chips sold by MindFactory last month. Conversely, Intel’s Core i7-12700K and the Core i5-12600K were its most popular CPUs in November.",
    "Breaking up sales within each company, Intel Alder Lake made up 37% of its overall sales, while Rocket Lake was responsible for 34%, and Comet Lake with 28%.",
    "Unlike the much more evenly distributed Intel, AMD has an overwhelming winner in its brands. The Vermeer Ryzen 5000 CPUs make up an overwhelming 68% of products sold, while its Cezanne and Matisse architectures contributed a meager 15% and 14%, respectively.",
    "Via PCGamesN"
  ],
  "headers": {
    "6": "Analysis: A breakdown of sales"
  },
  "links": {
    "Intel Alder Lake": "https://www.techradar.com/news/intel-alder-lake-is-here-and-with-it-it-really-does-feel-like-team-blue-is-back",
    "just posted the latest numbers for November 2021": "https://www.reddit.com/r/Amd/comments/r7xrrz/amd_remains_on_top_amid_alder_lake_release/",
    "Non-K lineup": "https://www.techradar.com/news/latest-intel-alder-lake-leak-is-fantastic-news-for-budget-pc-gamers",
    "PCGamesN": "https://www.pcgamesn.com/intel/market-share-boost-amd"
  }
}