{
  "source": "https://www.techradar.com/news/how-to-spot-a-good-prime-day-laptop-deal-2021-edition",
  "title": "How to spot a good Prime Day laptop deal – 2021 edition",
  "category": "computing",
  "updated": "2021-06-19T18:02:45Z",
  "author": "bill-thomas",
  "summary": "There's gonna be a ton of laptop deals, but they're not all equal",
  "article": [
    "Amazon Prime Day is coming up, and just like any other year, there are going to be a ton of laptops on sale, but there are definitely going to be some Prime Day laptop deals that stand above others.",
    "While its unlikely that you're going to find a top-end laptop with all the latest hardware for cheap, you can still find a pretty amazing device without having to break the bank. Because when new laptop hardware comes out all the laptops that have the last-generation components don't just disappear off of store shelves – retailers are left with that stock, making it perfect for discounts.",
    "So Prime Day is the perfect opportunity to get your hands on last year's tech at a cheap price. And, really, you're not missing out on too much if you get a laptop with a 10th generation Intel processor instead of an 11th-gen device – maybe something like a 2-5% difference in performance in every day applications, which you're definitely not going to notice.",
    "At the same time, though, a lot of low-end laptops are going to see huge discounts, and you don't want to jump on a laptop deal just because it's super cheap. After all, you're just going to end up stressing yourself out if you have to sit there and wait for the laptop to open a web browser. So, we're going to walk you through what to look for in a Prime Day deal for a laptop, and what kinds of laptop hardware to avoid.",
    "Even with the best Prime Day laptop deals out there, a new laptop will likely cost hundreds of dollars, and you're going to want to make sure it'll mesh well with the things you need to do with it.",
    "And for this, we find it's best to be honest with yourself. If you're not really going to play PC games on the go, or if you already have something you prefer to play games on, don't worry about picking up a gaming laptop. Cheap gaming laptops are all about providing horsepower, and will typically cut corners on build quality, trackpads and displays in order to deliver higher framerates. So, if you're mostly going to be doing work or just browsing the internet on your laptop, you'll get a better experience with something like a Chromebook.",
    "Chromebooks have kind of a weird reputation for being cheap and weak devices. It's kind of true, but it's not actually a bad thing. The best Chromebooks are actually ideal if you're just doing light computing work, especially if most of what you do can be done within the Google Chrome web browser (hint, these days, Chrome can basically do anything).",
    "If you want a little more power for things like photo and light video editing, an Ultrabook might be your best bet. The definition of the best Ultrabooks has shifted a bit in recent years, as laptops have become thinner, lighter and more powerful even at the low end.",
    "We would urge most users to avoid cheap windows 10 laptops across the board, however. If you're spending below $300, you're simply going to have a better experience with a Chromebook. Windows 10, as much as we love it, does not scale very well on low-end hardware.",
    "Likewise, if you want a really premium device to show off at the coffee shop, avoid a Chromebook. Because while Chrome OS is really useful on less powerful hardware, Windows 10 is great if you have powerful hardware. A Chromebook with something like an Intel Core i5 processor and 8GB of RAM is great, but it's unnecessary, because there's not much you can do with Chrome OS to really take advantage of that hardware.",
    "If you're browsing through laptop deals on Amazon Prime Day, you're probably going to see a huge amount of Windows laptops with 4GB of RAM.",
    "Avoid them.",
    "Windows 10 will run on 4GB of RAM, but even that is being generous. If you try to do any kind of multitasking – even if that just means listening to Spotify while idly scrolling through Twitter or TechRadar – you're going to run into some massive slowdowns as Windows tries to allocate that small pool of memory.",
    "4GB of RAM is more than acceptable on a Chromebook, though, as that operating system is a lot more efficient at allocating that memory – mostly because it primarily uses, like, only one program.",
    "You should be going for at least 8GB of RAM on your Windows laptop, and 16GB if you're going to be doing somewhat heavy work with it.",
    "It's possible to go too far in the other direction, though. You might see laptops with 32GB of RAM out there – especially if you're looking at gaming laptops or devices aimed at creative professionals. The way we look at it is, you'll know if you need that much memory, and most people absolutely won't.",
    "The only reason you'll ever need to make that upgrade is if you do a lot of work in Photoshop, Premiere or a similar program, and you run into slowdowns on a system with 16GB of memory.",
    "For the love of all that is good, do not get a laptop that just has a mechanical hard drive for system storage. You're going to find Windows laptops up and down the pricing stack that have some form of flash storage, so just get something with an SSD.",
    "These days, the experience of using a device without an SSD is just painfully tedious, and if you use any kind of modern technology, whether it's your phone or even a smart TV, you will be left wondering what the hell is taking so long every time you turn your laptop on.",
    "If you're going to insist on getting a laptop with a hard drive because they can store more data for cheaper, at least get one with a small SSD for your operating system. Because you don't want everything you're doing to suddenly grind to a screeching halt just because Windows decided it was a wonderful time to start a lengthy system update.",
    "And if Windows 10 is running on a hard drive, every update will be a lengthy system update.",
    "Trust us. Get something with an SSD, even if you have to compromise elsewhere.",
    "When it comes to the best laptop processors and graphics cards, new ones come out about every year or two years for CPUs and GPUs, respectively. And for this Amazon Prime Day, we're right at the beginning of a new generation of both, which means there are going to be a lot of laptops with seemingly old hardware that is still amazing.",
    "If you spot something with a 10th-generation Intel processor, you don't have to worry about it lagging too far behind an 11th-gen chip. Likewise, an AMD Ryzen 7 4800U isn't going to be that much slower than a Ryzen 7 5800U.",
    "GPU generations do bring bigger jumps in performance, but Nvidia GeForce RTX 20-series hardware is still pretty good. If you find a laptop with an Nvidia GeForce RTX 2070 for the same price or lower than an RTX 3060, you should absolutely jump on it.",
    "Most gaming laptops have 1080p displays anyways, and for most games you won't really need anything more powerful than a GTX 1660 Ti or an RTX 2060. You can more easily take advantage of high refresh rates with more powerful graphics hardware, sure, but if you're on a budget and just want to make sure you can run your favorite games, don't be afraid of picking up a laptop with an older GPU.",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {
    "4": "Know what you're looking for",
    "10": "Don't cheap out on RAM",
    "17": "Get an SSD",
    "22": "Last-generation CPUs and GPUs are just fine"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Prime Day laptop deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-laptop-deals",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Cheap gaming laptops": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "The best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "best Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "TechRadar": "https://www.techradar.com/",
    "Nvidia GeForce RTX 2070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2070",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}