{
  "source": "https://www.techradar.com/news/nintendo-switch-and-steam-deck-have-yet-another-competitor-on-the-way",
  "title": "Nintendo Switch and Steam Deck have yet another competitor on the way",
  "category": "gaming",
  "updated": "2021-08-18T08:22:09Z",
  "author": "rhys-wood",
  "summary": "Add another to the portable pile",
  "article": [
    "If you didn’t think any more high-profile handheld console releases could happen in the wake of the Nintendo Switch OLED and Valve’s Steam Deck, Chinese tech company GPD is here to prove you wrong with its own take on the trend.",
    "Named the GPD-XP, the Android-powered handheld has no firm release date as of yet, nor much in the way of concrete details, but according to XDA Developers, the console will boast a 6.81-inch screen, 6GB of RAM, 128GB of UFS 2.1 storage and 4G support (albeit with calls and SMS disabled). A microSD slot and built-in microphone will also feature on the device.",
    "In a tweet sharing some details about the device, GPD explained that the GPD-XP handheld console will adopt a modular approach to design, allowing the user to swap Joy-Con-esque controllers to better suit whichever game they’re playing. The company stressed that the device is “most suited for MOBA and FPS games,” though we imagine most other genres will play just fine, too.",
    "Ultimately, more quality handhelds in the gaming space feels like a good thing. As we’ve seen mixed responses for both the Nintendo Switch OLED and the Steam Deck, it’s clear to see that the handheld console market has room to grow, and offer something that the aforementioned consoles don’t.",
    "Given the levels of interest around the Switch OLED and Steam Deck it’s inevitable that more handheld hopefuls will appear. But to GPD’s credit, the company might have found a credible gap in the market. Not only does its console run on the incredibly versatile Android operating system, but the modular control options offer more flexibility than is typically found with the competition.",
    "And while this won’t be the company’s first foray into the handheld market, the GPD-XP might be a case of ‘right place at the right time.’ As TechRadar executive editor Gerald Lynch writes: \"It may not be a household name, but GPD make some of the most powerful handhelds out there.",
    "\"Whether Linux or Windows based, its range of handhelds are basically ultrabooks you can put in your pocket, complete with gaming controls thrown in. They may lack the pick-up-and-play ease of use of a Nintendo Switch, but with high-powered internals and fully-customisable operating systems, they're particularly good for those that want to dive deep into the world of emulation and retro gaming.\"",
    "We also love the concept of modular handheld controllers on the GPD-XP, allowing for a greater degree of customization. While we’re certain these individual modules will be relatively pricey, they could come in useful if you often play games not suited to a traditional controller setup, such as RTSs like Age of Empires or grand 4X titles like Civilization.",
    "Price point will, naturally, play a huge factor into how well the GPD-XP stacks up against the Switch OLED and higher-end Steam Deck models. Previous models like the GPD-XD Plus and GPD WIN 3 have run the gamut from relatively affordable (compared to the Nintendo Switch) to incredibly expensive.",
    "We expect the GPD-XP to be a fairly niche handheld in comparison to the competition, but if you’re not feeling the incremental nature of the Switch OLED, or the steep price of the Steam Deck, then the GPD-XP might just present a happy medium when it launches."
  ],
  "headers": {
    "3": "Do we need more handhelds?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "XDA Developers": "https://www.xda-developers.com/gpd-is-working-on-an-android-powered-modular-handheld-the-gpd-xp/amp/",
    "mixed responses": "https://www.techradar.com/news/the-nintendo-switch-oled-is-disappointing-but-why-are-you-surprised",
    "Age of Empires": "https://www.techradar.com/news/age-of-empires-4-release-date-trailers-and-features"
  }
}