{
  "source": "https://www.techradar.com/news/fresh-samsung-galaxy-s22-leaks-hint-at-fast-charging-speeds-and-a-new-color",
  "title": "Fresh Samsung Galaxy S22 leaks hint at fast charging speeds and a new color",
  "category": "phones",
  "updated": "2021-10-25T13:25:55Z",
  "author": "david-nield",
  "summary": "The S22 Ultra could be some phone",
  "article": [
    "It seems that there's a new Samsung Galaxy S22 rumor dropping every day at the moment – and today we've got unconfirmed snippets of information to share about the charging speeds and colors of the upcoming flagship smartphones.",
    "First up, reputable tipster Ice Universe has taken to Twitter to reiterate that the S22 Ultra model will come with a 5,000mAh battery capacity and a charging rate of 45W. That's apparently enough to charge up to 70% in a mere 35 minutes.",
    "In terms of both battery capacity and charging speed that matches up with previous leaks that we've come across, so these particular specs are now looking more likely than ever to be accurate. The S22 and S22 Plus, meanwhile, might well stick at 25W charging.",
    "The other tidbit again concerns the Galaxy S22 Ultra and this time it's about the colors the handset will come in. We'd already heard that a special dark red version was in the pipeline, but it now seems that a green color variant will be available as well.",
    "That's as per GalaxyClub, which is usually a reliable source of Samsung-related information. If the tip is right, the S22 Ultra could go on sale in black, white, dark red and green, and GalaxyClub reckons there might even be more colors to pick from.",
    "Whether this particular green is the same green as the Samsung Galaxy Z Fold 3 is available in remains to be seen, but LetsGoDigital has lost no time in trying to imagine what this shade might look like with some mock-up renders.",
    "We've had an absolute flood of leaks around the Samsung Galaxy S22 phones in recent months, giving us a very good idea of what's coming when these devices finally see the light of day – which is likely to be sometime towards the start of 2022.",
    "There's a clear distinction between what we're hearing about the Galaxy S22 and the Galaxy S22 Plus, and what we're hearing about the Galaxy S22 Ultra. The former two sound like more of the same, whereas the latter sounds like something quite different from what's gone before.",
    "We've seen unofficial renders of the two cheaper and smaller handsets, and there's been talk that the battery capacities and the screen sizes could be unchanged or even reduced from what we got with the Galaxy S21 phones at the start of 2021.",
    "Contrast that with the rumors around the Galaxy S22 Ultra – it looks to have an upgraded design, and in most respects is being positioned as a replacement for the Galaxy Note 22, complete with S Pen support, a large screen and top-end specs (including the rear camera module)."
  ],
  "headers": {
    "3": "Green is the color",
    "6": "Analysis: the S22 Ultra is the model to watch"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1451893893151158272",
    "previous leaks": "https://www.techradar.com/news/samsung-galaxy-s22-leak-reveals-new-plus-and-ultra-battery-capacities",
    "stick at 25W charging": "https://www.techradar.com/news/samsung-galaxy-s22-likely-wont-have-the-best-fast-charging-but-itll-beat-iphone-13",
    "in the pipeline": "https://www.techradar.com/news/samsung-galaxy-s22-leaked-colors-have-us-excited",
    "GalaxyClub": "https://www.galaxyclub.nl/nieuws/samsung-galaxy-s22-ultra-komt-straks-ook-in-het-groen/",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-galaxy-s22-ultra-groen/",
    "unofficial renders": "https://www.techradar.com/news/samsung-galaxy-s22-and-s22-renders-leak-out-hint-at-a-galaxy-note-22-ultra",
    "battery capacities": "https://www.techradar.com/news/samsung-galaxy-s22s-small-battery-feels-pretty-final-with-new-leak",
    "screen sizes": "https://www.techradar.com/news/samsung-galaxy-s22-screen-and-battery-could-both-be-smaller-than-the-s21",
    "Galaxy S21 phones": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "upgraded design": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-design-shown-off-in-backplate-leak",
    "for the Galaxy Note 22": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-basically-sounds-like-the-note-21-at-this-point"
  }
}