{
  "source": "https://www.techradar.com/news/the-mw08-true-wireless-earbuds-get-a-fitness-overhaul",
  "title": "The MW08 true wireless earbuds get workout-ready in new upgrade",
  "category": "audio-visual",
  "updated": "2021-08-02T15:33:24Z",
  "author": "becca-caddy",
  "summary": "MW08 Sport earbuds are durable and workout-friendly",
  "article": [
    "Master & Dynamic has launched the MW08 Sport true wireless earbuds. If that model sounds familiar, it’s because the standard MW08 earbuds came out in March 2021.",
    "The new MW08 Sport version is the same as the original MW08 but it has a few additions that Master & Dynamic hope will appeal to fitness-lovers.",
    "For starters, the MW08 Sport are made from shatter-resistant sapphire glass. The accompanying charging case is wrapped in Kevlar, so it’s light but tough. Combined with the case, you’ll get up to 42 hours of total playback time from the earbuds.",
    "Comfort is also a key focus here, as the MW08 came with five types of silicone eartips, but the Sport version also comes with two memory foam options. There are also a few different listening modes, two which let you hear ambient sounds around you and two with noise cancellation.",
    "The MW08 Sport also boast a number of features that make them a solid option if you’re looking for a new pair of true wireless earbuds. This includes external aluminium antennas for more reliable connectivity, 11mm Beryllium drivers for high quality sound, and AAC, aptX and SBC connectivity via Bluetooth 5.2.",
    "As well as launching the MW08 Sport, Master & Dynamic has also unveiled a new wireless charging pad, the MC100, which you can use to charge up the buds.",
    "The MW08 Sport have been created for fitness, but there’s stiff competition when it comes to the best headphones for workouts.",
    "True wireless earbuds can fall out if you’re running or doing an intense workout, unlike designs with ear hooks, like the Beats PowerBeats Pro.",
    "However, the memory foam eartips might solve this problem, as Master & Dynamic say the design provides a snug fit and creates a better seal, meaning they’re secure and music is likely to sound better, too.",
    "The listening modes are also a good addition, allowing anyone who runs or cycles to quickly get more ambient awareness to keep them safe. But whether the process of switching between modes is as simple as it sounds remains to be seen.",
    "The design of the earbuds doesn’t look geared to sport at first glance, with the high-shine metallic finish rather than a more practical material. But the sapphire glass is shatter-resistant and there’s an IPX5 water resistant rating here as well, so they should survive sweaty workouts and occasional knocks and bumps.",
    "There’s only one way to find out whether these earbuds match up to their fitness promises. We’ll let you know our verdict when we’ve had a chance to review the MW08 Sport and take them for a spin.",
    "The earbuds are available now in black, silver, blue and green for £329. The MC100 Wireless Charge Pad is available now in silver/grey and gunmetal/black for £59."
  ],
  "headers": {
    "6": "Analysis: can the MW08 Sport compete with other fitness earbuds?"
  },
  "links": {
    "MW08 earbuds": "https://www.techradar.com/news/master-and-dynamic-launches-mw08-true-wireless-earbuds",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "the best headphones for workouts.": "https://www.techradar.com/best/the-best-workout-headphones-for-every-sport",
    "Beats PowerBeats Pro.": "https://www.techradar.com/reviews/beats-powerbeats-pro"
  }
}