{
  "source": "https://www.techradar.com/news/windows-10-update-will-finally-kill-off-adobe-flash-unless",
  "title": "Windows 10 update will finally kill off Adobe Flash, unless...",
  "category": "computing",
  "updated": "2021-02-18T12:05:29Z",
  "author": "joel-khalili",
  "summary": "Windows 10 update will erase Adobe Flash Player, but not for everyone",
  "article": [
    "Microsoft is in the process of rolling out a Windows 10 update that will remove Adobe Flash Player from all versions of the operating system.",
    "A phased approach will see the update (KB4577586) arrive for different users at intervals over the next few weeks. Once the update is installed, either manually or automatically, Windows 10 users will not be able to restore the program unless via a pre-existing backup.",
    "However, as per the support documentation, the update will only remove editions of Adobe Flash Player installed automatically by Windows. “If you installed Adobe Flash Player manually from another source, it will not be removed,” Microsoft explained.",
    "Announced by Adobe in the summer of 2017, the death of Flash has felt like a long and drawn out affair, with various web browsers withdrawing support for the medium over the course of the last few years.",
    "The world’s most popular browser, Google Chrome, began to block Flash by default in 2019, while Microsoft Edge and Mozilla Firefox phased out support before the deadline at the end of last year.",
    "At the start of December, meanwhile, Adobe confirmed it would terminate support for Flash imminently and block content from running in Flash Player from January 12 onwards.",
    "“Today marks the final scheduled release of Flash Player for all regions outside of Mainland China. We want to take a moment to thank all of our customers and developers who have used and created amazing Flash Player content over the last two decades,” said Adobe at the time.",
    "“We are proud that Flash had a crucial role in evolving web content across animation, interactivity, audio and video. We are excited to help lead the next era of digital experiences.”",
    "With Flash no longer receiving updates from Adobe, the company has advised users to rid their machines of any related services, to ensure they do not provide an avenue of attack for cybercriminals.",
    "For this reason, owners of Windows 10 devices should install the relevant update as soon as it becomes available. Anyone that installed Flash Player manually will also have to remove the software by hand, via system settings.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "The death of Adobe Flash"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "operating system": "https://www.techradar.com/news/best-alternative-operating-systems",
    "backup": "https://www.techradar.com/best/best-backup-software",
    "support documentation": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1157335734899308300&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Ftopic%2Fkb4577586-update-for-the-removal-of-adobe-flash-player-october-27-2020-931521b9-075a-ce54-b9af-ff3d5da047d5",
    "web browsers": "https://www.techradar.com/best/browser",
    "block Flash by default": "https://www.techradar.com/news/chrome-76-blocks-flash-by-default-and-stops-websites-detecting-incognito-mode",
    "Windows Latest": "https://www.windowslatest.com/2021/02/17/windows-10-kb4577586-update-is-rolling-out-to-remove-flash-player/"
  }
}