{
  "source": "https://www.techradar.com/news/using-microsoft-teams-on-mobile-might-actually-get-more-useful-at-last",
  "title": "Using Microsoft Teams on mobile might actually get more useful at last",
  "category": "computing",
  "updated": "2021-06-10T08:54:46Z",
  "author": "mike-moore",
  "summary": "More participants can now squeeze into a Microsoft Teams mobile call",
  "article": [
    "Using Microsoft Teams on a mobile device is set to get a lot easier thanks to a new upgrade coming to the platform.",
    "Microsoft is working on an update to its video conferencing service that should make Teams calls more manageable on iOS and Android devices alike, as well as making sure you keep track on the co-workers you value the most.",
    "The company has announced a new large gallery layout model for Microsoft Teams on mobile which will display up to 10 call particiants per page on your phone screen.",
    "For larger calls, users will be able to swipe left or right to view different sets of participants, all of which can be interacted with in the usual method.",
    "The new feature is set to roll out by the end of July 2021, with both iOS and Android users able to experience the updates.",
    "Users will need to have a device running Android 9 or later or and iOS 13 or later, and also have a device with 4GB of memory or more. Anyone using a device with lower specs than these will see the current Microsoft Teams layout, but won't be able to navigate between call contacts.",
    "The news comes shortly after Microsoft announced that Teams will soon be even more like a classic phone call thanks to the introduction of hold music.",
    "The new \"Music on Hold for Consult/Transfer\" feature is looking to make waiting for a Teams call or being transferred, a somewhat more musical experience, with users who are put on hold will hear music while consultation and transfer occurs.",
    "It's not known exactly what music will be played, or whether users will be able to upload or even create their own hold music. Microsoft says hold music helps show users that their call is still ongoing, meaning there should be no embarrassing hang-ups or disconnections due to wires getting crossed.",
    "Via WindowsLatest"
  ],
  "headers": {
    "3": "Microsoft Teams mobile"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "introduction of hold music": "https://www.techradar.com/news/clone-microsoft-teams-is-getting-a-new-feature-that-s-dumb-and-amazing-in-equal-measure",
    "WindowsLatest": "https://www.windowslatest.com/2021/06/07/microsoft-teams-for-mobile-is-getting-a-new-large-gallery-layout/"
  }
}