{
  "source": "https://www.techradar.com/news/new-samsung-90hz-oled-laptops-might-be-the-next-blow-in-its-fight-against-the-macbook",
  "title": "New Samsung 90Hz OLED laptops might be the next blow in its fight against the MacBook",
  "category": "computing",
  "updated": "2021-01-27T14:53:45Z",
  "author": "carly-page",
  "summary": "Mass production of the displays will start next month",
  "article": [
    "Samsung Display has announced that it will soon start mass producing the \"world’s first\" 90Hz OLED panels for laptop and notebook devices.",
    "Although smartphone users have become accustomed to 90Hz and even 120Hz displays, it's a different story when it comes to laptops. LCD screens have been able to hit high refresh rates for some time, but OLED panels - which offer punchier, more vibrant visuals - currently top out at 60Hz.",
    "Samsung Display’s announcement, however, could suggest that 90Hz OLED laptops could become more commonplace starting this year.",
    "In its announcement, the company said it will start producing 90Hz OLED screens in “very large quantities” starting in March, adding that that “several global IT companies” are expected to release laptops that feature the new panels later this year.",
    "Samsung also confirmed that the panels are 14-inch in size, though it hasn’t yet revealed any further details regarding aspect ratio or resolution. However, the company has said that the 90Hz will offer 10 times the fastest screen response time on the market today and deliver “high-speed driving that is on par with that of 120Hz LCD screens”.",
    "While there are a number of OLED laptops already available - including the Gigabyte Aero 15 OLED and Samsung’s own Galaxy Chromebook - these all deliver a 60Hz refresh rate. Samsung Display’s move to mass produce 90Hz panels could trigger a wave of 14-inch laptops with faster refresh rates that deliver smoother-looking visuals for gaming and remote working.",
    "“OLED display panels can best satisfy the diverse consumer needs for laptops used in telework, online education, video streaming, and gaming,” the company said.",
    "While good news for those after punchier visuals, it’s likely these incoming laptops won’t be cheap. Samsung admits that a high-spec graphics card will be required to power the display, which is likely to have a hit on battery life too."
  ],
  "headers": {},
  "links": {
    "laptop": "https://www.techradar.com/laptops",
    "announcement": "https://www.businesswire.com/news/home/20210120005673/en/Samsung-Display-to-Introduce-First-90Hz-OLED-Laptop-Display/?feedref=JjAwJuNHiystnCoBq_hl-Q-tiwWZwkcswR1UZtV7eGe24xL9TZOyQUMS3J72mJlQ7fxFuNFTHSunhvli30RlBNXya2izy9YOgHlBiZQk2LOzmn6JePCpHPCiYGaEx4DL1Rq8pNwkf3AarimpDzQGuQ==",
    "Gigabyte Aero 15 OLED": "https://www.techradar.com/reviews/gigabyte-aero-15-oled-2020",
    "Samsung’s own Galaxy Chromebook": "https://www.techradar.com/reviews/samsung-galaxy-chromebook"
  }
}