{
  "source": "https://www.techradar.com/news/reddit-gets-tiktok-like-videos-but-has-it-missed-the-boat",
  "title": "Reddit gets TikTok-like videos – but has it missed the boat?",
  "category": "computing",
  "updated": "2021-08-17T11:16:25Z",
  "author": "daryl-baxter",
  "summary": "TikTok inspiration strikes again",
  "article": [
    "Reddit is the next social platform to take on video, with an update to its iOS app that’s slowly rolling out to users.",
    "The popular website has recently had some big redesigns on both its desktop site and its mobile apps on iOS and Android, making it easier for users to find and create content in certain groups, or subreddits as they're called.",
    "If you’re a heavy Reddit user, you’ll likely be subscribed to many subreddits that revolve around certain topics, and you can upvote, downvote and comment as you wish.",
    "But many people are submitting videos to these subreddits, which is where this feature comes in, making it easier to scroll through the video without having to manually go to each post.",
    "For users on iOS, a video icon is slowly showing up beside the search bar. You’ll be presented with a rolling feed of video on the subreddit you’re currently viewing, which you can swipe through, similar to TikTok.",
    "There’s also the option to watch video from all the subreddits you’re subscribed to, so you can keep up to date with what’s been submitted.",
    "Reddit has said via TechCrunch that the feature is rolling out to everyone in the coming months, but didn’t comment on whether it would also be coming to Android in that timeframe.",
    "After years of social media platforms refining and introducing new features, video still seems to be the next big challenge that companies want to get right in a bid to attract new users.",
    "With the rise of Stories that began in Instagram, and the growing popularity of TikTok with its rolling video feed of advice, memes and influencers, Reddit wants to see how it can broadcast video in a more engaging way to its users.",
    "Browsing through Reddit on the web has often felt like using a website from the late 90s, with its color scheme and layout leaving a lot to be desired. However, its updated apps on both iOS and Android have been received well, and Reddit seems to be aware that these apps are now a more popular way to browse the website than via a desktop browser on a PC or laptop.",
    "With this latest effort, time will tell whether the feature will bring new users to Reddit, but it’s encouraging to see this feature work so well already, without it being yet another step into the Stories saga that Facebook, LinkedIn and others have been trying to perfect.",
    "Couple this with the ability of this feature to compile the videos into one long feed on all your subscribed subreddits, and this could be a feature that appeals to more users than some may think at present.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "How do you use the feature?",
    "7": "Analysis: Another video feature, another fad?"
  },
  "links": {
    "iOS": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-8664415069668994000&sharedId=trd-us&u=https%3A%2F%2Fapps.apple.com%2Fus%2Fapp%2Freddit%2Fid1064216828",
    "Android": "https://play.google.com/store/apps/details?id=com.reddit.frontpage&hl=en_GB&gl=US",
    "TechCrunch": "https://techcrunch.com/2021/08/13/reddit-is-quietly-rolling-out-a-tiktok-like-video-feed-button-on-ios/"
  }
}