{
  "source": "https://www.techradar.com/features/inside-invasion-apple-tvs-alien-sci-fi-show-thats-really-about-human-isolation",
  "title": "Inside Invasion, Apple TV’s alien sci-fi show that’s really about human isolation",
  "category": "entertainment",
  "updated": "2021-10-24T14:00:00Z",
  "author": "tom-power",
  "summary": "‘We’re vulnerable and we need to care for each other’",
  "article": [
    "Mild spoilers for Invasion episodes 1-3 follow.",
    "Alien invasion movies and TV shows are a key cornerstone of the sci-fi genre. From Independence Day and District 9, to The X-Files and Falling Skies, audiences have grown accustomed to the film and TV industries churning out stories about aliens invading Earth.",
    "With so many comparable productions already available to viewers, how do studios and showrunners go about making an original alien invasion tale that audiences haven’t seen before?",
    "For the creators of Invasion, Apple TV Plus’ latest sci-fi show, the answer to this challenging question was two-fold: tell a story with a distinctly global appeal and ground it in the theme of human alienation.",
    "“We don’t often see an alien invasion with a global cast; it’s not canon in this genre,” co-creator David Weil tells TechRadar. “But I think the series’ message is that there’s more that unites us than divides us, and I hope Invasion acts as a reflection on our global interconnectivity rather than people isolating themselves from one another.”",
    "Ahead of Invasion’s October 22 release, TechRadar sat down with Weil and the series’ cast to discuss its exploration of human isolation. We also dig into the show’s chief influences and the design process behind its unusual and spooky aliens.",
    "Set in the present day, Invasion tells the story of six individuals, spread across four continents, when a seemingly invisible alien species threatens the existence of humanity itself.",
    "Sam Neill (Jurassic Park) stars as US Sheriff Jim Bell Tyson, the first individual to realize that extraterrestrials have invaded Earth. Meanwhile, Golfshifteh Farahani (Extraction) and Firas Nassar (Fauda) play married couple Aneesha and Ahmed Malik, who embark on a roadtrip to cross the US-Canadian border to try and keep their children safe.",
    "Shamier Anderson (Awake) portrays US Navy Seal Trevante Ward, who encounters the aliens during a tour of Afghanistan, while Japanese Space Agency technician Misuki Yamato, played by Deadpool 2’s Shioli Kutsuna, attempts to unravel the aliens’ origins. Finally, Billy Barratt (A Christmas Carol) features as Caspar Morrow, a British national whose school trip is interrupted by the martians’ attack.",
    "From the outset, Weil and co-creator Simon Kinberg (X-Men: Days of Future Past, Sherlock Holmes) wanted to develop a unique alien invasion tale. Even so, Weil admits that it was inevitable that Invasion would be influenced by similar stories – with one particularly iconic tale acting as a major reference point.",
    "“I always wanted to adapt War of the Worlds,” Weil says. “As a kid, I was so inspired by H.G. Wells’ novel, and then by Orson Welles’ 1938 radio play. So I wanted to create a story that skirted reality and fiction, and that gave the same kind of experience to audiences that both individuals did for their time.”",
    "Surprisingly, Weil and Kinberg both worked on CBS’ 2019 revival of The Twilight Zone, but it wasn't here that their paths crossed ahead of collaborating on Invasion. Instead, the duo were simultaneously working on separate alien invasion TV series – until Weil’s agent suggested that they should join forces and work on a combined project.",
    "“It [our original meeting] was supposed to be an hour-long meeting,” Weil explains. “But it turned into a seven-hour one! We pitched ideas back and forth, and talked about characters that we had in mind. It was this incredible dance of collating ideas, which led to us spending two years building and refining Invasion’s story.”",
    "No good alien invasion story is complete without its intimidating antagonists. Coming up with a unique alien design for Invasion, though, proved more problematic than initially predicted.",
    "“[The main inspiration was] our nightmares,” Weil reveals. “Simon and I thought ‘What are the nightmares that we had as kids? What scares us now?’ That was our starting point, but it took a year before we decided how we wanted these creatures to look and sound. It’s really tough to find a new alien – you never want to do what someone else has done. In the end, our creature designers came up with something amazing.”",
    "With the aid of a SETI (Search for Extraterrestrial Life Institute) consultant, VFX supervisor Erik Henry (Watchmen, Tom Clancy’s Jack Ryan) and his team produced a design that Weil believes will generate “terror and excitement” in audiences. The monsters’ final look, described as part-machine and part-organic, is one that Invasion’s showrunners think is completely original, even if viewers don’t get a good glimpse of them in the show’s first few episodes.",
    "The alien’s CGI creations also posed difficulties to the show’s cast. With no physical models to look at or act around, Invasion’s actors had to get imaginative when filming scenes where the aliens were present.",
    "“There’s a scene where I fight one of them,” Farahani, who plays Aneesha, reveals. “And the only prop I had was a green cushion. When I had to go back in and re-record my lines for that scene at a later date, I found it very funny watching it back.”",
    "“Usually, you hear about green screens being used or tennis balls on a stick,” Anderson, who portrays Trevante, adds. “But you still have to emote and pretend you’re looking at something you’re fearful of. I used what I refer to as my ‘Godzilla face’, where you pretend that you’re seeing something that’s terrifying and awe inspiring.”",
    "Amid its alien invasion backdrop, Apple’s latest sci-fi offering hits close to home from a thematic perspective: for one, the ongoing pandemic has left people feeling isolated from their families, friends and communities. Meanwhile, growing divisions between nations, and even within a country’s own population, have led to increasing human alienation and societal segregation.",
    "It’s these real-world issues, set in Invasion’s fictional world, that should resonate deeply with viewers. Aneesha and Ahmed are immigrants who feel like second-class citizens in their adopted homeland. Trevante and Mitsuki feel lost and alone after the deaths of people that they cared for. Caspar, who suffers from seizures, is bullied at school and often feels alienated due to his illness.",
    "For Nassar, who portrays Ahmed, Invasion isn’t just a story about extraterrestrials attempting to take over the world – it’s a show that subjectively leaves a mark because of what humankind is currently going through.",
    "“Invasion is the closest thing to helping me understand what we’re experiencing,” Nassar says. “Whether it’s loneliness, isolation or even just survival. The story we’re telling feels familiar to what humanity’s gone through over the last two years. So while it’s a well written drama with deep characters, it’s also very nuanced.”",
    "“It’s what attracted me to this story,” Farahani adds. “We’re really talking about peoples’ lives and psychology. Aneesha realizes that Ahmed has been cheating on her [in episode 1] so, while these aliens are invading Earth, this other woman has also invaded her home. There’s a parallel between what’s happening in her home and the wider world, which acts as a metaphor for our own lives. We’re vulnerable and we need to care for each other.”",
    "It’s hard to predict what kind of impact that Invasion will have – not only from viewership and ratings perspectives, but how it may emotionally affect those who watch it.",
    "True, the global nature of its story is significant in a subgenre that normally focuses on events in the US. Its themes, too, are topical for today’s climate. But with another Apple sci-fi series in Foundation, as well as other recently popular shows, competing for audiences’ attention, Invasion may struggle to attract viewers. That would be a shame, too, as it’s largely an intriguing watch.",
    "Still, Weil hopes that the unexpected triumph of certain newly released series, as well as the core themes in Invasion, show that humanity isn’t as divided as we might think.",
    "“Look at the success of Squid Game,” Weil says. “It’s crossed so many different language barriers, societies and cultures, and resonated with people globally. I also think the capacity for our crews, based around the world, to come together and create this show and beautiful art is a testament to shared artistry. I think it shows how incredible our shared humanity is.”",
    "Invasion episodes 1-3 are available to stream exclusively on Apple TV Plus now. New episodes will be released weekly."
  ],
  "headers": {
    "6": "Enemy at the gates",
    "13": "Menacing martians",
    "19": "Divided we fall"
  },
  "links": {}
}