{
  "source": "https://www.techradar.com/news/piracy-websites-are-raking-in-billions-of-dollars-in-ads",
  "title": "Piracy websites are raking in billions of dollars in ads",
  "category": "computing",
  "updated": "2021-08-13T11:22:41Z",
  "author": "mayank-sharma",
  "summary": "Google could hamper a catastrophic blow if it wants to, argues report",
  "article": [
    "Websites and apps that host and propagate pirate movies and TV shows rake in about $1.3 billion every year from online advertising alone, according to a new study.",
    "Prepared by online consumer safety group Digital Citizens Alliance and anti-piracy firm White Bullet Solutions Limited, the report is the result of a year-long investigation into the piracy industry, specifically to understand how it generates advertising revenues.",
    "“While piracy causes direct harm to creators and others who lose income when their content is stolen, the impact goes well beyond the entertainment industry. Consumers who use piracy websites and apps are three times more likely to be exposed to malware,” note the study’s authors.",
    "In addition to losses to content creators, and consumers, piracy also impacts the reputation of brands whose advertising appears on illicit websites.",
    "Digesting the comprehensive report, Bloomberg reports that the report is based on monitoring the ad-revenue of about 6000 websites and 900 apps that host pirated content between June 2020 and May 2021.",
    "According to its analysis, major brands accounted for about 4% of the advertising on the pirate websites and 24% of the ads on pirate apps, with Amazon, Facebook, and Google the largest companies represented.",
    "The biggest chunk of advertising though didn’t come from ads but rather sponsored content with click-bait headlines.",
    "Interestingly, the report also highlights the unique role of Google, the “800-pound gorilla” in the online advertising space, in the piracy advertising world.",
    "\"Despite having a sophisticated and dedicated program to protect advertisers and block ads to illegal publishers, Google is a significant contributor to the piracy ecosystem, both as an advertiser paying piracy websites and apps for ad space, and as an Ad Tech enabler facilitating ad placement for third party brands on piracy apps,” says the report arguing that Google has the knowledge and expertise to stop its advertising revenue from flowing to the illicit websites.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Google’s inadvertent role"
  },
  "links": {
    "Websites": "https://www.techradar.com/news/the-best-website-builder",
    "online advertising": "https://www.techradar.com/best/best-online-marketing-services",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-12/pirated-entertainment-sites-are-making-billions-off-of-ads"
  }
}