{
  "source": "https://www.techradar.com/news/unlike-the-nintendo-switch-valves-steam-deck-wont-get-boosted-performance-when-docked",
  "title": "Unlike the Nintendo Switch, Valve's Steam Deck won't get boosted performance when docked",
  "category": "gaming",
  "updated": "2021-08-23T07:06:33Z",
  "author": "jess-weatherbed",
  "summary": "No upscaling for you",
  "article": [
    "We may have been so concerned about the Stream Deck's ability to play games at higher framerates that we didn't stop to consider how docking the device would affect its performance.",
    "Despite the Nintendo Switch (arguably the best-established comparison product to Valve's new handheld) boosting games to 1080p when the console is docked (up from its native 720p), Valve didn't see the need to include a similar feature for its own portable gaming device. This may mean that you'll see better performance on the Steam Deck when using it solely as a handheld, especially if you only have a large 4K TV, which is fairly common in modern homes.",
    "In fact, you'll likely see a drop in performance even if you hook the Steam Deck into a 1080p desktop monitor too. In an interview with PC Gamer, Valve’s Greg Coomer revealed that while a “higher power mode” was previously conceived to help boost performance when docked that, the idea was eventually shelved.",
    "“We felt that it was actually better all things considered to not modify based on docked status or mobile status,” Coomer explained.",
    "“We really wanted to prioritize for using it in what we thought would be the highest use case, which is actually mobile, and so since we were focusing on that, and we chose like a threshold where the machine will run well, and with a good frame rate with AAA games in that scenario. We didn’t really feel like we should target also going after the dock scenario at higher resolutions.\"",
    "The Steam Deck's native resolution is set to 1280x800p, though Valves has assured folk that you can still change the resolution just as you would on any gaming PC. It is, after all, a computer despite its deceptive appearance. But like any PC, changing the resolution is going to affect framerate and performance, which makes the appeal of playing games in docked mode questionable for some.",
    "If you're looking to use Valves latest hardware as a dedicated indie or retro machine then you'll have little to worry about, but it's highly unlikely you'll be able to plug into a 4K TV and play something like The Witcher 3 or Horizon Zero Dawn at a pleasant level.",
    "Thing is, that isn't really the point of the Steam Deck, and if you're preparing yourself for disappointment on that front then you're not the market that Valve is targeting. To use the old saying \"you get what you pay for\"; the Steam Deck offers incredible portability when compared to a gaming laptop, and at a much cheaper price point – expecting it to have the same performance output is a sure-fire way of getting disappointed.",
    "Gabe Newell, Valve president and co-founder, even expressed that affordability was a key part of the Steam Decks design. \"I want to pick this up and say, oh, it all works. It's all fast. It's all... and then price point was secondary and painful. But that was pretty clearly a critical aspect to it,\" Newell said in an interview with IGN. \"But the first thing was the performance and the experience, that was the biggest and most fundamental constraint that was driving this.\"",
    "Of course, none of this is to suggest that you shouldn't use the hardware while docked, but curbing your expectations will prevent disappointment. For things like Stardew Valley, Counter Strike: Global Offensive or Hotline Miami, go for your life. If you're wanting to give something Like Cyberpunk 2077 a go though, consider saving your pennies for something with a dedicated GPU inside."
  ],
  "headers": {
    "2": "Don't Steam ahead with your expectations"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "interview with PC Gamer": "https://www.pcgamer.com/uk/steam-deck-dock-performance/",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Newell said in an interview with IGN": "https://www.ign.com/videos/gabe-newell-talks-steam-decks-origin-goals-and-future",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}