{
  "source": "https://www.techradar.com/news/under-the-hood-upgrade-drives-ethereum-to-another-major-milestone",
  "title": "Under-the-hood upgrade drives Ethereum to another major milestone",
  "category": "computing",
  "updated": "2021-05-06T11:04:31Z",
  "author": "joel-khalili",
  "summary": "Ether price surpasses $2,500 for the first time in its history",
  "article": [
    "Ether, the cryptocurrency of the Ethereum blockchain, vaulted beyond a valuation of $2,500 per coin for the first time overnight following an update to the network.",
    "The world’s second largest cryptocurrency held this new peak for a brief period, before making a retreat to circa $2,330, its price at the time of writing.",
    "The arrival at this landmark price point is the culmination of a cryptocurrency bull run (or period of growth) that extends back to November last year, at which point Ether was valued at just $500 per unit.",
    "This swing in price might appear less impressive than the growth achieved by Bitcoin in recent months, but Ether has actually provided investors with a greater return (+400%) than its more famous counterpart (+250%) since crypto fever made a comeback.",
    "The new milestone price was achieved in the immediate aftermath of the latest upgrade (or hard fork) to the Ethereum network, which took effect with block 12,244,000.",
    "Codenamed Berlin, the hard fork delivered on four so-called Ethereum Improvement Proposals (EIP) designed to reduce transaction fees, pave the way for new transaction types and stave off potential DDoS attacks.",
    "However, the Berlin hard fork is just a precursor to the more significant London upgrade, slated for the summer. This update will overhaul the network’s bid-based fee structure in a major way, with the goal of relieving congestion and stabilizing transaction costs.",
    "No longer will users pay miners a “gas” fee in exchange for the inclusion of a transaction in a block. Instead, the network itself will receive and then burn a set fee (called BASEFEE), with miners paid a small and optional tip (on top of newly minted cryptocurrency).",
    "The London hard fork has garnered support from Ethereum app developers and users alike, while others have speculated the introduction of a fee burn could trigger a rise in the price of Ether, by limiting supply. Predictably, however, the mining community is less enamored with the proposal.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via CoinDesk"
  ],
  "headers": {
    "4": "Ethereum hard fork"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "DDoS": "https://www.techradar.com/news/best-ddos-protection",
    "CoinDesk": "https://www.coindesk.com/berlin-hard-fork-is-now-live-on-ethereum"
  }
}