{
  "source": "https://www.techradar.com/news/6-core-and-8-core-cpus-are-surging-in-popularity-going-by-steam-data",
  "title": "6-core and 8-core CPUs are surging in popularity, going by Steam data",
  "category": "computing",
  "updated": "2021-04-03T12:33:32Z",
  "author": "darren-allan",
  "summary": "Quad-core processors remain dominant – for the time being",
  "article": [
    "8-core and 6-core (hexacore) processors are rapidly becoming much more popular these days, according to fresh data compiled from past Steam hardware surveys.",
    "The historical graphs shared on Twitter (spotted by Tom’s Hardware) show that both these types of multi-core CPUs are being bought in much greater quantities as of 2021, and indeed 8-core processors are about to surpass dual-core models, with 6-core chips not too far off the market share of quad-core CPUs.",
    "As you can see, quad-core processors remain the dominant force with just over a 40% market share, but 6-core CPUs are not far behind on a smidge over 30%. 8-core processors are around 12%, and dual-core about 13%.",
    "This isn’t a surprising trend, although it’s definitely interesting to see a snapshot of how the market currently looks (at least according to this graph of Steam’s data). AMD has been pushing forward with multi-core chips for some time now, and Intel has followed suit (even if Team Blue still puts a lot of emphasis on fast single-core performance).",
    "6-core models appear to be on a steeper upward trajectory than 8-core, and again that’s no surprise given that the likes of the Ryzen 5 3600 have been absolutely flying off the shelves in the past (as a powerful yet affordable option).",
    "Further remember that these figures will also reflect gaming laptops as well as desktop PCs, and in the latter world, the dominance of multi-core processors is likely even more pronounced.",
    "The popularity of these multi-core chips – and of course their presence in modern consoles – is doubtless pushing game developers to make better use of the likes of 8-core CPUs, which should only further cement their popularity going forward.",
    "Indeed, there is a possibility that the really heavyweight Ryzen processors which exceed 8-cores are going to become more popular in the future.",
    "Intel has, of course, taken a step backwards to 8-cores with its newest 11th-gen Rocket Lake processors (whereas Comet Lake had a 10-core flagship). However, things are going to be very different with 12th-gen Alder Lake chips which opt for a whole new design of powerful cores combined with low-power (power-efficient) cores – and it will be very interesting to see how that pans out."
  ],
  "headers": {
    "4": "6-core success"
  },
  "links": {
    "processors": "https://www.techradar.com/news/best-processors",
    "Twitter": "https://twitter.com/Jebisabigfatmes/status/1377803181992902657",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/6-8-core-popularity-market-share",
    "absolutely flying off the shelves": "https://www.techradar.com/news/amd-cpu-sales-skyrocket-with-ryzen-5000-launch-leaving-intel-in-the-dust",
    "Rocket Lake processors": "https://www.techradar.com/news/intel-rocket-lake",
    "Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "12th-gen Alder Lake chips": "https://www.techradar.com/news/intel-12th-gen-details-leak-ahead-of-11th-gen"
  }
}