{
  "source": "https://www.techradar.com/news/this-tiny-oculus-quest-2-update-just-made-connecting-with-friends-a-whole-lot-easier",
  "title": "This tiny Oculus Quest 2 update just made connecting with friends a whole lot easier",
  "category": "gaming",
  "updated": "2021-08-17T10:03:26Z",
  "author": "axel-metz",
  "summary": "Small update, big improvement",
  "article": [
    "In today’s technology-filled world, it’s easy to lose track of the small features that make connecting and sharing with friends an effortless process.",
    "It’s only when you jump into the virtual environment of an Oculus Quest 2, for instance, that you realize just how important something as simple as an invite link can be to enhancing your social experience.",
    "Well, more than five years after the launch of the company’s first VR headset – which was recently discontinued, as it happens – all Oculus devices have now been updated with the ability to invite friends to game sessions via a simple web link.",
    "That might sound like a trivial addition, but it’s a massive step towards improving the social experience of players using Oculus-branded VR headsets. Essentially, users now have the option to set up multiplayer game sessions outside of their device, making meeting up and playing with friends inside their headset a far easier process.",
    "To generate a URL-based invite link (which can be sent to friends’ mobile devices, posted to social accounts or hand-delivered in an envelope, if you fancy) players can now navigate to the Social tab in the Oculus mobile app on iOS or Android, select the VR title they’re planning a session for and generate a custom invite link for players to jump into the action as soon as they’re back inside their headset.",
    "Users can still create a Party and join up with friends that way, if they prefer, but Oculus is hoping that invite links “will streamline the process for those ad-hoc hangouts.”",
    "As part of the update, the company has also added an ‘Invite to App’ button that allows users to send a pop-up invite notification to friends, people they recently played with or in-game connections, without the need to navigate complex menus. Once the invited player accepts, they’ll be whisked into the multiplayer session, further simplifying the social experience on Oculus devices.",
    "It’s worth noting that only some Oculus apps support both features at present, with more developers expected to adopt the new functionality in the coming months. But titles like Beat Saber, Blaston, Echo VR, Hyper Dash and PokerStars VR are set to benefit imminently.",
    "Perhaps the biggest criticism of Oculus’ VR devices has been their tendency to isolate players in the virtual environments they so brilliantly create.",
    "Sure, users have long had the option to link up and play with friends, but doing so has always been a lengthy and overcomplicated process. Now, at least, players have the option to invite friends to games before putting on their headsets, as well as the ability to generate in-game invite links far quicker than was previously possible.",
    "A big part of our Oculus Quest 3 wish-list is a neighbourhood-like social space for players to more easily interact with others. This update hasn’t brought quite that level of improvement just yet, but these seemingly-small additions mark major steps towards making some of the best VR headsets the most social ones, too.",
    "Via RoadToVR"
  ],
  "headers": {
    "8": "Analysis: Isolating reality"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "recently discontinued": "https://www.techradar.com/news/the-oculus-rift-s-is-dead-long-live-the-oculus-quest-2",
    "now been updated": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=43993&u1=trd-us-6427462103924390000&murl=https%3A%2F%2Fwww.oculus.com%2Fblog%2Fnew-oculus-software-update-makes-it-easier-to-play-games-with-friends-and-adds-new-security-settings%2F",
    "Oculus Quest 3": "https://docs.google.com/document/d/1upk89hg1G6vtS-TEme4cofSYP5ru_E7xgxd13p5a1EU/edit",
    "best VR headsets": "https://www.techradar.com/news/the-best-vr-headset",
    "RoadToVR": "https://www.roadtovr.com/invite-link-friends-oculus-quest-rift/"
  }
}