{
  "source": "https://www.techradar.com/news/amazon-prime-video-just-got-one-of-the-best-cult-tv-shows-ever-in-the-us",
  "title": "Amazon Prime Video US is now streaming one of the best cult TV shows ever",
  "category": "entertainment",
  "updated": "2021-07-27T09:49:28Z",
  "author": "samuel-roberts",
  "summary": "Garth Marenghi's Darkplace has a new home",
  "article": [
    "Garth Marenghi's Darkplace has arrived on Amazon Prime Video in the US. The horror-themed 2004 UK TV comedy is now available to stream, with the endorsement of Knives Out director Rian Johnson, one of the show's many fans.",
    "Darkplace's co-creator and star Matthew Holness tweeted the news out over the weekend. You can watch Darkplace on Amazon US here.",
    "So, why should you care? Well, if you're a Prime Video user in the US and you're in the mood for a genuinely hilarious comedy that parodies Stephen King-style horror and '80s genre shows with genuine affection, this is the next thing you should add to your watch list.",
    "Garth Marenghi's Darkplace is a show-within-a-show. The titular Marenghi, played by Holness, is a hokey horror author who's written more books than he's actually read – a fact he's proud of. In the 1980s, Marenghi produced a short-lived TV series set in a hospital where ludicrous, spooky goings-on would occur, like an outbreak of utensils that move telekinetically, or a poisoned water supply that turns the infected into apes (in an episode called 'The Apes of Wrath').",
    "The show resembles bad 1980s fare like Manimal in its presentation, with much of the humor derived from its poor production values: visible strings for floating objects, no continuity between shots and Marenghi's terrible writing, not to mention the fact that he decided to make himself the show's dubious star.",
    "In Garth Marenghi's Darkplace, then, this dreadful series-within-a-series has now been unearthed for the first time after being buried (rightly) by nervous TV execs back when it was made. In the present day, Marenghi and his collaborators offer commentary around the original footage of the show, displaying no self-awareness about how awful it is, and trying to make themselves look good at every turn. The contrast between '80s parody and modern day DVD extra-style talking heads is pure magic – helped by total commitment to the joke by its cast and crew.",
    "It's weird, funny and a genuine cult favorite – it never got a second run on Channel 4 in the UK, where it was created, but found a new audience on DVD. A spin-off talk show was also made, called Man to Man with Dean Learner, with both Holness and co-creator/star Richard Ayoade reprising their roles from Darkplace.",
    "Darkplace is far from an unknown quantity in the US, but it's not exactly Doctor Who when it comes to successful UK imports, either. The series originally aired on the Sci-Fi Channel back in 2006, and also showed on Adult Swim, where its weird sense of humor is a perfect fit alongside the likes of The Eric Andre Show.",
    "Garth Marenghi's Darkplace is streaming now on Prime Video in the US – UK viewers can watch it for free on All4 with ads. Here's Rian Johnson's endorsement, in case you need encouraging:",
    "We live in a slightly different age when it comes to international TV than we did 10 or even 20 years ago. HBO Max, for example, launched with every episode of modern Doctor Who available to stream as a selling point – and a British series like Sex Education can captivate a global audience because it's available to stream anywhere you can get Netflix.",
    "Garth Marenghi's Darkplace launched in a very different time. It released in January 2004 on a UK channel, and even though it was supported by an intriguing commercial that committed to the fiction of the show, it was probably just too weird for the time. If it landed maybe five years later, a more internet-ready TV landscape could've been ready for it.",
    "The fact it took two years to reach a US audience, too, means this likely had no bearing on the series' chance of renewal for further series. Darkplace ended after only six episodes, but its legacy has clearly endured.",
    "As mentioned, Holness created the show with Richard Ayoade, who notably went on to direct the movies Submarine and The Double (starring Jesse Eisenberg). The character of Garth Marenghi originated in an award-winning stage show – both creators made the TV series when they were in their twenties, which is a massive achievement considering its quality. They were each members of Cambridge University's Footlights theater group, which seems like a dead cert way to find yourself on British TV based on its member history.",
    "Man to Man with Dean Learner wasn't quite as creatively successful as Darkplace – but it's well worth tracking down if you become a Marenghi aficionado too."
  ],
  "headers": {
    "9": "Analysis: Why some British shows take in the US and others don't"
  },
  "links": {
    "Amazon Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Darkplace on Amazon US here": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSkipper-the-Eyechild%2Fdp%2FB09B574VTD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1166578259272252700-20",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Sex Education": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "intriguing commercial": "https://www.youtube.com/watch?v=SH0Wms5-oNg"
  }
}