{
  "source": "https://www.techradar.com/news/moto-g60-mid-ranger-makes-an-early-appearance-in-leaked-renders",
  "title": "Moto G60 mid-ranger makes an early appearance in leaked renders",
  "category": "phones",
  "updated": "2021-04-02T09:30:33Z",
  "author": "david-nield",
  "summary": "Also known as the Moto G40 Fusion",
  "article": [
    "We first heard that a Moto G60 mid-range phone was on the way from Motorola a couple of weeks ago, and now we've got some leaked renders plus a few extra hints about the specs to examine too.",
    "The renders at TechnikNews show off the phone from all sides, and in terms of the look of the handset, it's along the same lines as the recently unveiled Moto G10, Moto G30 and Moto G50 (it seems Motorola is keen to cover as many numbers as possible).",
    "Unlike those phones though, the Moto G60 is apparently making use of a central punch hole for the selfie camera on the front – in that respect it's more along the lines of the Moto G100, though that phone has a dual-lens selfie camera, with the notches to the top left.",
    "There's also a rather dramatic and futuristic-looking two-tone effect on these Moto G60 renders that catches the eye. This picture shows a blue and green combination, but apparently a gray and brown option is in the pipeline too.",
    "While we can't verify that these renders are genuine, they do match up with pictures put forward by tipster Abhishek Yadav on Twitter, alongside another phone: the Moto G20. That would plug the gap between the Moto G10 and the Moto G30 nicely.",
    "Yadav says the Moto G20 will have a quad-lens rear camera, a fingerprint scanner on the back, and a teardrop notch. The Moto G60, on the other hand, is said to be sporting a 108MP triple-lens rear camera.",
    "TechnikNews goes over some of the specs we've heard before about the Moto G60: a 6.78-inch, full HD+ 120Hz display, a Qualcomm Snapdragon 732G processor, and up to 6GB of RAM and 128GB of internal storage. A dedicated Google Assistant button and a headphone jack will also be present.",
    "It seems that the phone will be called the Motorola G40 Fusion in Brazil and India, and the main camera will be downgraded from 108MP to 64MP. It's not clear exactly when we'll see the new phone, but it should be sooner rather than later."
  ],
  "headers": {},
  "links": {
    "a Moto G60 mid-range phone": "https://www.techradar.com/news/moto-g60-leaks-suggest-it-will-be-another-impressive-motorola-mid-ranger",
    "TechnikNews": "https://www.techniknews.net/news/motorola-g60-g40-fusion-alle-informationen-vorab-exklusiv/",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Moto G30": "https://www.techradar.com/reviews/moto-g30",
    "Moto G50": "https://www.techradar.com/news/the-moto-g50-is-a-surprise-new-cheap-phone-and-it-comes-with-5g",
    "Moto G100": "https://www.techradar.com/news/moto-g100-announced-and-its-by-far-the-most-powerful-moto-g-yet",
    "Abhishek Yadav": "https://twitter.com/yabhishekhd/status/1377199293191217152"
  }
}