{
  "source": "https://www.techradar.com/news/apple-watch-on-one-wrist-amazon-halo-on-the-other-why-i-have-two-wearables",
  "title": "Apple Watch on one wrist, Amazon Halo on the other: why I have two wearables",
  "category": "wearables",
  "updated": "2021-03-21T13:00:27.904Z",
  "author": "david-lumb",
  "summary": "Hear me out: an Apple Watch 5 and Amazon Halo are both worth wearing",
  "article": [
    "I’ve used an Apple Watch 5 as my main smartwatch since it was released as a baseline to compare other wearables – and generally I’ve worn both at the same time until the review period was over before dropping the non-Apple device. No hard feelings, I’m just locked into the Apple ecosystem.",
    "Yet I finished the review on the Amazon Halo… and it’s still on my wrist months later. Here’s why I’m wearing two fitness wearables at the same time – and why you might want to, too.",
    "Let’s get one thing straight: I’m not advocating for wearing two Apple Watches, or even any two smartwatches. Each of my wearables offers something the other does not, and given the Halo doesn’t have a screen, the Apple Watch is the only one grabbing my attention – though it still feels a little silly to wear two devices at once.",
    "There are big advantages to sporting two wearables that have different approaches to tracking activity, and here’s my argument for why you’d want to dual wield wearables too.",
    "As previously mentioned, there’s a reason only one of my wearables has a display: I only want my notifications and text previews going to one wrist-mounted tracker. I can’t begin to imagine how dorky it would look if I had to check both wrists to see which got my call.",
    "To put it simply: it’s nice to have two wearables, but only need to fuss with one.",
    "When I do head out for a run or lift weights or sit down with some YouTube yoga, it’s nice to only have to activate workout tracking on the Apple Watch – the Halo automatically detects when I’ve worked up a sweat, and monitors your level of exertion with decent accuracy.",
    "As anyone who’s owned an Apple Watch knows, the battery barely lasts a day, so I snap it back on its wireless charger any time I’m back working at my desk. Without a screen, the Amazon Halo lasts a week before needing to juice up (so long as the oddball voice-analyzing Tone feature is turned off, or else that battery life shrinks to two days), so it’s nice to only worry about one wearable during the day.",
    "This keeps my stress minimal, making sure my watch and phone are topped off during the day and generally forgetting about the Halo until I want to check what it’s tracked.",
    "When I want to pay attention to my progress in the middle of a workout and immediately after I’ve pounded the pavement, I’ve got the Apple Watch. When I want to escape the grind of daily calorie/fitness/standing goals, I’ve got the Amazon Halo. That tracks health on a week-long basis with two scores: fitness and sleep, displaying big numbers to gauge my progress at a glance and more complex results if I want to delve deeper.",
    "That’s an arbitrary ‘if’ – some weeks, I just want to focus on daily goals tracked by my Apple Watch and easily visible on my iPhone’s big iOS 14 Fitness App widget, but feel secure knowing that the Halo is tracking my less immediate goals in the background. On the other hand, it’s good to let go of the grind of the Fitness App’s relentless daily calorie and exercise goals to see the bigger week-long picture of the Halo app’s Activity score.",
    "I don’t necessarily put more faith in one metric over another, but it’s nice to have both as motivating goals, especially to get me out of the house when working from home. I can either see my weekly progress via Halo Activity score, or look at the Calendar feature in the Apple Fitness app to see my streak. On any given day, one of those is bound to spur me on to get another run in.",
    "Likewise, I flip between both approaches to sleep tracking from day to day. Sometimes, I like seeing the Halo’s Sleep score that shows a graph of how long I spent in REM, Light, and Deep sleep states, as well as intermittent waking periods; others, I prefer Apple Health app’s weekly or monthly glances at sleep length. Both show me patterns, though I tend to prefer Amazon’s approach as it has a more insightful breakdown of my sleep activity with explanations of each stage.",
    "It helps that all the Halo’s information is only stored and visible in the Amazon Halo app; the Apple Watch 5 stores workout activity in the Fitness app and also tracks my sleep, but I keep forgetting that the latter records are stored in the Health app’s Sleep section. It’s a bit annoying for those results to be divided, and leads me to typically ignore the multitude of other features in the Health app (like mindfulness, activity, and so on) in my focus on workout results.",
    "Lastly, the Amazon Halo comes with six months of its premium service – essentially the full functionality of the wearable including its complex fitness and sleep scores as well as workout mini-classes provided by existing services like Orangetheory, 8fit, and Openfit. (Without this subscription, the Halo only tracks basic health metrics like steps and heart rate.) The Apple Watch, on the other hand, has access to Apple Fitness Plus were I to pay for its monthly subscription.",
    "Getting the former with essentially six months of trial service is a nice bonus given the latter may be hefty on top of the Apple Watch 5’s price, retailing for $399 / £399 / AU$649, though it’s been replaced by the Apple Watch 6 on Apple’s website. But the Amazon Halo is a reasonably affordable add-on at $99 (roughly £75, AU$140), and with six months of fitness classes and other extras, it’s not too bad of an add-on to your fitness game.",
    "But if one wanted to get a secondary fitness wearable, one of the more minimalist choices from our best cheap fitness trackers is probably the way to go – and while they might not offer the idiosyncratic tracking of the Amazon Halo, they do have longer battery life than most smartwatches and track in the background while you’re paying attention to your main wearable, which I’ve found to be the key.",
    "Just don’t get one that shows notifications from your phone – you’ll only want to worry about one of your wrists buzzing with missives and messages from the world."
  ],
  "headers": {
    "4": "One active, one passive",
    "9": "Two wearables, two approaches to health tracking",
    "14": "Two fitness services, too"
  },
  "links": {
    "best cheap fitness trackers": "https://www.techradar.com/best/best-cheap-fitness-trackers"
  }
}