{
  "source": "https://www.techradar.com/news/the-last-of-us-tv-show-casts-joels-daughter-so-what-does-this-mean-for-its-plot",
  "title": "The Last of Us TV show casts Joel’s daughter – so what does this mean for its plot?",
  "category": "entertainment",
  "updated": "2021-07-01T09:57:47Z",
  "author": "axel-metz",
  "summary": "Expect flashbacks galore",
  "article": [
    "HBO’s upcoming The Last of Us TV show has cast Joel’s daughter – and she’s an exciting newcomer.",
    "Nico Parker, best known for her role in 2019’s live-action Dumbo adaptation, has signed on to play Sarah, who first appeared in the traumatic opening scene of the celebrated 2013 survival game.",
    "Parker will join the likes of Pedro Pascal, Bella Ramsey, Gabriel Luna and Merle Dandridge in the miniseries, which is expected to arrive on HBO Max in 2022.",
    "As well as her lead role in Dumbo, Parker has already appeared in another HBO series, The Third Day, and will be joining Hugh Jackman in the upcoming sci-fi mind-bender, Reminiscence (alongside her actual mother, Thandiwe Newton, too).",
    "Given that we expect The Last of Us TV show to mirror the original game in terms of its timeline, at least, Parker will likely appear in a series of flashbacks, rather than acting alongside the likes of Bella Ramsey, who will play Ellie. That’s because her character, Sarah, dies 14 years prior to the game’s setting, after being shot by a soldier when fleeing her home with her father.",
    "That doesn’t mean her role will be any less important, though. Throughout the game, Sarah’s memory simultaneously haunts and motivates Joel in his quest to bring Ellie to safety, so we’re likely to see Parker in much more than a simple bit part.",
    "Recent comments made by the show’s writer, Neil Druckmann – who also penned the script for the Naughty Dog games – confirmed that some episodes will “deviate greatly” from the source material, though only in terms of their focus on drama over hardcore action.",
    "That suggests The Last of Us TV show will borrow heavily from the original game, meaning we can likely expect it to tell the same (or similar) plot.",
    "Druckmann also revealed that, for himself and showrunner Craig Mazin, the “philosophical underpinnings of the story“ were the essential aspect they wanted to get right with the adaptation.",
    "“As far as the superficial things, like should [a character] wear the same plaid shirt or the same red shirt?” he said. “They might or might not appear in it, that’s way less important to us than getting to the core of who these people are and the core of their journey.“",
    "Pre-production for the show is currently underway, and while we haven’t yet had an official release date, we don’t expect to see Joel and Ellie’s small-screen debut until at least 2022."
  ],
  "headers": {
    "6": "Will the show follow the game’s story?"
  },
  "links": {
    "The Last of Us TV show": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Reminiscence": "https://www.techradar.com/news/hbo-maxs-next-big-sci-fi-movie-from-the-westworld-creators-looks-pretty-cool",
    "Recent comments": "https://www.techradar.com/news/the-last-of-us-tv-show-will-see-some-episodes-deviate-greatly-from-the-game"
  }
}