{
  "source": "https://www.techradar.com/news/apples-arvr-headset-rumored-to-be-a-premium-device-arriving-in-2022",
  "title": "Apple's AR/VR headset rumored to be a premium device arriving in 2022",
  "category": "wearables",
  "updated": "2021-10-31T20:00:24Z",
  "author": "david-nield",
  "summary": "The wait is almost over... maybe",
  "article": [
    "An Apple device offering augmented reality and virtual reality experiences – a mixed reality headset, if you prefer – has been rumored for years at this point. The latest leaks around the hardware suggest it'll be a premium-level piece of kit, and that it could launch in 2022.",
    "That's as per the Power On newsletter written by Mark Gurman, who has historically been more right than wrong when it comes to his Apple predictions. There's not much new information here, but from the description given by Gurman it sounds like the headset will be more towards the premium end of the market.",
    "\"Apple is planning to unleash its own pricey device with advanced chips, displays, sensors and avatar-based features as early as next year,\" writes Gurman, putting the headset in the context of a similar device from Facebook that we've just heard about.",
    "Facebook – now called Meta, by the way – is planning a successor to the Oculus Quest 2 that is going to be more expensive and more powerful. The device is official, even if details are thin on the ground, and a 2022 launch has been promised.",
    "From what Gurman is saying, the Apple AR/VR/mixed reality headset will be along similar lines in terms of its functionality and price point. The technology required for these headsets is improving all the time, and next year could be a significant one in terms of new hardware hitting the market.",
    "Facebook/Meta is also rumored to be working on a smartwatch, which is another field that Apple has a serious interest in. If the leaks are correct, it's going to have a front-facing camera, which should help it stand out against the competition.",
    "It's not been easy to keep track of Apple's potential AR/VR device. What we do know for sure is that Apple boss Tim Cook is very keen on augmented reality, and has been quick to make sure AR capabilities are built into devices like the iPhone and the iPad.",
    "There's nothing to stop a headset combining both virtual reality (entirely enclosed digital worlds) and augmented reality (digital elements laid on top of the real world). The official term is mixed reality, although not everyone uses it to mean the same technology, which muddies the water somewhat.",
    "From what we know so far, it sounds as though there's both a more powerful Apple VR headset, as well as a pair of Apple Glasses that will specialize in AR. It's possible, though rather unlikely, that the rumors around these devices are actually referring to the same piece of hardware with both AR and VR features.",
    "The most likely scenario is that Apple gives us a device like the Oculus Quest 2 for VR and a device like Google Glass for AR. As yet, nothing is official, but we wouldn't be surprised if Apple launched a dedicated AR/VR gadget sometime in 2022.",
    "Via 9to5Mac"
  ],
  "headers": {
    "3": "Facebook vs Apple",
    "6": "Analysis: what exactly is Apple building again?"
  },
  "links": {
    "rumored for years": "https://www.techradar.com/news/apple-vr-headset",
    "Power On": "https://www.bloomberg.com/account/newsletters/power-on",
    "just heard about": "https://www.techradar.com/news/new-oculus-vr-headset-officially-teased-at-facebook-connect-2021",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "working on a smartwatch": "https://www.techradar.com/news/facebooks-rumored-smartwatch-leaks-revealing-one-big-feature-rivals-lack",
    "augmented reality": "https://www.techradar.com/news/apples-tim-cook-ar-has-the-ability-to-amplify-human-performance",
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review",
    "9to5Mac": "https://9to5mac.com/2021/10/31/gurman-apple-planning-pricey-mixed-reality-device-to-launch-as-early-as-2022/"
  }
}