{
  "source": "https://www.techradar.com/news/oneplus-9-vs-xiaomi-mi-11",
  "title": "OnePlus 9 vs Xiaomi Mi 11: top smartphone performance for less",
  "category": "phones",
  "updated": "2021-06-05T13:00:14Z",
  "author": "jon-mundy",
  "summary": "Built to make the smartphone elite overpriced",
  "article": [
    "Most people would prefer not to spend $1,200 / £1,200 or thereabouts on their next smartphone, especially in these uniquely challenging times.",
    "Thankfully, with phones like the OnePlus 9 and the Xiaomi Mi 11 on the market, you no longer need to. For hundreds of dollars or pounds less than a top flagship device, these two handsets offer an impressively complete experience.",
    "But how do they compare to one another? It’s not a like for like comparison by any means, offering an interesting case study on the cost of compromise.",
    "The OnePlus 9 was announced on March 23, 2021, then hit shops three days later on March 26. The Xiaomi Mi 11 had a rather more protracted rollout, having been announced in China in December 2020, then receiving a second global announcement in February 2021. It finally arrived in European markets in that same month.",
    "Neither of these phones is universally available right now. The Xiaomi Mi 11 isn’t being sold in the US, while the OnePlus 9 isn’t available in Australia.",
    "Prices for the OnePlus 9 start from $729/£629 for 8GB of RAM and 128GB of storage, while a move up to 12GB of RAM and 256GB of storage will set you back $829/£729.",
    "Prices for the Xiaomi Mi 11 start from £749 / AU$1,099 (around $1,057) for the 128GB model, while a 256GB model is available in the UK for £799 (around $1,128).",
    "The Xiaomi Mi 11 is the more expensive phone of the two, then. Once we’ve take a closer look at their capabilities in more detail, you’ll see exactly where that extra money is being spent.",
    "The first indicator as to why the Xiaomi Mi 11 carries a more expensive price tag is right there when you look at it. This is a much prettier and more ‘premium’ handset than the OnePlus 9.",
    "OnePlus has applied a so-called “burdenless” design philosophy in the making of the OnePlus 9, which equates to a device that’s solid yet somewhat bland. Its flat display and hole punch selfie camera are fairly generic, and the rear of the phone bears little in the way of distinguishing features - Hassleblad camera branding aside.",
    "Unlike the OnePlus 9 Pro, the OnePlus 9 passes up the use of metal in favor of a fiberglass-reinforced polymer frame. The back is still glass, though, and you get a choice of Winter Mist, Arctic Sky, and Astral Black finishes.",
    "Despite the use of plastic, the OnePlus 9 is a surprisingly heavy phone at 192g. It’s quite thick, too, at 8.7mm.",
    "The Xiaomi Mi 11 might be a little heavier at 196g, but it’s a fair bit thinner at 8.1mm. And it justifies its relative heft through the use of more premium materials - we’re talking a full metal frame, a glass back, and super-tough Gorilla Glass Victus covering the front.",
    "There’s a choice of finishes available here: Horizon Blue, Cloud White, Midnight Gray, Special Edition Blue, Gold, and Violet, though availability will vary according to region.",
    "Besides its more premium materials, the Xiaomi Mi 11 simply looks more special than its rival. Put it down to the way the display slightly tapers away at each edge, or the unique rounded-square camera module. Whatever it is, we dig it.",
    "Both of these phones packs in a uniquely functional hardware element, though. With the OnePlus 9 it’s the company’s trademark alert slider, which provides quick access to silent and vibrate modes. With the Xiaomi Mi 11, it’s an IR blaster than enables you to turn your phone into a universal remote control.",
    "We like the OnePlus 9’s 6.55-inch FHD+ OLED display a lot. It’s a nice size, it’s bright (1100 nits at its peak), and it’s color-accurate. It also moves at 120Hz, which is flagship-level stuff.",
    "Despite all this, the Xiaomi Mi 11’s display is flat out better. It’s the bigger screen at 6.81-inches, it’s sharper at 1440 x 3200 (QHD+), and it gets brighter at a peak of 1500 nits.",
    "Like the Samsung Galaxy S21 Ultra and the OnePlus 9 Pro, the Xiaomi Mi 11 can output at 120Hz and QHD simultaneously, so you’re getting the best of both worlds. We can worry about the battery life implications later.",
    "We mentioned in the previous section that the Xiaomi display is slightly curved, but the effect on video content isn’t egregious. Still, some will prefer the dead-flat nature of the OnePlus 9 screen, which is a viewpoint we can appreciate.",
    "Another stand-out stat for the Xiaomi Mi 11 display is its 480Hz touch input rate. That makes for a staggeringly responsive touchscreen experience, which only dedicated gamers will truly be able to appreciate. We should also note that it’s double the touch sampling rate offered by the OnePlus 9’s screen.",
    "Both phones use in-display fingerprint sensors, and quite frankly, neither is among the best we’ve used. The OnePlus 9’s is awkwardly placed low down on the phone and somewhat unreliable, while the Xiaomi Mi 11’s sensor is just plain unreliable.",
    "All in all, though, this is a resounding win for the Xiaomi Mi 11.",
    "Both of these phones make bold claims about their camera systems, and both impress in their own ways.",
    "The OnePlus 9 gives you the same 48-megapixel Sony IMX689 main sensor that carried the OnePlus 8 Pro to widespread acclaim last year. It’s the same big, bright, sharp sensor, albeit with OIS removed from the equation. That lack of OIS is the big shame here, and it at lest partially accounts for some slightly lackluster night shots.",
    "OnePlus is also keen to highlight the role of camera specialist Hassleblad, which has supplied its signature color science to the OnePlus 9. This results in slightly more natural tones, not to mention a tidy new camera UI.",
    "But the main sensor of the Xiaomi Mi 11 is at another level entirely. It utilizes the same 108MP f/1.9 Samsung ISOCELL HM3 sensor that you’ll find in the monstrous Samsung Galaxy S21 Ultra. That large sensor, combined with extreme pixel-binning and Xiaomi’s advanced AI, makes for bright, balanced, contrasty snaps. It also benefits from OIS assistance, so night shots are better.",
    "The OnePlus 9 hits back with its secondary sensor, however. Typically this is where some of the money is saved on any less-than-top-end phone, but not so here. The 50-megapixel Sony IMX 766 ultra-wide sensor is the exact same component as can be found in the OnePlus 9 Pro and the Oppo Find X3 Pro.",
    "Combined with a special freeform lens, it produces bright, sharp, vivid ultra-wide snaps with precious little of the usual distortions. It’s very impressive indeed, and it creates a true sense of balance with the wide sensor.",
    "The Xiaomi Mi 11 packs in a much less eye-catching 13MP f/2.4 ultra-wide sensor. It’s perfectly fine at what it does, but it simply can’t produce shots with as much detail, vibrancy, or contrast as that main sensor. Compared to the OnePlus, it’s a little lopsided.",
    "The Xiaomi also adds a 5MP telemacro sensor, though, which is slightly more useful than the OnePlus 9’s 2MP monochrome sensor. At least the Xiaomi can take reasonably accomplished extreme close-ups. What we wouldn’t give for a telephoto lens on both phones, however.",
    "When it comes to video capture, both phones can mange 8K video at 30fps or 4K video at 60fps.",
    "There’s really nothing to distinguish these two phones when it comes to raw performance. And the reason for that is quite simple - they use exactly the same Snapdragon 888 SoC.",
    "These are backed by the same 8GB of speedy LPDDR5 RAM, and in both cases you might find a 12GB upgrade, depending on your region.",
    "It’s no great shock, then, to find that the two phones produced very similar benchmark results in our tests. The Xiaomi Mi 11 got a multi-core score of 3569 in Geekbench 5, while the OnePlus 9 scored 3587.",
    "Both phones feel fast, whether running multiple apps, editing videos, or playing high-end games. You’ll be able to play PUBG Mobile and Genshin Impact on maxed out settings, though of course that’s more of an achievement with the Xiaomi given its QHD display.",
    "While we’re talking about games, we should also restate the fact that the Xiaomi employs a startlingly fast 480Hz touch sampling rate, which gives it a performance edge.",
    "Whichever phone you opt for, you’ll have the same starting storage capacity of 128GB. In both cases, and in certain regions, you’ll also be supplied with a 256GB upgrade option, though there’s no expansion potential with either.",
    "Both phones also give you proper stereo speakers, though the Xiaomi goes the extra mile in offering a partnership with audio specialist Harman Kardon. They’re meaty alright. Still, the OnePlus 9 can boast Dolby Atmos support, so they’re far from useless.",
    "If it’s nip and tuck on the hardware front, with a slight edge to Xiaomi, then OnePlus wins hands down on software. Oxygen OS offers decent customization and a distinct aesthetic, but without completely subsuming Google’s OS with tacky icons, intrusive pop-ups, and folders-full of bloatware.",
    "It’s just far more tasteful and pleasant to use than Xiaomi’s MIUI. That said, MIUI is much improved, with less bloat than before and a handful of unique customization options. You can really get the phone looking and feeling different, if you’re prepared to put the time and effort in.",
    "The OnePlus 9 has a 4,500 mAh battery, while the Xiaomi Mi 11 runs on a 4600 mAh unit.",
    "It’s not as simple as calling this a clear win for the Xiaomi, however. You have to remember that this slightly larger battery has to power a significantly bigger, sharper, and brighter display.",
    "Being able to run 120Hz and QHD simultaneously, in particular, is a proven way to see that low battery warning before the day is done. We found that the Xiaomi Mi 11 could lose juice fairly rapidly.",
    "Indeed, the Mi 11 would only make it through a full day of usage when we kept things light. If we took lots of pictures and played a few games in a day, we found that we’d have to plug it in before bed time.",
    "With the OnePlus 9, on the other hand, you’ll be able to get through a full day of moderate usage just fine. It’s not a two day phone by any stretch of the imagination, but it made us sweat a good deal less.",
    "Both phones recharge incredibly quickly. The OnePlus 9 has the edge on wireless charging speeds, thanks to a 65W charger that can charge from 1 to 100% in just 28 minutes. Still the Xiaomi Mi 11’s 55W charger is hardly a slouch. Both bricks are bundled in, too - do you hear that, Samsung and Apple?",
    "The Xiaomi Mi 11 hits back with support for 50W wireless charging, whereas the OnePlus 9 can only manage 15W.",
    "Both of these phones offer excellent value for money, giving you top-end performance for a slightly lower price tag. But the precise ratio of price to performance is slightly different.",
    "The OnePlus 9 will give you some of the best bangs-per-buck of any phone on the market, with top notch power, a strong display, and a capable camera for just $729/£629.",
    "On the other hand, the Xiaomi Mi 11 gives you a nigh-on full flagship experience for £749 / AU$1,099 (around $1,057). Yes, that’s a little more expensive than the OnePlus, but the extra money virtually removes any hint of compromise - questionable battery life aside.",
    "Considering you have to pay $1,200 / £1,200 / AU$1,900 to get anything meaningfully better, we found the Xiaomi Mi 11 to be ever so slightly more impressive."
  ],
  "headers": {
    "3": "OnePlus 9 vs Xiaomi Mi 11 price and availability",
    "8": "Design",
    "16": "Display",
    "23": "Camera",
    "32": "Specs and performance",
    "41": "Battery life",
    "48": "Takeaway"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888"
  }
}