{
  "source": "https://www.techradar.com/news/if-you-get-an-email-from-any-of-these-companies-think-twice-before-opening",
  "title": "If you get an email from any of these companies, think twice before opening",
  "category": "computing",
  "updated": "2021-02-09T14:47:21Z",
  "author": "mike-moore",
  "summary": "Microsoft, Facebook and PayPal are phishers’ favourite brands of 2020",
  "article": [
    "Phishing campaigns are increasingly using some of the world's most famous technology brands in an attempt to trick victims, new research has revealed.",
    "A report from Vade Secure has found that Microsoft, Facebook and PayPal were among the most-impersonated brands in phishing scams during 2020 as hackers look to create ever more realistic fake emails.",
    "Examining over a billion mailboxes across the world, the company's Phishers' Favorites report for 2020 named Microsoft as the brand most often found in phishing emails, followed by Facebook and PayPal.",
    "Microsoft retained its spot as the most-spoofed brand in 2020, having held that position throughout the year as users flocked to its Microsoft 365 collaboration platform during the pandemic.",
    "Unsurprisingly, coronavirus-themed emails saw an incredible rise throughout 2020, with scammers theming their campaigns with fake offers for PPE equipment, facemasks and vaccines, alongside messages that impersonated the NHS and World Health Organization.",
    "Cloud services were found to be the most impersonated industry, taking over from financial services as interest in such computing platforms again skyrocketed due to the remote working boom. Vade noted that Microsoft, Netflix, Apple, and Dropbox represented the most impersonated cloud services companies in the top 20, with both Google and Adobe seeing a significant growth in phishing URLs to move up two and three spots respectively.",
    "Ecommerce overtook social media to become the third most impersonated industry as consumer shopping habits evolved during lockdowns, with eBay jumping 28 spots to rank at #5 in 2020.",
    "“Organisations need to be aware that phishers and other threat actors are always looking out for new ways to target them,\" noted Adrien Gendre, Chief Product and Services Officer at Vade Secure.",
    "“Phishing is just one tactic used by hackers and the ever-changing popularity of well-known brands shows how cybercriminals’ tactics are constantly evolving.”"
  ],
  "headers": {
    "3": "Top phishing"
  },
  "links": {
    "Phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "Microsoft": "https://www.techradar.com/reviews/microsoft-365-review",
    "emails": "https://www.techradar.com/news/best-email-provider"
  }
}