{
  "source": "https://www.techradar.com/news/smbs-anxious-about-post-pandemic-digital-investment",
  "title": "SMBs 'anxious' about post-pandemic digital investment",
  "category": "pro",
  "updated": "2021-11-17T13:54:40Z",
  "author": "sead-fadilpasic",
  "summary": "Many are still hesitant to deploy new tech, study finds",
  "article": [
    "Despite technology proving to be a life-saver for many small and medium-sized businesses during the pandemic, many business leaders are still hesitant to deploy new tech. They are unsure about the potential benefits, such as increased productivity, or time savings, they might get from their investments.",
    "A new report from cloud-based accounting software platform Xero, based on a survey of more than 1,000 small business owners in the UK, found just two in five small businesses were open to taking risks when making business decisions.",
    "Furthermore, half are reluctant to accept the risk of negative outcomes from tech-related decisions, while just three in ten said they would feel bad about having to postpone digital investment, such as new collaboration tools.",
    "This sentiment seems to be relatively unique to the UK. Compared to the rest of the world, small businesses in the UK were the least likely to agree that new technology, once integrated, would benefit them, or benefit in things like immediate cost savings, time savings, or immediate ROI.",
    "This skepticism towards new technology isn’t based on facts, but rather gut feeling, the report further finds, claiming that the top five behavioral barriers include being stuck in the present, being resistant to change, fearing ambiguity and uncertainty, making relative judgments and being too bothered to care.",
    "Some businesses have more immediate priorities and just can’t get past the upfront costs, while others just prefer things to stay the same. Some don’t know how to compare their options and make a good call for their business, and some just think it’s too much of a hassle to go through with it.",
    "“In times of stress requiring rapid adaptation, we have to choose between fight, flight or freeze responses,” said Sonya Dineva, lecturer in business psychology at the University of East London.",
    "“In many cases, such as the current pandemic, fear and inertia can hamper our ability to ‘fight.’ By focusing purely on survival, small business owners may inadvertently decide not to do anything at all, adopting a ‘freeze’ approach to managing change. This may obscure their broader strategic vision and shift their focus onto short-term goals; as a result, they fail to see the pitfalls of such actions and the plethora of growth opportunities that could be hidden in crises, including the benefits of digitalization”.",
    "You might also want to check out our list of the best project management software out there right now"
  ],
  "headers": {
    "3": "Fight, flight, or freeze"
  },
  "links": {
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best project management software": "https://www.techradar.com/best/best-project-management-software"
  }
}