{
  "source": "https://www.techradar.com/news/theres-never-been-a-worse-time-to-own-a-roku-streaming-stick",
  "title": "There's never been a worse time to own a Roku streaming stick (Updated)",
  "category": "televisions",
  "updated": "2021-12-09T09:06:22Z",
  "author": "rhys-wood",
  "summary": "Google and Roku going head to head",
  "article": [
    "Update 12/08/21: Google and Roku have reached a last-minute agreement to keep the YouTube and YouTube TV apps available on the Roku Channel Store for the foreseeable future, meaning new users will still be able to access the full gamut of YouTube content.",
    "A Roku spokesperson told TechRadar: \"Roku and Google have agreed to a multi-year extension for YouTube. This agreement represents a positive development for our shared customers, making YouTube available for all streamers on the Roku platform.\"",
    "Original story continues below:",
    "If you've recently bought yourself one of the best Roku streaming sticks – as many of you may have, during the Black Friday and Cyber Monday sales – then you should download the YouTube app from the Roku Channel Store, if you haven't done so already.",
    "Why? The YouTube app is being completely removed from the Roku Channel Store on December 9, as reported by Tom's Guide. This follows the removal of the YouTube TV app back in April, 2021, amidst claims from Roku that YouTube parent company Google was engaging in anticompetitive practices.",
    "This time, Google is taking down its own app, stating that YouTube will be pulled entirely unless they \"reach agreement on renewal terms prior to the expiration of [the] current agreement\" – on December 9. But unless these companies kiss and make up very quickly, you should prepare for the worst.",
    "So even if you don't watch much content on YouTube, the app is still worth downloading to your Roku device in the (quite likely) case that it never returns to the Roku Channel Store.",
    "To do so, simply hit the Home button on your Roku remote, navigate to Streaming Channels and search for, or select, YouTube. With the app downloaded to your device, you won't have to worry about missing it when it disappears from the store on December 9. And fear not, the YouTube app will remain on your device even after it's taken off the Roku Channel Store.",
    "Roku itself doesn't seem like it's having a very good Christmas so far, as this isn't the first recent instance of the platform completely losing control of one of its premiere apps. Just last week, it was reported that a recent update broke the Netflix and Disney Plus apps on the platform, forcing Roku to reverse the entire update while it looked for a fix.",
    "This understandably frustrated users, particularly those without the technical wherewithal to roll back to a previous version. And while the update was thankfully confined to a relatively small number of Roku TV and Roku Ultra users, overall it's not a great look for a brand that promotes the idea of having all your favorite entertainment available in one place.",
    "While we're sure the company will eventually have a fix for its ongoing Netflix and Disney Plus issues, there's unfortunately no patching up a complete removal of one of the best streaming apps from its store front.",
    "We obviously hope that Google and Roku can bury the hatchet and make both the YouTube app and YouTube TV available on Roku streaming devices once more, but we can't see that happening in the immediate future, given how much the relationship between these two companies appears to be souring."
  ],
  "headers": {
    "8": "Analysis: A bad patch for Roku?"
  },
  "links": {
    "Google and Roku have reached a last-minute agreement": "https://www.techradar.com/news/google-agreement-saves-roku-from-heading-the-same-way-as-windows-phone",
    "best Roku streaming sticks": "https://www.techradar.com/news/best-roku-streaming-device",
    "Tom's Guide": "https://www.tomsguide.com/opinion/heres-the-first-thing-every-roku-owner-should-do",
    "removal of the YouTube TV app": "https://www.techradar.com/news/youtube-tv-no-longer-available-on-roku-store",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review",
    "Roku to reverse the entire update": "https://www.techradar.com/news/roku-reverses-update-after-it-breaks-netflix-and-disney-plus-apps",
    "best streaming apps": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare"
  }
}