{
  "source": "https://www.techradar.com/news/microsoft-onedrive-is-still-operating-but-only-in-windows-7",
  "title": "OneDrive for Windows 7 gets stay of execution - for now",
  "category": "computing",
  "updated": "2021-04-29T15:54:45Z",
  "author": "mayank-sharma",
  "summary": "All Microsoft 365 apps will be supported until January 2023",
  "article": [
    "If you use OneDrive for Business on Windows 7, you’ll be glad to know the file hosting service will continue to support the defunct OS for another couple of years yet.",
    "Windows 7 reached end-of-life (EOL) over a year ago, in January 2020, which means normal installations aren’t receiving updates anymore.",
    "But, as is the norm, once an OS reaches EOL, Microsoft continues to support it under a paid Extended Security Updates (ESU) program, which allows business users extra time to implement their migration strategies.",
    "While many software vendors officially drop EOL OS’s from their support list, Microsoft has announced plans to support Microsoft 365 apps on Windows 7 until January 2023.",
    "However, a couple of weeks back, multiple readers of The Register informed the publication that they could no longer use OneDrive for Business on their Windows 7 installations, hinting that Microsoft might have quietly pulled the plug on the service.",
    "Much to their delight, though, a Microsoft spokesperson has now confirmed that the use case is still very much supported.",
    "\"Microsoft continues to support OneDrive on Windows 7,” the spokesperson told The Register.",
    "The difficulties experienced by the users were reportedly due to Microsoft’s attempt to kill support for the older Transport Layer Security (TLS) protocol in its products.",
    "If you’re a Windows 7 user and experience issues with the client for OneDrive for Business in your installation, The Register suggests you tweak the registry to force the OS to switch to using a newer TLS protocol.",
    "Via The Register"
  ],
  "headers": {
    "5": "Not quite dead"
  },
  "links": {
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "Windows 7": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-7-622923/review",
    "file hosting service": "https://www.techradar.com/best/file-hosting-and-sharing-services",
    "Windows 7 reached end-of-life (EOL)": "https://www.techradar.com/news/windows-7-end-of-life-what-your-business-needs-to-know",
    "Extended Security Updates": "https://www.techradar.com/news/microsoft-is-killing-off-windows-7-but-microsoft-security-essentials-lives-on",
    "business users": "https://www.techradar.com/news/best-business-desktop-pcs",
    "announced plans": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1443978609438574300&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fdeployoffice%2Fendofsupport%2Fwindows-7-support",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "The Register": "https://www.theregister.com/2021/04/29/onedrive_alive/"
  }
}