{
  "source": "https://www.techradar.com/news/jbl-announces-trio-of-true-wireless-earbuds-that-look-perfect-for-your-next-workout",
  "title": "JBL announces trio of true wireless earbuds that look perfect for your next workout",
  "category": "audio-visual",
  "updated": "2021-09-02T12:40:29Z",
  "author": "hamish-hector",
  "summary": "Fitness fanatics have new tools to help them power through training",
  "article": [
    "JBL has just announced three new true wireless earbuds models, with one pair – the JBL Reflect Flow Pro – that could be a perfect companion in your next workout.",
    "Meanwhile, the JBL Tune 230NC and JBL Tune 130NC firmly occupy the mid-range market with a slew of great features at a more affordable price.",
    "All three wireless earbuds promise active noise cancellation, an impressive battery life with up to 10 hours of continuous playback, and built-in voice assistant controls. The JBL Reflect Flow PRO take this further by boasting IP68 waterproofing – meaning they should survive a quick dip in the pool – and enhanced voice call clarity thanks to their six in-built microphones (three in each bud).",
    "The new JBL Reflect Flow PRO earbuds will be available to buy from November for $179.95 / £169.99 (about AU$240), while the JBL Tune 230NC and JBL Tune 130NC will each set you back just $99.95 / £79.99 (about AU$135) from October 17. While we haven’t yet had the chance to test these earbuds out for ourselves they offer some fairly impressive specs which you can check out below.",
    "Sports buffs could have found their next workout headphones with the JBL Reflect Flow PRO wireless earbuds. Thanks to their 6.8mm drivers they should deliver a decent overall sound and with adaptive noise cancellation, you shouldn’t be bothered by any outside annoyances while you exercise.",
    "As we explained already they also come with an IP68 waterproof rating which means they can survive up to 30 minutes in up to 1.5m of water. If you want to do a quick lap of the pool or two, these earbuds mean the music won’t have to stop (though you'll probably find the Bluetooth cuts out).",
    "The battery life is impressive too, with JBL promising up to 10 hours of use without using the recharging case (or 8 hours of battery life if ANC is turned on). If they do somehow run out charge, these buds will get back one hour of battery life in just 10 minutes.",
    "The only thing we aren’t sure of is the fit of these in-ear buds, a factor that is especially important for headphones designed for working out as we all hate losing our groove to pick up a stray earbud. Until we can test them for ourselves we’d advise seeing what other buyers have to say before taking the plunge if you’re unsure.",
    "For the most part, there’s a lot of similarity between these two models. Both offer active noise cancellation, both promise up to 40 hours of battery life (10 hours of continuous playback plus 30 hours more thanks to the charging case with ANC turned off), and both earbuds are IPX4 water and sweat resistant. Heck, they even cost the same price.",
    "There are some slight differences though for one they each offer slightly different designs. The JBL Tune 230NCs offer more of a stick shape like the Apple AirPods and the JBL Tune 130NC earbuds take on a more bulky bud-like shape.",
    "On top of that, audiophiles with a preference for a bassier experience will probably prefer the 10mm drivers offered by the Tune 130 NCs, while the 5.8mm drivers in the Tune 230NCs should make sure high tones are given a little more clarity."
  ],
  "headers": {
    "4": "JBL Reflect Flow PRO specs and features",
    "8": "JBL Tune 230NC and JBL Tune 130NC specs and features"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "workout headphones": "https://www.techradar.com/best/the-best-workout-headphones-for-every-sport",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review"
  }
}