{
  "source": "https://www.techradar.com/news/is-open-source-the-future-of-office-software",
  "title": "Is open source the future of office software?",
  "category": "computing",
  "updated": "2021-02-28T10:00:04Z",
  "author": "desire-athow",
  "summary": "A Q&A with Italo Vignoli of The Document Foundation, which oversees the popular LibreOffice suite",
  "article": [
    "While many people will be perfectly happy using Office 365 and Google Workspace products for all their word processing and spreadsheet needs, others will prefer something a little less...proprietary.",
    "There are a couple of significant benefits of opting for an open source alternative to Office; the products are almost always free and often benefit from continual improvement from a large network of committed developers.",
    "We caught up with Italo Vignoli of The Document Foundation, which oversees popular open source productivity software suite LibreOffice, to hear more about the project and where it is headed in the future.",
    "The Document Foundation was announced at the same time of the LibreOffice fork, as the home of the LibreOffice community. All activities are focused on the LibreOffice community, but are not limited to the development of the FOSS office suite.",
    "There are other major projects, such as the participation in the ODF (Open Document Format) Technical Committee for the advancement of the only ISO standard file format for true interoperability, the development of import/export filters for legacy and current proprietary file formats at the Document Liberation Project, the participation in advocacy groups for FOSS in public administrations (in Asia, Europe and Central/South America) and the support of native language communities (LibreOffice is released in 119 different language version, more than any other software worldwide).",
    "The sustainability of FOSS projects doesn't happen by magic, especially if software is widely deployed in enterprise environments such as LibreOffice. We launched the LibreOffice project back in 2010, based on the following sustainability concept: individuals would support back-office and development of features that are not targeted to enterprise deployments with donations; volunteers would contribute their time to develop their own features and to contribute to other activities such as localization, quality assurance, documentation, design and marketing. Enterprises, meanwhile, would support the development of mainstream features through the purchase of LTS versions or the direct engagement of developers from ecosystem partners, who are firmly committed in merging all features in a timely manner on the master branch at The Document Foundation (TDF), for the reciprocal benefit of all individual and enterprise users.",
    "As a result, we would have had a \"vanilla\" version released by TDF and supported solely by volunteers (who can provide assistance to individual users, according to their own schedule), and an enterprise version with LTS (Long Term Support) from professionals, backed by SLAs (Service Level Agreements).",
    "This has worked for a while, but over time the number of enterprises supporting the project has shrunk, and as a consequence the number of new features has also shrunk. At the moment, we estimate than less than 10% of LibreOffice enterprise users are supporting the project by \"giving back\" through ecosystem partners, as they deploy the vanilla version from TDF and ask for support to volunteers. As we do want to stay loyal to the FOSS nature of LibreOffice, and avoid a dual licensed open core software (where the enterprise LTS version has more features than the free version, but is released under a proprietary license), we have added the \"community\" label to encourage enterprises to seriously consider deploying the version optimized for their needs.",
    "Of course, a simple label is not enough, so we will develop and engage in communication activities focused on educating enterprises about supporting FOSS projects effectively and responsibly. FOSS has become pervasive, and enterprises should consider that focusing on the zero cost of the software can seriously harm projects they are now relying on as strategic assets of their infrastructure, because it is short-sighted, as you save a lot today by not paying a dime, but you have to spend a lot tomorrow if the project is not able to self sustain, and you have to switch back to a proprietary solution with a huge price tag attached.",
    "The LibreOffice ecosystem is large and diverse; there are volunteers, both individuals and native language communities (i.e. individuals organized in groups based on their language, plus their geographical locations if the language is spread over different continents).",
    "There are companies focused on LibreOffice development and other companies focused on building added value around LibreOffice, e.g. by providing services, consultancy and support. There are FOSS organizations such as FSF, FSFE, GNOME and KDE, and large corporations like Google, who are backing the LibreOffice project as they support our philosophy. Organizations are usually represented inside the TDF Advisory Board, which is meeting on a quarterly basis to discuss the progress of activities.",
    "Most of the engagement, though, happens spontaneously on the typical tools of FOSS projects such as mailing lists and various chatrooms on several messengers. This is something which happens only inside open source projects, where meritocracy wins over bureaucracy.",
    "A cloud solution based on the LibreOffice Technology has been available for several years from Collabora, which are the main code contributors of the Online branch, and is called Collabora Online. The WebAssembly port by allotropia will provide a different approach to getting LibreOffice into the browser. Both are based on the same platform for personal productivity called LibreOffice Technology, which offers unparalleled advantages over the technical puzzle of other office suites, which use a different engine and a different file structure for desktop, mobile and cloud.",
    "The fact that a cloud solution based on LibreOffice is not released by TDF is a detail, and cannot be seen as a lack of interest from the project. Rather the contrary - deploying a cloud office suite is not a trivial task, as you have to associate a secure sign-on solution and a cloud environment for file storage and access rights, and as such needs the resources of a professional service provider. At the moment this product is available from our commercial ecosystem, and this is perfectly in line with the spirit of the project.",
    "LibreOffice has a large feature set, which is comparable to proprietary solutions and is larger than in many other office suites. In addition, LibreOffice has a stronger focus on interoperability than any other office suite, including Microsoft Office. So, in a time where sharing digital content is more important than specific features, the development focus will be on compatibility with proprietary file formats.",
    "In addition to improving the overall quality and interoperability of LibreOffice, the project has priorities which are typical of FOSS projects, such as increasing the number of language versions, and advocating the adoption of the Open Document Format (ODF) and LibreOffice by governments and large organizations."
  ],
  "headers": {
    "3": "What is The Document Foundation? Does it only support the development of LibreOffice or does it have a wider mandate?",
    "5": "Could you explain the reasons that led to suffixing release post v7.1 as \"Community\"?",
    "9": "For people who aren’t aware, could you give us a 20,000 foot view of the LibreOffice ecosystem, including how you engage with the ecosystem partners?",
    "12": "One of the most interesting aspects of the project for many is LibreOffice Online. However, getting the office suite to run inside a web browser isn’t a priority for the project. Why is that, and will the stance change with the WebAssembly port finally approaching production quality?",
    "14": "What are some of the interesting ongoing developments that you’re particularly looking forward to landing in LibreOffice?",
    "15": "More broadly speaking, what are the priorities for the project in the near future?"
  },
  "links": {
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "alternative to Office": "https://www.techradar.com/news/best-microsoft-office-alternative",
    "productivity software": "https://www.techradar.com/best/best-productivity-apps",
    "LibreOffice": "https://www.techradar.com/reviews/libreoffice-7",
    "Document Liberation Project": "https://documentliberation.org/"
  }
}