{
  "source": "https://www.techradar.com/news/latest-wild-mcu-rumor-says-the-mutants-will-be-the-name-of-the-next-x-men-movie",
  "title": "Latest wild MCU rumor says The Mutants could be the name of a new X-Men movie",
  "category": "entertainment",
  "updated": "2021-03-05T17:51:19Z",
  "author": "tom-power",
  "summary": "But we're not convinced",
  "article": [
    "If you thought the finale of WandaVision on Disney Plus would bring an end to speculation about the mutants' arrival in the MCU, think again. The Scarlet Witch's journey may be over for now, but a new rumor about the arrival of the mutants in the Marvel Cinematic Universe has recently been sweeping the internet.",
    "The latest conjecture comes from The Illuminerdi, which claims that Marvel Studios have begun work on an X-Men reboot. The movie is tentatively titled 'The Mutants', per sources that The Illuminerdi say they have spoken to, and the website alleges that Marvel Studios President Kevin Feige has begun development on it.",
    "The Illuminerdi's report does not disclose any further information, such as who might be the first mutants to show up in the MCU, how long we might have to wait for their arrival, and other possible first questions that readers may have.",
    "It's unclear if this latest rumor has any legs, but we certainly have some thoughts on it. Be aware, though, that we venture into spoiler territory for WandaVision, including its season finale. If you aren't caught up yet, now is the time to leave.",
    "The thing is, except a supposedly tentative title, the report doesn't really tell us anything new about the X-Men coming to the MCU.",
    "In an interview with Collider in January, Marvel's Kevin Feige confirmed that conversations about the X-Men's MCU arrival \"has been heavily discussed\", but that \"it remains to be seen\" when that would be. Those comments, alongside ones he made to ScreenRant about the \"long\" and \"ongoing\" internal discussions about the MCU's version of X-Men, means we know a film will happen at some point.",
    "This leads us back to The Illuminerdi's rumor about The Mutants movie. What the rumor doesn't give us is any clues about the movie itself. There's no teases about what heroes or villains will appear, if it'll be tied to Deadpool 3 – which will take place in the MCU – or if any of confirmed future MCU projects will be the catalyst for their arrival. Even the title 'The Mutants' is tentative, according to the report.",
    "Basically, we haven't learned anything we didn't already know. Just a title that the report itself suggests could change.",
    "Not only that, but it may be years before we even hear about an X-Men MCU film officially. Right now, we have three upcoming MCU movies – Black Widow, Shang-Chi, and Eternals – that are slated for a 2021 release. Alongside Spider-Man: No Way Home, Doctor Strange in the Multiverse of Madness and Thor: Love and Thunder, which are all currently filming, there are five other movies in development at Marvel. Guardians of the Galaxy 3 takes us up to 2023, while Fantastic Four doesn't even have a release date yet.",
    "Couple those with the 12 MCU TV series that are either set to launch this year or are in active development, and an X-Men movie – while on the cards at Marvel – is way off in the distance.",
    "As such, we're unlikely to think much more about this rumor until we hear more about Marvel's plans for the X-Men.",
    "As viewers tuned into WandaVision every week, some started to speculate that Wanda would be the cause of the X-Men's arrival in the MCU. This was the result of the Fox version of Quicksilver, portrayed by Evan Peters, surprisingly turning up in episode 5.",
    "However, as it's revealed in episode 9, Fake Pietro - or 'Fietro' as Agatha Harkness calls him - is a Westview resident called Ralph Bohner. In episode 8, Agatha explained that she had used her magic to turn Ralph into Quicksilver, which poured cold water on fans' theories that the Fox version of the character had crossed over into the MCU.",
    "While that Quicksilver reveal ended up being a bait-and-switch, the comic book source material also had fans expecting some form of X-Men's MCU arrival. Wanda's origin story has been tweaked throughout her comic history, with the Scarlet Witch even being categorized as a mutant at one point. This was due to Magneto alleging that he was hers and Pietro's father, but the pair's origins have been altered again since, and they're now the children of former Scarlet Witch Natalya Maximoff.",
    "Finally, there's the issue of Wanda almost wiping out every mutant in Marvel comics. In the 2005 'House of M' storyline, Wanda is the cause of 'M-Day', a worldwide event that results in most of Earth's mutant population losing their X-gene and, as a result, their powers. With her ability to alter reality evident in WandaVision, some viewers had speculated that Wanda could be the reason behind Westview's inhabitants, or anyone else in the world, obtaining the mutant X-gene and developing powers as these Reddit threads suggested.",
    "As it happens, nothing like this occurs in WandaVision episodes 8 or 9. This means that mutants haven't arrived in the MCU just yet, and when they do, they may not be tied to Wanda Maximoff at all."
  ],
  "headers": {
    "4": "Does the X-Men MCU reboot rumor hold much weight?",
    "11": "Did WandaVision tell us anything new about the mutants?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus": "https://www.techradar.com/deals/disney-plus-price",
    "The Illuminerdi": "https://www.theilluminerdi.com/2021/03/04/the-mutants-exclusive/",
    "Collider": "https://collider.com/future-marvel-movies-plans-mutants-kevin-feige-interview/",
    "ScreenRant": "https://screenrant.com/xmen-movies-mcu-reboot-updates-kevin-feige/",
    "take place": "https://www.techradar.com/news/deadpool-3-will-be-part-of-the-marvel-cinematic-universe-and-r-rated",
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Fantastic Four": "https://www.techradar.com/news/marvel-confirms-mcu-fantastic-four-movie-from-spider-man-director",
    "episode 5": "https://www.techradar.com/news/quicksilver-in-wandavision-explained-what-we-know-about-pietro-maximoff",
    "episode 8": "https://www.techradar.com/news/wandavision-episode-8-recap-review",
    "Reddit": "https://www.reddit.com/r/marvelstudios/comments/ix5gkl/wandavision_is_this_how_were_going_to_get_mutants/",
    "threads": "https://www.reddit.com/r/FanTheories/comments/ljx6z0/wandavision_everyone_in_westview_is_a_mutant/"
  }
}