{
  "source": "https://www.techradar.com/news/intel-reveals-higher-than-expected-profits-as-new-ceo-takes-the-helm",
  "title": "Intel reveals higher than expected profits as new CEO takes the helm",
  "category": "computing",
  "updated": "2021-01-22T13:10:50Z",
  "author": "barclay-ballard",
  "summary": "Revenue figures for Q4 were very promising",
  "article": [
    "Chip manufacturer Intel has revealed impressive financial results, including revenue and profit figures far above industry expectations.",
    "Although 2020 would not be considered a stellar business year for Intel in normal circumstances given the huge economic disruption caused by the coronavirus pandemic, the firm can be pleased with its financial results for both Q4 2020 and the year in total. The company revealed that revenue declined by 1% in the fourth quarter to $19.98 billion but this was significantly above predictions of $17.5 billion.",
    "All of the company’s business units experienced declines in the fourth quarter, except for PCs and chips for autonomous vehicles. Impressively, when 2020 was analyzed in full, Intel’s revenue increased 8% year-on-year, reaching $77.9 billion. It was the company’s fifth year in a row posting record revenue figures.",
    "“We significantly exceeded our expectations for the quarter, capping off our fifth consecutive record year,” Bob Swan, Intel’s outgoing CEO, said.",
    "“Demand for the computing performance Intel delivers remains very strong and our focus on growth opportunities is paying off. It has been an honor to lead this wonderful company, and I am proud of what we have achieved as a team. Intel is in a strong strategic and financial position as we make this leadership transition and take Intel to the next level.”",
    "Although the departing Swan can be proud of the company's fourth quarter financial results, new CEO Pat Gelsinger will still have a tough challenge on his hands. In particular, he may need to shift the company’s focus somewhat after Apple decided to no-longer use Intel chips in its Mac computers after a 15-year partnership.",
    "One thing in Gelsinger’s favor is the fact that he has detailed knowledge of Intel, having worked at the company for 30 years before leaving to become president and COO at EMC and later VMware's CEO. Gelsinger may need to tap into that company knowledge if he is to repeat last year’s impressive financial results in 2021."
  ],
  "headers": {
    "3": "Beating expectations"
  },
  "links": {
    "said": "https://www.intc.com/news-events/press-releases/detail/1439/intel-reports-fourth-quarter-and-full-year-2020-financial",
    "new CEO Pat Gelsinge": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo"
  }
}