{
  "source": "https://www.techradar.com/news/google-chrome-update-revives-a-classic-feature-just-when-we-need-it-most",
  "title": "Google Chrome update revives a classic feature, just when we need it most",
  "category": "computing",
  "updated": "2021-10-11T11:20:16Z",
  "author": "joel-khalili",
  "summary": "Chrome for Android now has an in-built RSS feed",
  "article": [
    "Google has pushed out an update for the Android version of web browser Chrome that introduces native RSS functionality.",
    "In the latest Android build, Chrome users can curate a feed of updates from their favorite websites using a new Follow button, housed in the three dot menu in the top right of the screen. Articles published to these websites will then appear in a smart-looking feed every time the user opens a new browser tab.",
    "According to tweets from Adrienne Porter Felt, Director of Engineering for Google Chrome, the feature has already been rolled out to a proportion of users running the latest build (Chrome 94). Others can activate the feature manually via the Chrome flags system (chrome://flags) under “web feed”.",
    "Unfortunately, the feature is not currently available to iOS or desktop users, but Porter Felt says updates for these platforms are in the works.",
    "By creating a new avenue for sharing and discovering web content, the rise of social media platforms like Facebook and Twitter effectively put an end to the heyday of RSS, the open standard on which many aggregation tools are based.",
    "However, as the problems with the algorithm-based approach to content discovery come to light (misinformation, echo chambers etc.), there are plenty of people looking for a way to exercise greater control over the content they are served.",
    "Currently, many of these people make do with free RSS readers, many of which are developed on a shoe-string budget (or no budget at all) and, as such, are often lacking in polish and depth. But now, to make amends for the decision to kill off its own RSS service, Google Reader, Google is making a return to the space with Chrome.",
    "“We’ve heard it loud and clear,” wrote Paul Bakaus, Head of Web Creator Relations, when the feature was first announced. “Discovery and distribution is lacking on the open web, and RSS hasn’t been ‘mainstream consumer’ friendly.”",
    "While RSS is unlikely to reclaim its former status, Google’s decision to bring the technology back in from the cold could signal the start of a new trend. The backlash against social media and the economics that underpins clickbait and misinformation could see RSS (or another technology like it) play a much more influential role in the way people interact with the web in the years to come."
  ],
  "headers": {
    "4": "RSS in Google Chrome"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "tweets": "https://twitter.com/__apf__/status/1446503789586894850?s=20",
    "wrote": "https://twitter.com/pbakaus/status/1395091617732644864"
  }
}