{
  "source": "https://www.techradar.com/news/macos-12",
  "title": "macOS 12 Monterey release date, features and everything you need to know",
  "category": "computing",
  "updated": "2021-10-27T10:53:42Z",
  "author": "daryl-baxter",
  "summary": "macOS 12 Monterey has arrived and we have the lowdown.",
  "article": [
    "macOS 12 Monterey is now available to download, and brings a whole host of features to Macs and MacBooks, especially to the new models running M1 Pro and M1 Max that were announced at Apple’s October 2021 event.",
    "It’s a release that brings features that you can already use in iOS, such as Shortcuts and the redesigned Safari. However other features such as Universal Control and SharePlay, announced at WWDC, are coming later this year, which will disappoint some people who were hoping to try out those features.",
    "We reviewed Monterey and found it to be a small but substantial update for the Apple Silicon era. It looks as thought it's laying the foundation for other Macs that will be running on M1 chips soon.",
    "With the new MacBook Pro 16-inch (2021) and MacBook Pro 14-inch (2021) coming with Monterey pre-installed once they launch (again, on October 25), the newest macOS update looks to be a significant release.",
    "If you're unsure of what macOS 12 Monterey has, here’s everything we know of the latest Mac update.",
    "The list of Macs that will be able to run macOS 12 Monterey has been announced, with Apple promising that \"macOS Monterey will support the broadest lineup of Macs in history, including the latest iMac, MacBook Air, 13-inch MacBook Pro, and Mac mini, as well as Apple’s Intel-based Macs\".",
    "Here are the devices that can run macOS 12 Monterey:",
    "Apple announced macOS 12's new name as Monterey, picked due to it being part of Big Sur by the Californian coast.",
    "At Apple's recent 'Unleashed' event, the company announced that macOS 12 Monterey would launch on Monday October 25, which it did.",
    "As usual, this is a free update for everyone with a compatible system. If you're not sure if your Mac or MacBook is compatible, check out the system requirements above.",
    "The macOS 12 Monterey update is available for download through your Mac's System Preferences menu, or you can download it through the Mac App Store application.",
    "If you're not sure how to update your Mac, we have a guide in how to download macOS 12 Monterey.",
    "According to Apple, \"macOS Monterey comes with new ways for users to connect, get more done, and work more fluidly across their Apple devices\".",
    "This is an update that appeals to people who have multiple Apple devices, such as the iPad and iPhone.",
    "There some features however that will only be available on M1, M1 Pro and M1 Max Macs, which looks as though Apple are already moving to Apple Silicon and leaving Intel Macs further behind.",
    "This handy feature means you can use a single mouse and keyboard and switch between Mac and iPad. Use a trackpad on your MacBook and slide over seamlessly to your iPad.",
    "You can also drag and drop files between iPads, MacBooks, iMacs and more. There's no setup required, you'll be able to just put your devices next to each other, and move your cursor between them. This could prove to be one of the most useful new features in macOS 12 Monterey.",
    "Apple has confirmed that the feature, and SharePlay will be coming in a future update to Monterey. But if you have an iOS device, you can use SharePlay now, which has returned in the release of iOS 15.1.",
    "This past year has made the way we work and communicate change in drastic ways, and video calls are now more important than ever. So, it's good to see Apple bringing new features to FaceTime calling in macOS 12 Monterey.",
    "This includes spatial audio support (a big theme of Apple's WWDC 2021 keynote), so depending on where the person is sitting, their audio should feel like it's coming from their position.",
    "There's also Voice Isolation, which uses machine learning to eliminate background noise and make voices clearer and easier to understand.",
    "There's also Wide Spectrum, which does the opposite, and means all ambient sounds (as well as voices) are boosted, which can be useful in some circumstances where you need to hear the environmental sounds where people are.",
    "MacBooks and Macs using Apple's M1, M1 Pro and M1 Max chip will also be able to blur user backgrounds thanks to the Neural Engine, though this is something that has been part of other video calling applications for a while now, and doesn't require specialist hardware.",
    "More useful is the ability invite anyone to connect to a FaceTime call, even people using Windows and Android devices, and they are will still benefit from the end-to-end encryption.",
    "You can now use AirPlay on a Mac, and use your Mac or MacBook as a speaker or video output.",
    "Shortcuts have arrived to the Mac. These allow you to automate everyday tasks. You can set your own, or use ready-made ones.",
    "These can be triggered via Siri without using your hands, and you can import Automator workflows with Shortcuts.",
    "Shortcuts are integrated throughout macOS 12 Monterey, including the menu bar, Finder and Spotlight.",
    "Safari, Apple's web browser for macOS, has been redesigned for macOS 12 Monterey. Tabs are now more compact, the toolbar is refined and you can use tab groups.",
    "This saves and groups tabs together for easy access. Useful for people who end up browsing with loads of tabs open at once.",
    "You can name the groups, and they can be accessible across all devices. Make a change on a Mac, and the groups on iPad and iPhone will also change.",
    "You can use a search box to find certain websites, and the Tabs bar changes color depending what website you're on.",
    "The Notes app has been improved, making it easier to organize and collaborate notes. The Quick Note feature lets you write down notes from any app or website, and you can add links from Safari or Maps.",
    "Multiple people can work on notes, and they can add their own comments. People's edits can be easily found in the new Activity View, and tags can be added so you can easily find them later on.",
    "The new Focus feature is a powerful 'do not disturb' setting for Macs and MacBooks on macOS 12 Monterey. Depending on your current activity, notifications can be filtered out.",
    "You can set your status so other people know you're not to be interrupted, and if you set up Focus on one device, it will be mirrored on all your other Apple devices.",
    "Think of this release as more the Snow Leopard of macOS releases. Back in 2009, Apple made efforts to push the fact that it was a refined release, and no new features."
  ],
  "headers": {
    "5": "macOS 12 Monterey system requirements",
    "7": "macOS 12 name: Monterey",
    "8": "macOS 12 Monterey release date",
    "10": "When will macOS 12 Monterey be available to download?",
    "12": "macOS 12 features",
    "15": "Universal Control",
    "18": "FaceTime",
    "24": "Airplay",
    "25": "Shortcuts",
    "28": "Safari 15",
    "32": "Notes",
    "34": "Focus"
  },
  "links": {
    "MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "M1 Pro and M1 Max": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "October 2021 event": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "reviewed Monterey": "https://www.techradar.com/reviews/macos-12-monterey-review",
    "MacBook Pro 16-inch (2021)": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "MacBook Pro 14-inch (2021)": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "how to download macOS 12 Monterey": "https://www.techradar.com/news/macos-12-monterey-public-beta-is-now-available-but-its-missing-its-most-exciting-feature",
    "only be available": "https://www.techradar.com/news/apples-new-macos-monterey-brings-features-to-m1-macs-only",
    "iOS 15.1": "https://www.techradar.com/news/ios-151-news",
    "Quick Note feature": "https://www.techradar.com/how-to/how-to-use-quick-note-and-notes-in-macos-12-monterey",
    "Focus feature": "https://www.techradar.com/how-to/how-apples-new-focus-feature-works-on-macos-monterey",
    "refined release": "http://web.archive.org/web/20090826074600/http://www.apple.com/macosx/refinements/"
  }
}