{
  "source": "https://www.techradar.com/news/netflix-is-getting-an-addams-family-spin-off-from-tim-burton",
  "title": "Netflix is getting an Addams Family spin-off from Tim Burton",
  "category": "entertainment",
  "updated": "2021-02-18T10:43:34Z",
  "author": "rhys-wood",
  "summary": "It’s only Wednesday",
  "article": [
    "Netflix could have something for Addams Family aficionados in the form of Wednesday, a brand new spin-off series coming to the streaming platform that will focus on the teenage daughter of the creepy, kooky family.",
    "Netflix has hired Tim Burton as director and executive producer and will be joined by showrunners Al Gough and Miles Millar, perhaps best known for shows like Smallville and Into the Badlands.",
    "No casting has been announced for Wednesday as of yet, and it’s likely we won’t see the show until well into 2022. What we do know about is that Wednesday seems to be a darker take on the typical wacky Addams Family fare, which is becoming something of a trend with Netflix-backed series.",
    "Wednesday is being billed as a mystery-focused series with numerous main and subplots sprinkled throughout.",
    "As a student of Nevermore Academy, Wednesday will have to juggle a strange new social life with real, life-threatening mysteries, such as a murderous spree plaguing the town. All the while, Wednesday herself will be coming to terms with her evolving psychic abilities.",
    "It all sounds very Netflix, doesn’t it? We’ve seen a number of series from the platform in recent years that offers a darker spin on beloved, lighthearted franchises. Riverdale, The Chilling Adventures of Sabrina and Fate: The Winx Saga all come to mind here.",
    "It remains to be seen who will be cast in the iconic Addams Family roles, and indeed if we’ll get appearances from stalwart characters like Gomez, Morticia and Uncle Fester.",
    "Still, the darker tone of Wednesday should be a nice fit for Netflix’s back catalog, and could offer an interesting spin on the usually comedic antics of The Addams Family.",
    "With Burton in the director’s chair – perhaps most famous for Edward Scissorhands, Batman and Corpse Bride – Netflix subscribers could be treated to something darkly unique when the show eventually lands on the service."
  ],
  "headers": {
    "3": "Mysterious and spooky"
  },
  "links": {
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Riverdale": "https://www.techradar.com/news/how-to-watch-riverdale-season-5-online-stream-every-new-episode-from-anywhere",
    "The Chilling Adventures of Sabrina": "https://www.techradar.com/best/best-netflix-teen-movies-and-teen-shows"
  }
}