{
  "source": "https://www.techradar.com/news/horizon-forbidden-west-release-date-could-be-coming-very-soon",
  "title": "Horizon Forbidden West release date could be coming “very soon”",
  "category": "gaming",
  "updated": "2021-05-28T09:54:51Z",
  "author": "rhys-wood",
  "summary": "The Forbidden West is on the Horizon",
  "article": [
    "Horizon Forbidden West gameplay was finally shown off to the public via PlayStation’s May 2021 State of Play event. The showcase for the upcoming PS5 title was incredibly robust, showing off gorgeous new locales, vicious machines and new ways for Aloy to best them. The one big omission from the demonstration, however, was the game’s release date.",
    "While this may have left some fans scratching their heads, Guerilla thankfully didn’t leave them in the dark for very long, taking to Twitter after the State of Play presentation to update fans on the Horizon Forbidden West release date.",
    "In the tweet, Guerilla reassured fans that while it doesn’t have a concrete release date for Horizon Forbidden West just yet, development is “on track” and an update will be shared “very soon.” Perhaps not the answer fans were after, but it’s better than nothing.",
    "Horizon Forbidden West sees Aloy travelling to western portion of a post-apocalyptic United States, including San Francisco. The State of Play showcased impressive and vast tropical environments, differentiating it from the wooded and frosty regions of 2017’s Horizon Zero Dawn.",
    "While we know a fair bit now about what kind of locations we’ll explore and the mechanical predators we’ll be contending with, it’s easy to feel disappointed that no release date has been announced after Horizon Forbidden West’s impressive gameplay showcase, we might not have to wait that long before we know when the game is coming out.",
    "Sony and Guerilla have a number of upcoming ways they could announce Horizon Forbidden West’s release date. Summer Game Fest is kicking off in June, and while Sony is skipping E3 2021, the company has been fairly consistent with its State of Play announcement broadcasts. As such, it’s possible that we’ll know Horizon Forbidden West’s release date before the year is out."
  ],
  "headers": {
    "3": "Release on the Horizon?"
  },
  "links": {
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "May 2021 State of Play": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Summer Game Fest": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "E3 2021": "https://www.techradar.com/news/e3-2021"
  }
}