{
  "source": "https://www.techradar.com/news/how-analytics-can-help-to-catch-and-convict-criminals",
  "title": "How analytics can help to catch and convict criminals",
  "category": "computing",
  "updated": "2021-04-06T11:03:13Z",
  "author": "andy-davies",
  "summary": "How can analytics help to catch and convict criminals?",
  "article": [
    "Organized crime has been on the rise during the pandemic. In 2020, the number of impersonation scams alone doubled, reaching 39,360 cases, with a total of £150.3 million taken from bank accounts as a result. These were criminals feigning to be HMRC officials, NHS staff and Royal Mail representatives.",
    "COVID-19 has certainly been a contributing factor to this uptick in crime. It has put high financial pressure on people and disrupted the services which are often used to identify and convict criminals. Not only that but government support packages hurriedly put together are always going to be a target. Combined, this has created a hotbed for criminal activity and one which the public sector has struggled to quell.",
    "As is the case with every crime, the key to catching and convicting criminals is evidence. However, whether it’s fraud, money laundering or human trafficking, the evidence needs to be analyzed thoroughly to put together a coherent case. Naturally, this has to be a meticulous process and, as a result, it can be slow. As crime levels increase, however, slow is something we can’t allow, to protect people and the economy. Technology such as AI and analytics can be used to speed up the process, support police officers and unburden the justice system.",
    "Identifying organized crime, such as fraud, theft and human trafficking has always been a challenge. Much of this criminal activity takes place online and increasingly via the dark web, which can be tough to access and where the information being shared is often coded or difficult to trace back to a particular user. To uncover criminal activity on these channels demands the analysis of huge amounts of complex and varied data.",
    "The pandemic has only complexified this challenge further. Financial stress and the introduction of new relief systems has led to a rise in fraud, while crimes which may have ordinarily taken place in the broad daylight are now being orchestrated online. This means that there is even more data that needs to be analyzed to uncover patterns of criminal activity and to formulate evidence. Not only that but it may be based on new types of behavior that existing models are not set up to capture.",
    "Failure to analyze this data quickly and effectively increases the risk of criminal activity slipping through the net. The repercussions of this could be immense on both people’s lives and the economy. From an economic perspective, the British economy witnessed its greatest annual decline in 300 years in 2020. Therefore, it is of paramount importance that cases of fraud do not go undetected as criminal activity continues to rise.",
    "However, the challenge does not stop with identifying criminal activity. The pandemic has also made it more difficult to convict criminals as well. Recent figures have found that the backlog of cases in the crown courts has reached 54,000, which means that some crimes back in 2020 will not go before a jury until 2022. For the public sector, this is a logistical nightmare. However, it is one which can be eased and improved in both the short and long-term through the implementation of technology and analytics.",
    "In simple terms, the policing and justice systems face two problems as a result of the pandemic: a rise in the numbers of crimes being committed and overstretched courts. The deployment of technology such as advanced analytics, AI and machine learning can help to solve both of these problems.",
    "The technology can be implemented at the investigation and monitoring stage to quickly analyze otherwise complex data. Using previously solved cases and data, AI algorithms can be trained to quickly sift through datasets and identify patterns of criminal activity which can then be flagged for further investigation and review. This will help to expedite the process and ensure time is not wasted looking into cases where no criminal activity is present, while minimizing the chances of actual criminals slipping through the cracks. This will help the police to better manage the rising number of crimes being committed during the pandemic.",
    "Meanwhile, the use of technology in the investigation phase will also help the police to create a coherent and convincing case once the crime goes to trial. With the justice system inundated with outstanding cases, it is important that evidence can be presented clearly and concisely. Analytics can support the Crown Prosecution Service to wade through the increasing quantities of digital data that are now so often associated with criminal activity. This will enable it to quickly identify the data that is important to a case, helping speed up the process and keep court cases short and efficient once courts can reopen at full capacity. With over 54,000 backlogged cases to go through, this will be crucial to avoid severe delays in the justice system.",
    "For technology such as AI, advanced analytics, text analytics and machine learning to be fully effective, though, data needs to be accessible from a connected platform, such as the cloud. With this, the algorithms can be fed and trained with all of the information, both historical and present, at their disposal. Cloud-based analytics can then be used to identify current and historical criminal activity patterns, while also predicting how the patterns might evolve, allowing the police to stay one step ahead. AI has also been used to predict the outcome of certain court cases. While the technology is not at the stage of replacing judges entirely, it can be used to help them in their decision-making by reducing research time and providing them with valuable insights.",
    "A rise in crime can happen at any moment, meaning it’s not something which can be classified as ‘unprecedented’. However, courts being closed, or open but in a restricted capacity, is not something the justice system could have foreseen before the pandemic. Both are challenges which need to be addressed and done so urgently. When there are opportunities to improve the policing and justice systems and make them more efficient, they must be taken. The implementation of cloud-powered AI and analytics represents that very opportunity and can support the UK as it recovers from the effects of the pandemic"
  ],
  "headers": {
    "3": "A complex challenge with high stakes",
    "7": "Tipping the scales of justice"
  },
  "links": {
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}