{
  "source": "https://www.techradar.com/news/legend-of-zelda-remake-developer-is-hiring-for-a-mysterious-new-project",
  "title": "Legend of Zelda remake developer is hiring for a mysterious new project",
  "category": "gaming",
  "updated": "2021-02-17T17:16:04Z",
  "author": "rhys-wood",
  "summary": "Is it real, or is it not?",
  "article": [
    "Grezzo, the developer behind The Legend of Zelda: Link's Awakening on Nintendo Switch, is currently hiring a programmer and two designers for a new game project, which the company describes as being both “medieval” and “stylish.”",
    "The developer is well known by Nintendo fans for its work on The Legend of Zelda series, having also developed the enhanced Nintendo 3DS ports of Ocarina of Time and Majora’s Mask.",
    "Grezzo shared a snippet of information regarding the game’s visual style, claiming it will have a stylish take on reality while mostly avoiding photorealism. The game’s name and platforms of release aren’t announced yet, but the Switch seems like a safe bet given the company’s history working with Nintendo.",
    "The hirings, initially spotted by Nintendo Everything, detail openings for a programmer, an effects designer and a UI designer. According to the job descriptions, the design brief of the game is not photorealistic, but rather putting a unique spin on \"real elements\".",
    "It’s not overly clear what the final product will look like with a design goal like this, but it doesn’t sound dissimilar to what Grezzo managed to achieve with the remake of Link’s Awakening.",
    "That game featured a polished, shiny visual aesthetic that gave everything the look of an interactive diorama. Even the characters in the game somewhat resemble cute collectable dolls and figures.",
    "It also brings to mind Fantasian, Mistwalker’s upcoming RPG, which has its environments scanned in from real 3D sculptures. If that’s anything to go by, then it sounds like Grezzo might be developing a real looker of a game.",
    "While Grezzo made a name for itself working on The Legend of Zelda series, its back catalog extends beyond Nintendo’s revered franchise. It developed RPG and town management sim Ever Oasis in 2017, and also worked on the 3DS version of Luigi’s Mansion.",
    "This new project sounds like it’s in safe hands, then, and we have a vague, but intriguing visual premise to look forward to learning more about in future."
  ],
  "headers": {
    "3": "Switching it up"
  },
  "links": {
    "he Legend of Zelda: Link's Awakening": "https://www.techradar.com/reviews/the-legend-of-zelda-links-awakening-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo 3DS": "https://www.techradar.com/news/5-reasons-you-should-buy-a-nintendo-3ds-over-the-nintendo-switch",
    "hirings": "https://www.grezzo.co.jp/jp/careers/kinkyu2021/",
    "Nintendo Everything": "https://nintendoeverything.com/grezzo-the-studio-behind-recent-zelda-titles-and-ever-oasis-hiring-for-new-medieval-and-stylish-project/",
    "Fantasian": "https://www.techradar.com/news/final-fantasy-creators-fantasian-is-made-with-real-models-and-its-gorgeous"
  }
}