{
  "source": "https://www.techradar.com/news/first-oled-ipad-might-not-arrive-until-2023",
  "title": "First OLED iPad might not arrive until 2023",
  "category": "tablets",
  "updated": "2021-07-08T08:43:57Z",
  "author": "james-rogerson",
  "summary": "The iPad Air looks to be first in line",
  "article": [
    "Every phone in the iPhone 12 range has an OLED screen, as do most premium phones from other brands, but currently no iPad does, with most models stuck with inferior LCD tech, and the iPad Pro 12.9 (2021) getting Mini LED. It does seem like OLED is on the way though – but maybe not until 2023.",
    "That year has been put forward in the latest forecast from Display Supply Chain Consultants (DSCC), which also says that the first OLED iPad will have a 10.9-inch screen. That means it will probably be a new iPad Air, since the current model of that (the iPad Air 4) has a screen of that size.",
    "That said, we’d take this 2023 claim with a pinch of salt, as recently we heard from another source that the first OLED iPad would land in 2022, so it’s not clear which information is right. The sources seem to agree however on the size of the screen, so there’s a good chance at least that the first OLED iPad will be an iPad Air, whenever it lands.",
    "OLED panels can allow for deeper blacks and better contrast than the LCD screen tech Apple is currently using, so it would make for a definite upgrade.",
    "It’s an upgrade on those fronts from Mini LED too, but that can get brighter, and doesn’t suffer from burn-in, which is a risk with OLED. So Apple may have decided Mini LED is a better fit for its productivity-focused iPad Pros.",
    "That said, previous reports suggest that OLED will make its way to the iPad Pro range ultimately too, just probably not until after the iPad Air. So the days of LCD and even Mini LED iPads are probably numbered.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "A significant upgrade"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad Pro 12.9 (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Display Supply Chain Consultants": "https://www.displaysupplychain.com/blog/oled-panel-revenues-forecasted-to-exceed-60b-in-2025-helped-by-increased-it-market-penetration",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "would land in 2022": "https://www.techradar.com/news/apples-2022-ipad-could-bring-a-major-screen-improvement",
    "Phone Arena": "https://www.phonearena.com/news/first-oled-ipad-coming-in-2022-or-2023_id133430"
  }
}