{
  "source": "https://www.techradar.com/news/microsoft-teams-is-about-to-become-a-whole-lot-more-customizable",
  "title": "Microsoft Teams is about to become a whole lot more customizable",
  "category": "computing",
  "updated": "2021-02-02T16:15:06Z",
  "author": "barclay-ballard",
  "summary": "The pre-meeting experience is about to get more interesting",
  "article": [
    "Users of Microsoft Teams will soon be able to add some personal touches to their meeting experiences following the announcement of branded lobbies. The new feature will allow Teams users to customize the pre-meeting experience.",
    "“Admins will now be able to add a custom logo to the Teams experience, for display in the lobby and meeting pre-join experience,” the Microsoft 365 roadmap explains. “The logo will be displayed for meetings where the organizer has the Advanced Comms SKU.”",
    "A few weeks ago, Microsoft announced a new Advanced Communications package fr Teams, which includes advanced meeting customization features to give businesses greater control over their communication policies. In addition to a custom branded meeting lobby, tools for monitoring, tracking, and analyzing data on users and devices were also included.",
    "Users of Microsoft Teams have been asking for the opportunity to add some personal flavor to the Teams experience since at least 2019. As well as being useful for company branding, teachers could include learning objectives for students to read over before a class begins, and small businesses could post useful information like opening times or price lists.",
    "Microsoft has confirmed that the meeting lobby customization comes with the flexibility to use different branding across an organization’s various departments. This is particularly useful for larger businesses that may not want to present a uniform image.",
    "Microsoft’s Advanced Communications feature is available as an add-on to any paid Microsoft 365 or Office 365 subscription. The branded lobby feature is currently in development, with rollout confirmed for March."
  ],
  "headers": {
    "3": "On brand"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "explains": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-3536882398153636400&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D79957",
    "Advanced Communications": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1449863687489228000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fmicrosoftteams%2Fteams-add-on-licensing%2Fadvanced-communications",
    "2019": "https://microsoftteams.uservoice.com/forums/555103-public/suggestions/37180108-display-company-brand-in-teams-meeting-lobby"
  }
}