{
  "source": "https://www.techradar.com/news/amazfit-t-rex-pro-leaks-show-a-tough-powerful-smartwatch-coming-soon",
  "title": "Amazfit T-Rex Pro is shaping up to be one of the toughest smartwatches yet",
  "category": "fitness",
  "updated": "2021-03-11T16:34:45Z",
  "author": "cat-ellis",
  "summary": "Tyrannosaurus specs",
  "article": [
    "Leaked photos and specifications have given us an early glimpse of the Amazfit T-Rex Pro 2 – a tough new sports smartwatch we're expecting to arrive any day now, and might just make its way into our roundup of the best fitness trackers.",
    "The new info comes via 91Mobiles, which has a good track record when it comes to accurate leaks. Renders show a design that's almost identical to the original T-Rex, right down to the four triangular screws set into the bezel and textured buttons around the edges of the case.",
    "The only visible difference is the choice of colorways, which now include pale gray, dark teal, and black. The real changes are all below the surface – and they sound very promising.",
    "One of the most impressive upgrades is battery life. The first-gen T-Rex can keep going for 20 hours with GPS and heart rate tracking enabled, but according to the leaked data, the new watch will last twice as long. That's a real bonus for outdoor adventures when you're likely to be away from a power outlet for days at a time.",
    "This improvement appears to be due to Zepp's new optical heart rate monitor, the BioTracker 2 PPG, which was found to reduce overall power draw by up to 50% in in the company's performance tests.",
    "The new sensor can also detect signs of atrial fibrillation (an irregular heart rhythm) and measure blood oxygen saturation (SpO2) bringing the T-Rex Pro into line with devices from Apple, Samsung and Fitbit.",
    "Many watches and fitness trackers can detect when you start a workout and begin monitoring it automatically, but the BioTracker 2 PPG can also identify the type of exercise you're doing. We don't yet know how that feature will be implemented, but in theory it can identify 19 different exercise modes, including walking, running, cycling and swimming, which should cover most situations.",
    "On the subject of swimming, the T-Rex Pro will also be more waterproof than the original watch, certified for depths of up to 100m rather than 50m, matching the Garmin Fenix 6. Good news for scuba divers.",
    "The T-Rex Pro first appeared on our radar in January, when a Federal Communications Commission (FCC) certification for the device was published. The paperwork shows that the watch was originally going to be called the T-Rex 2, but was renamed back in December 2020. This might be because, although it's a big step up from its predecessor, the new watch isn't enough of a step up to be a full sequel.",
    "When it arrives, the T-Rex Pro could be a viable alternatives to rugged watches like the Garmin Instinct and Polar Grit X. We'll be bringing you a full review once it launches, so you can see how it measures up and choose the best watch for your outdoor adventures.",
    "Via Wareable"
  ],
  "headers": {
    "8": "Wrist assessment"
  },
  "links": {
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "best fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "91Mobiles": "https://www.91mobiles.com/hub/exclusive-amazfit-t-rex-pro-specs-design-leaked-launch-seems-imminent/",
    "in the company's performance tests": "https://www.eplabdigest.com/huamis-next-wearable-ai-chip-huangshan-2-scheduled-mass-production-q4-2020-50-energy-saved-faster-atrial-fibrillation-detection",
    "Garmin Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "first appeared on our radar": "https://www.techradar.com/news/amazfit-could-be-about-to-launch-a-new-sports-smartwatch-the-t-rex-pro",
    "Federal Communications Commission (FCC) certification": "https://fccid.io/2AC8UA2013",
    "Garmin Instinct": "https://www.techradar.com/reviews/garmin-instinct-solar",
    "Polar Grit X": "https://www.techradar.com/reviews/polar-grit-x",
    "Wareable": "https://www.wareable.com/smartwatches/amazfit-t-rex-pro-pictures-and-specs-leak-8328"
  }
}