{
  "source": "https://www.techradar.com/news/halo-infinites-physical-disc-doesnt-contain-the-full-game-whats-going-on",
  "title": "Halo Infinite's physical disc doesn't contain the full game - does Xbox really care about game preservation?",
  "category": "gaming",
  "updated": "2021-12-08T14:31:20Z",
  "author": "jamel-smith",
  "summary": "Is game preservation a priority?",
  "article": [
    "The disc version of Halo Infinite doesn’t actually contain the full playable game, instead, it requires online DRM to install the game - this means you’ll need an internet connection to download the full game with its patches, meaning the game cannot be installed offline.",
    "John Linneman from Digital Foundry has complained via Twitter that Halo Infinite's “disc doesn’t contain a playable game, this'll be the first Halo game you can't really own as a standalone copy.”",
    "Linneman goes on to write in another tweet, “the disc doesn't seem to allow you to play the game without connecting and downloading data. If you install it offline, it's just a partial game install and it does not run (at least on Series X/S).” This ultimately means if you don’t have an internet connection you won't be able to install and play the game offline - even the single-player campaign.",
    "We don’t know why Microsoft has done this with Halo Infinite. It isn’t due to its file size, considering the physical version of Microsoft Flight Simulator came with multiple discs to ensure the full game is able to install offline.",
    "It’s more likely because of Xbox’s Smart Delivery, as there isn’t a separate disc for Xbox One and Xbox Series X/S versions of Halo Infinite - these game discs tend to only contain the Xbox One versions of games, then the disc will need an internet connection to download and access the enhanced Xbox Series X/S version of games. This is different from PlayStation, where games come in two separate versions for the PS4 and PS5 and also come with a full version of games on the disc, which can be played from start to finish without going online to download patches.",
    "We have asked Microsoft for comment on Xbox's online DRM issue.",
    "While Microsoft has currently been leading the game industry on game preservation with its push to preserve older games - Xbox CEO Phil Spencer has recently called for industry-wide game preservation per a report from Axios - the Xbox Series X/S does have major issues with online DRM. Halo Infinite is not the only Xbox game that requires online DRM, many others do too.",
    "Youtuber Modern Vintage Gamer tested physical smart delivery versions of games like Tomb Raider and Hitman 3, and both refused to work offline and required an internet connection. He also tested native Xbox Series X/S physical games like Devil May Cry 5 and those versions seem to be able to be played and installed offline.",
    "This is a shame for game preservation, as it essentially means if Microsoft does decide to take its servers offline you won’t be able to play or install physical smart delivery versions of your Xbox Series X/S games.",
    "Microsoft has recommended keeping your Xbox Series X/S as your ‘Home Console’ in the settings, but this solution has been described as a ‘band-aid’ and doesn’t seem to make your games install and work offline.",
    "There isn’t only a problem with online DRM with Xbox Series X/S discs, but also the console itself. According to Twitter account Doesitplay1 - whose account is focused on online DRM in gaming - the Xbox Series X/S requires an online activation to a server to set up the console - so if you don’t have access to the internet, or if Microsoft decides to shut down servers, you won’t be able to set up a new Xbox Series X/S console.",
    "If it really cares about game preservation, Microsoft would make moves to end online DRM on its consoles. Hopefully, Halo Infinite will receive a complete edition down the line that will have the full game on the disc, as this is one best Halo games made in years - we gave Halo Infinite a rare five-star rating in our review."
  ],
  "headers": {
    "6": "Analysis: Is Xbox serious about game preservation?"
  },
  "links": {
    "tweet": "https://twitter.com/dark1x/status/1467956670873669651?s=20",
    "Microsoft Flight Simulator": "https://www.techradar.com/reviews/microsoft-flight-simulator",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Series X/S": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Axios": "https://www.axios.com/microsoft-old-games-preserve-emulation-748793a7-f559-4933-babf-81f34adc7cf6.html",
    "review": "https://www.techradar.com/reviews/halo-infinite"
  }
}