{
  "source": "https://www.techradar.com/news/chinas-tech-giants-face-closer-scrutiny-of-consumer-credit-data",
  "title": "China’s tech giants face closer scrutiny of consumer credit data",
  "category": "computing",
  "updated": "2021-01-11T18:26:48Z",
  "author": "rob-clymo",
  "summary": "Shake up could see a clampdown on lending practices",
  "article": [
    "China plans to try and curb excessive borrowing and clamp down on fraud by making large tech companies share their consumer loan data. According to a report by Reuters, the move is being seen as a reversal of the Chinese government’s previously lax approach to dealing with the industry.",
    "Major tech companies that run large internet e-commerceplatforms have traditionally kept the data under wraps, allowing them to operate unhindered while luring in new customers. Now though the Chinese regulators that include the central bank are attempting to get tech company loan data channeled through the country’s credit agencies.",
    "If successful the move will allow the People’s Bank of China (PBOC) to monitor lending risks more closely using the agencies, which are run by the central bank. Beijing is growing increasingly keen to monitor technology firms, especially those involved in the financial sector.",
    "The change in attitude is seen as an effective way to curb empire building by tech giants, with the clampdown already producing the collapse of fintech company Ant's IPO last November. Regulators followed that by launching an antitrust probe into Ant’s former parent company Alibaba, which resulted in changes to lending rules.",
    "Ant currently has access to the data of over 1 billion people along with 80 million merchants, as well as running Sesame Credit, which is one of the country’s largest private credit-rating platforms. The business takes so-called technology service fees of the interest on loans, which are arranged from information it gives to around 100 banks.",
    "China plans a similar clampdown on other tech giants including Tencent and JD.com, which run relatively small consumer-credit operations compared to the Ant operation. Nevertheless, Tencent’s WeBank runs Weilidai, a micro-loans unit that has produced loans worth more than 3.7 trillion yuan up to the end of 2019.",
    "Meanwhile, JD.com has a fintech arm called JD Digits that has a combined 70 million annual active users who use its two platforms Baitiao and Jintiao. As a result, technology service fees amounted to 4.4 billion yuan for the first half of 2020 alone, highlighting the substantial lending power of this area of China’s fintech industry."
  ],
  "headers": {
    "4": "Service fees"
  },
  "links": {
    "e-commerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "financial sector": "https://www.techradar.com/news/security-in-the-financial-industry"
  }
}