{
  "source": "https://www.techradar.com/news/bmw-i4-and-bmw-ix-first-look",
  "title": "The electric BMW i4 and iX offer superb craftsmanship, but Tesla's still the EV king",
  "category": "car-tech",
  "updated": "2021-09-04T10:00:51Z",
  "author": "myriam-joire",
  "summary": "We check out the all-electric BMW iX and i4",
  "article": [
    "Despite joining the battery EV ranks early with the quirky i3 back in 2013, BMW's made slow progress with electrification since.",
    "But the company's finally getting more serious with the BMW i4 sedan and iX crossover - coming summer 2022.",
    "We had the opportunity to see - but not drive - the i4 and iX in San Francisco recently, so here's a look at the tech and features these electric cars have to offer, along with our first impressions.",
    "The BMW i4 is the fully electric version of the new 4-series Gran Coupe sedan. It's being built on the same assembly line, alongside its ICE (internal combustion engine) twin.",
    "As such, it wasn't built from the ground up as a BEV (battery electric vehicle), but designed together with the rest of the 4-series range. This results in some compromises. For example, there's no frunk and the cabin floor isn't flat, so there's no extra space for people or things.",
    "Still, the i4 is just as spacious and comfortable as the 4-series Gran Coupe - complete with that convenient hatch trunk - so it isn't lacking in this regard.",
    "It's available in two trim levels with different powertrains and range options. The BMW i4 eDrive40 (single motor, RWD, 335hp) costs $55,400 / £51,905 / AU$107,750 before incentives, does 0-60mph in 5.5s (0-100km/h in 5.7s), and has a range 300 mile EPA (347mi / 558km WLTP).",
    "Meanwhile, the BMW i4 M50 (dual motor, AWD, 536hp) is priced at $65,900 / £63,905 / AU$133,800 before incentives, accelerates from 0 to 60mph in 3.7 seconds (0-100km/h in 3.9s), and offers a range of 245 miles EPA (258mi / 415km WLTP).",
    "These prices and specs aren't 100% finalized yet, so keep that in mind. An M Sport package is offered for the i4 eDrive40 in some markets (optional in the UK, standard in Australia).",
    "Both models share the same 81.5kWh battery, support up to 200kW DC fast charging (CCS Combo 1 in the US and Combo 2 abroad) resulting in an 80% charge in about 40 minutes, and handle up to 11kW AC charging for a full charge in 9 hours.",
    "In the US, BMW's partnered with EVgo for a seamless experience at charging stations through the my BMW app. You even get a $100 EVgo credit for free.",
    "Like the rest of the 4-series, the i4's most controversial design element is the massive kidney grille in the front. We aren't big fans, but strangely the new grille isn't nearly as odd in person as it is in pictures.",
    "The i4 eDrive40 we spent time with also featured multiple i3-like blue accents - novel in 2013, but perhaps a touch out of place in 2021. While the i4 retains BMW's classic proportions, the exterior is best described as fussy and overdone.",
    "Regardless, the interior design is lovely. The cabin is well appointed, modern, and up to BMW's usual high standards.",
    "Other than the futuristic curved glass dual screen, the i4 looks and feels quite familiar inside. Build and material quality are miles ahead of the Tesla Model 3 we recently reviewed.",
    "Then again, Tesla's sedan delivers 0-60mph in 4.2s (AWD), a 353-mile range, and vastly superior charging options for just $49,990.",
    "Obviously, the i4 is just a different value proposition, but we think BMW can do better. And did we mention the i4 lacks a frunk? Sorry, but in our book, all battery EVs must have a frunk. This is the way.",
    "The BMW iX is a fully electric crossover that's about as big as the X5 mid-size SUV. It was designed from the ground up as a BEV and is BMW's most aerodynamic vehicle to date, with a Cd of just 0.25.",
    "Like other purpose-built fully electric CUVs (crossover SUVs), the iX is very spacious inside. While it features optional third-row seating, there's no frunk, which is unusual for a bespoke EV. In fact, the hood only opens with tools.",
    "In the US, there's just one trim - the BMW iX xDrive50 - which packs a 516hp dual motor (AWD) drivetrain and a 105kW battery, costs $83,200 / £91,905 / AU$182,049 before incentives, does 0-60mph in 4.6s (0-100km/h in 4.7s), and has a range 300 miles EPA (365mi / 587km WLTP).",
    "The iX xDrive50 supports up to 200kW DC fast charging (10-80% in 35min), and up to 11kW AC charging.",
    "In the UK and Australia, there's a second, more affordable trim - the BMW iX xDrive40 - which comes with a 326hp dual motor (AWD) drivetrain and a 71kW battery, is priced at £69,905 / AU $146,621 before incentives, accelerates from 0 to 62mph (100km/h) in 6.1 seconds, and offers a range of 246 miles WLTP (395km).",
    "This model also handles up to 200kW DC fast charging and up to 11kW AC charging.",
    "Structurally, the iX pairs an exposed carbon-fiber cage (around the doors) with an aluminum space frame.",
    "Options include an adjustable air suspension, and a trick electrochromic glass roof that turns opaque at the push of a button. Unfortunately, this feature wasn't working on the iX xDrive50 we spent time with.",
    "We hope you like BMW's new design language, because the oversize kidney grille is on full display with the iX.",
    "It's definitely polarizing. The grille's shiny finish is made of a self-healing plastic that \"heals\" small scratches when exposed to heat – convenient for the inevitable day the front gets covered with sticky bugs.",
    "Other than the nose, the iX's exterior design is clean and attractive - at least for a crossover.",
    "The interior follows suit. Everything looks and feels high quality – if a little busy. Materials include quilted leather, and open-pore wood (with embedded, backlit capacitive buttons).",
    "Some items, like the iDrive puck, shifter knob, and power seat controls are made of an ornate, faceted crystal-like material that seems almost baroque. Ditto the two-spoke hexagonal steering wheel. At least it's still better than Tesla's awful yoke.",
    "Ultimately, while its unique, premium design somewhat justify its higher price tag, the iX doesn't really bring more to the table in terms performance, range, and technology than cheaper electric CUVs like Ford's Mustang Mach-E Premium or Tesla's Model Y Long Range.",
    "Different is fun, but we're worried BMW is forgetting its core values.",
    "The dashboard features a 12.3-inch instrument display and a 14.9-inch touchscreen mounted behind a single sheet of curved glass in a frameless pod that's angled slightly towards the driver.",
    "It's powered by the latest version of BMW’s software (iDrive 8) which, combined with computer hardware that's significantly faster, enables more responsive infotainment, and better sensor fusion for Level 2 driver-assistance.",
    "BMW isn't very specific about what kind of Level 2 ADAS features the i4 and iX will offer, but we expect it to match Ford's BlueCruise and GM's Super Cruise.",
    "This also includes BMW's existing tech, like the Active Driving Assistant safety suite, a 360-degree view, the Intelligent Personal Assistant, the My BMW app, Apple CarPlay / Android Auto support, Qi wireless phone charging, and multiple USB Type A and C ports.",
    "In all, we're cautiously optimistic about the upcoming i4 and iX. Like other German marques, BMW is slowly (but surely) getting more serious about electrification.",
    "While these new battery EVs aren't going to beat Tesla on value, range, charging infrastructure, or performance - even by next summer - the i4 and iX bring unique designs, superb craftsmanship, and familiarity to BMW's loyal customer base. And that's a big deal."
  ],
  "headers": {
    "3": "BMW i4 specs and features",
    "11": "BMW i4 first impressions",
    "17": "BMW iX specs and features",
    "25": "BMW iX first impressions",
    "32": "BMW i4 and iX tech"
  },
  "links": {
    "Tesla Model 3": "https://www.techradar.com/news/tesla-model-3-long-range-2021-review"
  }
}