{
  "source": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
  "title": "Facebook is changing its name to Meta",
  "category": "computing",
  "updated": "2021-10-28T21:25:48Z",
  "author": "nick-pino",
  "summary": "'From today on our company will be known as Meta'",
  "article": [
    "Facebook is officially changing its name to Meta, CEO Mark Zuckerberg announced today at the company's Oculus Connect event.",
    "As Zuckerberg pointed out, the word meta comes from the Greek word for beyond, which is where the CEO feels the company is going with its reinvigorated focus on augmented and virtual reality.",
    "At Connect, Zuckerberg outlined several ambitious plans for it's calling a connected, \"people-first\" internet that focuses less on social media in its traditional form and more on newer media forms like AR and VR.",
    "While the ways in which we'll interact with this platform are still coming together, the demos we saw showed seamless connectivity between Facebook's apps like Messenger and Oculus VR devices.",
    "None of Facebook's apps like Messenger or Instagram have changed their names or descriptions to reflect the new direction for the company, but we have discovered the @Meta Twitter handle and a Meta.com web address with content and information on the company's new direction.",
    "While it's a bit strange to hear that Facebook - a brand known the world over - will be changing its name, it appears to align with both Facebook's future plans and its current issues around privacy and the lack thereof.",
    "By changing its name, Meta can now invest in more AR / VR technology without it feeling like two separate companies - a point that Facebook might have taken strongly into consideration due to the calls by members of the US government to break the company up into smaller pieces.",
    "Having one company that focuses on new experiences might persuade the public that Facebook is turning over a new leaf and investing in new technologies rather than focusing on monetizing its current user base.",
    "That said, Facebook / Meta seems to have no plans on giving up on either of its two money-making social media websites, its two messaging services or its VR/AR company, Facebook Reality Labs.",
    "A new name may change how the company proceeds from here, but by and large you can expect some of its legacy platforms to remain exactly as they are today.",
    "Think the whole thing is ridiculous? So does TechRadar's Content Director, Jeremy Kaplan."
  ],
  "headers": {
    "5": "Analysis: This is a pivotal point in Facebook's history"
  },
  "links": {
    "@Meta": "https://twitter.com/meta?lang=en",
    "Meta.com": "https://about.facebook.com/meta"
  }
}