{
  "source": "https://www.techradar.com/news/there-might-be-some-new-motorola-rugged-phones-on-the-way",
  "title": "There might be some new Motorola rugged phones on the way",
  "category": "phones",
  "updated": "2021-02-11T18:34:52Z",
  "author": "anthony-spadafora",
  "summary": "First Caterpillar, then Land Rover and now Motorola",
  "article": [
    "Motorola is getting back into the rugged smartphone business as the company has entered into a long term, exclusive partnership with the UK-based Bullitt Group.",
    "Up until now, Lenovo was the only manufacturer making Motorola-branded smartphones. While the company has made rugged devices in the past, its experience in the space pales in comparison to the Bullitt Group.",
    "This is because the Bullitt Group manufactures the CAT line of rugged phones for the American engineering giant Caterpillar Inc. and also produces phones under the Land Rover brand.",
    "As part of their new strategic alliance, both the Bullitt Group and Motorola will combine their expertise in order to reach a new segment of consumers that require the additional durability and features that rugged smartphones have to offer.",
    "Co-founder of Bullitt, Dave Floyd explained how the new partnership is a testament to its success in the rugged phone business over the last 11 years in a press release, saying:",
    "“This is a unique strategic alliance, as it allows Bullitt to apply its expertise to the Motorola portfolio of products. Motorola invented the mobile phone and remains one of the most iconic brands in the world. To be entrusted by Motorola to create a portfolio of Motorola branded rugged phones, bears testament to the exceptional business we have built at Bullitt over the last 11 years.”",
    "The Bullitt Group and Motorola plan to release details on their new line of rugged smartphones later this quarter.",
    "Via Gizmochina"
  ],
  "headers": {
    "3": "Strategic alliance"
  },
  "links": {
    "rugged smartphone": "https://www.techradar.com/best/best-rugged-smartphones",
    "Motorola-branded smartphones": "https://www.techradar.com/news/phone-and-communications/mobile-phones/motorola-branded-phones-are-officially-dead-1312648",
    "Bullitt Group": "https://www.techradar.com/news/mobile-industry-awards-2020-bullitt-group-cat-phones-wins-ruggedised-manufacturer-of-the-year",
    "press release": "https://bullitt-group.com/bullitt-group-announces-new-mobile-partnership-with-motorola/",
    "Gizmochina": "https://www.gizmochina.com/2021/02/10/motorola-branded-rugged-smartphones-are-coming-but-not-made-by-lenovo/"
  }
}