{
  "source": "https://www.techradar.com/news/wwdc-2021-and-remembering-the-iphone-4-noise-cancelling-podcast-episode-68",
  "title": "WWDC 2021 and remembering the iPhone 4: Noise Cancelling podcast episode 68",
  "category": "phones",
  "updated": "2021-06-11T14:22:44Z",
  "author": "adam-vjestica",
  "summary": "Episode 68 of our tech podcast is out now",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "The show is presented by Gareth Beavis, Global Editor in Chief of TechRadar, and Sherri L. Smith, Editor in Chief of Laptop Mag.",
    "This week our guests Daryl Baxter, Software & Downloads Writer at TechRadar, and James Peckham, Phones Editor at TechRadar, who join us (remotely, of course) to talk about the last seven days in tech.",
    "In this week's episode, we're also joined by some Apple experts, so it would be shame not to dive into WWDC 2021 and discuss what took place during Apple's annual conference. We begin the show with this week's Big Question: if you could reimagine any gadget in the worst possible color, what would it be?",
    "Keeping to the Apple theme, we spend way too much time reminiscing about the iPhone 4, the Palm Pre and the iPod Hi Fi, and Sherri once again denies the existence of tablets. We also speculate on what Apple should make next.",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple Podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 68:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/uk",
    "Tom's Guide": "https://www.tomsguide.com/uk",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple Podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4085561739581922000&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}