{
  "source": "https://www.techradar.com/news/bad-news-upgraders-you-might-need-a-new-cpu-cooler-for-intel-alder-lake",
  "title": "Bad news upgraders: you might need a new CPU cooler for Intel Alder Lake",
  "category": "computing",
  "updated": "2021-06-28T15:35:02Z",
  "author": "bill-thomas",
  "summary": "Intel users could be in for an expensive upgrade when Alder Lake S arrives",
  "article": [
    "Intel's 12th-generation Alder Lake should help Team Blue regain some relevance in the mainstream processor market, but you might need to invest in more hardware than usual to upgrade to one of these processors.",
    "The Alder Lake socket has leaked via Igor's Lab, and unlike past revisions of Intel's CPU sockets, this one will probably require an entirely new CPU cooler – and just getting a new mounting bracket probably won't cut it.",
    "According to the leak, not only will the mounting sockets change, but the shape and height of the processor will also change for the first time in years, which means that even with a brand new mounting bracket, you're going to need an entirely new cooler. Instead of the square shape that, say, the Intel Core i9-11900K has, it looks like the Intel 12th-generation processors will have more of a elongated rectangular shape, kind of like Threadripper, but smaller.",
    "But aside from the new shape of the processor, the z-height, which is how high the CPU will measure when socketed in your motherboard, also looks like its shrinking down to 6.5mm from 7.3mm, which means CPU cooler manufacturers will also have to account for that.",
    "We're still a while out from actually seeing Alder Lake on the market, as the last we heard was a potential October 2021 launch date, but if this new design is accurate, we'd expect to see a bunch of leaked CPU coolers leading up to the launch. So, uh, stay tuned.",
    "It isn't out of the ordinary for Intel loyalists to have to upgrade more than just the processor when they grab an upgrade. Usually motherboards are only good for one or two generations before they have to be scrapped, but the Intel LGA 1200 socket has been around for years.",
    "This means it's conceivable that you've had the same cooler for a while, even if you've upgraded your CPU several times since then. We know we have a PC that's had the Cooler Master Hyper 212 for quite a while.",
    "It was only a matter of time before Intel would have had to update its socket design – there will probably be a socket change soon for AMD too – but it's something you should be prepared for if you're planning on upgrading to Intel's new silicon when it drops later this year (if it comes out later this year and doesn't get pushed back to 2022).",
    "Of course nothing has been confirmed yet and this is all just rumor and hearsay, but if it is true, we hope that Intel has strong enough performance gains to make upgrading both your motherboard and your CPU cooler worth it.",
    "Via Videocardz"
  ],
  "headers": {
    "5": "All new"
  },
  "links": {
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "processors": "https://www.techradar.com/news/best-processors",
    "Igor's Lab": "https://www.igorslab.de/en/intel-socket-lga-1700-and-lga-1800-in-detail-exclusive-data-and-drawings-for-the-new-cpus-ab-alder-lake/",
    "Intel Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "heard was a potential October 2021": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "Videocardz": "https://videocardz.com/newz/details-on-intel-lga1700-socket-for-alder-lake-cpus-have-been-leaked"
  }
}