{
  "source": "https://www.techradar.com/news/9-of-the-best-things-you-can-do-with-a-foldable-phone",
  "title": "9 of the best things you can do with a foldable phone",
  "category": "phones",
  "updated": "2021-08-22T08:00:39Z",
  "author": "esat-dedezade",
  "summary": "More than mere bragging rights",
  "article": [
    "As a kid, foldable phones were a mere pipe dream, like working lightsabers, flying cars, and hoverboards (the proper kind, not the two-wheeled nonsense we have today).",
    "While you’re unlikely to be slicing things in half with a highly advanced crystal-powered laser sword any time soon, the age of folding phones is already well and truly upon us. From Motorola and Huawei, to Samsung’s third generation Galaxy Z Fold 3, the future has already arrived.",
    "Priced well outside the range of most gadget fans though, folding phones remain rare beasts in the wild. You might even be wondering what purpose they serve beyond the novelty factor, which might wear off after a week or two — which is why we’re here.",
    "Yes, you can get a tablet, but the beauty of a folding phone lies in its ability to blend the portability of a regular handset with the larger screen of a tablet. From watching movies to supercharged selfies and reliving retro Game Boy classics, we’ve rounded up some of the best things you can do with a folding phone.",
    "While some contorting handsets like the Galaxy Z Fold 2 have regular selfie cams on their inner folding screens, others take a different approach. The Huawei Mate X2, for example, makes up for its lack of a selfie cam by letting you use the full power of the main rear cameras by cleverly letting you see yourself on the front screen when it’s unfolded. It might be more impractical to hold a fully unfolded phone towards you, but that’s a small price to pay for looking your best for selfies and portrait shots. And because it works with video too, vloggers can see themselves while they’re filming, to ensure they’re in frame without blindly recording themselves.",
    "While you can run Game Boy (and other console) emulators on regular smartphones, the extra screen real estate offered by folding phones makes them an ideal choice for playing your favorite retro games, as the on-screen controls can be easily placed beneath the screen without sacrificing any visibility.",
    "Download an emulator like My Boy!, load up a ROM (make sure you legally own the game itself first), and lose yourself in the pixellated masterpieces of yesteryear.",
    "Having spent most of the past few years exclusively reading books on his smartphone, this particular author has found that reading on a larger unfolded display is something that’s almost impossible to give up once you’ve got a taste for it.",
    "Sure, you could have a tablet or an ereader instead, but having one device that magically transforms into a larger one makes for the ultimate on the go ebook/graphic novel reader, not to mention a very capable website/reddit browser.",
    "If you’re an Xbox owner then you can essentially transform a folding phone into the ultimate portable gaming device similar to that of the Nintendo Switch. Using the Remote Play feature in the Xbox app, you can access and play games on your folding phone’s larger screen, with Xbox controller support for the full authentic experience to boot.",
    "Again, you could use a regular smartphone too, but you’ll be squinting and straining more than capturing flags and racking up kills. Even if you don’t have an Xbox on hand, regular mobile games like Call of Duty Mobile and Fortnite will look and play much better on a bigger screen.",
    "Another beauty of a plus-sized display is the fact that you’ve got more room to play around with when creating content. From on-phone drawing and photo editing, to video editing and more, you’ll have a much better time carrying out detailed work on a larger screen than you would on a poxy, narrower handset display, especially if you’re an avid stylus user.",
    "The larger screen space offered by an unfolded phone provides much more room for activities. From watching videos and making notes, to browsing memes and watching videos, the ability to have more than one app open and displayed on a bigger display is a godsend for multitaskers.",
    "Yes, you can have split screen apps on regular phones, but we’d be lying if the paltry size of each app was anything more than a rarely used novelty. Go big or go home, we say.",
    "There’s something quite magical about watching a show on Netflix on a folding phone. While the screen is obviously bigger than a regular handset’s you’re still going to get substantial black bars, which can’t be helped. If you’re daring though, you can opt to go full screen, filling up the entire square display with your favorite show.",
    "You’ll be cropping in quite significantly of course, but it’s nice to have the option, and the larger, edge-to-edge look feels rather futuristic, which is nice. Even with the black bars you’re still getting a larger picture than you would with a regular phone, so it’s a win-win either way.",
    "The bigger the display, the bigger the keyboard, and the bigger the keyboard, the more comfortable the typing experience. A folding phone saves you from pecking away at tiny on-screen keys, and instead lets you type away faster and more accurately with your thumbs, making for a much nippier (not to mention more comfortable), typing experience.",
    "From emails and WhatsApp messages, to editing documents and penning stories, a folding phone turns your handset into a more productive version of itself.",
    "Ultimately though, the best thing about having a folding phone is that there aren’t many out there. Chances are, yours will be the first one any of your friends or family see, and from our experiences so far, you’re going to blow people away.",
    "You’ll be surprised how many folks aren’t even aware that folding phones exist, or that they’re even possible, so you’ve got a chance to nab the spotlight until they become more mainstream. Just try not to flaunt it on the street — you’ll be a nefarious moped thief’s dream target."
  ],
  "headers": {
    "4": "Look your best",
    "5": "Relive your Game Boy days",
    "7": "Read a novel",
    "9": "Portable console gaming",
    "11": "Unleash your creative potential",
    "12": "Nail multitasking",
    "14": "Embiggen your favorite shows",
    "16": "Type a novel",
    "18": "Blow people’s minds"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold 3": "https://www.techradar.com/news/samsung-teases-the-galaxy-z-fold-3-ahead-of-its-official-announcement",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Huawei Mate X2": "https://www.techradar.com/news/a-week-with-the-huawei-mate-x2",
    "My Boy!": "https://play.google.com/store/apps/details?id=com.fastemulator.gbafree&hl=en_GB&gl=US",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}