{
  "source": "https://www.techradar.com/news/euphoria-season-2",
  "title": "Euphoria season 2: everything we know",
  "category": "entertainment",
  "updated": "2021-08-31T14:21:26Z",
  "author": "rebecca-april-may",
  "summary": "What we know about the HBO hit's upcoming return",
  "article": [
    "Spoilers follow for Euphoria season 1.",
    "Euphoria season 2 is coming to HBO – and while it doesn't have a release date yet, production began earlier in 2021, meaning you don't have much longer to wait to see it.",
    "Fans will be excited to hear that the highly anticipated follow-up to 2019’s breakout first season and the more recent specials from late 2020 and early 2021 is finally happening after being delayed by Covid-19. Euphoria’s first season premiered in June 2019, and was such a massive success that it was renewed for a second season before the first had even aired its finale.",
    "The show went on to be nominated for a BAFTA and a TCA Award for its stunning first season, as well as earn lead actor Zendaya the Emmy for Best Actress in a Drama Series. The first season followed high schooler Rue (played by Zendaya) over her recovery from drug addiction, as her and her classmates tackled sex, drugs, love, catfishing… and a lot of trauma. Season 2, we're sure, will only get more intense.",
    "Here's what we know about Euphoria season 2 so far.",
    "Release date: Euphoria season 2 is expected in either late 2021 or early 2022.",
    "Cast: As well as the returning cast of the first season, Euphoria is adding the actors Minka Kelly, Dominic Fike and Demetrius 'Lil Meech' Flenory Jr to its cast this season – possibly in recurring roles.",
    "Where will it air? If you're in the US, you'll be able to watch Euphoria on HBO, as well as the HBO Max streaming app. In the UK, you can expect to see it on Sky Atlantic and NOW.",
    "Euphoria season 2 was originally due to start filming in March 2020, but was postponed only days away from production due to Covid-19. In an interview with InStyle in August 2020, Zendaya said, “There is a beautiful second season that has been written, but in order to do it the way we want to do it, we need to wait until it's safer.\"",
    "Euphoria season 2 was back in production by Spring 2022. On 4 May 2021, Zendaya shared photos from the set to her Instagram story, captioning a photo of Angus Cloud, who plays Fez in the show, with \"Missed this kid,\" and another photo of the crew with, “And these kids.” The actress followed it up with, “Just being back in general… missed it.” tagging the official Euphoria page.",
    "Meanwhile, Sydney Sweeney, who plays Cassie, posted a photo to Instagram on 24th March this year, from the grooming chair in what looks like glam Cassie hair and makeup, with the simple caption, “She’s backkk.”",
    "So, with filming underway, when can we expect season 2 to premiere on HBO?",
    "The show’s creator and showrunner, Sam Levinson revealed in an early 2021 interview with IndieWire’s Filmmaker Toolkit podcast that he planned to start filming Euphoria season 2 in late March – and according to the cast’s social media posts, this plan appears to be on track. In that same interview, Levinson revealed, “The goal is to release episodes this year, so that’s hopefully [when they will be released].”",
    "Variety, though, mentioned in an article about new cast additions that late 2021 or early 2022 were the likely premiere dates. When it does release, we can expect it to air on HBO in the US and Sky Atlantic and Now in the UK, as the first one and its specials did.",
    "One of the biggest questions at the end of season 1 was around Rue’s fate: the series ended with Rue backing out of her plan to leave town with Jules, followed by a surreal and haunting song and dance number set to “All of Us,\" an original song by Zendaya. Many thought the final scenes could be interpreted as Rue relapsing – possibly fatally.",
    "But, of course, we know that Zendaya is returning for season 2, and we know that Rue is still alive thanks to the first of the specials, released in December 2020, which revealed that she was still in her hometown, without Jules, but that her sobriety had faltered.",
    "Similarly, though the final moments of season 1 saw Jules leave town for the city after Rue pulled out of their plan to run away together, in the second of the specials, we learn that Jules is back home, where she is also visited by Rue for the first time since, right after Rue’s earlier meeting with Ali.",
    "The exact cast list of the second season hasn’t been revealed by HBO yet, but we can expect the major players of season 1’s ensemble cast to return, including:",
    "We can expect new faces to join the ensemble, too. Deadline reported that Minka Kelly,",
    "The length of Euphoria season 2 hasn’t been confirmed yet, but for now we can assume it will be the same length as the first season, which was eight episodes, each around an hour long.",
    "Off the back of the season 1 finale and the two following specials, we know that Rue is alive and that Jules has returned to her suburban home from the city. So, what’s likely to happen next to the group?",
    "The plot details of the second season are being kept tightly under wraps – but thankfully, we have been served some tantalizing hints from the cast about each of their own characters in the new season.",
    "In an interview with Entertainment Weekly, Hunter Schafer, who plays Jules, revealed that she wants Jules to focus more on herself next season – though that’s likely to get messy. She said, \"I think I want to continue to see Jules work on herself in that she’s still got some major issues, and to continue to dissect that and feel it out. I think she learns from experiencing things. And so to experience what she needs to, without being messy, that’s from the sort of loving parent/sister relationship I feel like I have with her. That’s what I want for her, although who knows how it will play out. I’m sure it will be more messy than I would hope for her.\"",
    "We can expect Rue’s younger sister, Gia, to have a larger role this season, too. Storm Reid, who plays her, said in an interview with Entertainment Weekly, “I feel like you’ll be seeing a lot more Gia in the second season.” Meanwhile, speaking to Yahoo, Reid revealed, “[Gia’s] character definitely develops... She becomes her own person and she gets her own storyline. I don't want to give too much away, but she will definitely be more prominent in season 2.”",
    "And after a rather traumatic first season, Cassie will have a particularly “crazy” storyline, actress Sydney Sweeney has teased. Speaking to Stylecaster, the actress hinted at what that could entail. \"I can tease that, when you ask about season 2, my heart drops. In a you-guys-have-no-idea-what-you’re-going-to-watch way… Cassie really needs to get her shit together. I can’t say anything else. Cassie has a crazy storyline in season 2 that I did not expect. Every time I read a new episode that Sam writes, my jaw is on the ground and I can’t believe this is something coming out of someone’s mind.\"",
    "You've got plenty to look forward to in this next set of episodes, then – whenever it is they get here, anyway.",
    "Euphoria season 1 and its specials are streaming now on HBO Max in the US."
  ],
  "headers": {},
  "links": {
    "InStyle": "https://www.instyle.com/celebrity/zendaya-september-2020-cover",
    "Instagram": "https://www.instagram.com/p/CMzpwCznHsr/",
    "IndieWire’s Filmmaker Toolkit": "https://www.indiewire.com/2021/02/malcolm-and-marie-sam-levinson-filmmaker-toolkit-episode-129-1234616129/",
    "Variety": "https://variety.com/2021/tv/news/euphoria-season-2-dominic-fike-minka-kelly-demetrius-lil-meech-flenory-jr-1235036348/",
    "Deadline": "https://deadline.com/2021/08/euphoria-minka-kelly-dominic-fike-demetrius-lil-meech-flenory-jr-season-2-hbo-1234810518/",
    "Entertainment Weekly": "https://stylecaster.com/sydney-sweeney-euphoria/",
    "Stylecaster": "https://stylecaster.com/sydney-sweeney-euphoria/"
  }
}