{
  "source": "https://www.techradar.com/news/we-have-4k-monitors-why-are-there-no-32-inch-4k-tvs",
  "title": "We have 4K monitors – why are there no 32-inch 4K TVs?",
  "category": "televisions",
  "updated": "2021-11-11T18:09:56Z",
  "author": "henry-st-leger",
  "summary": "A curious absence among modern televisions",
  "article": [
    "Why are there no 32-inch 4K TVs? It’s a question that may well have come up in your TV shopping travels – given how ubiquitous 4K Ultra HD resolution is, it can feel surprising that it’s not more readily available on smaller screens.",
    "Well, smaller TV screens, we should say. 4K is now pretty common in PC monitors (for work and leisure alike), and while it will certainly lift the price tag of your monitor above a Full HD model, it’s still an option – one that isn’t even offered by TV manufacturers.",
    "There are a few reasons for this. For one, while 4K resolution packs in four times the amount of detail as a Full HD screen, this detail is only visible within a certain proximity.",
    "If you’re sitting right up close to a small screen, that’s fine – but given we tend to sit a bit of a distance away when watching television, often viewing a show or film alongside friends, family, or roommates, the viewing habits around small TVs makes 4K detail a bit redundant.",
    "Given the pixel density of a 4K screen, the ideal place to sit is between 1-1.5 times the screen size of your 4K TV. At this distance, your eyes cannot tell apart the individual pixels, so you’ll be viewing the image on the screen in the same detail as you would in real life. For a 32-inch screen, then, you should be seated 32-48 inches away (around three to four feet).",
    "While this is a workable distance in a study or bedroom, it’s not ideal for the average living room – and the visibility window is simply much larger on even a 40-inch screen, with an ideal viewing distance of around four to five feet. That’s why 4K resolution becomes standard at that size.",
    "The issue isn’t with TV screens, so much as how we tend to navigate them, at what distance, and where we usually place them in our homes.",
    "It’s not just viewing habits to consider, though, but also spending habits, and the usual price points on high-spec monitors versus small TVs.",
    "Michael Helander, CEO of OTI Lumionics, tells us that “one of the critical market forces at play here is that 27-inch 4K IPS monitors sell for the same price as a 55-inch LCD TV, which means the monitor market can sustain a higher price per unit area of display.”",
    "Selling a 4K TV at a 32-inch size simply isn’t compatible with that price disparity – while you’d naturally expect a notable cost reduction compared to a 55-inch 4K TV, as we usually get with 32-inch TVs packing Full HD screens, 4K monitors at the same size are a whole other ball game.",
    "Our favorite 4K monitor, the BenQ SW321C PhotoVue, retails for $1,999 / £1,599 / AU$3,199 despite measuring only 32 inches – around the cost of a high-end OLED TV like the 55-inch LG C1.",
    "Others, like the Asus TUF Gaming VG289Q, cost a fraction of that amount, but it's notable that you'll get a cheap 4K monitor for the same price as the average 32-inch TV with HD/Full HD resolution.",
    "Of course, this is one way to sidestep all this: by buying a 4K monitor and just using it as a small 4K TV. You might not get the sleek smart TV interface of a new Samsung TV or LG OLED display, but any TV streaming service worth its salt will have a browser option, and even a desktop app for you to download. You’ll likely be paying more than for a 40-inch TV with 4K, but it may be worth it to get the exact specifications you need (and likely a great work/gaming monitor to boot).",
    "It’s worth noting that TV streaming platforms don’t always support native 4K streaming in browsers – Netflix for instance will only offer it in Microsoft Edge, and not Google Chrome or Mozilla Firefox. Amazon Prime has a desktop app, though you won’t find 4K there at all, while HDR and Dolby 5.1 surround sound aren’t compatible there either, meaning you’ll need a smart TV to get the really high-spec performance.",
    "4K monitors will, like any 4K display, do a certain amount of upscaling, which is how a processor fills in additional pixels not provided by a source image or video. If a TV show is only in HD, but it needs to be watchable on a 4K screen, those extra pixels need to be created algorithmically on the fly without distorting the source. So watching a show in HD on your screen shouldn’t ruin things, but the ideal experience is still going to be on a streaming app that supports 4K out of the gates."
  ],
  "headers": {
    "7": "When the price is right",
    "12": "Avoiding the problem"
  },
  "links": {
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "Ultra HD": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "PC monitors": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "40-inch screen": "https://www.techradar.com/news/best-40-inch-tv",
    "viewing distance": "https://www.techradar.com/news/tv-viewing-distance",
    "55-inch 4K TV": "https://www.techradar.com/best/55-inch-4k-tv",
    "BenQ SW321C PhotoVue": "https://www.techradar.com/reviews/benq-sw321c-photovue",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "Asus TUF Gaming VG289Q": "https://www.techradar.com/reviews/asus-tuf-gaming-vg289q",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "TV streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "you won’t find 4K there at all": "https://www.windowscentral.com/amazon-prime-video-windows-10-better-browser-isnt-good-enough",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "upscaling": "https://www.techradar.com/news/4k-upscaling-everything-you-need-to-know-about-how-tvs-turn-hd-into-4k"
  }
}