{
  "source": "https://www.techradar.com/news/the-rise-and-fall-of-point-and-click-legends-sierra-and-lucasarts",
  "title": "The rise and fall of point-and-click legends Sierra and LucasArts",
  "category": "computing",
  "updated": "2021-08-30T14:00:00Z",
  "author": "carlos-l-hernando",
  "summary": "The rise and fall of LucasArts and Sierra",
  "article": [
    "The history of PC gaming is full of legendary developers and publishers who have not only delivered incredible experiences, but have shaped entire genres, inspired countless creators and helped establish a billion-dollar industry. And yet, many of them couldn’t stand the test of time and the ever shifting PC gaming scene.",
    "Companies like Sierra and LucasArts, two rivals that went on different paths, but eventually shared the same fate. Two fallen titans whose legacies are impossible to forget.",
    "But don’t be sad, this article is a celebration of their achievements and an invitation to remember.",
    "What started as a small family business led by husband and wife team, Roberta and Ken Williams, eventually grew into a huge development and publishing studio with hundreds of employees, a multitude of subsidiaries and several similar names.",
    "Founded in 1979, On-Line Systems (subsequently known as Sierra On-Line, Sierra Entertainment and then simply Sierra), took about a year to invent the beloved adventure game genre with Mystery House. It was the first game to combine text and graphics to tell an interactive story.",
    "After this first success, they developed some of the most important sagas in the genre, some of which did not have \"Quest\" in their title: King’s Quest, Space Quest, Police Quest, Gabriel Knight, Leisure Suit Larry, Quest for Glory...",
    "They would also publish a myriad of games of all kinds of genres. Some are as famous as Diablo: Hellfire (which was developed by one of their subsidiaries and yes, it’s the expansion pack of that Diablo) or Half-Life (undoubtedly one of the most influential games in PC gaming).",
    "However, success eventually crushed the dream. In 1996, CUC International bought Sierra for $1.5 billion and Davidson & Associates (former owners of Blizzard Entertainment) for another $1.6. This created a business conglomerate whose goal was to become one of the largest game publishers in the world.",
    "From this point on, Sierra would enter a legal maze of rebrandings, sales and studio closures that would include the departure of the Williams duo from the company, the biggest financial scandal of the time and the final acquisition by Activision, which ended its activity in 2008. Last year a book written by Ken Williams himself was published narrating part of the events of this era: Not All Fairy Tales Have Happy Endings: The rise and fall of Sierra On-Line..",
    "Activision resurrected the Sierra brand briefly in 2014 to publish old games in digital format and promising indie titles (such as Geometry Wars 3: Dimensions Evolved).",
    "However, no new games have been published since 2017 and, in 2018, the sierra.com domain was sold to TJX Companies, an off-price department store corporation.",
    "Therefore, it does not seem that we will see new titles under this “new” brand. And that’s OK. It would be a shame to see such an iconic name turned into a mere marketing hook. Their legacy is more than enough: over 400 developed and/or published games in less than 30 years.",
    "And at the very least, playing its most legendary games is easier than ever through Steam or GoG.",
    "Another graphic adventure giant, LucasArts was conceived as part of the Lucasfilm Computer Division in 1979, which included a department for computer games (the Games Group, later known simply as Lucasfilm Games) and another for graphics.",
    "This was in response to George Lucas' own desire to explore other areas of entertainment. In 1982, the latter department would become independent, eventually becoming Pixar.",
    "At the beginning of this journey, the Star Wars rights were in the hands of Atari, which forced the studio to experiment and create new IPs. As Ron Gilbert, one of its legendary designers, said: \"If we had been able to make Star Wars games, it's probably all we would have done\". Given the result, I call that a stroke of luck.",
    "One of their first titles was Habitat in 1985, considered the first MMO in history. Unfortunately it did not go beyond the beta phase because internet infrastructures at the time were not up to the task, but it was revolutionary and a herald of what was to come.",
    "Soon after, beloved adventure sagas would arrive, characterized by a philosophy that made them stand out from Sierra's games: no fail state, no death and a focus on comedy (although not all titles followed these principles to the letter). Some of them were: Maniac Mansion, Loom, Monkey Island, Indiana Jones and the Fate of Atlantis, Sam & Max Hit the Road, Full Throttle or Grim Fandango.",
    "But not everything was graphic adventures, and when LucasArts recovered the Star Wars rights in 1992, they began to exploit the brand, starting with the awesome X-Wing, published in 1993.",
    "Since then, a slow process would begin in which the prominence of this IP would displace the others. Finally, in its last years it would end up monopolizing almost its entire catalog (both publishing and developing). This led to all kinds of games, such as racing (Star Wars Episode I: Racer), RPGs (Star Wars: Knights of the Old Republic) or even chess (Star Wars Chess).",
    "The end came at the hand of Disney, which acquired Lucasfilm and all its subsidiaries in 2012. This, of course, included LucasArts and led to the cancellation of the games being developed at the time… and its ultimate closure in early 2013.",
    "However, in a seemingly inevitable way, the Lucasfilm Games brand rose from the ashes in January of 2021 to support games based on Star Wars and Indiana Jones.",
    "Fortunately, part of the true legacy of LucasArts survives thanks to the studios founded by its former employees, the most famous being Double Fine (recently acquired by Microsoft) and Telltale Games (which could be considered a fallen titan itself, since it disappeared in 2018). In addition, many of their most legendary games have been remastered (some by Double Fine). So, like in Sierra’s case, playing them is easier than ever through Steam or GoG. We heartily recommend that you do."
  ],
  "headers": {
    "3": "Sierra On-Line",
    "13": "LucasArts"
  },
  "links": {
    "most influential games in PC gaming": "https://www.techradar.com/news/the-most-important-pc-games-of-all-time",
    "Not All Fairy Tales Have Happy Endings: The rise and fall of Sierra On-Line.": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FFairy-Tales-Happy-Endings-Line-ebook%2Fdp%2FB08KG2XLMR%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1658674486076741000-21"
  }
}