{
  "source": "https://www.techradar.com/news/these-audiophile-headphones-promise-incredible-sound-but-theyll-cost-you",
  "title": "These audiophile headphones promise incredible sound - but they'll cost you",
  "category": "audio-visual",
  "updated": "2021-09-22T23:45:27Z",
  "author": "olivia-tambini",
  "summary": "The Audeze LCD-5 over-ear headphones don't come cheap",
  "article": [
    "A great pair of reference headphones for analytical listening rarely come cheap, but the latest cans from Audeze will really put a dent in your bank balance.",
    "The Audeze LCD-5, which continues the brand's lauded LCD series of over-ear headphones, are available to order now for $4,500 / AU$6799 (about £3,290).",
    "So, what are you getting for your money? Well, according to Audeze, the LCD-5 will set \"a new standard for accuracy\", thanks to a new design that should minimize reflections, improve the frequency response, and provide a more open soundstage.",
    "At 420g, the new headphones are one third lighter than their predecessors, the LCD-4, and come with leather earpads, a carbon fiber suspension headband, tortoiseshell acetate rings, magnesium housings, a high-purity copper cable, and an aluminum travel case.",
    "They look suitably luxurious for their price - but if you're after something a little cheaper, check out the Audeze LCD-1, which brings the company's planar magnetic headphones down to a more reasonable $399 / £399 / AU$649. Their direct, detailed sound and comfortable fit prove that you don't have to go into four-figure sums if you want to buy a pair of excellent reference headphones.",
    "Most headphones that are designed for careful, analytical listening come with open-back designs, which allows air to pass through the earcups.",
    "This prevents pressure from building up inside and distorting the sound of your music, making them ideal for listening to hi-res audio files, and when you want to get the clearest sound possible.",
    "Open-back headphones tend to sound more natural and expansive than closed-back headphones. However, they do come with some drawbacks.",
    "While open-back headphones allow air to pass through the earcups, they also allow air - and therefore, sound - to travel the other way. Lots of sound leakage means that anyone around you will be able to hear what you're listening to, so these headphones aren't suitable for use in a shared office or on your commute.",
    "You'll also be able to hear pretty much everything that's going on around you, too - unlike noise-canceling headphones that come with a closed-back design, open-back headphones allow environmental sound to pass through the earcups.",
    "Open-back headphones are also generally more fragile than other kinds of headphones. That's because the inner mechanisms of the earcups are relatively exposed, so drops of water or dust could cause lots of problems.",
    "All of that means you're limited in where you can use open-back headphones; models like the Audeze LCD-5 are made for careful listening in the studio and at home. If you want a pair of headphones that you can plug into an amp and listen to as you sink back into a well-plumped armchair, open-back is the way to go. For everything else? Closed-back is the way to go."
  ],
  "headers": {
    "5": "Analysis: do open-back headphones really sound better?"
  },
  "links": {
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "Audeze LCD-1": "https://www.techradar.com/reviews/audeze-lcd-1",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec"
  }
}