{
  "source": "https://www.techradar.com/news/why-im-waiting-for-the-ps5-slim-before-i-buy-a-next-gen-console",
  "title": "Why I’m waiting for the PS5 Slim before I buy a next-gen console",
  "category": "gaming",
  "updated": "2021-02-13T12:57:36.023Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Slim pickings",
  "article": [
    "With the PS5, a new generation of gaming has arrived – complete with massive jumps in processing power, a host of next-gen features like super-fast SSDs, the overhauled DualSense controller, and the beginnings of a roster of PS5 games to play.",
    "But for those wanting to play the long game, there is another console worth keeping in mind – the PS5 Slim.",
    "Slim editions of PlayStation consoles have been around almost as long as PlayStation itself. There was the slimmed down ‘PS1’ version of the original PlayStation console, with the PS2 Slim, PS3 Slim, and PS4 Slim consoles all following new iterations of the beloved gaming machine.",
    "In each case, the strategy has been roughly the same: once a new console has been on the market for a few years, Sony has figured out how to offer the same specifications in a more compact form factor, even at a slight cost reduction, with all the benefits of coming into a console generation a bit further into its lifespan (having a beefed-out game library, for one).",
    "While the PS5 launch is too fresh for a PS5 Slim to be announced or marketed yet – ‘Slim’ models usually launch three years after a new console iteration – its existence seems pretty certain given the history of its slimmed-down predecessors. And there are plenty of reasons to wait until this new iteration comes out.",
    "It’s no secret that PS5 consoles aren’t that easy to come by these days – and if you’re yet to nab a PS5 or PS5 Digital Edition for yourself, it’s likely you’ll be waiting until late 2021 anyway for more widespread availability.",
    "As you wait, it’s worth thinking over the benefits of not getting a PS5 console right away, especially if you wait the three years before a PS5 Slim is likely to launch. We’ll start with the most obvious one: the size.",
    "The PS5’s design has been pretty controversial from the off. Some love the sci-fi design, cape-like sides, and tall vampire lady aesthetic; others dismiss it as an eyesore that won’t fit into the average media cabinet without you sawing the console in half.",
    "I fall into the latter camp; it’s the same reason I’m still tempted by the slab-like Xbox Series S, with its compact form factor making it the smallest Xbox ever made. When you buy a game console, you’re opting to have it in your eyeline almost every day of your life, and nothing ruins a carefully created decor than a two-tone spaceship leaving hyperspeed.",
    "We measure the PS5 at 38.8 x 8 x 26cm (H x W x D), which is even larger than the bulky PS3 – though the curved surfaces make getting an exact measurement difficult.",
    "It’s meant to be eye-catching, for sure, but for many it simply won’t be at home in its current form. A PS5 Slim could offer a sleeker, more compact shape that, if not as small as the Series S, could still make owning a PS5 less about making a visual statement and more about playing next-gen games.",
    "It could be smart to wait until 2023 to opt into the PS5 console family too. By that point, we’ll have seen three years of PS5 exclusives and enhanced PS4 games, meaning we’re not short of great titles to play.",
    "Alongside launch titles like Astro’s Playroom and Spider-Man: Miles Morales, we’ll have seen God of War: Ragnarok, Horizon Forbidden Dawn, the Ratchet & Clank reboot, and a host of other PS5 games we don’t even know are in the pipeline.",
    "There’ll certainly be more 4K games to play, meaning you’ll be able to make better use of the PS5’s 4K capabilities – and it also gives TV makers more time to make sure their screens are really optimized for next-gen consoles. HDMI 2.1 support, which enables 4K/120Hz passthrough and usually comes bundled with VRR (variable refresh rate) is still largely limited to pricey sets, and good gaming features are going to trickle down to even cheaper televisions in the next couple of years.",
    "It’ll be clearer, too, whether the PS5 or Xbox Series X have won on exclusives. While Sony won that argument pretty definitively in the last generation, Microsoft’s acquisitions and increased focus on first-party games could start bearing fruit in the next couple of years.",
    "It’s very hard to tell this early in a console generation, as software strategies are still coming into focus – and flagship Xbox Series X games like Halo Infinite are yet to release – which console platform is really worth it this time around.",
    "Let’s not forget that a Slim console has the chance to improve the PS5 in a number of ways. The PS3 Slim, for example, wasn’t just two-thirds of the size and weight of the PS3 – it also consumed around 40% less power and featured a microprocessor and redesigned cooling system that made for a quieter and cooler machine.",
    "While I don’t expect to see anything as drastic as the ‘ring red of death’ from the Xbox 360 – which bricked my own 360 console, as well as its first replacement – minor issues have the chance to be fixed in successive hardware. Given the PS5 DualSense is prone to the same drift problem as Nintendo’s Joy-Cons, we’d hope work is happening behind the scenes to prevent this in future.",
    "It’s clear that the PS5 offers a major upgrade to the PS4 and PS4 Pro. But for those wanting the best version of the PS5, rather than the first model Sony could release, there may well be better things ahead.",
    "And if there aren’t? Well, the current PS5 will certainly be cheaper by then."
  ],
  "headers": {
    "7": "Sizing up",
    "11": "Gaming the system",
    "16": "Ironing out the kinks"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "PS4 Slim": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "tall vampire lady": "https://www.techradar.com/reviews/resident-evil-village",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS3": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps3-1099856/review",
    "PS5 exclusives": "https://www.techradar.com/best/best-ps5-games",
    "PS4 games": "https://www.techradar.com/best/best-ps4-games",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden Dawn": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Ratchet & Clank": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "4K games": "https://www.techradar.com/news/gaming/5-best-4k-games-the-best-looking-titles-to-play-in-4k-1296513",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "PS5 or Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "Xbox Series X games": "https://www.techradar.com/best/best-xbox-series-x-games-the-xbox-series-xs-games-you-need-to-play",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "PS3 Slim": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps3-630534/review",
    "Xbox 360": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-360-703247/review",
    "Joy-Cons": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "PS4 and PS4 Pro": "https://www.techradar.com/news/gaming/consoles/ps4-pro-vs-ps4-what-s-the-difference-1328341"
  }
}