{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-vs-samsung-galaxy-z-fold-2",
  "title": "Samsung Galaxy Z Fold 3 vs Samsung Galaxy Z Fold 2: what has changed?",
  "category": "phones",
  "updated": "2021-08-12T13:07:58Z",
  "author": "jon-mundy",
  "summary": "A foldable face-off",
  "article": [
    "Samsung has unfurled its third-generation luxury foldable, the Samsung Galaxy Z Fold 3. But is it likely to be a worthwhile upgrade over the Samsung Galaxy Z Fold 2?",
    "We were big fans of last year’s Fold 2, going so far as to say that it was “the only foldable phone you should consider buying” at the time of its release. But it still had a few creases that needed ironing out - and that isn’t intended as a joke about the phone’s folding display.",
    "We’ve only just started to get familiar with the Samsung Galaxy Z Fold 3, so a full comparison will have to wait until our review is published. But here’s how the two Folds compare in a straight spec-off.",
    "The Samsung Galaxy Z Fold 3 release date is Friday, August 27 in the US and UK, while for our Australian buddies it’s September 10. Prices start at $1,799 / £1,599 / AU$2,499 for the 256GB model, while $1,899 / £1,699 / AU$2,649 gets you 512GB of storage.",
    "The Samsung Galaxy Z Fold 2 hit shops on September 18, 2020, when it was priced at $1,999 / £1,799 / AU$2,999 for 256GB of storage.",
    "As you’ll note, this makes the Galaxy Z Fold 3 a fair bit cheaper at launch, though it’s still quite expensive. It’s also worth noting that the Galaxy Z Fold 2 can now be found at a knock-down price far south of its list price, and its successor’s for that matter.",
    "Samsung really hasn’t changed much with the design of the Galaxy Z Fold 3. But then, the Galaxy Z Fold 2 was pretty unique, so we’ll let it slide for now.",
    "The Galaxy Z Fold 3 is slightly smaller than its predecessor. Unfolded, it’s half-a-millimeter thinner at 6.4mm, and a whole millimetre shorter at 158.2mm.",
    "It’s also 11g lighter, though at 271g the Samsung Galaxy Z Fold 3 is still heavier than any mainstream non-foldable phone on the market today.",
    "Far more consequential than this marginal slimming down is the addition of an IPX8 rating. This means that the Galaxy Z Fold 3 will survive water immersion in a way the Fold 2 simply wouldn’t.",
    "It can theoretically be dunked up to 1.5 meters deep for up to 30 minutes, while the Galaxy Z Fold 2 has no water resistance rating. There still isn’t any form of dust resistance here, though, owing to those moving parts",
    "That said, the hinge system has been tightened up and improved for the Samsung Galaxy Z Fold 3. The materials are tougher and the tolerances are higher.",
    "While both main displays are coated in soft plastic, the Galaxy Z Fold 3 uses tougher materials, which enables the inclusion of S Pen compatibility - one of the big omissions from the Galaxy Z Fold 2.",
    "The external cover displays, incidentally, are coated in Gorilla Glass Victus in both devices. Talking of displays…",
    "Samsung hasn’t fiddled too much with the dual display of the Galaxy Z Fold 2, though there is one notable distinction that we’ll get to in a moment.",
    "In terms of the headline component, this is the exact same 7.6-inch 1768 x 2208 Foldable Dynamic AMOLED 2X display as before, complete with the same 120Hz refresh rate. It’s as big and vibrant as before, and similarly lacking in pixel definition to the tune of 373 pixels per inch.",
    "What has been improved is the secondary external cover display, which gets used much like a normal phone when the device is folded up. It’s a 6.2-inch AMOLED, much like the negligibly larger 6.23-inch Galaxy Z Fold 2, and the two phones pack near-identical resolutions too, at 832 x 2268 on the Z Fold 3, and 816 x 2260 on the Z Fold 2.",
    "But the Galaxy Z Fold 3's cover display gains a 120Hz refresh rate, bringing it in line with every other normal flagship Android phone on the market.",
    "As we’ve mentioned, the Galaxy Z Fold 3 also gains S Pen support for the first time in the range. There is a caveat here, in that only a special Fold-specific S Pen is usable, lest you scratch that soft display material.",
    "You’ll have to buy this separately, and it’s a shame that Samsung couldn’t find a way to house it within the Galaxy Z Fold 3’s body - especially given the news that the Galaxy Note series is no more. Still, we’re glad this feature is finally present, as Samsung’s stylus always seemed like a natural partner to the Fold.",
    "One of the downers with the Samsung Galaxy Z Fold 2 was that its cameras were merely good. When you’re paying the best part of $2,000 / £2,000 for a phone, you’d be forgiven for expecting the best of the best, and that simply wasn’t the case.",
    "The bad news is that the Galaxy Z Fold 3 camera system looks virtually identical. Once again, just like the Fold 2, you’re getting a humble-looking triple–12MP setup on the rear.",
    "So just to spell things out, that’s a 12MP f/1.8 main camera, a 12MP f/2.2 ultrawide camera, and a 12MP f/2.4 telephoto camera capable of a humble 2x optical zoom.",
    "If the Fold 2 is anything to go by, it’ll take perfectly respectable shots. But the Samsung Galaxy S21 Ultra it almost certainly ain’t.",
    "A far more interesting advancement has been made to the selfie camera on the main display. Gone is the Galaxy Z Fold 2’s forehead-mounted front camera, which served to enlarge those bezels. In its place is a novel in-display solution.",
    "It’s not entirely invisible, and you’ll notice a strange circular pixelated effect on the right-hand side of the inner screen when the screen is active. It's also a very humble 4MP f/1.8 camera unit (down from 10MP on the Galaxy Z Fold 2).",
    "But don’t forget that you can use the main camera for selfies using that cover display as a viewfinder, so a traditional selfie camera isn’t so important. And if you do want a conventional selfie snapper then you have that too on the cover screen, which on both phones has a 10MP one.",
    "We’re looking at a straight generational bump for the Samsung Galaxy Z Fold 3. It packs a Snapdragon 888 chipset, which is the direct successor to the Snapdragon 865 used by the Samsung Galaxy Z Fold 2.",
    "Both phones back their processors up with 12GB of RAM, which is plenty for any task.",
    "In both instances you also get a healthy 256GB of internal storage as standard. And while there are 512GB options for both, that larger model wasn't widely available for the Z Fold 2, but we’re expecting this capacity to be made available in US and UK markets with the Fold 3.",
    "There’s still no microSD card support, unfortunately. The inclusion of this would make a lot of sense in future if the Galaxy Z Fold series is meant to subsume the pro-leaning Galaxy Note.",
    "The Samsung Galaxy Z Fold 3’s battery has shrunk a smidgen since the Galaxy Z Fold 2, from 4,500mAh to 4,400mAh.",
    "Of course, the newer device also packs a more efficient processor, so we’re hopeful of similar stamina. Actually, scratch that - we’re hopeful of better.",
    "In testing the Galaxy Z Fold 2, we only ever managed to get through a full day when using the standard 60Hz refresh rate. Cranking the refresh rate up to 120Hz dropped us into the red rather too quickly for our liking.",
    "Bearing in mind that even the cover display of the Galaxy Z Fold 3 is running at 120Hz now, you’ll appreciate why we’re a little concerned about its battery life prospects. Here’s hoping Samsung has been working hard on optimization.",
    "The charging provision is identical to before, which equates to 25W wired and 11W wireless. Neither spec is remotely competitive with the very best on the market.",
    "It’s too early to say conclusively, but early signs suggest that the Samsung Galaxy Z Fold 3 is a worthwhile - if iterative - upgrade on the Samsung Galaxy Z Fold 2.",
    "Its design, while ostensibly similar, has been tightened and toughened. Performance has taken a generational step forward, and the external display has received the full 120Hz upgrade that we’d expect of a modern flagship phone.",
    "Meanwhile, it’s great to see S Pen finally taking its rightful place in the Fold family, albeit not quite as centrally as we would have liked. We’re glad to see that exorbitant price being reeled in a little, too.",
    "We have a few lingering concerns about battery life and the lack of meaningful camera improvements, but early signs suggest that overall progress has been made with the Galaxy Z Fold concept."
  ],
  "headers": {
    "3": "Samsung Galaxy Z Fold 3 vs Samsung Galaxy Z Fold 2 price and availability",
    "6": "Design",
    "14": "Display",
    "20": "Camera",
    "27": "Specs and performance",
    "31": "Battery",
    "36": "Takeaway"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review"
  }
}