{
  "source": "https://www.techradar.com/news/ipad-deals-every-ipad-air-4-color-is-on-sale-right-now-at-amazon",
  "title": "iPad deals: every iPad Air 4 color is on sale right now at Amazon",
  "category": "tablets",
  "updated": "2021-01-14T13:24:25Z",
  "author": "tabitha-baker",
  "summary": "A return to some of the lowest prices yet",
  "article": [
    "iPad Air 4 deals took the holiday sales period by storm last year, offering up fleeting discounts on the latest release and proving incredibly popular among those looking to upgrade their tablet. Back then you were fairly limited in your color choice, with only the Sky Blue and Green models seeming to hold onto their discounts.",
    "That's all changed with this latest round of iPad deals, however, as Amazon has just discounted its full range of iPad Air 4 models. You'll find the Rose Gold, Silver, Sky Blue, and Space Gray iPads available for $559 right now (was $599), with the Green model strangely sitting at a $10 premium - clocking in at $569.",
    "That's an excellent offer if you missed out on the last wave of iPad deals because your color of choice wasn't featured. We don't know how long this offer will stand, though, and we're willing to bet these are going to move off the shelves fairly quickly.",
    "Not in the US? You'll find more iPad deals available further down the page.",
    "The iPad Air is a perfect lightweight replacement for your laptop - especially seeing as you'll be able to find plenty of iPad Magic Keyboard deals and cheap Apple Pencil sales to use with it as well. However, if you want to explore some Windows options, take a look at the latest Surface Pro deals as well."
  ],
  "headers": {
    "4": "More iPad deals"
  },
  "links": {
    "$559 right now (was $599)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J62F1RH%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4817562727569932000-20",
    "clocking in at $569": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J6FD94H%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3984265548776773600-20",
    "iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "iPad Magic Keyboard deals": "https://www.techradar.com/deals/ipad-pro-cheap-magic-keyboard-price-deals-sales",
    "cheap Apple Pencil sales": "https://www.techradar.com/deals/the-best-cheap-apple-pencil-prices-sales-and-deals",
    "Surface Pro deals": "https://www.techradar.com/deals/surface-pro-deals-bundles"
  }
}