{
  "source": "https://www.techradar.com/news/heres-why-oculus-quest-2-didnt-happen-and-why-it-never-will",
  "title": "Here’s why Oculus Rift 2 didn’t happen – and why it never will",
  "category": "computing",
  "updated": "2021-04-06T11:57:40Z",
  "author": "hamish-hector",
  "summary": "Is PC-only Vr dead?",
  "article": [
    "With the news that Oculus Rift S headsets will no longer be restocked, Oculus VR founder Palmer Luckey has claimed that the Oculus Rift 2 was canceled not once, but twice before being shelved altogether. The Rift 2 was supposedly first canceled just before it went into production and then again to make way for the coolly-received Rift S.",
    "In a recent tweet, Luckey shared the news that the Rift S was being discontinued, calling it “a bummer.” He then explained what had happened to the Rift 2, whilst taking a shot at the “lower spec Lenovo rebadge” his former company made instead.",
    "The “much lower spec Lenovo rebadge” comment is a reference to the Oculus Rift S, which was built by Facebook in partnership with Lenovo. Luckey is implying that the Oculus Rift 2 would have been a much more significant upgrade over the original, though it’s impossible to tell how much better it would have been without seeing it in action. Something we may now never get to do.",
    "Unfortunately, we aren’t likely to see the Oculus Rift 2 anytime soon. When Facebook announced its plans to stop selling the Oculus Rift S it also announced that the headset would be its last PC-only VR headset.",
    "If you’re hoping those plans may change, we’re sorry to say that the move towards standalone VR headsets is already paying off. The Quest 2 has outsold every other Oculus headset combined and is also the most used PC VR headset using its optional Oculus Link cable functionality - ahead of the Rift S.",
    "For now, it looks like Facebook will be sticking to its plan, and reports suggest that the rumored Apple VR headset and Valve Index 2 could be following down the same path. We’ll have to wait and see to know for sure, but the days of PC-only VR could be numbered."
  ],
  "headers": {
    "3": "Will we ever see an Oculus Rift 2?"
  },
  "links": {
    "Oculus Rift S headsets will no longer be restocked": "https://www.techradar.com/news/goodbye-oculus-rift-s-we-wont-miss-you",
    "Oculus Rift 2": "https://www.techradar.com/news/oculus-rift-2-release-date-news-and-rumors",
    "Rift S": "https://www.techradar.com/reviews/oculus-rift-s-review",
    "tweet": "https://twitter.com/PalmerLuckey/status/1379260970090946562?s=20",
    "outsold every other Oculus headset combined": "https://www.techradar.com/news/oculus-quest-2-sales-figures-prove-vr-has-finally-gone-mainstream",
    "most used PC VR headset": "https://www.techradar.com/news/oculus-quest-2-is-now-pc-vrs-most-popular-virtual-reality-headset",
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "Valve Index 2": "https://www.techradar.com/news/valve-index-2-rumors-predictions-and-what-we-want-from-the-vr-headset"
  }
}