{
  "source": "https://www.techradar.com/news/google-pixel-phones-are-getting-another-round-of-feature-updates",
  "title": "Google Pixel phones are getting another round of feature updates",
  "category": "phones",
  "updated": "2021-12-06T18:00:17Z",
  "author": "david-nield",
  "summary": "Better Snapchat support, ultra-wideband and more",
  "article": [
    "Back when Google launched the Pixel 6 and the Pixel 6 Pro, we heard about a few features that were \"coming soon\" – and some of those features are now arriving in a software update, alongside other goodies for owners of Pixel phones.",
    "These feature drops have become a regular occurrence as Google attempts to give more people a reason to buy a Pixel phone rather than any other Android device – or an iPhone – and many of these updates don't just apply to the most recent models.",
    "For example, if you own a Pixel 4a 5G or later phone, you'll be able to use a new Quick Tap to Snap feature: a double-tap on the back of your handset launches Snapchat in its default camera mode, with no need to unlock the screen or open the Snapchat app first.",
    "Also with the feature update rolling out now, you've got the ability to adjust how the power button launches Google Assistant (Pixel 3 and newer), a bass slider to use with the Pixel Buds A-Series, and improved search for the Now Playing song recognition engine.",
    "If you own a Pixel 6 or a Pixel 6 Pro, you can now unlock your car digitally – if you own the right BMW model – and the Pro model gets ultra-wideband support for more accurate and reliable phone-to-phone sharing on the go.",
    "What's more, there are new wallpapers from disabled multidisciplinary artist Dana Kearly, and other features like car crash detection and the Recorder transcription utility are now available in more regions and with support for more languages.",
    "It's fair to say that Google's Pixel phones haven't all been runaway successes – far from it – but the tech giant does now seem to be making progress on both hardware and software fronts when it comes to making these devices as appealing as possible.",
    "On the hardware side, the Pixel 6 and the Pixel 6 Pro feature a distinctive new design, top-notch camera capabilities, and a high-quality fit and finish overall that has sometimes been lacking in previous Pixels. They actually look and feel like flagship devices, and Google's custom-made Tensor CPU means they perform very well too.",
    "On the software side, Google's own-brand phones have always been first in line for Android updates – a definite plus. On top of that they're now getting a host of really useful exclusive features, from the Now Playing tool that tells you instantly what you're listening to, to the voice transcription power of the Recorder app.",
    "All this means that you're getting something distinctly different from what you get from Samsung, OnePlus, Xiaomi or anyone else – although time will tell whether it's enough to convince significant numbers of people to make the jump across from the iPhone."
  ],
  "headers": {
    "3": "Features aplenty",
    "6": "Opinion: there are more reasons than ever to pick up a Pixel"
  },
  "links": {
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "feature drops": "https://www.techradar.com/news/google-pixel-phones-get-a-big-change-to-social-media-in-new-quarterly-feature-drop",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Pixel Buds A-Series": "https://www.techradar.com/reviews/google-pixel-buds-a-series-review",
    "the iPhone": "https://www.techradar.com/reviews/iphone-13"
  }
}