{
  "source": "https://www.techradar.com/news/e3-2021-microsoft-and-bethesda-confirmed-to-hold-a-joint-conference",
  "title": "E3 2021: Microsoft and Bethesda confirmed to hold a joint conference",
  "category": "gaming",
  "updated": "2021-05-21T09:55:40Z",
  "author": "vic-hood",
  "summary": "Will we learn more about Starfield and The Elder Scrolls 6?",
  "article": [
    "Microsoft has confirmed that it will hold a joint conference with the newly acquired Bethesda at E3 2021.",
    "In an interview with Le Figaro (via IGN), Xbox Game Studio head Matt Booty confirmed that a joint Microsoft/Bethesda conference will be held to, according to the publication, \"introduce players to their upcoming projects\". On Twitter, the article's author, Chloé Woitier, stated that this conference is due to take place \"in a few weeks\".",
    "The conference would therefore fall into the E3 2021 period, with the event running from June 12 to June 15, which Microsoft is confirmed to be attending.",
    "We already knew that Bethesda and Microsoft planned to hold some sort of conference this \"Summer\" (between June and September) following a \"Bethesda Joins Xbox\" roundtable on March 11.",
    "Microsoft acquired Bethesda's parent company ZeniMax Media earlier this year for an eye-watering $7.5 billion. Since then, there have been questions raised over whether this now means that upcoming Bethesda titles The Elder Scrolls 6 and Starfield - plus any future unconfirmed products - with be Xbox and PC exclusives, with PS5 players missing out.",
    "While Microsoft seems to have confirmed that future Bethesda titles will be Microsoft exclusives, with Phil Spencer stating that these games will be exclusive to \"platforms where Game Pass exists\", neither Microsoft nor Bethesda has explicitly confirmed that The Elder Scrolls 6 or Starfield will not come to PlayStation.",
    "We're hoping that this E3 conference will give us updates on both these highly-anticipated upcoming titles but also confirm once and for all which platforms we can expect them on."
  ],
  "headers": {
    "3": "What do we expect to see?"
  },
  "links": {
    "Le Figaro": "https://www.lefigaro.fr/secteur/high-tech/jeux-video-microsoft-savoure-son-mariage-avec-bethesda-20210519",
    "IGN": "https://www.ign.com/articles/bethesdas-e3-2021-conference-will-be-connected-to-microsofts-e3-conference?utm_source=twitter",
    "Twitter": "https://twitter.com/W_Chloe/status/1395318271038087171",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Bethesda Joins Xbox\" roundtable": "https://youtu.be/YJneU_qBMPM",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "confirmed": "https://www.techradar.com/news/ps5-players-wont-get-future-bethesda-games"
  }
}