{
  "source": "https://www.techradar.com/news/chiara-ferragni-has-designed-a-new-nespresso-coffee-maker-we-just-wish-we-could-change-one-thing",
  "title": "Chiara Ferragni has designed a new Nespresso coffee maker, we just wish we could change one thing",
  "category": "appliances",
  "updated": "2021-05-25T10:53:12Z",
  "author": "sophie-bird",
  "summary": "Fans of the entrepreneur have a new way to enjoy her designs",
  "article": [
    "The best coffee makers ensure you can make the perfect latte, cappuccino, or espresso in the comfort of your home. They usually come in fairly muted colors such as stainless steel or black, but if you’ve been craving a brighter, bolder-looking machine, now’s your chance.",
    "Nespresso has revealed its new line with entrepreneur and social media mogul, Chiara Ferragni. The exclusive range, which will include a Nespresso x Chiara Ferragni Essenza Mini coffee maker, a signature Aeroccino 3 for frothing milk, a coffee mug, as well as a travel mug, comes in pastel colors and playful patterns, and will be available from Nespresso.com on May 28.",
    "The collection will feature Chiara Ferragni’s signature designs from her clothing and lifestyle brand while shining the light on a hugely successful business woman - something which Nespresso hopes will enforce female empowerment.",
    "With a huge 23.6 million followers on Instagram alone, Chiara Ferragni founded her own brand which features a now iconic eye logo design and the collaboration with Nespresso makes a refreshing change from male brand representatives including George Clooney.",
    "The new Nespresso coffee maker collection will also be accompanied by exclusive events for coffee fans and there’ll be a series of recipes to celebrate the launch too.",
    "Speaking about the collaboration with Nespresso, Chiara Ferragni said: “Nespresso really represents a contemporary way of living with its practical and smart approach to high quality coffee.",
    "“When I first met the brand, they introduced me to a lot of initiatives regarding sustainability and recycling, that I deeply want to be a part of.”",
    "The collaboration from Nespresso and Chiara Ferragni includes the Essenza Mini coffee maker with a pastel pink design and Chiara’s eye print that you find across her brand. There’s also an Aeroccino 3 milk frother so you can enjoy milk-based drinks with minimal effort. For coffee at home and on the go, the collection is completed by a glass mug and a travel mug.",
    "Selection boutiques will be stocking the collection but it will be available more readily online. Prices for the collection have not yet been revealed.",
    "Teaming up with other brands is nothing new for Chiara Ferragni as she’s a key figure in the fashion world and has been listed in the Forbes list of “30 influential people under 30”.",
    "It’s also a nice change to see a woman not only collaborating with Nespresso in the way that George Clooney and Natalie Dormer did, but at the forefront of creating a new range using elements from the Chiara Ferragni hugely established brand.",
    "It could all come down to personal taste but it’s somewhat a shame that the Chiara Ferragni collection is all pastel pink - possibly one of the stereotypically ‘girly’ colors out there - but then again this is the signature color palette of the Chiara Ferragni brand. We would have loved to see some of the other colors from Chiara’s designs used as the main shade in this collection but we'll definitely welcome Nespresso mixing it up with something new. Hopefully, there's more to come."
  ],
  "headers": {
    "7": "Nespresso x Chiara Ferragni collection",
    "9": "Analysis: Is it really about female empowerment?"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "Nespresso.com": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6846795240989915000&xs=1&url=https%3A%2F%2Fwww.nespresso.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fchiara-ferragni-has-designed-a-new-nespresso-coffee-maker-we-just-wish-we-could-change-one-thing"
  }
}