{
  "source": "https://www.techradar.com/news/how-tcl-is-helping-drive-industry-adoption-of-5g",
  "title": "How TCL is helping drive industry adoption of 5G",
  "category": "phones",
  "updated": "",
  "author": "sponsored",
  "summary": "New technology made affordable",
  "article": [
    "We’ve all been hearing about 5G the past couple years. The terms get thrown around, and it doesn’t always mean the same thing. For most of us, 5G comes down to the cellular technology our mobile carriers are offering. The major carriers are rolling out their 5G networks, making them faster and more extensive at the same time. But, for many of us, that 5G network hasn’t been the most accessible because the phone’s that can connect to it have been exorbitantly expensive. That’s all changing with the latest wave of affordable smartphones, and the new TCL 10 5G UW is pushing in a big way.",
    "TCL may not have the most brand recognition in the smartphone market. After all, isn’t it a TV manufacturer? It’s true that TCL makes TV, but it’s a manufacturing chops go well beyond TVs.",
    "This may be the first you’re hearing of TCL smartphones, but you’ve actually probably come across more than a few phones made by the company. Since even before the launch of the iPhone, TCL had been working on phones under the Alcatel brand, and it continued launching budget-friendly Alcatel phones ever since.",
    "More recently, it even developed phones under the Palm (of Palm Pilot fame) brand as well as the BlackBerry KeyOne and Key2. There’s plenty of history for TCL in smartphones, and its latest venture may help commoditize 5G networking.",
    "The TCL 10 5G UW isn’t just any smartphone. At $399, it’s one of the most affordable 5G smartphones you’ll find right now. This low price makes it an easy entryway for users to get onto the new 5G networks, and as more users make the transition, the major carriers will have further incentive to continue expanding their coverage. The phone is also an attractive offering for the price, as it packs a large display with some of TCL’s TV expertise baked in as well as powerful internals you won’t find in many other devices at this price.",
    "Where the TCL 10 5G UW really shakes things up is in the 5G networks it supports. The few budget 5G phones on the market now all tend to support Sub6 5G, which is a fast and more broadly available form of 5G. But, the TCL 10 5G UW goes further, offering both Sub6 and Ultra-Wideband 5G support. The latter is a technology that really lets a 5G connection flaunt, as it can readily see connection speeds over 1Gbps.",
    "By bringing a complete 5G experience to such a low price point, TCL is helping to make the new technology accessible to more people. And the TCL 10 5G UW is just the start. TCL has even more devices in store, including the TLC 20 5G and even a 5G tablet.",
    "For all the latest, be sure to check TCL’s mobile products here."
  ],
  "headers": {},
  "links": {
    "history for TCL in smartphones": "https://www.techradar.com/news/a-history-of-tcls-entry-into-smartphones",
    "TCL has even more devices in store": "https://www.techradar.com/news/tcls-ces-2021-lineup-includes-the-cheapest-5g-phone-yet",
    "check TCL’s mobile products here": "https://www.tcl.com/us/en/products/mobile"
  }
}