{
  "source": "https://www.techradar.com/news/new-starfield-videos-give-a-glimpse-of-three-locations-from-the-game",
  "title": "New Starfield videos give a glimpse of three locations from the game",
  "category": "gaming",
  "updated": "2021-08-28T10:59:23Z",
  "author": "emma-boyle",
  "summary": "Start your travel itinerary",
  "article": [
    "Bethesda has revealed three of the cities that will feature in Starfield in a trio of brief new videos.",
    "Originally shared with fans who signed up to Starfield's Constellation Program updates, the videos were then posted by the official Starfield Twitter account and now you can watch them below.",
    "The videos don't show what the locations look like in-game – instead they give us a look at concept art for each location (first glimpsed in \"Into the Starfield\") with narration from design director Emil Pagliarulo offering greater insight into their stories. Though each video is only around 50 seconds long, you still get a pretty good sense of the intended vibe for the places.",
    "The first of the three cities is New Atlantis, capital of the United Colonies, the most powerful political and military faction in the game. New Atlantis is described by Pagliarulo as “a true melting pot and its residents come from every race, creed, and ethnicity. In a lot of ways, New Atlantis is a true reflection of the future of our world.“",
    "The second city, Akila, is a little less built-up than New Atlantis. It’s the capital of the Freestar Collective, a loose confederation of three star systems. While the people who live there are all different, they share a belief in “the sanctity of personal freedom and individuality”. The city is walled and outside the walls, Pagliarulo says, dangerous aliens that are “a cross between a wolf and a velociraptor” roam. We don’t get a look at any concept art of what these aliens will look like but that’s a description that gets the imagination going.",
    "Finally, there’s Neon, a pleasure city built by a corporation on an aquatic world. Originally intended to be a fishing platform, the corporation quickly discovered that some of the fish had psychotropic properties and realised “they could make way more money selling a drug than they could fish.” That drug is Aurora, legal only on Neon, and it’s a pretty big draw for people who visit the city.",
    "The three cities shown by Bethesda in these videos are very different from each other but they do strike you as exactly the kinds of locations you’d expect (and want) to encounter in an open world space RPG.",
    "These videos don't show footage or images from Starfield itself, though, and concept art, as gorgeous as it is, is no guarantee of what we’ll eventually explore in the game. As such, it’s hard to say anything solid about what Starfield is going to be based on them. We’ve not seen much of the game yet, after all.",
    "However, these videos do serve to give an insight into Bethesda's ambitions for Starfield's world and they go some way to helping fire up our imagination with regards to what Starfield could be. Hopefully, that's a world with distinct, beautiful locations that are exciting to explore. If Neon looks half as pretty as it does in its art, we'd like to visit.",
    "So, while these short clips don't give a lot away about Starfield overall, they do have us looking forward to learning more and seeing footage from the game itself when it's ready to be shown.",
    "There’s still plenty of time for all of that, though – Starfield’s release date is slated for November 11 2022, more than a year away. When it does launch you’ll be able to play it on PC and Xbox Series X, with a day one Xbox Game Pass release."
  ],
  "headers": {
    "6": "Analysis: Imagination fuel"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Starfield Twitter account": "https://twitter.com/StarfieldGame",
    "first glimpsed in \"Into the Starfield\"": "https://www.youtube.com/watch?v=Wun9up_M87E&t=56s",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}