{
  "source": "https://www.techradar.com/news/brave-and-unstoppable-domains-join-forces-to-allow-users-to-access-the-decentralized-web",
  "title": "Brave and Unstoppable Domains join forces to allow users to access the decentralized web",
  "category": "computing",
  "updated": "2021-05-15T01:59:56Z",
  "author": "anthony-spadafora",
  "summary": "Brave users can now visit .crypto domains and other decentralized websites",
  "article": [
    "Brave users will now be able to access the decentralized web on desktop and Android as the company behind the privacy-oriented browser has joined forced with the blockchain domain name provider Unstoppable Domains.",
    "After updating to the latest version, the browser's users will have access to 30,000 decentralized websites and 700,000 blockchain domain names registered with Unstoppable Domains.",
    "Co-founder and CTO of Brave, Brian Bondy provided further insight on the new partnership between the two companies in a press release, saying:",
    "“We are excited to work with Unstoppable Domains to enable decentralized DNS to a wider audience. At Brave, we see Web3 as a stepping stone to the future of digital ownership and decentralization. Unstoppable Domains was a natural fit for us, giving our users access to the decentralized web with the ability to visit any .crypto domain name. From registering .crypto domains to hosting an NFT art gallery, to sending and receiving crypto, the possibilities are limitless for Brave users.”",
    "First launched in 2018, Unstoppable Domains is a domain registrar that provides users with .crypto and other top-level domain names with no renewal fees.",
    "When a domain is claimed, it is then minted as an NFT on the Ethereum blockchain which grants users full ownership and control over it. These .crypto domains can then point to content hosted on the web, IPFS or even to cryptocurrency addresses which makes it even easier to send and receive over 70 different cryptocurrencies across more than 40 cryptocurrency wallets and exchanges.",
    "By integrating with Unstoppable Domains, Brave is supporting a decentralized network that its not part of the traditional Domain Name Service (DNS) that has increasingly become susceptible to hijacking, denial-of-service attacks and phishing.",
    "Brave isn't the first browser to integrate with Unstoppable Domains though as Chromium-based Opera recently added support for decentralized websites and .crypto domains just last month. Hopefully we'll soon see other browser makers follow Opera and Brave's lead when it comes to supporting the decentralized web."
  ],
  "headers": {
    "4": "Crypto domains"
  },
  "links": {
    "Brave": "https://www.techradar.com/reviews/brave-web-browser",
    "browser": "https://www.techradar.com/best/browser",
    "Unstoppable Domains": "https://www.techradar.com/news/youll-soon-be-able-to-access-blockchain-domains-using-any-web-browser",
    "press release": "https://brave.com/unstoppable-domains/",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "NFT": "https://www.techradar.com/news/what-is-an-nft-non-fungible-tokens-explained-and-why-you-shouldnt-dismiss-this-fad",
    "cryptocurrencies": "https://www.techradar.com/best/mining-rigs",
    "cryptocurrency wallets": "https://www.techradar.com/news/best-bitcoin-wallets",
    "exchanges": "https://www.techradar.com/best/mining-rigs",
    "Opera": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/opera-35924/review/news/opera-upgrades-user-access-to-decentralized-web-via-unstoppable-domains"
  }
}