{
  "source": "https://www.techradar.com/news/how-to-watch-schmigadoon-online-stream-the-new-apple-tv-plus-series",
  "title": "How to watch Schmigadoon! online: stream the new Apple TV Plus series",
  "category": "computing",
  "updated": "2021-07-16T05:03:40Z",
  "author": "daniel-pateman",
  "summary": "An eclectic cast light up this jubilant musical comedy",
  "article": [
    "Schmigadoon! is the word tripping off our tongues right now, the title of a new 6-part musical parody on Apple TV Plus. Starring Keegan-Michael Key and long-time SNL cast member Cecily Strong, it’s an affectionate throwback to the Golden Age of musical theatre, given a modern twist and featuring an excellent ensemble of comedy actors. Below we’ll explain how to watch Schmigadoon online now when you subscribe to Apple TV Plus.",
    "Loosely based on the 1947 musical Brigadoon, writing duo Cinco Paul and Ken Daurio have adapted the original’s premise about two American tourists encountering an enchanted Scottish village, focusing instead on bickering couple Melissa (Strong) and Josh (Key).",
    "On a backpacking trip designed to salvage their relationship, they stumble upon a magical town called Schmigadoon. This pastoral locale and its provincial inhabitants – ready to form a chorus line at every opportunity – are torn straight from the pages of a Rodgers and Hammerstein musical, and the confounded couple find themselves trapped in this high-kicking hellscape, unable to leave until they’ve found true love.",
    "Directed by Barry Sonnenfeld (The Adams Family, Men in Black) and executive produced by Lorne Michaels (30 Rock), Schmigadoon! combines the epic romance of Broadway musicals like Carousel with an ironic, modern sensibility. It’s populated by a talented crop of actors too, including Portlandia’s Fred Armisen, Kristin Chenoweth, Tony award-nominee Ariana DeBose, and Aaron Tveit as bad-boy Danny Bailey (Les Misérables), in addition to guest appearances from Martin Short and the brilliantly funny Jane Krakowski.",
    "So, get ready to croon along to some show tunes as we break down how to watch Schmigadoon! online from anywhere now.",
    "While Apple's answer to Netflix has a comparatively tiny library of films and shows to get stuck into – 60 and counting – what's available is top-notch, well-produced fare with little in the way of filler.",
    "The service's launch calling card was The Morning Show, a drama starring Jennifer Aniston, Reese Witherspoon, and Steve Carell, which was complemented by See - an epic sci-fi drama starring Jason Momoa and Alfre Woodard, as well as M. Night Shyamalan’s horror series, Servant.",
    "The service's surprise big breakout show so far has been the Jason Sudeikis comedy Ted Lasso, which follows an American football coach hired to coach a Premier League football team, which has earned an army of fans and a sizeable amount of gongs during this year's awards season.",
    "The small but great library is set to grow at a steady pace - alongside incoming second seasons of Ted Lasso and The Morning Show, Apple TV Plus looks to have a pretty strong-looking upcoming schedule of new exclusive content.",
    "The Martin Scorsese-directed Killers of the Flower Moon, promises a 'large-scale Western' that stars big guns Leonardo DiCaprio and Robert De Niro.",
    "The Shrink Next Door, meanwhile, is a new comedy series based on the 2019 podcast of the same name, that is set to bring together Will Ferrell and Paul Rudd, while Foundation is a much-anticipated sci-fi series based on the books by Isaac Asimov, and starring Chernobyl's Jared Harris and Lee Pace.",
    "Read more:"
  ],
  "headers": {
    "5": "What else should I know about Apple TV Plus?"
  },
  "links": {
    "Apple TV Plus": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1201659121791028200&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fapple-tv-plus%2F",
    "The Morning Show": "https://www.techradar.com/news/season-2-of-apple-tv-plus-flagship-show-finally-has-a-release-date",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know"
  }
}