{
  "source": "https://www.techradar.com/news/samsung-s21-accessories",
  "title": "Samsung Galaxy S21 accessories: what comes in the box, and what doesn't",
  "category": "phones",
  "updated": "2021-12-03T07:40:20Z",
  "author": "tom-bedford",
  "summary": "You might need to buy some things",
  "article": [
    "The Samsung Galaxy S21 phones are the same as the iPhone 12 and Xiaomi Mi 11 in that they don't have a number of the accessories that come inside a normal phone box, so if you buy one of the handsets, you might find yourself needing a few extras too.",
    "People opening up their brand-new Samsung Galaxy S21 boxes might find multiple items missing they would have found with the Galaxy S20 handsets, for example, and all three of its 2021 flagships are affected, so the Galaxy S21 Plus and Galaxy S21 Ultra are no exception. You won't find the box barren though, and a few items remain.",
    "The apparent reason for the Samsung Galaxy S21 missing these accessories is to cut down on e-waste, which makes sense for some of the things - most people opt to buy their own headphones rather than stick to the inferior in-box ones, as an example.",
    "Unless you've been studiously following the Samsung Galaxy S21 accessory news, though, you might not be totally up on what's in the box, so we'll run you through what you'll get, and what you'll need to source separately.",
    "The following things come in your Samsung Galaxy S21 box. Obviously we're not counting the documentation and SIM removal tool here.",
    "Naturally, the main thing in the Samsung Galaxy S21 box is the phone itself (or the Plus or Ultra, depending on which you opted for). We're sure this isn't a surprise to you.",
    "Other than the phone, the only main thing in your Samsung Galaxy S21 is a USB-C to USB-C cable, which can plug into the bottom of the phone in one end, and certain other outlets in the other.",
    "It's worth pointing out USB-C isn't the 'standard' rectangle USB port you might be used to, so this end can't plug into some computers that only have that kind of input.",
    "Some devices have USB-C ports, including many modern laptops and computers, and if you've bought a device with a charging block in the last few years, it's very possible this accepts USB-C output too.",
    "The following items don't come with the Samsung Galaxy S21, but we'd recommend buying them if you don't already own them, to improve your experience.",
    "The Samsung Galaxy S21 doesn't come with an in-box wall plug, so you can't plug the thing straight into a wall.",
    "You might already own one of these, from a previous mobile or another gadget completely, and if you do, you don't need another one. However, remember you need one that accepts USB-C, which is oval-shaped, not USB-A, which is rectangular.",
    "If you don't have a wall charger that'll work, you can easily buy one from the Samsung website here, but that's a touch pricey compared to the many Amazon USB-C wall chargers.",
    "Previous Samsung Galaxy S phones have come with AKG-tuned wired earbuds, but that's not the case with the S21 phones. These are phones without 3.5mm headphone jacks too, so you can't just plug in your aging buds to listen to music.",
    "Sure, if you've got headphones with a USB-C jack you're sorted, but they're pretty rare. If you own, or want to buy, a 3.5mm to USB-C adaptor, you could use them along with existing wired buds. If you would prefer to use wired headphones, which many people do, you can check out USB-C headphones on Amazon, or USB-C to 3.5mm adaptors for your existing and beloved headphones.",
    "But Samsung's probably hoping you buy some true wireless earbuds, particularly its own. Alongside the Samsung Galaxy S21 phones, the company unveiled the Samsung Galaxy Buds Pro, its new buds for portable audio. The company already has the Galaxy Buds Live, Galaxy Buds Plus and original Galaxy Buds, so you've got lots of options when it comes to wireless earbuds.",
    "If those aren't to your taste, there are loads of other options on the market, and you can see some below.",
    "While the following items aren't pivotal to your Samsung Galaxy S21 experience, you might like to pick them up to improve your time with the phone.",
    "Wireless charging is the future, with more and more phones offering the wire-free powering option, and the Samsung Galaxy S21 phones are no different.",
    "If you head on over to its official website, you'll find Samsung sells loads of wireless chargers of different shapes and sizes. Some of these are standing ones, others are to lay your phone flat, and some work with multiple devices at once (including the Galaxy Buds or a Galaxy Watch if you own them).",
    "You can also check out our list of the best wireless chargers to find other options. Samsung isn't the only company that sells wireless chargers of course, and you can find loads of cheap options on Amazon too.",
    "If you're really tech-savvy you probably already own a smartwatch, but if you don't already own one (or want a new one), you'll find it'll help you make the most of your new Samsung Galaxy S21. Smartwatches can show you notifications, manage your music, and track exercise and health activities.",
    "Samsung makes its own smartwatches, most recently the Galaxy Watch 3, but there are other options too which you can check out in our round-up of the best Samsung watches",
    "Alternatively, you could buy from another company - Fitbit's devices are great for social exercising and fit with a wide ecosystem of products, Garmin makes smartwatches designed for fitness fans, and Samsung's Galaxy Watch devices usually dominate our list of the best smartwatches.",
    "If you opted for the Samsung Galaxy S21 Ultra, there's one other accessory we should point out to you:",
    "The Samsung Galaxy S21 Ultra is compatible with the company's S Pen stylus, used for note-taking and sketching, as well as the S Pen Pro, which isn't out just yet.",
    "If you already have an S Pen from another device that comes with it, like a Samsung Galaxy Note phone or a Galaxy Tab slate, you won't need to buy a new S Pen, because older styli are actually compatible with the new smartphone.",
    "If you don't own one, though, you might want to shell out for one to be able to make the most of your new super-phone. You can find them at Samsung's website here."
  ],
  "headers": {
    "4": "What comes in the box:",
    "5": "Samsung Galaxy S21 phone",
    "6": "USB-C to USB-C cable",
    "9": "What you need to buy:",
    "10": "Samsung Galaxy S21 wall charger",
    "13": "A new pair of headphones",
    "17": "What you could also buy:",
    "18": "Samsung Galaxy S21 wireless charger",
    "21": "A Samsung smartwatch",
    "24": "Samsung Galaxy S21 Ultra extras",
    "25": "Samsung Galaxy S21 S Pen"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung website here": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5924873798522986000&xs=1&url=https%3A%2F%2Fwww.samsung.com%2Fmobile-accessories%2Fall-mobile-accessories%2F%3Fsmartphones%2Badapters-and-cables&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-s21-accessories",
    "Amazon USB-C wall chargers": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dusb-c%2Bwall%2Bcharger%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1020501853726649900-20",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "USB-C headphones on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dusb-c%2Bheadphones%26ref%3Dnb_sb_noss_2%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3695444448124363300-20",
    "USB-C to 3.5mm adaptors": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dusb-c%2Bto%2B3.5mm%2Badaptor%26ref%3Dnb_sb_noss_2%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1264250513624105500-20",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Samsung sells loads of wireless chargers": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1455231742623138300&xs=1&url=https%3A%2F%2Fwww.samsung.com%2Fmobile-accessories%2Fall-mobile-accessories%2F%3Fsmartphones%2Bwireless-chargers&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-s21-accessories",
    "best wireless chargers": "https://www.techradar.com/best/best-wireless-chargers",
    "cheap options on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dwireless%2Bcharger%26ref%3Dnb_sb_noss_1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1277851032303093000-20",
    "Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "best Samsung watches": "https://www.techradar.com/news/best-samsung-smartwatch-finding-the-right-tizen-wearable-for-you",
    "Samsung's website here": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-6728774528477182000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fmobile%2Fmobile-accessories%2Fphones%2Fgalaxy-s21-ultra-5g-s-pen-ej-pg998bbegus%2F&article_name=Samsung%20Galaxy%20S21%20accessories%3A%20what%20comes%20in%20the%20box%2C%20and%20what%20doesn't&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-s21-accessories"
  }
}