{
  "source": "https://www.techradar.com/news/new-south-park-movies-and-episodes-are-now-at-the-heart-of-the-streaming-wars",
  "title": "New South Park movies and episodes are now at the heart of the streaming wars",
  "category": "entertainment",
  "updated": "2021-08-06T10:09:05Z",
  "author": "samuel-roberts",
  "summary": "Why South Park is still worth big money",
  "article": [
    "South Park creators Trey Parker and Matt Stone have signed a mega deal with ViacomCBS in the US for an eye-watering $900 million. As part of it, the animated sitcom has been renewed up until its 30th season – with season 25 set to release in 2022. But more interesting is the idea that 14 South Park spin-off movies are being made for the US streaming service Paramount Plus, apparently introducing new ideas and characters.",
    "Since it's an old show with a big audience, it's no surprise that South Park is worth a hell of a lot of money to streaming services. But this move is a slightly strange one, in a sense – in the US, HBO Max already has the exclusive streaming rights to South Park, and gets new episodes the day after they air on Comedy Central. That deal, made in 2019, was set to cover the next three seasons of the show. South Park hasn't aired a full season since then – but has released two specials in the meantime.",
    "The Paramount Plus deal, then, seems like a canny move to get new South Park content on a competing streaming service by the company that actually produces the show. So, US fans will need to have both HBO Max and Paramount Plus to have complete access to South Park over the coming years.",
    "That's potentially annoying for diehard South Park fans, but it's also arguably a net gain. You get all the South Park episodes you would've had anyway, but you've now also got plenty of movies to look forward to – if you're a bit mercenary about it, you could just subscribe to Paramount Plus, watch one of these South Park movies then unsubscribe again. Two will release per year, which should be simple enough to keep up with.",
    "That would probably be considered a win by the streamer. The point, as ever, is getting people into the ecosystem of a streaming service – that's why the content swings are so big.",
    "\"We did a ‘South Park’ movie in 1999, and we’ve never done another one because the show has been so satisfying,” Matt Stone said, as quoted by Bloomberg. \"Now we’re older, and the idea of what streaming movies can be is pretty promising.\"",
    "South Park's first movie, Bigger, Longer & Uncut, launched all the way back in 1999. More movies have been considered over the years, but never came to fruition – 2007's three-part 'Imaginationland' episode started life as a potential movie idea.",
    "South Park's appeal is evergreen, but it's only recently that its real value as a library of episodes has actually become apparent. Hulu's first deal to license South Park was a lean $87.5 million, with a follow-up that was worth $110 million.",
    "Then, with the streaming wars hotting up in 2018, HBO Max put up a mighty $500 million offer for a five-year deal just for this show.",
    "Why the escalation? Well, it's a sellers' market for content right now. But South Park's enduring popularity as an older show with a large number of episodes makes it valuable. Friends, for example, sold to HBO Max for $425 million back in 2019. The Office went to Peacock in the US for $500 million in the same year. Both were enormously successful on Netflix in the US, and had established they still have massive value years after they went off-air.",
    "South Park, meanwhile, has never stopped releasing new episodes since 1997. It has the unusual distinction of being a popular show from an age where we mostly watched the same TV – which is exactly why Friends has remained so valuable – while also being an ongoing animated series with no reason to stop. Much like The Simpsons, too, it's binge-friendly, with more than 300 episodes that only run for 20 minutes each. They're perfect for streaming.",
    "That, then, is why companies are still betting on Parker and Stone decades later – and unlike some long-running series, the quality of South Park has never truly, permanently declined. Instead, some seasons or episodes are just better than others.",
    "The first South Park movie will arrive this year on Paramount Plus, and apparently forms part one of a two-part story. It's unclear how the movies will roll out internationally – but Sky just made a deal with Paramount Plus to partner up on a launch in Europe in 2022, so this new content will hopefully be accessible to UK subscribers.",
    "Better yet, Parker and Stone also get to make new, non-South Park projects as part of the deal, according to THR – so for those who loved Team America: World Police or The Book of Mormon and maybe don't care about South Park, that seems promising."
  ],
  "headers": {
    "7": "Why is South Park suddenly so important to streamers?"
  },
  "links": {
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-05/south-park-creators-sign-900-million-deal-for-more-episodes-movies?cmpid=socialflow-twitter-business&utm_content=business&utm_medium=social&utm_campaign=socialflow-organic&utm_source=twitter",
    "THR": "https://www.hollywoodreporter.com/movies/movie-news/14-south-park-films-parker-stone-deal-1234993150/"
  }
}