{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-may-not-land-at-unpacked-2021-after-all",
  "title": "Samsung Galaxy S21 FE may not land at Unpacked 2021 after all",
  "category": "phones",
  "updated": "2021-10-20T08:40:30Z",
  "author": "jitendra-soni",
  "summary": "It might launch later this year",
  "article": [
    "Samsung has recently revealed the date of 2021’s Galaxy Unpacked event and while the event teaser made it obvious that a couple of foldable phones are coming, one of the other expected phones may not appear.",
    "Previous leaks had suggested the Samsung Galaxy F21 FE would be on the list of devices launching at Unpacked 2021, but a new rumor suggests it won't be appearing after all.",
    "A report at LetsGoDigital includes a leaked list of devices that Samsung will announce on August 11. According to the publication, the Galaxy S21 FE isn't included on this list.",
    "The list of devices does include foldable phones like the Samsung Galaxy Z Fold 3, and Galaxy Z Flip 3. There are also a couple of smartwatches - Galaxy Watch 4 and the Galaxy Watch 4 Classic - and the Galaxy Buds 2.",
    "Talking about the Galaxy S21 FE, the affordable flagship device is now expected to launch at a later date, probably in October sandwiched between this August 11 launch event and the 2022 iteration of the Galaxy S lineup.",
    "Contrary to a few previous reports that suggested the Galaxy S21 FE had been delayed due to the ongoing chipset shortage, Samsung denied that it has not been forced to defer any device for this reason.",
    "The company in a written statement to Bloomberg said, “While we cannot discuss details of the unreleased product, nothing has been determined regarding the alleged production suspension.”",
    "This suggests that the device is still in the works, and it may mean that the company already has a launch event scheduled.",
    "Samsung has heavily hinted that there won't be a Samsung Galaxy Note 21 this year due to the ongoing chipset shortage. It's thought the company wants users to graduate to the foldable phones instead, so it may want to give its foldable phones all the attention on August 11 and introduce the S21 FE at a later date."
  ],
  "headers": {
    "5": "Chipset shortage may not be the reason though"
  },
  "links": {
    "Galaxy Unpacked": "https://www.techradar.com/news/rip-galaxy-note-21-samsung-galaxy-z-fold-3-to-launch-in-august-hints-unpacked-invite",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy F21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fe-render-shows-off-the-phone-from-every-angle",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/galaxy-s21-fe/",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/news/samsung-galaxy-fold-3-and-flip-3-may-be-thoroughly-waterproof",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-06-13/samsung-halts-production-of-new-phone-on-chip-shortage-et-says",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21"
  }
}