{
  "source": "https://www.techradar.com/news/the-intel-core-i5-11400-may-beat-the-10th-gen-flagship",
  "title": "The Intel Core i5-11400 may beat the 10th-gen flagship",
  "category": "computing",
  "updated": "2021-02-22T19:19:08Z",
  "author": "john-loeffler",
  "summary": "Rocket Lake-S is coming in hot",
  "article": [
    "Recently flagged benchmarks online appear to show that Intel's upcoming 11th generation Core i5-11400 CPU has better single core performance than all of the company's 10th generation CPUs, a remarkable feat considering the i5-11400 is the 11th generation's entry level CPU.",
    "The benchmarks, found in the Geekbench database, show Intel's upcoming entry-level 11th generation processor beating out the fastest Intel CPU from the previous generation in terms of single-core performance by roughly 200 points, with one outlier beating it by nearly 1,000.",
    "Its multicore performance falls well short of the Core i9-10900K, however. That isn't too surprising though, given the 10900K is a 10-core, 20-thread CPU while the 11400 is a six-core, 12-thread processor. Still, that one outlier does manage to crack 10,000, putting up a good chase against the 11,000-plus multicore scores of the 10900K.",
    "This still falls short of the AMD Ryzen 5 5600X, as PCGamesN notes, which is AMD's cheapest offering among the competing 5000-series processors. Still, Intel's budget 11th-generation CPU is quite impressive, so we're looking forward to seeing what the rest of the lineup has to offer as we get closer to their release in the next few weeks.",
    "It's an understatement to say Intel would really like some good news on the desktop CPU front. After losing out on desktop CPU marketshare to AMD earlier this year and running into production issues that pushed back their 7nm processors by a few years, Team Blue definitely looked like it has been roughed up a bit.",
    "Intel is definitely hoping to turn things around a bit with Rocket Lake-S and, later this year, Alder Lake, Intel's big.LITTLE processor design similar to Arm chips. Alder Lake uses a mix of efficiency and performance cores in the same way that the Apple M1 chip does and which looks rather promising – especially since Intel is ahead of AMD on this front. Whether that leads them to claw back some of its losses from AMD remains to be seen, however."
  ],
  "headers": {
    "4": "Intel pushing hard to knock AMD down a peg"
  },
  "links": {
    "Geekbench database": "https://browser.geekbench.com/v5/cpu/search?q=i5-11400",
    "PCGamesN": "https://www.pcgamesn.com/intel/i5-11400-benchmarks-leak",
    "CPU marketshare": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip"
  }
}