{
  "source": "https://www.techradar.com/news/nasty-windows-10-defender-bug-could-clog-up-your-pc-heres-how-to-fix-it",
  "title": "Nasty Windows 10 Defender bug could clog up your PC - here's how to fix it",
  "category": "computing",
  "updated": "2021-05-06T09:42:29Z",
  "author": "daryl-baxter",
  "summary": "No one likes a full hard drive",
  "article": [
    "After a bug from Microsoft’s anti-virus application for Windows 10 caused thousands of files to fill up space on many hard drives, there has now been a fix to alleviate this anxiety-induced incident.",
    "Microsoft’s Defender software has had its ups and downs since its debut in 2008, originally appearing to help the once-lacklustre security of Windows XP. In recent years though, it’s become a much stronger contender in scanning your PC for any unwanted spyware and viruses.",
    "However, this recent bug will do no favors to new users looking for anti-virus software, but now that there’s a fix and hard drives are claiming back space, it will hopefully be quickly forgotten.",
    "Recently, issues were reported on forums and Reddit, detailing users’ plight on thousands of files appearing out of nowhere. These would eventually appear so much that users would have next to no space on their main hard drives.",
    "Users would try to delete the files as fast as they appeared, but they would duplicate over a short period of time, rendering their PC unusable due to there being no space on the hard drive.",
    "These files would appear in the ‘Windows Defender’ folder, found in the ‘Program Data’ folder.",
    "To fix this issue, make sure to go to ‘Windows Update’, found in ‘Settings’, and see if there is an update available for ‘Microsoft Defender’.",
    "Once update ‘1.1.18100.6’ has been installed, the bug will be fixed.",
    "However, while the fix has put a stop to the duplication, the files are still there. To remove them, you need to do the following:",
    "Via Windows Latest",
    "Once the fix has been installed and the files have been deleted, Microsoft Defender will work as intended.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "What was the bug?",
    "6": "Here's how to fix it"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "forums": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-5368687970339629000&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fanswers%2Fquestions%2F376490%2Fwindows-defender-issue-on-server-lots-of-files-bei.html%3FchildToView%3D381018%23answer-381018",
    "Reddit": "https://www.reddit.com/r/sysadmin/comments/n43xk2/windows_defender_server_2016_watch_out/",
    "Windows Latest": "https://www.windowslatest.com/2021/05/05/microsoft-fixes-windows-10-defender-bug-generating-random-files/"
  }
}