{
  "source": "https://www.techradar.com/news/tcl-could-combine-foldable-and-rollable-tech-in-the-same-phone",
  "title": "TCL could combine foldable and rollable tech in the same phone",
  "category": "phones",
  "updated": "2021-03-28T09:30:47Z",
  "author": "david-nield",
  "summary": "Two innovations in one",
  "article": [
    "It's no secret that TCL is busy working on both foldable and rollable displays, and hopes to launch a phone featuring one of these technologies later this year. However, the latest rumor points to a device that is both a foldable and a rollable at the same time.",
    "That's according to internal sketches and renderings seen by CNET, which puts a hinge on one side of the display with a rollable extension on the other – two different types of expandable screen tech in one seamless whole.",
    "In theory, this approach would turn a compact phone into a rather large tablet. CNET says the plans are going to be unveiled in the middle of April, when TCL also officially launches the 20 series phones that made their debut at CES 2021.",
    "For now the hardware is being described as a \"concept device\", and it's not certain that the foldable-and-rollable will actually go on sale – something we've found ourselves saying a lot as manufacturers experiment with different form factors and screen technologies.",
    "TCL has been making noises about foldable phones for several years at this point, and considering its expertise in making television sets, you would have thought that the company was in a good position to push out phones in a variety of form factors.",
    "We've already seen a rollable handset from the manufacturer in prototype form, while screens that roll have also been spotted in TV sets made by TCL. The journey from concept device to finished product isn't always a smooth one, however.",
    "Oppo has been working on rollable phones as well, and we know that it's something that Samsung is looking into too. Rollables are potentially more robust and reliable than foldables, because the screen doesn't have to bend – it just expands in one direction.",
    "The question is whether manufacturers can get the rollable technology to a viable place to include it in handsets, to go alongside the increasing number of foldable phones we're seeing. Based on these sketches, TCL is going to try its best to make it happen."
  ],
  "headers": {},
  "links": {
    "later this year": "https://www.techradar.com/news/tcl-confirms-it-will-launch-a-rollable-or-foldable-phone-this-year",
    "CNET": "https://www.cnet.com/news/tcl-experiments-with-foldable-rollable-displays-in-the-same-mobile-device/",
    "the 20 series phones": "https://www.techradar.com/news/tcls-ces-2021-lineup-includes-the-cheapest-5g-phone-yet",
    "saying a lot": "https://www.techradar.com/news/lg-rollable-may-be-delayed-or-even-cancelled-suggests-supply-chain-intel",
    "making noises": "https://www.techradar.com/news/the-tcl-foldable-phone-may-be-the-most-important-smartphone-at-ces-2020",
    "seen a rollable handset": "https://www.techradar.com/news/this-is-the-best-foldable-phone-concept-weve-seen-so-far",
    "spotted in TV sets": "https://www.techradar.com/news/tcl-has-developed-a-sideways-rollable-oled-tv-watch-it-in-action-here",
    "working on rollable phones": "https://www.techradar.com/news/oppo-x-2021-rollable-phone-shows-up-in-new-hands-on-videos",
    "Samsung is looking into": "https://www.techradar.com/news/samsung-confirms-that-rollable-and-slidable-displays-are-on-the-way",
    "foldable phones we're seeing": "https://www.techradar.com/news/google-pixel-foldable-phone"
  }
}