{
  "source": "https://www.techradar.com/news/swiss-company-mocks-apple-with-dollar30800-vantablack-coated-last-upgrade-watch",
  "title": "Swiss company mocks Apple with $30,800 Vantablack-coated watch – here's why",
  "category": "fitness",
  "updated": "2021-02-04T10:03:26Z",
  "author": "cat-ellis",
  "summary": "The Last Upgrade also has an infinitely-spinning loading wheel",
  "article": [
    "Luxury watchmaker H Moser – known for occasionally baiting Apple with its Swiss Alp analog watches – has released a new dig at the tech company with a timepiece that features an infinitely spinning loading wheel, and retails at $30,800 (about £23,000 / AU$40,000).",
    "As reported by Hodinkee, the Infinite Upgrade pokes fun at smartwatches that require firmware updates before they're able to tell you the time. Despite borrowing more than a few design cues from Apple, it has no 'smart' features at all – just two hands and that familiar wheel, which serves to count seconds.",
    "Whereas the Apple Watch 6 features an always-on Retina Display, and is the company's brightest display yet, the Infinite Upgrade's face is coated in Vantablack – a material that can absorb up to 99.965% of available light.",
    "This isn't H Moser's first foray into the bizarre; in 2017, the company produced a timepiece with a bezel made from actual Swiss cheese.",
    "That Vantablack coating is doubtless part of the reason for the Last Upgrade's price tag. The material (which is at the center of a long-running feud between artists Anish Kapoor and Stuart Semple) isn't a pigment, but a 'forest' of artificially grown carbon nanotubes.",
    "It has practical applications in optics and heat regulation, but its maker Surrey NanoSystems has also licensed it to tech companies hoping to make a statement. In 2018, Activision paid for a room to be coated in Vantablack to promote Call of Duty: Black Ops 4, and the following year BMW revealed an X6 concept with a Vantablack coating intended to draw attention to the car's silhouette.",
    "Unlike the BMW, however, the Last Upgrade is actually available to buy if your pockets are deep enough and you don't mind that it costs as a new car."
  ],
  "headers": {
    "4": "The dark side"
  },
  "links": {
    "Swiss Alp analog watches": "https://www.h-moser.com/product/swiss-alp-watch-3/",
    "Hodinkee": "https://www.hodinkee.com/articles/h-moser-swiss-alp-vantablack-watch-hands-on",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "actual Swiss cheese": "https://www.hodinkee.com/articles/h-moser-swiss-mad-watch-swiss-cheese-limited-edition-venturer-introducing",
    "a long-running feud": "https://www.archpaper.com/2017/07/anish-kapoor-blackest-black/",
    "paid for a room to be coated in Vantablack": "https://www.digitaltrends.com/cool-tech/vantablack-call-of-duty-gaming/",
    "BMW revealed an X6 concept": "https://www.autocar.co.uk/car-news/motor-shows-frankfurt-motor-show/bmw-paints-new-x6-light-absorbing-%E2%80%98vantablack%E2%80%99",
    "available to buy": "https://www.h-moser.com/product/swiss-alp-watch-5324-1205/"
  }
}