{
  "source": "https://www.techradar.com/news/microsoft-word-is-getting-an-even-darker-dark-mode",
  "title": "Microsoft Word is getting an even darker dark mode",
  "category": "computing",
  "updated": "2021-02-09T15:22:41Z",
  "author": "axel-metz",
  "summary": "Because dark isn't dark enough",
  "article": [
    "Microsoft is levelling up the dark mode feature in Microsoft Word to make it even darker.",
    "Where the existing dark mode on Word dims the toolbar, ribbons and surrounding area of a page, tests are ongoing using a new dark mode which further blackens the canvas itself – giving users the option to switch between their preferred levels of darkness.",
    "In an official Office Insider blog post, Microsoft Word program manager Ali Forelli described the update as a “long-requested feature” only made more pertinent by the ever-increasing amount of time we spend at our screens. “It has become increasingly important,” he said, “to reduce eye strain and accommodate light sensitivity.”",
    "Among changes which will see the updated dark mode switch previously-white pages to charcoal grey, the colors used in documents themselves will also be adjusted. Reds, blues, yellows and other bright colors will be “shifted slightly to mute the overall effect of the color palette” and to better match the darkened background.",
    "The update will introduce a ‘Switch Modes’ tab in the Word ribbon to switch between a dark and light canvas (similar to that which exists in OneNote), along with an option to permanently disable the dark canvas and stick with the traditional dark mode.",
    "This darker dark mode (let’s go with ‘double dark’) is currently available to beta testers of Office 365, so expect it to arrive in your Word program in the coming months.",
    "Of course, this will come as useless news to those who don’t know how to activate the original dark mode in Microsoft Word, or indeed those who didn’t know it existed in the program at all.",
    "According to Microsoft, Office’s dark mode is only available if you have a Microsoft 365 (previously known as Office 365) subscription, though you can still opt for a dark grey theme on Office 2016 and Office 2013. This works on any version of Windows, including Windows 7, 8, or 10.",
    "To change your theme, click the ‘File’ menu at the top left corner of an Office application like Word, Excel, Outlook, or PowerPoint. Click the ‘Account’ option in the sidebar, then the ‘Office Theme’ dropdown menu to select your desired theme.",
    "The default theme is ‘Colorful’ (which keeps your Excel green, your PowerPoint red etc.) but you can also select ‘White’ for brighter whites across Office applications. To enable dark mode, select ‘Black’ for the darkest possible style or ‘Dark Gray’ for more of a charcoal feel.",
    "To put Office in dark mode on Mac, you’ll need to change this setting in the macOS system preferences. Click the Apple menu in the top left, select ‘System Preferences’, then ‘General’ and at the top of the dialog box you can switch your macOS from Light to Dark.",
    "It’s worth noting that documents you create while in your chosen dark mode will still have a white background and black text by default. You could change your documents to have a black background and white text, but those colors would be part of each document you save.",
    "Via The Verge"
  ],
  "headers": {
    "6": "How to use dark mode in Microsoft Word"
  },
  "links": {
    "official Office Insider blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_2672710596339501600&xs=1&url=https%3A%2F%2Finsider.office.com%2Fen-us%2Fblog%2Ftry-dark-mode-in-word&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-word-is-getting-an-even-darker-dark-mode",
    "Microsoft": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1188710657278263600&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Foffice%2Fchange-the-look-and-feel-of-office-63e65e1c-08d4-4dea-820e-335f54672310%3Fui%3Den-us%26rs%3Den-us%26ad%3Dus",
    "The Verge": "https://www.theverge.com/2021/2/9/22274181/microsoft-word-dark-mode-canvas-update-beta"
  }
}