{
  "source": "https://www.techradar.com/news/canon-patent-reveals-more-about-its-powershot-zoom-lens-for-smartphones",
  "title": "Canon patent reveals more about its Powershot Zoom lens for smartphones",
  "category": "cameras",
  "updated": "2021-07-26T10:20:39Z",
  "author": "mark-wilson",
  "summary": "Is Canon working on a smartphone zoom lens attachment?",
  "article": [
    "Canon has long been rumored to be working on a camera attachment for smartphones – and now a new patent has revealed more about how the accessory could work in practice.",
    "Discovered by Canon News, the patent (see images below) fleshes out some of the 3D renders of the phone add-on we saw last year, revealing what looks like a Canon Powershot Zoom-style device with a smartphone cradle.",
    "In the patent, Canon describes an external zoom lens that rotates around a hinge to allow it to fold away neatly, and also has a bracket to hold your smartphone. The wireless communication between the accessory and phone would let you use the latter as a viewfinder, with the Canon patent adding that \"remote control of the camera becomes possible\".",
    "On the back of Canon's zoom lens accessory is a power switch and zoom switch which, as you'd expect, \"lets you change the focal length of the lens barrel\".",
    "The patent doesn't specify exactly what focal lengths would be available, but speculates that \"a zoom switch for inputting an instruction for setting a focal length to 400\" and one for doing the same for \"setting the focal length to 100\" may be provided.",
    "This is interesting because the Canon Powershot Zoom, which was crowd-funded on Japanese site Makuake last year before going on general sale, also lets you jump from 100mm to 400mm focal lengths at the push of a button. Rather than a traditional zoom lens, the Powershot Zoom is a three-stepped zoom, that starts at 100mm and goes all the way to 800mm thanks to a 2x digital extension.",
    "Like that little monocular-style camera, Canon's patented phone accessory also suggests it'll be capable of video, too. The patent mentions that its imaging processing unit will, along with performing \"color space conversion, white balance, AE, and flash correction\", also \"output an 8-bit digital signal in YUV (4 : 2 : 2) format\".",
    "There's no doubt the existing Powershot Zoom is a little limited on that front, shooting Full HD videos at 30fps that are capped to ten minutes. But it does offer 4-axis stabilization to help keep footage steady – and while there's no mention of this in Canon's patent, it's fair to assume that some optical stabilization would be on board, too.",
    "Like all patents, there's no guarantee that Canon is seriously looking to launch its telephoto zoom accessory for phones. That said, it has developed a taste for testing crowd-funding concepts like the Canon Ivy Rec, Canon Powershot Pick and Canon Powershot Zoom – and despite its potential clunkiness, there would likely be demand for a Canon-made smartphone accessory like the one described in this patent.",
    "The problem is, we have already seen quite a few takes on this idea before. Sony launched the QX10 and QX100 smartphone lens attachments back in 2013, while the DxO One even brought a 20.2MP 1-inch sensor (the same as the one inside Sony's RX100 compact cameras) to our phones in 2015. Despite impressive hardware, poor usability and limited battery lives held all of them back.",
    "Phone cameras have made huge leaps since then, but one area where they have seemingly hit a limit is optical zoom. We now have 10x optical zoom courtesy of some clever folded optics in phones like the Samsung Galaxy S21 Ultra, but that's an equivalent focal length of around 240mm.",
    "If Canon's concept managed to hit a 400mm equivalent focal length using a larger sensor than today's flagship phones, there could still be a niche market among those who want the extra reach for sports and wildlife snapping, but without the faff of buying or carrying a dedicated camera.",
    "The question is whether or not the accessory's stabilization and autofocus could produce results that improve on software-based techniques like Super Res Zoom, which was pioneered by Google's Pixel phones. Sadly, we didn't find that this was the case on the Canon PowerShot Zoom, which was also hobbled by a small 1/3in image sensor.",
    "But if Canon could make a second-generation version that plays nice with smartphones in the way that its patent describes, we'd certainly be keen to take it for a spin – even if it does look like a somewhat Frankensteinian meeting of the new and old photography worlds."
  ],
  "headers": {
    "8": "Analysis: Better on paper than in reality?"
  },
  "links": {
    "Canon News": "https://www.canonnews.com/canon-patent-application-smartphone-telelphoto",
    "we saw last year": "https://www.techradar.com/news/canon-may-have-its-own-smartphone-photography-accessories-in-the-works",
    "Canon Powershot Zoom": "https://www.techradar.com/reviews/canon-powershot-zoom",
    "Canon Ivy Rec": "https://www.techradar.com/news/canon-turns-to-crowdfunding-for-its-latest-ivy-rec-camera",
    "Canon Powershot Pick": "https://www.techradar.com/news/canon-powershot-pick-leak-reveals-ai-camera-that-takes-photos-for-you",
    "QX10": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/sony-qx10-1177656/review",
    "QX100": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/sony-qx100-1174463/review",
    "DxO One": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/compact-cameras/dxo-one-1297172/review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review"
  }
}