{
  "source": "https://www.techradar.com/news/treat-yourself-to-a-security-upgrade-this-easter",
  "title": "Treat yourself to a security upgrade this Easter",
  "category": "computing",
  "updated": "2021-04-21T07:31:54Z",
  "author": "techradar-pro",
  "summary": "Here's our latest look at all the security tips you need",
  "article": [
    "With Easter and the typical chocolate haul now underway, you might be forgiven for thinking the time for treats and indulgence will soon be over for a while. So maybe instead it's time to take a look at indulging your security set-up to make sure your devices don't fall victim to any of the many security threats and scams around today. But if you're not sure where to start - never fear, as we've collated some of the best security tips and tricks to make sure you and your family can stay safe online this Easter.",
    "What better place to start than with an extra treat for your devices that should also offer heightened online security. Using a Virtual Private Network, or VPN, helps keep you safe online by masking your internet connection, making it appear that you are based in a different country or region of your choosing. This should mean that advertisers and websites are unable to track your internet activity or snoop on your location. With the current world situation still meaning many of us still can't travel overseas, here is your opportunity to feel like you're a different country - as a VPN can also allow you to stream media from other territories. Bitdefender Total Security comes with a comprehensive and recently improved VPN service that's perfect for work and home use, providing 200MB of encrypted data traffic per day for your Windows, Android, macOS and iOS devices at no extra cost, meaning you'll be able to stream and surf online whilst staying secure without restrictions.",
    "With many of us now working from home at least part of the time for the foreseeable future, this means most of us now own and use multiple connected devices both at work and at home. But away from laptops and PCs, smartphones, tablets and other mobile devices often get forgotten when it comes to security protection, despite being continually connected to the internet and containing much of our most treasured photos, videos and apps. To keep all this protected, Bitdefender Total Security offers your mobile devices as much protection as your work laptop, covering Windows, macOS, Android and iOS, including several generations of each software. Protection can be extended over up to 15 devices per household, meaning you can also keep your entire family safe online, whatever devices are being used.",
    "Passwords are an unavoidable part of online security for all of us, meaning they can often be a source of frustration when they get forgotten or changed. But the fact remains that having strong passwords employing a mix of letters, numbers and special characters for all your seperate accounts can ensure hackers and other cybercriminals are blocked at the point of entry, keeping your data, and your devices, secure. If you re-use passwords across multiple accounts, all it takes is for one of these to be compromised for hackers to gain knowledge of your logins to everything else. Creating and remembering strong passwords for all your accounts can be a challenge, but Bitdefender Total Security can help. The platform features an in-built Password Manager service to let you keep track of all your passwords, credit card information, and other sensitive data in a cyber-vault for easy access whenever you need them.",
    "Even though some of us may be going back to the office soon, that's no reason to let down your guard when it comes to security. Juggling work and personal devices can be tricky, despite the convenience of checking your work email when away from the office or your workplace devices. However accidentally opening up a scam link or email on your personal devices can have a knock-on effect for your other items too. Phishing emails, where hackers spoof messages from a legitimate company in an attempt to steal login details or personal information, have seen a significant rise recently. But if you receive an email that looks or seems suspicious, take a few moments to examine it carefully - phishing messages often contain obvious spelling, imaging or formatting errors, or have clearly malicious links. Bitdefender Total Security goes beyond typical antivirus and malware blockers to keep you protected from all the latest phishing scams, including dedicated anti-phishing and anti-fraud systems to keep you safe online."
  ],
  "headers": {
    "1": "Treat yourself to a VPN",
    "2": "Watch all your devices are secured, all of the time",
    "3": "Make sure your passwords are under control",
    "4": "Stay on alert"
  },
  "links": {
    "Bitdefender Total Security": "https://www.bitdefender.co.uk/solutions/total-security.html"
  }
}