{
  "source": "https://www.techradar.com/news/newegg-ps5-restock-also-includes-more-rtx-3080-and-ryzen-5-5600-units",
  "title": "Newegg PS5 and RTX 3080 out of stock - here's where to buy them now",
  "category": "gaming",
  "updated": "2021-01-23T01:00:31Z",
  "author": "david-lumb",
  "summary": "The first step of Newegg's new lottery system",
  "article": [
    "If you're searching where to buy PS5, Newegg had PS5 restock earlier on Friday, as well as Asus and MSI versions of the RTX 3080 and 3080 video cards and AMD Ryzen 5 and Ryzen 7 processors, but they're all out of stock now. It was notably the first test of the retailer's brand-new lottery system to deal with high demand.",
    "How does their lottery system work? Simply go into checkout and buy any of the items (here's a list on Newegg) as normal, and you'll be entered into a lottery to get those items. At the end (in several hours), winners will be notified via email or Newegg's app and you'll have two hours to complete your purchase – or the items will go to the next in line.",
    "It's an imperfect system, and we realize folks will likely be disappointed, but it's one way Newegg is hoping to combat the rampant bots scooping up PS5 stock before any actual humans can buy them.",
    "Games deals Twitter account was the first to loop together the disparate products on Newegg:",
    "As the Wario64 tweet notes, there were other high-demand items that have been nearly impossible to buy lately, from the Asus TUF GeForce RTX 3070, MSI RTX 3070, and Asus ROG STRIX RTX 3080 video cards to the AMD Ryzen 5 5600X and AMD Ryzen 7 5800X processors. All have been difficult to buy since their releases over previous months.",
    "If you missed the chance to buy a PS5, check the links below:",
    "If you didn't make it through today at Newegg, check Best Buy tomorrow morning, as it got back in stock earlier today and could be back in the coming days.",
    "Looking for RTX's latest graphics cards? Here are our roundups for where to buy them:"
  ],
  "headers": {},
  "links": {
    "where to buy PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "lottery system": "https://www.techradar.com/news/newegg-introduces-new-lottery-system-for-scarce-ps5s-rtx-3080s-and-more",
    "a list on Newegg)": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-1883025788279163100&murl=https%3A%2F%2Fwww.newegg.com%2Fproduct-shuffle%3Fnm_mc%3DAFC-RAN-COM%26cm_mmc%3DAFC-RAN-COM%26utm_medium%3Daffiliates%26utm_source%3Dafc-Twitter%26AFFID%3D2949699%26AFFNAME%3DTwitter%26ACRID%3D15962827816%26ASUBID%3D%26ASID%3Dhttps%253A%252F%252Ft.co%252F8FFb7NOgAl%26ranMID%3D44583%26ranEAID%3D2949699%26ranSiteID%3D0wLgH49VWzI-laO4_gJwPEpVdRK63n_32g%26RandomID%3D9142747154131520210122114058",
    "check Best Buy": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart"
  }
}