{
  "source": "https://www.techradar.com/news/orange-builds-experimental-zero-touch-5g-network",
  "title": "Orange builds experimental 'zero-touch' 5G network",
  "category": "computing",
  "updated": "2021-06-30T13:08:49Z",
  "author": "steve-mccaskill",
  "summary": "Experimental network in France uses cloud, AI and data to effectively run itself",
  "article": [
    "Orange is launching Europe’s first fully end-to-end Standalone 5G experimental network in France so it can see the benefits that cloud, AI and new radio technologies can have on its operation and the customer experience.",
    "As the industry shifts to 5G, mobile operators are increasingly moving infrastructure and applications from on-premise environments into the cloud.",
    "Some of the benefits are financial – cloud infrastructure is more efficient – but the virtualization of key network functions and the aggregation of data will make it faster and easier to roll out new services, adapt to market trends and enable automation.",
    "Cloud-based core networks will also be essential to support some of the more revolutionary 5G applications such as Virtual Reality (VR) and the Industrial Internet of Things (IIoT) that rely on ultra-low latency.",
    "Orange’s experimental network will run all its key functions from the cloud and the hope is that it will essentially run itself, automatically provisioning services, using data to optimise infrastructure and self-healing any potential issues.",
    "The operator will see how a fully-cloudified ‘zero touch’ network works in the real world, unencumbered by ‘legacy’ systems, while the use of OpenRAN will provide an insight into how open networking innovations can coexist with other technologies.",
    "The network will first be deployed in the Northwestern town of Lannion before expanding to other locations in 2022. This expansion will increase the number of users and also allow Orange to test key 5G services like dynamic network slicing.",
    "“Our ambition is to prepare Orange for the operator of the future by building more resilient and auto-adaptive networks that offer best in class quality of service in each situation,” declared Michaël Trabbia, Chief Technology and Innovation Officer, Orange. “This experimental network represents an important milestone on our way to implement and deploy Open RAN and AI technologies to prepare on-demand connectivity and zero touch operator capabilities.”",
    "Suppliers come from across the industry, with Mavenir providing OpenRAN technology and Casa Systems responsible for the core network. HPE will offer cloud-based subscriber data management capabilities, while Dell will provide hardware and Xiaomi devices.",
    "“This is a significant announcement by Orange on several front: firstly, the fully cloud-based aspect, not only indicating Orange’s roadmap towards fully automated, software and AI-driven networks, but also its commitment to Open RAN principles of vendor diversity—with some notable absences from the named technology partners,” explained Richard Webb, Director, Network Infrastructure at CCS Insight.",
    "“Secondly, this sort of project is vital not only in giving operators like Orange a clearer understanding of how Open RAN solutions interoperate but also how cloud-based, software-defined, intelligent networking transform the operator itself, in terms of its own operations.\"",
    "“This is a 5G Standalone network, considered by many to be the ‘true version’ of 5G in which a richer services environment can be fully realised. Although this experimental network is small-scale to start with, it could provide proof points for enhanced user experiences.”"
  ],
  "headers": {
    "3": "Orange 5G AI"
  },
  "links": {}
}