{
  "source": "https://www.techradar.com/news/xiaomi-mi-12-might-charge-far-faster-than-any-other-phone",
  "title": "Xiaomi Mi 12 might charge far faster than any other phone",
  "category": "phones",
  "updated": "2021-05-31T08:55:21Z",
  "author": "james-rogerson",
  "summary": "200W of power",
  "article": [
    "Many flagship phones already charge very fast, but it looks like the Xiaomi Mi 12 – or some other upcoming Xiaomi phone – might take these speeds to a whole new level.",
    "That’s because the brand shared a video on Twitter showing a new charging tech called Xiaomi HyperCharge, which offers 200W wired charging and 120W wireless charging. On the wired front, according to Xiaomi that’s enough to get a 4,000mAh battery charged from zero to 100% in just eight minutes. It can apparently get to 10% in 44 seconds, and 50% in three minutes.",
    "If you go wireless then you can supposedly get a 10% charge in one minute, a 50% charge in seven minutes, and a 100% charge in 15 minutes. That’s incredibly fast, and means you’d never really be waiting around for your phone to charge again.",
    "It’s also substantially faster than current fast charging tech. Xiaomi is already leading the way there, with the Xiaomi Mi 10 Ultra offering 120W wired charging speeds and the Xiaomi Mi 11 Ultra offering 67W wireless charging, but this new tech is a huge boost on both of them.",
    "So far it’s not clear when we’ll see this tech on phones, but given that Xiaomi is teasing it and presenting it like a completed feature, we might not be waiting too long. So perhaps we’ll see it on the Xiaomi Mi 11T range (likely landing in September) or on the Xiaomi Mi 12 (probably launching in early 2022).",
    "However, it’s worth noting that Xiaomi hasn’t widely rolled out its 120W wired charging tech, with the Xiaomi Mi 11 range charging at slower speeds than the Mi 10 Ultra, so this might not be something we see on many phones.",
    "There could be good reasons for that, as superfast charging isn’t always great for long-term battery health, which is probably one of the reasons Samsung and Apple haven’t embraced it. Still, as a party trick it’s sure to impress, and it could also be very useful anytime you have just minutes to charge your phone.",
    "Via Phandroid"
  ],
  "headers": {},
  "links": {
    "Xiaomi Mi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Twitter": "https://twitter.com/Xiaomi/status/1399186017421127680",
    "Xiaomi Mi 10 Ultra": "https://www.techradar.com/news/xiaomi-mi-10-ultra",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Xiaomi Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Phandroid": "https://phandroid.com/2021/05/31/xiaomis-latest-fast-charging-tech-will-juice-your-phone-up-in-just-8-minutes/"
  }
}