{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-first-reactions-heres-what-the-critics-thought",
  "title": "Zack Snyder's Justice League first reactions: here's what the critics thought",
  "category": "entertainment",
  "updated": "2021-03-15T16:47:34Z",
  "author": "tom-power",
  "summary": "Does Snyder do justice to his fanbase?",
  "article": [
    "Read our Zack Snyder's Justice League review to see what we thought of it.",
    "After a four-year wait, fans will finally get to experience Zack Snyder's Justice League as it was originally intended. The Snyder Cut launches on HBO Max on March 18 and, ahead of full reviews landing later today, those lucky enough to see it ahead of time have been giving their thoughts on the superhero movie.",
    "Critics and some lucky fans were given the chance to see the four-hour long film over the weekend. With the social media embargo having now lifted, those individuals have offered their opinion on the Snyder Cut – and the overall reaction is a positive one.",
    "Empire contributing editor Amon Warmann summed up plenty of reviewers' thoughts on the matter. The Snyder Cut, Warmann teased, isn't without its problems but the film is an enjoyable one all the same.",
    "Check out Warmann's tweet below:",
    "Fandango's Erik Davis was also full of praise for the Snyder Cut, stating that it was a \"far superior\" film to Joss Whedon's 2017 theatrical cut even though it was a \"long watch\".",
    "CinemaBlend's Sean O'Connell went as far as to label the Snyder Cut as \"the greatest DC movie we've ever seen\".",
    "Grace Randolph, creator of Beyond the Trailer!, said it was a \"master class in what a difference a filmmaker makes\".",
    "Summing up many fans' thoughts on the flick, Twitter user Mr. Will-iam favorably compared the Snyder Cut to Marvel's Avengers: Endgame, calling it Warner Bros' \"best movie ever. Not just DC Comics. It's that great\".",
    "Finally, you'll want to read our thoughts on Zack Snyder's Justice League. TechRadar's Tom Power (yep, that's me) called it a \"vast improvement\" on the Whedon cut and that Snyder Cut fans \"won't be disappointed\" by this version of the movie.",
    "Our full review of Zack Snyder's Justice League will be going live later today, so make sure you check back here for our in-depth thoughts on the flick.",
    "Zack Snyder's Justice League arrives on HBO Max in the US, and Sky Cinema and Now TV in the UK, on March 18."
  ],
  "headers": {},
  "links": {
    "Zack Snyder's Justice League review": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Zack Snyder's Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "HBO Max": "https://www.techradar.com/deals/hbo-max-price-cost-deals"
  }
}