{
  "source": "https://www.techradar.com/news/iphone-6-and-other-phones-too-old-for-ios-146-receive-an-important-security-update",
  "title": "iPhone 6 and other phones too old for iOS 14.6 receive an important security update",
  "category": "phones",
  "updated": "2021-06-15T23:21:05.550Z",
  "author": "david-lumb",
  "summary": "iPhone too old for iOS 14.6, or even iOS 13? Apple has released a crucial security update",
  "article": [
    "The iPhone 6 and several older iPhones, iPads, and other iOS devices that were too old to update to iOS 14 can now get an update in the form of iOS 12.5.4 to fix security vulnerabilities – so if yours is on the compatibility list, you might want to download that now.",
    "Don’t expect any new features from iOS 13, nor any other updates from iOS 13 (let alone the newest iOS 14.6) to trickle down – this is purely a security patch to seal up some vulnerabilities that could become (or could have been) potential attack vectors.",
    "The assortment of older devices that can download the iOS 12.5.4 update include the iPhone 5S, iPhone 6, and iPhone 6 Plus, as well as the iPod touch 6th generation, the original iPad Air, the iPad Mini 2, and iPad Mini 3.",
    "This update (build number 16H50) addresses one security issue by removing vulnerable code that could cause a memory corruption issue, according to Apple’s patch notes for the update. Two potential issues for the open source web browser engine WebKit were also addressed in the update, which could have allowed malefactors to use ‘maliciously crafted web content’ to enact arbitrary code execution – both of which Apple admits are issues that ‘may have been actively exploited.’",
    "In any case, if you have one of these models, it would be wise to download the update immediately. To do so, head to Settings > General > Software Update.",
    "This isn’t the first security update Apple has quietly released for older devices to patch up vulnerabilities – it sent out iOS 12.5.3 in May to fix a few memory corruption issues and pack along some memory optimization tweaks, iOS 12.5.2 in March, and iOS 12.5.1 in January, with even more updates going back through 2020 for the same devices left behind by iOS 13, per Apple’s security log.",
    "While all these and the new iOS 12.5.4 are small security fixes without feature upgrades, they’re still helpful support for older phones and tablets that Apple is releasing without much fanfare. Hopefully the company continues to do so for folks who aren’t ready or are unable to upgrade to newer devices."
  ],
  "headers": {
    "5": "Older iOS, still getting security patches?"
  },
  "links": {
    "iPhone 6": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-1264565/review",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "iPhone 5S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-5s-1179315/review",
    "iPhone 6 Plus": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-plus-1264566/review",
    "iPad Air": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-air-1191350/review",
    "iPad Mini 2": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-mini-2-1191349/review",
    "iPad Mini 3": "https://www.techradar.com/reviews/pc-mac/tablets/ipad-mini-3-1269214/review",
    "patch notes": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3365849365834292000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT212548",
    "iOS 12.5.3": "https://www.techradar.com/news/older-iphones-can-now-download-a-new-ios-update",
    "security log": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-2151980202686338000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT201222"
  }
}