{
  "source": "https://www.techradar.com/news/salesforce-drops-major-cross-suite-update-including-new-industry-specific-products",
  "title": "Salesforce Spring '21 release reveals major cross-suite update",
  "category": "computing",
  "updated": "2021-02-18T22:09:11Z",
  "author": "barclay-ballard",
  "summary": "There's a lot of new features in the Spring '21 release, including new industry-specific products",
  "article": [
    "Cloud giant Salesforce has unveiled its Spring ’21 release, complete with new loyalty management and payment processing platforms. The additional features should allow Salesforce customers to connect with customers more easily and boost conversion rates.",
    "“Today, the Spring ’21 Release features and products are available to customers globally — and we mean globally!” a Salesforce update revealed. “Now, the Spring ’21 Highlights Demo, and Highlights Trail have been translated into [Japanese, German, French, Spanish, and Portuguese]. Additionally, all demo videos have been translated into Japanese.”",
    "Regarding industry-specific updates, the Spring ’21 release comes with a new Rebate Management tool that delivers a comprehensive incentive management solution for businesses selling through distribution channels. New products, like Communications Cloud, Media Cloud, and Energy & Utilities Cloud, will also prove useful for organizations in the relevant industries.",
    "Looking more closely at Salesforce’s new Loyalty Management platform, the solution aims to deliver an end-to-end loyalty platform that empowers businesses to create personalized engagements built on the company’s CRM. Commerce Cloud Payments, meanwhile, should help solve implementation, fraud, and PCI compliance challenges for merchants.",
    "Salesforce revealed that community feedback played a significant role in the creation of its new Spring ’21 release. Many of its features started life as user submissions to Salesforce’s IdeaExchange, including Tableau CRM’s Dashboard Components, and enhancements to Developer Tools, Dynamic Actions, and In-App Guidance.",
    "Salesforce had a busy end to 2020 following the $27.7 billion takeover of Slack, but has already made headlines in the early months of this year by declaring that remote working will become a permanent fixture even once the COVID-19 pandemic has passed."
  ],
  "headers": {
    "3": "A major new release"
  },
  "links": {
    "Cloud": "https://www.techradar.com/best/free-cloud-apps",
    "Salesforce": "https://www.techradar.com/reviews/salesforce-service-cloud",
    "payment processing": "https://www.techradar.com/best/best-payment-gateways",
    "revealed": "https://www.salesforce.com/news/stories/our-spring-21-release-is-live/",
    "Spring ’21": "https://www.salesforce.com/releases/spring-21/overview/?sfdc-redirect=128",
    "Developer Tools": "https://www.techradar.com/news/best-web-development-tool",
    "takeover of Slack": "https://www.techradar.com/news/salesforce-confirms-multi-billion-dollar-slack-takeover",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "permanent fixture": "https://www.techradar.com/news/salesforce-declares-the-traditional-office-working-life-over"
  }
}