{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-bts-edition-blatantly-teased-by-samsung-itself",
  "title": "Samsung Galaxy Z Flip 3 BTS edition blatantly teased by Samsung itself",
  "category": "phones",
  "updated": "2021-10-20T09:01:02Z",
  "author": "david-lumb",
  "summary": "Samsung x BTS collab?",
  "article": [
    "Update: it's Samsung's next launch event today (October 20) at 7am PT / 10am ET / 3pm BST today (or 1am AEDT on October 21), and we expect the Samsung Galaxy Z Flip 3 BTS edition to be among the announcements. Head to our Samsung Unpacked live blog for all the action.",
    "In what may be the most blatant tease ever, an official Samsung tweet asked if we’d forgotten the Samsung Galaxy Z Flip 3 (we loved it) and tagged K-pop megagroup BTS, as well as including the hashtag #GalaxyxBTS.",
    "Yeah, we think they might collaborate on a phone.",
    "The tweet seems pretty self-explanatory, going so far as to display images of the BTS members, some even holding the Samsung Galaxy Z Flip 3, and pointing to the official site for the next Samsung Unpacked event, which the company has announced will be happening on October 20.",
    "If you recall, these images seem to be from BTS’ appearance during the last Samsung Unpacked in August which saw reveals of the Z Flip 3 and the Samsung Galaxy Z Fold 3. That in itself felt like a hint that a collaboration between the globally famous group and the phonemaker might be happening, and this feels like all but confirmation.",
    "What would a Samsung Galaxy Z Flip 3 BTS Edition look like? We haven’t the foggiest idea, as the images of the BTS members in the tweet don’t show any special versions of the Z Flip 3 – just one of the lilac colors you can buy today.",
    "It’s not the first collaboration between the megagroup and the phonemaker – the Samsung Galaxy S20 Plus had its own BTS edition launch in July 2020, which came in a vibrant violet hue with blue-toned edges, as well as BTS-themed software customization. There didn’t seem to be any branding...except for a telltale purple heart on the camera block for true fans to spot.",
    "Presumably, the Z Flip 3 BTS Edition (or whatever it’s called) could have a similar coloring and software package, as well as a logo somewhere in the design, but that’s all speculation at this point. It’s pretty obvious that we’ll see the device revealed at Samsung Unpacked on October 20, so we (and BTS fans eager for their next phones) will just have to wait for the event to see it shown off.",
    "Via SamMobile"
  ],
  "headers": {
    "5": "You got BTS in my Samsung...again"
  },
  "links": {
    "Samsung Unpacked": "https://www.techradar.com/news/rip-galaxy-note-21-samsung-galaxy-z-fold-3-to-launch-in-august-hints-unpacked-invite",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "BTS": "https://www.techradar.com/news/ive-never-heard-k-pop-band-bts-but-im-desperate-for-their-samsung-galaxy-s20-plus",
    "tweet": "https://twitter.com/SamsungMobile/status/1448097620728197127",
    "site": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-5165825860630628000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fsmartphones%2F&article_name=Samsung%20Galaxy%20Z%20Flip%203%20BTS%20edition%20blatantly%20teased%20by%20Samsung%20itself&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsamsung-galaxy-z-flip-3-bts-edition-blatantly-teased-by-samsung-itself",
    "announced": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-land-on-october-20-one-day-after-the-pixel-6",
    "Samsung Galaxy S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "launch": "https://www.techradar.com/news/pre-booking-for-samsung-galaxy-s20-plus-bts-edition-to-start-from-july-1",
    "SamMobile": "https://www.sammobile.com/news/samsung-exclusive-galaxy-z-flip-3-bts-fans/"
  }
}