{
  "source": "https://www.techradar.com/news/ticwatch-pro-3-ticpods-anc-giveaway",
  "title": "TechRadar giveaway: Win a TicWatch Pro 3 smartwatch or TicPods ANC wireless headphones",
  "category": "wearables",
  "updated": "2021-01-19T14:35:05Z",
  "author": "techradar-team",
  "summary": "New year, new you, free tech.",
  "article": [
    "Brand new year, brand new tech. That's exactly what those of you in the US, UK and Australia have a chance of winning in 2021.",
    "Here's the deal. We've got two different contests offering you a chance to win some great Mobvoi gear: one for the TicPods ANC wireless earbuds with active noise-cancelling, and another for the TicWatch Pro 3 smartwatch.",
    "Residents of all three countries can enter to win both competitions, but you can only win one of the products! Scroll down if you're ready to enter.",
    "Seven lucky winners will dance away with a set of the TicPods ANC: wireless earbuds that look similar to the AirPods Pro, are Bluetooth 5 compatible, include independent earbud control (in case you only want to listen to one bud) and can tune out nearby noise as they turn up the volume to your music.",
    "And three other lucky winners get the TicWatch Pro 3, one of the best Android smartwatches of 2020. We reviewed the Pro 3 in October 2020 and found it to be not only \"one of the best Wear OS watches we've tested full stop\" but also one of the best-looking wrist trackers to date.",
    "Ready to enter? Good! Because you can put your name in the running a total of 20 times (across both contests)! Find out how below.",
    "Update: We've added even more ways to win. There are now 22 options to gain more entries.",
    "Entries close at 00:01 ET (05:01 GMT, 16:01 AEDT) on February 1, 2021. Good luck!",
    "Mobvoi provides and ships the products for this giveaway, but the contents of this article are entirely independent and solely reflect the editorial opinion of TechRadar."
  ],
  "headers": {
    "8": "Enter to win the TicWatch Pro 3"
  },
  "links": {
    "TicPods ANC": "https://www.techradar.com/reviews/ticpods-anc",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "best Android smartwatches of 2020": "https://www.techradar.com/news/best-android-smartwatch"
  }
}