{
  "source": "https://www.techradar.com/news/amds-next-gen-ryzen-cpus-and-rdna-3-gpus-could-launch-together-at-end-of-2022",
  "title": "AMD’s next-gen Ryzen CPUs and RDNA 3 GPUs could launch together at end of 2022",
  "category": "computing",
  "updated": "2021-06-08T11:53:29.566Z",
  "author": "darren-allan",
  "summary": "Zen 4 processors may arrive simultaneously with AMD’s next-gen graphics cards",
  "article": [
    "AMD’s next-gen Ryzen processors based on the Zen 4 architecture might launch simultaneously alongside RDNA 3-powered graphics cards, but we’ll be waiting some time for this to happen.",
    "A fresh rumor shared on Twitter – from leaker Broly_X1 – asserts that this simultaneous CPU and GPU launch could occur at the end of 2022 (in the final quarter). That’s pretty much in line with all the recent speculation we’ve heard about Zen 4 CPUs which holds that a later in 2022 release seems the most likely timeframe. That’s also what the official roadmaps have suggested in the past, too…",
    "As VideoCardz, which spotted this tweet, reminds us, Broly_X1 has a solid track record of AMD leaking previously, spilling the details on pretty much the entire AMD keynote for Computex (and correctly highlighting the Radeon Pro GPU launch before it was revealed).",
    "However, even if Broly_X1 is on the money with this schedule right now, things could well change at AMD, because we are, after all, talking a timeframe of a year and a half.",
    "As we’ve mentioned before when discussing a possible Zen 4 (Ryzen 6000?) launch at the close of 2022, this is a long way out for nothing else to happen since AMD unleashed Ryzen 5000 (Zen 3) processors on the world (late last year). Potentially leaving the door open for Intel to take back some serious turf in the CPU world (starting with Alder Lake chips which might turn up in October).",
    "The obvious stopgap solution – if the rumors about there being no Zen 3+ refresh are right, and we’ve still heard nothing about that possibility – would be for AMD to push out Ryzen 5000 XT models to pep things up a bit. Indeed, these were rumored to perhaps be planned for later this year. Broly_X1 appears to agree that something will be needed to fill the gap, but that we may not see an XT refresh of current CPUs until early in 2022; not this year.",
    "On the graphics card front, nothing will be happening until we get through until Q4 2022, Broly_X1 reckons, so the current RX 6000 range will theoretically remain in place through this year and most of next. The leaker believes that AMD will tape out RDNA 3 GPUs (meaning the design will be finished) later in 2021."
  ],
  "headers": {
    "4": "Stopgap solution"
  },
  "links": {
    "Zen 4": "https://www.techradar.com/news/amd-zen-4-rumor-could-be-bad-news-for-intel",
    "recent speculation": "https://www.techradar.com/news/amd-zen-4-rumor-suggests-late-2022-release-a-year-after-intel-alder-lake-debuts",
    "later in 2022 release": "https://www.techradar.com/news/amd-zen-4-rumor-suggests-much-faster-ryzen-cpus-for-2022-and-even-a-24-core-monster",
    "VideoCardz": "https://videocardz.com/newz/amd-zen4-and-rdna3-architectures-both-rumored-to-launch-in-q4-2022",
    "Radeon Pro GPU launch": "https://www.techradar.com/news/new-radeon-pro-gpu-featuring-navi-21-teased-by-amd",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "processors": "https://www.techradar.com/news/best-processors",
    "Alder Lake chips which might turn up in October": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "were rumored to perhaps be planned for later this year.": "https://www.techradar.com/news/amd-ryzen-6000-cpus-not-coming-in-2021-more-rumors-claim-we-could-see-5000-xt-chips-instead"
  }
}