{
  "source": "https://www.techradar.com/news/microsoft-unveils-new-cloud-platforms-focused-on-industry",
  "title": "Microsoft unveils new cloud platforms focused on industry",
  "category": "computing",
  "updated": "2021-10-27T15:52:10Z",
  "author": "anthony-spadafora",
  "summary": "New industry clouds are a launchpad for innovation",
  "article": [
    "In an effort to help businesses innovate as part of their digital transformation efforts, Microsoft has announced three new industry-specific cloud offerings for Azure in the form of Microsoft Cloud for Financial Services, Microsoft Cloud for Manufacturing and Microsoft Cloud for Nonprofit.",
    "The software giant created its industry clouds by bringing together common data models, cross-cloud connectors, workflows, APIs and industry-specific components and standards with its cloud services which include Microsoft 365, Teams, Azure, Microsoft Power Platform, Dynamics 365 and security solutions.",
    "Through its industry clouds, Microsoft aims to empower organizations to deliver value faster, adapt quickly to changing conditions and build for the future with security at the core of everything they do.",
    "In a new blog post, corporate VP of business applications and global industry at Microsoft Alysa Taylor explained how the company worked with industry experts to create its industry clouds, saying:",
    "“Microsoft’s deep investment in industry solutions is not new. Across the company, embedded industry experts among our employee base are informing our priorities — doctors working alongside engineering teams on healthcare challenges, retail executives imagining new customer experiences, financial experts helping us understand fintech, banking and payments and nonprofit leaders shaping our vision and solutions to impact those helping others.”",
    "Microsoft’s industry clouds provide an on-ramp to the company's broader portfolio of cloud services and enable customers to begin with the areas where the need for technology transformation is the most urgent.",
    "Microsoft Cloud for Financial Services brings together the company's solutions, unique templates, APIs and industry-specific standards along with multi-layered security and compliance coverage. Using these capabilities, retail banks can create a 360-degree view of their customers, embed digital collaboration into their process workflows and enhance insights to help reduce fraud.",
    "Microsoft Cloud for Manufacturing will help manufacturers move toward data-driven automation and adopt IoT, machine learning and AI. Using the company's end-to-end manufacturing solutions, organizations will be able to become more resilient by connecting people, assets, workflows and business processes.",
    "Microsoft Cloud for Nonprofit on the other hand creates a connected, intelligent platform to empower staff and volunteers to focus on the work that matters most. This new industry cloud will launch in public preview by the end of June.",
    "Whatever industry your organization is in, Microsoft has a cloud tailored to your unique problems and the software giant will likely add even more industry clouds in the future."
  ],
  "headers": {
    "5": "New industry clouds"
  },
  "links": {
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Dynamics 365": "https://www.techradar.com/news/microsoft-launches-dynamics-365-commerce",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1407280006818392600&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fblog%2F2021%2F02%2F24%2Fnew-industry-clouds-offer-launchpad-for-innovation%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-unveils-new-cloud-platforms-focused-on-industry",
    "cloud services": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know"
  }
}