{
  "source": "https://www.techradar.com/news/microsoft-onedrive-gets-a-much-needed-overhaul",
  "title": "Microsoft OneDrive is getting a much-needed overhaul",
  "category": "computing",
  "updated": "2021-02-04T14:32:08Z",
  "author": "barclay-ballard",
  "summary": "Android users will receive some exciting new features",
  "article": [
    "The Android version of Microsoft’s file-hosting service, OneDrive, has received a significant update. The new features include a revamped home screen, as well as support for Samsung Motion Photos and 8K video playback.",
    "The most notable change, of course, will be the updated home screen, which will now include three main sections for personal account holders: recently accessed files, offline files, and “On This Day” photos.",
    "Work or school account holders, meanwhile, will see shared libraries in place of the “On This Day” feature. Fans of the old home screen can still access the root view of their files by clicking the Files tab.",
    "“The updated home experience now appears on both OneDrive for Android and, as previously announced, on OneDrive for iOS,” Paul Diamond, the product marketing manager for Microsoft OneDrive, explained. “It’s available for OneDrive work, school and home accounts. To get the new home experience on your Android device, you will need Android version 6.0 or higher and OneDrive for Android version 6.21 or above.”",
    "Other noteworthy additions to OneDrive center on its video playback functionality. OneDrive Android users will now be able to play Samsung Motion Photos – a recently launched feature that allows Samsung device owners to capture a few seconds of live video before a picture is taken.",
    "In addition, although OneDrive has always allowed storage of 8K videos, owners of select Android devices will now be able to play those videos back within the OneDrive app. Individuals with the Samsung Galaxy S20 or the S21 series will now have the option of viewing full-resolution 8K videos from their smartphone.",
    "The new OneDrive update, which has previously been launched for users of the iOS app, is available now for Android users .",
    "Via 9to5Google"
  ],
  "headers": {
    "4": "Microsoft's Samsung partnership"
  },
  "links": {
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3879897859039957000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-onedrive-blog%2Fonedrive-for-android-updates%2Fba-p%2F1953515&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-onedrive-gets-a-much-needed-overhaul",
    "9to5Google": "https://9to5google.com/2021/02/03/microsoft-onedrive-for-android-receives-homescreen-overhaul-8k-video-playback-support/amp/"
  }
}