{
  "source": "https://www.techradar.com/news/new-ipad-pro-could-be-very-hard-to-buy",
  "title": "New iPad Pro could be very hard to buy",
  "category": "tablets",
  "updated": "2021-04-12T08:43:02Z",
  "author": "tom-bedford",
  "summary": "Stock shortages to blame",
  "article": [
    "We've been hearing the new iPad Pro could launch some time in April, and news of its design, processor and more have been trickling in for months now. The latest piece of information is bad news though, and it surrounds the tablet's display.",
    "According to a report written by Bloomberg, Apple is struggling to acquire enough displays for its upcoming iPad Pro models - rumors suggest the slate was set to use Mini LED technology for its screens, and the report says there's trouble on that front.",
    "It's not exactly clear why there aren't enough screens being produced, but apparently the report does say at least one manufacturer has ceased making the displays, which suggests it's a production or sourcing issue.",
    "There's an ongoing chipset shortage affecting technology around the world, which apparently could continue into 2021, but by the sounds of things this is a separate issue.",
    "If Apple is struggling to source screens for its iPad Pros, it's very likely there will be fewer iPad Pros to buy as a result.",
    "This could make buying one of the new tablets around launch harder than expected. We saw a similar thing happen with the iPad Air 4, which was pretty hard to buy on release, and some buyers had to wait a while before picking one up.",
    "So if you're keen to buy a new iPad Pro, you should keep your eyes peeled for a release date announcement, as this day could be vital for your acquiring the tablet within the first few months of it being announced.",
    "Alternatively, rumors suggest the new iPad Pro won't be much different from the iPad Pro 2020, which itself only had a few upgrades from the 2018 models. If you don't need top processing power, consider one of those older iPad Pros, or even the iPad Air 4 which has a lot in common with them."
  ],
  "headers": {
    "4": "Fewer iPad Pros to buy"
  },
  "links": {
    "new iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "design": "https://www.techradar.com/news/new-ipad-pro-ipad-mini-design-leaked",
    "processor": "https://www.techradar.com/news/new-ipad-pro-2021-might-be-as-powerful-as-the-latest-macs",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-04-12/apple-facing-supply-shortage-of-upcoming-high-end-ipad-display",
    "apparently could continue into 2021": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad Pro 2020": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "2018 models": "https://www.techradar.com/reviews/ipad-pro-11"
  }
}