{
  "source": "https://www.techradar.com/news/intel-i9-11900k-revealed-to-have-11-faster-storage-than-ryzen-9-5950x",
  "title": "Intel i9-11900K revealed to have 11% faster storage than Ryzen 9 5950X",
  "category": "computing",
  "updated": "2021-02-24T11:10:47Z",
  "author": "jess-weatherbed",
  "summary": "Blazing fast Gen 4 performance",
  "article": [
    "Intel’s Core i9-11900K is rumored to be launching as soon as March 2021, but the unreleased Rocket-Lake-S flagship is already making some gains against rival AMD's 16-core Zen 3-based counterpart, the Ryzen 9 5950X.",
    "A performance comparison graph was posted to Twitter by Intel's Chief Performance Strategist Ryan Shrout that compares the two CPUs, and acts as the first official benchmark for the new i9-11900K processor.",
    "The test highlights the Gen 4 performance comparison between the two flagships, with the Core i9-11900K achieving an 11% faster result than the 5950X in PCMark 10's Quick System Drive Benchmark. It's important to point out that this is purely a comparison of the Gen 4 performance capabilities, and isn't reflective of the general performance we could expect since the AMD Ryzen 9 5950X has more cores and threads than the Core i9-11900K. The benchmark used a PCI Gen4 compatible 1TB Samsung 980 Pro that was attached to the PCIe riser to use CPU lanes rather than chipset lanes, as well as 32GB of DDR4-3200 MHz memory, the same software and OS versions, and an NVIDIA RTX 3090 graphics card for consistency. The full system configurations for the test as well as additional details can be found on the official Intel website. Intel is currently fighting against AMD to retain its crown in the gaming market, but this will depend on exactly where Intel decides to pitch the new Rocket Lake CPUs in terms of their pricing. The latest speculation we’ve heard on that front sounds quite positive, with the possibility that the 11900K may come in at a cheaper level than the Comet Lake flagship, and that would certainly make for strong competition for AMD.",
    "Via Neowin"
  ],
  "headers": {
    "2": "Head to head"
  },
  "links": {
    "as soon as March 2021": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "official Intel website.": "https://edc.intel.com/content/www/us/en/products/performance/benchmarks/11th-generation-intel-core-processors/",
    "11900K may come in at a cheaper level than the Comet Lake flagship": "https://www.techradar.com/news/intel-rocket-lake-leak-suggests-core-i9-11900k-could-get-a-price-cut-to-compete-with-amd",
    "Neowin": "https://www.neowin.net/news/intel-touts-faster-pcie-40-storage-performance-on-its-upcoming-rocket-lake-s-against-ryzen/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+neowin-main+%28Neowin+News%29"
  }
}