{
  "source": "https://www.techradar.com/news/ps5-stick-drift-might-be-inevitable-according-to-this-comprehensive-teardown",
  "title": "PS5 drift problem might be inevitable – here's why",
  "category": "gaming",
  "updated": "2021-02-22T17:09:24Z",
  "author": "adam-vjestica",
  "summary": "Nintendo and Xbox controllers are also prone to drift",
  "article": [
    "PS5 stick drift might be inevitable, due to predictable flaws in how the joystick hardware is designed. The problem causes a controller to register false inputs, which leads to your character or crosshair moving entirely on its own.",
    "A fascinating teardown from iFixit delved into the components found in the PS5 DualSense controller, Nintendo Switch Pro Controller and Xbox Series X controller, and concluded that all the gamepads are using ageing off-the-shelf joystick modules that have a known life expectancy.",
    "Should a problem occur with either controller, it’s extremely difficult to repair the joysticks without soldering gear, meaning quick fixes are out of the question for the average consumer.",
    "A product sheet from manufacturer Alps outlines that the operating life of the potentiometers used by the PS5 DualSense controllers is two million cycles. Now, that might sound like a lot, but iFixit’s teardown engines discovered it’s actually worryingly low.",
    "Playing Call of Duty: Modern Warfare (2019), which requires a lot of analog input and interactions, the tester found that, hypothetically, your controller’s joystick could become faulty after four to seven months of use, if you capped your game time to two hours a day.",
    "There’s no guarantee that you will experience stick drift at that point (you might get lucky or discover a fault sooner), but the sensors and parts used in a controller are used as a “wilful cost-saving calculation on the consoles makers’ part”, according to iFixit.",
    "If that wasn’t bad enough, iFixit determined that there are four main causes of stick drift: sensor wear, spring fatigue, material stretching and grime, dust, moisture and other gunk. Sensor wear is the hardest to avoid, as this will naturally occur over time, and spring fatigue is also similarly susceptible to the rigors of playing a game.",
    "Material stretching is also a factor. This can result in a joystick feeling loose, but not necessarily drifting, as you press hard on the sticks over a continuous period of time: like when playing a driving game.",
    "Finally, there is one area that we might have a bit more joy in combating: grime, dust, moisture and other gunk. Many users have had success eliminating stick drift by cleaning out a controller's build up of dirt using compressed air, contact cleaner, and/or isopropyl alcohol. This isn’t a sure fire fix, though, and can often just move stuff around or delay the inevitable. Do what you can to keep your controllers clean, then, like washing Cheetos’ dust off your fingers, and not leaving your pads out to sit and gather dust.",
    "Of course, as iFixit rightly points out, the real fix to PS5 DualSense or Xbox One stick drift is for console manufacturers to use more durable and higher-quality components. It’d probably turn out cheaper in the long run, particularly if Nintendo loses some of the lawsuits that have been filed against it over Joy-Con drift, including one from a child."
  ],
  "headers": {
    "6": "The frustrating four",
    "9": "Drifter"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "iFixit": "https://www.ifixit.com/News/48944/heres-why-ps5-joysticks-drift-and-why-theyll-only-get-worse",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Xbox Series X controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Call of Duty: Modern Warfare (2019)": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review",
    "Xbox One stick drift": "https://www.techradar.com/news/an-angry-gamer-is-suing-microsoft-over-xbox-one-controller-stick-drift-issue",
    "Nintendo loses some of the lawsuits": "https://www.techradar.com/news/is-your-switch-controller-drifting-nintendo-faced-with-lawsuit-over-joy-con-issues",
    "from a child": "https://www.techradar.com/news/now-nintendo-is-being-sued-by-a-child-over-joy-con-drift"
  }
}