{
  "source": "https://www.techradar.com/news/microsoft-is-giving-the-outlook-calendar-a-feature-packed-facelift",
  "title": "Microsoft is giving the Outlook Calendar a feature-packed facelift",
  "category": "computing",
  "updated": "2021-03-02T18:23:31Z",
  "author": "jess-weatherbed",
  "summary": "On Board productivity",
  "article": [
    "Microsoft has announced new features expected for Outlook for Windows 10 and mobile, with a new look for the existing calendar coming in the form of the Outlook Calendar Board. This updated view will allow for a more user-friendly experience by removing the rigid grid view and replacing it with a more customizable experience. You'll be able to better organize your workday with task lists, file attachments, links, reminders, and more directly through the Calendar board without having to use external applications.",
    "This new free-form Board view will allow you to set up a customizable space befitting your personal needs. According to Microsoft, \"on average, people use six tools to track all the things they need to get done\", so this new calendar tool should better optimize the Outlook workspace to reduce the number of external programs required for productivity. Outlook web users can try this for themselves right now – just expand your calendar and select \"Board\" in the views dropdown located at the top right of your page. We don't know when or if this will be coming to mobile devices or apps. Another feature heading to Outlook users is intelligent scheduling assistance. This will suggest optimal timeslots for your meetings that check availability with invited meeting attendees to ensure that everyone is free to attend. If this isn't possible, Outlook will help you move any scheduling conflicts. There hasn't been confirmation on when we will see this new feature going live for desktop, but you can read more about it on Microsoft's official announcement blog post. Mobile users should see the new 'suggested times' feature rolled out in the coming month.",
    "Via Neowin"
  ],
  "headers": {},
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Microsoft's official announcement blog post.": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1151552729983989200&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Foutlook-blog%2Feveryone-needs-some-extra-time%2Fba-p%2F2164356&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-giving-the-outlook-calendar-a-feature-packed-facelift",
    "Neowin": "https://www.neowin.net/news/microsoft-outlook-is-getting-a-new-calendar-look/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+neowin-main+%28Neowin+News%29"
  }
}