{
  "source": "https://www.techradar.com/news/this-oculus-quest-2-hack-frees-you-from-facebook-but-at-what-cost",
  "title": "This Oculus Quest 2 hack frees you from Facebook, but at what cost?",
  "category": "wearables",
  "updated": "2021-10-08T16:17:40Z",
  "author": "rhys-wood",
  "summary": "Don't like being tethered to the social network? Understandable.",
  "article": [
    "An Oculus Quest 2 tool known as Oculess is offering users of the VR headset a way to unlink the device from their Facebook accounts, which is a necessity to use the headset under normal circumstances.",
    "As reported by UploadVR, Oculess essentially does what it says on the tin. It's a sideloaded program that unlinks your Facebook account, allowing you to play games with the Quest 2 without the need to be tethered to the social network.",
    "If you've yet to set up your Oculus Quest 2 device, though, you will still need to connect a Facebook account in order to complete the setup. However, once that's out of the way, you're free to add sideloaded programs to your Quest 2 headset, promptly removing the account link should you so choose.",
    "There's some caveats to bear in mind, though. By unlinking your Facebook account through Oculess, you'll lose access to the Oculus store, as a Facebook account is required to sign into the store. That means you won't be able to download and play Oculus-exclusive titles like the upcoming Resident Evil 4 VR.",
    "Oculus TV and the Oculus browser will also cease to function, as you might guess, these also require you to be signed into a Facebook account to function. But if you're not planning on watching TV or browsing the web with your Quest 2 headset anyway, this is a small price to pay for freedom from Facebook.",
    "While it may sound like using Oculess takes away many privileges that require a Facebook account to be connected, it's not the end of the world. SideQuest, the sideloading app that you'll probably need to use Oculess in the first place, will also allow you to download and use hundreds of third party apps that can replace the pre-installed Quest 2 amenities.",
    "For browsers, for example, Firefox Reality can be sideloaded to replace the default Oculus browser, and as it's Firefox, it's probably a lot better than what comes pre-installed in the Quest 2.",
    "Sideloading also gives you access to tons of experimental VR games and VR ports, such as Half-Life VR, Quake 2 VR and - strangely enough, Pokemon VR as well. While you lose a lot of conveniences by unlinking that Facebook account, sideloading apps via SideQuest can more than make up for it if you're willing to learn how to do it properly."
  ],
  "headers": {
    "5": "Analysis: Forget the main story, let's check out the SideQuest"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "UploadVR": "https://uploadvr.com/oculess-unlink-facebook-quest-2/",
    "Resident Evil 4 VR": "https://www.techradar.com/news/resident-evil-4-vr-resurrects-the-classic-game-for-oculus-quest-2",
    "Oculus TV": "https://www.techradar.com/news/oculus-tv-lets-you-watch-shows-movies-and-more-on-oculus-go",
    "Firefox Reality": "https://www.techradar.com/news/mozilla-launches-firefox-reality-vr-web-browser",
    "Half-Life VR": "https://www.techradar.com/how-to/how-to-play-half-life-1-and-half-life-2-in-vr"
  }
}