{
  "source": "https://www.techradar.com/news/china-could-soon-overtake-the-us-in-low-code-adoption",
  "title": "China could soon overtake the US in low code adoption",
  "category": "computing",
  "updated": "2021-09-01T01:35:59Z",
  "author": "anthony-spadafora",
  "summary": "The pandemic helped spur low code adoption",
  "article": [
    "In addition to accelerating the global appetite for website building, the pandemic has also led to a surge in low code adoption according to new research from Mendix.",
    "The Siemens-owned software company surveyed 2,025 individuals including 1,209 IT pros and 816 software developers in the US, China, UK, Germany, Belgium and the Netherlands to compile its new “The State of Low-Code 2021: A Look Back, The Light Ahead” report.",
    "The report's findings revealed that 77 percent of enterprise in six countries have already adopted low code while 75 percent of IT leaders said “it's a trend they can't afford to miss”. In addition to allowing organizations to develop custom applications faster, low code also removes the barriers associated with traditional programming while making software development more accessible to a broader range of people.",
    "As low code adoption has increased, the number of staff needed to develop software and the costs to do so have also risen significantly. For instance, nearly six in 10 (57%) of IT pros said the number of staff needed for software development is increasing at a time when 76 percent of respondents said that demand for developers has reached a fever pitch.",
    "Mendix's report also took a closer look at which countries and regions have already adopted low code to discover that four-fifths of US organizations have done so compared to 75 percent in China and 74 percent in Europe.",
    "However, 90 percent of Chinese IT pros are eagerly embracing low code which suggests that China could soon overtake the US as the global low code leader. In fact, the Chinese are also the most likely to consider low code to be a trend they can't afford to miss (84% vs 72% globally).",
    "In the US, the greatest barrier to low code adoption is being tied to legacy systems that are still running core and mission-critical workloads. US organizations that are not yet using low code also suggested that other barriers include reluctance from IT decision makers (28% vs 19% globally) and reluctance from business decision makers (25% vs 18% globally).",
    "As more low code platforms become available and demand for custom software continues to remain high, we'll likely see even more organizations adopting low code in order to take some of the strain off of their developers."
  ],
  "headers": {
    "4": "US leads for now"
  },
  "links": {
    "global appetite for website building": "https://www.techradar.com/news/global-appetite-for-website-building-reaches-new-highs-during-pandemic",
    "low code": "https://www.techradar.com/news/oracle-wants-to-drastically-simplify-app-development-with-new-low-code-service",
    "Mendix": "https://www.techradar.com/news/top-tech-conferences-the-ultimate-tech-events-and-show-guide",
    "The State of Low-Code 2021: A Look Back, The Light Ahead": "https://www.mendix.com/resources/the-state-of-low-code-report/",
    "custom applications": "https://www.techradar.com/news/why-businesses-are-turning-to-low-code-for-their-custom-applications",
    "programming": "https://www.techradar.com/news/its-official-these-are-the-most-hated-programming-languages-around",
    "demand for developers": "https://www.techradar.com/news/developers-enjoying-higher-uk-paychecks",
    "legacy systems": "https://www.techradar.com/news/critical-us-infrastructure-can-be-hacked-by-anyone",
    "low code platforms": "https://www.techradar.com/news/why-the-low-code-industry-is-in-for-a-reckoning"
  }
}