{
  "source": "https://www.techradar.com/news/nvidia-dlss-now-boosts-frame-rates-in-vr-games",
  "title": "Nvidia DLSS now boosts frame rates in VR games",
  "category": "computing",
  "updated": "2021-05-19T08:15:12Z",
  "author": "darren-allan",
  "summary": "No Man’s Sky update will make VR mode a much smoother experience",
  "article": [
    "Nvidia has announced DLSS support for a bunch of new games, including the first time that the frame rate boosting technology has come to VR titles.",
    "VR gaming is a good area to apply DLSS, of course, seeing as these games demand super-smooth frame rates to look and feel real (and choppy motion can be particularly off-putting in VR, possibly exacerbating any of the dreaded motion sickness effects some players might experience).",
    "The good news for VR headset owners is that No Man’s Sky is getting DLSS support in an upcoming update for the game. In VR mode, applying DLSS doubles performance at ‘ultra’ graphics settings for No Man’s Sky, Nvidia claims. Team Green further asserts that this means you can maintain 90 frames per second (fps) on ‘ultra’ details with a GeForce RTX 3080 graphics card using an Oculus Quest 2.",
    "No Man’s Sky will receive a seriously impressive frame rate boost outside of VR, too, with DLSS increasing performance by up to 70% at 4K resolution. At 4K, running DLSS in ‘performance’ mode, an RTX 3060 GPU (with Ryzen 5900X CPU) hits an average of 71 fps, compared to 41 fps without DLSS. An RTX 3070 achieves 100 fps with DLSS, compared to 57 fps without.",
    "Other VR titles that are getting DLSS support include Into The Radius, a survival shooter, and Wrench, which gets DLSS in an update today, boosting performance by up to 80% according to Nvidia. Wrench, which is a motorsport mechanic simulator that majors in realism (still in early access), also gets ray tracing too (not just for the VR version, but the normal game as well).",
    "Aside from these, a number of other games are getting DLSS, namely the following: Amid Evil, Aron’s Adventure, Everspace 2, Redout: Space Assault, and Scavengers. Nvidia further reminds us that Metro Exodus PC Enhanced Edition was updated with DLSS earlier in May, offering up to a doubling of frame rates.",
    "In total, over 50 games now support DLSS (and we’ve rounded up the best DLSS-powered games right here). Nvidia also let us know that its latest Game Ready driver adds support and optimization for Days Gone which just came out on PC."
  ],
  "headers": {
    "4": "Heart wrenching"
  },
  "links": {
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "VR gaming": "https://www.techradar.com/best/the-best-vr-games",
    "No Man’s Sky": "https://www.techradar.com/news/no-mans-sky-companions-update-lets-you-adopt-alien-monstrosities",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "best DLSS-powered games right here": "https://www.techradar.com/news/dlss-games-top-titles-that-support-nvidias-exciting-tech",
    "Days Gone which just came out on PC": "https://www.techradar.com/news/ps4-survival-game-days-gone-hits-pc-in-may"
  }
}