{
  "source": "https://www.techradar.com/news/no-time-to-die-in-dolby-atmos-and-vision-has-ruined-cinemas-for-me",
  "title": "No Time To Die in Dolby Atmos and Vision has ruined cinemas for me",
  "category": "televisions",
  "updated": "2021-10-06T10:03:59Z",
  "author": "gerald-lynch",
  "summary": "A year spent watching films at home hasn’t helped my return to cinemas, either",
  "article": [
    "After months spent mostly watching movies at home, I’ve been to the cinema to see two films this week – the return of James Bond in No Time to Die, and Marvel’s latest blockbuster, Shang-Chi and the Legend of the Ten Rings. Both were great, and right up my street – so why did I enjoy No Time to Die so much more?",
    "The answer is simple. I saw No Time to Die at the new Odeon Luxe cinema in central London, complete with Dolby Vision HDR screen and Dolby Atmos overhead surround sound, while I saw Shang-Chi at my poor old standard multiplex. And I fear I can never go back.",
    "There is now an increasingly widening gulf between the quality of the presentation at a high-end cinema, and that of standard projection at the majority of other cinemas.",
    "Dolby Vision cinema screens are capable of hugely enhanced colors, brightness and contrast levels thanks to the company’s proprietary HDR system, projected using dual Christie 4K 6P modular laser projectors. Dolby Atmos audio, on the other hand, envelopes the listener in sound across as many as 64 individual speakers.",
    "In combination at a Dolby Cinema, the result is a breathtaking, immersive experience, with visuals that pop and sound that explodes around you.",
    "Seeing Bond and Shang-Chi more or less back to back then was eye-opening. Here are two great action films, which should burst with life and color. Except one, Bond, looked like it had been filmed in the future, while the other, Shang-Chi, actually reminded me of those dodgy VHS cinema pirates that had been filmed on a camcorder.",
    "You remember the sort – the type where you can hear the audience laughing, and see someone standing up to go to the loo. Bond’s action scenes, on the other hand, were ablaze with dazzling lights and vibrancy, with equally explosive sound, Shang-Chi just looked washed out – its fantastical elements drab, and its darker scenes bereft of detail.",
    "And keep in mind that both are available in Dolby Vision and Atmos – Shang-Chi could have looked just as good, had I sought out the premium cinema format elsewhere.",
    "My love of the Dolby experience is shared by professionals. Speaking recently to TechRadar, No Time to Die director Cary Joji Fukunaga shared his praise for the system.",
    "“With Bond in Dolby Atmos and Dolby Vision, anything that heightens the immersive experience of the audience, that transports them in a way, when that low bass kicks and just kind of shakes their guts. That's what I'm aiming for,” he told us.",
    "“I think that the mix is pretty incredible,” praised Fukanaga, who uses both old and new shooting technologies in tandem.",
    "“Paul [Massey, re-recording mixer] and Oliver [Tarney, supervising sound editor] and everyone did an amazing job with that. And then on a picture level shooting on 35mm and then 5-perf 70mm and 15-perf have provided an amazing base medium to create a gorgeous final image I'm very happy with.",
    "“This may be, you know, one of the more beautiful films I've ever worked on, so you know I'm hoping that Bond fans will also feel that cinematically it's one of the most beautiful Bond films.”",
    "There are of course exceptions to the rule that cutting edge presentations are best. My favorite cinema in the world, London’s Prince Charles Cinema, does excellent well-worn screenings of classic films in ageing analogue 35mm reels – the pop and fizzle of the image bringing the same warmth to the experience as vinyl lovers enjoy.",
    "The Prince Charles largely gets a pass on image quality as its schtick is mostly about presenting classic films in the same format as when they were originally released.",
    "But once you know that the latest blockbuster releases have been digitally mastered for the likes of Dolby Vision and Atmos, it’s hard not to feel short changed when you pay to see a film only to be presented with a washed out grey screen and timid sound.",
    "It’s a problem exacerbated by the Covid-19 lockdown’s move to home cinema releases. I recognise that I’m fortunate in being in the minority to enjoy the pleasure of having a HDR 4K screen hooked up to Atmos speakers at home. But the level of detail in both sound and picture that I can get without leaving the house now far outstrips what I see at an average cinema – and the snacks are cheaper too.",
    "And so I’m now spoiled. I love the atmosphere of a night at the cinema, but I can’t live with the knowledge that on average I get a better experience at home. It’s either that, or cough up the extra cash to head to one of the rare and exclusively-priced Dolby Cinemas for a Vision and Atmos screening. It’s worth it – but not the sort of thing the average punter can afford every time a new film comes out.",
    "So until Dolby Cinema is the norm, I’ll be saving my most hotly-anticipated watches for a Dolby Vision and Dolby Atmos theater. For everything else? I’ll wait for the 4K Blu-ray."
  ],
  "headers": {
    "5": "An eye-opener",
    "13": "Old exceptions and future expectations"
  },
  "links": {
    "No Time to Die": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-first-reactions-heres-what-the-critics-thought",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Speaking recently to TechRadar": "https://www.techradar.com/news/no-time-to-die-is-the-most-beautiful-bond-film-says-director-cary-joji-fukunaga"
  }
}