{
  "source": "https://www.techradar.com/news/totally-rated-finally-pictures-of-spider-man",
  "title": "Totally Rated: Finally, pictures of Spider-Man",
  "category": "gaming",
  "updated": "2021-08-27T16:23:12Z",
  "author": "rhys-wood",
  "summary": "Spider-Man: No Way Home, Samsung and Gamescom 2021 feature on this week's Totally Rated",
  "article": [
    "In this week’s Totally Rated, we finally got the Spider-Man: No Way Home trailer we've been waiting so long for, and it's packed full of surprises for Marvel fans both new and old.",
    "TechRadar's Matt Swider takes a deep dive with the Samsung Galaxy Z Fold 3 5G, which could actually be the harbinger that foldable phones have sorely needed.",
    "In gaming news, Gamescom 2021 happened over the last week, and we were treated to announcements for several new games, including the Saints Row reboot, Marvel's Midnight Suns and much, much more.",
    "We've known that a potential Saints Row 5 has been in the works at Volition for a while, but we got to see it firsthand at Gamescom 2021, thanks to the Geoff Keighley-presented Opening Night Live, where the rebooted Saints Row trailer kicked off the show.",
    "We were treated to a delightful CG clip, showing the series is going back to its gangland roots, ditching the shark jumping madness of the latter games in the series while maintaining the over-the-top silliness that made Saints Row so special.",
    "Of course, the Saints weren't the only gang on the block. Prior to Opening Night Live, Xbox held its own stream. It was a bit of a damp squib with no genuinely huge announcements, but we did get to see more of Forza Horizon 5, which looks better and better each time we see it.",
    "Opening Night Live itself was packed with impressive showings, however. We got a December 8 release date for Halo Infinite, a fresh look at Lego Star Wars: The Skywalker Saga and the remarkably baffling DokeV.",
    "This week, TechRadar updated its Samsung Galaxy Z Fold 3 review and as it might be the device that actually convinces us of the future of the foldable phone, we thought we’d update you too, with the help of our US Editor-in-Chief Matt Swider.",
    "The latest episode of Totally Rated features a breakdown of the phone, its features, and a discussion on why it's the best foldable phone to date. Be sure to check it out, or read our review linked above for a more thorough deep dive into why we love the Samsung Galaxy Z Fold 3 so much.",
    "Finally, after months and months of waiting, speculation and no shortage of insanity, we got a trailer for the much-anticipated Spider-Man: No Way Home!",
    "It’s been long rumored that the movie would feature many returning characters and actors from the previous Spider-Man films, and we think we may have spotted a couple of clues that could lead to even more familiar faces making a comeback.",
    "Grab your shiniest tin foil hat, as we could've sworn we saw Charlie Cox's Daredevil in the trailer, complete with a sign that could hint the lawyer will legally represent Peter Parker in the movie. That, or it's a giant red herring and Marvel's playing us.",
    "Other hints were a little more blatant. Not only is Alfred Molina reprising his role as Doctor Octopus (gloriously revealed at the end of the trailer) but we also saw a pumpkin bomb accompanied by a very familiar sounding laugh.",
    "Could Willem Dafoe also be reprising his role as the Green Goblin? We certainly hope so, as Norman Osborn was arguably one of the more compelling - and entertaining - characters in Sam Raimi's Spider-Man trilogy.",
    "Going back to Doc Ock for a moment, the good doctor is able to address Peter by name. Surely he'd only recognize the Tobey Maguire version of Parker? If so, we could well see some multiverse shenanigans happen in No Way Home, thanks in no small part to Doctor Strange, of course.",
    "Suffice to say, we're extremely excited to watch Spider-Man: No Way Home this December. We're sure the trailer wasn't being entirely sincere with us, so we can't wait to see where we were right, and where we were being misled.",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every week."
  ],
  "headers": {
    "3": "The Third Street Saints are back!",
    "7": "Samsung Galaxy Z Fold 3: the best foldable ever?",
    "9": "Spider-Man: No Way Home's trailer was awesome"
  },
  "links": {
    "Saints Row reboot": "https://www.techradar.com/news/saints-row-reboot-is-out-next-year-and-it-looks-just-as-bonkers-as-youd-hope",
    "Marvel's Midnight Suns": "https://www.techradar.com/news/marvels-midnight-suns-brings-xcom-tactics-to-a-comic-book-rpg",
    "Saints Row": "https://www.techradar.com/news/saints-row-reboot-what-can-we-expect-to-see-from-volitions-next-game",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "DokeV": "https://www.techradar.com/news/dokev",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/forget-the-leak-watch-the-official-spider-man-no-way-home-trailer-right-here"
  }
}