{
  "source": "https://www.techradar.com/news/stranger-things-season-4-will-release-in-2022-as-netflixs-big-shows-finally-return",
  "title": "Stranger Things season 4 will release in 2022, as Netflix's big shows finally return",
  "category": "entertainment",
  "updated": "2021-08-06T14:28:14.185Z",
  "author": "axel-metz",
  "summary": "The comeback is on for Netflix",
  "article": [
    "After a so-so year for the streamer, Netflix is finally getting its big shows back on the service.",
    "We’ve already got release dates (or months) for highly-anticipated series like The Witcher season 2, Cobra Kai season 4 and Sex Education season 3 – and now, thanks to a new teaser trailer, we also know that Stranger Things season 4 will definitely be returning in 2022.",
    "Initially expected to release this year, the mega-popular sci-fi show was hampered by pandemic-related production delays, with filming halted in March last year and not resuming until September. With a 2022 arrival now confirmed, we're hoping Stranger Things will return in the early months of next year.",
    "Season 4 of the show is set to be the most ambitious yet, with the plot moving away from Hawkins and into new locations in both the US and Russia following Jim Hopper’s supposed death and Eleven’s relocation.",
    "\"As much as it pains our viewers that it will have been so long,” executive producer Shawn Levy recently told Collider, “we chose season 4 to be by far – and I mean by far – the most ambitious of the seasons.\"",
    "In this latest teaser, we get only a small taste of that ambition. Interspersed with clips from previous episodes is some blink-and-you’ll-miss-it new footage showing a flame-throwing Hopper and some new shots of the young cast. All the usual suspects return, so we’re expecting more of the same supernatural hijinks from Dustin, Mike and the gang.",
    "As for why Netflix has decided to share such a tenuous release window for the show now, rather than waiting until later in the year to confirm a single date, speaks to the streamer’s efforts to promise its subscribers that quality content is on the way. It also ends speculation about the prospect of the show returning this year, which always seemed unlikely after the filming delay.",
    "Netflix has certainly had a quieter year when it comes to its big, returning series – it hasn't stopped it producing new hits like Shadow and Bone, Sex/Life or Sweet Tooth, but a lot of its most popular programming has been slow to emerge thanks to the pandemic. This summer, in particular, has yielded a noticeably drier library of original content.",
    "What’s more, with the likes of Disney Plus and HBO Max seemingly benefiting from excellent new additions – and viewers – every week, the pressure is on Netflix to double-down on its flagship franchises in the coming year to recoup lost prestige.",
    "This latest tease for Stranger Things’ fourth season will go some way to reminding subscribers why Netflix has proved so popular in the last decade – but its golden geese will need to deliver the goods when they do eventually arrive."
  ],
  "headers": {},
  "links": {
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Cobra Kai season 4": "https://www.techradar.com/news/cobra-kai-season-4",
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-finally-has-a-release-date-netflix-confirms",
    "Stranger Things season 4": "https://www.techradar.com/news/stranger-things-season-4",
    "the most ambitious": "https://www.techradar.com/news/stranger-things-4-is-taking-so-long-because-its-ambitious-but-filming-is-nearly-done",
    "Collider": "https://collider.com/why-stranger-things-season-4-taking-so-long-shawn-levy/",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained"
  }
}