{
  "source": "https://www.techradar.com/news/surface-pro-8-rumor-suggests-microsoft-is-hiking-prices",
  "title": "Surface Pro 8 rumor suggests Microsoft is hiking prices",
  "category": "computing",
  "updated": "2021-04-13T15:49:34Z",
  "author": "darren-allan",
  "summary": "Remember there’s no 4GB entry-level model, going by the rumor mill",
  "article": [
    "Microsoft’s Surface Pro 8 is expected to be revealed this month – maybe even very shortly at CES – and rumored pricing for the upcoming Surface Pro range is now floating around on Twitter. The price tags provided have raised some eyebrows, even if we obviously can’t jump to the conclusion that these will be the actual retail prices – take everything here with a healthy amount of skepticism.",
    "As shared in a tweet from well-known leaker Roland Quandt, Microsoft is seemingly ditching the 4GB option for Surface Pro 8 models (as we’ve heard already).",
    "The Surface Pro 7 starts with a Core i3-toting hybrid with 4GB RAM and 128GB storage, but apparently the Pro 8 will offer a Core i3 entry-level product with 8GB RAM (but still 128GB when it comes to the SSD).",
    "As you can see, the new entry-level Surface Pro 8 will start at $899.99 – remember this is just rumored pricing, though – compared to the $749.99 that Microsoft is asking for the basic Pro 7 (with 4GB) currently.",
    "That’s a fair old leap, of course, although arguably it makes sense to get rid of the 4GB option, which is, let’s face it, definitely on the lean side for a device which is targeted at pro usage.",
    "Comparing other prices further down the range, if we look at the Surface Pro 8 with the Core i5 processor, 8GB of RAM and 256GB storage, that will apparently have a price tag weighing in at $1,299.99 – with the Pro 7 costing $100 less for the equivalent loadout. And indeed that $100 price hike continues throughout the range into the higher-end models.",
    "These are, as ever, prices for just the tablet, not including the Type Cover keyboard, and the fact that Microsoft may be set to ask a chunk more for the new Surface Pro certainly hasn’t gone down particularly well on Twitter. Especially as it doesn’t seem like the Surface Pro 8 is set to make any major advancements (once again); in the leaks we’ve seen, the new device keeps pretty much the same design as the Pro 7 (a design which hasn’t been altered for a long time, for that matter).",
    "Yes, you will get a new and improved processor model, that’s pretty much a given, with speculation pointing to an 11th-gen Tiger Lake CPU, which should provide a nice boost on the performance front.",
    "There will also purportedly be a new 32GB option, further driving home the ‘pro’ status of Microsoft’s hybrid, and you can see that listed in the pricing above as well – it’ll set you back an eye-watering $2,799.99.",
    "The Surface Pro 8 was spotted in a recent FCC filing which indicated that it will use Wi-Fi 6, as you might expect, and there will be LTE options as we can see in this leak too (you’ll pay an extra $150 for LTE models, according to Quandt).",
    "Via MSPoweruser"
  ],
  "headers": {
    "6": "Big ask?"
  },
  "links": {
    "Microsoft’s Surface Pro 8": "https://www.techradar.com/reviews/microsoft-surface-pro-8",
    "CES": "https://www.techradar.com/news/ces-2021-highlights",
    "Surface Pro": "https://www.techradar.com/reviews/microsoft-surface-pro-6",
    "as we’ve heard already": "https://www.techradar.com/news/microsoft-surface-pro-8-looks-set-to-launch-soon-with-the-latest-wi-fi-tech",
    "leaks we’ve seen": "https://www.techradar.com/news/new-microsoft-surface-pro-8-rumor-brings-good-news-and-bad-news",
    "speculation pointing to": "https://www.techradar.com/news/surface-pro-8-prototype-apparently-shows-up-again-this-time-with-benchmarks",
    "Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake",
    "recent FCC filing which indicated that it will use Wi-Fi 6": "https://www.techradar.com/news/microsoft-surface-pro-8-looks-set-to-launch-soon-with-the-latest-wi-fi-tech",
    "MSPoweruser": "https://mspoweruser.com/microsoft-surface-pro-pricing/"
  }
}