{
  "source": "https://www.techradar.com/news/diablo-2-resurrected-pc-system-requirements-revealed-and-mod-support-confirmed",
  "title": "Diablo 2 Resurrected PC system requirements revealed – and mod support confirmed",
  "category": "computing",
  "updated": "2021-02-21T10:10:04.755Z",
  "author": "darren-allan",
  "summary": "No hellish spec demands, fortunately",
  "article": [
    "Diablo 2 Resurrected has just been announced at BlizzCon 2021, with Blizzard now revealing the PC requirements for the incoming remaster – and confirming that mods will be supported, to boot.",
    "What kind of system will you need to run Diablo 2 Resurrected, then? Fortunately, the requirements aren’t particularly demanding from a contemporary gaming perspective, although the recommended spec – for 1080p resolution – does call for 16GB of system memory (an increasing trend these days).",
    "Here are those PC spec requirements in full.",
    "Minimum requirements (720p)",
    "Recommended requirements (1080p)",
    "So as you can see, there’s nothing traumatic here, and indeed the bare minimum requirements are very easy-going – although note that this is for running the game at 720p resolution, which isn’t going to look great, of course.",
    "Diablo 2 Resurrected ups the graphical ante considerably, and as we’ve seen, it will update the visuals with a fresh coat of paint and allow the resolution to be cranked up to 4K while supporting refresh rates of up to 144Hz.",
    "There will, however, be a classic mode which reverts to the look of the original sprite-based (2D) game, should you wish to go that route. As well as the beefed-up visuals, Blizzard is delivering Dolby 7.1 surround on the audio side with remastered and re-recorded sound effects.",
    "As Wccftech, which spotted the requirements, also flagged up, mod support for Diablo 2 Resurrected has been confirmed on Twitter.",
    "That’s good to hear, naturally. We don’t know when all this will happen, as Blizzard has yet to confirm a launch date for Diablo 2 Resurrected – but we do know it’ll be arriving at some point in 2021.",
    "Meanwhile, there’s public alpha testing in the nearer future, and we can keep our fingers crossed that this remaster doesn’t make any of the same mistakes as Warcraft III."
  ],
  "headers": {
    "8": "Mod happy"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "PC spec requirements": "https://eu.shop.battle.net/en-gb/product/diablo_ii_resurrected",
    "allow the resolution to be cranked up to 4K": "https://www.techradar.com/news/diablo-2-resurrected-is-a-4k144hz-remaster-of-diablo-2-for-pc-and-consoles",
    "Wccftech": "https://wccftech.com/diablo-ii-resurrected-pc-specs-mods/",
    "public alpha testing": "https://diablo2.blizzard.com/en-us/",
    "make any of the same mistakes as Warcraft III": "https://www.techradar.com/news/warcraft-iii-reforged-launch-has-been-a-mess-but-heres-what-blizzard-is-going-to-do-to-fix-it"
  }
}