{
  "source": "https://www.techradar.com/news/oneplus-nord-n10-5g-and-n100-available-for-pre-order-today-with-free-oneplus-buds",
  "title": "OnePlus Nord N10 5G and N100 available for pre-order today with free OnePlus Buds",
  "category": "phones",
  "updated": "2021-01-08T12:11:53Z",
  "author": "alex-whitelock",
  "summary": "Some great OnePlus deals to start off the year",
  "article": [
    "OnePlus deals tend to be the preserve of the pricier flagship models leaving Android users on a budget out in the cold. Well, that's not the case today, with two brand new Nord devices available for pre-order with a range of audio freebies being thrown in for good measure.",
    "Both the new OnePlus Nord N10 5G and OnePlus Nord N100 are open for pre-orders today for the price of $299.99 and $179.99 respectively - with a shipping date of next Friday (15th January).",
    "The OnePlus Nord N10 5G is one of the first lower mid-range devices on the market to offer 5G, so right now it's got a fairly unique selling point for those who want fast data speeds on a budget. The 64MP quad-camera, 6.49-inch 90Hz display, 6GB of RAM, and 128GB of internal storage are all great for the money, although you are having to settle for an LED display here - not the OLED panels that we've come to expect on the more premium OnePlus models.",
    "The OnePlus Nord N100 comes in at one of the lowest prices we've ever seen a new OnePlus device go for and looks like a fairly strong budget offering. The biggest selling point here is the massive 5,000 mAh battery, which should give you plenty of uptime on that large 6.52-inch display, and you're also getting 64GB of expandable storage too. Again, the Nord N100 doesn't challenge its bigger siblings on features and power, but for just $179.99 unlocked, it doesn't need to.",
    "To sweeten the deal on these new devices, OnePlus is including a free pair of OnePlus Buds Z (with the N10) or OnePlus Bullets (with the N100) with every pre-order. In the case of the Buds Z, you're getting a free pair of truly wireless earbuds here worth $50 by themselves, which is a pretty fantastic offer if you were considering picking one of these new devices up either way.",
    "Want to see what else is available this week? Head on over to our main best cell phone deals article to find the best prices on not just OnePlus devices, but also the latest from Samsung, Apple, plus more."
  ],
  "headers": {
    "5": "OnePlus deals: free buds with new OnePlus Nord series"
  },
  "links": {
    "$299.99": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-7696467698503932000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-n10-5g",
    "$179.99": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-8205088938499622000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Foneplus-n100",
    "OnePlus Buds Z": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-7879069523722191000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Fproduct%2Foneplus-buds-z",
    "OnePlus Bullets": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-2350975706357654500&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Fproduct%2Foneplus-bullets-wireless-z",
    "best cell phone deals": "https://www.techradar.com/deals/mobile-phone-deals"
  }
}