{
  "source": "https://www.techradar.com/news/amazfit-smartwatches-are-getting-a-potentially-life-saving-new-feature",
  "title": "Amazfit smartwatches are getting a potentially life-saving new feature",
  "category": "fitness",
  "updated": "2021-07-13T14:56:32Z",
  "author": "cat-ellis",
  "summary": "Estimating blood pressure from the wrist",
  "article": [
    "Amazfit smartwatches will soon get a new app that can monitor blood pressure without the need for a separate arm cuff. PumpBeats is a system that measures blood pressure using the watch's optical sensors, and Zepp Health (Amazfit's parent company) says that it's given impressive results in clinical testing on hospital patients with hypertension.",
    "Zepp Health says PumpBeats will begin rolling out at the end of 2021, and the fact that it relies on optical sensors means there's a chance it could be available on existing smartwatches and fitness trackers as a firmware update – not just new devices.",
    "Measuring blood pressure regularly is very important for people with hypertension, but it's an awkward, time-consuming process. A 2020 survey from wearables company Valencell revealed that many patients in the US measured their blood pressure just once a month, or even once a year.",
    "We don't have full details yet, but it sounds as though PumpBeats will use the watch's PPG (photoplethysmography) sensor, which is typically used to monitor heart rate, but can also take optical readings of your arteries to estimate blood pressure. This is the technology used by the blood pressure app that rolled out earlier this year to Samsung Galaxy Watch owners.",
    "Apps like these can't replace conventional blood pressure monitoring, and still have to be configured using a cuff, but can be a useful extra tool for people managing their condition at home.",
    "Zepp Health announced the new blood pressure tool at its Future of Health conference, where it also unveiled a new smartwatch operating system – Zepp OS – which looks set to replace the Amazfit OS used by devices like the Amazfit Bip, GTR 2, and GTS 2.",
    "The new operating system sounds like a big upgrade, requiring 1/10 the storage space of Amazfit OS, and consuming far less power. Hopefully this will translate to watches with seriously impressive battery life, lower prices, or (ideally) both.",
    "The company has yet to announce any new watches that will use it, but it looks like future devices will be particularly focused on fitness. The OS supports 4G/5G, which Zepp plans to use for music and fitness services like Strava and Spotify.",
    "The OS will be officially launched towards the end of 2021 for developers to begin creating apps. We'll be keeping an eye out for news on new watches, and will keep you up to date.",
    "Zepp Health's final announcement is a set of new fitness-tracking true wireless earphones that are built to stop you slouching at your desk. The Amazfit PowerBuds Pro, which were teased in a press release yesterday (July 12) are a follow-up to last year's Amazfit PowerBuds, with a collection of new health monitoring tools.",
    "Like the original PowerBuds, the new earphones will offer heart rate tracking, but they'll also detect if you start running, and will launch the appropriate app on your watch to log your workout. It seems as though running will be the only activity tracked automatically (presumably because of the distinctive head movement).",
    "While you're working at your desk, the PowerBuds Pro will detect changes to the alignment of your cervical spine (the vertebrae in your neck), and alert you if you begin to slouch. They can alert you at regular intervals when it's time to get up and stretch your legs as well.",
    "They can also track audio levels in real time, and keep the volume of your music and video calls below the World Health Organization's recommended threshold to protect your hearing.",
    "As Wareable reports, they'll cost $149.99 (about £110 / AU$200), and will be available to order direct from Amazfit from July 15."
  ],
  "headers": {
    "5": "Amazfit's next-gen watches",
    "9": "Sit up straight"
  },
  "links": {
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "A 2020 survey from wearables company Valencell": "https://valencell.com/blog/national-hypertension-survey-reveals-huge-digital-health-opportunities/",
    "blood pressure app": "https://www.techradar.com/news/samsung-brings-ecg-and-blood-pressure-checks-to-thousands-of-galaxy-watch-users",
    "Samsung Galaxy Watch": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Amazfit Bip": "https://www.techradar.com/reviews/amazfit-bip",
    "GTR 2": "https://www.techradar.com/reviews/amazfit-gtr-2",
    "GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "true wireless earphones": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Amazfit PowerBuds Pro": "https://www.amazfit.com/en/powerbuds-pro.html",
    "were teased in a press release": "https://www.techradar.com/news/amazfits-new-earbuds-will-help-fix-your-terrible-posture",
    "Amazfit PowerBuds": "https://www.techradar.com/reviews/amazfit-powerbuds",
    "Wareable": "https://www.wareable.com/wearable-tech/amazfit-powerbuds-pro-specs-release-date-8501",
    "direct from Amazfit": "https://www.amazfit.com/en/powerbuds-pro.html"
  }
}