{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-gpu-could-be-closer-to-launch-than-we-thought",
  "title": "Nvidia GeForce RTX 3080 Ti GPU could be closer to launch than we thought",
  "category": "computing",
  "updated": "2021-04-19T09:20:56Z",
  "author": "darren-allan",
  "summary": "Nvidia GeForce RTX 3080 Ti with 12GB VRAM reportedly on its way to US retailers",
  "article": [
    "Nvidia RTX 3080 Ti GPUs are winging their way to retailers in the US, at least going by some leaked pics.",
    "Tom’s Hardware spotted that Facebook user Lok LOK had posted images of what appears to be MSI’s GeForce RTX 3080 Ti Ventus 3X 12G OC, a graphics card which is yet to be released.",
    "That is, of course, an unknown source, so exercise some caution here, but the images certainly look like genuine photos of pallets of GPUs – with the MSI 3080 Ti apparently being shipped to the US alongside RTX 3090 cards.",
    "An interesting point to note here is that looking at the name of the graphics card, the ‘12G’ refers to 12GB of VRAM, confirming previous rumors that this will be the memory configuration of the RTX 3080 Ti.",
    "Of course, that’ll disappoint folks who might still be hanging on to earlier speculation that the 3080 Ti could weigh in with much more video memory (like 20GB of the stuff) – but we still need to be careful around assuming too much here.",
    "Nvidia has already indicated that broadly speaking, stock of Ampere (RTX 3000) graphics cards is not likely to improve much throughout 2021, and that’s backed up by news elsewhere such as the latest on component shortages from chipmaker TSMC",
    "The rumor mill has been spinning out theories about the RTX 3080 Ti for a long time now, and the expected launch timeframe for the graphics card is May. However, not so long ago, the theory was that the GPU would debut in mid-April, but Nvidia reportedly hit snags and a delay – problems which have apparently now been smoothed over, with the card now presumably imminent.",
    "Also worth noting is that the 3080 Ti may just come with anti-mining countermeasures as per the grapevine, with the RTX 3060 already carrying this (although Nvidia has faced problems in successfully implementing the tech).",
    "When (or rather if) the new graphics card lands, Nvidia’s RTX 3080 Ti is expected to have a CUDA core count of 10,240, and as mentioned, 12GB of VRAM with a 384-bit memory interface.",
    "Whether you will actually be able to buy one of these new graphics cards next month not only depends on whether the rumor peddlers and purported launch timeframe are correct, but also you’ll be fighting seriously poor odds in terms of getting hold of any available stock (which is likely to be thin on the ground, naturally)."
  ],
  "headers": {
    "5": "Theories aplenty"
  },
  "links": {
    "Nvidia RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/nvidia-geforce-rtx-3080-ti-allegedly-heads-to-us-retailers",
    "Lok LOK": "https://www.facebook.com/photo/?fbid=10165305081710158&amp%3Bset=p.10165305081710158",
    "like 20GB": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-a-powerful-gpu-with-20gb-of-vram-to-take-on-amd-big-navi",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "latest on component shortages from chipmaker TSMC": "https://www.techradar.com/news/chip-maker-has-bad-news-for-those-hoping-to-buy-an-nvidia-geforce-rtx-3080-in-2021",
    "a long time now": "https://www.techradar.com/news/nvidia-rtx-3080-ti-leak-suggests-a-powerful-gpu-with-20gb-of-vram-to-take-on-amd-big-navi",
    "GPU would debut in mid-April": "https://www.techradar.com/news/nvidia-could-be-about-to-hit-amd-hard-with-launch-of-rtx-3080-ti-and-3070-ti-gpus",
    "although Nvidia has faced problems in successfully implementing the tech": "https://www.techradar.com/news/nvidia-to-launch-new-anti-cryptomining-gpu-to-replace-the-rtx-3060"
  }
}