{
  "source": "https://www.techradar.com/news/godaddy-makes-it-easier-than-ever-to-create-social-media-ads-for-your-website",
  "title": "GoDaddy makes it easier than ever to create social media ads for your website",
  "category": "computing",
  "updated": "2021-08-27T14:25:23Z",
  "author": "abigail-opiah",
  "summary": "GoDaddy dashboard now holds all web creators' social media ad campaign information for easy tracking",
  "article": [
    "In a string of new updates, GoDaddy has added a Facebook and Instagram ad builder directly into its Websites + Marketing and Digital Marketing Suite dashboards.",
    "The popular domain registrar and web hosting company added the new feature to help small businesses find more customers through social media.",
    "After creating content with GoDaddy's Websites + Marketing suite, website designers and creators will now get first dibs on launching an ad campaign to Facebook and/or Instagram.",
    "The news means GoDaddy will now let website designers and content creators track the success of their ad campaign from one dashboard, which can be accessed through GoDaddy Studio's photo editor within Websites + Marketing.",
    "Ad results can be viewed from the same dashboard, regardless of which social channel it appeared on, with businesses able to select ad campaigns for as low as $1 a day, with the ability to scale the campaign up from there.",
    "\"Paid social ads are an important way to drive website traffic that shouldn’t be overlooked - a whopping 69% of Americans use Facebook alone, and most GoDaddy customers more than doubled their website traffic increases when running a Facebook & Instagram ad,\" the company said in a blog post announcing the news.",
    "“Now with Digital Ads, GoDaddy’s Websites + Marketing toolset continues to be a powerful one-stop shop for small businesses to create and amplify awareness for their brands, and ultimately sell more.”",
    "Before this update, GoDaddy customers could only post directly to their social channels and boost social posts from their Websites + Marketing dashboards.",
    "Compared to the process of setting up ad campaigns outside of the new central GoDaddy feature, the company said it has managed to cut down the time and steps it would previously take to create and measure social media adverts.",
    "The news comes shortly after GoDaddy also announced its new social media content planning tool for all platforms including Facebook, Instagram and Twitter."
  ],
  "headers": {
    "3": "Social media boost"
  },
  "links": {
    "GoDaddy": "https://www.techradar.com/reviews/godaddy-website-builder",
    "domain registrar": "https://www.techradar.com/news/best-domain-registrars",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "blog post": "https://aboutus.godaddy.net/newsroom/company-news/news-details/2021/GoDaddy-Integrates-Dashboard-With-Facebook--Instagram-Ad-Builder-So-Business-Owners-Can-Create-Ads-and-Track-Results-From-One-Central-Hub-/default.aspx",
    "social media content planning tool": "https://www.techradar.com/news/godaddy-launches-social-media-scheduling-tool-for-smbs"
  }
}