{
  "source": "https://www.techradar.com/news/ev-vs-phev-vs-self-charging-hybrid-vs-mild-hybrid-whats-best-for-you",
  "title": "EV vs PHEV vs self-charging hybrid vs mild hybrid: what's best for you?",
  "category": "car-tech",
  "updated": "2021-08-07T15:00:44Z",
  "author": "ian-evenden",
  "summary": "There's lots of choice, and all have their benefits",
  "article": [
    "Anyone just dipping their toe into the world of hybrid and electric cars for the first time may be surprised to discover that it's not just a case of just electric or petrol power.",
    "There are a few different types of hybrid car out there, generally diversified by how big their batteries are and how long they can run on pure electric power, if at all.",
    "This difference then feeds into the respective cars' fuel efficiency - more batteries mean more juice, so they can feed more electric power to the wheels and allow the petrol engine to take more time off, using less fuel.",
    "These, then, are the types of electrically assisted cars you're most likely to see on a forecourt near you.",
    "The fully electric vehicle doesn't even have a combustion engine, and there's nowhere to put the petrol - instead you have a charging socket that is likely to be different depending on where you live.",
    "Otherwise, they're just like other cars, though they tend to be extremely high-tech, with screens and buttons where other cars would have dials and gear levers, and a system for recovering energy from braking that feeds back into the battery.",
    "They still have motors, of course, and some have more than one, but they're smaller electric ones that weigh far less than an internal combustion engine. The weight is put back in by the batteries, but as these tend to be distributed throughout the body of the vehicle, you get better weight distribution.",
    "EVs are completely reliant on charging, whether that be from a charging point attached to your house, and wired into its electricity meter, or from public access points in parking lots and service stations around the country.",
    "As technology improves, the distance fully electric vehicles can achieve from a full charge is increasing, to the point that they are beginning to rival what petrol cars can manage between fills.",
    "You may find EVs also referred to as BEVs, which stands for Battery Electric Vehicles.",
    "The best of both worlds? Maybe. These vehicles have a reasonably large battery and a petrol engine, along with the management software that allows them to switch between the two completely transparently, or a switch that locks them into all-electric mode.",
    "Despite the size of the battery, however, all-electric range is extremely limited, around 35 miles is common. Having to carry a petrol engine and its transmission around takes its toll on the electric range, however, and plug-in hybrids tend to be larger, heavier vehicles (though the Prius and Ioniq are the same size as their hybrid stablemates).",
    "When using the petrol engine, the battery system helps out, improving fuel economy, just like any other hybrid.",
    "PHEVs have enough electric range to go to the shops and back, or carry out the school run or a short commute, with the flexibility of the petrol engine there for longer trips when you want it.",
    "They also have the same energy-recovery systems as other hybrids, so you can put some charge back into that big battery as you brake downhill or into roundabouts.",
    "Ideally, you'll need a home charger for a PHEV - waiting in a car park while it fills up, and taking a detour to get there, doesn't suit its greater efficiency.",
    "The classic model, around since the Prius launched in Japan in 1997. Its hybrid drivetrain flips between electric and petrol, and can run in all-electric mode for short periods.",
    "It's reliant on the energy recovery systems to replenish its battery, as there's no charging port - hence the 'self-charging' monicker - and you won't need a charging point to be installed on your home (or use public ones).",
    "Most of the time, the electric motor acts as a helper to the petrol engine, meaning it needs to burn less petrol, costs less to run, and produces fewer harmful tailpipe emissions.",
    "Hybrids like this make an ideal solution for those who want to reduce their fuel bills and their impact on the environment. There are few reasons left to buy a diesel car over a hybrid if you're looking for fuel efficiency.",
    "The oil-burner may have the edge in long motorway journeys, but it won't for much longer, and many manufacturers are phasing out diesel cars in favor of petrol hybrids, which reliably produce far better MPG (miles per gallon) figures than their pure-petrol siblings and beat diesels on short journeys and in combined average figures.",
    "A new category that feels like an attempt to do as little as possible by car manufacturers being forced to make changes, a mild hybrid is a car with a simple petrol engine and an electric generator in place of the starter motor and alternator.",
    "This, coupled with a small battery, produces power to run the car's electrical components, instead of siphoning off engine power for them.",
    "It also assists the car when accelerating, and helps restart more easily when the engine stops, when stuck in traffic and stationary, for example.",
    "What it can't do is power the car on its own - the petrol engine is always running while the car is moving. It has the same regenerative properties as other hybrids, though, clawing back energy usually lost as heat while braking to fill its battery.",
    "The lack of complexity in the system can also make them cheaper to buy, and you can get them with manual gearboxes if you don't like being stuck with an automatic transmission.",
    "Audi even makes one with a diesel engine. And while their fuel efficiency isn't as high as other hybrid models, they're still cheaper to run and produce fewer harmful emissions than cars that purely use an internal combustion engine."
  ],
  "headers": {
    "4": "1. EV (electric vehicle)",
    "10": "2. PHEV (plug-in hybrid vehicle)",
    "16": "3. Hybrid (aka 'full' hybrid, 'parallel' hybrid or 'self-charging' hybrid)",
    "21": "4. Mild Hybrid"
  },
  "links": {}
}