{
  "source": "https://www.techradar.com/news/all-twitch-data-and-source-code-has-been-leaked-online",
  "title": "Twitch admits huge data hack - here's all you need to know",
  "category": "computing",
  "updated": "2021-10-06T15:58:05Z",
  "author": "mayank-sharma",
  "summary": "All Twitch data and source code has been leaked online",
  "article": [
    "UPDATE: In its first statement since the breach was revealed, Twitch has confirmed an incident has occured.",
    "\"We can confirm a breach has taken place. Our teams are working with urgency to understand the extent of this. We will update the community as soon as additional information is available. Thank you for bearing with us,\" the company posted in a tweet.",
    "An anonymous hacker claims to have leaked the entirety of popular video game live streaming service Twitch, including its source code and personally identifiable information (PII) of its users.",
    "The leaked data is rolled into a 125GB torrent, and its link was posted to 4chan. Although the authenticity of the data hasn’t been authoritatively established, an anonymous source told VGC that it is, including the source code.",
    "The data was supposedly obtained this week itself, and the source further claimed that Twitch is aware of the leak - which is thought to contain a range of confidential product roadmaps, including that the company is working on a competitor to Steam.",
    "Video Games Chronicles (VGC) reported that the hacker wasn’t pleased with the community that had built around the service and leaked the data in a bid to “foster more disruption and competition in the online video streaming space.”",
    "Expectedly, some people have already started combing through the data and are sharing purported earnings of popular streamers, while others claim the data also includes encrypted user passwords.",
    "In all, the leaked Twitch data reportedly includes all versions of the source code of the platform, complete with the developer’s comments, going all the way back to its beginning.",
    "The torrent also includes the proprietary SDKs and internal AWS services used by the platform, as well as data from all other Twitch-owned properties including IGDB and CurseForge, and lots more.",
    "To top it off, the hacker has claimed that the 125GB torrent is just the first part of the data exfiltrated from Twitch, and that the rest will be shared as well without specifying a time window for its release.",
    "Via Video Games Chronicles"
  ],
  "headers": {
    "6": "PII and more"
  },
  "links": {
    "posted in a tweet": "https://twitter.com/Twitch/status/1445770441176469512?s=20",
    "video game live streaming": "https://www.techradar.com/news/the-best-free-streaming-software",
    "AWS": "https://www.techradar.com/news/aws",
    "Video Games Chronicles": "https://www.videogameschronicle.com/news/the-entirety-of-twitch-has-reportedly-been-leaked/"
  }
}