{
  "source": "https://www.techradar.com/news/ford-f-150-lightning-first-look",
  "title": "Check out the Ford F-150 Lightning from all angles - with space for junk in its frunk",
  "category": "car-tech",
  "updated": "2021-08-28T10:00:14Z",
  "author": "myriam-joire",
  "summary": "We get a good look at the affordable electric truck",
  "article": [
    "The Ford F-150 Lightning is a big deal. Here in the US, Ford's F-series hasn't just been the best selling truck for the past 44 years, it's the best selling vehicle in the country, period.",
    "As such, the stakes are high for the F-150 Lightning - Ford's first battery-electric pickup truck. If the goal is to convert ICE (internal combustion engine) truck buyers into electric truck buyers, the Lightning needs to be a great EV and a great truck. That's no small feat.",
    "And while other manufacturers - like Tesla, Rivian, Canoo, and General Motors (Hummer) - have all announced electric trucks, the Lightning has three significant advantages.",
    "It's going to be one of the first electric trucks to reach customers (spring 2022), it's the most affordable electric truck currently announced ($39,974), and it's the electric version of an existing ICE truck which benefits from a well established ecosystem of accessories.",
    "We recently had the chance to see - but not drive - the Ford F-150 Lightning in person, so we wanted to walk you through some of this vehicle's unique EV (and truck) features.",
    "Other than better aerodynamics and slightly different headlights, taillights, and grille, the Lightning looks pretty much identical to its ICE counterpart. It only comes in one body configuration: SuperCrew (4-door) with a 5.5-foot bed (1.67m).",
    "All Lightning trims have two motors and all-wheel-drive. Two battery options are available: 300mi (482km) with 563hp and 775lb-ft of torque, plus 230mi (370km) with 426hp and 775lb-ft of torque.",
    "You have four trims to choose from: PRO and XLT (230mi battery, 300mi optional), plus Lariat and Platinum (300mi battery). We spent time with the fully loaded Platinum trim, which costs $90,474 before destination charge and incentives.",
    "Ford estimates the Lightning's 0-60mph time at 4.4 seconds, which is about 0.8s less than Ford's quickest F-150, the Raptor.",
    "The Lightning also ditches the solid live axle rear suspension found on ICE models for an independent rear suspension. Between the improved suspension and the low center of gravity (from the under-floor battery pack), we expect the Lightning will also be Ford's best handling (and riding) F-150 to date.",
    "Since the Lightning is dimensionally identical to the ICE SuperCrew F-150, it works with existing accessories and gear.",
    "It even keeps the full-size spare tire under the bed in the back. Maximum payload capacity is 2000lbs (907kg), including 400lbs (181kg) in the large Mega Power Frunk. While Ford hasn't revealed battery sizes for the Lightning yet, the company's EPA range estimates assume a 1000-pound (453kg) payload.",
    "The Lightning can tow up to 10,000lbs (4535kg), and inherits some of the ICE F-150's optional features, like onboard scales to measure payload weight (and predict range more accurately).",
    "For charging, the Lightning supports 150kW DC fast charging (CCS Combo 1), and comes with the 240V / 120V, 32A Ford Mobile Charger. Versions with the 300-mile battery also include the 80A Ford Charge Station Pro for 19.2kW AC charging at home.",
    "Once professionally installed, the Ford Charge Station Pro (in combination with a transfer switch) also enables a clever new feature called Ford Intelligent Backup Power.",
    "This allows the Lightning to supply power to your home for up to 3 days (30kWh per day, 9.6kW peak) in case of a power outage, and can be stretched to 10 days by rationing power use - great for emergencies like 2020's massive winter power grid failure in Texas.",
    "Another differentiating feature is the number of AC power outlets the Lightning offers.",
    "There's 7.2kW of power available in the bed (one 240V, 30A outlet and two sets of 120V, 20A twin outlets), plus 2.4kW of power available in the frunk (four 120V outlets, 20A combined).",
    "You'll even find a couple 120V outlets in the cab (one in the front, one in the back). That's a total of 11 outlets - not counting the various 12V and USB (Type-A and C) ports.",
    "The Mega Power Frunk is what really sets the Lightning apart from its ICE counterpart. At 14 cubic feet (396 liters) - about the same size as the trunk in most cars - and with a 400lbs (181kg) payload capacity, it's a massive, lockable space (with outlets) for tools and other gear.",
    "The grille is integrated with the power frunk lid, making loading a breeze, and there's even additional storage under half the floor (with a convenient drain hole).",
    "On the tech front, the Lightning boasts the same portrait, volume knob-equipped 15.5-inch center display (Ford Sync 4A) we saw in the Mustang Mach-E - at least on the Lariat and Platinum models.",
    "A landscape 12-inch screen (Ford Sync 4) is standard on the PRO and XLT versions. Ford's Co-Pilot360 driver assistance is included, along with a 360-degree view when parking, and BlueCruise Level 2 ADAS is optional.",
    "LTE connectivity (with WiFi hotspot) is standard for over-the-air updates, and the FordPass app lets you remote control various features (like climate), monitor charging, and use your phone as a key.",
    "Ford's Sync software also includes smart route planning - taking payload weight, topography, weather, and traffic into account - plus charging network integration (with Electrify America) for a seamless experience at charging stations.",
    "This Platinum model is fully loaded with comforts like heated / ventilated massaging lie-flat power leather seats, under rear-seat storage, power folding gear lever, center-console work surface, twin moonroof, and power tailgate - to name a few.",
    "Take a look at the Ford F-150 Lightning Platinum from all angles in our photo gallery below.",
    "Overall, we're quite impressed with the Lightning. It looks and feels just like a normal pick-up truck - like a regular ICE F-150, even - that just happens to be fully electric.",
    "As such, it delivers everything you'd expect from a truck and from an EV. Basically, it's the best of both worlds - with the added bonus of features like Ford Intelligent Backup Power, the Mega Power Frunk, and 9.6kW of outlet power.",
    "But there's a lot more to cover, so keep an eye out for our full review, coming in 2022."
  ],
  "headers": {
    "5": "Undercover EV",
    "12": "It can power your house, and your tech",
    "19": "Junk in the Mega Power Frunk",
    "27": "Initial impressions"
  },
  "links": {
    "Mustang Mach-E": "https://www.techradar.com/news/ford-mustang-mach-e"
  }
}