{
  "source": "https://www.techradar.com/news/google-chrome-is-getting-a-small-but-important-upgrade-for-the-home-working-era",
  "title": "Google Chrome is getting a small but important upgrade for the home working era",
  "category": "computing",
  "updated": "2021-01-26T13:00:02Z",
  "author": "joel-khalili",
  "summary": "Chrome will help you keep your private and professional lives separate",
  "article": [
    "Google Chrome is set to roll out a small but important tweak to the way it handles push notifications, in a bid to better preserve the privacy of remote workers.",
    "According to a company blog post, Chrome will now detect whether the user is sharing their screen over video conferencing software and conceal the contents of any pop-up notifications (from messaging apps, email services etc.) accordingly.",
    "The measure is designed to prevent personal or sensitive information from being exposed during video calls, which have become a staple of the working day during the pandemic.",
    "The feature will be available to all Google account holders (not just Workspace customers) and is expected to roll out in full by the end of the week.",
    "The ability to screen share over video conferencing platforms has been a boon for remote workers, but the feature also has its perils and has emphasized the uncomfortable blurring of private and professional lives during the pandemic.",
    "The video conferencing horror story has practically become a genre in and of itself. Some have accidentally exposed their embarrassing browsing habits or personal messages, while other unfortunates have been caught bad-mouthing clients or colleagues.",
    "The Google Chrome tweak, then, should spare the blushes of remote workers everywhere, as well as limiting the chances of a data security incident.",
    "“There has been a dramatic shift in how many of us work - now more than ever, we’re relying on the use of Google Meet and other screen sharing solutions,” wrote Google.",
    "“We hope this feature will reduce distractions and prevent sensitive or personal information from accidentally being displayed while sharing your screen.”",
    "With the pandemic proving more difficult to shake than anyone had hoped, video conferencing will likely remain a fixture of our professional lives for some time yet. In the remote working era, measures that can help us avoid the associated pitfalls will be welcomed with open arms."
  ],
  "headers": {
    "4": "Google Chrome notifications"
  },
  "links": {
    "remote workers": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "blog post": "https://workspaceupdates.googleblog.com/2021/01/better-privacy-when-screen-sharing-chrome.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "messaging apps": "https://www.techradar.com/best/best-encrypted-messaging-app-android",
    "email services": "https://www.techradar.com/news/best-email-provider",
    "Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet"
  }
}