{
  "source": "https://www.techradar.com/news/nvidia-wants-to-create-a-digital-twin-of-earth-in-the-omniverse",
  "title": "Nvidia wants to create a digital twin of Earth in the 'Omniverse'",
  "category": "computing",
  "updated": "2021-11-12T13:43:52Z",
  "author": "sead-fadilpasic",
  "summary": "Chipmaker wants to simulate climate change",
  "article": [
    "Nvidia wants to build a digital twin of planet Earth in the “omniverse” and use the model to peek into the future of climate change.",
    "With this digital twin, the company aims to see the challenges future humans may face in terms of global warming and the natural disasters that come with it, and hopes to provide early warnings to regions, nations and cities that could be most affected.",
    "The company announced plans to build a new AI supercomputer, called Earth-2 (or E-2, for short), and in it, a system for predicting climate change. It says that the idea is no longer in the sci-fi domain due to advances in three key technologies: GPU-accelerated computing, deep learning and physics-informed neural networks, and AI supercomputers together with troves of observed and model data to learn from.",
    "The project is entirely funded by Nvidia, company CEO Jensen Huang confirmed, saying that no other companies, nation-states, or international organizations, are (yet) participating:",
    "“We now have several supercomputers that are the largest in the world,” he explains. “Selene is number six in the world. Cambridge-1 (AI supercomputer for healthcare research) just came online as a supercomputer dedicated to healthcare - it's about the size of Selene. So we have three or four supercomputers that are about the size of the sixth-largest supercomputer in the world. And it's completely funded by us.”",
    "The goal, Huang added, was to lend a helping hand in the battle against climate change.",
    "“We built it so that we could develop our software in the modern world of AI. Software's developed by great computer scientists but it is accelerated and augmented by the software development of machines. We are going to create Earth-2 to focus our researchers' ability to help contribute to combatting climate change.”",
    "Huang went on to say that the company plans to reveal Earth-2’s architecture soon, as it will allow it to create “the most energy-efficient supercomputer ever created”.",
    "“If you imagine Earth as a physical thing, this will be the engine of alternate worlds.”",
    "The problem with predicting climate change is, unlike predicting the weather, the timeframe is too large, and there are too many factors to consider. To develop the best strategies to mitigate the effects of climate change, and adapt to the changes, the world needs climate models that can predict the climate in different regions of the world, over decades, Nvidia argues.",
    "These models are “multidecade simulations”, that model the physics, chemistry, and biology of the atmosphere, waters, ice, land, and human activities. All of this is just scratching the surface, as there’s also the need to simulate clouds that reflect sunlight back to space, as well as the need to simulate the global water cycle (water movement from the ocean, sea ice, land surface, and groundwater through the atmosphere and clouds).",
    "For the first time ever, Nvidia concludes, the world has the technology to do ultra-high-resolution climate modeling.",
    "Supercharge your computing needs with the best web hosting services around"
  ],
  "headers": {
    "3": "Supercomputer-powered",
    "5": "Multidecade simulations"
  },
  "links": {
    "best web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites"
  }
}