{
  "source": "https://www.techradar.com/news/castlevania-advance-collection-is-the-perfect-thing-for-fans-of-the-netflix-show",
  "title": "Netflix's Castlevania anime may be over, but this Nintendo Switch game collection has just begun",
  "category": "gaming",
  "updated": "2021-09-24T12:43:07Z",
  "author": "henry-st-leger",
  "summary": "Castlevania Advance Collection is the perfect thing for fans of the Netflix show",
  "article": [
    "Castlevania Advance Collection is here, Nintendo revealed in the midst of a surprise Nintendo Direct on September 23. The Collection packages together four classic Castlevania games from the days of the SNES and Game Boy Advance into one affordable package.",
    "For just $19.99 / £15.99, you can get all four titles on Nintendo Switch, PC, or PlayStation and Xbox consoles – with GBA games Circle of the Moon, Harmony of Dissonance, and Aria of Sorrow alongside the SNES' Dracula X.",
    "The Nintendo Direct event also heralded the arrival of N64 games on Nintendo Switch Online – as we had long suspected.",
    "But this quartet of Castlevania games is going to be the main event for anyone who loved the Castlevania Netflix series and is intrigued by the prospect of delving deeper into the franchise's lore.",
    "Castlevania has always been first and foremost a video game franchise – so much so that rumblings of an animated Netflix show a few years ago seemed a bit off. How do you adapt a game series that is so much about non-linear exploration and platforming – so much so that it lent its name to the creation of the Metroidvania genre – without losing the essence of what it is?",
    "The answer, of course, is for the show to do its own thing, and we got a stunning portrayal of grief, familial conflict, and demonic violence worthy of the Castlevania name – a show that felt gruesome, gothic, and dignified all at once.",
    "The Castlevania TV series, though, was largely inspired by 1989's Dracula's Curse – with some influences from Symphony of the Night and Curse of Darkness – and occupies a different canonical universe from the games, similar to the difference between the MCU and specific series of superhero comics.",
    "The Castlevania Advance Collection visits some entirely different titles in the franchise's history, curating the GBA games we saw released in 2001-2003 – as well as 1995's Dracula X, a SNES remake of 1993's Rondo of Blood.",
    "We don't really see new Castlevania games released these days – the last official entry on consoles was 2014's Lords of Shadow 2, a whole seven years ago, with the more recent Grimoire of Souls (2019) landing purely on iOS and Apple Arcade.",
    "And with Castlevania season 4 having come to an end – and who knows how long to wait until the spin-off series actually lands on Netflix – the Advance Collection is the perfect thing to get your fangs into for the time being, especially because of the recurring characters common across the Collection and the Netflix adaptation of the franchise. (Warning: some spoilers for the Castlevania TV show follow.)",
    "Both Circle of the Moon and Aria of Sorrow were hugely acclaimed upon release – with the former seeing recurring villain vampire Carmilla (so memorably depicted in the Netflix series) in her mission to resurrect Dracula. The latter game, too, even includes Death itself, as a servant of Dracula, and who turns out to be the end villain in Castlevania season 4.",
    "For anyone wanting to see the original and earlier incarnations of the show's incredible cast – and how much the show's action imitate the boss battles from the games – the Castlevania Advance Collection is certainly your best opportunity."
  ],
  "headers": {
    "4": "Analysis: exploring the castle"
  },
  "links": {
    "a surprise Nintendo Direct": "https://www.techradar.com/news/nintendo-direct-september-2021-all-the-biggest-announcements-you-need-to-know",
    "GBA games": "https://www.techradar.com/best/best-gba-games",
    "the arrival of N64 games": "https://www.techradar.com/news/nintendo-switch-online-to-offer-n64-and-genesis-games-with-new-subscription-plan",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-release-date-features-and-online-multiplayer",
    "Grimoire of Souls (2019) landing purely on iOS and Apple Arcade": "https://www.techradar.com/news/how-do-you-bring-castlevania-to-your-iphone-a-developer-qanda",
    "Castlevania season 4": "https://www.techradar.com/news/castlevania-season-4-netflix-release-date",
    "until the spin-off series actually lands on Netflix": "https://www.eurogamer.net/articles/2021-06-11-netflixs-castlevania-is-getting-a-spin-off-series-set-during-the-french-revolution"
  }
}