{
  "source": "https://www.techradar.com/news/standard-nintendo-switch-might-get-a-price-drop-ahead-of-oled-model",
  "title": "Standard Nintendo Switch might get a price drop ahead of OLED model",
  "category": "gaming",
  "updated": "2021-09-13T04:07:30Z",
  "author": "stephen-lambrechts",
  "summary": "A European price cut is expected this week",
  "article": [
    "With the refreshed and revised Nintendo Switch OLED set to arrive on October 8, it was only a matter of time before the current non-OLED model received an inevitable price drop.",
    "While Nintendo has yet to make any announcements, French retail tipster Nintend’Alerts has tweeted that the standard Nintendo Switch will drop its price to just €270 this week, which is a €60 reduction from the full retail price of €330.",
    "The news was picked up by Gamereactor Spain, which claims to have received confirmation of an imminent price drop, however, the site will only confirm that the price will dip below €300 in Spain at this stage.",
    "So far, it's unknown whether Nintendo plans to reduce the price of its non-OLED Nintendo Switch models outside of Europe, or if it's simply bringing the notoriously high European pricing in line with the rest of the world.",
    "For instance, the supposed price cut to €270 equates to around $319 in the US, which is still more expensive than the console's current $299 price point. It does, however, translate to a much cheaper price point in the UK, hypothetically bringing the cost down from £279 to around £230.",
    "In Australia, the converted price of AU$433 would also be slightly cheaper than the current Nintendo Switch RRP of AU$469.95. That said, the console is routinely discounted to well below that price at Aussie retailers.",
    "Meanwhile, when the €60 price cut itself is directly converted, it works out to a discount of around $70 / £80 / AU$96 in each territory, which would obviously be incredibly welcome.",
    "Of course, all of this is purely speculation at this point – if Nintendo does decide to permanently reduce the price of its standard Nintendo Switch console ahead of the OLED model's launch, we'll make sure to update you right away. For now, you can find the best Nintendo Switch deals in your area below."
  ],
  "headers": {
    "3": "Analysis: will the Switch's price drop outside of Europe?"
  },
  "links": {
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Nintend’Alerts": "https://nintendalerts.com/",
    "tweeted": "https://twitter.com/nintendalerts/status/1436030921195536385",
    "Gamereactor Spain": "https://www.gamereactor.es/el-precio-de-nintendo-switch-baja-de-los-300-euros-en-espana-a-partir-del-lunes/",
    "standard Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}