{
  "source": "https://www.techradar.com/news/the-coolest-robots-of-ces-2021",
  "title": "The coolest robots of CES 2021",
  "category": "appliances",
  "updated": "2021-01-15T12:37:27Z",
  "author": "axel-metz",
  "summary": "These are the droids you’re looking for",
  "article": [
    "Spare a thought for the robots of CES 2021. This year’s all-virtual event means the vegetable-chopping, spring-cleaning, joke-telling animatrons we’ve come to expect on the show floor have been forced to work from home like the rest of us, performing through Zoom feeds and promotional videos as if they’re merely machines created to serve humanity… wait?",
    "But despite the technical difficulties facing this year’s crop of quirky machines, it’s actually a pretty good time to be a robot. The world is a tough place right now, and despite supposedly giant leaps in AI, it’s hard to imagine a mechanised butler having sleepless nights over the global pandemic and general political instability that rages around them. We’re all in need of a little TLC in 2021 – which is handy, because the robots of this year’s CES are much less HAL and far more helpful. There’s robots to keep us safe, robots to help around the house, robots to entertain, robots to educate, and robots to do some of life’s (really) heavy lifting.",
    "We’ve picked out some of the coolest – from the super useful to the downright adorable.",
    "As expected, Samsung debuted its latest slew of home-improving robots at this year’s show – the most interesting being the Samsung Bot Handy. Capable of loading the dishwasher, doing the laundry and even pouring a bottle of wine and bringing it to you on cue using its giant robot arm, the Bot Handy is a moving extension of your kitchen should you need “an extra hand in your home.\" Expect the next version to come wearing black tie.",
    "Getting one up on the Samsung Bot Handy is ITRI’s Dual Arm Robot System, which has (you guessed it) not one, but two (!!) mechanised arms to help it perform smaller, gentler human tasks like playing the piano or opening a water bottle. The DARS is equipped with five-fingered, human-like hands which allow it to overcome the limitations of traditional robotics' grippers. It’s still in the prototype stage, but the DARS looks ready-made to become a dexterous bartender.",
    "More than ever, personal hygiene is at the forefront of our day-to-day lives, and it’s an anxiety that will persist as we return to the workplace. LG’s CLOi UV-C (pronounced “Chloe bot”) aims to ease those concerns by patrolling high-traffic areas in classrooms, offices, hotel lobbies etc. and eliminating harmful germs using its dual UV lights. In previous years, it’s a robot that might have gotten buried beneath the noise of flashier products – but Covid-19 has meant the “Chloe bot” can’t come soon enough.",
    "Perhaps not exactly what you have in mind when you think of the term “robot”, but John Deere’s X Series combine harvester is just that. Autonomous, camera-laden and capable of machine-to-machine communication, this giant hunk of metal looks set to change the future of agriculture. Farmers everywhere, rejoice! Manual crop pickers... not so much.",
    "Likely the robot on this list with the most immediate application, the Samsung JetBot 90 AI Plus is a smartvac that patrols your home using object recognition technology to decide the best cleaning path. It also uses LiDAR sensors (the lasers used in autonomous vehicles to determine depth and distance) to get up close to objects like toys while avoiding more fragile items like vases – and smellier numbers like pet poop (sorry, “wet messes”). Although we’ve seen smartvacs before, the JetBot 90 AI Plus aims to be the first to never, ever get stuck. We'll believe that when we see it.",
    "CES wouldn’t be complete without the customary announcement of the latest pet-like emotional support device – but damn, Moflin is cute. Created by Vanguard Industries with a successful Kickstarter campaign, Moflin is an AI pet robot with \"emotional capabilities\" which supposedly learns to love you using an algorithm and a set of built-in sensors. It’s essentially a fluffy gray guinea pig with black beady eyes and soft fur that also makes a series of misty-eye-inducing gurgles. That comment about all needing a little TLC in 2021? This is what we mean.",
    "Similar to Moflin, this fur-covered robot from Japanese company Yukai Engineering is a lap cat designed to soothe and relax without the penchant for scratching and pooping. The smaller companion to 2020’s Qoobo, the Petit Qoobo will pur, wag its tail and (supposedly) induce a state of calm and serenity. While it’s not the most groundbreaking of bots at CES 2021, the Petit Qoobo is certainly up there with the weirdest."
  ],
  "headers": {
    "3": "Samsung Bot Handy",
    "4": "ITRI Dual Arm Robot System (DARS)",
    "5": "LG CLOi UV-C",
    "6": "John Deere X Series",
    "7": "Samsung JetBot 90 AI Plus",
    "8": "Moflin",
    "9": "Petit Qoobo"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Moflin is cute": "https://www.techradar.com/news/ces-2021-meet-moflin-the-adorable-ai-pet-robot-that-will-learn-to-love-you"
  }
}