{
  "source": "https://www.techradar.com/news/thor-love-and-thunder-set-photos-reveal-loki-features-in-the-movie-sort-of",
  "title": "Thor: Love and Thunder set photos reveal Loki features in the movie – sort of",
  "category": "entertainment",
  "updated": "2021-03-02T12:21:36Z",
  "author": "samuel-roberts",
  "summary": "Mild spoilers ahead",
  "article": [
    "If you want to go in to 2022's Thor: Love and Thunder completely unspoiled, we'd advise avoiding the below. Instead, may we offer you a guide to the Marvel movies in order in these trying times?",
    "Thor: Love and Thunder began filming in Australia back in January, and now set photos have emerged that tell us a bit more about who's going to pop up in the film. First up, Matt Damon has been spotted reprising his Thor: Ragnarok role as an Asgardian actor, again playing the role of Loki within the film. Meanwhile, Luke Hemsworth reprises his role as the Asgardian actor playing Thor.",
    "Check them out below:",
    "The scene in question looks like it's going to re-enact the plot of Thor: Ragnarok, this time played by Asgard's best actors – a sequel of sorts to a memorable scene in Ragnarok. Sam Neill has also been spotted playing Odin again from that movie, this time dressed in Anthony Hopkins' brown suit.",
    "And yes, someone special is playing Cate Blanchett's Hela in this particular sequence as well – but we'll let you seek that out if you want to learn who it is, since it's a fairly major spoiler. This surprise was almost certainly meant to be saved for the finished movie, and not just revealed by photographers with long-lens cameras.",
    "Some have also speculated that Idris Elba will reprise his role as Heimdall in the movie, despite the character being killed off in Avengers: Infinity War. That's because Elba was spotted at an '80s-themed cast and crew party on Chris Hemsworth's Instagram page, though he hasn't officially been added to the cast, and has separately been filming the George Miller film Three Thousand Years of Longing in Australia.",
    "Thor: Love and Thunder will release on February 18, 2022.",
    "What can we learn from these set photos? Well, Thor: Love and Thunder looks like it'll keep Thor: Ragnarok's fun streak – which isn't a massive surprise, given that director Taika Waititi is known for putting plenty of jokes in his work, even when the subject matter is otherwise serious.",
    "Still, there is reason to believe this could otherwise be the darkest Thor movie yet. Christian Bale is playing the villain Gorr the God Butcher, a memorable character created in 2012 for a particularly great series of Thor comics – and he's about as grim as a Marvel character gets.",
    "Gorr essentially travels the universe, purging gods of all kinds in brutal ways, and is presented as the ultimate Thor villain – one he encounters multiple times across a period of thousands of years.",
    "It'll be interesting to see how Waititi adapts those elements of the character for his film, while also weaving in Natalie Portman's Jane Foster as the newer Thor character."
  ],
  "headers": {
    "7": "A Taika Waititi film"
  },
  "links": {
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Marvel movies in order": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "long-lens cameras": "https://www.techradar.com/news/best-bridge-camera",
    "Chris Hemsworth's Instagram page": "https://www.instagram.com/p/CL0mL4zpKbo/"
  }
}