{
  "source": "https://www.techradar.com/news/alder-lake-is-old-news-intel-says-a-new-era-of-ever-faster-processors-is-coming",
  "title": "Alder Lake is old news: Intel says a new era of ever-faster processors is coming",
  "category": "computing",
  "updated": "2021-10-28T19:26:09Z",
  "author": "john-loeffler",
  "summary": "Intel intends to keep pace and even outrun Moore's Law",
  "article": [
    "Ahead of the release of Intel Alder Lake processors next week, Intel's CEO Pat Gelsinger promises that Intel will keep pace with – and even outrun – Moore's Law to produce faster processors over the next decade, and that Intel's rivals won't be able to keep up.",
    "Intel's legendary founder Gordon Moore is credited with the creation of Moore's Law, an industry axiom that the number of transistors that can fit on a processor will double roughly every two years. The more transistors on a chip, the faster and more powerful it will be, but even though Moore's Law has been roughly accurate for the past half-century, it's run into trouble in recent years.",
    "Transistors are already so nanoscopic in scale that it has become even harder to physically shrink them any smaller, which has led to consternation in an industry that is used to rapid, transformative advances.",
    "So naturally, Gelsinger's pledge has drawn considerable attention. “Moore’s Law is alive and well,” Gelsinger said, according to PCWorld. “Today we are predicting that we will maintain or even go faster than Moore’s Law for the next decade.",
    "“We are entering a period of sustained if not ‘super’ Moore’s Law,” Gelsinger added. “We expect to even bend the curve faster than a doubling every two years. And we will not rest until the periodic table is exhausted. We as the stewards of Moore’s law will be relentless in our path to innovate in the magic of silicon.”",
    "The reason, Gelsinger said, is that new advances in transistor manufacturing have the potential to break the transistor logjam and even accelerate the pace of transistor increases. While the semiconductor industry is moving to adopt new Extreme Ultraviolet (EUV) lithography that will allow for more transistors to be etched into a silicon chip, Intel is going a step further to adopt High-NA EUV, which is a more advanced lithography technique.",
    "In addition, Intel's Foveros Omni model allows for vertical chip expansion, which will give more space for transistors in the same horizontal space as current chips.",
    "After a rough couple of years, Intel seems to be in a very resurgent position thanks to the imminent release of its Alder Lake processors. The new CPU design, which features a big.LITTLE architecture pioneered by Arm, is a big differentiator from its archrival AMD, which isn't expected to introduce the same architecture innovation until its Zen 5 processors at the earliest, with a Zen 6 introduction much more likely.",
    "Combined with next-next-gen EUV silicon lithography, Intel could pull ahead even further. And since Intel relies almost exclusively on its own fabrication process, its innovations are more likely to be kept in-house, giving Intel a definite advantage over AMD and even Apple, both of whom rely on semiconductor fabricator TSMC.",
    "“You know, I think we’re going to be comfortably ahead of anybody else in the industry,” Gelsinger said. “I don’t think it’s that nobody else is going to be participating. But I expect as we look at those coming together, you know, we’re just going to be adding advantage [with its IDM 2.0 manufacturing strategy], as we look out over the rest of the decade.”"
  ],
  "headers": {
    "7": "Analysis: can Intel pull ahead once again? It's possible"
  },
  "links": {
    "PCWorld": "https://www.pcworld.com/article/547802/intels-gelsinger-pledges-to-beat-moores-law-over-the-next-decade.html"
  }
}