{
  "source": "https://www.techradar.com/news/obi-wan-kenobi-disney-plus-series-has-announced-its-all-star-cast",
  "title": "Obi-Wan Kenobi Disney Plus series has announced its all-star cast",
  "category": "entertainment",
  "updated": "2021-03-29T15:00:44Z",
  "author": "tom-power",
  "summary": "The Force is with them all",
  "article": [
    "It's about time we heard some concrete information on the Obi-Wan Kenobi series that's coming to Disney Plus. After things went quiet on the news front recently, the Jedi's standalone Star Wars TV show has received a major update in the form of several casting announcements.",
    "After months of speculation, the official Star Wars Twitter account has finally revealed which actors will be appearing in the Obi-Wan Kenobi TV series. As you'd expect, Ewan McGregor and Hayden Christensen will reprise their roles as Obi-Wan and Darth Vader respectively - Christensen's return was announced in December 2020 - but it's the other stars who are of most interest to us.",
    "Check out the official announcement below:",
    "Alongside McGregor and Christensen, Joel Edgerton and Bonnie Piesse will reprise their roles as Uncle Owen and his wife Beru Lars from Star Wars Episode II and Episode III. Additionaly, Indira Varma - who was rumored to have been cast in the TV show - is officially onboard as part of the supporting cast. Other notable inclusions are Silcon Valley's Kumail Nanjiani, Fast & Furious' Sung Kang and Straight Outta Compton's O'Shea Jackson Jr.",
    "Spoilers for the entire Star Wars film catalogue from this point on. Turn back if you're one of the few who hasn't seen all of the movies.",
    "Right now, we know which four actors will be returning to roles that they have previously played in Star Wars productions. As we said, McGregor and Christensen are back as the Jedi and Sith Lord respectively, and we can expect the duo to cross paths at some point for, hopefully, another lightsaber duel.",
    "Edgerton and Piesse will portray the Lars, too. For those unfamiliar with Owen and Beru, the Tattooine-based couple are the ones who are entrusted by Obi-Wan with raising Luke Skywalker. Obi-Wan is believed to have told the Lars that Anakin Skywalker, who becomes Darth Vader, died as a Jedi, and Obi-Wan was tasked with finding a new surrogate home for Luke. Given that part of the Obi-Wan series will see him watching over Luke from a distance, it isn't surprising to see Owen and Beru make their live-action returns.",
    "As for the rest of the cast, there's no word on what role they will play in proceedings. It's possible that some of them will be cast in roles as Empire commanders or generals, while there are bound to be allies that Obi-Wan has on Tattooine.",
    "What would be extremely cool, though, would be another Jedi showing up to help to keep Luke safe. We know that other Jedi Knights survived Order 66, which was the command given to all clone troopers to gun their leaders down in Episode III: Revenge of the Sith, such as Anakin Skywalker's former padawan Ahsoka Tano, Jedi Master Yoda, and Star Wars Jedi: Fallen Order video game protagonist Cal Kestis.",
    "There are plenty of Jedi Knights who survived the execution order throughout Star Wars comics, novels, and other media, so whose to say one won't show up here? Obi-Wan will need all of the help he can get to keep Luke safe, so we'd be delighted to see someone like Nanjiani, Kang, or Moses Ingram team up with McGregor.",
    "Per StarWars.com, filming on Obi-Wan Kenobi begins in April, with a 2022 release date tentatively penciled in. The TV series will launch exclusively on Disney Plus when it is released."
  ],
  "headers": {
    "4": "Obi-Wan Kenobi: Who's who in the Disney Plus Star Wars TV show?"
  },
  "links": {
    "Disney Plus": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1225684929320131800&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2Fen-gb%2Fwelcome%3F%26cid%3DDSS-Search-Google-71700000070665426-%26s_kwcid%3DAL%218468%213%21500174328676%21e%21%21g%21%21disneyplus%26gclid%3DCj0KCQjw9YWDBhDyARIsADt6sGayH3ZGkfJlGM3REpBxjFQTXfXSP-KRl21J5IYFdtTJbSi3rj7YlncaAqFUEALw_wcB%26gclsrc%3Daw.ds",
    "announced": "https://www.techradar.com/news/hayden-christensen-will-play-anakin-skywalker-again-in-disneys-new-obi-wan-series",
    "rumored": "https://www.techradar.com/news/obi-wan-kenobi-tv-show-adds-game-of-thrones-actress-as-mystery-character",
    "StarWars.com": "https://www.starwars.com/news/obi-wan-kenobi-series-cast"
  }
}