{
  "source": "https://www.techradar.com/news/inside-the-bad-batch-the-star-wars-tv-show-about-the-fallout-of-order-66",
  "title": "Inside The Bad Batch, the Star Wars TV show about the fallout of Order 66",
  "category": "entertainment",
  "updated": "2021-06-28T14:54:23Z",
  "author": "samuel-roberts",
  "summary": "We spoke to the talent behind the newest Star Wars animated series",
  "article": [
    "If you're a Star Wars fan and you're only partially familiar with the events of The Clone Wars series, there's one big reason to tune in to The Bad Batch. This spin-off show finally gives you a proper look at the rise of the Galactic Empire in the immediate aftermath of Order 66 – from the perspective of an elite squad of Clone troopers who find the universe around them has transformed overnight.",
    "It feels like a part of the Star Wars universe you've never seen explored in much detail, other than briefly in places like the excellent game Jedi Fallen Order.",
    "\"That was one of the most exciting things for us to dive into with this series,\" says Jennifer Corbett, the head writer of Star Wars: The Bad Batch, which begins on Disney Plus on May 4 to mark Star Wars Day. \"Because when you talk about the end of the Clone Wars – what that actually looks like for not only Clone Force 99, but the Clones in general and what the galaxy looks like – it's not the Empire that everybody is so used to from the Original Trilogy, and from Star Wars Rebels, where it was the height of its dominance over the galaxy.\"",
    "The Emperor has only just seized control of the galaxy in this show – so you're seeing the Empire in an earlier state, with entire worlds in a state of flux.",
    "\"It's the beginning stages of that, and what that looks like and what the galaxy is going through immediately when the war is over – and how some planets and systems are happy the war's over and are embracing the Empire because of that, and others are a little bit more leery of the Empire and what what their reign truly means.\"",
    "The Bad Batch is about the soldiers of Clone Force 99, who debuted in The Clone Wars' final season. They were each customized to be specialists – Hunter is the show's de facto protagonist, and the crew's leader, and he's got heightened senses that make him an asset in battle. Crosshair, meanwhile, is a deadly sniper. Echo, who had a long-running arc in The Clone Wars, is cybernetically enhanced to give the team a tactical edge in battle. The fast-talking, nerdier Tech is a computer expert. Wrecker, meanwhile, is a really big dude with incredible strength.",
    "All of the Bad Batch crew members are played by Dee Bradley Baker, the voice of all Clone troopers in The Clone Wars, which is quite a feat given how many scenes feature the titular heroes talking to each other.",
    "\"I voice almost all the characters,\" Baker says. \"There's a few new ones, and there's a few old ones in there too, as you'll know if you've seen the trailer.\" Ming-Na Wen reprises her role as The Mandalorian's Fennec Shand, only earlier in the Star Wars timeline, which is what Baker is alluding to here.",
    "\"It's an oddly solitary experience, and yeah, I'm making it as a collaboration. [Director] Brad Rau and Jennifer Corbett, they're in there with me as we make this story together... Often but not always, it's just me working through the scene, with myself. But there are times that we're also collaborating as well, with the rest of the cast. It's odd. It's an odd kind of acting, especially these days with the virus, where it's all done remotely now.\"",
    "As a set of characters, The Bad Batch find themselves losing the autonomy they had throughout the events of The Clone Wars. The show explores how that affects them, and what their place is in this new world.",
    "\"In terms of the Bad Batch, it was fun to explore their feelings, because with the Republic, they were given a lot of freedom, and didn't really report to anybody except for Commander Cody at times,\" Corbett tells us. \"But with the Empire, they run things a little differently. And we definitely wanted to show how the Batch reacts to that.\"",
    "Despite how dark this post-Revenge of the Sith period is – any Jedi who hasn't been killed yet is in exile, like Obi-Wan or Yoda – the show is closer to The Clone Wars in tone than you might think. It still has standalone stories, and the writers find ways to keep the series funny and light, as is the case with any work of Star Wars fiction.",
    "\"With The Bad Batch, we think of it as a spiritual successor to The Clone Wars,\" says director Brad Rau. \"So there's a lot that it has in common. When we even start our first episode, we're backing up a little bit time-wise from what we've seen at the very end of the Clone Wars, so it overlaps. It's something that Dave Filoni wanted us to do, and it's really, really exciting to see how things come about, like Order 66.",
    "\"So in that sense, there's a lot in common, but having these characters that we only know a little bit about from that arc in the final season of The Clone Wars gives us an opportunity to carry on that legacy and storytelling of Clone Wars, but through new characters' eyes. So somebody who's not familiar with The Clone Wars can start with The Bad Batch and carry forward, and if you know who they are, even better, but it's one reason why we wanted to use those particular characters.\"",
    "You don't need expert knowledge to enjoy the show, then – releasing on Disney Plus, a platform widely available around the world, makes a big difference to how accessible this show is compared to a cable-bound series like The Clone Wars. If you're a Star Wars fan who's never seen an animated project set in this universe before, you won't feel overwhelmed by anything here. It might even encourage you to begin a long 133-episode binge of its predecessor.",
    "\"It's really interesting to see how the team of the Bad Batch respond to the transformational changes that are suddenly imposed upon them, with the transfer from Republic to the Empire,\" says Baker when we ask how the characters evolve over the course of this first season. \"The tensions and the differences that exist within this group, this really fine-tuned group, those are brought out in very interesting if even potentially explosive ways due to the pressures of this transformation from Republic to Empire. To a universe that is much more authority-based, and rule-based.",
    "\"And The Bad Batch, they kind of play by their own rules. Although, within the group, there's an interesting difference in dynamic in terms of authority and control and world view, shall we say. This very much plays out in a big way as the season plays out.\"",
    "The hope is that this could lead to a second season of stories featuring the characters. The big question with The Bad Batch is whether you're watching a tragedy play out or not – on the surface, things don't look great for a bunch of Clone Troopers with moral compasses existing at this time in Star Wars' history. It's not a great time to be a hero.",
    "But whether they'll survive this ever-changing galaxy – and how they'll actually endure – is definitely a strong hook for a new Star Wars story.",
    "Star Wars: The Bad Batch begins on May 4 on Disney Plus, with new episodes releasing every Friday thereafter, starting on May 7."
  ],
  "headers": {
    "5": "The best of the best",
    "12": "Sequel series"
  },
  "links": {
    "Jedi Fallen Order": "https://www.techradar.com/reviews/star-wars-jedi-fallen-order-review",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}