{
  "source": "https://www.techradar.com/news/netflixs-first-trailer-for-cowboy-bebop-looks-pretty-good-actually",
  "title": "Netflix's first trailer for Cowboy Bebop looks pretty good, actually",
  "category": "entertainment",
  "updated": "2021-09-25T18:26:50Z",
  "author": "tom-power",
  "summary": "Cowboy Bebop lands on Netflix in November",
  "article": [
    "The first trailer for Netflix's adaptation of Cowboy Bebop has been released, and it actually looks pretty rad.",
    "Unveiled at Netflix's first-ever global fan event – Tudum – the first teaser showed off John Cho, Daniella Pineda and Mustapha Shakir as Spike Spiegel, Faye Valentine and Jet Black in action for the very first time.",
    "In something of a cool nod to the original anime series, Netflix's Cowboy Bebop's first teaser is actually the show's title sequence. This was confirmed as much in an official Netflix tweet, which you can see below, and acts a wonderful tribute to the franchise that was created by Hajime Yatate.",
    "Check out the first look at Netflix's Cowboy Bebop below:",
    "If that wasn't enough, Netflix also revealed a first look at some of the show's supporting characters, including Alex Hassell as Vicious and Elena Satine and Julia:",
    "Per an official synopsis from Netflix, Cowboy Bebop will follow \"a ragtag crew of bounty hunters [who] chases down the galaxy's most dangerous criminals. They'll save the world... for the right price.\"",
    "Speaking to Entertainment Weekly before Netflix's Tudum event, showrunner André Nemec claimed that Netflix's adaptation will be \"an expansion to the canon\" and that it'll \"never take the original anime away from the purists\" and \"does a really nice job of not violating the canon\".",
    "Cowboy Bebop will stream exclusively on Netflix on Friday, November 19."
  ],
  "headers": {},
  "links": {
    "Tudum": "https://www.techradar.com/news/how-to-watch-tudum-online-date-start-time-and-what-to-expect-from-the-netflix-event",
    "Entertainment Weekly": "https://ew.com/tv/cowboy-bebop-netflix-series-preview/?utm_campaign=entertainmentweekly_entertainmentweekly&utm_content=new&utm_medium=social&utm_source=twitter.com&utm_term=6149dc09e56df4000174e603"
  }
}