{
  "source": "https://www.techradar.com/news/security-budgets-wasted-on-remote-working-it-managers-say",
  "title": "Security budgets wasted on remote working, IT managers say",
  "category": "computing",
  "updated": "2021-06-23T22:33:22Z",
  "author": "anthony-spadafora",
  "summary": "Securing a remote workforce is a costly endeavor",
  "article": [
    "Keeping employees connected and secure while working from home has proven to be a costly endeavor for organizations according to a new survey from JumpCloud.",
    "To compile its new 2021 State of the SME IT Admin Report, the cloud computing company surveyed 401 IT decision makers at SMEs across a variety of industries back in April of this year.",
    "When it came to their organization's security budgets during the pandemic, 60 percent of respondents said their companies overpaid for identity management software while 56 percent said that too much money was spent enabling their employees to work remotely.",
    "JumpCloud CEO Rajat Bhargava explained in a press release how IT admins played a critical role when it came to making it possible for employees at their organizations to work from home, saying:",
    "“COVID-19 has highlighted that while IT admins are often behind the scenes, they are the team that ensures secure and simple workflows for every employee in SMEs. Remote work put enormous pressure on admins and organizations, and now that the work landscape has changed permanently, the top priority for SMEs is to address those challenges. IT professionals’ 2021 priorities of layered security for more secure work-from-anywhere, making remote work easier, and more efficient device management underscore the need for a more consolidated, platform-based approach to IT that reduces complexities and cost.”",
    "In the coming year as part of the transition to hybrid working, IT budgets will prioritize remote management (58.4%), security (55.9%) and cloud services (50.1%). One of the main reasons for this is due to the fact that 74 percent of the IT admins surveyed by JumpCloud said that remote work made it more difficult for employees to follow best practices when it came to security.",
    "Respondents also listed software vulnerabilities (39%), credential reuse across apps and online services (37%), unsecured home networks (36%) and device theft (29%) as their top security concerns. While using a password manager can help with credential reuse, nearly a quarter (24%) of organizations have adopted a zero trust approach to security and 33 percent of SMEs plan to adopt one going forward.",
    "Although supporting remote work over the past year has been expensive for organizations worldwide, they are now in a much better position to allow employees to work from home some days and from the office on others.",
    "Before the pandemic, remote work was considered a perk that some companies offered but now employees are prepared to work from anywhere which will continue to pose a challenge to IT admins as their organizations begin implementing hybrid working models.",
    "Via ZDNet"
  ],
  "headers": {
    "5": "Impact of remote work"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "JumpCloud": "https://www.techradar.com/news/security-and-remote-working-thinking-about-access",
    "2021 State of the SME IT Admin Report": "https://jumpcloud.com/resources/it-trends-report-remote-work-security-cloud-services",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "identity management software": "https://www.techradar.com/best/best-identity-management-software",
    "press release": "https://www.globenewswire.com/news-release/2021/06/23/2251690/0/en/JumpCloud-2021-State-of-the-SME-IT-Admin-Report-Highlights-IT-Challenges-Managing-Remote-Work-and-the-Need-for-Consolidation.html",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "password manager": "https://www.techradar.com/best/password-manager",
    "zero trust": "https://www.techradar.com/news/when-establishing-a-zero-trust-approach-dont-forget-to-monitor-vpn-activity-levels",
    "ZDNet": "https://www.zdnet.com/article/it-leaders-say-cybersecurity-funding-being-wasted-on-remote-work-support-survey/"
  }
}