{
  "source": "https://www.techradar.com/news/upworks-project-catalog-makes-it-easier-than-ever-to-kickstart-work",
  "title": "Upwork's Project Catalog makes it easier than ever to kickstart work",
  "category": "computing",
  "updated": "2021-07-20T15:41:14Z",
  "author": "barclay-ballard",
  "summary": "The platform lets freelancers curate predefined projects",
  "article": [
    "Freelancing platform Upwork has launched a new platform to help businesses and independent professionals work together.",
    "Project Catalog contains a curated collection of predefined projects, making it easier for businesses to solve their most pressing work needs quickly.",
    "Project Catalog hosts tens of thousands of projects spread across more than 300 categories, including design, IT, marketing, translation, and writing. Each project’s scope, cost, timings, and other deliverables are clearly outlined before businesses commit.",
    "Although Project Catalog will certainly making finding contractors easier for businesses, it will also offer benefits to freelancers, providing them with a new controlled revenue stream. By allowing them to package up their skills, it makes it easier for them to market their services.",
    "“We see on the horizon a future in which independent talent will work at the heart of every business,” Hayden Brown, President and Chief Executive Officer at Upwork, said.",
    "“COVID-19 provided a shock to the system for businesses everywhere, many of which are now rethinking how they work for the long term. Many have experienced the incredible benefits of accessing the most highly skilled talent on demand, regardless of location, using Upwork. They are starting to understand the tremendous competitive advantage that an instantly scalable workforce of talented people offers - and we are continuing to sharpen these advantages, most recently with the global launch of Project Catalog.”",
    "As the Upwork CEO mentioned, the COVID-19 pandemic has had a huge effect on the world of work. With many businesses seeing reduced demand, cost-cutting has often been employed, with full-time staff made redundant. Simultaneously, freelance workers have increased in number, some of whom will no doubt be keen to try out Upwork’s new platform."
  ],
  "headers": {
    "3": "The COVID jobs crisis"
  },
  "links": {
    "Upwork": "https://upwork.pxf.io/c/221109/1062918/13634?subId1=trd-us-2723036050650719000&sharedId=trd-us&u=https%3A%2F%2Fwww.upwork.com%2F"
  }
}