{
  "source": "https://www.techradar.com/news/microsoft-is-planning-major-asia-cloud-push",
  "title": "Microsoft is planning major Asia cloud push",
  "category": "computing",
  "updated": "2021-06-19T00:47:25Z",
  "author": "anthony-spadafora",
  "summary": "Software giant aims to capitalize on growing cloud demand in China",
  "article": [
    "As demand for cloud computing services has grown in Asia, Microsoft is planning to add four new data centers in China by the beginning of 2022 according to a new report from Bloomberg which spoke with people familiar with the matter.",
    "The software giant already has six data centers in the country but back in March it announced its plans to expand its service capacity in the region by adding a new Azure region in Northern China. Just like with its existing data centers, these new facilities will by operated by its local partner 21Vianet.",
    "In a blog post released back in March, Microsoft explained that its upcoming expansion is expected to effectively double the capacity of its intelligent cloud portfolio in China which includes Azure, Microsoft Office 365, Dynamics 365 and Power Platform which is operated by 21Vianet.",
    "The Chinese cloud computing market is also expected to reach $46bn in 2023 according to a white paper from the Development Research Center of the State Council (DRC) of China. By expanding its service capacity in the next few years, Microsoft hopes to capitalize on this trend and take on Alibaba Cloud and other homegrown cloud providers.",
    "Microsoft has collaborated with 21Vianet for almost a decade now and together the two companies launched the Microsoft Cloud platform in 2014 with two initial regions. In fact, Microsoft Azure was the first international public cloud service to be generally available in the Chinese market through a local operating partner.",
    "Chairman and CEO of the Microsoft Greater China Region (GCR) Alain Crozier provider further insight on how the company's new Azure region in Northern China will bring additional opportunities to Chinese businesses, saying:",
    "“The upcoming region will reinforce the capabilities to help further nurture local talents, stimulate local innovation, grow local technology ecosystems, and empower businesses in a wide range of industries to achieve more.\"",
    "Although digital transformation efforts have been slower in China in the past, the pandemic led 63 percent of organizations in the country to begin leveraging cloud-related innovations in their products, payments, e-commerce, automation and more.",
    "We'll likely hear more about Microsoft's four additional data centers and its new Azure region in Northern China once we get closer to their launch next year.",
    "Via Bloomberg"
  ],
  "headers": {
    "4": "Microsoft Cloud platform"
  },
  "links": {
    "cloud computing services": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "new report": "https://www.bloomberg.com/news/articles/2021-06-18/microsoft-plans-massive-china-expansion-in-asia-wide-cloud-push?srnd=technology-vp",
    "Azure region": "https://www.techradar.com/news/microsoft-wants-to-make-sure-azure-never-lets-you-down",
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1103055082402897700&murl=https%3A%2F%2Fazure.microsoft.com%2Fen-us%2Fblog%2Fnew-azure-region-coming-to-china-in-2022%2F",
    "Alibaba Cloud": "https://www.techradar.com/reviews/alibaba-cloud",
    "public cloud service": "https://www.techradar.com/news/a-public-cloud-service-has-ranked-among-the-most-powerful-supercomputers-for-the-first-time",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "63 percent": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6802868284275409000&xs=1&url=https%3A%2F%2Fnews.microsoft.com%2Fapac%2F2020%2F09%2F10%2Fa-culture-of-innovation-fuels-business-resilience-and-economic-recovery%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-planning-major-asia-cloud-push",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-06-18/microsoft-plans-massive-china-expansion-in-asia-wide-cloud-push?srnd=technology-vp"
  }
}