{
  "source": "https://www.techradar.com/news/latest-ipad-deals-at-amazon-give-dollar40-price-cut-on-the-ipad-air-4",
  "title": "Latest iPad deals at Amazon give $40 price cut on the iPad Air 4",
  "category": "tablets",
  "updated": "2021-01-06T12:40:06Z",
  "author": "alex-whitelock",
  "summary": "A return to the lowest price we've seen so far",
  "article": [
    "iPad deals are landing early this new year with a surprise discount on the new iPad Air 4 - on sale for just $559 (was $599) at Amazon right now.",
    "This is a return to the pricing we saw over Black Friday, and the lowest price yet on this new Apple tablet. So far, it's looking like the blue color is the most readily available, with a delivery date of January 21st currently.",
    "Unfortunately, you've just missed the opportunity to catch one of the silver models for the same price this side of March. Well, you can still put your order in for the same price, but it looks like the next wave of stock has all been snapped up already. We definitely expect the blue devices to go the same way very soon, so we'd act quickly if you want to secure yours by the end of January.",
    "The new iPad Air 4 is quite the departure for Apple, with its emphasis on offering a little bit more of a premium package than the previous Airs. Of course, it's still really lightweight, but the new A14 chip inside means that you're getting performance more akin to what we've come to expect on the iPad Pros. With that hefty processor does come a higher price tag than before, but a gorgeous new squared-off aesthetic, nearly all-screen design, and expanded choice of colors means the new iPad Air isn't just an iterative improvement over the last-gen - it's a new direction for the mid-range tablet from Apple.",
    "If you'd like to see what other iPad deals are available, we have a main best iPad deals page with a breakdown of this week's best prices for each model. Another good option is our best cheap Android tablet deals page, where you'll find great alternatives from Samsung, Lenovo, and more."
  ],
  "headers": {
    "4": "Apple iPad Air 4 deals at Amazon"
  },
  "links": {
    "for just $559": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J61FCVN%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3036085229344689000-20",
    "for the same price": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J62F1RH%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3731697442042008000-20",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "best iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "best cheap Android tablet deals": "https://www.techradar.com/deals/the-best-cheap-android-tablet-deals"
  }
}