{
  "source": "https://www.techradar.com/news/nokia-boosts-5g-ambitions-with-new-reefshark-powered-network-gear",
  "title": "Nokia boosts 5G ambitions with new ReefShark-powered network gear",
  "category": "phones",
  "updated": "2021-06-25T09:16:10Z",
  "author": "steve-mccaskill",
  "summary": "Nokia refreshes Massive MIMO, baseband and 5G software",
  "article": [
    "Nokia has refreshed its AirScale 5G portfolio, hoping a new range of baseband, radio and Massive MIMO antennas powered by its latest ReefShark chipsets will deliver a boost to its ambitions in the telecoms equipment market.",
    "The Finnish firm says the new products will boost the speeds, capacity and connectivity capabilities of 5G networks, allowing operators to deliver enhanced mobile broadband and entirely new services for consumers and businesses.",
    "These benefits, it says, can be done while lowering total cost of ownership (TCO), reducing energy consumption, and simplifying management and deployment of complex network environments.",
    "Massive MIMO is a multi-user MIMO (multiple-input multiple-output) technology that can provide uniformly good service to wireless terminals in high-mobility environments. It is an essential technology for the 5G standard because of its ability to increase capacity cost-effectively.",
    "Nokia’s new ReefShark-powered Massive MIMO antennas can handle multiple frequency requirements and network sharing, while the ‘32TRX’ model weights just 17kg. This means it can be more easily deployed at existing network sites where physical capacity is a challenge.",
    "The AI capabilities of ReefShark means in the future, Massive MIMO will be enhanced by beam pattern organisation, energy saving, advanced traffic steering, advanced packet scheduling, and alarm pattern discovery. In short, Nokia’s customers will benefit from more efficient networks that can meet the demadns of customers. Proof of Concepts will deployed later this year.",
    "The company is also introducing new baseband plug-in cards that boosts capacity of 5G networks by allowing them to process data generated by more users. Nokia says its new ReefShark cards can deliver eight times the throughput of previous generations and support up to 90,000 simultaneous users. A modular design means it is easily scalable.",
    "Finally, Nokia has upgraded its Single RAN software to include 5G. Single RAN software allows a single base station to operate multiple standards (2G, 3G, 4G and 5G), allowing operators to pool resources to drive efficiency. All of Nokia’s new innovations are Open RAN ready.",
    "“Our new generation of ReefShark-powered AirScale radio and baseband products is evidence of the successful transformation of our business and ability to deliver market-leading products to our global customers,” said Tommi Uitto, President of Mobile Networks, Nokia.",
    "Nokia’s new portfolio enables communication service providers to offer both consumer and enterprise customers with cutting-edge 5G experiences with premium speeds, capacity and connectivity underpinned by seamless, simple, and efficient ‘plug-in’ deployment. Our new AirScale products are O-RAN ready. They consume less energy and highlight our commitment to climate change. We’re excited to see our customers deploying these products and see the transformative impact of 5G technology.”",
    "Nokia is locked in a fiercely contested battle with other Network Equipment Providers (NEPs) such a Ericsson and Huawei and had pitched itself as the only vendor to have a portfolio that extends across the radio, transport and core layers of the network.",
    "However, the company was surprised by the earlier-than-expected shift to 5G and has struggled with the high cost of developing 5G technologies. There has also been criticism that it has failed to fully capitalise on Huawei’s well-documented struggles, with Ericsson generating significant momentum in North America and also winning contracts in China.",
    "Pekka Lundmark was appointed as CEO last summer to remedy the situation and he initiated a major internal restructure that abandoned the ‘end-to-end’ strategy.",
    "After a solid Q4, Lundmark had warned revenues would drop in 2021 as the company did “whatever it takes” to win 5G. However the early signs have been encouraging, and this latest tranche of releases will do no harm to its cause."
  ],
  "headers": {
    "3": "Nokia 5G"
  },
  "links": {}
}