{
  "source": "https://www.techradar.com/news/canon-eos-r5c-release-date-price-rumors-and-what-we-want-to-see",
  "title": "Canon EOS R5c release date, price, rumors and what we want to see",
  "category": "cameras",
  "updated": "2021-07-23T13:56:57Z",
  "author": "andrew-williams",
  "summary": "A video-focused EOS R5 is in the pipeline, it seems",
  "article": [
    "The Canon EOS R5 has been slowly improving its video skills thanks to new firmware updates, but the rumors are already growing about a new video-focused follow-up called the Canon EOS R5c.",
    "Why give the EOS R5 a new mirrorless sibling when it already has 8K video and claims of being the ultimate hybrid camera? Canon’s main aim with the EOS R5c will likely be addressing the overheating limitations that dogged the R5.",
    "While those problems became somewhat overblown, Canon's flagship does have practical limitations – including recording limits and long overheating recovery times – that mean it can never quite be the video king that the R5c promises to be.",
    "The Canon EOS R5c will apparently fix this with 'active cooling', adding weight and potentially losing weatherproofing to let you shoot high-quality video for much longer. And that’s why the “c” in Canon EOS R5c may well stand for “cinema\".",
    "We've rounded up all of the latest rumors for the R5c – and also added our thoughts on what we want to see from this promising rival to the Sony A7S III and Sony FX3.",
    "The Canon EOS R5c will be announced in late 2021 and released in early 2022, according to Canon Rumors. This means it should arrive around 18 months after the Canon EOS R5.",
    "We have no indications of its price yet, but the expected pro-friendly features mean it is likely to be at least a little more expensive than the Canon EOS R5. That camera cost $3,899 / £4,199 / AU$6,899 at launch.",
    "Interestingly, the Sony FX3 (above) – another small mirrorless camera aimed at solo filmmakers – has an identical price tag to the EOS R5, so the EOS R5c is unlikely to command a much higher price tag than that.",
    "That said, the FX3 can't shoot 8K video, so Canon may pitch the EOS R5c as an alternative for those who need the flexibility and future-proofing of that higher-resolution mode.",
    "The main rumored feature of the Canon EOS R5c is active cooling – this should be able to fix the much-reported overheating issues of the EOS R5. On the latter, these limit video shooting to 35 minutes continuously at 4K/60, or just 15 minutes at 8K.",
    "Pro videographers will often need, or at least want, more. But how can active cooling be added to a mirrorless camera? 'Active cooling' usually means using a fan. This introduces a few obvious problems, particularly in a camera for video.",
    "Will fan noise be noticeable during capture? While pro-level RED cameras use fans, their microphones are less likely to sit just a handful of centimeters away from the noise in real-world shooting scenarios, like on the EOS R5c.",
    "And how might Canon maintain weather sealing in a camera with a fan? Such cooling systems rely on clear airflow between the component heatsinks and the outside world.",
    "How about a water cooling system, popular among some PC builders? We have serious doubts about the practicality of this. The volume of liquid you could fit into a camera system would be tiny, and water cooling still requires a pump, so would not be silent either. It's not going to happen, hopefully.",
    "Another option is the vapor chamber, used in some high-end phones. It is also part of the Xbox Series X cooling system.",
    "A vapor chamber is effectively a turbo-charged heatsink, using a vacuum-sealed chamber and a small amount of liquid that evaporates and condenses to take heat away from a processor, quickly and evenly.",
    "This would likely work much better than the Canon EOS R5’s cooler but it’s not really an 'active cooling' system. It’s still passive, and while a vapor chamber would be great at spreading heat around, it wouldn’t help Canon get it out of the EOS R5c body all that much.",
    "Sony gives us a preview of what the Canon EOS R5c cooling tech will probably be like. It uses active cooling in its new FX3, and suggests maybe we don’t need to worry so much about fan noise.",
    "We like what we see here. The Sony FX3 has a single fan that brings cool air in from a slot in the bottom, presumably just behind where a stand mount would sit, and pushes it out the left side (relative to your shooting position).",
    "There are high surface area heat sinks towards the heat outlet, which are no doubt connected to the area behind the sensor and processor. This may be as part of either a solid heatsink, or using heat pipes: even better. These are a little like the vapor chambers mentioned earlier, vacuum sealed with a tiny amount of easy-to-evaporate liquid inside, to boost the efficiency of heat spread.",
    "Sony uses an orange color for these heat sink parts, suggesting rather vaguely they may be made of copper. This is an excellent heatsink material as copper has very high thermal conductivity.",
    "It would not be impossible to make a similar arrangement in the Canon EOS R5c that still offers a reasonable degree of weather sealing. It’s the outer parts of the heat sinks that need to be exposed to the air, so Canon could theoretically partially seal off this cooling air tunnel and provide some weather resistance.",
    "A Canon EOS R5 teardown by Lensrentals shows the current camera has a basic metal plate to spread heat away from the sensor/processor. Lensrentals suggests this is aluminum, but Canon’s statement regarding the R5’s overheating suggests it may actually be magnesium, which has even lower thermal conductivity than aluminum: \"Magnesium alloy was used in the body to dissipate heat away from internal component,” it reads.",
    "It would not be too hard to improve the EOS R5's cooling situation in the Canon EOS R5c. But this will mean the camera is likely significantly thicker than the EOS R5, and probably a good bit heavier. Magnesium alloys weigh around 1.85g per cubic centimeter, according to Total Materia, far less than the 8.94g of copper.",
    "Canon Rumors says the EOS R5c will otherwise have specs and features similar to the EOS R5. That means a 45MP sensor, 4K video up to 120fps and 8K capture at 30fps.",
    "There’s no reason to believe it won’t match the R5 for burst performance either, given this is limited by the buffer and storage rather than heat. The Canon EOS R5c will likely offer 12fps using its mechanical shutter, or 20fps with its silent/electronic shutter.",
    "One other rumored change from the EOS R5 is Canon Log 2. The R5 has Canon Log and, thanks to a recent firmware update, Canon Log 3. However, Canon Log 2 pushes even harder for high dynamic range, at the risk of more shadow noise.",
    "The obvious first thing to request of an actively cooled 'cinema' camera with 8K capture is no limit on that shooting mode. Sure, that would be nice. But unlimited 4K/60p is the real thing most of us need right now.",
    "The Canon EOS R5 is currently limited to around 35 minutes of 4K/60p video using the full frame width, or 25 minutes with an APS-C crop. Remove that cap completely and the EOS R5c suddenly becomes a much more amenable work tool.",
    "At the very least we want to see the battery become the bottleneck, although as the EOS R5 can already be powered over USB-C with the right power bank, more would be welcome.",
    "An 8K cap of an hour also seems feasible, and pushes at the limits of what you’ll fit on a 1TB CFexpress Type B card when shooting 8K raw. Still, now that 2TB cards are available maybe we should ask for the moon and expect unlimited 8K capture too.",
    "If the Canon EOS R5c is to have a fan, some control over its operation is important. We should be able to disable it completely for silent shooting, and be restricted to similar shooting durations seen in the EOS R5. That said, some of those ceilings could be raised by a more effective heatsink and greater exposure to air, even without the fan running.",
    "This would be Canon’s easy get-out for any complaints about fan noise. When you’re using the internal mics, or an outboard one close enough to pick up fan noise, just use the fanless operation mode to shoot a quiet scene in video.",
    "Canon should also offer a 'fan boost' feature, that helps clear heat out quickly after these fan-free stints, so you can get back to shooting more quickly.",
    "Here’s a Canon EOD R5c feature we probably won’t get, but one that could dramatically improve the affordability of shooting masses of 4K/60p or 8K footage using storage-hungry ALL-I compression. It’s recording to an SSD via the USB-C port.",
    "The Canon EOS R5 supports recording to external storage, over HDMI. An Atmos Ninja V is the obvious choice for many. It costs $599 / £525 / AU$988 and records to relatively cheap 2.5in SATA SSDs or extremely cheap (but slow) hard drives.",
    "Recording via USB would let us use the same SSD drives you might put into a PC. And even the older SATA standard is fast enough for the EOS E5c’s top raw 8K mode. Newer M.2 SSD drives can write data at up to five times the required pace.",
    "Canon wouldn’t even need to upgrade the USB spec. The EOS R5 has a USB-C 3.1 Gen 2 port with 10Gbps bandwidth, equivalent to 1250 megabytes per second.",
    "Imagine being able to buy a 1TB SSD for around $100 instead of a 1TB CFexpress card for $800. Sounds pretty good, right?",
    "The Canon EOS R5 has two card slots. One takes a CFexpress Type B card, the other an SD card. Unfortunately this CFexpress format doesn’t allow for easy CFexpress/SD combi card slots, seen in the Alpha A1, because CFexpress Type B cards are significantly larger than SDs.",
    "If we are going to be able to shoot video for an awful long time with the Canon EOS R5c, a second CFexpress slot seems a must-have. But we also don’t want to give up the SD slot. Most of us have a small mountain of such cards lying around, they are cheap and top-spec V90 cards even let you shoot 8K video (using greater compression).",
    "So could Canon fit three card slots in the EOS R5c? There should certainly be room for them, given the proposed internal fan would add to the thickness of the camera body more than an SD slot.",
    "If the Canon EOS R5c is to be a lot like the EOS R5 but thicker, Canon could also accommodate a larger battery.",
    "The EOS R5 uses the LP-E6NH, a battery made for the EOS R5 and R6 that offers 20% higher capacity over the LP-E6N. We have doubts as to whether Canon could actually do this, creating a new battery for what will probably be a relatively niche camera.",
    "But it would work well with extended video recording times, particularly if powering the camera over USB won’t be an option for your shoot."
  ],
  "headers": {
    "5": "Canon EOS R5c release date and price",
    "9": "Canon EOS R5c rumors and features",
    "27": "1.) Unlimited 4K/60p video capture",
    "31": "2.) Fan control modes",
    "34": "3.) Recording via USB-C",
    "39": "4.) Triple card slots",
    "42": "5.) A larger battery"
  },
  "links": {
    "new firmware updates": "https://www.techradar.com/news/canon-eos-r5-firmware-update-brings-serious-video-upgrades",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers",
    "Canon Rumors": "https://www.canonrumors.com/confirmed-a-canon-eos-r5c-is-going-to-be-announced-this-year-cr3/",
    "Lensrentals": "https://www.lensrentals.com/blog/2020/09/taking-apart-the-canon-r5-mirrorless-camera/)",
    "power bank": "https://www.techradar.com/news/top-portable-chargers"
  }
}