{
  "source": "https://www.techradar.com/news/anthony-mackie-to-star-in-tv-adaptation-of-classic-playstation-game",
  "title": "Anthony Mackie to star in TV adaptation of classic PlayStation game",
  "category": "entertainment",
  "updated": "2021-09-16T09:36:43Z",
  "author": "axel-metz",
  "summary": "We're in for a wild ride",
  "article": [
    "Anthony Mackie has signed on to lead a TV adaptation of the classic PlayStation video game series, Twisted Metal.",
    "The Falcon and the Winter Soldier star will also serve as executive producer on the series, which is being co-developed by Sony Pictures TV and PlayStation Production. As per THR, the show will be pitched to potential buyers in the near future.",
    "In the games, Twisted Metal is essentially a demolition derby that encourages players to use ballistic projectiles, machine guns, mines and other types of weapons to defeat their opponents in vehicular combat.",
    "The first Twisted Metal title launched on the original PlayStation back in 1995, and was followed by eight more mainline games spanning the PlayStation 2, PlayStation Portable and PlayStation 3 until 2012.",
    "Mackie will play John Doe in the TV adaptation, a milkman with no memory of his past tasked with delivering a mysterious package (not milk, presumably) across a post-apocalyptic wasteland, Mad Max-style.",
    "Cobra Kai writer Michael Jonathan Smith will pen the script, while also executive producing alongside Mackie and Deadpool writers Rhett Reese and Paul Wernick. Given the latter’s involvement – coupled with the game series’ tongue-in-cheek subject matter – we’d anticipate a TV show bearing tonal similarities to the movies featuring the Merc With A Mouth.",
    "A few years ago, this news might have had our heads in our hands. After all, video game adaptations have been notoriously uninspired throughout the years (looking at you, Hitman).",
    "But recent history has seen the tide change on live-action takes on beloved digital IP. To everyone’s surprise, 2019’s Pokémon Detective Pikachu was actually pretty great, and this year’s Mortal Kombat, too, was a massive hit on HBO Max.",
    "Then there’s the popularity of Netflix’s The Witcher series – which itself spawned an anime spin-off and upcoming prequel series – and the in-development Borderlands movie and The Last of Us TV show.",
    "The point being, in today’s creative climate, video game adaptations aren’t the taboo subject they once were, and there’s every chance that Twisted Metal may actually be a well-made, entertaining ride.",
    "Of course, it’s likely that we’ll have to wait a while until it hits screens, and we still don’t know whether it’ll land on Netflix, Amazon Prime Video, HBO Max or another major streamer.",
    "In the meantime, though, we’ll boot up the original PlayStation and take Sweet Tooth’s ice cream truck for a spin."
  ],
  "headers": {
    "6": "Analysis: a more forgiving creative climate"
  },
  "links": {
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/anthony-mackie-to-star-in-twisted-metal-tv-series-from-sony-1235014432/",
    "Cobra Kai": "https://www.techradar.com/news/cobra-kai-season-4",
    "Mortal Kombat": "https://www.techradar.com/news/mortal-kombat-ending-explained-who-is-cole-young",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "prequel series": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "Borderlands movie": "https://www.techradar.com/news/borderlands-movie-cast-likely-release-date-and-what-we-know-so-far",
    "The Last of Us": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show"
  }
}