{
  "source": "https://www.techradar.com/news/smartphone-battery-tech-what-could-the-next-10-years-bring",
  "title": "Smartphone battery tech: what could the next 10 years bring?",
  "category": "phones",
  "updated": "2021-12-05T14:15:29Z",
  "author": "esat-dedezade",
  "summary": "Battery life will change by 2031",
  "article": [
    "We’ve all suffered from smartphone battery-range anxiety. From the dreaded 15% warning one day into a weekend festival, to navigating maze-like backroads to reach your destination before Maps sucks your handset dry, the dread of running out of juice is one that we can all relate to.",
    "It’s no surprise, then, that battery life is one of the most important features for consumers. The trouble is, while other areas of smartphone tech have improved at a blistering pace – bigger, higher-resolution screens, more powerful innards and pixel-packed cameras – battery tech has lagged sorely behind. When the ancient and miniscule Nokia 8210 is capable of comfortably outlasting your modern pocketable computer by days, it feels like in some ways, we’ve gone backwards. But there is hope.",
    "Battery tech has already improved immensely over the nickel-toting cells used in the 80s. The following decade’s switch to lithium-ion/poly batteries has allowed more power to be crammed into smaller spaces, helping kick-off the smartphone revolution. Today, manufacturers are already using innovative solutions to provide more power, and there isn’t a day that goes by without news of a potentially revolutionary new bit of battery tech hitting the news.",
    "While we can’t possibly cover every single potential advance in battery tech, we’ve grouped together a few that stand out. Join us for a possible glimpse into the future of a one-week-lasting smartphone...",
    "In the most immediate future, manufacturers can (and, in fact, already are) focus on simply cramming larger batteries into our handsets. While this isn’t exactly the most elegant or exciting solution, you can’t argue with the results; the bigger the battery, the longer your phone will last.",
    "Some companies are also going down a slightly different route by using more than one battery in a single device. Apple, Huawei and OnePlus all have handsets that use dual-cell batteries. This not only enables greater flexibility by fitting everything inside a handset with Tetris-block position, but it helps with charging too.",
    "The OnePlus 9, for example, has a dual-cell battery with a total capacity of 4,500mAh. While it isn’t the largest smartphone battery in the world, it’s split design means it can charge incredibly quickly at 65W – a staggering 1-100% in 29 minutes, to be exact. This is because two smaller batteries can charge faster than a single cell.",
    "Ever notice how your phone’s battery life seems to become worse over time? That’s because most smartphones lose around 20% of their original battery capacity within a year of use. That means that after a while, a 100% charge on your aging handset will actually last substantially less than the full charge when it was brand new.",
    "Thankfully, there’s some promising new tech from a bunch of scientists at the Japan Advanced Institute of Science and Technology, which helps batteries retain an impressive 95% of their capacity for five years or more. The solution is all down to a fancy new binder material for the negative terminal, called – *deep breath* – Bis-imino-acenaphthenequinone-Paraphenylene, or BP for short. This tongue-twisting material enables batteries to keep around 95% of their original capacity for more than 1,700 recharges, versus the 500 recharges seen with current tech.",
    "Right, enough with the incremental improvements, let’s bite into some meaty futuristic developments, starting with a new type of battery that could provide future smartphones with multiple days of use.",
    "Developed by researchers from Monash University, a new lithium-sulphur battery not only has a lower environmental impact than current lithium-ion offerings, but it could lead to reduced manufacturing costs to boot, along with providing a five-day battery for smartphones. Electric car fans will also be pleased to hear that the same tech can see you through an impressive 620 miles per charge. Range anxiety be damned.",
    "Another company, Prieto Battery, is taking things one step further, by creating a battery that not only lasts substantially longer, but charges blisteringly fast too. Its battery solution uses a clever copper foam substrate that massively increases the internal surface area compared to that of a traditional battery, by up to 60 times. This means that a Prieto foam battery can have hugely increased power and energy densities.",
    "One example the company gives is a smartphone battery that lasts 10 hours, and that takes only five minutes to charge. Increase the size and thickness a little, and you potentially have the ultimate smartphone battery.",
    "Another exciting field in battery tech is supercapacitors. Not actually batteries per se, they store their potential energy electrostatically, rather than chemically. This allows them to rapidly deliver and accept a charge, far faster than an actual battery. We’re talking up to 1,000 times faster charging, which basically means near-instantaneous charging of any device. Plug, unplug, and off you go.",
    "The downside, though, is the density of their energy storage. It’s roughly a quarter of that stored by weight compared to a regular battery. However, when you can charge a phone in an instant, this might not be as big a problem as you initially thought. With widespread compatible chargers, you could theoretically juice up at coffee shops, offices and so on, in only a few seconds, before being on your merry way. As long as you’re not in the middle of the wilderness, this will all but eliminate range anxiety.",
    "For the immediate future, given the size limitations, a hybrid solution combining the speed of supercapacitors with the energy storage abilities of regular batteries, appears to be an ideal compromise.",
    "You can’t have a talk about future battery tech without mentioning graphene – thought to be the ultimate material for numerous applications.",
    "Graphene is made from a composition of carbon atoms that are tightly bound in a honeycomb-like structure. At just one atomic layer thick, it’s unfathomably thin. These graphene sheets are laden with useful properties, including incredible electrical and thermal conductivity, high strength, flexibility and low weight.",
    "The upshot is that graphene cells offer much faster charging than regular lithium-ion batteries, with much higher capacities, all in a package that’s much thinner and lighter. The latter is particularly important, since it means we can squeeze far more power into the same space as existing smartphones, without having to make them any thicker. Add to this its superior thermal performance, and graphene batteries will operate noticeably cooler, increasing their longevity and safety.",
    "The problem, of course, is the fact that we’ve heard about graphene’s miraculous properties for years now, but are yet to see it break through into any mainstream applications. This is because manufacturing costs are ludicrously high for the yields given, although we’re optimistically hoping that this will continue to improve as time goes on.",
    "For now, we’re simply grateful for the fact that the current offering of modern smartphones will last us a day and charge in less than an hour. Will we look back on this sentence in a few years’ time and laugh at our naivety? We certainly hope so."
  ],
  "headers": {
    "4": "Brute force",
    "7": "Improved shelf life",
    "9": "Going on and on and on",
    "13": "Supercapacitors",
    "16": "Graphene: the holy grail"
  },
  "links": {
    "smartphone battery": "https://www.techradar.com/how-to/how-to-show-battery-percentage-on-your-iphone",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Japan Advanced Institute of Science and Technology": "https://www.jaist.ac.jp/english/whatsnew/press/2021/03/08-1.html",
    "Monash University": "https://www.monash.edu/news/articles/supercharging-tomorrow-australia-first-to-test-new-lithium-batteries",
    "Prieto Battery": "https://www.prietobattery.com/how-it-works-2/foam/"
  }
}