{
  "source": "https://www.techradar.com/news/new-macs-could-use-apples-smallest-chips-yet",
  "title": "New Macs could use Apple’s smallest chips yet",
  "category": "computing",
  "updated": "2021-03-30T10:15:31Z",
  "author": "hamish-hector",
  "summary": "Bigger doesn’t mean better",
  "article": [
    "Apple could be gearing up for an upcoming iMac launch, as it has reportedly put in an order for a new design of processor with its supplier TSMC. The 4nm chips will supposedly provide a performance boost to Apple’s “new-generation Macs.”",
    "This is according to sources who spoke to DigiTimes, who also claimed that Apple had asked TSMC to start manufacturing an A15 chip for next-generation iPhones. While not much is known about how either chip would perform, the rumor gives us more reason to believe a jam-packed Apple event is coming in April.",
    "As with all rumors, we have to take the information with a pinch of salt, but with Apple discontinuing many of its iMac models, it makes sense for it to want to replace them with the next iteration. However, we may have to wait a while, as TSMC's 4nm chips likely won’t begin production until the end of this year.",
    "It’s all well and good that new Apple iMacs could be getting 4nm chips from TSMC, but what does that mean for how well a computer will run?",
    "CPUs, the computer’s processing unit, are built using multiple transistors. More transistors often equates to more processing power because the CPU can handle more processes at once. As you add more transistors, though, your CPU gets larger. By producing smaller transistors you can fit more of them into the same space and make a more powerful CPU.",
    "When it comes to the 4nm size, this isn’t talking about the whole chip’s size - often it refers to the size of the smallest element in the transistor - it would be smaller than the 5nm chip currently in use in Apple’s M1 CPU.",
    "This could mean that Apple’s next iMacs could use powerful new hardware, though we’ll have to wait until we get our hands on them to find out how good they really are."
  ],
  "headers": {
    "3": "What is a 4nm chip?"
  },
  "links": {
    "iMac": "https://www.techradar.com/reviews/apple-imac-27-inch-2020",
    "DigiTimes": "https://www.digitimes.com/news/a20210330PD200.html",
    "Apple event is coming in April": "https://www.techradar.com/news/next-apple-event-might-be-in-april-not-march"
  }
}