{
  "source": "https://www.techradar.com/news/chrome-could-soon-run-better-on-windows",
  "title": "Chrome could soon run a lot better on Windows",
  "category": "computing",
  "updated": "2021-01-15T11:00:09Z",
  "author": "barclay-ballard",
  "summary": "Chromium-based browsers should run smoother following update",
  "article": [
    "Microsoft has an update in store for Chromium-based browsers that should make both Edge and Chrome run a little smoother for users. The fix should help improve jerky scrolling, as well as further reduce RAM usage.",
    "By adding support for EdgeHTML-style scroll animations called ‘impulse’ to Chrome, Microsoft hopes that scrolling should feel smoother. The animation works by attempting to mimic the real world by moving content quickly then slowing it down. The quick ramp-up at the start should make scrolling feel more responsive.",
    "Microsoft first introduced impulse scrolling to it’s the UWP version of its own Edge browser a while ago and has since been working on making it available to Chrome users.",
    "Although impulse scrolling is not hugely different from the existing scrolling animations used by Chrome, users should notice subtle improvements. Also, Microsoft added that scrolling on long pages or documents should not be affected.",
    "Microsoft has been one of the biggest contributors to the Chromium project since the Redmond-based firm confirmed that it would give up on developing its own EdgeHTML rendering engine more than two years ago. In that time, the tech giant has developed improvements to browser accessibility, battery usage, media playback, privacy, and now scrolling",
    "Chromium is an open-source software project launched by Google in 2008 to provide the source code for web browsers. Initially, this just included Google’s own Chrome browser, but Microsoft Edge became Chromium-based in January of last year. Based on the company’s impressive efforts so far, expect to see more browser contributions from Microsoft in the future.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Scroll with the punches"
  },
  "links": {
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Windows Latest": "https://www.windowslatest.com/2021/01/13/chrome-could-soon-run-better-on-windows-thanks-to-microsoft/"
  }
}