{
  "source": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
  "title": "Sex Education season 3: trailer, release date, cast and everything we know",
  "category": "entertainment",
  "updated": "2021-09-07T13:53:58Z",
  "author": "james-wood",
  "summary": "The Sex Education season 3 release date is confirmed for September 2021",
  "article": [
    "Sex Education season 3 will release on Netflix on September 17, 2021 – now the show has a new trailer, heralding its return. This school-based British sitcom is one of our best Netflix shows yet, and fans have endured a long wait for this one.",
    "Sex Education's cast is one of the reasons the show has taken off like it has. Season 1 kicked off with a great, funny hook: Otis (Asa Butterfield), the child of sex therapist Jean (Gillian Anderson), opened a sex-therapy clinic in his school with Maeve (Emma Mackey) – with numerous entertaining results. Across two seasons of episodes, Sex Education tackled sensitive issues delicately, demonstrating its seriously layered approach to characterization, and avoiding falling into the trappings of bawdy teen sex comedies.",
    "Netflix confirmed Sex Education season 3 was on the way back in February 2020 – but unfortunately, that's when the pandemic held up the series' return. Back in September 2020, however, the cast and crew isolated so they could film the show, with one crew member stating that the series had wrapped filming by March 2021. Now, it's almost over.",
    "On this page, you'll find everything we know about Sex Education season 3 so far, including its cast, the show's official release date and the brand new trailer.",
    "Netflix has officially confirmed that Sex Education season 3's release date is 17 September, 2021 – close to two years since season 2 dropped on the service. Here are the first images Netflix has released for the show's return:",
    "And here were the first teaser images released from the set, back from late 2020.",
    "A new trailer has been released for Sex Education season 3 as its release creeps up on us. Among the highlights: Jemima Kirke's new, seemingly more conservative headteacher, Otis getting lucky and Eric's developing relationship with Adam. Even though it was filmed mid-pandemic, it looks like the same old show to us.",
    "While a full cast list for season three is yet to be confirmed, Netflix announced some exciting new names to the Sex Education season 3 cast in September. Jason Isaac's Peter Groff should prove an excellent foil to his headteacher brother, with recording artist Dua Saleh as a returning student who clashes with the new headmistress, Hope, played by Jemima Kirke (Girls, Tiny Furniture) as previously mentioned.",
    "Series headliners Asa Butterfield (Otis Milburn) and Gillian Anderson (Dr Jean Milburn) return this season, along with a sizeable chunk of the supporting cast including Emma Mackey (Maeve Wiley), Ncuti Gatwa (Eric Effiong), Connor Swindells (Adam Groff) and Patricia Allison (Ola Nyman).",
    "Series creator and writer Laurie Nunn was already hard at work on the script for a third season well before Netflix renewed the show.",
    "In an interview with LADbible, Nunn touches on the tight working schedule for the series, noting that the writing process of another season before confirmed renewal is a normal part of how TV production works. When asked about the potential for future stories, Nunn said, \"I love writing these characters. It's such a big ensemble and I think the theme of the show – in terms of it being about sex and relationships – it really just offers up endless story opportunities.\"",
    "Sex Education season 2 pivoted away from its focus on Otis and instead opted to lend almost equal time to the wonderfully diverse characters around him. The internet’s newest queer icon Eric (Gatwa) benefited the most from this shift in show structure, allowing for a nuanced and moving insight into the struggles of a young Black queer man. His popularity clearly hasn’t gone without notice, as the teaser video for the third season is largely focused on the potential of his blooming romance with his former bully Adam.",
    "While remaining tight-lipped on the Sex Education season 3 story, Butterfield said to Digital Spy that he's \"really happy\" with the first episode and that \"it didn't go where I anticipated it to. He added: \"A few things have changed. I'm excited.\" We're also firmly with him when he says \"I want more of Otis and Maeve.\" The will-they-won't-they relationship was frustratingly left Otis leaving a drunk love message on Maeve's answerphone, just as she seems to be falling for neighbour, Isaac.",
    "Eric isn’t the only student with love on the brain, of course. The timeless 'will they, won’t they?' dance between Otis and Maeve (Mackey) seems set to come to a head. The somewhat divisive final scenes of season two saw Otis confess his love to Maeve in a voicemail, only for it to be deleted by Maeve’s new love interest before she could hear it.",
    "While some fans have been critical of this story beat as an artificial extension of the character’s ongoing love dilemma, the show’s director shrugs off any potential backlash. In a chat with BT, Ben Taylor says \"I think shoes will be thrown at screens. In a good way. I love being p***ed off at stuff. You think you want it, but you don't”.",
    "There are plenty more threads featuring the supporting cast that need to be picked up in Sex Education season 3. Jean ends season two with a newfound appreciation for emotional intimacy with her on-again, off-again partner Jakob thanks to her friendship with Adam’s freshly divorced mother Maureen. Elsewhere, various students are now grappling with revelations about their identity and place in the world as they face the realities of sexual assault trauma, non-conventional identities and the looming prospects of the future.",
    "Speaking to The Hollywood Reporter about further developments for the show, Nunn is excited about the places she and her writers can take the eclectic cast. “These characters ... they've got legs. I think I could do some more with them if we're given the chance,” she said. “[Netflix] is very supportive and really wanting us to tell the stories that we feel passionate about. It really feels like we're all on the same page, wanting to make the same show.”",
    "It’s an exciting prospect for a show primarily made by young, diverse talent both in front of and behind the camera. It’s not hard to see why Sex Education has resonated so deeply with fans. It offers a very human, non-judgemental look at the issues facing not just teenagers, but many adults who are still coming to terms with their own sexuality. Nunn’s writing is razor-sharp, and the show’s inclusive agenda makes it a fine addition to Netflix’s growing library of progressive media and stories.",
    "Bring on season 3."
  ],
  "headers": {
    "4": "Sex Education season 3 release date: September 2021",
    "6": "Sex Education season 3 trailer",
    "7": "Sex Education season 3 cast: who we expect to return",
    "9": "Sex Education season 3 story: what we expect from the next set of episodes",
    "16": "Sex Education is one of Netflix's best shows"
  },
  "links": {
    "best Netflix shows": "https://www.techradar.com/best/best-netflix-shows",
    "LADbible": "https://www.ladbible.com/entertainment/tv-and-film-sex-education-creator-has-already-started-writing-season-three-20200113",
    "Digital Spy": "https://www.digitalspy.com/tv/a33000572/asa-butterfield-sex-education/",
    "BT": "https://www.awin1.com/awclick.php?awinmid=3041&awinaffid=103504&clickref=trd-us-5728125685703432000&p=https%3A%2F%2Fwww.bt.com%2Ftv%2Fcomedy%2Fsex-education-ending-season-two-explained-alternative%2F",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/live-feed/sex-education-season-2-finale-explained-laurie-nunn-interview-1270658"
  }
}