{
  "source": "https://www.techradar.com/news/huaweis-new-wireless-earbuds-are-cheap-airpods-pro-rivals",
  "title": "Huawei's new wireless earbuds are cheap AirPods Pro rivals",
  "category": "audio-visual",
  "updated": "2021-03-11T10:08:22Z",
  "author": "olivia-tambini",
  "summary": "The Freebuds 4i come with active noise cancellation",
  "article": [
    "Huawei may be best known for its smartphones, but the Chinese tech company is quickly making a name for itself in the world of wireless headphones and earbuds, often offering cheaper alternatives to the best headphones on the market.",
    "Now the company has announced its latest true wireless earbuds, the Huawei FreeBuds 4i. Coming with active noise cancellation, these in-ear headphones could prove to be a cheaper rival for the likes of the Apple AirPods Pro and the Sony WF-1000XM3.",
    "Having launched in China already, the Huawei FreeBuds 4i will be available to buy in the UK from March 26 for just £80. Additionally, customers who pre-order from the Huawei Store between March 12 and March 25 will get £5 off, and Huawei Band 4 as a free gift.",
    "That works out at around $110 / AU$150, though global availability and pricing is still to be confirmed. Unfortunately, they're unlikely to come to the US, having been banned from doing business with US organizations in 2019.",
    "The Huawei FreeBuds 4i look very similar to the AirPods Pro with protruding ear stems and silicone tips, though they come in black and red finishes, as well as white.",
    "Like their predecessors, the Huawei FreeBuds Pro, the FreeBuds 4i come with active noise cancellation and an 'Awareness Mode', which allows environmental sound to pass through the buds when you hold down their touch-sensitive housings.",
    "The battery life comes in at seven-and-a-half hours from the earbuds themselves, rising to 10 hours with ANC switched off, which is far longer than the AirPods Pro can manage.",
    "The charging case is less impressive, increasing the max battery life to 22 hours – that means it can only offer 14.5 hours of playback at best. That's far lower than most wireless earbuds on the market, though we're hesitant to be too critical of earbuds at this low price.",
    "Inside the earbuds are 10mm dynamic drivers, which Huawei says will delver a \"powerful\" bass performance, with the overall soundstage tuned to \"fit the frequency of pop music\".",
    "When we tested the FreeBuds Pro, we found that the sound quality was very much dependent on whether noise cancellation was switched on or off. When off, we found it to be relatively neutral, but switched on, the FreeBuds Pro leant towards a more bass-heavy sounding profile.",
    "Ass they're cheaper than the FreeBuds Pro, we're not expecting a significant improvement in audio quality with the FreeBuds 4i – however, even if Huawei simply matches the performance of their previous buds, its latest wireless earbuds will represent exceptional value for money.",
    "While we've tested a few budget wireless earbuds that offer a good audio performance at this price, very few have managed to offer noise cancellation as well – and if Huawei can deliver on its promises, the FreeBuds 4i could become the best cheap AirPods-alternatives on the market today.",
    "Via What Hi-Fi?"
  ],
  "headers": {
    "4": "Impressive specs"
  },
  "links": {
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Huawei Band 4": "https://www.techradar.com/news/huawei-band-4-unveiled-but-havent-we-seen-this-before",
    "budget wireless earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds",
    "AirPods-alternatives": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "What Hi-Fi?": "https://www.whathifi.com/news/huawei-freebuds-4i-deliver-noise-cancelling-on-an-pound80-budget"
  }
}