{
  "source": "https://www.techradar.com/news/new-leak-hints-s21-ultra-could-pack-an-s-pen-in-an-unusual-spot",
  "title": "New leak hints S21 Ultra could pack an S Pen in an unusual spot",
  "category": "phones",
  "updated": "2021-01-05T00:08:29Z",
  "author": "david-lumb",
  "summary": "A folio case with an S Pen slot makes a stylus-supporting S21 Ultra work",
  "article": [
    "Recent rumors have suggested the Samsung Galaxy S21 Ultra will support the S Pen stylus, but without the slot found in Samsung’s Note series of phones where it’s typically housed. Thanks to a new leak, we know where it could be stored: in an external folio case fitted around the S21 Ultra.",
    "Housing the S Pen in a case isn’t the most elegant solution, but it keeps the stylus handy without needing to drastically redesign the S21 Ultra – after which it would, well, look like a Note phone. The cases, shown in photos acquired by tech site WinFuture and tweeted by Roland Quandt, look like standard phone folio cases, though it looks like the S Pen will clip in on the left side of the S21 Ultra, with the folio wrapping around it:",
    "It’s a little tough to see, and we’re relying on WinFuture’s interpretation of the images and corresponding insight. The S Pen does indeed look more like the stylus that came with the Galaxy Tab S7, lacking the clicking top button of the stylus on the Samsung Note 20 series, though you’ll allegedly still be able to tap the back end as a button, say, to pause or play media. And yes, gesture controls will supposedly return.",
    "The leak suggests the S Pen will be sold separately at a cost (allegedly under €40) in line with the Note 20's stylus ($39 / £34 / around AU$50) or included with said case, which may be called the S View Flip Cover.",
    "Early rumors suggested that the S21 would support the S Pen, but renders and images didn’t show a slot in the device to house the stylus (as in the Note 20), casting doubt on the possibility that the new phones would support the accessory. Further leaks suggested that only the S21 Ultra would be compatible with the S Pen, but again, there didn’t seem to be design changes from last year’s Samsung Galaxy S20 Ultra to accommodate a stylus.",
    "The new leaked images of the cases account for the S Pen’s absence: like with the Samsung Galaxy Tab S6 and Tab S7 tablets, the stylus could just be slid into the case for easy transport. Not as elegant as the Note series, but a serviceable solution, especially for the kinds of power users who can afford an S21 Ultra’s likely very high pricetag.",
    "Still, it’s not totally clear why the S21 and S21 Plus couldn’t also be compatible with the S Pen, though there was apparently enough of a hardware difference that the Note 20’s 26ms stylus latency isn’t as advanced as the Note 20 Ultra’s 9ms. Perhaps it wasn’t economical to fold stylus-connecting display and internal tech into the lower-tier S21 phones...though it’s also quite a feather in the S21 Ultra’s cap to justify its surely higher price.",
    "Via GSM Arena"
  ],
  "headers": {
    "4": "S21 Ultra: the case for an S Pen"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "WinFuture": "https://winfuture.de/news,120358.html#",
    "Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Samsung Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "renders": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-image-leak-shows-a-monstrous-camera",
    "leaks": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-may-support-the-s-pen-but-not-in-the-way-youd-expect",
    "suggested": "https://www.techradar.com/news/samsung-galaxy-s21-and-fold-3-may-support-s-pen-while-the-note-might-be-dead",
    "Samsung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Samsung Galaxy Tab S6": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-review",
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "GSM Arena": "https://www.gsmarena.com/new_leak_shows_galaxy_s21_ultra_case_designed_specifically_for_the_s_pen-news-47008.php"
  }
}