{
  "source": "https://www.techradar.com/news/sophisticated-stylish-modern-this-portable-space-heater-puts-the-competition-to-shame",
  "title": "Sophisticated. Stylish. Modern. This portable space heater puts the competition to shame",
  "category": "news",
  "updated": "2021-11-22T20:39:29Z",
  "author": "sponsored",
  "summary": "This small space heater is the perfect way to keep your home office warm, safe, and comfortable this winter",
  "article": [
    "Winter has arrived again, so it's time for hot chocolate by the fireplace. Time for snow days, quiet nights, and holiday cheer. Time to hope you can find a space heater that's actually capable of keeping you warm while you work from home.",
    "That's where Dreo comes in. It’s released a small form space heater that's perfect for your home office. It's powerful, compact, and stylish. But most importantly, it's safe.",
    "As you may know, space heaters are one of the leading causes of fires in the United States. Dreo built its new space heater with that fact in mind. The unit is absolutely brimming with design features to keep you safe — but more on that in a moment.",
    "Equipped with a brushless DC motor and 9 blades, the 1500W PTC ceramic heater can oscillate up to 70degrees. This allows it to heat a much larger area than a typical static space heater while also providing more even heating. And it does all this while being whisper-quiet, so you'll be able to attend your Zoom meetings in peace.",
    "Dreo's space heater is easy to configure, as well. It has three separate heating modes, and can also be run as a regular fan in the event that you don't need heat. The digital display makes it easy to check the status (and temperature) of the unit at a glance.",
    "And if you'd rather just turn the unit on and let it do its thing? Just turn on ECO mode, and the unit will adjust its working power to the ambient temperature, helping prevent wasted electricity. The space heater also has a built-in, 12-hour timer. In other words, you can have it run automatically during your workday, and switch off when you're no longer in the office.",
    "Dreo's unit doesn't just heat your surroundings, though. It also improves air quality, with a built-in detachable/washable dust filter that captures hair, pet dander, and dust. And all this is packed into a unit that looks downright exquisite, with a curved honeycomb grille and a sleek, compact frame.",
    "We've saved arguably the most important part for last. Traditionally, one of the biggest drawbacks of space heaters is safety. You can pack all the bells and whistles in the world into a device — if it's unsafe, none of those features matter.",
    "In that regard, Dreo has gone above and beyond.",
    "First, its space heater is equipped with automatic overheat protection. If at any point the unit's internal temperature exceeds 50℃ (122℉), it will automatically shut down and sound an alarm. The materials from which it's built also have the highest UL 94 flame retardancy rating possible — V0, meaning they've undergone tens of thousands of tests, all in the interest of keeping you surrounded by warmth, worry-free.",
    "Dreo has also gone out of its way to shield the unit's internals against heat as well. Its glass fiber printed circuit board is exceptionally durable, resistant to temperatures up to 200℃ (392℉). In other words, no more worrying about your space heater frying itself when it overheats.",
    "As far as power surges are concerned, Dreo has built the plug for its unit with flameproof materials and added a security bracket to prevent the prongs from bending — in other words, no more worrying about an overheated plug or outlet.",
    "Finally, instead of using a conventional mechanical tip-over switch, Dreo has a built-in gyroscope that's capable of 360-degree detection. The moment the unit tilts more than 45 degrees, it will immediately shut down and sound an alarm. So whether you have inquisitive pets or kids, there's less chance of them causing a fire (or injuring themselves).",
    "If you’re after a space heater that offers safety, comfort, warmth, and style, look no further. This winter, pick up the Dreo Space Heater and embrace the best in sophisticated modern living. Take the first step on the journey towards a better life."
  ],
  "headers": {},
  "links": {
    "one of the leading causes of fires in the United States": "https://jsheld.com/insights/articles/common-causes-of-electric-space-heater-fires-methods-of-prevention",
    "Take the first step on the journey towards a better life": "https://www.amazon.com/dp/B097RG67QB?maas=maas_adg_4F481965CE3A396D2C7129253FFF3026_afap_abs&ref_=aa_maas"
  }
}