{
  "source": "https://www.techradar.com/news/iphone-12-colors-new-shades-for-the-iphone-12-12-mini-12-pro-and-12-pro-max",
  "title": "iPhone 12 colors: every shade explained including iPhone 12 mini, 12 Pro and 12 Pro Max",
  "category": "phones",
  "updated": "2021-12-02T11:05:40Z",
  "author": "tom-bedford",
  "summary": "Plenty of shades to choose between",
  "article": [
    "Apple's newest iPhone 12 phones come in plenty of different colors, so people who have a favorite shade can take their pick from a huge range.",
    "There are actually four models of iPhone 12: the main one, the iPhone 12 mini, the iPhone 12 Pro and the iPhone 12 Pro Max. The first two of those come in the same colors as each other, while the latter two come in a different selection but also the same as each other.",
    "We'll run you through all the different shades of all four phones below so you can save yourself the trip to your local Apple store to see them all.",
    "The iPhone 12, which starts at $799 / $799 / AU$1,349, and the iPhone 12 mini, starting at $699 / £699 / AU$1,199, come in six different colors: white, black, green, red, blue and purple. The first four of those were also iPhone 11 colors, but purple and yellow have been dropped for the blue. Purple was added later, in April 2021.",
    "The iPhone 12 and iPhone 12 mini come in a white shade - it's not a color you'd want for a car, or clothes you'd wear somewhere muddy, but it makes the iPhone look chic and clean. It's q-white a nice look.",
    "You can also get the iPhone 12 and iPhone 12 mini in this generalist black hue – sure, it's not exactly an 'Apple-unique' color, but if you're going to throw the device in a personalized case anyway, it doesn't really matter.",
    "You can pick up the iPhone 12 and iPhone 12 mini in this pale green pastel hue, which we'd say is a little more understated than the green option on some phones. It's still pretty funky though.",
    "The iPhone 12 and 12 mini come in this 'classic Apple' red shade, or as Apple calls it, {PRODUCT}RED. Maybe it's us, but it seems a little paler than we saw it on the iPhone XR – either way, it's arguably the most vibrant of the available colors. If you buy this version some of the money goes towards a global fund to combat Covid-19.",
    "One new color on the block for Apple's iPhone 12 and iPhone 12 mini is this blue shade, so if you don't want people to confuse your new phone for an iPhone 11, it's a good one to pick. If you like this shade of dark blue in general it's one for you too.",
    "This fresh purple hue was launched at Apple's Spring Loaded event in April 2021, and it certainly has a spring feel to it: warmer weather, longer days, and so on. If you want to stand out from the crowd but don't want anything too vibrant or too garish, then we think the new purple color is a good choice.",
    "The two iPhone 12 Pro devices come in some more subdued shades than the non-Pro models - the iPhone 11 Pro handsets were like this too.",
    "The iPhone 12 Pro, which starts at $999 / £999 / AU$1,699, and the iPhone 12 Pro Max, starting at $1,099 / £1,099 / AU$1,849, come in silver, graphite, gold and blue (but not the same blue as the iPhone 12).",
    "The iPhone 12 Pro and Pro Max come in this silver shade - if you've owned an Apple product from an iPod Classic to a recent iPad Pro you'll probably recognize this color, and it's arguably the most iconic shade you can get a product from the company in.",
    "If you want your iPhone 12 Pro or Pro Max to match your iPad Pro, you can pick up the graphite option - it's definitely understated, subtle, even dull, but some people like that for their smartphones.",
    "Use your iPhone 12 Pro or iPhone 12 Pro Max to show off your untouchable level of class by picking up the gold model - it's pretty pale, so it's not blindingly stately, but it's still quite showy.",
    "The final iPhone 12 Pro and Pro Max color is blue, or Pacific Blue as Apple is calling it (perhaps to distinguish it from the slightly-different blue of the iPhone 12 and 12 mini). This is a greenish-blue hue, rather like an ocean, for example the Pacific ocean."
  ],
  "headers": {
    "4": "iPhone 12 / 12 mini in white",
    "5": "iPhone 12 / 12 mini in black",
    "6": "iPhone 12 / 12 mini in green",
    "7": "iPhone 12 / 12 mini in red",
    "8": "iPhone 12 / 12 mini in blue",
    "9": "iPhone 12 / 12 mini in purple",
    "12": "iPhone 12 Pro / Pro Max in silver",
    "13": "iPhone 12 Pro / Pro Max in graphite",
    "14": "iPhone 12 Pro / Pro Max in gold",
    "15": "iPhone 12 Pro / Pro Max in Pacific blue"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "in April 2021": "https://www.techradar.com/news/apples-iphone-12-just-got-a-new-color-option",
    "personalized case": "https://www.techradar.com/best/best-iphone-12-mini-cases",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "at Apple's Spring Loaded event": "https://www.techradar.com/news/apples-iphone-12-just-got-a-new-color-option",
    "iPhone 11 Pro": "https://www.techradar.com/reviews/iphone-11-pro-review"
  }
}