{
  "source": "https://www.techradar.com/news/swiss-post-makes-encrypted-cloud-services-push-with-tresorit-deal",
  "title": "Swiss Post makes encrypted cloud services push with Tresorit deal",
  "category": "computing",
  "updated": "2021-07-09T15:37:20Z",
  "author": "abigail-opiah",
  "summary": "Digital privacy and security are top priority",
  "article": [
    "Swiss Post has acquired a majority stake of European end-to-end-encrypted cloud services provider Tresorit.",
    "Financial details of the acquisition were not disclosed, but Tresorit says it plans to improve on digital privacy and security once the acquisition is finalized, with the collaboration set to strengthen both companies and open new opportunities for their customers.",
    "Founded ten years ago, Tresorit says it plans to further expand its presence in Germany, Austria and Switzerland following the deal.",
    "\"We also continue to serve our global regions of EU countries, the UK and the US,\" Tresorit said in a blog post. \"Operating under Swiss data protection legislation since the early days, our state-of-the art technology will contribute to expanding Swiss Post’s existing digital product portfolio.\"",
    "\"As part of Swiss Post, we’re excited to continue to develop privacy-focused, end-to-end encrypted productivity and workspace tools that enable individuals and businesses to work easily and securely knowing that their valuable data is safe from any third-party access.\"",
    "Tresorit assured its customers nothing would change moving forward, with all services offered by the company will continue as usual. The company plans to maintain its current management team including its founders and shareholders, as Tresorit will be an independent entity within the Swiss Post group.",
    "Swiss Post is active in 25 countries, employs more than 54,000 people worldwide and generated a turnover of over $7.6 billion in 2020.",
    "Via TechCrunch"
  ],
  "headers": {
    "3": "Encrypted cloud"
  },
  "links": {
    "cloud services": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5126022024995067000&xs=1&url=https%3A%2F%2Ftresorit.com%2Fblog%2Ftresorits-majority-of-stakes-acquired-by-swiss-post%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fswiss-post-makes-encrypted-cloud-services-push-with-tresorit-deal",
    "TechCrunch": "https://techcrunch.com/2021/07/08/swiss-post-acquires-e2e-encrypted-cloud-services-provider-tresorit/amp/"
  }
}