{
  "source": "https://www.techradar.com/news/windows-11-the-blue-screen-of-death-is-making-a-triumphant-return",
  "title": "Windows 11: The blue screen of death is making a triumphant return",
  "category": "computing",
  "updated": "2021-11-15T21:30:42Z",
  "author": "anthony-spadafora",
  "summary": "Black screen of death we hardly knew you",
  "article": [
    "Microsoft has reversed course regarding its decision to change the color of its notorious error screen from blue to black in Windows 11.",
    "The blue screen of death error screen has been an unwelcome sight for users of the software giant's operating system since it was first introduced in Windows 3.0 all the way back in 1990. This error screen only appears on your PC when it has encountered a serious problem and needs to restart which is why Windows users dread seeing it so much.",
    "While Microsoft has changed the blue screen of death over the years to include additional information on errors to help its users troubleshoot problems, the color of the error screen has always remained blue from Windows 3.0 up until Windows 10.",
    "However, back in July, it appeared as if the company would change the color of the iconic error screen from blue to black with the release of Windows 11. Perhaps Microsoft wanted to do this to make Windows 11 stand out from its predecessors and give the new version of its operating system a distinctive style.",
    "Although Microsoft never provided a proper explanation regarding its decision to change the blue screen of death to black, it now appears as if the company has changed its mind.",
    "As reported by ZDNet and first spotted by Ars Technica, the software giant is rolling back its color change in a new Windows 11 preview released to its Beta and Release Preview Channels.",
    "At the bottom of a blog post detailing all of the improvements in Windows 11 preview Build 22000.346, there is a bullet point which reads: We changed the screen color to blue when a device stops working or a stop error occurs as in previous versions of Windows”.",
    "While you'll hopefully never have to encounter this dreaded error screen yourself, at least now when you do, you'll know exactly what you're in for thanks to the color change back to blue.",
    "Looking to upgrade for Windows 11? Check out our roundup of the best business computers as well as our lists of the best business laptops, best workstations and best mobile workstations",
    "Via ZDNet"
  ],
  "headers": {
    "4": "From black back to blue"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "blue screen of death": "https://www.techradar.com/news/windows-10-gets-emergency-fix-for-blue-screen-of-death-crashes",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "blue to black": "https://www.techradar.com/news/windows-11-kills-off-the-blue-screen-of-death-for-the-black-screen-of-death",
    "distinctive style": "https://www.techradar.com/news/windows-11-could-freshen-up-the-most-tired-bits-of-windows-10s-interface",
    "reported": "https://www.zdnet.com/article/windows-11-is-bringing-back-the-classic-blue-screen-of-death-for-when-your-pc-stops-working/#ftag=RSSbaffb68",
    "first spotted": "https://arstechnica.com/gadgets/2021/11/next-windows-11-update-makes-the-blue-screen-of-death-blue-again/",
    "blog post": "https://blogs.windows.com/windows-insider/2021/11/12/releasing-windows-11-build-22000-346-to-beta-and-release-preview-channels/",
    "best business computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "best business laptops": "https://www.techradar.com/news/best-business-laptops",
    "best workstations": "https://www.techradar.com/best/best-workstations",
    "best mobile workstations": "https://www.techradar.com/news/best-mobile-workstations",
    "ZDNet": "https://www.zdnet.com/article/windows-11-is-bringing-back-the-classic-blue-screen-of-death-for-when-your-pc-stops-working/#ftag=RSSbaffb68"
  }
}