{
  "source": "https://www.techradar.com/news/i-dont-need-a-4k-nintendo-switch-but-i-do-want-a-better-handheld",
  "title": "I don’t need a 4K Nintendo Switch, but I do want a better handheld",
  "category": "gaming",
  "updated": "2021-03-13T16:00:15Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Will we get a premium Nintendo Switch experience in handheld?",
  "article": [
    "There’s a new Nintendo Switch on the way. Probably. Rumors are currently abounding over an upcoming refresh of the Switch console, and whether it’s called the Switch Pro or Nintendo Switch 2 it seems certain that the four-year-old console is due an upgrade.",
    "The question is, then, what improvements Nintendo actually has in mind for a new Switch, and whether it aligns with player needs.",
    "The Nintendo Switch is still selling incredibly well, and there’s no immediate need for Nintendo to push out improved hardware – especially since a drastically different gaming machine could end up splitting its audience as well as walling off the latest and greatest games on the eShop.",
    "But one of the most persistent rumors about this new Switch is 4K capability. While this would be a step up from the Full HD output currently achieved in docked mode, I just hope Nintendo doesn’t chase an easy buzzword in place of meaningful upgrades to the current hardware, especially in how it plays in handheld.",
    "4K gaming has been slow to take off, even if the Xbox Series X and PS5 offer native 4K output (rather than jazzing up HD games with a 4K algorithm, as you’ll find on the Xbox Series S or PS4 Pro). A more powerful processor in the Switch that could upscale games to 4K in docked mode should bring improvements across the board, of course.",
    "But as someone who mainly plays handheld, I’m worried that the design flaws of the console will be overlooked in yet another Switch iteration for the sake of meeting a 4K benchmark that won’t affect huge swathes of the Switch’s game library.",
    "We’ve already had a Nintendo Switch 2.0, of course – the Switch Lite, which was released in 2019.",
    "For all the pleasures of the compact, handheld-only model, it does sacrifice some of the bulk of the original model, making do with a 5.5-inch screen rather than the 6.2 inches enjoyed by the mainline Switch.",
    "For a low-cost Switch experience, it’s worth the trade off – but it means that the Lite doesn’t offer the best handheld experience that it could.",
    "That’s what I look towards the Switch Pro, or Nintendo Switch 2 for: a way to play Switch games portably while still feeling like I’m playing a modern, if not next-gen console. A Switch that feels premium, but not by trying to compete with the PS5 or Xbox Series X as a home console.",
    "And if the Lite was all about reduction (in price, size, and functionality), the Pro then needs to be about expansion.",
    "Rumors suggest that’s what we’re getting, to an extent, with a 7-inch OLED screen set to increase the display size as well as the overall picture quality possible in handheld mode.",
    "The 2017 Nintendo Switch does sport a rather thick bezel, meaning there are some easy gains to be had from reducing this black outline and increasing the screen real estate without upping the overall profile of the Switch console too much. We saw similar improvements on successive Nintendo DS consoles, even those that slimmed down the hardware while vastly upping the size of the screen.",
    "The screen isn’t the only thing that needs improving in the Nintendo Switch, though, and there are a host of design flaws that could be addressed in a new model.",
    "The kickstand is infamous for being unstable, and off-balance, given its flimsy nature and placement on one side rather than at the center of the casing. Something more weighty would help, or even a dedicated stand accessory thrown in if the console became too bulky for this to be feasible. Either way, Nintendo needs to provide this solution itself.",
    "In terms of audio, the headphone jack is terribly placed on the upper side of the console, meaning you have to track wires down the back of the Switch before leading them up to your head. Placement on the underside makes much more sense, if Nintendo’s engineering team makes it feasible with the console’s design.",
    "Built-in Bluetooth audio would be the real winner though, given the glut of Bluetooth headphones on the market today, and do without the need for a wireless adaptor that ruins the Switch’s silhouette.",
    "A Switch console refresh would also be the perfect opportunity to update the Joy-Cons. While they’ve proven versatile over the past four years, whether attached to the console directly or used in more free-form arrangements, they have their issues, from small buttons to ongoing drift issues.",
    "A new Joy-Con accessory offering a roomier shape, larger buttons and triggers, as well as implementing a d-pad on the left Joy-Con – all improvements found on the dedicated Switch Pro controller (pictured above).",
    "There’s no doubt that a Nintendo Switch 2 with any meaningful upgrades will cost more than the current iteration ($299 / £279 / AU$329), and likely encroach on the territory of the PS5 Digital Edition ($399 / £359 / AU$599). Still, it should cost far less than the fully-fledged Xbox Series X or PS5 next-gen consoles, even if the Xbox Series S matches the current Switch’s price tag pretty closely.",
    "I don’t expect Nintendo to meet all of my demands, and being part of such a large player base means that some of us will inevitably be disappointed with whatever the company chooses to do.",
    "I just hope the white whale of 4K resolution doesn’t draw Nintendo’s away from the fun and convenience of playing handheld, where anything like 4K is still a good while off, and other, more urgent improvements are still waiting to be made."
  ],
  "headers": {
    "6": "What a sad little Lite, Jane",
    "13": "Kick back and collapse",
    "17": "Does it spark joy?"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch 2": "https://www.techradar.com/news/nintendo-switch-2",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "4K gaming": "https://www.techradar.com/news/gaming/5-best-4k-games-the-best-looking-titles-to-play-in-4k-1296513",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "PS5 or Xbox Series X": "https://www.techradar.com/news/ps5-vs-xbox-series-x-which-next-gen-console-should-you-buy",
    "Rumors suggest that’s what we’re getting": "https://www.techradar.com/news/nintendo-switch-2-launch-news-and-features",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "Nintendo DS": "https://www.techradar.com/reviews/gaming/handheld-consoles/nintendo-ds-93912/review",
    "Bluetooth headphones": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "wireless adaptor": "https://www.techradar.com/news/best-wireless-adaptors",
    "PS5 Digital Edition": "https://www.techradar.com/news/ps5-vs-ps5-digital-edition-which-next-gen-sony-console-is-for-you",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd"
  }
}