{
  "source": "https://www.techradar.com/news/these-haptic-feedback-vr-gloves-are-changing-virtual-reality-heres-how",
  "title": "These haptic feedback VR gloves are changing virtual reality – here's how",
  "category": "gaming",
  "updated": "2021-01-18T09:28:42Z",
  "author": "matt-phillips",
  "summary": "We talk with the CEO of SenseGlove about its latest VR gloves",
  "article": [
    "Haptic feedback could be the next frontier for immersive VR experiences, and the new SenseGlove Nova VR gloves make a firm stride in that direction, bringing us closer than ever to realistic simulations and fully sensory VR.",
    "These wearable controllers offer touch-sensitive experiences you won't get with standard VR headset controllers, like the Knuckle controllers used with the Valve Index.",
    "SenseGlove tells us that you get 11 degrees of freedom \"per hand\" with the Nova's tracking system, far beyond the total six-degree freedom of the Oculus Quest 2. This lets you \"experience collisions, textures, and button clicks where they happen – on your fingertips or the palm of your hand.\"",
    "The SenseGlove Nova gloves cost a pretty penny, at around $5,000 (£3,700 / AU$6,500) a pair, and for now you'll only be seeing it used for more commercial purposes; Airbus, Honda and Volkswagen have all been making use of its previous prototype (DK1) iteration, though we're told that future models will only get smaller, cheaper, and more mainstream in the coming years.",
    "We sat down with SenseGlove's CEO and co-founder, Gijs den Butter, to talk about the importance of haptic feedback for VR, AR, and telerobotics – as well as the future of haptic feedback in the medium of virtual reality.",
    "For the full low-down on the SenseGlove Nova, watch our video at the top of this article.",
    "Haptic feedback has gained a lot of buzz in recent months, especially in the world of gaming. The PS5's new DualSense controller makes use of haptic triggers for precise tension control – something that's apparent in PS5 games like Astro's Playroom that really work to make use of the technology and prove a test case for it.",
    "The danger, of course, is that the greatest advancements in VR and gaming interfacing won't be fully utilized by developers. There's no denying the potential of haptic feedback, though, and companies like SenseGlove are certainly going all in."
  ],
  "headers": {
    "6": "Haptic feedback"
  },
  "links": {
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games"
  }
}