{
  "source": "https://www.techradar.com/news/6-big-features-coming-to-your-next-flagship-snapdragon-android-phone",
  "title": "6 big features coming to your next flagship Snapdragon Android phone",
  "category": "phones",
  "updated": "2021-12-04T08:00:07Z",
  "author": "james-peckham",
  "summary": "Inside the Samsung Galaxy S22, OnePlus 10 and more",
  "article": [
    "The Qualcomm Snapdragon 8 Gen 1 chipset is official, and if you’re looking to upgrade your top-tier Android phone next year, it’s likely you’ll find this chipset powering your new flagship device.",
    "We’ve been learning about what the new chip is capable of, and you’ll find everything you need to know about the Snapdragon 8 Gen 1 in our coverage elsewhere.",
    "Just want to know the key changes? We’ve put together this list of what may change on your next Android phone. There are six major features that you need to know about, and these will give you an idea of what you can expect in upcoming flagships like the Samsung Galaxy S22, OnePlus 10, Xiaomi 12 and more.",
    "Let’s start with arguably the biggest change. The new chipset will allow your smartphone’s camera to always be on. Don’t worry, it won’t be constantly snapping selfies - it’s designed to allow for other features rather than taking photographs.",
    "Why would that benefit you? It will allow developers to include features that are specifically designed around using your phone’s camera without you touching the device.",
    "An example Qualcomm has given is that it’ll allow you to unlock your phone without touching it. Think about how you may be cooking with ingredients all over your hands, and this will allow you to unlock your phone without getting gunk on it.",
    "Some have cited security concerns about the feature, and it may worry you, too. Qualcomm insists that it’s doing this in a safe way to ensure that no one can take your data from your phone’s cameras, but it’ll be interesting to see how people might take advantage of the feature.",
    "Aside from the always-on camera, there are lots of other upgrades that you’ll find are coming to your smartphone’s camera. An 18-bit image signal processor (ISP), improved night mode photography, better wide-angle shots, stronger facial recognition technology, 8K HDR video recording… the Snapdragon 8 Gen 1 is focused on its camera upgrade.",
    "While the always-on upgrade is the headline-grabbing feature here, there are lots of other little improvements that you may see on your next phone’s snapper that will improve the overall experience.",
    "There aren’t many game-changing features here, though. Camera phones are already fantastic, but these smaller upgrades are likely to slightly tweak the performance you get from your smartphone’s shooter rather than overhaul the whole experience.",
    "Qualcomm’s Voice Suite technology has been upgraded in 2021, and the aim here is to cut out background noise when you’re being recorded. For example, if you’re on a video call, this new technology will use artificial intelligence to try and cut out noises such as sirens or typing.",
    "We’ve seen a demo of the technology, and in Qualcomm’s examples it worked amazingly well. This was on a reference device in a demo set up by Qualcomm, so we’re most interested in seeing this on a real life device to see how it works in practice.",
    "It if works as well as the demos suggested, it could change how you’re recorded on calls and how you’re heard by your colleagues, friends and family.",
    "This isn’t going to be useful for everyone, but if you have a phenomenally good 5G connection you’ll find you can reach higher speeds than ever before.",
    "Last year’s Snapdragon 888 was restricted to 7.5Gbps, which is also fantastically quick. It’s almost impossible to reach these speeds on an average day, but it’s useful to know your 2022 flagship phone will be capable of it for the future.",
    "The bokeh effect is where you can blur the background of a subject, and it’s commonplace in portrait modes throughout the Android sphere. If you’ve wanted to get that effect in video recording, you haven’t been able to until now.",
    "A similar technology debuted on the iPhone 13 series with Apple’s Cinematic Mode feature, and now it’ll be coming to Android phones through this new chipset.",
    "We don’t yet know which manufacturers will include this feature, but it’s likely a lot of the upcoming Android phones will install this in camera apps for you to play with. It’s also capable of recording up to 4K.",
    "As to be expected, the Snapdragon 8 Gen 1 is the company’s fastest chipset so it should mean your smartphone is quicker at loading up apps, playing games and anything else you throw at it.",
    "According to Qualcomm, the CPU here is 20% faster than the Snapdragon 888 and it offers 30% power savings over that chip's results as well. The Adreno GPU is 30% faster, which should mean games load quicker and look better than ever.",
    "We won’t know how well the Snapdragon 8 Gen 1 truly performs until we see it in new smartphones (and whatever hardware manufacturers decide to pair this with) but it’s looking like a big upgrade for the biggest phones of 2022."
  ],
  "headers": {
    "3": "1. An always-on camera may bring big new features",
    "7": "2. There are many, many camera upgrades",
    "10": "3. Calls will cut out background noise",
    "13": "4. You can reach 10Gbps internet",
    "15": "5. Bokeh video is coming to Android",
    "18": "6. Naturally, it’s faster than ever"
  },
  "links": {
    "Qualcomm Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "in our coverage elsewhere": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple’s Cinematic Mode": "https://www.techradar.com/news/what-is-cinematic-mode-the-iphone-13s-new-video-focusing-trick-explained"
  }
}