{
  "source": "https://www.techradar.com/news/get-a-blue-yeti-mic-on-amazon-prime-day-if-youre-starting-a-podcast-in-2021",
  "title": "Get a Blue Yeti mic on Amazon Prime Day if you're starting a podcast in 2021",
  "category": "audio-visual",
  "updated": "2021-06-17T13:56:32Z",
  "author": "samuel-roberts",
  "summary": "It's the portal to your podcasting dreams",
  "article": [
    "During the pandemic last year, I joined many other embarrassing men in their thirties by starting my own podcast (you can find it here and it's about games, if you fancy listening to it). With a good enough internet connection and a co-host you get along with, you can make a decent podcast from home no problem – you just need the right mic to do it.",
    "The Blue Microphones Yeti has long been cited as the USB microphone to get if you're a budding streamer or a podcaster, and it's worth considering one for Amazon Prime Day 2021 if they get a discount. There are more expensive options from the likes of Shure or even the Pro version of the Blue Yeti if you've got the money, but this model is perfect because it walks the line between affordability and quality.",
    "To most people listening to your podcast, they'd find your audio crisp and professional-sounding – I paired mine with a relatively cheap isolation shield from Moukey, to help offset the echoes of my living room space, and to help drown out the sounds of annoying children who live in my estate. I've heard stories about voice actors recording in cupboards filled with towels to stop echoing effects, but the shield just about does the job for me.",
    "The Blue Yeti is intuitive to use, with four different audio pattern settings to suit your needs: Cardioid, Bidirectional, Omnidirectional and Stereo. Now, I've used one of these to record a podcast with three other people before, and it's far from ideal compared to a scenario where each of you have your own microphone – but you can do it if you want to keep costs down.",
    "The microphone features headphones output, which I've never used, and also some recording software that I'll confess I've never opened. Like many podcasters, I use the free software Audacity to record my end, and other guests do the same on theirs – this opens up your margin for error significantly over using a service like Zencastr, since you're depending on the audio syncing up with no one's hardware crashing, but it works for us.",
    "That's pretty much all I've got to say on the Blue Yeti – I simply see it as a means to an end, but I'm delighted with the quality of the audio. There are older podcasts than ours I listen to where they clearly haven't invested in the right equipment, despite the hosts clearly being affluent enough to afford it, and as a listener it can be frustrating.",
    "At $129.99 / £119.99 (around AU$180) and often available at a discount, the barrier for entry with the Blue Yeti is nice and low for what you're getting. There's also a cheaper Nano model available for $99.99 (£89.99 / AU$159) that doesn't feature stereo or bidirectional modes – I haven't tried that one personally, though.",
    "So, if you plump for a Blue Yeti, I want to pass on some other advice I have for starting a podcast. Our show hovers around the 1,500-2,500 downloads per episode mark at the moment. That's nothing compared to stalwarts like This American Life or WTF with Marc Maron, but isn't a bad start considering it's only been around for six months and comes from two people who don't have much of an internet presence compared to gaming streamers.",
    "Having a great place to host your podcast is super handy. The all-in-one solution I use is Buzzsprout, which is number one on our list of the best podcast hosts – it makes it very easy to get your podcast listed in places like Apple Podcasts and Spotify, and gives you an RSS feed that people can drop into their pod catchers of choice.",
    "I pay $24 a month to upload up to 10 hours of audio, which is easily enough if you're making a weekly or fortnightly show, and there's an option to pay for more hours if needed. There are also monetization options, including the ability to link to a Patreon account in every episode, though I'll confess I haven't experimented with those. When I've used their customer service email, I've had prompt and useful responses.",
    "Accept that audience growth will be very gradual. Having a Twitter account specifically for your podcast helps – if people can engage with your podcast, they're more likely to try and get their friends to listen to it. People are less likely to tag in the personal Twitter account of a host, but an all-in-one location for your content makes it easier to build an online identity for your show.",
    "Here's another thing: if you make a podcast with someone else, ensure they're as creatively invested in it as you are. If it's too one-sided as a venture, it's easier to miss a week, or let the whole thing fall apart. I've been part of a few podcasts like that, where I'm more into it than the other person – when it subsequently dies on the vine, it doesn't feel very good as a creator, and your listeners are likely to be disappointed too.",
    "But more than that, if you're both passionate about the podcast in question, it turns the process of making it into a truly compelling hobby – exactly the kind of distraction you might find comforting during these still-not-quite-normal times."
  ],
  "headers": {
    "3": "Any amateurs can use the Blue Yeti",
    "7": "What else you might want to know if you're starting a podcast"
  },
  "links": {
    "you can find it here": "https://open.spotify.com/show/4l6fx0Cw5GR0lz14qMmWrO?si=6EHPSOa3Qmmibmu7JzXwsA&dl_branch=1",
    "podcast": "https://www.techradar.com/news/the-best-podcast-apps-for-mac-users/news/best-podcasts",
    "Blue Microphones Yeti": "https://www.techradar.com/reviews/pc-mac/peripherals/speakers-and-headphones/microphones/blue-microphones-yeti-905163/review",
    "Amazon Prime Day 2021": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "isolation shield from Moukey": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fgp%2Fproduct%2FB084VFRBPM%2F%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-5889282655829813000-21",
    "Zencastr": "https://zencastr.com/",
    "Buzzsprout": "https://www.buzzsprout.com/",
    "best podcast hosts": "https://www.techradar.com/best/podcast-hosting",
    "Spotify": "https://www.techradar.com/reviews/spotify"
  }
}