{
  "source": "https://www.techradar.com/news/these-cheap-wireless-earbuds-offer-anc-and-a-long-battery-life-for-a-budget-friendly-price",
  "title": "These cheap wireless earbuds offer ANC and a long battery life for a budget-friendly price",
  "category": "audio-visual",
  "updated": "2021-01-22T09:49:14Z",
  "author": "olivia-tambini",
  "summary": "The EarFun Air Pro wireless earbuds are here",
  "article": [
    "Cheap wireless earbuds are getting better all the time, and the EarFun Air are among the best we've ever tested. Now, the latest model from the Chinese company has been announced, bringing premium features to the budget-friendly buds.",
    "The EarFun Air Pro come with active noise cancellation like the Apple AirPods Pro, but boast a far longer battery life, with a claimed nine hours contained within the buds themselves (dropping to seven with ANC turned on), and a further 23 hours provided by the charging case.",
    "Unlike their predecessors, there's no wireless charging support and the water-resistance rating has been reduced from IPX7 to IPX5 – still, that's enough to protect the earbuds from a little sweat or rain if you use them while working out.",
    "The EarFun Air Pro use the same Bluetooth 5 connectivity as their predecessors, which we found to be incredibly easy to pair when we tested them.",
    "While the audio quality of the original EarFun Air was already pretty good, the EarFun Air Pro should represent a step up. Instead of the 6mm composite cellulose driver found in their predecessors, the EarFun Air Pro come with 10mm composite dynamic drivers, which should provide a more powerful sound.",
    "Each earbud has also been furnished with an extra microphone – presumably to allow for active noise cancellation – while the in-ear detection feature now relies on infrared rather than capacitive sensors, using LEDs to detect when you remove them, stopping your music automatically.",
    "Those specs may suggest a high price, but the EarFun Air Pro cost a mere $80 / £70 (around AU$100). That's far cheaper than most true wireless earbuds on the market, let alone models with active noise cancellation.",
    "It can be a bit of a lottery when it comes to buying super-cheap wireless earbuds; you could uncover a real gem or land yourself with a pair or buds that barely work, let alone sound good.",
    "While we're yet to test them for ourselves, if the EarFun Air Pro are anything like their predecessors, you'll find yourself pleasantly surprised.",
    "Via What Hi-Fi?"
  ],
  "headers": {
    "3": "High spec, low price"
  },
  "links": {
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "EarFun Air": "https://www.techradar.com/news/can-cheap-wireless-earbuds-ever-sound-good-we-put-five-budget-brands-to-the-test",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "What Hi-Fi?": "https://www.whathifi.com/news/earfun-air-pro-unveiled-bringing-noise-cancelling-to-our-budget-award-winners"
  }
}