{
  "source": "https://www.techradar.com/news/eufys-new-range-fixes-the-biggest-issue-with-home-security-cameras",
  "title": "Eufy’s new range fixes the biggest issue with home security cameras",
  "category": "smart-home",
  "updated": "2021-06-02T16:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Built-in storage means no more hubs or monthly subscriptions",
  "article": [
    "The best home security cameras can offer peace of mind that your property is safe and sound when you’re not there, but they are a costly investment, especially when you factor in the monthly cost to be able to review footage captured by the camera at a later date.",
    "However, Eufy, which is the smart home brand from Anker, hopes to make this a thing of the past with its new range of weatherproof home security cameras that come with local storage built-in, eliminating the need for a hub.",
    "The SoloCam is a battery-powered weatherproof home security camera that can detect motion and record footage of the activity in either Full HD or 2K, depending upon the model. It connects directly to a home Wi-Fi network and can store up to 8GB of footage in it’s built-in storage. Eufy says this is around two months’ worth of video based on 30 detections a day, with each lasting for 10 seconds. The SoloCam also has Artificial Intelligence (AI) smarts to reduce the number of unwanted notifications, and a battery that Eufy claims will last up to four months between charges.",
    "There are five different versions of the SoloCam to choose from. The SoloCam E20, which records FullHD footage, and the SoloCam E40, which can capture video in 2K, are priced at $99.99 / £99.99 (around AU$130) and $129.99 /£119.99 (AU$170) respectively.",
    "They are available to pre-order now and will ship in mid-June in the UK, US, and Australia, although Australian pricing has yet to be confirmed.",
    "The SoloCam L20 and L40 build on this with a built-in 600-lumen motion-activated spotlight for color night vision (and to deter intruders) and a 90db siren, both of which can be manually activated from the app, will follow in mid to late July priced at $149.99 / £149.99 (AU$195) and $169.99 /£169 (AU$220).",
    "There’s also a version with a built-in solar panel that continuously powers the battery. Known as the SoloCam S40, this will ship in August and is priced at $199.99 / £199.99 (AU$260).",
    "At the same time, Eufy has also launched Floodlight Cam 2 Pro – a 360-degree pan and tilt outdoor camera that comes with three LED floodlights that offer 3,000 lumens of light in total. The LEDs can be set to turn on at sunset and off at sunrise automatically, or triggered only when motion is detected, and the color temperature can even be tweaked to represent natural light at various times of the day.",
    "The camera records color footage in 2K and also has a 100Db alarm that can be sounded from the app. The Floodlight Cam 2 Pro is priced at $299.99 / £279 (around AU$390) and will ship in August.",
    "There’s no denying the home security camera market is a crowded one, and with so much choice, it can be hard to know which cameras are better than others. One of the reasons we rate Eufy home security cameras is the local storage. Rather than using a secure area online to store the camera’s footage, many of its current cameras – including the EufyCam 2, which took the top spot in our best home security cameras list – include a base station that offers up to 16GB of local storage free of charge.",
    "However, finding room for a base station can pose a problem for some homes, especially as it needs to be connected directly to your router with an ethernet cable. We think building local storage into the camera itself is something all smart home security camera brands should consider, if not to reduce the on-going costs associated with smarty home security cameras."
  ],
  "headers": {
    "3": "Spotlights, sirens and solar panels",
    "9": "Analysis: Local storage is the way forward"
  },
  "links": {
    "best home security cameras": "https://www.techradar.com/news/best-home-security-camera"
  }
}