{
  "source": "https://www.techradar.com/news/why-1996-was-a-vintage-year-for-pc-gaming",
  "title": "Why 1996 was a vintage year for PC gaming",
  "category": "gaming",
  "updated": "2021-09-01T14:17:39Z",
  "author": "mike-shields",
  "summary": "A Quake, a Sword, a Croft",
  "article": [
    "1996 can feel like an apex for many looking back on pop culture. It was a year that is now resolutely steeped in nostalgia for those looking back. The height of Brit Pop, the drama of international football tournaments and the rise of Cool Britannia overshadowed almost everything going on in the world.",
    "Almost everything that is. PC games have come so far in the following 25 years that it can be difficult to pinpoint when the medium really took off. There’s a lot to be said for nostalgia, but even without the rose-tinted sheen, 1996 stands out as the point in which gaming reached new heights and set precedents that are still aimed for by many game developers these days.",
    "The preceding few years had given us the likes of Wolfenstein 3D and its natural successor, Doom, but 1996 truly burst at the seams with creativity, zeal and the noticeable shift towards three dimensions and a hint at realism.",
    "There are many standard-bearer titles for that year, but here are five reasons why we should hold 1996 up like a fine wine and muse about it until dawn. This list isn’t exhaustive by any means, but a highlight reel for a year that stand the test of time.",
    "Doom was a gore-filled, iconic and often-aped shooter that blew people (as well as many ungodly creatures) away on its release on the PC in 1993, but by 1996, the next step was to create a darker, more mysterious beast. The resulting experimentation was the murky brown monolith that was Quake.",
    "Equal parts disturbing creatures and a barren, almost liminal set of maps, its spewing lakes of lava and brutal weaponry took what made Doom deliciously dark and made it a murky, unforgiving experience. Squinting into the gloaming of this title was transcendental for many, with many reviewers scoring it highly for its innovative level design. Finding yourself on a platform high above where you just faced down bloodthirsty enemies moments earlier was a real trip, yes it was linear, but my was it immersive. Ditto for the AI, clunky by today’s standards, this was perhaps the first title to feature fights to the death among your demonic hosts.",
    "The more patient a player was willing to be, the more ammo they could save for their precious nail guns and other arsenal. The sprawling nature of the levels also meant brilliant multiplayer bouts and the honing of the rocket jump as a piece de resistance for the more elite player.",
    "You can see the brown shadows of Quake among the first person shooters of today. The Unreal series built upon and perfected the idea of a 3D engine, which became a legacy for decades of similar shooters.",
    "The game's lasting appeal is obvious, with a recent remastered release on Switch and other next gen platforms, a new generation can experience the horror and intrigue for themselves. The soundtrack has also been given a 2xLP release on vinyl, proof that this is one of the most enduring games of all time, let alone in 1996.",
    "While Doom had set the scene for first person atmospherics and unbridled violence, it could be argued, Duke Nukem 3D turned it on its head. Decidedly non-PC and possibly even borderline offensive by today’s standards, the gum-chewing, wise-cracking titular Duke had already had outings in two dimensions, but the level of detail and interactivity within your abilities in-game showed what could be done with a twisted mind and some imagination.",
    "Destructible environments, interactions with NPCs and a self-aware character that broke the fourth wall (as well as everything in sight), made this a memorable and somewhat thrilling experience. This wasn’t what the multifunctional family Personal Computer was made for, but it did split open what was acceptable on the platform.",
    "Cheap, stupid and subversive, it won’t win any plaudits for its subtlety, but what a memorable, fun romp this was. Returns were diminishing for the Duke in following decades, but as a fun and rip-roaring gaming release, this ticked so many boxes it was unreal.",
    "If there was ever a more copied franchise in the late 90s, it was the dominating Command & Conquer series at the time. A real-time strategy game only equalled by Age of Empires for sheer enduring fandoms from this era, it was global war on a micro scale, but felt huge too.",
    "An imagined time-traveling timeline where Hitler died before he could rise to power, the seemingly endless fight between the Soviets and the Allied Nations is played out like micro machines come to life. All of which takes place in a Dune-like world where precious Tiberium is harvested.",
    "Strategic base-building and freedom of choice plays a part, but the original gameplay also built upon the original Command & Conquer’s frenetic pace, adding more features to what was already a brilliant formula. The use of spies, along with resource management meant this was a paced, absorbing world full of intrigue and rightly took the PC market by storm.",
    "Again, 1996 throws us a game that sets out a whole genre with aplomb. Before Starcraft, League of Legends and others, it was Command and Conquer that set the standard. Endless sequels and remakes followed of course along with a remastered collection in recent times, but Red Alert still remains an apex in the strategy genre from that year.",
    "Immersive and incredibly detailed, the point-and-click adventure was still a truly popular medium in 1996. The Curse of Monkey Island series had laid down what could be done with a fantastical setting and a large dose of sarcasm, but the Broken Sword series took the genre beyond what many thought was possible.",
    "Graphically, it wasn’t going for realism, but the storytelling and detailed puzzles captured so many imaginations, the series went on to sell more than 6 million copies. Following the protagonist George Stobbart as he unravelled a plot thicker than molasses, many were enraptured by the sheer scale and ingenuity of the game, but many came back for the challenge. Its sequel Broken Sword II: The Smoking Mirror added even more depth, but without this game would we have such rich storytelling and an importance placed on interwoven gameplay and narrative.",
    "Would we have the advanced storytelling of the Mass Effect series or the heart-stopping drama of The Last of Us? It’s unlikely. Through its blocky charm, Broken Sword pushed more boundaries than many might give it credit for.",
    "What can be written about Tomb Raider that hasn’t been pored over by its legion of fans for the past quarter of a century? There wasn’t a game like it at the time and there hasn’t been a game series to eclipse its vision since.",
    "Released in October of 1996 by developers CORE Design, the team wanted to create a fully-realised 3D world that was inspired by the likes of Prince and Persia and Indiana Jones. Sprawled across four locations and 15 levels altogether, you would encounter wolves, bears, Atlantean creatures and of course, a Tyrannosaurus Rex.",
    "Pretenders to the crown came thick and fast and the series has twisted and turned through many diverse plots and iterations, but there wasn’t anything as truly ground-swelling for casual and experienced players alike. This was the point at which gaming crossed into the mainstream, the point at which gaming became a past-time rather than a passive experience for many.",
    "In controlling the protagonist Lara Croft, Tomb Raider had a huge draw for a market that thrived on the pin-up and the personality. It was the 90s, everything writ large with an counter-culture attitude after the confident swagger 80s and Tomb Raider fit the bill perfectly. The gameplay itself often plays second fiddle to the imagery and the cultural impact it made, but it shouldn’t. Sprawling and beautiful, the cavernous, often claustrophobic levels were punctuated by moments of frustration with mind-bending puzzles and frenetic combat. This was 1996 and it was all Lara’s."
  ],
  "headers": {
    "4": "Quake",
    "9": "Duke Nukem",
    "12": "Command & Conquer - Red Alert",
    "16": "Broken Sword",
    "19": "Tomb Raider"
  },
  "links": {
    "PC games": "https://www.techradar.com/news/best-pc-games"
  }
}