{
  "source": "https://www.techradar.com/news/tvos-15",
  "title": "tvOS 15: every new Apple TV feature",
  "category": "televisions",
  "updated": "2021-07-01T00:27:52Z",
  "author": "henry-st-leger",
  "summary": "Siri support, Shareplay, and not much more",
  "article": [
    "There's a new tvOS 15 in town, after Apple announced the 2021 overhaul to its Apple TV operating system at WWDC.",
    "Overhaul might be a strong word for what transpired, though. We got a glimpse at a couple of small tweaks and features coming to tvOS 15, though nothing like the radical redesign that had been hinted at by the rumor mill in the past few weeks. It was odd not to see any substantial mention of Apple TV Plus either.",
    "There's some additional support for the HomePod Mini, and new collective features that make sharing an Apple TV 4K with your family a little bit easier – but that's it. It's somehow more disappointing than last year's update, which brought in gaming-specific features like quick game resume, support for the Xbox Elite Series 2 and Xbox Adaptive Controllers, HomeKit updates, and the arrival of picture-in-picture mode for dual-feed watching.",
    "We'll run you through these changes in more detail below, but we wouldn't expect too much here, and our wishlist for tvOS 16 is looking to be pretty much the same as what we hoped for with this year's tvOS 15 iteration.",
    "Want to try it out? A tvOS 15 public beta is live right now on the Apple Beta Software Program website, which is available free for anyone with a tvOS 15-compatible device.",
    "So, what's new for tvOS 15? There are a few changes to the Apple TV interface, such as a list of multi-user viewing recommendations that show up no matter whose user profile is selected. So if you're watching with roommates or family members, you'll have a handy place to look through things you all enjoy, and not be cursed with a single person's algorithm for deciding every movie night.",
    "There's the introduction of SharePlay, an Apple-specific feature for co-watching TV streaming services with friends over FaceTime (which is getting some limited support on Android devices too). You'll be able to set it up for a host of streaming platforms over Apple TV like Hulu, Disney Plus, HBO Max, Twitch, Pluto TV, ESPN+ and Paramount Plus – though not Netflix – casting from your iPhone to Apple TV hardware while continuing to chat into your handset.",
    "Spatial Audio support is coming to both tvOS and MacOS, making audio through the AirPods Max and AirPods Pro headphones more immersive, while adding dynamic head tracking too.",
    "Anyone with a HomePod Mini will also be able to control their Apple TV through the compact smart speaker via Siri voice commands.",
    "tvOS 15 looks set to follow a similar release schedule to previous iterations of Apple's TV operating system. That means an announcement at WWDC (check), a private beta shared with developers (check), a public beta available for download (check) and a full rollout in September (it'll happen).",
    "If you want to try tvOS 15 out for yourself, you can download the public beta from Apple's website. While typically more stable than developer betas, the public beta can still be finicky, so take caution when upgrading.",
    "tvOS 15 will also launch alongside iOS 15, iPadOS 15 and watchOS 8, as Apple releases the latest updates to its fleet of smartphone, tablet, smartwatch, and streaming devices.",
    "Read more: how to install tvOS",
    "tvOS 13 focused on multi-user support for TV shows and movies, with each profile getting its own recommendations in the TV app, but now that same functionality will apply to games via Apple Arcade as well.",
    "tvOS 14 added the ability to keep track of individual achievements for every user, and quickly resume games when you come back to them. Apple also updated the software to recognize two new Microsoft controllers, the Xbox Elite Series 2 and Xbox Adaptive Controllers that were released in late 2019.",
    "Two other new additions in tvOS 14 are picture-in-picture, which allow you to keep videos running on the screen in the corner of the screen while you move in between apps, and the addition of smart home camera feeds to Home View. Both those features are on iOS 14, too.",
    "It's probably too soon to start thinking about tvOS 16 considering that tvOS 15 hasn't even arrived to the general public yet, but while we wait we though it'd be good to ponder the future of Apple's TV operating system with the hopes of getting these new features:",
    "Kids profiles and Screen Time",
    "AppleInsider has reported on possible Kids profiles for future tvOS updates, restricting mature content and enabling parents to keep tracking of screen time usage, too – and we'd certainly like to see it.",
    "Improved Apple TV Plus integration",
    "One of our main bugbears about Apple TV Plus at launch was the way it was integrated into the Apple TV app, with Plus content being littered around and mixed up with non-Apple content in a confusing manner that doesn't make it clear what's free and what's paywalled content.",
    "A software update for 2021 is the perfect opportunity to remedy this, especially now that Apple TV Plus has expanded its launch lineup, with far more shows and series on offer, from Ted Lasson season 2 to Mythic Quest season 2."
  ],
  "headers": {
    "5": "tvOS 15: what's new?",
    "9": "tvOS 15 release date and beta",
    "13": "tvOS 14: everything in last year's update",
    "16": "tvOS 16: what we want to see"
  },
  "links": {
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Apple TV 4K": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Xbox Adaptive Controllers": "https://www.techradar.com/news/yes-the-xbox-adaptive-controller-is-innovative-if-you-can-afford-the-added-expenses",
    "Apple Beta Software Program website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6611052020281233000&sharedId=trd-us&u=https%3A%2F%2Fbeta.apple.com%2Fsp%2Fbetaprogram%2F",
    "limited support on Android devices": "https://www.techradar.com/news/facetime-is-coming-to-android-but-not-how-you-expect",
    "Spatial Audio": "https://www.techradar.com/news/spatial-audio-your-complete-guide-to-immersive-speakers-headphones-and-streaming-services",
    "is coming to both tvOS and MacOS,": "https://www.techradar.com/news/tvos-and-macos-will-get-spatial-audio-support-for-airpods-pro-and-max",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Apple's website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7786228874010440000&sharedId=trd-us&u=https%3A%2F%2Fbeta.apple.com%2Fsp%2Fbetaprogram%2F",
    "how to install tvOS": "https://www.techradar.com/how-to/install-tvos",
    "AppleInsider": "https://appleinsider.com/articles/20/03/23/higher-capacity-apple-tv-with-tvos-kids-mode-may-be-on-the-way",
    "Ted Lasson season 2": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know",
    "Mythic Quest season 2": "https://www.techradar.com/news/how-to-watch-mythic-quest-season-2-stream-new-apple-tv-plus-series-online"
  }
}