{
  "source": "https://www.techradar.com/news/realme-gt-2-will-launch-surprisingly-early",
  "title": "Realme GT 2 will launch surprisingly early",
  "category": "phones",
  "updated": "2021-12-08T09:26:50Z",
  "author": "tom-bedford",
  "summary": "In... one day?",
  "article": [
    "December is usually a quiet month for smartphone news, but December 2021 definitely isn't - case in point, the Realme GT 2 Pro is launching on the 9th day of the month, which is tomorrow at the time of writing, and also the same day the Moto Edge X30 is coming.",
    "A post by the company on Chinese social media platform Weibo schedules an event for December 9, and says \"The world's first GT 2 Pro user will be born at the event site!\". Machine translation has wrought havoc with the meaning of that sentence, but it's safe to say the company's upcoming top-end phone will show its face at the live stream.",
    "While that post makes it sound like the mobile will be teased and not unveiled, Realme recently confirmed that the GT 2 Pro would be launched in December, which makes it sound more likely that we'll get an official showing.",
    "There's no word on the Realme GT 2 - as in, the non-Pro sibling to the aforementioned mobile - and while Realme has been busy teasing its upcoming flagship phone, it's been silent on its 'standard' equivalent. So while we could see it tomorrow, we wouldn't be surprised if it didn't show up.",
    "Nor is there word of the Realme GT 2 Fold, the brand's first foldable phone which has been rumored a little bit. The actual existence of this is a little hazy though, so we'd be surprised if it did show up.",
    "This launch is a China-only one, so we'll only hear local pricing and availability of the phone, and we'll likely have to wait until the new year to hear about a global launch. This is the pattern we saw for the Realme GT earlier in 2021, as well as many other mobiles from the brand.",
    "The original Realme GT is far less than a year old, with an unveiling at the beginning of 2021 and a global launch in August, and its siblings are even more recent than that. Since most phone lines come out in yearly schedules, it's a little surprising that the GT 2 is breaking cover so early.",
    "But there's a very good reason, and it's all thanks to the new Qualcomm Snapdragon 8 Gen 1 - that's a new top-end chipset we'll likely see in loads of Android phones.",
    "Each year companies compete to be the first to put out a phone running Qualcomm's newest top-end chipset. For the previous model, the Snapdragon 888, Xiaomi won by launching the Mi 11 earlier than originally expected.",
    "For the Snapdragon 8 Gen 1, it seems a few companies are desperate not to let Xiaomi win again, because although the Xiaomi 12 is expected in the next few weeks, we've heard both Realme and Motorola are fighting for the crown too.",
    "And that battle will take place on December 9, because we recently heard the Moto Edge X30 will be unveiled in China on that date - and now Realme has scheduled a launch for just a few hours earlier.",
    "Depending on what it shows, then, Realme could win the Qualcomm crown with its GT 2 Pro - that's if this is a real unveiling, and not a tease - and steal Motorola's thunder.",
    "The competition is a little daft, as not only are all these phones only being unveiled in China and not worldwide, but winning the Qualcomm crown doesn't actually come with that much merit.",
    "General phone audiences don't know enough about tech or smartphones to even know what a chipset is, let alone care about which company used a certain processor first - but that doesn't stop these brands from competing anyway."
  ],
  "headers": {
    "6": "Analysis: why so early?"
  },
  "links": {
    "Weibo": "https://weibo.com/6617213711/L4UGPaB9G?layerid=4711712312526108",
    "confirmed that the GT 2 Pro would be launched in December": "https://www.gsmarena.com/realme_gt_2_pro_will_be_among_the_first_smartphones_to_use_the_snapdragon_8_gen_1-news-52079.php",
    "Realme GT 2 Fold": "https://www.techradar.com/news/realme-gt-successor-could-be-a-foldable-phone",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "Qualcomm Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12"
  }
}