{
  "source": "https://www.techradar.com/news/frayed-charging-cables-could-soon-be-a-thing-of-the-past-at-least-for-apple-users",
  "title": "Frayed charging cables could soon be a thing of the past – at least for iPhone users",
  "category": "phones",
  "updated": "2021-02-05T01:57:24Z",
  "author": "stephen-lambrechts",
  "summary": "The iPhone maker has a new patent for stiffer, sturdier cables",
  "article": [
    "Apple's proprietary charging cables have long held a reputation for fraying easily, but the Cupertino company could finally be set to address the problem if a new patent submission is anything to go by.",
    "The patent, first discovered by AppleInsider, sees the iPhone and Mac maker freely admit that it \"is well known that bending of the cable near the termination point may cause unwanted strain on the wire connections, which may lead to cable failure.\"",
    "Apple's patent goes on to list a number of possible solutions, with most options leading back to a \"Cable with Variable Stiffness.\"",
    "The proposed cable would sport a core with sections of varying thickness that would be \"surrounded by an outer sleeve having a uniform thickness\", as detailed in the submitted diagram below.",
    "It's worth noting that the patent does not single out Lightning cables by name, meaning the submission could be in relation to a complete overhaul of the company's iPhone, iPad and Mac cables. That means we may see updated Thunderbolt 3, USB-C and MagSafe charger cables in the near future.",
    "Of course, the submission of a patent is by no means a confirmation that Apple will indeed start producing stiffer cables, though it does suggest that the company is seriously looking into it."
  ],
  "headers": {},
  "links": {
    "patent submission": "http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&r=13&p=1&f=G&l=50&d=PG01&S1=(apple.AANM.+AND+20210204.PD.)&OS=aanm/apple+and+pd/2/4/2021&RS=(AANM/apple+AND+PD/20210204)",
    "AppleInsider": "https://appleinsider.com/articles/21/02/04/apple-may-have-a-solution-for-fraying-lightning-cables"
  }
}