{
  "source": "https://www.techradar.com/news/microsoft-cloud-pc-interface-leaked-but-nobody-noticed",
  "title": "Microsoft Cloud PC interface leaked, but nobody noticed",
  "category": "computing",
  "updated": "2021-07-14T16:12:14Z",
  "author": "joel-khalili",
  "summary": "Is this the interface for Microsoft’s new Cloud PC service?",
  "article": [
    "With all eyes seemingly on Windows 11 as preview builds of the new operating system begin to roll out, a promo image for Microsoft’s upcoming PC-as-a-Service offering appears to have flown under the radar.",
    "The graphic was published on Twitter in the runup to the Windows 11 launch event, where the leaker expected Microsoft Cloud PC to also be unveiled. It is now thought the service, codenamed “Deschutes”, will be showcased at Microsoft’s Inspire conference next week.",
    "The leak appears to show Cloud PC running in a web browser, likely Edge, and sporting the same frosted glass aesthetic as Windows 11.",
    "The application icons, however, are dressed with the Windows 10 wallpaper, perhaps suggesting Cloud PC will go live before the new version of Windows rolls out in winter. Previously, it was rumored Microsoft was aiming at a summer launch.",
    "TechRadar Pro has contacted Microsoft to confirm whether the leaked image is legitimate.",
    "Information about Microsoft’s new Cloud PC service first came to light last summer, when ZDNet discovered a job description containing details about the project.",
    "In essence, Cloud PC will allow users to access a Windows desktop and Office 365 software remotely, using their own device as a thin client. The service will be distinct from Windows Virtual Desktop in that customers will be charged a flat rate per user, as opposed to fees based on resource consumption.",
    "In February, it emerged Microsoft will offer several different “service plans” for customers to choose from, each offering a different level of performance and storage capacity.",
    "In a more recent job listing, Microsoft explained the new Azure-based service “allows all users to be productive from anywhere, on any device with a cloud-powered, secure and always up to date Windows experience.”",
    "“It also seamlessly allows endpoint managers to instantly provision cloud hosted PCs and manage physical and virtual devices through a unified portal.”",
    "The implications for businesses could be significant, allowing companies to cut down on both hardware costs and IT administration, while still providing employees with the tools they need."
  ],
  "headers": {
    "5": "Microsoft Cloud PC"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "published on Twitter": "https://twitter.com/ALumia_Italia/status/1408069967140904964",
    "Cloud PC": "https://www.techradar.com/news/windows-365-release-date-features-and-everything-else-you-need-to-know",
    "web browser": "https://www.techradar.com/best/browser",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "it was rumored": "https://www.techradar.com/news/microsofts-windows-10-cloud-pc-set-for-summer-launch",
    "Office 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "thin client": "https://www.techradar.com/best/best-thin-client",
    "several different “service plans”": "https://www.techradar.com/news/microsoft-drops-fresh-details-about-upcoming-windows-10-pc-as-a-service",
    "Azure": "https://www.techradar.com/reviews/microsoft-azure"
  }
}