{
  "source": "https://www.techradar.com/news/starfield-has-third-and-first-person-modes-alien-races-confirmed",
  "title": "Starfield has third and first-person modes, alien races confirmed",
  "category": "gaming",
  "updated": "2021-06-14T18:04:35Z",
  "author": "samuel-tolbert",
  "summary": "Venturing out",
  "article": [
    "Starfield has been unveiled, with a release date revealed and an in-engine trailer shown during the Xbox and Bethesda Games Showcase at E3 2021. In an interview with The Telegraph, director Todd Howard talked about just what players can actually expect from Starfield in terms of gameplay – at least a little bit. The game is over a year away and Bethesda doesn't want to share too much.",
    "\"Well it's coming out next year so there'll be a lot of time to show actual gameplay – and we'll do that closer to release, like we usually do,” Howard says. “But I will say this: it is a first person and third person game, like our other ones. We like that style of gameplay. First person for us is still our prime way of playing. So you can see the world and touch all those things.\"",
    "There are also aliens in the game but in exactly what fashion remains to be seen. Though there aren't any specifics at this time, Bethesda also seems to be pursuing a more hardcore RPG formula than in some of its recent games.",
    "“It's also a bit more hardcore of a role playing game than we've done. It's got some really great character systems – choosing your background, things like that. We’re going back to some things that we used to do in games long ago that we felt have really let players express the character they want to be. So I think when you see it being played, you would recognize it as something we made.\"",
    "Microsoft finalized its acquisition of Bethesda parent company ZeniMax Media earlier this year. As a result, Bethesda Softworks is now Xbox first-party, including Bethesda Game Studios. Future games that don't have pre-existing deals (such as Deathloop) will be exclusive to platforms where Xbox Game Pass exists.",
    "As such, Starfield is currently set to release exclusively on Xbox Series X, Xbox Series S and PC on November 11, 2022."
  ],
  "headers": {
    "4": "Only on Xbox"
  },
  "links": {
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "The Telegraph": "https://www.telegraph.co.uk/gaming/features/starfield-e3-2021-reveal-exclusive-todd-howard-spent-25-years/",
    "Bethesda Softworks": "https://www.windowscentral.com/bethesda-softworks",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}