{
  "source": "https://www.techradar.com/news/xbox-game-pass-for-pc-is-dead-long-live-pc-game-pass",
  "title": "Xbox Game Pass for PC is dead, long live PC Game Pass",
  "category": "computing",
  "updated": "2021-12-10T10:56:38Z",
  "author": "matt-hanson",
  "summary": "Change of name",
  "article": [
    "At The Game Awards, Microsoft announced that it was rebranding Xbox Game Pass for PC as PC Game Pass. The popular subscription service gives PC gamers access to loads of games from both Microsoft and other developers for a monthly fee.",
    "A similar service is also available on Microsoft’s Xbox consoles, and while it has got plaudits (rival Sony is rumored to be working on a PlayStation rival), it looks like PC gamers may not have been too keen on the Xbox brand, which is usually associated with consoles.",
    "This could explain why Microsoft has renamed the service on PC to just PC Game Pass. While it’s certainly snappier, the new name is also a bit… boring. However, by dropping ‘Xbox’ references, it may make it clearer to PC gamers that this service is about PC games, not console ones.",
    "One of the big appeals of PC Game Pass is that for $9.99/£7.99/AU$10.95 a month, you get access to over 100 games – including big name games from Microsoft on the day they are launched, such as Halo Infinite.",
    "At The Game Awards, Microsoft also announced new games coming to PC Game Pass that will appear on the service the same day they are launched (rather than making you have to wait), including Sniper Elite 5 and… Pigeon Simulator.",
    "These join games such as Total War: Warhammer III, Starfield and S.T.A.L.K.E.R. 2: Heart of Chernobyl, which will also be launching day one on PC Game Pass.",
    "From what we’ve seen so far, Game Pass has been a success for Microsoft on both Xbox and PC, so why change the name? It may be because of simplicity – Xbox Game Pass for PC always sounded cumbersome and awkward, so simplifying the name isn’t a bad idea.",
    "There’s also the fact that the Xbox brand isn’t as strong on PC, and may even put some people off. Having ‘Xbox’ in the name could also have made people wrongly assume that the service just gave you access to Xbox games. In fact, PC Game Pass offers quite a distinctive library from its console sibling, with PC-only games included. By dropping ‘Xbox’ this may be made clearer.",
    "It’s also worth pointing out that Microsoft doesn’t have the best track record when it comes to brand names. The naming conventions of its consoles is often bizarre (going from the Xbox to the Xbox 360 to the Xbox One), and Windows is no stranger to bizarre names and numbering conventions (what does XP really mean? Where is Windows 9?).",
    "While Microsoft may hope dropping ‘Xbox’ from the PC Game Pass name will help entice PC gamers, we’re still worried that it’s also stripped it of its personality. Time will tell if this is the right move."
  ],
  "headers": {
    "3": "More games coming",
    "6": "Analysis: Why the name change?"
  },
  "links": {
    "The Game Awards": "https://www.techradar.com/news/game-awards-2021-the-nominees-and-what-we-expect-to-see",
    "Xbox Game Pass for PC": "https://www.techradar.com/how-to/how-to-set-up-xbox-game-pass-for-pc",
    "rumored to be working on a PlayStation rival": "https://www.techradar.com/news/sony-could-finally-be-ready-to-compete-with-xbox-game-pass",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news"
  }
}