{
  "source": "https://www.techradar.com/news/google-pixel-5-vs-samsung-galaxy-s20-fe",
  "title": "Google Pixel 5 vs Samsung Galaxy S20 FE: which phone has smarter compromises?",
  "category": "phones",
  "updated": "2021-11-17T23:33:01Z",
  "author": "jon-mundy",
  "summary": "Two affordable flagships",
  "article": [
    "Both the Google Pixel 5 and the Samsung Galaxy S20 FE show that you no longer need to spend a king’s ransom in order to secure yourself a flagship phone experience.",
    "At a time when it’ll set you back well north of $1,100/£1,000 to obtain the ultimate smartphone experience, it’s phones like these that are carving out an essential niche of affordable luxury.",
    "There are many parallels between the two, including a similar release schedule and pricing, not to their both scoring 4 out of 5 star reviews from TechRadar. But there are also some fascinating differences at play here.",
    "So which late–2020 affordable flagship is best: the Pixel 5 or the Galaxy S20 FE?",
    "Google hit us with its latest flagship phone late in 2020, with the Pixel 5 rolling into shops on October 15. It’s still selling at its launch price of $699 / £599 / AU$999 from the official Google Store.",
    "The Samsung Galaxy S20 FE landed just a couple of weeks earlier on October 2, 2020. Prices started at $699/£699/AU$1,149 for the 5G model, while in the UK and Australia a 4G model was also made available for £599/AU$999 - and you can see the current prices in our Galaxy S20 FE deals page.",
    "Given its relatively mature status, and the subsequent arrival of the Galaxy S21 family, you’ll find that you can get the Galaxy S20 FE for much cheaper these days. At the time of writing, we spotted one selling for £463 on Amazon UK, and $599.99 on Amazon US.",
    "Examining the designs of the Pixel 5 and the Galaxy S20 FE offers a fascinating insight into how to hit an aggressive price point whilst still retaining some semblance of premium quality.",
    "The Pixel 5 doesn’t look or feel like anything special, with a flat display and a unibody construction that initially seems to be made from some kind of soft-touch plastic. But it actually has an all-metal body with a curious matte finish, which lends extra grip.",
    "The Galaxy S20 FE, by contrast, most certainly is a plastic phone, at least in part. Samsung has employed a so-called ‘Glasstic’ material for the back of its phone, though the frame is solid aluminum.",
    "The Pixel 5 is the smaller phone by far at 144.7 x 70.4 x 8mm, and it weighs a mere 151g. The Samsung Galaxy S20 FE, by contrast, is a relatively bulky 159.8 x 74.5 x 8.4mm, with a corresponding weight of 190g.",
    "Both phones are very well built, with IP68 ratings that ensure a high degree of dust and waterproofing. Again, there’s an understated sense of quality to them.",
    "Like the Pixel 5, the Galaxy S20 FE has a flat display. Unlike the Pixel, it positions its hole punch selfie cam right in the middle of the top of the display, rather than to the side. We can’t say we have a particular preference either way.",
    "Samsung has gone with an in-display fingerprint sensor, while Google has equipped its phone with an old-fashioned rear-mounted fingerprint sensor. Neither is particularly snappy or reliable, as these things go.",
    "Both of these phones pack vibrant FHD+ OLED displays, but the Samsung Galaxy S20 FE wins out in a couple of ways.",
    "At 6.5-inches, it’s much larger than the Google phone’s 6-inch equivalent. And with a refresh rate of 120Hz, it’s a fair bit more fluid than its 90Hz rival.",
    "Unlike the rest of the Galaxy S20 range, you don’t have to make that tough choice between a QHD resolution and those faster refresh rates, which comes as something of a relief. We always felt like we were missing out on something with those either/or situations.",
    "The Samsung’s larger size and faster refresh rate results in richer day-to-day navigation than on the Pixel 5, and a superior media-consumption experience to boot. By modern standards the Pixel 5 screen could be considered quite small, while the Galaxy S20 FE’s is average or even large.",
    "On the flip side of this, the Pixel 5 display is much more wieldy one-handed, and those with larger hands will be able to use it without bringing a second hand into play too often.",
    "Google and Samsung are at polar opposites when it comes to photographic philosophies. While Google is all about the software with, Samsung goes all in on hardware.",
    "It still feels quite unusual (at least in Android terms) that the Pixel 5 has just the two sensors. Not only that, but the humble 12.2-megapixel Sony Exmor IMX363 sensor that leads the charge is the exact same one that you’ll find in the Pixel 3 of a few years back. Cutting edge it ain’t.",
    "The Samsung Galaxy S20 FE also employs a 12MP wide sensor, but it’s a more advanced component that produces much larger 1.8µm pixels (as opposed to the Pixel 5’s 1.4 μm). Basically, Samsung is relying on hardware to hoover up all the light it can, whereas Google employs its clever algorithms to maximize what little it can get its hands on.",
    "Google has changed the nature of its second camera this time around. It’s a dedicated 16MP 107-degree ultra-wide rather than the Pixel 4’s telephoto. You’ll just have to make do with crops if you want to zoom in beyond 1X.",
    "The Galaxy S20 FE, by contrast, has both a 12MP ultra-wide sensor and an 8MP f/2.4 telephoto, the latter of which is capable of capturing 3X zoomed shots. We found the latter to be nice and sharp, though such close-ups tended to sport slightly duller colors then we would have liked.",
    "Ultimately, Google doesn’t hold the photographical lead it used to have, and the Pixel 5’s camera isn’t as flexible as the Galaxy S20 FE’s. However, we still prefer Google’s balanced color science and uncannily capable HDR to Samsung’s OTT tones.",
    "The Pixel 5 also excels in low light conditions, where Google’s algorithmic voodoo really comes into its own. While Google’s true flagship competitors have closed the gap and even overtaken it on this front, Night shots are still almost spookily clear and colorful where they’re merely decent on the Samsung. We also love Google’s built-in image editing software.",
    "Both phones can manage 4K video at 60fps, but the Galaxy S20 FE benefits from some extra neat tricks. Single Take, for example, will capture short 5 to 15-second snippets, then select the best stills and video footage from it.",
    "As is Samsung’s wont, the manufacturer has split its hardware offering for the Galaxy S20 FE. But this time it’s not along regional grounds, rather depending upon whether you go for the 4G or 5G model.",
    "If you get the 5G Galaxy S20 FE, you’re guaranteed a Snapdragon 865 CPU, while all 4G models pack the Exynos 990. It’s a much healthier state of affairs than the rest of the Galaxy S20 range.",
    "Of course, Google has moved away from the hardware arms race altogether. The Pixel 5 is powered by the Snapdragon 765, which is an upper-mid-range 2020 chip that provides decent (but far from top) performance and 5G connectivity at an affordable price.",
    "The result of these two different approaches is a massive win for Samsung. In the popular Geekbench 5 multi-core benchmark test, the Pixel 5 scored 1617 next to the Galaxy S20 FE’s 3130.",
    "Gaming isn’t as silky smooth on the Pixel 5 as it is on the Galaxy S20 FE, and you won’t be bumping the likes of Genshin Impact or CoD Mobile to the same High settings either. Otherwise, with both phones packing a respectable 8GB of RAM, multitasking is reasonably snappy.",
    "The Pixel 5 comes in a single 128GB storage variant, while the Galaxy S20 FE gives you choice of 128GB or 256GB. Samsung’s phone also provides a microSDXC slot.",
    "It’s a pretty resounding hardware win for the Samsung Galaxy S20 FE all things considered, but the Pixel 5 does hit back in one small area. It comes with 5G as standard, whereas the Galaxy S20 FE gives you 4G and 5G variants depending on your region.",
    "Stepping away from hardware for a second, the Pixel 5 wins when it comes to software. Google’s pure take on Android is a beautiful thing, especially when you compare it to the rather more cluttered efforts of Samsung.",
    "The Korean manufacturer’s One UI is a lot better than it used to be, with far less bloat than the bad old days. It definitely has its fans, and it’s also a good deal more customizable than stock Android. But it’s still full of unwanted third party apps and clutter that ultimately detract from the experience of using the phone day to day.",
    "We know which phone we’d opt for if we were pinning our hopes on a timely upgrade to Android 12, too.",
    "We’ve already established that the Google Pixel 5 is the smaller phone of the two, so it shouldn’t surprise you to learn that it has a smaller battery. At 4080 mAh, its capacity is quite a bit lower than the Galaxy S20 FE’s 4500mAh cell.",
    "Remember that the Pixel 5 has more humble components, however. In particular its display is smaller and less fluid, thus demanding less power to run.",
    "We were a little disappointed with the Galaxy S20 FE’s battery performance in our review. On fairly typical days, with the 120Hz display, 5G connectivity and always-on display active, our reviewer would finish work with around 30% battery or less remaining. They’d then find that hey needed to charge the phone if they wanted to play a game or watch Netflix and get through to bed time.",
    "Ultimately, we’d advise that you familiarize yourself with Samsung’s impressive suite of battery saver modes if you opt for the Galaxy S20 FE.",
    "Conversely, the Pixel 5 routinely lasted into a second day of usage on a frequent basis. Extreme Battery Saver helps when things do get low, too.",
    "When it comes time to recharge, the Galaxy S20 FE does so faster than its rival. It supports 25W wired charging compared to the Pixel 5’s 18W, and 15W wireless charging versus the Pixel 5’s 12W.",
    "Both of these phones approached the flagship category in new and interesting ways, and both have proven to be influential in their own ways.",
    "The Pixel 5 showed that you didn’t need top notch power or all the bells and whistles to be considered a flagship, as long as you think outside of the box on design and are clever with your software. The Galaxy S20 FE, meanwhile, showed that plastic could still be considered premium, especially when it’s married to top level performance.",
    "It’s tough to say which presents the more convincing case in the second half of 2021. The Samsung Galaxy S20 FE is the more capable all-rounder, with a more fluid display and far superior performance. But the Pixel 5 has the continued software backing of Google itself, and the kind of clean Android software that will feel fast for some time to come.",
    "Ultimately, both phones remain highly competitive right now, yet both are surely set to be replaced over the coming months. Our choice would simply be to pick out the best deal available at any given time, which at the time of writing looks more likely to involve the Galaxy S20 FE."
  ],
  "headers": {
    "4": "Google Pixel 5 vs Samsung Galaxy S20 FE price and availability",
    "7": "Design",
    "14": "Display",
    "19": "Camera",
    "27": "Specs and performance",
    "37": "Battery",
    "43": "Takeaway"
  },
  "links": {
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Galaxy S20 FE deals": "https://www.techradar.com/deals/samsung-galaxy-s20-fe-deals",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Genshin Impact": "https://www.techradar.com/news/genshin-impact-free-zelda-clone-to-play-while-you-wait-for-breath-of-the-wild-2",
    "CoD Mobile": "https://www.techradar.com/news/call-of-duty-mobile-season-5",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}