{
  "source": "https://www.techradar.com/news/all-new-macbook-pro-is-dollar100-off-in-early-back-friday-laptop-deal-and-going-fast",
  "title": "All-new MacBook Pro is $100 off in early Back Friday laptop deal and going fast",
  "category": "computing",
  "updated": "2021-10-28T14:58:19Z",
  "author": "alex-whitelock",
  "summary": "The lowest price yet on the stunning new MacBook Pro 14",
  "article": [
    "Barely weeks after launch, the new Apple MacBook Pro 14 is now just $1,899 thanks to Adorama's early Black Friday laptop deals - a full $100 discount and the first real price cut we've seen from any retailer so far.",
    "Not only does this early Black Friday MacBook deal beat Amazon's previous record by $50, but it's also looking like you'll be able to secure a fairly speedy delivery too. Currently shipping estimates are 3-4 weeks at Apple itself and Amazon's store page is also listed as out of stock. In short, this could be your best bet to not only get yourself a nice little discount but also beat the crowds out and get your machine before Black Friday 2021.",
    "And it's probably wise to do so - A combination of the latest new Apple M1 Pro processor, Liquid Retina XDR display, 16GB of RAM, and 512GB SSD has made these new machines very much in demand for both professionals and power users. It's easily one of the best ultrabooks you can buy right now - a fact backed up by a five-star rating on our recent MacBook Pro 14-inch (2021) review.",
    "You could, of course, wait for later Black Friday MacBook Pro deals but we think this is probably going to be the best price on this particular machine. Other retailers may match it in the following weeks, but it's unlikely we'll see anything much lower on these super in-demand ultrabooks.",
    "Outside the US? See the best MacBook deals in your region just below",
    "Read about what other brands are offering in our handy guide to the upcoming Black Friday laptop deals."
  ],
  "headers": {
    "5": "Apple MacBook Pro 14 lowest price ever"
  },
  "links": {
    "is now just $1,899": "https://adorama.evyy.net/c/221109/51926/1036?subId1=trd-us-5755532762040445000&sharedId=trd-us&u=https%3A%2F%2Fwww.adorama.com%2Facmkgp3lla.html%3Femailprice%3Dt",
    "by $50": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-MacBook-14-inch-8%25E2%2580%2591core-14%25E2%2580%2591core%2Fdp%2FB09JQSLL92%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1195065373971587600-20",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "MacBook Pro 14-inch (2021)": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Black Friday MacBook Pro deals": "https://www.techradar.com/black-friday/black-friday-macbook-pro-deals",
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals"
  }
}