{
  "source": "https://www.techradar.com/news/prime-day-headphones-deal-the-best-on-ear-headphones-of-2021-plummet-to-lowest-price",
  "title": "The best on-ear headphones in the world are down to their lowest price for Prime Day",
  "category": "audio-visual",
  "updated": "2021-06-22T02:29:00Z",
  "author": "olivia-tambini",
  "summary": "Don't miss this incredible headphones deal",
  "article": [
    "Cheap headphones don't always sound as good as their more expensive counterparts, but the Jabra 45H on-ear headphones are a notable exception – and right now, they're available at the lowest price we've seen thanks to a stellar Prime Day deal.",
    "Usually $99.99, Amazon has slashed the price of these sleek headphones to just $54.99, saving you $45. (Not in the US? Scroll down for the best Jabra headphones deals in your region.)",
    "Previously, these cans have dropped as low as $69.99, but this is the first time we've seen them plummet to this price – and you should snap them up very quickly, as we anticipate that stock won't last long with this brilliant discount.",
    "For your money, you can't do any better than Jabra Elite 45H – and this Prime Day headphones deal makes them all the more attractive.",
    "Despite the low price, you're getting Bluetooth 5 connectivity, 40mm full-range dynamic drivers and a smattering of physical push-button controls in a wireless on-ear frame. Faux leather and memory foam, combined with winningly un-creaky plastic, make for a comfortable fit (even if the earpads themselves absorb ear-heat quite quickly and then give it straight back).",
    "There’s voice control available from Amazon Alexa, Google Assistant, or Siri. Jabra’s Sound+ control app even walks you through a brief hearing test to establish exactly how the EQs should be set to best suit your ears. By the standards of overtly affordable headphones, the Elite 45h are very feature-packed indeed.",
    "Best of all, you're getting 50 hours of battery life from a single charge. There are very few headphones around, at any price, that can challenge that figure – and the Jabras will go for another 10 hours after just 15 minutes of USB-C charging.",
    "Looking for something a little different? Perhaps a pair of over-ear headphones or some true wireless earbuds? Well, Amazon has discounted lots more Jabra headphones as well:",
    "No matter where you live, you'll find all the lowest prices for the Jabra Elite 45H from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best on-ear headphones deal on Prime Day",
    "7": "More Jabra headphones deals on Prime Day",
    "8": "More Jabra Elite 45H deals"
  },
  "links": {
    "Prime Day deal": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "to just $54.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FJabra-Elite-Titanium-Black-Ear%2Fdp%2FB0865439LD%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8930720103430557000-20",
    "Jabra Elite 45H": "https://www.techradar.com/reviews/jabra-elite-45h-review",
    "Prime Day headphones deal": "https://www.techradar.com/amazon-prime-day/best-prime-day-headphone-deals"
  }
}