{
  "source": "https://www.techradar.com/news/should-you-buy-a-nintendo-switch-lite-on-amazon-prime-day-2021",
  "title": "Should you buy a Nintendo Switch Lite on Amazon Prime Day 2021?",
  "category": "gaming",
  "updated": "2021-06-16T12:00:33Z",
  "author": "samuel-roberts",
  "summary": "Nintendo's handheld is a perfect fit for the right type of player",
  "article": [
    "As we head into Amazon Prime Day, it's unclear what its gaming deals are going to look like. While we expect a suite of software to get a discount, the current slowdown of hardware supplies driven by a worldwide semiconductor shortage means it's hard to tell what could feasibly get a big price cut.",
    "If you tried buying a Nintendo Switch last year at the height of the pandemic, you probably noticed that it was borderline impossible. With everyone stuck indoors for months at a time, nothing seemed more appealing than escaping to an island of friendly critters in Animal Crossing: New Horizon, or blue-shelling your housemates in Mario Kart 8 Deluxe. Stock sold out quickly all year – and it's only really started to recover in 2021, with more focus now placed on the even harder-to-find PS5 and Xbox Series X stock.",
    "If you tried to buy its handheld-only sister console, though, the Nintendo Switch Lite, stock was much easier to find. It's unclear exactly why that is – but it's probably because of the big difference in functionality. While the $299 Nintendo Switch model can function as a home console that docks and connects to your TV via HDMI, the $199.99 / £199.99 / AU$329.95 Switch Lite is strictly a portable console. You also can't detach the controllers – it doesn't have Joy-Cons like the main Switch. It's an all-in-one handheld.",
    "We think there's a strong possibility you'll see it featured in the Prime Day deals this year in some capacity – and below, we'll give you a quick assessment on whether the console is for you. Keep an eye on our Prime Day Nintendo Switch deals hub throughout the next week, as we track the best discounts out there.",
    "The Switch Lite resembles consoles like the PS Vita or the PSP, with the buttons and analogue sticks placed on the left and right hand sides of the screens. Like the main Switch, you place game cards into a slot above the screen, but you also don't have to use physical media at all – an identical library is available digitally on Nintendo's eShop, though discounts on some of its bigger titles are harder to come by that way.",
    "The Switch Lite is perfect for players who don't need another home console, or who value portability. Neither the Switch or the Switch Lite are really appropriate for carrying around in your pocket like a phone, for example, but the Switch Lite weighs 277g, significantly less than the 398g for the main Switch unit.",
    "Performance-wise, they're basically the same. The main Switch model can hit 1080p when in docked mode, while being handheld-only keeps the Switch Lite at 720p. Considering the modest size of the screen, we think this is fine.",
    "Basically, if you're planning on going on vacation – or you want a nice console to enjoy in bed, or in another part of your home away from your TV – the Switch Lite is a worthy purchase. The price offsets the downgrade in feature set.",
    "Here's the problem with buying a regular Nintendo Switch right now – Nintendo is largely expected to replace the console with a widely rumored Nintendo Switch Pro console. While it's expected to be more expensive than $299, it's also set to offer more graphical power, making it the most technically impressive unit on the market.",
    "The Switch Lite, meanwhile, is not expected to be phased out, according to Bloomberg. While buying the handheld now means you almost certainly means won't own the most powerful Nintendo Switch available by the end of the year, the price difference between this and the new unit is expected to be more than the existing $100 (around £71 / AU$130) – that's meaningful to most people.",
    "The Switch Lite is a borderline budget console in price, but to hold, you wouldn't think that at all. Just think of it as a powerful Nintendo handheld and a successor to the 3DS – and not necessarily a compromise from a hybrid console that boasts more functionality.",
    "You're more likely to see bundles including the Nintendo Switch Lite around Prime Day than you are discounts on the main unit. Finding a Nintendo Switch Lite for $20 / £20 off the retail price or more would be a decent saving if you're in the US and UK – anything lower is unlikely, since these things are still in high demand, but not necessarily impossible.",
    "Your best bet, if you're a new Switch owner, is to try and get a bundle deal that includes a game you actually want for a decent price. Check our best Nintendo Switch games list for recommendations on software to look out for when you're weighing up bundles.",
    "Try and avoid bundles that come with unwanted third-party accessories, like headphones or cases – they tend to inflate the price, and you won't necessarily need them. Getting the game, a console and an optional microSD card from a respected manufacturer like SanDisk is what you want in a bundle as a new Switch Lite owner.",
    "If you want the most powerful Switch on the market, we'd recommend skipping the Nintendo Switch Lite. The Nintendo Switch Pro – a tentative name – is almost certainly going to supplant the basic Nintendo Switch model before the end of the year.",
    "The Lite, though, is expected to be available for a few years, yet. And considering it's still less than two years old, we don't think it's a bad bet to grab at a sale price, especially given the deep library of great Nintendo games you can enjoy on the console.",
    "The question is, with Switch demand still high, will we actually see it discounted? While deals are few and far between for Nintendo's console in this age of high demand, we don't think it's worth biting on Prime Day without some kind of deal involved.",
    "Perhaps the coming of the Switch Pro, too, will finally lead to big discounts on the core Switch unit, as retailers clear stock ahead of its release. Still, we'll believe that when we see it."
  ],
  "headers": {
    "4": "The Switch Lite is ideal for a certain type of player",
    "8": "The Switch Lite won't be made obsolete by a new Switch console",
    "11": "What's a good discount on a Nintendo Switch Lite?",
    "14": "Should you buy a Nintendo Switch Lite on Prime Day 2021?"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X stock.": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Prime Day Nintendo Switch deals": "https://www.techradar.com/news/amazon-prime-day-nintendo-switch-deals-all-the-best-offers-available-now",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-27/nintendo-plans-upgraded-switch-replacement-as-soon-as-september",
    "best Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games"
  }
}