{
  "source": "https://www.techradar.com/news/samsung-galaxy-buds-pro-wireless-earbuds-are-getting-some-buds-2-features",
  "title": "Samsung Galaxy Buds Pro wireless earbuds are getting some Buds 2 features",
  "category": "audio-visual",
  "updated": "2021-09-01T09:30:11Z",
  "author": "olivia-tambini",
  "summary": "The Galaxy Buds Pro are about to get even better",
  "article": [
    "The Samsung Galaxy Buds Pro are among the best wireless earbuds you can buy today – and thanks to a new firmware update, they're about to get even better, according to Tizen Help.",
    "The update is bringing some features first seen from the newer Samsung Galaxy Buds 2, including a new Noise Control option. This allows you to control the active noise cancellation and ambient sound settings from one specific earbud, which is handy if you prefer to wear one bud at a time.",
    "Samsung claims that the update will also kill some minor bugs to \"provide more stability and to enhance overall performance\".",
    "To use these new features, you'll need to install the new Galaxy Buds Pro Plugin, which is free from the Google Play Store. Right now, it's only available in South Korea, but according to Tizen Help, that's with \"a promise to come out in other countries.\"",
    "Unsurprisingly, the plugin isn't currently available to iOS users – in fact, iPhone owners still can't download the Galaxy Wearable app to control their Galaxy Buds, Galaxy Buds Pro or Galaxy Buds 2 earbuds, though there is the Samsung Galaxy Buds app that works with the Galaxy Buds Plus and the Galaxy Buds Live.",
    "Now that the Galaxy Buds Pro come with some of the features seen on the recently released Galaxy Buds 2, you may be wondering whether there's any point in buying the latest Samsung earbuds over their predecessors.",
    "The Galaxy Buds 2 are cheaper than the Buds Pro, costing $149.99 / £139.99 / AU$219 as opposed to the Pro's $199 / £219 / AU$349 price tag. Saying that, the older Galaxy Buds Pro are often subject to discounts these days, and you may find that the two models are roughly the same price in your shopping travels.",
    "The newer Buds 2 also come with a longer battery life than their predecessors, with a 20-hour playback time compared to the 18 hours provided by the Galaxy Buds Pro.",
    "We think the Galaxy Buds 2 sound better than the Buds Pro, too, which suffered from a flat, slightly cramped sound.",
    "However, there are some instances in which the Galaxy Buds Pro come out on top. For example, the Galaxy Buds Pro offer an IPX7 water resistance rating, while the Buds 2 only come with a measly IPX2 rating – which isn't enough to protect them from sweaty workouts or heavy rain.",
    "So, if you're trying to decide between the two models and you know you're going to be using your buds while exercising, we'd recommend opting for the Galaxy Buds Pro. Otherwise, the improved audio quality, battery life, and noise cancellation provided by the Galaxy Buds 2 makes them a safer bet, even if the Galaxy Buds Pro now share some of their features."
  ],
  "headers": {
    "5": "Analysis: is it still worth buying the Galaxy Buds 2?"
  },
  "links": {
    "Samsung Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Tizen Help": "https://www.tizenhelp.com/galaxy-buds-pro-praised-with-buds-2-features/",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Galaxy Buds": "https://www.techradar.com/reviews/samsung-galaxy-buds",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Galaxy Buds Plus": "https://www.techradar.com/reviews/samsung-galaxy-buds-plus",
    "Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live"
  }
}