{
  "source": "https://www.techradar.com/news/viewsonic-has-unveiled-a-new-8k-color-accurate-monitor",
  "title": "ViewSonic has unveiled a new 8K color accurate monitor",
  "category": "computing",
  "updated": "2021-01-14T15:32:41Z",
  "author": "barclay-ballard",
  "summary": "8K monitor among a host of new display tech unveiled at CES 2021",
  "article": [
    "Californian electronic company ViewSonic has unveiled a range of new monitors at this year’s Consumer Electronic Show, currently being held virtually due to the coronavirus pandemic. Perhaps the most impressive product is the VP3286-8K, an 8K premium monitor that comes with multiple connectivity options including Thunderbolt 3.",
    "The VP3286-8K, which will retail at $5,000, is joined by three different 4K monitors, including the VP3286-4K. This 32-inch monitor also comes with Thunderbolt 3, DisplayPort, and a USB hub for connectivity and will set consumers back $2,000.",
    "Other display options revealed by ViewSonic include new gaming monitors, a 4K projector and an upgraded LED-based portable projector with smart connectivity.",
    "Cheaper displays were also unveiled, including a 27-inch monitor called the VP2786-4K, which is priced at $1,000. More affordable still is the VP2776-4K, which for $900 has the same connectivity options and size as its slightly more expensive cousin but doesn't have the same “wide color” functionality.",
    "In total, ViewSonic announced five ColorPro monitors, five elite gaming monitors, four portable monitors and three projectors. It may sound like a lot to release at once, but many new announcements get lost in the noise of CES, so businesses often try to make as big a splash as they can.",
    "“ViewSonic continues to develop display solutions that can fit into anyone’s lifestyle, from a hybrid work/learn environment to just enjoying something that provides entertainment, whether it’s gaming or binge-watching shows,” Jeff Muto, Business Line Director at ViewSonic, said.",
    "“Our latest displays were designed to perform with next-generation gaming, hardware and applications to make everyone’s experience a little better and offer flexibility. Our ColorPro monitors feature color blind modes and ensure color accuracy for professional content creators, while our ELITE gaming monitors are developed to take gamers to the next level. We have 4K and 1080p projectors that can provide big-screen content.”",
    "Check out all of TechRadar's CES 2021 coverage. We're remotely covering the online-only show to bring you all the breaking tech news and launches, plus a smattering of hands-on reviews.",
    "Via PetaPixel"
  ],
  "headers": {
    "2": "On display"
  },
  "links": {
    "Thunderbolt 3": "https://www.techradar.com/news/getting-the-most-out-of-thunderbolt-3",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "PetaPixel": "https://petapixel.com/2021/01/13/viewsonic-announces-8k-color-accurate-thunderbolt-3-monitor/"
  }
}