{
  "source": "https://www.techradar.com/news/it-looks-like-we-really-are-getting-nvidia-rtx-3000-ti-gpus-for-laptops-at-ces-2022",
  "title": "It looks like we really are getting Nvidia RTX 3000 Ti GPUs for laptops at CES 2022",
  "category": "computing",
  "updated": "2021-12-06T16:08:13Z",
  "author": "jackie-thomas",
  "summary": "Another leak points to Acer laptops with refreshed GPUs",
  "article": [
    "Recently, we've been seeing rumors about refreshed mobile GPUs from Nvidia that will be based on its latest high-end graphics cards like the RTX 3070 Ti and RTX 3080 Ti. And now a retail leak gives further credence that these GPUs are coming soon.",
    "A store listing on French tech retailer pc21.fr, and spotted by leaker @momomo_us, refers to a new Acer Nitro 5 with an Intel Core i7-12700H, an RTX 3070 Ti and 8GB of RAM. Of course, neither this GPU or CPU currently exist for laptops.",
    "The Core i7-12700H isn't too surprising. We'd expect 12th-generation chips to launch soon, given the recent launch of Intel's Alder Lake S-series chips on desktop. But what is surprising is the inclusion of an RTX 3070 Ti. At least, kind of. This would mark a mid-generation refresh for Nvidia, just to give its mobile lineup another boost before its new graphics cards supposedly launch in late 2022.",
    "Given the timing of this leak, we wouldn't be terribly surprised if these new gaming laptop GPUs launch at CES 2022 in January. Until then, we'll just have to wait and see what Nvidia has in store, but it's starting to look pretty promising.",
    "The rumored release of yet another round of RTX 3000 series GPUs might seem like a red flag for anyone that's been waiting for the RTX 4000 launch, but don't worry - the likely Lovelace GPUs are probably still on schedule.",
    "Nvidia did the same thing with its RTX Super GPUs back in 2020, refreshing its gaming laptop lineup early in the same year it launched the RTX 3080. And, it makes sense.",
    "Because while folks that play on a gaming PC are likely going to get new graphics cards later in the year, laptop versions of those GPUs are probably not going to release at the same time. Instead, the RTX 4080 for laptops probably won't see the light of day until CES 2023 at the earliest.",
    "These RTX 3000 Ti GPUs, if they're real, are going to serve as a stopgap between the two GPU generations for laptops. It's probably not going to be enough of an upgrade for anyone that already owns a gaming laptop that's come out within the last two years, but it'll be a nice bonus for anyone shopping for a new laptop in early 2022.",
    "Via VideoCardz"
  ],
  "headers": {
    "4": "Analysis: Don't worry, the RTX 4080 is probably still on schedule"
  },
  "links": {
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "pc21.fr": "https://www.pc21.fr/fiche/nh-qfsef-004-nitro-5-an515-58-7771-15-6-qhd-ips-2560-x-1440-165hz-dci-p3-100-165hz-dci-p3-100-confyview-dalle-mate-intel-core-i7-12700h-nvidia-geforce-rtx--i3692683.html",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "CES 2022": "https://www.techradar.com/news/ces-2022",
    "likely Lovelace GPUs": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-finalized-could-arrive-end-2022",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 4080": "https://www.techradar.com/news/nvidia-geforce-rtx-4080",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "VideoCardz": "https://videocardz.com/newz/acer-nitro-5-laptops-with-core-i7-12700h-i5-12500h-cpus-and-geforce-rtx-3070ti-3050ti-gpus-listed-by-french-retailer"
  }
}