{
  "source": "https://www.techradar.com/news/ryzen-7-pro-may-be-the-push-amd-needs-to-challenge-intel-based-laptops",
  "title": "Ryzen 7 Pro may be the push AMD needs to challenge Intel-based laptops",
  "category": "computing",
  "updated": "2021-01-29T21:22:42Z",
  "author": "john-loeffler",
  "summary": "AMD moves to strengthen its mobile business market",
  "article": [
    "AMD appears to be readying a pair of new Ryzen 5000U mobile CPUs to build up its business line of laptops, and it may become a serious challenge to Intel.",
    "The new AMD Ryzen processors, which will have the Pro series designation, will have enhanced features targeted towards business users, like system memory encryption to prevent sensitive data from being stolen and support for Microsoft's cloud management system.",
    "Benchmark data from the Ryzen 7 5850U Pro appeared on UserBenchmark this week and was flagged by @TUM_APISAK on Twitter.",
    "The benchmark shows that the new 5850U is probably based on the Ryzen 7 5800U, since - as Videocardz notes - UserBenchmark reports that its base clock is 1.9GHz and has eight cores with 16 threads, the same as the 5800U.",
    "The report doesn't provide a max boost frequency, though, just an average boost frequency of 3.65GHz. It does rank it fairly high, relative to other CPUs tested through UserBenchmark.",
    "That's not the only news. TUM_APISAK also posted the link to an HP specification document on HP's site that lists two new processor SKUs, the Ryzen 7 5850U and the Ryzen 5 5650U. It also lists the max boost of the two processors as 4.4GHz and 4.2GHz, respectively.",
    "While we don't have benchmark data on the Ryzen 5 5650U and since AMD has not officially announced the new Ryzen 5000U Pro series yet, we also can't say if there are more SKUs to come in the Pro line of CPUs.",
    "Earlier this month, AMD surpassed Intel in desktop CPU market share for the first time in 15 years, marking a remarkable turnaround powered almost entirely by the success of its Ryzen line of processors.",
    "The same can't be said of the mobile computing market, where Intel enjoys a dominating position with 81.3% of laptops running an Intel CPU to AMDs meager 18.7%.",
    "This isn't terribly different than the position AMD found itself in a decade and a half back when Intel's Core series of processors helped Team Blue pull away from AMD's Athlon series. It took time and effort, but AMD managed to turn things around in recent years.",
    "With AMD's focus on desktop CPUs, it's mobile CPU lineups haven't gotten nearly as much attention from consumers. But with mobile computing growing faster than ever, largely at the expense of desktop PCs, it definitely won't be long before AMD begins making a more concerted push into the mobile computing space the way they did with desktop CPUs.",
    "Can AMD pull a second silicon rabbit out of their hat in as many decades? If it does, it may all start with the Ryzen 7 5850U Pro."
  ],
  "headers": {
    "7": "AMD lags Intel in mobile systems, but for how long?"
  },
  "links": {
    "@TUM_APISAK": "https://twitter.com/TUM_APISAK/status/1355026071939215362",
    "Videocardz": "https://videocardz.com/newz/amd-ryzen-7-pro-5850u-and-ryzen-5-pro-5650u-appear-online",
    "HP specification document": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-7564620002948005000&p=https%3A%2F%2Fsupport.hp.com%2Fth-en%2Fdocument%2Fc06995210",
    "surpassed": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years"
  }
}