{
  "source": "https://www.techradar.com/news/google-is-finally-updating-its-most-confusing-icon",
  "title": "Google is finally updating its most confusing icon",
  "category": "computing",
  "updated": "2021-09-16T10:51:10Z",
  "author": "joel-khalili",
  "summary": "Google Tasks icon is now much clearer",
  "article": [
    "At long last, Google has unveiled a new icon for its to-do list service Tasks, which should make the application easier to identify at a glance.",
    "To replace the old logo, which was abstract in style, Google has chosen a simple design that more obviously resembles the tick symbol we’ve all come to associate with productivity apps of this kind.",
    "In a blog post, Google says the change is meant to bring the Tasks logo in line with the iconography used across other services in its Workspace suite. That said, the company has not followed the multi-color palette used for the icons for Meet, Gmail, Drive and the like, opting instead for a solid blue.",
    "The new Tasks icon will begin to appear on devices from September 23 onwards.",
    "Google last updated its icons en-masse in October last year, to coincide with the launch of Google Workspace, a rebranded version of G Suite.",
    "At the time, the company said the new icons were supposed to create consistency across the product suite, to symbolize the new level of interoperability it hoped to achieve between its individual apps. Inexplicably, however, the Tasks logo was left behind - an oversight Google is attempting to rectify with this latest icon update.",
    "A new logo is not the only change to come to Tasks in recent weeks, though. Last month, the company unveiled an update for the Tasks mobile app, which introduced a tabbed system that lets users better categorize and distinguish between the different items in their to-do list.",
    "Admittedly, it’s not an update that will set the world on fire, but it shows Google hasn’t entirely forgotten about its task management application.",
    "It’s also no coincidence the firm has chosen to give Tasks a new lick of paint at this particular juncture; with the transition to hybrid working in full flow, the ability to organize the working day effectively will become all the more important."
  ],
  "headers": {
    "4": "Google icons makeover"
  },
  "links": {
    "to-do list": "https://www.techradar.com/best/best-to-do-list-apps",
    "productivity apps": "https://www.techradar.com/best/best-productivity-apps",
    "blog post": "https://workspaceupdates.googleblog.com/2021/09/new-logo-coming-to-google-tasks.html",
    "Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "an update": "https://www.techradar.com/news/google-is-upgrading-one-of-its-most-unloved-productivity-tools",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}