{
  "source": "https://www.techradar.com/news/the-apple-iphone-13-has-yet-another-big-problem",
  "title": "The Apple iPhone 13 has yet another big problem",
  "category": "phones",
  "updated": "2021-09-28T15:27:27Z",
  "author": "henry-st-leger",
  "summary": "Face ID could stop working if you get a third-party screen fix",
  "article": [
    "The new iPhone 13 is having some issues. None of them are product-breaking, or as explosive as the combustible handsets we were seeing from Samsung but a few years ago. But the latest is one that Apple appears to have intentionally introduced, which makes it possibly the hardest to swallow so far.",
    "It seems like Face ID could stop working for your handset if you get a screen replacement from a third-party supplier – essentially, anyone other than Apple. YouTube channel Phone Repair Guru found that swapping out the iPhone 13's screen – even with an identical display – rendered Face ID unusable.",
    "Face ID, which allows users to unlock phones through face recognition alone, is a highly useful feature, especially for those prone to forgetting their passcodes. But Apple has a long history of hostility towards third-party fixers, preferring customers to go to Apple directly instead.",
    "It's a tussle that's at the heart of 'right to repair' movements across the globe, with manufacturers wanting to keep control over who does what to their devices – especially if an easy third-party fix stops someone from buying a new model – and both the EU and US government looking for ways to put more power in the hands of consumers.",
    "You can see the full video from Phone Repair Guru below. Perhaps the worst part is that Face ID was still unusable after inserting the original displays back in their respective handsets – suggesting that the damage can't be undone.",
    "Anti-consumer measures like these aren't surprising, but they're still disappointing – especially when considered alongside other launch issues for the iPhone 13 range.",
    "We've already reported on an issue with 120Hz refresh rates on the new handsets, as well as Apple Watch users having trouble unlocking their new iPhones – in both cases, unintentional bugs that will no doubt be fixed in a firmware update down the line.",
    "But for anyone who wants the option of fixing their own iPhone, given the ease of dropping and cracking any smartphone's screen, the move is a slap in the face. It's a pointless restriction designed only to limit customers' options, and prevent money entering the hands of third parties rather than Apple itself.",
    "We see the same philosophy in the complex sealing of handsets like the iPhone 12, which requires proprietary tools to reset serial numbers of replaced parts – and simply won't turn on again without them.",
    "Back in May, the FTC went so far as to blast Apple with a report that condemned its repair restrictions as anti-competitive, like limiting access to service manuals and requiring unannounced inspections of those third-party shops (via 9to5Mac).",
    "Even hardware design was criticized, like tying components to logic boards and making battery replacement so tough and cost-inefficient to encourage going through Apple’s channels, if not simply buying a new device – adding to mountains of e-waste every year from discarded gadgets, whatever noise Apple makes about its green initiatives."
  ],
  "headers": {
    "5": "A slap in the face (ID)"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Phone Repair Guru": "https://www.youtube.com/watch?v=LgU5G41-c2g&ab_channel=PhoneRepairGuru",
    "both the EU": "https://www.techradar.com/news/the-eu-wants-to-make-it-easier-to-fix-your-phone",
    "US government": "https://www.techradar.com/news/us-may-revise-right-to-repair-laws-for-phones-and-consoles-but-by-how-much",
    "an issue with 120Hz refresh rates on the new handsets": "https://www.techradar.com/news/the-best-iphone-13-pro-feature-isnt-working-properly-but-a-fix-is-coming-soon",
    "Apple Watch users having trouble unlocking their new iPhones": "https://www.techradar.com/news/one-of-the-apple-watchs-slickest-features-isnt-working-on-the-iphone-13-yet",
    "report": "https://redirect.viglink.com/?format=go&jsonp=vglnk_162561003379010&key=c1c7d488bb2df8a8b659d5d41634d304&libId=kqslzubt010023dg000DLnlyd3d3f&loc=https%3A%2F%2F9to5mac.com%2F2021%2F05%2F07%2Fftc-anti-competitive-repair-restrictions%2F&v=1&out=https%3A%2F%2Fwww.ftc.gov%2Fsystem%2Ffiles%2Fdocuments%2Freports%2Fnixing-fix-ftc-report-congress-repair-restrictions%2Fnixing_the_fix_report_final_5521_630pm-508_002.pdf&ref=https%3A%2F%2F9to5mac.com%2F2021%2F07%2F06%2Ffederal-right-to-repair-changes-and-iphone%2F&title=Anti-competitive%20repair%20restrictions%20FTC%20report%20calls%20out%20Apple-%209to5Mac&txt=The%20report%20says",
    "9to5Mac": "https://9to5mac.com/2021/05/07/ftc-anti-competitive-repair-restrictions/",
    "whatever noise Apple makes about its green initiatives": "https://www.techradar.com/news/apples-environmental-initiatives-just-how-green-is-the-big-fruit-of-tech"
  }
}