{
  "source": "https://www.techradar.com/news/favorite-ces-2021-gadgets-and-the-galaxy-s21-noise-cancelling-podcast-episode-47",
  "title": "Favorite CES 2021 gadgets and the Galaxy S21: Noise Cancelling podcast episode 47",
  "category": "phones",
  "updated": "2021-01-15T09:26:19Z",
  "author": "adam-vjestica",
  "summary": "Episode 47 of our tech podcast is here",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's show is presented by Gareth Beavis, TechRadar's Global Editor-in-Chief, and Sherri L. Smith, Editor-in-Chief of Laptop Mag.",
    "This week our guests are James Peckham, Mobile Editor at TechRadar, and John McCann, Deputy Editor at TechRadar, who join us (remotely, of course) to talk about the last seven days in tech.",
    "As usual, we're talking about a variety of topics from the world of tech. We begin the show with this week's Big Question: what tech features would you add to a smart mask?",
    "In the news section, we're talking about Samsung SmartTags, whether rollable screens are the future and the Samsung Galaxy S21. We also round up our best CES 2021 TVs, best CES 2021 cars and discuss which gadgets deserve to make it into our Gadget Hall of Fame.",
    "Meanwhile, this week's Unpopular Opinions is replaced by our big fat CES 2021 quiz. How many answers can you get right?",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 47:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/",
    "Tom's Guide": "https://www.tomsguide.com/",
    "Samsung SmartTags": "https://www.techradar.com/news/samsung-galaxy-smarttag-release-date-price-design-and-features",
    "rollable screens": "https://www.techradar.com/news/rollable-and-foldable-oled-tvs-are-the-future-heres-why",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6144664275431316000&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}