{
  "source": "https://www.techradar.com/news/my-dream-mirrorless-camera-runs-on-android-so-why-isnt-there-a-good-one-yet",
  "title": "My dream mirrorless camera runs on Android, so why isn't there a good one yet?",
  "category": "cameras",
  "updated": "2021-08-21T08:00:00Z",
  "author": "jason-parnell-brookes",
  "summary": "Opinion: It's time we saw a modern-day Samsung Galaxy Camera",
  "article": [
    "Mirrorless cameras have come a long way since their inception, with automatic eye focusing, incredible in-body image stabilization, and compact ergonomics. But there’s still one thing I’m frustrated with – their inability to move on from a method of editing and sharing images that's ancient compared to Android and iOS smartphones.",
    "Since the advent of digital cameras we’ve had the ability to develop our own photographs on computers (and now smart devices) with increasing flexibility. While many cameras do offer in-camera editing, it’s often clunky and limited.",
    "To get around this, I’ve been hoping a mirrorless camera running Android might come along to make the whole workflow, from snap to publishing, a doddle. But I'm still waiting. The new Yongnuo YN455 recently caught my eye and brought the concept tantalizingly close to fruition, but it's only available in China.",
    "Still, with power of modern silicon, stacked sensors and a mature Android OS, isn't it time we saw a spiritual successor to the Samsung Galaxy Camera and NX series from almost a decade ago? It feels like an oversight, but there are also good reasons why the Android-powered mirrorless camera could remain a pipe dream...",
    "Every time I try to edit and share photos from a mirrorless camera it feels like a tool from a bygone age.",
    "To process your shots you need to transfer the images over to a separate device, use dedicated image editing software to develop your photos, then prepare them for publishing online or in print, before exporting to those platforms (or uploading copies to online stores for printing).",
    "The China-based Yongnuo, which recently announced the YN455 successor to their YN450 Android camera, is the latest in a line of tech companies who've tinkered with integrating smartphone operating systems into their cameras. But none have quite nailed it yet.",
    "The first real splash was made by Samsung with its Galaxy Camera (above) in 2012. Its slogan was 'camera reborn'. And to be fair, it lived up to that billing on paper, combining the OS and slick interface of a smartphone with a larger image sensor and 21x optical zoom lens.",
    "It was by far the best-connected camera of its time, even offering 4G. And its interface still looks futuristic for a camera, which says a lot. But it was let down by poor image quality (this was pre-computational photography, after all) and stunted functionality, despite the boon of 8GB internal storage.",
    "Sadly, the Galaxy Camera concept, and more advanced NX series, fizzled out when Samsung decided to quit making cameras in 2017. But then, out of nowhere, Zeiss introduced the ZX1 in 2018.",
    "The ZX1 is an intriguing camera. Its 37.4MP full-frame sensor also captures 4K video and, thanks to the 512GB on-board storage, it can run Lightroom for in-camera editing and publishing straight to social media channels.",
    "Unfortunately, the ZX1 is also painfully expensive, running in at $6,000 / £5,399 (around AU$10,300). This is a bit steep compared to its rivals, when you consider the ZX1 has a fixed lens and a burst mode that can only hit a maximum of 3fps.",
    "With camera manufacturers seemingly uninterested in producing a successor to Samsung's previous riffs on the concept, it’s no surprise that independent companies have started to pop their heads in to fill the gap.",
    "The Alice Camera, an Indiegogo project that's due to ship in October, combines your smartphone with a Micro Four Thirds camera to produce an interesting hybrid for YouTubers, Twitch streams and TikTokkers.",
    "As the makers of Alice Camera told us in February,\"there's a whole generation of people who have grown up with smartphones in their pockets – and if you gave them a mirrorless camera they'd have no idea what to do with it\".",
    "The Alice Camera is not only trying to bridge the usability gap, it’s also introducing AI learning for smarter photo-taking by using Google’s edge TPU chip.",
    "The phone links via Wi-Fi to the Four Thirds camera and promises the best of both worlds (in theory) with smartphone-like app control and intelligent features, only with the heft and quality of a large image sensor and good optics. However, it’s still an unknown quantity and, as a first-gen product from a startup, there will almost certainly be rough edges.",
    "Which leads us to the latest contender: the Yongnuo YN455. Yongnuo is well-known for producing accessories that give photographers a cheaper alternative to main brand competitors. Its YN450 cracked into a new(ish) market in 2019 by combining smartphone and traditional camera functionalities. But it was a half-baked attempt with some odd quirks.",
    "The YN450 ran an old version of Android (7.1) that was two generations behind the smartphones of the time and also strangely combined a Four Thirds sensor with a Canon EF mount. Two years later, Yongnuo updated the YN450's EF mount with a Micro Four Thirds mount, which paralleled the image sensor inside, but it still didn't cut the mustard for critics.",
    "Still, on the face of it, the new YN455 looks like a promising front-runner in my quest for a practical Android camera. Cellular 4G and Wi-Fi link-up means sharing straight to Facebook, Instagram, TikTok and other social channels should be as simple as pressing a button. It can also shoot 20MP stills and 4K/30fps video, and offers dual USB-C ports.",
    "The rest of its specs list is promising, too. The YN455 is able to stream, which should make it ideal for vloggers and especially those working from home. It also contains 3.5mm jacks for both headphones and external microphones and features a large, 5-inch tilting touchscreen on the back. This should make it easy to review images and change settings without having to faff with physical buttons on the camera body.",
    "As you might expect from an Android-powered device, the internals are more reminiscent of a smartphone than a camera. An 8-core 2.2GHz Qualcomm Snapdragon powers the unit with 64GB of internal storage that is expandable to 256GB with the addition of a microSD card. It has built-in GPS and a large 4,400mAh battery to keep the device running for longer (it’s also fast charge compatible).",
    "Unfortunately, the slight hitch is that there’s been no news on when the YN455 will be released, or if it'll ever be available, outside of China. The search continues...",
    "Android OS isn't a panacea for cameras and would certainly bring some limitations. As a smartphone operating system, it's designed to be left in standby mode rather than quickly switched on and off, and battery life would no doubt be an issue. Also, as rudimentary and frustrating as camera interfaces often are, they are at least consistent and reliable – which isn't always the case with Android apps.",
    "But for me, the benefits would outweigh the drawbacks. It would also bring huge potential. In an ideal world, I’d like to see an Android camera that caters for photographers and social media content creators in three ways: intelligent image capture, seamless editing workflow options, and an ability to publish images without the need for a second device.",
    "It might work something like this: artificial intelligence is built right into the camera processor itself. It can identify people’s faces automatically for instant autofocusing or even make the decision to blur them out for privacy. For example, based on factors like if they’ve uploaded photos of their face to a universal camera database.",
    "That way, anyone who wants to opt out of having their photo taken in public will keep their privacy (especially important for the vulnerable or young people). But more realistically, it might also work by applying enhancing filters to portraits at the point of source without the need to do it later (working similar to raw files, where you can just undo it later when editing).",
    "Each image editing software company would have their own apps available on the built-in store, so you can choose between Adobe Lightroom, Gimp, Luminar AI, Capture One and more to seamlessly edit your shots after you’ve taken them. The user interface would pop up as an option if you press the ‘info or ‘I’ button on the camera, much like the overlays for rule of third grids and picture information do now. From here you could add custom presets, play with AI face-editing and make all your normal adjustments for exposure and lighting.",
    "Export options would come not just for social media platforms, but give you the ability to email or even print your images. Printing could be linked to an existing printing company, and after a quick sign-up the images can automatically print, charge your card, and deliver photos to you with the press of a button.",
    "Or, the camera manufacturers could place printing machines in local shops (like coffee shops and ATMs do now) for you to go and collect them from. The machines might work the same as delivery companies currently operate, allowing you to scan a QR code for on-the-spot printing, no cash needed as it’s already synchronized with your account.",
    "This is certainly asking for a big leap from where we are now. But it's also much more realistic with today's tech than it would have been in the Samsung Galaxy Camera's era.",
    "The tantalizing prospect is combining the intelligence and apps of smartphones with the professional optics and sensors of modern mirrorless cameras. Yet it seems that no manufacturer, or one with global ambitions at least, is taking this phone-camera hybrid concept seriously.",
    "To some extent, this makes sense. We saw how slowly Canon, Nikon, and the other giants took up mirrorless cameras after Sony showed them all how it was done years in advance. That pace of change wouldn't have happened without Sony shaking things up, and there's no Sony equivalent right now for my dream Android camera. It's also distinctly possible that, with smartphones now good enough for most people, the potential market is too niche.",
    "Realistically, it’s probably going to be a long time before the camera giants adopt this approach for cameras. You only have to look at the companion apps for most manufacturers to see how low a priority it is.",
    "But with more crowd-funded campaigns like Alice Camera, and innovation from companies like Yongnuo, we might yet inch towards a mirrorless camera that makes them sit up and take notice. I'll certainly be one of the early adopters. But until then, we'll need to keep our cameras around our necks and our smartphones in our pockets if we want the best of both worlds."
  ],
  "headers": {
    "4": "Living in the past",
    "10": "Signs of life",
    "17": "A new contender",
    "23": "My dream camera",
    "30": "Android dreams"
  },
  "links": {
    "makers of Alice Camera told us in February": "https://www.techradar.com/news/inside-the-alice-camera-why-its-maker-thinks-its-the-future-of-mirrorless-cameras"
  }
}