{
  "source": "https://www.techradar.com/news/twitter-tackles-harmful-language-with-new-warning-feature",
  "title": "Twitter tackles harmful language with new warning feature",
  "category": "computing",
  "updated": "2021-05-06T01:01:23Z",
  "author": "harry-domanski",
  "summary": "And rolls out larger image previews on iOS and Android app",
  "article": [
    "Twitter has today begun rolling out a new feature that it hopes will prevent hostility on the social platform by warning users to reconsider when they are about to post a reply containing \"potentially harmful or offensive\" language.",
    "The feature was trialled around a year ago, but a company blog post has revealed that the feature will be rolling out to iOS and Android app users from today, starting with accounts that have English-language settings.",
    "If a Twitter user types out a reply with any of the language that the company has deemed harmful, they'll see a warning message asking \"Want to review this before tweeting? We're asking people to review replies with potentially harmful or offensive language.\"",
    "Below the message, users will be given the option to delete, edit or continue tweeting their reply.",
    "Throughout the testing process, Twitter has refined its detection algorithm in order to \"capture the nuance in many conversations and [...] differentiate between potentially offensive language, sarcasm, and friendly banter.\"",
    "The system also takes into consideration the frequency of interaction between the user and replier in question, acknowledging that they may \"have a better understanding of preferred tone of communication\". It also should be able to detect when \"language may be reclaimed by underrepresented communities and used in non-harmful ways\".",
    "This is far from the first time that the micro-blogging site has attempted to curb hostility on its platform, with efforts to ban racism and other forms of hate speech, and introduce protection methods (such as a 'safety mode') for users that are being targeted.",
    "Like all successful social media platforms, there's often a debate over where the responsibility lies in censoring, controlling and moderating the millions of users that frequent it – after all, the site itself isn't responsible for the hostility, but rather the people that use it.",
    "With that said, the general consensus among both governments is that the tech companies that run such platforms need to have some degree of accountability for moderating their users' interactions due to the sheer ubiquity of social media. Among the larger of the companies, Twitter has seemingly been one of the more conscious of this responsibility.",
    "Another, unrelated, announcement from Twitter today sees the company starting to roll out support for larger, uncropped images on both iOS and Android.",
    "While previously, images would be viewed as a 16:9 crop of the original file, now the mobile app will be able to view both 2:1 and 3:4 aspect ratios as previews, without having to expand them."
  ],
  "headers": {
    "9": "Uncropped Twitter images"
  },
  "links": {
    "company blog post": "https://blog.twitter.com/en_us/topics/product/2021/tweeting-with-consideration.html",
    "ban racism and other forms of hate speech": "https://www.techradar.com/news/twitter-introduces-new-guidelines-to-combat-hate-speech-and-racism",
    "such as a 'safety mode'": "https://www.techradar.com/news/twitter-to-come-up-with-much-needed-anti-troll-feature"
  }
}