{
  "source": "https://www.techradar.com/news/lenovo-unveils-suave-new-range-of-thinkbook-laptops",
  "title": "Lenovo unveils suave new range of ThinkBook laptops",
  "category": "components",
  "updated": "2021-01-16T03:27:26Z",
  "author": "anthony-spadafora",
  "summary": "Stylish and refined laptops for SMBs",
  "article": [
    "Lenovo has unveiled a number of new business laptops at CES 2021 that have been built specifically for mobile professionals working from home or at the office.",
    "The company's new range of ThinkBook laptops includes the new ThinkBook Plus Gen 2 i, ThinkBook 13x i, ThinkBook 14p Gen 2 and ThinkBook 16p Gen 2. These new devices are built using aluminum materials with a distinctive dual tone finish and they integrate stat-of-the-art technologies such as Dolby Vision HDR, Dolby Atmos support on select models and TÜV Rheinland Eyesafe Display Certification to enhance user experiences.",
    "The new ThinkBook Plus Gen 2 features an improved e-Ink display with a larger 12-inch usable area and a resolution of 2560X1600. The laptop also features a new 16:10 low blue light display with a virtually edge-to-edge screen experience.",
    "Taking notes on the e-Ink display located on the ThinkBook Plus Gen 2's lid is now easier than it was with the previous model as Lenovo has improved performance with a better refresh rate. At the same time, the company has rethought and redesigned the device's e-Ink User Interface to provide more intuitive access to to frequently used information and productivity apps can now be run on the ThinkBook Plus Gen 2 without having to open the lid.",
    "Lenovo also introduced its new compact ThinkBook 13x i which is available in either Storm Gray or Cloud Gray. The device is one of the slimmest 13-inch business laptops available at only 12.9mm thin and weighing less than 1.2kg.",
    "Besides the e-Ink display, the ThinkBook 13x i shares all of the ThinkBook Plus Gen 2 i's features including Dolby Vision, Dolby Atmos and Thunderbolt 4 ports. The laptop is powered by an 11th Gen Intel Core Processor and it also has Wi-Fi 6 and a 53-watt hour battery so that users can work from anywhere.",
    "The ThinkBook 14p and 16p are powered by the latest AMD Ryzen 9 5000 H Series Mobile Processors for maximum performance. These laptops are ideal for video conferencing as they can be outfitted with an optional Full HD webcam protected by a ThinkShutter physical cover while an AI-based noise cancellation algorithm suppresses ambient noise.",
    "Lenovo's ThinkBook 14p is a thin and light laptop that can be configured with up to a 14-inch 2.8k OLED display with VESA Display HDR True Black standard. Optional next generation Nvidia GeForce RTX discrete graphics are also available to complement AMD Ryzen processing power to deliver a high-performance laptop with a 16-inch 2560x1600 display.",
    "All of Lenovo's new ThinkBook models will be available in the first quarter of this year and the ThinkBook Plus Gen 2 i starts at $1549 (£1139), the ThinkBook 13x i starts at $1199 (£875), the ThinkBook 14p starts at $849 (£622) and the ThinkBook 16p starts at $1299 (£889)."
  ],
  "headers": {
    "4": "Stylish and refined"
  },
  "links": {
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights/news/ces-2021-highlights",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "previous model": "https://www.techradar.com/news/lenovos-thinkbook-plus-has-an-e-ink-touchscreen-built-into-the-lid",
    "productivity apps": "https://www.techradar.com/best/best-productivity-apps",
    "11th Gen Intel Core Processor": "https://www.techradar.com/news/intel-11th-gen-cpus-might-not-all-be-based-on-intels-latest-architecture",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "ThinkShutter": "https://www.techradar.com/news/lenovo-launches-thinnest-thinkpad-ever"
  }
}