{
  "source": "https://www.techradar.com/news/hackers-accuse-robinhood-of-concealing-theft-of-id-cards",
  "title": "Hackers accuse Robinhood of concealing theft of ID cards",
  "category": "computing",
  "updated": "2021-11-12T14:20:13Z",
  "author": "mayank-sharma",
  "summary": "Cyber criminals can do lots of damage just with names and email addresses, suggest researchers",
  "article": [
    "Cybersecurity experts monitoring the dark web report that hackers who stole the personal data of millions of Robinhood customers also accuse the platform of lying and intentionally omitting the fact that the attack had exposed the ID cards of some members as well.",
    "Earlier this week, the popular trading platform revealed a data breach had leaked details of more than seven million customers.",
    "However, privacy watchdog Privacy Affairs reports that writing on a popular hacker forum, the alleged hackers accused Robinhood of downplaying the severity of the breach.",
    "“At this time, we understand that the unauthorized party obtained a list of email addresses for approximately five million people, and full names for a different group of approximately two million people,” wrote Robinhood in a blog post disclosing the breach.",
    "While Robinhood admitted that it gathers sensitive information about its users as part of the regulatory requirements, including social security numbers and financial information, it claimed this data wasn’t leaked in the breach.",
    "However, the alleged hackers insisted that they had managed to get their hands on customer ID cards from SendSafely, a file transfer system used by the platform during customers’ Know Your Customer (KYC) verification process.",
    "When Privacy Affairs confronted Robinhood with the hacker’s claims, the platform admitted that it had indeed lost the ID cards of a handful of users, something Privacy Affairs notes that the platform had not shared in its original post.",
    "“As we disclosed on November 8, we experienced a data security incident and a subset of approximately 10 customers had more extensive personal information and account details revealed. These more extensive account details included identification images for some of those 10 people,” a Robinhood spokesperson told Privacy Affairs over email.",
    "Even without the ID cards, cybersecurity experts TechRadar Pro spoke to believed that even the supposed non-sensitive data, names and email address, could pose a serious threat to the concerned individuals.",
    "Marcus Guidry, senior cyber threat intelligence analyst at security firm Pondurance says cyber criminals can collect the other missing pieces of information with the help of dossiers already compiled by marketing firms, and readily available in underground marketplaces on the dark web.",
    "“Worse, they can easily purchase stolen credentials from leak sites owned by initial access brokers (IABs). If a threat actor already has your email, then chances are very high that the same email address already has a presence on at least one or more social media sites,” says Guidry.",
    "He uses this opportunity to stress the importance of not reusing passwords across multiple sites, and enabling two-factor authentication (2FA) wherever possible.",
    "Make sure you stay protected against inadvertent data leaks with these best identity theft protection services and use security keys to add another layer of security by protecting your accounts"
  ],
  "headers": {
    "4": "More than meets the eye",
    "8": "A leak is a leak"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Robinhood": "https://www.techradar.com/reviews/robinhood",
    "revealed": "https://www.techradar.com/news/stock-trading-app-robinhood-hit-by-mega-data-breach",
    "reports": "https://www.privacyaffairs.com/robinhood-data-breach/",
    "wrote": "https://robinhood.c3me6x.net/c/221109/662405/10402?subId1=trd-us-1200486957337078300&sharedId=trd-in&u=https%3A%2F%2Fblog.robinhood.com%2Fnews%2F2021%2F11%2F8%2Fdata-security-incident",
    "": "https://robinhood.c3me6x.net/c/221109/662405/10402?subId1=trd-us-1406179065980297500&sharedId=trd-in&u=https%3A%2F%2Fblog.robinhood.com%2Fnews%2F2021%2F11%2F8%2Fdata-security-incident",
    "file transfer system": "https://www.techradar.com/best/best-ways-to-transfer-files-online",
    "not reusing passwords": "https://www.techradar.com/news/so-many-of-us-are-still-using-a-single-password-across-all-our-accounts",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "best identity theft protection services": "https://www.techradar.com/best/best-identity-theft-protection",
    "security keys": "https://www.techradar.com/best/best-security-key"
  }
}