{
  "source": "https://www.techradar.com/news/everything-the-new-apple-tv-4k-could-have-done-but-didnt",
  "title": "New Apple TV hopes and dreams: everything we're still waiting for",
  "category": "televisions",
  "updated": "2021-07-07T10:49:59Z",
  "author": "henry-st-leger",
  "summary": "5 things the new Apple TV 4K still doesn't do",
  "article": [
    "The new Apple TV 4K 2021 that launched earlier this year finally granted our wish – for a new Apple TV streamer after four years of inaction from the technology giant.",
    "But the new Apple streaming device didn’t quite match our hopes and dreams, with an iterative model that showed a company largely content to stick with what had come before. Apple did see fit to fix the biggest problem with its streaming box range – the Siri remote – and add some neat new features, like HFR support and a way to calibrate TV color output using an iPhone.",
    "But the core experience is largely the same, and we can’t help but think that Apple could have done more with its streaming range.",
    "There’s a reason that the late Steve Jobs called Apple TV a “hobby” for the company, and that reputation of a product line that isn’t taken as seriously as the company’s bread-and-butter iPhones and Macbooks is still hard to shake off.",
    "With that in mind, we’ve brought together five things we would love to see in a new Apple TV model, and which we’re disappointed not to have already seen in action.",
    "Alas, what might have been. In the runup to the Apple event at which the new Apple TV 4K 2021 was announced, rumors surfaced of a combined set-top box and smart speaker that melded together the streaming functionality of the Apple TV and the audio capabilities of the Apple HomePod.",
    "While Amazon would still have beat Apple to the punch – the Fire TV Cube functions as both a streamer and an Alexa speaker – this kind of reinvention of the Apple TV was (and is) sorely needed.",
    "Things get tricky when considering that the Apple HomePod was discontinued earlier this year, after failing to gain much traction – or at least as much as the smaller, cheaper HomePod Mini, which Apple is now focusing its smart speaker efforts on. But porting the speaker capability of either the disappearing HomePod (let’s use those leftover parts, eh?) or the emerging HomePod Mini over into the Apple TV hardware would have been pretty seismic. You can connect HomePod Mini speakers to the Apple TV, though.",
    "Apple has been angling more for gaming audiences in recent times, with its Apple Arcade game subscription service, and an upgraded processor in the Apple TV 4K 2021 that should help games run more smoothly. PS5 and Xbox Series X controllers also now work on Apple TV devices (not just the latest model) too.",
    "Unfortunately, Apple has continued to drag its feet around app support for other gaming applications. You can’t download either Xbox Game Pass or Google Stadia as native apps, with only the option to access through an internet browser, making it a fiddly workaround for accessing your favorite games.",
    "The problem is that Apple views them as app stores in themselves, given the number of playable games in each one. That makes them competitors for the App Store – where Apple would rather you buy games directly, so it can take a cut of the payment.",
    "There’s more Apple could do to make lives easier for the gamers it wants to attract, and something as simple as improved app support would go a very long way. This is more of an Apple problem than an Apple TV problem, of course, but it means that the streaming hardware simply isn’t the gaming hub that Apple would love it to be.",
    "Apple’s walled garden means that the Apple TV 4K doesn’t play as nicely with Android devices as with iPhones – and while you can still setup and use the streamer fine without an Apple smartphone, you will be locked out of some of its best features, such as AirPlay and color balance adjustment.",
    "We don’t expect this to change even in a successive model, given Apple wants to keep its users on Apple-owned devices and services as much as possible, but it does dampen the experience of an Apple TV 4K for those making do with a OnePlus, Google, or Samsung smartphone.",
    "What’s most striking about the tvOS platform is how little it attempts to act as a smart TV interface. tvOS is an Apple product first and foremost, and its home screen pushes Apple services like Apple Music or Apple Fitness ahead of streaming apps like Netflix, Amazon Prime Video, or Disney Plus.",
    "These apps can be reorganised as you wish, but it’s not an intuitive experience for first-time users, especially when you compare it to the TV platforms that put streaming apps front and center. Roku or MyHomeScreen will ask what your key apps are before taking you to the home screen, for one, ensuring you have the important ones from the offset.",
    "This is the kicker, really. Anyone with an Apple TV 4K (2017) really has every reason to opt for the latest model, despite a four-year gap between them. That’s pretty much inconceivable for any other Apple product – can you imagine if a 2021 flagship iPhone had the same camera, battery life and body as the iPhone 8?",
    "The new Siri remote is the main change, but given that it’s available as an individual purchase, there’s still little reason to opt for the whole 2021 package, and that’s a major disappointment after waiting for so long for a meaningful Apple TV upgrade.",
    "With a new model having come out this year, though, and a four-year gap since its predecessor, it's unlikely we'll get the Apple TV reinvention we're after for a good while yet. Apple TV 2025, anyone?"
  ],
  "headers": {
    "5": "1. Built-in HomePod speaker",
    "8": "2. Xbox Game Pass and Stadia app support",
    "12": "3. Android phone support",
    "14": "4. An interface for everyone",
    "16": "5. A reason to upgrade"
  },
  "links": {
    "Apple TV 4K 2021": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "the biggest problem with its streaming box range": "https://www.techradar.com/news/the-new-apple-tv-4k-finally-fixes-its-biggest-problem",
    "HFR": "https://www.techradar.com/news/what-is-hfr",
    "iPhones": "https://www.techradar.com/news/best-iphone",
    "Macbooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "rumors surfaced": "https://www.techradar.com/news/new-apple-tv-could-be-a-set-top-box-speaker-and-smart-display-combo",
    "set-top box": "https://www.techradar.com/news/best-set-top-box",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "Fire TV Cube": "https://www.techradar.com/reviews/amazon-fire-tv-cube-2nd-generation",
    "HomePod Mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Apple smartphone": "https://www.techradar.com/news/best-iphone",
    "Samsung smartphone": "https://www.techradar.com/news/best-samsung-phones",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Apple Fitness": "https://www.techradar.com/news/apple-fitness-plus",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review"
  }
}