{
  "source": "https://www.techradar.com/news/bitcoin-mining-difficulty-rises-to-all-time-high-as-powerful-new-hardware-joins-the-party",
  "title": "Bitcoin mining to become even more difficult as powerful new hardware joins the party",
  "category": "computing",
  "updated": "2021-04-03T04:34:35Z",
  "author": "joel-khalili",
  "summary": "New mining hardware is pushing up the Bitcoin mining difficulty",
  "article": [
    "Bitcoin mining now demands more computational power than ever before, with mining difficulty on the network reaching an all-time high after the most recent recalibration.",
    "Mining difficulty, which ebbs and flows in line with shifts in the total hashrate, has now increased to 23.1 trillion, a sizable jump of circa 6%.",
    "This is the second largest increase in difficulty since the turn of the year, and the fifth time mining difficulty has increased in the last six recalibration periods.",
    "To the uninitiated, increasing the difficulty of mining Bitcoin might sound counterproductive, but the mechanism plays an important role in regulating the network, ensuring that blocks are processed at a stable rate and making the network more resilient to attack.",
    "Mining difficulty is automatically recalibrated after every 2016 blocks processed, which occurs roughly every two weeks. The consistency with which mining difficulty has increased this year is a reflection of the current ferocity of competition among miners.",
    "With the surge in the price of Bitcoin in recent months has also come a new enthusiasm for mining, which is now more lucrative than ever. In March, Bitcoin miners took in a record $1.5 billion in revenue, a 373% increase on September last year, before the start of the rally.",
    "As mining operations scale up, in an effort to capitalize on the increase in the value of Bitcoin, the mining difficulty rises in tandem.",
    "According to Whit Gibbs, CEO at mining firm Compass, the significant rise in mining difficulty can be attributed to the large number of new ASIC machines coming online as supply chain issues are resolved.",
    "“Today’s moderately large difficulty increase is not surprising, and I expect it’s only a taste of what will come later in this year and into 2022, as deployed machine shipments start arriving and being deployed,” he said.",
    "“The pending flood of hashrate about to enter the market will only continue pushing Bitcoin’s mining difficulty higher, which should track with Bitcoin’s price.”",
    "While the prospect of yet further growth in the price of Bitcoin will have many people licking their lips, an increase in mining difficulty will do nothing to alleviate concerns about the environmental impact of Bitcoin mining. With more computational power required to compete for cryptocurrency rewards, yet more energy will need to be funnelled into the network, which already uses up more power than the country of Sweden.",
    "Via CoinDesk"
  ],
  "headers": {
    "3": "Bitcoin mining difficulty"
  },
  "links": {
    "Bitcoin mining": "https://www.techradar.com/best/mining-rigs",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "uses up more power than the country of Sweden": "https://www.techradar.com/news/the-first-ever-green-bitcoin-is-about-to-be-minted",
    "CoinDesk": "https://www.coindesk.com/bitcoin-mining-difficulty"
  }
}