{
  "source": "https://www.techradar.com/news/this-new-ticwatch-smartwatch-is-a-top-apple-watch-7-rival-but-it-has-a-dumb-name",
  "title": "This new TicWatch smartwatch is a top Apple Watch 7 rival, but it has a dumb name",
  "category": "wearables",
  "updated": "2021-10-15T03:12:19Z",
  "author": "tom-bedford",
  "summary": "The Mobvoi TicWatch Pro 3 Ultra GPS (yes, that's really it)",
  "article": [
    "It's rare that we at TechRadar cover a product with a name so long we can't even put it in the headline, but here we go: the Mobvoi TicWatch Pro 3 Ultra GPS has just been unveiled, and it's a new top-end smartwatch.",
    "Don't Pro and Ultra mean the same thing? Why is the GPS necessary in the name? Why doesn't Mobvoi like the number four?",
    "This is a premium smartwatch that costs you $299.99 / £289.99 / AU$399.99, and it's technically an upgrade on the TicWatch Pro 3 GPS. At that price it slightly undercuts the Apple Watch 7, and as a Wear OS smartwatch it has lots of similar features.",
    "The watch has a 1.4-inch AMOLED screen, a Qualcomm Snapdragon Wear 4100 chipset, 8GB storage, 1GB RAM and an NFC chip. It's a Wear OS smartwatch so it uses Google's software, but brings a few Mobvoi extras like specific health apps and workout modes.",
    "Of course, it also has built-in GPS - that name would be pretty misleading otherwise.",
    "Mobvoi hasn't stated whether this watch uses Wear OS 3.0, as in the Samsung Galaxy Watch 4, or the second-gen version of it which some companies still use - we'll have to find it out when we test the device.",
    "The smartwatch is available right now from Mobvoi's website - we'll be testing it out soon to bring you our full thoughts on it.",
    "At the same time as unveiling the TicWatch Pro 3 Ultra GPS, Mobvoi also showed off the Mobvoi TicWatch Pro 3 Ultra with 4G. What's the difference with this? Well partly the price, as it costs £329.99 (roughly $450 / AU$610), and partly its connectivity, as it supports a 4G connection.",
    "The lack of a US price implies the watch isn't coming to the US, though it could just be that a cost hasn't been confirmed yet. In the UK and Europe, the device will be available to buy from November.",
    "LTE connectivity is somewhat of a niche feature, as it's only important if you don't plan on carrying your smartphone around with you all the time. So most people won't need this second smartwatch, but if you think you'd appreciate phone-less watch use, it could be worth waiting for.",
    "It's unlikely, but technically possible, that the Black Friday smartwatch deals could cut the price of these two new devices - almost definitely not by much, but perhaps by enough to make them even more tempting."
  ],
  "headers": {
    "7": "Analysis: A second smartwatch coming"
  },
  "links": {
    "TicWatch Pro 3 GPS": "https://www.techradar.com/news/ticwatch-pro-3-india",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Wear OS smartwatch": "https://www.techradar.com/news/best-wear-os-watch",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Mobvoi's website": "https://mobvoi.m4ibck.net/c/221109/733475/10848?subId1=trd-us-4859042142539303000&sharedId=trd-us&u=https%3A%2F%2Fwww.mobvoi.com%2Fus%2F",
    "Black Friday smartwatch deals": "https://www.techradar.com/news/black-friday-smartwatch-deals"
  }
}