{
  "source": "https://www.techradar.com/news/the-global-chip-shortage-could-finally-be-coming-to-an-end",
  "title": "The global chip shortage could finally be coming to an end",
  "category": "computing",
  "updated": "2021-04-06T13:09:48Z",
  "author": "mayank-sharma",
  "summary": "Acer’s comments are in stark contrast to that of Micron’s",
  "article": [
    "One of the world’s leading PC vendors believes the global shortage of chips is starting to ease and will continue to improve in the second quarter of the year.",
    "The reassurance comes from Andrew Hou, Acer president for Pan-Asia Pacific Operations, during an interaction with the press, as reported by Reuters.",
    "Several factors led to the shortage of chips, which reportedly first surfaced in the fourth quarter of last year. Manufacturing unit shutdowns owing to the Covid-19 pandemic is largely blamed as the trigger for the crisis that rapidly depleted vendors’ inventories.",
    "Hou said suppliers however quickly “jumped into action” to address the situation. He added that sales in his region, which excludes China, are very healthy, as companies and governments are placing orders for laptops in bulk to help sustain the remote-first work-from-home environments.",
    "However, Hou didn’t address the impact of the unprecedented drought in Taiwan, which accounts for a majority of world’s chip production.",
    "The various measures imposed by the government to check water usage, including curbing the supply of water to several industrial areas, has had a dramatic impact on the silicon fabrication units.",
    "In fact, Hou’s comments are in stark contrast to that of Micron’s CEO Sanjay Mehrotra, who, in an earnings call last week, said he doesn’t see the situation improving anytime soon.",
    "True, Mehrotra was speaking from the point of view of RAM, which accounts for over 70% of Micron’s revenue.",
    "But as a critical component in virtually all computers, a shortage of RAM will have a cascading effect to drive up prices for laptops and workstations, putting his views diametrically opposite to that of Acer’s Hou.",
    "Via: Reuters"
  ],
  "headers": {
    "4": "Is it really over?"
  },
  "links": {
    "Acer": "https://www.techradar.com/news/the-best-acer-laptops",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "Micron": "https://www.techradar.com/reviews/micron-1tb-c200-microsd-uhs-i-card",
    "doesn’t see the situation improving": "https://www.techradar.com/news/industry-chief-warns-severe-dram-shortage-wont-be-ending-any-time-soon",
    "RAM": "https://www.techradar.com/news/best-ram",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "Reuters": "https://www.reuters.com/article/us-taiwan-acer/taiwans-acer-sees-global-chip-shortage-gradually-easing-idUSKBN2BT0J1"
  }
}