{
  "source": "https://www.techradar.com/news/nvidia-rtx-3060-gpu-could-still-come-in-a-cheaper-version-with-6gb-vram",
  "title": "Nvidia RTX 3060 GPU could still come in a cheaper version with 6GB VRAM",
  "category": "computing",
  "updated": "2021-02-23T11:10:13Z",
  "author": "darren-allan",
  "summary": "Potentially more affordable variant spotted in South Korean filing",
  "article": [
    "Nvidia’s GeForce RTX 3060 graphics card arrives in just a couple of days on February 25 complete with 12GB of GDDR6 VRAM, but there may still be a version with half that video memory coming as well, going by a filing in South Korea from graphics card maker Palit.",
    "Previous buzz from the GPU grapevine in the past has suggested the existence of an RTX 3060 with 6GB of video RAM, and that quantity fits with the card’s 192-bit memory interface – Nvidia essentially has a choice of using either a 12GB or 6GB configuration.",
    "Because Nvidia officially confirmed it was going with the former, and there’s been no mention of a 6GB variant, it was assumed that this smaller loadout had been abandoned.",
    "However, as spotted by @harukaze5719 on Twitter (via VideoCardz), that might not be the case – with the emphasis on might here – as Palit has just filed both 12GB and 6GB variants of the RTX 3060 with the South Korean National Radio Research Agency.",
    "Specifically, the Palit RTX 3060 Dual card has two 12GB and 6GB versions (standard and OC or overclocked models of both).",
    "While this could be some kind of blanket filing or error, it could equally point to the launch of a 6GB version of the RTX 3060 in the future, perhaps as a second prong of attack on the mid-range GPU front for when AMD unleashes its Radeon RX 6700 XT (rumor has it that this could happen mid-March). Obviously bear in mind that all this is pure speculation, of course.",
    "We’ve said before that 12GB looks like overkill for the RTX 3060 – particularly when the 3060 Ti has 8GB of VRAM, albeit running at a faster speed (with a 256-bit memory interface) – so a 6GB version does make some sense. Time will tell if this is what Nvidia has planned.",
    "If the 6GB spin does become a reality, we can hope that it’ll at least make the RTX 3060 pricing look a bit more like a mid-range GPU, because from what we’re hearing about the imminent 12GB model, the price is going to be seriously hiked up above Nvidia’s recommended price tag by retailers (let alone the scalpers who’ll doubtless be vying for the cards as well as genuine punters)."
  ],
  "headers": {
    "5": "Second prong?"
  },
  "links": {
    "Nvidia’s GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "arrives in just a couple of days": "https://www.techradar.com/news/nvidia-rtx-3060-full-specs-confirmed-ahead-of-the-gpus-imminent-launch",
    "@harukaze5719": "https://twitter.com/harukaze5719/status/1364130381138591744",
    "VideoCardz": "https://videocardz.com/newz/nvidia-geforce-rtx-3060-6gb-reappears-after-2-months",
    "rumor has it that this could happen mid-March": "https://www.techradar.com/news/amd-rx-6700-xt-could-arrive-in-march-to-challenge-nvidias-mid-range-gpus",
    "12GB looks like overkill for the RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "seriously hiked up above Nvidia’s recommended price tag": "https://www.techradar.com/news/nvidia-rtx-3060-gpu-could-somehow-end-up-pricier-than-the-rtx-3060-ti"
  }
}