{
  "source": "https://www.techradar.com/news/maquette-is-a-whimsical-romance-to-please-rom-com-and-puzzle-fans",
  "title": "Maquette is a whimsical romance to please rom-com and puzzle fans",
  "category": "gaming",
  "updated": "2021-01-16T12:00:45Z",
  "author": "vic-hood",
  "summary": "Love is quite the puzzle",
  "article": [
    "A low-key coffee in a corner cafe, a stolen first kiss at a house party, or even just a walk around a fair – the early days of a blossoming romance are some of the most whimsical. In Maquette, you get to be privy to each scene of the love story, unlocked one puzzle at a time.",
    "Maquette, a first-person narrative puzzler from Annapurna, explores the relationship of Kenzie and Michael through a series of flashbacks and memories, starting with their meet-cute in a coffee shop where they scribble together in a sketchbook. But this isn’t a simple romance tale. Far from it. Instead, their story is told through the exploration of the game’s recursive puzzle world. With each step of progression and solved puzzle unearthing further memories that begin to piece together their relationship – and perhaps why it’s being told in the past tense.",
    "Maquette manages to blend these unique puzzles and its romantic tale beautifully, resulting in a game appeals to both your head and your heart.",
    "Maquette is, first and foremost, a recursive puzzle game. But what does that actually mean? Back when the game was first revealed in early 2020, the recursive puzzle element sounded needlessly complicated. And the explanation of worlds within worlds just confused me further. But, having had some time to get to grips with the game myself, it isn’t actually as confusing as it sounds.",
    "Essentially, Maquette’s ‘normal size’ world is the standard that you'll return to. There you'll find a central dome that houses a doll house-like replication of the normal-size world, with every element recreated in miniature. This is key to your puzzle-solving, as most of the puzzles you’ll be greeted with will require you to use the miniature world in some way.",
    "Here's where things get slightly more complicated. Objects that are in the normal-size world appear in the small world, and they're linked – so if you move, say, a block in the normal-size world, then a smaller version of it will also move in the small world. Likewise, if you move an object in the small world then it will move the normal sized equivalent of that object in the real world.",
    "You can also take objects from the normal-size world and place them in the small world, creating an even bigger version of that object in the normal world. It takes some getting used to, and is more confusing on paper than actually using the mechanic in the game – especially since there’s an even bigger world outside the normal-size world… but that’s another story.",
    "In one instance, I had to cross a gap in a bridge in the normal-size world. Remembering that I still had a key that I used earlier, I went back and picked it up and popped it into the mini-world – laying it straight across the gap. When I walked over to the gap in the normal-size world, a huge key was now acting as the bridge I needed.",
    "It's a bit easier to see in practice, like here in the game's trailer:",
    "Trust me, it sounds more complex than it is. But that’s not to say that the puzzles in Maquette aren’t challengin,g and there were times where I was completely stumped. These are purposely not “softball puzzles”, according to developer Graceful Decay’s Hanford LeMoore. And, as frustrating as some puzzles can be, the “ah ha!” moment when you finally solve them almost makes up for it.",
    "The dome, which acts as a kind of central hub for the game, has several offshoots to new sections. Most of these remain locked off until you progress enough that you can unlock them and discover what secrets they hold. But you roughly know when you’re headed in the right direction, or on the right path to solving the puzzle, as more of Kenzi and Michael’s story text begins to appear, in some cases providing subtle clues as to where you should be heading next.",
    "While Maquette is puzzle-forward, that’s not to say that its story gets lost in all of this. In fact, I found myself more determined to solve the puzzles in an effort to unearth more about their story.",
    "Kenzi and Michael’s story isn’t thrown in your face. We never see the characters themselves, but the flashbacks of voices (illustrated in sketches) and the gradual unrolling of their story through text appearing in the world gives you a sense of those characters. They’re young and in love. Awkward and ambitious. It’s quietly authentic.",
    "Even the world of Maquette is enough to melt the heart of the cynical – and is wonderfully indulgent for hopeless romantics such as myself. The world is made up of locations tied to memories the pair seem to have shared: a funfair they visited once, a house they once attended a party in. But the whole world looks like it’s been put through some sort of Instagram filter. When a big progression milestone is met, a (what appears to be original) Indie pop tune plays, making it feel like you’re almost in a rose-colored version of how someone in the throes of romance would see their relationship – and it's lovely.",
    "You get a sense that it’s all a bit too perfect. And while I only played a few chapters of Maquette (and can’t reveal too much of what I did play), Graceful Decay has already revealed that the game will explore the “scales of everyday problems in a modern-day love story, where sometimes the smallest of issues can become insurmountable obstacles”. No doubt that means those puzzles are going to get a whole lot harder...",
    "Maquette releases in 2021 for PlayStation 4, PlayStation 5 and PC."
  ],
  "headers": {
    "3": "It's...complicated",
    "11": "Rose-colored romance"
  },
  "links": {}
}