{
  "source": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
  "title": "Apple event recap: new iPad Pro M1, iMac 2021, AirTags... and new Ted Lasso",
  "category": "tablets",
  "updated": "2021-07-15T13:56:49Z",
  "author": "gareth-beavis",
  "summary": "An iPad with the new M1 chipset was the star of the show",
  "article": [
    "Apple's Spring Loaded event was its first big launch event of 2021, and it didn't disappoint: we saw the AirTag tracker finally appear, alongside a new iPad Pro featuring Apple's M1 chip, and a major overhaul of the iMac desktop computer.",
    "We also saw a new and improved Apple TV 4K, a new color for the iPhone 12, and were treated to a sneak peek of season 2 of Apple TV Plus show Ted Lasso.",
    "The new iPad Pro getting the M1 chipset – the engine that previously powered the new, impressive, range of Macbooks – is the real talking point. It means a huge amount of power, an internal architecture to rival the MacBook range and it's even got a new screen.",
    "The Mini LED display, which uses 10,000 LEDs compared to the 72 on the previous iPad, will only be coming to the 12.9-inch model. But that extra brightness and color reproduction is going to be an alluring combination for many – one of the TechRadar number has already tried to buy one at $1,099 but it looks out of stock.",
    "The front-facing camera also comes with a wide-angle lens that can track your movement around the area – meaning you'll always stay front and center. That's probably why the feature is called Center Stage, and it will work with multiple people.",
    "The new AirTags are finally here, having been much-vaunted for months / years – and it would seem as though Apple's got them right.",
    "At $29 / £29 / AU$45 for one or $99 / £99 / AU$149 for four, with free engraving too, if you're at all forgetful you'll really enjoy having these tags spottable by millions of iPad and iPhone owners around the world. The battery is replaceable too, as it should run out after a year, and Apple has baked in some strong privacy settings as well.",
    "The new iMac, powered by the new M1 chip too, comes with tweaks rather than gargantuan changes: new colors are interesting, harking back to the retro iMac days of yore, and the speakers are upgraded too. The M1 chipset can improve the power of the internal, now Full HD webcam as well, as Apple realises the world needs more Zoom calls.",
    "We've got an upgrade to the Apple TV 4K, which doesn't come as part of a HomePod speaker sadly, and it can now process images using the A12 chipset from recent iPhones - so it can do high frame rate HDR.",
    "This isn't going to change movies that much, but it will help make sports look better and you can now stream your 60 frames per second Dolby Vision movies that you shot on the iPhone directly with AirPlay.",
    "The Siri remote looks miles better now too – it's thicker, with the Siri button on the side and a return to the scrollwheel from iPods of old. That looks more like it.",
    "There were a few things missing: we didn't hear anything on any new AirPods 3, an iPad mini 6 didn't appear, and we didn't get Apple Music and Podcasts rolling together to push the power of those two platforms into one.",
    "But there was still a lot to take in, and it had to be written at breakneck speed – so read on to see the event as it happened and find out everything that launched at the Spring Loaded Apple Event.",
    "All times are in Pacific Standard Time (PST)",
    "10:58 - Heading back to Tim now - are we wrapping up? I still can't get over the fact we've got the AirTags.",
    "And we're done. Time to get a fresh cup of tea.",
    "10:55 - Oh, no there's the 11-inch model - and that's starting at $799 and the 12.9-inch version costs $1,099 - both available to order April 30, and out second half of May.",
    "10:54 - Apple Pencil getting upgraded? Is it? Ah, no. I think it was just a trick of the light. The same model is supported and the Magic Keyboard too - although that's coming in a new white color.",
    "10:54 - I really want to see more, useful apps that take LiDAR to a new place. The power is there, but it's not being exploited yet. All the developers are talking about how this is going to be a big deal - and the way the M1 chipset changed the Macbook line, this could be big indeed.",
    "10:53 - Pretty sure I just saw the new Apple Pencil 3 on the promo video. But then again, my left eye is hurting a lot so I might be hallucinating.",
    "10:50 - Ooh, just mentioned 'all-day battery life' - I'd expected it to be more. But those LEDs must take a lot of power. But bringing the XDR display on the go is rather impressive - although I'd rather see an OLED display here.",
    "It supports HDR 10, Dolby Vision and Atmos too. Only talking about the 12.9-inch model here... does that mean there's no 11-inch option?",
    "10:49 - As rumored, Apple has 'developed' a mini LED that's over 100 times smaller than previous models, with over 10,000 mini LEDs - compare that to the 72 LEDs on the previous iPad and you have to expect that this will rival OLED displays for impressive display performances.",
    "10:47 - Let's hear about the Retina Display now. Apple wants to support HDR better, with the Pro Display XDR that's a separate monitor - but that's being brought to the 12.9-inch iPad Pro.",
    "Liquid Retina XDR display that's coming at 1000 nits of brightness and 1600 nits at peak brightness. This required a 'new approach'... but what?",
    "10:46 - I have no idea what's new here - Apple is talking about the specs as though they're new. Ah, here's something - the front-facing True Depth camera system will now have a new ultra-wide camera, a 12MP sensor with 122-degree field of view.",
    "It's bringing 'Center Stage' to keep you in the middle of the view, panning to keep you in shot and zooms out when others come into view. It's like the Echo Show 10 without a creepy robot arm.",
    "10:44 - There are new cameras on the rear of the new iPad, and the same four-mic setup from previously. Wait, are they new, or are we just talking about the same LiDAR scanner and AR Kit?",
    "There's smart HDR 3 support thanks to the new M1 chipset in there too.",
    "10:43 - It will support mmWave 5G, and it can reach 4Gbps at peak speeds if you get it in the right place.",
    "There was a guy having a video call on a commute with nobody around. Yeah, that's not gonna happen.",
    "10:42 - The USB-C port at the bottom will now support Thunderbolt, as well as USB 4 connectivity too. That's 4x the bandwidth, says APple, and being able to pass full-res video files across.",
    "We're talking wireless connections and that means.... 5G.",
    "10:41 - This really does push Apple's advantage in the tablet space - there won't be anything close to this on the market for being able to do the things on the go.",
    "10:39 - This is pretty big news - and iPadOS is set to use it already as it's built on similar architecture. This means a 50% jump in performance from the last-gen iPad - and we bet the battery life will be pretty good on this one too.",
    "There's 40% better graphical performance, and it's 1500x faster than the first iPad Pro model from all those years ago. Apple is pushing that for 3D modelling and gaming - and support for the gaming controllers from Xbox Series X and PS5.",
    "10:38 - We're seeing a promo video of someone trying to break into the Apple Campus - to install the new M1 chip in... an iPad?",
    "The iPad Pro is getting the M1 chip - that drew an 'ooosh' from our Computing Editor.",
    "10:36 - You'll be able to buy this in the second half of May, and it'll start at $1499 for the seven color option.",
    "10:34 - Do you still need to charge that Magic Mouse from the bottom? Still the most amazingly bad thing Apple has ever done. Especially when it's just come up with a clever ethernet solution.",
    "OK, it was seven colors of the new iMac. I can't count at speed.",
    "10:33 - TouchID has been brought to the iMac for the first time, with the keyboard. Even though it's wireless, Apple says it's still secure with a secure enclave. And you can use this to change the profile too.",
    "The Magic Mouse also comes in new color-matched array, as does the Trackpad too.",
    "10:31 - The 'ultimate' Big Sur experience, there's also new connections - 4x USB-C ports, including two Thunderbolt, and a magnetic power cable, and small power adaptor. Ethernet connects to the power adaptor and runs through the power - that's cool, I like fewer wires.",
    "10:29 - We're hearing a lot about the power of the M1 chip on the new iMac - multiple video streams to edit, playing games while Zoom calling, and the same chip architecture means you can hand off emails and text to and from your phone.",
    "10:27 - The speakers have been upgraded, with two pairs of woofers and more power, with a high-performance tweeter - meaning six stereo speakers 'coupled' with advanced algorithms to allow spatial audio to hear in Dolby Atmos.",
    "This is the 'best sound system ever in a Mac'.",
    "10:26 - As we're all working from home, this is why Apple has boosted things up. A Full HD camera, with improved low-light performance. Apple's new M1 neural engine will balance the lighting from the sensor too, so Apple is clearly going after the webcam. 'The best camera we've ever put in a Mac'.",
    "There's a three-way mic, with beam-forming to ignore background noise better - or even to record voice. Smart latency management means you're less likely to talk over someone in a video call too.",
    "10:25 - Talking about the display now - there's Truetone on board to change the white balance, and a coating that allows for an easier viewing experience.",
    "The camera, mic and speaker have been overhauled too.",
    "10:23 - I can talk happily about color. Internal components scare me. Here we go...",
    "The thermal system has been replaced by two small fans after Apple has shrunken the system down, and will not make more than 10dB of noise, and is 11.5mm thin to help it slip into more places.",
    "10:22 - Super thin, with a hinge on the side. There will be six colors 'for your style' - there's a single sheet of glass covering the surface, the light gray borders, and the rear really 'celebrates color' with loads of colors. Green, orange, yellow, red, blue and one other that I missed. Soz.",
    "10:21 - OK, a quick breath while we hear about all the new apps that are using the new M1 chip. Although that probably is important for those that are using M1 Macbooks right now.",
    "Today, we're going to hear about a new Mac built around M1. From the ground up, apparently.",
    "It's a new iMac. With lots of colors like the old iMac from the Zoolander days, but in aluminum rather than plastic.",
    "10:20 - The M1 chip has gone well so far, says Tim, and it's powering most of the Mac range being sold these days.",
    "We've inexplicably gone underwater to hear more.",
    "10:19 - Only 20 minutes in, and we've covered so much. I can't even drink my tea. Oh man, now we're onto the new Macs. Come on Tim, show me a promotional video so I can relax for a second.",
    "10:16 - You can now use the light sensor in your iPhone to calibrate your TV exactly, to compensate for any slight shifts in color and brightness. You just move the iPhone to a point on the screen and off you go.",
    "Obviously, the change looks great according to Apple - but I love the idea of talking one gadget to make another better.",
    "There's a new thicker Siri Remote, with an outer ring and five-way control - this is more like an old-school iPod, and it comes with a power button to turn off your TV, and the Siri button is now on the side like on the iPhone.",
    "Aaaaand we're done. It'll be $179 for 32GB, or $199 for 64GB for more space to fill with apps. You can pre-order on April 30 for delivery in May.",
    "10:14 - Right, here we go with Apple TV hardware - it's the Apple TV 4K. Talking about Apple Fitness Plus on there - it's good, but it annoys me that you can't use it when your Watch isn't charged up.",
    "Sorry, actual news: the new Apple TV 4K will have the A12 Bionic chip inside, allowing it to play HDR in faster framerate, which means sports and other high-resolution / high-framerate footage (including that from your iPhone) will look good - even over AirPlay.",
    "10:12 - Next up, Apple TV Plus. Now we're looking at season 2 of Ted Lasso - one of the big shows on the service. Tim Cook says 'it's one of his favorites'.",
    "Looks like things aren't going well for Ted in season 2. Are we going to see an even bigger fall from grace?",
    "10:10 - Apple is going big on privacy here - allowing you to make sure you've not had one slipped in your bag, audible alerts to let you know it's there, and 'rotating identifiers' - whatever that is.",
    "There are also some new bag clips too to let you accessorize, they'll cost $29 each or $99 for four.",
    "10:09 - This is the Tile rival, and you can connect loads of them with different descriptions to help you see where that is. With 'Precision Finding' and a U1 chip (in newer iPhones) you can move around to see exactly where the device is - it uses the camera, gyroscope and accelerometer to help you find your lost item exactly.",
    "10:08 - I can't believe this is happening. Apple, this should be the 'One More Thing' that we've all waited for. We're currently in a magical word of the 'back of someone's sofa' - there's a big reveal for this. Yep, there's the AirTag.",
    "To paraphrase our US Computing Editor: \"I hate when I leave my keys in the subterranean cave in my couch.\"",
    "10:07 - Now we're talking about 'Find My' - we've zoomed to the health area of the Campus now. Apple is launching a new accessory... NO IT CAN'T BE.",
    "10:06 - I can confirm it's purple, launched to 'Candyman', from Willy Wonka and the Chocolate factory. You'll be able to pre-order this week, and buy it from April 30.",
    "10:05 - There's a new color coming for the iPhone range - looks like it'll be purple.",
    "10:03 - Apple 'believes' that it's the most successful credit card launch ever. It's also going to allow spouses to improve credit history, and family members over 13 will be able to use it too - with Apple Card Family.",
    "Straight onto podcasts - there's a new Podcasts app, and channels to help you find new shows from your favorite sources. And there are subscriptions too, launching next month in 170 countries, so you can support your top podcasts.",
    "10:01 - Here's Tim Cook, talking about how Apple wants to make a difference in our lives with some 'exciting announcements'.",
    "First up talking about how the brand is carbon neutral. Tim is pledging that by 2030 it'll be carbon neutral from end to end - meaning from creation to the removal of products, to remove more than 1 million tonnes of carbon every year.",
    "Tim is walking down a path that I've walked down, past the little tables.",
    "APPLE CAR? No, Apple Card. Less of an exciting 'first up'. Calm down, Gareth.",
    "10:00. - Here we go, it's APPLE TIME. We're speeding over the Apple Campus as usual.",
    "09:57 - I've upset myself thinking about the AirTags. Will they appear? Will they not? If Apple pans past an AirPower charging mat with AirTags on, and doesn't announce either, it would be an amazing middle-finger easter egg to all you fans.",
    "09:55 - Down to five minutes now. You should have fired up your stream if you haven't already.",
    "On the subject of the iPad Mini 6, I'd be surprised if that appears, even though it's strongly rumored. Apple really doesn't seem to love that little device in the same way it does the iPad Pro, thanks to the fact it's generally bought by those that just fancy a little tablet and care less about the specs.",
    "Maybe I'm wrong, but I think that's the most likely miss. Well, apart from AirTags.",
    "09:50 - We're just 10 minutes away now. I bet Tim Cook is shouting at himself in a mirror right now and throwing oranges at a wall to psyche himself up.",
    "09:40 - Right, so we've talked about the new iPad Pro 2021, but what about the Apple Pencil 3? Word is that we're getting a new one today, and that would mean we need some design tweaks.",
    "It's been rumored that a few changes will come, so let's rate them out of 10:",
    "A new glossy finish - 10/10 this one seems certain. So back to the shininess of the first pencil. A flat edge - 10/10 too. No way that Apple doesn't let this magnetically clip to the side of the device. Higher sensitivity - 8/10. While it's feasible that Apple would just go with the new finish and a different end section, it would be a failure not to give a sketching reason to buy the the new device. A new tip - 6/10. This seems on the cards, but for what, we don't know. That could be the thing that enables better sensitivity or 'paper feel' when gliding over the glass. A black finish - 4/10. Apple probably won't change the colors on this model, but we've heard crazier things. Color-sensing capabilities - 2/10. Naaaah, this has been rumored but not for me tonight. That seems like 2023's problem.",
    "09:25 - I actually nearly fell for this tweet.",
    "09:19 - Right, let's have a look at what we could be seeing today - starting with the obvious one, the new iPad Pro. Coming in two sizes (as usual) the iPad Pro is expected to be offered in 12.9- and 11-inch sizes, come with 5G connectivity and have a new mini LED screen.",
    "That last point is going to be the pivotal one - with the new screen tech and an enhanced chipset inside, expect Apple to make a big deal about the way creatives can sketch and design on the new iPad Pro.",
    "09:18 - The answer was olives.",
    "09:10 - Cracks knuckles It's been a while since I've done one of these - in fact, not since the last iPhone launch - and Apple's been rather quiet since then. James 'The Peck' Peckham has done a good job of keeping you up to date on what we're likely to see, but is he asking the big questions?",
    "For example, over at our sister brand Marie Claire, they posit: 'Princess Charlotte’s favourite snack is pretty fancy for a five year old.'",
    "But what could it be?",
    "09:00 - Hello everyone, it's Gareth Beavis back in the hotseat. What have I missed?",
    "08:20 - The other thing that we might well see is the long-rumored Apple AirTags. Jon Prosser had suggested that these would land in March, so the spring event would be the ideal candidate - and he's since hinted that this event is likely to be where we'll see them.",
    "These are expected to be item trackers similar to Tile, so you’d be able to attach them to belongings, like a bag, wallet, or phone, and then track the device if it’s lost or stolen. AirTags are likely to leverage Apple’s Find My functionality, and might be able to use the vast network of peoples’ iPhones to help with the tracking.",
    "07:54 - Henry St Leger, TechRadar's Home Cinema Editor, says \"It’s been four years since the last Apple TV 4K (5th generation), and with rumors around a 2021 release date for a next-gen model, it seems at least semi-likely that we’ll see it shown off or teased at tonight’s event.",
    "\"If a new Apple TV is shown off, though, you shouldn’t expect a retread of what’s gone before. The latest rumors say that Apple is planning an all-in-one streaming box, speaker and smart display – which could mean it ditches the ‘Apple TV’ moniker entirely and begins a new product line for the tech giant.",
    "\"A more conservative prediction might be another 4K HDR streamer in the vein of the 2017 model, but with a more advanced A12X processor to better handle Apple TV Plus streaming, as well as Apple Arcade games. Hopefully, though, we’ll get all of the above.\"",
    "07:14 - Tim Cook is awake and he's at work... or, his social media manager is up bright and early instead. How do we know? Because Cook has sent his first tweet of the day.",
    "06:30 - Apple AirPods 3... where are those true wireless headphones we've heard so much about?",
    "Olivia Tambini, Audio and Music Editor for TechRadar, says, \"We've been hearing rumors about the Apple AirPods 3 for a while now, and everything is pointing to a 2021 release – and with the event happening later today, we're hopeful that Apple will take the opportunity to show off the next generation of its true wireless earbuds.",
    "\"Of course, nothing is certain at this stage, and we've also heard conflicting rumors that the AirPods 3 won't enter production until the third quarter of this year, potentially launching alongside the next iPhone in September.",
    "\"Plus, we've also been hearing rumors that the next AirPods Pro could launch in April, so we may see the AirPods Pro 2 be announced today instead. In any case, we'll definitely be keeping our eyes peeled for a AirPods or AirPods Pro announcement today.\"",
    "05:30 - Now is when the rumored products start to become less likely, although we may see the iPad mini 6 arrive later today.",
    "Ming-Chi Kuo (an analyst with a great track record for Apple leaks) has said to expect this slate in the first half of the year, and Jon Prosser has said that he’s heard “iPads” are coming in March (which would be almost right if it lands in April).",
    "The plural there suggests multiple models, so it’s not out of the question that the iPad Pro (2021) and iPad mini 6 could both show up. That said, we’ve heard fewer release date rumors about the iPad mini 6, so we’d say it’s less likely to show up than the iPad Pro (2021).",
    "Whenever it does arrive, rumors suggest it might have a slightly larger 8.5-inch screen (up from the 7.9-inch one used by the iPad mini (2019)). It might also stick with the Lightning port (rather than switching to USB-C), and use an A13 Bionic chipset, like the iPhone 11 range.",
    "04:12 - The Apple Store is down, so you won't be able to buy any new products from the company for the next few hours ahead of the launch event while the team tinkers behind the scenes.",
    "Apple always pulls its store down ahead of a launch event so it can include new products without leaking them to the world ahead of time. If you wanted to buy a new iPhone 12 directly from Apple, you'll likely have to wait until the event is over now.",
    "03:45 - It looks increasingly likely that we’ll see the iMac (2021) at the Apple event. This long-rumored all-in-one PC has been expected since Apple released two new MacBooks and the Mac mini late last year that run on its own M1 chip, rather than based on Intel hardware.",
    "It looks increasingly likely that we’ll see the iMac (2021) at the Apple event. This long-rumored all-in-one PC has been expected since Apple released two new MacBooks and the Mac mini late last year that run on its own M1 chip, rather than based on Intel hardware.",
    "An M1-powered iMac would see a decent bump in performance, and would bring the all-in-one PC in line with Apple’s other new computing products.",
    "Earlier this year, Apple discontinued several existing iMac models, a pretty reliable sign that it was preparing to launch a new version. When the April 20 event was announced, many of us thought this would be an ideal time to launch the new iMac – and it looks like that could be the case.",
    "A tweet over the weekend by Ian Zelbo (@RendersbyIan), states that “Apple is expected to release a redesigned iMac on Tuesday’s Spring Loaded event”, and is based on leaks by Jon Prosser, a very well-known Apple leaker, who has accurately predicted several Apple launches in the past.",
    "Not only will the new iMac apparently come with the Apple M1 chip, but there are also rumors that they will have a new design, and will come in a range of colors – a nod to the classic iMac G3, launched back in 1998.",
    "02:50 - So what gadgets will we be seeing announced tonight? Throughout today we'll be running you through some of the announcements we're expecting, and we're kicking off with what we know about the new iPad Pro 2021.",
    "The iPad Pro (2021) might end up being the headline announcement of the Apple spring event. Multiple sources had said a new model would land in March, and with the previous model landing last March, the timing would have made sense. Of course, we're now in April, but that's close enough.",
    "That doesn’t necessarily mean it will be unveiled at the spring event, but it’s unlikely that Apple would have two different sets of announcements so close together, and Prosser has suggested it will land at this event.",
    "As for what the iPad Pro (2021) might offer, a large number of leaks suggest it will have a Mini LED screen, offering an improved contrast ratio and color reproduction over a normal LCD display.",
    "We’ve also heard that it will come in both 11-inch and 12.9-inch sizes, and that it might support 5G, have a powerful new chipset, and have a tweaked but similar design to its predecessor.",
    "01:45 - Do you expect to see Apple AirTags today? The Tile alternatives have been rumored for years now, but we've yet to see them be officially unveiled by Apple. Some leakers are saying today is the big day.",
    "01:30 - Welcome to the first big Apple announcement of 2021. We're expecting a whole host of gadgets to be revealed later today, and there may be something for every Apple fan.",
    "In fact, this is arguably Apple's most interesting show of its year as it often unveils new tech from all around its business.",
    "Throughout today we'll be running you through what we expect to see when the event starts, but the main highlights so far - according to leaks and rumors - are we'll be seeing the new iPad Pro, and maybe a new iMac too.",
    "Don't expect to see the new iPhone SE 3 or iPhone 13 today, but we may hear something more about software (today could be the day iOS 14.5 drops) and there may be other gadgets like AirPods 3 or a new Apple TV.",
    "Only time will tell, and we're excited to see what Apple does launch later today."
  ],
  "headers": {
    "13": "Apple event live blog: the whole launch as it happens"
  },
  "links": {
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "iPad Mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "new iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2020-review",
    "'Princess Charlotte’s favourite snack is pretty fancy for a five year old.'": "https://www.marieclaire.co.uk/news/celebrity-news/princess-charlotte-favourite-snack-646731",
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "these would land in March": "https://www.techradar.com/news/apple-airtags-and-a-new-ipad-pro-tipped-to-launch-in-march",
    "Apple TV 4K (5th generation)": "https://www.techradar.com/reviews/apple-tv-4k",
    "new Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Apple Arcade games": "https://www.techradar.com/best/best-apple-arcade-games",
    "Apple AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "next iPhone": "https://www.techradar.com/reviews/iphone-13",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "AirPods Pro 2": "https://www.techradar.com/news/apple-airpods-pro-lite-what-we-want-to-see-from-the-rumored-true-wireless-earbuds",
    "expect this slate in the first half of the year": "https://www.techradar.com/news/the-upcoming-entry-level-ipad-2020-might-be-almost-as-big-as-ipad-pros",
    "Jon Prosser": "https://twitter.com/jon_prosser/status/1362958638478856192",
    "iPad mini (2019)": "https://www.techradar.com/reviews/ipad-mini-2019",
    "stick with the Lightning port": "https://www.techradar.com/news/new-ipad-air-2020-could-take-two-of-the-ipad-pros-best-features",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iMac (2021)": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "Mac mini": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020",
    "own M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Apple discontinued several existing iMac models": "https://www.techradar.com/news/apple-discontinues-more-imac-models-ahead-of-rumored-m1-refresh",
    "and will come in a range of colors": "https://www.techradar.com/news/check-out-what-an-ipad-air-inspired-imac-m1-could-look-like",
    "Prosser has suggested": "https://www.techradar.com/news/apple-event-for-march-23-if-true-it-could-bring-new-ipad-pro-and-apple-airpods",
    "will have a Mini LED screen": "https://www.techradar.com/news/new-ipad-pro-could-land-soon-with-a-mini-led-screen",
    "it might support 5G": "https://www.techradar.com/news/ipad-pro-2021-looks-even-more-likely-to-feature-5g-and-other-big-upgrades",
    "powerful new chipset": "https://www.techradar.com/news/new-ipad-pro-2021-might-be-as-powerful-as-the-latest-macs",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news"
  }
}