{
  "source": "https://www.techradar.com/news/this-rtx-3080-laptop-from-gigabyte-is-dollar1450-off-with-this-early-newegg-black-friday-deal",
  "title": "This RTX 3080 laptop from Gigabyte is $1,450 off with this early Newegg Black Friday deal",
  "category": "computing",
  "updated": "2021-11-13T00:08:00Z",
  "author": "john-loeffler",
  "summary": "Instant savings and a $700 rebate combine for a massive discount",
  "article": [
    "Finding good early Black Friday deals on mobile workstations can be tough, making this incredible offer from Newegg one you definitely need to check out. Right now, you can get this Gigabyte Aero 15 OLED laptop with an RTX 3080 for just $1,999 after instant savings and an additional rebate offer (Not in the US? Scroll down for deals in your region).",
    "We ranked the Gigabyte Aero 17 (2021) as one of the best laptops you can buy earlier this year, and that remains the case for the slightly smaller 15-inch version, especially if you are a creative professional looking to upgrade your equipment.",
    "Normally selling for $3,449, you can save $750 right off the bat, paying $2,699 plus applicable taxes and shipping at checkout. Then, you also have a $700 rebate card offer you can take advantage of, bringing the final price down to $1,999.",
    "The Gigabyte Aero 15 on offer comes with an Intel Core i9-11980HK processor, an RTX 3080 8GB GPU, 32GB RAM, dual 512GB and 1TB SSDs, and a 15.6-inch, Pantone-validated 4K AMOLED display with X-Rite certification and per-unit factory calibration.",
    "Even at full price, this laptop is one of the best purchases you can make if you are a creative professional who needs outstanding performance and visual fidelity, so a savings of $750 right out the gate makes this a deal you really need to consider.",
    "Normally, everyone forgets about the rebates after they make their purchases, but with an additional $700 rebate card from Gigabyte, you really can't let this early Black Friday laptop deal from Newegg pass you by. Don't forget to mail in your rebate form!",
    "No matter where you live, you'll find all the lowest prices for the Gigabyte Aero 15 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Gigabyte Aero 15 Black Friday deal",
    "6": "More Gigabyte Aero 15 deals",
    "7": "More Black Friday deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Gigabyte Aero 15 OLED laptop with an RTX 3080 for just $1,999": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-4434983106698463000&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2FN82E16834233455",
    "Gigabyte Aero 17 (2021)": "https://www.techradar.com/reviews/gigabyte-aero-17-2021-review",
    "best laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday laptop deal": "https://www.techradar.com/black-friday/black-friday-laptop-deals"
  }
}