{
  "source": "https://www.techradar.com/news/is-a-daredevil-disney-plus-show-in-the-works",
  "title": "Is a Daredevil Disney Plus show in the works?",
  "category": "entertainment",
  "updated": "2021-12-06T10:35:13Z",
  "author": "axel-metz",
  "summary": "Kevin Feige is dare(devil)ing us to dream",
  "article": [
    "Marvel chief Kevin Feige has seemingly confirmed that the studio plans to bring Charlie Cox on board to reprise his role as Daredevil in the MCU – suggesting a Daredevil Disney Plus series could be on the way.",
    "Speaking to CinemaBlend on the press tour for Spider-Man: No Way Home, Feige said: \"If you were to see Daredevil in upcoming things, Charlie Cox, yes, would be the actor playing Daredevil.\"",
    "Naturally, the Marvel boss didn’t speculate further as to what those “upcoming things” might be – \"where we see that, how we see that, when we see that, remains to be seen\" – but the admission comes as promising news for the future of Matt Murdock in the MCU.",
    "Cox played Daredevil in the eponymous Netflix series for three seasons before the show was canceled in 2018. It was produced by Marvel Television (the company also responsible for both Jessica Jones and The Punisher), which was itself folded into the all-encompassing Marvel Studios a year later.",
    "At the time, Netflix said the blind crime-fighter would \"live on in future projects for Marvel,\" though an original deal between the two studios meant Daredevil couldn't appear in any non-Netflix projects for at least two years following the show’s cancelation (as per Variety).",
    "So, could an MCU-set Daredevil season 4 or reboot show actually be in the works? If the ongoing speculation around Spider-Man: No Way Home is anything to go by, we’d say it’s a distinct possibility.",
    "Now, we’ve already debunked the theories suggesting Cox’s Murdock appears in the first trailer for the upcoming Spidey movie. But multiple sources, including Murphy's Multiverse and ComicBook.com's Brandon Davis, have since suggested that Cox will have a role to play in No Way Home.",
    "What’s more, Cox himself appeared flustered in a recent interview when asked if he was part of No Way Home's cast, while other leakers have alleged that Murdock will defend Peter Parker in court after the latter is supposedly convicted of killing Mysterio at the end of Spider-Man: Far From Home.",
    "Even if Cox’s Daredevil doesn’t end up appearing in No Way Home, though, there’s still a chance the character could cameo in upcoming Marvel Disney Plus shows like She-Hulk and Echo, or even future episodes of Hawkeye. In fact, if you believe the rumors about She-Hulk and Echo's supposed plots, Daredevil may actually be part of each show's supporting cast.",
    "Add in the fact that both TV series seem ideally placed to feature the character – She-Hulk, like Daredevil, is also a lawyer, while Echo has a prominent comic history with the Man Without Fear – and we wouldn't be surprised to see Charlie Cox announced as part of their respective casts, post-No Way Home.",
    "But appearances aside, the success of recent MCU shows like WandaVision and Loki – coupled with the enduring popularity of Netflix’s original Daredevil production – suggests a Disney Plus-based Daredevil series would be a sure-fire hit with new and existing fans alike."
  ],
  "headers": {
    "5": "Will we dance with the devil again?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "CinemaBlend": "https://www.cinemablend.com/interviews/kevin-feige-confirms-daredevil-casting-in-the-mcu-and-fans-will-be-pumped",
    "Spider-Man: No Way Home": "https://www.cinemablend.com/interviews/kevin-feige-confirms-daredevil-casting-in-the-mcu-and-fans-will-be-pumped",
    "Netflix series": "https://www.techradar.com/best/best-netflix-shows",
    "Variety": "https://variety.com/2018/tv/news/defenders-disney-streaming-daredevil-iron-fist-luke-cage-jessica-jones-1203087219/",
    "debunked the theories": "https://www.techradar.com/news/no-daredevils-not-in-spider-man-no-way-home-trailer-and-this-proves-it",
    "first trailer": "https://www.techradar.com/news/spider-man-no-way-home-trailer-5-things-you-may-have-missed",
    "Murphy's Multiverse": "https://www.murphysmultiverse.com/charlie-cox-daredevil-spiderman-3-marvel-studios/",
    "ComicBook.com": "https://twitter.com/spideysnews/status/1350134555500535808?s=21",
    "recent interview": "https://www.youtube.com/watch?v=E7LwHospKcc",
    "other leakers": "https://twitter.com/Ml6007/status/1429772910546325505",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-episode-3-may-have-just-confirmed-the-return-of-a-fan-favorite-character",
    "believe the rumors": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/qy7h45/exclusive_sources_close_to_bingewatchthis_have/",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Loki": "https://www.techradar.com/news/loki-season-2"
  }
}