{
  "source": "https://www.techradar.com/news/valves-steam-deck-teardown-is-fascinating-and-scary",
  "title": "Valve’s Steam Deck teardown is fascinating – and scary",
  "category": "computing",
  "updated": "2021-10-07T11:41:27Z",
  "author": "jamel-smith",
  "summary": "Be warned",
  "article": [
    "Valve has posted an official teardown video of the Steam Deck, and before it even starts the teardown, the company states that it doesn’t recommend anyone to take apart their own handheld console.",
    "The Steam Deck is not designed to be user-upgradable either, which could disappoint PC hardware enthusiasts who were hoping to swap out certain components, such as the SSD storage, later on.",
    "Valve even goes on to warn viewers that you could be putting yourself and your life at risk by opening up your Steam Deck.",
    "Valve, helpfully, details that damaging the battery of the Steam Deck could be the thing to endanger your life, as the battery can set alight. Dying due to the battery of the Steam Deck exploding would certainly be an interesting inclusion on your death certificate.",
    "Valve also explains that opening the case of the Steam Deck immediately weakens the structural integrity of the handheld, so the product will be less drop-resistant.",
    "There’s also the danger of the static electricity from your own body potentially frying some of the components in the Steam Deck.",
    "The screws and the screw housing of the Steam Deck are flimsy, to say the least, Valve warns that the screws and the housing can easily be stripped due to the plastic material the screws and housing are made out of.",
    "Valve does show how to remove the SSD from the Steam Deck, but again, it doesn’t recommend swapping out the internal SSD for an off-the-shelf one. If you want to expand your storage, the company recommends using the microSD card slot. All Steam Deck models use the M.2 SSD connector for storage, and if you want to go against Valve's recommendations and swap out the SSD, the connector only fits a 2230 size module SSD.",
    "Though Valve strongly recommends not opening up the Steam Deck, this video is compelling. Hardware teardowns are utterly fascinating for people like myself. The PS5 hardware teardown, for example, garnered 10 million views. Me, like many others, was enamored by the mighty heatsink in the PS5, so much so that I actually wanted to open up my PS5 just to see that heatsink in all its glory.",
    "But despite my weird obsession, I probably should leave the Steam Deck alone once I get my hands on one, it’ll be for the best."
  ],
  "headers": {
    "4": "Don't try this at home",
    "8": "Opinion: Hardware teardowns are really fascinating"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "PS5 hardware teardown": "https://www.youtube.com/watch?v=CaAY-jAjm0w"
  }
}