{
  "source": "https://www.techradar.com/news/rick-and-morty-co-creator-is-making-a-new-apple-tv-plus-animated-series",
  "title": "Rick and Morty co-creator is making a new Apple TV Plus animated series",
  "category": "entertainment",
  "updated": "2021-09-06T10:24:14Z",
  "author": "samuel-roberts",
  "summary": "It's based on the Strange Planet alien webcomic",
  "article": [
    "Rick and Morty co-creator Dan Harmon is making a new show for Apple TV Plus, based on the Strange Planet alien cartoons by artist Nathan Pyle.",
    "The series will be 10 episodes long, and Harmon will be credited as co-creator, according to THR. You've probably seen these cartoons before – the official Instagram page for Strange Planet has 6 million followers, meaning it gives Apple some pretty recognizable source material to draw from.",
    "The show will apparently feature 'heartfelt' stories on a planet that feels pretty similar to ours in a lot of ways – if Harmon is involved, you can at least expect it'll be funny. If you haven't seen the comic before, here's a sample of what it's all about in terms of content and tone:",
    "Over the Garden Wall writer Amalia Levari will be the series' showrunner, while Apple's own in-house studio will co-produce the show with BoJack Horseman's animation house ShadowMachine.",
    "That's a formidable lineup of talent attached to this project, then, but Pyle's beliefs have previously drawn criticism.",
    "It's unclear when the show will release, but some time next year is probably a good bet. Harmon has two other animated shows coming up, alongside Rick and Morty's now-airing season 5: Krapopolis on Fox in the US, and Little Demon on FXX.",
    "Apple already has an adult-oriented animated comedy show: Central Park, which debuts its second season on June 25.",
    "Hulu has Solar Opposites and Animaniacs. Netflix has Big Mouth, and had BoJack and Tuca and Bertie. Even HBO Max has Close Enough. Apple TV Plus essentially came out of the gate with one of its own, in Central Park – but commissioning more of these shows is probably a smart move.",
    "Why are these shows so valuable to streamers? The variety is no doubt part of it. But these series arguably have the potential to be more rewatchable than a big-budget drama is. Think about how valuable the library of The Simpsons is to Disney Plus, or how HBO Max paid more than $500 million for the rights to South Park in the US.",
    "These are the types of shows that can keep users coming back to streaming services over and over again – and Apple doesn't have the advantage of a library acquired from elsewhere, so it essentially has to build its own from scratch. It's no wonder it's working with notable creators to capture a bit of extra attention."
  ],
  "headers": {
    "7": "Analysis: Every great streamer needs an animated series"
  },
  "links": {
    "Rick and Morty": "https://www.techradar.com/news/rick-and-morty-season-6",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/strange-planet-tv-series-dan-harmon-nathan-pyle-1234972713/",
    "previously drawn criticism": "https://www.dailydot.com/unclick/strange-planet-nathan-pyle-christian-beliefs-tweet/"
  }
}