{
  "source": "https://www.techradar.com/news/zoom-on-ipad-is-getting-a-much-needed-upgrade",
  "title": "Zoom on iPad is getting a much-needed upgrade",
  "category": "computing",
  "updated": "2021-05-10T10:06:09Z",
  "author": "daryl-baxter",
  "summary": "Zoom gains a VIP feature for iPad",
  "article": [
    "Apple has granted video conferencing app Zoom access to an API (Application Programming Interface) that allows the camera to be used when multitasking on the iPad.",
    "This means you can now use Zoom alongside another app via your tablet's split-view feature, while the camera still displays you in a call.",
    "The iPad has become an important device for users, especially in the last year, with many using it for working at home. With Apple’s yearly WWDC event looming next month, many owners are hoping to see improvements in the camera, especially where it’s only allowing the camera to be in use when one app is displaying at present.",
    "Not so with Zoom, which has been granted a special API that allows this when two applications are showing at the same time. According to a developer firm, the API is called ‘com.apple.developer.avfoundation.multitasking-camera-access’, and lets Zoom use the camera at all times.",
    "This is known in developer circles as a ‘private entitlement’, where an app can be allowed access to certain APIs that no one else can currently have.",
    "When using another conferencing app like Skype or Microsoft Teams, the camera will shut off when using another app, causing a lot of frustration when in a call.",
    "With many working remotely for the last year, it makes sense for the API to be used, but it does raise questions as to why it hasn’t been allowed for other apps.",
    "We’ve reached out to Apple for comment.",
    "Via Think Tap Blog"
  ],
  "headers": {
    "3": "What is the API?"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "a developer firm": "https://blog.thinktapwork.com/post/649630720084639744/ipad-camera-multitasking",
    "Skype": "https://www.techradar.com/reviews/skype",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Think Tap Blog": "https://blog.thinktapwork.com/post/649630720084639744/ipad-camera-multitasking"
  }
}