{
  "source": "https://www.techradar.com/news/microsoft-word-online-will-soon-feel-a-little-more-like-google-docs",
  "title": "Microsoft Word Online will soon feel a little more like Google Docs",
  "category": "computing",
  "updated": "2021-09-08T11:55:50Z",
  "author": "joel-khalili",
  "summary": "Microsoft is aiming to declutter your Word docs",
  "article": [
    "Microsoft is preparing an update for the web-based version of Word that will address a frustrating collaboration shortcoming.",
    "According to a new entry in the company’s product roadmap, Word Online will soon benefit from a new Simple Markup view that minimizes the amount of on-screen clutter generated by suggested edits and comments.",
    "“Simple Markup view keeps suggestions from others - both tracked changes and comments - on the periphery, allowing you to focus on the document itself while remaining aware that there are suggestions present,” Microsoft explained.",
    "The new Word Online feature, which has long been available with the offline version, is set to roll out at some point next month.",
    "With the rise of remote working during the pandemic, real-time online document collaboration took on a much more prominent role; no longer could two colleagues crowd around a desk to hash out a draft.",
    "In these scenarios, Google Docs has long had the beating of Microsoft Word, with a much cleaner comment system, user interface and @ mention functionality. And more generally, Google Workspace (née G Suite) was built for the web from the ground up, so the productivity suite lends itself more naturally to online collaboration.",
    "However, with the latest update for Word Online, Microsoft is aiming to close the gap somewhat with a document view that does away with clutter on the page itself, instead pushing any markup to the margins.",
    "The hope is that colleagues will be able to collaborate on documents more efficiently, avoiding any confusion or miscommunication that might arise as a result of messy markup.",
    "In all likelihood, the new Simple Markup view will be housed under the Review tab, as is the case with the offline version of Word."
  ],
  "headers": {
    "4": "Microsoft Word update"
  },
  "links": {
    "Word": "https://www.techradar.com/reviews/microsoft-word-review",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "product roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6304073030194389000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D85601",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "productivity": "https://www.techradar.com/best/best-productivity-apps"
  }
}