{
  "source": "https://www.techradar.com/news/apple-tipped-to-launch-a-foldable-phone-in-2023-we-get-you-its-details",
  "title": "Apple tipped to launch a foldable phone in 2023 – here's what we know",
  "category": "phones",
  "updated": "2021-05-03T08:49:22Z",
  "author": "balakumar-k",
  "summary": "8-inch QHD+ flexible OLED display mooted",
  "article": [
    "It's time to dip back into the realm of foldable iPhone rumors: one of the top analysts in the business has made some more predictions about when the bending Apple phone is coming, and it looks on course for 2023.",
    "In an investor note spotted by MacRumors, the well-respected Ming-Chi Kuo goes on record as saying Apple plans to launch an 8-inch QHD+ foldable iPhone with a flexible OLED display the year after next.",
    "What's more, Kuo says foldables will soon be a \"must-have\" for smartphone makers, and that Apple will eventually be one of the biggest players in the market. Based on Apple’s requested capacity plan, Kuo predicts that the foldable iPhone will ship 15-20 million units in 2023.",
    "A few more tidbits to talk about: SDC will apparently be the exclusive display supplier, Samsung Foundry will supposedly supply the display drivers, and the screen is said to use a silver nanowire touch solution that's already in use on a smaller scale in the HomePod mini.",
    "Kuo goes on to say that the silver nanowire touch solution being adopted for the device’s display will create a “long-term competitive advantage\" for Apple in the foldable device market.",
    "\"Future foldable devices will require touch technology that supports multiple folds (vs. only a single fold in current foldable smartphones), rollable, medium to large size display, and durability,\" Kuo writes, pointing out that silver nanowire is superior in this respect to other solutions.",
    "The analyst also predicts that foldable devices will blur the product segmentations between smartphones, tablets, and laptops in the future. With its cross-product ecosystems and hardware design advantages, Apple is in a great position to take advantage, according to Kuo.",
    "We've already got the likes of the Samsung Galaxy Z Fold 2, the Motorola Razr and the Huawei Mate Xs on the market, with other foldables – including the Google Pixel Fold – rumored to be on the way."
  ],
  "headers": {
    "4": "Multiple fold touch tech"
  },
  "links": {
    "foldable iPhone": "https://www.techradar.com/news/foldable-iphone",
    "MacRumors": "https://www.macrumors.com/2021/05/02/kuo-8-inch-foldable-iphone-2023/",
    "HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Motorola Razr": "https://www.techradar.com/reviews/motorola-razr-2020-review",
    "Huawei Mate Xs": "https://www.techradar.com/reviews/huawei-mate-xs",
    "Google Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone"
  }
}