{
  "source": "https://www.techradar.com/news/microsoft-teams-will-soon-let-you-lock-your-meetings",
  "title": "Microsoft Teams will soon let you 'lock' your meetings",
  "category": "computing",
  "updated": "2021-03-19T09:43:38Z",
  "author": "mike-moore",
  "summary": "Should mean an end to embarassing incidents",
  "article": [
    "Keeping your Microsoft Teams calls private and secure may soon get a lot easier thanks to a new update in the works.",
    "The video conferencing service is set to soon add a feature that will allow organizers to lock Microsoft Teams calls at any point in order to prevent other people joining.",
    "The new feature should prevent anyone joining a Microsoft Teams call who isn't supposed to be there, as well as giving the platform a heightened privacy option.",
    "In its Microsoft 365 roadmap entry for the new feature, the update is simply named \"Microsoft Teams: Lock a meeting from additional joins\", with a release date scheduled for around May 2021 - although it is still in development at the time of writing.",
    "Microsoft notes that after organizers lock their meetings, \"anyone attempting to join a lock meeting from any device will be informed that the meeting is locked.\"",
    "A seperate listing in the Microsoft 365 roadmap details another upcoming update which will apparently let users bypass the meeting lobby, instead gaining entry directly into the meeting. The upgrade, which is set to roll out this month, notes that this new meeting policy is an option for people in the organization but can exclude guest users.",
    "Keeping video calls safe and secure has become a growing issue over the past 12 months as more and more of us now work from home due to the pandemic.",
    "In particular, the abuse of Zoom calls - so-called \"Zoom-bombing\" hit the headlines repeatedly after multiple incidents in which pranksters or hackers gained access to meetings.",
    "Zoom was quick to up its security protection following a number of high-profile incidents, some involving the notorious online messageboard 4chan, however Zoom-bombing continues to plague organisations large and small around the world. Some US states even made Zoom-bombing a federal offense, however it's not clear if anyone was ever charged.",
    "If you're looking to keep your video conferencing calls private, there are a number of steps you can take. For instance, don't make meetings or classrooms public, don't share video conferencing links in public social media posts, manage screen sharing options in Zoom to only allow the host to use this feature and make sure that all participants have updated their software to the latest version."
  ],
  "headers": {
    "3": "No more Zoom-bombing?"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft 365 roadmap entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1064245333705375600&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D80669",
    "bypass the meeting lobby": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-5771411223710791000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D81376",
    "Zoom-bombing": "https://www.techradar.com/news/think-your-zoom-meeting-is-safe-from-zoombombing-think-again",
    "made Zoom-bombing a federal offense": "https://www.techradar.com/news/zoom-bombing-is-now-a-federal-offense-in-the-us"
  }
}