{
  "source": "https://www.techradar.com/news/long-term-home-workers-and-cyber-threats",
  "title": "Long-term home workers and cyber threats",
  "category": "computing",
  "updated": "2021-06-08T09:25:53Z",
  "author": "mark-wilson-blackberry",
  "summary": "Work has changed and so must our approach to cybersecurity",
  "article": [
    "Throughout the pandemic, we’ve all been told that working from home (WFH) increases the chance of cyber-attacks. Now, as more and more multinational organizations publicly commit to ‘work from anywhere’ policies long-term, it seems that this heightened threat is here to stay.",
    "Many organizations have implemented policies and shared advice to help home workers stay safe, but amid busy working days, sometimes combined with home schooling and often with longer working hours than usual, our patience with complex safety procedures was always destined to wear thin quickly.",
    "The cyber threat to organizations is real and active but, critically, the seemingly unlikely chance of a devastating attack means it’s not a priority for the average home worker. As threat actors increase their arsenal of techniques, organizations must ask themselves: can employees really remain vigilant to this threat forever more?",
    "A new survey from AT&T found 55% of employees report being targeted by cyber-attacks while working remotely. Yet, despite the shocking frequency of such threats to company intellectual property, customer data and our own personal information, 35% of those surveyed connect their work devices to smart home devices. Popular connected home devices include voice assistants (14%), smart speakers (14%), fitness monitors (13%), smart lighting (12%), and smart kitchen appliances (12%). Connecting to these devices dramatically increases the risk of an attack, since their endpoint security is likely to be lax when compared with the closely monitored systems of the traditional office.",
    "Critically, the AT&T report also found that one in five employees (20%) claimed they cannot be encouraged to care about the risk of cyber-attacks. This is wholly understandable; many procedures recommended to employees in the past have been clunky and time-wasting. When a client is asking for a report in a matter of minutes, cybersecurity is the least of an employee’s worries.",
    "Cybersecurity teams should pay attention to these stats. Of all those in the company who are at risk of cyber-attack, those relying on endpoint technologies are the most vulnerable. And yet, 20% of them are unwilling to engage with the messages of caution and vigilance shared by those employed to protect the company. Of course, it takes just one insecure endpoint to allow a cyber-attacker into the system, from where they can start to wreak havoc.",
    "So, how can an organization hope to secure its employees, technologies and endpoints remotely, without collaborating with employees?",
    "There is a two-fold method for successfully solving the problem of securing a remote workforce. Devices and technology can be reliably protected by taking a Zero Trust approach to accessing organizational resources. Likewise, employees can be protected through active measures that continuously assess their security risks, but remain out of their view. This non-intrusive form of personalized employee cybersecurity is possible through recent advancements in artificial intelligence (AI), and is called Zero Trust.",
    "The idea behind Zero Trust is simple – anything wishing to interact with organizational resources must first acquire a certain level of trust. By default, everything starts with a trust score of zero. As interactions occur between the business infrastructure and another actor, trust levels may increase or decrease. The amount of access an actor is granted changes in real-time, along with their trust rating.",
    "While the problem of personal technology connecting to workplace devices is solved with Zero Trust, the vulnerabilities caused by human nature must still be addressed. How does one create a secure environment when workers prioritize productivity over good security practices? How can the 20% of workers apathetic towards additional security measures be protected without their active cooperation? The answer is through implementing a Zero Touch approach to cybersecurity.",
    "Zero Touch, as the name implies, seeks to give users immediate access to their productive assets without taking multiple intermediary steps. Workers who can do their jobs without entering passwords, experiencing timeouts, requesting special permissions, or multiple authentications are less likely to seek shortcuts or workarounds. When no additional security tasks exist for the user to perform, it does not matter if 20% of employees ignore new security measures.",
    "The Zero Touch approach goes hand-in-hand with Zero Trust. Users establish trusted routines and interactions with workplace infrastructure. While performing trusted tasks, they experience no interference from cybersecurity related processes. When unusual activity occurs, trust must be gained or re-established with the system though minimally intrusive verification. The end result: organizational infrastructure is continuously secured while employee productivity continues without interruption.",
    "The risks caused by home working during the pandemic have been greater than security analysts predicted. These latest statistics from AT&T should prompt us all to change our approach to cybersecurity to fit into the modern working landscape. Cyber teams should start thinking beyond the standard EDR solutions and instead consider extended detection and response.",
    "Sure, securing endpoints remains critical, but in the new, connected workplace it’s time to set a new standard that allows employees to gain seamless protection through holistic solutions. This means deploying network telemetry, behavioral analysis and continuous authentication now, to protect the bright new future of work."
  ],
  "headers": {
    "3": "Home workers really are at greater risk than ever",
    "7": "Zero Trust takes the weight off employees’ shoulders",
    "9": "Make security pain-free through a Zero Touch approach",
    "12": "Work has changed - and so must our approach to cybersecurity"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "employees": "https://www.techradar.com/best/best-employee-monitoring-software",
    "data": "https://www.techradar.com/best/best-data-recovery-software",
    "smart speakers": "https://www.techradar.com/news/best-smart-speakers",
    "endpoint security": "https://www.techradar.com/news/best-endpoint-security-software",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "passwords": "https://www.techradar.com/best/password-generator"
  }
}