{
  "source": "https://www.techradar.com/news/the-best-gaming-laptops-of-ces-2021",
  "title": "The best gaming laptops of CES 2021",
  "category": "computing",
  "updated": "2021-01-19T11:32:36Z",
  "author": "michelle-rae-uy",
  "summary": "Game faster, smoother and better with these gaming portables from CES 2021",
  "article": [
    "The virtual CES 2021 event may be different this year, but that hasn’t stopped it from rolling out impressive tech as per usual. The best gaming laptops of this year’s CES are a mix of many first-rate refreshes, a few outstanding overhauls of existing models, and notable newcomers.",
    "To name-drop a few, the MSI Stealth 15M now comes with a brand-new shell that gives it a legitimate claim to the title of thinnest gaming laptop in the world. Meanwhile, the new Asus TUF Dash F15 comes with a hip design, military-grade durability, and an affordable price tag – proving once and for all that you don’t need to spend the big bucks for sheer power and portability.",
    "With Nvidia’s GeForce RTX 3000 graphics coming to gaming laptops this year, the time to upgrade to a brand spanking new model is now. The best gaming laptops of CES 2021 are proof that power and portability can go hand in hand, and we’ve gathered them all right here.",
    "Bigger and better display",
    "Lenovo has released several gaming laptops this year, including the Legion Slim 7, the Legion 5 Pro, and the flagship Lenovo Legion 7. All eyes are on the Legion 7, however, as it comes with a newer display and the latest innards. Unlike its previous model, this 2021 version comes with a bigger, faster, and higher resolution screen. Its 16-inch IPS display touts a 2560 x 1600 resolution, 165Hz refresh rate, HDR 400, and Nvidia G-Sync. That’s certainly an upgrade from 2020’s 15.6-inch, 1080p, 144Hz one.",
    "Not to be outdone, the internal components get a proper update as well. This year’s Lenovo 7 comes with AMD Ryze 5000 chips and Nvidia GeForce RTX 3000 GPUs. That’s while keeping things around the same price point as last year’s. Expect to see it on the shelves around June 2021.",
    "Is this the world’s thinnest gaming laptop?",
    "Though lofty claims of being the world’s thinnest gaming laptop are yet to be substantiated, the MSI Stealth 15M is certainly a solid contender for the title. Being only 0.63-inch thick and 3.73 lbs light means that it’s thinner and lighter than both the MacBook Pro 16-inch and the Dell XPS 15. That’s while packing 11th-gen Intel Core chips and Nvidia GeForce RTX 3000 graphics – the highest configuration gets you an Intel Core i7-11375H CPU, Nvidia GeForce RTX 3060 Max Q, 32GB of RAM, and a 1TB SSD. In fact, it’s one of the first gaming laptops to feature Intel’s 11th-gen H35-Series mobile processors.",
    "That’s pretty impressive, especially for a gaming laptop. The display could be better, with MSI keeping things low-key with a 1920 x 1080 pixel resolution and a 144Hz refresh rate. However, even in 2021, a 1080p screen is still plenty sharp for gaming. Now available for pre-order starting at $1,399 (£1,025, AU$1,800), the MSI Stealth 15M won’t start shipping until later this year.",
    "Affordable CAN mean sheer power",
    "The Asus TUF line is no stranger to affordable great performers. Last year’s Asus TUF A15, for instance, was simply brilliant while keeping things accessible to budget-conscious gamers. Now, it’s back at CES to prove that budget gaming laptops can also deliver brute strength. The new Asus TUF Dash F15 is set to do exactly that, bringing in Intel Tiger Lake processors, Nvidia GeForce RTX 3000 mobile GPUs, and up to a 240Hz 1080p display without costing a fortune. The cherry on top? It’s only 0.78-inch thick and only 4.41 lbs in weight.",
    "And that’s on top of its military-grade durability and hip, office space-worthy design. No word yet on when the Asus TUF Dash F15 will be available and just how cheap it is exactly at the time of writing, but based on the success of the TUF A15, we’re sure the TUF Dash F15 will deliver as promised.",
    "Smooth 4K gaming",
    "Available starting January 26 at the top online retailers, the new Razer Blade 15 may not feature any design revamps. However, its 4K display option does need the right internals to back it up. And, this year’s models make that a reality, thanks to Nvidia’s GeForce RTX 3080 joining its specs roster. That’s right; the new Razer Blade 15 Advanced Edition will come powered with the best mainstream GPU for 4K gaming right now, alongside a 10th-gen Intel chip, 32GB RAM, and 1TB SSD.",
    "Of course, if you’re looking for faster yet more affordable options, it’ll also have 1080p and 1440p displays available at 360Hz and 240Hz, respectively – all also touting RTX 3000 GPUs. The new Razer Blade 15 starts at $1,699 (about £1,325 / AU$2,380), with the 4K display, RTX 3080 configuration setting you back $3,299 (about £2,420 / AU$4,230).",
    "Fast 4K gaming",
    "If you don’t mind a slightly bulkier gaming portable, however, the Razer Blade Pro 17 offers everything the Razer Blade 15 with 4K display has to offer, only faster. Only $300 more than its smaller cousin, this configuration of the new Blade Pro 17 comes with a 4K display with double the refresh rate at 120Hz. It also comes with the Nvidia RTX 3080 GPU for that impeccable 4K gaming experience. Much like the 15, it also comes with largely similar display options and the Nvidia GeForce RTX 3000 graphics cards.",
    "The question is, is it worth shelling out more over the Blade 15? In our humble option, if you’re all about the 4K gaming life, yes. That’s especially since it’s not really much thicker or heavier. If you’re going for the 1440p option, however, the smaller version has a faster refresh rate.",
    "Back with a vengeance",
    "Gigabyte has also rolled out its share of refreshed gaming laptops this year, with the both the Aorus 15G and Aorus 15P getting their share of internal updates. However, it’s the Gigabyte Aorus 17G that’s turning heads, its 17.3-inch IPS display with a 300Hz refresh rate, mechanical keyboard with Omron switches, and Intel Core H series processors now being complemented by Nvidia’s GeForce RTX 3000 line, replacing last year’s RTX 2000 GPUs.",
    "Next to other gaming laptops that launched this year, this isn’t such a big update, especially because it’s looking like Gigabyte is sticking to 10th-gen processors. However, to Gigabyte fans with much older specs inside, it’s an excellent time to upgrade and even see what the RTX 3080 is made of.",
    "Dual-screen wonder",
    "While its TUF Dash F15 is gunning for the affordable yet powerful title, Asus’ ROG Zephyrus Duo 15 is out proving that dual-screen is still the future of gaming. It’s back this year to prove that a secondary screen is more than just a gimmick, offering gaming support like extra menus, map previews, and inventory options that will help for a smoother, more seamless gaming experience. Naturally, the internals are upgraded as well with AMD’s next-gen Ryzen mobile processor and Nvidia’s RTX 3000 mobile GPUs rounding it out.",
    "The question remains: is the Asus ROG Zephyrus Duo 15 and its second screen, especially with its Special Edition burning a $2,899 (about £2,130 / AU$3,715) hole in your pocket, worth a serious consideration? We’ll have to wait and see until we get our hands on it. In the meantime, it’s still a pretty nifty tech that’s worth a place on this list.",
    "MSI’s new offering",
    "MSI’s new GE76 Raider may still be stuck with 10th-generation Intel Core processors, which is a tad disappointing for a fresh offering. However, it does make up for that in the GPU department, coming equipped with Nvidia GeForce RTX 3000 graphics up to RTX 3080. Since Nvidia’s latest flagship is best for 4K gaming, this new line has a 17.3-inch 4K IPS display option on offer – although it you want something faster, there’s a 1080p alternative with a 300Hz refresh rate. RGB fans, meanwhile, will appreciate the fact that it’s inherited the RE66’s Mystic Light panoramic aurora lighting design.",
    "It also has a special edition, the MSI GE76 Raider Dragon Edition Tiamat, that comes with a gorgeously-engraved lid inspired by the ancient goddess Tiamat and is set to be released in February. In the meantime, it’s worth taking a look at the MSI GE76 Raider, now available to pre-order from $1,499 (about £1,100 / AU$1,920).",
    "The evergreen bet",
    "Alienware’s gaming laptop offerings are always on point, from their funky design to their specs and performance. Sadly, this year, the new Alienware m15 R4 doesn't get any design updates, which is disappointing, and is staying with Intel’s 10th-gen chips. The good news is that Dell has opted to give it a few component boosts, starting of course with its graphics cards. Like most gaming laptops to come out of CES 2021, the Alienware m15 R4 is getting the Nvidia GeForce RTX 3000 GPUs.",
    "It also offers a faster RAM with up to 2933MHz, which obviously will also help with your gaming experience. If you’re looking to upgrade your slightly aging Alienware gaming laptop, here’s your chance. The Alienware m15 R4 will be out on January 28 starting at $2,150 (about £1,575 / AU$2,750).",
    "Convertible gaming laptop with a mobile eGPU",
    "CES 2021’s theme when it comes to gaming laptops seems to be the thinner and lighter the better, which somewhat explains the ROG Flow X13 from Asus. It takes things to a new (and perhaps weird) level by opting for a 13-inch convertible body that is only 0.62 inches thin and 2.9 pounds light. It also apparently offers up to 10 hours of battery life. That’s all while promising “desktop-class gaming.”",
    "How exactly is it able to do that? By coming its own ultraportable eGPU, of course. The Flow X13 itself is equipped with up to AMD Ryzen 9 5980HS CPU and Nvidia GeForce GTX 1650 graphics, which is a decent GPU in its own right. To kick things up a notch, it comes with the compact Asus ROG XG Mobile external GPU with up to a GeForce RTX 3080 GPU inside that can be clocked to 1810 MHz at 150W with ROG Boost.",
    "Will this 2-in-1 route (in more ways than one) work better than the traditional way? Or will it be its downfall? We have yet to see. For now though, you gotta admit: it sounds like something you want to get your hands on to play with. The ROG Flow X13 and XG Mobile bundle is now available for pre-order starting at $2,999 (about £2,200 / AU$3,845)."
  ],
  "headers": {
    "3": "1. Lenovo Legion 7",
    "6": "2. MSI Stealth 15M",
    "9": "3. Asus TUF Dash F15",
    "12": "4. Razer Blade 15",
    "15": "5. Razer Blade Pro 17",
    "18": "6. Gigabyte Aorus 17G",
    "21": "7. Asus ROG Zephyrus Duo 15",
    "24": "8. MSI GE76 Raider",
    "27": "9. Alienware m15",
    "30": "10. Asus ROG Flow X13"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "MSI Stealth 15M": "https://www.techradar.com/news/ces-2021-msi-overhauls-gaming-laptop-lineup-with-nvidia-rtx-3000-graphics",
    "Asus TUF Dash F15": "https://preview.vanilla.tools/fte/techradar/c62d2568-55d2-11eb-b4e1-1adf1e7a4e82/news/asus-tuf-dash-f15-shows-that-thin-and-light-gaming-laptops-dont-have-to-be-super-expensive",
    "GeForce RTX 3000 graphics coming to gaming laptops this year": "https://www.techradar.com/news/nvidia-rtx-3000-graphics-cards-are-finally-coming-to-laptops",
    "flagship Lenovo Legion 7": "https://www.techradar.com/news/lenovo-unveils-new-additions-for-the-legion-gaming-laptop-range-at-ces-2021",
    "one of the first gaming laptops to feature Intel’s 11th-gen H35-Series mobile processors": "https://www.techradar.com/news/intel-is-making-some-of-the-thinnest-gaming-laptops-ever-at-ces-2021",
    "Asus TUF A15": "https://www.techradar.com/reviews/asus-tuf-a15",
    "GeForce RTX 3000 mobile GPUs": "https://www.techradar.com/news/nvidia-rtx-3000-graphics-cards-are-finally-coming-to-laptops",
    "new Razer Blade 15": "https://www.techradar.com/news/razer-reveals-new-lineup-of-blade-gaming-laptops-with-rtx-3080-gpus-at-ces-2021",
    "Razer Blade Pro 17": "https://www.techradar.com/news/razer-reveals-new-lineup-of-blade-gaming-laptops-with-rtx-3080-gpus-at-ces-2021",
    "Gigabyte Aorus 17G": "https://www.techradar.com/news/gigabyte-aorus-17g-laptop-has-an-rtx-3080-gpu-and-300hz-screen-for-super-smooth-gaming",
    "more than just a gimmick": "https://www.techradar.com/news/asus-rog-zephyrus-duo-15-wants-to-prove-that-dual-screen-gaming-laptops-arent-just-a-gimmick",
    "GE76 Raider": "https://www.techradar.com/news/ces-2021-msi-overhauls-gaming-laptop-lineup-with-nvidia-rtx-3000-graphics",
    "Alienware m15 R4": "https://www.techradar.com/news/alienware-m15-and-m17-gaming-laptops-get-even-more-powerful-at-ces-2021-with-nvidias-rtx-3000-series-gpus"
  }
}