{
  "source": "https://www.techradar.com/news/dell-closing-in-on-deal-to-sell-boomi-cloud-business",
  "title": "Dell closing in on deal to sell Boomi cloud business",
  "category": "computing",
  "updated": "2021-05-03T09:26:29Z",
  "author": "sead-fadilpasic",
  "summary": "Boomi is the latest company to be offloaded by Dell",
  "article": [
    "Dell Technologies has agreed to sell its Boomi arm for around $4 billion to private equity firms Francisco Partners and TPG.",
    "According to the Wall Street Journal, which broke the story, details about the deal are scarce, except the fact that it is expected to close by the end of 2021.",
    "Boomi, which was acquired by Dell in November 2010 for an undisclosed sum, is a cloud technology business that helps other organizations integrate various cloud platforms. According recent reports, the company has more than 11,000 customers and more than 1,300 employees.",
    "In a statement, Dell vice chairman and chief operating officer Jeff Clarke, said: “This proposed transaction positions Boomi for its next phase of growth and is the right move for both companies, our shared customers and partners. For us, we’re focused on fueling growth by continuing to modernize our core infrastructure and PC businesses and expanding in high-priority areas.”",
    "Dell has offloaded a number of its businesses in the last few years as it looks to focus on core operations. Last year, the company sold its legacy security firm, RSA, to a consortium of investors (Symphony Technology Group, Ontario Teachers’ Pension Plan Board, AlpInvest Partners) for just over $2 billion.",
    "Earlier this year, it announced plans to spin off its stake in VMware, in order to “simplify the corporate ownership structure”. An $11.5bn to $12bn special cash dividend was recommended by the independent Special Committee and declared by the VMware Board to all VMware stockholders immediately before the spin-off.",
    "Dell is currently in the process of transitioning from a hardware seller into a software and subscription seller. At the moment, about half of its revenue comes from the sales of PCs to both consumers and businesses.",
    "Via: Wall Street Journal"
  ],
  "headers": {
    "4": "Sell-off"
  },
  "links": {
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "spin off its stake in VMware": "https://www.techradar.com/news/dell-set-to-spin-off-vmware-into-independent-company-also-selling-boomi-cloud-arm",
    "Wall Street Journal": "https://www.wsj.com/articles/tpg-francisco-partners-near-deal-to-buy-boomi-from-dell-11619996400?mod=searchresults_pos1&page=1"
  }
}