{
  "source": "https://www.techradar.com/news/this-copy-and-paste-feature-might-finally-be-a-reason-to-ditch-chrome-for-microsoft-edge",
  "title": "This copy and paste feature might finally be a reason to ditch Chrome for Microsoft Edge",
  "category": "computing",
  "updated": "2021-03-07T07:30:03Z",
  "author": "mike-moore",
  "summary": "Share links quickly and easily across devices with Microsoft Edge",
  "article": [
    "Using Microsoft Edge across different Windows 10 devices might have just got an added advantage over the likes of Google Chrome.",
    "A new feature should soon allow Microsoft Edge users to transfer links that they have copied or shared from a browser on one Windows 10 devices onto another.",
    "The new Shared Links feature looks to help those users who may need to send and receive a large number of links every day, but have trouble keeping track of exactly which link was which, and when they'll be needed again.",
    "\"We send and receive a large number of links throughout our work weeks. However, when we actually need to use them, we may not remember what the link was called, where we last saw it, or whether we opened it at all,\" Microsoft noted in a blog post outlining the feature.",
    "\"The current processes that users have to re-find their links can be difficult and time-consuming. Users spend time and energy trying to find links that have been shared with them and sometimes shared by themselves, looking in various apps, checking their email and chat messages, and sometimes by asking someone else to find or re-send the link to them.\"",
    "The company notes that the goal of the new feature is to, \"Help users save time and effort by making links shared with/by user searchable in the history page of Edge Browser.\"",
    "Microsoft does already offer the Windows Cloud Clipboard tool to provide a similar service, but many users remain unaware of the functionality, so the company wants to build it directly into Edge.",
    "Now, users will be able to view and access the links they've shared, or had shared with them, on the History page in Microsoft Edge 0 - which will now get a new \"Shared Links\" tab. As it is part of the History section, users can go through their links using the search function, then quickly copy the links they need.",
    "Shared Links is still being tested, but Microsoft says users can trial it as a beta extension now.",
    "Via WindowsLatest"
  ],
  "headers": {
    "3": "Shared Links"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "browser": "https://www.techradar.com/best/browser",
    "a blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1335701771318906400&xs=1&url=https%3A%2F%2Fmicrosoftedge.microsoft.com%2Faddons%2Fdetail%2Flinks-recall-history%2Fblcahcocllnckhbmnmncgplbkdaehbmc%3Fhl%3Den&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-copy-and-paste-feature-might-finally-be-a-reason-to-ditch-chrome-for-microsoft-edge",
    "WindowsLatest": "https://www.windowslatest.com/2021/03/04/microsoft-edges-new-shared-links-feature-is-another-reason-to-ditch-chrome/"
  }
}