{
  "source": "https://www.techradar.com/news/intel-has-killed-off-its-speedy-optane-ssds-so-if-you-want-one-buy-it-quickly",
  "title": "Intel kills off speedy Optane SSDs – so if you want one, buy it quickly",
  "category": "computing",
  "updated": "2021-01-17T11:01:57Z",
  "author": "darren-allan",
  "summary": "Optane M10, 800P, 900P and 905P drives are no more",
  "article": [
    "Intel is to stop producing its dedicated Optane solid-state drives for the consumer market.",
    "As Tom’s Hardware spotted, the whole Optane-only family of SSDs for desktop PCs has been discontinued, meaning the Optane Memory M10, 800P, 900P and 905P drives.",
    "Intel said: “Intel will not provide a new large capacity Optane Memory SSD as a transition product for the client market segment. Intel will focus on the new Optane Memory H20 with Solid State Storage for the client market segment.”",
    "The H20 product isn’t a dedicated Optane drive, but rather a traditional SSD with QLC flash twinned with Optane memory. Essentially these are cache drives, which are speeded up a bit by the small amount of Optane memory on-board, but aren’t nearly as fast as the dedicated drives that are being discontinued.",
    "The H20 is designed more for laptops or small form-factor PCs and OEM usage (PC makers), and was only recently revealed at the close of 2020.",
    "The aforementioned M10, 800P, 900P and 905P models are now officially discontinued, although remaining units will still be shipping until February 26. So if you want one of these Optane SSDs, now would be a good time to make a move.",
    "Intel isn’t abandoning fully-fledged Optane SSDs totally, though, as there will be a second-gen Optane product for the server market in the form of the P5800X. However, it doesn’t seem likely that this will be a consumer offering in any shape or form."
  ],
  "headers": {
    "5": "Shipping through February"
  },
  "links": {
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/intel-kills-off-all-optane-only-ssds-for-consumers-no-replacements-planned",
    "SSDs": "https://www.techradar.com/news/ssd-vs-hdd-which-is-best-for-your-needs",
    "recently revealed at the close of 2020": "https://www.techradar.com/news/intel-reinvents-the-ssd-and-unleashes-an-optane-monster"
  }
}