{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-trilogy-trailer-isnt-what-you-think-it-is",
  "title": "Zack Snyder's Justice League trilogy trailer isn't what you think it is",
  "category": "entertainment",
  "updated": "2021-04-15T09:02:16Z",
  "author": "tom-power",
  "summary": "No, we're not getting any sequels for Zack Snyder's Justice League",
  "article": [
    "Zack Snyder's Justice League has been out for almost a month on HBO Max, but the fan-led campaign for the SnyderVerse isn't going away anytime soon.",
    "If you were one of those hoping that Snyder's Justice League sequels may one day be brought to life, a new HBO Max trailer teasing a Justice League trilogy might have caught your attention recently. Unfortunately, the video isn't what fans thought it would be – and they're not happy at all.",
    "In something of a bait and switch on Warner Bros.' part, the HBO Max trailer for Zack Snyder's Justice League isn't confirmation that the studio is moving forward with the director's two sequels. Instead, the video shows that the Snyder Cut is, in fact, the final part of a trilogy that also includes Man of Steel and Batman v Superman: Dawn of Justice.",
    "Check out the trailer below:",
    "As we said, fans of the SnyderVerse are pretty upset with this new trailer, and a quick look at the YouTube comments section for the video shows as much.",
    "Plenty of fans still using the hashtag #RestoreTheSnyderVerse in an attempt to force Warner Bros. to conduct a 180-degree spin and allow Snyder to make Justice League 2 and 3. Those efforts have fallen on deaf ears so far, and it's pretty much guaranteed that Snyder won't be returning to produce any more DCEU instalments of the world he created.",
    "Just three weeks ago, Warner Bros.' Ann Sarnoff confirmed that the Snyder Cut was the \"completion of his trilogy\", which the studio has since doubled down on with this trailer. Snyder himself has also poured cold water on the possibility of making his two Justice League sequels, saying that they \"will never be photographed\".",
    "Still, there's plenty of fan support for Justice League 2 and 3. As the tweet above shows, the #RestoreTheSnyderVerse hashtag is still trending in some capacity on social media nearly four weeks after Zack Snyder's Justice League was released. It doesn't look like that level of affection will ever pay off, but we thought that about the Snyder Cut, too, didn't we?",
    "Zack Snyder's Justice League is available on HBO Max now."
  ],
  "headers": {
    "4": "Zack Snyder's Justice League fans are unhappy with the teasing trailer"
  },
  "links": {
    "Zack Snyder's Justice League": "https://www.techradar.com/news/zack-snyders-justice-league-changed-my-mind-on-a-second-viewing",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-1947925326734537700&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fzack-snyders-justice-league-trilogy-trailer-isnt-what-you-think-it-is",
    "confirmed": "https://www.techradar.com/news/zack-snyders-justice-league-is-the-end-of-the-line-for-the-snyderverse",
    "saying": "https://www.techradar.com/news/zack-snyder-wanted-justice-league-to-get-two-sequels"
  }
}