{
  "source": "https://www.techradar.com/news/slack-is-finally-adding-this-vital-messaging-feature",
  "title": "Slack is finally adding this vital messaging feature",
  "category": "computing",
  "updated": "2021-06-17T10:01:24Z",
  "author": "mike-moore",
  "summary": "Scheduled message send is finally coming to Slack",
  "article": [
    "Being woken up or otherwise disturbed by an out-of-hours Slack message should soon be a thing of the past thanks to a new update from the service.",
    "The online collaboration platform has announced a new Scheduled Send feature that will allow users to choose a specific time for a message to be delivered.",
    "\"When you have an important message to share in Slack but it's not the best time to send it quite yet, you can schedule it. Select a date and time in the future and rest assured your message will be sent whether you're at your desk or on the go,\" Slack said of Scheduled Send, which is live now and rolling out gradully to users.",
    "In order to schedule a message on the desktop version of Slack, users need to click the green arrow icon to the right of the paper plane icon when they're done typing. This will bring up a new menu offering the chance to schedule a message - users can choose a pre-set date and time from the list, or select 'Custom time' to set their own.",
    "Mobile Slack users will need to tap and hold the paper plane icon to bring up the new option, but will also be able to choose a pre-selected time and date, or their own custome choice.",
    "Slack says that messages can be to scheduled up 120 days in advance, and that once scheduled, users will be able to edit, delete or reschedule messages before they’re sent. Scheduled messages will get their own new dedicated meny on the sidebar of the desktop Slack client, with mobile users able to find theirs in the Home tab.",
    "Many email services such as Gmail already offer such delayed send options, but this is the first time Slack has stepped up to do so. The platform has introduced a number of new features in recent months as it looks to keep pace with its rivals in the collaboration space with the advent of the new hybrid working world.",
    "The company recently released research that found many employees believe hybrid working is good for productivity and overall mental state, and would love to see the practice kept on after the pandemic."
  ],
  "headers": {
    "3": "Slack message send"
  },
  "links": {
    "Slack": "https://www.techradar.com/reviews/slack",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "said": "https://slack.com/help/articles/1500012915082-Schedule-messages-to-send-later?locale=en-US#mobile-2",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "good for productivity and overall mental state": "https://www.techradar.com/news/most-employees-believe-hybrid-working-is-helping-productivity"
  }
}