{
  "source": "https://www.techradar.com/news/efootball-2022-is-already-in-a-relegation-battle-after-winning-an-unwanted-title",
  "title": "Konami's eFootball 2022 has become the worst-rated Steam game in history",
  "category": "gaming",
  "updated": "2021-09-30T15:49:51Z",
  "author": "adam-vjestica",
  "summary": "Flailing limbs, weird physics, and odd-looking players aplenty",
  "article": [
    "Konami’s eFootball 2022 – the free-to-play soccer sim that was formally known as Pro Evolution Soccer, or PES for short – is now available to download on PS4, PS5, Xbox One, Xbox Series X/S, and PC.",
    "However, it hasn’t garnered the greatest reception with players.",
    "eFootball 2022 hasn’t even been out 24 hours, but that hasn’t stopped it from getting absolutely mullered online due to the game's horrendous glitches, bizarre physics, and truly terrifying-looking player likenesses.",
    "Here's Barcelona's Ansu Fati running like Naruto.",
    "Here we see players sliding around, as if by magic.",
    "And here's Lionel Messi's in-game likeness, who is eFootball 2022's cover star, no less.",
    "But Twitter isn’t the only indicator that eFootball 2022 isn’t impressing footy enthusiasts. The game has an ‘Overwhelming Negative’ review score on Steam after amassing 4,368 reviews at the time of writing, making it the worst-rated video game in the history of Steam according to Steam250.",
    "Just like Arsenal’s pitiful start to the 21/22 Premier League season, Konami can still turn things around with eFootball 2022. The publisher has already admitted that the game’s launch would basically serve as a demo, and more updates and changes are planned in the near future as the game evolves.",
    "However, you can’t help but wonder how the game has been released in such a state considering the team took an extra year of development time. Compare eFootball 2022 to EA's FIFA 22, which has been fairly well-received (microtransactions aside), it seems like Konami's soccer sim is already fighting an uphill battle.",
    "\"Alexa, play 'Things can only get better' by D:ream.\""
  ],
  "headers": {
    "7": "Analysis: there’s still time to make things right"
  },
  "links": {
    "eFootball 2022": "https://www.techradar.com/news/how-the-pro-evolution-of-konamis-efootball-came-to-be",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Steam": "https://store.steampowered.com/app/1665460/eFootball_2022/",
    "Steam250": "https://steam250.com/bottom100",
    "a demo": "https://twitter.com/play_eFootball/status/1422159538262880258?s=20",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22"
  }
}