{
  "source": "https://www.techradar.com/news/lucid-air-first-drive",
  "title": "Lucid Air may be the yardstick by which all luxury performance EVs are measured",
  "category": "car-tech",
  "updated": "2021-10-26T09:30:19Z",
  "author": "myriam-joire",
  "summary": "Now that's a big deal",
  "article": [
    "Lucid came out of nowhere. The California company - formerly named Atieva - initially supplied EV batteries and powertrains for other vehicle manufacturers and Formula E racing.",
    "In late 2016, it unveiled the Lucid Air - a high-performance luxury battery EV - after hiring Peter Rawlinson (Tesla's Model S Vehicle Engineer) and Derek Jenkins (Mazda's head of design), and announcing it was building a factory in Arizona.",
    "TechRadar recently visited Lucid's plant in Casa Grande, Arizona on the first official day of production, and spent about 20 minutes driving a pre-production Lucid Air Dream Edition ($169,000 before incentives) on nearby highways and freeways, under the watchful eye of a company representative. Here are our first drive impressions.",
    "The Lucid Air comes in four trims - Dream Edition ($169,000 before incentives, deliveries begin late October 2021), Grand Touring ($139,000), Touring ($95,000), and Pure ($77,400).",
    "Online reservations are available for all trims except the Dream Edition, which now has a waiting list. A deposit of $1,000 is required for all trims except the Pure, which can be reserved for $300.",
    "UK, Australian and rest of the world pricing and availability for the Lucid Air are still unknown.",
    "We drove the Dream Edition, and photographed the Grand Touring trim. The Dream Edition comes in two variants: Performance with 1,111hp and a 471-mile (758km) EPA range, and Range with 933hp and a 520-mile (836km) EPA range.",
    "Specs for the other trims are 800hp with a 516-mile (830km) projected range (Grand Touring), 620hp with a 406-mile (653km) projected range (Touring), and 480hp with a 406-mile (653km) projected range (Pure).",
    "All trims are dual-motor AWD except Pure, which is single motor RWD (with optional AWD).",
    "In the US, Lucid includes three years of free DC fast charging on Electrify America's charging network with all Lucid Air trims.",
    "The Dream Edition delivers over 737ft-lb (1000Nm) of torque and a top speed of 168mph (270km/h), with a 0-60mph time of 2.5s (Performance) or 2.7s (Range). Now that's fast!",
    "The Lucid Air is built around a 924V electrical system, and the Dream Edition boasts a 113KWh battery pack made of 22 modules, which contain 2170-format cylindrical cells made to Lucid's spec by Samsung SDI or LG Chem - depending on trim.",
    "All Lucid Air trims support 300kW DC fast charging and 22kW AC charging via a standard CCS Combo connector. Lucid's Wunderbox bi-directional on-board charger also supports V2G and V2V.",
    "In addition to designing its own battery pack, Lucid's also developed its own drive units - identical front and back - which integrate the motor, gearbox (single gear), and inverter into a single, ultra small and lightweight package.",
    "With its headquarters located in Silicon Valley, Lucid - like Tesla - is a tech-savvy company. As such, the Lucid Air integrates the latest in vehicle tech, including a multi-screen LTE-connected infotainment system powered by Android Automotive, Level 2 ADAS called DreamDrive, and even a lidar sensor - the first in a US production car.",
    "In all, there are five displays, 14 cameras (one inside), five radar sensors, and multiple ultrasonic sensors.",
    "Amazon's Alexa voice assistant is built-in, along with Apple CarPlay and Android Auto support, Qi wireless phone charging, and multiple USB ports.",
    "But what really stands out is the Lucid Air's 34-inch 5k resolution curved Glass Cockpit, which is made up of three seamlessly integrated screens. It's similar to - but bigger than - the curved glass instrument display on the Porsche Taycan, and appears to be floating above the dashboard.",
    "The left and right side screens are touch sensitive, but the instrument display in the middle isn't - yet these three panels blend into one. Controls for the headlights, wipers, defrosters, door locks, and more are located on the smaller screen to the left, while the larger screen to the right is used for home, navigation, entertainment, and communication.",
    "It looks super futuristic, but without the visual heft of - say - the Hyperscreen found in the Mercedes EQS.",
    "Below the dashboard, in the middle, is another touchscreen called the Pilot Panel, which controls drive modes, climate, seats, interior lighting, charging, settings, and more.",
    "It’s like an iPad Air (see what we did there?) resting on the center console at a 45-degree angle. Tap the little arrow centered at the bottom edge of this display, and the entire motorized panel retracts into the dashboard to reveal a storage cubby. Clever.",
    "One more touchscreen is located in the center console behind the armrest, facing the rear passengers. It controls rear climate, seats, and the power sunshade.",
    "Unfortunately, we didn't get to spend much time using these displays or rooting around the infotainment system. The navigation didn't work, and some of the software seemed unfinished. Still, the user experience was polished, and the infotainment system was responsive.",
    "We also didn't get a chance to properly listen to Lucid's Surreal Sound audio system, which features 21 speakers and Dolby Atmos tech. The little bit we heard sounded decent, though.",
    "On the plus side, we were able to try Lucid's DreamDrive Level 2 ADAS on a stretch of freeway, and it felt quite competent - on par with Tesla's Autopilot - and definitely more sorted than many other competing systems already on the road.",
    "Unlike Tesla's Autopilot, DreamDrive doesn't disengage when you take over the steering wheel. Instead, it lets you drive, attempts to reacquire the lane, and notifies you when it's safe to let go of the steering wheel again.",
    "So if you see an obstacle on the road, you can manually avoid it, then glide right back into DreamDrive without turning it back on - as long as you don't brake. It's pretty intuitive.",
    "Beyond auto steering, adaptive cruise control, a 360-degree view, and self-parking, Lucid's advanced driver assistance and safety suite will include everything you'd expect from a modern flagship electric car - from lane departure, blind spot, and forward collision warning, to cross traffic alert, and automatic emergency braking.",
    "OTA (over-the-air) software updates and phone-as-a-key are also on the menu, naturally. No surprises here.",
    "Finally, Lucid uses the interior camera to recognize who's driving and recall that person's profile, including seat, rearview mirror, and steering wheel position, plus car settings and other preferences.",
    "With Dolby Atmos, DreamDrive can play directional audible warnings to help the driver locate hazards. In addition, the infotainment system comes with built-in apps like Spotify, Tidal, TuneIn Radio, Pocket Casts, and iHeartRadio.",
    "The Lucid Air's design is definitely polarizing. It looks very sleek and futuristic, but also kind of awkward - the exterior recalls Chinese cars like the Xpeng P7, or even the LeEco LeSee concept we saw at the Shanghai Motor Show back in 2016.",
    "And with a coefficient of drag (Cd) of just 0.21, it's certainly sleek. But it's the bubble-like rear end that's somewhat awkward. The good news is, it's a lot more attractive in person.",
    "Frankly, from some angles, we think it's downright sexy. No matter what, the Lucid Air turns heads.",
    "It's low and wide, and features a lot of interesting design cues, like the two-tone paint job, the clamshell trunk and frunk, the light bars front and back, the narrow multi-lens headlights, the windshield that extends all the way to the B pillar (Tesla Model X-style), the semi-frameless windows, and the almond-shaped rearview mirrors.",
    "It's all tastefully done, with superb craftsmanship and attention to detail. This theme continues inside, where the Lucid Air really lives up to its name. It's airy and spacious.",
    "We've already discussed the futuristic 34-inch curved Glass Cockpit and retractable Pilot Panel in the tech section above, but the rest of the interior looks and feels extremely modern and premium. The color, material, and finish combinations are especially pleasant.",
    "Unlike traditional luxury sedans, which are almost ostentatious these days, the Lucid Air's interior strikes the perfect balance between Tesla minimalism and Mercedes opulence.",
    "There are few buttons and switches overall, but the basics are covered, including dedicated seat, window, and climate controls, and even a volume thumbwheel. Still, Tesla's UX influence is undeniable - especially with the turn signal and gear selector stalks.",
    "Similarly, the rearview mirror and steering wheel position can only be controlled from the Pilot Panel - ditto the glovebox latch. At least the vents can still be adjusted manually.",
    "The two-spoke steering wheel includes a triplet of buttons and a thumbwheel on each spoke for DreamDrive (left) and multimedia (right).",
    "Unfortunately, in the car we drove, those thumbwheels didn't feel premium enough in terms of tactile feedback.",
    "Then again, that car was pre-production. Everything else was of high quality - especially the materials, which include leather, wood, fabric, and alcantara.",
    "The two-tone design of the exterior continues in the interior, where the floor color in the front extends to the rear seats, and the dashboard color extends to the front seats. Additional features include massaging, heated, and ventilated seats plus a glass roof for the rear passengers.",
    "Space is abundant in the Lucid Air. The flat floor provides ample legroom and headroom for the driver and passengers, even in the back seat, and there's plenty of space in the trunk.",
    "Despite the sloping rear end, this car isn't a hatchback, but the rear seats do fold 40/60 and feature a passthrough. And with 10 cubic feet (283 liters) of storage, even the frunk is generously sized.",
    "We only drove the Lucid Air Dream Edition (Range variant) for about 20 minutes on the highways and freeways near the company's plant in Casa Grande, so our seat time was limited.",
    "Other than cloverleaf interchanges, there wasn't much of an opportunity to test the vehicle's dynamics since this part of Arizona is rather flat, with mostly straight roads. We'll find out more when we review the Lucid Air sometime in the next year.",
    "The first thing we noticed is that the seating position is higher than we expected for such a low and sleek vehicle. It's not Tesla Model 3 or Porsche Taycan low, but then again, it's not crossover high, either.",
    "After adjusting everything to our liking and getting a quick onboarding from the Lucid representative in the passenger seat, we drove off. In a nod to Tesla, there's no power button here - just press the brake pedal, pick a direction, and go.",
    "Before we continue, let's dive into some technical details. The Lucid Air's body is made of aluminum, and the bottom of the battery pack is made of an aerodynamically shaped glass-fiber reinforced ballistic composite which incorporates part of the rear diffuser.",
    "While weight saving is a top priority for Lucid, the car still clocks in at 5,050lbs (2,290kg). Yet unlike other heavy vehicles, there's no air suspension here - just adjustable dampers.",
    "As such, the drive modes adjust the stiffness - but not the ride height - of the five-link front and rear suspension.",
    "Speaking of which, there are three drive modes - Smooth, Swift, and Sprint - each one stiffer, with two levels of regen braking (up to 0.3g).",
    "Following in Tesla's footsteps, the Lucid Air's brakes are purely hydraulic (not blended), and you can choose between hold (for one-pedal driving) and roll modes, and toggle idle creep on and off.",
    "The brakes on the pre-production car we drove - while working fine - didn't feel quite right, requiring more pedal travel than expected. Other journalists in other cars didn't experience this, so we'll reserve judgment for our review.",
    "The ride is fantastic - the Lucid Air is supremely comfortable, and soaks up bumps and surface roughness without being soft or numb. Handling is excellent, too, and the chassis is well sorted.",
    "Again, we only scratched the surface in terms of dynamics, but the Lucid Air seems pretty agile for such a large car. It's also incredibly quiet - as you'd expect for such a premium EV.",
    "Obviously, acceleration is outstanding. While the fastest Sprint mode was off limits during our drive, Swift mode already packs a nice punch, offering the same kind of neck snapping kick we've experienced in Tesla's performance models before.",
    "Smooth mode softens the blow a little, but is still satisfyingly quick. As for the steering, it's precise and well tuned, with decent feedback for a modern setup.",
    "Like damper stiffness and throttle response, the steering weight changes slightly based on the drive mode. Lucid's done a great job scaling up these drive modes from comfort to performance. And overall, we came away very impressed with the way this electric car drives.",
    "But there's a lot more to the Lucid Air than a top notch driving experience. This car combines amazing specs, leading technology, and sophisticated design into an upscale package that doesn't feel pretentious or bloated.",
    "Basically, it combines the best attributes of the Tesla Model S and the Mercedes EQS. As such, it might just become the yardstick by which all future luxury performance EVs are measured. Now that's a big deal."
  ],
  "headers": {
    "3": "Lucid Air price and availability",
    "6": "Lucid Air specs and features",
    "14": "Lucid Air tech",
    "32": "Lucid Air design",
    "47": "Lucid Air driving impressions"
  },
  "links": {
    "Porsche Taycan": "https://www.techradar.com/news/porsche-taycan-4s-review",
    "Mercedes EQS": "https://www.techradar.com/news/mercedes-eqs",
    "iPad Air": "https://www.techradar.com/reviews/ipad-air-4-review",
    "Xpeng P7": "https://en.xiaopeng.com/p7.html",
    "LeEco LeSee": "https://www.techradar.com/news/heres-everything-leeco-announced-at-its-big-us-event-today",
    "Tesla Model 3": "https://www.techradar.com/news/tesla-model-3-long-range-2021-review"
  }
}