{
  "source": "https://www.techradar.com/news/sony-may-start-selling-custom-ps5-faceplates-after-securing-a-new-patent",
  "title": "Sony may start selling custom PS5 faceplates after securing a new patent",
  "category": "gaming",
  "updated": "2021-11-23T10:42:57Z",
  "author": "adam-vjestica",
  "summary": "An officially licensed black PS5 might finally become a reality",
  "article": [
    "Sony has been granted a new patent for its PS5 faceplates, which suggests we could see official custom PlayStation 5 faceplates being sold in the future.",
    "The United States Trademark Office granted the patent which is titled 'Cover For Electronic Device' on November 16. While the patent name might be a bit vague, the 11 sketches included show what is undoubtedly the PS5’s faceplates in all their curvy glory.",
    "The patent doesn’t include any information regarding specific colors, but we wouldn’t be surprised to see Sony offer its own black PS5 faceplates, as those have proven the most popular with consumers who aren’t fans of the stock matte white plates.",
    "After shutting down custom PS5 faceplate designers in the past, it appears that Sony has now safeguarded its intellectual property. Third-party sellers began selling PS5 faceplates, which can be removed and reattached to the console, to offer alternatives to Sony’s white and black two-tone color scheme.",
    "Tech branding company Dbrand even went as far as to challenge Sony to sue it when it released its 'darkplates'. The company apparently felt that its matte black faceplates were sufficiently unique to stop Sony from taking legal action, but it turned out that wasn’t the case, as Sony served Dbrand with a cease-and-desist order, with which the company complied.",
    "However, that hasn’t stopped Dbrand from offering a new take on its darkplates, one that supposedly improves upon Sony’s original PS5 faceplate design. Dubbed 'Darkplates 2.0', the new design features a prominent fan cutout and a more svelte design.",
    "Dbrand also offers various skins that can be placed over the glossy portion of the PS5, which is handy, as the plastic can scratch over time if you're using the front USB ports.",
    "Sony faces an unexpected challenge when it comes to selling limited-edition consoles in the future due to the removable nature of the PS5 faceplates. Unlike the Xbox Series X, which has fixed hardware, users probably won’t be willing to pay for a limited-edition PS5 if over 95% of the custom design is found on the faceplates.",
    "Instead, Sony’s best bet is to release custom PS5 faceplates in various colors, or ones that are dedicated to particular titles and marquee releases. It could prove more lucrative than producing custom consoles to sell, and it’ll certainly be interesting to see how Sony approaches this conundrum.",
    "Of course, the only reason why the PS5 faceplates can be removed is so that users can access the internal SSD bay and add more storage. Microsoft's storage solution, meanwhile, involves using a memory card-style SSD which slots into a proprietary port at the back of the console.",
    "If you're interested in upgrading your PS5's storage, don't miss the best PS5 SSD Black Friday deals this November."
  ],
  "headers": {
    "7": "Analysis: Sony could struggle to sell PS5 custom consoles"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "patent": "https://pdfpiw.uspto.gov/.piw?PageNum=0&docid=D0936149&IDKey=AE3DFAA4B3B6&HomeUrl=http%3A%2F%2Fpatft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect2%3DPTO1%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%2Fnetahtml%2FPTO%2Fsearch-bool.html%2526r%3D1%2526f%3DG%2526l%3D50%2526d%3DPALL%2526S1%3DD936149.PN.%2526OS%3DPN%2FD936149%2526RS%3DPN%2FD936149",
    "custom PS5 faceplate designers": "https://www.techradar.com/news/ps5-custom-faceplate-orders-cancelled-as-sony-takes-legal-action",
    "darkplates": "https://www.techradar.com/news/okay-so-i-kind-of-love-the-darkplates-that-have-given-me-a-black-ps5",
    "Darkplates 2.0": "https://www.techradar.com/news/ps5-darkplates-maker-defies-legal-action-with-brand-new-design",
    "PS5 SSD Black Friday deals": "https://www.techradar.com/news/ps5-ssd-black-friday-deals"
  }
}