{
  "source": "https://www.techradar.com/news/resident-evil-village-pc-patch-finally-fixes-drm-related-stuttering-and-boosts-frame-rates",
  "title": "Resident Evil Village PC patch finally fixes DRM-related stuttering and boosts frame rates",
  "category": "computing",
  "updated": "2021-07-20T11:34:23Z",
  "author": "darren-allan",
  "summary": "New patch means the game should run much more smoothly in general",
  "article": [
    "Resident Evil Village just got a patch on PC which aims to smooth over frame rate hitches caused by the game’s anti-piracy countermeasures (DRM), while also potentially giving a further frames per second boost via AMD’s new FidelityFX Super Resolution (or FSR for short).",
    "The official Resident Evil Twitter account announced an important update on Steam, noting that “adjustments have been made to optimize the anti-piracy technology” of the game.",
    "As you might have seen, there was a good deal of controversy last week when Digital Foundry discovered that a cracked version of Resident Evil Village ran smoothly, where a retail copy exhibited stuttering issues that messed with the smoothness of gameplay.",
    "Capcom acknowledged the problem and promised it was “working on a patch to address PC performance issues” which “should be available soon”, and it appears that this solution has now arrived.",
    "While the patch notes don’t directly address or mention stuttering, rather just that an ‘optimization’ was applied, it’s obviously enough a fair assumption that this is the cure Capcom was talking about last week. And indeed anecdotal reports on social media indicate that it has improved frame rates for some gamers in situations which were previously proving problematic.",
    "Note that Resident Evil Village actually used a double layer of DRM, with both Denuvo and Capcom’s own anti-piracy tech.",
    "The other change as we mentioned at the outset is the introduction of support for FSR, which is AMD’s equivalent of DLSS (remember that FSR can benefit all graphics cards, not just AMD models, if a game doesn’t have support for DLSS – and Village does not, though it does offer ray tracing). We knew this was coming because AMD had previously let us know that Resident Evil Village was in line for the FSR treatment.",
    "Like DLSS, the idea is to boost frame rates, and again anecdotally, there seem to be some nice little fps bumps for those early adopters who’ve already patched up and reported their findings – like an extra 10 fps for an RX 580 on the ‘high quality’ setting (presumably meaning ‘ultra’ or max image quality).",
    "Via PC Gamer"
  ],
  "headers": {
    "6": "FSR treatment"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "FidelityFX Super Resolution": "https://www.techradar.com/news/amd-wants-you-to-help-choose-which-games-get-fidelityfx-super-resolution-frame-rate-boosts",
    "Digital Foundry": "https://www.eurogamer.net/articles/digitalfoundry-2021-resident-evil-village-cracked-performance-beats-official-code",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "reported": "https://www.reddit.com/r/Games/comments/onrmxh/an_important_update_for_resident_evil_village/",
    "PC Gamer": "https://www.pcgamer.com/resident-evil-village-fsr-denuvo-stuttering-fix/"
  }
}