{
  "source": "https://www.techradar.com/news/the-best-gaming-laptops-could-soon-see-the-same-stock-shortage-as-the-rtx-3080",
  "title": "The best gaming laptops could soon see the same stock shortage as the RTX 3080",
  "category": "computing",
  "updated": "2021-03-05T17:36:11Z",
  "author": "carly-page",
  "summary": "Cryptominers are reportedly buying up RTX 30 gaming laptops",
  "article": [
    "Cryptocurrency miners aren’t just causing a massive GPU shortage, they’re now buying up gaming laptops kitted out with Nvidia RTX 3000-series GPUs.",
    "That’s according to a report at Digitimes, which has heard from industry sources that crypto miners from China, Taiwan, and South Korea are buying large stocks of laptops kitted out with RTX 3000 GPUs.",
    "While the Nvidia RTX 3060 – and reportedly the incoming RTX 3080 Ti – has been throttled against crypto mining, the mobile variant of the GPU isn't, making it an attractive investment for Ethereum miners.",
    "This newly-introduced hash rate limiter, along with the lack of available RTX 30 series graphics cards is only part of the reason that crypto miners are shifting their attention to gaming laptops, DigiTimes reports. It claims that a shrinking price gap between desktop GPUs and gaming notebook has also contributed to the latter's rise in popularity.",
    "Some crypto miners have even gone as far as to lobby manufacturers to create RTX 30-series gaming systems with budget components in order to further reduce that gap, according to the report.",
    "Digitimes said that “notebook shipments were originally expected to slip quarter by quarter in 2021 as the pandemic would be gradually put under control,” but its sources claim “demand from crypto mining may keep the volumes in high gear.”",
    "Thankfully, gaming laptop stock isn’t as depleted as GPUs just yet. While you’ll struggle to get your hands on an Nvidia RTX 3080 or AMD Radeon RX 6800 graphics card, a quick scan of the web shows that there are still plenty of RTX 30-based laptops in stock at MRSP prices.",
    "However, it might not stay this way for long, so if you're in the market for an RTX 30-series gaming laptop, you might want to pick one up soon.",
    "Via: PCGamesN"
  ],
  "headers": {},
  "links": {
    "massive GPU shortage": "https://www.techradar.com/news/processor-and-graphics-card-stock-woes-could-last-into-2022-if-chip-shortage-prediction-is-right",
    "Digitimes": "https://www.digitimes.com/news/a20210303PD213.html",
    "Nvidia RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "and reportedly the incoming RTX 3080 Ti": "https://www.techradar.com/news/nvidia-might-throttle-crypto-performance-of-the-rumored-rtx-3080-ti",
    "lack of available RTX 30 series graphics cards": "https://www.tomshardware.com/uk/news/gpu-shortages-worsen-cryptocurrency-coin-miners-ethereum",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "PCGamesN": "https://www.pcgamesn.com/nvidia/gaming-laptop-stock-issues?amp&__twitter_impression=true"
  }
}