{
  "source": "https://www.techradar.com/news/new-whatsapp-feature-helps-you-avoid-making-a-fool-of-yourself",
  "title": "New WhatsApp feature helps you avoid making a fool of yourself",
  "category": "phones",
  "updated": "2021-05-04T11:44:12Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Check your voice messages before sending them",
  "article": [
    "WhatsApp is working on an updated feature that make it significantly easier to avoid sending unintelligible audio messages to you contacts. While the chat app is most frequently used for text-based chats or video calls, there are times when sending audio messages makes a lot of a sense, and this upcoming change greatly enhances this feature.",
    "Although it's already possible to listen back to a message you have recorded before you send it, the new implementation bring this options forward so it is right under your fingertips. It lets you ensure that what you have said makes sense and is actually audible, for instance, or that you don't sound… well... weird.",
    "At the moment, WhatsApp defaults to sending a message as soon as you have finished recording it. While this may be what you want to happen most of the time, if ou have recorded a message when there is a lot of background noise, you may want to check before sending to make sure that what you’ve said can be heard; this is what the message review function that is is under development at the moment is going to help with.",
    "WABetaInfo, which first shared news of the feature, posted a video showing what message reviewing looks like:",
    "The new implementation makes a great deal of sense. Rather than having to hunt around to play back what you have recorded before you send it, a review option is available as soon as the recording is finished, giving you a safety net and the option to delete a duff take if things don’t sound how you would like. The feature isn't yet available to try in the app, but it will eventually be making its way to both the iOS and Android version.",
    "It is hard to say if the feature will arrive in the main release version of WhatsApp in the exact form we see here, or whether it will undergo further tweaks. It would be nice, for example, if it was possible to toggle the review feature on an off as required, but we'll just have to see what is actually given a public release.",
    "Via WABetaInfo"
  ],
  "headers": {
    "4": "Check it out"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-is-developing-a-review-tool-for-voice-messages/"
  }
}