{
  "source": "https://www.techradar.com/news/netflix-reveals-first-look-at-one-of-its-biggest-new-movies-of-2021",
  "title": "Netflix reveals first look at one of its biggest new movies of 2021",
  "category": "entertainment",
  "updated": "2021-01-11T10:16:27Z",
  "author": "samuel-roberts",
  "summary": "Zack Snyder's Army of the Dead is coming soon",
  "article": [
    "Netflix has revealed a first look at Army of the Dead, its upcoming \"zombie heist\" movie from director Zack Snyder (Watchmen, Batman Vs Superman). Set in Las Vegas during an outbreak – a word that rings a little differently these days – it's about a band of mercenaries who head into 'Sin City' to pull off a big job while fending off the undead that populate the streets.",
    "While Netflix hasn't set a release date for the film yet, besides 2021, we're expecting to see it in the first half of this year. It'll be accompanied by a prequel movie and an anime series – so Netflix is going all in on Snyder's new creation. According to a recent interview with EW, the director came up with Army of the Dead's premise after filming 2004's Dawn of the Dead remake.",
    "Snyder says the movie has \"warmth and real emotion\", as well as lots of zombies to kill. This outbreak started in Area 51, then spread onwards – a wall has been erected around Las Vegas to try and keep the zombies under control. The movie was apparently stuck in development for years at Warner Bros, but Netflix was happy to jump in and help Snyder release it.",
    "The ensemble cast features Dave Bautista, Tig Notaro, Garret Dillahunt and Hiroyuki Sanada, among many others. Here are the first images:",
    "As mentioned, Army of the Dead will land on Netflix at some point in 2021.",
    "This is likely to be one of the bigger movies of 2021 generally, simply because theatrical releases are so uncertain for the time being. While HBO Max's decision to stream 2021 theatrical releases like The Matrix 4 and The Suicide Squad will make big waves as people around the world look for new things to watch, the wider schedule is likely to continue shifting around as the pandemic continues.",
    "Netflix's track record with blockbuster-like movies is a little spotty, but 2020's Extraction and The Old Guard helped to pass the time. A big, expensive zombie movie in 2021 sounds like it'll hit the spot – even if we find Snyder's filmography a little inconsistent generally."
  ],
  "headers": {
    "5": "Will Netflix dominate movies in 2021?"
  },
  "links": {
    "anime series": "https://www.techradar.com/best/best-anime",
    "EW": "https://ew.com/movies/zack-snyder-army-of-the-dead-netflix/",
    "HBO Max's decision to stream 2021 theatrical releases": "https://www.techradar.com/news/the-matrix-4-the-suicide-squad-and-dune-will-come-to-hbo-max-the-same-day-as-they-hit-theaters"
  }
}