{
  "source": "https://www.techradar.com/news/windows-11-running-slow-microsofts-ongoing-ssd-problems-could-be-to-blame",
  "title": "Windows 11 running slow? Microsoft's ongoing SSD problems could be to blame",
  "category": "computing",
  "updated": "2021-12-08T14:31:00Z",
  "author": "matt-hanson",
  "summary": "NVMe SSD speeds are being halved – but where’s the fix?",
  "article": [
    "Windows 11 continues to suffer from a problem where some NVMe SSDs are running more than 50% slower, and Microsoft still hasn’t fixed it. The issue has been plaguing some Windows 11 users since the operating system was in beta earlier this year, so the fact that several months later the problem persists has led many people to wonder when Microsoft will release a fix.",
    "As MSPoweruser reports, a user ran CrystalDiskMark benchmark tests for the Samsung 980 Pro SSD and found that random write speeds are drastically cut.",
    "So, if your Windows 11 PC appears to be running slowly and you are using an NVMe SSD, this could be the culprit.",
    "When this issue was first identified in the Windows 11 beta, Microsoft acknowledged the problem. However, no fix has been released, and it’s not entirely clear what’s causing the problem, though some people suggest it’s the virtualization-based security of Windows 11 that’s to blame.",
    "Whatever the cause, this is one of the more serious Windows 11 problem we’ve seen, and the fact that there has yet to be a fix around three months after it was discovered is concerning. It could mean that a fix is harder to implement. This won’t be welcome news for anyone affected by this problem.",
    "It’s not a good look for Windows 11, either. Microsoft wants more people to upgrade to the new operating system, but ongoing problems like this are just going to put people off. Microsoft will need to come up with a fix, and fast."
  ],
  "headers": {
    "3": "Analysis: Where’s the fix?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "MSPoweruser reports": "https://mspoweruser.com/windows-11-is-still-halving-nvme-ssd-write-speeds/",
    "Windows 11 problem": "https://www.techradar.com/how-to/windows-11-problems-how-to-fix-the-most-common-issues"
  }
}