{
  "source": "https://www.techradar.com/news/heres-more-evidence-samsung-is-unveiling-its-new-foldables-and-watches-on-august-11",
  "title": "Here's more evidence Samsung is unveiling its new foldables and watches on August 11",
  "category": "phones",
  "updated": "2021-07-19T00:57:50Z",
  "author": "david-nield",
  "summary": "An official-looking promo image appears",
  "article": [
    "We're eagerly awaiting confirmation of when Samsung is going to show off the Galaxy Z Fold 3, the Galaxy Z Flip 3, the Galaxy Watch 4, the Galaxy Watch 4 Classic, and the Galaxy Buds 2 off to the world– and it now seems more likely that the big day is going to be August 11.",
    "That's per a Twitter post from Evan Blass, one of the most reliable tipsters in the business. Blass seems to have got hold of an official promotional image for the next Samsung hardware event, which are usually given the Unpacked label (like the one in January).",
    "The picture includes a couple of shapes that could well be representing the Galaxy Z Fold 3 and Galaxy Z Flip 3 foldables – one with a more conventional folding hinge running vertically, and the other with a folding hinge running horizontally across the display, creating a clamshell form factor.",
    "According to the image, the event gets underway at 5pm Moscow time – to save you having to get your time zone maps out, that's 7am PT / 10am ET / 3pm BST (that's midnight AEST on August 12, so adjust your calendars and your sleep schedules accordingly, if you need to.",
    "The August 11 date isn't a completely new one: we had heard the same date from another source, and it would make sense considering the Samsung Galaxy Z Fold 2 made its debut in August 2020. Samsung likes to keep on the same schedule each year.",
    "August 3 is another potential date that we've heard about, though with the latest leak it would seem that August 11 is the front runner – it's possible that even Samsung itself hadn't decided until fairly recently when the big day would be. With most hardware launches now virtual events, it's easier to change the dates at short notice.",
    "While we've heard a lot about these products already in terms of leaks and rumors, some questions remain – not least the status of the Samsung Galaxy S21 FE phone, which may or may not get unveiled at this event. What's more certain is that the Galaxy Note 21 has been canceled, with the fate of the Note 22 unclear at this point.",
    "If the August 11 date is correct, then it should be being made official very soon – and we will of course bring you all of the product announcements as they're made from what should be one of the biggest hardware events of the year."
  ],
  "headers": {},
  "links": {
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "a Twitter post": "https://twitter.com/evleaks/status/1416536195979436035",
    "the one in January": "https://www.techradar.com/news/samsung-galaxy-s21-launch-date",
    "heard the same date": "https://www.techradar.com/news/samsung-may-launch-the-z-fold-3-z-flip-3-galaxy-watch-and-more-on-august-11",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "we've heard about": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21"
  }
}