{
  "source": "https://www.techradar.com/news/nvidia-prepares-windows-11-for-gamers-with-official-gpu-drivers",
  "title": "Nvidia prepares Windows 11 for gamers with official GPU drivers",
  "category": "computing",
  "updated": "2021-07-20T10:41:54Z",
  "author": "matt-hanson",
  "summary": "New OS coming along nicely",
  "article": [
    "Windows 11 has taken an important leap forward for PC gamers, with Nvidia releasing official drivers for the upcoming operating system.",
    "While Windows 11 won’t be officially released until later this year (most rumors point to an October launch), you can download and install an early version of Windows 11 already to help out with testing.",
    "So, there are already a decent amount of people using Windows 11, which means official driver support will help improve the experience for anyone helping to test the operating system.",
    "It will also give Nvidia and Microsoft early information about any potential issues with the drivers, so when Windows 11 officially releases, fully working drivers should be available on day one.",
    "According to Windows Latest, people using Windows 11 who have installed the driver have already seen improvements in the operating system.",
    "To install the driver, use Nvidia’s GeForce Experience app, which handily alerts you when there’s a new driver update.",
    "Nvidia’s latest driver brings other improvements for PC gamers on both Windows 10 and Windows 11, including DLSS support for Red Dead Redemption 2 and improved compatibility with gaming monitors.",
    "Nvidia’s GeForce driver version 471.41 for Windows 11 (as well as Windows 10) follows Intel’s move to release official drivers for Windows 11 as well. Even if you don’t do a lot of gaming, having updated graphics drivers can improve the overall performance of your PC – especially with software that has lots of graphical effects, like Windows 11.",
    "Microsoft is really pushing Windows 11 as an operating system that PC gamers will want to use, including features such as Auto HDR. This means it’s essential that Windows 11 is supported by drivers from the likes of Nvidia and Intel. We’ll likely see AMD release Windows 11 drivers soon as well.",
    "It also shows how well Windows 11 is coming along, and means we should be seeing the release relatively soon.",
    "Microsoft has benefitted from most PC gamers running its Windows operating system, due to how many games support it compared to alternatives such as macOS and Linux.",
    "However. Valve, the company behind the popular Steam store, has been pushing for more Linux support in recent years, even going so far as creating its own Linux distribution, Steam OS, and Proton, a compatibility layer that allows Windows games to run in Linux.",
    "Valve also recently announced the Steam Deck, a handheld gaming device that runs on Steam OS. If it is a success, it could show gamers that Linux is now a viable alternative to Windows – and that could be bad news for Microsoft."
  ],
  "headers": {
    "4": "Graphical improvements",
    "7": "Why this matters"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "point to an October launch": "https://www.techradar.com/news/did-intel-just-leak-the-windows-11-release-date",
    "download and install an early version of Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "to Windows Latest": "https://www.windowslatest.com/2021/07/20/after-intel-nvdia-delivers-official-gpu-drivers-for-windows-11/",
    "Nvidia’s GeForce Experience app": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44270&u1=trd-us-8076935490289355000&murl=https%3A%2F%2Fwww.nvidia.com%2Fen-gb%2Fgeforce%2Fgeforce-experience%2F",
    "DLSS support for Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-gets-nvidia-dlss-support-to-make-it-run-better-on-your-pc",
    "Auto HDR": "https://www.techradar.com/news/windows-10-is-finally-embracing-hdr-but-what-took-it-so-long",
    "Steam Deck": "https://www.techradar.com/news/steam-deck"
  }
}