{
  "source": "https://www.techradar.com/news/what-does-free-antivirus-software-do",
  "title": "What does free antivirus software do?",
  "category": "computing",
  "updated": "2021-03-09T11:49:14Z",
  "author": "darren-allan",
  "summary": "Solid fundamentals and plenty more... if you pick the right one",
  "article": [
    "There are two categories of antivirus, broadly speaking: free apps and ones you must pay for. In this article, we’re focusing on the freebie software and, specifically, on what it actually does to keep you safe online. But in answering that, another way to look at this is what free antivirus doesn’t do – and how paid-for apps can provide extra coverage.",
    "Because as we’ll see, the extras you get with a premium product are the main difference between the two categories. Although as will become equally clear, the defenses provided by a free antivirus – at least one from a reputable security software vendor – are not to be sniffed at.",
    "The basic function of a free antivirus – or how any antivirus app works, for that matter – is to run protective routines that will detect any intrusion or suspect occurrence on your PC, and stop anything malicious in its tracks before it does any damage.",
    "This is achieved via what’s normally referred to as the antivirus engine of the app, which provides real-time protection for your system, scrutinizing any files as they arrive or processes that start up. It uses what are known as ‘definitions’ (which you can think of as fingerprints of malware), and if anything suspect is spotted, it’ll take swift action and shut down the offender by quarantining it.",
    "Antivirus definitions are updated very regularly to keep pace with newly emerging strains of malware, but a good antivirus engine will also employ heuristic technology as a backup and safety net. This can spot potential malware by its very behavior, and so the idea is it can catch anything which is so new that it doesn’t have its definition (fingerprint) available in the antivirus engine.",
    "Therefore, the antivirus engine has two main lines of real-time defense, keeping your PC or smartphone constantly protected. Plus away from that real-time protection, you can manually run a scan for malware – a deep and thorough one if you wish – at any time.",
    "That’s how a good free antivirus works... like the ones in our best free antivirus list. And here’s the key thing about free antivirus from a reputable high-quality provider: you’re actually getting exactly the same core protection as you are from the paid app in terms of that antivirus engine. Which is nice considering you’re paying nothing for the privilege.",
    "While free antivirus apps might provide the same strong fundamental defenses as premium efforts, as we mentioned at the outset, what freebies lack is all the extras that paid products bristle with.",
    "You’ll get a lot more features with the paid-for version from any given software maker, and rightly so – after all, paying users should get more. That’s only fair. But don’t get the impression that free antivirus apps only give you a barebones set of features; they do much more than this.",
    "In fact, some free antivirus products come with a decent helping of additional features, like a firewall, dedicated anti-phishing or web protection, and the likes of an integrated password manager. Some security firms even include a VPN – albeit with inevitable restrictions on the data allowance – with their free app, such as Avira Free Antivirus. Or you may get a basic system of parental controls, as with Sophos Home Free.",
    "So, while you obviously won’t get everything with a free antivirus app compared to a paid one, you’ll often get some pretty enticing extras delivered. All of this additional security coverage will help keep you safer and more secure online, above and beyond the solid core antivirus protection that any given free app delivers (or should deliver).",
    "On the negative front, one unwelcome thing that many folks might expect a free antivirus to do is bombard them with adverts, because after all, there’s not really any such thing as a free lunch, right? You’ve got to pay somehow, in time or being hassled, if not money?",
    "While it’s true that many free apps do use advertising as a way of monetization and creating a revenue stream, antivirus apps or otherwise, a good free antivirus will keep this kind of activity to a minimum. Indeed, some of the top-rated free antivirus programs out there don’t show any ads at all.",
    "Most importantly, a free antivirus ably polices your PC, and provides core antivirus protection – both real-time and on-demand scanning – which is equal to that of paid-for apps (at least when it comes to the reputable security brands out there).",
    "That said, premium antivirus products will go well beyond that fundamental protection to deliver a whole host of additional features – but equally, free antivirus does a surprising amount in terms of providing nifty extras, depending on the exact app you’re looking at, of course.",
    "As ever, try to go for a highly rated provider – check out our free antivirus roundup to see our top picks – and remember that one of these apps will ensure robust protection for your PC."
  ],
  "headers": {
    "2": "Fundamental function",
    "7": "Extras, extras…",
    "11": "Ad central?",
    "13": "What does free antivirus software do?"
  },
  "links": {
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "how any antivirus app works": "https://www.techradar.com/news/how-does-antivirus-software-work",
    "best free antivirus": "https://www.techradar.com/best/best-antivirus#best-free-antivirus-downloads",
    "same core protection as you are from the paid app": "https://www.techradar.com/news/is-free-antivirus-safe",
    "password manager": "https://www.techradar.com/best/password-manager",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "Avira Free Antivirus": "https://www.techradar.com/reviews/avira-2020-antivirus-solutions#section-avira-free-antivirus",
    "Sophos Home Free": "https://www.techradar.com/reviews/sophos-2020-antivirus-solutions#section-sophos-home-free",
    "free antivirus": "https://www.techradar.com/best/best-antivirus#best-free-antivirus-downloads"
  }
}