{
  "source": "https://www.techradar.com/news/ethereum-price-passes-another-major-landmark",
  "title": "Ethereum price passes another major landmark",
  "category": "computing",
  "updated": "2021-05-10T10:00:36Z",
  "author": "mike-moore",
  "summary": "Ether price rises beyond $4,000 for the first time in another Ethereum boost",
  "article": [
    "Another strong weekend has seen the price of Ether, the native cryptocurrency of the Ethereum blockchain, go past the value of $4,000 per coin for the first time.",
    "In another major show of strength, the world’s second largest cryptocurrency behind Bitcoin saw gains of more than 6% for the day, and is currently being traded at over $4,100.",
    "This follows another strong weekend for cryptocurrencies as a whole, helped in part by the widely-advertised appearance of Tesla CEO and crypto super-fan Elon Musk on hit US TV show Saturday Night Live.",
    "The news appears to be the latest result of the cryptocurrency bull run (meaning a sustained period of growth) that extends back to November 2020, at which point Ether was valued at just $500 per unit.",
    "This has meant that Ether, whilst still valued far lower than Bitcoin, which is currently priced at roughly $59,500, has provided a much superior return in recent months.",
    "The value of Ether has now more than quadrupled since the turn of the year, with Bitcoin doubling in price over the same timeframe. Since the start of the bull run, meanwhile, the Ether price has increased by more than 500%, versus the circa 315% rise exhibited by its more famous counterpart.",
    "Traditionally, movements in the price of Bitcoin have acted as a bellwether for the performance of Ether. However, despite Bitcoin faltering in the last couple of weeks, the price of Ether has continued to climb.",
    "Commentators have attributed this growth to a combination of factors, many of which are linked to qualities that distinguish the Ethereum network from others like it.",
    "For example, Ethereum provides the infrastructure for both the NFT and decentralized finance (DeFi) industries, both of which have experienced explosive growth within the last six months or so.",
    "The Ethereum blockchain has also enjoyed a significant recent upgrade, making it much more of a player in the cryptocurrency space as a whole.",
    "Others have suggested the price of Ether has also benefited from the ongoing transition to Ethereum 2.0, which will ultimately push the network towards a more sustainable, efficient and scalable model.",
    "As part of this process, the introduction of a mechanism known as sharding will improve the network’s throughput dramatically, allowing Ethereum to compete more effectively with legacy payments systems.",
    "According to CoinMarketCap, the total sum of ether tokens in circulation is $477 billion, compared with $1.1 trillion for bitcoin and $69 billion for dogecoin.",
    "However, while it is easy to be taken in by the online frenzy and graphs sawing up and to the right, anyone looking to catch this latest wave should exercise caution. Cryptocurrencies remain an extremely volatile (and therefore inherently risky) asset class and, as many learned the hard way in 2017, a significant market correction could spell disaster for investors unable to absorb the losses.",
    "TechRadar is supported by its audience. TechRadar does not endorse any specific cryptocurrencies or blockchain-based services and readers should not interpret TechRadar content as investment advice. Our reporters hold only small quantities of cryptocurrency (under $100 in value), as is necessary to perform wallet and exchange reviews, and do not hold shares in any publicly listed cryptocurrency companies.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Ethereum price high"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "traded at over $4,100": "https://www.coindesk.com/price/ethereum",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "NFT": "https://www.techradar.com/news/nfts-are-seriously-hot-right-now-but-were-falling-into-a-familiar-trap",
    "DeFi": "https://www.techradar.com/news/investing-in-defi-is-seriously-risky-but-maybe-it-doesnt-have-to-be",
    "Ethereum 2.0": "https://www.techradar.com/news/ethereum-20-goes-live-next-month-heres-why-thats-a-huge-deal",
    "payments": "https://www.techradar.com/best/best-payment-gateways",
    "Reuters": "https://www.reuters.com/technology/ether-bursts-past-4000-other-cryptos-firm-2021-05-10/"
  }
}