{
  "source": "https://www.techradar.com/news/remastered-gta-trilogy-is-available-again-on-pc-via-rockstar-games-launcher",
  "title": "Remastered GTA Trilogy is available again on PC via Rockstar Games Launcher",
  "category": "gaming",
  "updated": "2021-11-15T01:48:59Z",
  "author": "harry-domanski",
  "summary": "Rockstar promises it’s working on Definitive Edition's performance",
  "article": [
    "Plagued from the outset with a number of meme-worthy bugs, glitches and performance issues, there's no doubt that it's been a messy launch for GTA: The Trilogy – The Definitive Edition, with Rockstar even removing the game from sale on PC and taking down its Games Launcher. This, at least, has now been undone.",
    "The game publishing giant has revealed in an official tweet that the collection is once more available through its Rockstar Games Launcher, allowing those who have already purchased it to play the title, and those who haven't to go ahead and buy it... if they dare.",
    "As revealed in an earlier tweet from Rockstar, the reason for the Games Launcher being down (and more specifically, why it occurred simultaneous to the launch of the Trilogy) was that its team needed to \"remove files unintentionally included in these versions\".",
    "While not explicitly stated by the developer, these files have been reported (as first covered by Video Games Chronicle) to include developer notes, music from the initial release of the game that the company no longer holds licensing for, as well as the controversial and sexually explicit Hot Coffee mini-game.",
    "All of these offending files were disabled from appearing within the game when played, but were still readily accessible to dataminers and anyone else willing to dive into the PC version's code.",
    "Not only did this mean that the game was unavailable to play or purchase for the past few days, but with the Rockstar Games Launcher down for some time, PC gamers couldn't even play other titles from the developer during this window.",
    "Rockstar also mentioned in its latest tweet that it's \"working to improve and update overall performance\", and while this may be seen as a light at the end of the tunnel, we can't help but feel that the train is thoroughly derailed at this stage...",
    "The GTA Trilogy launched on November 11 across Playstation 5, Xbox Series X/S and Nintendo Switch consoles as well as PC and even PS4 and Xbox One, however the experience of gamers across all platforms has been far from ideal.",
    "The collection contains 'remastered' editions of three seminal titles from the Grand Theft Auto franchise – GTA III, GTA: Vice City, and GTA: San Andreas – but users and critics alike have panned the 'Definitive Edition' as being an insult to the classic games.",
    "This is due to a host of bugs, questionable re-modelling and re-texturing implementation, and performance issues – even on current-gen consoles like the XSX and PS5.",
    "As we discussed in this opinion piece, the Nintendo Switch release was especially poor, and we covered why we deserve better than this messy remaster of GTA 3 in detail as well.",
    "We're tentatively optimistic that Rockstar is heeding all of these complaints and its promise to improve the performance of this collection will eventually give the Trilogy the love it deserves, but in the meantime we don't suggest you buy it."
  ],
  "headers": {
    "7": "Opinion: It's available, but don't buy it"
  },
  "links": {
    "GTA: The Trilogy – The Definitive Edition": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "Rockstar even removing the game from sale on PC": "https://www.techradar.com/news/rockstar-has-removed-gta-the-trilogy-the-definitive-edition-from-sale-on-pc",
    "tweet": "https://twitter.com/RockstarSupport/status/1459311246789038089",
    "Video Games Chronicle": "https://www.videogameschronicle.com/news/gta-trilogy-chaos-continues-as-hot-coffee-sex-files-reportedly-uncovered/",
    "Playstation 5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch release was especially poor": "https://www.techradar.com/news/busted-dont-buy-gta-trilogy-definitive-edition-on-nintendo-switch",
    "this messy remaster of GTA 3": "https://www.techradar.com/news/gta-3-deserved-better-than-this-messy-definitive-trilogy-remastering"
  }
}