{
  "source": "https://www.techradar.com/news/cant-stand-the-macbook-notch-theres-an-app-for-that",
  "title": "Can't stand the MacBook Pro notch? There's an app to hide it",
  "category": "computing",
  "updated": "2021-10-26T16:05:08Z",
  "author": "daryl-baxter",
  "summary": "Opinion: Would you hide the notch?",
  "article": [
    "Apple’s new MacBooks are out and reviews are glowing, especially with the return of ports that’s sure to help pros in their workflows.",
    "However, a big bone of contention for many has been the notch. It’s at the top of the display which houses the camera while not getting in the way of you doing work.",
    "While we didn’t see an issue with it in our MacBook Pro 14-inch (2021) review, some are still wanting to find ways to hide the notch regardless, which is where a few apps have appeared to grant this wish. But it doesn’t seem needed in the long run.",
    "The MacBooks have only just been released, and yet there’s apps that already hide the notch. The menu bar takes care of this by blending in with the notch, while it disappears when an app switches to full-screen.",
    "When I upgraded to an iPhone X in 2017, it took me a few weeks to ignore the notch. Now, it’s something I accept.",
    "With a notch on a 14-inch or 16-inch display, it’s something you’re barely going to notice. But, there are two apps that can hide the notch if you really want to.",
    "However, you may still want something to hide it completely.",
    "Forehead is a utility that can make the Menu Bar black, and a future update will even add a virtual notch if you’re feeling left out on your older Mac. This is free but the developer does have a donation option.",
    "TopNotch also tries to fix the notch problem by making sure that the Menu Bar stays black across any window that you’re using. It runs in the background so if you change your wallpaper, the app will adjust the notch accordingly. It’s also another free download.",
    "The notch is an example of not knowing how something truly is until you see it in person. You’ll be able to test out the new MacBooks at your nearest Apple Store, or another authorized vendor to judge for yourself.",
    "But I suspect that the MacBook Pro notch will eventually be accepted as much as the notch on the iPhone was. There’s an argument for why FaceID isn’t on the new MacBooks, which is valid. But if you want a screen with a thin bezel, this is the compromise that Apple argues needs to be made.",
    "There’s undoubtedly going to be improvements in the future where the notch is reduced in size, similar to the iPhone 13 Pro. However, it’s not something that should make you hold off from purchasing if you’ve been waiting for these new machines.",
    "These are the best MacBooks that Apple has designed in years, with a new focus on what makes a great professional laptop. For a bigger display that also has ProMotion at 120Hz, it’s a small price to pay for what you’re getting overall."
  ],
  "headers": {
    "3": "On the head, Mac",
    "9": "Much ado about nothing"
  },
  "links": {
    "MacBooks": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "MacBook Pro 14-inch (2021) review": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "Forehead": "https://goodsnooze.gumroad.com/l/nASbe",
    "TopNotch": "https://topnotch.app/",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "best MacBooks": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725"
  }
}