{
  "source": "https://www.techradar.com/news/intel-locks-down-all-remaining-tsmc-3nm-production-capacity-boxing-out-amd-and-apple",
  "title": "Intel locks down all remaining TSMC 3nm production capacity, boxing out AMD and Apple",
  "category": "computing",
  "updated": "2021-08-12T19:15:25Z",
  "author": "john-loeffler",
  "summary": "Intel's 3nm orders include a new GPU and three server chips",
  "article": [
    "Intel may have pulled a fast one on its industry rivals by buying up a majority of the 3nm node capacity at TSMC in order to fabricate its new GPU and a number of server chips, something that could inhibit AMD and Apple from ramping up production of their own next-gen chips in 2022.",
    "Production with the 3nm node is expected to start in Q2 2022, with mass production expected to start in mid 2022, according to Wccftech. Production capacity would reach about 4,000 in May of next year, with mass production capacity ramping up to 10,000 wafers a month.",
    "Intel, unlike AMD or Apple, has its own fabrication plants that it uses for most of its chip production, though it has struggled in recent years to hit its own development roadmap targets. None of the 3nm node process orders will be for its consumer market processors, namely Raptor Lake, which is expected to launch in mid-to-late 2022.",
    "Instead, reports indicate that the product lines in the order will coming out of its graphics and server units, specifically a new GPU and three new server processors, most likely next-gen Xeon processors meant for data centers.",
    "We don't know much about any of these chips yet, though the GPU could be the long-awaited Intel discrete graphics card based on the company's Iris graphics processor.",
    "The Intel Iris Xe graphics card has been in the works for a long time now, but we've yet to ever really see it beyond some prototypes and presentation material. If Intel is making a substantial investment in its graphics unit however – and eating up a substantial chunk of TSMC's 3nm node capacity in the process – then we certainly hope this is an indication that Intel's discrete graphics card is on its way to customers.",
    "While we're not expecting it to immediately dethrone AMD and Nvidia in the graphics card space, turning things into a three-way fight rather than a head-to-head matchup will push the three companies to innovate even more. This can only be good for gamers and other PC enthusiasts in the end, assuming we're ever able to get our hands on any of these graphics cards in the first place."
  ],
  "headers": {
    "4": "Analysis: Is the Intel Iris Xe graphics card finally making it to production?"
  },
  "links": {
    "Wccftech": "https://wccftech.com/intel-grabs-majority-tsmc-3nm-capacity-4-server-graphics-chips-production-q2-2022/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Wccftechcom+%28WCCFtech.com%29",
    "Raptor Lake": "https://www.techradar.com/news/intel-raptor-lake-cpu-details-mistakenly-spilled-including-compatibility-with-alder-lake",
    "Intel Iris Xe": "https://www.techradar.com/news/intel-xe-graphics-cards"
  }
}