{
  "source": "https://www.techradar.com/news/tiktok-could-be-facing-some-serious-gdpr-charges",
  "title": "TikTok could be facing some serious GDPR charges",
  "category": "computing",
  "updated": "2021-02-17T10:30:04Z",
  "author": "barclay-ballard",
  "summary": "The BEUC has a long list of complaints against TikTok",
  "article": [
    "TikTok has been accused of breaching GDPR rules by the European Consumer Organization (BEUC).",
    "A complaint filed with the European Commission argues that the video-sharing social network misleads users regarding the type of personal data it collects.",
    "The BEUC alleges that TikTok breaches multiple EU consumer rights and fails to protect children from inappropriate content and hidden advertising. As well as its consumer law complaint, the BEUC has notified the authorities of TikTok practices that it believes are in breach of data protection laws.",
    "“We have brought our data protection findings to the attention of Data Protection Authorities in the context of their ongoing investigations into the company,” a BEUC release explains.",
    "“TikTok must also respect its users’ privacy and data protection rights. It should ensure that its policies respect all the obligations under EU data protection law. Data collection, profiling and targeted advertising for all users below 18 should be severely restricted.”",
    "Specifically, the BEUC identifies four practices that it believes require further investigation. Firstly, it argues that several terms in TikTok’s user agreement are unclear and unfair. The fact that TikTok can modify the exchange rate between in-app coins and virtual gifts on the platform is also accused of being unfairly biased against the consumer.",
    "Other practices are also criticized. For example, TikTok encourages users to take part in branded hashtag challenges but does not carry out due diligence to protect children from viewing suggestive content. The BEUC’s fourth complaint concerns misleading users regarding what personal data is collected and why.",
    "Although TikTok has acquired a huge user base in a relatively short space of time, it has also faced hurdles, including security flaws and political disagreements. In support of BEUC’s complaints, consumer organizations in 15 countries have also asked their respective authorities to investigate TikTok's practices.",
    "Via ITPro"
  ],
  "headers": {
    "3": "A long list of complaints"
  },
  "links": {
    "GDPR": "https://www.techradar.com/news/what-is-gdpr-everything-you-need-to-know",
    "social network": "https://www.techradar.com/best/best-social-media-management-tools",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "data protection": "https://www.techradar.com/best/best-data-loss-prevention-service",
    "explains": "https://www.beuc.eu/tiktok#ourdemands",
    "content": "https://www.techradar.com/best/best-content-marketing-tools",
    "security flaws": "https://www.techradar.com/best/best-malware-removal",
    "political disagreements": "https://www.techradar.com/news/tiktok-sale-to-oracle-shelved-by-biden-administration",
    "ITPro": "https://www.itpro.co.uk/policy-legislation/general-data-protection-regulation-gdpr/358620/tiktok-potentially-breaches-gdpr"
  }
}