{
  "source": "https://www.techradar.com/news/this-android-phone-could-have-even-more-ram-than-the-samsung-galaxy-s21-ultra",
  "title": "This Android phone could have even more RAM than the Samsung Galaxy S21 Ultra",
  "category": "phones",
  "updated": "2021-07-02T11:37:37Z",
  "author": "david-nield",
  "summary": "20GB of RAM, yes please",
  "article": [
    "The ZTE Axon 30 handsets are already on sale in some parts of the world, but if the rumor mill is to be believed then another variant could be on the way: one that packs a huge 20GB of RAM inside it, as well as an under-display selfie camera.",
    "As per a report from GizmoChina, ZTE executive Lu Qianhao has taken to Chinese social media network Weibo to tease the arrival of a handset with 20GB of RAM. While no specific phone was mentioned, it seems a member of the ZTE Axon 30 series is the leading candidate.",
    "That's more RAM than most computers manage to pack inside, and it exceeds the 18GB that you can get in the Lenovo Legion 2 Pro and the 16GB offered by the top-end iPad Pros. As for the flagship Samsung Galaxy S21 Ultra, that only goes up to 16GB too.",
    "If this ZTE phone launches, It would set a new high bar for smartphone memory, meaning app switching, file handling and gaming should be super-speedy. However, there is speculation that some of this memory might be virtual RAM, where part of the internal storage is 'borrowed' to act like RAM.",
    "While you'd be forgiven for thinking that ZTE was done as far as the Axon 30 series of phones was concerned, the 20GB of RAM rumor isn't the only reason that we think another model is on the way – there's also talk of a variant with an under-display camera.",
    "The ZTE Axon 20 was the first smartphone to market with a forward-facing camera embedded under the screen – a notable achievement, even if it didn't actually take very good photos – so we know that ZTE has the technical know-how to make this happen.",
    "Presumably in the nine months or so since the ZTE Axon 20 made its debut, its manufacturer has figured out how to improve the in-screen camera technology. With that in mind we're hopeful that the photos and videos taken by the selfie camera in the new phone – which might launch this month – are up to par.",
    "We know that other smartphone manufacturers including Xiaomi and Samsung are working on in-screen cameras to help remove the display notch and shrink down the bezel size, so we can expect plenty more handsets featuring the tech to appear in the future."
  ],
  "headers": {
    "4": "New camera tech too"
  },
  "links": {
    "ZTE Axon 30": "https://www.techradar.com/reviews/zte-axon-30-ultra-5g-review",
    "GizmoChina": "https://www.gizmochina.com/2021/07/01/zte-executive-hints-at-a-20gb-ram-phone/",
    "iPad Pros": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Axon 30 series": "https://www.techradar.com/news/zte-axon-30-ultra-5g-announced-with-an-unusual-camera",
    "also talk": "https://www.slashgear.com/zte-axon-30-with-an-under-display-camera-might-launch-soon-01680805/",
    "ZTE Axon 20": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "take very good photos": "https://www.techradar.com/news/this-android-phones-under-display-selfie-camera-isnt-great-but-its-a-sign-of-the-future",
    "Xiaomi": "https://www.techradar.com/news/the-xiaomi-mi-mix-4-could-finally-arrive-this-year-with-an-under-display-camera",
    "Samsung": "https://www.techradar.com/news/a-future-samsung-phone-could-have-an-under-display-camera-based-on-this-patent"
  }
}