{
  "source": "https://www.techradar.com/news/your-microsoft-teams-audio-may-finally-get-less-terrible",
  "title": "The most frustrating part of a Microsoft Teams call could finally get fixed soon",
  "category": "computing",
  "updated": "2021-08-06T16:28:56Z",
  "author": "mike-moore",
  "summary": "New \"Music Mode\" for Microsoft Teams looks to upgrade your audio",
  "article": [
    "Dealing with patchy sound or audio issues when on a Microsoft Teams call may soon be a forgotten worry after the company revealed news of a new update.",
    "The video conferencing platform is set to release \"Music Mode\", an update that it says can improve the quality of audio when on a call - whether speech or your favorite tunes.",
    "The feature, which Microsoft says can help online conferences, concerts and even music lessons, will also offer a range of audio-focused features including noise suppression, mic sensitivity, and even high fidelity mode for the top quality audio.",
    "First revealed back in July 2021, Music Mode is now due to be released within the next few weeks, hopefully solving audio woes for users everywhere.",
    "Microsoft says that for most meetings, Music Mode will probably not be necessary, and users can help protect bandwidth by sticking with their recommended settings.",
    "But when enabled, Music Mode will see Microsoft Teams automatically adjust the audio bit rate based on the available bandwidth - with the company saying it can go down as far as 48 kbps while still being able to deliver good music or audio quality.",
    "\"In music mode, we support up to 32 kHz sampling rate mono audio at 128 kbs, and optimize our audio processing settings for reproducing music with high fidelity,\" Microsoft noted.",
    "Users will also be able to turn off components such as echo cancellation, noise suppression and gain control if needed. Once a meeting starts, however, settings cannot be changed - so you'll need to get everything ready beforehand.",
    "Once a call starts, high fidelity music mode can be turned on and off by clicking on the new icon in the Microsoft Teams bar.",
    "Microsoft recommends that Teams users should opt for high quality external speakers or headset, but advises against Bluetooth models in order to reap the full benefits of the change.",
    "Via WindowsLatest"
  ],
  "headers": {
    "3": "Music Mode for Teams"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Music Mode": "https://www.techradar.com/news/microsoft-teams-update-tackles-one-of-the-most-frustrating-video-conferencing-issues",
    "WindowsLatest": "https://www.windowslatest.com/2021/08/05/microsoft-teams-audio-upgrade-coming-later-this-year/"
  }
}