{
  "source": "https://www.techradar.com/news/heres-more-evidence-moon-knight-on-disney-plus-stars-oscar-isaac",
  "title": "Here's more evidence Moon Knight on Disney Plus stars Oscar Isaac",
  "category": "entertainment",
  "updated": "2021-04-12T09:15:26Z",
  "author": "samuel-roberts",
  "summary": "The actor is photographed ahead of filming",
  "article": [
    "Moon Knight, another TV spin-off from the Marvel Cinematic Universe, is coming to Disney Plus at some point soon. The show has long been reported to star Oscar Isaac as lead Marc Spector, but never officially confirmed by Marvel.",
    "Now, the actor has been snapped in Budapest alongside reported co-star Ethan Hawke ahead of filming – Hawke confirmed he's part of the show back in February, and again mentioned Oscar Isaac's involvement.",
    "Discussing Film originally reported that the show would film in Budapest back in November, so the evidence really is mounting up.",
    "Take a look at the picture below:",
    "When is Marvel finally going to confirm that Oscar Isaac is joining the Marvel Cinematic Universe? Who knows. When the show was discussed at Disney's Investor Day in December 2020, Isaac's participation wasn't part of the presentation – possibly because it was too early to reveal. THR revealed Isaac was in talks for the role back in October.",
    "Moon Knight's showrunner is Jeremy Slater, who previously wrote for The Umbrella Academy, while Mohamed Diab (who made 2016 movie Clash) is the show's director.",
    "Moon Knight is certainly one of the more obscure Marvel heroes to make the leap to live action – though he's been a pretty important character to Marvel on the comics side over the past decade.",
    "He's probably best thought of on a superficial level as a Marvel riff on Batman, except he suffers from dissociative identity disorder.",
    "That means you're likely to see Isaac play a host of different types of personalities in the show. Expect Egyptian imagery to be important in this series, too – in the comics, Spector acquires his powers from a moon god known as Khonshu.",
    "Even compared to WandaVision, then, this show could be a little bit out there."
  ],
  "headers": {
    "6": "Who is Moon Knight, and why should you care?"
  },
  "links": {
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "back in February": "https://twitter.com/ringer/status/1363194961001209857",
    "Discussing Film": "https://discussingfilm.net/2020/11/11/production-tidbits-moon-knight-aquaman-2-ms-marvel-and-more/",
    "THR": "https://www.hollywoodreporter.com/heat-vision/oscar-isaac-in-talks-to-star-in-marvels-moon-knight-for-disney",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained"
  }
}