{
  "source": "https://www.techradar.com/news/why-crash-bandicoot-is-my-game-for-life",
  "title": "Why Crash Bandicoot is my game for life",
  "category": "gaming",
  "updated": "2021-09-11T11:00:00Z",
  "author": "natasha-radmehr",
  "summary": "Opinion: We’ve been tight since 1997",
  "article": [
    "It’s May 1997 and a most un-British sense of optimism is hanging in the air, mingling with the sticky aroma of Impulse O2 body spray. Tony Blair is the new prime minister, the UK has won the Eurovision Song Contest, and the Spice Girls have announced an upcoming film, Spice World. Nobody yet knows it’ll be a rapid tumble downhill from here for all concerned. Life is good.",
    "Life is bloody great, in fact. At the age of 11 I’ve been told I’m Dux of my primary school, which is the dweeb equivalent of being crowned Gala Queen. My entire body trembles with glee when I learn the news, my shell suit gently rustling in delight.",
    "Partly because I’m proud, but mostly because it means I’ll get a present. I’m finally going to have the one thing I’ve been dreaming of for the best part of a year: Crash Bandicoot.",
    "Rewind a few months and I’m in my friend Jenny’s kitchen, the two of us perched on stools in front of a compact television hooked up to a dove-grey console. She’s the first of my friends to get a PlayStation and I’m politely straining at the leash for a shot.",
    "My gaming life thus far has been a steady diet of MS-DOS games played on my dad’s best friend’s hand-me-down computers – Invasion of the Mutant Space Bats of Doom, Prince of Persia, Zork – with monochrome displays and pixels so big you could eat dinner off them. I have a Game Boy for which I own two games, Tetris and Super Mario Land. At night I sneak it out and play it under the duvet with a torch illuminating the screen.",
    "Kids at school chat about their Mega Drives and Sega Saturns, their Ataris and Super Nintendo consoles, and I can’t even visualise what they are and how they work. I’ve only heard boys talk about them, boys with grubby Sonic school bags and spiked-up hair, so subconsciously I think they must not be for girls.",
    "But then Jenny gets a PlayStation.",
    "The disc whirs and Crash Bandicoot bounces onto the screen in glorious, saturated technicolour. My friend expertly navigates to N. Sanity Beach and the room fills with the optimistic, tribalesque music that will become the soundtrack to my summer. She talks me through the controls – X is jump, Square is spin – as she weaves through the jungle, bopping crabs and smashing Wumpa-filled crates. “Ooga-booga!” booms an Aku Aku mask, and we turn to each other grinning and parrot it back. “OOGA-BOOGA!”",
    "Then it’s my turn. I grip a controller for the first time. I play in colour for the first time. I feel the giddy elation of getting three Aku Aku masks and racing invincibly through a level, my heart fluttering as I obliterate everything in my path.",
    "I walk home and tell my parents I really, really want a PlayStation. But what I really, really want is Crash Bandicoot. And then, in the summer of 1997, as a gift for being an unbearable little swot, I get both.",
    "A heat wave descends that summer. The tiny Scottish village I live in smells of hot concrete and cut grass. I don’t go outside much, though, because after considerable begging and pleading my little sister and I have been allowed a small TV in our room. It sits on a shelf with my new toy plugged in below, and me plugged in on a bean bag on the floor.",
    "My rollerblades gather dust, the bike tyres sink and hours dissolve every day as I journey through N. Sanity Island. I munch through packets of Tangy Toms that rim my mouth with dusty crumbs the same lurid orange as my bandicoot chum.",
    "Try as I might, I can’t get beyond Native Fortress at the end of the first island – those shield guys do me dirty every time – so I circle back to the beginning and lap my favourite levels. A round of Boulders floods my body with adrenaline as I swap chasing my pals outside for running away from a rolling rock. I ride the pig in Hog Wild so many times that every leap and dodge is committed to muscle memory. You know that video of the ballerina with Alzheimer’s who can remember how to dance? If I ever suffer the same fate, Hog Wild will be my Swan Lake.",
    "As a not very seasoned gamer in a pre-internet age, I don’t understand why I reach the end of a flawless play in some levels, only to be smashed over the head with the boxes I apparently missed. “My game must be broken,” I think. I express this thought out loud on a rare outing to the swing park and a classmate laughs. “Nah, you need to get the gems. It’s really hard, though. Do you want a cheat code?”",
    "The code, scribbled in pencil, doesn’t magically reveal the hidden boxes. It goes one better and unlocks every single level in the game.",
    "I jump between the three islands in awe, unable to believe my eyes. There are levels shrouded in darkness! Robots! Slime! The bongo drums give way to electro and filthy basslines. I die almost immediately in every level because, well, I’m rubbish, but it doesn’t really matter. I’m just happy to be here, spending my summer holidays pootling around on the Wumpa Islands.",
    "I flirt with Crash over the subsequent years, but when life simultaneously blesses and curses you with the internet, boys and booze, it’s easy to forget your humble roots. I smile fondly when I hear the trilogy has been remastered in 2017, but it’s not until the end of 2018 that I play.",
    "I’ve been driven to seek solace in it after receiving bad news. The kind that winds you. I’m pit-deep in winter and already in hibernation mode; how do you bury yourself when you're already hiding?",
    "In nostalgia, it turns out. Some people have childhood teddies or a well-worn film they turn to in times of trauma and distress. Familiarity is soothing; a cuddle from an old friend. I discover my emotional comfort blanket in the video game I'd fallen in love with 21 years earlier, and dive in headfirst.",
    "This time I'm not messing about. I'm going to complete it. A bit of me is playing for pleasure but overwhelmingly I am seeking something that feels absent from my life: a sense of control. And while Crash seemed to be the master of me when I was 11 years old, I feel that 32-year-old me has a chance of beating it. Especially now the internet exists.",
    "I understand how the first game works now – that I get crystals for getting all the boxes, but some boxes will elude me until I've snared the coloured gems. I know I have to complete certain levels without dying to obtain the coloured gems, and that while Crash might not die on successful attempts, my soul will in the process of getting there.",
    "I become obsessed with the gems; they are my precious, I am Gollum. Every night I come home from work and play intensively until I achieve something; anything. When I discover I can walk the ropes on the bridge levels I want to phone everyone I know, then remember nobody cares because it’s not the 90s any more and they’re all married with kids.",
    "Entire days are spent sliding around in the pissing rain of Slippery Climb on a mission to get the red gem, the most challenging of all. When I make it unscathed past the revolving platforms and flapping birds to the sweet, succulent ruby at the end, my dopamine centre lights up like an arcade.",
    "By January 2019 I can look in the mirror and say: ‘Crash? Completed it, mate.’ Well. The first one, anyway.",
    "Look, we’re in the midst of a pandemic: of course I have returned to the furry ginger embrace of Monsieur Bandicoot. Alongside wearing my pyjamas all day and being able to fetch Magnums from the freezer during meetings, working from home has bestowed on me the greatest blessing of all: Crash breaks.",
    "Between lockdowns and deadlines, new jobs and old wounds, I’ve slowly made my way through the entire trilogy and the fourth game now lies in sight. I’ve cursed the arsehole bees in Diggin’ It, rode to victory on the baby polar bear in Totally Bear and pulsated with rage throughout every gimmicky level of Warped. When I realised I had to get the relics to complete the third game, I almost flushed my controller down the toilet in a huff. But then I persevered, because I’m an adult lady and not a big baby.",
    "My therapist tells me it’s important for anyone’s mental health to have a sense of mastery in life, whether it’s from learning an entirely new skill or completing a piece of work. For me, it has come from Crash. That feeling of ticking off a level, a crystal, a relic, whatever it is, brings a sense of achievement, even if the rest of the world has gone to muck.",
    "It’s strange; I’ve never really been one to reread books or rewatch films because I’m constantly overwhelmed by how much new art there is to discover. Yet I’d happily never play another videogame but Crash. It is my comfort food, my safety net, my virtual holiday home. And I still don’t even know what a bandicoot is.",
    "The original games were developed by Naughty Dog. Activision Blizzard now owns the IP for Crash Bandicoot, and produced the remastered collection, and is currently embroiled in ongoing litigation in regards to claims reporting a workplace culture that allegedly enabled acts of sexual harassment, abuse and discrimination. Read our Activision Blizzard lawsuit timeline of events for ongoing coverage of the events."
  ],
  "headers": {
    "3": "Jenny gets a PlayStation",
    "10": "Summer on the Wumpa Islands",
    "16": "Crash re-landing",
    "24": "Crash Pand(em)icoot"
  },
  "links": {
    "Activision Blizzard lawsuit timeline of events": "https://www.techradar.com/news/activision-blizzard-lawsuit-a-timeline-of-key-events-and-everything-you-need-to-know"
  }
}