{
  "source": "https://www.techradar.com/news/the-best-black-friday-deals-under-dollar50-you-dont-want-to-miss",
  "title": "The best Black Friday deals under $50 you don't want to miss",
  "category": "audio-visual",
  "updated": "2021-11-27T14:25:46Z",
  "author": "mackenzie-frazier",
  "summary": "Black Friday must-haves from Amazon, Best Buy, and Walmart",
  "article": [
    "The 2021 Black Friday deals event is officially underway, and we've already seen some of the best sales leaping from the virtual shelves. If you're looking for today's cheapest offers still around, we've scoured the internet to bring you the best Black Friday deals under $50 and check out our Black Friday deals live blog for all the latest sales and helpful offers still available",
    "From tablets to smart speakers, air fryers, blenders, security cameras, and more, you'll find all the latest tech and home gadgets sitting at excellent prices today from all your favorite retailers, including Walmart, Best Buy, Amazon, and more. So whether you're splashing out on yourself, or looking to get your Christmas gift shopping done early, these are the very best Black Friday deals that won't break the bank. Deals that we're confident won't be bettered over the weekend and into Cyber Monday, some of which are the lowest prices we've ever seen on those products. Deals that are unlikely to be around for long. Black Friday deals that you will want to click on right now.",
    "See more bargains with our guides to the best Black Friday Best Buy deals and the best Amazon Black Friday deals."
  ],
  "headers": {
    "2": "Black Friday deals: quick links"
  },
  "links": {
    "check out our Black Friday deals live blog for all the latest sales and helpful offers still available": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Black Friday Best Buy deals": "https://www.techradar.com/black-friday/best-buy-black-friday-deals",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals"
  }
}