{
  "source": "https://www.techradar.com/news/sony-admits-ps5-restock-issues-likely-to-continue-into-2022",
  "title": "Sony admits PS5 restock issues likely to continue into 2022",
  "category": "gaming",
  "updated": "2021-08-30T09:14:40Z",
  "author": "gareth-beavis",
  "summary": "PS5 supply constraints forcing Sony to warn potential buyers",
  "article": [
    "Sony has confirmed that PS5 restock issues could well continue into the new year, according to a Bloomberg report that cites a recent analyst briefing - corroborating recent reports that it believes more drastic action could be necessary to relieve supply constraints.",
    "Speaking under the condition of anonymity, several analysts have reported that Sony has confirmed it's struggling to keep up with demand for the PS5 thanks to a shortage of the components needed to create the console.",
    "“I don’t think demand is calming down this year and even if we secure a lot more devices and produce many more units of the PlayStation 5 next year, our supply wouldn’t be able to catch up with demand,” Hiroki Totoki, Chief Financial Officer of the Sony Group, is reported to have said in the private briefing.",
    "However, the meeting also saw Sony admit that it does need to improve production as soon as possible to get more consoles onto store shelves worldwide as the PS5 continues to be in short supply across the globe.",
    "This briefing follows on from recent comments made by Sony, where it was posited that if silicon continued to be hard to come by, it might force Sony into redesigning the internal of the PS5 to allow for more components to be sourced and more Playstation 5 units to be made.",
    "The briefing appeared to be one to calm the nerves of analysts and the wider financial world, with Totoki quick to dampen concerns that PS5 interest would drop as the world aims to emerge from the Covid-19 pandemic, with the CFO quoted as saying that the 'market share and reputation' of PlayStation would keep demand high.",
    "However, while PS5 console sales have skyrocketed (despite the lack of stock) the brand hasn't been able to capitalize on lockdown as much as it would like.",
    "With people being forced to stay in their homes, many were turning to online gaming platforms and buying titles digitally, yet Sony confirmed to analysts that active users on the PlayStation Network fell from 114 million to 109 million year on year, and full game purchases were also down on the same point in 2020, when lockdown was enforced in many key territories.",
    "Sony's CFO reiterated that the company had sold nearly 8 million PS5 consoles since the launch in late 2020, and is aiming to sell nearly 15 million by April 2022.",
    "That's a long way behind the PS4, which has sold nearly 116 million consoles since launch in 2013, but Sony is confident the next-gen features of the PS5 will help it outstrip that figure before 2028.",
    "We've contacted Sony for further comment on this story and will update the article with any response.",
    "While it's not a good look for Sony to be unable to give consumers what they want – leading to months of ire so far – a console that can't be bought sends a very strong message.",
    "It says to consumers that the PS5 is clearly a good product that no amount of marketing could manage, (which it is, as we've noted in our in-depth PS5 review) and Sony isn't likely to want to lose that attraction any time soon.",
    "TechRadar's Matt Swider has been working around the clock on Twitter to provide information on when and where to buy the new PS5 (at least in the US), which is incredible when you think it's been on sale for over half a year now and the interest in him helping consumers buy a PS5 console dwarfs that of the Xbox Series X.",
    "That's not to say Sony is artificially deflating PS5 stock – the silicon needed to power these consoles is in short supply thanks to the Covid-19 outbreak, and all consoles makers are struggling to keep up.",
    "The brand suggesting that it could be forced to 'redesign' the console led to many speculating that a full re-launch was on the cards, when in reality it would be smaller changes to the internal architecture that would help allieviate supply chain issues.",
    "Even the ageing Nintendo Switch is still unable to be made at the volumes consumers want, so Sony would need to think about a PS5 Pro and a full redesign to get consumers to want to buy a new kind of console.",
    "While it will be frustrating for the Sony Group that it's not been able to get more consoles into the hands of consumers, who would in turn have subscribed to the PlayStation Network and bought digital copies of games (and, let's not forget, that's where the money is made for Sony) the overall fervour for this console is telling the world that the PS5 is the big next purchase if they're 'lucky' enough to get one."
  ],
  "headers": {
    "5": "PS5 on target to beat PS4 sales",
    "11": "Analysis: PS5 demand is no bad thing"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Bloomberg report": "https://www.bloomberg.com/news/articles/2021-05-10/sony-warns-tight-playstation-5-supply-to-extend-into-next-year",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "it was posited": "https://www.videogameschronicle.com/news/sony-says-its-unlikely-ps5-supplies-will-drastically-improve-this-year/",
    "which has sold nearly 116 million consoles since launch in 2013": "https://www.sie.com/en/corporate/data.html",
    "PS5 review": "https://www.techradar.com/reviews/ps5",
    "Twitter": "https://twitter.com/mattswider?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5 Pro": "https://www.techradar.com/news/will-there-be-a-ps5-pro-in-2020-we-dont-think-so"
  }
}