{
  "source": "https://www.techradar.com/news/windows-10-may-2021-update-is-finally-done-and-should-be-rolling-out-soon",
  "title": "Windows 10 May 2021 Update is finally done and should be rolling out soon",
  "category": "computing",
  "updated": "2021-04-29T10:30:15Z",
  "author": "darren-allan",
  "summary": "21H1 is just a minor update, though, like the one before it",
  "article": [
    "Windows 10’s next (imminent) feature update has officially been christened as the May 2021 Update, and is almost ready to begin rolling out.",
    "We knew that the 21H1 update, as it has been previously known, would be coming very soon, so this is no great surprise – and the first big update of the year landing in May is pretty commonplace (we’ve had a ‘May Update’ for the last two years running).",
    "Microsoft announced that it believes that build 19043.928 is the final version – barring any last-minute hiccups – and that it is now preparing the Windows 10 May 2021 Update to be unleashed on the public at some point next month.",
    "The software giant noted that the May 2021 Update will first be pushed out to testers in the Release Preview channel, although these folks will need to search for and select the download under Windows Update (it’ll need to be manual triggered, in other words, and won’t automatically come to their PC).",
    "As you are likely aware, the May 2021 Update is just a minor upgrade, and it’s the second time in a row that Microsoft has run with one of these (in an unprecedented move).",
    "Even as a minor update, it will bring some changes to Windows 10, naturally, and they include improving Windows Hello with multi-camera support and some security tweaks. However, there’s not a huge amount of stuff here, and nothing really all that interesting for the average user.",
    "A previous rumor indicated that the May 2021 Update would be finished in April, and rolled out in May, and this has proved to be bang on the money (well, barring any last gasp disasters as mentioned)."
  ],
  "headers": {
    "4": "Twice in a row"
  },
  "links": {
    "Windows 10’s": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "May Update": "https://www.techradar.com/how-to/windows-10-may-2020-update-problems-how-to-fix-them",
    "noted": "https://blogs.windows.com/windows-insider/2021/04/28/preparing-the-windows-10-may-2021-update-for-release/",
    "nothing really all that interesting": "https://www.techradar.com/news/microsoft-finally-confirms-the-next-windows-10-update-wont-be-anything-exciting",
    "previous rumor": "https://www.techradar.com/news/windows-10s-next-feature-update-wont-be-arriving-late-rumor-has-it"
  }
}