{
  "source": "https://www.techradar.com/news/hunt-showdown-is-secretly-the-most-forgiving-online-shooter-around",
  "title": "Hunt: Showdown is secretly the most forgiving online shooter around",
  "category": "computing",
  "updated": "2021-09-01T12:00:44Z",
  "author": "robert-zak",
  "summary": "Like a tough judo instructor, it knocks you down a lot but always helps you back up.",
  "article": [
    "If you’ve been on the lookout for a new online shooter to jump into, then just beyond the lurid lights of Fortnite and fireworks of Call of Duty or Battlefield, you may have caught glimpse of Hunt: Showdown - enshrouded in a thick fog of mystery and menace.",
    "It’s easy to be intimidated by what you hear about Crytek’s inimitable shooter, set in the swampy climes of late 19th century Louisiana. It’s PvPvE (Player vs Player vs Environment), where even a rabble of basic zombie grunts can overwhelm a reckless newbie.",
    "Its permadeath(ish) system means that a character you’ve levelled up and played with for hours can be extinguished forever with a single bullet or ill-judged assault on a Meathead, and its dark, clammy atmosphere is enough to give anyone a bad case of the mousey-jitters.",
    "And yet, as someone who isn’t the sharpest of shooters nor endowed with the twitchiest of reflexes, I can say that Hunt: Showdown is deceptively welcoming, filled with little systems that make it more forgiving than many other online shooters today. In fact, in its own way it’s one of the more accessible battle royale-esque shooters around.",
    "Hunt: Showdown relies on some interesting paradoxes. For example, TTK (time to kill) is low and realistic - a single headshot from any gun will kill you, as will a short-range shotgun blast or a couple of well-placed body shots from a pistol.",
    "But even if you fall to a sublime sniper headshot that should by all rights turn your head into a lumpy splattering of expressionist art, you can still be revived by a teammate. There’s no time limit or expiration date on your corpse, nor can an enemy player just shoot you when you’re down to finish you off.",
    "They can burn your body, which will slowly drain your health over time, but this is relatively rare as the enemy needs to have a fiery throwable item on them, and chucking it risks revealing their position.",
    "When you get revived, you lose a health chunk (each hunter has three to four), but if your team manages to banish a monster in the meantime then you get all your health chunks back - effectively resetting the amount of times you can be revived. So yes, you can be shot point-blank in the face with a shotgun, and still end a match with full health.",
    "You’ll be knocked on your ass a lot in Hunt: Showdown - whether by the bullets of other players, the fangs of a venomous spider-boss, or through the chaotic collusion of regular monsters that can still surprise you after dozens of hours of play. But even throughout the course of a single match, it offers you plenty of opportunities to pick yourself up again.",
    "And if you’re feeling overwhelmed or don’t fancy your chances in a particular scenario, you can extract from the mission at any time with your hunter alive, well, and even packing a few trait points if you managed to get some kills in before your escape. You can even jump into a match and simply farm its monsters or passively wait by extraction points to ambush escaping players. There’s no real pressure for you to engage in combat, and it’s up to you how hard you want to press - if at all - in a given match.",
    "There are no distinct mechanics to think about in Hunt: Showdown - no plopping out walls in your wake like Fortnite, nor multiple classes with unique abilities or special gear to call in from the heavens. There’s ‘Dark Sight’, which points you to clues and bosses, but beyond that you only rely upon your weapons, items and, perhaps most importantly, your senses.",
    "That makes Hunt: Showdown a very direct game, free from conveniences like radar, tracking ping markers, or even notifications to say that you’ve killed an enemy player. The sparse UI lets you focus on the environmental cues that you would in a real-life situation - distant gunshots, twigs breaking, dogs barking, or a flustered murder of crows flying overhead to indicate that a player disturbed them in that area.",
    "You don’t need to master fiddly mechanics nor abstract ideas in Hunt: Showdown (though the menus could definitely use some cleaning up). Instead, it engages those skills of deduction and inference that you’d like to think your bravest, most idealised self would implement if you actually found yourself in a hell-stricken 19th century bayou.",
    "The marquee game mode is Bounty Hunt, where you team up with up to two other players to track down a boss, kill it for its bounty, then make for one of the extraction points on the map (with several rival teams doing the same thing). It’s thrilling stuff, partly because the stakes are so high. Win or even just survive a match, and you get to improve your hunter with perks for the next match. Die, and that’s the last you’ll ever see of them.",
    "But Hunt has two other less storied modes that let you gain hunters, money and ‘Bloodline’ experience (the game’s meta-progression through which you unlock traits, weapons and items to buy for your hunters).",
    "The Trials mode is divisive in the community, with players bemoaning the difficulty in attaining the top 3-star rating in many of the challenges. For me, the Trials - which may involve racing through checkpoints or killing ‘x’ amount of a certain type of monster with fire - give me fond flashbacks to my FPS glory days in TimeSplitters: Future Perfect. Sentimentality aside, they give you time to familiarise yourself with the different monster types and their weaknesses, and an opportunity to earn valuable Hunt dollars and Blood Bonds without putting your hunters at risk.",
    "But the real hidden gem in Hunt: Showdown is Quickplay - a kind of condensed twelve-player battle royale where you start off with nothing, pick up traits throughout the match, and try to be the last player standing. Should you win and be the ‘Soul Survivor’, you get to carry your hunter over to the main Bounty Hunt mode.",
    "You have nothing to lose and potentially plenty to gain as you build up your hunter with the spoils you find throughout a Quickplay match. It’s a great way to enjoy the suspenseful thrills of Hunt: Showdown without the spectre of permadeath looming over your precious high-level hunter. Of course the time will eventually come where you graduate your Soul Survivor into the Bounty Hunt, but you’ll be going in with a well-earned foot-up.",
    "Hunt: Showdown is a tough online shooter. It demands respect and patience from the player, and doesn’t suffer those who want to casually dip their toes into its black bayou waters. But it’s determined to keep you in the game, rewards good human intuition more than reflexes, and offers multiple paths to progression. Beneath its intimidating veneer, Hunt: Showdown is a hardcore shooter with a heart of gold."
  ],
  "headers": {
    "4": "The Hunt goes on",
    "13": "Trials and Error"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Call of Duty": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "Battlefield": "https://www.techradar.com/reviews/battlefield-2042"
  }
}