{
  "source": "https://www.techradar.com/news/google-is-investing-billions-in-new-us-offices-and-data-centers",
  "title": "Google is investing billions in new US offices and data centers",
  "category": "computing",
  "updated": "2021-03-18T14:12:31Z",
  "author": "mayank-sharma",
  "summary": "The search engine giant is looking to hire over 10,000 full-time roles",
  "article": [
    "Google has revealed plans to invest over $7 billion to build new offices and data centers all over the US in the next 12 months.",
    "A blog post by the tech behemoth’s CEO Sundar Pichai noted that, as the Covid-19 pandemic has taken a toll on economies all over the world, the investment forms part of Alphabet’s efforts to help reinvigorate the US economy and pull it out of the slump.",
    "“Google wants to be a part of that recovery. That’s why we plan to invest over $7 billion in offices and data centers across the U.S. and create at least 10,000 new full-time Google jobs in the U.S. this year,” shares Pichai.",
    "The increased investments in data centers will also help satiate the demand for more cloud computing resources, including cloud storage, as more number of companies increase their reliance on cloud hosted services.",
    "Pichai’s plans include investing over $1 billion in the facilities in their California headquarters. The company also plans to increase headcounts in other offices across the US. Pichai also affirmed the company’s racial equality commitments, noting that Google hired a record number of Black and Latinx employees in 2020.",
    "The company also intends to expand its data centers in Nebraska, South Carolina, Virginia, Nevada and Texas, and Pichai assures that the ones already under construction will be fully up and running before the year is out.",
    "Expanding on the plans, Pichai added that Google will open its first US Google Operations Center in Southaven, Mississippi and will also expand their data centers in Nebraska.",
    "In addition to investing in offices and data centers, Google will also help support affordable housing initiatives in the Bay Area as part of its $1 billion housing commitment. “We project that our $250 million investment fund will help create 24,000 housing units by 2029,” Pichai noted."
  ],
  "headers": {
    "3": "Expanding data centers"
  },
  "links": {
    "Google": "https://www.techradar.com/reviews/google-hangouts-meet",
    "blog post": "https://blog.google/inside-google/company-announcements/investing-america-2021/",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "cloud hosted services": "https://www.techradar.com/news/best-cloud-hosting-providers"
  }
}