{
  "source": "https://www.techradar.com/news/newegg-shuffle-loophole-discovered-by-11-year-old-who-bought-an-rtx-3090-gpu",
  "title": "Newegg Shuffle loophole discovered by 11-year-old who bought an RTX 3090 GPU",
  "category": "computing",
  "updated": "2021-07-27T11:35:11Z",
  "author": "jess-weatherbed",
  "summary": "It's still bot-proof right?...right?",
  "article": [
    "There are a lot of systems in place across various retailers right now that make buying elusive graphics cards like the GeForce RTX 3080 and Radeon RX 6900 XT difficult. While thousands of people have been unable to make a purchase, one savvy 11-year-old boy from Florida found a loophole in the Newegg Shuffle that enabled him to avoid any queues and add an EVGA FTW3 RTX GeForce 3090 directly to his basket.",
    "For many folk in the US, the Newegg Shuffle was one of the best chances to get your hands on a new graphics card without having to battle against bots and scalpers. The caveat was that the shuffle itself didn't allow you to simply log in and buy the GPU, instead making you register for a lottery-like system in which you reserve your desired items, with winners having a chance at purchasing them during the buying window.",
    "The Newegg Shuffle system was initially started to help keep PS5 consoles away from scalpers that were buying up available stock and then reselling online at a massively inflated price to make a profit, though the lottery was quickly rolled out to include other hardware experiencing the same issues.",
    "Unsurprisingly, most who enter the Newegg Shuffle are unsuccessful given the sheer number of participants, with PCMag reporting an average of 100k people entering each raffle. The Loophole discovered by Florida resident Ricardo Santana Jr circumvented the entire lottery process using the Newegg 'Build your PC' feature, a system that allows you to digitally compile a selection of components to create a custom gaming desktop PC.",
    "While the Newegg website itself appeared fairly watertight, you could use the mobile app to add any GPU to your cart and check out without having to add any other components, with the loophole even ignoring if the cards were displayed as 'out of stock'.",
    "PCMag also replicated the loophole in the above video and confirmed its legitimacy, but Newegg has since caught wind of things and quickly patched it up – so if you're looking to try it yourself then you're out of luck. Andrew Choi, senior brand manager for Newegg states that \"the vulnerability only sold a small number of graphics cards. We stopped all subsequent orders.\"",
    "Ricardo Santana Sr (the boy's father) said to PCMag that they resisted the temptation to abuse the loophole because they wanted other people to have a shot at getting their hands on some hardware, having experienced the Shuffle system prior to discovering the gap in Newegg's system:",
    "\"I thought about purchasing more but don’t want to abuse it and would like to give other people the opportunity, I’m thinking that they (Newegg) are prioritizing selling custom builds with the inventory they have for the Shuffle. I’m not sure exactly how many people are winning the Shuffle, but I tried the Shuffle so many times and never won.\"",
    "While I did initially think \"what on earth does an 11-year old boy need an RTX 3090 for?\", good for them frankly. Newegg thanked the family for finding the loophole, so there are clearly no hard feelings. And a few other purchases were made before the workaround had been fixed, hopefully by gamers rather than folk out to make a profit.",
    "Santana Sr mentioned to PCMag “It’s terrible that we have to go to this extent to be able to obtain these cards\", and that's a sentiment that has been frustrating PC gamers and builders for months now. Recent news surrounding falling cryptocurrencies suggests that we could start to see GPUs on the shelves at an affordable price and with enough inventory to go around, but when we will start to see the benefits of the crashing cryptomining market is anyone's guess.",
    "For now, I'll take these happy stories when they appear in the ongoing storm of depressing news surrounding hardware shortages, and just hope that we will share a similar slice of success ourselves in turn.",
    "Via PC Gamer"
  ],
  "headers": {
    "2": "Luck of the draw",
    "8": "Opinion: Just let people enjoy things"
  },
  "links": {
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Radeon RX 6900 XT": "https://www.techradar.com/deals/where-to-buy-amd-radeon-rx-6900-xt-find-stock-here",
    "RTX GeForce 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "PS5 consoles": "https://www.techradar.com/news/where-to-buy-ps5",
    "PCMag": "https://uk.pcmag.com/graphics-cards/134643/11-year-old-finds-loophole-in-newegg-app-to-quickly-buy-pc-graphics-cards",
    "crashing cryptomining market": "https://www.techradar.com/news/ethereums-crashing-value-could-finally-net-you-an-nvidia-rtx-3060-graphics-card",
    "PC Gamer": "https://www.pcgamer.com/11-year-old-discovers-loophole-in-neweggs-lottery-system-buys-rtx-3090/"
  }
}