{
  "source": "https://www.techradar.com/news/sony-wh-1000xm4-wireless-headphones-early-black-friday-deal",
  "title": "Skip Black Friday - the Sony WH-1000XM4 headphones are at a record low price today",
  "category": "audio-visual",
  "updated": "2021-10-21T15:36:06Z",
  "author": "james-pickard",
  "summary": "Save over $100 off the best noise-cancelling wireless headphones you can buy.",
  "article": [
    "The Sony WH-1000XM4 have never been cheaper, so if you've had your eye on a pair of the best headphones you can buy then you'll want to grab this early Black Friday deal while you can.",
    "Right now the Sony WH-1000XM4 are just $248 (was $349) at Amazon. You can also find the very same deal at Best Buy. This discount of over $100 matches the biggest price cut we've ever seen on the top-rated wireless headphones. Previously, they had only been as low during this year's Amazon Prime Day sale so it makes a fitting return as the biggest sales period of the year approaches.",
    "We'd already picked out the Sony WH-1000XM4 as one of the hottest items to look out for in this year's Black Friday deals. It seems Amazon and Best Buy were listening, as both retailers have run with this record low price. Our review shows the Sony cans sport excellent noise cancellation and superior sound quality to the point where many would consider them the best noise-cancelling headphones you can buy.",
    "Not in the US? Scroll down for the best price for the Sony WH-1000XM4 is your region today.",
    "As we reach the midpoint of October we're starting to see more and more early Black Friday deals at various stores. The prelude to the massive Amazon Black Friday sale, the Epic Deals event has offered a steady stream of discounted tech throughout October.",
    "No worries if you're not ready to make a purchase just yet. We're following all the best Black Friday headphone deals this year and will keep you up to date with all the cheapest prices. For other options, why not have a browse through some of the top offers available below."
  ],
  "headers": {
    "4": "Today's best Sony WH-1000XM4 deal",
    "6": "More noise-cancelling wireless headphone deals"
  },
  "links": {
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4 are just $248 (was $349) at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSony-WH-1000XM4-Canceling-Headphones-phone-call%2Fdp%2FB0863TXGM3%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-2489129483659969000-20",
    "Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-6161513482200870000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsony-wh-1000xm4-wireless-noise-cancelling-over-the-ear-headphones-black%2F6408356.p%3FskuId%3D6408356&article_name=Skip%20Black%20Friday%20-%20the%20Sony%20WH-1000XM4%20headphones%20are%20at%20a%20record%20low%20price%20today&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsony-wh-1000xm4-wireless-headphones-early-black-friday-deal",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Amazon Black Friday sale": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "Black Friday headphone deals": "https://www.techradar.com/black-friday/best-headphones-deals"
  }
}