{
  "source": "https://www.techradar.com/news/salesforce-finalizes-slack-deal",
  "title": "Salesforce finalizes Slack deal",
  "category": "computing",
  "updated": "2021-07-22T09:54:07Z",
  "author": "sead-fadilpasic",
  "summary": "Slack is now officially under the Salesforce umbrella",
  "article": [
    "Salesforce has confirmed its multi-billion acquisition of Slack has officially wrapped up.",
    "The Customer Relationship Management (CRM) giant confirmed the news in a press release, where it said the combination of Salesforce and Slack is \"creating the business operating system for the new world of work”.",
    "News of a possible acquisition first broke in December 2020, when Salesforce entered a definitive agreement to acquire the communications and collaboration platform for roughly $27.7 billion.",
    "In the announcement, Salesforce said Slack will remain in a position to “accelerate and extend” its mission to make work life simpler, more pleasant, and more productive. The platform will remain under the Slack brand, and will keep its CEO and Co-Founder, Stewart Butterfield.",
    "The acquisition took place with a mixture of cash and shares, with Slack shareholders receiving roughly $26 in cash and 0.0776 shares of Salesforce common stock for each Slack share they hold.",
    "Acquiring Slack was a priority for Salesforce CEO Marc Benioff's mind for some time now, despite worries over the company's valuation.",
    "“We’ve learned over the past year that the workplace isn’t snapping back to the way it was,” said Bret Taylor, President and Chief Operating Officer of Salesforce. “Together, Slack and Salesforce Customer 360 will give every company in the world a single source of truth for their business and a single platform for connecting employees, customers, and partners with each other and the apps they use every day.”",
    "Salesforce is expected to deeply integrate Slack with its Salesforce Customer 360, where it will act as an entirely new interface."
  ],
  "headers": {
    "5": "Remote working wave"
  },
  "links": {
    "Slack": "https://www.techradar.com/reviews/slack",
    "Customer Relationship Management": "https://www.techradar.com/best/the-best-crm-software",
    "in December 2020": "https://www.techradar.com/news/salesforce-confirms-multi-billion-dollar-slack-takeover"
  }
}