{
  "source": "https://www.techradar.com/news/garmin-launches-new-spd-spd-sl-and-look-keo-power-meter-pedals",
  "title": "Garmin launches three new power meters, including its first SPD pedals",
  "category": "fitness",
  "updated": "2021-03-25T12:11:15.538Z",
  "author": "cat-ellis",
  "summary": "Garmin Rally power pedals for road and gravel",
  "article": [
    "Garmin has revealed a series of new cycling power meters, with options for both road and off-road riding. The Rally power pedals replace Garmin's original Vector range and feature sensors that measure data including cadence and power, so you can better understand your riding form.",
    "The Garmin Rally RS100 and Rally RS200 are built for road cyclists using SPD-SL cleats, while the Rally RK100 and Rally RK200 fit Look Keo cleats. The Garmin Rally XC100 and XC200 are built for off-road riding, and are the company's first power pedals for Shimano SPD cleats.",
    "The RK200, RS200 and XC200 are dual-sensing, and allow you to see metrics from both legs independently. Stats include cadence, total power, left-right balance, and advanced cycling dynamics to help you better understand your form.",
    "They also measure time spent seated and standing, and where power is applied so you can be sure your cleats are positioned properly for efficient energy transfer.",
    "The Rally RK100, RS100 and XC100, meanwhile, are single-sensing systems with a sensor in the left pedal that measures cadence and power. If you decide you'd like to upgrade later, you can add a second sensor without having to pay full price for a whole new pair of pedals.",
    "The Rally series are available to order now direct from Garmin, starting at $649.99 / £579.99 / AU$949 for the single-sensing models.",
    "All the new Rally power meters pair with the Gamin Connect app, allowing you to see your stats alongside metrics from other Garmin devices including fitness trackers and smart scales. For indoor training, you can set up your turbo trainer and use them together with apps including Zwift and Garmin's own Tacx smart trainer app.",
    "All pedals can be installed and switched between bikes with a regular pedal wrench, and should be simple to fit provided you're happy wielding a pedal wrench. If you're not sure, your nearest Shimano Service Center can help.",
    "We hope to test the power meters soon, and will bring you a full review when we do. Stick with TechRadar for the full lowdown."
  ],
  "headers": {
    "6": "Ride smarter"
  },
  "links": {
    "direct from Garmin": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7021285312337339000/https://buy.garmin.com/",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "smart scales": "https://www.techradar.com/best/best-smart-scales"
  }
}