{
  "source": "https://www.techradar.com/news/s-pen-pro-support-for-samsung-galaxy-z-fold-3-confirmed-in-fcc-listing",
  "title": "Samsung Galaxy Z Fold 3 will get S Pen Pro support, according to this listing",
  "category": "phones",
  "updated": "2021-07-13T08:27:15Z",
  "author": "stephen-lambrechts",
  "summary": "Will also be compatible with several other devices",
  "article": [
    "We've previously stated that the upcoming Samsung Galaxy Z Fold 3 is almost certain to get S Pen support, but now the functionality seems to have been confirmed, thanks to an FCC filing spotted by 9to5Google.",
    "The filing, which details Samsung's forthcoming S Pen Pro, lists a number of devices which the updated stylus is said to support – one of which is the Samsung Galaxy Z Fold 3 5G.",
    "Additionally, the regulatory documentation reveals that the S Pen Pro will also be compatible with Samsung's S21 Ultra, Note 20 Ultra, Note 20, Note 20 Lite, Tab S7 Plus, Tab S7 FE and Tab S6 devices that support One UI 3.1 or later.",
    "It's worth noting that while the filing clearly lists the as-yet-unannounced Galaxy Z Fold 3 amongst the S Pen Pro's supported devices, it makes no mention of a Note 21 handset, suggesting once again that Samsung won't be releasing a Note this year.",
    "Given that Samsung is unlikely to release a Note handset in 2021, it makes sense for the South Korean manufacturer to bring the Note's most famous feature over to what is now the company's top premium handset offering.",
    "Fold owners have been crying out for stylus support for some time, and dedicated Note users will be looking for a new handset to fill the void left behind by the Note 21's absence, making the Galaxy Z Fold 3 the perfect place to debut S Pen functionality on a foldable device.",
    "According to rumors which have been circulating since August last year, Samsung is seriously considering combining its Fold series and Note series into a single productivity-focused line.",
    "Whether the traditional Note series will get permanently scrapped will surely depend on how well this year's experiment with the Galaxy Z Fold 3 fares."
  ],
  "headers": {
    "4": "Z Fold 3: why S Pen support makes sense"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "almost certain to get S Pen support": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-is-almost-certain-to-get-s-pen-support-heres-why",
    "FCC filing": "https://apps.fcc.gov/oetcf/eas/reports/ViewExhibitReport.cfm?mode=Exhibits&RequestTimeout=500&calledFromFrame=N&application_id=PQFsmd5Fd6mroqLRXdITpA%3D%3D&fcc_id=A3LEJP5450",
    "9to5Google": "https://9to5google.com/2021/07/12/samsung-s-pen-pro-fcc-galaxy-z-fold-3/",
    "Samsung won't be releasing a Note this year": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "rumors": "https://www.techradar.com/news/report-samsung-galaxy-note-series-to-be-replaced-by-z-fold-next-year"
  }
}