{
  "source": "https://www.techradar.com/news/is-apple-set-to-reveal-new-macbook-pro-at-wwdc-2021",
  "title": "Is Apple set to reveal new MacBook Pro at WWDC 2021?",
  "category": "computing",
  "updated": "2021-05-24T21:29:16Z",
  "author": "john-loeffler",
  "summary": "A new MacBook Pro may be about to drop",
  "article": [
    "Hot off the release of the newly redesigned iMac, Apple may be set to announce a new MacBook Pro at its upcoming WWDC 2021 event in June.",
    "While earlier than we have been anticipating, Apple is known to drop hints in its marketing material for its events, so already people are poring over a new marketing image Apple released for this year's WWDC.",
    "As AppleTrack notes, journalists like @SamiFathi_ have honed in on the unicode names for three emojis reflected in the glasses of one of the faces in the image, which refer to a fork and knife, the sleeping face emoji, and a laptop emoji.",
    "The Occam's Razor interpretation of these emojis are that they're likely a play on a pretty common saying in the developer community, \"Eat, sleep, code,\" so it's hardly confirmation that a new MacBook Pro is going to be announced in two weeks. That said, reputable Apple leaker Jon Prosser is coming right out and saying that we're getting a new MacBook Pro at WWDC, which adds a lot of weight to the speculation.",
    "There have already been some rumors circulating that a new MacBook Pro might launch in the next few months. We anticipate a Q3 launch for the new 16-inch MacBook, which doesn't necessarily rule out an announcement at WWDC. Apple typically announces a product a couple of weeks before it ships, so an early June announcement could place a launch date in the first couple of weeks of Q3 2021.",
    "If a new MacBook Pro is about to drop in the next couple of weeks, we may be able to see Apple's latest silicon, the Apple M1X chip. Apple has been very tight-lipped about the expected update to its M1 processor (not even acknowledging that it exists), but everyone is expecting that whatever upgrades Apple has in store for its silicon, its going to be introduced in the 16-inch MacBook Pro.",
    "If that MacBook is right around the corner, we should be able to see this new and improved processor much sooner than we anticipated. Again, without any word from Apple, all we really have is speculation, but the 16-inch MacBook Pro is a more high performance device than its smaller siblings, so we might see a doubling of the performance core count over the M1, from four to eight, for 12 cores in total.",
    "There's also no telling what Apple may be looking to do with a MacBook Pro redesign. Last year's Apple MacBook Pro 13-inch (M1) kept the same look as the earlier Intel-powered MacBook Pros, but with the launch of the new, very colorful iMacs this month, it would be amazing if we also saw a similar redesign here."
  ],
  "headers": {
    "5": "Will we see Apple's next-gen silicon in the new MacBook Pro?"
  },
  "links": {
    "iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "AppleTrack": "https://appletrack.com/apple-may-have-hinted-at-new-macbooks-coming-at-wwdc/",
    "@SamiFathi_": "https://twitter.com/SamiFathi_",
    "some rumors": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022",
    "Apple M1X chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "Apple MacBook Pro 13-inch (M1)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020"
  }
}