{
  "source": "https://www.techradar.com/news/did-apple-backtrack-on-the-iphone-13-face-id-disablement-row",
  "title": "iPhone 13 screen replacement won’t kill Face ID after all",
  "category": "phones",
  "updated": "2021-11-11T11:00:17Z",
  "author": "raj-narayan",
  "summary": "Third-party repair shops up in arms",
  "article": [
    "The iPhone 13 appears to be in the throes of a few challenges, be it those related to chipset shortages or the more recent one around fixing cracked screens. While the issue with global processor shortages is likely to continue till early next year, when it comes to the other issue Apple may have backtracked on its intentions.",
    "It appears that Apple could well be in the process of releasing a new software update that would help third-party repair shops fix a cracked screen on iPhone 13 devices without actually ending up messing with the Face ID recognition software. A report to this effect appeared in The Verge, though it did not give any specific date for the software update to arrive.",
    "The issue raised a few hackles worldwide following an investigation by iFixit who had tested this issue several times across many devices running the iOS 15 and iOS 15.1. The company said in a post on their website that attempting to fix a cracked screen rendered the Face ID on the iPhone 13 device completely ineffective.",
    "iFixit went on to share YouTube videos of several such instances on the blog post to substantiate their claim that the results they came up with had been replicated by numerous other repair professionals. This led to a collective protest from these third party repair stores around Apple attempting to monopolize iPhone repairs.",
    "The trick employed by Apple to ensure that iPhone users with cracked screens only approached authorized professionals is quite simple. Unless you removed a small control chip from the original screen, it would break the Face ID software. And the process involved for doing so was complex as it involved expensive machinery.",
    "Apple's authorized repair shops not only had access to a software tool that can make the device accept a new screen, but also the ability to micro-solder using equipment that they bought specifically outside at a higher cost.",
    "This meant that an iPhone user who has the misfortune of getting a cracked screen would have to spend extra bucks and visit a store that had a microscope to fix it. And this under the screen trick would also have ensured that future iPhones would too would have eased out of the ambit of third-party repair.",
    "Apple has grown more hostile toward independent repairs over the years, preferring instead that consumers get their products fixed directly through Apple at an Authorized Service Provider, or at third-party shops worldwide that are part of its Independent Repair Provider (IRP) program. The latter get tools, training, and parts sourced directly from the company.",
    "This runs against the Right to Repair ethos, which campaigns against device-makers deliberately designing their products to be harder for individuals and third-party shops to repair. While EU lawmakers have been exploring laws that eliminate e-waste and back consumer rights for years, the US government under President Biden’s administration is finally starting to revise Right to Repair laws – especially for smartphone makers.",
    "Apple isn’t the only company obstructing Right to Repair – a Bloomberg report back in May detailed how the trade group TechNet, which includes Google and Apple, encouraged lawmakers not to sign Right to Repair laws. The report also explained how tech giants lobby against such legislation on the state level, as Microsoft, Amazon, and others did for a 2019 Washington bill.",
    "The iPhone 13’s display-and-microcontroller serialization seemed like another way to funnel consumers into repairing devices through Apple-authorized businesses, functionally limiting Right to Repair. Hopefully the company walking back its arbitrary hardware limitation is a sign of its direction in the future.",
    "Via Ars Technica"
  ],
  "headers": {
    "7": "Analysis: a win for Right to Repair"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "chipset shortages": "https://www.techradar.com/news/iphone-13-might-be-easier-to-buy-soon-but-at-the-expense-of-new-ipads",
    "cracked screens": "https://www.techradar.com/news/third-party-screen-replacement-of-iphone-13-disables-face-id-heres-how",
    "The Verge": "https://www.theverge.com/2021/11/9/22772433/apple-iphone-13-screen-replacements-face-id-software-update",
    "company said in a post": "https://www.ifixit.com/News/54829/apples-new-screen-repair-trap-could-change-the-repair-industry-forever",
    "YouTube videos": "https://www.youtube.com/watch?v=-elQNEvlqrk",
    "such instances": "https://www.youtube.com/watch?v=LxKr0gJVpJ8",
    "third-party shops": "https://www.techradar.com/news/apple-will-train-independent-repair-providers-to-fix-your-iphone-properly",
    "exploring": "https://www.techradar.com/news/the-eu-wants-to-make-it-easier-to-fix-your-phone",
    "revise": "https://www.techradar.com/news/us-may-revise-right-to-repair-laws-for-phones-and-consoles-but-by-how-much",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-20/microsoft-and-apple-wage-war-on-gadget-right-to-repair-laws",
    "Ars Technica": "https://arstechnica.com/gadgets/2021/11/apple-will-no-longer-break-face-id-on-repaired-iphone-13s/"
  }
}