{
  "source": "https://www.techradar.com/news/fifa-22-fut-web-app-release-date",
  "title": "FIFA 22 FUT web app release date: when can you manage your Ultimate Team on the go?",
  "category": "gaming",
  "updated": "2021-09-17T09:12:02Z",
  "author": "adam-vjestica",
  "summary": "Manage your FIFA 22 Ultimate Team from your PC on mobile",
  "article": [
    "The launch of FIFA 22 is drawing ever closer, but when is the FIFA 22 FUT web app release date?",
    "On the FIFA 22 website, EA has revealed that the companion app to the popular FIFA Ultimate Team mode (or FUT) will launch for web on September 22 and mobile on September 23.",
    "It gives players total control of their FUT Club from either your PC or mobile device and lets you sign players, style your stadium and even select your next starting eleven.",
    "Players will be able to use the FUT Companion App without logging into FIFA 22 until October 17, but after that date, you will need to boot the game up.",
    "The FUT Companion App has grown in popularity as it helps players stay on top of weekly competitions. It’s also a great bragging tool among friends, as you can share your carefully curated squad with your friends.",
    "With FIFA 22 launching on October 1, 2021, the FUT web app and mobile companion app will let Ultimate Team players get a headstart on building their dream team, as FIFA’s fantasy football mode continues to be extremely popular.",
    "FIFA Ultimate Team was first introduced in FIFA 09 and lets you build a team using any players from all the world’s top leagues. Players compete online and offline to win coins which can then be used to buy better players or packs that contain random players.",
    "The mode has come under criticism for promoting gambling to children, due to the fact the player packs are essentially loot boxes. As a result, the mode has been banned in countries such as the Netherlands and Belgium and continues to be scrutinized by government officials and healthcare professionals.",
    "Nevertheless, FIFA Ultimate Team continues to be incredibly popular with players of EA’s annual soccer sim, and the FUT web app and mobile companion app are great additions for players who are already entrenched in EA’s microtransaction-heavy mode."
  ],
  "headers": {
    "6": "Analysis: FIFA Ultimate Team popularity continues to grow despite controversy"
  },
  "links": {
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "FIFA 22 website": "https://www.ea.com/games/fifa/fifa-22/news/pitch-notes-fut-22-launch-update?isLocalized=true"
  }
}