{
  "source": "https://www.techradar.com/news/starfield-is-science-fiction-grounded-in-reality-and-takes-inspiration-from-spacex",
  "title": "Starfield is science-fiction grounded in reality, and takes inspiration from SpaceX",
  "category": "gaming",
  "updated": "2021-06-14T19:29:34Z",
  "author": "samuel-tolbert",
  "summary": "300 years ahead of the game",
  "article": [
    "One of the biggest games at E3 2021 is Starfield, the next role-playing game from Bethesda Games Studios. As a new IP exploring science-fiction concepts, the teaser trailer was light on details but set the tone for what players can expect.",
    "As part of the game's unveiling, director Todd Howard spoke with The Telegraph about the inspiration for the game's aesthetic and how everything is grounded in reality. Despite taking place 300 years in the future, Starfield borrows ideas that are being explored today, including from SpaceX, which designs , manufactures and launches advanced rockets and spacecraft. Howard visited the campus ”to talk to people who could see further than what I was seeing right now” and came back with ideas that influenced the game's look and feel, as well as it's gameplay.",
    "\"It's being able to play with something where the technology level and the logic of how humankind got to where they are. You know, how do the people live? How does the equipment work? What are the rules of communication? You take it for granted in the game that you could communicate from one planet to another, or some other remote thing. But we have the rules. No, they can't – that's going to take years! And then once you realize, you can be, like ‘okay...’, you can use that to your advantage.\"",
    "Still, even though Starfield won't stray to far away from realism, players needn't be worried, as it's still fundamentally a game and is meant to be fun.",
    "“It is a game, let's make no mistake,\" Howard said. \"But when you build those things, you can then lean in on them and they create their own vibe. There's a case in the trailer – it's a watch case, actually. You’re part of Constellation so you get this explorer’s watch. And that's part of the identity of... you know, how does this thing work? What does it do? What does it not do? Tone. A lot of it is tone.”",
    "Starfield is slated to arrive on November 11, 2022. It's coming exclusively to Xbox Series X, Xbox Series S and PC. Bethesda Softworks is now part of Xbox Game Studios, which comprises of 23 studios.",
    "Other future Bethesda games will also be exclusive, including Redfall, an immersive shooter about vampires designed by Arkane Austin and scheduled to be released in 2022."
  ],
  "headers": {
    "5": "Coming next year to Xbox"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "The Telegraph": "https://www.telegraph.co.uk/gaming/features/starfield-e3-2021-reveal-exclusive-todd-howard-spent-25-years/",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Redfall": "https://www.techradar.com/news/arkane-austins-new-game-redfall-brings-vampires-in-summer-2022"
  }
}