{
  "source": "https://www.techradar.com/news/ces-2021-made-me-actually-want-a-gaming-laptop",
  "title": "CES 2021 made me actually want a gaming laptop",
  "category": "computing",
  "updated": "2021-01-16T11:00:24Z",
  "author": "matt-hanson",
  "summary": "FINALLY",
  "article": [
    "Well well well, it looks like CES 2021 could make me a gaming laptop convert. Over the years I’ve had the luck of playing around with, and reviewing, some brilliant gaming laptops, and while I’ve liked a great deal of them, and can certainly understand their appeal, they never appealed to me.",
    "Once I’d packed them up and sent them back I was never tempted to go out and buy one for myself, however. Instead, I’d return to my trusty old desktop PC. Sure, it takes up most of the space on my desk, guzzles up power and pumps out enough heat to warm up not just my house, but my neighbor's as well, but I was convinced I was getting the very best gaming experience from it.",
    "For a start, it’s incredibly powerful – much more than any gaming laptop could ever be. Then, there’s the future-proofing. When the next uber-powerful GPU from Nvidia comes out, I know I could quite easily swap out the RTX 3090 and keep pushing the kind of pixels the PS5 or Xbox Series X (or even the best gaming laptops) could only dream of.",
    "And sitting at a desk with a full size mechanical keyboard, and a great gaming mouse, I thought it would be far more comfortable as well. Also, who needs portability when the world’s in lockdown and there’s nowhere to go?",
    "However, the gaming laptops shown off at CES 2021 really surprised me – in a good way. The three big names in computing hardware – Intel, AMD and Nvidia – all showed off exciting new mobile hardware which could revolutionise gaming laptops.",
    "And, as soon as their presentations were up, and I was just contemplating the possibilities of the hardware shown off, laptop makes including Asus, Acer, Alienware and (frantically thinking of a laptop maker that doesn’t begin with ‘A’) MSI all showed off their latest gaming laptops that will pack the new tech, and they looked excellent.",
    "First of all, devices like the MSI Stealth 15M and Acer Predator Triton 300 SE were brilliant examples of how gaming laptops can be as thin and light as Ultrabooks – and that you don’t have to settle for big and bulky devices that are a pain to lug about if you want a gaming laptop.",
    "Intel’s CES 2021 keynote was probably one of the most exciting presentations of the event, as the chip maker showed off its 11th generation Tiger Lake-H35 processors, which look like they could usher in an exciting new future of thin, light, and powerful gaming laptops.",
    "Meanwhile, the Asus TUF Dash F15 caught my eye, as it promises to be a thin and light laptop that’s also affordable. The idea of being able to get hold of a slimline gaming laptop without spending thousands of dollars (or pounds, in my case) could, again, be a game changer.",
    "Both AMD and Nvidia also showed off new powerful mobile processors and graphics cards, respectively, and this also has exciting repercussions. AMD’s new Ryzen 5000 series of mobile CPUs included eight core x86 processors, promising some seriously impressive performance in a laptop.",
    "Meanwhile, Nvidia revealed its RTX 3000 mobile GPUs at CES 2021, which could also bring huge performance gains to gaming laptops.",
    "While a desktop RTX 3080 is going to still outperform the mobile RTX 3080, there are going to be gaming laptops that can compete with gaming desktops, while offering the portability desktop PCs lack.",
    "CES 2021 also saw a growing trend of laptops coming with 1440p resolution screens, which I think is another great move. It gives you better visual fidelity than 1080p, but without being a complete drain on resources, like 4K is. It’s a great compromise.",
    "While I’m not going to give up on gaming desktops any time soon – even though my most recent gaming desktop build is giving me no end of grief (stay tuned for an article documenting that saga soon), for the first time in a long time, I’m really excited about gaming laptops. Who knows, I may even get one myself."
  ],
  "headers": {
    "4": "Change of heart",
    "9": "Power for the portable people"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "MSI Stealth 15M": "https://www.techradar.com/news/ces-2021-msi-overhauls-gaming-laptop-lineup-with-nvidia-rtx-3000-graphics",
    "Acer Predator Triton 300 SE": "https://www.techradar.com/reviews/acer-predator-triton-300-se",
    "Ultrabooks": "https://www.techradar.com/news/mobile-computing/laptops/best-ultrabook-18-top-thin-and-lights-1054355",
    "showed off its 11th generation Tiger Lake-H35 processors": "https://www.techradar.com/news/intel-is-making-some-of-the-thinnest-gaming-laptops-ever-at-ces-2021",
    "Asus TUF Dash F15": "https://www.techradar.com/news/asus-tuf-dash-f15-shows-that-thin-and-light-gaming-laptops-dont-have-to-be-super-expensive",
    "AMD’s new Ryzen 5000 series of mobile CPUs": "https://www.techradar.com/news/amd-ryzen-5000-mobile-processors-arrive-at-ces-2021-to-steal-the-laptop-crown-from-intel",
    "RTX 3000 mobile GPUs": "https://www.techradar.com/news/nvidia-rtx-3000-graphics-cards-are-finally-coming-to-laptops"
  }
}