{
  "source": "https://www.techradar.com/news/boost-your-education-with-these-back-to-school-security-tips",
  "title": "Boost your education with these back to school security tips",
  "category": "computing",
  "updated": "2021-09-23T10:21:43Z",
  "author": "techradar-pro",
  "summary": "Make sure you stay safe this Autumn by following our guide",
  "article": [
    "As summer draws to an end (at least in the northern hemisphere), many of us will be returning to the office, school or university.",
    "But just because you are dropping back into more of a routine doesn't mean that you should let down your guard when it comes to online security. With cyber-threats still lurking around many corners on the web, there's more need than ever to make sure you're protected online.",
    "Here are some of our top tips to banish the back-to-school security blues.",
    "After months of uncertainty, many children will finally be heading back to school, college or university for in-person lessons at last.",
    "Keeping the entire family safe online has never been more important, especially as criminals often try to exploit a lack of proper security knowledge in children or social engineering tactics to trick victims into giving away login details or password information on services such as social media or gaming sites.",
    "Bitdefender Total Security can keep your family safe from a wide range of online threats, and also comes with comprehensive advanced parental controls that allow you to filter out inappropriate content and limit screen time, as well as remote access to Bitdefender Central to monitor your kids’ online activities.",
    "Most of us now own and use multiple connected devices at work and at home, as smartphones, tablets and other pocket-sized devices jostle for space with traditional laptops and PCs.",
    "But ensuring all these different devices stay secure can often be a challenge, as mobile items occasionally get forgotten or left behind, despite often containing our most treasure photos, videos and apps.",
    "Bitdefender Total Security covers Windows, macOS, Android and iOS devices, and protection can be extended over up to 15 devices per household, keeping your family safe online, whatever device is being used.",
    "In this age of remote working, many of us may now be familiar with using a Virtual Private Network (VPN) software, connecting to work networks from the safety of your home.",
    "But a VPN is now an indispensable security tool for everyone, as it can help keep you safe online by masking your internet connection. This should mean that advertisers and websites are unable to track your internet activity or snoop on your location, giving you the freedom to browse without restrictions.",
    "Bitdefender Total Security comes with a comprehensive and recently improved VPN service that's perfect for all the family, providing 200MB of data traffic per day for Windows, Android, macOS and iOS devices at no extra cost.",
    "Finally, we all know the importance of having strong and distinct passwords across all of your accounts - but this is only true if you are doing it properly.",
    "Experts say a good password should use a mix of letters, numbers and special characters that are changed regularly, meaning cybercriminals aren’t ever able to guess your logins and access any of your online accounts or personal devices. Using the same passwords for different accounts can be very risky, as if one is compromised, hackers may then be able to gain access to others without much work.",
    "Having so many passwords may sound like a lot to remember, but Bitdefender Total Security features an in-built Password Manager service that lets you keep track of all your accounts, meaning all your vital details stay safe."
  ],
  "headers": {
    "3": "Make sure the whole family is safe online",
    "6": "Stay secure across all your devices",
    "9": "Get a VPN to protect your privacy",
    "12": "Beef up those passwords"
  },
  "links": {
    "Bitdefender Total Security": "https://www.bitdefender.co.uk/solutions/total-security.html"
  }
}