{
  "source": "https://www.techradar.com/news/thor-love-and-thunder-has-finished-filming-heres-a-new-set-photo",
  "title": "Thor: Love and Thunder has finished filming – here's a new set photo",
  "category": "entertainment",
  "updated": "2021-06-02T09:24:29Z",
  "author": "samuel-roberts",
  "summary": "See Chris Hemsworth in a vest",
  "article": [
    "Thor: Love and Thunder has finished filming in Australia, it's been confirmed. Star Chris Hemsworth posted a photo of himself as the character along with director Taika Waititi, and marked the end of the shoot by praising the fourth Thor movie.",
    "\"The film is gonna be batshit crazy off the wall funny and might also pull a heart string or two,\" Hemsworth wrote alongside his Instagram post. \"Lots of love, lots of thunder! Thank you to all the cast and crew who made this another incredible Marvel journey. Buckle in, get ready and see ya in cinemas!!\"",
    "Here's the photo:",
    "Waititi, of course, plays Thor's friend Korg in the movies.",
    "You'll notice Thor isn't in his traditional costume, and is dressed more like a wrestler or early 1990s pop star. Thor: Love and Thunder will feature Natalie Portman taking up the hammer of Thor in her first MCU appearance since Thor: The Dark World, while Christian Bale is playing Gorr the God Butcher, a villain who in the comics hunted down various gods and murdered them over the course of many years.",
    "Tessa Thompson will also reprise her role as Valkyrie, while Russell Crowe, Jaimie Alexander and various Guardians of the Galaxy actors are expected to reappear. A few more surprises have been revealed via set photos – but we'll save those for the finished movie, which you'll be able to go and see on May 6, 2022.",
    "Thor marks the first time a solo MCU series has reached its fourth entry – though in many ways, Thor: Ragnarok felt like a soft reset of the character and his world, establishing Thor as a more comedy-infused subseries within this universe of movies. We expect Waititi to do something similar, here – especially if the tone of Thor's costumes is anything to judge by.",
    "At the same time, Waititi clearly has a lot of love for the source material, especially the run of writer Jason Aaron. That encompassed both Jane Foster's transformation into Thor, and the Gorr the God Butcher story – and veered from funny to wildly dark and back again, which might be what the director is going for, here.",
    "Either way, it's probably the MCU film we're most excited about over the next couple of years."
  ],
  "headers": {
    "6": "What to expect from Thor: Love and Thunder"
  },
  "links": {
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4"
  }
}