{
  "source": "https://www.techradar.com/news/lg-oled-tvs-just-got-an-hbo-max-upgrade",
  "title": "LG OLED TVs just got an HBO Max upgrade",
  "category": "televisions",
  "updated": "2021-08-04T14:05:37Z",
  "author": "henry-st-leger",
  "summary": "The streaming service finally lands on LG TVs",
  "article": [
    "The HBO Max streaming service has finally landed on LG TVs, bringing the platform hosting Dune and The Suicide Squad to the TV maker's OLED and LCD screens (via CNET).",
    "LG and WarnerMedia (which owns HBO) made the announcement this week, shortly before The Suicide Squad is set to land on the service (August 5).",
    "You'll also find it on Roku devices (OS 9.3 and later), the current and last-gen Xbox and PlayStation consoles, Android TV (5.0 or later), Google Chromecast, Apple TV, internet browsers, and Samsung smart TVs.",
    "Anyone with an LG smart TV should be able to access HBO Max, then, though we expect the update to the webOS platform only goes back a few years (Samsung TVs only get it on 2016 models and later).",
    "While it may seem like an odd absence on LG TVs prior to this, it makes sense when considering that HBO Max is relatively new. It launched in mid-2020, and is still finding its way on smart TV platforms like LG's webOS, though it's coverage is now pretty broad.",
    "The main draw of HBO Max at the moment is likely its suite of Warner Bros films, with the entertainment conglomerate's entire 2021 slate of movies set to launch same-day on HBO Max as they air in theaters.",
    "It's proven a contentious point for many directors, including creatives involved in those projects, with the threat of legal action even in the air.",
    "Similarly, Scarlett Johansson is suing Disney for launching Black Widow on Disney Plus on the same day as its theatrical release, so it's clear that the loss of box office tickets has some knock-on affect for actor's earnings, even when they're blockbuster stars.",
    "For those who still feel (or are) unsafe going into crowded public spaces, though, watching Dune at home on a capable LG OLED TV is still going to be a pretty good experience.",
    "HBO Max is also offering a selection of free pilot episodes for a number of TV shows on its platform, ostensibly to draw in subscribers and get them hooked on HBO's offering. Free pilots are available for Batwoman, Euphoria, Game of Thrones, Lovecraft Country, Doom Patrol, among others."
  ],
  "headers": {
    "5": "Analysis: A streaming service worth considering"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "LG TVs": "https://www.techradar.com/news/lg-tv-2021",
    "Dune": "https://www.techradar.com/news/dune-cast-release-date-trailer",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-release-date-plot-cast-trailer-and-more",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "CNET": "https://www.cnet.com/tech/services-and-software/the-hbo-max-app-is-now-available-on-lg-smart-tvs/",
    "Roku devices": "https://www.techradar.com/news/roku-tvs-and-streaming-devices-are-getting-a-massive-movie-overhaul",
    "Android TV": "https://www.techradar.com/news/android-tv",
    "Google Chromecast": "https://www.techradar.com/reviews/audio-visual/av-accessories/chromecast-1305399/review",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "Samsung TVs": "https://www.techradar.com/news/best-samsung-tv/news/new-samsung-tv-2021",
    "threat of legal action even in the air": "https://www.techradar.com/news/hbo-max-could-kill-the-dune-franchise-says-director",
    "Scarlett Johansson is suing Disney": "https://www.techradar.com/news/scarlett-johansson-is-suing-disney-over-black-widows-disney-plus-release",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today"
  }
}