{
  "source": "https://www.techradar.com/news/maybe-the-metal-gear-solid-film-will-actually-be-good-oscar-isaac-discusses-being-snake",
  "title": "Maybe the Metal Gear Solid film will actually be good? Oscar Isaac discusses being Snake",
  "category": "gaming",
  "updated": "2021-08-23T09:23:55Z",
  "author": "gerald-lynch",
  "summary": "Snake? SNAKE? SNAAAAAAAAAKE!",
  "article": [
    "They’re getting better, but we’re still yet to have a truly great video game movie adaptation. Could the upcoming Metal Gear Solid film, starring Oscar Isaac and directed by Kong: Skull Island’s Jordan Vogt-Roberts turn the tide?",
    "We’re quietly hopeful – speaking in a new interview about his starring role as Solid Snake, Isaac is certainly saying all the right things to get us excited.",
    "\"I just loved the game,\" Isaac told Total Film when asked what brought him to the project.",
    "\"I love the feeling that the game would give me every time I’d play. It’s just a strangely isolated, mournful, lonely game to play that has these incredible moments of violence and terror, with these weird, psychedelic concepts and villains. But, yes, it’s kind of like psychedelic military horror things that happen.",
    "\"And the truth is, underneath the whole thing, it’s an anti-war story. So I think those are the elements I really love. And, like I said, I love the feel of playing it, and the big question of: can something like that be transferred – or can you explore those themes in a really interesting way – on film?\"",
    "It’s been a busy few years for video game movie adaptations, from the light hearted Detective Pikachu to the gory Mortal Kombat, and now looking forward to Tom Holland’s Uncharted movie and an upcoming The Last of Us TV show. Film adaptations like Detective Pikachu, Sonic the Hedgehog and Mortal Kombat punched above their weight and delivered movies that, whilst not all out classics, hit the right beats to keep fans smiling.",
    "So what’s changed since the god awful 90s adaptations, such as Super Mario and Street Fighter, on the silver screen? I’d say it’s a three-fold change.",
    "Firstly, we’ve got a wave of younger directors who grew up with the games and have a reverence for the source material that they’re working on. In the case of the Metal Gear film, Vogt-Roberts is just 36 years old, and was a fan of the Metal Gear games growing up. He doesn’t need to be sold on what makes the series special – he was there alongside every other PlayStation gamer the first time around.",
    "Secondly, in the case of games like Metal Gear Solid, they themselves were directly inspired by films, and (compared 8-bit and 16-bit franchises) were built on technologies that allowed for cinematic presentations. Metal Gear creator Hideo Kojima has always been a cinephile, and Metal Gear Solid’s fixed-perspectives allowed him to ape the drama that movie-style camera angles bring. It’s something that Vogt-Roberts can lift wholesale if he likes.",
    "Finally, there’s been a shift in power between the Hollywood studios and the games companies whose properties are being developed. According to Mordor Intelligence’s industry reports, the global gaming industry is expected to be worth $314.40 BILLION by 2026.",
    "By comparison, 2020 saw a decline in global revenue for the film industry down to $80.8 billion – admittedly a knock on effect of the pandemic, but regardless exists as part of a trend that sees cinema slowly shrinking in comparison to gaming’s growth. Hollywood needs the properties recognised by a generation of video game players, arguably more than the video game industry needs Hollywood. And gamers are a vocal bunch – if their favorite titles are butchered on the silver screen, they’ll let the studios know it, so it’s in the studio’s interest to deliver faithful adaptations.",
    "In Metal Gear Solid, we potentially have a star and director on the same page as the fans of the games the film draws inspiration from. The fact that Isaac (and, by extension, Vogt-Roberts) can identify the psychedelic nature of characters including Psycho Mantis, and the games’ underlying anti-war message, as opposed to turning the whole thing into a Rambo flick with mechs, is sending the exact sort of reassurance that fans of the series will want."
  ],
  "headers": {
    "5": "Analysis: A solid movie?"
  },
  "links": {
    "Metal Gear Solid film": "https://www.techradar.com/news/metal-gear-solid-movie-will-star-oscar-isaac-as-solid-snake",
    "Total Film": "https://www.gamesradar.com/uk/totalfilm/",
    "Detective Pikachu": "https://www.techradar.com/news/netflix-is-making-a-pokemon-tv-show-but-is-it-an-anime",
    "Mortal Kombat": "https://www.techradar.com/news/the-mortal-kombat-movie-was-a-much-bigger-hit-than-you-thought-it-was",
    "Tom Holland’s Uncharted movie": "https://www.techradar.com/news/new-uncharted-movie-images-tease-tom-hollands-first-adventure",
    "The Last of Us TV show": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "Mordor Intelligence": "https://www.mordorintelligence.com/industry-reports/global-gaming-market"
  }
}