{
  "source": "https://www.techradar.com/news/early-amazon-prime-day-sale-knocks-4k-fire-tvs-to-just-99",
  "title": "Early Amazon Prime Day sale knocks 4K Fire TVs to just $99.99",
  "category": "televisions",
  "updated": "2021-06-15T15:14:35Z",
  "author": "mackenzie-frazier",
  "summary": "Score early Prime Day TV deals before the official sale begins",
  "article": [
    "Amazon Prime Day is less than a week away and the retailer is giving a preview of the two-day deals event with fantastic cheap TV deals that you can shop for right now. These early Prime Day deals include a range of Fire TVs starting at just $99.99.",
    "You'll find all of Amazon's early Prime Day TV deals below, each of which includes the Fire TV experience. This allows you to stream movies and TV shows from your favorite apps like Netflix, Disney Plus, Prime Video, and more.",
    "The Fire TVs also feature a handy voice remote with Amazon Alexa so you can use your voice to launch apps, search for titles, play music, and control compatible smart home devices. We've also included the 4K Fire TV Stick, which allows you to stream content in 4K resolution, and it's currently on sale for just $39.99. Keep in mind these early Prime Day deals are limited-time offers, and we can't predict the prices will drop any further at next week's sale. You must have a Prime membership to take advantage of these bargains, and you can sign up for a 30-day free trial here, which will take you through the upcoming Amazon Prime Day sale.",
    "You can see more early bargains with our roundup of the best Prime Day TV deals and the best cheap TV deals that are currently available."
  ],
  "headers": {
    "3": "Amazon Prime Day - early TV deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "for just $39.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FFire-TV-Stick-4K-with-Alexa-Voice-Remote%2Fdp%2FB079QHML21%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7593019501781444000-20",
    "here": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Famazonprime%3F_encoding%3DUTF8%26%252AVersion%252A%3D1%26%252Aentries%252A%3D0%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4334422432484784600-20",
    "best Prime Day TV deals": "https://www.techradar.com/amazon-prime-day/prime-day-tv-deals-2021",
    "best cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales"
  }
}