{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s7-fe-is-official-along-with-a-new-cheap-android-tablet",
  "title": "Samsung Galaxy Tab S7 FE officially announced as stylus-toting iPad Air rival",
  "category": "tablets",
  "updated": "2021-05-27T23:36:56Z",
  "author": "tom-bedford",
  "summary": "Samsung's new mid-range tablet is here",
  "article": [
    "We were waiting with anticipation for the Samsung Galaxy Tab S7 FE, a mid-range version of the Galaxy Tab S7 with reduced specs and lower price, and it's finally here.",
    "Announced without fanfare through a press release, the Galaxy Tab S7 FE comes alongside the Galaxy Tab A7 Lite, a super-affordable slate that's smaller, and much cheaper, than the Tab S7 FE.",
    "We'll detail what we know about these tablets below - just note that we don't have all the information right now, as the chipset hasn't been detailed, and we only know the price and availability in the UK.",
    "The Samsung Galaxy Tab S7 FE has a 12.4-inch screen - that's pretty big for an Android tablet - with a 2560 x 1600 resolution. The tablet comes with the S Pen stylus for note-taking and writing.",
    "The slate seems like a battery champion with a 10,090mAh power pack, which charges up at 45W (though the in-box charger is much slower).",
    "Curiously, the tablet's chipset hasn't been detailed, though we know it's paired with 4GB or 6GB RAM and 128GB or 256GB storage. The tablet runs Android 11 with Samsung's One UI laid over the top.",
    "The Galaxy Tab S7 FE has an 8MP rear and 5MP front-facing camera. Something that's worth noting is that the slate is 5G-connected, something few Android tablets are. You'll be able to buy the slate in black, silver, green or pink.",
    "In the UK, the Galaxy Tab S7 FE price comes in at £589 ($830, AU$1,080) for 4GB RAM and 64GB storage, or £629 ($890, AU$1,150) for 6GB RAM and 128GB storage. It goes up for pre-order on June 2 and is fully available to buy June 18.",
    "Despite the name, the Galaxy Tab A7 Lite isn't 7-inches big. Its display reaches 8.9-inches, and it has a 1340 x 800 resolution.",
    "The battery is 5,100mAh and charging is 15W though again the inbox charger doesn't go that high. The slate has an 8MP rear camera, like the Galaxy Tab S7 FE, but only a 2MP front snapper.",
    "Again, we don't know the tablet's chipset, though it comes with 3GB or 4GB RAM and 32GB or 64GB storage. It's not 5G-connected, though can connect to 4G networks. Like the Tab S7 FE it has a USB-C port, but unlike that other device it has a 3.5mm headphone jack too.",
    "We've asked Samsung for more information on the areas we don't know about the Galaxy Tab S7 FE and the Galaxy Tab A7 Lite with a plan to update this article at a later date with more details.",
    "In the UK, the Galaxy Tab A7 Lite price is £149 ($210, AU$270) for a Wi-Fi connected model, or £179 ($250, AU$330) for LTE connectivity. It is fully available to buy June 18. Pricing information for other markets is yet to be confirmed, although in Australia, the tablets will be available only in \"the second half of 2021\"."
  ],
  "headers": {
    "3": "Samsung Galaxy Tab S7 FE specs",
    "8": "Samsung Galaxy Tab A7 Lite"
  },
  "links": {
    "Samsung Galaxy Tab S7 FE": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}