{
  "source": "https://www.techradar.com/news/the-alienware-m15-is-one-of-my-favorite-gaming-laptops-and-its-on-sale-right-now",
  "title": "The Alienware M15 is one of my favorite gaming laptops – and its on sale right now",
  "category": "computing",
  "updated": "2021-06-20T23:25:31Z",
  "author": "bill-thomas",
  "summary": "Save on one of the most luxurious gaming laptops we've used",
  "article": [
    "When it comes to the best gaming laptops, there's probably no better example right now than the Alienware m15. The only problem it's ever had is that it's a bit too pricey – but with this Best Buy deal ahead of Prime Day, you can save a bit of cash.",
    "Right now at Best Buy, you can get the Alienware m15, packed with an Intel Core i7-10870H, 16GB of RAM and an Nvidia GeForce RTX 3070 for $1,849 – a tidy $250 off its list price.",
    "Now, you may have noticed that the Intel Core i7-10870H is a last-generation part, as the Core i7-11850H has replaced it. However, that new processor has only a marginal bump in performance, so you're not really missing out on anything by going with the 10th-gen part. Plus, it's a gaming laptop, and that RTX 3070 is going to be doing a lot of the heavy lifting, let's not kid ourselves.",
    "But pretty much any gaming laptop these days with an RTX 3070 is going to bring its A-game when it comes to graphics heavy lifting, but what makes the Alienware m15 so great is that it has everything you could want in a gaming laptop in 2021.",
    "It's thin and light enough to carry around with you, it has a lovely display that brings a high refresh rate without sacrificing quality, and it has one of the most comfortable keyboards in a gaming laptop. Sure, it looks like an Alienware laptop, but it's also become one of my favorite laptops to work on in spite of that, but not having to go into the office helps with that.",
    "There are a lot of premium gaming laptops out there, but if I had to pick between this and something like the Razer Blade, I'd probably go with the Alienware m15 every single time. The $250 discount is just icing on the cake.",
    "And if you're not in the US, we've included some Alienware m15 deals down below, so you can save no matter where you are.",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {},
  "links": {
    "best gaming laptops,": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Alienware m15": "https://www.techradar.com/reviews/alienware-m15-r3-2020",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Razer Blade,": "https://www.techradar.com/reviews/razer-blade-15-2020",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}