{
  "source": "https://www.techradar.com/news/10-new-movies-and-shows-on-netflix-amazon-prime-and-more-in-march-2021",
  "title": "10 new movies and shows to watch on Netflix, Amazon Prime and more in March 2021",
  "category": "entertainment",
  "updated": "2021-03-03T10:04:39Z",
  "author": "tom-power",
  "summary": "These are our tip picks for the month",
  "article": [
    "Looking for the best movies and TV shows to stream on Netflix, Amazon Prime, HBO Max and more in March 2021? There's plenty of new stuff dropping on these streaming platforms this month, and you might need a few recommendations to make sure you only hit the highlights.",
    "Oh, and a new service launches this month in the US – Paramount Plus. So there's a lot going on in the world of TV this March.",
    "Below, we've picked out 10 upcoming films and TV series that you won't want to miss for March 2021, and there's something for everyone here to enjoy. From action-packed anime shows to comic book adaptations, and fantasy horror series to comedy flicks, you won't be left wanting for things to binge watch.",
    "Here are our top 10 choices for Netflix, Amazon Prime, HBO Max, and more this month.",
    "Eddie Murphy and Arsenio Hall reprise their multiple roles in this comedy follow-up to 1988's Coming to America. Murphy stars as Akeem Joffer, soon-to-be-King of Zamunda, who returns to America alongside trusted confidante Semmi (Hall) to find the son he never knew he had.",
    "Murphy and Hall lead an all-star cast including Leslie Jones, Tracy Morgan, James Earl Jones, and Jermaine Fowler in a film that brings Zamunda and its unique cast of characters to a new audience. Amazon Prime bought the rights, so it's landing straight on the streaming service and bypassing a theatrical release.",
    "Coming 2 America will launch exclusively on Amazon Prime Video on March 5.",
    "Disney's latest animated feature arrives early this month and, as we mentioned in our review, it's a movie that families will definitely enjoy.",
    "Raya and the Last Dragon tells the tale of the titular Raya (Kelly Marie Tran), who must seek out the last remaining dragon Sisu (Awkwafina) to restore harmony to the world and end the threat posed by the mindless plague known as the Druun.",
    "The film looks gorgeous and there is enough action and humor to keep kids entertained. It's a slightly darker Disney film than recent efforts, and some fans may be disappointed at the lack of traditional sing-along musical numbers. If you can look past that, though, it's one to check out – assuming you don't mind paying extra on top of your Disney Plus subscription fee to access it.",
    "Raya and the Last Dragon lands in theaters and on Disney Plus with Premier Access on March 5.",
    "Tom Holland breaks free of his Spider-Man commitments to portray an army medic turned opioid-addicted criminal in this crime drama from the Russo brothers.",
    "Based on the novel of the same name, Holland plays Cherry, a fictionalized version of author Nico Walker who returns from active duty with PTSD. Unable to fight off his inner demons, Cherry makes a series of terrible life choices that threaten to shatter his relationship with girlfriend Emily (Ciara Bravo) and force him down a path that he can't return from.",
    "Reviews for the movie have been mixed since its theatrical release. If you're fan of Holland or the Russo brothers, though, this at-times black-comedy flick will be the perfect film to switch your brain off for.",
    "Cherry is out now in cinemas, but will launch on Apple TV Plus on March 12.",
    "It's been four years since Justice League fans began calling for Zack Snyder's cut of the movie to be released. Now, that wish is finally becoming a reality, as Zack Snyder's Justice League release comes ever closer.",
    "The director's original vision for the DC superhero team-up film will be one of the longest movies ever - it clocks in at over four hours - so you'll need a bathroom break or two if you watch it in one go. With plenty of additional footage to wrap your eyeballs around, there will be plenty of new stuff for those who saw the 2017 version to see. Whether it marks a vast improvement on the original cut remains to be seen, of course, but it's not like it can get much worse.",
    "Zack Snyder's Justice League will launch in theaters and on HBO Max on March 18. It'll be available in the UK, too.",
    "Marvel Studios' second TV offering of 2021 arrives in mid-March, and fans are eagerly looking for to what's in store for Sam Wilson (Anthony Mackie) and Bucky Barnes (Sebastien Stan).",
    "With Captain America passing on his famous shield to Wilson in Avengers: Endgame, the duo must put their differences aside and team up to put a stop to anti-patriotism group The Flag Smashers and the returning Baron Zemo (Daniel Bruhl). The pair are aided by Sharon Carter (Emily VanCamp), but will have to contend with the US government-developed U.S. Agent (Wyatt Russell), who seemingly takes up the Captain America mantle in Steve Rogers' absence.",
    "The Falcon and the Winter Soldier premieres exclusively on Disney Plus on March 19, with new episodes released weekly.",
    "It's time to rev those engines, F1 fans, as the third instalment in Netflix's Drive to Survive series arrives this month.",
    "Motorheads will be given unprecedented access to the 2020 season that, like everything else last year, was postponed by four months due to the Covid-19 pandemic. Despite the truncated championship composed of 17 races instead of 22, there was plenty of high-speed action and behind-the-scenes moments that Formula 1 fans will enjoy from this latest season.",
    "Formula 1: Drive to Survive: Season 3 will be released on March 19 exclusively on Netflix.",
    "Netflix has made a play to become the go-to streamer for anime series in recent times, and DOTA: Dragon's Blood is the next entry in this genre's back catalog.",
    "Based on Valve's critically-acclaimed strategy game franchise, Dragon's Blood tells the tale of Davion (Yuri Lowenthal), a renowned Dragon Knight who travels across the land to rid it of evil. When Davion encounters an Eldwurm dragon far beyond his capabilities, however, he'll have to team up with the mysterious Princess Mirana (Lara Pulver) to bring peace back to the world.",
    "DOTA: Dragon's Blood will exclusively launch on Netflix on March 26.",
    "Amazon Prime Video will hope that its latest graphic novel adaptation will be as successful as The Boys. Invincible stars The Walking Dead alumni Steven Yeun as Mark Grayson, a 17-year-old son of the world's most powerful superhero Omni-Man (J.K. Simmons). When Mark develops powers of his own, he's taken under his father's wing to hone his skills - until Mark discovers that his father's legacy isn't what it appears to be.",
    "Based on Robert Kirkman's popular graphic novel series, Invincible's adult animated show has a stacked cast including Sandra Oh, Seth Rogen, Zazie Beetz, Mark Hamill, and Jason Mantzoukas. Superhero fans shouldn't miss it.",
    "Invincible's first three episodes arrive exclusively on Amazon Prime Video on March 26, with new instalments releasing each week.",
    "This Sherlock Holmes spin-off might fill the fantasy void in your viewing schedule. Set in Victorian London, The Irregulars follows a gang of street kids who begin working for Dr. Watson and his elusive detective friend. As each investigation takes on an increasingly supernatural edge, it'll be up to The Irregulars to solve the overarching mystery and, perhaps, save the world in the process.",
    "The Irregulars stars the likes of Thaddea Graham and Darci Shaw as the troubled teens, while Henry Lloyd-Hughes and Royce Pierreson will feature as Holmes and Watson respectively. Created by Tom Bidwell, the show has been loosely inspired by Arthur Conan Doyle's stories about the world's greatest detective.",
    "The Irregulars launches on March 26 exclusively on Netflix.",
    "The world's two most famous titans will finally clash when Godzilla vs Kong arrives on HBO Max at the end of the month. The upcoming monster action flick from Adam Wingard is the sequel to Godzilla: King of the Monsters and Kong: Skull Island, and seemingly pits the duo against one another for supremacy of the Earth.",
    "That said, there appears to be more than meets the eye as the pair duke it out, and it'll be up to the film's human cast - including the returning Millie Bobby Brown and Kyle Chandler - to find out the reasons behind Godzilla's increasingly erratic behavior.",
    "Godzilla vs Kong arrives on March 26 in the UK and other global markets, before landing on HBO Max on March 31 in the US."
  ],
  "headers": {
    "4": "Coming 2 America (Amazon Prime Video)",
    "7": "Raya and the Last Dragon (Disney Plus)",
    "11": "Cherry (Apple TV Plus)",
    "15": "Zack Snyder's Justice League (HBO Max)",
    "18": "The Falcon and the Winter Soldier (Disney Plus)",
    "21": "Formula 1: Drive to Survive: Season 3 (Netflix)",
    "24": "DOTA: Dragon's Blood (Netflix)",
    "27": "Invincible (Amazon Prime Video)",
    "30": "The Irregulars (Netflix)",
    "33": "Godzilla vs Kong (HBO Max)"
  },
  "links": {
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "review": "https://www.techradar.com/reviews/raya-and-the-last-dragon",
    "Zack Snyder's Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3"
  }
}