{
  "source": "https://www.techradar.com/news/spider-man-across-the-spider-verse-part-1-trailer-8-things-you-may-have-missed",
  "title": "Spider-Man: Across the Spider-Verse Part 1 trailer – 8 things you may have missed",
  "category": "entertainment",
  "updated": "2021-12-06T16:18:17Z",
  "author": "tom-power",
  "summary": "Spider-Man: Across the Spider-Verse Part 1 arrives in October 2022",
  "article": [
    "Potential spoilers follow for Spider-Man: Across the Spider-Verse Part 1.",
    "It'll be time to return to the Spider-Verse soon. And no, we're not just talking about Spider-Man: No Way Home.",
    "Three years after Spider-Man: Into the Spider-Verse wowed audiences with its wonderful comic book art style, emotionally engaging story, banging soundtrack and unique spin on the popular superhero, it's time for the next entry in Miles Morales' animated film journey.",
    "Spider-Man: Across the Spider-Verse, the sequel to Sony Pictures' original flick, is set to arrive in theaters on October 7, 2022. Well, Part 1 is, with Part 2 not due to land until 2023. After what feels like a lengthy wait, though, Sony finally gave us our first look at the upcoming sequel with a two-minute teaser trailer at Comic-Con Brazil (CCXP) 2021. If you missed its unveiling on December 4, you can check it out below:",
    "There's a lot to take in from Spider-Man: Across the Spider-Verse Part 1's first trailer. We see Miles and Spider-Gwen reunite, Miles grappling with Spider-Man 2099, a few teases about some new comic book-inspired Spidey worlds, and more, all within its two minutes and 30 seconds runtime.",
    "And that's only the stuff we can see in real time. There are plenty of Easter eggs and hidden secrets in Spider-Man: Across the Spider-Verse Part 1's first teaser, which we imagine you'll have missed on your first or even your tenth viewing.",
    "Here, then are eight things you may have missed in Spider-Man: Across the Spider-Verse Part 1's trailer:",
    "One of the biggest 'I wonder what that is' moments from the trailer is a gadget that Spider-Gwen is wearing on her left wrist. You can see it as soon as she lands in Miles' reality in the image above.",
    "So what is it? It appears to be a time-travel gadget that allows Gwen to traverse the Spider-Verse through the hexagonal, orange portals that we see throughout the teaser.",
    "Interestingly, Spider-Man 2099, aka Miguel O'Hara, who will again be voiced by Oscar Isaac after the actor's brief turn as the character in Into the Spider-Verse's post-credits scene, also appears through one of these portals later in the trailer. Is O'Hara the person behind this Spider-Verse time travel gadget, then? And has he given one to Gwen, so that she can go and request Miles' help with a new multiversal threat?",
    "In our opinion, all signs point to yes. Much like other Spider-Man versions, O'Hara is an intellectual genius. And, given that he resides in the year before the 22nd century, technology should have advanced at such a rate (by that time, anyway) that he could find a way to hop between universes to counter any threats to the multiverse. We actually see him wearing a very similar device in Into the Spider-Verse's post-stinger scene, too, so we're pretty confident about this one.",
    "Speaking of the hexagonal tunnel portals that we see in the trailer, they're another neat call-back to a few Marvel productions.",
    "We've seen similar hexagon-style jump points in Guardians of the Galaxy Vol. 2 and Captain Marvel, so it's cool that there's some continuity that's maintained between those live-action movies and this animated sequel.",
    "Into the Spider-Verse was chock full of tongue-in-cheek call-backs to the not-so-great aspects of Spider-Man's illustrious comic history.",
    "One particularly maligned item – for comic fans, anyway – is the Spider-Mobile, a buggy-style vehicle that has fleetingly appeared in various Spider-Man comic runs. Given that the wallcrawler has a far superior way of traversing New York – i.e. swinging through the city using his web shooters – it always seemed like a daft move to give Spider-Man a car to drive around in.",
    "But we digress. The Spider-Mobile was one of the more obvious Easter eggs that was included in Into the Spider-Verse – it makes an appearance alongside other Spidey vehicles in Aunt May's underground tech lair.",
    "It also shows up in Across the Spider-Verse Part 1's trailer but, this time around, its appearance is more of a blink-and-you'll-miss-it moment. Skip to the 0:55 minute mark, after Gwen has grabbed Miles' sketch book, and look at his bookcase. You'll spot a model of the Spider-Mobile on the third shelf down. Pretty neat, eh?",
    "We get a funny little moment in the trailer when Gwen spots a drawing of her, by Miles, in his sketch book. But, if you look on the other page of the book, you'll see a bus ticket that harks back to Into the Spider-Verse.",
    "How? Well, the ticket has 'Hudson Valley Explorer' on it. This is a call-back to the bus that Miles and Peter B. Parker ride on in order to travel to Kingpin's research facility. Given that this was Miles' first real mission as a Spider-Man, it's obvious that he'd keep this item as a reminder of his first superhero venture.",
    "Another moment you'll probably have missed is that we'll be traveling to Spider-Man 2099's own universe in the movie.",
    "Right after O'Hara grabs Miles during the teaser, we see a number flash up on his wrist gadget for a brief moment before the action jumps to a new world. The number that shows up is '928', which refers to the version of Earth that O'Hara hails from.",
    "In the comics, Earth-928 is a possible future version of Earth-616, which is the main universe in Marvel's literary works. Here, a massive civil war breaks out between humans and mutants, which the humans win.",
    "It's after this war that O'Hara tries to replicate the Spider-Man formula and, long story short, winds up becoming imbued with spider-like abilities, including superhuman strength, speed and endurance, enhanced healing and vision, organic webbing that he shoots from his forearms, retractable talons on his fingers and toes, and secreting paralyzing venom from fangs.",
    "So yes, we'll be visiting O'Hara's own universe at some point – we even get a brief glimpse of it after he throws Miles through another portal before the teaser ends.",
    "Another cool addition to this version of Spider-Man 2099 is the color of his webbing.",
    "In the comics, O'Hara has clear/white webbing, just like his fellow webheads. In Across the Spider-Verse's teaser, however, we see that his webbing is orange. This is likely to be part of a suit upgrade – that is, if Spider-Man 2099's webbing isn't organic and is, instead, synthetic like the type that other Spider-Men have – that helps him to grab people who may not be from his universe.",
    "As we saw in Into the Spider-Verse, people start to glitch out if they weren't born in the universe that they've accidentally been transported to. So maybe O'Hara's webbing allows him to lasso people, such as Miles, and stabilize their genetic makeup in different universes. That is, until he can give Miles his own multiverse traversal gadget.",
    "Naturally, a Spider-Verse movie is going to reunite us with Spider-People we've seen before, as well as potentially introduce us to new Spider-Men.",
    "One such individual that we may see is Spider-Man India. After Miles travels through one multiverse tunnel, he arrives in a world that's been drawn and colored in a pencil aesthetic. It's here where he's grabbed by Spider-Man 2099 and, as the duo bounce off the environment and each other, we see distinctive Hindi text flash on screen – much like the 'Thwip' word and other text we saw in Into the Spider-Verse. There's only one Spider-Man character who would speak Hindi, and that's Spider-Man India.",
    "The end of the trailer also teases some other potential Spider-People. We see a number of logos flash up on the screen, which might hint at the arrival of Spider-Punk or Silk.",
    "We know Jessica Drew's Spider-Woman is already part of the cast (she'll be voiced by Issa Rae), while Japanese Spider-Man has also been teased by the film's co-writer Phil Lord. But it would be cool to see even more Spider-People turn up in Across the Spider-Verse Part 1 and Part 2.",
    "Okay, the trailer doesn't tease this per se. But, based on the fact that this is an expanded, interdimensional story, we suspect that it'll be The Spot.",
    "Wait, who? The Spot, whose real name is Johnathan Ohm who, in the comics, is a scientist who works for Kingpin (where have we seen this before?). Tasked with trying to reproduce the radiation levels of the vigilante known as Cloak, Ohm winds up creating a black portal to an unknown realm, which he steps through and acquires the abilities to, namely, teleport between dimensions and different realities.",
    "If he's moving between universes and causing chaos wherever he goes, The Spot may come to the attention of Spider-Man 2099, who wants to put an end to his escapades. That would lead O'Hara to go and recruit Spider-Gwen, Miles and company as each of their realities would be in danger of The Spot's masterplan. Hence why they need to travel between various worlds using O'Hara's time-traveling gadgets and stop The Spot together."
  ],
  "headers": {
    "7": "1. What gadget is Spider-Gwen wearing?",
    "11": "2. The return of the hexagons",
    "13": "3. A wheely good spot",
    "17": "4. A ticket to ride",
    "19": "5. Visiting Spider-Man 2099's universe",
    "24": "6. Slinging orange webbing",
    "27": "7. The arrival of new Spider-Men",
    "31": "8. Who is the villain?"
  },
  "links": {
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Spider-Man: Across the Spider-Verse": "https://www.techradar.com/news/new-spider-verse-trailer-teases-not-one-but-more-spider-man-movies"
  }
}