{
  "source": "https://www.techradar.com/news/this-leading-vpn-provider-is-launching-another-major-privacy-tool",
  "title": "This leading VPN provider is launching another major privacy tool",
  "category": "computing",
  "updated": "2021-01-15T21:08:30Z",
  "author": "anthony-spadafora",
  "summary": "ProtonVPN can now block malware, ads and online trackers",
  "article": [
    "In an effort to further protect users of its VPN service online, ProtonVPN has released a new privacy tool called NetShield which blocks malware, ads and online trackers.",
    "The new tool is now available in the company's Android, iOS, macOS and Windows VPN apps and it is also in beta in its Linux command line tool. NetShield helps keep users devices safe while also improving browsing speeds by blocking ads and trackers before they even load.",
    "When enabled, NetShield offers two levels of protection. First the tool prevents user's browsers from loading resources from domains which host malware, spyware and other malicious software by default. NetShield also blocks ads and online trackers used to target users by adtech companies.",
    "Once a user has enabled NetShield, any time they visit a website the ProtonVPN app will check the site's address against a massive database of malicious sites. If the tool finds that a site a user is trying to visit does host malware, spyware or other malicious software, NetShield will automatically block it from loading.",
    "Unlike other ad blockers which only work in your browser, NetShield's ad and tracker blocking works across your entire device. Not only are unwanted ads annoying but they can also eat up data and slow down your browsing experience online.",
    "Founder and CEO of ProtonVPN, Andy Yen explained in a press release that the company created NetShield due to how difficult it has become to opt-out of online tracking and advertising, saying:",
    "“In recent years, it has become increasingly difficult to opt-out of online tracking and advertising. Big tech companies not only track you on your devices and on their websites, but also across the entire web. NetShield helps tilt this balance of power by giving any Internet user the ability to opt-out of most tracking, while also including additional protection against malware threats.”",
    "Paid ProtonVPN users can begin using NetShield today by updating to the latest version of the company's VPN app."
  ],
  "headers": {
    "3": "NetShield"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ProtonVPN": "https://www.techradar.com/reviews/protonvpn",
    "malware": "https://www.techradar.com/news/what-is-malware-and-how-dangerous-is-it",
    "ad blockers": "https://www.techradar.com/news/googles-new-web-standard-could-disable-your-ad-blocker",
    "Andy Yen": "https://www.techradar.com/news/google-vpn-why-one-company-thinks-big-techs-entry-into-the-privacy-space-is-a-terrible-idea"
  }
}