{
  "source": "https://www.techradar.com/news/the-cambridge-audio-melomania-1-have-been-given-a-huge-upgrade",
  "title": "The Cambridge Audio Melomania 1 have been given a huge upgrade",
  "category": "audio-visual",
  "updated": "2021-03-09T14:05:35Z",
  "author": "rhys-wood",
  "summary": "The next big step for Cambridge Audio?",
  "article": [
    "Cambridge Audio has revealed the Melomania 1+ wireless in-ear headphones, the follow-up to the Melomania 1 wireless headphones from 2019.",
    "The Melomania 1+ look to enhance the feature set of its predecessors, by adding customizable EQ settings, app control to check battery level (and to locate your earbuds should you lose them), and an “innovative” High Performance Mode. Some quality-of-life upgrades are also present, including USB-C fast charging and a variety of memory foam ear tips.",
    "The Melomania 1+ are available to buy now for $139.95 / £119.95 (about AU$180), putting the new wireless earbuds in roughly the same price range as Cambridge Audio’s prior Melomania 1.",
    "The Melomania 1+ will also maintain an enviable battery life, offering nine hours on a single charge. The included compact charging case can also offer up to 45 hours of total playtime – definitely a feature to look forward to if you use wireless headphones frequently.",
    "The new earbuds continue the brand’s use of Bluetooth 5, allowing for AAC and aptX codec support. This essentially means the headphones should be able to handle high-quality wireless audio without a drop off in calibre.",
    "We gave high praise for the Melomania 1 in our review, citing their incredible audio quality, comfy design, and great value for money. However, the lack of noise cancellation was a definite drawback compared to models like the Sony WF-1000XM3 wireless earbuds and the Apple AirPods Pro.",
    "Cambridge Audio has certainly been busy the last few months, too, with the company also launching the Melomania Touch wireless earbuds towards the end of last year. The Melomania Touch also lack noise cancellation, despite building on the qualities that made the Melomania 1 so good.",
    "The omission of noise cancellation seems to be a trend for the Melomania range of earbuds – but why? One reason could be an effort on Cambridge Audio’s part to help keep costs down, or perhaps a focus on delivering high fidelity sound. That said, the Melomania Touch boast some great new features like touch controls and all-around better design, with a comparable price tag to the Melomania 1.",
    "You’d think a logical next step for Cambridge Audio would be to expand on the Melomania brand by offering a premium option with noise cancellation, to more directly target its competitors at Apple and Sony. Perhaps Cambridge Audio has this in mind for future earbuds, as we’re sure the company could offer such a device at a competitive price point."
  ],
  "headers": {
    "3": "An ear for quality"
  },
  "links": {
    "Melomania 1 wireless headphones": "https://www.techradar.com/reviews/cambridge-audio-melomania-1",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Melomania Touch": "https://www.techradar.com/reviews/cambridge-audio-melomania-touch-review"
  }
}