{
  "source": "https://www.techradar.com/news/dells-latest-chromebook-is-all-about-democratizing-internet-access",
  "title": "Dell's latest Chromebook is all about democratizing internet access",
  "category": "computing",
  "updated": "2021-01-18T18:08:57Z",
  "author": "barclay-ballard",
  "summary": "The new device meets the needs of students learning remotely",
  "article": [
    "While the coronavirus pandemic continues to disrupt life for many employees, it shouldn’t be forgotten how much of an impact the virus has had on school-age children.",
    "With this in mind, Dell has released a new Chromebook with an LTE-enabled option specifically designed to work as a school laptop.",
    "In order to address the needs of students learning remotely, Dell has launched the Chromebook 3100 with LTE. The new device allows the owner to choose their mobile carrier, which will be welcomed by students that are struggling to find reliable internet access.",
    "In addition to its new Chromebook, Dell has also unveiled its new Latitude 3120 device, which can function as either a laptop or a 2-in-1 device. By offering ultra-fast Wi-Fi 6 technology, the device promises to deliver a reliable and fast connection for individuals working or learning from home.",
    "Dell’s new releases are also designed to withstand the robust treatment sometimes meted out by younger users. All of the firm’s education-focused devices have been tested to withstand 48-inch drops on plywood floors, as well as 12-ounce liquid spillages.",
    "The new Dell laptops should greatly help with democratizing internet access, particularly in the US. Research published late last year found that online latency can have a huge impact on an individual’s ability to work and learn effectively.",
    "“The pandemic has revealed the disparity in access to the basic requirements for remote learning,” Meghana Patwardhan, Vice President of Dell Latitude and Mobility Products at Dell Technologies, explained.",
    "“A recent New Common Sense and Boston Consulting Group analysis shows that up to 16 million kids and as many as 400,000 teachers in the US alone lack adequate internet or computing devices at home. Most visible in rural and ethnic minority communities this lack of access to basic needs – devices, broadband, digital literacy and critical skills for the digital economy – mean these communities are at risk of falling further and further behind.”"
  ],
  "headers": {
    "3": "Internet for all"
  },
  "links": {
    "school laptop": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "Research": "https://www.techradar.com/news/poor-latency-could-be-a-major-issue-for-video-conferencing-and-wfh-across-the-us",
    "explained": "https://www.delltechnologies.com/en-us/blog/learn-from-anywhere-resilient-laptops-meet-resilient-students/"
  }
}