{
  "source": "https://www.techradar.com/news/far-cry-7-could-reportedly-shake-the-series-up-by-being-more-online-oriented",
  "title": "Far Cry 7 could reportedly shake the series up by being more ‘online-oriented’",
  "category": "gaming",
  "updated": "2021-10-09T12:48:39Z",
  "author": "emma-boyle",
  "summary": "Is change on the cards?",
  "article": [
    "Far Cry 7 might take Ubisoft’s popular series in a totally new direction by leaning into a more “online-oriented approach”.",
    "That’s according to a recent report from Axios Gaming’s Stephen Totilo, who says that, following the recent release of Far Cry 6, “Ubisoft appears to know a shake-up is needed.”",
    "As for what this shake-up will involve, Totilo claims that a source has said Ubisoft is “exploring a more online-oriented approach for a sequel.”",
    "This wouldn’t be the first time we’ve heard rumblings of a Far Cry re-invention; earlier this year Bloomberg’s Jason Schreier suggested during an episode of the Triple Click podcast that the next game in the series could take things in a “radically different direction.”",
    "What exactly this more online-oriented approach could involve and whether it would be a spin-off or an outright overhaul of the mainline series, however, remains unclear.",
    "Earlier this year, Ubisoft said (via Axios) it was looking to diversify its offering with more free-to-play and mobile releases alongside its big-budget AAA titles. In that line, we’ve just seen the announcement of the free-to-play Ghost Recon Frontline and there’s also Assassin’s Creed Infinity, the mysterious planned evolution of the long-running Assassin’s Creed series.",
    "With that in mind, it doesn’t seem totally implausible that Ubisoft might be looking to make changes to Far Cry. It’s worth noting, though, that these reports aren’t confirmations from Ubisoft that there are definite plans to take the series online going forward. If there are internal discussions taking place they could always change and we won’t know for sure what the future of the series is until we hear it from Ubisoft itself.",
    "Far Cry 6 is the latest release in the Far Cry series and the general consensus in reviews appears to be that, yes, it’s more Far Cry for good and for bad. In our own four star review, we enjoyed a lot of the familiar fun that the game had to offer, as well as its compelling story and cast of characters. But we also felt it was better played in short bursts as it can “often lean a bit too heavily in the series’ trappings, and it’s not quite free from that tried and tested Ubisoft level of repetition.”",
    "If tried and tested is becoming tired and testing, maybe it’s not so bad that Ubisoft is already thinking about how it will make things feel more fresh next time around. The issue is, a more “online-oriented approach” is kind of vague.",
    "Far Cry is a series that could be suited to an experiment with online multiplayer elements. But would long-time fans who look forward to their annual fix of single-player chaos be happy if that replaced mainline releases? Our instinct is probably not.",
    "Online multiplayer games and battle royales are hugely popular so it’s kind of easy to see why plugging those elements into an existing series might seem like a good way to freshen up its formula. But it’s not a sure-fire fix. As an example, the newly announced free-to-play Ghost Recon Frontline is currently receiving backlash as fans of the series express their displeasure by hammering the dislike button on the trailer on YouTube.",
    "Then there's Assassin’s Creed Infinity. It's still kind of a mystery but reports suggest that it’ll be an online game that will evolve over time as a live service, with Ubisoft saying that “rather than continuing to pass the baton from game to game, we profoundly believe this is an opportunity for one of Ubisoft’s most beloved franchises to evolve in a more integrated and collaborative manner.” Could something like this work for Far Cry?",
    "Maybe the Far Cry franchise is in need of some changes but what the right change is remains to be seen. Perhaps Ubisoft is waiting for the dust to settle around Far Cry 6 but we are interested in seeing what the future holds for the series."
  ],
  "headers": {
    "7": "Analysis: Is it time for a shake-up?"
  },
  "links": {
    "Axios Gaming’": "https://www.axios.com/ubisofts-far-cry-sequel-e05b168f-49f3-47bc-b186-5210201827c0.html",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "an episode of the Triple Click podcast": "https://maximumfun.org/episodes/triple-click/prepare-for-a-weird-e3/?utm_source=newsletter&utm_medium=email&utm_campaign=newsletter_axiosgaming&stream=top",
    "Axios": "https://www.axios.com/ubisofts-mobile-f2p-game-develpment-1b114a94-26a3-487b-8a4e-37ae7d07ee86.html?utm_source=newsletter&utm_medium=email&utm_campaign=newsletter_axiosgaming&stream=top",
    "Assassin’s Creed Infinity": "https://www.techradar.com/news/assassins-creed-infinity-what-you-need-to-know-about-the-new-assassins-creed-platform",
    "our own four star review": "https://www.techradar.com/reviews/far-cry-6",
    "trailer on YouTube": "https://www.youtube.com/watch?v=7NewkthNMDE",
    "saying": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-7100247477934493000&sharedId=trd-us&u=https%3A%2F%2Fnews.ubisoft.com%2Fen-us%2Farticle%2FGZi5hT4dBeM8YITOsJeCn%2Fan-update-on-assassins-creed-infinity-and-the-future-of-the-assassins-creed-franchise"
  }
}