{
  "source": "https://www.techradar.com/news/exclusive-realme-is-ending-one-of-its-phone-lines-and-for-an-exciting-reason",
  "title": "Exclusive: Realme is ending one of its phone lines, and for an exciting reason",
  "category": "phones",
  "updated": "2021-08-13T15:09:27Z",
  "author": "tom-bedford",
  "summary": "Realme X? More like ex-Realme",
  "article": [
    "One of the best Android phones of 2021 is the Realme GT, the first of a new family of Realme phones that doesn't cost much money at all, but has some surprisingly high-end specs. In China, Realme has launched two new entries in the line, which are confirmed to go global soon, but TechRadar has just learnt the knock-on effect of these new devices.",
    "Speaking in an interview with TechRadar, Madhav Sheth, the CEO of Realme Europe and Realme India, confirmed that the GT series is officially replacing the company's previous X series.",
    "\"The X will be replaced by the GT; so the GT is the new X,\" Sheth confirmed, with the addendum that it's only the X line that will be affected - that means the C and numbered series of phones will likely remain unaffected.",
    "The Realme X series was the company's upper-budget and mid-range collection of devices, with recent entries like the X3 SuperZoom and X50 Pro from 2020 sitting above the company's 'main' - or numbered - handsets like the Realme 7 or Realme 8 families.",
    "Compared to its other series, Realme's X line didn't have as consistent an output or as concrete an identity between devices, two points which the Realme GT certainly fixes. That's not to say the phones were bad - in fact, the Realme X2 Pro was the first handset from the company this writer tested, and it put forward Realme's modus operandi, of top specs at low prices, with clarity and simplicity.",
    "There's no better way to kick off a new product line than with something like the Realme GT; from its distinctive design, to its impressive specs and surprisingly low price, it's bound to be one of 2021's highlights - at least in the mobile world.",
    "By confirming that the Realme X line was being replaced by the GT, it implicitly suggests we'll be seeing far more of the phones, beyond the two new phones (the GT Master Edition is confirmed to launch globally on August 18; it launched in China alongside the Explorer Edition, so it follows that will be coming to global markets too, but the company has been shtum on that).",
    "Therefore we'll hopefully see a Realme GT 2 or similar in 2022, perhaps with specs that, until that point, have only been seen on premium devices. It's good, at least, to hear that the Realme GT wasn't a one-off, as that means the democratization of premium tech will continue.",
    "Realme has been very busy of late. On August 3 it showed off the Realme Flash along with MagDart, a magnetic wireless charging solution to rival Apple's MagSafe. On the same day Realme officially became the fifth-biggest phone company in Europe, with a massive 1800% year-on-year growth (compared to 67% for Xiaomi, 15.7% for Apple and a 7% decline for Samsung).",
    "The company has proven to be highly 'disruptive' - forgive us for using such a marketing term, though it seems appropriate - since it launched in the European market in mid-2019.",
    "It's hard to get excited at much in the smartphone market, with most brands pumping out identical and boring devices, and a few others eking out an existence on wildly overpriced handsets, and that's really why Realme is such a breath of fresh air.",
    "Its devices have offered premium features at low price points, and now we know its most interesting line is likely to continue into the future, Realme is definitely one of the top smartphone brands to watch."
  ],
  "headers": {
    "5": "Analysis: good for Realme, great for Realme fans"
  },
  "links": {
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "Realme GT": "https://www.techradar.com/reviews/realme-gt",
    "two new entries in the line": "https://www.techradar.com/news/realme-gt-master-edition-explorer-launch-china",
    "confirmed": "https://twitter.com/realmeIndia/status/1426091153238134785",
    "X3 SuperZoom": "https://www.techradar.com/reviews/realme-x3-superzoom",
    "X50 Pro": "https://www.techradar.com/reviews/realme-x50-pro-5g",
    "Realme 7": "https://www.techradar.com/reviews/realme-7-review",
    "Realme 8": "https://www.techradar.com/reviews/realme-8-review",
    "Realme X2 Pro": "https://www.techradar.com/reviews/realme-x2-pro",
    "Realme Flash along with MagDart": "https://www.techradar.com/news/realme-flash-is-a-new-android-phone-with-a-better-version-of-iphones-magsafe",
    "Realme officially became the fifth-biggest phone company in Europe": "https://www.techradar.com/news/samsung-is-no-longer-the-biggest-smartphone-vendor-in-europe"
  }
}