{
  "source": "https://www.techradar.com/news/elite-dangerous-odyssey-alpha-phase-3-we-hope-you-like-pumice",
  "title": "Elite Dangerous Odyssey Alpha Phase 3 – we hope you like pumice",
  "category": "computing",
  "updated": "2021-04-20T15:08:17Z",
  "author": "john-loeffler",
  "summary": "New exploration gameplay rolls out",
  "article": [
    "Elite Dangerous Odyssey Alpha Phase 3 is live as the popular space-sim game rolls out all-new gameplay options that let players try out new activities and earn additional achievements.",
    "The Alpha Phase 3 update went live Friday, April 16, 2021, and introduced a major new gameplay experience for exploration enthusiasts. The biological sampling activity brings Elite Dangerous commanders to a planetary surface enveloped by an atmosphere (we haven't encountered any lifeforms on worlds exposed to the vacuum of space ourselves, at least not yet) where they can gather biological data to sell back at space station hubs.",
    "In order to engage in biological collection, you'll need to don the new Artemis suit, which gives you access to the biological sampler tool. Once you've found some flora to scan on a given world, you get close enough to collect a viable sample and pull the trigger on the sampler, bringing up a sample-collection minigame.",
    "You'll see several rings, one stationary outer ring and three spinning inner rings. The goal is to match the symbols on the spinning ring to the stationary one three times by pressing the trigger when the symbols on both rings more or less align.",
    "With each success, the spinning ring gets locked and becomes the new stationary ring to match, with the inner ring now spinning up a bit faster. The symbols were the same each time we did it, so we're assuming that you won't be facing down a new challenge each time.",
    "Just collecting one sample isn't enough, however. You'll need some biological diversity, forcing you to go farther afield to find flora of the same type from a different patch twice more to consider the sample collection a success.",
    "There doesn't appear to be any restriction on the number of samples you can collect in one go, nor does it appear that you can only collect a genetic sample only once. We collected two samples of Osseus Pumice on two different moons in the same system and it was treated as two different entries in our logs.",
    "Finding the biomass can be a bit tricky, however. Thankfully, you can perform a detailed surface scan of a landable planet, which will yield a heatmap overlay that appears to show which areas have vegetation - and presumable their concentration - and which parts of the planet are deserts.",
    "At this stage, there isn't a whole lot of diversity in the kinds of flora you're going to find. For the most part, it appears to be Osseus Pumice as far as the eye can see, but we certainly expect that to change as the game develops.",
    "Once you collect a sample, you can bring it to your friendly neighborhood settlement's, station's, or starport's Vista Genomics desk and sell what you've collected much like you do with stellar system cartographic data.",
    "Also added to this update is the \"First Footfall\" badge, recognizing players who are the first to set foot on a planet's surface, similar to the discovery and mapping achievements listing the names of the first discoverers and surveyors of any given world.",
    "We had not been able to find one ourselves that hadn't already been taken by somebody else, but once the whole galaxy is opened up, there are going to be plenty of worlds for commanders to get first dibs on.",
    "Of all the Elite Dangerous Odyssey Alpha Phase content we've played, the exploration gameplay feels the least developed, so far. At first, nearly every planet we landed on, all we found was sparsely populated patches of pumice.",
    "As fun as it is to say out loud, the actual experience of it was somewhat more underwhelming than the alliteration suggests. These are not lush forests teeming with life out here, but very isolated stretches of flora that could easily be mistaken for rocks at a distance until you know what pumice trees/bushes/bouquets look like.",
    "Even then, there's no escaping the procedurally-generated nature of it, especially when the pumice models themselves all appear identical, other than the scaling of the model used. Obviously, the same could be said of Nature, which makes every pineapple, fir tree, and dandelion more or less carbon-based copies of a single model.",
    "When we figured out how to use the surface scanner properly, however, we were able to find more variety of biologicals (in scanning mode, you can switch what kind of biologicals you're interested in for your heat map). This made the experience more interesting, but not a whole lot more.",
    "We would definitely like to see more diversity in the biological content throughout the galaxy as we explore more and the game approaches its release. There is a technological limit on this, obviously, and we don't expect to see rich, lush grasslands and jungles. But we hope it develops more complexity as it goes.",
    "Otherwise, this gameplay loop is going to get somewhat monotonous for most after the first couple of hours or so. For explorers, you might be performing the same system scans and exploratory fly-bys as always, but at least there's the satisfying honk of the sensor when it's done performing a system scan. No such luck here, but it's early yet, so we'll have to see how this new gameplay element develops."
  ],
  "headers": {
    "2": "Biologically collecting",
    "12": "Pumice is nice, but we'd love to see more"
  },
  "links": {}
}