{
  "source": "https://www.techradar.com/news/the-elder-scrolls-6s-future-on-xbox-could-be-announced-very-soon",
  "title": "The Elder Scrolls 6's future on Xbox could be announced very soon",
  "category": "gaming",
  "updated": "2021-03-09T15:26:23Z",
  "author": "vic-hood",
  "summary": "According to a new report",
  "article": [
    "Update: Microsoft has released a blog post about its Bethesda acquisition. Read the full story here.",
    "Microsoft's acquisition of Zenimax Media, the parent company of Bethesda, has been finalized and, according to a new report, Microsoft is ready to talk about what that means for much-loved franchises such as The Elder Scrolls, Fallout and Doom.",
    "According to a report by GamesBeat, \"sources familiar with the plans\" told the publication that Microsoft is planning to hold a presentation on March 11 to discuss what the acquisition means for players.",
    "While the report claims that it's unlikely we will get any solid details on upcoming Bethesda games like Starfield and The Elder Scrolls 6, Microsoft is expected to announce which of Bethesda games will be making their way to Xbox Game Pass - and that any upcoming Bethesda titles will land on Game Pass at launch.",
    "That means that Xbox Game Pass subscribers would get access to Starfield, The Elder Scrolls 6, the new Indiana Jones game, and any future Bethesda titles, on launch day for free as part of their Xbox Game Pass subscription.",
    "Both companies are also allegedly gearing up for announcements in the Summer (between June and September) but, while Bethesda is now technically a Microsoft studio, the report claims that the two companies plan to hold separate showcases. Though it's possible that the showcases may be held back-to-back.",
    "The big question on everyone's lips is what does the acquisition mean for PlayStation players. As Microsoft now owns Bethesda, it has every right to make any of the developer's future titles Xbox exclusive, meaning future Bethesda games wouldn't launch on the PS5. However, Microsoft hasn't confirmed its plans on platform exclusivity yet.",
    "According to the report, it \"remains unclear\" whether Microsoft will address this during the rumored presentation later this week.",
    "Previously it has been noted by Bloomberg's Jason Schreier via reporter Dina Bass that future Bethesda games \"will be on Xbox, PC and 'other consoles on a case-by-case basis'\". While games already bound by PS5 exclusivity agreements, like Deathloop and Ghostwire: Tokyo, will continue to release as before.",
    "Last we heard, even Sony itself was unclear of what the acquisition would mean for PlayStation players. In an interview with Russian publication TASS (via our friends at GamesRadar), Sony Interactive Entertaiment CEO Jim Ryan said back in November that he's still uncertain as to whether upcoming titles Starfield and The Elder Scrolls 6 will come to PlayStation - or whether both will be Microsoft exclusives.",
    "\"That’s a decision that is out of our hands,\" Ryan said. \"We’ll wait and see what happens. I look forward to learning about that.\"",
    "What does seem likely is that Xbox and PC players are likely to get preferential treatment when it comes to Bethesda games. If Microsoft does decide to allow Bethesda titles onto PS5, we will likely see them hit Xbox Series X and Xbox Series S first - with Xbox Game Pass subscribers getting access as part of their subscription from day one.",
    "It's worth noting that Microsoft hasn't officially confirmed the presentation is taking place on March 11 and there's still a possibility it isn't happening or won't be happening on that particular date. But we're expecting to have our burning questions answered sooner rather than later."
  ],
  "headers": {
    "6": "The big question"
  },
  "links": {
    "here.": "https://www.techradar.com/news/xbox-will-be-home-to-new-and-exclusive-bethesda-games",
    "GamesBeat": "https://venturebeat.com/2021/03/08/bethesda-xbox-presentation/",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "the new Indiana Jones game": "https://www.techradar.com/news/new-indiana-jones-game",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Bloomberg's Jason Schreier via reporter Dina Bass": "https://twitter.com/jasonschreier",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "TASS": "https://tass.com/economy/1225233",
    "GamesRadar": "https://www.gamesradar.com/playstation-boss-unsure-if-the-elder-scrolls-and-starfield-are-coming-to-ps5/",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}