{
  "source": "https://www.techradar.com/news/asus-rog-5-what-can-you-do-with-18gb-of-ram",
  "title": "Asus ROG 5: what can you do with 18GB of RAM?",
  "category": "phones",
  "updated": "2021-03-13T22:41:59Z",
  "author": "david-lumb",
  "summary": "The Asus ROG 5 Ultimate has 18GB of RAM – here’s what it can do",
  "article": [
    "The Asus ROG 5 just launched with up to 16GB of RAM – and if you somehow snag the limited-release Ultimate model, you can hold one of the only smartphones in the world with a whopping 18GB of RAM. But... what does all that RAM get you?",
    "For years, RAM has been used alongside chipset and storage space as shorthand for a phone’s performance. Roughly, the more RAM, the more the phone can do at once: currently open applications use RAM as quickly accessible memory, with excess RAM keeping track of other applications in the background so you can swiftly swap back and forth. Graphics-intensive games may use more RAM, too, to produce lots of complex on-screen effects.",
    "The gold standard of Android phones, the Samsung Galaxy S21, only packs 8GB of RAM, while the S21 Ultra starts at 12GB and maxes out at 16GB. In our testing, these phones handled every task a consumer would put it through, from browsing the internet to binging media to gaming. But they are aimed at mainstream consumers.",
    "Thus, it’s no surprise to us that Asus – itself a producer of gaming-focused products – is signaling to its demographic of performance enthusiasts that its new handset’s 18GB of RAM is an extravagance that can, in theory, push a lot of pixels.",
    "So does that mean you’ll instantly have better graphics in today’s games by playing on an 18GB phone? Not really, according to experts, as you’ll get much the same performance out of phones running 12GB so long as you’re playing casual games.",
    "But we did reach out to ask one developer to explain exactly how that much RAM can help in their AAA mobile game as a case study.",
    "Kabam's Marvel Realm of Champions stars some of the brand's most iconic heroes in team-based 3v3 arena combat between players. We'd asked Kabam's Ethan Young, development director of the game, to explain the differences in playing on an older iPhone 6S vs. playing on a brand-new iPhone 12 Pro – so we wanted his take on the highest 18GB RAM end of the performance spectrum.",
    "\"Having 18GB of RAM when playing MARVEL Realm of Champions will ultimately reduce loading times over long play sessions,\" Young told TechRadar over email. \"Because all assets are cached, the more memory that is available means that the game will not need to release and reload assets frequently if MARVEL Realm of Champions needs to use additional memory.\"",
    "As we noted in the previous piece, Realm of Champions plays perfectly well on the 2016 iPhone 6S, which has 2GB of RAM. Young stated that Kabam ensures its games are playable on older devices through some compromises: when playing on a phone with 3GB of RAM, the game \"will need to release and reload assets frequently as players enjoy the game. With more memory comes more room to frontload assets, which allows for more efficient and enjoyable play.\"",
    "Naturally, the game is designed to play on a range of phones with different specs, and it'll be awhile before 18GB RAM devices are the norm. Playing Realm of Champions on devices with 8GB or 12GB of RAM is just as enjoyable, Young assured.",
    "\"The only advantage phones with additional memory above 8GB is if you’re playing for multiple hours in an individual gaming session, though 8GB devices are also capable of extended play,\" he said.",
    "But what 18GB of RAM can do for tomorrow’s games – especially in mobile esports – is another question.",
    "Mobile games will obviously evolve to take advantage of more powerful components in phones, and we’re already seeing some with graphics rivaling their PC versions – just look to Genshin Impact, suggests Jennifer McLean, VP of Industry Relations at industry analysis firm Niko Partners. But it might be a few years before games come out that can truly harness 18GB RAM.",
    "“As far as game developers taking advantage of the new higher RAM devices – there will need to be a significant enough installed base before developers will make games that require those specs,” McLean told TechRadar in an email.",
    "But there are some gamers who can really use 18GB RAM, according to McLean: “Mobile esports will benefit greatly from these devices NOW.”",
    "Mobile esports has been growing, but is especially embraced in East and Southeast Asia: a Niko Partners report noted that in 2018, mobile esports generated $15.3 billion, of which $5.6 billion came from China alone, compared to $16.1 billion earned by PC esports. Mobile esports games have higher install rates than their PC and console counterparts, which translates to better revenue per player.",
    "Mobile esports require higher-performing phones, so consumers may naturally gravitate toward higher-spec devices like the Asus ROG 5. But it’s not just consumers playing mobile esports – pro players and streamers who need these high-performance phones could drive adoption, too.",
    "“Niko's data on Asia's gamers shows that hardware and peripherals used by esports competitors and streamers influences gamers and fans to purchase those devices as well,” McLean said. “So as we see competitors and streamers adopt these more powerful devices, we will see gamers and fans follow suit.”",
    "Given the release of mobile esports outside East Asia around PUBG Mobile and Call of Duty: Mobile, along with upcoming titles like the still-in-beta League of Legends: Wild Rift and the just-announced PUBG New State, we could see this phenomenon become even more mainstream in the US and Europe.",
    "The good news, then, is that you don’t need to upgrade to 18GB this year. That amount is aspirational – even the upper limit of phones today with 12GB breeze through tasks.",
    "“I don't think that there is a perfect number for how much RAM a smartphone needs. It varies on the operating system and the application,” says Anshel Sag, analyst at Moor Insights and Strategy. “For example, my [Samsung] S21 Ultra is using 75% of RAM on 10GB, which means that 12GB seems pretty reasonable to give breathing room for top-end models.”",
    "That makes even 16GB RAM an edge case for consumers to consider, Sag says, though phone configurations have had that much RAM since 2020 when the Samsung S20 Ultra first offered it.",
    "Of course, the rules are different between Android and iOS. Even the iPhone 12 Pro Max only has 4GB of RAM – and still beats out every other phone yet released on Geekbench 5 benchmarks (4240 iPhone 12 Pro Max vs 3518 Samsung Galaxy S21 Ultra, per GSM Arena). This isn’t exactly new: Apple has always done more with less in terms of RAM thanks to, logically, its control of the entire hardware-software ecosystem in its phones.",
    "That’s very unlike Android, which has to work on devices of far more spec configurations, as Sachin Dev Duggal, Founder & CEO of Engineer.ai, explained in a 2019 Firstpost interview.",
    "“Android is built for various devices with varying hardware specifications, hence, it needs more memory to execute the right code for the right device,” Duggal said. “Also, apps on Android are allowed to use as much of RAM that is required, so, they end up collecting more data on the RAM and when it is not used the data is cleaned.”",
    "iOS, on the other hand, has multiple reasons it needs less RAM – but a big one is memory management: Apple’s operating system “doesn’t rely on Java Virtual machine to execute its codes and the app codes are directly executed on the hardware thus limiting the need for RAM to run virtual machines on iOS,” Duggal explained.",
    "Given that article was written in August 2019, its aspirational questions are correspondingly quaint from today’s perspective: Duggal noted that 6GB of RAM is “more than enough to future-proof a device” and 8GB will be good in the near future. 4GB of RAM was the standard of the day, and continues to be overrepresented in terms of global smartphone distribution: after the iPhone 7 and 8, some of the most popular phones in the world outside China are the Samsung Galaxy S8 and S9 (both of which have 4GB of RAM), according to an April 2020 Yahoo Finance report.",
    "But in the intervening two years since Duggal’s estimations, Android phones have included more RAM, and developers will likely start upgrading their system requirements for more functionality and, in games, more advanced graphics. The high-water mark for RAM will rise as original equipment manufacturers (OEM) aka phonemakers stuff more and more in their devices.",
    "“Android is inherently a more memory-hungry operating system, so it appears that OEMs are looking for ways to up the specs for differentiation but also to improve the user experience as apps get more memory-hungry on Android,” Sag pointed out.",
    "In short: you probably won’t need an 18GB RAM phone for awhile, but as always, it’s nice to be ahead of the curve when developers start adapting to the new cutting edge."
  ],
  "headers": {
    "6": "The 18GB question: how will it improve games now?",
    "12": "Games will harness 18GB of RAM...when more phones have 18GB of RAM",
    "19": "The magic RAM number"
  },
  "links": {
    "Asus ROG 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "explain the differences": "https://www.techradar.com/news/iphone-12-vs-iphone-6s-see-the-difference-in-game-graphics-youre-missing-out-on",
    "Genshin Impact": "https://www.techradar.com/news/genshin-impact-free-zelda-clone-to-play-while-you-wait-for-breath-of-the-wild-2",
    "report": "https://nikopartners.com/evolution-of-mobile-esports-for-the-mass-market/",
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "Call of Duty: Mobile": "https://www.techradar.com/news/call-of-duty-mobile-season-1",
    "Wild Rift": "https://www.techradar.com/news/league-of-legends-mobile",
    "PUBG New State": "https://www.techradar.com/news/pubg-mobile-new-state-release-date-price-trailer-and-everything-we-know-so-far",
    "GSM Arena": "https://www.gsmarena.com/samsung_galaxy_s21_ultra-review-2219p5.php",
    "Firstpost": "https://www.firstpost.com/tech/news-analysis/smartphones-now-feature-up-to-12-gb-ram-but-how-much-of-it-do-you-really-need-7086651.html",
    "Yahoo Finance": "https://finance.yahoo.com/news/most-popular-smartphone-world-now-171603364.html"
  }
}