{
  "source": "https://www.techradar.com/news/xbox-series-x-fps-boost-could-work-on-xbox-360-and-original-xbox-games-in-the-future",
  "title": "Xbox Series X could give Xbox 360 and original Xbox games a renaissance",
  "category": "gaming",
  "updated": "2021-02-23T18:04:02Z",
  "author": "adam-vjestica",
  "summary": "New FPS Boost feature could help older titles",
  "article": [
    "Microsoft’s new FPS Boost feature on Xbox Series X and Xbox Series S has the potential to quadruple the framerate of older games without any input from developers – and it could be used to improve Xbox 360 and original Xbox games.",
    "Xbox director of program management Jason Ronald revealed the news during an appearance on the Kinda Funny Podcast (thanks, Pure Xbox), but noted that the team is focusing on Xbox One generation titles first.",
    "“Right now, we're focused primarily on Xbox One generation titles because we've seen the best results there. We're still evaluating, can we bring this technology back to Xbox 360 games or original Xbox games?” Ronald said.",
    "The majority of Xbox 360 games and original Xbox games in particular ran at 30 frames per second. Using the FPS Boost feature, it’s possible that Microsoft could retroactively double or even quadruple the frame rates of these titles, which would provide a smoother, more responsive gameplay experience.",
    "FPS Boost only works with a small selection of titles currently: Watch Dogs 2, Far Cry 4, UFC 4, New Super Lucky’s Tale and Sniper Elite 4. It’s not something that can be easily applied to every backwards compatible game, though, as the technology can create some problems depending on how a game is coded.",
    "“The techniques that we've come up with will not work on every title. We've actually gotten some games working, and honestly, I'm playing the game, it's super awesome, it feels great, it's buttery smooth, but then all of a sudden we realize, ‘oh, this character over in the corner is animating twice as fast.’” Ronald explained. “Or, maybe three-quarters of the way through the game, all of the sudden we find a physics-breaking bug because the system's running the game so fast that the game doesn't actually know how to handle that.”",
    "Despite the challenges that some games may pose, Ronald expects new batches of games that support FPS Boost to be announced every couple of weeks. It means that your existing library of Xbox One games could be dramatically improved, with zero cost to you or input from the original developer.",
    "FPS Boost is another sign that Microsoft is fervently committed to backwards compatibility. The company has previously improved the resolution of older 360 and Xbox titles on Xbox One X, like Red Dead Redemption which now runs at 4K, and added features like Auto HDR which cleverly adds high dynamic range to Xbox One games that didn't originally support the technology."
  ],
  "headers": {
    "6": "Smooth operator"
  },
  "links": {
    "FPS Boost": "https://www.techradar.com/news/xbox-series-x-update-quadruples-the-framerate-of-older-games-heres-how-it-looks",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox 360": "https://www.techradar.com/news/gaming/consoles/how-the-xbox-360-won-the-console-war-1196990",
    "Kinda Funny Podcast": "https://www.youtube.com/watch?v=5VJD_vFdIdY",
    "Pure Xbox": "https://www.purexbox.com/news/2021/02/xbox_series_x_fps_boosts_will_focus_on_xbox_one_games_for_now",
    "Xbox One": "https://www.techradar.com/best/best-xbox-one-games/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Watch Dogs 2": "https://www.techradar.com/news/watch-dogs-2-review",
    "Xbox One games": "https://www.techradar.com/best/best-xbox-one-games",
    "Xbox One X": "https://www.techradar.com/news/xbox-one-x-deals-price-bundles",
    "Auto HDR": "https://www.techradar.com/news/what-is-xbox-series-x-auto-hdr-microsofts-game-changing-feature-explained"
  }
}