{
  "source": "https://www.techradar.com/news/nokia-is-launching-a-cloud-based-software-subscription-service",
  "title": "Nokia is launching a cloud-based software subscription service",
  "category": "computing",
  "updated": "2021-11-17T12:32:21Z",
  "author": "sead-fadilpasic",
  "summary": "New tools for communication service providers",
  "article": [
    "Finish telecommunications giant Nokia has announced several Software as a Service (SaaS) offerings aimed at communication service providers (CSP).",
    "The company says its software, some of which are already available , while others will be released next year, will provide solutions for analytics, security, and data management.",
    "For early 2022, Nokia has a couple of cloud-based services lined up, including NetGuard Cybersecurity Dome, and Anomaly Detection. Both are related to cybersecurity and endpoint protecion, with the former aiming to reduce malicious actors’ network dwell time, cut down on manual tasks, as well as response time for 5G networks. The latter, on the other hand, does just as the name suggests - it’s a machine learning tool that learns what proper network behavior looks like and seeks to eliminate anomalies.",
    "Nokia has been hard at work transforming into a SaaS company for some time now. It created its software division back in 2016, Senior VP Mark Bunn said in a recent interview, but never came through with the idea of offering subscription-based software.",
    "\"Now we have executed on it ... we have built underlying technology to be able to operate at scale,\" he told Reuters.",
    "Nokia says it will be targeting the CSP and enterprise SaaS market, valued at $3.1 billion, and growing annually at roughly 25-30%, over the next few years.",
    "These tools (and others down the line) will be packed into three different service offerings, or “suites” - one aimed towards Digital Engagement, one towards Marketplaces, and one towards Networking, the media reported. Some of the services, such as the ones focused on cybersecurity, will most likely be available in all of the suites.",
    "Nokia Data Management (NDM), for example, is already commercially available after being launched as a subscription model earlier in 2021, offering “an easy and secure way” to share and access data. Besides CSPs, companies in multiple other industries, such as transportation or energy, can expect improved automation, efficiency and scalability."
  ],
  "headers": {
    "3": "Targeting SaaS market"
  },
  "links": {
    "analytics": "https://www.techradar.com/best/best-data-visualization-tools",
    "cloud": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "endpoint protecion": "https://www.techradar.com/news/best-endpoint-security-software",
    "Reuters": "https://www.reuters.com/technology/nokia-launch-cloud-based-software-subscription-service-2021-11-17/"
  }
}