{
  "source": "https://www.techradar.com/news/quake-could-be-coming-back-and-theres-really-no-better-time-for-it",
  "title": "Quake is back on PC and consoles, and there's no better time for it [updated]",
  "category": "gaming",
  "updated": "2021-08-19T19:59:47Z",
  "author": "rhys-wood",
  "summary": "Quaking in our boots",
  "article": [
    "Update: Bethesda has released a remastered version of the original Quake game on PC, Nintendo Switch, PS4, and Xbox One (as well as PS5 and Xbox Series X through backward compatibility). Those who own the original Quake on Steam or the Bethesda launcher will get a full upgrade to the remastered version.",
    "The remaster has improved visuals up to 4K resolution, extra mission packs, cross-play support, 4-player split-screen support on all platforms (deathmatch and co-op), dedicated online deathmatch multiplayer (matchmaking only, players can host their own custom matches), and varying mod support, per an official blog post.",
    "In addition, Quake is coming to Xbox Game Pass on Xbox and PC, while Quake II and Quake III Arena will be available on PC Game Pass only, per Windows Central. Here's the official announcement trailer:",
    "Original story below:",
    "Quake is to Doom what peanut butter is to chocolate. The two go hand-in-hand as arguably the most influential first-person shooters of all time, and both were developed by id Software in the midst of a burgeoning PC gaming scene.",
    "When it comes to development priorities, however, Doom clearly reigns supreme over Quake, with Doom Eternal releasing last year to critical acclaim, while the multiplayer-focused Quake Champions, while a quality title in its own right, struggled to find a large audience of players.",
    "Quake's time in the shadows could be about to end, though, as a listing for \"Quake\" was spotted on the ESRB's website. More interestingly, it's supposedly coming out on pretty much every platform, including PS5, Xbox Series X/S, Nintendo Switch and (naturally) PC.",
    "It's currently unclear if this Quake project will be a brand new entry in the series or not, or if it will amount to anything at all. As we only have the ESRB listing to go off for now, the existence of a future Quake project should be taken with a pinch of salt.",
    "That said, the description for the game on the ESRB listing is reminiscent of the setting for the very first Quake, released in 1996. This could signify that a remaster of the original game will be making its way to PC and current-gen consoles.",
    "But with QuakeCon 2021 happening from August 19 - August 22, there's every chance that this Quake ESRB listing won't remain a mystery for very long.",
    "The last official single-player Quake title was Quake 4, released all the way back in 2005, if you can believe that. If it wasn't for multiplayer projects like Quake Live or Quake Champions, we'd have gone 16 years without a game in the series.",
    "In fairness, there was a 12-year gap between Doom 3 and Doom (2016), so it's certainly not as if id Software's flagship series has been routinely pumping out releases until very recently.",
    "However, a new Quake game is certainly long overdue. Whether it's the blood-soaked eldritch halls of the original game, or the sci-fi body horror of its sequels, Quake has always left a lasting impression in terms of setting that's just begging to be explored with current-gen technology. It would also be wonderful to have Nine Inch Nails' Trent Reznor back to once again handle the soundtrack.",
    "Not to mention that official projects like Quake 2 RTX show how stunning older games can look with proper implementation of advanced graphical effects like ray tracing. And no, we don't expect to see that on the Nintendo Switch, or older consoles like PS4 and Xbox One, but it speaks to just how robust the id Tech engine has been over the decades.",
    "That said, we wouldn't mind a remaster of the first Quake, either. Recent ports of the original Doom games have been phenomenal, and they even feature support for fan-made map packs (some of which are even better than the base game, but don't tell id Software that).",
    "Quake has seen an absolute ton of superb map packs over the years, too, thanks to the release of the game's source code, such as the breathtaking Arcane Dimensions. If a Quake remaster could feature the same high port quality and support for third-party map packs, then Bethesda could be onto another winner."
  ],
  "headers": {
    "10": "Analysis: Quake should make a comeback"
  },
  "links": {
    "blog post": "https://bethesda.net/en/article/53tAlMd4N1Aptp9PvdxWD/quake-release-notes-and-faq",
    "Windows Central": "https://twitter.com/WCGamingTweets/status/1428417925766057994",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Quake Champions": "https://www.techradar.com/news/gaming/quake-champions-brings-back-rocket-jumps-and-glorious-deathmatches-1326131",
    "ESRB's website": "https://www.esrb.org/ratings/37924/Quake/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "QuakeCon 2021": "https://quakecon.bethesda.net/en/schedule/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x"
  }
}