{
  "source": "https://www.techradar.com/news/ec-approves-sk-hynix-acquisition-of-intel-nand-flash-and-solid-state-drive-businesses",
  "title": "EC approves SK Hynix acquisition of Intel NAND flash and solid-state drive businesses",
  "category": "computing",
  "updated": "2021-05-24T11:17:53Z",
  "author": "mayank-sharma",
  "summary": "Deal has already been approved by the US FTC",
  "article": [
    "The deadline for European Commission (EC) regulators to object to South Korean semiconductor supplier SK Hynix’s takeover of Intel’s NAND storage division, has passed without any objections being raised.",
    "The SK Hynix-Intel deal, which includes Intel’s solid state drive (SSD) business, and is valued at approximately $9 billion, was announced in October 2020.",
    "SK Hynix confirmed the approval from the EC regulators, noting that along with last year’s approval by the US Federal Trade Commission, it brings the acquisition closer to completion.",
    "“The proposed acquisition will help SK hynix expand its global footprint, adding complementary memory technology. SK hynix expects to enhance its expertise through the acquisition, to deliver more breakthroughs and higher value products for customers,” SK Hynix said in a release to note the EC approval.",
    "The companies have previously said that the acquisition, which includes a memory and storage wafer fabrication facility in the Chinese city of Dalian, will happen gradually and might only complete by 2025.",
    "The deal is significant for SK Hynix since it’ll elevate it up the global NAND pecking order, putting it only behind compatriot and current market leader, Samsung.",
    "The divestment is also beneficial to Intel, which hopes to reorient its resources on its core segments, where it is losing ground to old time rivals AMD, and new ones like Ampere.",
    "However, the deal still needs further approvals before it can close completely, and SK Hynix notes that both companies will work to ensure that they obtain the remaining approvals before the end of the year.",
    "Via The Register"
  ],
  "headers": {
    "4": "Significant shakeup"
  },
  "links": {
    "SK Hynix": "https://www.techradar.com/reviews/sk-hynix-gold-p31",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "SK Hynix-Intel deal": "https://www.techradar.com/news/intel-sells-off-nand-storage-unit-in-multi-billion-dollar-deal",
    "solid state drive": "https://www.techradar.com/news/best-portable-ssd",
    "old time rivals AMD": "https://www.techradar.com/news/amd-is-trumping-intel-in-this-vital-computing-market",
    "Ampere": "https://www.techradar.com/news/watch-out-intel-and-amd-theres-a-new-server-player-in-town",
    "The Register": "https://www.theregister.com/2021/05/22/sk_hynix_intel_europe/"
  }
}