{
  "source": "https://www.techradar.com/news/how-volcanic-black-holes-and-cosmic-bubbles-are-sculpting-intergalactic-space",
  "title": "How 'volcanic' black holes and cosmic bubbles are sculpting intergalactic space",
  "category": "appliances",
  "updated": "2021-10-18T15:00:00Z",
  "author": "john-loeffler",
  "summary": "New study reveals the forces shaping the intergalactic medium",
  "article": [
    "Supermassive black holes are the most powerful dynamos in the known universe, but a new study reveals how they not only shape the galaxies they inhabit but the shape of intergalactic space itself.",
    "In a new study published this week in Nature Astronomy shows for the first time how the evolution of the warm gases produced by active supermassive black holes blow off into intergalactic space like the smoke stacks of an erupting volcano, which in turn shapes the intergalactic medium around the galaxy and influences the evolution of the galaxy itself.",
    "When a black hole of any size consumes material, not all of it gets swallowed up behind the event horizon, beyond which nothing can escape. Some material is accelerated at near the speed of light by the immense magnetic field of the black hole and ejected away at its magnetic poles.",
    "In the new study, this material is seen expanding into enormous bubbles of gas around the supermassive black hole in the central galaxy of the Nest200047 system, a collection of about 20 galaxies about 200 million light years away, and include as-yet unexplained filaments of magnetic fields and material accelerated to near light-speed that can stretch hundreds of thousands of light years across.",
    "\"Our investigation shows how these gas bubbles accelerated by the black hole are expanding and transforming in time,\" said Marisa Brienza, a researcher at the Department of Physics and Astronomy at the University of Bologna, member of the Italian National Astrophysics Institute (INAF), and lead author of the study. \"Indeed, they create spectacular mushroom-shaped structures, rings and filaments that are similar to those originating from a powerful volcanic eruption on planet Earth.\"",
    "\"The similarity [between a black hole's jets and volcanoes] is not only by chance but the same physics is involved as in both cases we have bubbles of light gas rising and expanding in a surrounding medium which is more dense at the center and less dense at higher distances,\" Brienza told TechRadar via email, adding that \"the density of our own atmosphere is higher at the Earth's surface than up in the sky, the same as the gas surrounding a galaxy.\"",
    "These gas bubbles end up shaping the intergalactic medium – the very hot, plasma-suffused space between galaxies – around the galaxy and can dramatically influence the rate of star formation. Star formation, in turn, is the lifeblood of an active galaxy without which galaxies burn out and slowly die.",
    "A crucial element Brienza emphasized is that stars need cold gas in order to form, and the heated jets of particles shooting out from galactic nucleii heat the medium it cuts through, which in turn heats the gas in the galaxy that stars need to form.",
    "\"If the gas in and around the galaxy hosting the active black hole is warmed up it means the star formation will be significantly slowed down or even stopped (at least for a certain amount of time until the gas will cool down again),\" Brienza told us.",
    "\"The gas which is found in a galaxy (in between stars) is called interstellar medium and is the material from which stars are created, while the gas surrounding the galaxy is called intergalactic medium and fuels the galaxy from outside with new gas reservoirs.\"",
    "If those gas reservoirs are too hot, stars can't form, and galaxies can slowly die off, in a sense suffocated by the gases heated from the supermassive black holes they themselves host in their centers.",
    "\"If a galaxy runs out of (cold) gas to form stars the star formation rate will decrease or stop,\" Brienza said. \"So the heating from jets produced by supermassive black holes is actually playing against star formation.\"",
    "Star formation plays a critical role if the lifecycle of a galaxy, and is an important cosmic marker for the timeline of the evolution of the universe.",
    "\"What is generally observed is that galaxies had a lot of cold gas at the beginning of the universe and so most of the star formation happened back then,\" Brienza told us. \"Nowadays they are forming much fewer stars because they have less material available, plus the [available] gas is regularly heated by their black hole's activity.",
    "\"This process we call 'black hole negative feedback'. With our data we have directly observed this feedback in action; that is, the heating by a black hole on the surrounding medium up to distances of hundreds of million years from the black hole's position.\""
  ],
  "headers": {
    "12": "Analysis: the lifecycle of galaxies help chart the evolution of the universe"
  },
  "links": {
    "Nature Astronomy": "http://dx.doi.org/10.1038/s41550-021-01491-0",
    "intergalactic medium": "https://www.britannica.com/science/intergalactic-medium"
  }
}