{
  "source": "https://www.techradar.com/news/star-trek-day-how-to-watch-best-panels-and-everything-we-know",
  "title": "Star Trek Day: how to watch, best panels and everything we know",
  "category": "entertainment",
  "updated": "2021-09-08T15:08:48Z",
  "author": "samuel-roberts",
  "summary": "The biggest day in the Star Trek calendar explained",
  "article": [
    "Star Trek Day is happening today, on September 8, 2021. No matter where you are, you can livestream this digital event for free – and learn a ton about the future of the Star Trek universe in doing so. The date was picked because it's been 55 years since Star Trek: The Original Series first hit TV screens with 'The Man Trap'. The event will be hosted by Wil Wheaton and Mica Burton.",
    "Star Trek Day promises announcements, and we're hoping to see new trailers for Star Trek Picard season 2, Star Trek Discovery season 4 and Star Trek: Strange New Worlds, along with much more on the animated show Prodigy. Classic Trek stars will participate in the panels across the day, too, including George Takei, LeVar Burton and Cirroc Lofton.",
    "On this page, we'll give you a breakdown of how to watch Star Trek Day, which panels you must see and anything else you might want to keep in mind ahead of the event.",
    "The Star Trek Day livestream begins at 8.30PM EDT / 5.30PM PDT / 4.30AM BST / 1.30PM AEST on Wednesday, September 8 (or September 9, if you're in the UK or Australia). If you're watching from Australia or North America, you can enjoy this live at a sensible hour – if you're based in the UK, the timing is pretty rough, but you'll be able to catch up on the key announcements when you wake up.",
    "If you want to watch Star Trek Day live, it's being broadcast worldwide on StarTrek.com on this page – likely through the site's own video player. You won't be able to watch it live on YouTube, but US viewers can watch it on the Paramount Plus service live, and it'll also be broadcast on Paramount Plus's Twitch channel.",
    "After the livestream, the panels will be available to watch individually on the Paramount Plus YouTube channel.",
    "Here's a quick breakdown of all the Star Trek Day panels in handy list form – note that the times below are Pacific, and that the whole thing lasts for close to three hours.",
    "It probably goes without saying, but the panels you won't want to miss here will be Prodigy, Discovery, Strange New Worlds and Picard – and maybe Lower Decks, if the animated comedy series is your sort of thing.",
    "The Prodigy panel will dive into what that new kid-friendly CG Trek series is about. The Discovery panel, meanwhile, is focused on the upcoming season, which is due to launch this year. That means we're likely to find out the release dates for both, and see a trailer for each.",
    "We'd expect a trailer at least for both Picard and Strange New Worlds. These panels are among the most stacked when it comes to cast appearances, too – Patrick Stewart, Jeri Ryan and Isa Briones will each appear to discuss the upcoming second season, which features the return of John de Lancie's Q.",
    "Meanwhile, Strange New World's three leads – Ethan Peck (Spock), Anson Mount (Pike) and Number One (Rebecca Romijn) – will all be appearing on that panel. Considering this show promises to resemble more classic episodic Trek adventures, fans will definitely want to keep an eye on that one.",
    "While Picard season 2 has already been confirmed for 2022, perhaps we'll learn more about when Strange New Worlds will land in that panel. The Discovery spin-off wrapped up the first round of filming in July.",
    "Your mileage may vary on the rest, depending on your appetite for Trek nostalgia – but the running time is pretty lean, considering how much they're packing in. Star Trek Day sounds like a worthwhile event for Paramount Plus's growing universe of shows set in this universe.",
    "To mark Star Trek Day, PC games retailer GOG.com has re-released a whole host of games based on the Trek universe, including the Elite Force series. They're worth a look if you played any of these back in the day."
  ],
  "headers": {
    "3": "When is Star Trek Day? What time does it start?",
    "4": "How to watch Star Trek Day",
    "6": "Star Trek Day panels: the ones you shouldn't miss",
    "13": "Star Trek Day: old games based on the series have returned"
  },
  "links": {
    "Star Trek Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Star Trek Discovery season 4": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "Star Trek: Strange New Worlds": "https://www.techradar.com/news/star-trek-strange-new-worlds",
    "StarTrek.com on this page": "http://startrek.com/Day",
    "Paramount Plus's Twitch channel": "https://www.twitch.tv/paramountplus",
    "Paramount Plus YouTube channel": "https://www.youtube.com/channel/UCrRttZIypNTA1Mrfwo745Sg"
  }
}