{
  "source": "https://www.techradar.com/news/windows-10s-new-look-glimpsed-again-in-microsoft-teams-and-edge",
  "title": "Windows 10’s new look glimpsed again in Microsoft Teams and Edge",
  "category": "computing",
  "updated": "2021-06-04T11:22:01Z",
  "author": "darren-allan",
  "summary": "And Outlook as well, with these apps being spotted with rounded corners",
  "article": [
    "Windows 10’s major interface overhaul is coming with the 21H2 update, and more potential work from the ‘Sun Valley’ revamp has been spotted in the form of rounded corners (once again).",
    "By all accounts, the rounding of corners will be one of the major pillars of change in the refreshed desktop due later this year (alongside the introduction of floating menus), with there having been plenty of sightings of various UI elements being rounded.",
    "This theme continues as Windows Latest has spotted apps with windows which have rounded corners. That includes Microsoft Edge with the browser being shown off at the recent Build 2021 conference with this refreshed look in a mock-up – complete with additional space around the minimize/close icons top-right (letting them breathe a little bit more, and helping to promote a less cluttered feel along the top there).",
    "The overall look, also seen in Microsoft Teams and Outlook mock-ups, is more modern (and Mac-like) in line with a lot of the changes seemingly underway for Windows 10 – or what might eventually be Windows 11.",
    "Yes, the latest spinning from the rumor mill around Microsoft’s intentions with its big redesign is the possibility that the operating system could be renamed, despite very firm assertions in the past that this wouldn’t happen. We might just be looking at plain old ‘Windows’ from hereon out, or Windows 11 if some hints and suggestions are to be believed (as opposed to the 21H2 update).",
    "Microsoft has indicated that whatever’s coming in the pipeline for Windows 10, there will be major changes, indeed ‘revolutionary’ ones which usher in the ‘next generation of Windows’. Whatever it’s called, whatever’s coming later in 2021 is something big, and the rounded corners for apps seen here certainly make sense given that this seems to be one of the most prominent overarching themes for the UI revamp.",
    "Whether or not we will actually see these changes come through – and other purported bits of interface that could be pinched from the now shelved Windows 10X – we will ultimately just have to wait and see."
  ],
  "headers": {
    "4": "Name game"
  },
  "links": {
    "Sun Valley": "https://www.techradar.com/news/windows-10-interface-might-be-set-for-a-huge-overhaul",
    "rounding of corners will be one of the major pillars of change": "https://www.techradar.com/news/windows-10s-new-look-hinted-at-in-fresh-screenshots",
    "introduction of floating menus": "https://www.techradar.com/news/windows-10s-new-look-glimpsed-in-preview-build-leak",
    "Windows Latest": "https://www.windowslatest.com/2021/06/04/windows-10s-new-rounded-corners-look-teased-again/",
    "Build 2021": "https://www.techradar.com/news/microsoft-build-2021",
    "what might eventually be Windows 11": "https://www.techradar.com/news/rip-windows-10-windows-11-could-be-unveiled-by-microsoft-in-a-few-weeks",
    "21H2 update": "https://www.techradar.com/news/windows-10-21h2-update",
    "revolutionary": "https://www.techradar.com/news/windows-10-will-get-a-revolutionized-new-look-according-to-microsoft",
    "could be pinched from the now shelved Windows 10X": "https://www.techradar.com/news/windows-10s-big-redesign-is-seemingly-pinching-bits-of-windows-10x"
  }
}