{
  "source": "https://www.techradar.com/news/how-digital-technology-can-level-the-educational-playing-field",
  "title": "How digital technology can level the educational playing field",
  "category": "computing",
  "updated": "2021-07-21T14:08:00Z",
  "author": "manju-kygonahally",
  "summary": "How technology can drive social impact in education",
  "article": [
    "Technology has been vital in enabling remote or online learning during the COVID-19 lockdowns and has rapidly accelerated a trend towards hybrid learning that was already in motion pre-pandemic. Schools and universities were forced to implement and learn how to use these technologies quickly, while under a lot of pressure to keep students digitally engaged and secure. While this situation was challenging for all involved, there are also benefits that have come as a result.",
    "According to the Department for Education (DfE), over 10,000 schools in England had limited or no remote teaching or learning capability at the start of the pandemic. Now, however, technology helps address some of the social disparities around access to educational resources. By using technologies like cloud, the education sector can help to better support underprivileged students in accessing learning materials they might not have been able to access previously - even with in-person learning. More importantly, by integrating technology in how students learn, it strengthens their digital abilities, effectively preparing them for a digital workforce regardless of their background.",
    "The outbreak of COVID-19 affected everyone, regardless of demographic, social status, or geographical location, and it led the world into an unprecedented public health crisis. Emergency protocols were implemented all over the globe, including the closure of educational institutions, which propelled the education sector to pursue digital transformation projects out of urgent necessity.",
    "While many students already benefit from digitally enhanced lives, with most in the western world owning their own laptops, tablets or phones, COVID-19 also saw a call to action to help pupils who faced being left behind due to not having these privileges. This is a great reminder of the disparity that can be caused by technology. As such, COVID-19 made campaigners, governments and education institutions realize the importance of being connected and having the tools and resources needed to access online learning. It very quickly became a priority for most institutions. The DfE has been working with education institutions and charities to provide laptops and internet access as required to children who cannot afford these tools. This is one positive outcome from the pandemic, as students who had previously no access to technology or the internet are now better equipped, vastly levelling the playing field with those that benefit from greater privilege.",
    "While not every student is connected yet, the solutions that have been implemented over the past year are enabling education institutions to reach students further around the globe. By not being limited to geographical restrictions, a student in a remote corner of the world can now have access to the same education and learning materials as those in populated cities, thanks to technology. It also means students are no longer limited to solely learning on-site.",
    "This increasing use of technology for students’ education will also be vital for preparing them for the digital workforce. Businesses today require candidates to have at least a basic understanding of digital tools. It is therefore vital that we continue to reach students across the globe to teach them the skills that will be crucial for their future, helping them to develop and home in on technical talents. This basic understanding of digital tools, when also paired with greater access to educational resources, anywhere and anytime, will see more students be able to access STEM learning modules. Technology in education will clearly play a key role in starting to close the STEM and workplace skills gap that is currently increasing all over the globe.",
    "Government bodies and education institutions need to ensure that there is focused and relevant investment in the underlying technology infrastructure that education institutions rely on in order to continue to help underprivileged children access learning materials. We have proven that teaching and learning no longer need to be confined to textbooks and classrooms.",
    "The acceleration of digital transformation needs to continue, particularly EdTech platforms and applications. For example, cloud enablement will allow education institutions to expand their geographical reach and for resources to be shared and accessed anywhere, irrespective of the location of the users, such as teachers, students and third parties like lecturers, who can collaborate and learn on a unified platform. It also enables virtual classroom environments and virtual exams, saving students time and expenses effectively.",
    "Data is another key aspect that can significantly improve global education. Everyone should be entitled to an education. But every student has a unique background, unique strengths, and a unique path to building their education. Data is one of the most powerful digital elements we have. By collecting data on individuals about their background and how they best learn, including their engagement points, it can help educational institutions create individual opportunities for students along their education journeys by enabling connections that lead to insights and improvements. For example, they can analyze data on students who dropped out and compare it to those who completed their education. This helps to identify characteristics that might make students leave prematurely and to offer support and resources to those at risk of dropping out. On a broader level, data around academic and demographic information, as well as information from assessments, teacher observations and student actions, can help parents, students, educators and especially policymakers gain invaluable insight into how students learn and how to best progress through their studies.",
    "Education organizations need a clearly defined strategy on how they can work with technology partners and government bodies to implement technology that can help bridge the divide among students of different backgrounds. This way, we can ensure each student is not only given access to education, but also armed with digital skills that are so crucial in our modern workforce. Cloud computing and data have the potential to transform the education sector and help meet the needs of individual students, ensuring no one gets left behind along the way."
  ],
  "headers": {
    "2": "Education shouldn’t be a privilege",
    "4": "How technology can level the playing field",
    "6": "Where more needs to be done",
    "9": "Bridging the digital divide"
  },
  "links": {
    "online learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "remote": "https://www.techradar.com/news/best-remote-desktop-software",
    "cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "tablets": "https://www.techradar.com/best/best-school-tablets",
    "applications": "https://www.techradar.com/best/best-android-apps-2021",
    "Data": "https://www.techradar.com/best/best-data-visualization-tools",
    "Cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}