{
  "source": "https://www.techradar.com/news/no-we-cant-believe-how-good-this-apple-watch-cyber-monday-deal-is-either",
  "title": "No, we can't believe how good this Apple Watch Cyber Monday deal is either",
  "category": "wearables",
  "updated": "2021-11-28T16:38:57Z",
  "author": "rhys-wood",
  "summary": "Fantastic Apple Watch deal carries over into Cyber Monday",
  "article": [
    "We've been pleasantly surprised by this year's Cyber Monday Apple Watch deals, many of which have carried over from Black Friday just a few days earlier. Usually, you'd be hard pressed to find a decent discount off any Apple Watch model, new or old, but there's one huge outlier this year that made us double take.",
    "The Apple Watch 5 is a bit of an older model, releasing in 2019, but right now it's seeing an uncharacteristically large $290 discount. That's a superb Cyber Monday deal that brings the price down to $459 at Amazon right now. That's just 10 bucks away from the record low price, and while the Apple Watch 5 is still what we'd consider to be expensive, even at the discounted price, it's extremely rare to see it dip lower than that.",
    "(Not in the US? Scroll down for Black Friday Apple Watch deals in your region).",
    "This Apple Watch 5 Cyber Monday deal is for a specific \"Gold Stainless Steel with Stone Sport Band\" model, and appears to be the only model currently available in Amazon's sales. It's also the larger 44mm version, so physical experience with the watch may vary depending on the size of your wrist.",
    "If you're after a newer model, like the Apple Watch 7, Amazon still has some colors in stock for as little as $479, not much more expensive than the Apple Watch 5 Cyber Monday deal. If you absolutely need the latest tech from Apple, this deal might be a better fit for you.",
    "After more Apple products? Be sure to check out our Cyber Monday Apple deals hub for a breakdown of all the best deals across a wide range of Apple products, from AirPods to iPhones and more.",
    "No matter where you live, you'll find all the lowest prices for the Apple Watch 5 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Apple Watch 5 Cyber Monday deal",
    "6": "More Apple Watch 5 Cyber Monday deals",
    "7": "More Cyber Monday deals"
  },
  "links": {
    "Cyber Monday Apple Watch": "https://www.techradar.com/cyber-monday/cyber-monday-apple-watch-deals-and-sales",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "$290 discount": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07XQSTXDZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1048212005370274000-20",
    "Cyber Monday deal": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Apple Watch 7": "https://www.techradar.com/reviews/apple-watch-7",
    "as little as $479": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-Watch-Cellular-Aluminum-Abyss%2Fdp%2FB09HF6QF5J%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5655987107627099000-20",
    "Cyber Monday Apple deals": "https://www.techradar.com/cyber-monday/cyber-monday-apple-deals"
  }
}