{
  "source": "https://www.techradar.com/news/linux-mint-201-is-here-with-a-host-of-neat-new-features",
  "title": "Linux Mint 20.1 is here, with a host of neat new features",
  "category": "computing",
  "updated": "2021-01-12T11:00:38Z",
  "author": "mayank-sharma",
  "summary": "New Linux Mint release will be supported until 2025",
  "article": [
    "The Linux Mint project’s first release of 2021 is now available for download.",
    "The Long Term Support (LTS) release of Linux Mint 20.1 is supported until 2025 and is available in three variants, each with different desktop environments, namely Cinnamon, Mate, and Xfce.",
    "Linux Mint 20.1 is based on Ubuntu 20.04 LTS, and in addition to updated software also brings with it several new updates. However, much like with the previous Linux Mint 20 release, the upstream Snap Store is still disabled in the distro following Mint’s lead-developer Clement \"Clem\" Lefebvre’s displeasure with Ubuntu’s packaging decisions.",
    "One of the noteworthy additions in the new release is a home-brewed app called Webapp Manager which can be used to create a desktop app from any website.",
    "The developers came up with the tool since an increasing number of useful tools are available as browser-based apps, and not all of them have native Linux apps. “It's easier to multitask between applications on the desktop than it is between tabs in a web browser,” they reason in the release notes.",
    "Once created, the web apps operate outside the web browser and behave like regular desktop apps. Users can even pin them to the desktop panel for easier access, according to the release notes.",
    "The second app, named Hypnotix, is an IPTV player that can play IPTV streams. Out of the box, the app is equipped to play freely and publicly available live TV channels from the Free-IPTV provider.",
    "Besides these apps, the release has several other improvements all over the place. For instance, the Cinnamon edition improves 4K rendering, while the Mate edition enables hardware video acceleration for smoother playback."
  ],
  "headers": {
    "3": "New and noteworthy"
  },
  "links": {
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "desktop environments": "https://www.techradar.com/best/best-linux-desktop",
    "displeasure with Ubuntu’s": "https://www.techradar.com/news/linux-mint-introduces-its-own-take-on-the-chromium-web-browser"
  }
}