{
  "source": "https://www.techradar.com/news/hawkeye-on-disney-plus-could-see-the-return-of-shield-based-on-this-set-photo",
  "title": "Hawkeye on Disney Plus could see the return of SHIELD, based on this set photo",
  "category": "entertainment",
  "updated": "2021-02-03T10:36:05Z",
  "author": "samuel-roberts",
  "summary": "Post-HYDRA, is SHIELD on the way back?",
  "article": [
    "The Hawkeye TV show coming to Disney Plus could see the return of the organization SHIELD to the Marvel Cinematic Universe. In a new Instagram photo posted during filming, actor Jeremy Renner showed off the hero's quiver in the show, which bears the SHIELD symbol. Eagle-eyed fans had previously spotted the emblem on-set back in December.",
    "SHIELD is a peace-keeping task force in the Marvel Cinematic Universe, originally responsible for the Avengers Initiative that brought the heroes together. One of the MCU's biggest twists is that it was infiltrated and secretly controlled by Hydra, essentially a group of Nazis. Captain America and pals largely dismantled the group during 2014's The Winter Soldier movie, with the last stragglers being taken down at the start of Avengers: Age of Ultron.",
    "Here's the photo:",
    "Clint Barton was originally working with SHIELD when he was introduced to the MCU. Could this new series see the group re-established with more positive intent, perhaps by Barton himself? We'll have to wait and see.",
    "SHIELD's recent history admittedly gets more complicated if you take the TV show Agents of SHIELD as canon.",
    "Little is known about the Hawkeye TV show's storyline, except that it'll feature Barton training up a new archer, Kate Bishop (played in the show by Hailee Steinfeld). Some fans have speculated the show will have Barton dealing with hearing loss, too.",
    "Clint Barton seems like he's retired from avenging three times now: once at the end of Age of Ultron, another time when he was put on house arrest in Captain America: Civil War, and again when his family returned from the Thanos snap.",
    "Presumably this series will deal with the fallout of Barton's actions in Endgame, where he went on a rampage, murdering criminals across the world following the loss of his family. Since they came back, what's his rush to get back into the action?",
    "This is what we hope will be addressed in the Disney Plus series."
  ],
  "headers": {
    "6": "What happened to Clint Barton after Avengers: Endgame?"
  },
  "links": {
    "Hawkeye TV show coming to Disney Plus": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "Disney Plus series": "https://www.techradar.com/best/best-disney-plus-shows"
  }
}