{
  "source": "https://www.techradar.com/news/wandavision-episode-8-just-changed-a-major-part-of-wandas-origin-story",
  "title": "WandaVision episode 8 just changed a major part of Wanda's origin story",
  "category": "entertainment",
  "updated": "2021-02-27T12:56:21Z",
  "author": "tom-power",
  "summary": "Major spoilers ahead",
  "article": [
    "Spoilers incoming for WandaVision episode 8. If you haven't seen the latest episode, now is the time to turn back.",
    "WandaVision's eighth episode - titled Previously On - is the series' biggest exposition drop to date. We learned a ton about the show's overarching plot, got answers to longstanding questions, and even saw some major secrets being revealed ahead of the season finale.",
    "One of those shock moments concerns Wanda's origin story, which rewrites what we previously knew about the Maximoff twin. Its implication could have big repercussions on the Marvel Cinematic Universe moving forward, and below we'll explain what it could mean in more detail.",
    "Make sure you've seen episode 8 before you keep reading.",
    "In WandaVision episode eight, we finally hear Wanda's alter ego mentioned for the first time in the MCU. During the final scene of the episode, Agatha Harkness is holding Tommy and Billy - Wanda's twin sons - hostage by her dark magic threads. As Wanda confronts Agatha, the series' villain reveals Wanda's real identity - she is the Scarlet Witch.",
    "This name won't be a revelation to Marvel comic book fans, but WandaVision viewers may be a bit confused about why the name is so significant. Well, in the comics, Scarlet Witch is Wanda's superhero alias. Until now in the MCU, we've seen Wanda use her powers to great - and tragic - effect, but we've always suspected that there's a limit as to how powerful she is.",
    "Now, though, it turns out that Wanda is much more powerful than expected. As the Scarlet Witch in the comics, Wanda is a mighty sorceress who possesses the ability to alter realities, use telekinetic powers, and even remove the superpowers from those who possess them. The last of that trio is what happens in Marvel's House of M storyline, which saw Wanda reduce the mutant population - including the X-Men - down from millions to mere hundreds.",
    "But we digress. Read on for why Scarlet Witch's reveal is massive for the MCU.",
    "Why does this matter for Wanda's MCU iteration? Well, the Scarlet Witch revelation means that Wanda already had magic powers before Hydra experimented on her with the Mind Stone. Confused? Allow us to explain.",
    "Let's briefly recap what we thought we know about Wanda's origin story. In Avengers: Age of Ultron, we learn that Wanda and twin brother Pietro are orphans. Their parents were killed by an air strike and, after another missile lands in their ruined home, the Maximoff twins hide under a bed for two days waiting for it to explode. The missile - a Stark Industries invention, no less - is defunct, however, and the twins eventually escape after realizing this fact.",
    "We see this scene play out in WandaVision episode eight, but something is off about Wanda's version of events. As Agatha points out, it seems like a huge coincidence that the seemingly defunct missile would land on their home, which raises the question about whether it was a dud to begin with.",
    "As it turns out, it wasn't. Wanda already has superpowers - her chaos magic, as Agatha calls it - before the missile strike, and it is these abilities that enable the Maximoff twins to survive. In the comics, Wanda possesses the power of probability, which allows her to change the outcome of events. This is a superpower that's been transferred from the comics to Wanda's MCU counterpart. Without realizing it, Wanda is able to alter the odds of the missile being a dud, prevents its detonation, and saves hers and Pietro's lives.",
    "This brings us onto Hydra's experiments with the Mind Stone. Fueled by rage over Tony Stark killing their parents, the Maximoff twins enlist in Hydra's terrorist organization and volunteer as subjects for their Mind Stone studies. Until Wanda, every other participant has been killed by the Infinity Stone's power. However, bolstered by her abilities, Wanda is able to withstand its might, which results in her powers being supercharged.",
    "Bringing all of this together, WandaVision episode 8 proves that Wanda was already a sorceress to begin with. We know that magic wielders already exist in the MCU due to Agatha's backstory and the events seen in Doctor Strange, so there's no reason why Wanda couldn't have such abilities too within the logic of the MCU. The Mind Stone simply imbued her with more power, and her actions between Avengers: Endgame and the beginning of WandaVision show how she was able to alter reality in and around WestView to kick off the series' events.",
    "Now that we know Wanda is the Scarlet Witch, her powers can have massive repercussions on the MCU. Wanda will play a big role in Doctor Strange in the Multiverse of Madness, but it's unclear if she'll be helping the Sorcerer Supreme or causing the events that unfold in the sequel. She could end up being the villain of the piece, depending on how WandaVision ends, or be the vital piece of the puzzle that can explain the events that might transpire in Doctor Strange 2.",
    "Whatever happens, Wanda's origin story isn't what we thought it was, and it'll be interesting to see how this factors into the wider MCU once the curtain falls on WandaVision's season finale."
  ],
  "headers": {
    "4": "WandaVision episode 8: Wanda's new backstory explained",
    "8": "How WandaVision episode 8 changes Wanda's MCU origin",
    "13": "What does this mean for the MCU's future?"
  },
  "links": {
    "WandaVision episode 8": "https://www.techradar.com/news/wandavision-episode-8-recap-review",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "big role": "https://www.techradar.com/news/doctor-strange-2-filming-in-the-uk-has-been-delayed-says-elizabeth-olsen"
  }
}