{
  "source": "https://www.techradar.com/news/microsoft-edge-for-linux-gets-an-official-beta-release",
  "title": "Microsoft Edge for Linux gets an official beta release",
  "category": "computing",
  "updated": "2021-05-05T14:14:37Z",
  "author": "mayank-sharma",
  "summary": "Edge for Linux still lacks several important features compared to the Windows and macOS variants",
  "article": [
    "After spending over six months in the Dev channel, Microsoft has graduated Edge for Linux to the Beta channel.",
    "Linux builds of the new Chromium-based Edge started popping up in October 2020 with support for a number of the most popular Linux distros including Ubuntu, Debian, Fedora and openSUSE.",
    "Together with its existing releases for macOS and Windows, Edge joined the ranks of mainstream web browsers such as Google Chrome and Mozilla Firefox to service all three major operating systems.",
    "Microsoft now contends that the browser is stable and usable enough to move up to the Beta channel. While still not considered production ready, Beta builds are a lot more stable than Dev builds.",
    "While the Dev channel is updated every week with new features and bug fixes, releases in the Beta get major changes every six weeks.",
    "All three branches (Dev, Beta, and Stable) are developed simultaneously and the Beta builds allow users a chance to preview some of the new features before they land in the Stable release.",
    "Microsoft developers have been bringing useful features to the Edge for Linux Dev builds, and last month rolled out the sign-in and sync features in a limited capacity.",
    "In addition to polishing the existing features, Edge for Linux in the Beta channel introduces a handful of other features as well.",
    "For instance, users can now sync favorites to the Edge Application Guard, and there’s also a new shopping feature.",
    "As per the release schedule, v91 of the browser that’s currently available in the Beta channel is set to graduate to the Stable channel on May 27. However, Microsoft hasn’t yet confirmed whether this release date is applicable to the Linux build as well.",
    "Via WindowsLatest"
  ],
  "headers": {
    "4": "Middle ground"
  },
  "links": {
    "Edge for Linux": "https://www.techradar.com/reviews/microsoft-edge-for-linux",
    "Linux builds": "https://www.techradar.com/news/microsoft-edge-finally-lands-on-linux",
    "Linux distros": "https://www.techradar.com/best/best-linux-distros",
    "Ubuntu": "https://www.techradar.com/news/ubuntu-2104-is-finally-here",
    "Debian": "https://www.techradar.com/reviews/debian-101-buster",
    "macOS": "https://www.techradar.com/how-to/how-to-download-and-install-macos-11-big-sur",
    "Windows": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "web browsers": "https://www.techradar.com/best/browser",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Mozilla Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "sign-in and sync features": "https://www.techradar.com/news/microsoft-edge-is-getting-a-handy-linux-upgrade",
    "WindowsLatest": "https://www.windowslatest.com/2021/05/04/microsoft-edge-for-linux-is-now-one-step-closer-to-stable-release/"
  }
}