{
  "source": "https://www.techradar.com/news/intels-rocket-lake-cpus-could-arrive-in-march-to-combat-amd-ryzen-5000-threat",
  "title": "Intel’s Rocket Lake CPUs could arrive in March to combat AMD Ryzen 5000 threat",
  "category": "computing",
  "updated": "2021-01-04T10:48:02Z",
  "author": "darren-allan",
  "summary": "11th-gen chips should be compatible with existing 400-series motherboards",
  "article": [
    "Intel’s incoming Rocket Lake processors will be landing at the end of March according to the rumor mill, which backs up what we’ve been hearing on the grapevine previously.",
    "This is the latest piece of speculation on the potential release date of 11th-gen CPUs from Intel – which, let’s face it, can’t come quickly enough in order to deal with AMD’s Ryzen 5000 threat – as flagged up by Tom’s Hardware, from well-known leaker @harukaze5719 on Twitter.",
    "That information was apparently supplied by an MSI representative in a product Q&A session, but of course we need to take this – and any rumor really – with a suitable degree of caution. Translations of the original post vary slightly, but it’s clear enough that the target launch date is the end of March.",
    "It is, of course, worth bearing firmly in mind that even if it is Intel’s intention to shoot for a late March launch with Rocket Lake, there’s no guarantee that there won’t be any delays between now and then (which is what seemingly happened with Comet Lake last year).",
    "The expectation is that we may see Intel reveal its 11th-gen desktop chips at CES which is just around the corner (with the show officially kicking off on January 11).",
    "Further gossip contends that new Z590, B560 and H510 motherboards might be launched at CES, pointing to the possibility that Comet Lake processors will be compatible with these boards (as there wouldn’t be much point launching the chipsets otherwise, given Rocket Lake is still theoretically the best part of three months out). Take that with a large pinch of salt, though.",
    "In case you’re wondering, existing Intel 400-series motherboards should be good to go with Rocket Lake silicon, as is clarified here, via firmware updates (with the top-end Z490 chipset getting updated first by MSI). Intel hasn’t officially said this, but at the end of last year, we already saw some motherboard makers boasting about such 11th-gen compatibility.",
    "As we said at the outset, several rumors around the launch of Rocket Lake have previously floated a March launch date, albeit earlier rather than later – or even perhaps a late February release – but again, it’s worth repeating that whatever Intel’s intended schedule is right now could change anyway.",
    "What we can say is that with the weight of rumors around, March does seem like the most likely month that we’ll finally welcome 11th-gen silicon to the market, headed by an 8-core flagship by all accounts with some considerable gaming chops (which has seen many leaks of late – again reinforcing that it’s likely to be out soon)."
  ],
  "headers": {
    "4": "Motherboard revelations?"
  },
  "links": {
    "Intel’s incoming Rocket Lake processors": "https://www.techradar.com/news/11th-generation-intel-rocket-lake-processors-are-officially-coming-in-2021",
    "AMD’s Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/msi-confirms-intel-11th-gen-rocket-lake-s-cpu-launch-march",
    "might be launched at CES": "https://www.techradar.com/news/intels-next-gen-rocket-lake-cpus-could-be-here-sooner-than-you-think",
    "floated a March launch date": "https://www.techradar.com/news/intel-rocket-lake-cpus-again-rumored-to-land-in-march-2021",
    "perhaps a late February": "https://www.techradar.com/news/intels-next-gen-rocket-lake-cpus-could-be-here-sooner-than-you-think",
    "8-core flagship by all accounts": "https://www.techradar.com/news/intel-core-i9-11900k-leak-is-our-first-glimpse-of-rocket-lake-gaming-potential",
    "considerable gaming chops": "https://www.techradar.com/news/new-intel-11th-gen-leak-threatens-amds-new-ryzen-5000-single-core-crown"
  }
}