{
  "source": "https://www.techradar.com/news/this-top-google-chrome-rival-just-added-a-major-speed-boost",
  "title": "This top Google Chrome rival just added a major speed boost",
  "category": "computing",
  "updated": "2021-03-18T13:30:49Z",
  "author": "mike-moore",
  "summary": "Vivaldi update also boosts browser security, adds M1 Mac support",
  "article": [
    "One of the leading competitors to Google Chrome and Microsoft Edge has announced a serious upgrade that it hopes will help it steal a march in the browser market.",
    "Vivaldi says that its latest update brings a major speed boost that puts it ahead of the competition, along with welcome upgrades when it comes to online security, and also native support for Apple's new M1 Macs.",
    "The company claims that Vivaldi 3.7 can \"help shave seconds, even minutes off a day and potentially hours off a year,\" with its internal benchmarks finding that browser tabs now open twice as fast and new windows open 26% faster than before.",
    "Vivaldi 3.7, which is available to download on Windows, Mac, and Linux computers now, also features a number of productivity and efficiency additions. This includes configurable Menus, Quick Commands, and Web Panels, all of which the company says can help contribute to the time savings so valuable in a modern workforce.",
    "It adds that it was able to offer such impressive speed gains in Vivaldi 3.7 by \"simply prioritizing performance in our to-do list,\" with a number of unnamed under-the-hood upgrades helping enable the speed boost.",
    "Vivaldi also recently introduced two-level tab stacks to allow users to have large numbers of tabs open at any one time - useful for those workers that require a large amount of information to be available at ther fingertips. With the new upgrade, Vivaldi users can also now easily create multiple tab stacks at once via a new ‘Tab Stack by Hosts’ feature to keep track of the key pages they need.",
    "Elsewhere, the browser's Periodic Tab Reload feature is now including in its Web Panels, allowing websites to reload at regular intervals, and configurable menus now allow users to edit the context menus that they open when right-clicking anywhere on a web page.",
    "\"I’ve been doing browsers for 25 years and one thing has always been true: speed and performance matter. While we add more features, simplify navigation and help you manage your tasks, we shall continue to work on improving performance. This is an ongoing process and we hope you will enjoy these gains in Vivaldi as much as we do”, said Vivaldi CEO Jon von Tetzchner."
  ],
  "headers": {
    "3": "Speed boost"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Apple's new M1 Macs": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "introduced two-level tab stacks": "https://www.techradar.com/news/this-browser-is-now-offering-two-level-tab-stacks"
  }
}