{
  "source": "https://www.techradar.com/news/busted-dont-buy-gta-trilogy-definitive-edition-on-nintendo-switch",
  "title": "Busted: don’t buy GTA Trilogy Definitive Edition on Nintendo Switch",
  "category": "gaming",
  "updated": "2021-11-12T10:51:04Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Grand Theft Auto on Switch is daylight robbery",
  "article": [
    "Please don’t buy Grand Theft Auto: The Trilogy – Definitive Edition on Nintendo Switch. You’d honestly be better tracking down a PlayStation 2 or original Xbox to play these games again because this pathetic port isn’t worth your time or money.",
    "Nintendo fans have had to wait two decades to experience Grand Theft Auto 3 and its stellar sequels Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas. But Grand Theft Auto: The Trilogy – Definitive Edition can be best described as a sick joke.",
    "What you’re greeted with after sitting through an initial load screen of around 19 seconds is a game that’s undoubtedly running at a resolution that’s so low someone might as well have smeared vaseline over your Switch’s screen. The HUD icons, though, are jarringly crystal clear.",
    "I don’t know the exact resolution that Grand Theft Auto: The Trilogy – Definitive Edition is running at on Nintendo Switch, but it doesn’t take the experts at Digital Foundry to determine that it isn’t coming close to the console’s native 720p output.",
    "That’s not to say every game needs to hit this resolution target. But we’re not talking about some impossible port here like The Witcher 3 or Doom Eternal – this is a remaster of three games that were released in 2001, 2002, and 2004. Yes, they’re running on Unreal Engine 4, but it still shouldn’t be anywhere near this bad.",
    "Dynamic resolution scaling is clearly in place in the GTA Trilogy, but it seems to aggressively bounce between various sub-HD resolutions and tops out at what appears to be 540p, without any sort of sharpening to compensate. The result is butt-ugly image quality in all three games.",
    "But what about when playing docked? Sadly, it’s even worse. The resolution doesn’t appear to increase in any meaningful way, and the game’s unappealing softness is even more pronounced when blown up on a larger display. Handheld mode is definitely the lesser of two evils.",
    "The game’s new cartoony art style – which has already proved polarizing – also takes a hit as a result. It looks completely flat and washed out, even on the Nintendo Switch OLED’s vivid screen. The low resolution also detracts from the game’s new lighting system, and ultimately makes you feel like you’re playing a weird fan-made tribute of the original games as opposed to an official remaster.",
    "But it’s not just a criminally low resolution that Switch players have to stomach in Grand Theft Auto: The Trilogy – Definitive Edition. The game’s performance is – to put it lightly – unacceptable.",
    "There’s no option of a 60fps performance mode here, so you’re stuck at a maximum framerate of 30fps. That’s admittedly a shame, but it wouldn’t be a problem if the Switch version ever came close to holding 30fps for more than a few seconds.",
    "Driving through the streets in all three games is a nightmarish and sluggish experience as the framerate fluctuates wildly, dropping into the low twenties. GTA: San Andreas seems to have the best performance of the bunch, but it still can’t hold its target framerate for very long.",
    "Combine a janky framerate with a soupy resolution, and what you get is a one-way ticket to feeling like you want to throw up after five minutes of play, at least in my case. It also makes driving, a fundamental mechanic of GTA games, an unresponsive slog.",
    "Grand Theft Auto: The Trilogy – Definitive Edition on Nintendo Switch is also plagued by laughable pop-in. If you’ve never heard of pop-in before, it’s a term used to describe when a game’s assets magically appear and disappear in relation to how close a player is to them.",
    "When a game streams in assets properly, most players won’t notice a game’s world unfolding before them. But when it’s done badly, it’s impossible to ignore.",
    "In Grand Theft Auto: The Trilogy – Definitive Edition, pop-in is absolutely horrendous, to the point where it makes the games unplayable at times. Cars will phase into existence at a moment’s notice, giving you split seconds to veer out of the way. Streets are eerily quiet and then suddenly filled with people. Trees, shadows, and environmental details can be flicked on and off like a light switch, simply by moving forward or backward. It’s a hideous sight to behold.",
    "Playing GTA on a dedicated handheld again has been a distant dream ever since the PSP releases of GTA: Liberty City Stories and GTA: Vice City Stories 2005. The Switch should have been the perfect platform to realize those halcyon days, with improved performance and graphics to boot. Instead, we’ve been given shoddy ports that either shouldn’t have been released on Nintendo’s platform or delayed until performance could be significantly improved.",
    "For returning players, Grand Theft Auto: The Trilogy – Definitive Edition will likely provide a miserable experience, even with its updated control scheme. For newcomers? You’d be forgiven for thinking that anyone who ever raved about these games needs their head checked.",
    "Throw in the missing audio tracks, incredible low audio sample rates in the voice acting, some new bugs (I saw a number of cars’ rear lights flickering uncontrollably), and it’s impossible to recommend anyone buying Grand Theft Auto: The Trilogy – Definitive Edition for the asking price of $49.99 / £49.99.",
    "As it stands, the Definitive Edition of Rockstar’s three classics games deserves the most damning sentence a gamer can bestow on any title. Please, don’t buy this game."
  ],
  "headers": {
    "6": "Turn it off",
    "8": "Pitiful performance",
    "12": "Now you see me, now you don’t",
    "15": "Oh, what could have been"
  },
  "links": {
    "Grand Theft Auto: The Trilogy – Definitive Edition": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Grand Theft Auto 3": "https://www.techradar.com/news/gta-3-deserved-better-than-this-messy-definitive-trilogy-remastering",
    "The Witcher 3": "https://www.techradar.com/news/the-witcher-3-on-nintendo-switch-may-mean-i-finally-play-the-dlc",
    "Doom Eternal": "https://www.techradar.com/reviews/doom-eternal-review",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "PSP": "https://www.techradar.com/best/best-psp-games"
  }
}