{
  "source": "https://www.techradar.com/news/apex-legends-mobile-beta-launch-plans-announced-heres-where-to-play-it-first",
  "title": "Apex Legends Mobile beta launch plans announced – here’s where to play it first",
  "category": "gaming",
  "updated": "2021-04-20T04:06:51Z",
  "author": "david-lumb",
  "summary": "Apex Mobile is globally rolling out in beta this year",
  "article": [
    "Apex Legends Mobile has officially been revealed, and it’s launching in beta soon – but only in limited regions, starting with India and the Philippines. There's no word on other regions like the US and UK just yet.",
    "As expected, the game has been adapted for mobile and “specially designed for touchscreens, with streamlined controls and thoughtful optimizations,” according to Respawn’s blog post.",
    "The post didn’t go into too much detail, nor have we seen gameplay for how Apex on mobile will look. But Respawn did confirm that there won’t be cross-play between Apex mobile and the console/PC versions of the game. It will still be free to play and have its own battle pass, complete with cosmetics and unlockables unique to the mobile version.",
    "But we do have a couple official screenshots showing characters and locations in the Worlds End map that look faithful to the console and PC versions:",
    "The initial test periods in 'Spring 2021' (Q2 2021) will start with closed betas in India and the Philippines limited to a few thousand players before expanding to “more regions and more players around the world” through 2021, the post said.",
    "We still have plenty of questions left unanswered, including how content releases will work between the distinct mobile and main console and PC versions of Apex. The blog post implied that Respawn won’t neglect the console/PC versions while working to release Apex Mobile, but it’s unclear how much parity the versions will have – like the just-announced new legend Valkyrie, and everything else coming in Season Nine: Legacy.",
    "We could expect the shooter combat to follow other mobile versions of desktop shooters, like Call of Duty: Mobile and PUBG Mobile, which assign mouse and keyboard functions to a slew of buttons on the right side of the phone screen (and a free-floating d-pad on the left for movement) – but until we see a screenshot of the actual HUD/layout, we won’t know for sure.",
    "We’re also curious how the gameplay itself will be adapted to the small screen. Will Apex Mobile follow League of Legends: Wild Rift’s example and shrink the maps as well as adapt abilities to mobile play? Will the legends and guns be tweaked to better serve mobile screens? There’s plenty of unknowns, but we’re excited that the ball is rolling on Apex Legends Mobile."
  ],
  "headers": {
    "5": "Apex Mobile and Apex main: so many Apex questions remain"
  },
  "links": {
    "Apex Legends Mobile": "https://www.techradar.com/news/apex-legends-mobile-news",
    "blog post": "https://www.ea.com/games/apex-legends/news/apex-legends-mobile-regional-betas",
    "Valkyrie": "https://twitter.com/erikaishii/status/1384176277410648074",
    "Season Nine: Legacy": "https://www.ea.com/games/apex-legends/legacy"
  }
}