{
  "source": "https://www.techradar.com/news/you-wont-need-to-use-the-hey-alexa-wake-word-for-latest-amazon-echo-features",
  "title": "Alexa is now a much better listener – even when you're not talking",
  "category": "smart-home",
  "updated": "2021-12-02T15:00:18Z",
  "author": "hamish-hector",
  "summary": "Alexa can listen out for alarm beeps and running water",
  "article": [
    "Amazon Echo devices can now respond to beeping alarms and detect motion, meaning you won't need to say 'Hey Alexa' to get some assistance.",
    "Your Amazon Echo can now respond and perform actions and routines without you having to say ‘Hey Alexa’, thanks to the latest updates.",
    "Amazon previously announced that Alexa would soon be able to recognize custom sounds – and while that feature has yet to be implemented, your Echo devices have certainly got a boost in capability, now being able to react to the sound of an appliance beeping or running water.",
    "On top of that, owners of the Echo (4th Gen), Echo Dot (4th Gen), and Echo Dot (4th Gen) with Clock will now have the option to enable ultrasound motion detection – which can pick up when someone moves past the device.",
    "Amazon suggests these new features could be used to let you know that your washing machine’s cycle is finished, to automatically turn on room lights when someone walks into a room, or turn down the thermostat if no one is detected for a certain period of time.",
    "On top of that, by saying ‘Alexa, join the conversation’, Echo Show 10 users in the US can now activate conversation mode. If you want to ask Alexa to perform several tasks in a row, this feature will allow you to issue multiple commands without having to repeat ‘Hey Alexa’ before each one.",
    "Alexa’s assistance is becoming more useful in traditional ways too. You can now ask Alexa to open TikTok so that you can enjoy your favorite videos on Echo Show devices – you can even request to see videos on specific topics, for example, cats (obviously) or DIY. Or if you’re unsure what to cook tonight, saying ‘Alexa, what should I eat?’ will prompt the smart assistant to offer your restaurant options, meal kit deliveries or traditional recipes that you might want to try out.",
    "If that last feature tickles your taste buds, you might want to let Alexa know a bit more about what you like to eat and more. If you tell it about your food and entertainment preferences – for example by saying ‘Alexa, I am a vegetarian’ or ‘Alexa, I like the Boston Red Sox’ – Alexa will store that information, and use it to give you personalized responses in the future.",
    "Alexa’s latest batch of features offers plenty of new ways to put your smart device to good use, though we can’t help but worry it gives Alexa a bit too much insight into what’s going on around our homes.",
    "If you weren't keen on the idea of having Amazon's Astro robot wandering around your home, then you likely won't be happy that some of its features are starting to appear, in some form or another, on Amazon Echo devices that you already own.",
    "Thankfully, the most invasive detection options (such as ultrasound motion detection) are locked to routines, meaning that you have to enable the features before Alexa will start using them. For some, however, just knowing that your device is capable of tracking your movement could still be a cause for concern, especially as that information could potentially be accessed by someone you’d rather didn’t know.",
    "To address those worries, Amazon has made plenty of efforts to ensure the Alexa platform is as secure as possible. While breaches have been found, they generally get fixed quickly, and in some cases would require a hacker to have direct access to a device to install a malicious program.",
    "That means you shouldn't have to worry too much about bad actors pitting Alexa’s functions against you, such as using the motion sensor to detect if your house is empty – though you might want to shy away from second-hand Echo devices if you're worried about security, as you never know what someone might have modified without you knowing."
  ],
  "headers": {
    "8": "Analysis: convenience at the cost of security?"
  },
  "links": {
    "Amazon Echo": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
    "Echo (4th Gen)": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Echo Dot (4th Gen)": "https://www.techradar.com/reviews/amazon-echo-dot-2020",
    "Echo Dot (4th Gen) with Clock": "https://www.techradar.com/reviews/amazon-echo-dot-with-clock-2020-review",
    "Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Amazon's Astro robot": "https://www.techradar.com/news/amazons-astro-robot-is-a-24-hour-security-guard-and-smart-assistant-all-rolled-into-one"
  }
}