{
  "source": "https://www.techradar.com/news/microsoft-outlook-update-lays-foundation-for-hybrid-working-future",
  "title": "Microsoft Outlook update lays foundation for hybrid working future",
  "category": "computing",
  "updated": "2021-05-27T11:01:17Z",
  "author": "joel-khalili",
  "summary": "New Outlook feature will ensure staff can collaborate across different working environments",
  "article": [
    "Microsoft is working on an update for its email service Outlook in anticipation of the widespread transition to hybrid working, whereby employees split their time between the home and office.",
    "As per a new entry to the company’s product roadmap, Outlook calendar markers will soon automatically contain links to join meetings via the web.",
    "“Whether you’re working from home or meeting with people in other locations, all your meetings will automatically be online so everyone can attend,” Microsoft explained.",
    "When it first goes live, the feature will support Teams and Skype sessions only, although Microsoft has suggested third-party video meetings may become compatible later down the line.",
    "The Outlook update is still technically under development, but is expected to roll out to all users before the end of the month.",
    "One of the main questions facing businesses as societies begin to unlock is how to ensure collaboration remains equitable when staff are split between the office and home. In many ways, the challenge is much more complex than supporting a remote-only workforce.",
    "The most critical technology services in the months to come will be those that facilitate frequent transitions between environments and provide a level of consistency that bridges the gap between different styles of working.",
    "Although the new Outlook feature doesn’t necessarily address potential pitfalls associated with meetings that combine in-person and remote collaboration, it will at least ensure that no employee is excluded from the process.",
    "It also forms part of a wider Microsoft strategy that centers largely around its collaboration platform Teams, which has received a raft of upgrades designed to make the service into a central hub for working.",
    "By building as wide a range of functionality into Teams as possible, the company hopes to minimize the number of tools workers need to get a job done, while providing a common space where office-based and remote staff can work together effectively."
  ],
  "headers": {
    "5": "Microsoft Outlook update"
  },
  "links": {
    "email service": "https://www.techradar.com/news/best-email-provider",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-8531263526423381000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D81995",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Skype": "https://www.techradar.com/reviews/skype",
    "video meetings": "https://www.techradar.com/best/best-video-conferencing-software",
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}