{
  "source": "https://www.techradar.com/news/panasonic-will-no-longer-produce-its-own-tvs-in-europe",
  "title": "Panasonic will no longer produce its own TVs in Europe",
  "category": "televisions",
  "updated": "2021-10-22T17:23:00Z",
  "author": "nick-pino",
  "summary": "However, ‘R&D in Japan as well as in Europe will continue’",
  "article": [
    "Your next Panasonic TV won’t be produced by Panasonic itself. Well, not entirely at least.",
    "An internal announcement that went out to employees earlier this week stated that the company will shift production of TVs away from its factory in the Czech Republic to a yet-to-be-unveiled external company.",
    "A Panasonic spokesperson confirmed the news in a statement to TechRadar and said that while production of the TVs would move elsewhere, “R&D in Japan as well as in Europe (Langen, Germany) will continuously develop and evolve the leading picture quality you have been experiencing from us.”",
    "The reason for the shift, according to Panasonic, is to “make our TV business profitable on both a global scale as well as on a European basis” and says that the move is similar to ones made by other TV makers in the industry over the past few years.",
    "We won’t know how much the move to an external manufacturer will affect the quality of its TVs until next year’s lineup is unveiled, but the decision isn’t worth losing sleep over.",
    "In fact, a number of other companies already source panels from other makers - Sony and Samsung buy OLED panels from LG Display, for example - and they still manage to put their own touches to make the TVs look and feel different from one another.",
    "That said, Panasonic has been responsible for making some of the best OLED TVs consistently year-after-year, and the shutting down of that factory could have ramifications on the performance of those TVs in the future, even if there’s no immediate difference.",
    "Thankfully, Panasonic’s promise to keep its R&D divisions operational means that we’ll continue to see innovation out of the brand - and if those innovations now come at a lower price thanks to panel outsourcing, well, that’s a win-win for everyone.",
    "For folks in the US, though, none of this will make much of a difference as the brand still has yet to return to the country after its departure in 2016."
  ],
  "headers": {
    "4": "Analysis: Maybe you’ll notice a difference… and maybe you won’t"
  },
  "links": {
    "Panasonic TV": "https://www.techradar.com/news/panasonic-tv-2021",
    "best OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today"
  }
}