{
  "source": "https://www.techradar.com/news/battlefield-2042-is-already-being-targeted-by-cheats-with-over-a-million-signed-up",
  "title": "Battlefield 2042 is already being targeted by over a million hackers",
  "category": "gaming",
  "updated": "2021-08-23T13:55:36Z",
  "author": "adam-vjestica",
  "summary": "Modern warfare",
  "article": [
    "Battlefield 2042 isn’t even out yet, but it’s already being targeted by cheats and hackers.",
    "As spotted by Charlie Intel, a website called ‘IWantCheats’ is already offering cheats for the upcoming online competitive shooter. The list of hacks includes aimbots, radar hacks, ways to harass people, and more game-breaking features that are bound to ruin the fun for everyone else.",
    "What makes matters worse, though, is that ‘IWantCheats’ claims to have \"over 1.2 million registered users\", which have apparently never been banned from a Battlefield game before.",
    "The website also actively encourages players to cheat, claiming that its hacks are undetectable and always updated.",
    "\"Safety and undetectability are top priorities for IWantCheats. Our Battlefield 2042 Hack is confirmed to be undetected, as we always update the second a new patch comes out from the developer.\"",
    "IWantCheats (which we’re not linking to for obvious reasons) also promises cheats for Outriders, Call of Duty: Warzone, Splitgate and even Sea of Thieves.",
    "With online streaming now the norm, many \"pro\" gamers rise to stardom by using hacks to trick their audience into thinking they’re more skilled than they actually are. Some get caught, but the more sophisticated hacks become, the harder it is for developers to determine whether foul play is involved.",
    "Due to being an online competitive shooter, Battlefield 2042 is bound to be flooded with players who want to gain an unfair advantage. We’ve seen it time and time again in games like Call of Duty: Warzone, Apex Legends and PUBG, where developers spend just as much time thwarting hackers as they do updating a game.",
    "Call of Duty has permanently banned 300,000 players worldwide since launch, and a further 60,000 back in February who were caught using cheat software. But unfortunately, hackers and cheats continue to devise more ways to manipulate the game and cause misery for every player who chooses to play fair.",
    "With Battlefield 2042 shaping up to be a popular return for Dice’s long-running first-person shooter, it’s important that EA clamps down on cheaters early on, as no one wants to play a competitive game that’s inherently broken due to hackers.",
    "Hopefully both Dice and EA can ensure that Battlefield 2042 remains competitive and free of hackers, though it looks like work already needs to be done to stem the tide of upcoming cheaters."
  ],
  "headers": {
    "6": "Analysis: The war against hackers never ends"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "Charlie Intel": "https://charlieintel.com/a-cheat-provider-is-unfortunately-already-offering-hacks-for-battlefield-2042/117584/",
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-release-date-news-and-features",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds"
  }
}