{
  "source": "https://www.techradar.com/news/data-centre-industry-to-become-trillion-dollar-fifth-utility-by-end-of-decade",
  "title": "Data centre industry to become trillion-dollar 'fifth utility' by end of decade",
  "category": "computing",
  "updated": "2021-03-12T16:27:28Z",
  "author": "mayank-sharma",
  "summary": "There will be several new hyperscale data centers by 2030",
  "article": [
    "As an increasing number of companies move to the cloud, data centers will soon become as indispensable as any other utility, a new report suggests.",
    "Fueled by growth during the Covid-19 pandemic, data center revenue will touch $948 billion by the end of the decade, according to forecasts from data and analytics company GlobalData.",
    "“Data center-provided cloud services have allowed remote workers to collaborate with colleagues, provide entertainment for locked-down citizens, deliver online learning and enable online shopping,\" observes David Bicknell, Principal Analyst at GlobalData.",
    "\"At the same time, the pandemic-driven accelerating shift to the cloud has put a premium on flexibility. This will, in turn, drive the adoption of new architectures and software-defined, programmable infrastructures within data centers.\"",
    "Businesses are becoming increasingly reliant on data centers for all kinds of services, from cloud storage to remote collaboration services.",
    "In its latest report, GlobalData states that data center revenue is projected to grow at a compound annual growth rate (CAGR) of 6.7% to reach almost a trillion dollars by 2030. That’s more than double the $466 billion generated by data centers in 2020.",
    "The report suggests that much of the projected growth will come from building massive hyperscale data centers. It also imagines that there will be several mergers and acquisitions in the data center space, which in turn will fuel the creation of special purpose acquisition companies to buy up data centers.",
    "While the growth is encouraging, the report cautions that it will also attract additional government scrutiny.",
    "“The expansion of data centers reflects the need for increased artificial intelligence (AI) processing capabilities, but these have a poor carbon footprint. With governments focused on climate change, meeting stringent sustainability targets will be an unwelcome reward for an industry that excelled during the pandemic,” cautioned Bicknell."
  ],
  "headers": {
    "4": "Double-edged sword"
  },
  "links": {
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud services": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "collaborate": "https://www.techradar.com/best/best-online-collaboration-tools",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}