{
  "source": "https://www.techradar.com/news/this-irobot-roomba-vacuum-cleaner-black-friday-deal-makes-chores-a-breeze",
  "title": "This iRobot Roomba vacuum cleaner Black Friday deal makes chores a breeze",
  "category": "smart-home",
  "updated": "2021-11-22T23:56:57Z",
  "author": "jess-weatherbed",
  "summary": "Put that vacuum down and your feet up",
  "article": [
    "Many of us have dreamed about automating household chores, and while having robots doing the entire process might be a few years away, we can certainly make them vacuum and mop our floors.",
    "This iRobot Roomba i1+ vacuum cleaner is one of the better Black Friday deals this year at Walmart, down from $579 to just $349. (Not in the USA? Scroll down for deals in your region).",
    "Robot vacuum cleaners are a great way to ensure your floors stay clean and tidy all day, without you needing to manually run over them yourself with a large, clunky machine.",
    "Thanks to modern technology, robot vacuums improving every day which is why this iRobot Roomba vacuum cleaner has amazing features, such as being self-emptying for up to 60 days (allowing you to forget about manually emptying the vacuum yourself), and Intelligent, straight line navigation to ensure that no part of your floor is left unclean.",
    "Its 3-stage cleaning system will ensure that not only does it clean efficiently, but you can program it to do so while you're out of your home so the vacuuming is out of sight and earshot.",
    "Pet hair won't be an issue either if you have small, furry friends as the Roomba i1+ Robot Vacuum uses Dual Multi-Surface Rubber Brushes that flex to adjust to different floor types and avoid getting tangled with fur or hair.",
    "The iRobot Home app allows you to preset times for the Vacuum to start and stop through the day, allowing you to get it going while you drop the kids at school or complete your daily errands, so your home will always have clean floors without you needing to be in to supervise.",
    "No matter where you live, you'll find all the lowest prices for the vacuum cleaners from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Roomba i1+ Black Friday deals",
    "7": "More vacuum cleaner deals",
    "8": "More Black Friday deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "down from $579 to just $349": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-3996312681855078000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FiRobot-Roomba-i1-1552-Wi-Fi-Connected-Self-Emptying-Robot-Vacuum-Works-with-Alexa-Ideal-for-Pet-Hair-Carpets%2F484338113",
    "robot vacuums": "https://www.techradar.com/news/best-robot-vacuums"
  }
}