{
  "source": "https://www.techradar.com/news/ios-15-might-fix-an-iphone-camera-problem-you-didnt-even-notice",
  "title": "iOS 15 might fix an iPhone camera problem you didn't even notice",
  "category": "phones",
  "updated": "2021-08-17T09:08:26Z",
  "author": "tom-bedford",
  "summary": "Overzealous Night mode",
  "article": [
    "When you're taking a low-light picture on your iPhone, Night mode will automatically toggle on - this means the snap takes longer to capture, but ends up being way brighter, so you can see what's in the darkness. Apparently, iOS 15 is bringing the ability to turn this automation off.",
    "According to 9to5Mac, and presumably found in the currently-running iOS 15 beta, the Apple software update, which is set to roll out in its final form from September, has a setting that lets you completely turn off automatic Night mode.",
    "You'll still be able to use Night mode in the camera app by manually selecting it - the mode just won't automatically toggle when you're trying to take a standard photo.",
    "You could previously stop automatic Night mode from triggering, but the action would only apply until you closed the camera app, so you'd need to turn it off all over again, which spoils half the point of turning it off to begin with.",
    "This new feature sounds like a logical solution to an annoying quirk of Apple's software.",
    "The problem with Night mode automatically appearing on standard photos, is that while this resulted in brighter and easier-to-see snaps, that's not the same thing as 'better' photos.",
    "Lots of night-time photos look far more artistic when the dark of the night, and the bright of street lights or buildings or whatever else you're capturing, juxtapose each other. The shining lights in the darkness stand out because they're so lonely.",
    "If Night mode dims the lights, and also brightens up the 'darkness' so you can see shapes and objects, it loses its artistic quality. The photos generally aren't as good (obviously exceptions apply).",
    "Sure, it's up for each photographer to play around with the phone settings and framing to take a great picture, but that can be a lot harder when Night mode keeps jumping up and down and saying 'pick me!'.",
    "It's not like Night mode is any harder to use now, since you can still just press 'Night' in the photography carousel at the bottom. It makes you wonder why Apple ever thought this long-take Night setting needed to be toggled on the standard 'Photo' mode too.",
    "Either way, it's going now, and we'd like to see Android devices follow suit, because they suffer from this problem just as much as iPhones."
  ],
  "headers": {
    "5": "Analysis: why it's night-night for automatic Night mode"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "9to5Mac": "https://9to5mac.com/2021/08/16/ios-15-lets-you-turn-off-iphone-cameras-night-mode-feature-and-keep-it-off/"
  }
}