{
  "source": "https://www.techradar.com/news/intel-investing-billions-in-us-manufacturing-plant",
  "title": "Intel investing billions in US manufacturing plant",
  "category": "computing",
  "updated": "2021-05-04T09:22:52Z",
  "author": "mayank-sharma",
  "summary": "The new investment is part of Intel's new IDM 2.0 strategy",
  "article": [
    "Chip giant Intel has announced a $3.5 billion investment to ramp up its Rio Rancho manufacturing facility in New Mexico.",
    "The multiyear investment aims to upgrade the facility to manufacture advanced semiconductor packaging technologies, including its 3D packaging technology dubbed Foveros.",
    "The investment follows a further announcement from Intel earlier this year that it would be building two new semiconductor factories in Arizona at a cost of $20 billion.",
    "This series of investments formpart of new Intel CEO Pat Gelsinger’s overhaul of the company’s integrated device manufacturing (IDM) model, which includes setting up a new semiconductor manufacturing business called Intel Foundry Services.",
    "“We’re proud to have invested in New Mexico for more than 40 years and we see our Rio Rancho campus continuing to play a critical role in Intel’s global manufacturing network in our new era of IDM 2.0,” said Keyvan Esfarjani, Intel senior vice president and general manager of Manufacturing and Operations.",
    "The New Mexico investment comes weeks after Gelsinger promised his company would ramp up production in its existing units in a bid to help pull out companies from the current semiconductor chip shortage.",
    "Gelsinger last month referred to 2021 as a “pivotal year” for the company, as Intel beat analyst revenue expectations for the first quarter of 2021, riding primarily on strong growth in PC sales.",
    "The Rio Rancho facility is one of Intel’s oldest manufacturing units and according to the company currently develops and manufactures Intel Optane SSD technology, embedded multi-die interconnect bridge, and Intel silicon photonics technology.",
    "In a release, the chip maker shared that the new investment will create at least 700 high-tech jobs in the state, in addition to a 1000 construction jobs, while supporting an additional 3,500 jobs in the state.",
    "Via ZDNet"
  ],
  "headers": {
    "5": "Part of IDM 2.0"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "3D": "https://www.techradar.com/best/best-3d-printers",
    "announcement": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "“pivotal year”": "https://www.techradar.com/news/intel-records-mixed-q1-but-pc-sales-offer-a-silver-lining",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "ZDNet": "https://www.zdnet.com/article/intel-to-invest-3-5b-to-expand-manufacturing-in-new-mexico/"
  }
}