{
  "source": "https://www.techradar.com/news/hybrid-working-could-be-a-catastrophic-mistake",
  "title": "Hybrid working could be a catastrophic mistake",
  "category": "computing",
  "updated": "2021-06-06T14:18:22Z",
  "author": "joel-khalili",
  "summary": "A hybrid working model is anything but the perfect solution, says Head of Remote at GitLab",
  "article": [
    "In the spring of 2020, the pandemic was said to have brought about the world’s largest remote working experiment. But as some nations now begin to unlock, there is little agreement over the conclusions that can be drawn.",
    "Eager to escape the confines of the home office, many people are calling for a transition to a hybrid working system, whereby time is split between the home, office and any other preferred location.",
    "Others, like Darren Murph, Head of Remote at GitLab, believe businesses are heading blindly towards catastrophe, having underestimated the logistical challenges a shift to hybrid working will create.",
    "“Hybrid working is going to wreck a lot of companies; it’s going to create a lot of chaos and friction,” he told TechRadar Pro, in no uncertain terms.",
    "“The moment you force a subset of people back into the office, with another subset that is always remote, you have two playing fields to administrate - and that will be extremely difficult.”",
    "As vaccine rollouts have gathered pace and frustrations with lockdown measures have deepened, patience with remote working appears to have dwindled. However, while the home office has lost much of its initial charm, Murph is convinced the remote model can solve many deep-rooted problems with office culture and ways of working.",
    "GitLab, whose DevOps platform straddles the line between IDE and collaboration tool, was an all-remote company long before the pandemic, with no physical premises whatsoever. According to Murph, both he and GitLab have been banging the remote working drum for many years, but only recently have people begun to sit up and listen.",
    "“It feels like I’ve been pushing the remote working rock uphill for the better part of 15 years,” he said. “But Covid has enlightened the world to the fact that a lot of work can be done flexibly.”",
    "“The pandemic has accelerated a trend that was already playing out and we’re seeing a lot more people start to think about the intersection between work and life very differently.”",
    "Murph’s role, Head of Remote, was carved out by GitLab in recognition of the fact that orchestrating a fully-remote operation requires both investment and the attention of a dedicated team. His day-to-day responsibilities span a number of business functions - from marketing and communications to operations and culture - but his core objective is to champion the company’s all-remote system.",
    "When he was appointed in 2019, Murph says he was probably the only Head of Remote in the world. But now, many of the largest companies are hiring for the role, including the likes of Dropbox and Facebook.",
    "“Before the pandemic, companies assumed there were only two places to work: the home and the office. In its purest form, remote working offers ultimate flexibility,” he said.",
    "“Inertia is difficult to overcome and there were a lot of legacy habits in place, like the commute to the office and chats at the water cooler. The pandemic gave everyone a permission slip to consider whether things could be done differently.”",
    "As part of his job, Murph thinks about the change a remote-first culture could bring about on a macro scale, beyond just the effects on his own business. His vision for a remote working society is much grander than simply skipping a few days in the office here and there.",
    "Challenged on the practicalities of a system whereby people are working with complete flexibility, from all manner of locations and almost always asynchronously, Murph explained that a deeper and more comprehensive change in mindset will need to take place.",
    "“It’s about how you spend your time,” he told us. “Many people have simply shifted the office approach, lifted it up and pasted into the virtual world. But if you think about your work day as chunks of hours instead of a solid block, the trajectory of your week will be fundamentally changed.”",
    "“If even a small percentage of the people working remotely as a result of Covid understand that fact, it could be really powerful.”",
    "In order for an all-remote model to function, however, GitLab believes a strong foundation needs to be put in place. The company’s remote manifesto sets out a series of rules, which include:",
    "With this combination of structures in place, the idea is that employees will be liberated to work in a completely new way, different entirely from the rigid structures workers have become accustomed to.",
    "Asked about lifestyles and industries that may be incompatible with his vision, Murph conceded that an all-remote model cannot be applied indiscriminately. But he contends that the lives of those unable to work remotely will also change for the better, with less traffic on the roads during commuting hours, more efficient information sharing and greater transparency around company culture.",
    "As some regions begin to emerge from the pandemic, Murph believes businesses are approaching a dangerous crossroads.",
    "Hybrid working is being bandied around as the perfect solution, allowing for face-to-face interaction without compromising the benefits of working from home. However, establishing the correct balance will be easier said than done.",
    "The main challenge will be ensuring collaboration remains equitable, with half of meeting attendees in the room and half dialling in over video, and that methods of communication remain consistent.",
    "For example, Murph explained, businesses will have some people working in an office-first manner, collaborating in a way that excludes remote colleagues. At the same time, remote team members will be working over digital platforms, creating opportunity for overlap and for information to fall between the cracks.",
    "According to Murph, the only way to solve this problem is to go all-remote, or at the very least convert all workflows to remote-first.",
    "“The office is a relic of the past. If you’re going to go to an office, it should simply be a place where you go to work remotely. When you go to that office, it shouldn’t change the way you work,” he told us.",
    "“If one of your co-workers is sitting five feet away and the rest are all in different countries, you should all collaborate in the same way. But old habits are very difficult to break.”"
  ],
  "headers": {
    "5": "A change of mindset",
    "13": "The magic of remote",
    "20": "The problem with hybrid working"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "IDE": "https://www.techradar.com/best/best-ide-for-python",
    "collaboration tool": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Dropbox": "https://www.techradar.com/reviews/dropbox-cloud-storage-review",
    "remote manifesto": "https://about.gitlab.com/company/culture/all-remote/guide/#the-remote-manifesto"
  }
}