{
  "source": "https://www.techradar.com/news/oppos-next-flagship-android-phone-coming-in-early-2022-with-snapdragon-8-gen-1",
  "title": "Oppo's next flagship Android phone coming in early 2022 with Snapdragon 8 Gen 1",
  "category": "phones",
  "updated": "2021-12-01T02:24:18Z",
  "author": "james-peckham",
  "summary": "Almost certainly the Oppo Find X4",
  "article": [
    "Oppo's next flagship phone - likely to be called the Find X4 series - is set to feature the new Qualcomm Snapdragon 8 Gen 1 chipset, and it's also confirmed to launch in early 2022.",
    "Oppo confirmed this soon after the Snapdragon 8 Gen 1 reveal at Qualcomm's Snapdragon Summit 2021. Oppo joins Xiaomi and Motorola as the first manufacturers to confirm compatibility with the new chipset.",
    "The company confirmed it would be introducing its new device in Q1 2022, which means it'll be revealed at some stage before the end of March next year.",
    "The Oppo Find X3 series was introduced in March 2021, so it may be that we see the sequel handsets launch in March 2022.",
    "If that's the case, it may be the company decides to launch its phones as part of Mobile World Congress 2022.",
    "Scott Zhang, Oppo Vice President of Overseas Sales, said, \"Oppo maintains a close relationship with Qualcomm Technologies, and we believe the new mobile platform will bring immense improvements and powerful performance to the next generation of flagship smartphones.\"",
    "We've begun to see leaks for the Oppo Find X4 series with one tipster saying the Find X4 Pro may come with a QHD display, 80W fast-charging and 12GB of RAM.",
    "Earlier in the Qualcomm launch, the Xiaomi 12 was confirmed to be the first phone to feature the next-gen chipset. Plus, a new Motorola Edge phone that will be revealed in China will also include the chipset."
  ],
  "headers": {},
  "links": {
    "Find X4": "https://www.techradar.com/news/oppo-find-x4",
    "Qualcomm Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "Qualcomm's Snapdragon Summit 2021": "https://www.techradar.com/news/live/qualcomm-snapdragon-summit-2021-live-blog",
    "Mobile World Congress 2022": "https://www.techradar.com/news/mwc-2022",
    "new Motorola Edge phone": "https://www.techradar.com/news/new-motorola-edge-is-coming-in-just-a-few-days-but-it-may-be-a-china-exclusive"
  }
}