{
  "source": "https://www.techradar.com/news/nintendo-reveals-pokemon-legends-arceus-a-new-approach-for-the-game-series",
  "title": "Nintendo reveals Pokémon Legends: Arceus, a ‘new approach’ for the game series",
  "category": "gaming",
  "updated": "2021-02-26T16:01:00Z",
  "author": "rhys-wood",
  "summary": "Pokémon Legends: Arceus transports us to a much older Sinnoh region",
  "article": [
    "Pokémon Legends: Arceus has been announced for the Nintendo Switch as the closer to the Pokémon Presents presentation, which was held to celebrate the franchise’s 25th anniversary with new game announcements.",
    "According to the announcement, Pokémon Legends: Arceus acts as a prequel to the main series. Taking place in a much older version of Pokémon Diamond and Pearl’s Sinnoh region, in a time when Pokémon roamed freely. Players will travel from their village home base to many different areas surrounding it.",
    "The world premiere trailer showed off a glimpse at Pokémon Legends: Arceus’s gameplay, which looks to be running on the Pokémon Sword and Shield engine. The game will release simultaneously worldwide in early 2022 and is being developed by Game Freak.",
    "Players will be tasked with filling out one of the very first Pokedexes, which are your trusty Pokémon data collection devices featured throughout the series. In a twist on the typical formula, the three starter Pokémon are all from different generations, and they are Rowlet, Cyndaquil and Oshawott.",
    "There’s more of an emphasis on Pokémon Legends: Arceus being an RPG adventure, meaning progression might not be quite as linear as we’re used to in older titles. It looks like your trainer can catch Pokémon from the overworld, too, without having to enter a battle first. Of course, Pokémon battles will still be a major part of the experience.",
    "The focus of the game’s story looks like it will heavily involve the titular mythical Pokémon, Arceus, who in the Pokémon lore shaped the world how it is today.",
    "Pokémon Legends: Arceus looks to break new ground for the long-running series. While this may not be a mainline series entry, it’s interesting to see a big Pokémon adventure not be announced alongside a counterpart game, as we saw in 2017 with Pokémon Let’s Go Pikachu and Let’s Go Eevee."
  ],
  "headers": {
    "3": "Playing in the past"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Pokémon Let’s Go Pikachu": "https://www.techradar.com/news/pokemon-lets-go-review"
  }
}