{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-is-almost-certain-to-get-s-pen-support-heres-why",
  "title": "Samsung Galaxy Z Fold 3 is almost certain to get S Pen support - here's why",
  "category": "phones",
  "updated": "2021-06-29T08:47:33Z",
  "author": "aakash-jhaveri",
  "summary": "The stylus is almost guaranteed for the foldable flagship",
  "article": [
    "The Samsung Galaxy Z Fold 3 is expected to be one of the most capable foldable phones when it is announced in the coming weeks. Samsung just hinted at a major feature for its next flagship, which will be a category-first: support for its S Pen stylus.",
    "While the biggest announcement from MWC 2021 was around the upcoming Samsung Galaxy Watch 4 series and One UI Watch software, another interesting development was around the company's next major smartphone.",
    "With the Note 21 expected to be cancelled this year, all eyes will be on the Samsung Galaxy Z Fold 3 when it launches (that's expected to be in early August). A bunch of significant upgrades are expected on hardware and software fronts for a more durable and cohesive foldable tablet experience.",
    "Not just that, we can also now expect a big leap in terms of productivity features as Samsung has pretty much confirmed S-Pen support for the new flagship.",
    "While talking about the Galaxy ecosystem, a Samsung spokesperson talked about how the S-Pen remains unrivaled and has brought many smart features to the mix.",
    "In closing, they mentioned that the S Pen will be coming to more flagship smartphones in the near future, which we believe was a not-so-subtle hint at stylus support for the Samsung Galaxy Z Fold 3.",
    "We've seen leaks that suggest the Galaxy Z Fold 3 will support an S Pen, but it looks like there won't be a place on the phone to store the stylus. S Pen support is usually used to refer to devices that can accept input via a stylus — similar to the Galaxy S21 Ultra.",
    "The Z Fold 3 is unlikely to have a slot or a silo to holster the S-Pen when not in use, but there should be first-party cases that enable that.",
    "We also expect some more unique features and applications to make use of the foldable form factor.",
    "The current lineup of styli from Samsung has a rubber tip, which might be a little too hard for a foldable’s flexible display material. This could mean that Samsung unveils a new S Pen too, alongside the Z Fold 3.",
    "The August Unpacked event is also expected to mark the debut of the Samsung Galaxy Z Flip 3, the new smartwatches such as the Galaxy Watch 4 and Galaxy Watch Active 4 and a few other smaller announcements."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/news/samsung-galaxy-watch-4-reveal-set-for-upcoming-unpacked-event",
    "Note 21 expected to be cancelled": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "early August": "https://www.techradar.com/news/we-might-finally-have-a-date-for-samsungs-next-big-phone-and-wearable-launch",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "August Unpacked event": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-reportedly-entering-production-and-on-track-for-august",
    "Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}