{
  "source": "https://www.techradar.com/news/new-witcher-season-2-trailer-shows-netflix-isnt-ready-to-give-up-its-fantasy-crown",
  "title": "New Witcher season 2 trailer shows Netflix isn't ready to give up its fantasy crown",
  "category": "entertainment",
  "updated": "2021-10-29T16:06:00Z",
  "author": "tom-power",
  "summary": "Destiny is a beast",
  "article": [
    "The official trailer for The Witcher season 2 has arrived – and, judging by the latest footage, it proves that Netflix isn't ready to give up its fantasy crown just yet.",
    "Released on Friday, October 29 (just in time for Halloween, no less), the video shows the grandiose nature of The Witcher season 2. There are plenty of sweeping shots, intricate camera work, tons of fantasy-horror infused action and an indication of how much the stakes have been raised for Geralt and company.",
    "Check out the new trailer below:",
    "The Witcher's second season will see Geralt of Rivia (Henry Cavill) watch over Princess Ciri (Freya Allen) following the fallout from the season 1 finale. The titular character brings Ciri to his childhood home of Kaer Morhen but, unsurprisingly, it seems that the duo won't be as safe in this hideout as Geralt initially thinks.",
    "Not only must he keep Ciri safe from the world's numerous monsters and other antagonists, Geralt must also protect her from something else entirely: the mysterious power that Ciri possesses.",
    "Meanwhile, Yennefer of of Vengerberg (Anya Chalotra) is alive and well. Despite Geralt assuming that she was killed at the Battle of Sodden Hill, Yennefer finds herself a prisoner to the Nilfgaardians. Will she be able to escape and reunite with Geralt, Ciri and the other Witchers? Only time will tell. What we do know, though, is that The Witcher is likely to maintain its position as one of our favorite Netflix TV shows of all-time.",
    "The Witcher season 2 will launch exclusively on Netflix on Friday, December 17.",
    "Netflix has high hopes for The Witcher season 2. The show's first season was one of the most-watched TV series on the streamer when it arrived in December 2019. With such a devoted following, too, it's likely that many people will be glued to their TV screens to watch the series' next installment later this year.",
    "The Witcher, though, faces some serious competition in the fantasy genre towards the end of 2021.",
    "Amazon's TV adaptation of The Wheel of Time launches exclusively on Prime Video on November 19. And, while its season 1 finale will have aired by the time that The Witcher season 2 is released, it may still have a fight on its hands.",
    "Why? Well, not everyone will have had the chance to watch The Wheel of Time as soon as it's released. Some TV fans may wait until all six episodes are out before they watch it. Others, meanwhile, will only hear about The Wheel of Time by word of mouth. If they don't learn about it until, say, its fourth episode has been released, some viewers might not finish The Wheel of Time until mid or late-December.",
    "That would put it in direct opposition with The Witcher – a battle that Netflix may not have foreseen ahead of season 2's release.",
    "Still, The Witcher has a loyal following from the novels and an established viewership from its TV adaptation. That gives it a distinct advantage over The Wheel of Time, which isn't as well-known as The Witcher.",
    "So yes, Netflix should be able to see Amazon's threat when The Witcher season 2 arrives. Even if it doesn't, though, it'll make for a fascinating watch as the two biggest streamers around go head-to-head in the fantasy stakes. The more competition there is between studios and shows, the better it is for audience choice. Of that, we can be certain."
  ],
  "headers": {
    "7": "Analysis: Will Netflix continue to cast a spell on viewers with The Witcher?"
  },
  "links": {
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Netflix TV shows": "https://www.techradar.com/best/best-netflix-shows",
    "The Wheel of Time": "https://www.techradar.com/news/amazons-the-wheel-of-time-season-1-release-date-cast-plot-trailer-and-more"
  }
}