{
  "source": "https://www.techradar.com/news/best-smart-bags-suitcases-luggage",
  "title": "Best smart bags, suitcases, luggage and rucksacks for the future of travel",
  "category": "appliances",
  "updated": "2021-09-16T08:32:44Z",
  "author": "gerald-lynch",
  "summary": "You'll be on cloud nine with these clever cases",
  "article": [
    "Let’s face it – the golden age of flight is over. Sure, we can get around the world with relative ease, with all but the most far-flung and remote locations accessible by air.",
    "But unless you’ve paid for the first class, premium experience you’re going to be about as comfortable as a cow in an overheating barn.",
    "So it’s becoming ever-more important to be able to enjoy air travel with as little extra stress as is possible, able to bring your prized entertainment gadgets along for the ride and keeping them easily at hand and fully charged.",
    "The answer to super-smooth travel? Smart luggage. Here’s what you need to know.",
    "So-called smart luggage includes cases and bags designed to keep your gadgets charged while you travel.",
    "At their most basic, they’ll include a rechargeable battery pack that can be used to power your devices on the go, and at their most advanced they may include a GPS luggage tracker, putting your mind at ease as to the location of your baggage as it travels alongside you.",
    "Some brands, such as Horizn Studios even include a personalised travel service, managing bookings and reservations on your behalf.",
    "While not strictly tech-infused, gadget-friendly backpacks and rucksacks can also be a lifesaver when travelling, with secret pockets for valuables and dedicated pouches putting gadgets easily within reach when you’re rushing through security.",
    "However, the rise of smart luggage has not been a straightforward one. With airports on high alert due to never ending terrorism threats and passenger safety paramount, some earlier attempts at smart luggage have been banned on flights.",
    "Remember the exploding Samsung Galaxy Note 7 debacle? Or flaming hoverboards? They’re to blame – with airlines unable to verify the safety of onboard batteries, luggage that contained lithium-ion batteries were banned from the hold – and in the case of some airlines, from being taken onboard as hand luggage too.",
    "Major airlines like American Airlines, Delta and Alaska Airlines have all put restrictions on smart luggage. But all is not lost, provided you know what you’re travelling with.",
    "So what can, and can’t, you take on board? Essentially, if you buy a suitcase that has a removable battery pack onboard, you should be fine – they’re allowed in the cabin and, so long as you eject the battery before check in, they can be stored in the hold, too.",
    "However, some airlines are still a little touchy about cases with battery compartments built in, so just to be on the safe side, eject your battery pack before you go through security even if you’re taking it as carry on luggage.",
    "What you definitely shouldn’t do is buy a case with a battery pack built in that can’t be removed. This is a sure-fire way to get you held up at the gate, where you and your belongings will be stranded unless you purchase a new, dumb case.",
    "If you’re after the best of the best smart luggage, the best we've tried so far would be the cases built by Away. It makes smart cases in a range of sizes, including two different carry-on capacities, and a kid friendly case too.",
    "The Carry-On with Pocket is our pick of the bunch. Capacious with a 38L main compartment, and lightweight at 3.8kg when empty, it comes complete with an ejectable 10,000mAh battery tucked under the slide-out handle with two power-out ports for charging a pair of gadgets at once.",
    "Its polycarbonate shell is tough while still having enough give to overstuff the bag in a pinch, and 360-degree Hinomoto wheels let you glide around the airport concourse.",
    "A dedicated pocket at the front also lets you slip a laptop or tablet in and out in seconds to help a speedy sprint through security.",
    "An inner compression system maximises the amount of clothes you can fit inside, while a TSA-approved combination lock keeps your valuables safe while also letting authorities safely open your bag if required without resorting to tearing the the thing apart.",
    "Other brands to consider include Horizn Studios and Incase",
    "If you’re after a rucksack we’d suggest trying wares by ModernistLook and Horizn Studios. We've not tried these ourselves, but from our research these look by far the most sensibly-designed, with all the elements we're looking for.",
    "The more tech-savvy of the two is the ModernistLook Smart Pro. Large enough to house a 15-inch laptop, it has an integrated USB port to which you can connect up any portable charging pack on the inside.",
    "Then, it’s just a matter of plugging your depleted device into the port on the outside of your device to charge while on the go. With a hidden rear pocket for valuables against your back and a luggage strap for hooking your bag onto your suitcase, it’s feature rich.",
    "The Smart Pro isn’t the best looking bag we’ve seen. If you’re feeling fashion conscious, and don’t mind losing out on the USB port, check out the Horizn Studios Gion, which has a classier pod-like look, ample easy-access storage space and water resistance.",
    "The future of luggage? It's looking like it'll be hands-off, and ride-on. With GPS trackers mastered and onboard charging as standard, the future suitcase will look to do the really hard work for us – wandering aimlessly through cookie-cutter departure gates while dragging our stuff behind us.",
    "Take for instance the forward-thinking Modobag, as seen in the video above. Not only is it a vessel for your vestments, it also doubles up as a 6mph motorised scooter, turning a trip to the airport lounge into a makeshift Mario Kart track. Though released in 2016, there's still little out there yet to match it.",
    "Or how about Xiaomi's Puppy 1 Smart Suitcase? Remote control powered with a secure finger print lock, it'll follow its owner around, complete with a parking brake and bi-directional steering, with sensors allowing it to adjust to different inclines and adapt its center of gravity accordingly to avoid tipping over.",
    "And what about if you want to be buddies with your luggage? The Panasonic Personal Porter Robot concept was shown off in late 2018, and features facial recognition tech which lets it lock its contents off to anyone but its owner, whom it'll follow around like a faithful dog. While it's intended more for a trip to the shops than an overseas jaunt, its mere existence makes it easier to imagine a future where we've all got our own personal luggage-bot to carry our belongings around for us. Let the AI worry about your passport and dirty laundry while you hope off the plane and find the nearest beach."
  ],
  "headers": {
    "4": "What is smart luggage?",
    "8": "Travel restrictions",
    "14": "The best smart luggage: cases",
    "20": "The best smart luggage: rucksacks",
    "24": "Lightspeed luggage – the cases of the future"
  },
  "links": {
    "Horizn Studios": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5182669422002477000&xs=1&url=https%3A%2F%2Fhorizn-studios.co.uk%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fbest-smart-bags-suitcases-luggage",
    "Samsung Galaxy Note 7 debacle": "https://www.techradar.com/news/heres-one-way-samsung-is-keeping-the-galaxy-note-7-off-of-airplanes",
    "Away": "https://www.pntra.com/t/8-11514-101987-155614?sid=trd-us-6407330479486838000&website=194177&url=https%3A%2F%2Fwww.awaytravel.com%2Fuk%2Fen%2Fshop%2Fluggage",
    "Incase": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3813947898259649500&xs=1&url=https%3A%2F%2Fwww.incase.com%2Fproducts%2Ftravel%2Fsmart-luggage%2Fproconnected-4-wheel-hubless-roller&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fbest-smart-bags-suitcases-luggage",
    "Modobag": "http://modobag.com/"
  }
}