{
  "source": "https://www.techradar.com/news/british-airways-set-to-pay-out-billions-in-compensation-over-data-breach",
  "title": "British Airways set to pay out billions in compensation over data breach",
  "category": "computing",
  "updated": "2021-01-08T11:04:49Z",
  "author": "barclay-ballard",
  "summary": "Each claimant could receive thousands of pounds",
  "article": [
    "The UK’s flagship airline, British Airways (BA), intends to begin settlement discussions later this year relating to a massive data breach that occurred in 2018. The legal firm responsible for managing the settlements believes that, collectively, BA could end up forking out billions.",
    "Your Lawyers was appointed to the Steering Committee for the BA data breach litigation in 2019 and confirmed that BA has begun settlement discussions. The firm added that by considering compensation, BA was admitting culpability, which could result in significant settlement fees. Your Lawyers believes that every claimant could receive £6,000 on average, which would add up to approximately £3 billion if every affected customer filed a legal case.",
    "Individuals have until March 19 to join the Group Litigation Order, which they can do by filling in a few details here. In addition to the £6,000 forecast by Your Lawyers, it is possible that additional financial losses could also be claimed.",
    "Back in 2018, British Airways suffered two sizable data breaches in quick succession. First, between April and July, 185,000 BA reward-booking customers had their personal information and financial details compromised, and then an additional 380,000 users of the airline’s app and website had their information exposed between August and September.",
    "Among the information stolen were customer names, billing addresses, email accounts, and payment card details. The UK’s Information Commissioner’s Office issued BA with a record £183 million fine for breaching GDPR regulations, but this was reduced to just £20 million late last year.",
    "Although individual claimants may hear more about a possible settlement in the first quarter of this year, BA has already rejected suggestions that any pay-out will be as sizeable as the figure quoted by Your Lawyers.",
    "\"We continue to deny liability in respect of the claims brought arising out of the 2018 cyber attack and are vigorously defending the litigation,\" BA told TechRadar Pro in a statement. \"We do not recognise the damages figures that Your Lawyers has put forward, and they have not appeared in the claims.\"",
    "Via Infosecurity Magazine"
  ],
  "headers": {
    "3": "A sky high cost"
  },
  "links": {
    "data breach": "https://www.techradar.com/news/what-is-a-data-breach",
    "here": "https://www.bagroupaction.com/",
    "Infosecurity Magazine": "https://www.infosecurity-magazine.com/news/british-airways-plans-3bn-breach/"
  }
}