{
  "source": "https://www.techradar.com/news/crazy-fast-tesla-model-s-plaid-is-now-on-roads-and-it-plays-ps5-level-games",
  "title": "'Crazy fast' Tesla Model S Plaid is now on roads, and it plays PS5-level games",
  "category": "car-tech",
  "updated": "2021-06-11T09:56:45Z",
  "author": "john-mccann",
  "summary": "It's the first production car to hit 0-60mph in under two seconds",
  "article": [
    "The Tesla Model S Plaid is officially the latest electric car to hit roads, after the official delivery event took place in Fremont, California on June 10, with 25 cars passed to their new owners.",
    "Tesla boasts that the Model S Plaid offers huge improvements over the original Model S, with the latest generation of the firm's flagship electric vehicle having broken the sub-two second 0-60mph barrier.",
    "Tesla CEO, Elon Musk noted that no production car has ever done 0-60mph in under two seconds before, with the \"crazy fast\" Plaid's official time recorded at 1.99 seconds.",
    "There's another speed record for the Model S Plaid too, as it also takes the crown as the fastest production car to complete a quarter mile, with a time of 9.23 seconds.",
    "You'll find three electric motors inside the Tesla Model S Plaid, which can generate 1,020hp and propel the car to a top speed of 200mph.",
    "It's quoted to have a range of up to 390 miles – making it one of the best EVs for range on the market – and using a Tesla Supercharger it can regain 187 miles of range in just 15 minutes.",
    "Tesla has improved cold weather performance too – with EV range usually taking a hit when the mercury drops – with the inclusion of a new heat pump and improved thermal performance providing 30% better range in the cold, while using 50% less energy to heat the cabin.",
    "Musk also explained the reason behind making the Model S Plaid. \"We've got to show that an electric car is the best car, hands down.\" he said.",
    "\"Sustainable energy cars can be the fastest cars, the safest cars, can be the most kick-ass cars in every way, and that's why we did the Plaid. Just to show, hands down, this is the way to go.\"",
    "On safety, the Model S Plaid has yet to go through official safety ratings, but Tesla thinks it will get the lowest probability of injury of any car ever tested. We'll have to wait for the official crash tests and ratings to find out if it can live up to the claim.",
    "Musk went on to make the bold claim the Plaid is \"faster than any Porsche, safer than any Volvo.\"",
    "The Model S Plaid gets an all-new interior too. The large, 17-inch, 2200 x 1300 touchscreen in the front has been rotated 90 degrees, so it now sits landscape, making it better to watch movies and play games on, with PS5-level performance.",
    "During the event, we were given a demo of Cyberpunk 2077 being played on the main 17-inch display at 60fps.",
    "The UI (user interface) has also been improved for both front and rear displays, with more customization options and better gesture controls.",
    "There's two smartphone wireless charging pads which sit under the display, plus there's a 36W USB-C port too, which is powerful enough to charge a laptop. Tesla has also added a ventilated front seats option, to keep you cool in the summer.",
    "Another striking feature is the yoke steering wheel, which forgoes the traditional circular design, chopping the top half off and offering a look which is more accustomed to something you'd find in a F1 car.",
    "This design gives you much better visibility of the digital instrument display, although it remains to be seen how practical this design will be in the real-world.",
    "You won't even need to press a button to unlock, get in or start the Model S Plaid. The car can pair with your smartphone, sensing you as you approach which unlocks the doors, and once inside there' no start/stop button - the car is ready to drive right away - something we've experienced already in the Polestar 2.",
    "Rear seat passengers haven't been forgotten either, with a smaller display between the two front seats for them, plus another two smartphone wireless charging pads in the fold-down center arm rest.",
    "The Model S Plaid also features a powerful 22-speaker, 920 Watts sound system and special acoustic glass to keep outside noise to a minimum inside the cabin.",
    "If this seems like an awful lot for one package, you're not wrong, and the Tesla Model S Plaid price reflects the level of performance and technology this electric car offers.",
    "The Tesla Model S Plaid price starts at a staggering $129,990 / £118,980 / AU$186,990 (the standard Model S starts at $79,990 / £83,980 / AU$129,990), and goes up to $148,990 / £134,680 / AU$262,663 if you add premium paint, wheels, interior finish and full self-driving mode.",
    "You can watch back the Tesla Model S Plaid delivery event below"
  ],
  "headers": {
    "7": "But why?",
    "11": "New tech on the inside"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Polestar 2": "https://www.techradar.com/news/polestar-2-review"
  }
}