{
  "source": "https://www.techradar.com/news/microsoft-office-is-getting-a-simple-little-video-editor",
  "title": "Microsoft Office is getting a simple little video editor",
  "category": "computing",
  "updated": "2021-12-02T20:00:17Z",
  "author": "anthony-spadafora",
  "summary": "You'll soon be able to record, edit and share videos in Office for Android",
  "article": [
    "Microsoft is adding a video editor to its mobile app for Office that will allow users to create more than just documents using its office software.",
    "According to a new post in the Microsoft 365 Roadmap, a simple video editor will begin rolling out to the Office mobile app for Android beginning this month.",
    "Microsoft's new video editor in Office will enable users to create short video clips and of course edit them before sharing them with the people in their network.",
    "While there are already plenty of video editing apps for Android such as KineMaster and PowerDirector, the company's new update for Office will make it possible for its customers to create short video clips using an app they already have installed on their Android smartphones without the need to download additional software.",
    "If you're looking to add a bit of visual flair to your projects in Excel, Word, Outlook and PowerPoint, last year Microsoft announced the addition of premium creative content to Office. With this feature, Microsoft 365 uses can easily add high quality, curated images, stickers and icons to both their personal and professional flies.",
    "To get started, simply select Insert, scroll down to Pictures and click on the Stock Images option. From here, you'll be able to pick from a wide variety of content in addition to stock images including Cutout People, Icons and Stickers.",
    "Microsoft also recently added Cartoon People in Office to allow users to create artwork and tell stories using a diverse set of characters and scenery. Cartoon People can be found in the premium content library under Icons and they can easily add a bit more to your documents and presentations.",
    "While Microsoft Office is nowhere close to Adobe's Creative Cloud, the addition of a video editor and premium creative content in the software giant's office software makes it possible for users to channel their inner visual creativity in a place where they wouldn't normally expect to be able to do so.",
    "We've also rounded up the best online collaboration tools, best free office software and best productivity tools"
  ],
  "headers": {
    "4": "Premium creative content"
  },
  "links": {
    "video editor": "https://www.techradar.com/best/free-video-editing-software",
    "Office": "https://www.techradar.com/news/microsoft-office-2021-release-date-pricing-features-and-everything-else-you-need-to-know",
    "office software": "https://www.techradar.com/best/free-office-software",
    "new post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6394146939398192000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D82197",
    "video editing apps": "https://www.techradar.com/best/best-video-editing-apps",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "stock images": "https://www.techradar.com/best/free-stock-photos",
    "Cartoon People": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9014941087217010000&xs=1&url=https%3A%2F%2Finsider.office.com%2Fsl-si%2Fblog%2Fadd-cartoon-people-to-office-creations&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-office-is-getting-a-simple-little-video-editor",
    "presentations": "https://www.techradar.com/best/free-presentation-software",
    "Creative Cloud": "https://www.techradar.com/reviews/adobe-creative-cloud",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best free office software": "https://www.techradar.com/best/free-office-software",
    "best productivity tools": "https://www.techradar.com/best/best-productivity-apps"
  }
}