{
  "source": "https://www.techradar.com/news/pentax-k-3-mark-iii-delay-hints-at-issue-thats-hitting-all-camera-manufacturers",
  "title": "Pentax K-3 Mark III delay hints at issue that's hitting all camera manufacturers",
  "category": "cameras",
  "updated": "2021-02-19T11:10:16Z",
  "author": "mark-wilson",
  "summary": "And it's not all down to the pandemic",
  "article": [
    "The glacial launch of the Pentax K-3 Mark III, an APS-C DSLR that was first seen in prototype form back in 2019, has been drawn out even longer with the news that it has been delayed again – and the reason is an increasingly common one that's affecting most camera manufacturers.",
    "In a progress report on its new flagship camera, picked up by Pentax Rumors, the manufacturer said that the K-3 Mark III now won't be released at the CP+ 2021 show, which starts on February 25.",
    "The reason? It said that \"as some of the product parts are delayed, we have determined that development will require a greater amount of time for us to achieve the exceptional performance and finest quality that is the hallmark of next APS-C flagship model\".",
    "It's another frustrating delay for K-mount fans and owners of the Pentax KP, who've been waiting for a successor to that all-rounder for a few years. But Pentax is far from alone in being affected by delays to product parts.",
    "In December 2020, Sony told us that it was \"facing a severe shortage of key parts\" for its compact cameras and video cameras. This followed reports from Australian publication Inside Imaging about a huge factory fire, which broke out on October 20 at Japanese components factory AKM Semiconductor, that would have \"serious ongoing supply impacts for several camera manufacturers\".",
    "Since then, Nikon confirmed to us that the AKM Semiconductor is one of its suppliers, but said that \"details around the impact are confidential\". And more recently, a post from Canon Rumors titled \"delays seem to be the name of the game for 2021\" suggested that Canon has had to delay launches and shelve plans for CP+ 2021 announcements due to \"manufacturing challenges\".",
    "Of course, we don't know for sure exactly which parts shortages have caused issues for the Pentax K-3 Mark III. There are also undoubtedly knock-on effects to supply chains from the pandemic, too, which have hit many other products in the tech industry, from the PS5 to Nvidia graphics cards.",
    "But the camera industry appears to have been hit particularly hard from this double whammy, with some brands like Fujifilm also recently announcing that they're having to restructure in the wake of a continued drop in demand for interchangeable lens cameras.",
    "So what does it mean for camera launches in 2021? The Pentax K-3 Mark III has been delayed indefinitely, with Pentax simply saying that \"it will inform you again in the near future\" about a revised launch date.",
    "After a blistering start to the year for new mirrorless cameras – which has seen the arrival of the Sony A1, Fujifilm GFX100S, Fujifilm X-E4 and Blackmagic Pocket Cinema Camera 6K Pro – it looks like we may be set for a slight lull before manufacturing starts to ramp up again in the second half of 2021.",
    "We're still expecting to see the Sony FX3 arrive at an event on February 23, but it looks like CP+ 2021 show will be a little quieter than usual for new camera launches, with new lenses from Canon, Nikon and Panasonic likely to be the order of the day. For anyone who's simply looking to start some new photography projects rather than being tempted into upgrading their camera, perhaps that's not such a bad thing."
  ],
  "headers": {
    "6": "A quiet patch?"
  },
  "links": {
    "Pentax Rumors": "https://pentaxrumors.com/2021/02/17/the-new-pentax-k-3-mark-iii-aps-c-dslr-flagship-camera-is-delayed-again/",
    "CP+ 2021 show": "https://www.techradar.com/news/cp-2021-what-new-cameras-can-we-expect-to-see-from-canon-sony-and-nikon",
    "Pentax KP": "https://www.techradar.com/reviews/pentax-kp",
    "Inside Imaging": "https://www.insideimaging.com.au/2020/chip-fire-to-impact-camera-supply/",
    "Canon Rumors": "https://www.canonrumors.com/delays-seem-to-be-the-name-of-the-game-for-2021/",
    "PS5": "https://www.techradar.com/news/ps5-and-xbox-series-x-chip-shortages-will-continue-until-mid-2021-amd-warns",
    "Nvidia graphics cards": "https://www.techradar.com/news/nvidia-rtx-3080-stock-shortage-is-set-to-worsen-and-it-could-cause-prices-to-rise",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Fujifilm X-E4": "https://www.techradar.com/news/the-fujifilm-x-e4-is-a-retro-travel-camera-with-an-attractive-price-tag",
    "Blackmagic Pocket Cinema Camera 6K Pro": "https://www.techradar.com/news/blackmagic-pocket-cinema-camera-6k-pro-arrives-with-flagship-filmmaking-tools",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers",
    "photography projects": "https://www.techradar.com/how-to/52-photography-projects-a-great-technique-to-try-every-week-of-the-year"
  }
}