{
  "source": "https://www.techradar.com/news/google-calendar-will-soon-show-how-much-time-you-spend-in-meetings",
  "title": "Google Calendar will soon show how much time you spend in meetings",
  "category": "computing",
  "updated": "2021-08-31T18:00:00Z",
  "author": "anthony-spadafora",
  "summary": "Time Insights can also show you who you spend the most time meeting with",
  "article": [
    "Keeping track of how you spend your time while working from home is about to get a lot easier as Google is bringing its new Time Insights feature to Google Calendar.",
    "With Time Insights in Calendar, remote workers get a personalized, analytical experience that shows how they spend their time across meetings and collaborators. However, it's worth noting that this new feature is only available on a computer and can't be viewed on a mobile device.",
    "Time Insights will begin rolling out for paid Google Workspace users in September and for admins, this feature will be toggled on by default but can be disabled at the domain/OU level according to a new blog post from Google.",
    "Once Time Insights is added to Google Calendar, users will be able to view a variety of data on how much time they spend working with collaborators online as well as how much time they spend in meetings each week.",
    "You can also gain insights into which days you spend the most time in meetings and how frequently your have them so that you can better plan out your work weeks.",
    "If you find yourself working with the same people frequently, you can also pin them to ensure you're staying in touch with them regarding projects and other tasks.",
    "Although Time Insights sounds like the kind of feature that could be used for employee monitoring, Google points out in its post that “this information is visible to you, not your manager” so that you can assess how you're spending your time against your own priorities. However, if you manage other people's calendars and have “manage sharing access” permission to their calendars, you will be able to view their Time Insights.",
    "Regardless of how long you've been working remotely, time management is an important aspect to working from home successfully and with Time Insights, Google is giving you all of the data you'll need to manage your time more effectively."
  ],
  "headers": {
    "3": "Time Insights"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Google Calendar": "https://www.techradar.com/news/google-calendar-will-soon-let-you-show-where-youre-working-from",
    "computer": "https://www.techradar.com/news/best-business-desktop-pcs",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "blog post": "https://workspaceupdates.googleblog.com/2021/08/better-understand-how-youre-spending.html",
    "employee monitoring": "https://www.techradar.com/best/best-employee-monitoring-software",
    "time management": "https://www.techradar.com/best/best-time-management-solution"
  }
}