{
  "source": "https://www.techradar.com/news/new-intel-arc-alchemist-gpu-leak-could-be-bad-news-for-nvidia",
  "title": "New Intel Arc Alchemist GPU leak could be bad news for Nvidia",
  "category": "computing",
  "updated": "2021-09-13T13:04:44Z",
  "author": "darren-allan",
  "summary": "Once again shows a graphics card ready to take on Nvidia’s RTX 3070",
  "article": [
    "Another leak around Intel’s incoming Arc gaming graphics cards shows again that the flagship GPU could be pitched against the Nvidia RTX 3070 in terms of its expected power level.",
    "To be precise, this is a leaked slide which came from the Baidu forums as highlighted by VideoCardz, and we have to be pretty skeptical about whether it’s genuine – though it does line up with previous indications we’ve heard from the rumor mill, and appears to reinforce a leak courtesy of Greymon which popped up last week on Twitter.",
    "The top Alchemist GPU – and note that this name, or indeed the Arc brand, aren’t used here, but rather the older DG2 codename – is shown as lining up in performance terms with both the RTX 3070 and 3060 / 3060 Ti for the Nvidia side of the equation. With AMD, it’s shown as roughly equivalent to the RX 6700 XT and 6600 XT. The Intel GPU offers a TDP of 175W to 225W according to the slide.",
    "Interestingly, there are only two different flavors of the DG2 high-end gaming graphics cards shown here, the flagship alongside an affordable 75W model which will be pitched at a performance level of something like Nvidia’s GTX 1650 Super (again, apply plentiful salt).",
    "The pricing for these two Intel Arc GPUs could purportedly be in the $300 to $499 range for the top-end model, according to the slide, or roughly in the $100 to $200 bracket for the more wallet-friendly product.",
    "While this material outlines two main Intel GPUs, there could be different models using those GPUs. Indeed, we’d expect a more midrange model using the flagship (SOC1) chip, as it’d seem pretty odd for Intel to have just a top dog offering, and then a cheap one, with nothing in-between.",
    "As we stated at the outset, the slide does correspond to previous leaks in terms of Intel targeting Nvidia’s RTX 3070 with its incoming flagship Alchemist graphics card, but that’s no guarantee that it isn’t some kind of fabrication. After all, if someone was to fake something, they’d probably make it seem to line up with existing rumors to give it more of an air of authenticity.",
    "We should also make it clear that this isn’t the most convincing piece of presentation material we’ve ever set eyes on, but we shouldn’t be too quick to dismiss it either. Presumably this is very likely to be the same slide which Greymon on Twitter previously referenced, as noted above, so that gives it at least a bit more credibility.",
    "What’s also noteworthy is that the DG2 codename is still used in this leak, with no mention of the freshly revealed Arc or Alchemist branding. This suggests a further possibility that this is an older slide from Intel, predating the new branding, so it could be genuine, but from quite some time ago – and if that is the case, the performance comparisons here may no longer be relevant.",
    "All in all, while this is an interesting glimpse of what we might expect from Intel with its new GPUs, in terms of pricing as well as performance, exercise a good deal of caution here. With Arc GPUs set to arrive at the start of 2022, if the flagship can compete with the RTX 3070, it’ll be quite some time before Nvidia can muster a response (with next-gen graphics cards not expected from Team Green until later next year)."
  ],
  "headers": {
    "5": "Analysis: Could this slide be real, fake – or just really old?"
  },
  "links": {
    "Intel’s incoming Arc gaming graphics cards": "https://www.techradar.com/news/intel-arc",
    "Nvidia RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Baidu": "https://tieba.baidu.com/p/7529361935",
    "VideoCardz": "https://videocardz.com/newz/leaked-slide-shows-intel-dg2-arc-alchemist-gpus-compete-with-geforce-rtx-3070-and-radeon-rx-6700xt",
    "which popped up last week": "https://www.techradar.com/news/intel-arc-alchemist-gpus-might-not-beat-rtx-3070-but-it-doesnt-matter",
    "RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "Intel GPUs": "https://www.techradar.com/news/intel-ceo-suggests-its-gaming-gpus-will-be-a-serious-threat-to-nvidia",
    "which Greymon on Twitter previously referenced": "https://www.techradar.com/news/intel-arc-alchemist-gpus-might-not-beat-rtx-3070-but-it-doesnt-matter",
    "not expected from Team Green until later next year": "https://www.techradar.com/news/nvidia-rtx-4000-lovelace-gpus-could-turn-up-earlier-than-expected-in-2022"
  }
}