{
  "source": "https://www.techradar.com/news/playstation-may-have-leaked-an-unannounced-square-enix-game",
  "title": "PlayStation may have leaked an unannounced Square Enix game",
  "category": "gaming",
  "updated": "2021-08-09T15:52:15Z",
  "author": "vikki-blake",
  "summary": "Voice of Cards: The Isle Dragon Roars looks set to release on PS4 soon",
  "article": [
    "A previously unannounced game, Voice of Cards: The Isle Dragon Roars, has seemingly been leaked.",
    "As reported by the Twitter account PSN releases, the game Voice of Cards: The Isle Dragon Roars was added to the \"PS4 Asian PSN\" complete with the ID CUSA27401.",
    "Though little is known about the hitherto unannounced title, a rumor on Reddit posits the game may be connected to Nier: Automata and Drakengard director and writer Yoko Taro, who confirmed a little while back that he was working on a brand-new game for Square Enix.",
    "Just to make it all that little bit more interesting, it turns out Square Enix trademarked \"Voice of Cards\" and \"The Isle Dragon Roars\" in June 2021 (thanks, TheGamer).",
    "Others wonder if the accompanying image – a pile of cards – was designed by Kimihiko Fujisaka, a character designer who also worked with Taro on Drakengard, as it seems to match their signature style.",
    "Right now, all we can do is speculate – neither Sony nor Square Enix have denied or accepted the rumors just yet – but with Gamescom just around the corner, we may find out more later this month. Watch this space.",
    "In an industry as tech-savvy as the gaming sector, it stands to reason that we're pretty good at snooping around behind the scenes to uncover hidden secrets. Thanks to the rise in data miners – gamers who intentionally scour hundreds of lines of code in-game files and updates – it's getting increasingly difficult for developers to keep their secrets despite all those non-disclosure agreements.",
    "Lately, though, we're getting as many leaks through official sources, too. But beyond accidental leaks where gaming companies, publishers, and even hardware developers like Xbox and Sony prematurely share their news on social media (and no matter how quickly those tweets are deleted, someone always seems to manage to grab a screenshot), gamers are also getting better at triangulating clues so that we can cross-reference interviews, trademark filings, and even behind-the-scenes store updates, too. This means as the industry matures, so too do our detective skills..."
  ],
  "headers": {
    "6": "Analysis: why do we see so many game leaks?"
  },
  "links": {
    "PSN releases": "https://twitter.com/psnrelease2/status/1423297076641767431",
    "Reddit": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/oykxis/psn_listing_for_voice_of_cards_the_isle_dragon",
    "TheGamer": "https://www.thegamer.com/playstation-accidentally-leaks-game/",
    "Gamescom": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Xbox": "https://www.techradar.com/reviews/xbox-series-x"
  }
}