{
  "source": "https://www.techradar.com/news/scarlett-johanssons-black-widow-lawsuit-has-been-resolved",
  "title": "Scarlett Johansson's Black Widow lawsuit has been resolved",
  "category": "entertainment",
  "updated": "2021-10-01T09:18:58Z",
  "author": "tom-power",
  "summary": "Black Widow bites back",
  "article": [
    "Scarlett Johansson and the Walt Disney Company have reached a monetary agreement over the actor's Black Widow lawsuit.",
    "As reported by Variety, the two parties have settled the dispute after a two month stand-off – though the terms of the agreement have not been made public.",
    "Johansson had sued Disney for breach of contract after Black Widow received a simultaneous release on Disney Plus and in theaters. According to industry insiders, Johansson's lawsuit claimed that her contract ensured any film in which she starred would launch exclusively in cinemas worldwide.",
    "In a statement, Johansson said: “I am happy to have resolved our differences with Disney. I’m incredibly proud of the work we’ve done together over the years and have greatly enjoyed my creative relationship with the team. I look forward to continuing our collaboration in years to come.”",
    "Alan Bergman, Disney Studios Content chairman, added: “I’m very pleased that we have been able to come to a mutual agreement with Scarlett Johansson regarding ‘Black Widow'. We appreciate her contributions to the Marvel Cinematic Universe and look forward to working together on a number of upcoming projects, including Disney’s ‘Tower of Terror.'”",
    "In July, Johansson's lawyers claimed that Black Widow's day and date Disney Plus release would reduce the actor's Black Widow payday. Per Johansson's team, she would've earn additional bonuses based on how the Marvel movie performed at the box office.",
    "Johansson's lawyers argued, though, that Black Widow's Disney Plus release reduced the amount that the actor earned as her deal didn't entitle her to a slice of the film's streaming performance. As a result, Johansson had sued Disney for a reported $50 million in lost earnings before the pair settled outside of court.",
    "For now, at least, it seems like the Premier Access initiative is on hold. With cinemagoers feeling uneasy about returning to theaters, due to the ongoing pandemic, Disney decided to provide audiences with a choice over how (and where) they watched the studio's latest releases.",
    "It's unclear how experimenting with a simultaneous theatrical and Disney Plus release truly worked out for Disney. Sure, Disney made $67 million by offering Black Widow to viewers as a Disney Plus Premier Access title, but that clearly had an impact on its box office takings – with Shang-Chi likely to surpass it soon enough.",
    "Whether the lawsuit is a factor or not, the studio appears to be more hesitant about launching its movies on Disney Plus and in cinemas at the same time.",
    "Recently, the Walt Disney Company confirmed that its final six film releases of the year would all receive timed exclusive theatrical runs. That includes Marvel's Eternals, the next MCU movie to arrive in theaters, on November 5.",
    "Yes, each one will arrive on Disney Plus in the future, but not before they've screened in cinemas for a 30-day or 45-day exclusivity period.",
    "Of course, this doesn't mean that Disney won't change tactics again if Covid-19 cases rise rapidly. The studio will want to provide audiences with a choice about how they consume Disney's latest content. If that means releasing films on Disney Plus and in theaters simultaneously, should Covid-19 cases increase, Disney may change its release strategy.",
    "For the time being, however, Disney's committed to theatrical releases: for fans of the moviegoing experience (not to mention theater owners), that's something to celebrate."
  ],
  "headers": {
    "7": "Analysis: is this the end of Disney's day and date release strategy?"
  },
  "links": {
    "Variety": "https://variety.com/2021/film/news/scarlett-johansson-disney-lawsuit-settled-1235078355/",
    "confirmed": "https://thewaltdisneycompany.com/disney-announces-exclusive-theatrical-windows-for-remaining-2021-slate-of-films/"
  }
}