{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-patent-suggests-it-could-measure-ecg-or-blood-pressure",
  "title": "Samsung Galaxy Z Fold 3 patent suggests it could measure ECG or blood pressure",
  "category": "phones",
  "updated": "2021-04-28T05:00:32Z",
  "author": "david-lumb",
  "summary": "Samsung Galaxy Z Fold 3 could have health tracking",
  "article": [
    "While in-screen fingerprint readers have become commonplace on flagship phones, the Samsung Galaxy Z Fold 3 or other future Samsung foldables could take it to the next level with Apple Watch-like biometric scanners that could measure heart rate and blood pressure, a new patent suggests.",
    "The supposed patent, filed with the USPTO in April 2020 and first revealed by Mark Peters at LetsGoDigital, shows three methods of taking biometric data, depending on how the foldable – labeled the Galaxy Z Fold 3 on the image, but potentially in other future Samsung foldables – is aligned.",
    "When unfolded, a users can squeeze finger and thumb on the edges of the phone; the presumed sensors can also read the user’s palm and forefinger when laid out in hand; and finally, reading a user’s finger with the foldable screens pinched closed.",
    "While the next phone this could arrive in would be the Samsung Galaxy Z Fold 3, it could apply to any device with a screen that folds inwards, as the prior Samsung Galaxy Z Fold 2 and Samsung Galaxy Z Flip do. The patent suggests the phone reads biometric data from fingers pressed over image sensors located underneath one or more of the device’s displays – and resulting health info could be displayed on the adjacent folding screen.",
    "Per LetsGoDigital, the patent claims these sensors could sense the condition and quality of an individual’s circulation system – not just blood pressure, but cholesterol level, aortic pressure (how harmful remaining in a sitting position could be), arterial stiffness (how much harder the heart must pump), along with stress and fatigue tracking. All this data would be combined with user-disclosed health info in the Samsung Health app for more robust personal charts.",
    "Why biometrics in a phone? Well, why not? Most of the predictions to put biometrics on phones is to enable another method of authentication, but given the greater focus on health apps and predictions, it makes sense for Samsung to explore new ways for users to track their personal wellbeing.",
    "While phonemakers aren’t likely to pass up an opportunity to sell users on smartwatches and other discrete fitness trackers, it may not be too difficult to transfer some of that health monitoring to a smartphone platform. Wearables still have their place in passive tracking and more robust health reports, but smartphones could offer the kind of immediate feedback that may help encourage users to seek medical aid at the right time.",
    "As always, this patent is a potential technology that may not make it into any finished product (or if it does, it may not arrive soon), but we’re excited for the potential all the same.",
    "Via PhoneArena"
  ],
  "headers": {
    "5": "Why biometrics in a phone?"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "LetsGoDigital": "https://nl.letsgodigital.org/opvouwbare-telefoons/samsung-galaxy-z-fold/",
    "authentication": "https://www.techradar.com/news/forget-passwords-youll-soon-be-able-to-log-into-your-laptop-using-biometrics-on-your-phone",
    "PhoneArena": "https://www.phonearena.com/news/samsung-galaxy-z-fold-flip-heart-rate-sensor-patent_id131743"
  }
}