{
  "source": "https://www.techradar.com/news/kids-spending-too-much-on-fortnite-xbox-consoles-now-come-with-spending-controls",
  "title": "Kids spending too much on Fortnite? You can now control Xbox spending via your phone",
  "category": "gaming",
  "updated": "2021-07-14T09:17:46Z",
  "author": "henry-st-leger",
  "summary": "More skins, more problems",
  "article": [
    "Whether your kids are playing on an Xbox Series X, Xbox Series S, or older Xbox One console, trying to keep track of – or prevent – impulse purchases can be a worry for parents, enough to make many wary of inputting their card and payment information into a games console at all.",
    "Some new spending controls put in place by Xbox, though, should make this a safer and less worrisome thing to do – while giving parents more involvement in their kids' spending habits.",
    "Xbox has announced a number of new updates to its Family Settings app, which is available on both iOS and Android. The Family Settings app already contains a number of ways for parents to manage their kids' screen time, as well as the age rating of the games they can access, and whether they can play with strangers or engage in voice chat on online multiplayer games.",
    "This update, though, adds the ability to add funds directly through the mobile app – say, as an allowance or one-off gift – and approve or deny specific purchases your child has attempted to make.",
    "Parents can activate an 'Ask to Buy' feature that sends a notification each time a purchase is requested without sufficient funds on the account, whether for a whole title or in-app purchases like microtransactions. The app also has easy overviews of spending history and current account balances.",
    "The danger with so many kid-friendly games like Fortnite is that, while the free-to-play model is great for accessibility, removing an up-front price barrier, the prevalence of microtransactions (optional in-game purchases) can cause issues.",
    "A young gamer may not realize they're using real-world money to buy cosmetic items, and those costs can quickly stack up – there are plenty of scare stories about parents finding thousands of dollars charged to their card, because their child went on an accidental spending spree.",
    "With the right safeguards in place, though, parents can relax and know they're in control of their finances. For more information on the Xbox Family Settings app, you can view the video below."
  ],
  "headers": {
    "5": "Fresh out of V-bucks"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}