{
  "source": "https://www.techradar.com/news/amd-rx-6700-leak-sparks-worries-that-it-wont-have-enough-memory",
  "title": "AMD RX 6700 leak sparks worries that it won’t have enough memory",
  "category": "components",
  "updated": "2021-03-22T11:38:37Z",
  "author": "darren-allan",
  "summary": "Leaked box shot shows a graphics card with 6GB of video RAM",
  "article": [
    "AMD’s supposedly inbound Radeon RX 6700 graphics card could run with 6GB of GDDR6 memory according to the latest leak (which runs contrary to previous rumors that this GPU would be equipped with 12GB).",
    "Tech Powerup dug up this info thanks to the site spotting leaked press shots of PowerColor’s RX 6700 Fighter (its entry-level card). One of the pics is the product box shot which clearly shows that the card has 6GB of video RAM on-board (and that it’s aimed at 1440p gamers). Note that the cooling solution looks the same as PowerColor’s 6700 XT model, too.",
    "As you’ll doubtless recall, AMD just launched the RX 6700 XT with 12GB of VRAM, and this is the vanilla RX 6700 version – the interesting bit being that as we said, a previous rumor indicated that the 6700 would also have 12GB.",
    "Indeed, Asus RX 6700 graphics cards have been spotted in EEC (Eurasian Economic Commission) filings with 12GB, yet PowerColor and ASRock products were also seen at the EEC with 6GB of VRAM listed.",
    "So, either Asus is wrong, and 6GB is the final call for the amount of video memory on board the RX 6700 – or another possibility is that there could be two variations of the RX 6700, with both 6GB and 12GB being options on the table (at different price points, obviously).",
    "Unless these shots are somehow faked, it certainly seems as if PowerColor’s RX 6700 Fighter will have 6GB on-board. Reaction online has certainly seen a number of gamers worried that this won’t be enough for their needs when it comes to 1440p gaming, which the card is touted for – but for those folks, there might just be a 12GB choice as well.",
    "Obviously we don’t know when the vanilla RX 6700 might launch, but given the EEC filings and increasing amount of rumors – plus the existence of these purported press shots – we guess it could be sooner rather than later. Particularly as the latest Radeon Adrenalin driver brought in support for ‘RX 6700 graphics’, indicating the range of 6700 products rather than the just-launched 6700 XT specifically.",
    "However, as we have to remind ourselves whenever any supposedly imminent GPU is mentioned, it will obviously be a major worry that there won’t be nearly enough stock to go round, as is certainly the case with AMD’s current Big Navi range and Nvidia’s RTX 3000 models alike.",
    "Via VideoCardz"
  ],
  "headers": {
    "4": "Dual options?"
  },
  "links": {
    "this GPU would be equipped with 12GB": "https://www.techradar.com/news/amd-rx-6700-and-6600-xt-gpus-could-both-load-up-with-12gb-vram",
    "Tech Powerup": "https://www.techpowerup.com/280016/powercolor-radeon-rx-6700-non-xt-fighter-pictured-confirms-6-gb-memory-size",
    "RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "PowerColor and ASRock products": "https://www.techradar.com/news/amd-rx-6700-and-6600-xt-gpus-could-both-load-up-with-12gb-vram",
    "latest Radeon Adrenalin driver": "https://www.techradar.com/news/amd-radeon-rx-6700-xt-support-arrives-in-new-driver-plus-a-cool-feature-for-overclockers",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "VideoCardz": "https://videocardz.com/newz/powercolor-radeon-rx-6700-fighter-leaked-comes-with-6gb-memory"
  }
}