{
  "source": "https://www.techradar.com/news/report-hyundai-confirmed-its-in-early-talks-to-help-make-apple-car",
  "title": "Report: Hyundai confirmed it’s in early talks to help make Apple's self-driving car",
  "category": "car-tech",
  "updated": "2021-01-08T02:48:34Z",
  "author": "david-lumb",
  "summary": "The Korean car company isn’t the only one talking with Apple about an autonomous auto.",
  "article": [
    "Apple is reportedly talking with automakers about developing its self-driving car, and Hyundai Motor has confirmed it’s involved, according to CNBC.",
    "There’s nothing to announce yet: “As the discussion is at its early stage, nothing has been decided,” a spokesperson for Hyundai Motor told CNBC. But they noted that Hyundai is among “a variety of global automakers” in talks with the tech giant.",
    "The confirmation comes after a subdivision of Korea Economic Daily reported that Apple approached Hyundai to cooperate on both developing an electric car and working on the rechargeable batteries to conceivably use in them.",
    "A separate Bloomberg report claimed the Apple car is still at least five years away. Sources told the news outlet that the vehicle is \"nowhere near production stage\" and, should development proceed with Apple’s small team working on the project, a car could be ready in five to seven years, assuming the pace isn’t accelerated.",
    "Rumors have reignited around Apple’s mission to build an autonomous vehicle, codenamed Project Titan, with a recent report suggesting Tim Cook could be introducing a new car concept as early as September 2021. But Reuters has suggested the Apple car would arrive by a later date: 2024.",
    "Hyundai’s comment suggests Apple is still early in development, and aligns with the Bloomberg report’s timeline.",
    "Developing..."
  ],
  "headers": {},
  "links": {
    "CNBC": "https://www.cnbc.com/2021/01/08/hyundai-motor-says-it-is-in-early-talks-with-apple.html",
    "Korea Economic Daily": "https://www.kedglobal.com/newsView/ked202101080003?lang=",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-01-07/apple-s-aapl-tesla-tsla-killer-won-t-ship-for-at-least-half-a-decade",
    "report": "https://www.gizchina.com/2020/12/21/apple-car-to-come-in-2021-two-years-ahead-of-the-original-schedule/",
    "Reuters": "https://www.reuters.com/article/apple-autos/exclusive-apple-targets-car-production-by-2024-and-eyes-next-level-battery-technology-sources-idINL1N2IX1RZ"
  }
}