{
  "source": "https://www.techradar.com/news/xiaomi-mi-11-ultra-and-mi-11-lite-launched-and-one-could-be-the-best-camera-phone",
  "title": "Xiaomi Mi 11 Ultra and Mi 11 Lite launched, and one could be the best camera phone",
  "category": "phones",
  "updated": "2021-03-29T14:31:04.022Z",
  "author": "tom-bedford",
  "summary": "One, two, three high-res cameras",
  "article": [
    "We thought the Xiaomi Mi 11 launch in February was a little quiet, and now we know why; it's because Xiaomi was holding all its goodies back until this big launch event in March. Now we know the Mi 11 Ultra, Mi 11 Lite and more are all totally real.",
    "At the big March 29 launch event, Xiaomi unveiled the Mi 11 Ultra, its super-premium take on the Mi 11, as well as the Mi 11 Lite 5G, which is an affordable version of the flagship handset.",
    "There's also the Mi Smart Band 6, an affordable fitness tracker, which you can find out about here, as well as the Mi 11i, Mi 11 Lite 4G, Mi 11 Pro and Mi Projector Pro, though you won't be able to buy those last three phones or the projector (as they're not coming to the UK, US or Australia).",
    "The big news from the announcement is the Mi 11 Ultra and Mi 11 Lite 5G though, as both are getting released in the UK (and possibly other regions) in April. We'll run you through their specs so you know what to expect, but just note that we don't have their prices just yet.",
    "This is Xiaomi's super-premium phone, likely intended to rival the Samsung Galaxy S21 Ultra, as it's huge and has top specs.",
    "The Mi 11 Ultra no doubt is Xiaomi's attempt to win the 'best camera phone' crown - its three cameras are a 50MP main, 48MP ultra-wide and 48MP telephoto (5x optical, 120x digital zoom), with a 20MP selfie-snapper. That's a lot of high-res cameras.",
    "The display is a 6.81-inch AMOLED panel with a 1440 x 3200 resolution, a 120Hz refresh rate, and 1700 nits max brightness. There's also a petite 1.1-inch AMOLED screen on the back, used for notification alerts as well as for framing selfies with the main cameras.",
    "Specs-wise, the phone has the powerful Snapdragon 888 chipset as well as 12GB of RAM and an internal cooling system. The battery is 5,000mAh, and it supports 67W wired and wireless charging, which is the fastest wireless charging we've seen in a smartphone. There's also 10W reverse wireless charging, for powering up your other devices.",
    "While we don't really see phones with the suffix '5G' in 2021 - most phones are 5G now - there's also a 4G version of the Mi 11 Lite, though that's not coming to many regions.",
    "The Xiaomi Mi 11 Lite 5G has a 6.55-inch screen with a FHD+ resolution and a 90Hz refresh rate. It's a pretty dainty device, weighing 159g and being only 6.81mm thick, and it's seemingly intended as a lightweight counterpoint to Xiaomi's chunky phones.",
    "The cameras here are a 64MP main, 8MP ultra-wide and 5MP telemacro snapper - the latter is for close-up pictures, and the Mi 11 used one that we wrote a whole feature about. The phone also has a 20MP front-facing camera.",
    "Xiaomi's Mi 11 Lite 5G marks the debut of the Snapdragon 780G chipset, which is a mid-range processor that should be good for its class, though we'll need to test it out. It's paired with 6GB or 8GB of RAM depending on which you opt for. As the name implies, this is a 5G phone.",
    "Finally, there's a 4,250mAh battery which powers up with 33W wired charging."
  ],
  "headers": {
    "4": "Xiaomi Mi 11 Ultra",
    "8": "Xiaomi Mi 11 Lite 5G"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Mi 11 Lite": "https://www.techradar.com/reviews/xiaomi-mi-11-lite-5g-review",
    "here": "https://www.techradar.com/news/xiaomis-mi-smart-band-6-could-be-the-cheap-fitness-tracker-youve-waited-for",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best camera phone": "https://www.techradar.com/news/best-cameraphone",
    "that we wrote a whole feature about": "https://www.techradar.com/news/a-xiaomi-mi-11-camera-feature-helped-me-appreciate-the-foods-i-take-for-granted"
  }
}