{
  "source": "https://www.techradar.com/news/how-to-avoid-buying-a-bad-treadmill-on-amazon-prime-day",
  "title": "How to avoid buying a bad treadmill",
  "category": "fitness",
  "updated": "2021-08-18T09:25:26Z",
  "author": "cat-ellis",
  "summary": "The best deals in the long run",
  "article": [
    "Treadmills are a big investment, and if you've been thinking about taking the plunge it might be tempting to pick up the first machine you see – but it's worth bearing in mind that not all treadmills are equal. If you make your choice based solely on price, there's a good chance you'll be disappointed and end up with a machine that's no use for anything other than hanging laundry to dry.",
    "Here, we've put together a list of tips, including advice from a professional personal trainer, to help you avoid being drawn in by low prices and pick a treadmill that's not just a good deal, but will also be good value in the long run.",
    "A cheap treadmill might seem tempting, and it's quite possible that there will be some genuinely good deals over Prime Day, but it's not always a good idea to grab the cheapest one possible.",
    "Amazon allows you to return most goods within 30 days for a refund, but a treadmill from a big manufacturer will also be covered by a warranty that gives you longer cover in case a manufacturing fault is discovered later. The warranty won't cover things like accidental damage though, so make sure you add your treadmill to your home contents insurance.",
    "It will also be easier to find replacement parts for a treadmill from an established brand, and they will have a customer relations department that you can contact in case you have a problem. This may not be the case with smaller companies, which might also not keep a supply of components in stock.",
    "Safety is another consideration. Products sold on Amazon should all comply with the safety legislation in your country (and Amazon sometimes contacts sellers to ask for proof) but the bigger treadmill brands are more likely to go beyond the call of duty with tools like safety keys to lock the machine when it's not in use, or a PIN that must be entered before the motor will start.",
    "Then there's the matter of specifications...",
    "To find our what to look for in a home treadmill, TechRadar spoke to Olivia Neely, personal trainer at Starks Fitness (currently sharing home workout videos at starksfitnessgym on Instagram).",
    "\"Ideally, you want one that offers a walk-and-run facility to maximize usage and training variations,\" she says. She also recommends considering the following specifications when making your choice.",
    "\"Belt size: for running you need a belt size of 48in+ in length and 16in+ in width. If you’re tall, you may need even longer!\"",
    "\"Speed and incline: to utilize training methods (walk, jog, sprint etc) you’ll need a treadmill that goes up to 10mph. You may also want to adjust incline settings to stimulate outdoor training conditions.\"",
    "\"Control panels: get a treadmill that is simple to use and offers easy-reach control buttons. Safety and efficiency go hand in hand.\"",
    "She also advises trying before you buy, where possible, and going down to your local fitness store to try as many as possible to check for comfort, noise levels, safety and size. If you're able to do this, you can then make a shortlist of models to watch over Prime Day, so you can snap one up if it drops in price.",
    "There are some treadmill brands to watch out for over Prime Day. These are all well known and established companies with a strong track record for building good quality fitness equipment that's built to last, and meets the specifications recommended by professionals.",
    "This certainly isn't an exhaustive list but if you see a big discount on a machine from any of these companies over Prime Day, it's well worth taking a closer look.",
    "NordicTrack Whether you're looking for a treadmill, an exercise bike, an elliptical or a rower, NordicTrack is one of the most dependable brands around. Most of its machines are also compatible with iFIT, which gives you interactive workouts to keep you from getting bored and help you build your fitness.",
    "ProForm ProForm is another huge name in home workout equipment. It's been around for 30 years, and is great for customer service. Not only does it have dedicated national phone numbers and email addresses, it offers a 12-month warranty from the original date of purchase. You can also order spare parts from its website, and the instruction manual for your treadmill gives all the information you need to find the components you need.",
    "Life Fitness Life Fitness produces a wide range of treadmills, from premium models made to take the stress of use in a commercial gym, through to affordable folding machines that don't skimp on specs. For example, the F3 folding treadmill has as top speed of 10mph, walk/jog/run modes, a generously sized belt, and built-in shock absorption.",
    "Horizon Fitness Horizon Fitness treadmills are great value, and if you can find a discount on Prime Day then definitely click for a closer look. Even the entry-level T101 has a hydraulic folding mechanism, a top speed of 10mph, a 55in running belt, Bluetooth connectivity, and a USB charging port for your phone or tablet. Customer service is also excellent, with manual, replacement parts, and live support all readily available.",
    "Prime Day is a great time to get a bargain, but if you're looking for a cheap treadmill it's not your only option.",
    "Before you place your order, Olivia Neely recommends considering not just how often you plan to use it, whether your expectations match your budget, how much space you have available, and whether it's actually necessary to buy a brand new treadmill, or if you could opt for a second-hand machine instead.",
    "Second-hand machines come with their own set of considerations, though. First of all, the seller may not have kept the original user manual, which would include important details of how to use the machine safely and maintain it.",
    "That's not necessarily a dealbreaker, though. If there's no manual, see if you can download one from the manufacturer's website, or request a PDF from their customer service department.",
    "What's more important is that the seller might also be unable to tell you when the treadmill was last serviced (or indeed if it's been serviced at all), and if it's an older model then parts may not be easy to get hold of.",
    "Buying a second-hand treadmill is likely to be much cheaper than picking up a new one though, even on Prime Day, and it helps avoid an unwanted machine being thrown out. You might also have the opportunity to test it out in the seller's home to see how it feels.",
    "Alternatively, it's also possible to hire home treadmills if you don't want to splash a lot of cash at once. Search for fitness equipment rental companies in your area to see what's available for short or long-term loan."
  ],
  "headers": {
    "2": "Why it matters",
    "7": "What your treadmill needs",
    "13": "Brands to look out for",
    "19": "Alternatives to Prime Day deals"
  },
  "links": {
    "Starks Fitness": "http://starksfitness.co.uk/",
    "starksfitnessgym": "https://www.instagram.com/starksfitnessgym/",
    "NordicTrack": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1788886806507310000&xs=1&url=https%3A%2F%2Fwww.nordictrack.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-avoid-buying-a-bad-treadmill-on-amazon-prime-day",
    "ProForm": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1921443412295387100&xs=1&url=https%3A%2F%2Fwww.proform.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-avoid-buying-a-bad-treadmill-on-amazon-prime-day",
    "Life Fitness": "https://www.lifefitness.co.uk/en-gb",
    "Horizon Fitness": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8019153078334464000/https://www.horizonfitness.com/"
  }
}