{
  "source": "https://www.techradar.com/news/microsoft-edge-resurrects-this-classic-windows-game-when-your-internet-dies",
  "title": "Microsoft Edge resurrects this classic Windows game when your internet dies",
  "category": "computing",
  "updated": "2021-11-25T12:31:11Z",
  "author": "darren-allan",
  "summary": "Microsoft Edge surfing becomes skiing (while being chased by a yeti)",
  "article": [
    "Microsoft Edge’s mini-game which can be played as a diversion when the browser can’t get online has been given a snowy twist for winter, with the traditional ‘surf game’ being changed into a skiing challenge that’s a blast of nostalgia (we’ll come back to its origins later).",
    "If you aren’t familiar with the surf game, it’s basically Edge’s equivalent of the dinosaur game in Chrome – a mini-game for the browser which you can play when your internet is offline (or when you’re bored at any time, for that matter).",
    "Normally, the Edge game allows you to use the keyboard (or mouse, touchscreen, or controller) to guide a surfer down the screen, avoiding obstacles, hitting jumps, and sometimes being pursued by a deadly monster – the kraken.",
    "In the new skiing version for Edge 96, spotted by German tech site Deskmodder, the ocean is replaced by a snowy slope, and the kraken becomes a yeti (aka the abominable snowman).",
    "Otherwise, it remains essentially the same, offering a few different modes of play (endless, time trial, and zigzag which is a slalom) and being more fleshed out than Chrome Dino (which is a pure side-scroller with the only control being space to jump).",
    "If you want to play, simply open Edge and type in the following in the address bar:",
    "The surf game for Edge came out in May 2020 (with build 83) and is based on Microsoft’s aged classic SkiFree game that was released way back in 1991. So in actual fact, this new winter-inspired version is a return to the original format of a skiing game.",
    "It’s a fun distraction, for sure, and a more interesting game than Chrome Dino – plus also it’s less prone to giving us slight motion sickness, which the dinosaur game seems to do when it starts to speed up with ridiculously fast scrolling.",
    "Those keen to find more of these kinds of efforts to play should check out our roundup of the best free browser games.",
    "Via MS Power User"
  ],
  "headers": {
    "6": "Analysis: SkiFree returns after 30 years"
  },
  "links": {
    "Microsoft Edge’s": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "browser": "https://www.techradar.com/best/anonymous-browsing",
    "Deskmodder": "https://www.deskmodder.de/blog/2021/11/24/edge-surf-jetzt-mit-skipisten-und-einem-yeti/",
    "best free browser games": "https://www.techradar.com/best/best-free-web-browser-games-10-games-you-have-to-play",
    "MS Power User": "https://mspoweruser.com/microsoft-has-updated-the-edge-surf-game-with-yeti-and-more/"
  }
}