{
  "source": "https://www.techradar.com/news/new-samsung-qd-oled-tvs-could-finally-debut-at-ces-2022",
  "title": "New Samsung QD-OLED TVs could finally debut at CES 2022",
  "category": "televisions",
  "updated": "2021-11-18T10:37:46Z",
  "author": "rhys-wood",
  "summary": "Does Samsung have LG in its sights?",
  "article": [
    "Samsung finally plans to unveil its latest TVs fitted with new QD-OLED panels during CES 2022, according to new reports. This follows news from earlier this year that Samsung's QD-OLED hybrids could launch sometime in early 2022.",
    "As reported by OLED-Info, the initial reveal will consist of 55-inch and 65-inch variants, with a larger 70-inch screen being made available later in 2022. No word on price as of yet, but we should expect them to be as expensive as the very best 4K TVs out there right now.",
    "We first learned about Samsung's quantum OLED display tech all the way back in 2019, where QD-OLED panels were posited as the eventual successor to standard OLED displays. Now, it sounds like we'll witness the fruit of Samsung's labor for the first time at CES 2022.",
    "Since 2019, Samsung has invested upwards of $10 billion into its new QD-OLED tech, which covers research and development of the panels as well as their production lines. This investment plan is supposed to last up until 2025, so we can likely expect Samsung to support and grow its QD-OLED repertoire for some years to come.",
    "QD-OLED (or quantum OLED) will be Samsung's successor to its standard QLED displays. But what are they?",
    "In essence, QD-OLED will be a hybrid of OLED and QLED display tech, ideally offering the advantages of both – combining OLED's high contrast capability alongside QLED's penchant for color enhancement.",
    "It sounds very expensive, and we won't beat around the bush in saying Samsung's QD-OLED TVs probably will be. A report from Korea Economic Daily suggests that Samsung's new TVs will sit \"between its top-premium segment of Micro LED TVs and its flagship QLED lines.\"",
    "That would mean the company's QD-OLED TVs could be even more expensive than its 2021 flagship, the QN900A 8K TV, which retails for an eye-watering $4,999 / £5,999 / AU$7,579 for the 65-inch model. Basically, you shouldn't get your hopes up about purchasing a brand new QD-OLED TV unless you're a Samsung display enthusiast.",
    "That would be a bit of a shame, then, as QD-OLED tech sounds utterly marvellous. Combining the best of what both OLED and QLED displays can offer makes it sound like Samsung is creating the dream display. It's just unfortunate that, at least for the first few years on the market, they'll likely be largely inaccessible to the average buyer."
  ],
  "headers": {
    "4": "Analysis: What's the difference with QD-OLED?"
  },
  "links": {
    "QD-OLED": "https://www.techradar.com/news/the-end-of-oled-tvs-how-samsungs-qd-oled-hybrid-could-shake-up-the-market",
    "CES 2022": "https://www.techradar.com/news/ces-2022",
    "early 2022": "https://www.techradar.com/news/samsung-qd-oled-tvs-are-coming-next-year-say-insiders",
    "OLED-Info": "https://www.oled-info.com/samsung-electronics-unveil-its-first-qd-oled-tvs-ces-2022",
    "best 4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "back in 2019": "https://www.techradar.com/news/the-end-of-oled-tvs-how-samsungs-qd-oled-hybrid-could-shake-up-the-market",
    "upwards of $10 billion": "https://www.oled-info.com/samsung-display-formally-announces-its-108-billion-investment-qd-oled-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Korea Economic Daily": "https://www.kedglobal.com/newsView/ked202107250002",
    "Micro LED TVs": "https://www.techradar.com/news/micro-led-tv",
    "QN900A": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "8K TV": "https://www.techradar.com/best/best-8k-tv"
  }
}