{
  "source": "https://www.techradar.com/news/resident-evil-village-multiplayer-mode-has-been-delayed",
  "title": "Resident Evil Village multiplayer mode has been delayed",
  "category": "gaming",
  "updated": "2021-04-28T15:46:39Z",
  "author": "rhys-wood",
  "summary": "Multiplayer shenanigans delayed, but we’re still Village bound",
  "article": [
    "Resident Evil Village’s multiplayer companion, the oddly titled Resident Evil Re:Verse, has been delayed. The game will no longer release alongside Resident Evil Village on May 7, instead being pushed back to later in 2021, with no concrete date specified.",
    "Reported by Eurogamer, a look at Resident Evil Re:Verse’s website suggests that the multiplayer spin-off will still be free to players who purchase Resident Evil Village. The website posits a “Summer 2021” release window, so barring any further delays, we can expect to play Resident Evil Re:Verse between the months of June and August.",
    "If you’re not in the loop, Resident Evil Re:Verse is a multiplayer PVP shooter for up to six players that opts for the more traditional over-the-shoulder view of games like Resident Evil 2 Remake over the first-person Resident Evil Village. You’ll be able to take control of iconic series characters like Jill Valentine, Leon S. Kennedy, Claire Redfield and more, while also being able to transform into villainous bioweapons like Resident Evil 3’s Nemesis.",
    "While the reason for Resident Evil Re:Verse’s delay is unclear, there may be a number of reasons as to why Capcom made the decision. The developer could simply be taking some extra time to add polish to the game, or to prepare it for a reasonably long shelf life.",
    "Remember Resident Evil Resistance, the multiplayer component of the Resident Evil 3 remake? While fun, it didn’t maintain a sizable player base for very long. As such, Capcom could be looking into ways to avoid this with Resident Evil Re:Verse. Maybe a Battle Pass or progression system of some kind?",
    "Thankfully, Re:Verse’s delay has no bearing on the release of Resident Evil Village, which is still on track to launch on May 7, 2021. In the last Resident Evil showcase, Capcom announced that The Mercenaries extra mode would be returning in Resident Evil Village, which should hopefully tide over players looking for a more action-oriented experience until Re:Verse eventually releases later this year."
  ],
  "headers": {
    "3": "Re:Verse engineering"
  },
  "links": {
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-04-28-resident-evil-re-verse-delayed-to-summer-2021",
    "Resident Evil Re:Verse’s website": "https://www.residentevil.com/reverse/us/",
    "Resident Evil 2 Remake": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "Resident Evil 3": "https://www.techradar.com/reviews/resident-evil-3"
  }
}