{
  "source": "https://www.techradar.com/news/turbotax-maker-intuit-says-it-is-dropping-out-of-irs-free-file-program",
  "title": "TurboTax maker Intuit says it is dropping out of IRS Free File program",
  "category": "computing",
  "updated": "2021-07-19T17:30:16Z",
  "author": "anthony-spadafora",
  "summary": "Limitations of the program held Intuit back from innovating",
  "article": [
    "After almost 20 years, TurboTax maker Intuit has announced that it will no longer be participating in the IRS' Free File program that allows Americans to file their taxes for free.",
    "The IRS has been working with Intuit, H&R Block and a number of other tax software companies since 2001 on its Free File program that provides free online tax preparation and electronic filing services to individuals making under $72,000.",
    "However, in a new blog post, Intuit has said that it will be leaving the program once this tax season ends in October. The reason behind the company's decision is due to the limitations of the Free File program and conflicting demands from those outside of the program.",
    "Through its nearly 20 years of participation in the Free File program, Intuit has helped the IRS exceed its goal of increasing electronic filing to 80 percent and making free tax preparation available to 70 percent of tax filers in the US.",
    "Now though, the company has said that it is unable to continue participating in the program as doing so would prevent it from delivering all of the benefits that help its customers make more money, save more and invest for the future.",
    "Once its free from the limitations of the Free File program, Intuit plans to remove obstacles in tax preparation by importing data beyond the tax return, provide access to tax and finance experts for personalized support free of charge or at a portion of the cost elsewhere, use AI to proactively intervene when customers make mistakes or appear confused, direct deposit refunds into free, high yield accounts and extend free refund advances to its customers.",
    "Although Intuit is leaving the IRS' program, the company remains committed to free tax filing and will still offer similar services to its customers as it works to accelerate innovation to address all of their financial problems.",
    "Via Bloomberg"
  ],
  "headers": {
    "3": "Free File program"
  },
  "links": {
    "TurboTax": "https://www.techradar.com/reviews/intuit-turbotax",
    "Intuit": "https://www.techradar.com/news/intuit-takeover-of-credit-karma-probed-by-justice-department",
    "IRS": "https://www.techradar.com/how-to/irs-tax-tips-to-protect-you-from-becoming-a-victim-of-identity-theft",
    "tax software": "https://www.techradar.com/best/best-tax-software",
    "blog post": "https://www.intuit.com/blog/news-social/accelerating-technology-innovation-to-better-help-consumers-solve-their-most-pressing-financial-problems/",
    "electronic filing": "https://www.techradar.com/how-to/top-ways-to-safeguard-your-taxpayer-data",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "Bloomberg": "https://news.bloomberglaw.com/daily-tax-report/turbotax-maker-intuit-opts-out-of-irs-free-file-program"
  }
}