{
  "source": "https://www.techradar.com/news/uncharted-collection-on-pc-leak-just-killed-my-desire-to-get-a-ps5",
  "title": "Uncharted Collection on PC leak just killed my desire to get a PS5",
  "category": "computing",
  "updated": "2021-09-01T13:14:21Z",
  "author": "matt-hanson",
  "summary": "PC for the win (again)",
  "article": [
    "I’ve been seriously considering buying a PS5, but a new leak that suggests a huge Uncharted Collection could be coming to PC has effectively killed my desire to buy a new PlayStation.",
    "According to the leak, which was posted on the ResetEra forums, the Uncharted Collection will bundle five of the games on PC, and will be available on Steam and Epic Games Store.",
    "According to the leak, the collection will include the first game, Drakes Fortune, Uncharted 2: Among Thieves, Uncharted 3: Drakes Deception, Uncharted 4: A Thief's End, and Uncharted: The Lost Legacy.",
    "This is a hugely exciting leak, as I’ve been a massive fan of the Uncharted series since the first one on PS3, back in 2007. I’ve loved every game, with the second one being one of my all-time favorite games, and it’s meant that I’m pretty much always going to buy a PlayStation to play them.",
    "It’s almost inevitable that a new Uncharted will at some point turn up for the PS5, and that meant that I was sold on eventually buying one, despite mainly playing on PC.",
    "However, if the Uncharted Collection is coming to PC, it could mean that any future Uncharted games will also turn up on the platform, that means I’m now less interested in buying a PS5.",
    "If the Uncharted Collection for PC is real, and the leak is pretty convincing, then I’ll definitely be replaying them on PC, despite playing the games (and their remasters) multiple times on the PS3 and PS4. Seeing some of those set pieces powered by my RTX 3090-toting PC is extremely exciting.",
    "The leak may once have been thought of as highly unlikely, but Sony has recently been releasing many of its exclusives, such as Horizon Zero Dawn and Days Gone, on PC, albeit a few years after they debut on PlayStation.",
    "As Microsoft has found with its decision to publish its games on PC as well as Xbox (and which has meant I’ve no interest in buying an Xbox either), by putting games on PC, you’re getting your games in front of a much larger audience, even if it means there’s a slight hit to the amount of people buying your consoles.",
    "So, do I need a PS5 anymore? The reasons to get one are becoming rarer – after all, I’m lucky enough to have two killer gaming PCs that blow the PS5 and Xbox Series X out of the water when it comes to performance. With one of my PCs hooked up to my TV and used as a games console, it means I can play multiplatform games at their very highest graphical settings.",
    "And, if the next Uncharted, along with any other games Naughty Dog make, end up on PC, along with any Xbox exclusives I like the look of, such as Starfield, then the PC remains by far the best platform, for me at least.",
    "There are some caveats, however, that mean I may still crumble and buy a PS5 at some point. For a start, Sony exclusives that do come to PC, end up taking a good few years to arrive. If the next Uncharted looks phenomenal, I may just not be able to wait. On the other hand, my PC gaming backlog is so vast, I could happily play all the games I already own while I wait for it to arrive on PC, and probably at a much cheaper price than it would be selling for on PS5.",
    "There’s also the fact that while a growing number of Sony games are coming to PC, not all of them are. So, I may still need to invest in a PS5 if a killer app comes along.",
    "So, while this leak isn’t confirmed, I feel its likely enough to put my PS5 buying plans on hold (which to be fair they already were, considering how hard it is to buy the bloody thing).",
    "If it comes to pass, it’s another big win for PC gamers, and shows if you want the very best games, including ones from Sony and Microsoft, the PC is the best place to play. But, I knew that anyway.",
    "Via GamesRadar"
  ],
  "headers": {
    "6": "Game on",
    "9": "No need for a PS5?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "posted on the ResetEra forums": "https://www.resetera.com/threads/rumor-uncharted-collection-for-pc-leaked.480100/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Days Gone": "https://www.techradar.com/news/days-gone-is-coming-to-pc-and-more-playstation-exclusives-are-on-the-way",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "With one of my PCs hooked up to my TV and used as a games console": "https://www.techradar.com/news/i-couldnt-buy-a-ps5-so-i-built-my-own-console-and-lost-my-mind",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "GamesRadar": "https://www.gamesradar.com/uk/uncharted-collection-pc-leaks-and-includes-all-five-games/"
  }
}