{
  "source": "https://www.techradar.com/news/final-fantasy-7-remake-ps5-upgrade-brings-new-story-content-and-visual-upgrades",
  "title": "Final Fantasy 7 Remake PS5 upgrade brings new story content and visual upgrades",
  "category": "gaming",
  "updated": "2021-02-25T23:27:18Z",
  "author": "nick-pino",
  "summary": "Final Fantasy 7 Remake: Intergrade brings Yuffie into the fray on PS5",
  "article": [
    "At its February State of Play event, Sony announced a new chapter coming to Final Fantasy 7 Remake, called Intergrade, that’s set to release on June 10, 2021.",
    "Final Fantasy 7 Intergrade stars Yuffie, an optional playable character from Final Fantasy 7, around Midgar as she attempts to steal rare materia from Shinra Corp - the evil corporation Cloud and crew are also fighting against in the main plotline.",
    "Sony didn’t say how big of a content update Intergrade will be, but the trailer for the extra content said that it will bring a number of graphical enhancements like better reflective lighting and particle effects alongside faster loading times and a new photo mode.",
    "From the sound of this tweet, the extra content will only be available on PS5 for a yet-undisclosed price, but Sony says that gamers will be able to carry over their save data from PS4 to PS5 when the DLC comes out later this year. Naturally, gamers will be able to get a free upgrade to the PS5 version from the PS4 version as well.",
    "While fans are already chomping at the bit for the second part of Final Fantasy 7 Remake, Intergrade looks like it will act as a sort of filler episode to introduce a new character and enhancements, while the core team continues to work on the next chunk of the game.",
    "In some ways, it’s actually kind of fitting for Yuffie to be included in the Interlude chapter as it really harkens back to the character’s roots as an optional side character. That's good news is that gamers who don’t want to shell out extra for DLC won’t miss any major plot points while diehard fans can still get the full experience by forking over a bit more while they wait for the next game to be finished.",
    "That said, if Yuffie’s chapter is only available on the PS5 version of the game, that could be rough for PS4 owners who haven’t upgraded yet due to PS5 restock issues.",
    "As for when we’ll actually see Final Fantasy 7 Remake Part 2, it’s anyone’s guess at this point but with a number of delays hitting Sony’s first-party games right now, it wouldn’t be surprising if we had to wait until 2022 - or even 2023 - to see the final showdown between Cloud and Sephiroth."
  ],
  "headers": {
    "4": "Better than ‘Noffie’"
  },
  "links": {
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "tweet": "https://twitter.com/finalfantasyvii/status/1365067252865900544",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart"
  }
}