{
  "source": "https://www.techradar.com/news/how-to-watch-meghan-and-harrys-interview-on-oprah-stream-from-anywhere-today",
  "title": "How to watch Harry and Meghan interview on Oprah: stream free online from anywhere",
  "category": "audio-visual",
  "updated": "2021-03-11T07:57:17Z",
  "author": "james-laird",
  "summary": "Time to finally see what all the ruddy royal fuss is about?",
  "article": [
    "You can't avoid it and it won't ignore you. Prince Harry and Meghan Markle's interview with Oprah Winfrey won't be going away or out of the tabloid headlines any time soon - the renegade royal couple's bombshell TV appearance still all the world wants to talk about nearly one week on. Didn't catch it live? Read on as we explain how to watch the Harry and Meghan Oprah interview wherever you are today - including where you can stream it free online.",
    "We've been building towards this moment since November 2016, when Prince Harry issued a statement calling out the abuse, harassment and racially motivated smears his then-girlfriend had been subjected to on a daily basis by Britain's gutter media.",
    "The obvious comparison is to the ordeal faced by Princess Diana, Harry's mother, who lost her life in a car crash while attempting to flee from the paparazzi. What's especially controversial is much of the backbiting and anti-Meghan sentiment can allegedly be traced back to Kensington Palace, the home of the Duke and Duchess of Cambridge - who to put it mildly, are not on good terms with Harry and Meghan.",
    "The Buckingham Palace machine knew something big was coming and looked to get ahead of the game, renewing bullying claims against Meghan, Duchess of Sussex ahead of the regal TV tell-all. But now that the Oprah interview has aired complete with shocking allegations of its own, the two factions are embroiled in all-out warfare - much to the delight of gossip fans everywhere, of course!",
    "It's the TV event of the year and no subject is off-limits, so read on as we explain how to watch the Harry and Meghan interview on Oprah online - stream it FREE on-demand from all over the world right now.",
    "Below, you'll find details of how to watch Harry and Meghan's Oprah interview online FREE and on TV in a number of places around the world - including the US, Canada, UK, Australia and New Zealand.",
    "But unfortunately, if you try to watch your domestic coverage from somewhere outside your home country, you'll soon find a problem - geo-blocking. That's where the broadcaster prevents you from watching your usual feed from abroad. It's a common problem for streamers all over the world, but there's an easy solution."
  ],
  "headers": {
    "5": "How to watch Harry and Meghan Oprah interview from outside your country",
    "7": "How to watch the Harry and Meghan Oprah interview free online in New Zealand"
  },
  "links": {}
}