{
  "source": "https://www.techradar.com/news/having-trouble-getting-a-raspberry-pi-this-could-be-why",
  "title": "Having trouble getting a Raspberry Pi? This could be why",
  "category": "computing",
  "updated": "2021-08-23T13:42:58Z",
  "author": "sead-fadilpasic",
  "summary": "Chip shortage won't be over soon, Eben Upton belives",
  "article": [
    "The global hardware components shortage isn’t just plaguing the PC market (computers, business laptops, servers and more), but also the Raspberry Pi market, as well, its CEO has confirmed.",
    "Speaking to The Register, Raspberry Pi Foundation CEO Eben Upton revealed that he doesn’t expect the shortage to die down this year, with things starting to improve by Q1 2022, although no one expects major improvements before 2023.",
    "While the company managed to ship some 800,000 units per month earlier this year, by July 2021 this had fallen to 650,000, roughly 20% down.",
    "What’s more, getting your hands on a specific Pi model from a specific retailer could mean having to wait for as long as a year, Upton added.",
    "\"What's stopping us from flexing up is basically everything... everything is on fire. \"It's the motto of this year,\" he noted.",
    "Even though the Covid-19-induced chip shortage is to blame for most of these issues, it’s not the only “problem” - demand also spiked last year, Upton revealed.",
    "\"What's happened this year,\" he said, \"is the industrial side of the business has grown. I think, in the first six months, we did more compute modules than in the whole of last year.\"",
    "The chip supply shortage came as a result of a misjudgment from the retailer’s side. When the pandemic kicked off, and people withdrew to their homes, retailers expected the demand for hardware to drop, and started ordering less.",
    "Manufacturers were forced to produce less, partly due to shrinking demand, and partly due to having to re-arrange operations to maintain the health and safety of their workforce.",
    "But instead of the demand falling, it actually rose. Remote workers, needing to set up entirely new home offices, required new hardware. Furthermore, people needed new machines to entertain themselves while in lockdown.",
    "Now, almost two years into the pandemic, there’s a global shortage of hardware, with many retailers scrambling to meet the demand, while the prices of hardware continue to rise.",
    "It will take at least another half a year to return to pre-pandemic levels, many analysts believe.",
    "Via: The Register"
  ],
  "headers": {
    "7": "Chip shortage"
  },
  "links": {
    "business laptops": "https://www.techradar.com/news/best-business-laptops",
    "Raspberry Pi": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "The Register": "https://www.theregister.com/2021/08/20/raspberry_pi_supply_eben_upton_interview/"
  }
}