{
  "source": "https://www.techradar.com/news/classic-games-like-chess-and-sudoku-are-now-easier-to-play-on-iphones-and-ipads",
  "title": "Classic games like chess and Sudoku are now easier to play on iPhones and iPads",
  "category": "phones",
  "updated": "2021-04-03T08:37:47Z",
  "author": "tom-bedford",
  "summary": "They're now on Apple Arcade",
  "article": [
    "If you like using your iPhone or iPad as a digital way to play classic board, card and number games, you might be really pleased to hear that some of the stalwart titles are now much easier to play on those gadgets, thanks to changes in Apple Arcade.",
    "Apple Arcade is Apple's games subscription service, which offers nearly 200 different games you can download and play for a monthly fee, and its newest release expansion includes loads of classic games, which the service didn't have before.",
    "New games include backgammon, checkers, chess, two different solitaire games, two separate Sudoku apps, Mahjong, threes and a crossword collection, as well as quite a few other games.",
    "If these inspire you, there are a few other similar apps that might catch your interest too: there's Really Bad Chess, which takes the classic strategy game and introduces some bonkers new rules, Blek, an artistic puzzle game about drawing lines, and Mini Metro which is another puzzle game about drawing lines between houses and workplaces in an ever-growing city.",
    "Apple Arcade costs $4.99 / £4.99 / AU$7.99 per month which may seem a lot if you're only interested in the classic games - you probably already have a few boards and a deck of cards at home you can use. But Apple Arcade lets you play them on the go - and also offers a one-month free trial to test it, which jumps up to a three-month trial if you've recently bought an Apple device.",
    "We've written an Apple Arcade review which should help you understand the service more if you're interested. But remember if that price does seem steep, there are lots of equivalent apps for those games that aren't as good, but are free.",
    "Who knows, though, perhaps taking a few steps into Apple Arcade via its chess and Sudoku applications will help you take more steps into mobile gaming - you might find yourself playing the service's classics like Overland and Sayonara Wild Hearts very soon."
  ],
  "headers": {
    "3": "At the (Apple) arcade"
  },
  "links": {
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "newest release expansion includes loads of classic games": "https://www.techradar.com/news/apple-arcade-adds-30-new-games-including-fantasian-monument-valley-and-chess",
    "Apple Arcade review": "https://www.techradar.com/reviews/apple-arcade"
  }
}