{
  "source": "https://www.techradar.com/news/this-apple-watch-8-upgrade-may-make-you-want-to-skip-the-apple-watch-7",
  "title": "This Apple Watch 8 upgrade may make you want to skip the Apple Watch 7",
  "category": "phones",
  "updated": "2021-09-10T08:47:50Z",
  "author": "james-peckham",
  "summary": "Another rumor for temperature measurement",
  "article": [
    "The Apple Watch 7 and Apple Watch SE 2 may be set to debut alongside the iPhone 13 on September 14, but we've just heard a new rumor about what to expect from the 2022 smartwatch.",
    "According to analyst Ming-Chi Kuo, the Apple Watch 8 will come with new health management features, with the highlight being a body temperature sensor.",
    "This is something we've heard from other sources in the past, but Kuo's certainty - given that he's often accurate with these sort of stories - makes us believe this may be happening on the 2022 device.",
    "Previous patent documents have suggested Apple has been working on this as a project since 2019, or perhaps even earlier, with some of the patents showing this sensor measuring your temperature through skin contact.",
    "Whether this would be an element of the heart rate sensor on the rear of the watch, or somewhere else on the device you can touch is currently unclear. Other patents have suggested features that wouldn't need you to touch the device, but it's unclear how far this is through development.",
    "There's no guarantee that any of these body measurement features will be ready for the Apple Watch 8, but it may be something that you want to hold out for if the Apple Watch 7 reveal next week doesn't excite you.",
    "A body temperature monitor won't be useful to everyone, but there are a few use case scenarios that would make it a worthwhile upgrade from Apple.",
    "The big one for some right now is being able to monitor your body temperature as a symptom of whether you may have Covid-19. Body temperature is a gauge which you can use to see whether you may need to do a more official test for the virus.",
    "This may also help with a variety of illnesses in future, such as the common cold or the flu.",
    "It can also give you a sign of whether you're in a fit state to train, too. If you're feeling a touch under the weather, you would be able to monitor your body temperature to see whether it's a good idea to go out for that run or a swim.",
    "It's unlikely the body temperature measurement will be a must-have feature for most, but in some small scenarios this may be an upgrade that would make the Apple Watch one of the best ways to monitor your health.",
    "Via AppleInsider"
  ],
  "headers": {
    "6": "Analysis: why would this be useful?"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch SE 2": "https://www.techradar.com/news/apple-watch-se-2",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "other sources": "https://www.techradar.com/news/apple-watch-7-tipped-to-have-new-watch-faces-to-fit-its-larger-display",
    "AppleInsider": "https://appleinsider.com/articles/21/09/10/kuo-apple-watch-series-8-might-integrate-temperature-measurement-feature"
  }
}