{
  "source": "https://www.techradar.com/news/is-this-dollar219-mini-pc-microsoft-and-qualcomms-best-bet-for-beating-the-apple-m1-chip",
  "title": "Is this $219 mini PC Microsoft and Qualcomm's best bet for beating the Apple M1 chip?",
  "category": "computing",
  "updated": "2021-11-16T14:44:00Z",
  "author": "sead-fadilpasic",
  "summary": "Microsoft wants to bring in more devs for Arm-based Windows",
  "article": [
    "Microsoft is finally giving developers a chance to test out apps for Arm-based Windows with the announcement of a new, budget-friendly Snapdragon device.",
    "The company has listed a brand new Snapdragon-powered mini PC that targets programmers on its online store called the ECS Liva Mini Box QC710 Desktop which comes in a small form factor and costs just $219.",
    "The new release comes with 4GB of memory, 64GB of storage, one USB 2.0 Type-A, one USB 3.2 Gen 1 Type-A, one USB Type-C, an HDMI port, and a microSD card slot.",
    "Inside, there's is a Qualcomm Snapdragon 7c Compute SC7180 - the chip from the first generation of 7c’s, not to be confused with the second-gen that was announced earlier this year.",
    "As for the operating system, it ships with Windows 10 Home, 64-bit, although the media are claiming Windows 11 is listed on the product page, saying the device “appears to meet” the minimum requirements for the new OS.",
    "The goal of the device obviously isn’t to replace other, more popular (and more costly) Arm-based Windows devices, such as the Surface Pro X (which costs roughly $900), or to rival the likes of a Mac Mini. Instead, it seems Microsoft and Qualcomm are looking to get more developers on board with building Windows-on-Arm apps, and to that end have created a cheap but effective device to run tests on.",
    "Its small form factor also gives away its purpose - by being just 12x17x3 cm in dimensions, and weighing just over 200 grams, it’s a device that can easily fit in a pocket. Developers will be able to take it home from the office and back, quite easily.",
    "At the moment, there are only a few Arm-based devices running Windows, including the Duet 5 Chromebook and the Galaxy Book Go. However, many apps are still not compatible with the new infrastructure, which is why consumers are usually hesitant when buying.",
    "These are the best laptops for programming around today"
  ],
  "headers": {
    "3": "Snapdragon power",
    "5": "Enabling development"
  },
  "links": {
    "mini PC": "https://www.techradar.com/best/best-thin-client",
    "": "https://www.techradar.com/best/best-workstations",
    "Surface Pro X": "https://www.techradar.com/news/new-surface-pro-x-launch-date-specs-and-price-everything-we-know-so-far",
    "Windows": "https://www.techradar.com/news/best-business-laptops",
    "best laptops for programming": "https://www.techradar.com/news/best-laptop-for-programming"
  }
}