{
  "source": "https://www.techradar.com/news/samsung-s21-vs-iphone-12",
  "title": "Samsung Galaxy S21 vs iPhone 12: two great phones, but which is for you?",
  "category": "phones",
  "updated": "2021-06-16T11:42:35.936Z",
  "author": "james-rogerson",
  "summary": "Two top flagships from Apple and Samsung",
  "article": [
    "The iPhone 12’s biggest rival has finally arrived, in the form of the Samsung Galaxy S21 range, with the standard Samsung Galaxy S21 being the main Android competitor to the standard iPhone 12.",
    "While technically the standard iPhone 12 isn’t the most affordable option in the range (that’s the iPhone 12 mini), it is the clearest iOS alternative to the Galaxy S21.",
    "The iPhone 12 and the Samsung Galaxy S21 are similarly priced, have similar screen sizes, and similarly top-end power, among other things, but they also have a whole lot of differences beyond their operating systems. Choosing between them, then, isn’t as simple as choosing iOS or Android.",
    "But to make that choice clearer and a little simpler we’ve compared these two flagships across all the most important areas, from design and screen, to camera, battery life, specs, features and price, so you can make an informed decision about which – if either – to buy.",
    "At first glance the Samsung Galaxy S21 and iPhone 12 look to be similarly priced. After all, the Galaxy S21 starts at $799 / £769 / AU$1,249, while the iPhone 12 starts at $799 / £799 / AU$1,349.",
    "However, for that money you’re getting 128GB of storage with the Samsung Galaxy S21 but only 64GB with the iPhone 12. For a 128GB model of the iPhone 12 you’ll have to pay $849 / £849 / AU$1,429.",
    "So the Samsung Galaxy S21 is cheaper, and arguably the better value proposition, especially once you factor in its extra camera lens.",
    "As for availability, both phones are now on sale. The Galaxy S21 was revealed in January 2021, whereas the iPhone 12 was revealed in October 2020. Don't expect any truly significant price discounts until the iPhone 13 later this year or the Galaxy S22 in early 2022.",
    "The Samsung Galaxy S21 is a premium smartphone but it doesn’t have the most premium of builds. It’s clad in ‘Glasstic’, which is basically a fancy way of saying plastic that looks like glass.",
    "Still, it looks the part, and in our review we found that its matte finish left it feeling fairly premium too - if not quite a match for glass. There’s no real compromise on the front of the device though, where you have an all-screen design with a punch-hole selfie camera.",
    "The iPhone 12 meanwhile has a glass back, so it feels as expensive as it looks, but around the front there’s Apple’s typical large notch.",
    "As for the dimensions and weight, the Samsung Galaxy S21 comes in at 151.7 x 71.2 x 7.9mm and 172g, while the iPhone 12 is 146.7 x 71.5 x 7.4mm and 164g. So the two phones are similar in size and weight, but the iPhone 12 is marginally shorter, slimmer, and lighter – though it’s a touch wider.",
    "Color wise, you can get the Samsung Galaxy S21 in Phantom Gray, Phantom White, Phantom Violet, or Phantom Pink, some of which offer contrasting camera colors, while the iPhone 12 comes in black, white, red, green, or blue, and both phones are IP68 certified for water and dust resistance.",
    "The Samsung Galaxy S21 has a 6.2-inch 1080 x 2400 Dynamic AMOLED 2X display with a 120Hz refresh rate. The iPhone 12 on the other hand has a 6.1-inch 1170 x 2532 Super Retina XDR OLED screen with a 60Hz refresh rate.",
    "Looking beyond the marketing terms, these are both OLED screens, and both are very high quality – in our reviews we were impressed by both.",
    "We noted slight disappointment that at Full HD+ the S21's screen is notably a step down from the QHD+ of the Samsung Galaxy S20, but it’s still comparable to the iPhone 12, with that phone offering 460 pixels per inch, while the Samsung Galaxy S21 has 421.",
    "The Samsung Galaxy S21 has a slightly bigger screen than the iPhone 12, but the difference is marginal. The bigger difference is the refresh rate, which is twice as high on Samsung’s new phone, meaning interactions with the screen should feel smoother.",
    "Both phones also have a flat screen – if you’re looking for something curved in the Galaxy S21 range you’ll have to shell out for the Samsung Galaxy S21 Ultra.",
    "There’s a triple-lens camera on the back of the Samsung Galaxy S21, with a 12MP f/1.8 main camera, a 64MP f/2.0 telephoto one (with 3x optical zoom), and a 12MP f/2.2 ultra-wide. The main and telephoto snappers also have optical image stabilization (OIS).",
    "The iPhone 12 meanwhile has a dual-lens camera, with a 12MP f/1.6 main snapper and a 12MP f/2.4 ultra-wide. So it misses out on a telephoto camera, and only the main lens has OIS.",
    "That said, in our review we found that the cameras – while similar to the iPhone 11’s – performed well, even handling tricky low light scenes better than many rivals.",
    "The Samsung Galaxy S21 has a top camera as well though. This too is similar to its predecessor's, but in our review we were impressed with the zoom potential and the wealth of new modes on offer, such as Director's View, which lets you shoot with front and rear cameras at the same time. Those modes plus the extra lens means Samsung's camera should be a little more versatile.",
    "On the front, you get a 10MP f/2.2 camera on Samsung’s phone and a 12MP f/2.2 one on Apple’s. Again, both worked well in our tests.",
    "The Samsung Galaxy S21 has a much bigger battery than the iPhone 12, with the former coming in at 4,000mAh, while the latter is just 2,815mAh.",
    "You might think that would lead to much longer life from the Galaxy S21 than the iPhone 12, but in our tests we found that while you should generally get a day of life from either, you're unlikely to get much more. The 120Hz refresh rate on the Galaxy S21 has a noticeable detrimental effect on the battery, so that's a big part of why the extra size doesn't mean much extra life.",
    "Both phones support fast charging and wireless charging though, with the Samsung Galaxy S21 additionally offering Wireless Power Share, which lets you use the S21 as a wireless charging mat for other devices.",
    "It's worth noting though that neither of these phones come with a charger in the box.",
    "Both of these phones are packed full of power. In the case of the Samsung Galaxy S21 you get either a Snapdragon 888 chipset (in the US) or an Exynos 2100 (in the UK and most other regions). These are both the top of their respective ranges, and among the very best you’ll find in a phone. The Galaxy S21 also has 8GB of RAM, and a choice of 128GB or 256GB of storage.",
    "The iPhone 12 is similarly powerful, with a top-end A14 Bionic chipset, and a choice of 64GB, 128GB, or 256GB of storage. It only has 4GB of RAM, but that’s never held Apple’s phones back.",
    "In practice we found both phones were as fast as you'd hope, but on the more negative side notably neither of them has a microSD card slot - that's always the case in Apple phones, but Samsung's often do have one.",
    "Both phones also support 5G, but they have some different features. The most obvious and arguably biggest difference is the operating system, with the Galaxy S21 running Android 11, while the iPhone 12 runs iOS 14.",
    "However, they also have different security options – with the iPhone 12 the focus is on Face ID, while the Samsung Galaxy S21 has an in-screen fingerprint scanner. These both work well, though Samsung's in-screen solution isn't quite as speedy as a physical fingerprint scanner.",
    "The Galaxy S21 also has DeX mode. This is offered by a number of Samsung flagships and allows you to connect the phone up to an external screen and have it display a more desktop-like interface.",
    "The iPhone 12 meanwhile benefits from MagSafe, which allows you to magnetically attach accessories (such as cases, wallets, and wireless chargers) to the back of the phone.",
    "Beyond just attaching them though, the phone is also able to tell what you’ve connected to it via MagSafe. At the time of writing the types of available MagSafe accessories are limited, but the selection is likely to improve.",
    "The Samsung Galaxy S21 has more cameras than the iPhone 12, plus more RAM, a bigger battery, a slightly larger screen, a higher refresh rate, and more storage in the entry-level model.",
    "The iPhone 12 meanwhile only really has MagSafe and a glass back to help it stand out over the S21 in terms of back-of-the-box bullet points, but both phones are packed full of power, and have all-round impressive specs.",
    "Of course, specs don’t always tell the whole story, as evidenced by the fact that the iPhone 12 still has a great camera despite it just being dual-lens, and smooth performance despite just 4GB of RAM.",
    "So on paper the iPhone 12 might not quite seem a match for the Samsung Galaxy S21, but in practice our review found it to be an excellent phone. In fact, we gave it four stars - the same rating as we gave the Samsung Galaxy S21, so there's no clear winner, it's more a case of choosing which is right for you."
  ],
  "headers": {
    "4": "Samsung Galaxy S21 vs iPhone 12 price and availability",
    "8": "Design",
    "13": "Display",
    "18": "Camera",
    "23": "Battery life",
    "27": "Specs and features",
    "35": "Takeaway"
  },
  "links": {
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Android 11": "https://www.techradar.com/news/android-11",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "MagSafe accessories": "https://www.techradar.com/best/best-magsafe-accessories"
  }
}