{
  "source": "https://www.techradar.com/news/the-largest-cpu-in-the-world-just-got-a-massive-upgrade",
  "title": "The largest CPU in the world just got a massive upgrade",
  "category": "computing",
  "updated": "2021-04-21T17:56:29Z",
  "author": "mayank-sharma",
  "summary": "The world’s largest CPU makes good use of the TSMC 7nm process",
  "article": [
    "Two years after Cerebras Systems unveiled the world’s largest computer chip, the company has launched a monstrous successor.",
    "Back in 2019, the Wafer Scale Engine (WSE) launched as a new type of processor optimized for AI and deep learning workloads and towered over its peers by packing a staggering 1.2 trillion transistors.",
    "Fast forward a couple of years, and the company has taken the cover off the WSE 2, which more than doubles all the specs of its predecessor.",
    "Built on the TSMC 7nm process, the WSE2 houses a staggering 2.6 trillion transistors. To put that into perspective, the Nvidia A100, the world’s largest graphics processing unit (GPU), has 54 billion transistors.",
    "Thanks to the miniaturization possible with the 7nm process, the new gigantor of a chip offers 850,000 AI cores spread over 46,225 mm(2) of silicon.",
    "Continuing its list of preposterous specs, the WSE2 sports 40GB of on-chip SRAM memory, 20 petabytes of memory bandwidth, and 220 petabits of aggregate fabric bandwidth.",
    "Cerebras also revealed the chip consumes the same 15kW of power as its predecessor, but provides twice the performance, again thanks mostly due to the new 7nm process.",
    "The WSE2 is intended to replace clusters of server racks, saving space and electricity costs. The firm will offer the chip, in the same fashion as its predecessor, in a 15RU 26-inch tall unit with built in liquid cooling.",
    "There’s currently no pricing information available for the WSE2 or the 15RU racks, but you can expect a price tag that matches its eye-popping specs.",
    "Via AnandTech"
  ],
  "headers": {
    "4": "Double everything"
  },
  "links": {
    "world’s largest computer chip": "https://www.techradar.com/news/worlds-largest-computer-chip-revealed",
    "Nvidia A100": "https://www.techradar.com/news/nvidia-shows-off-the-first-a100-gpu-systems-built-to-handle-ai-workloads",
    "AnandTech": "https://www.anandtech.com/show/16626/cerebras-unveils-wafer-scale-engine-two-wse2-26-trillion-transistors-100-yield"
  }
}