{
  "source": "https://www.techradar.com/news/its-really-dumb-to-pirate-the-latest-james-bond-film-heres-why",
  "title": "It’s really dumb to pirate the latest James Bond film - here’s why",
  "category": "computing",
  "updated": "2021-10-02T12:07:26Z",
  "author": "joel-khalili",
  "summary": "It’s (absolutely not) Bond, James Bond",
  "article": [
    "Cybersecurity researchers have uncovered a new wave of online scams designed to entrap people looking to watch the latest James Bond film, No Time To Die.",
    "Released on Thursday, the new Bond flick has garnered plenty of attention in the press and on social media, creating an opening for cybercriminal actors.",
    "According to analysis from security firm Kaspersky, threat actors are capitalizing on the excitement surrounding the film to spread malware and steal personal data that could be used to hijack online accounts.",
    "The company identified numerous malicious download links for the new film, which conceal a variety of types of malware, including adware, trojans, password stealers and ransomware.",
    "On other websites, meanwhile, visitors are allowed to watch the first few minutes of the film, but are then asked to enter personal information and credit card details. This data is then used to debit the victim’s bank account.",
    "It is a common tactic among cybercriminals to latch onto the latest trend or event to draw people into making mistakes. In the same way as uncertainty surrounding the pandemic was exploited, for example, hackers are using the appetite for the latest Bond film to infect devices and steal sensitive data.",
    "“Various sources of entertainment, including movies, have always been an attractive lure for cybercriminals to spread threats and phishing pages,” explained Tatyana Scherbakova, Security Expert at Kaspersky.",
    "“Inevitably, such a long-awaited premiere as No Time To Die causes a stir. The audience is in a hurry to see the movie, causing them to forget about internet security.”",
    "To shield against scams of this kind, Kaspersky says web users should avoid sites promising early viewings of films or TV series, check the authenticity of a website before entering personal details and pay close attention to the type of files they are downloading (for example, a video file will never finish with “.exe”).",
    "For an additional layer of protection, meanwhile, the company advises users to shield their devices with a leading antivirus product."
  ],
  "headers": {
    "5": "The Spy Who Phished Me"
  },
  "links": {
    "No Time To Die": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "password": "https://www.techradar.com/best/password-manager",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "antivirus": "https://www.techradar.com/best/best-antivirus"
  }
}