{
  "source": "https://www.techradar.com/news/oculus-quest-2-is-getting-ar-but-could-the-quest-3-take-it-further",
  "title": "Oculus Quest 2 is getting AR – but could the Quest 3 take it further?",
  "category": "vr",
  "updated": "2021-08-09T14:32:10Z",
  "author": "henry-st-leger",
  "summary": "We speak to AR experts about the future of the Oculus Quest",
  "article": [
    "Oculus is getting into AR, and it has big repercussions for the future direction of the company and its popular line of VR headsets – especially the eventual Oculus Quest 3.",
    "The Facebook-owned company recently announced its intention to open up its Oculus platform to augmented reality developers, allowing them to use the Oculus Quest 2 headset to host AR games and apps rather than simply VR titles – setting the scene for an explosion of both consumer and business applications on the popular standalone headset.",
    "The introduction of AR in a VR headset may be confusing at first glance, especially because of how distinct AR and VR hardware has traditionally been.",
    "While VR headsets require extensive visors that cover our field of vision and immerse us in a different reality, AR products tend to take the form of smart glasses like the Google Glass or Microsoft Hololens, which overlay our surroundings with computer-generated images – in what tends to be a very limited field of view.",
    "But Facebook is angling to utilise its existing VR hardware – and existing install base – to position itself as a purveyor of AR goods too, and it might be the breakthrough move AR needs to make it to the mainstream. Rather than having to build up separate interest in AR technology, Facebook can funnel these applications directly to current VR enthusiasts, and test the waters for more AR investment down the line.",
    "What makes this possible is the series of four built-in cameras in the exterior of the Quest 2’s casing. These cameras can essentially record the wearer’s surroundings and show the feed on the display inside the headset, allowing anyone to look outside, as if through a window.",
    "It’s ostensibly a safety precaution – so you can see who or what you’re walking into – but there are clearly further applications for these camera capabilities, as shown by Facebook’s foray into AR. It’s very early days, of course, and without any AR apps on the platform as yet, it’s mainly an invitation to developers to start working on ideas. The benefits for everyday consumers are also likely a way off.",
    "However, this one announcement could also have huge repercussions for the direction of the Oculus line of VR headsets, too, especially with the spectre of an Oculus Quest 3 or Quest Pro on the horizon. Here’s why.",
    "We spoke to Peter Maddalena, director of VRCraftworks, an agency that creates VR, AR, and mixed-reality experiences for brands around the world – and has its roots in the same online VR community that saw Palmer Luckey birth the very first Oculus headset prototype.",
    "Maddalena says the introduction of AR capabilities into the Oculus headset manages to sidestep the usual “limitation of AR spectacles”, which is the narrow field of vision they usually provide. The wide visor-like display found in a VR headset vastly expands the field of view and the reach of any augmented reality objects.",
    "“All of a sudden, instead of having that small screen, you have the whole field of view, which gives you more opportunity to actually place objects of interest around that space,” Maddalena says.",
    "However, Maddalena admits that the current iterations of the Oculus Quest headsets aren’t perfect carriers of AR either. “The pressure on wearables is to become lighter, thinner, more like glasses,” even as VR headsets remain relatively hefty. Using an immersive headset to record and display your surroundings is a smart workaround, but it will no doubt remain a semi-isolating experience for now.",
    "The Quest 2’s four-camera setup is pretty advanced compared to other commercial headsets on the market, but these cameras are still in black and white, meaning that, even if AR objects are presented in color, they’ll be against a monochrome background of the wearer’s surroundings. We’re told by Maddalena, though, that “what people don’t realise is that there’s a whole lot of AI that allows you to turn black and white images into color images… so perhaps this is a stepping stone, until the Quest comes out with color cameras.”",
    "These cameras don’t line up with your eyes, either, meaning you’re getting a video feed from some unintuitive angles, which means your sense of depth perception likely won’t be as seamless with a passthrough feed as it would be with, well, your actual vision.",
    "Of course, giving AR tools to developers is still a long way from launching their early efforts, and it may be some time before Oculus has an AR library actually worth dipping into. ”It’s not what I would call a killer feature,” Maddalena says, “because killer features are based on content.”",
    "Of course, this early in the days of Oculus’ AR efforts, the real enhancements are likely to come with later, more advanced hardware – more custom-built for the needs and requirements of AR.",
    "Smaller hardware and higher resolution screens will only help; after all, while computer-generated images can still look quite good on a low-res screen (hello Nintendo Switch), real-life images and objects can quickly look a bit pixelated, and not as we expect to perceive them. More advanced cameras that can capture color will be necessary to do this well, and that’s something we can only hope to get in an Oculus Quest 3 or Quest Pro too.",
    "Leo Gebbie, a technology analyst at CCS Insight, tells us that “headsets which can seamlessly blend the real and digital worlds [...] require a strong baseline of technical specs – including a very high resolution display, and powerful external cameras – in order to deliver a compelling experience. This is where I’d suggest that we’re still some way away from AR passthrough on consumer VR devices being a good idea in practice.”",
    "The main thing for Facebook to do at this point is to get in early, and establish itself as the best site for burgeoning AR development – though it doesn’t need to do this for consumers. Oculus headsets are still being sold on their capability to deliver VR experiences alone, and by the time AR applications catch up, there’ll be a huge install base ready to start trying them out with their Quest hardware.",
    "We’re sure Oculus will be keen to avoid recreating the failed launch of the Magic Leap One, a consumer AR headset with a sleek design and sky-high price tag that, despite an initial wave of hype, simply didn’t resonate with everyday consumers – without the audience to attract developers, or the content to attract an audience in the first place. The moderately-priced Quest 2, though, already has a user base to start with, vastly lowering the risk of its (and developers’) AR investments.",
    "“Developers will want to reach the Oculus installed user base and using Facebook’s devices will be the best way to do this,” Gebbie says.",
    "In April 2021 we heard from Facebook exec Andrew Bosworth about a new Quest iteration being in developmen,, though ostensibly a “Quest Pro” rather than a third instalment, suggesting a higher-spec model designed to sit alongside the less powerful Quest 2. “There isn’t a Quest 3, there’s only a Quest 2,” said Bosworth, adding that “we want to introduce new functionality to the headset [...] and that’s a little way off still.”",
    "With the Quest 2 selling relatively well, there doesn’t seem to be an appetite to replace it right away, then, and this push into AR will no doubt see the Quest 2 become a proving ground for budding AR developers hoping to make or port Oculus’ first big augmented reality hit. Once those teeth are cut, though, it’ll turn to a successor or more powerful model to fulfil AR’s potential on the Oculus platform.",
    "Maddalena tells us that he’s “always found [the Quest 2] powerful enough,” but future iterations are only going to improve the scale and scope of what VR and AR developers can do. “I just look forward to being able to do more, more fancy lighting techniques and more interesting content, not necessarily having to worry about reducing the number of shadows or how to keep the frame rate up.”",
    "Everyone we spoke to was confident in saying that Oculus’ competitors were likely to follow suit, using the passthrough camera tech in the HTC Vive Pro, or HP Reverb G2, to start testing out AR applications – with a future of more fluid, capable devices in store that can dip in and out of different mixed reality experiences with ease. Given the Vive Pro only features two cameras though, this seems like yet another chance for Oculus to gain the upper hand against its competitor.",
    "As Gebbie puts it, “in the longer term, I’m certain we’ll start to see mixed reality products which totally blur the boundaries between VR and AR, demonstrating the power of the entire XR spectrum in one device.”",
    "However, we’re still some way off the logistical ease needed to make VR and AR headsets as commonplace as, say, the smartphone.",
    "Faisal Galaria, CEO of Blippar – an AR technology company that creates bespoke AR experiences – predicts that we’ll need headsets, “both AR and VR, to slim down so they become a natural and everyday accessory. This is when AR will become ubiquitous [...] VR headsets are still limited by portability and mobility, and not something you’ll expect to see in everyday life for some years to come.”",
    "Oculus is also now a subsidiary of Facebook, and it’s impossible to separate the strategies of both companies entirely. Galaria suggests the hypothetical Oculus Pro will also “give users wider access to self-generated content, rather than consuming content provided to them” – following the user-led content strategy of social media platforms like Facebook and Instagram (the latter also being owned by the former). New Oculus users need a Facebook account, after all, while older ones will need to link one by 2023.",
    "Galaria tells us that “Oculus also has a captive audience in place that is signed up with a Facebook account, giving Facebook the ability to analyse users and their activities and direct personalised content their way, which really opens up potential possibilities for refined, immersive, personalised AR experiences (and possibly advertising).”",
    "So the key here may not just be the work of developers’ but the engagement of users in ensuring Oculus’ AR platform is full of content you won’t get anywhere else. Less Oculus 3, more Oculus Me."
  ],
  "headers": {
    "8": "Seeing in color",
    "15": "Augmented, or pixelated?",
    "21": "The spectre of Quest 3",
    "26": "Consumers will play a key role"
  },
  "links": {
    "VR headsets": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review",
    "Microsoft Hololens": "https://www.techradar.com/reviews/wearables/microsoft-hololens-1281834/review",
    "VRCraftworks": "https://www.vrcraftworks.com/",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "CCS Insight": "https://www.ccsinsight.com/",
    "we heard from Facebook exec Andrew Bosworth about a new Quest iteration being in developmen": "https://www.techradar.com/news/oculus-quest-pro-will-arrive-long-before-any-oculus-quest-3-vr-headset",
    "HTC Vive Pro": "https://www.techradar.com/reviews/htc-vive-pro",
    "HP Reverb G2": "https://www.techradar.com/reviews/hp-reverb-g2",
    "Blippar": "https://www.blippar.com/",
    "New Oculus users need a Facebook account": "https://www.techradar.com/news/oculus-will-require-new-users-to-use-facebook-logins-starting-in-october"
  }
}