{
  "source": "https://www.techradar.com/news/apple-watch-7-vs-samsung-galaxy-watch-4",
  "title": "Apple Watch 7 vs Samsung Galaxy Watch 4: which is the best smartwatch?",
  "category": "wearables",
  "updated": "2021-09-15T10:03:56Z",
  "author": "carrie-marshall",
  "summary": "Which smartwatch deserves a place on your wrist in 2021?",
  "article": [
    "It’s that time of year again: endless speculation, renders and rumors before Apple finally drops a brand new Apple Watch.",
    "This year’s Apple Watch Series 7 isn’t a huge upgrade over the Apple Watch Series 6, but there are some important improvements – not least a bigger display and tougher crystal.",
    "It's important to note that Samsung's watch only works with Android handsets, while Apple's is just exclusive to iPhone models. This will likely have made your decision for you.",
    "So how does the Apple Watch 7 compare with Samsung’s flagship, the Samsung Galaxy Watch 4? Let’s take a look.",
    "There are two Galaxy Watch 4 models, the Galaxy Watch 4 and the Galaxy Watch 4 Classic. The non-Classic one is smaller, lighter and has a capacitive touch-sensing band rather than the rotating bezel of the Classic. We’ll focus on the standard Watch 4 here.",
    "We think the Galaxy Watch 4 is a very good-looking device, and the streamlined Armour Aluminum frame is particularly good looking in Pink Gold, although unfortunately that option isn’t available in the 44mm model. Like the Apple Watch you have a choice of sizes – 40mm and 44mm here – and colors: Black and Silver in any size, Green in 44mm only and Pink Gold in the 40mm.",
    "There’s a decent selection of bands too, including Hybrid Leather and Sport options. The Super AMOLED screen is 1.4” in the 44mm and 1.19” in the 40mm. The Samsung is IP68 rated for water and dust resistance.",
    "Rumors suggested a radical redesign for the Apple Watch Series 7 but this is an evolution, not a revolution: thinner borders make for a bigger screen without a noticeably bigger case (the Series 7 is 1mm bigger than the Series 6 and compatible with existing Apple Watch straps and bands), and the crystal cover has been redesigned to make it stronger.",
    "It now has IP6X dust resistance as well as WR50 water resistance.",
    "The display is 20% bigger than before (and 50% bigger than a Series 3) and enables you to view more data and have more on-screen complications. There are new colors too: midnight, starlight, green, blue and PRODUCT(RED) for the aluminum models. Stainless steel models come in silver, graphite or gold, and titanium is available in natural and space black. There are also new Nike sport and Hermes bands.",
    "The unique selling point of the Samsung Galaxy Watch 4 is its bioelectrical impedance sensor (BIA), which can provide data on your body composition in much the same way as the body fat monitors in electrical scales. The BIA sits alongside an optical heart rate sensor and an ECG in what Samsung calls the BioActive sensor, and it can tell you your water percentage, metabolic rate and body fat percentage.",
    "That’s useful because weight is a poor guide for fitness and health: muscle weighs more than fat. There’s sleep tracking with snoring detection and overnight blood oxygen monitoring, and in some markets the Watch can also track your blood pressure.",
    "The use of Google’s Wear OS means that more Google apps and services are available, such as YouTube Music (including offline mode), Google Maps and Google Pay. Wear has a much bigger library than Tizen, Samsung’s own previous OS, so that’s good news. Google Assistant hasn’t made it across yet – for now you’re stuck with Bixby – but Samsung promises an update soon.",
    "There are no new sensors in the Apple Watch Series 7, which retains the ECG and blood oxygen sensors of the Series 6. Fall detection now works for cyclists, and there are improved algorithms for biking and e-biking. There are some new watch faces and a full keyboard that you can use with typing or swiping. Machine learning will try to guess your intent to make text input faster.",
    "The Samsung Galaxy Watch 4 is powered by Google’s own WearOS and runs Samsung’s One UI 3 with an impressive range of attractive watch faces. There’s 16GB of internal storage, 1.5GB of RAM and a dual-core Exynos W920 chipset, which promises to be 20% faster than its predecessor.",
    "There’s a dedicated low-power display processor to keep the main processor offline when it isn’t required, resulting in battery life that easily runs for 24 hours of normal use. Wi-Fi here is dual band to 802.11n and there’s also NFC.",
    "It’s important to note that unlike other Wear watches, the Galaxy Watch 4 can’t be paired with an iPhone and some key features, such as the ECG, only work if your Android phone is a Samsung. You’ll also need to use the Galaxy Wearable app, not the standard Wear OS one.",
    "Apple’s focus this time around appears to have been on energy efficiency, so that bigger screen doesn’t mean less battery life: expect the same 18 hours as before. The Series 7 charges more quickly, though – 33% faster – thanks to its new USB-C charger, and Apple says that 8 minutes on charge is good for 8 hours of sleep tracking. It hasn’t published details of the processor, RAM or storage so we’re assuming the spec is similar or identical to the Series 6.",
    "As ever, the Apple Watch runs Apple’s own watchOS: version 8 this time. It’s a mature and user friendly operating system now with a decent collection of apps, including many Google ones as well as Apple’s own options and third party apps.",
    "The Galaxy Watch 7 is £249 / $249.99 for the 40mm model and £269 / $279.99 for the 44mm. Add £40 / $50 plus a data contract if you want the LTE version, which can use the mobile data network as well as Wi-Fi.",
    "The Apple Watch Series 7 starts at £379 / $399 for the standard model and $499 for the cellular option, which also requires a data plan. We've yet to find out prices for other regions, and we don't yet know when the Apple Watch 7 will go on sale.",
    "Chances are you’ve probably picked a side already: if you’re an iPhone user you probably won’t want a Galaxy Watch 4 (which won’t talk to your phone) and if you’re on Android then the Apple Watch won’t be for you either.",
    "But it’s interesting to compare the different ways in which the two tech titans have approached their latest wearables: while on the surface both firms appear to have tweaked their existing products, Samsung has jettisoned its entire OS in favor of going back to Google power.",
    "What you gain in apps, you lose in compatibility: where the Apple Watch gives you the same experience with any iPhone, Samsung doesn’t extend the full Galaxy Watch experience to every Android phone."
  ],
  "headers": {
    "4": "Apple Watch 7 vs Samsung Galaxy Watch 4: design and display",
    "10": "Apple Watch 7 vs Samsung Galaxy Watch 4: fitness and features",
    "14": "Apple Watch 7 vs Samsung Galaxy Watch 4: OS, power and battery",
    "19": "Apple Watch 7 vs Samsung Galaxy Watch 4: price",
    "21": "Takeaway"
  },
  "links": {
    "Apple Watch Series 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch Series 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review"
  }
}