{
  "source": "https://www.techradar.com/news/thermaltake-introduces-argent-series-and-divider-series",
  "title": "Thermaltake Introduces ARGENT Series & Divider Series",
  "category": "gaming",
  "updated": "2021-01-12T00:44:55Z",
  "author": "sponsored",
  "summary": "Cases, cooling & gaming gear kick off the line up for 2021",
  "article": [
    "Thermaltake is jumping into 2021 with new cases, cooling, gaming gear and more. Today we are kicking things off with the NEW Divider Series Gaming PC Line up and we have the Divider 300TG here to showcase.",
    "The Divider Series offers a range from M-ATX to ATX form factors, divided by 3mm tempered glass panels to offer a custom split difference for your next PC build. Built-in triangular side panels include side venting to improve airflow. Patented rotational PCIE expansion slots provide secure options for vertical GPU mounting or direct to MB with a variety of GPU length support across the series.",
    "Launching with the Divider 300TG available in the USA Mid-January with the other models going forward into 2021. The Divider 300TG is a mid-tower chassis that supports ATX form factor motherboards and is available in black and white color options.",
    "The Divider 300TG supports up to 360mm GPU lengths with a radiator mounted in the front with additional side radiator mounting support for more cooling or even larger GPUs while keeping your fans in the front. Take a look at this RTX 3090 card comfortably sitting with a radiator mounted on the side in the 300TG case.",
    "Top-mounted ports also include a USB 3.2 (gen2) Type-C port, with USB 3.0 ports and HD audio plugs for quick and easy access.",
    "Thermaltake told us there is both a standard Divider 300TG and a Divider 300TG ARGB coming from at different price points in 2 different colors. The ARGB Edition includes (3) 120mm ARGB PWM fans to easily sync up with ASUS Aura, ASROCK Polychrome, BIOSTAR RGB, GIGABYTE RGB Fusion 2.0, and MSI Mystic Light through the included ARGB controller, which will allow you to add even more ARGB, all controlled through one software.",
    "Filters are included around the case to help manage dust and can easily be removed for cleaning. Built-in full-length PSU cover allows you to easily manage power cables and keep them out of sight. The side-mounted radiator location also doubles for mounting HDD/SSD drives, with additional drive mounts directly behind the motherboard for even more storage.",
    "The Divider 300TG will start at $79.99 to $114.99 MSRP depending on the configuration and will start shipping mid-January in the USA.",
    "To learn more about the DIVIDER series, visit Thermaltake website, https://www.thermaltakeusa.com/",
    "We also got some new gaming gear from Thermaltake as well to look at. This all-inclusive gaming ecosystem, the ARGENT Gaming Peripherals, which will include the ARGENT K5 RGB Mechanical Gaming Keyboard, ARGENT M5 RGB Gaming Mice, ARGENT H5 RGB 7.1 Headset, ARGENT HS1 RGB Headset Stand, ARGENT Gaming Desk, ARGENT Gaming Chair, ARGENT MP1 RGB Mouse Pad, and ARGENT MB1 Mouse Bungee.",
    "The ARGENT K5 RGB Mechanical Gaming Keyboard utilizes a silver aluminum faceplate",
    "with an understated aesthetic incorporating a floating keycap design, offering excellent",
    "dust extraction and water-resistance. With 16.8 million RGB color illumination and 13",
    "dynamic lighting patterns, you can create stunning RGB illumination for your particular style. Full compatibility with TT RGB PLUS products for RGB illumination, syncing with other TT RGB products.",
    "The keyboard utilizes Cherry MX Speed Silver and MX Blue series switches. It also comes with eight additional keycaps (Q, W, E, R, A, S, D, F) and keycap puller allowing you to customize your keyboard. It’s got dedicated multimedia keys and a detachable leather wrist pad as well, which is wrapped up in synthetic leather, giving you extra ergonomics for long gaming sessions.",
    "ARGENT M5 RGB Gaming Mouse will be available in wired and wireless options. To ensure a stable wireless signal within a 10-meter range, the mouse utilizes a 2.4ghz wireless and Bluetooth 5.0 connection as well as USB direct connectivity, which gives a faster polling rate under 1ms and excellent battery life.",
    "The mouse has been designed for both right and left-handed users and provides on-the-fly DPI adjustments with six selectable default options from 100 to 16000 DPI, all while gaming.",
    "The mouse is built with world-class OMRON switches for supreme reliability and rated up to 50 million clicks. ARM-based 32-bit microcontroller and a 64Kb flash memory provide excellent agility and a super-fast response time. The mouse offers 16.8 million RGB color illumination across two separated lighting zones allows users to customize the dynamic lighting effects using the TT iTAKE software. ARGENT M5 RGB lighting can be fully synchronized with TT RGB PLUS and compatible products, including the Razer Chroma ecosystem.",
    "The ARGENT M5 RGB Mechanical Gaming Keyboard and ARGENT M5 RGB Gaming Mouse will be available from major retailers starting Q1, with the rest to be unveiled in later 2021.",
    "CEO of Thermaltake, Kenny Lin stated:",
    "“ARGENT is a concept about creating a gaming ecosystem, the hardware, software, and even the illumination, can evolve to a state-of-the-art level. A truly immersive gaming enjoyment!”",
    "ARGENT’s goal is to give gamers a single gaming ecosystem that provides everyone with a better experience, overall.",
    "Keep an eye out at your favorite retailer to scoop some new gear from Thermaltake very soon!"
  ],
  "headers": {
    "2": "New Thermaltake Divider 300TG",
    "9": "New ARGENT Gaming Peripherals"
  },
  "links": {
    "https://www.thermaltakeusa.com/": "https://www.thermaltakeusa.com/"
  }
}