{
  "source": "https://www.techradar.com/news/amazon-echo-show-update-is-putting-alexa-skills-front-and-center",
  "title": "Amazon Echo Show update is putting Alexa skills front and center",
  "category": "smart-home",
  "updated": "2021-07-22T12:50:18Z",
  "author": "rhys-wood",
  "summary": "Alexa skills to receive a big Echo Show update",
  "article": [
    "Amazon Echo Show owners will soon see their smart devices be more closely integrated with Alexa skills, a long-running feature of the voice assistant that adds a host of supplementary applications and uses to Alexa's repertoire.",
    "On the Echo Show, certain skills can be displayed on the home screen based on your preferences and voice command trends. As reported by The Verge, Amazon is now opening the floodgates on Alexa skills, making the feature more widely available to third party developers.",
    "VP of Amazon Alexa Skills Aaron Rubenson contextualized the skills update, stating: “It’s open to everybody to raise their hand and say they want to be part of it. We’re letting developers raise their hand and say, ‘My skill can handle that request.’”",
    "Featured Alexa skill cards from third parties will soon be the norm on Echo devices, then, and it sounds like the skills that show up on your Echo Show screen will be determined by your voice command habits and preferences. For instance, if you ask your Alexa about recipes often, a featured third party skill card for a digital cookbook might show up.",
    "Furthermore, Alexa skill developers will soon be allowed to sell products within their skill apps, so long as the products are available to buy on the Amazon website. Amazon’s last introduction to the skills family will be paid skills, which are locked behind a paywall before the user can utilize them, much similar to paid apps on Google Play or Apple’s App Store.",
    "We see featured skill cards on Amazon Echo devices potentially being something of a double-edged sword. We actually really like the ‘we have a skill for that’ mentality, and it could introduce users to services they’d never have considered before. The potential for discoverability with skill cards is high, and it would be great to see smaller third-party developers hit their stride with a skill app that takes Echo users by storm.",
    "On the other hand, featured skill cards might sound gravely familiar to anyone who’s used the internet for more than five seconds – as they sound a whole lot like targeted ads.",
    "Services like Google AdSense are able to so accurately tailor online advertisements to our individual preferences, and it’s possible that Amazon’s featured skill cards could use similar technology.",
    "We’re also wondering how intrusive featured skill cards will be. Will they genuinely offer users unique solutions to their queries, or will they just be a fancy way to advertise Domino’s Pizza deals?",
    "We’re cautiously looking forward to seeing how these Alexa skill cards evolve as Amazon makes the service more readily available to third-party developers. It could either be a revelation of convenience for smart home enthusiasts, or potentially just a hindrance that acts as a middleman between our voice commands and assistants."
  ],
  "headers": {
    "5": "Analysis: Will featured skills help or hinder?"
  },
  "links": {
    "Amazon Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-8-2nd-gen",
    "Alexa skills": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "The Verge": "https://www.theverge.com/2021/7/21/22586033/amazon-alexa-widgets-featured-skill-api-developers-echo-show-screen",
    "Google Play": "https://www.techradar.com/news/phone-and-communications/mobile-phones/what-is-google-play-1073348"
  }
}