{
  "source": "https://www.techradar.com/news/the-time-has-come-for-new-bubbles-in-latest-whatsapp-beta-update",
  "title": "The time has come for new bubbles in latest WhatsApp beta update",
  "category": "computing",
  "updated": "2021-09-07T10:43:14Z",
  "author": "daryl-baxter",
  "summary": "A bubbling redesign in testing",
  "article": [
    "While we see updates continue to be refined for Android and iOS from Google and Apple, WhatsApp is still keeping up with the race as it introduces redesigned chat bubbles, currently in testing.",
    "Every month brings small steps in refreshing the appearance of Facebook’s other messaging app, with gifs easier to access, archived chats staying archived and more.",
    "However, it’s the small touches that many users notice the most, which is why a refreshed take on chat bubbles looks to be in testing for the foreseeable future.",
    "In the WhatsApp beta version 2.21.13.2 on Android devices, chat bubbles are now much more rounded, differentiating itself from other messaging apps such as iMessage and Telegram, alongside a more colorful green hue this time.",
    "This is another step in the refresh of the user interface that’s been present in WhatsApp since its inception, way before it was bought by Facebook back in February of 2014.",
    "While there’s no announcement of when these new bubbles will arrive, it may be when multi-device support is rolled out to all devices, as that’s when it will have an opportunity to be showcased on many more devices, such as the iPad.",
    "We’ve seen a trickle of refinements to WhatsApp as of late, resulting in a better experience for users who have been wanting to see improvements in different aspects of the messaging app.",
    "Especially with competitors such as iMessage and Telegram showcasing disappearing messages and reactions to messages for its users for a while now, the spotlight has been on WhatsApp to bring these similar features to its users as well.",
    "With reactions also in development, users are going to reap these benefits, not just on their smartphones, but soon on their tablets and laptops once multi-device support is released.",
    "As we approach the final releases of Android 12 and iOS 15, it’s going to be a tight-nit race to see how WhatsApp can still keep up with this marathon of small yet significant updates to keep its users from jumping ship.",
    "Via WABetaInfo"
  ],
  "headers": {
    "3": "New Bubbles",
    "6": "Analysis: preparing for Android 12 and iOS 15"
  },
  "links": {
    "Android": "https://www.techradar.com/news/android-12-news",
    "iOS": "https://www.techradar.com/news/ios-15-update",
    "WhatsApp": "https://www.techradar.com/how-to/use-whatsapp",
    "WABetaInfo": "https://wabetainfo.com/whatsapp-is-redesigning-chat-bubbles-on-ios/"
  }
}