{
  "source": "https://www.techradar.com/news/days-gone-is-coming-to-pc-and-more-playstation-exclusives-are-on-the-way",
  "title": "Days Gone is coming to PC, and more PlayStation exclusives are on the way",
  "category": "gaming",
  "updated": "2021-02-23T17:51:31Z",
  "author": "hamish-hector",
  "summary": "Who needs a PS5?",
  "article": [
    "Even more PlayStation exclusive games are reportedly coming to PC starting with Days Gone sometime in early 2021.",
    "PlayStation President and CEO Jim Ryan shared the announcement as part of an interview with GQ, where he also revealed that a new PSVR headset is on the way. Ryan's announcement was also later supported by a tweet from Days Gone developer Bend Studio, who confirmed that its game is coming to PC soon.",
    "For now, we don’t know what other games are on the way, but Sony has said more PlayStation exclusives are coming after the port of Horizon Zero Dawn was deemed successful, even if not every fan agreed at launch.",
    "PlayStation’s library of exclusive games is exceptionally good, so we’d love to see more of Sony's games launch on PC in the future.",
    "Some obvious highlights would be the Last of Us 2, which was dubbed by many as the best game of 2020, and of course God of War, the 2018 soft-reboot of the franchise that took Kratos into the Norse mythos.",
    "God of War definitely seems more likely for the near future, with Days Gone and Sony’s other PC port - Horizon Zero Dawn - both being released several years after their console debut. For now, we will have to see what Sony picks next.",
    "For years, Sony has lagged behind Microsoft in releasing its games on non-console platforms, so what's different now? Well for one it’s apparently easier to port games to the PC than ever before, particularly as the PS4 and Xbox One were more PC-like in nature.",
    "However, at the core of the decision is, of course, money. Jim Ryan highlights that the cost of making games is high, and we only need to look at Cyberpunk 2077’s estimated $330 million budget to see that in action.",
    "As costs increase, more copies have to be sold, but for exclusives that can be difficult because the pool of players is smaller than for multi-platform releases. By selling its games to PC players, Sony can hope to make a bit more cash from the titles it has already made."
  ],
  "headers": {
    "3": "What other games do we want to see ported to PC?",
    "6": "Why are we getting more ports?"
  },
  "links": {
    "Days Gone": "https://www.techradar.com/news/fireside-chat-is-days-gone-worth-buying",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/playstation-vr-jim-ryan-interview-2021",
    "new PSVR headset": "https://www.techradar.com/news/sony-confirms-psvr-2-is-coming-to-ps5-along-with-a-new-vr-controller",
    "Horizon Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "agreed at launch": "https://www.techradar.com/news/horizon-zero-dawn-pc-specs-and-benchmarks-one-messy-port",
    "Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077"
  }
}