{
  "source": "https://www.techradar.com/news/cant-get-the-apple-airpods-max-these-noise-cancelling-headphones-might-do-the-trick",
  "title": "Can't get the Apple AirPods Max? These noise-cancelling headphones might do the trick",
  "category": "audio-visual",
  "updated": "2021-01-12T13:17:46Z",
  "author": "olivia-tambini",
  "summary": "The V-Moda M-200 ANC will be available in early March",
  "article": [
    "V-Moda has upgraded its exceptional M-200 Studio headphones with active noise cancellation and wireless connectivity, making them a compelling alternative to the Apple AirPods Max.",
    "The V-Moda M-200 ANC look almost identical to their predecessors, with hexagonal earcups – which come in customizable colors and the option to include a personalized engraving – and a rugged, foldable headband.",
    "The drivers inside have been downsized to 40mm compared to the 50mm drivers found in the non-ANC model. Hopefully that won't have too much of an impact on the sound quality; the original V-Moda M-200 impressed us with their excellently balanced soundstage, well-extended bass, and detailed trebles.",
    "There are also new buttons for controlling music playback and wireless pairing, and a USB-C charging port. Battery life comes in at 20 hours; not the best we've seen for noise-cancelling headphones, but still on a par with the AirPods Max.",
    "You can control the level of noise cancellation via an app, which means you can adjust it to suit your surroundings. It's also possible to briefly turn off the noise cancellation and lower the volume of your music by placing your hand over the left earcup – a nifty feature for times when you need to quickly tap into your environment or have a quick conversation.",
    "Unlike the Apple AirPods Max, the V-Moda M-200 ANC come with the option for wired listening, with a 3.5mm audio cable included in the box. The lack of audio port on Apple's headphones was particularly contentious, with many – quite fairly – expecting a level of flexibility to come with headphones that cost $549 / £549 / AU$899.",
    "So, if the V-Moda M-200 ANC can deliver the same excellent audio quality as their predecessors, as well as the flexibility that comes with wired and wireless connectivity and adjustable noise cancellation, they could be a formidable rival for the AirPods Max.",
    "Saying that, they're not exactly cheap either; the V-Moda M-200 ANC will cost $499 when they become available to buy in March. While global pricing and availability is yet to be announced, that works out at about £370 / AU$640.",
    "Plus, you're not getting any of the iOS-centric quality of life features that you get with the AirPods Max, like Automatic Switching, hands-free Siri activation, or Audio Sharing – which for many Apple devotees, are the main reasons for buying the pricey cans. It's not just about support for Apple's ecosystem – the AirPods Max are among the best-sounding headphones we've tested.",
    "Of course, the Apple-centric nature of the AirPods Max won't appeal to all, and it's one of the reasons why we wouldn't recommend them over our favorite headphones of 2021, the Sony WH-1000XM4.",
    "Which headphones would be better for you boils down to your needs. Do you own lots of iOS devices and love Apple's minimal aesthetic? The AirPods Max could be a great fit.",
    "Or, are you looking for great build quality and flexibility in how you listen to your music? The V-Moda headphones might be a better pick, and they're slightly cheaper to boot. It's also worth considering that the AirPods Max have been sold out since they launched in December 2020, and any new stock is likely to be snapped up quickly.",
    "In any case, here's hoping the V-Moda M-200 ANC can match the sound quality of their predecessors as well as that of the AirPods Max – if they can, they could easily join our round up of the best noise-cancelling headphones you can buy today."
  ],
  "headers": {
    "5": "What about the Apple AirPods Max?"
  },
  "links": {
    "M-200 Studio headphones": "https://www.techradar.com/reviews/v-moda-m-200-studio-headphones",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490"
  }
}