{
  "source": "https://www.techradar.com/news/google-drive-update-waters-down-new-user-blocking-feature",
  "title": "Google Drive update waters down new user blocking feature",
  "category": "computing",
  "updated": "2021-09-21T00:30:16Z",
  "author": "anthony-spadafora",
  "summary": "Drive users will no longer be able to block users from trusted domains",
  "article": [
    "After adding the ability to block other users in Google Drive back in July, Google has now updated this feature to prevent users from blocking others in trusted domains.",
    "The search giant originally added this feature in an effort to decrease the amount of spam content on its cloud storage service.",
    "While users aren't able to block their coworkers or others within their domain, up until now they were able to block users from trusted domains.",
    "For those unfamiliar, trusted domains are external organizations that are allowed to share files with your organization such as partners or companies your business often collaborates with.",
    "According to a new post on the Google Workspace blog, as part of this new Google Drive update, user blocks will no longer work with users in trusted domains.",
    "At the same time though, any previous blocks established for users in trusted domains will no longer be enforced in Google Drive. It's worth noting though that these blocks will continue to be enforced in other Workspace apps and Google services.",
    "If you accidentally blocked someone in Google Drive or in another Workspace app, you can click on your profile picture or initial and then go to “Manage your Google Account”. From here, you'll need to find the “Contacts” section under People & sharing and click on “Blocked”. This will bring up a list of accounts you've blocked across Google products. To unblock someone, you'll need to select “Remove X” next to that person's name.",
    "Preventing unwanted users from contacting you across Google Workspace apps can certainly help improve your productivity but blocking someone from a trusted domain meanwhile, may make it difficult to do your job. Thankfully though with this new update, you'll no longer be able to block partners or collaborators from trusted domains."
  ],
  "headers": {
    "4": "Blocking users in trusted domains"
  },
  "links": {
    "block other users": "https://www.techradar.com/news/google-drive-now-let-you-ban-spammers",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "collaborates": "https://www.techradar.com/best/best-online-collaboration-tools",
    "new post": "https://workspaceupdates.googleblog.com/2021/09/block-shares-google-drive-trusted-domains.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "productivity": "https://www.techradar.com/best/best-productivity-apps"
  }
}