{
  "source": "https://www.techradar.com/news/tcl-oled-tvs-could-see-the-technology-finally-become-affordable",
  "title": "OLED TVs could plummet in price by 2023",
  "category": "televisions",
  "updated": "2021-04-16T12:42:37Z",
  "author": "henry-st-leger",
  "summary": "If TCL's OLED alternative pays off",
  "article": [
    "TCL is officially making OLED TVs, after the company announced a 2023 kickoff for production of its own take on the premium television tech – and it could be great news for your wallet.",
    "OLED is an expensive technology compared to traditional LCD televisions, even though ramped-up manufacturing and wider adoption is seeing prices gradually drop. But TCL's preferred method of making OLED panels will, it tells us, be significantly cheaper, with those savings making much lower RRPs likely when the televisions launch.",
    "This alternative production method uses inkjet-printed panels (IJP), effectively 'printing' OLED panels between panes of glass, rather than traditional 'white OLED' (WOLED) panels found in today's OLED televisions – such as the LG CX, Sony A8H, or Panasonic JZ2000 – and which require a more material-intensive production process.",
    "Back in 2019, market analyst firm IHS Markit (now known as Omdia) predicted that a move to inkjet printing could see a 15-25% cost reduction to existing OLED TV retail prices. That could see entry-level launch prices for OLED drop from around $1,200 / £1,200 to well below the $1,000 / £1,000 mark, and offer real competition to the current market leader in OLED TV production, LG Display.",
    "Chase LI, a senior analyst at IHS Markit, said at the time that \"Despite years of competition with LCDs in the market for high-end displays of all sizes, OLED market penetration remains limited because of its expensive production costs.\"",
    "Li added that \"IJP has the potential to dramatically reduce manufacturing expenses, making OLEDs more cost-competitive with LCDs in products including televisions and displays for computers and tablets.\"",
    "Whether these OLED TVs will look as good as those made with more traditional means, is unclear, though the potential for a mid-price OLED with some acceptable compromises is certainly exciting in itself.",
    "Currently, all OLED TV panels on the market are made by LG Display, which supplies them to LG Electronics (a distinct entity) as well as Panasonic, Philips and Sony.",
    "That monopoly could be set to change, though, if other TV brands are able to manufacture other, cheaper OLED panels at a large scale. TCL is one of the biggest TV sellers worldwide – currently third behind Samsung and LG, according to its own estimates – and it certainly has the scale and resources to do so.",
    "Europe Product Development Director Marek Maciejewski has previously told us that \"We see no future in terms of efficiency and brightness [for conventional OLED]\".",
    "The inkjet process can supposedly \"avoid the problematic evaporation technique\" currently used to create WOLED panels, and is \"more precise\" with \"less waste [and] lower prices\" – with Maciejewski adding that he believed \"all major OLED manufacturers are developing this.\"",
    "If you're not sold on the promise of Mini LED, then, it's very possible that TCL will shake up the market with truly cheap OLED TVs a few years down the line.",
    "2023 is when the specific production line for TCL's OLED is expected to start production – so, depending on the time of year that it starts, we could be looking at 2024 for these sets actually entering the market.",
    "2023-2024 is a while off yet, though, and Samsung is likely to beat TCL to the punch at this point. The world's biggest TV maker is reportedly prototyping its own OLED alternative known as 'QD-OLED', which combines the advantages of a self-emissive OLED panel with the enhanced contrast of the quantum dot technologies used in Samsung's QLED and Neo QLED ranges.",
    "Samsung's QD-OLED televisions could launch as soon as 2022, though, giving it something of a head start if those timelines prove to be true. However, TCL tends towards more aggressive pricing than Samsung, meaning it might be worth waiting a bit longer for a true value OLED.",
    "Between the two of them, Samsung and TCL could offer a real two-step market disruption to the current hold LG Display has on the OLED market."
  ],
  "headers": {
    "7": "Change is coming"
  },
  "links": {
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "LG CX": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A8H": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "Panasonic JZ2000": "https://www.techradar.com/reviews/panasonic-jz2000-4k-oled-tv",
    "could see a 15-25% cost reduction to existing OLED TV retail prices": "https://www.techradar.com/news/you-should-wait-until-2020-to-buy-a-cheaper-oled",
    "Samsung and LG": "https://www.techradar.com/news/samsung-vs-lg-tv-which-tv-brand-is-better",
    "previously told us": "https://www.techradar.com/news/you-should-wait-until-2020-to-buy-a-cheaper-oled",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "reportedly prototyping its own OLED alternative known as 'QD-OLED'": "https://www.techradar.com/news/new-samsung-tvs-could-ditch-lcd-for-oled-as-soon-as-next-year",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Neo QLED": "https://www.techradar.com/news/qled-vs-neo-qled"
  }
}