{
  "source": "https://www.techradar.com/news/dashlane-just-unveiled-its-cheapest-password-manager-plan-yet",
  "title": "Dashlane just unveiled its cheapest password manager plan yet",
  "category": "computing",
  "updated": "2021-04-28T18:00:57Z",
  "author": "anthony-spadafora",
  "summary": "Secure all your online accounts for as little as $2.99 per month",
  "article": [
    "Ahead of this year's World Password Day, Dashlane has unveiled a new Essentials plan that gives users of its password manager even more choices when it comes to deciding how to secure their online accounts.",
    "Based on feedback from its customers, Essentials builds off the company's Free plan and provides users with a new affordable monthly pricing option to store, secure and access unlimited passwords and accounts across multiple devices.",
    "In a press release, chief product officer at Dashlane, Derek Snyder explained why the company decided to create its new Essentials plan, saying:",
    "“With more and more people realizing the importance of proper password hygiene, one of the most common requests we heard was for a more flexible plan; one still helps users manage the fundamentals of their identity, privacy, and security at an accessible monthly price point, but may not have as many advanced security features as our Premium offering. We wholeheartedly believe that everyone should have a password manager—budget constraints or year-long commitments shouldn't be a barrier to safer, easier access online.\"",
    "With the addition of its new Essentials plan, Dashlane now offers four plans at different price points depending on users' needs in the form of Premium, Essentials, Family and Free. The Essentials plan costs either $3.99 per month if billed monthly or just $2.99 per month with yearly billing.",
    "The new plan offers the most vital features of a password manager at the most affordable price point as it allows users to store, secure and access passwords and personal information for an unlimited amount of accounts across two devices. This means that you can use Dashlane with both your desktop computer and smartphone for all your password management needs for as little as $2.99 per month.",
    "After its relaunch in beta, Dashlane's one-of-a-kind Password Changer will also be available as part of the Essentials plan. For those unfamiliar, the company's Password Changer uses machine learning to log users into compatible websites where it can generate passwords that are both strong and unique and change a user's existing passwords with just one-click.",
    "If you're considering signing up for Dashlane's password manager, it's worth noting that the company's Family plan, which can secure the accounts of up to six different users, also includes a VPN for $8.99 billed monthly or $7.49 billed yearly."
  ],
  "headers": {
    "4": "Just the Essentials"
  },
  "links": {
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "password manager": "https://www.techradar.com/best/password-manager",
    "press release": "https://www.prnewswire.com/news-releases/dashlanes-new-essentials-plan-because-everyone-should-have-a-password-manager-301279170.html",
    "Essentials plan": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8875885048420357000&xs=1&url=https%3A%2F%2Fwww.dashlane.com%2Fplans&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fdashlane-just-unveiled-its-cheapest-password-manager-plan-yet",
    "desktop computer": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Password Changer": "https://www.techradar.com/news/dashlane-is-eliminating-the-hassle-of-changing-your-account-passwords",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "generate passwords": "https://www.techradar.com/best/password-generator",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}