{
  "source": "https://www.techradar.com/news/rivian-r1t-electric-truck-beats-ford-f-150-lightning-and-tesla-cybertruck",
  "title": "Rivian R1T electric truck beats Ford F-150 Lightning and Tesla Cybertruck",
  "category": "car-tech",
  "updated": "2021-09-16T08:06:05Z",
  "author": "chris-teague",
  "summary": "The first EV truck to roll off production line",
  "article": [
    "The very first customer-bound Rivian R1T electric pickup truck recently left the automaker's factory in Normal, IL. To mark the occasion, company CEO RJ Scaringe tweeted celebratory images from the factory floor.",
    "While it's still unclear how quickly the company will be able to ramp up building the pre-ordered trucks and SUVs it has on the books, the fact it's in production at all is a significant step forward.",
    "Rivian beat General Motors, Tesla, and others to market with its electric R1T pickup. Still, the R1T won't have the market to itself for long, making the news that production is starting all the more critical for Rivian.",
    "Even Ford, who has invested hundreds of millions of dollars in Rivian, won't release the F-150 Lightning electric truck until sometime in 2022, but is sure to make waves when it does.",
    "Rivian, as Tesla did before it, has the benefit of being first, so it will be interesting to see how buyers and other automakers react.",
    "Being the only supplier of electric pickup trucks at a time when everyone wants an electric pickup truck puts Rivian in a strong position, but the trucks that come from legacy automakers will present the company with an enormous challenge.",
    "Despite having a novel, attractive product, Rivian does not have the decades of manufacturing and supply chain management experience that Ford and General Motors do, so the ball is in Rivian's court on whether or not it can hold its own.",
    "It will also be entertaining to see how the R1T influences future electric pickup trucks. Some of the choices automakers make today are in place because Tesla hit the market first with a feature or service and now buyers expect them.",
    "Large infotainment screens are probably the most prominent example of this trend. Rivian's truck and SUV both feature clever designs with surprising and useful features, so there's no telling what second-generation electric trucks will look like down the road."
  ],
  "headers": {
    "4": "Analysis: the benefit of being first"
  },
  "links": {
    "tweeted": "https://twitter.com/RJScaringe/status/1437842808384233477",
    "F-150 Lightning": "https://www.techradar.com/news/ford-f-150-lightning-first-look"
  }
}