{
  "source": "https://www.techradar.com/news/bitcoin-in-india-could-be-banned-again-in-crackdown-on-cryptocurrencies",
  "title": "Bitcoin in India could be banned again in crackdown on cryptocurrencies",
  "category": "computing",
  "updated": "2021-02-01T10:01:33Z",
  "author": "mayank-sharma",
  "summary": "Regulate not ban, suggest stakeholders",
  "article": [
    "Private cryptocurrencies such as Bitcoin could be banned in India according to new government legislation.",
    "Legislative agenda listed by the Government of India in the ongoing Budget session shows that it plans to introduce a law to ban the purchase and ownership of private cryptocurrencies.",
    "Dubbed “The Cryptocurrency and Regulation of Official Digital Currency Bill, 2021” the bill “seeks to prohibit all private cryptocurrencies in India” according to a bulletin published on the website of its Lower House.",
    "Furthermore, the Indian government wants to introduce a framework for an official digital currency that will be issued by the Reserve Bank of India (RBI), which is the central bank of the country.",
    "This isn’t the first time India has moved to ban crypto. Back in 2018, the RBI ordered all financial institutions in the country to break off all ties with individuals or businesses dealing in virtual currency such as bitcoin within three months. The diktat was however later overturned by India's Supreme Court, which allowed banks to process cryptocurrency transactions from exchanges and traders.",
    "In 2019, an inter-ministerial committee set up by the government on crypto again proposed to ban them via a 2019 draft bill that sought to impose fines and penalties on individuals and exchanges that continued handling crypto. That bill, which was placed in the public domain also called on the Government to think about launching an official digital currency.",
    "Governments all over the world have been looking into ways to regulate cryptocurrencies, but no one has yet taken the drastic step of placing a blanket ban on owning them.",
    "Exchanges in the country meanwhile want the Government to engage with them and take their opinion on board before steamrolling ahead with the legislation.",
    "“We are talking to other stakeholders and will definitely initiate deeper dialogue with the government and showcase how we can actually create a healthy ecosystem in unison,” said Sumit Gupta, co-founder and chief executive of CoinDCX,a cryptocurrency exchange in India.",
    "Via: TechCrunch"
  ],
  "headers": {
    "4": "\"Regulate, don’t ban!\""
  },
  "links": {
    "Bitcoin": "https://www.techradar.com/best/mining-rigs",
    "bulletin": "http://loksabhadocs.nic.in/bull2mk/2021/29012021.pdf",
    "2019 draft bill": "https://www.prsindia.org/billtrack/draft-banning-cryptocurrency-regulation-official-digital-currency-bill-2019",
    "TechCrunch": "https://techcrunch.com/2021/01/30/india-plans-to-introduce-law-to-ban-bitcoin-other-private-cryptocurrencies/"
  }
}