{
  "source": "https://www.techradar.com/news/is-nvidia-is-preparing-to-release-an-rtx-2060-12gb-card-to-ease-stock-woes",
  "title": "Is Nvidia is preparing to release an RTX 2060 12GB card to ease stock woes?",
  "category": "computing",
  "updated": "2021-11-16T18:35:10Z",
  "author": "john-loeffler",
  "summary": "Getting the Turing band back together",
  "article": [
    "Nvidia and Gigabyte are preparing to rerelease the RTX 2060 graphics card - with a big VRAM upgrade, according to a new regulatory filing.",
    "The document, submitted to the Eurasian Economic Commission and published on November 15, refers to four new Gigabyte graphics card SKUs. All four are for new versions of the Nvidia RTX 2060 and all indicate a 12GB variant, doubling the VRAM over the original 6GB when the card was released back in 2019.",
    "The cards will come in both GB Gaming and GB WindForce branding, the SKUs also indicate, with a standard and overclocked model for each.",
    "It's not clear whether the new cards will include any additional improvements over the 2019 cards beyond the increased VRAM. According to Wccftech, the move comes as the RTX 3050 and RTX 3050 Ti GPUs are not expected to hold up well against AMD's upcoming budget Big Navi cards based on the Navi 24 GPU.",
    "The move can also be an effort on Nvidia's part to do something, anything, to address the stock shortages of its latest Nvidia Ampere cards, including the RTX 3060, RTX 3070, and RTX 3080.",
    "Every gamer that upgrades from older GPUs like the GTX 1660 Ti to RTX 2060 cards means fewer people clamoring for the impossible-to-find Ampere cards, which could make it easier for others to buy them.",
    "How much difference will the rerelease of a three-year-old graphics card make in the short-term? It's anyone's guess, but the card is expected to release in early December, so we'll know soon enough.",
    "Will the release of an upgraded RTX 2060 really help the rest of us get the graphics cards we actually want (namely the RTX 30-series cards)? Almost certainly not.",
    "You can already get an RTX 2060 pretty easily right now, and the additional VRAM is not likely to move anyone who might be sitting on the fence at this point. Adding more RTX 2060 cards to the mix is unlikely to move the needle on the demand for more powerful Ampere cards.",
    "How about competing with AMD's anticipated Navi 24 graphics cards? For builders, the GTX 1660 Ti is still the go-to budget graphics card, and it's more than capable of taking on Navi 24. Sure, Navi 24 will have ray tracing cores, while the GTX 1660 Ti does not, but to be honest, Navi 24's ray tracing capability won't be very functional.",
    "The same is true of the RTX 2060, which can indeed produce ray-traced graphics, but at frame rates most gamers are unwilling to accept. Most people will take 60 fps non-ray-traced visuals over 30 fps with ray tracing pretty much any day of the week, so the added features on these budget cards is pretty much a moot point anyway.",
    "Still, any graphics card on the market, even one that is three years old, will probably sell anyway, so from a financial perspective, Nvidia is likely to come out ahead with this move. And at the end of the day, that's likely driving this decision."
  ],
  "headers": {
    "7": "Analysis: will it help? No, but it might make Nvidia some extra money"
  },
  "links": {
    "Eurasian Economic Commission": "https://portal.eaeunion.org/sites/odata/_layouts/15/Portal.EEC.Registry.UI/DisplayForm.aspx?ItemId=78816&ListId=d84d16d7-2cc9-4cff-a13b-530f96889dbc",
    "Nvidia RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "Wccftech": "https://wccftech.com/nvidia-geforce-rtx-2060-12-gb-graphics-cards-from-gigabyte-listed-at-eec/",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "Nvidia Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "GTX 1660 Ti": "https://www.techradar.com/news/best-nvidia-geforce-gtx-1660-ti"
  }
}