{
  "source": "https://www.techradar.com/news/sky-glass-tv-pre-order",
  "title": "Sky Glass TV pre-order: how to pre-register for the Sky television sets",
  "category": "televisions",
  "updated": "2021-10-11T14:53:11Z",
  "author": "gerald-lynch",
  "summary": "Buying the Sky Glass TV is unlike purchasing any other television",
  "article": [
    "The long rumoured Sky television set, the Sky Glass, has finally been revealed. With all of the best bits of Sky Q built in, the TV range comes in three sizes, each offering 4K quantum dot displays, with a broad range of HDR support and built-in Dolby Atmos sound systems and voice control.",
    "It’s an all-in-one TV package quite unlike any other that’s come before it – and that includes the way you purchase the sets.",
    "Launching on October 18, not only do you have three screen sizes to choose from (a ‘Small’ 43-incher, a ‘Medium’ 55-incher and a ‘Large’ 65-incher) but you’ve also got the choice of buying the TV outright, having it subsidised against the cost of a monthly fee as you would a phone contract, and also a wide array of TV channel packages that you can bolt on top.",
    "It could get a bit confusing, so let this Sky Glass TV pre-order guide walk you through how to pick the right set up for you ahead of that October 18 release date.",
    "At present, Sky is not taking any orders or deposits on Sky Glass TV sets. However, it is allowing interested customers to ‘pre-register’ their interest in the new televisions. You’ll then be on the list for the latest news and ordering information as they become available.",
    "It’s a simple process – just head over to the Sky Glass pre-registering page. You’ll be asked for your first and last name, email address and phone number. Pop them in and you’ll be first to know when the Sky Glass TV goes on sale.",
    "After having a read of our hands on Sky Glass TV review, the first decision you’ll have to make is for what screen size you’re looking to purchase.",
    "If you’re after the 43-inch models, they can be purchased outright for £649, or on a 48-month contract at £13 a month. That works out at a total cost of £624.",
    "For the 55-inch model, you can buy one for £849, or £17 a month on a 48 month contract. That contract’s the equivalent of £816.",
    "Finally, the 65-inch version will be sold for £1049, or £21 a month on a 48 month contract. That monthly fee will cost £1008 by the end of the contract term.",
    "With all the contract options, shorter contracts of 24 months can be negotiated in return for a higher monthly outlay (43-inch, £26pm, £644 total / 55-inch, £34pm, £836 total / 65-inch, £42pm, £1028 total).",
    "All contracts also include a one-off, upfront fee – £20 for 24 month contracts, and £10 for 48 month contracts.",
    "Remember though that all purchases currently must be paired with a Sky TV subscription package, so factor that cost in too – more on those next.",
    "After that, you’ve then got the option to customise the screen’s aluminium casing in one of five colors – blue, green, pink, white or black. Remote controls will be offered in matching colors, while a range of magnetic front plates with various patterns will also eventually be offered at an additional cost.",
    "With the two year minimum commitment on the subscription purchase options proving more affordable than the outright purchases, Sky is obviously banking on you splashing the cash with its TV packages and raking the cash in that way. There are some affordable options here, but the most fun stuff here is inevitably locked behind the more expensive tiers.",
    "The basic package is the ‘Sky Ultimate TV’ bundle. This throws together Sky’s entertainment channels and TV boxsets in with a Netflix subscription for £26 a month. It’s great for binge TV watchers.",
    "If you’re after Sky’s very extensive sports programming that includes loads of Premier League football, golf, cricket and motorsports action, that’s an additional £25 a month. If you want access to the sports content that rival provider BT Sports offer, that’s another £24. With that, combined with the Sky stuff, that’ll be basically all televised paid-for sporting content, aside from what Amazon Prime Video offers.",
    "The best-value add-on is the Sky Cinema bolt on, which costs an extra £11 a month. Sky has a great catalogue of movies from across the ages, and excellent on demand movie boxset packages too, collating complete series of popular movie franchises.",
    "If you’ve got kids running around, you can add the Sky Kids programming, with lots of exclusive characters your little-ones will recognise, for an extra £5 a month.",
    "Perhaps the most cheeky part of Sky’s pricing options is that 4K HDR TV content, and Dolby Atmos options, are locked behind an additional £5 per month add-on, the ‘Sky Ultra HDR and Dolby Atmos pack.’ That feels quite cynical, but will be needed to get the most out of the content you’re watching.",
    "All packages are sold on a 31-day rolling contract, letting you adjust them on a near-monthly basis as your finances allow.",
    "So what if you’ve already got a TV that you’re in love with, but still want to get Sky Glass’s feature set? Well, at present, whatever happens you’re going to need to buy a Sky Glass TV – but there is a package that will let you additionally add the features to another TV set in your home.",
    "For an extra £10 a month, you can upgrade to the “Whole Home” package, which offers up the Sky Stream Puck. This box, connecting to your old TV over HDMI, will bring all the software features of Sky Glass to your television – but, obviously, won’t magically add Dolby Atmos surround sound or built-in microphones to your old TV set. Think of it like Sky’s equivalent to a streaming stick, though sadly it’s not currently set to be sold separately, hence the requirement to still sign up for one of the Sky Glass TV offers. Each Puck costs a one-off £50 fee."
  ],
  "headers": {
    "4": "How to pre-register for Sky Glass TV",
    "6": "Sky Glass TV purchasing options",
    "14": "Sky Glass TV packages",
    "21": "Sky Glass Whole Home options"
  },
  "links": {
    "Sky Glass": "https://www.techradar.com/news/sky-glass-is-a-qled-tv-with-sky-q-built-in-and-its-coming-soon",
    "Sky Q": "https://www.techradar.com/reviews/audio-visual/digital-tv-recorders/sky-q-1309215/review",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Sky Glass pre-registering page": "https://www.awin1.com/awclick.php?awinmid=11005&awinaffid=103504&clickref=trd-us-7045392067509233000&p=https%3A%2F%2Fwww.sky.com%2Fshop%2Fpre-reg%2Fglass%3Firct%3DglassHome-glass-hero",
    "Sky Glass TV review": "https://www.techradar.com/reviews/sky-glass-4k-qled-tv"
  }
}