{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-is-coming-to-blu-ray-very-soon",
  "title": "Zack Snyder’s Justice League is coming to Blu-ray very soon",
  "category": "entertainment",
  "updated": "2021-04-16T12:08:07Z",
  "author": "rhys-wood",
  "summary": "The Snyder Cut is homebound",
  "article": [
    "DC fans looking to own a copy of Zack Snyder’s Justice League won’t have to wait long, as the Snyder Cut is due for both digital and physical release on 4K Ultra HD, Blu-ray and DVD very soon.",
    "You’ll be able to download Zack Snyder’s Justice League digitally from April 19. This will be followed by a physical release on 4K Ultra HD, Blu-Ray and DVD on May 24. A steelbook version of the film will also be available with some extra features included. Note that these are UK dates, and we're unsure how the movie will be made more widely available elsewhere.",
    "The limited edition steelbook version of Zack Snyder’s Justice League will include the Road to Justice League featurette, which will involve the director reflecting on his work within the DC extended universe. The digital version of the film will include (via select digital retailers only) Justice is Gray, the black and white version of the movie previously only available to a select few.",
    "Zack Snyder’s Justice League, or ‘The Snyder Cut,’ is an enhanced version of the original 2017 Justice League movie, which was released to a poor reception. The Snyder Cut version represented something of an improvement, though, with critics praising the added depth Snyder was able to bring to the film’s heroes and villains.",
    "The DC Extended Universe movies might finally be working through their growing pains. The Cathy Yan directed Birds of Prey was positively received last year, and upcoming projects like The Batman and James Gunn’s DC directorial debut, The Suicide Squad, continue to generate excitement despite being delayed due to the Covid-19 pandemic.",
    "If you skipped out on 2017’s Justice League but are interested in Zack Snyder’s enhanced version of the film, have a look at our review to see if it’s worth your time. We praised the much improved final battle and the overall upgrade in quality over the original, while citing the slow setup and bloated runtime as its main drawbacks."
  ],
  "headers": {
    "3": "Justice for all"
  },
  "links": {
    "Zack Snyder’s Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "Birds of Prey": "https://www.techradar.com/reviews/birds-of-prey",
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer",
    "The Suicide Squad": "https://www.techradar.com/news/the-suicide-squad-sounds-a-lot-better-than-the-first-movie",
    "have a look at our review": "https://www.techradar.com/reviews/zack-snyders-justice-league"
  }
}