{
  "source": "https://www.techradar.com/news/ring-floodlight-cam-has-a-new-rival-as-ezviz-launches-fullhd-lc1c-floodlight-camera",
  "title": "Ring Floodlight cam has a new rival, as Ezviz launches FullHD LC1C Floodlight camera",
  "category": "smart-home",
  "updated": "2021-02-09T10:21:29Z",
  "author": "carrie-ann-skinner",
  "summary": "Keep an eye on your property without the need for a subscription",
  "article": [
    "Smart home security-brand Ezviz has unveiled a floodlight security camera that doesn’t require a subscription to store videos it records, unlike its main rival the Ring Floodlight Camera.",
    "As well as a camera with a 140-degree angle that records FullHD video if it detects motion, the Ezviz LC1C Floodlight camera also has two lights, offering 2,000 lumens of brightness and a 270 degree PIR sensor (passive infrared sensor). As soon as motion is detected by either the camera or the PIR sensor, the lights will illuminate, potentially deterring any would-be intruders.",
    "Video recorded by the camera can either be stored on a MicroSD card up to 256GB in size (although this doesn’t come bundled with the camera) or through an Ezviz CloudPlay subscription, which stores the video online for $5.99/ £4.99 / AUS$7.99 per month.",
    "Similar in design to Ring’s competitor, the EZVIZ LC1C floodlight camera comes in black or white, but undercuts it on price with a $148 / £179.99 / AU$289.98 price tag.",
    "The camera will alert your smartphone when motion is detected, and you can log in live and see the camera’s feed in real-time. A microphone and speaker mean you can hear and talk to anyone at your property while night vision means when it’s dark you’ll be able to see footage recorded up to 25 meters (82 ft.) away.",
    "The EZVIZ LC1C floodlight camera can replace an existing outdoor floodlight that’s not smart, but can also be installed if you don’t currently have an outdoor sensor light. There’s also a 100db siren, which can be manually sounded from the app.",
    "The EZVIZ LC1C floodlight is compatible with Amazon Alexa, Google Assistant and IFTTT so you can ask a compatible smart speaker to illuminate the lights or start recording. The camera has an IP65 enclosure rating, so it’ll withstand rain, snow and other harsh weather conditions, too."
  ],
  "headers": {
    "4": "Enter the spotlight"
  },
  "links": {
    "Ring Floodlight Camera": "https://www.techradar.com/news/save-pound70-on-the-ring-floodlight-cam-in-amazons-early-easter-sale",
    "MicroSD card": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "Amazon Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "IFTTT": "https://www.techradar.com/how-to/world-of-tech/how-to-control-your-smart-home-with-ifttt-1326142"
  }
}