{
  "source": "https://www.techradar.com/news/amd-ryzen-9-5900x-is-dominating-cpu-sales-on-amazon-should-intel-be-worried",
  "title": "AMD Ryzen 9 5900X is dominating CPU sales on Amazon – should Intel be worried?",
  "category": "computing",
  "updated": "2021-04-26T10:55:07Z",
  "author": "matt-hanson",
  "summary": "Despite inflated prices, AMD’s CPUs are selling like hotcakes on Amazon",
  "article": [
    "It looks like AMD is on a major hot streak with its new Ryzen 5000 series processors, with the AMD Ryzen 9 5900X topping the Amazon CPU sales charts – and that could spell big trouble for Intel.",
    "While this is just one retailer, it is Amazon, and due to its sheer size, it gives us a good idea of just how well AMD’s processors are selling.",
    "The news gets worse for Intel, in fact, as the AMD Ryzen 9 5900X is number one, despite selling for $800 (around £575 / AU$1,030), well above the $549 (about £420, AU$760) recommended retail price. That shows just how in demand AMD’s 12-core processor is.",
    "There’s even more bad news for Intel, as at the time of writing. The Amazon CPU best sellers list is dominated by AMD chips – the entire top six are all processors from Team Red, and only three of the top 10 are Intel processors.",
    "According to the list, Intel’s most popular CPU on Amazon right now is the Intel Core i7-10700K, a 10th gen 8-core processor, which sells for $319.95 (around £230 / AU$410).",
    "Meanwhile, the second-best selling CPU on Amazon is the AMD Ryzen 7 3700X, an 8-core chip that costs $308.91 (around £220, AU$400).",
    "Amazon’s best sellers lists are constantly changing, so we may see AMD’s domination slip, but the fact that its processors are doing so well in one of the biggest retailers in the world is an incredible achievement, and a big turnaround from Intel’s historic dominance.",
    "It also follows similar reports from other (admittedly smaller) retailers, which show AMD’s CPUs being much more popular – and this points to an overall trend which could be quite concerning for Intel.",
    "So, what can Team Blue do? It’s clear that AMD is winning mindshare at the moment – the fact that people are willing to spend well over the RRP for the AMD Ryzen 9 5900X shows just how hot AMD’s products are right now.",
    "The best way to do that is to release processors that attack AMD on all fronts – both performance-wise and price-wise.",
    "The problem here is that Intel has just released 11th generation Rocket Lake processors, like the Intel Core i9-11900K, but they have so far failed to set the world alight, feeling like a stop-gap release before the much more exciting 12th-generation Alder Lake-S processors, which are rumored to launch around September 2021.",
    "The pressure will be on these processors to really wow people (and early rumors do suggest something special), and convince them to switch back to Intel.",
    "Via TechnoSports"
  ],
  "headers": {
    "3": "Oh dear, Intel",
    "8": "What can Intel do?"
  },
  "links": {
    "Ryzen 5000 series processors": "https://www.techradar.com/news/amd-ryzen-5000",
    "AMD Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "Amazon CPU best sellers list": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fbestsellers%2Fpc%2F229189%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1296022615974711300-20",
    "Intel Core i7-10700K": "https://www.techradar.com/news/intel-core-i7-10700k-vs-intel-core-i7-9700k-how-does-intels-10th-gen-chip-stack-up",
    "AMD Ryzen 7 3700X": "https://www.techradar.com/reviews/amd-ryzen-7-3700x",
    "similar reports": "https://www.techradar.com/news/amd-continues-domination-against-intel-as-cpu-demand-rises",
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "Intel Core i9-11900K": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "rumored to launch around September 2021": "https://www.techradar.com/news/intel-alder-lake-cpus-could-arrive-as-soon-as-september",
    "early rumors": "https://www.techradar.com/news/intel-isnt-messing-around-if-these-alder-lake-s-benchmarks-are-real",
    "TechnoSports": "https://technosports.co.in/2021/04/24/amd-ryzen-9-5900x-is-the-best-selling-cpu-on-amazon-us-even-though-its-800/"
  }
}