{
  "source": "https://www.techradar.com/news/3-apple-watch-7-leaks-you-need-to-know-about",
  "title": "3 Apple Watch 7 leaks you need to know about",
  "category": "wearables",
  "updated": "2021-07-12T19:00:02Z",
  "author": "david-lumb",
  "summary": "The biggest Apple Watch 7 rumors you need to see",
  "article": [
    "We have some big expectations for Apple’s next wearable, the Apple Watch 7 – and there are a few rumors we’ve heard that have us pretty excited.",
    "The Apple Watch 6 launched in September 2020 as an incremental upgrade on its predecessor, and the Apple Watch 5 only added a few, albeit important things like an always-on display on top of the Apple Watch 4.",
    "In other words, we wouldn’t be surprised if there were only a few new things coming to the Apple Watch 7.",
    "But so far, we’ve seen a few interesting rumors that give us a bit of an idea what exciting changes could be coming in Apple’s next wearable – here’s what we’ve heard.",
    "Yes, the upcoming Apple Watch 7 could have squared-off sides much like the iPhone 12, if these unofficial renders are to be believed. They’re supposedly based on leaked photos of the actual smartwatch, so gauge your skepticism accordingly.",
    "Otherwise, the watch seems to look identical to its predecessors, including the crown and app catalogue buttons on the right side.",
    "There’s nothing to suggest any functionality will change, nor any hint at additional sensors or other potential hardware improvements. But still, it would be huge news if true, as the biggest design shift since the first Apple Watch was released.",
    "Aside from square sides, there could be other design shifts to come in the Apple Watch 7. Noted Apple analyst Ming-Chi Kuo has predicted ‘significant form factor design change’ a couple times (via research notes seen by MacRumors and 9to5Mac).",
    "That could come in the form of a more rugged version of the Apple Watch, which could endure more extreme environments than the stock model. Could this be a distinct version of the Apple Watch 7?",
    "A rumor says that such a wearable is in development, but we’ll believe it when we see it – the company hasn’t really been in the business of releasing rugged alternatives to its exquisitely-designed products.",
    "To be clear, there are several health features that are rumored to come in the Apple Watch 7, but tracking blood sugar – which one report claims could come to many smartwatches in 2021, including Apple’s next – would be the most exciting.",
    "How the Apple Watch 7 would do so is unclear, given how most glucose monitors directly access the blood (often via needle) – which isn’t really something we could see Apple implementing.",
    "Regardless, blood sugar tracking could be very helpful for diabetics and other folks who need to pay attention to their glucose, and expand on the ECG and blood oxygen measurements introduced in the Apple Watch 5 and 6, respectively.",
    "While this feature may not arrive until the Apple Watch 8 in 2022, according to another report, it would be very exciting to see in the Apple Watch 7 coming later this year."
  ],
  "headers": {
    "4": "Squared-off sides?",
    "7": "A rugged version?",
    "10": "Blood sugar tracker?"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "pple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch 5": "https://www.techradar.com/reviews/apple-watch-5-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "unofficial renders": "https://www.techradar.com/news/see-this-apple-watch-7-leak-with-a-wild-looking-flat-edged-design",
    "MacRumors": "https://www.macrumors.com/2020/11/24/kuo-redesigned-apple-silicon-macbooks/",
    "9to5Mac": "https://9to5mac.com/2020/09/14/apple-watch-redesigned-120hz-iphone-13/",
    "rumor": "https://www.techradar.com/news/a-more-rugged-apple-watch-design-could-be-on-the-way",
    "report": "https://www.techradar.com/news/apple-watch-8-might-be-able-to-track-blood-sugar-and-alcohol-levels"
  }
}