{
  "source": "https://www.techradar.com/news/ibm-has-big-plans-for-the-future-of-quantum-computing",
  "title": "IBM has big plans for the future of quantum computing",
  "category": "computing",
  "updated": "2021-02-04T15:01:41Z",
  "author": "mayank-sharma",
  "summary": "And it wants to get there with the help of the open source community",
  "article": [
    "Technology giant IBM today unveiled its roadmap for quantum computing, including ambitious goals of applications running 100 times faster in the not too distant future.",
    "IBM argues that while it took classical computing many decades to get to where it is today, it is working to ensure that quantum computing makes that leap in a fraction of that time.",
    "To help it achieve the target, IBM hopes to rely on the open source ethos to mobilize developers, noting, “we know that software development is best done collaboratively, since open-source approaches are based around the understanding that an ecosystem of different human needs drives the best outcomes — and quantum computing is no different.“",
    "The latest quantum software roadmap follows a similar vision document from a hardware perspective in September last year in which the company aimed to improve the performance of quantum processors by 41 times by 2023.",
    "The challenge then is to write tools to allow developers to utilize this power for meaningful applications, which is what it has addressed in the new roadmap.",
    "Furthermore, IBM wants to allow developers to harness the power of quantum computers without having to learn new tools or languages. “All they need is a few lines to code to call a quantum API service on the cloud,” assures Jay Gambetta, IBM Fellow and Vice President, IBM Quantum.",
    "According to the document, the quantum software community is made up of many different developers, working at different levels, from the kernel up. “Our aim is to help orchestrate this ecosystem so multiple developers can contribute to each layer, each feeding the layer above, providing abstraction without trivialization,” adds Gambetta."
  ],
  "headers": {
    "3": "Empowering developers"
  },
  "links": {
    "quantum computing": "https://www.techradar.com/news/the-cios-guide-to-quantum-computing",
    "quantum software roadmap": "https://www.ibm.com/blogs/research/2021/02/quantum-development-roadmap/",
    "hardware perspective": "https://www.techradar.com/news/ibm-to-boost-performance-of-quantum-processors-by-41-times-in-three-years"
  }
}