{
  "source": "https://www.techradar.com/news/zoom-is-getting-a-makeover-for-the-hybrid-working-future",
  "title": "Zoom is getting a makeover for the hybrid working future",
  "category": "computing",
  "updated": "2021-08-25T10:18:38Z",
  "author": "mike-moore",
  "summary": "Changes are coming to Zoom Meetings, Phone and Chat",
  "article": [
    "Top video calling platform Zoom has announced a series of updates as it looks to cement its place as the perfect hybrid working companion.",
    "The video conferencing platform, which saw its user base skyrocket during the pandemic, has revealed upgrades to its Meetings, Phone and Chat platforms as it looks to help users around the world stay in touch.",
    "But the company also says its new release will help users secure and streamline their communications, as well as helping hosts ensure participants stay focused.",
    "It hopes to do the latter via an all-new Focus Mode, first revealed earlier this month. Designed with schools and university classes in mind, where participants can only see themselves, the call host/co-hosts, and the content they are sharing. Hosts and co-hosts can also choose to view participants in gallery view, enabling them to see all participants simultaneously.",
    "Elsewhere, business users will soon be able to seamlessly transition a Zoom meeting from mobile to desktop and back again, meaning there should be no need to juggle multiple devices when on the go.",
    "There's also gesture recognition support, which will spot when a user is raising their hand or giving a thumbs up to display a corresponding meeting reaction, making meetings more seamless.",
    "Zoom Chats themselves are also getting a significant upgrade aimed at streamlining communications across channels and making it easier to chat with friends, family and coworkers.",
    "Going forward, clear markers will be added to the chat sidebar to note whether a channel is public or private. The sidebar itself will also display fewer chats and channels per group, and users will now get the ability to expand the chat sidebar to see more chats and channels.",
    "Searching for specific users or messages is also getting a boost thanks to an updated search functionality which Zoom says creates an interface that is more familiar to existing users.",
    "For Zoom Phone users, there will now be more call queue visibility, giving admins more information on the top 10 extensions by call or minutes usage. Customers using shared lines will also benefit from greater security and privacy thanks to a new feature that blocks outside users from picking up or listening in to a held call.",
    "The new features will begin rolling out soon, with Zoom saying it hopes users everywhere can benefit."
  ],
  "headers": {
    "3": "Zoom updates"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Focus Mode": "https://www.techradar.com/news/zooms-new-focus-mode-wants-to-cut-out-distractions-for-home-learning-and-meetings"
  }
}