{
  "source": "https://www.techradar.com/news/diablo-developer-working-on-new-unannnounced-game",
  "title": "Diablo developer working on new unannnounced game",
  "category": "gaming",
  "updated": "2021-03-12T11:28:14Z",
  "author": "vic-hood",
  "summary": "Blizzard is hiring for an unannounced AAA multiplayer",
  "article": [
    "Blizzard appears to be working on a new, unannounced AAA multiplayer game which seems to have a first-person shooter element, according to recent job listings.",
    "According to Blizzard Senior Artist Dan John Cox on Twitter (spotted by our friends at GamesRadar), the studio is hiring developers to work on an \"unannounced AAA multiplayer project\" for console and PC. There are 16 listings at present for this unannounced project on Blizzard's Career site, including roles for a Combat Designer, Level Designer and Senior System Designer.",
    "The listings themselves give a slight indication of what we can expect from this upcoming game. The Combat Designer role is for someone with \"broad, extensive player experience with FPS and action games, both single-player and online\", while the Senior 3D Environment Artist role is to be filled by someone who can combine \"traditional art aesthetics with next-gen 3D authoring techniques to create a unique visual texturing style for environments that extend the boundaries of what's creatively possible\". The Lead Designer role listing states that the chosen person \"will create epic, memorable worlds\".",
    "While it's not much to go on, this would suggest Blizzard's unannounced AAA multiplayer title will be an FPS (or at least have elements of an FPS) and feature both an online and offline mode, with plenty of worlds to explore.",
    "In addition, the career listings suggest that Blizzard is also working on a new, unannounced mobile game.",
    "Given that Activision is a subsidiary of Blizzard, you may assume that this may be a new Call of Duty. But, the roles are for Blizzard Entertainment's headquarters in Irvine, California, while Activision Blizzard is based in Santa Monica - plus Activision hires on its own site.",
    "The job listings also suggest this is an entirely new IP, rather than a new entry in a series. It's unlikely Blizzard would announce this new game anytime soon, with the breadth of hiring suggesting that this new game is in very early development - if development has started at all.",
    "It's possible we'll get confirmation on what Blizzard has up its sleeve at BlizzCon 2022 - but, for now, we can only speculate."
  ],
  "headers": {
    "5": "It's definitely not Call of Duty"
  },
  "links": {
    "GamesRadar": "https://www.gamesradar.com/blizzard-is-developing-an-unannounced-aaa-multiplayer-game-with-epic-memorable-worlds/",
    "Blizzard's Career site": "https://careers.blizzard.com/global/en",
    "Combat Designer": "https://careers.blizzard.com/gb/en/job/R004071/Mid-Level-or-Associate-Combat-Designer-Unannounced-Project",
    "Level Designer": "https://careers.blizzard.com/global/en/job/R004060",
    "Senior System Designer": "https://careers.blizzard.com/global/en/job/R005177/Senior-Systems-Designer-Unannounced-Project"
  }
}