{
  "source": "https://www.techradar.com/news/oculus-go-gets-a-power-boost-a-year-after-being-discontinued",
  "title": "Oculus Go gets a power boost a year after being discontinued",
  "category": "vr",
  "updated": "2021-10-01T11:00:32Z",
  "author": "hamish-hector",
  "summary": "Long live the Oculus Go!",
  "article": [
    "Your old Oculus Go VR headset could be getting a power boost in the near future thanks to the efforts of ex-Oculus CTO John Carmack.",
    "Putting the message out on Twitter, recently John Carmack announced that an unlocked build of the Oculus Go OS will be made public soon, giving users full root access once it has been sideloaded on the device.",
    "As Carmack goes on to explain in a follow up Tweet this will allow users to get the most out of the Oculus Go’s hardware through overclocking / underclocking but will also mean that a “randomly discovered shrink wrapped headset twenty years from now will be able to update to the final software version”.",
    "Unfortunately if you don’t already have an Oculus Go you might struggle to get one as the device was discontinued in the middle of 2020 to make room for the Oculus Quest 2. While Go headsets do pop up on second-hand sites from time to time, we imagine they could become more valuable as news spreads of this new unlocked build.",
    "However, there are now hopes that something similar could now come to devices like the Oculus Quest 2. In response to a question Carmack said that while this policy is currently specific to Go, he hopes it sets a precedent for other models.",
    "If similar support does come to the Quest 2 we imagine it will arrive in several years once the current-gen hardware has been replaced.",
    "The Oculus Go was the VR headset that almost was. When it first released, we praised its decent standalone performance – which came at a much more affordable price than prior models.",
    "However, it was discontinued not long before the Oculus Quest 2 hit shelves, and with good reason as what the Quest 2 could achieve blows the Go out of the water. Yes the Quest 2 cost about twice as much as the Go but it offered significantly better specs and premium features like hand tracking. It even came with a second controller – can you believe it?",
    "We aren’t the only ones that loved the Oculus Quest 2, as within six months on sale it managed to surpass the total sales of all other Oculus headsets combined. The Oculus Quest 2 finally brought VR into the mainstream like the Go promised, offering a powerful device to the masses.",
    "This last hurrah for the Oculus Go will give its long-time supporters a chance to eek a little more power out of the headset, and might help them stave off needing a new headset until the Oculus Quest 3 is announced."
  ],
  "headers": {
    "6": "Analysis: Oculus Go's last hurrah"
  },
  "links": {
    "Oculus Go": "https://www.techradar.com/reviews/oculus-go",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs"
  }
}