{
  "source": "https://www.techradar.com/news/shang-chi-disney-plus-release-date",
  "title": "When is Shang-Chi coming to Disney Plus?",
  "category": "entertainment",
  "updated": "2021-12-02T14:28:59Z",
  "author": "tom-power",
  "summary": "Shang-Chi has arrived on Disney Plus",
  "article": [
    "Update: Shang-Chi is available to stream on Disney Plus from today (Friday, November 12)!",
    "Original story follows.",
    "Is Shang-Chi and the Legend of the Ten Rings getting released on Disney Plus? Many Marvel fans have asked this particular question ever since the MCU film's September 3 theatrical release. The short answer is yes: Friday, November 12.",
    "With the pandemic continuing to impact the movie industry (and the world as a whole), some MCU fans didn't feel comfortable going to see the superhero flick in cinemas. So some Marvel fans have waited to see if Shang-Chi will come to Disney Plus.",
    "If you're one of those who have been waiting to watch Shang-Chi and the Legend of the Ten Rings in your own home, you're in luck: Shang-Chi is coming to Disney Plus. More specifically, it'll be launching on the streamer as part of Disney Plus Day, which takes place tomorrow.",
    "Below, we'll explain the exact reason behind Shang-Chi's Disney Plus launch date. We'll also reveal why it didn't receive a simultaneous launch in cinemas and Disney's streaming platform.",
    "Yes. Shang-Chi and the Legend of the Ten Rings has an official release date on Disney Plus. As mentioned, the Marvel movie will arrive on the streaming service on Friday, November 12.",
    "Confirming the news on the official Disney Plus Twitter account, The Walt Disney Company revealed that Shang-Chi would arrive on the streamer on Disney Plus Day. This global celebration of all things Disney provides the studio with the perfect opportunity to release Shang-Chi in people's homes, so it isn't surprising that its release was held back for such a special occasion.",
    "In August, we reported that Shang-Chi had an exclusive theatrical release for 45 days following its September 3 release. At the time, we expected Shang-Chi to arrive in mid-October, but Disney took the decision to delay its release.",
    "No, Shang-Chi won't be a Premier Access release. It'll be free to watch for all Disney Plus subscribers when it arrives on November 12.",
    "That means that you'll have to own a Disney Plus subscription in order to watch it for free. If you're curious about signing up for one, you can find out how much it costs per month here. Right now, there's a major discount on a one-month Disney Plus subscription, too, so check that out if you want to make a major saving.",
    "It's unsurprising why studios have experimented with day-and-date movie releases. With the Covid-19 pandemic continuing to disrupt the film industry, it makes sense that they want to offer audiences with the choice over how to watch their newly released content.",
    "Despite this, though, Disney opted to release Shang-Chi exclusively in theaters – and they've been justified in that decision.",
    "To date, per Box Office Mojo, Shang-Chi has amssed $430 million worldwide since its September 3 launch. That's more than Black Widow and, depending on how Eternals and Spider-Man: No Way Home, Shang-Chi could be the biggest box office Marvel movie in 2021. Disney, then, should pay attention to Shang-Chi's box office success when it comes to making a firm decision on how it releases Marvel movies moving forward.",
    "Johansson's final outing as Natasha Romanoff was initially helped by the character's popularity. Black Widow has been a pillar of the MCU for over 10 years, so fans were expected to flock to see her belated solo movie. Black Widow's July release also came when Delta variant cases were lower, too, which will have aided the film's theatrical performance. Since then, though, Shang-Chi has overtaken Black Widow in ticket sales.",
    "So Disney has a decision to make over its release strategy. Some fans feel safer watching new MCU movies at home, so they still have to consider dual Disney Plus and theatrical launches. But Marvel films are made to be seen on the big screen – seeing them with friends and family beats watching them on a laptop or TV at home.",
    "Disney is likely to remain flexible for the time being. Covid-19 cases could rapidly rise again, so it'll want to be adaptable enough to any such changes. In order to stave off customer confusion about when and where fans can catch future Marvel movies, though, Disney needs to settle on a permanent blueprint – regardless of which one it chooses. With Eternals and No Way Home also receiving exclusive theatrical releases, it seems that they've finally settled on a permanent strategy."
  ],
  "headers": {
    "6": "Does Shang-Chi have a Disney Plus release date?",
    "9": "Will Shang-Chi be a Disney Plus Premier Access title?",
    "11": "Analysis: Shang-Chi's box office performance may end Disney's in-flux release strategy"
  },
  "links": {
    "Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "MCU film": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "watch Shang-Chi and the Legend of the Ten Rings": "https://www.techradar.com/news/how-to-watch-shang-chi-and-the-legend-of-the-ten-rings-online-from-anywhere",
    "Disney Plus Day": "https://www.techradar.com/news/disney-plus-day-how-to-watch-date-start-time-shang-chi-what-to-expect-and-more",
    "we reported": "https://www.techradar.com/news/could-shang-chis-delayed-release-on-disney-plus-affect-it-at-the-box-office",
    "Premier Access": "https://www.techradar.com/news/disney-plus-premier-access",
    "how much it costs per month here": "https://www.techradar.com/deals/disney-plus-price",
    "one-month Disney Plus subscription": "https://www.techradar.com/news/its-your-last-chance-to-make-the-most-of-rare-disney-plus-deal-this-weekend",
    "Box Office Mojo": "https://www.boxofficemojo.com/title/tt9376612/",
    "Eternals": "https://www.techradar.com/news/eternals-is-unlike-any-other-mcu-movie-so-far-and-thats-a-good-thing",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know"
  }
}