{
  "source": "https://www.techradar.com/news/totally-rated-does-the-apple-tv-4k-2021-live-up-to-the-hype",
  "title": "Totally Rated: does the Apple TV 4K 2021 live up to the hype?",
  "category": "gaming",
  "updated": "2021-05-28T15:39:22Z",
  "author": "rhys-wood",
  "summary": "Apple TV 4K (2021) and Biomutant feature on this week's Totally Rated",
  "article": [
    "We've got a delightfully varied episode of Totally Rated this week with a double bill of new products.",
    "In gaming, new release Biomutant has us going feral in a post-post apocalyptic world inhabited by anthropomorphic critters.",
    "It's a big week for streaming, too, as Apple has released its brand new Apple TV 4K streaming device, but does it live up to all the hype?",
    "After a long string of delays, Biomutant has finally released on PS4, Xbox One and PC. Originally announced all the way back in 2017, it seems those delays ultimately haven't done the game any favors.",
    "Sam Loveridge of GamesRadar found certain elements formulaic, saying:",
    "\"Every time you really enjoy a moment in Biomutant, it finds the capacity to frustrate you.",
    "\"Like the endless repetition of dialogue, side missions, and hidden areas.",
    "\"The assaults you mount as you try to unite the tribes are intensely formulaic. And yet, there are moments where the game's attention to detail is great, such as using the ice weapon will make enemies skid across the ground like an excerpt from a Ratchet and Clank adventure.",
    "\"It's such a shame, because there is a great game in here.",
    "\"Biomutant's world and its characters are wonderful and brilliantly silly, but these elements clash against some of the more serious elements of the core story.",
    "\"The intensely formulaic and repetitive moments distract from the brilliant ones that'll have you nodding in approval, or laughing at its bizarreness.",
    "\"And it all comes down to the fact it doesn't really know exactly what it is or wants to be. If you got Biomutant in a sale, you wouldn't be sad, but as a full-priced offering, it feels too confusing to easily recommend.\"",
    "PC Gamer's James Davenport was less forgiving of Biomutant:",
    "\"Biomutant is a boring game that survives on charm.",
    "\"What other open world game stars a bipedal mutant cat-thing that specializes in martial arts? This is an RPG in which you can leap from your grotesque, grinning horse, summon a ball of mucus around yourself to roll up your enemies like ants on a moist jawbreaker, 'detonate' the mucus to send them flying, and finish with a slow-motion Max Payne-esque volley of electric bullets from a gun with a trumpet horn for a muzzle.",
    "\"It's tragic, then, that hollow progression and an incessant narrator suck out so much of the joy in Biomutant.",
    "\"Biotmutant feels like it's going to be much more, but in practice it's an endless stream of new ideas that go nowhere and beautiful, toxic landscapes with little to offer except an excuse to use photo mode - I'm at 127 screenshots and counting.",
    "\"It's especially disappointing because Biomutant's nonchalant, optimistic vision of the post-apocalypse is a refreshing take on the end times, with a weasel dressed like Elvis for every fascist cannibal emperor in Fallout.",
    "\"But if you strip out the gangly, affable muppets, all that's left is a broken open-world RPG with little else to discover except another cheap riff on the same color-matching puzzle, plastered over a rotary phone or microwave or whatever. At least it looks amazing.\"",
    "Apple has released its 2021 version of the Apple TV 4K, and it boasts some pretty substantial improvements over its predecessors.",
    "Tom's Guide's Kelly Woo was quick to highlight the Apple TV 4K's improvements:",
    "\"On the Outside, the new Apple TV 4k looks like the original.",
    "\"It’s on the inside where everything has changed. It has a new A12 chip that gives it more power and faster performance. It now supports high frame rate HDR at 60 fps so video plays more smoothly with even greater detail.",
    "\"The best part of the new Apple TV 4k is the new Siri remote. The old remote had a terrible touchpad that was too sensitive. The new remote has a new click pad that still supports gestures but has actual buttons.\"",
    "TechRadar's Carrie-Ann Skinner added more praise for the device, saying:",
    "\"The Apple TV 4K (2021) is a slick streaming device, which can play 4K video in HDR and Dolby Vision, and supports high-frame-rate HDR to make fast action and sports look smooth and clear.",
    "\"The revamped Siri remote is a pleasure to use, and there are plenty of small but handy features, such as multi-user support and the ability to tweak your TV’s color balance automatically.",
    "\"There’s no denying it’s expensive, but it’s more than just a way to watch movies and TV shows, doubling up a smart home hub.\"",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every Thursday."
  ],
  "headers": {
    "3": "Biomutant is frustratingly charming",
    "19": "Apple TV 4K boasts substantial improvements"
  },
  "links": {}
}