{
  "source": "https://www.techradar.com/news/amd-threadripper-5000-64-core-processor-could-launch-as-soon-as-august",
  "title": "AMD Threadripper 5000 64-core processor could launch as soon as August",
  "category": "computing",
  "updated": "2021-07-12T10:38:15Z",
  "author": "matt-hanson",
  "summary": "Will it bring big upgrades?",
  "article": [
    "AMD’s super-powerful Threadripper series of processors could get a new entry as soon as August, if new rumors are to be believed.",
    "According to the MoePC website, the Threadripper 5000 series, code-named “Chagall”, is coming soon, however the upgrades may be a bit disappointing.",
    "While Threadripper 5000 processors are rumored to be based on the same Zen 3 architecture as AMD’s latest Ryzen 5000 CPUs are (or even an upgraded Zen 3+ architecture), it looks like there won’t be major changes when it comes to the number of cores on offer, with the flagship offering a still-mighty 64-cores, along with rumors of a potential 16-core CPU as well (alongside possible 24- and 32-core variants).",
    "The AMD Threadripper 5000 processors, according to the rumor, will still support DDR4 memory, and the TDP (Thermal Design Power) will remain the same at 280W. It’s also rumored they will support existing TRX40 motherboards, which is good news as it means that’s one less component to upgrade if you want those new chips.",
    "So are there any big changes rumored to be coming with these new Threadrippers? Well, apart from the move to Zen 3 architecture, which will bring performance increases over the third generation Threadrippers, the new ‘Chagall’ Threadrippers will have increased Inter-Chip Global Memory Interconnect (xGMI) speed from 16 GT/s to 18 GT/s, bringing it in line with AMD’s EPYC 7003 series server chips.",
    "So, while on the face of it, the new Threadrippers may not be a massive change (the rumored lack of DDR5 support could disappoint some, for example), under the hood we could see some decent performance gains – as long as these rumors are correct. If they are, then we won’t have too long to wait.",
    "Via Videocardz"
  ],
  "headers": {
    "4": "Any changes?"
  },
  "links": {
    "the MoePC website": "https://moepc.net/codenamed-chagall-amd-threadripper-5000-series-is-expected-to-be-released-in-august/",
    "Zen 3": "https://www.techradar.com/news/amd-zen-3",
    "DDR5": "https://www.techradar.com/news/ddr5-ram-has-officially-hit-the-shelves-but-you-shouldnt-buy-them",
    "Videocardz": "https://videocardz.com/newz/amd-ryzen-threadripper-5000-chagall-to-feature-xgmi-at-18-gt-s"
  }
}