{
  "source": "https://www.techradar.com/news/wear-os-smartwatches-might-finally-get-a-new-feature-but-its-not-a-great-one",
  "title": "Wear OS smartwatches might finally get a new feature - but it's not a great one",
  "category": "wearables",
  "updated": "2021-02-23T11:07:21Z",
  "author": "jitendra-soni",
  "summary": "Possibly just for developers.",
  "article": [
    "Google doesn't enjoy any sort of dominance in the smartwatch software market, with its Wear OS software failing to make waves, and infrequent updates are partly the reason for that. It sounds like Wear OS could finally get an update, but with a rather useless feature.",
    "According to 9to5Google, Google has a Wear OS update planned with some changes, but the main feature it brings is the ability to record the screen of your smartwatch. Wow, try not to set the world on fire there, Google.",
    "While any new feature is welcome, it's hard to fathom the practical use of sharing a screen recording of a tiny display. Wear OS already allows you to take screenshots, which some could argue is useful if you want to share how your home screen setup looks or share the current status of fitness activity.",
    "The Wear OS application teardown done by 9to5Google offers little information about this screen recording feature, and at this point in time it's not clear if users will be able to control the length of the recording, however, apparently this recording can be shared with your contacts via email.",
    "As it stands, it seems this new smartwatch feature is designed for app developers, so they can see how their app runs on a device and take recordings as evidence.",
    "However Wear OS users, clamoring for new features to justify their smartwatch choice over the myriad competitors from Apple, Mobvoi, Amazfit, Honor, Samsung or other smartwatch sellers, might only feel chagrin at this new, useless feature."
  ],
  "headers": {},
  "links": {
    "9to5Google": "https://9to5google.com/2021/02/22/wear-os-screen-recording/"
  }
}