{
  "source": "https://www.techradar.com/news/psychonauts-2-is-playable-and-coming-to-xbox-series-x-this-year",
  "title": "Psychonauts 2 is ‘playable’ and coming to Xbox Series X this year",
  "category": "gaming",
  "updated": "2021-04-20T14:15:23Z",
  "author": "rhys-wood",
  "summary": "Hopefully not a load of psychobabble",
  "article": [
    "Psychonauts 2 has been in the public consciousness since its announcement in 2015 at The Game Awards – but it's only now we're getting firm details on the launch date for the game, with developer Double Fine confirming that Psychonauts 2 is in a playable state and releasing sometime in 2021.",
    "Details have been scarce on Psychonauts 2 since its initial announcement, with the occasional gameplay trailer and press conference appearance reigniting interest in the game. Now, though, we may finally have a concrete release window.",
    "Through Twitter, Double Fine confirmed that Psychonauts 2 is releasing in 2021, and better yet, that it’s in a playable state. This likely means that the bulk of development has wrapped on Psychonauts 2, thus paving the way for its eventual 2021 release.",
    "Perhaps the standout version of Psychonauts 2 will be the optimized Xbox Series X / Xbox Series S release, which should allow players to experience the game at higher frame rates at 4K. Psychonauts 2 is also launching on last generation PS4 and Xbox One consoles as well as Windows PCs, Mac and Linux.",
    "Microsoft acquired Psychonauts 2 developer Double Fine in 2019, and made the company a part of its Microsoft Game Studios collective. This means that Psychonauts 2 will also be available on Xbox Game Pass on day one of release.",
    "We’re definitely excited to check out Psychonauts 2 when it eventually releases in 2021. One big selling point of the game for us is that School of Rock and Kung Fu Panda star Jack Black will be lending his voice to one of Psychonauts 2’s major characters. Black has previously worked with Double Fine on 2009’s metal-infused Brutal Legend, where he voiced protagonist Eddie Riggs."
  ],
  "headers": {
    "3": "Meeting of the minds"
  },
  "links": {
    "occasional gameplay trailer": "https://www.youtube.com/watch?v=G6SRtNZb_D4",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS4 and Xbox One": "https://www.techradar.com/news/gaming/consoles/ps4-vs-xbox-720-which-is-better-1127315",
    "Windows PCs": "https://www.techradar.com/news/the-best-gaming-pc",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Brutal Legend": "https://www.techradar.com/news/gaming/how-to-write-a-genuinely-funny-videogame-628552"
  }
}