{
  "source": "https://www.techradar.com/news/microsoft-now-lets-you-run-a-windows-11-desktop-in-the-cloud",
  "title": "Microsoft now lets you run a Windows 11 desktop in the cloud",
  "category": "computing",
  "updated": "2021-10-06T10:31:02Z",
  "author": "joel-khalili",
  "summary": "Who needs a new Windows 11 laptop, when you can have a PC in the cloud?",
  "article": [
    "Microsoft has announced that Windows 365 customers can now deploy cloud PCs running Windows 11, the company’s brand new operating system.",
    "According to a Microsoft blog post, Windows 11 is now supported across all cloud PC configurations with at least 2 vCPUs and 4GB RAM, of which there are eleven in total.",
    "The cheapest - with 2 vCPUs, 4GB RAM and 64GB storage - is available for $28.00 (or £23.90) per user per month.",
    "The only caveat is that Windows 11 cloud PCs are only available to Windows 365 Enterprise customers for the time being. Microsoft says smaller businesses (with fewer than 300 deployments) will gain access to Windows 11 cloud PCs “in the coming weeks”.",
    "Microsoft launched Windows 365 earlier in the summer, promising customers “a new way to experience Windows 10 or Windows 11”.",
    "The virtualization service allows users to stream a Windows desktop to any of their devices and from any location. Instead of hosting the operating system and applications locally, using up both storage and computing resources, Windows 365 lets users stream their apps, data and settings to any of their devices - including those that run on macOS, Linux and Android.",
    "According to Microsoft, the service opens up a host of new opportunities for businesses, from a cost, administration and productivity perspective.",
    "Although Windows 365 didn’t support Windows 11 cloud PCs at launch, customers will now be able to take advantage of the upgrades on offer with the new Microsoft OS, as well as the flexibility afforded by the PC-as-a-service model.",
    "In addition to provisioning brand new Windows 11 cloud PCs, administrators can also upgrade existing Windows 10-based deployments by changing the gallery image in Microsoft Endpoint Manager and triggering a reprovision.",
    "To check whether existing cloud PC deployments are compatible with Windows 11, administrators can consult the Work from anywhere dashboard in Endpoint analytics."
  ],
  "headers": {
    "4": "Windows 11 cloud PCs"
  },
  "links": {
    "Windows 365": "https://www.techradar.com/news/windows-365-release-date-features-and-everything-else-you-need-to-know",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8829565035772399000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fwindows-it-pro-blog%2Fwindows-365-enterprise-now-supports-windows-11%2Fba-p%2F2810334&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-now-lets-you-run-a-windows-11-desktop-in-the-cloud",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software"
  }
}