{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-launch-date",
  "title": "Surprise! Samsung Galaxy S21 will launch January 14 – a month early",
  "category": "phones",
  "updated": "2021-12-05T13:31:45.449Z",
  "author": "matt-swider",
  "summary": "Three new S21 phones are expected along with the leaked Galaxy Buds Pro and 'SmartTag' Bluetooth tracker",
  "article": [
    "The Samsung Galaxy S21 launch date is sooner than you may expect: January 14 is when the company will host its Galaxy Unpacked 2021 press conference, meaning we'll see its new 5G phones and accessories at virtual event.",
    "The Thursday, January 14 keynote starts at 10am EST / 7am PST / 3pm GMT (and Friday 2am AEST). All of the latest Samsung Galaxy S21 leaks point to the three new phones – the S21, Galaxy S21 Plus and Galaxy S21 Ultra – offering refreshes of the 11-month-old trio: the Galaxy S20, S20 Plus and S20 Ultra.",
    "You can watch on Samsung's site – just click the link below:",
    "Samsung is moving its usual late February announcement window up – perhaps due to the fact that MWC 2020 has shifted to late June, or that the Snapdragon 888 and Exynos 2100 chipsets are ready to go. It'll clash with the last day of CES 2021, too.",
    "Of course, Samsung's event invite doesn't name any of the phones we mentioned. It bills this invite for its semi-annual Samsung Galaxy Unpacked 2021 showcase, with the tagline 'Welcome to Everyday Epic'. But the event invite image clearly shows the recently leaked rear camera module in an opaque cube.",
    "Samsung's shift to an earlier launch date matches the tempo of the Galaxy S21 leaks we've been seeing almost daily. There's almost nothing left for Samsung to reveal.",
    "We're expecting Samsung to deliver phones in three screen sizes – 6.2, 6.7 and 6.9 inches – all with 120Hz adaptive displays and a smaller bottom bezel (goodbye chin). Rumors about its internal specs naturally lead to the Qualcomm Snapdragon 888 (US) or Exynos 2100 chipsets (everywhere else) and at least 8GB of RAM. We're still waiting to hear if it'll have expandable storage via a microSD card slot.",
    "The Galaxy S21 and S21 Plus rear cameras seem to be getting special treatment, according to several renders of the refined camera module. All with three lenses – presumed to be a 12MP main, 12MP ultra-wide and 64MP telephoto – appear in a flatter module this year, resulting in a slightly less pronounced camera bump.",
    "Samsung's Galaxy S21 Ultra is thought to have a different rear camera setup, with the 108MP main camera making a return from the S20 Ultra, along with either a 5x or 10x optical zoom, depending on which of the many rumors you want to believe. The Samsung Galaxy Note 20 really impressed us with the 5x optical zoom, so you should be happy either way.",
    "In a twist, the Galaxy S21 Ultra may also include an S Pen, the stylus that's previously been exclusive to Samsung's Galaxy Note series. If true, that would be a big reason to buy the most expensive version of the phone – and less of a reason to wait for a new Samsung Galaxy Note 21 presumably will launch in August 2021.",
    "This weekend we also got insight into a novel accessory that Samsung may launch on January 14: a Tile-like Bluetooth tracker called Samsung Galaxy SmartTag. It may be helpful for finding items like keys, backpacks and luggage that constantly go MIA. If the SmartTag tracker does get announced, Samsung will beat to market the yet-to-be-revealed Apple AirTag tracker that's been rumored for more than a year.",
    "A different leak outed a second Unpacked 2021-bound accessory this weekend: the Galaxy Buds Pro may put Samsung on equal footing with the AirPods Pro when it comes to true wireless earbuds with active noise cancellation and support for Dolby Atmos. The source of the leak? Samsung's own website.",
    "We'll have a Samsung Galaxy S21 live blog during the January 14 announcement and point you to the official Samsung Unpacked 2021 live stream. Until then, we're sure there are a half-dozen more Galaxy S21 leaks waiting to spoil the press conference."
  ],
  "headers": {
    "5": "Samsung Galaxy S21 specs all but confirmed",
    "9": "A twist or two"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "5G phones": "https://www.techradar.com/best/best-5g-phones",
    "accessories": "https://www.techradar.com/news/samsung-galaxy-s21-launch-date",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "S20 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s20-plus-review",
    "S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "MWC 2020": "https://www.techradar.com/news/mwc-2020-is-cancelled-everything-you-need-to-know-about-what-happens-next",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "almost nothing left": "https://www.techradar.com/news/official-samsung-galaxy-s21-teasers-have-leaked-confirming-minimal-camera-bump",
    "if it'll have expandable storage": "https://www.techradar.com/news/samsung-galaxy-s21-could-remove-the-expandable-storage-option",
    "Samsung Galaxy Note 20": "https://www.techradar.com/reviews/samsung-galaxy-note-20-review",
    "Galaxy S21 Ultra may also include an S Pen": "https://www.techradar.com/news/samsung-galaxy-s21-ultra-may-support-the-s-pen-but-not-in-the-way-youd-expect",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Tile": "https://www.techradar.com/news/these-new-tile-trackers-mean-theres-even-less-excuse-for-losing-your-keys",
    "Samsung Galaxy SmartTag": "https://www.techradar.com/news/samsung-galaxy-s21-smarttag-bluetooth-tracker-launch",
    "Apple AirTag": "https://www.techradar.com/reviews/apple-airtag-review",
    "different leak": "https://www.techradar.com/news/samsung-galaxy-buds-pro-appear-on-the-brands-site-ahead-of-rumored-launch",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around"
  }
}