{
  "source": "https://www.techradar.com/news/i-cant-wait-to-play-this-xbox-series-x-exclusive-with-the-ps5-dualsense-controller",
  "title": "I can't wait to play this Xbox Series X exclusive with the PS5 DualSense controller",
  "category": "gaming",
  "updated": "2021-11-12T02:44:32Z",
  "author": "adam-vjestica",
  "summary": "Opinion: All within my hands",
  "article": [
    "The Medium was one of the few genuine Xbox Series X and Xbox Series S exclusives available for Microsoft’s console when it launched back in January this year (it isn’t available on Xbox One), but now the psychological horror game is coming to PS5 with full support for the DualSense controller.",
    "Developer Bloober Team believes that the DualSense’s unique features should make The Medium more immersive on PS5, as the controller will act as “an extension of your senses”. And I must admit, I’m tempted to play the game again simply because of Sony’s next-gen controller.",
    "In the video below, Bloober Team highlights exactly how the DualSense controller will enhance the game, such as how haptic feedback provides the weird sensation of a swarm of moths hitting the barrier of your spirit shield, how the lightbar flickers when an enemy is nearby, and how you can use the DualSense’s touchpad or motion controller for a more intuitive experience when investigating clues.",
    "The PS5’s clever DualSense controller continues to add that extra bit of magic to PlayStation 5 games that I can’t help but miss when playing Xbox Series X games – and more importantly – the DualSense continues to be supported by developers, despite my initial pessimism that it would be largely ignored. Thankfully, its widespread support has also helped benefit one of the Xbox Series X controller’s criminally underutilized features as a result.",
    "It may seem gimmicky to some, but I really enjoy the little additions and quirks the DualSense adds to an experience. It really shines in games like Returnal and the fantastic pack-in title, Astro’s Playroom, wouldn’t be the same without it. There’s no doubt in my mind that it’s a selling point when it comes to third-party titles, though not every game takes full advantage of what Sony’s pad can do.",
    "The DualSense controller hasn’t just impressed players, though. Microsoft’s head of Xbox Phil Spencer has also acknowledged that he’s a fan of Sony’s DualSense, and hinted that DualSense-like features could come to Xbox controllers in the future. A survey from Microsoft also suggested the company was polling players to gauge interest in adding DualSense features to its controller.",
    "The Medium is set to release on PS5 on September 3, 2021. The game is also available on Xbox Series X, Xbox Series S and PC, and Xbox Game Pass subscribers can download the game for free as part of their subscription."
  ],
  "headers": {
    "5": "A not so secret admirer"
  },
  "links": {
    "The Medium": "https://www.techradar.com/reviews/the-medium",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense controller": "https://www.techradar.com/how-to/how-to-use-the-ps5-dualsense-controller-on-a-pc",
    "haptic feedback": "https://www.techradar.com/how-to/how-to-turn-off-ps5-adaptive-triggers-and-haptic-feedback",
    "it would be largely ignored": "https://www.techradar.com/news/the-dualsense-ps5-controller-is-packed-with-features-but-they-wont-get-used",
    "one of the Xbox Series X controller’s criminally underutilized features": "https://www.techradar.com/news/the-ps5s-best-feature-is-finally-getting-the-most-out-of-the-xbox-controller",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Astro’s Playroom": "https://www.techradar.com/news/astros-playroom-will-make-you-fall-in-love-with-the-ps5-dualsense-controller",
    "DualSense-like features could come to Xbox controllers": "https://www.techradar.com/news/ps5s-dualsense-could-inspire-updates-to-the-xbox-controller-says-phil-spencer",
    "DualSense features to its controller": "https://www.techradar.com/news/xbox-series-x-survey-asks-if-you-want-ps5-dualsense-features-on-its-controller",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}