{
  "source": "https://www.techradar.com/news/microsoft-gives-diehard-internet-explorer-fans-a-passive-aggressive-nudge",
  "title": "Microsoft gives diehard Internet Explorer fans a passive aggressive nudge",
  "category": "computing",
  "updated": "2021-06-15T11:25:23Z",
  "author": "joel-khalili",
  "summary": "Inexplicably, Internet Explorer still has millions of active users",
  "article": [
    "Since Microsoft announced it would be killing off Internet Explorer (IE), the company has tried almost everything in its power to encourage users away from the now-defunct web browser.",
    "However, while the IE install base has halved since plans for a phased termination were revealed, data from Statcounter suggests the browser still has millions of active users.",
    "Now, Microsoft is taking steps to cut away the last remaining use cases for IE. According to the company’s product roadmap, certain file types will soon begin to launch automatically in Microsoft Edge (the company’s new flagship browser) instead of its predecessor.",
    "“Starting in Microsoft Edge version 92, MHTML file types will automatically open in Internet Explorer mode on Microsoft Edge instead of the Internet Explorer 11 application,” the company explained.",
    "According to Microsoft, this type of file appears most commonly in scenarios in which users open Outlook emails via their browser.",
    "The change will take effect with the next iteration of Microsoft Edge, which is set to go live next month, but will only be applied if Internet Explorer is set as the default handler for MHTML files.",
    "Internet Explorer has long been the butt of jokes in the technology community, ridiculed for its speed issues and clunky user interface. The move to retire the browser, which first hit the scene in 1995, can be seen as an admission of its growing irrelevance to modern users.",
    "The file-handling tweak is the latest in a long line of changes designed to give remaining IE users a shove in the right direction.",
    "For example, in October, Microsoft announced that websites that are no longer compatible with the older browser would launch automatically in Edge. Thousands of sites fall into this category, including popular services Twitter, Instagram, Google Drive, Yahoo Mail.",
    "Not only will certain webpages now redirect automatically to Edge, but Microsoft is also continuing to drop Internet Explorer support from its various software and services.",
    "As of November 2020, users were no longer able to log into their Microsoft accounts via Internet Explorer, nor the Microsoft Teams web app. By August 17 2021, no Microsoft 365 app will be compatible with the browser.",
    "After this final deadline has passed, users of the unsupported web browser will suffer a “degraded experience”; new Microsoft 365 features will be unavailable and existing web apps will be disabled."
  ],
  "headers": {
    "6": "Internet Explorer end-of-life"
  },
  "links": {
    "killing off Internet Explorer": "https://www.techradar.com/news/microsoft-is-finally-killing-off-internet-explorer",
    "web browser": "https://www.techradar.com/best/browser",
    "Statcounter": "https://gs.statcounter.com/",
    "product roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1459570839408651300&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D84190",
    "Outlook": "https://www.techradar.com/reviews/microsoft-outlook",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review"
  }
}