{
  "source": "https://www.techradar.com/news/norco-releases-a-trio-of-ultra-powerful-new-e-bikes-for-tackling-serious-climbs",
  "title": "Norco releases a trio of ultra-powerful new e-bikes for tackling serious climbs",
  "category": "fitness",
  "updated": "2021-07-28T10:24:40Z",
  "author": "cat-ellis",
  "summary": "E-MTBs with some of the biggest battery capacities around",
  "article": [
    "Canadian e-bike maker Norco has released a trio of new mountain bikes with swappable battery packs ranging from 540Wh to 900Wh – which Electric Bike Report explains is one of the highest capacities of any e-bike battery currently available.",
    "Each electric mountain bike (e-MTB) in the new Norco VLT series was designed around the batteries, which slide in and out of the downtube for easy charging and changing. The new Sight VLT is an e-MTB built for tough descents, the Fluid VLT is optimized for trail riding, and the Range VLT gives speed on the ascents.",
    "E-bikes are subjected to more forces than regular bicycles. This can cause earlier wearing of components, which can easily go unnoticed as the bike's motor masks a drop in performance.",
    "To manage that, Norco's new e-MTB line-up include reinforced rims and spokes, optimized single-click gear shifters, and hydraulic disc brakes with four-piston callipers to help you manage your speed and dissipate heat. Charge ports have tough weather-proofing, and all bikes have tires with a sticky rubber compound to provide additional grip.",
    "The Sight and Range are available with a choice of carbon or aluminum frames, and the Fluid is aluminum only.",
    "Prices for the new bikes start at $4,199 (about £3,000 / AU$5,800). The 540Wh, 720Wh and 900Wh batteries are sold separately for $749 (about £540 / AU$1,000), $999 (about £720 / AU$1,400) and $1,199 (about £860 / AU$1,600) respectively.",
    "Capacity isn't the only factor that affects your e-bike's range – the total weight of you, the bike and the battery will also have an impact, as will your own power output, the riding conditions, the amount of climbing involved, the ambient temperature, and more – so it's impossible to say exactly how far you'll be able to ride on a single charge. Nevertheless, stats for the new Norco bikes look impressive.",
    "Whereas most e-bikes are tested in ideal conditions so the manufacturer can quote the optimum range in its stats, Norco tested its bikes on real trails to determine the actual performance you can expect (provided you're as fit as the company's test rider).",
    "When set to eco mode, the 900Wh battery lasted 39 miles on a tough, mountainous course with an elevation of 3,500 meters. For comparison, our current top-rated e-bike, the Cowboy 4, has a 360Wh battery and a quoted range of 43.5 miles, but that's ridden in optimum conditions on flat, smooth roads.",
    "E-bikes are great for city riding, making it easier to keep pace with traffic, move off at intersections, and arrive at your destination without breaking a sweat. In fact, most of the models in our roundup of the best e-bikes are built for the streets – but pedal-assisted bikes also have a home off-road.",
    "For one, they open up mountain biking to a more diverse range of riders, and help mixed abilities ride together – whether it's a group of friends or parents and kids, the addition of a battery pack and motor helps balance out differences in fitness.",
    "Perhaps obviously, an e-MTB can also help you ride for longer, exerting less energy on the inclines so you can stay fresher. It makes the inclines more enjoyable too, and helps you keep going when you'd normally have to quit and push.",
    "There are disadvantages, too. E-MTBs can be seriously expensive (as Norco's new line-up demonstrates), and are typically weighty beasts as well. Even with meticulous use of carbon and aluminum, the battery will always add a serious amount of weight, making the bike more awkward to carry and generally travel with.",
    "This can also make them a real chore to ride without assistance – which is another reason high capacity batteries like Norco's are so important. You don't want to be struggling in the woods with over 30kg of bicycle on your hands."
  ],
  "headers": {
    "6": "Going the distance",
    "9": "Analysis: e-MTBs make a lot of sense (usually)"
  },
  "links": {
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "Norco": "https://www.norco.com/",
    "Electric Bike Report": "https://electricbikereport.com/e-bike-news-new-e-bikes-from-rad-power-bikes-dahon-gt-and-norco/"
  }
}