{
  "source": "https://www.techradar.com/news/how-to-watch-ufc-269-time-card-oliveira-vs-poirier-live-stream",
  "title": "How to watch UFC 269: time, card and Oliveira vs Poirier live stream details",
  "category": "entertainment",
  "updated": "2021-12-10T17:05:34Z",
  "author": "kevin-lynch",
  "summary": "Lightweight title clash headlines stacked card in Las Vegas",
  "article": [
    "It's a pretty unforgiving match up for Charles Oliveira for the first defence of his title, with the lightweight champ taking on Dustin Poirier this weekend in Las Vegas. Read on to discover how to watch UFC 269 and an Oliveira vs Poirier live stream, plus the rest of the card online with ESPN+ having exclusive coverage in the US.",
    "Oliveira was crowned champ back in May after dispatching Michael Chandler via a second-round knock out, but comes into this fight as the underdog with many pundits.",
    "Poirier has been in line for a shot at the title since last year, but instead opted for the big payday of a trilogy rematch in the summer with Conor McGregor.",
    "Having beaten the Irish star for a second time, the pound-for-pound ranked number 5 fighter is at last taking the opportunity for a title shot.",
    "That fight headlines a ridiculously packed bill that also includes two-division Women's champ Amanda Nunes returning to defend her bantamweight crown for the first time since 2019.",
    "Follow our guide below as we explain how to get a UFC 269 live stream online - plus key details like the Oliveira vs Poirier time, and the cheapest way to get a UFC live stream today.",
    "Oliveira vs Poirier takes place at UFC 269, which is scheduled for Saturday, December 11. The UFC 269 early prelim card is scheduled to begin at 6.15pm EST / 3.15pm PST / 11.15pm GMT / 10.15am AEDT, with the prelims kicking off at 8pm EST / 5pm PST / 1am GMT / 12am AEDT.",
    "The UFC 269 main card is slated to start at 10pm EST / 7pm PST / 3am GMT (Sun) / 2pm AEDT (Sun) - with Oliveira vs Poirier expected to enter the Octagon no earlier than 11.30pm EST / 8.30pm PST / 4.30am GMT (Sun) / 3.30pm AEDT (Sun).",
    "While many are tipping Poirier to ease his way to the title this weekend, more considered UFC observers will have noted that Oliveira is a fighter on the up and will likely provide a far greater threat than McGregor did across those bitter trilogy grudge matches.",
    "Oliveira has a well-earned reputation as one of the UFC’s best finishers, but will be hoping to quiet critics who have accused him of avoiding the best in the division with a win here.",
    "Poirier won't provide an open target in the way the defence-shy Michael Chandler did during his title-winning triumph earlier this year, meaning we could be in store for a fight of the year contender.",
    "Having worked his way up the ranks in a number of Brazilian promotions, Oliveira made his UFC debut in 2010, but was initially written off as a middling contender, chalking up an unimpressive 10-8 record between 2012 and 2017.",
    "The 31-year-old went on to elevate his reputation with an eight-fight win streak that earned him a title fight earlier this year against Michael Chandler, taking the opportunity to claim the belt in resounding style with a second round knock out.",
    "Nicknamed 'The Diamond', the former interim Lightweight champion's storied career has seen him claim wins over four former UFC champions.",
    "He boasts an impressive 28 wins, with 21 by knockout or submission. Poirier remains a force to be reckoned with, with his raw power for all to see in his trilogy victories over Conor McGregor.",
    "Despite Oliveira's champion status, it's the challenger who leads the betting, with Poirier coming in around the 5/4 mark to take the belt, while the Brazilian incumbent is currently drifting around 8/13 to retain his title with most bookies.",
    "Poirier last stepped in the Octagon in July at UFC 264 for the final bout of his three-fight trilogy against Conor McGregor, with the 32-year-old securing victory over Notorious following a dramatic doctor stoppage that came after the Irish fighter broke his leg in the first round.",
    "Oliveira's last fight was his title-winning victory over Michael Chandler in Houston back in May at UFC 262, which saw him claim the vacant lightweight title with a second round knock out.",
    "Beyond the much anticipated headline act, the full line up for UFC 269 is arguably one of the best bills put together by the promotion this year.",
    "The co-headline act sees all-time women's MMA great Amanda Nunes looking to retain her bantamweight title against Julianna Pena, while the intriguing men's bantamweight clash between Raulian Paiva and “Sugar” Sean O’Malley as the main card opener looks the perfect choice for setting the tone of what looks set to be an explosive night's worth of MMA action.",
    "Full UFC 269 card for Saturday, December 11",
    "MAIN CARD",
    "Charles Oliveira vs. Dustin Poirier (Men's lightweight title fight)",
    "Amanda Nunes vs. Julianna Pena (Women’s bantamweight title fight)",
    "Geoff Neal vs. Santiago Ponzinibbio",
    "Kai Kara-France vs. Cody Garbrandt",
    "Raulian Paiva vs. Sean O’Malley",
    "PRELIMS",
    "Josh Emmett vs. Dan Ige",
    "Dominick Cruz vs. Pedro Munhoz",
    "Augusto Sakai vs. Tai Tuivasa",
    "Jordan Wright vs. Bruno Silva",
    "EARLY PRELIMS",
    "Andre Muniz vs. Eryk Anders",
    "Erin Blanchfield vs. Miranda Maverick",
    "Alex Perez vs. Matt Schnell",
    "Ryan Hall vs. Darrick Minner",
    "Randy Costa vs. Tony Kelley",
    "Gillian Robertson vs. Priscila Cachoeira"
  ],
  "headers": {
    "6": "When is Oliveira vs Poirier? UFC 269 date and time",
    "8": "Oliveira vs Poirier preview and predictions",
    "11": "Who is Charles Oliveira?",
    "13": "Who is Dustin Poirier?",
    "15": "Oliveira vs Poirier latest odds: who is the favorite to win?",
    "16": "Oliveira vs Poirier: recent results",
    "18": "UFC 269 full card and highlights"
  },
  "links": {
    "ESPN+ having exclusive coverage in the US": "https://go.web.plus.espn.com/c/221109/718846/9070?subId1=trd-us-6970550132597092000&sharedId=trd-us&u=https%3A%2F%2Fplus.espn.com%2Fufc%2Fppv"
  }
}