{
  "source": "https://www.techradar.com/news/what-time-is-marvels-what-if-released-on-disney-plus",
  "title": "What time is Marvel's What If...? episode 2 released on Disney Plus?",
  "category": "entertainment",
  "updated": "2021-08-17T09:10:45Z",
  "author": "tom-power",
  "summary": "What If...? episode 2 is a bittersweet reunion",
  "article": [
    "Marvel's What If...? episode 2 is nearly here. The next standalone entry in the anthology animated TV show lands on Disney Plus on Wednesday, August 18 – and it's set to be a bittersweet reunion for Marvel fans.",
    "The second entry in Marvel's What If...? series will reunite us with the late Chadwick Boseman, who passed away after a four-year battle with colon cancer in August 2020. The iconic Black Panther star lent his voice to four of What If...?'s nine episodes and the first of those performances arrives in this week's instalment.",
    "What If...? episode 2 follows an alternate reality version of T'Challa (Boseman), who is accidentally kidnapped by Yondu (Michael Rooker) and his Ravagers gang instead of Peter Quill. With T'Challa growing up to become this universe's version of Star Lord, episode 2 will look at how he shapes the galaxy with his benevolent personality – and the lives he changes along the way.",
    "Below, we've explained what time What If...? episode 2 will arrive on Disney Plus. Additionally, you'll find a full release schedule for every entry in the animated series, so you can see when each instalment will land on the streamer.",
    "Episode 2 of Marvel's What If...? will launch on Disney Plus on Wednesday, August 18 at 12AM PT/ 3AM ET/ 8AM BST/ 12:30PM IST.",
    "That means US viewers will have to stay up late if they want to catch the next entry as soon as it's available. UK and European audiences may be able to check it out before they go to work, while India-based Marvel fans can watch it on their lunch break (if you're sneaky enough).",
    "If you won't be watching it until Wednesday evening (or even later), make sure you mute words and hashtags including '#WhatIf' on social media so you don't have it spoiled for you.",
    "To find out what the full release schedule for What If...? is, read on.",
    "Like every other Marvel TV show to date, What If...? episodes will be released weekly. If you want to binge watch the entire series in one go, then, you'll have to wait until early October to do so.",
    "There are nine episodes in the first season of Marvel's What If...?, so check out when each new entry will be available to stream. Bookmark this page, too, so you can keep tabs on when new episodes land on Disney Plus."
  ],
  "headers": {
    "4": "When does Marvel's What If...? episode 2 arrive on Disney Plus?",
    "8": "Marvel's What If...? full release schedule"
  },
  "links": {
    "Marvel's What If...?": "https://www.techradar.com/news/inside-marvels-what-if-the-disney-plus-animated-show-that-reshapes-the-mcu",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}