{
  "source": "https://www.techradar.com/news/specializeds-latest-e-bike-is-built-for-shredding-the-trails-and-your-wallet",
  "title": "Specialized's latest e-bike is built for shredding the trails (and your wallet)",
  "category": "fitness",
  "updated": "2021-03-24T16:14:48Z",
  "author": "cat-ellis",
  "summary": "A super premium off-roader with a price to match",
  "article": [
    "Specialized has launched a new premium electric mountain bike, the new Levo, with updated geometry and a light carbon frame for optimum maneuverability – if your budget can stretch to it.",
    "The handling of electric mountain bikes often suffers due to the space occupied by the motor, which means longer chainstays. These result in a bike that's more stable at speed, but less good for fast cornering on twisty trails.",
    "For the new Levo, Specialized has got around that problem with a smaller rear wheel that allow for shorter chainstays and a shorter wheelbase for more agile handling.",
    "You can also tweak the bike's geometry to suit your riding style and preferred terrain, with three head-tube angles and adjustable bottom bracket height.",
    "To make sure the battery doesn't run flat partway through your ride, the Specialized Mission Control App lets you enter how long you want to spend on the trails (or how far you want to go), and how much power you want for the return journey.",
    "The MasterMind Mission Control Unit will then handle the power management, monitoring the bike every 10 seconds so you'll be left with enough charge to get back home afterwards.",
    "All of that comes at a price, of course. There are three Levo models to choose from: the Pro and S-Works are available now for £10,750 (about $15,000 / AU$20,000) and £13,000 (about $18,000 / AU$23,000) respectively, and the Expert will go on sale later this year for £8,750 (about $12,000 / AU$16,000).",
    "For comparison, our top-rated electric bike, the Ribble Hybrid AL e, costs a relatively modest £2,000 (about $2,800 / AU$3,600).",
    "If you like the idea of tearing up the trails with a little power assistance, but can't run to that sort of cash, Specialized has a wide range of other off-road e-bikes, starting at £2,500 (about $3,400 / AU$4,500)."
  ],
  "headers": {
    "4": "Mission Control"
  },
  "links": {
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "a wide range of other off-road e-bikes": "https://www.specialized.com/gb/en/shop/bikes/turbo-e-bikes-its-you-only-faster/c/ebikes#/filter:categoryproperty:Mountain"
  }
}