{
  "source": "https://www.techradar.com/news/searching-your-gmail-inbox-is-about-to-become-way-faster-on-android",
  "title": "Searching your Gmail inbox is about to become way faster on Android",
  "category": "computing",
  "updated": "2021-09-21T21:30:46Z",
  "author": "anthony-spadafora",
  "summary": "New search filters can be used independently or applied post-search",
  "article": [
    "Finding the exact email you're looking for in your inbox is about to get a whole lot easier in Gmail on Android thanks to a new update from Google.",
    "Up until now, searching through your inbox in the search giant's email service on mobile was a bit of a hassle due to the lack of any filters. On Gmail for desktop though, users are able to filter by recipient, subject, keywords or lack of keywords, email size and date.",
    "In a new post on the Google Workspace blog, Google has revealed that improved search is now rolling to Gmail on Android.",
    "Gmail users will now be able to quickly and easily filter email and search results on their Android smartphones to find specific emails or information they're looking for.",
    "These new search filters can also be used independently or post-search as they appear as drop-down lists. Once this update rolls out to your device, you'll see buttons for “From”, “Sent to”, “Date” and “Attachments” after entering a search term to help you find exactly what you're looking for.",
    "Additionally, when searching for emails by sender, Gmail users can choose from a list of suggested senders or search for emails from multiple senders.",
    "As more of our work is increasingly done on mobile, giving Android users the same tools they have on Gmail for desktop will likely help boost their productivity as they won't have to waste time searching through multiple emails to find the information they're looking for."
  ],
  "headers": {
    "3": "Filtering search results"
  },
  "links": {
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "new post": "https://workspaceupdates.googleblog.com/2021/09/improved-search-in-gmail-on-android.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "Android smartphones": "https://www.techradar.com/best/best-android-phones",
    "productivity": "https://www.techradar.com/best/best-productivity-apps"
  }
}