{
  "source": "https://www.techradar.com/news/gran-turismo-7-gets-a-fancy-new-trailer-but-still-doesnt-have-a-release-date",
  "title": "Gran Turismo 7 gets a fancy new trailer – and it's out March 2022",
  "category": "gaming",
  "updated": "2021-09-09T20:39:14Z",
  "author": "adam-vjestica",
  "summary": "Start your engines",
  "article": [
    "Gran Turismo 7 was spotlighted at Sony’s PlayStation Showcase 2021 event, and the latest trailer showed off the game's stunning implementation of ray-traced reflections. We also got a glimpse of the game's livery editor, new cars, tracks, photo mode, single-player campaign, and some fresh gameplay footage behind the wheel.",
    "Weirdly, no release date was shared during the PlayStation conference, but after the event came to a close, Head of PlayStation Studios Herman Hulst confirmed the game will be out March 4, 2022.",
    "Gran Turismo was originally positioned as a PS5 exclusive and was tipped to release in 2021. However, Sony revealed back in June on the PlayStation Blog that the game would not only miss its 2021 release window thanks to delays caused by the coronavirus pandemic. but that it would also be coming to PS4 and PS4 Pro.",
    "Sony will not offer a free next-gen upgrade to those who buy the PS4 version of Gran Turismo 7, though. If you want to get the PS5 version, you can upgrade the game digitally for $10/£10. The company will offer a free PS5 upgrade for Horizon Forbidden West, however, after it received some notable backlash from fans. Gran Turismo 7 is set to be released on PS4, PS4 Pro, and PS5 on March 4, 2022. It's expected to cost $70 / £70, which is in line with every PlayStation Studios exclusive released so far."
  ],
  "headers": {},
  "links": {
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "PlayStation Showcase 2021 event": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "ray-traced": "https://www.techradar.com/news/ray-tracing",
    "PlayStation Blog": "https://blog.playstation.com/2021/06/02/hermen-hulst-qa-whats-next-for-playstation-studios/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "you can upgrade the game digitally for $10/£10": "https://www.techradar.com/news/sony-backtracks-horizon-forbidden-west-ps5-upgrade-which-will-now-be-free",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer"
  }
}