{
  "source": "https://www.techradar.com/news/windows-10-is-finally-embracing-hdr-but-what-took-it-so-long",
  "title": "Windows 10 is finally embracing HDR - but what took it so long?",
  "category": "computing",
  "updated": "2021-05-22T14:00:00Z",
  "author": "rhys-wood",
  "summary": "Opinion: Windows 10 is finally improving HDR, but why did it take so long?",
  "article": [
    "It’s finally happening. Microsoft is improving HDR support for Windows 10 in an update later this year. Likely, this will be part of the Windows 10 Sun Valley UI refresh expected to roll out in the latter half of 2021. The feature is even available to preview right now, if you’re enrolled in the Windows 10 Insider program, which lets users test upcoming builds before release.",
    "HDR is largely considered an upgrade to sRGB, which restricts displays to outputting a comparatively limited color space. By comparison, HDR (or high dynamic range), unlocks that space to display a much wider, vibrant and more accurate range of colors. This makes HDR ideal for creative types, be that image and photo editors on Lightroom or digital artists using programs like Clip Studio Paint.",
    "HDR, of course, has been a mainstream display feature for years now, and HDR monitors are available to buy without breaking the bank. But this just begs the question: with HDR easier to come by than ever, why has it taken Windows so long to fully embrace it?",
    "HDR support on Windows 10 has never been stellar. The feature is simply underdeveloped for the OS, with many users reporting issues like washed out colors, poor compatibility with GPU color options or just flat out refusing to be enabled in certain games and programs. Overall, the consensus is that HDR is wildly inconsistent on Windows 10, as pointed out by many a forum thread.",
    "When you think about it, though, it’s not much of a surprise that Microsoft has waited until now to announce its HDR improvements. Given the sorry state of the feature that’s in current Windows 10 builds, it would likely take a decent amount of development time to properly fix and implement.",
    "It’s possible that HDR just wasn’t all that much of a priority for Windows 10, too. Unlike a platform like Xbox, Windows 10 doesn’t need to impress by making games and programs looking as good and sharp as possible. As an operating system, Windows 10 has to nail function above all else.",
    "HDR is more accessible than ever, but like 4K is still something of a luxury feature and likely wouldn’t be priority one for the dev team. But I would argue that maybe it should have been, because that could have given Windows an edge over its competitors.",
    "For example, Macs have always been pitched as the creative’s alternative to Windows. It’s a selling point that makes products like the MacBook Pro fly off the shelves as they feature a robust suite of best-in-class creativity programs.",
    "What could Microsoft do to compete with that, if they wanted to attract even more creative types to Windows 10? Full HDR integration would be a great start. Perhaps Microsoft can’t meet Apple’s high standards when it comes to the bespoke programs that company offers, but it can beat them on quality of life features like HDR. Actually, this sounds familiar…",
    "Microsoft’s Xbox division has arguably spearheaded the implementation of HDR on consoles, with the Xbox Series X impressing with not only full HDR support, but also Auto HDR. This feature retroactively adds HDR to games that don’t support it by default, such as backwards compatible titles from the Xbox 360 era.",
    "This focus on pushing the boundaries of great features like HDR grants Xbox a unique selling point over its closest competitor: Sony and the PS5. Xbox cannot hope to match the PS5 in terms of the quality of its exclusives. But what it can do is push the boat out on features that benefit its software in other impactful ways.",
    "That’s exactly the position Windows finds itself in here, and why Microsoft should have magnified its focus for HDR on the OS sooner. By properly integrating HDR into Windows 10, you have an immediately noticeable upgrade to creativity-focused programs like Photoshop and Clip Studio Paint.",
    "Photo editors and artists suddenly have the baked-in ability to work with a wider spectrum of colors where they otherwise might not have before, without needing to worry about inaccurate colors, as is the state HDR currently finds itself in on Windows 10. This would position Windows as a more serious option for professional creators.",
    "Now, I’m definitely not saying that HDR will be the answer to all of Windows 10’s woes. The operating system still falls short in many areas, especially when it comes to performance on some hardware and the suite of bugs that seem to plague every update.",
    "The upcoming HDR update for Windows 10 is clearly a step in the right direction. Hopefully it will address the aforementioned complaints of washed out colors, poor integration with certain programs and so on. But also, I hope it acts as a springboard for many HDR updates Microsoft could add to its OS in the future.",
    "Much like we see on Xbox Series X, an Auto HDR feature for Windows 10 would be a wonderful addition. If the devs can find a way to smartly inject HDR into any given game or program on the fly, you’d have an operating system that essentially does all the work for the user. This would ideally create close to optimal settings no matter which program or game is open at the time.",
    "This would be a boon for those who have already invested in powerful monitor setups. As we’ve already seen, HDR on Windows 10 isn’t going to be a one-size-fits-all solution (even on Xbox, Auto HDR can lead to inaccurate colors for certain titles).",
    "But it’s still a feature I’m glad Microsoft is finally embracing on Windows 10, and one that the company will hopefully strive to improve in the coming months and years as HDR itself continues to evolve. Better late than never, right?"
  ],
  "headers": {
    "3": "Kept you waiting, huh?",
    "9": "Microsoft already knows HDR",
    "13": "Windows 10's bright HDR future"
  },
  "links": {
    "Microsoft is improving HDR support": "https://www.techradar.com/news/windows-10-is-about-to-get-a-lot-more-colorful-heres-why",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 10 Sun Valley": "https://www.techradar.com/news/windows-10-21h2-update",
    "Windows 10 Insider program": "https://www.techradar.com/news/you-can-now-get-access-to-new-windows-10-update-features-in-advance",
    "Lightroom": "https://www.techradar.com/reviews/adobe-photoshop-lightroom-cc",
    "HDR monitors": "https://www.techradar.com/news/best-hdr-monitors-excellent-displays-with-true-hdr-support",
    "many a forum thread": "https://www.overclock.net/threads/win10-hdr-looks-bad.1775324/",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Auto HDR": "https://www.techradar.com/news/what-is-xbox-series-x-auto-hdr-microsofts-game-changing-feature-explained",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "plague every update": "https://www.techradar.com/news/new-windows-10-update-is-already-causing-some-headaches"
  }
}