{
  "source": "https://www.techradar.com/news/intel-rocket-lake-could-land-on-march-15-with-potentially-record-breaking-flagship-cpu",
  "title": "Intel Rocket Lake could land on March 15 with potentially record-breaking flagship CPU",
  "category": "computing",
  "updated": "2021-02-18T12:00:09Z",
  "author": "darren-allan",
  "summary": "With Alder Lake rumored for September",
  "article": [
    "A fresh rumor claims that Intel’s next-gen Rocket Lake processors could arrive bang in the middle of March, potentially spearheaded by a Core i9-11900K CPU that posted the fastest ever seen single-core result in Geekbench, going by a recent leak.",
    "The launch date rumor comes from Hong Kong-based tech site HKEPC, which claims that Rocket Lake-S chips will be here on March 15 (as spotted by VideoCardz).",
    "While Intel has only said that Rocket Lake (11th-gen) CPUs will arrive in Q1 of 2021, that obviously means March at this point – and indeed a whole bunch of previous rumors have pointed to a March launch.",
    "March 15 gives us an exact date to work with, then, and it’s a fair guess, although obviously this is still just speculation floating down from the rumor mill. Certainly sooner in March rather than later seems likely, when you consider how fast the following generation – Alder Lake – will follow.",
    "Intel has already said that Alder Lake (12th-gen) processors will arrive in the second half of 2021, and HKEPC has another rumor on that score – it reckons the month to mark in your calendar is September. Theoretically, that would be six months after the debut of Rocket Lake, but bear in mind this is reportedly just the announcement, with the actual Alder Lake chips themselves not arriving until December.",
    "That would give Rocket Lake a little more time to breathe, and makes sense in that respect.",
    "HKEPC also claims that Intel will use an enhanced version of its 10nm SuperFin architecture with Alder Lake, and just yesterday we heard some very promising noises about exactly how well these processors might perform.",
    "Rocket Lake will drop the flagship CPU to 8-cores – from 10-cores with current Comet Lake chips – but is still expected to deliver considerably more impressive performance levels, at least going by some leaks (like the one we mentioned at the outset). Alder Lake will change things entirely, with a fresh design based around normal (big) cores and efficient low-power (little) cores and a new socket.",
    "While there have been concerns about how Alder Lake’s low-power cores might help when it comes to a desktop PC, those fears have been somewhat assuaged by the latest from the rumor mill."
  ],
  "headers": {
    "4": "12th-gen launch in September?"
  },
  "links": {
    "Intel’s next-gen Rocket Lake processors": "https://www.techradar.com/news/intel-rocket-lake",
    "going by a recent leak": "https://www.techradar.com/news/intel-core-i9-11900k-leak-suggests-a-record-breaking-cpu-that-could-be-trouble-for-amd",
    "HKEPC": "https://www.hkepc.com/20141/",
    "VideoCardz": "https://videocardz.com/newz/intel-rocket-lake-s-to-be-available-on-march-15th-alder-lake-s-to-feature-10nm-enhanced-superfin-architecture",
    "whole bunch": "https://www.techradar.com/news/intels-next-gen-rocket-lake-cpus-could-be-here-sooner-than-you-think",
    "rumors": "https://www.techradar.com/news/intel-rocket-lake-cpus-again-rumored-to-land-in-march-2021",
    "March launch": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "very promising noises about exactly how well these processors might perform": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
    "and a new socket": "https://www.techradar.com/news/intel-alder-lake-12th-gen-cpus-could-usher-in-a-new-socket-in-2021-leaving-z490-motherboards-out-in-the-cold",
    "fears have been somewhat assuaged": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought"
  }
}