{
  "source": "https://www.techradar.com/vpn/pcs-with-16gb-ram-likely-to-be-standard-in-2021-as-ddr5-hits-mainstream",
  "title": "16GB RAM could soon become the standard on PCs and laptops",
  "category": "computing",
  "updated": "2021-07-20T13:18:55Z",
  "author": "desire-athow",
  "summary": "Manufacturers shy away from 8GB DDR5 as 16GB becomes the norm",
  "article": [
    "Update: Since the publication of this particle, other vendors - Apacer, Innodisk - have confirmed that they won't be selling memory modules smaller than 16GB. Innodisk cited the lack of interest for smaller capacities as the reason. The rest of the original article follows below.",
    "2021 is set to be the year when DDR5 DRAM goes mainstream and Teamgroup has fired the first salvo. The company has announced it will release its first DDR5 product next year under the ELITE brand, with the launch potentially coming as early as the third quarter of 2021.",
    "With both AMD and Intel likely to launch DDR5 compatible products next year, the Taiwanese module manufacturer is the first of many to come over the next few months.",
    "What's more interesting is that they delivered some interesting details about the module itself, which will offer 16GB RAM memory running at 4.8GHz (or DDR5-4800) operating at 1.1V. That means a data transfer increase of up to 60% (3Gbps to 4.8Gbps) and a 10% reduction in power consumption.",
    "What's more, all DDR5 memory will now come with on-die ECC (Error Correction Code) which is a feature commonly found in servers and workstations that self-corrects single-bit error and - in theory - improves system stability.",
    "In a statement to TechRadar Pro, a spokesperson for Teamgroup comfirmed that the price will be higher than DDR4 (no surprise there) with SODIMM DDR5 modules on the platform schedule.",
    "She also added that 16GB should be mainstream for DDR5 as per DRAM vendor's expectation, which can be translated as 16GB is likely to be the most popular SKU pushed by the vendors.",
    "Hyperscalers, web hosting companies, cloud storage storage firms and IMC specialists will pay close attention to the price of DDR5 as ECC memory historically carry a significant price premium."
  ],
  "headers": {
    "4": "ECC entry"
  },
  "links": {
    "DDR5": "https://www.techradar.com/news/full-speed-ahead-with-ddr5-faster-system-ram-is-on-the-horizon",
    "DRAM": "https://www.techradar.com/news/computing-components/storage/how-universal-memory-will-replace-dram-flash-and-ssds-1222632",
    "RAM": "https://www.techradar.com/news/what-is-ram",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "workstations": "https://www.techradar.com/best/best-workstations",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}