{
  "source": "https://www.techradar.com/news/philips-fidelio-t1-could-compete-with-the-best-true-wireless-earbuds",
  "title": "Philips Fidelio T1 could compete with the best true wireless earbuds",
  "category": "audio-visual",
  "updated": "2021-11-11T15:06:31Z",
  "author": "hamish-hector",
  "summary": "The first Fidelio true wireless earbuds announced",
  "article": [
    "Philips has unveiled its Philips Fidelio T1, the first true wireless earbuds from the brand’s flagship audio range. Philips Fidelio products might not be as recognizable as other options out there, but their consistently great performance and price have served the range well in our past reviews.",
    "With a promise to deliver advanced noise cancellation, brilliant audio quality, and with a long-lasting battery, we can’t help but be excited to see if these Fidelio earbuds can compete with other premium wireless earbuds out there. There’s a good chance the Philips Fidelio T1 could put up a strong fight against some of the best wireless earbuds like the Sony WF-1000XM4 and Cambridge Audio Melomania 1 Plus.",
    "Right now we don’t have a price or a release date for the Philips Fidelio T1 but we know nearly everything else. As we learn more we’ll be sure to keep you updated, but for now, read on to learn more about the features you can expect from Philips' upcoming true wireless earbuds.",
    "The Philips Fidelio T1 true wireless earbuds boast an impressive lineup of features. Thanks to active noise cancellation powered by six microphones (three on each bud) you’ll be able to enjoy your own private soundscape free from the annoyances of the outside world, and you can enjoy it for around nine hours straight - due to an incredibly long battery life even with ANC turned on. With the charging case, you can achieve 25 hours of playback with ANC turned on, or by turning it off you can get up to 13 hours continuously and 35 with the case before needing to recharge.",
    "Fitness buffs may also fail in love with the Philips Fidelio T1. With their IPX4 water-resistant rating, these true wireless earbuds won’t survive a dip in the pool but should be able to fight off the rain and sweat if you want to use them during your workout routines. Thanks to the in-built Google Assistant you’ll be able to issue hands-free commands too, meaning you won’t have to pause your fitness to pause your music.",
    "As for audio quality, Philips promises \"deep yet controlled bass\" with \"complete mid-range fidelity\" to boot. The impressive playback capabilities will be delivered by an advanced two-way design that combines a large 10mm dynamic driver with a specially optimized armature module. This hardware won’t be wasted either thanks to the LDAC codec, which is included to ensure high-resolution quality music playback.",
    "We’ve seen some impressive Philips Fidelio devices over the years (such as the Philips Fidelio X3 and Philips Fidelio NC1 which both earned four and a half stars out of five in our reviews) so there’s not much reason to doubt Philips’ bold claims, though as always we’ll want to try these true wireless earbuds out for ourselves to know how good they really are."
  ],
  "headers": {
    "3": "Every feature coming to the Philips Fidelio T1 earbuds"
  },
  "links": {
    "best wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "Philips Fidelio X3": "https://www.techradar.com/reviews/philips-fidelio-x3-open-back-headphones",
    "Philips Fidelio NC1": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/philips-fidelio-nc1-1284427/review"
  }
}