{
  "source": "https://www.techradar.com/news/the-cheap-amazfit-gts-2-mini-smartwatch-is-now-even-better-value",
  "title": "The cheap Amazfit GTS 2 Mini smartwatch is now even better value",
  "category": "fitness",
  "updated": "2021-03-09T11:23:32Z",
  "author": "cat-ellis",
  "summary": "Alexa voice commands arriving in firmware update",
  "article": [
    "The compact Amazfit GTS 2 Mini is one of the best cheap fitness trackers you can buy today, and it's now even more tempting thanks to an update that adds Amazon Alexa voice controls.",
    "The GTS 2 Mini was released worldwide in January 2021, but was missing Alexa support. Now, as XDA Developers has discovered, a software update has unlocked voice controls for users in India, and is likely to roll out more widely soon.",
    "When the new firmware version (1.0.2.31) is released in your area, you'll be able to update your GTS 2 Mini through the Zepp app provided it's paired to your phone via Bluetooth. Just select your watch within the app, then tap the Firmware Update option and wait while the update is download and installed.",
    "Once that's done, swipe left on the watch's home screen and you'll see an option to enable Alexa. Select this, then return to the Zepp app on your phone and select 'Profile'. Tap 'Add accounts', then log in using your Amazon account and you're ready to start with voice commands.",
    "You can now use your watch to set alarms and timers, play and control music, check the time and date, move calendar events, and create to-do lists. For more tips, see our complete guide to Alexa commands and skills.",
    "When we reviewed the Amazfit GTS 2 Mini, we were particularly impressed by its bright, high quality screen, robust 24/7 fitness tracking (including on-board GPS) and handy productivity tools including a Podoromo timer that's particularly helpful for keeping you on task while working from home.",
    "It's not quite as feature-packed as its larger siblings, the Amazfit GTS 2 and GTS 2e, with a slightly less stylish design and no music player. However, it's one of the cheapest smartwatches on the market right now, and impressive value for the price."
  ],
  "headers": {
    "5": "Speak your mind"
  },
  "links": {
    "Amazfit GTS 2 Mini": "https://www.techradar.com/reviews/amazfit-gts-2-mini",
    "best cheap fitness trackers": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "XDA Developers": "https://www.xda-developers.com/amazfit-gts-2-mini-alexa-update/",
    "our complete guide to Alexa commands and skills": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "Amazfit GTS 2": "https://www.techradar.com/reviews/amazfit-gts-2",
    "GTS 2e": "https://www.techradar.com/reviews/amazfit-gts-2e",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074"
  }
}