{
  "source": "https://www.techradar.com/news/haunted-chocolatier",
  "title": "Haunted Chocolatier looks like the perfect follow-up to Stardew Valley",
  "category": "gaming",
  "updated": "2021-10-22T11:25:22Z",
  "author": "hamish-hector",
  "summary": "Make chocolate with ghosts",
  "article": [
    "The creator of Stardew Valley has announced the title of his next game: Haunted Chocolatier.",
    "In Haunted Chocolatier, you'll be playing as a chocolatier with the goal of making the best chocolate you can. To succeed you'll have to gather as many rare and exciting ingredients as you can to make your creations as delicious as possible. Oh, and you'll be working out of the kitchen in your own haunted mansion.",
    "So far, we've only seen a gameplay trailer and developer Concerned Ape has emphasized that the game is in early development, but we absolutely adored playing Stardew Valley across both PC and its console releases and we can't wait to get our hands on this new title. What we've seen so far already has us plenty excited - the premise is splendidly goofy and the early gameplay looks to offer the same chilled-out vibes that made everyone fall in love with Stardew Valley. The return of Stardew's beautiful art style is a welcome bonus too.",
    "If you're waiting for the Haunted Chocolatier as intently as we are, then read on to find out everything we currently know about the Stardew Valley follow-up including the gameplay details shown up so far, the platforms you can play it on, and when we expect the game to release.",
    "Unfortunately, details on the release of Haunted Chocolatier are thin on the ground right now. Over on the game's FAQ page, we can find a few details but not as many as we would have hoped for.",
    "Bad news first, the game doesn't yet have a release date of any kind - not even a vague '2022'. The lack of an announced release date is because, as Concerned Ape says \"[Haunted Chocolatier is] still relatively early in development and I want to be able to work in peace without the pressure of a release date, or even an estimated release date\".",
    "With Haunted Chocolatier still in early development, we don't expect to see it release until at least the latter half of 2022 - but it's more than likely we might have to wait until 2023.",
    "As for platforms, the developer has only committed to PC right now but has said has has \"every intention of bringing it to the other major platforms as well\". With the PC support, we'll almost certainly see Haunted Chocolatier arrive on the Steam Deck, and it should also come to the Nintendo Switch, Xbox Series X, and PS5 at some point as well (though it may be a delayed release like with Stardew Valley).",
    "Right now we just have the one trailer for Haunted Chocolatier, though the two and a half minutes of early gameplay footage already tells us a fair amount about what the game has in store for players.",
    "For starters, there is a lot of similarity to Stardew Valley. Most obviously is the return of Stardew's iconic pixelated art style which will bring this game's new characters and locations to life.",
    "However, we also see that Stardew's combat and romance systems will be making a return. We wonder if one of our potential partners will love eating rocks in this game too...",
    "If the name wasn't a giveaway, it looks like Haunted Chocolatier might have more sinister elements than ConcernedApe's previous game. While the trailer shows friendly ghosts helping to manage your chocolate shop we also meet a bartender named Nigel.",
    "The way the scene is presented makes it seem like Nigel isn't too happy to see a new chocolatier in town, however, we'll just have to wait and see.",
    "While this is what we've seen so far ConcerenedApe has stressed that this is a game still very early in development. That means that while we'll likely see new features added into Haunted Chocolatier, we might find others (like those shown off in the trailer) are taken away or changed.",
    "As Haunted Chocolatier develops we'll keep you up to date with everything we know.",
    "Alongside the trailer, ConcernedApe released some early screenshots for us to peruse. They give us a better look at various locations in the game including a blacksmith's workshop and the interior of the haunted mansion we'll be living in.",
    "We even get a look at what recipes in the game will look like. Much like Stardew Valley, we'll have to wait around for our chocolate to be ready to eat - but thankfully the times don't look as long as some of the crops we had to cultivate.",
    "It also looks like the map will be quite large and that we'll be exploring through multiple seasons. We've seen a variety of outdoor locations some with snow and some without. Much like how the season impacted Stardew Valley's gameplay we imagine the in-game climate will affect what ingredients we can find."
  ],
  "headers": {
    "4": "Haunted Chocolatier: cut to the chase"
  },
  "links": {
    "Stardew Valley": "https://www.techradar.com/news/games-of-the-generation-stardew-valley-is-a-welcome-break-from-the-chaos-of-the-world",
    "FAQ page": "https://www.hauntedchocolatier.net/faq/",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}