{
  "source": "https://www.techradar.com/news/house-of-marleys-sustainable-true-wireless-earbuds-reflect-a-greener-audio-industry",
  "title": "House of Marley’s sustainable true wireless earbuds reflect a greener audio industry",
  "category": "audio-visual",
  "updated": "2021-08-11T10:23:27Z",
  "author": "axel-metz",
  "summary": "Going green",
  "article": [
    "When it comes to sustainability, technology must play its part in reducing humanity’s impact on the environment – whether that’s through the TVs we watch, the consoles we play or the earbuds we listen with.",
    "In our recent guide to the future of sustainable sound, we detailed the ways in which audio companies – from big names like Sony to smaller brands like Grado and Focal – are changing their manufacturing, distribution and marketing processes to align themselves with this changing tide.",
    "Among those companies is House of Marley, an audiomaker more committed than most to using sustainable materials across its range of speakers, headphones, turntables and accessories. Unsurprisingly, that philosophy endures with the launch of the brand’s new true wireless offering, the Rebel earbuds.",
    "An expansion of its TWS (true wireless stereo) collection, the Rebel earbuds are designed using a combination of bamboo, natural wood fibre composite and recycled plastics. They’re packaging, too, is 100% recyclable.",
    "Being a brand so closely associated with music legend Bob Marley (and his grandson, Skip Marley, who collaborated with the company on these new earbuds), House of Marley’s Rebel earbuds pack a compelling range of audio specs, as well as green credentials.",
    "Those specs include swappable EQs (Signature and Bass Boost), echo noise cancellation for improved call performance, and eight hours of on-board battery life (jumping to more than 30 hours when paired with their wireless charging case).",
    "They won’t break the bank, either. The black pair are available now for $129.99 / £99.99 (which is around $AU185, when they land in Australia), with a cream color to follow in the coming months.",
    "House of Marley isn’t the only audio brand looking towards a greener future.",
    "Many major tech companies now have long-term sustainability goals, like becoming carbon neutral within a decade (Apple) or creating products using more recycled materials (Sony).",
    "Most interestingly, some companies are working on ways to ditch power-guzzling batteries. Urbanista’s Los Angeles headphones, for example, are solar-powered, and could mark a bold frontier for the future of audio products if they can deliver a stellar audio performance while promoting alternative power sources.",
    "Then there are the schemes in place to aid the conscience of the consumer. Apple’s trade-in scheme, for one, allows customers to return old devices in exchange for credit towards their next purchase – which proves sustainability can play into profitable business models, too.",
    "All of these small steps represent larger strides towards a future free of excessive audio-based waste – companies like House of Marley were simply ahead of the curve."
  ],
  "headers": {
    "7": "What are other brands doing?"
  },
  "links": {
    "guide to the future of sustainable sound": "https://www.techradar.com/news/sustainable-sound-how-headphones-speakers-and-turntables-are-going-green",
    "House of Marley": "https://www.techradar.com/news/house-of-marley-headphones",
    "Urbanista’s Los Angeles": "https://www.techradar.com/news/these-solar-powered-headphones-boast-a-virtually-infinite-battery-life"
  }
}