{
  "source": "https://www.techradar.com/news/majority-of-remote-workers-expected-to-go-hybrid-by-2022",
  "title": "Majority of remote workers expected to go hybrid by 2022",
  "category": "computing",
  "updated": "2021-06-24T11:31:12Z",
  "author": "sead-fadilpasic",
  "summary": "Many knowledge workers set to turn remote before the end of the year",
  "article": [
    "A third of the entire global workforce (32%) will be operating in a remote or hybrid model by the end of the year, up from 17% two years ago, according to a new report from market analysts Gartner.",
    "The firm said that among knowledge workers - those involved in knowledge-intensive occupations, such as writers, accountants, or engineers - more than half (51%) will become remote in the same timeframe.",
    "The US will have most remote workers next year, Gartner expects, with 53% of its entire workforce working remotely at least a few days a week with 52% in the UK, Germany 37% and France 33%. Overall penetration rates for India and China will remain relatively low at approximately 30% and 28% respectively, but due to their sheer numbers, they’ll provide the global economy with a fairly large number of workers.",
    "These monumental shifts will reshape the average organization’s IT infrastructure and IT spending habits. They’ll have to speed up their digital transformation plans by at least half a decade, while the demand for PCs and tablets is expected to grow.",
    "In 2021, PC and tablet shipments will exceed 500 million units for the first time in history, Gartner expects.",
    "Cloud will also play a major role and as such, is expected to grow, as well. Gartner forecasts worldwide end-user spending on these services to grow by almost a quarter (23.1%) this year, with SaaS being pivotal. Collaboration tools will remain a “must-have” and are expected to push the worldwide software and collaboration revenue market by 17.1% this year.",
    "Zero trust network access will become commonplace with at least 40% of remote access usage being served this year (up from 5% last year). However, Gartner doesn’t expect companies to completely retire their client-facing VPN services just yet."
  ],
  "headers": {
    "4": "Cloud and device spending grows"
  },
  "links": {
    "hybrid model": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "tablet": "https://www.techradar.com/news/best-business-tablets",
    "Cloud": "https://www.techradar.com/news/the-best-cloud-storage",
    "Collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "VPN services": "https://www.techradar.com/vpn/best-vpn"
  }
}