{
  "source": "https://www.techradar.com/news/spider-man-3-is-the-most-ambitious-solo-superhero-movie-ever-says-tom-holland",
  "title": "Spider-Man 3 is ‘the most ambitious’ solo superhero movie ever, says Tom Holland",
  "category": "entertainment",
  "updated": "2021-02-05T17:08:42Z",
  "author": "rhys-wood",
  "summary": "The Spider-Man sequel is shaping up nicely, according to the actor",
  "article": [
    "Tom Holland's third Spider-Man movie sounds like it's the MCU film to keep an eye on over the coming year. Speaking to Variety, Holland explained that the currently untitled Spider-Man 3 is “...really impressive,” and shortly after he claimed that “it’s the most ambitious standalone superhero movie ever made.”",
    "Clearly excited about the project himself, Holland was asked by Variety if he could tell them anything about the MCU’s third Spider-Man outing, which is the sequel to 2019's Far From Home. He naturally remained tight-lipped about the film. “Obviously, I can’t really say anything,” he replied.",
    "Holland was asked what the ending of the film is. “What’s funny is like, I nearly told you then,” said Holland. “You were so close to getting what you want.”",
    "Previous reports have suggested that this Spider-Man movie will converge all live-action Spider-Men to date into a single story – with Tobey Maguire and Andrew Garfield reprising their roles, according to Collider. THR also reported that Spider-Man 2's Doc Ock, Alfred Molina, is on-board for this picture, along with Jamie Foxx as The Amazing Spider-Man 2's Electro.",
    "Could this be the element that makes this third Spider-Man film so ambitious?",
    "Holland elaborated a little bit on what the new Spider-Man movie is trying to achieve. “I can say that it’s the most ambitious standalone superhero movie ever made. You sit down, read the script, and see what they’re trying to do, and they’re succeeding. It’s really impressive. I’ve never seen a standalone superhero movie quite like it.”",
    "Holland also talked about the progress on filming the movie, saying: “We got a lot more shooting to do. We started before Christmas and shot for like seven weeks. We stopped for the Christmas break, and then we’re starting again. I’m just as excited as everyone else to see it, let alone be a part of it.”",
    "The third Spider-Man movie is currently scheduled to release on December 17, 2021.",
    "Both Spider-Man Homecoming and Spider-Man Far From Home have been well-received by critics and fans, after the cooler reception to Andrew Garfield's last Spider-Man picture, The Amazing Spider-Man 2. Adding Peter Parker to the MCU has been a big part of that success – but the movies have just been more consistent overall.",
    "Hopefully, Holland’s comments signal a strong capper to the trilogy. After Into the Spider-Verse, the possibility of seeing multiple Spider-Men team up in live-action is surely very exciting to MCU devotees.",
    "Tom Holland is also set to star in the upcoming Uncharted movie based on the popular video game series."
  ],
  "headers": {
    "8": "Third time’s the charm?"
  },
  "links": {
    "Variety": "https://variety.com/2021/film/awards/tom-holland-cherry-awards-circuit-podcast-1234899695/",
    "Collider": "https://collider.com/spider-man-3-cast-doc-ock-alfred-molina-andrew-garfield/amp/?__twitter_impression=true",
    "THR": "https://www.hollywoodreporter.com/heat-vision/spider-man-3-alfred-molina-returning-as-doctor-octopus",
    "upcoming Uncharted movie": "https://www.techradar.com/news/new-uncharted-movie-images-tease-tom-hollands-first-adventure"
  }
}