{
  "source": "https://www.techradar.com/news/the-leica-phone-is-real-but-its-a-rebadged-clone-with-a-ridiculous-lens-cap",
  "title": "The Leica phone is real, but it mixes the sublime with the ridiculous",
  "category": "cameras",
  "updated": "2021-06-18T07:56:46Z",
  "author": "mark-wilson",
  "summary": "Sadly, it's also Japan-only for now",
  "article": [
    "Always fancied owning a Leica camera, but been put off by their car-sized price tags? Well, Leica has just launched what could be your dream camera phone, the Leitz Phone 1 – though it comes with a few big caveats.",
    "For starters, the classic camera maker's first phone will only be available in Japan through the retailer Softbank. For now, there's no news on an international launch, and there are good reasons for that.",
    "First, the Leitz Phone 1 is actually a rebadged version of the Sharp Aquos R6, and Sharp only sells its phones in a few markets outside Japan. Still, as an experiment for the rest of the world to look at longingly, it's certainly an interesting one – as the Aquos R6 is the first phone with a 1-inch sensor.",
    "That huge 20MP 1-Inch sensor alone makes the Leitz Phone 1 an intriguing device, but Leica has added some other touches – a few of which are slightly questionable – in order to make it worthy of \"red badge\" status.",
    "The lens is apparently a seven-element f/1.9 affair with a wide-angle equivalent focal length of 19mm. Running on Android 11, the Leitz Phone 1 also features a monochrome interface that's been customized by Leica, while the camera app features 'Leitz Looks' for your impossibly stylish reportage photography.",
    "Under the hood, the specs are impressive: a Qualcomm Snapdragon 888 processor, 12GB RAM, and 256GB of storage, which certainly sets the Leitz Phone 1 apart as a high-end handset.",
    "But it's the additional touches and accessories that separate Leica's phone from the standard Sharp Aquos R6 – and it's here that we find that Leica has included a magnetic, circular lens cap. We're not sure smartphone photographers will fancy removing that every time they need to take a quick snap, but it's certainly in keeping with the phone's silver body and general air of exclusivity.",
    "Speaking of which, the Leitz Phone 1 will reportedly go on sale in July for 187,920 yen (around $1,705 / £1,225 / AU$2,255), which isn't too bad considering the phone's red badge and 1-Inch sensor.",
    "Leica has been dabbling in smartphone photography for a few years now, starting with the Panasonic CM1 in 2015. It made the lenses for that phone, which also had a 1-Inch sensor, but Leica's better-known collaboration has been with Huawei from 2016.",
    "Earlier this year Huawei told us that this partnership was partly down to smartphone photographers looking for something other than pure accuracy, hence the inclusion of three color modes – Leica Vivid, Leica Soft and Leica Monochrom – on the Mate 40 Pro to help add a little variety to the usual saturated look seen on most modern smartphones.",
    "The Leitz Phone 1 is certainly another step on that path, but it follows a familiar pattern for them of using Leica's heritage to add marketing flourishes to an existing product, rather than being a new concept that's built from the ground up.",
    "This is something Leica has also done in the camera space, with some of its models (like the recent Leica SL2-S) being tweaked and rebranded Panasonic affairs. But none of these efforts seem to water down its admittedly well-earned reputation for making classic, bomb-proof and incredibly desirable cameras like the Leica Q2 or the stunning Leica M10.",
    "Of course, it'd be great to see Leica design its own smartphone in the vein of those cameras, but for now its rebranded version of Sharp's intriguing 1-inch camera phone gives us an intriguing taster of what that might be like. And, hopefully, the rest of the world will get to see what it's capable of with a wider international release."
  ],
  "headers": {
    "8": "Worthy of the red badge?"
  },
  "links": {
    "Sharp Aquos R6": "https://www.techradar.com/news/sharps-latest-flagship-phone-is-the-first-with-a-massive-1-inch-camera-sensor",
    "Huawei told us": "https://www.techradar.com/news/huawei-what-the-mate-40-pro-teaches-us-about-the-future-of-camera-phones",
    "Leica SL2-S": "https://www.techradar.com/reviews/leica-sl2-s",
    "Leica Q2": "https://www.techradar.com/reviews/leica-q2-monochrom",
    "Leica M10": "https://www.techradar.com/reviews/leica-m10-r"
  }
}