{
  "source": "https://www.techradar.com/news/logitech-ceo-warns-chip-shortage-could-last-into-next-year",
  "title": "Logitech CEO warns chip shortage could last into next year",
  "category": "computing",
  "updated": "2021-05-28T18:00:47Z",
  "author": "john-loeffler",
  "summary": "Another industry leader with a pessimistic forecast",
  "article": [
    "Logitech has joined the growing chorus of pessimistic tech companies who see the ongoing global semiconductor dragging on into next year.",
    "Bracken Darrell, Logitech's chief executive officer, told Swiss outlet Finanz und Wirtschaft that while some sectors could see the chip shortage abate in as early as three to six months, other industries will continue to face a silicon shortfall into 2022.",
    "\"Like others we have felt the shortages, but we have been able to cushion them well,\" Darrell said. \"It takes time to ramp up production but in the meantime, prices have also adjusted.\"",
    "The computer peripheral giant has turned to additional suppliers, Darrell said according to Reuters, since many of their current suppliers have not been able to meet demand.",
    "Logitech has added its voice to that of IBM, Intel, Nvidia, and TSMC in warning that the current glut of silicon will be more protracted than many had hoped, but there's some silver lining here. As Darrell notes, some industries will see shortages into 2022, but not all.",
    "Among the biggest victims of the chip shortage have been automobile manufacturers which cut orders last year due to the pandemic, according to Harvard Business Review. This freed up a lot of capacity for IT and consumer electronics that have already locked in orders that will be rolling off the fabrication lines shortly.",
    "While this is terrible news for the automotive industry which now needs to play catch up, those chips which didn't end up in cars this year will be going into graphics cards and other computer equipment instead. That, taken together with the recent crash in cryptocurrency prices, could mean that more supply of the best graphics cards and consoles like the PS5 and Xbox Series X|S could be coming soon."
  ],
  "headers": {
    "4": "Is ongoing semiconductor shortage easing up?"
  },
  "links": {
    "Reuters": "https://www.reuters.com/technology/logitech-ceo-says-chip-shortage-could-last-up-year-paper-2021-05-28/",
    "IBM, Intel, Nvidia, and TSMC": "https://www.techradar.com/news/chip-shortage-nightmare-could-last-for-years-says-ibm",
    "Harvard Business Review": "https://hbr.org/2021/02/why-were-in-the-midst-of-a-global-semiconductor-shortage",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}