{
  "source": "https://www.techradar.com/news/how-netflixs-the-irregulars-reinvents-the-sherlock-legend-through-a-horror-lens",
  "title": "How Netflix’s The Irregulars reinvents Sherlock Holmes through a horror lens",
  "category": "entertainment",
  "updated": "2021-03-28T12:00:36Z",
  "author": "tom-power",
  "summary": "Honoring Sir Arthur Conan Doyle's favored pastime",
  "article": [
    "Netflix's The Irregulars wants you to know that it isn’t your normal Sherlock Holmes story. For once, Sir Arthur Conan Doyle’s legendary fictional detective isn’t the star of the show, and he struggles to display the impressive sleuthing skills of those iterations who’ve come before.",
    "For Henry Lloyd-Hughes, the latest incumbent to assume the Sherlock mantle, there’s one key reason behind this bait and switch in Netflix’s new series.",
    "“This version of Sherlock is a case of seeing all of the elements of his legend, which we’re used to, being smashed to bits,” Lloyd-Hughes tells us. “In this show, it’s a journey of piecing those back together and seeing what the reconstructed version really looks and feels like. Once we do, we can reflect on how the man or myth has done more good than bad or vice versa.”",
    "Sherlock isn’t the only individual wrestling with his legacy in The Irregulars. Dr. John Watson, Holmes’ loyal companion and often the voice of reason for the iconic duo, finds himself unable to come to terms with how his life has panned out.",
    "“I wanted to make him a world-weary man who has lived, traveled and had to adapt to any situation,” Royce Pierreson, who plays Watson, explains. “He’s constantly trying to run from his past but the mistakes he made are still with him. When you see Holmes and Watson here, I think there’s going to be an expectation from fans. We normally see them as rounded, nearly flawless characters but they’re broken, older men here who are hanging on to an idea of what they used to be.”",
    "If Sherlock and Dr. Watson aren’t the heroes of the piece, then who is? Step forward the Irregulars, a gang of streetwise teenagers led by the matriarchal Bea (Thaddea Graham) who live in the shadow of 221B Baker Street. The group are living hand-to-mouth until a chance encounter with Watson sees them begin to solve crimes with a paranormal twist. As Bea and her adopted family dig deeper into each investigation, however, they find that the whole world is under threat from supernatural forces that not even Holmes and Watson may be able to stop.",
    "The Irregulars is based on the gang of street boys who occasionally pop up in Sherlock stories, but that’s where the similarities end. Like Holmes and Watson, creative liberties were taken with Netflix’s version of the group. Gone is the all-white, male boy gang led by Wiggins and, in its place, is a group that’s more contemporary in its approach to casting.",
    "It may be a show set in Victorian times where gender disparity and racism were commonplace, but that's not what the show is about, which is to its credit.",
    "“Representation of any kind is important,” Graham says. “But to see these two female characters at the forefront, with their sisterly bond, is lovely as you don’t see that a lot. It felt like an honour to be given the chance to portray that. We’ve got these strong characters regardless of gender and I hope that it’ll become the norm and not this monumental or groundbreaking moment.”",
    "As surreal as it may sound to base a Sherlock production around the occult and mystical arts, it isn’t such a far-fetched idea. Conan Doyle retained a longstanding interest in the paranormal and spiritualism, so making a TV show with horror and otherworldly elements wasn’t difficult for the series’ cast to comprehend.",
    "“It felt like we were exploring a whole new universe,” Lloyd-Hughes explained. “You think ‘What would happen if you took the world of Stranger Things, Doctor Who and literary icons and put them together?’ I don’t think we ever had to hold back for fear of Sherlock Holmes or period drama rules that we had to adhere to, and that was really liberating.”",
    "The Irregulars has an overarching narrative that’s threaded throughout its first season, but there were also opportunities to tell standalone stories in each episode. Inspired by TV shows including The X-Files and films such as Alfred Hitchcock’s The Birds, each installment includes a unique villain that the gang have to try and stop, even if there is a valid reason behind the turn to the dark side.",
    "“I think all the villains are good, but their villainy comes from a very real place like grief or loss,” Harrison Osterfield, who plays Leo in the show, says. “You can always understand where they’re coming from and why they’re on this dark path. You want to find out what’s driven them to reach out and connect with the spirit world, and I think there’s a very emotional pull [behind each villain’s story].”",
    "Bea, Leo, and the rest of the gang don’t just deal with physical monsters, though. Much like Holmes and Watson, the gang spend the series coming to terms with their own internal demons. Billy (JoJo Macari) grapples with toxic masculinity born out of his childhood, while Leo - who, unknown to the other gang members initially, is heir to the English throne - struggles to balance his two vastly different lives.",
    "Those issues end up bleeding into the series’ exploration of other important topics. Class privilege, absent father figures, and ultimately finding your place in the world are problems that each character deals with to some degree. For Osterfield, giving as much screen time to those real world subjects was as important as the show’s paranormal elements and nods to Sherlock adaptations of the past.",
    "“Tom Bidwell has written some incredible dialogue, which makes you think about these things,” he says. “I’d never really looked into it [class privilege] before but, reading the script, you think ‘These are really important points that should be talked about every day’. It was a privilege to have those discussions about class disparity and bring it to life on screen.”",
    "“I don’t think I realized how strong these characters were when I auditioned,” Graham adds. “When I read the part I had I thought ‘This is a nice story about a group of friends’ and then got the full script and thought ‘Oh, there’s a lot more going on here’. The themes are quite heavy and we deal with a lot of things across the series. That was a real honour to be part of.”",
    "The Irregulars is a non-canonical entry in the Sherlock universe so, while a second season has already been greenlit by Netflix, don’t expect to see its characters appear in future novels or other adaptations. The series may not lean as heavily into Conan Doyle’s works as other iterations of the characters, but that doesn’t mean it can’t have a place in the wider Sherlock world. If anything, Lloyd-Hughes says, The Irregulars enables fans and the TV show itself to reflect on the character’s legacy and add something entirely new to the Sherlock mythos.",
    "“There’s a beautiful scene with me and Royce where we’re reflecting on old times,” he says. “There’s real truth to it, and the wistful nostalgia that they have is what I think is going to be the window in for audiences. Ultimately, they’re reflecting on their pasts as well. In a weird way, it’s meta as our versions are reflecting on their legacy as well.”",
    "“They’re such different characters despite being called Sherlock and Watson,” Pierreson adds. “To see their genius come out now and again, and then let it fall away by any demons they’re consumed by, is brilliant. We got to delve into the psyche of these guys and I think it creates a totally different dynamic to what people have seen before.”",
    "The Irregulars season 1 is available to stream now on Netflix."
  ],
  "headers": {
    "5": "Gangs of London",
    "9": "Supernatural surprises",
    "13": "The devil’s in the details"
  },
  "links": {
    "Netflix": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8652406435088919000/https://www.netflix.com/"
  }
}