{
  "source": "https://www.techradar.com/news/ionos-adds-amd-hardware-to-server-roster",
  "title": "Ionos adds AMD hardware to server roster",
  "category": "computing",
  "updated": "2021-12-01T12:12:41Z",
  "author": "mayank-sharma",
  "summary": "Offers servers with four different AMD processors",
  "article": [
    "European cloud and web hosting firm IONOS has today announced new offerings powered by AMD Ryzen and AMD EPYC processors.",
    "AMD has been making impressive performance leaps recently with its newer chips outperforming their peers in various benchmarks.",
    "An Intel-only shop until now, IONOS notes that it’s been conscious of AMD processors making serious inroads and increasing their presence in the server space in recent years. The company points to a report by our sister publication Tom’s Hardware to highlight AMDs growth in the server segment.",
    "IONOS has started offering hosting options based on the AMD Ryzen 5 Pro 3600, AMD Ryzen 7 Pro 3700, and AMD EPYC 7302P.",
    "\"AMD processors offer excellent performance and security features for dedicated servers and cloud operations. With the new offerings, we now provide our customers even more options to choose the right technology for them, while still ensuring cost efficiency,” IONOS CEO Achim Weiss said in a press statement.",
    "IONOS now has a dedicated page to help users configure their AMD-powered server. You can choose to pair the four AMD processors with various amounts of RAM and use either a HDD or a SSD. By default all servers run Linux, and Windows is available at an additional cost.",
    "At the lower end of the spectrum, the configuration options start at £55/month for the Ryzen 5 Pro 3600 with 32 GB of DDR4 RAM and 1TB of HDD storage. On the other end of the scale, configurations with the EPYC 7302P server with 128GB of DDR4 RAM and 1 TB of NVMe SSD start at £180/month.",
    "To make the new offering even more attractive, IONOS is giving credits of up to £100 for new users of their AMD-powered servers."
  ],
  "headers": {
    "3": "AMD gaining traction"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "IONOS": "https://www.techradar.com/reviews/11",
    "AMD Ryzen": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "EPYC": "https://www.techradar.com/news/amd-lifts-the-curtain-on-3rd-gen-epyc-milan",
    "Tom’s Hardware": "https://www.tomshardware.com/news/amd-vs-intel-q3-2020-cpu-market-share-report",
    "dedicated page": "https://www.ionos.co.uk/servers/amd-servers",
    "RAM": "https://www.techradar.com/news/best-ram",
    "HDD": "https://www.techradar.com/news/10-best-internal-desktop-and-laptop-hard-disk-drives-2016",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "servers run Linux": "https://www.techradar.com/best/best-linux-server-distro"
  }
}