{
  "source": "https://www.techradar.com/news/google-meet-will-soon-give-you-extra-options-for-creating-a-meeting",
  "title": "Google Meet will soon give you extra options for creating a meeting",
  "category": "computing",
  "updated": "2021-01-08T21:39:04Z",
  "author": "anthony-spadafora",
  "summary": "Google has added several new ways to create meetings on Meet's landing page",
  "article": [
    "Google Workspace users will now have several options to join or start a meeting using Google Meet after a new update to the video conferencing service's landing page.",
    "Now when users click on the “New meeting” button, they'll be presented with the option to create a meeting for later, start an instant meeting or to schedule a meeting in Google Calendar.",
    "When a user decides to create a meeting for later, they'll also be able to save this information so they can quickly start a meeting with the same users later.",
    "Instant meetings on the other hand provide users with a way to join a meeting in one click without first having to go to the Meet greenroom. Once in the meeting, they'll be able to add others or copy the joining information to share. It's worth noting that choosing this option will automatically turn on a user's camera and microphone though they can both be turned off once in the meeting.",
    "Google's new options for starting meetings in Meet are available to Google Workspace users, G Suite users and those with a Google account. However, Workspace Essentials customers will be unable to schedule meetings using Google Calendar though they can create instant meetings or schedule meetings for a later time.",
    "These new meeting options also don't have any admin controls or end user settings and they will be available to users without making any changes to Google Meet's settings.",
    "Google has already started rolling this feature out to Rapid Release domains while Scheduled Release domains will gain access to this feature beginning on January 21.",
    "As video conferencing has become an essential tool for those working from home, Google's changes to creating meetings in Meet will likely be welcomed by customers looking to save time."
  ],
  "headers": {
    "4": "Creating meetings"
  },
  "links": {
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "G Suite": "https://www.techradar.com/reviews/google-workspace",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}