{
  "source": "https://www.techradar.com/news/spotify-makes-it-easier-to-hear-your-top-songs-in-every-genre-unless-you-like-k-pop",
  "title": "Spotify makes it easier to hear your top songs in every genre – unless you like K-pop",
  "category": "audio-visual",
  "updated": "2021-03-02T15:34:36Z",
  "author": "olivia-tambini",
  "summary": "You can now filter your 'Liked Songs' by genre and mood",
  "article": [
    "Spotify has introduced yet another upgrade, which should make it easier to find songs you love based on how you're feeling, or the music genre you want to listen to.",
    "You'll soon be able to categorize tracks in your 'Liked Songs' playlist by genre and mood, so you can easily find the perfect soundtrack to your day, rather than listening through your entire eclectic catalog of saved tracks.",
    "You'll be able to use the new feature if you have at least 30 tracks in your 'Liked Songs' collection, with the ability to filter the tracks within by up to 15 personalized mood and genre categories, including soulful, moody, chill, dancehall, J-pop, bluegrass, and more.",
    "Free and Premium subscribers will be able to take advantage, and it's set to roll out over the coming weeks to iOS and Android devices in English-speaking countries, including the US, the UK, and Australia.",
    "The new feature comes just days after the streaming service announced its new high-quality streaming tier, Spotify HiFi.",
    "Spotify HiFi will be available to Premium subscribers in \"select regions\" and will deliver music as \"CD-quality, lossless audio format[s] to your device and Spotify Connect-enabled speakers\", in a move that could entice music lovers away from services like Tidal, Amazon Music HD, and Deezer.",
    "No firm release date has been announced yet, but Spotify says that it will be rolled out in these (yet to be confirmed) regions \"later this year\", with the company teasing that it will have \"more details to share soon\".",
    "It hasn't all been good news for Spotify in recent days, though. Hundreds of K-pop songs have disappeared from the platform, after a dispute with the South Korean music distributor Kakao M (which also owns the country's top streaming service, MelOn), leaving fans of the genre in the lurch.",
    "In a statement, Spotify said: \"The fact that we have not yet reached agreement on a new global deal is unfortunate for their artists, as well as for fans and listeners worldwide. It is our hope that this disruption will be temporary and we can resolve the situation soon.\""
  ],
  "headers": {
    "4": "Spotify HiFi and the K-Pop Exodus"
  },
  "links": {
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "have disappeared from the platform": "https://www.bbc.co.uk/news/entertainment-arts-56237626"
  }
}