{
  "source": "https://www.techradar.com/news/rainbow-six-siege-just-got-much-better-with-nvidia-dlss",
  "title": "Rainbow Six Siege just got much better with Nvidia DLSS",
  "category": "computing",
  "updated": "2021-06-14T14:16:33Z",
  "author": "darren-allan",
  "summary": "DLSS support comes on top of Nvidia Reflex which arrived in March",
  "article": [
    "Over at E3 2021, Nvidia has made a few announcements on ray tracing and DLSS support, with the latter now live for Rainbow Six Siege – and both coming to Doom Eternal very soon.",
    "Rainbow Six Siege is getting a patch today which introduces DLSS for the Vulkan version, and massively improves frame rates at higher resolutions with up to 50% frame rate hikes in evidence.",
    "Going by Nvidia’s benchmarking at 4K resolution, with DLSS running in performance mode, the RTX 3070 can comfortably exceed 200 frames per second (211 fps) when paired with an Intel Core i9-10900K CPU. Without DLSS, this GPU manages 145 fps.",
    "The RTX 3060 Ti isn’t far behind the 3070 at all on 193 fps with DLSS (127 fps without), and the vanilla RTX 3060 manages to achieve 147 fps (compared to 94 fps without).",
    "DLSS comes on top of Nvidia Reflex support that was introduced for Rainbow Six Siege in March, reducing input lag and effectively making sure that your actions – like taking a shot – happen with less delay. Both that added responsiveness, and smoother gameplay with DLSS, will obviously benefit those with Nvidia GPUs.",
    "For DLSS, as well as the latest patch for Rainbow Six Siege, you also need to install the newest Nvidia graphics driver.",
    "Nvidia also announced that Doom Eternal’s major (free) update will bring ray tracing and DLSS support to the game when it’s unleashed on June 29, just a couple of weeks from now.",
    "Team Green also pointed out that Naraka: Bladepoint now has a launch date confirmed, namely August 12, and this martial arts-themed battle royale will come with both Nvidia DLSS and Reflex."
  ],
  "headers": {
    "6": "Doom boon"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in",
    "RTX 3070": "https://www.techradar.com/news/nvidia-rtx-3070-ti-vs-rtx-3070",
    "introduced for Rainbow Six Siege in March": "https://www.techradar.com/news/nvidia-reflex-now-gives-you-sharper-reactions-in-rainbow-six-siege",
    "Doom Eternal’s": "https://www.techradar.com/news/doom-eternal-could-be-getting-a-vr-port-after-listing-leaks-new-2021-game",
    "battle royale": "https://www.techradar.com/best/best-battle-royale-games"
  }
}