{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-chipset-reveal-hints-at-even-more-new-camera-features",
  "title": "Samsung Galaxy S21 chipset reveal hints at even more new camera features",
  "category": "phones",
  "updated": "2021-01-12T16:20:44Z",
  "author": "tom-bedford",
  "summary": "200MP cameras?",
  "article": [
    "The Samsung Galaxy S21 launch date is very soon, and the company has begun teasing features of the upcoming phone. First was a trailer for the Samsung Unpacked launch event, and now the company has launched its new Exynos 2100 chipset.",
    "Samsung unveiled its new chipset on a YouTube livestream two days before we’re expecting the Galaxy S21 to launch - that's set for January 14.",
    "This chipset is what we’ll likely see in Galaxy S21 phones in Europe and Asia, as opposed to models elsewhere that are heavily rumored to be using Qualcomm’s Snapdragon equivalent. Samsung typically uses this chipset split, much to the chagrin of Exynos users as the chipsets typically return slower speeds.",
    "Interestingly, Samsung kicked off its Exynos 2100 livestream with a slideshow of social media comments of people criticizing Exynos chipsets - clearly it understands its own tech isn’t as popular as Qualcomm's alternative.",
    "The new Exynos 2100 was released under the slogan ‘Exynos is back’, so hopefully this is set to be a more capable processor than what we've seen in previous handsets.",
    "During the livestream, Samsung detailed some features of the Exynos 2100 chipset - apparently it’ll be 10% faster than its predecessors and be 20% more power efficient. But the real news comes from the camera features the Exynos 2100 can support, which hints towards more camera features of the phone.",
    "The Exynos 2100 chipset can take pictures of a whopping 200MP, way more high-res than smartphone cameras currently are. So does that mean the Galaxy S21 will have a 200MP camera? Probably not - this was likely just an attempt at Samsung to boast about its processor.",
    "Regarding actual features though, the Exynos 2100 can support six different cameras, including four recording simultaneously. This sounds especially useful for the company's Single Take mode, which utilizes multiple cameras at once to take great shots. Perhaps now this can incorporate the Galaxy S21 Ultra’s rumored extra rear lenses, or the front camera as well.",
    "The Exynos 2100 chipset also supports 4K video recording at a high frame rate of 120fps, twice as much as the 60fps some phones can reach and the 30fps most cap out at. Video playback also goes up to 8K resolution with 60fps.",
    "Samsung also stated the Exynos 2100 will lead to improved images, with scene optimization and HDR able to use more processing power and more intelligent AI. Perhaps the already massive list of settings Samsung phone cameras recognize will be even longer now.",
    "All in all, the Exynos 2100 launch points to the Samsung Galaxy S21 having improvements on a few features we’ve already seen before, though not necessarily brand new ones. We’ll have to wait until the launch event on January 14 for all the information - check back in to TechRadar then for all the news."
  ],
  "headers": {
    "6": "Samsung Galaxy S21 camera features"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "trailer for the Samsung Unpacked launch event": "https://www.techradar.com/news/samsung-galaxy-s21-launch-teaser-hints-at-new-camera-features-and-more",
    "YouTube livestream": "https://www.youtube.com/watch?v=qcBqg6Y_cnw"
  }
}