{
  "source": "https://www.techradar.com/news/hpe-throws-its-weight-behind-gaia-x",
  "title": "HPE throws its weight behind Gaia-X",
  "category": "computing",
  "updated": "2021-05-18T13:23:49Z",
  "author": "mayank-sharma",
  "summary": "First Gaia-X-compliant solutions expected to be certified before the end of 2021",
  "article": [
    "Hewlett Packard Enterprise (HPE) has announced a set of services to help organizations tap into the decentralized data infrastructure proposed by the Gaia-X initiative.",
    "Gaia-X aims to wrest back control of data from the hands of a few big tech companies and put it inside a federated and decentralized data infrastructure. The initiative is supported by more than 300 organizations in Europe and globally.",
    "HPE’s Solution Framework for Gaia-X is designed for companies, service providers and public organizations that want to get ready to participate in Gaia-X.",
    "“This [Gaix-X] is perfectly in line with our company strategy which is focused on unlocking the value of data distributed across locations and clouds,” said Johannes Koch, Senior Vice President, Germany, Austria and Switzerland, HPE.",
    "HPE suggests that its new Gaia-X solutions will help participating organizations both provide and consume data and services in a decentralized environment.",
    "To stress on the importance of decentralized data, HPE leverages on a paper from the European Commission, which suggests that 80 percent of the overall data volume be processed in a decentralized manner by 2025.",
    "However it argues that many organizations aren’t equipped to monetize the data that’s at their disposal.",
    "Furthermore, it again banks on the European Commission’s finding that a large part of the world’s data rests with a small number of firms, to stress the importance of decentralized data infrastructure.",
    "HPE argues that Gaia-X is the perfect answer to correct this imbalance.",
    "For its part, Koch says that HPE has strung together existing solutions from its platforms such as the Ezmeral software platform and the Cloud28+ business platform, to allow Gaia-X member organizations to “monetize data and put it to work.”",
    "The company claims that it is already working with dozens of organizations across Europe to help them get ready for Gaia-X.",
    "As part of its Gaia-X solutions, it also offers a reference architecture that defines the foundation of the components necessary to build Gaia-X use cases, and has also announced a roadmap service to help customers assess their Gaia-X readiness and develop a roadmap.",
    "Gaia-X is now entering its operational phase with first flagship projects, and first Gaia-X-compliant solutions are expected to be certified in December 2021. Gaia-X interfaces and connectors for HPE solutions will be made available as soon as Gaia-X specifications are final."
  ],
  "headers": {
    "5": "Decentralized data",
    "9": "HPE’s Gaia-X solutions"
  },
  "links": {
    "Gaia-X initiative": "https://www.techradar.com/news/could-the-eu-be-about-to-build-its-own-cloud-network",
    "existing solutions": "https://www.techradar.com/news/hpe-to-deliver-hpc-solutions-as-a-service"
  }
}