{
  "source": "https://www.techradar.com/news/dji-action-2-leak-points-to-imminent-launch-for-gopro-hero-10-black-rival",
  "title": "DJI Action 2 leak points to imminent launch for GoPro Hero 10 Black rival",
  "category": "cameras",
  "updated": "2021-10-11T15:03:25Z",
  "author": "mark-wilson",
  "summary": "The Action 2 could be preparing for lift-off",
  "article": [
    "The DJI Action 2, the rumored successor to the DJI Osmo Action, appears to have made its first public appearance in a YouTube video ahead of an imminent battle with the new GoPro Hero 10 Black.",
    "The action camera's official box was spotted in a YouTube video by Twitter user Moe K and it appears to back up earlier speculation that the Action 2 will have a cube-like form factor in the vein of the now-discontinued GoPro Hero Session.",
    "The accidental reveal has now been edited in the video at 2 minutes 45 seconds, but a screenshot (below) has spread across Twitter. The packaging certainly looks pretty final, so it seems likely that we can expect to see the DJI Action 2 land pretty soon.",
    "The video leak doesn't reveal anything other than a square form factor and screen, but earlier speculation has given us a taste of what the DJI Action 2's specs could be.",
    "A Twitter post from DJI leaker Jasper Ellens (picked up by DroneDJ) last week claimed that the Action 2 will actually be modular, in a similar style to the Insta360 One R. This could allow you to attach an additional display to make it suitable for vlogging to camera.",
    "The apparently leaked manual also suggests that the Action 2 will have a 1/1.7in sensor (larger than the 1/2.3in sensor in the DJI Osmo Action) and weigh just 56g. This would make it around a third of the weight of the GoPro Hero 10 Black, if still twice as heavy as the tiny Insta360 Go 2.",
    "The other specs claim the Action 2 will be capable of shooting 4K/60p video with a 100Mbps bit-rate – this would be impressive for such a small camera, if slightly behind the resolution of the GoPro Hero 10 Black (5K/60p) and the sensor size of the Insta360 One R 1-Inch edition.",
    "If the rumored specs are to be believed, we can also expect the Action 2 to have a 1.76in screen, a reasonably bright f/2.8 aperture and be waterproof down to 10m. But we'll have to wait for its surely imminent launch to find out for sure.",
    "These recent DJI Action 2 leaks suggest a big change of direction for DJI's action camera – and one that it'll see it attempt to carve its own niche, rather than directly take on the GoPro Hero 10 Black.",
    "The original DJI Osmo Action delivered handy new features like a front-facing screen, which eventually made their way onto GoPro's action cameras. But that model is now a little dated, and the new cube-like design perhaps explains why there's been a two-and-a-half-year gap since that model.",
    "The leaked packaging certainly looks legitimate, so it does seem likely that the DJI Action 2 (which follows DJI's recent strategy of dropping its 'Osmo' sub-brand) will have a similar form factor to the discontinued GoPro Hero Session.",
    "We were fond of the latter when it first arrived in 2014, because its design meant it could be mounted pretty much anywhere and it was slightly more affordable than GoPro's flagships.",
    "The downsides, though, were that it was a bit fiddly to use and lacked the modern stabilization we see on today's latest action cameras. It also didn't have a replaceable battery, which somewhat limited its longevity.",
    "If the DJI Action 2 does indeed have the rumored cube-like form factor, it'll be interesting to see if it overcomes the shortcomings we saw in the GoPro Sessions. If it can, we could have an interesting new action camera option to add to our adventure backpacks."
  ],
  "headers": {
    "8": "Analysis: A potentially affirmative new Action"
  },
  "links": {
    "DJI Action 2": "https://www.techradar.com/reviews/dji-action-2",
    "DJI Osmo Action": "https://www.techradar.com/reviews/dji-osmo-action-review",
    "YouTube video": "https://www.youtube.com/watch?v=9utgzXspwl4",
    "Moe K": "https://twitter.com/mkmkmk13/status/1443703121058754561",
    "GoPro Hero Session": "https://www.techradar.com/reviews/gopro-hero5-session-review",
    "Jasper Ellens": "https://twitter.com/JasperEllens/status/1441160600466300934",
    "DroneDJ": "https://dronedj.com/2021/09/24/dji-action-2-camera-specs-leaked/",
    "Insta360 One R": "https://www.techradar.com/reviews/insta360-one-r",
    "GoPro Hero 10 Black": "https://www.techradar.com/reviews/gopro-hero-10-black",
    "Insta360 Go 2": "https://www.techradar.com/reviews/insta360-go-2",
    "Insta360 One R 1-Inch edition": "https://www.techradar.com/reviews/insta360-one-r-1-inch-edition"
  }
}