{
  "source": "https://www.techradar.com/news/black-friday-gaming-laptop-deal-this-dell-g15-with-an-rtx-3050-ti-is-dollar305-off",
  "title": "Black Friday gaming laptop deal: this Dell G15 with an RTX 3050 Ti is $350 off",
  "category": "computing",
  "updated": "2021-11-01T17:24:21Z",
  "author": "alex-whitelock",
  "summary": "A great price and a chance to beat the crowds",
  "article": [
    "This Dell G15 with an RTX 3050 Ti for $832.99 (was $1,184) is easily one of the best early Black Friday gaming laptop deals we've spotted here at TechRadar.",
    "[Update 11/01] The above Dell is no longer the best deal this week! Check out this MSI GF65 with an RTX 3060 for $849.99 (was $1,099.99) [Update]",
    "Not only is the retailer offering up a hefty $350 discount well before the Black Friday 2021 sale, but this one's extremely well priced considering you're getting a powerful graphics card, Intel Core i5-10500H processor, 8GB of RAM, and 512GB SSD.",
    "Put together, you're getting some very respectable mid-range performance indeed here as well as getting a fairly spacious drive for the money. This machine isn't super high-end, but it's got more than enough power to max out a lot of triple-A games at high settings. Plus, it also happens to be one of the cheapest ways to unlock those coveted Ray-Tracing and DLSS graphical settings in-game.",
    "So, it's a great gaming laptop deal - but should you wait it out until Black Friday? Good question. We think there's bound to be a lot more choice in this year's upcoming Black Friday gaming laptop deals, but this latest discount from Dell definitely offers a prime opportunity to beat the crowds. If you're looking for peace of mind, you can do a lot worse than this Dell G15 with an RTX 3050 Ti.",
    "Outside the US? See the best gaming laptop deals in your region just below.",
    "Not what you're looking for? We've got plenty more options over at our main weekly best gaming laptop deals roundup. Over there you'll find some great cheaper alternatives and the best prices on more high-end RTX 3060 machines too."
  ],
  "headers": {
    "6": "Early Black Friday gaming laptop deals"
  },
  "links": {
    "for $832.99 (was $1,184)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1233384025912538400/https://deals.dell.com/en-us/member/productdetail/azje",
    "for $849.99 (was $1,099.99)": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-6059262444534564000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fmsi-gf65-15-6-144hz-gaming-laptop-intel-core-i5-nvidia-geforce-rtx3060-512gb-ssd-8gb-memory-black%2F6456144.p%3FskuId%3D6456144&article_name=Black%20Friday%20gaming%20laptop%20deal%3A%20this%20Dell%20G15%20with%20an%20RTX%203050%20Ti%20is%20%24350%20off&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fblack-friday-gaming-laptop-deal-this-dell-g15-with-an-rtx-3050-ti-is-dollar305-off",
    "Black Friday 2021 sale": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday gaming laptop deals": "https://www.techradar.com/black-friday/black-friday-gaming-laptop-deals",
    "gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000"
  }
}