{
  "source": "https://www.techradar.com/news/each-google-pixel-5a-leak-makes-it-sound-increasingly-familiar-and-boring",
  "title": "Each Google Pixel 5a leak makes it sound increasingly familiar and boring",
  "category": "phones",
  "updated": "2021-08-16T08:38:07Z",
  "author": "tom-bedford",
  "summary": "Is Google stuck in a rut?",
  "article": [
    "In the midst of all the Google Pixel 6 hullabaloo, you'd be forgiven for forgetting all about the Pixel 5a, the anticipated affordable take on the Pixel 5 we were expecting to be launching soon.",
    "A source has leaked images of Pixel 5a components to Android Police; apparently, these are being shipped to phone repair shops in the US, likely so if people start breaking their Pixels straight away phone repairers are ready to help.",
    "These images show a phone that's near-identical to the Google Pixel 4a 5G and Pixel 5 from last year, with a square rear camera bump housing two lenses and a fingerprint scanner just below that.",
    "There's still a 3.5mm headphone jack, and the volume rocker and fingerprint scanner are where they were on last year's handset.",
    "Even Android Police states \"the most noticeable difference is what seems to be a ribbed power button,\" which attests to how little has changed on this new smartphone.",
    "The battery capacity has also leaked, and it's apparently 4,680mAh. That's a fair size for an Android phone, but its lasting power really depends on software optimizations as much as capacity.",
    "According to the site, the Google Pixel 5a will launch on August 17, and we won't have long to wait to find out if that's correct or not.",
    "If the Google Pixel 5a really is this similar to the 4a 5G and 5, and therefore also pretty close to the Pixel 4a (also from 2020), it suggests Google's reign of error isn't quite over yet.",
    "Those three handsets, Google's only ones from last year, weren't exactly scene-stealing smartphones. Their cameras were only okay, they had pretty cheap-feeling designs, the performance wasn't as strong as some competitors and the battery on most models was sub-par.",
    "The devices were all cheaper models, not aiming for the premium price point previous Pixels hit, and that'd be okay, as expectations for low-cost devices are different than for top-end ones. However, none of the phones were actually that affordable compared to same-spec rivals.",
    "When news first broke that Google was pivoting to mid-range and budget phones, there was excitement, as that's one of the most interesting smartphone markets, but after seeing the three (and soon-to-be four) resultant Pixel phones, we're ready for the Pixel 6.",
    "The Google Pixel 6, which has been partly revealed by Google, seems to be a top-end beast powered by a custom Google-built chipset, and with a better range of cameras than before.",
    "We still don't know too much about the Pixel 6 and its Pro-size sibling, but we don't need to - we already know they're far different from the Pixels 4a, 4a 5G, 5 and 5a, and that's all we need to know."
  ],
  "headers": {
    "7": "Analysis: Google stuck in a rut"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Android Police": "https://www.androidpolice.com/2021/08/15/exclusive-photos-of-pixel-5a-5g-components-leak-as-repair-shops-prep-for-launch/",
    "Google Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a"
  }
}