{
  "source": "https://www.techradar.com/news/bluettis-portable-generators-give-you-a-bunch-of-ways-to-stay-charged",
  "title": "Bluetti’s portable generators give you a bunch of ways to stay charged",
  "category": "smart-home",
  "updated": "2021-08-17T06:09:59Z",
  "author": "sponsored",
  "summary": "Bluetti keeps your power on, wherever you are",
  "article": [
    "All across North America people have been experiencing an unprecedented wave of unexpected power outages and the worst part is it doesn’t appear to be ending any time soon. With everything going on, many people have been turning to portable generators as a backup solution for powering their homes.",
    "Solar technology has been steadily improving over the years to the point where solar-powered generators are not strong enough to power our homes, they’re much more affordable too.",
    "Bluetti makes some of the best solar powered generators on the market and their new AC300 and AC200 Max generators bring even more power to your home. With 3,000W and 2,200W output power respectively, these generators can keep almost everything in your house running for quite a while after a power outage.",
    "Despite the fact that the AC200 MAX looks identical to the AC200P model, it comes with a lot of changes and improvements that make the AC200 Max the better option.",
    "For starters, the AC200 MAX features higher continuous output power at 2,200W from its pure sine wave inverter, a 100W PD 3.0 USB-C port, an upgraded MPPT controller that can handle up to 900W of solar input, and a built-in 30A NEMA TT-30 outlet designed especially for RVs.",
    "Bluetti listened to the feedback it received from some of its previous models and added Bluetooth connection and wireless controls to the AC 200 MAX. The generator can be controlled via the Bluetti smartphone app that is available for both iOS and Android, and it too supports expandable battery packs.",
    "And you can recharge them quickly when they run out of juice. The AC300 can fully charge in just 1.5 hours so you can quickly recharge it from the car, solar panels, or your neighbor’s noisy gas generator.",
    "Both generators can also be plugged into additional batteries to give you a maximum of 12,288Wh of power storage (from the AC300) if you need it. With Bluetti’s Fusion Box Pro, you can connect two AC300s to double the power and capacity if you need it. Get up to 6,000W of continuous power, 24.6kWh capacity in total, and 10.4kW of solar input capability.",
    "The AC300 does not come with an internal battery pack but its modular design allows you to mate the B300 battery module with the AC300. This new modular allows for a heavy-duty unit like Bluetti AC300 to significantly reduce the weight of each single unit but also allows you to replace any or all the batteries, if necessary, in the future. And since the system is modular, you can carry each module individually.",
    "This setup can easily be an emergency power center and run your home essentials for over a week, or with enough solar panels, you can even run your entire house, off-grid indefinitely.",
    "With all the craziness going on this past year, it is certainly more than enough to make you want to get away from it all, but you don’t have to leave your gadgets and the convenience of electricity at home.",
    "Solar powered generators are extremely useful while camping either in the backyard, or trekking across the country and Bluetti designed them to be portable and even modular, so you can swap out the batteries if you need to. Charge up a few before you hit the road, and never worry about running out of juice before you make it home.",
    "You can check out Bluetti’s new AC300 and AC200 Max generators here and see their entire lineup of generators at their website."
  ],
  "headers": {},
  "links": {
    "here": "https://www.bluettipower.com/pages/ac300ac200max",
    "website": "http://www.bluettipower.com/"
  }
}