{
  "source": "https://www.techradar.com/news/microsoft-teams-might-finally-be-making-group-calls-less-awkward",
  "title": "Microsoft Teams might finally be making group calls less awkward",
  "category": "computing",
  "updated": "2021-09-09T13:27:08Z",
  "author": "mike-moore",
  "summary": "Create custom scenes for Together Mode in Microsoft Teams meetings",
  "article": [
    "Group calls in Microsoft Teams could soon be less imposing thanks to a change to the service's Together Mode.",
    "The video conferencing tool has revealed it is upgrading Together Mode to allow developers to create custom scenes for such meetings.",
    "The new Custom Together Mode scenes are available now, allowing users to craft and build their own backgrounds alongside the initial offerings provided by Microsoft.",
    "\"Custom Together Mode scenes in Microsoft Teams provide an immersive and engaging meeting environment with the following actions,\" the company wrote in dev notes advising around the release.",
    "Users will need a Microsoft Developer account, and have a basic understanding of the Microsoft Teams Developer Portal and App Studio to get the most out of the feature, the company added.",
    "Custom scenes are created via the Microsoft Scene studio, which allows developers to port in artifacts that can be built into a scene, with participants in seats with rendered video streams.",
    "Microsoft Teams Together Mode was first revealed in July 2020 as the company looked to make pandemic-enforced conference calls a bit more visually exciting.",
    "The tool creates a live avatar for each participant, and places it into a virtual location such as a beach or lecture theater.",
    "The company initially said Together Mode would make meetings more engaging by allowing users to pick up on body language and facial cues much like you would in a real-life meeting.",
    "Having avatars should also make it easier to spot exactly who is talking in a meeting with lots of participants, rather than trying to guess which chat window is lighting up. The feature was recently upgraded to allow any number of users to talk in Together Mode, right down to one-to-one calls.",
    "The update comes as Microsoft prepares for the launch of Windows 11, where Teams is expected to play a central role.",
    "The so-called Microsoft Teams 2.0 will sport a whole new look, including removing the address bar and main menu to look more like a native app.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Together Mode update"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "dev notes": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3991421412379115500&murl=https%3A%2F%2Fdocs.microsoft.com%2Fen-us%2Fmicrosoftteams%2Fplatform%2Fapps-in-teams-meetings%2Fteams-together-mode",
    "Microsoft Teams Together Mode": "https://www.techradar.com/news/microsoft-teams-now-brings-your-whole-workforce-together-in-a-virtual-room",
    "right down to one-to-one calls": "https://www.techradar.com/news/microsoft-teams-calls-are-about-to-get-a-little-more-intimate",
    "Microsoft Teams 2.0": "https://www.techradar.com/news/microsoft-teams-is-getting-a-whole-new-look-for-windows-11",
    "MSPowerUser": "https://mspoweruser.com/microsoft-custom-scenes-for-together-mode-teams/"
  }
}