{
  "source": "https://www.techradar.com/news/this-10-foot-tall-500-pound-ps5-costs-dollar70k-and-someone-actually-bought-it",
  "title": "This PS5 is 10-foot tall and cost $70K... and it actually works",
  "category": "gaming",
  "updated": "2021-02-17T17:17:19Z",
  "author": "adam-vjestica",
  "summary": "Comically large DualSense controller included",
  "article": [
    "The PS5 is undeniably large, but for some unknown reason, a 10-foot tall model that weighs 500 pound now exists in the world… and it costs $70K (that’s around £50,000 or $AU89,000).",
    "YouTuber ZHC stumped up the eye-watering sum for the towering behemoth, which is even taller than Resident Evil Village’s tall vampire lady. The console even comes with an oversized PS5 DualSense controller, for reasons. The most surprising thing, though, is that it's fully-functional and not just a prop.",
    "We're not entirely sure who made the oversized console, and while we don’t understand the reasoning behind spending such an exorbitant amount on a PS5 that is only suitable for Godzilla, ZHC did at least correct Sony’s questionable color scheme with a custom paint job which took over 100 hours to complete. It's pretty rad.",
    "Sony's PS5 costs $499 / £449 / AU$749, for the disc version at least, and has been impossibly hard to find ever since its release last year. Finding where to buy a PS5 has continually frustrated consumers, as the console continues to be snapped up whenever stock does appear.",
    "The PS5 has certainly received a lot of praise since launch, but one aspect that hasn’t been looked upon favorably is the console’s gargantuan size. It teeters on almost being too big for the majority of home entertainment centers, and it’s the largest console that Sony has ever made. As a positive consequence, though, the PS5 is significantly quieter than the PS4 and PS4 Pro, which were often compared to an aircraft leaving the runway.",
    "The PlayStation 5’s two-tone color scheme has also come under fire, with gamers craving a black PS5 ever since the console was revealed. Thankfully a company is now selling black PS5 faceplates, which can give you that matte black PS5 we’ve all been dreaming about. Simply pop off the side panels of the PS5 and voila, you’ve got a black PS5. Now if only we could get a black PS5 DualSense controller, too...",
    "Via GQ"
  ],
  "headers": {
    "5": "Back in black"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "where to buy a PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review/news/ps4-deals-bundles-price-cheap",
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "black PS5": "https://www.techradar.com/news/the-ps2-themed-black-ps5-has-now-officially-sold-out-but-more-could-be-on-the-way",
    "black PS5 faceplates": "https://www.techradar.com/news/black-ps5-finally-becomes-a-reality-as-faceplates-go-on-sale-but-not-from-sony",
    "GQ": "https://www.gqmiddleeast.com/Largest-playstaion-stands-10-feet-tall"
  }
}