{
  "source": "https://www.techradar.com/news/playstations-mobile-games-will-be-revealed-sooner-than-you-might-think",
  "title": "PlayStation's mobile games will be revealed ‘sooner than you might think’",
  "category": "gaming",
  "updated": "2021-06-12T08:59:43Z",
  "author": "emma-boyle",
  "summary": "“Our IP portfolio is in such a strong state right now”",
  "article": [
    "Sony is apparently planning to reveal some of its plans for bringing its major IPs to mobile “sooner than you might think”, according to Sony Interactive Entertainment (SIE) president and CEO Jim Ryan.",
    "In a recent interview with Axios, Ryan was willing to touch on some of Sony’s plans for mobile and the reasons behind them. According to Ryan, some of the thinking behind the expansion to mobile “is that our IP portfolio is in such a strong state right now, it seems perverse to restrict enjoyment of it to our existing PlayStation community.”",
    "When it comes to specifics, though, Ryan was less forthcoming. When asked by Axios whether Sony would seek to acquire studios or whether it would develop in-house expertise on mobile games, he replied, “We are working on a number of models to open up mobile. You’ll see the first fruits of this sooner than you might think.”",
    "Of course, this isn’t the first we’re hearing of PlayStation’s plans to expand into mobile games. Chatter around PlayStation titles coming to Android and iOS started in earnest in April 2021, when a job ad for a Head of Mobile at PlayStation was spotted, looking for someone to “focus on successfully adapting PlayStation’s most popular franchises for mobile.”",
    "Even more recently than that, Jim Ryan reportedly said in an investor relations presentation that Sony will “begin to publish some of our iconic PlayStation IP on mobile” in \"FY21\". With the fiscal year running to March 2022, this means we could see some of PlayStation’s biggest titles on smartphones before then which would be, as Ryan suggested, sooner than some might think.",
    "With some kind of reveal expected relatively soon, then, the real question is what franchises Sony is planning to bring to mobile. The only real indication we’ve had is that PlayStation is looking to focus on its “most popular franchises”, which could mean games drawing on new and upcoming PS5 titles like Ratchet and Clank: Rift Apart, Horizon Forbidden West and God of War: Ragnarok. Or it could see Sony dig back through its catalog of older but popular releases as it has plenty to work with there.",
    "While Sony has mobile plans up its sleeve, we’re not planning to see a huge number of exclusive announcements from the publisher during E3 2021. Sony has said it is sitting out this year’s show which takes place from June 12 to June 15 and is going entirely online for the first time. E3 will feature presentations from publishers such as Square Enix, Nintendo, Ubisoft and Microsoft and TechRadar will be reporting the latest news from the show across the four-day broadcast so keep checking back."
  ],
  "headers": {
    "5": "What to expect?"
  },
  "links": {
    "Axios": "https://www.axios.com/ps5-jim-ryan-interview-mobile-cyberpunk-sony-e2ba0ddb-17b6-4882-bb9e-2908c7c4f71d.html",
    "was spotted": "https://www.techradar.com/news/some-of-playstations-biggest-game-franchises-could-come-to-mobile",
    "reportedly said": "https://www.techradar.com/news/sony-ps5-game-franchises-could-land-on-iphone-and-android-later-this-year",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "said": "https://www.techradar.com/news/sony-is-skipping-e3-again-but-what-does-that-mean-for-ps5"
  }
}