{
  "source": "https://www.techradar.com/news/what-is-vivo-a-brief-overview-of-the-company-and-its-smartphones",
  "title": "What are Vivo phones? A brief overview of the company and its smartphones",
  "category": "phones",
  "updated": "2021-03-15T09:45:05Z",
  "author": "tom-bedford",
  "summary": "Everything about the Chinese tech company",
  "article": [
    "Vivo is currently one of the lesser-known Chinese phone brands selling its handsets in the West. However, with a legacy in affordable smartphones, a few unique top-tier innovations, and friends in high places, we could be hearing a lot more about the company in time.",
    "We’ve now seen a number of Chinese phone brands make it big outside Asia by offering high-spec phones at low prices, and Vivo could be set to follow the same path. In a few years, you could see Vivo phones sitting on store shelves next to Samsung Galaxy and Apple iPhones.",
    "In this guide to Vivo, we look at the company’s history, the phones it makes, and where it stands with regards to non-smartphone devices too.",
    "Vivo was founded in 2009, selling its phones in only China for a time. This changed in 2014, when the company extended its reach to a few more countries, predominantly in South Asia. The brand released its first smartphone in Europe in 2020, and now sells its devices in a few countries on the continent including the UK, France, Italy and Spain.",
    "The company also has a presence in a few non-Eurasian countries – namely Colombia, Chile and Australia.",
    "Alongside Realme, Oppo and OnePlus, Vivo is affiliated with tech conglomerate BBK Electronics, although the exact relationship between BBK’s brands has always been unclear.",
    "In a statement, Vivo told TechRadar 'vivo is an independent company and does not belong to any parent company. We invest in our own R&D and product development resources, and do not share with any brand in both the software and hardware development.'",
    "'In 2001, the three BBK business divisions parted to fully separate business entities/companies. BBK Communications became vivo'.",
    "Vivo’s flagship line of smartphones is the X range, with the most recent addition, the Vivo X60. These phones feature top-end specs, but typically at mid-range prices. They often come with camera innovations such as a physical gimbal sensor on the main camera, for improved optical image stabilization.",
    "In addition, Vivo has its Y-series of devices, such as the Y70 and Y20s. In general, these are dependable, low-cost devices. Higher numbers correlate to better specs and higher prices.",
    "The Vivo Apex smartphones are worth a look, too – although you can’t buy these handsets. They’re concept devices that Vivo launches annually, to show off tech that later trickles down into smartphones the company launches to market.",
    "So, the X and Y series are the two smartphone ranges that Vivo sells in Europe, but it produces plenty of other phones that aren’t sold in all countries. Notable among these is iQOO, a line that’s dedicated to high performance (mainly for gaming), and the V and S series of phones, which sit between the X and Y lines. We’re waiting on these models to make their way to Europe.",
    "At the time of writing, Vivo is less than a year old in Europe. As such, it’s difficult to specify release patterns for its phones in the region.",
    "The first batch of Vivo’s phones were launched in Europe in October 2020, comprising the X51, Y70, Y20s and Y11s; the X51 had been launched earlier in the year elsewhere.",
    "The Vivo X60, the company’s newest flagship, saw a Chinese launch in December 2020. There’s a possibility we could see this device come to Europe, too, although we have no idea as to when.",
    "Alongside its range of smartphones, Vivo also sells audio devices such as the Vivo TWS Neo earbuds, which appear designed for use alongside the company’s phones.",
    "In late-2020, the brand also unveiled the Vivo Watch – although it isn’t available in Europe, and there’s no word if it will appear, or whether we’ll be seeing more wearables from the company in the future.",
    "It’s possible that, as Vivo expands, it could move into areas such as fitness trackers, tablets and even over-ear headphones – although that’s just speculation for now."
  ],
  "headers": {
    "3": "A brief history of Vivo",
    "8": "What phones does Vivo make?",
    "12": "Vivo phone availability information",
    "15": "Other tech Vivo sells"
  },
  "links": {
    "Vivo X60": "https://www.techradar.com/news/vivo-x60",
    "Y70": "https://www.techradar.com/reviews/vivo-y70-review",
    "Y20s": "https://www.techradar.com/reviews/vivo-y20s"
  }
}