{
  "source": "https://www.techradar.com/news/ikea-unleashes-asus-rog-gaming-furniture-and-a-gaming-chair-so-cheap-youll-fall-off-your-seat",
  "title": "IKEA unleashes Asus ROG gaming furniture – and a gaming chair so cheap you’ll fall off your seat",
  "category": "gaming",
  "updated": "2021-09-16T14:26:18Z",
  "author": "darren-allan",
  "summary": "Huvudspelare gaming chair is seriously affordable",
  "article": [
    "IKEA’s collaboration with Asus ROG (Republic of Gamers) has now borne fruit with the announcement of the imminent release of the range of gaming furniture at the start of next month.",
    "The first Uppspel range will go on sale both online and in stores on October 1 in the US and UK (as well as Ireland), and comes alongside a further five series of product families aimed at PC gamers, namely: Lanespelare, Matchspel, Gruppspel, Utespelare and Huvudspelare. Those other ranges are just the work of IKEA, by the way, and only the Uppspel products are actually made in conjunction with ROG.",
    "As to what you can expect to be able to purchase in the way of Uppspel products, that includes a gaming desk (price not yet mentioned), display cabinet with glass doors (£60, or around $82), storage unit with drawers (£75, or around $103 – a cabinet which could potentially slide under a desk), a pegboard (£19, or around $26) plus accessories (£7.50, or around $10), and a PC stand with castors (£12, or around $17).",
    "In total, over 30 products will be launched in these various families, and while IKEA only worked with Asus ROG on Uppspel, the retailer notes that the other product ranges were informed with the “insights and knowledge gained from the ROG partnership”, and they all concentrate on meeting three key elements for gamers: design, high performance, and price.",
    "Other products will include several gaming chairs, including a supremely affordable Huvudspelare model at £45 (around $62) which is pictured below, and a Utespelare chair (£99, or around $136) plus a Matchspel gaming chair (£129, or around $178 – still nicely wallet-friendly).",
    "Other more niche gaming accessories IKEA is bringing out include a mouse bungee (£9, or around $12), mug and neck pillow (both £7.50, or around $10), mouse pad (£4.50, or around $6), as well as headset stands and a floor pad, and more besides.",
    "When first announced, IKEA made a big thing of stressing the affordable prices of its gaming furniture and accessories, and certainly the company hasn’t let us down on that front with some of these products.",
    "In particular, our eye is caught by the Huvudspelare gaming chair which retails at £45 (around $62). The best gaming chairs certainly don’t come cheap, and indeed you’ll struggle to get even a bog-standard bargain basement office chair for that kind of money.",
    "Now, obviously we have to temper expectations somewhat for anything in this kind of price bracket, but the Huvudspelare chair appears to take some cues from its much more expensive IKEA Markus cousin, namely the mesh seat back seen on this well-liked office chair. That said, the armrests and seat cushion on the Huvudspelare look rather thin, but we can’t really judge much from a brief glimpse of the chair – we’ll only really know when it actually comes out.",
    "For this kind of money, though, it’ll only need to be half-decent to make a case for itself in terms of a seriously affordable option for PC gamers on a shoestring budget for their accessories. It certainly looks like it’s a better made seat than the equivalent super-cheap office chair, the IKEA Renberget in the US, which is $50 (or the IKEA Torkel in the UK which retails at an identical £45).",
    "Fingers crossed that IKEA can pull it out of the bag and maintain a suitable level of quality here, because the company is certainly promising to “democratise the gaming experience”, as Ewa Rychert, Global Business Leader of Workspaces at IKEA, asserts, further noting: “We’ve taken the first step on our gaming journey, and have done it by offering consumers affordable, high-performing gaming products and complete home solutions that we hope reflect people’s personality and taste.”"
  ],
  "headers": {
    "6": "Analysis: How cheap can a gaming chair possibly be?"
  },
  "links": {
    "IKEA’s collaboration with Asus ROG": "https://www.techradar.com/news/asus-rog-and-ikea-team-up-to-make-gaming-furniture-with-help-from-pro-gamers",
    "gaming desk": "https://www.techradar.com/best/best-gaming-desk-2020-top-standing-l-shaped-and-motorized-desks",
    "IKEA made a big thing of stressing the affordable prices": "https://www.techradar.com/news/asus-rog-and-ikea-team-up-to-make-gaming-furniture-with-help-from-pro-gamers",
    "best gaming chairs": "https://www.techradar.com/news/best-pc-gaming-chair-5-best-chairs-to-game-in-comfort",
    "bargain basement office chair": "https://www.techradar.com/best/best-office-chairs",
    "IKEA Markus cousin": "https://www.techradar.com/best/best-office-chairs"
  }
}