{
  "source": "https://www.techradar.com/news/microsoft-combines-onenote-apps-into-a-single-offering",
  "title": "Microsoft combines OneNote apps into a single offering",
  "category": "computing",
  "updated": "2021-08-06T19:30:06Z",
  "author": "anthony-spadafora",
  "summary": "OneNote for Office and OneNote for Windows 10 are merging into a single note-taking app",
  "article": [
    "Microsoft has revealed that OneNote on Windows 10 will be receiving a series of updates over the next year as the company plans to combine multiple versions of the app into a single offering.",
    "In a new blog post, the software giant explained that its note-taking app will be updated with its latest pen and ink features, a flexible new navigational UI layout option as well as a visual refresh ahead of the launch of Windows 11.",
    "Most importantly though, Microsoft plans to combine the OneNote for Office and the OneNote for Windows 10 app from the Microsoft Store into a single app.",
    "In the coming months, the OneNote app will receive new features as well some currently unique to OneNote for Windows 10.",
    "During the second half of next year, Microsoft will also send out in-app invitations to OneNote for Windows 10 users that will let them try out the company's new OneNote experience. More details on this will be revealed in an announcement for IT pros that will inform them of what they need to do to update their organization's users to the new OneNote app.",
    "Current OneNote users don't have to take any action as they'll automatically receive all of the new features Microsoft has in store for its note-taking app.",
    "By combining both existing OneNote apps into a single app, Microsoft will likely be able to encourage even more users to try out the service as doing so will remove any confusion over which app they need to install on their devices."
  ],
  "headers": {
    "3": "A single OneNote app"
  },
  "links": {
    "OneNote": "https://www.techradar.com/how-to/computing/how-to-use-onenote-1330149",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1182788987963204600&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Foffice-365-blog%2Fwhat-s-coming-to-onenote%2Fba-p%2F2612960&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-combines-onenote-apps-into-a-single-offering",
    "note-taking app": "https://www.techradar.com/best/best-note-taking-app",
    "visual refresh": "https://www.techradar.com/news/microsoft-teams-is-getting-a-whole-new-look-for-windows-11",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "OneNote for Office": "https://www.techradar.com/reviews/microsoft-onenote",
    "OneNote for Windows 10": "https://www.techradar.com/reviews/microsoft-onenote",
    "which app they need to install": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9841311127289210000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Foffice%2Fwhat-s-the-difference-between-the-onenote-versions-a624e692-b78b-4c09-b07f-46181958118f"
  }
}