{
  "source": "https://www.techradar.com/news/why-xbox-game-pass-is-a-discovery-engine-for-gamers",
  "title": "Why Xbox Game Pass is a ‘discovery engine’ for gamers",
  "category": "gaming",
  "updated": "2021-05-04T13:38:17Z",
  "author": "adam-vjestica",
  "summary": "Interview: Xbox Game Pass is ‘only getting better’",
  "article": [
    "Microsoft’s Xbox Game Pass has had a seismic impact on the video game industry. It’s been the driving force behind the early success of the Xbox Series X, and made the more affordable Xbox Series S a tempting proposition for those looking to enter the Xbox ecosystem for the very first time.",
    "But even though the value proposition Xbox Game Pass has been well documented, Microsoft’s subscription service has also provided a terrific platform for independent developers to shine – one that feels like a match made in heaven.",
    "We spoke to “Ago” Agostino Simonetta, director of the ID@Xbox global partnership team, about how Microsoft’s program has helped bring more independent games to the Xbox platform, the power of Xbox Game Pass, and the importance of Microsoft’s more affordable new current-gen console, the Xbox Series S.",
    "Independent games have continued to rise in prominence since the Xbox 360, which was a platform that Ago admits was “super close to the development community”. From the popular Summer of Arcade event, which used to celebrate and highlight a selection of exciting new titles, to the Xbox Live Indie Games initiative, Microsoft made great strides in championing independent developers.",
    "But when it came to Xbox One, Ago conceded that Microsoft lost its way a little. “I think at one point, the evolution of the program kind of froze for a bit. There was a moment of freezing...and not being perfectly in line with the market and where it was going. ID@Xbox was the answer.”",
    "The ID@Xbox program was Microsoft’s big push to bring independent developers back to the Xbox platform, and was designed to reflect how the market had evolved. As Ago explained, “...we were ready to go to the next level and effectively open up [Xbox] to [developers] to completely self publish.”",
    "He also admitted that due to how the labelling of independent games has changed, and how these games are perceived among gamers, it’s unlikely that a Summer of Arcade-style event will return.",
    "“Now we have hundreds of millions of people, billions of people – they're more than comfortable engaging with independent titles, right. So I think as much as I missed those [Summer of Arcade] days...we need to have a new outlook in terms of how we promote content, how we distribute content... the Summer of Arcade was a very important milestone in the evolution. But I think the market is very different today.”",
    "And he’s not wrong. Independent games now garner the same type of respect, excitement and commercial success that was previously only available to the annual blockbuster titles that are typically developed by hundreds of people and backed by the biggest publishers in the world. ID@Xbox helps bring more independent games to the Xbox platform, shines a spotlight on them, but also avoids pigeonholing them as just indies.",
    "“I think we need to go beyond those labels,” Ago said. “The market has evolved so much...we treat games as games. We don't even say [which games] are ID@Xbox partners because the audience does not care. The title is [why] they love it.”",
    "With Microsoft offering a cheaper entry point into next-gen gaming with Xbox Series S, what do independent developers think of the more affordable system, and is it having the impact Microsoft desires? Ago believes it is.",
    "“I think if you're a partner of a platform...and you're a content creator, you are very excited the moment the platform [holder] gives you tools to reach the largest possible audience. And I think with now with the launch of the Xbox Series X and S, you start seeing the validation of the strategy, how Xbox Series S is delivering a next-gen experience for people that don't need top performance,\" Ago said. \"A lot of people want to come to experience next-gen, but quite often they wait a bit longer. But actually, at that price point, I can jump in and get that experience.”",
    "Ago is also aware that a lot of gamers own multiple consoles, and that the Xbox Series S could be seen as a great alternative. “...let's face it, in a world where people play on multiple consoles, it’s great. You might not be an Xbox player by default, but actually, with the power of Xbox Game Pass and the [price of the] Xbox Series S…people might think for a second. I have friends that have other consoles, but they're playing on Xbox Series S today, and they’re probably in the Xbox Game Pass program.",
    "“So I think it's been a very powerful [option] and again, yes, the reaction from the developers was pretty positive. Developing for the platform as a whole has also been relatively straightforward...we always say we are successful if we make the transitions [from a console generation] as boring as they can be. So yeah, I think the feedback has been super positive. And you know, you're on the media...you see a lot of fan reaction. I don't know what your point of view is. But I think it's landing pretty well.”",
    "And so do we, to the point where we stated that the combination of Xbox Series S and Xbox Game Pass could make Microsoft’s sleek all-white Xbox a real threat to the PS5.",
    "But Microsoft’s subscription service isn’t just a hit with gamers – independent developers are excited too. When asked whether Xbox Game Pass has driven more developers to the ID@Xbox program, Ago was under no illusions about the impact the service has had.",
    "“Yes, totally. We actually had a developer come to us and say ‘I used to be PC-focused, but obviously, you guys have Xbox Game Pass across the two platforms [Xbox and PC]. I'm interested in exploring this value, do you like my game? Can we figure something out?’. So yeah, I think in general, the community response has been one of excitement. And then when you look at the positive impact Xbox Game Pass is having on [developers'] games, I think it has really helped.”",
    "Xbox Game Pass is great for independent developers, then, but Ago stressed that Microsoft has worked hard to “partner up with more and more studios” and also tried to “improve our dev tools and processes…we try to make people’s lives easier. Xbox Game Pass has been received extremely well by the development community, but also what we try to do to make their life easier. It's helping in these conversations.”",
    "One question that’s often leveled at Xbox Game Pass is that it’s too good to be true. But as Ago admits, while “it does seem to be good to be true” he reiterates “that, actually, it is true, and it’s only getting better.” He also explained how it's become a discovery engine for gamers, who are playing more games, different genres, and sharing their new favorite titles with others.",
    "“What we are seeing with Xbox Game Pass, is that the moment you remove spending on an individual title from the equation – obviously, you're still paying a subscription – but the moment that happens it affects the decision,” Ago explains. “I don't like puzzle games and, for example, Human Fall Flat is a puzzle game. I'm not gonna buy it no matter what the price point is. But the moment it’s on Game Pass? We know that a large percentage of the people that have engaged with Human Fall Flat in the past have never played a puzzle game on our platform. So effectively, we think of Xbox Game Pass as a discovery engine – it breaks those barriers.”",
    "Ago went on to provide another example, one that might resonate specifically with a number of European Xbox owners. “I played MLB: The Show 21 recently from our friends at Sony San Diego and MLB. It's on Game Pass, and I know so many people that never played MLB. I care about soccer and F1. But… I think it’s in Game Pass...why not? Why not play MLB? Even if you don't care about baseball, because you might not enjoy it. So I think it's a discovery engine like that.”",
    "So what’s next for Xbox Game Pass and ID@Xbox? Well, there are some big hitters on the way. The Ascent, Edge of Eternity, and 12 Minutes are but a few of the games coming to Xbox Series X and Xbox consoles through the program which look seriously impressive, and two of them launch on Xbox Game Pass on day one. Ago and the ID@Xbox team continue to “find content, talk to and manage partners” and he encourages everybody to “flag” games that the community would like to see.",
    "With Xbox Game Pass and the ID@Xbox program, it’s clear that Xbox has re-established itself as an enticing platform for independent developers to develop for – and more importantly, thrive."
  ],
  "headers": {
    "5": "Back on track",
    "10": "The impact of Xbox Series S",
    "15": "The Game Pass Effect",
    "21": "Future perfect"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "value proposition Xbox Game Pass": "https://www.techradar.com/news/ps5-isnt-good-value-compared-to-xbox-series-x-and-im-sick-of-it",
    "Xbox 360": "https://www.techradar.com/news/gaming/consoles/how-the-xbox-360-won-the-console-war-1196990",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "a real threat to the PS5": "https://www.techradar.com/news/xbox-series-s-is-now-a-real-threat-to-ps5-heres-why",
    "MLB: The Show 21": "https://www.techradar.com/news/mlb-the-show-21-xbox-game-pass-series-x"
  }
}