{
  "source": "https://www.techradar.com/news/leak-suggests-a-cheap-tesla-could-be-with-us-sooner-than-expected",
  "title": "A cheap Tesla could be with us sooner than expected, according to tipster",
  "category": "car-tech",
  "updated": "2021-08-05T15:22:09Z",
  "author": "chris-teague",
  "summary": "Could this be the low-cost Tesla Model 2?",
  "article": [
    "Tesla could be closer to building its touted $25,000 electric car than anyone expected, if recent rumors are to be believed.",
    "The compact car - which could be called the Tesla Model 2 - would comfortably be the automaker's least expensive vehicle to date, and could help push EV adoption forward in the US and beyond.",
    "According to a post on Chinese social media site Sina Weibo, the first prototype has been built and suppliers are on board for the eventual production run.",
    "Rumors are far from fact, but as a InsideEVs report states, this one comes from a well-known source with a track record of leaking information that ultimately proves to be true.",
    "If the car is truly in the prototype stage, we could start seeing physical testing vehicles in the wild sometime later this year or early next.",
    "It's easy to assume that this is another publicity stunt for Tesla, which was adamant that its Model 3 sedan would enter the market with an affordable $35,000 version.",
    "That car did eventually show up, far later than expected, but only remained on sale for a little over a year before being discontinued. This rumored car, however, may end up landing a bit closer to its stated target.",
    "Earlier this year, Tesla China President Tom Zhu confirmed that a new model would be designed and built at the Giga Shanghai facility, which gives these rumors more weight than they would otherwise. Zhu also confirmed that the Chinese-built Tesla would be sold worldwide.",
    "For hopeful EV owners around the globe, this could end up being one of just a few actually affordable vehicles on sale.",
    "We're still at a point in the EV timeline where automakers' development and marketing costs drive sales costs to a point that make many vehicles unobtainable for the average buyer.",
    "If we are truly to see a seismic shift to electric vehicles within the decade, as many companies claim, there will need to be an abundance of affordable vehicles available, and ultimately, people will need to buy them.",
    "Should this new car actually become a reality, Tesla's appeal and its ability to build in desirable tech and attractive styling may help push the tipping point up by a few years, which is a good thing for everyone."
  ],
  "headers": {
    "4": "Analysis: a cheap Tesla for 2022?"
  },
  "links": {
    "Sina Weibo": "https://weibo.com/us",
    "InsideEVs report": "https://insideevs.com/news/524282/25k-tesla-prototype-built-rumor/",
    "Model 3": "https://www.techradar.com/news/tesla-model-3"
  }
}