{
  "source": "https://www.techradar.com/news/us-blacklists-chinese-quantum-computing-firms-over-security-fears",
  "title": "US blacklists Chinese quantum computing firms over security fears",
  "category": "computing",
  "updated": "2021-11-25T14:51:02Z",
  "author": "mayank-sharma",
  "summary": "Dozen Chinese firms join compatriots in US blacklisting",
  "article": [
    "The US Department of Commerce's Bureau of Industry and Security has added 27 companies to its list of entities prohibited from doing business with the US, including several Chinese firms that dabble with quantum computing.",
    "The Financial Times reports that the companies were banned on grounds they threaten national security.",
    "Eight of the Chinese groups have been specifically targeted to prevent them from accessing sensitive quantum technologies, with the Department accusing the companies of helping develop the Chinese military’s quantum computing programme.",
    "According to reports, Secretary of Commerce Gina Raimondo said the eight Chinese firms are working to advance Beijing’s “efforts that support military applications, such as counter-stealth and counter-submarine applications, and the ability to break encryption or develop unbreakable encryption.”",
    "FT notes that the addition of the 27 companies to the ban list is the latest move by the Biden administration to prevent Beijing from getting its hands on bleeding edge technology that could have military applications.",
    "“This is a sensible move and an important reminder of the scope and scale of China’s efforts to achieve technological breakthroughs that erode US national security,” Martijn Rasser, a former US official told FT.",
    "In addition to the targeted Chinese groups, Washington has placed 13 Pakistani companies on the “entity list” for activities related to nuclear and ballistic missile programs, as well as firms from Japan, and Singapore."
  ],
  "headers": {
    "3": "Military use"
  },
  "links": {
    "quantum computing": "https://www.techradar.com/news/quantum-computing-breakthrough-will-help-us-learn-about-the-earliest-moments-of-the-universe",
    "Financial Times": "https://www.ft.com/content/f1a4f2da-fe08-4c24-80cb-eb6fbc759f35",
    "quantum technologies": "https://www.techradar.com/news/theres-been-another-major-quantum-computing-breakthrough",
    "encryption": "https://www.techradar.com/best/best-encryption-software"
  }
}