{
  "source": "https://www.techradar.com/news/vivaldi-40-browser-comes-with-built-in-email",
  "title": "Vivaldi 4.0 browser comes with built-in email",
  "category": "computing",
  "updated": "2021-06-09T23:44:01Z",
  "author": "anthony-spadafora",
  "summary": "Is Vivaldi 4.0 the first real alternative to Big Tech?",
  "article": [
    "Vivaldi Technologies has given its browser a complete visual overhaul packed with new features to help users break free from Big Tech.",
    "Vivaldi 4.0 is now available for Windows, Mac, Linux and Android and the updated browser now includes its own email, calendar, RSS reader and translation services to provide users with a compelling alternative to Google, Microsoft and Apple.",
    "The company's desktop and mobile browser on Android now offer a new built-in, privacy-friendly translation service powered by Lingvanex and hosted by Vivaldi called Vivaldi Translate.",
    "At the same time though, Vivaldi 4.0 also includes the eagerly-awaited beta versions of Vivaldi Mail with Vivalid Feed Reader and Vivaldi Calendar on desktop. While the company's Vivaldi Mail Beta works with existing email and calendar services, users can also set up a new account on vivaldi.net or add a trusted third-party service such as Fastmail.",
    "Vivaldi CEO Jon Von Tetzchner explained in a blog post how the latest version of its browser and all of the additional services it includes could be the perfect way for people looking to break free from Big Tech to do so, saying:",
    "“A growing movement of people worldwide is looking for reliable, functional alternatives to the tools offered by the tech giants. Vivaldi meets that need – and more – with an expanded set of integrated features that will give you more control of your data and your workflow. Simply put, the era of trusting Big Tech is over.”",
    "While Vivaldi 4.0 comes packed with features, the browser offers three default layouts in the form of Essentials, Classic and Fully Loaded so that users can choose which ones they want to use based on their individual needs.",
    "Essentials is ideal for those who want to keep things simple with a more private browser but aren't quite ready to test out all of the company's new services and features. Classic on the other hand adds Panels and Vivaldi's Status Bar to the mix to help boost productivity. Finally Fully Loaded includes everything from the other two layouts while also enabling users to take advantage of the new beta version of Vivaldi Mail, Vivaldi Feed Reader and Vivaldi Calendar.",
    "Unlike other email clients, Vivaldi Mail does a lot of the heavy lifting for users by automatically detecting mailing lists and mail threads in order to categorize all of a user's emails in a way that makes them easy to find. Another interesting thing about the service is that it does all of this on a user's computer rather than on a remotely operated webmail server. As a result, users aren't tied to a specific service provider and can change email providers as often as they like without losing email filters all while maintaining privacy and online freedom.",
    "Interested users can download Vivaldi 4.0 now from Vivaldi's website in order to test out the company's latest update for themselves."
  ],
  "headers": {
    "6": "Three default layouts"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "translation service": "https://www.techradar.com/best/best-translation-software",
    "Jon Von Tetzchner": "https://www.techradar.com/news/vivaldi-is-the-latest-browser-to-block-floc",
    "blog post": "https://vivaldi.com/press/vivaldi-4-0-vivaldi-translate-beta-of-vivaldi-mail-calendar-and-feed-reader-arive/",
    "private browser": "https://www.techradar.com/best/anonymous-browsing",
    "email clients": "https://www.techradar.com/best/best-email-clients",
    "email providers": "https://www.techradar.com/news/best-email-provider",
    "Vivaldi's website": "https://vivaldi.com/"
  }
}