{
  "source": "https://www.techradar.com/news/all-hitman-3-starting-locations-revealed-along-with-whats-inside-the-deluxe-edition",
  "title": "All Hitman 3 starting locations revealed, along with what's inside the Deluxe Edition",
  "category": "gaming",
  "updated": "2021-01-14T12:28:22Z",
  "author": "adam-vjestica",
  "summary": "Murder on the move",
  "article": [
    "IO Interactive has shared all the starting locations Agent 47 will visit in Hitman 3, as well as what’s inside the game’s Deluxe Edition. If you’d rather not know where you’ll be jetting off to in Hitman 3, beware that spoilers lie below.",
    "Half the fun of the Hitman series – aside from assassinating targets through a variety of ingenious means – comes from the game’s varied locales. Until now, we only knew that the bald-headed contract killer would be jetting off to the Arab Emirates, the UK and China, but developer IO Interactive have shared that Hitman 3 will also see players travel to Germany, Argentina and Romania.",
    "In a blog post on IO Interactive’s website, the developer said: “Agent 47’s adventure will take him around the world to six unique locations on three continents, where he will take on the biggest contracts of his entire career. Each location has been designed to deliver a unique and memorable gaming experience, from the game’s first mission in the world’s tallest building to the dramatic epilogue that concludes the trilogy in style with a narrative-focused ending.”",
    "Hitman 3 is also getting a Deluxe Edition, which includes the following content and add-ons:",
    "Those who pre-order the game will also receive the Trinity Pack, which includes new suits, briefcases, and weapons for Agent 47 to wield.",
    "Hitman 3 arrives on PS5, PS4, Xbox Series X, Xbox Series S, Xbox One, Google Stadia and PC on January 20. It’ll also be playable on Nintendo Switch via cloud streaming technology. Oh, and if you fancy stepping into the polished shoes of the trained assassin, Hitman 3 is also playable entirely in virtual reality for PSVR owners."
  ],
  "headers": {
    "5": "Target sighted"
  },
  "links": {
    "blog post": "https://www.ioi.dk/hitman-3-all-locations-revealed/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/news/ps4-deals-bundles-price-cheap",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review"
  }
}