{
  "source": "https://www.techradar.com/news/vivo-x70",
  "title": "Vivo X70 price, news, rumors and why you should pay attention to this Android phone",
  "category": "phones",
  "updated": "2021-09-06T15:05:19Z",
  "author": "tom-bedford",
  "summary": "Vivo's next flagship line",
  "article": [
    "There's not long left until the Vivo X70 series of Android phones launches, as we're expecting these new handsets to land on September 9 - though a global release date might be quite a bit later.",
    "The X series is Vivo's top line of phones, making the Vivo X70 handsets its next top collection of phones akin to the Samsung Galaxy S22 or Xiaomi 12 lines. It follows the Vivo X60 line, and we gave the Vivo X60 Pro a fairly positive review, though there are parts that could be improved upon.",
    "It's curious that the Vivo X70 phones are launching now, but it seems the company isn't obeying an annual release pattern. The X60 phones debuted in China in late December and went on sale globally in March, so only six months before the X70 phones are set to debut. Perhaps they'll only be available to buy outside China in March 2022, though.",
    "Either way, this September 9 launch event will bring us everything you need to know about the hardware and software of the Vivo X70, so you'll be able to decide ahead of time whether you like the look of it or not.",
    "Ahead of the 9th, we've collected everything that Vivo has confirmed about the X70 devices (of which there is a lot) as well as things leakers have said about the phones, which paints quite a clear picture of the handsets.",
    "Vivo has confirmed the X70 series will debut at a launch event on September 9. This is implied to be a China-only launch, as is Vivo's way, and it might be many months before we see the handsets launch outside China.",
    "For the X60 series, only the Pro model came to the UK, and neither of the versions hit the US, so we might only see one or two devices in the wider world.",
    "Regarding price, that's hard as we don't even know Chinese pricing yet, but the three phones will probably hit slightly different price points. The X70 will likely be a mid-ranger, with the X70 Pro hitting the same kind of price as the Samsung Galaxy S21 or Xiaomi Mi 11, and the Pro Plus might be priced as a Sony Xperia 1 III or iPhone 12 Pro Max competitor. That depends on where they launch, of course.",
    "Lots of what we've heard about the Vivo X70 series isn't leaks, but specs the company itself has confirmed.",
    "Case in point: the company has confirmed the phone screens will have 2K resolutions - that means around 1440 x 3200 but it could be slightly higher depending on the aspect ratio. An image shared with the information shows the front-facing camera will be at the top-center of the screen, like in the X60 series. It's not clear if this will be the design for all the phones though.",
    "In addition, via SparrowNews, it sounds like Vivo has already taken to plastering X70 series posters around China, which show off the X70 Pro Plus in a few different colors.",
    "These pictures, and other official ones shared, show Zeiss branding on the back of the phone. Zeiss has previously made camera lenses for Vivo phones so the continuation of that partnership here isn't a total surprise, but it's worth noting.",
    "Vivo's president has also confirmed the X70 series will get a brand-new ISP - that means Image Signal Processor, and is the part of the chipset which deals with image optimization - so there could be some new camera tricks at play.",
    "Phones understood to be the X70 / 70 Pro and X70 Pro Plus were spotted on Chinese certification website TENAA too, and there's some interesting information. It sounds like the standard phone will have a 6.58-inch 1080 x 2376 screen and a 4,320mAh battery, while the Pro Plus will have a 6.78-inch 1440 x 3200 display and a 4,430mAh power pack. In addition, the devices sound fairly light at 181g and 209g respectively.",
    "That actually contradicts some other information we heard in a giant Vivo X70 leak, at least for the battery sizes, as apparently the smaller phone will get a 4,400mAh power pack, which goes up by 50mAh for the Pro and another 50mAh for the Pro Plus.",
    "This leak also suggests the vanilla and Pro phones will get Samsung's Exynos 1080 chipset, while the Pro Plus will boast the top-end Snapdragon 888 Plus chipset, and apparently the lower models will get 44W charging while the premium one will get 55W wired and 50W wireless powering.",
    "We also hear about cameras with this leak. It sounds like the Vivo X70 will get a 40MP main snapper and two 12MP sensors with unknown lenses. The Pro is said to keep the 12MP duo but with a 50MP main and an 8MP extra shooter, while the Pro Plus apparently has a 50MP, 48MP, 12MP and 8MP combination.",
    "All of the phones are said to have 32MP selfie cameras. Without knowing details of the actual lenses, it's a little hard to guess at the photographic power of any of the devices.",
    "A leaker has provided a little extra information on the Vivo X70 Pro Plus though. Apparently the 8MP camera has a periscope lens for 5x optical zoom, while the 12MP snapper has a telephoto lens offering 2x zoom - perhaps this is used for Portrait mode. The 48MP sensor is said to have an ultra-wide lens, meaning the 50MP snapper is the main one.",
    "In addition, the leaker backs up the claim that the phone will use the Snapdragon 888 Plus chipset.",
    "Finally, a candid Vivo X70 Pro photo, captured of it in the wild, suggests it looks a lot like the Vivo X60 Pro, and quite distinct from the blindingly-premium Pro Plus model."
  ],
  "headers": {
    "5": "Vivo X70 release date and price",
    "8": "News and rumors"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Vivo X60 Pro": "https://www.techradar.com/reviews/vivo-x60-pro",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "confirmed": "https://weibo.com/1809745371/Kwqsy1K7g?type=comment#_rnd1630923333383",
    "SparrowNews": "https://sparrowsnews.com/2021/09/02/vivo-x70-pro-plus-blue-color-and-vivo-v1-real-life-photo/",
    "also confirmed": "https://weibo.com/2419314855/Kvnss2gcK",
    "X70 / 70 Pro": "http://shouji.tenaa.com.cn/Mobile/MobileDetail.aspx?code=H45U39iSCu9D%2fEnTDb9YaEMIdVoPFbGp",
    "X70 Pro Plus": "http://shouji.tenaa.com.cn/Mobile/MobileDetail.aspx?code=H45U39iSCu%2f24pi6iytsgsG3uIsMObRA",
    "giant Vivo X70 leak": "https://weibo.com/6048569942/KwrtzmoIA?type=comment#_rnd1630760787252",
    "leaker": "https://weibo.com/3213165941/KvXGImvaB",
    "Vivo X70 Pro photo": "https://www.gsmarena.com/vivo_x70_pro_photographed_in_the_wild_it_features_a_5x_periscope_and_zeiss_t_lenses-news-50725.php"
  }
}