{
  "source": "https://www.techradar.com/news/leaked-nvidia-rtx-3060-prices-are-good-news-and-bad-for-people-looking-for-a-deal",
  "title": "Leaked Nvidia RTX 3060 prices are good news – and bad – for people looking for a deal",
  "category": "computing",
  "updated": "2021-02-25T12:14:03Z",
  "author": "darren-allan",
  "summary": "Pricing variation could be considerable looking at these leaked price tags",
  "article": [
    "Nvidia’s GeForce RTX 3060 graphics card is unleashed later today, and we’ve just witnessed a fresh bunch of leaked prices (following similar leakage earlier this week, and indeed previous to that).",
    "As highlighted by Tom’s Hardware, the pricing comes from Best Buy and Newegg, although the latter has since taken down the listings and prices (not before Twitter-based hardware leaker @momomo_us grabbed some screenshots of them, though).",
    "The prices are truly exorbitant at the top of the scale, with PNY’s RTX 3060 XLR8 Gaming Revel Epic-X models commanding $630 and $625 from your wallet. This seems pretty odd, though, and so out of line with the rest of the pricing that it may be a mistake. Mind you, as this is leaked pre-release pricing, all of this info should be taken with a good handful of salt…",
    "At any rate, MSI’s GeForce RTX 3060 Gaming X is the next card down in the list of spilled prices, pitched at $540, with other models from MSI, Asus, and Gigabyte pegged around the $500 to $520 mark.",
    "At the (relatively) more affordable end of the spectrum, there are graphics cards from Zotac and EVGA at about the $400 mark, and then – shock horror – at the foot of the RTX 3060 pricing league, we have a pair of cards which are actually pitched at Nvidia’s recommended price. That’s $330, and the video cards in question are the Gigabyte RTX 3060 Eagle and EVGA RTX 3060 XC Black Gaming.",
    "So there’s apparently some hope yet for more wallet-friendly RTX 3060 products, but as we’ve already mentioned, we need to be cautious around any leak – whether we’re being despondent or hopeful.",
    "What is telling here is that the RTX 3060 leak from Coreteks that popped up earlier this week pretty much matches the prices given here, albeit with slight variations of $10 to $20 or so (which is to be expected with prices from different retailers anyway). This does suggest that much of the pricing mentioned here may be on, or at least close, to the mark.",
    "The overall picture still looks like something of a ridiculous one, whereby some RTX 3060 Ti models will be cheaper than RTX 3060 cards. For example, Gigabyte has a 3060 Ti Eagle selling for $480 at Best Buy – and that’s cheaper than most of the RTX 3060 prices we’ve just been through.",
    "Of course, the problem is none of those RTX 3060 Ti models are in stock, so you can’t buy them – and you’ll (theoretically) be able to purchase an RTX 3060 later today (the telling difference). Or at least you will be able to briefly – exactly how quickly available RTX 3060 inventory will sell out isn’t yet known, but the word ‘flash’ springs to mind.",
    "If you’re going to be on the hunt for stock later on, then you’ll likely need all the help you can get – so head on over to our where to buy the Nvidia RTX 3060 article, which does all the hard work for you in terms of keeping an eye on inventory levels at different retailers. And for those who don’t get lucky, it’s a great resource to bookmark and keep an eye on going forward."
  ],
  "headers": {
    "6": "Price match"
  },
  "links": {
    "Nvidia’s GeForce RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "similar leakage earlier this week": "https://www.techradar.com/news/nvidia-rtx-3060-gpu-could-somehow-end-up-pricier-than-the-rtx-3060-ti",
    "previous to that": "https://www.techradar.com/news/nvidia-rtx-3060-prices-are-spiralling-upwards-and-the-gpu-isnt-even-out-yet",
    "Tom’s Hardware": "https://www.tomshardware.com/news/nvidia-geforce-rtx-3060-floods-us-retailers-starting-from-329-to-629",
    "screenshots": "https://twitter.com/momomo_us/status/1364728859208282114",
    "RTX 3060": "https://www.techradar.com/news/nvidia-rtx-3060-full-specs-confirmed-ahead-of-the-gpus-imminent-launch",
    "RTX 3060 leak from Coreteks": "https://www.techradar.com/news/nvidia-rtx-3060-gpu-could-somehow-end-up-pricier-than-the-rtx-3060-ti",
    "where to buy the Nvidia RTX 3060": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-find-stock-here"
  }
}