{
  "source": "https://www.techradar.com/news/samsung-s21-ultra-vs-iphone-12-pro-max",
  "title": "Samsung Galaxy S21 Ultra vs iPhone 12 Pro Max: which top-end phone is for you?",
  "category": "phones",
  "updated": "2021-12-05T14:02:58Z",
  "author": "james-rogerson",
  "summary": "Two ultra-premium handsets, but which is right for you?",
  "article": [
    "The Samsung Galaxy S21 Ultra is the biggest, most expensive entry in the Samsung Galaxy S21 range, so of course it’s directly competing with the iPhone 12 Pro Max – Apple’s biggest and most expensive phone.",
    "These are both big, ultra-high-end handsets, and both come with much of what you’d expect, including top-tier power and near endless features. But while they have a lot in common, the specifics of what they offer also vary in numerous ways.",
    "So if you’re trying to decide between the Samsung Galaxy S21 Ultra and the iPhone 12 Pro Max, this article should help, as it compares the two phones in full.",
    "The Samsung Galaxy S21 Ultra has a slightly curved glass back with a very large camera block in the top left corner. From the front, there’s an all-screen design, with curved edges and a single-lens punch-hole camera in the top center.",
    "The iPhone 12 Pro Max on the other hand is a lot flatter – both on the front and back, but it too has a glass back and is light on bezel, though rather than a cut-out in the screen for the selfie camera, it has a sizeable notch at the top. Its rear camera block is smaller than the Galaxy S21 Ultra’s though, and it’s square, where Samsung’s is more rectangular.",
    "But the iPhone 12 Pro Max itself is a similar size to the S21 Ultra, coming in at 160.8 x 78.1 x 7.4mm, while the Samsung Galaxy S21 Ultra is 165.1 x 75.6 x 8.9mm. So Samsung’s phone is a bit taller and thicker, but slightly narrower. The two phones weigh exactly the same amount though, at 228g each.",
    "Both handsets also have IP68 certification, meaning they’re dust and water resistant. In the case of the iPhone 12 Pro Max, that water resistance extends to depths of 6 meters for 30 minutes though, while the Samsung Galaxy S21 Ultra is only tested to depths of 1.5 meters for 30 minutes.",
    "As for colors, you can get the Samsung Galaxy S21 Ultra in Phantom Black and Phantom Silver (or if buying direct from Samsung there are also Phantom Titanium, Phantom Navy and Phantom Brown shades), while the iPhone 12 Pro Max is available in Graphite, Silver, Gold, and Pacific Blue shades.",
    "The Samsung Galaxy S21 Ultra’s screen is enormous at 6.8 inches. It’s a curved OLED screen with a 1440 x 3200 resolution and a 120Hz refresh rate. Unlike previous Samsung flagships you can also run it at both full resolution and the highest refresh rate simultaneously.",
    "The iPhone 12 Pro Max also has a big screen, in fact it’s the biggest Apple has ever put on a phone, but it’s slightly smaller at 6.7 inches.",
    "This also uses OLED, but it’s a flat display, and it comes in at 1284 x 2778. In terms of pixel density, you’re looking at 515 pixels per inch on the Galaxy S21 Ultra, and 458 on the iPhone 12 Pro Max.",
    "The iPhone 12 Pro Max only has a 60Hz refresh rate, but we were still very impressed with it, finding in our review that it had a great, bright screen with excellent color reproduction.",
    "The Samsung Galaxy S21 Ultra meanwhile has what we described as \"Samsung's best screen\", so it too impressed a lot. Despite its slightly larger size, we also noted in our review that it was easier to hold than the iPhone 12 Pro Max, thanks to its curved edges and the slightly narrower design.",
    "There’s a quad-lens camera on the Samsung Galaxy S21 Ultra, with a 108MP f/1.8 main sensor, a 12MP f/2.2 ultra-wide one, a 10MP f/2.4 telephoto one (capable of 3x optical zoom), and a second 10MP telephoto one, this time with an f/4.9 aperture and support for 10x optical zoom.",
    "The iPhone 12 Pro Max also has a quad-lens camera, but the specs are quite different. There’s a 12MP f/1.6 main snapper, a 12MP f/2.4 ultra-wide one, a 12MP f/2.2 telephoto one (with 2.5x optical zoom) and a LiDAR scanner, for judging depth and distances – which is particularly useful for augmented reality.",
    "On the front meanwhile, the Samsung Galaxy S21 Ultra has a 40MP f/2.2 camera, while the iPhone 12 Pro Max has a 12MP f/2.2 one.",
    "While the numbers might look less impressive on Apple’s camera, we were certainly impressed in our review, noting that the camera is “powerful” and performs well even at night.",
    "That said, we went so far as to call the Galaxy S21 Ultra's camera \"phenomenally powerful\" and described its zoom as the best on a smartphone. Overall though, we found that the iPhone 12 Pro Max is still often slightly better for non-zoomed photos, particularly when indoors or at night - but only slightly.",
    "There’s a huge 5,000mAh battery in the Samsung Galaxy S21 Ultra, which dwarfs the 3,687mAh one in the iPhone 12 Pro Max.",
    "That said, we found that while you'd get over a day of life from Samsung's phone with default settings, if you max out the resolution and make heavy use of the 120Hz refresh rate it drains faster.",
    "Meanwhile, we found in our tests that the iPhone 12 Pro Max lasted over a day comfortably, but was unlikely to stretch to two. So the two phones are likely to be broadly similar on this front, but if you want to use all the Galaxy S21 Ultra's bells and whistles, you might need to reach for a charger faster than you would with the iPhone 12 Pro Max.",
    "Both phones support fast charging and wireless charging, and the Galaxy S21 Ultra additionally supports Wireless PowerShare – which lets you use it to wirelessly charge other gadgets. However, neither phone actually comes with a charger in the box.",
    "Both of these phones are very powerful, as you’d expect, though the exact specs differ. The Samsung Galaxy S21 Ultra has either a Snapdragon 888 chipset (if you’re in the US) or an Exynos 2100 (in most other regions), while the iPhone 12 Pro Max has an A14 Bionic. All three of these though are the top of their ranges.",
    "One thing that the Galaxy S21 Ultra has a lot more of though is RAM, with 12GB included in the 128GB and 256GB models, while the 512GB model has 16GB of RAM. The iPhone 12 Pro Max on the other hand only has 6GB of RAM, whichever model you buy (128GB, 256GB, or 512GB). That said, the iPhone 12 Pro Max is a very fast phone, so we wouldn’t read too much into that.",
    "At this end of the market it's hard to even talk about performance beyond saying that both phones (and both chipset versions of the Galaxy S21 Ultra) feel very snappy. There's not much on mobile that should really tax them.",
    "One feature that both of these phones have is 5G, so you’ll be ready to take advantage of the new generation of mobile connectivity, but a lot of their other features differ.",
    "For one thing, while the Samsung Galaxy S21 Ultra has an in-screen fingerprint scanner, the iPhone 12 Pro Max instead goes all in on Face ID.",
    "The Samsung Galaxy S21 Ultra also supports Samsung’s S Pen stylus (though this is sold separately), while the iPhone 12 Pro Max supports MagSafe accessories, which you can magnetically attach to the back of the phone.",
    "Of course, they also have very different operating systems, with the Samsung Galaxy S21 Ultra running Android 11, while the iPhone 12 Pro Max runs iOS 14.",
    "The Samsung Galaxy S21 Ultra starts at $1,199 / £1,149 / AU$1,849, for which you’ll get a 128GB model. It’s easy to do a direct comparison with the iPhone 12 Pro Max, as that also starts with 128GB of storage, for which you’ll pay $1,099 / £1,099 / AU$1,849.",
    "So the two phones cost the same amount in Australia, but in the US and the UK the iPhone 12 Pro Max is actually slightly cheaper, which isn’t a sentence you’ll hear very often. There’s not much in it though.",
    "As for availability, the iPhone 12 Pro Max is of course available now, while at the time of writing you can pre-order the Samsung Galaxy S21 Ultra, with it going on sale on January 29.",
    "The iPhone 12 Pro Max and Samsung Galaxy S21 Ultra really stand up well to each other on paper. Both have premium builds, top-end power, 5G, quad-lens cameras, up to 512GB of storage, and similarly large screens.",
    "The Samsung Galaxy S21 Ultra’s display is marginally larger and higher resolution, it has longer range optical zoom, a bigger battery, and more RAM, plus support for the S Pen stylus. But with the iPhone 12 Pro Max you get MagSafe support, better water resistance, and a LiDAR scanner, plus in most places the iPhone 12 Pro Max has a slightly lower starting price.",
    "If any of those factors are a big deal for you, that should help in making a purchase decision, but if you just want to know which is best, well, it's very close, as we gave both of these phones 4.5 stars, but the Samsung Galaxy S21 Ultra tops our list of the best smartphones."
  ],
  "headers": {
    "3": "Design",
    "8": "Screen",
    "13": "Camera",
    "18": "Battery life",
    "22": "Specs and features",
    "29": "Price and availability",
    "32": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Android 11": "https://www.techradar.com/news/android-11",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "best smartphones": "https://www.techradar.com/news/best-phone"
  }
}