{
  "source": "https://www.techradar.com/news/moto-tab-g20",
  "title": "Moto Tab G20 release date, price, features, specs and news",
  "category": "tablets",
  "updated": "2021-10-02T10:00:49Z",
  "author": "james-rogerson",
  "summary": "Motorola's latest cheap tablet has landed",
  "article": [
    "If you’re in the market for a cheap Android tablet then Motorola has a new option you might want to consider, dubbed the Moto Tab G20.",
    "This slate has so far only been launched in India, but a wider rollout is certainly possible, so don’t be surprised if it comes to the US, UK or elsewhere soon.",
    "While the specs don’t excite, it looks to have the basics covered, being essentially a slightly modified version of the Lenovo Tab M8, and thanks to its 8-inch screen it could also be a strong option for anyone after a relatively compact, portable slate.",
    "Below, you’ll find all the specs of the Moto Tab G20, along with what we know so far about the release date and price.",
    "The Moto Tab G20 was announced on September 30, 2021, and it will be sold in India from October 2. At the time of writing there’s no word on if or when it will arrive in other regions, but we wouldn’t count it out.",
    "It costs just 10,999 Indian rupees (around $150 / £110 / AU$205), though we wouldn’t expect an exact price conversion if it launches in other regions.",
    "The Moto Tab G20 has an 8-inch 1280 x 800 IPS LCD screen with a 16:10 aspect ratio and an 85% screen-to-body ratio. So its screen is small and not particularly high resolution, but that’s in line with the price.",
    "As for the design, it comes in at 199.1 × 121.8 × 8.15mm and 305g, making it marginally heavier than the iPad mini (2021). The bezels are sizeable, but where it comes out looking surprisingly premium is the back, which is made from metal. However, it’s only available in a single color – platinum grey.",
    "It’s also worth noting that the Moto Tab G20 has a 3.5mm headphone port, so fans of wired audio are in luck here.",
    "Tablets rarely include great cameras, especially at the lower end of the market, so we wouldn’t expect much from the cameras here, but you get a 5MP main one and a 2MP front-facing one.",
    "The battery meanwhile is fairly small at 5,100mAh, though Motorola claims it can last through up to 15 hours of video viewing, and its charging speeds top out at 10W (via USB-C), so this won’t juice up particularly fast. There's also no wireless charging, but we wouldn't expect that at this price.",
    "The Moto Tab G20 is powered by a MediaTek Helio P22T chipset, which is a low-end one. It also has 3GB of RAM, 32GB of storage, and a microSD card slot so you can add more.",
    "It runs a near-stock version of Android 11, so there should be minimal bloat or manufacturer customizations – this is Android more or less as Google intended it.",
    "Others features include face unlock, and a single bottom-firing speaker, capable of Dolby Atmos audio."
  ],
  "headers": {
    "4": "Moto Tab G20 release date and price",
    "6": "Design and display",
    "9": "Camera and battery",
    "11": "Specs and features"
  },
  "links": {
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "iPad mini (2021)": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}