{
  "source": "https://www.techradar.com/news/this-simple-gmail-tweak-will-means-youll-never-miss-a-chat-message-again",
  "title": "This simple Gmail tweak will mean you'll never miss a Google Chat message again",
  "category": "computing",
  "updated": "2021-01-20T14:01:50Z",
  "author": "barclay-ballard",
  "summary": "You will now be able to resize the Chat section in Gmail",
  "article": [
    "Google has made a small but important change to Gmail, which should make it easier than ever for individuals to manage their chat messages. The technology giant will now allow users of the Gmail web client to resize the Google Chat and Rooms side widgets.",
    "“You can now resize the Chat and Rooms sections in the left-side navigation of Gmail on the web,” a Google Workspace Update explained. “This makes it easier to stay on top of your most important conversations and navigate to relevant chats faster.”",
    "The feature will be rolled out over the next few days to users of the following Google packages: Google Workspace Essentials, Business Starter, Business Standard, Business Plus, Enterprise Essentials, Enterprise Standard, and Enterprise Plus, as well as G Suite Basic, Business, Education, Enterprise for Education, and Nonprofits.",
    "The new resize functionality can be found when the Gmail navigation drawer is expanded. In order to resize Chat, Rooms, or Meet, users simply click the top of the relevant section and drag until they've expanded it to their liking.",
    "The new feature will provide Gmail users with enhanced customization, which will be particularly welcomed by individuals that may be finding that the current Gmail interface is getting a little crowded. When combined with the existing ability to pin important conversations, it should mean that users never inadvertently miss a Google Chat message again.",
    "With more workplace conversations relying on digital tools as a result of the coronavirus pandemic, the ability to manage messages more flexibly is certain to come in handy. The Gmail update comes a few months after Google also launched a new “away” status for individuals that want to avoid their colleagues for a little while."
  ],
  "headers": {
    "3": "Remote chats"
  },
  "links": {
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "explained": "https://workspaceupdates.googleblog.com/2021/01/resize-chat-rooms-sections-gmail-side-panel.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+GoogleAppsUpdates+%28Google+Workspace+Updates+Blog%29",
    "“away” status": "https://www.techradar.com/news/google-chat-will-now-let-you-hide-from-your-needy-boss"
  }
}