{
  "source": "https://www.techradar.com/news/nearly-1-in-4-companies-have-fired-someone-for-zoom-incidents",
  "title": "A shocking number of companies have fired workers for Zoom \"incidents\"",
  "category": "computing",
  "updated": "2021-09-01T16:43:50Z",
  "author": "mike-moore",
  "summary": "Mind how you appear on Zoom",
  "article": [
    "Workers who use video conferencing services to communicate with colleagues across the globe will need to make sure they are behaving, after a new survey found many managers still don't trust their employees with the technology.",
    "The report from Vyopta found that only around two-thirds of bosses trusted workers to be able to correctly navigate the remote technology needed to make remote work successful, meaning a sizable amount still don't believe in their workforce's technical skills.",
    "This lack of belief has had some serious knock-on effects, with nearly a quarter (24%) of those surveyed for the report claiming they've seen an employee fired because of mistakes made on video or audio calls on services such as Zoom.",
    "The survey of 200 executives at US-based companies of 500 or more employees also revealed that 83% have seen an employee receive some disciplinary action following an incident on a virtual call.",
    "Elsewhere, 38% said they'd seen an employee given a formal reprimand following an error on a video call, with 40% seeing an informal warning. A third (33%) said they'd seen a staff member removed from a project, and just over half (53%) had seen someone removed from the responsibility of managing or organising calls.",
    "The executives interviewed for the report were split on their beliefs over who was responsible for keeping remote work and collaboration technology running smoothly, with 58% saying it was down to the business, and 42% saying it was for the employees.",
    "The risks of making a mistake do seem to be serious for many businesses, however, as nearly a third (32%) say they have lost a client or business opportunity because of technology or connection issues, with 41% saying it has meant they missed a project deadline.",
    "“The data clearly shows that there is a misalignment in expectations regarding remote and hybrid work between management and employees and a lack of training on how to manage and perform in this new way of working,” said Alfredo Ramirez, CEO of Vyopta."
  ],
  "headers": {
    "3": "Zoom fails"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "remote work": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Zoom": "https://www.techradar.com/news/microsoft-teams-vs-zoom-which-video-conferencing-and-collaboration-service-is-best"
  }
}