{
  "source": "https://www.techradar.com/news/xiaomi-redmi-note-11-series-may-have-just-leaked-in-full-for-the-first-time",
  "title": "Xiaomi Redmi Note 11 series may have just leaked in full for the first time",
  "category": "phones",
  "updated": "2021-06-24T14:21:13Z",
  "author": "tom-bedford",
  "summary": "Details of loads of Xiaomi phones",
  "article": [
    "It's been a quiet few months for Xiaomi, as the company is seemingly sitting on its haunches and biding its time until the next launch (maybe the Xiaomi Mi 11T series). However we've just heard about a batch of new Xiaomi phones that could be coming soon.",
    "As reported by Gizchina, Xiaomi phone owners have been digging around in the code for MIUI (the software the devices use), and have found references to a grand total of 13 new phones from the company.",
    "The actual names of these phones haven't been discovered - we're left with codenames for now - but for six of the devices, a few specs have been discovered for each.",
    "There's no way of knowing which phones are detailed here and since Xiaomi puts out Mi, Redmi and Poco devices, it's no easy task guessing what we're looking at. But judging by the specs, we'd say it's very likely some of these phones are the Redmi Note 11 series, which is expected to launch later in the year.",
    "We say that because the specs aren't top-end enough for the Mi line, but include better cameras than we'd expect to see from a Poco device - thus, the next generation of budget and mid-range Redmi phones seems most likely.",
    "Of the six phones detailed in the leaks, the top-end one seems to be the one codenamed 'hyacinth', which has a 108MP main camera, two other cameras, and a 120Hz display. That sounds pretty similar to 'cygnus', which has the same main camera joined by an ultra-wide and telephoto (for 5x optical zoom) snapper, and a 90Hz display.",
    "Both 'bestla' and 'divine' have 64MP main cameras, and the latter also has an ultra-wide, a 5x zoom telephoto camera, and a 90Hz display. The fifth phone is 'lepus' with a 50MP camera (that we also saw in the Mi 11 Ultra) joined by an ultra-wide and 5x telephoto lens, and a 90Hz display.",
    "Finally there's 'mercury' with a 12MP main camera joined by the ultra-wide and 5x telephoto snappers we've already heard of. Plus, this apparently has a 120Hz display.",
    "An extra mystery is that 'cygnus', 'divine' and 'lepus' all apparently may have an in-screen front-facing camera, though this sounds vague.",
    "So that's a real smattering of specs, with most listed devices combining top-end camera performance with mid-range displays - that's represented most clearly regarding the telephoto cameras, as 5x optical zoom is a surprisingly high-end feature for a device with a 90Hz display.",
    "Generally, Xiaomi's budget phones could perhaps be categorized as emphasizing one feature above all others - Poco devices, for example, are very powerful but with weak cameras, while older Redmi devices have good-looking displays. If there's something these codenamed phones have in common, its that the cameras seem very powerful compared to the displays.",
    "If we had to guess, we'd say these listings refer to the Redmi Note 11 series, which could feature a closer focus on photography. The GN3 sensor 'lepus' is said to use is particularly powerful, and four phones having 5x optical zoom is a surprise given most budget devices omit zoom lenses in favor of macro.",
    "The fact that lots of the listed phones all have these surprise specs in common suggests they're all part of one family, which is why we think Note 11, as we could see five or six phones in total under this banner.",
    "However, Xiaomi often shares specs and features between its phone series, so our guess is a very rough one at this point in time. Perhaps Mi or Poco handsets will launch with these specs to prove us completely wrong.",
    "One thing is very likely though: Xiaomi tends to stagger phone releases, even ones in the same family, so we probably won't see all thirteen of the listed phones, or even a large fraction of them, launch all at once."
  ],
  "headers": {
    "5": "What specs are we talking about?",
    "9": "So what are the phones?"
  },
  "links": {
    "Xiaomi Mi 11T": "https://www.techradar.com/reviews/xiaomi-11t-pro",
    "Xiaomi phones": "https://www.techradar.com/news/best-xiaomi-phones",
    "Gizchina": "https://www.gizchina.com/2021/06/24/details-of-13-new-xiaomi-devices-have-been-spotted-in-miui-firmware-code/",
    "Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review"
  }
}