{
  "source": "https://www.techradar.com/news/oneplus-9-vs-samsung-galaxy-s21-vs-iphone-12",
  "title": "OnePlus 9 vs Samsung Galaxy S21 vs iPhone 12: comparing the flagship phones",
  "category": "phones",
  "updated": "2021-03-24T11:22:32Z",
  "author": "james-rogerson",
  "summary": "The phones of the moment",
  "article": [
    "The OnePlus 9 is one of the most high-profile handsets around. Not quite a match on that front for the Samsung Galaxy S21 or the iPhone 12, but close, and as such those two phones are likely to be its biggest rivals.",
    "These three handsets are all flagships, and they’re all the standard model in their ranges – so not the top one, but the one that might well have the most mass appeal.",
    "They all pair high-end specs with high-end prices, but there are plenty of differences between them too, and some areas in which one of these handsets does significantly better or worse than the others.",
    "With all that in mind, we’ve compared the OnePlus 9 to the Samsung Galaxy S21 and iPhone 12, so you can see which of these three flagships is right for you.",
    "The OnePlus 9 has a curved Gorilla Glass back, a ‘fiberglass-reinforced polymer frame’, and a flat screen with minimal bezels and a punch-hole camera in the top left corner. There’s a large camera block in the top left corner of the rear, and the phone comes in Winter Mist, Arctic Sky and Astral Black shades. Its dimensions come in at 160 x 74.2 x 8.7mm, and it weighs 192g.",
    "The Samsung Galaxy S21 meanwhile has a plastic back, so it’s slightly less premium in that sense. It has a metal frame, a flat screen with small bezels, a punch-hole camera in the top center, and a camera block in the top left corner of the rear.",
    "The Galaxy S21 comes in Phantom Gray, Phantom White, Phantom Violet, and Phantom Pink shades, and it’s 151.7 x 71.2 x 7.9mm and 171g. It’s also IP68 certified, allowing it to be submerged up to 1.5 meters deep in water for up to 30 minutes.",
    "Finally, we have the iPhone 12, which has a Gorilla Glass back, a metal frame, and a flat screen with generally small bezels, though rather than a punch-hole camera this has a large notch. Its camera block is also in the top left corner of the rear, but it’s square where the other two phones have a rectangular housing.",
    "The iPhone 12 comes in Black, White, Red, Green, and Blue shades, and it’s 146.7 x 71.5 x 7.4mm and 164g. It’s also IP68 certified like the Galaxy S21, but it’s actually even more water resistant, able to survive submersion to depths of 6 meters for up to 30 minutes.",
    "So, the OnePlus 9 is the biggest and heaviest of these phones, while the iPhone 12 is the smallest and lightest.",
    "The iPhone 12 also stands out – for better or worse – as the only one with a notch, but it’s the most water-resistant, while the OnePlus 9 is the least. The Samsung Galaxy S21 meanwhile has the least premium build, thanks to its plastic back, while the OnePlus 9 comes in the fewest different colors.",
    "The OnePlus 9 has the biggest screen of these three phones at 6.55 inches. It’s a 1080 x 2400 AMOLED display with 402 pixels per inch, a 120Hz refresh rate, and a 20:9 aspect ratio. It also has HDR10+ certification, and a maximum brightness of 1,100 nits.",
    "As for the Samsung Galaxy S21, that has a 6.2-inch 1080 x 2400 AMOLED screen with 421 pixels per inch, a 120Hz refresh rate, a 20:9 aspect ratio, HDR10+, and a maximum brightness of 1,300 nits.",
    "Then there’s the iPhone 12, which has a 6.1-inch 1170 x 2532 OLED screen with 460 pixels per inch, a 60Hz refresh rate, a 19.5:9 aspect ratio, HDR10, and a maximum brightness of 1,200 nits.",
    "So the key differences include the size – with the OnePlus 9 being the biggest while the iPhone 12 is the smallest, and the refresh rate, which the iPhone 12 loses out on as it’s half what you get on the other two.",
    "Otherwise these screens are quite similar, with comparable resolutions, aspect ratios, and levels of brightness. There are some differences as you can see in our comparison, but they’re minor.",
    "In practice you can expect a good visual experience from all three phones, but none of them have a QHD+ resolution like some top handsets, such as the Samsung Galaxy S21 Ultra.",
    "There are a lot of differences between the cameras on these three phones, but let’s once again start with the OnePlus 9. This has a triple-lens camera on the back, with a 48MP f/1.8 main camera, a 50MP f/2.2 ultra-wide one, and a 2MP monochrome one, which works with the main camera for more detailed black and white shots.",
    "This camera setup has been developed in collaboration with Hasselblad, and OnePlus claims it delivers some of the most natural colors in photos taken by any mobile device. The ultra-wide camera also uses a freeform lens, designed to minimize distortion at the edge of photos, and it also works as a macro camera.",
    "The OnePlus 9 is packed full of shooting modes too, which along with the typical ones include a tilt-shift mode, which can make scenes appear as if in miniature. Video meanwhile can be shot at up to 8K at 30fps, and there’s a 16MP f/2.4 camera on the front.",
    "The Samsung Galaxy S21 also has a triple-lens camera on the back, but this one consists of a 12MP f/1.8 main snapper, a 64MP f/2.0 telephoto one (capable of 3x hybrid optical zoom), and a 12MP f/2.2 ultra-wide one.",
    "While Samsung’s phone lacks any fancy camera-brand collaborations, we suspect a lot of people would take the telephoto snapper here over the monochrome one that takes its place on the OnePlus 9.",
    "Samsung’s phone also has a wealth of shooting modes, including Single Take, which takes a variety of photos and videos using all these cameras with a single button press. Speaking of video, the Samsung Galaxy S21 can record that in up to 8K quality at 24fps. There's also a 10MP f/2.2 camera on the front.",
    "Finally, the iPhone 12 has just a dual-lens rear camera, with a 12MP f/1.6 main snapper and a 12MP f/2.4 ultra-wide one. On paper it’s the least impressive setup, but Apple’s flagship phones reliably take excellent quality photos, and the iPhone 12 even holds up well at night.",
    "Indeed, in terms of shooting modes, its Night Mode is definitely a highlight, but there are lots of other things to play with here too. Video tops out at 4K quality, but with Dolby Vision support, which lets you shoot HDR videos, and there’s a 12MP f/2.2 camera on the front.",
    "All of these phones have impressive camera offerings in their own way, it just depends on what you want from them. OnePlus for its part though has worked hard to close the camera gap, as that used to be a weak point on its handsets.",
    "The OnePlus 9 has the biggest battery of these three phones, at 4,500mAh. It supports 65W charging and can get the phone from zero to 100% battery in just 29 minutes. The OnePlus 9 also supports 15W wireless charging.",
    "With the Samsung Galaxy S21 you get a 4,000mAh battery with 25W wired charging and 15W wireless charging. This phone additionally supports reverse wireless charging at 4.5W, so you can use it to slowly charge up other devices wirelessly.",
    "Finally, the iPhone 12 has just a 2,815mAh battery, with 20W wired charging and 15W wireless charging.",
    "Of course, while the OnePlus 9 has the biggest battery of the three it also has the biggest screen to light up, and while the iPhone 12’s battery is by far the smallest, in our review we found that its life was similar to the Galaxy S21’s and the OnePlus 9's, with all three phones tending to last a day but not reliably going much further than that.",
    "The similar performance can probably in part be explained by the iPhone 12’s lower 60Hz screen refresh rate. Still, while battery size doesn’t tell the whole story, the OnePlus 9 undeniably has the edge over these rivals when it comes to charging speed.",
    "All three of these phones are packed full of power, and in the case of the OnePlus 9 and the Samsung Galaxy S21 they also have quite similar specs.",
    "The OnePlus 9 has a top-end Snapdragon 888 chipset and either 8GB or 12GB of RAM, while the Samsung Galaxy S21 has the same chipset in the US, with most other regions getting the similarly high-end Exynos 2100. In either case that’s paired with 8GB of RAM. So the OnePlus 9 has the potential for more RAM, giving it a slight edge on paper.",
    "The iPhone 12 meanwhile has a top-end A14 Bionic chipset and 4GB of RAM – but Apple’s phones never compete with Android ones on the RAM front, and this never holds them back.",
    "For storage, there’s a choice of 128GB or 256GB in both the OnePlus 9 and the Samsung Galaxy S21, while the iPhone 12 comes with 64GB, 128GB or 256GB, and none of these phones have microSD card slots.",
    "All three support 5G, and in the case of the OnePlus 9 and Samsung Galaxy S21 they run Android 11 (albeit with some individual tweaks), while the iPhone 12 runs iOS 14. The operating system is one of the biggest differences between the iPhone 12 and the other two phones, but it’s totally subjective as to which is better.",
    "In terms of features, it’s worth noting that both the OnePlus 9 and the Samsung Galaxy S21 have an in-screen fingerprint scanner, while the iPhone 12 relies on Face ID.",
    "The OnePlus 9 costs $729 / £629 (roughly AU$950) for 8GB of RAM and 128GB of storage, or $829 / £729 (around AU$1,080) for 12GB of RAM and 256GB of storage. It's hitting stores on April 2, and you’ll be able to buy it in the US and the UK, but not Australia.",
    "The Samsung Galaxy S21 has a starting price of $799 / £769 / AU$1,249 for 8GB of RAM and 128GB of storage, rising to $849 / £819 / AU$1,349 for 8GB of RAM and 256GB of storage. As you can guess from the included prices, this is available in the US, UK and Australia, among other places.",
    "The iPhone 12 is also available in the US, UK and Australia, and it starts at $799 / £799 / AU$1,349. For that you’ll get 64GB of storage, while 128GB will cost you $849 / £849 / AU$1,429, and 256GB is $949 / £949 /AU$1,599 – in all cases that’s with 4GB of RAM.",
    "So they’re similarly priced, but the OnePlus 9 marginally undercuts its rivals. It’s worth highlighting too that the base iPhone 12 model comes with half the storage of the other two phones, so for a comparable iPhone 12 model you’re paying quite a lot more.",
    "As you can see, there are just as many differences between these phones as there are similarities. The OnePlus 9 has the biggest screen, though it’s also the biggest and heaviest overall.",
    "It also has the biggest battery, the fastest charging, the most optional RAM, and it’s the only one with a dedicated monochrome lens. All that and it’s the cheapest of the three too. But it doesn’t have a water resistance rating, which the other two do.",
    "The Samsung Galaxy S21 meanwhile is the only one with a telephoto lens or reverse wireless charging, though its plastic back makes it feel slightly less premium.",
    "And the iPhone 12 isn’t much of a match on paper, with fewer cameras than its rivals, a smaller screen, a lower refresh rate, and the smallest battery.",
    "But it has the most water resistance, and performs a lot better than those on-paper specs might suggest. It’s also the only one to run iOS, which will be a big point in its favor for Apple fans. Plus, some people will prefer its more compact screen – though they’re unlikely to like its higher price.",
    "These are all top phones then – if not quite the top of their ranges – but they’ll all appeal to different people. And if you want the best of the best, then consider the OnePlus 9 Pro, the Samsung Galaxy S21 Ultra, or the iPhone 12 Pro Max – just be prepared to pay a lot for any of them."
  ],
  "headers": {
    "4": "Design",
    "11": "Display",
    "17": "Camera",
    "26": "Battery life",
    "31": "Specs and features",
    "37": "Price and availability",
    "41": "Takeaway"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Android 11": "https://www.techradar.com/news/android-11",
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review"
  }
}