{
  "source": "https://www.techradar.com/news/nvidia-dlss-22-has-already-been-silently-released-in-rainbow-six-siege",
  "title": "Nvidia DLSS 2.2 has already been silently released in Rainbow Six Siege",
  "category": "computing",
  "updated": "2021-06-17T11:11:49Z",
  "author": "jess-weatherbed",
  "summary": "The first DLSS 2.2 supported game is here",
  "article": [
    "Nvidia made a few announcements during E3 2021 regarding beloved features such as ray tracing, Nividia Reflex and DLSS support for the popular first-person shooter Rainbow Six Siege. As it turns out, that patch might have been a slighter bigger deal than we previously thought, with several eagle-eyed Reddit users noticing the game is using DLSS 2.2, a version of Nvidia's 'deep learning super sampling' technology that has yet to be officially announced.",
    "The DLL library (nvngx_dlss.dll) that was added to the latest patch of the game states that the product version of DLSS being used is 2.2.6.0, which if correct would mean that Rainbow Six Siege is the first game to use the updated tech.",
    "While it's unlikely this will see a huge improvement from DLSS version 2.1, players of the Vulkan version of Rainbow Six Siege can allegedly boost 4K performance by up to 50%.",
    "Nvidia provided its own benchmarking during its E3 keynote, displaying that at 4K resolution and DLSS running in performance mode, the GeForce RTX 3070 graphics card can achieve up to 211 frames-per-second if paired with a powerful Intel Core i9-10900K CPU. For context, you can expect to get around 145 fps on the same setup without any help from DLSS.",
    "If you want to enable DLSS in Rainbow Six Siege and give it a try yourself then you'll need to ensure you have an Nvidia GeForce RTX graphics card with the latest Game Ready Driver installed. Follow the below instructions to get yourself game ready if you fit the hardware requirements.",
    "DLSS has come a long way since version 1.0 was released, with many people finding it didn't quite match what Nvidia was promising. That all changed with DLSS 2.0, with game performance seeing massive improvements thanks to artificial intelligence, scaling up lower resolutions without putting additional strain on your GPU. AMD is currently working on its own version of this framerate-boosting tech, dubbed FidelityFX, in order to compete with Team Green. DLSS is a huge selling point for many Nvidia GPUs over AMD offerings such as the Radeon RX 6700 XT, so it's really hard to understate just how much this feature has revolutionized the playability of demanding games. It's likely that DLSS 3.0 won't be with us anytime soon, but any developments and updates made to the current version are a welcome sight.",
    "Via VideoCardz"
  ],
  "headers": {
    "4": "Don't take our word for it, give it a whirl"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Nividia Reflex": "https://www.techradar.com/news/nvidia-reflex-now-gives-you-sharper-reactions-in-rainbow-six-siege",
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in",
    "Rainbow Six Siege": "https://www.techradar.com/news/rainbow-six-siege-just-got-much-better-with-nvidia-dlss",
    "eagle-eyed Reddit users": "https://www.reddit.com/r/nvidia/comments/o0e8lk/rainbow_six_siege_dlss_22/",
    "GeForce RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Intel Core i9-10900K": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "DLSS 2.0": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "FidelityFX": "https://www.techradar.com/news/amd-finally-takes-on-dlss-with-fidelityfx-super-resolution",
    "Radeon RX 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "VideoCardz": "https://videocardz.com/newz/nvidia-enables-dlss-2-2-in-rainbow-six-siege"
  }
}