{
  "source": "https://www.techradar.com/news/us-hits-russia-with-sanctions-following-solarwinds-cyberattack",
  "title": "US hits Russia with sanctions following SolarWinds cyberattack",
  "category": "computing",
  "updated": "2021-04-15T23:21:33Z",
  "author": "anthony-spadafora",
  "summary": "Sanctions placed on tech companies that support Russian intelligence agencies",
  "article": [
    "In response to the SolarWinds hack that occurred last December, the US has announced that it will impose sanctions on Russia which it believes was behind the massive cyberattack.",
    "The US Department of the Treasury provided further details on the actions it plans to take against Russia in a press release, saying:",
    "“Today, the U.S. Department of the Treasury took multiple sanctions actions under a new Executive Order (E.O.) targeting aggressive and harmful activities by the Government of the Russian Federation. Treasury’s actions include the implementation of new prohibitions on certain dealings in Russian sovereign debt, as well as targeted sanctions on technology companies that support the Russian Intelligence Services’ efforts to carry out malicious cyber activities against the United States.”",
    "In addition to the SolarWinds hack, the US has also accused the Russian government of meddling in the 2020 election by spreading disinformation online.",
    "President Biden's Executive Order placing sanctions on Russia comes at a time when foreign relations between the two countries have grown increasingly tense. However, Biden did recently make a call to Russian President Vladimir Putin in which he vowed to defend his country's national interests “firmly”.",
    "While the US has now come out and accused Russia's foreign intelligence service, the SVR, of being responsible for the SolarWinds hack, former Secretary of State Mike Pompeo first said that he believed the country was responsible last December.",
    "The new sanctions target 32 entities and officials that have been accused of attempting to influence the 2020 election and for “other acts of disinformation”. So far, ten diplomats, some of whom are allegedly spies, are being expelled from the US and President Biden's executive order will also prevent financial institutions in the country from purchasing rouble-denominated bonds beginning in June.",
    "Russia's foreign ministry has responded to the new sanctions by calling them “hostile steps which dangerously raise the temperature of confrontation” in a statement.",
    "Kevin Mandia, CEO of the cybersecurity company FireEye commented on the news in a statement, saying:",
    "“This is a positive, welcome step towards adding more friction to Russian operations. Simply naming the SVR, as well as the corporations that support it will inform our defense. Unfortunately, we are unlikely to fully deter cyber espionage and we will have to take serious action to better defend ourselves from inevitable future intrusions.”",
    "Via BBC"
  ],
  "headers": {
    "4": "Blaming Russia"
  },
  "links": {
    "SolarWinds hack": "https://www.techradar.com/news/solarwinds-hack-may-have-been-a-global-attack",
    "Russia": "https://www.techradar.com/news/russia-is-expecting-payback-cyberattacks-following-solarwinds-hack",
    "press release": "https://home.treasury.gov/news/press-releases/jy0127",
    "2020 election": "https://www.techradar.com/news/us-election-2020-malware-scam-targets-undecided-voters",
    "disinformation": "https://www.techradar.com/news/us-department-of-justice-takes-down-rogue-domain-names",
    "Mike Pompeo": "https://www.techradar.com/news/microsoft-has-discovered-yet-more-malware-affecting-solarwinds-orion",
    "FireEye": "https://www.techradar.com/news/fireeye-systems-taken-down-in-major-cyberattack",
    "BBC": "https://www.bbc.com/news/technology-56755484"
  }
}