{
  "source": "https://www.techradar.com/news/microsoft-announces-office-2021-for-windows-and-macos",
  "title": "Microsoft announces Office 2021 for Windows and macOS",
  "category": "computing",
  "updated": "2021-02-18T22:01:53Z",
  "author": "john-loeffler",
  "summary": "Microsoft's latest update to their productivity suite is coming",
  "article": [
    "Microsoft announced its latest update to their productivity suite, Office 2021, this week in a blog post by Jared Shapiro, Microsoft 365's corporate vice president. He also announced Office Long Term Servicing Channel (LTSC) for businesses that need a long-term, static option for the software.",
    "Like the previous release, Office 2019, Office 2021 is designed for personal and small business users who do not want to subscribe to the company's cloud service, Microsoft 365.",
    "While we don't have the full details yet about what kinds of feature changes or additions Office 2021 has in store, The Verge points out that Microsoft is likely to introduce any major changes to Office products in their subscription-based Microsoft 365 first.",
    "Shapiro says in the blog post that Office 2021 will be supported for five years and that pricing for the one-time purchase will remain the same for personal and small business users, though the price of Office Professional Plus, Office Standard, and individual Office app purchases will increase by 10%.",
    "\"The cloud is where we invest, where we innovate, where we discover the solutions that help our customers empower everyone in their organization—even as we all adjust to a new world of work,\" Shapiro writes. \"But we also acknowledge that some of our customers need to enable a limited set of locked-in-time scenarios, and these updates reflect our commitment to helping them meet this need.\"",
    "Microsoft's new Office LTSC option is for commercial operations that for whatever reason cannot update their software frequently or even at all, whether out of practical necessity or regulatory compliance.",
    "\"New Office LTSC features will include accessibility improvements, capabilities like Dynamic Arrays and XLOOKUP in Excel, dark mode support across multiple apps, and performance improvements across Word, Excel, Outlook, and PowerPoint,\" Shapiro writes. It won't ship with Skype for Business, but it will ship with Microsoft Teams.",
    "It won't have cloud access but like with previous releases, Office LTSC will be offered with a perpetual, device-based license. Microsoft plans to release a preview of Office LTSC in April, with a full release sometime later this year. No word yet on when Office 2021 will be available, though the company doesn't plan on releasing a preview ahead of its release."
  ],
  "headers": {
    "4": "Office LTSC is here for businesses that need a time-locked Office option"
  },
  "links": {
    "blog post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-4855663835874007000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Fblog%2F2021%2F02%2F18%2Fupcoming-commercial-preview-of-microsoft-office-ltsc%2F",
    "Office 2019": "https://www.techradar.com/reviews/microsoft-office-2019",
    "The Verge": "https://www.theverge.com/2021/2/18/22288959/microsoft-office-2021-windows-mac-features-release-date-price"
  }
}