{
  "source": "https://www.techradar.com/news/qualcomms-new-mobile-shows-power-isnt-everything-for-gaming-phones",
  "title": "Qualcomm's new mobile shows power isn't everything for gaming phones",
  "category": "phones",
  "updated": "2021-08-30T10:00:43Z",
  "author": "tom-bedford",
  "summary": "It's the hardware that counts",
  "article": [
    "In early July, smartphone component maker Qualcomm unveiled its new Android phone, made in collaboration with Asus. The Smartphone for Snapdragon Insiders - that's literally the name, we're not using some bizarre synonym - costs a princely $1,499 / £1,099 (roughly AU$2,020), but justifies its price in a few key ways.",
    "The phone acts as a showcase for many of Qualcomm's technologies: it uses the top-end Snapdragon 888 chipset, comes with earbuds that use Snapdragon Sound tech, uses the company's fast-charging tech, and utilizes some camera features designed by the company too.",
    "This isn't just a showcase phone though, and judging by the marketing and Asus partnership, it seems Qualcomm is hoping mobile gamers will pick up the phone.",
    "We can certainly see mobile gamers being attracted to the phone's specs and features, but testing the thing has made us realize that there's a lot more to a gaming smartphone than its specs.",
    "We tested some of the biggest mobile games on the Smartphone for Snapdragon Insiders, and found they always played flawlessly.",
    "Games played without lag or stutters, and on titles with graphics options, we could always use the top offering without having to worry about the phone giving up on us.",
    "We used the phone with the bundled headphones - these have the Snapdragon Sound branding, but it seems they're actually just repurposed Master & Dynamic MW08s. We gave those wireless earbuds a very positive review, though, so that's no bad thing. Audio sounded great on these, in part due to the Snapdragon Sound lossless audio.",
    "If we were watching someone use the Smartphone for Snapdragon Insiders, maybe peering over their shoulder as they wander through a game of PUBG Mobile, it would seem like a great device. But actually playing with the thing made made us realize what we actually need from a gaming phone, and it's not just specs.",
    "The one big problem with mobile gaming is that touch controls on a smartphone can be quite finickity, so the time between 'thinking you need to react' and 'actually reacting' can be quite long, as you work out where the right button is and stretch your fingers to press it.",
    "Many gaming phones, like the Nubia Red Magic 6 or Lenovo Legion Phone Duel, solve this by using physical trigger buttons. These sit on the side of the handset, so they're on top when you hold the device landscape to play games, and are super easy to reach. You can map them to controls - say, in a shooting game, tapping one trigger shoots your gun.",
    "Once you've played a competitive mobile game on a device with triggers, it feels hard to go back to on-screen controls, because they're so convenient and natural. They turn a 'powerful phone' into a real 'gaming phone'.",
    "Another feature of gaming phones that makes them great is the software, as they have launchers you use to play the games. There are various optimizations from this as the phones will generally silence notifications, dedicate all the processing power to the game, and sometimes boost the cooling systems too.",
    "Some smartphones even have physical triggers for this, so you can just flick a switch and easily jump into a game in no time, without having to scroll through your app drawer or phone menus to find the title you're looking for.",
    "These are things we've come to take for granted on most gaming phones, but the Smartphone for Snapdragon Insiders doesn't have triggers or a gaming space - and we really started to notice this when we were playing games.",
    "We're so used to testing smartphones with triggers and game spaces that it was a little jarring using a gaming device without the features - in a busy Call of Duty: Mobile match we'd find our fingers idly drifting north and tapping the sides of the device, even if it didn't actually do anything.",
    "Despite the fact we were staring at high-res graphics, on a display with a top refresh rate that was big enough to see the details of every visual, we didn't find ourselves loving gaming on the Smartphone for Snapdragon Insiders, mainly because of the lack of these two features.",
    "Qualcomm has kitted out its device with all the best tech it's created, but the issue lies in the tech it hasn't created - now that most gaming phones have triggers and game spaces, it's hard to adjust to a device that doesn't.",
    "Before testing the Smartphone for Snapdragon Insiders, we were sure a gaming phone just needed to be powerful and have a great-looking display. It was only when playing games that we noticed that, while the power was great, it's the extra features that really make a gaming phone stand out.",
    "That's not to say you should avoid the Smartphone for Snapdragon Insiders for what it lacks - the price is much more of a disincentive - but it's a lesson in what really makes a great gaming phone."
  ],
  "headers": {
    "4": "Playing games",
    "8": "It's in the details",
    "14": "Getting triggered"
  },
  "links": {
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Master & Dynamic MW08": "https://www.techradar.com/reviews/master-and-dynamic-mw08",
    "Nubia Red Magic 6": "https://www.techradar.com/reviews/nubia-red-magic-6",
    "Lenovo Legion Phone Duel": "https://www.techradar.com/reviews/lenovo-legion-phone-duel-review"
  }
}