{
  "source": "https://www.techradar.com/news/you-could-speed-up-your-windows-network-connection-with-this-expressvpn-tip",
  "title": "You could speed up your Windows network connection with this ExpressVPN tip",
  "category": "computing",
  "updated": "2021-08-07T10:46:52Z",
  "author": "mike-williams",
  "summary": "You don't need ExpressVPN, it works on any PC",
  "article": [
    "Is your Windows network connection slower than you'd like? A quick web search gets you several libraries worth of advice on how to speed things up, but the quality is, well, variable. You could easily waste time on a lengthy list of complicated tweaks based on an obscure blog post from 2014, only to find your speeds are worse than they were originally (and that's if your connection still works at all).",
    "What if you got advice from someone you know you can trust, though? Like, say, VPN market-leader ExpressVPN? Then, maybe, it's worth paying a little more attention.",
    "The company's Windows VPN app includes a setting called 'Optimize Windows networking to maximize Windows speed' which aims to improve network and internet speeds. The option is simple, only changes a couple of Windows settings, and could have a positive impact on your speed.",
    "And the best bit? You can apply these tweaks right now, even if you don't use ExpressVPN. It only takes a couple of minutes and, if doesn't work out, no problem - just restore the original settings, reboot and you'll be back to normal.",
    "ExpressVPN explains that: \"default Windows network settings for Windows 7 and 8 are not optimized for today’s fast internet traffic and VPN speeds\", and turning on its Optimize setting means that its app has applied the latest recommended settings from Microsoft.",
    "Assuming you're using Windows 10, then other apps you've installed may already have changed these network settings, so it's still worth checking them out.",
    "The ExpressVPN app applies these two Windows TCP tweaks:",
    "- Enables a feature called Windows Receive Windows Auto-Tuning, a smart technology which automatically adjusts data transfers to best work with changing network conditions.",
    "- Disables Windows Scaling Heuristics. Much like auto-tuning, this tells Windows to look for connectivity issues and try to compensate for any problems it finds. That's good in theory, but it doesn't always work and many network speedup guides recommend turning it off.",
    "Will either of these help you? We can't say for sure. To make it easier to find out, check your broadband speeds with a site like SpeedTest.net or nPerf.com both before and after you make the tweaks, to get a clear picture of any changes.",
    "The simplest way to manually apply these tweaks is via the Windows command prompt.",
    "Click Start, type CMD, and Command Prompt should be selected by default (if not, use the up and down arrows on your keyboard to select it.)",
    "When it's highlighted, click Run As Administrator, and click Yes when asked if you want to allow this app to make changes to your device.",
    "Don't see a Run As Administrator prompt? Right-click Command Prompt and choose the option from the menu, or highlight Command Prompt, hold down Ctrl and Shift, then press Enter.",
    "Before you make any changes, it's important to check your existing settings, as you can then restore them later if the tweaks don't work.",
    "Copy and paste the command netsh int tcp show global into the command prompt, and press Enter.",
    "Look down the list of settings, and make a note of the Receive Windows Auto-Tuning Level. It's the second setting on our Windows 10 system, and might read 'disabled', 'highlyrestricted', 'restricted', 'normal' or 'experimental'.",
    "Now copy and paste netsh int tcp show heuristics into the command line, and press Enter.",
    "This time, look for the Windows Scaling heuristics value, make a note of whether it's disabled or enabled, and save the details.",
    "If your Windows Scaling Heuristics setting is turned on right now, copy and paste the command netsh int tcp set heuristics disabled into the command prompt, then press Enter to turn it off.",
    "If your Receive Windows Auto-Tuning Level is set to anything but 'Normal', copy and paste the command netsh int tcp set global autotuninglevel=normal into your command window, then press Enter.",
    "Heuristics was already disabled, and auto-tuning set to normal? Then you're already using ExpressVPN's recommended settings. That earns you a thumbs up for your top-notch PC setup, but otherwise there's nothing more for you to do.",
    "If you have made a change, though, it's important to close any apps and reboot when you're done. TCP changes may not be fully active until your system restarts.",
    "Tweaks applied, return to the speed test sites you tried earlier, run a few more checks and look for any change.",
    "Don't be surprised if performance is much the same. If there are any advantages to the tweaks, they may not be immediately noticeable or apply in every situation.",
    "If this is a Windows laptop, for instance, you might see no changes at home, but a big speed boost on your favorite coffeeshop's wireless hotspot when it's especially busy.",
    "In other words: be patient. See how your system performs with all the networks you access, and all your regular tasks, before you give your final verdict.",
    "If there are problems, and you'd like to put Windows back the way it was, just launch the command prompt again, refer back to your notes of the previous settings, and use the netsh commands you entered earlier to restore them.",
    "If your Heuristics setting was Enabled, for instance, restore that by entering the command netsh int tcp set heuristics enabled",
    "And if your original Auto-Tuning Level was Disabled, switch back with the command netsh int tcp set global autotuninglevel=disabled",
    "In both cases, replace the final word of the command with the original setting, as recorded in your notes.",
    "Again, reboot when you're done to make sure Windows properly applies the new settings, and your system will be back to its original state."
  ],
  "headers": {
    "4": "ExpressVPN's Windows network speedup tweaks",
    "10": "1. Open the Windows command prompt",
    "14": "2. Check your current Windows network settings",
    "19": "3. Apply the ExpressVPN tweaks",
    "23": "4. Test your system network speed",
    "27": "5. Undo any changes, if necessary"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "ExpressVPN": "https://www.techradar.com/reviews/expressvpn",
    "Windows VPN": "https://www.techradar.com/vpn/best-windows-10-vpn",
    "TCP": "https://www.techradar.com/vpn/what-is-tcpip-and-why-does-it-matter",
    "check your broadband speeds": "https://www.techradar.com/broadband/broadband-speed-test",
    "SpeedTest.net": "https://www.speedtest.net/",
    "nPerf.com": "https://www.nperf.com/en/",
    "Windows laptop": "https://www.techradar.com/news/best-windows-laptop"
  }
}