{
  "source": "https://www.techradar.com/news/apple-fitness-plus-vs-peloton",
  "title": "Apple Fitness Plus vs Peloton: choose the right workout subscription service for you",
  "category": "appliances",
  "updated": "2021-06-29T22:08:16Z",
  "author": "rob-clymo",
  "summary": "Two fab fitness options to help you achieve your goals",
  "article": [
    "Peloton has long been the biggest name in instructor-led home workouts, but now Apple Fitness Plus is offering a very similar service for a similar fee. So what are the differences, and which one is best for you?",
    "Gym memberships usually skyrocket at the start of a new year. Coronavirus has changed all that though, with many of us looking at other ways to rid ourselves of the extra weight we’ve gained due to all that festive excess.",
    "If you want to bypass going to a gym and have been looking at alternative ways to get more exercise in or around your home then both Apple Fitness Plus and Peloton make obvious places to start.",
    "Apple Fitness Plus launched back in September 2020, and if you’re keen to start working out in 2021 it’s definitely going to be of interest, although it’s got less of a track record compared to Peloton. With its high-profile image and many ‘live’ workouts where you pitch yourself against others Peloton enjoys a fervent following around the globe.",
    "So which one to go for? In a nutshell Apple disciples will probably flock to the Apple Fitness+ option, but Peloton has a lot going for it. They’re actually both good for slightly different reasons. Let’s find out why.",
    "Subscription-based, Apple Fitness Plus is a service that costs $9.99 / £9.99 / AU$14.99 a month or $79.99 / £79.99 / AU$119.99 annually. If you’ve got the Apple One Premier bundle then it’s possible to use the service with Family Sharing for $29.95 a month. If you’ve bought an Apple Watch Series 3 or later since September 15 then you can explore it free for three months. Existing owners get the benefit of one month free.",
    "In order to use Apple Fitness Plus you’ll need yourself, obviously, plus an Apple Watch and an iPhone, iPad or Apple TV in order to stream the classes. You might also want to invest in some weights to get the full benefit of the workouts where your trainer is using them.",
    "Add in a sprinkle of enthusiasm and you’ll be good to go, although the lack of ‘live’ atmosphere you get compared to many of the Peloton workouts might prove offputting to some it has to be said.",
    "The workout options for Apple Fitness+ currently consist of high-intensity interval training (HIIT) along with strength training, yoga, dance, core, cycling, running and walking workouts on a treadmill, plus rowing and cooldown options. Supplementary workouts will be added on a weekly basis according to Apple.",
    "Having been around for much longer than its new Apple Fitness+ counterpart, Peloton provides subscribers with a well-seasoned workout experience that benefits from some very cool hardware. Compared to Apple it’s got a much more complete package in that respect, with the high-tech bikes and treadmills it sells offering a much more immersive experience paring perfectly with the wealth of live workout events it offers.",
    "Used on its own, Peloton’s app-only membership costs $12.99 per month, which allows you to access its extensive workout classes. Of course, if you’ve splurged or want to purchase Peloton hardware such as the Peloton Bike or Tread treadmill options then you’ll get it as part of the service. For many, being able to use a high-end cardio machine is what makes Peloton appealing as many of us sidestep conventional gyms, but the kit is expensive.",
    "Indeed, Peloton is proving to be increasingly attractive to people who want to avoid the close contact of traditional gyms. This is especially so since the coronavirus pandemic has made many of us nervous about being in something like a spinning class.",
    "Many gyms are also going through open/closed cycles due to evolving lockdown rules. Therefore, getting yourself armed with Peloton cardio kit removes all of that uncertainty, but you can still workout with others online. Of course, you’ll want to be pretty confident that you’re going to stick with it considering the sizeable outlay needed to buy a Peloton bike or treadmill.",
    "Hardware or not, the core ingredient of a Peloton sweat session is the app, which if you subscribe to its digital services lets you enjoy a raft of different workout options. You can access Peloton digital services via mobile devices such as an iPad, iPhone or Android phones and tablets. Peloton is also available via Apple TV, Fire TV and Roku. Alternatively, tune in to exercise sessions online on a laptop.",
    "Fitness fans of Peloton digital are well catered for too. You can get stuck into strength, yoga, cardio, meditation, running (both on a treadmill and outdoors), indoor cycling, stretching and walking. There are also Tread Bootcamp and Bike Bootcamp options, so there’s something for everyone.",
    "Your workouts are driven by trained instructors with the supportive backdrop of music, which Apple also uses as a key feature in its own package. However, Peloton takes the edge in terms of motivation because of that live element and the fact that you’re working up a sweat with others. It’s more inclusive.",
    "If you’re looking to workout, but also want to try and get other members of your family into the fitness groove then both Apple Fitness+ and Peloton will fit the bill. While joining online classes often involves watching content that is dominated by toned trainers the overall output is basically viewable by anyone 12 and over. Apple Fitness+ makes good sense in this respect as it can be trialled without too much hassle or financial outlay.",
    "If you’ve got younger family members who want to get involved it’s important to be aware that the adult classes will, in many cases, feature instructors working themselves (and you) into a lather. The worst you’ll probably see is lots of sweat. But, in the case of both Apple Fitness+ and Peloton, there’s lots of super-animated coaching and, perhaps, some audio content that might not be everyone’s cup of tea.",
    "Generally speaking though either Apple Fitness+ and Peloton should be palatable for older children and upwards. Where there might be a question mark on content you’re about to watch then check your app for clarification.",
    "It’s easy to see why Peloton enjoys such a fervent following with fitness fans that want to connect with others. Peloton looks and feels live, it’s got a cool vibe going on and for many that’s an essential part of any workout. It’s also got the hardware and tech to add to its overall muscle. Go the whole hog and buy the hardware though and you’ll be spending a sizeable chunk of money.",
    "Apple Fitness Plus is pretty smart too it has to be said, with the dynamic edge of the software allowing you to get a better workout than you might think. Workouts evolve based on the data your Apple Watch records, so if you’re pushing hard to burn calories and boost your heart rate the Fitness+ technology should squeeze more from you. It’s requires much less financial commitment too, while some of the neat though not quite groundbreaking features will pique your interest.",
    "For example, it’s useful that your live heart rate, calorie burn and movement ring output is shown live on screen during workouts with Apple Fitness+. There’s also the Burn Bar, which is a great idea that induces a little more of a competitive edge to proceedings as it gathers data from others who’ve done your workout. It gives you a bit of a virtual nudge if you opt to keep it switched on.",
    "Equally, Apple Fitness Plus requires a little more self-discipline on your part to get the most from it as it’s basically down to you to get on with it.",
    "It’s early days for Apple Fitness Plus, whereas Peloton has been plying its workout wares for considerably longer. With its proven track record for firing people up and delivering plenty of fitness options using a variety of different classes Peloton therefore looks like a great option. It’s also got the potential to empty your wallet initially. A Peloton bike starts at just under $2,000 while the treadmill comes in at over $4,000. You’ll need space for the kit too.",
    "However, factor in the savings if you’re going to do it instead of a gym membership and it starts looking like pretty good value.",
    "If you’re keen on the look of the Apple Fitness Plus route then the major difference is you’ll need an Apple Watch in order to get the best from the classes. If you’re already an Apple convert, or thinking about buying the latest Apple Watch model then that may be perfect timing. A real bonus is the way that, save for any free weights you buy, there’s no bulky kit to worry about.",
    "And another win with Apple Fitness Plus is that if you’re on the move then you’ll have access to all of your favourite workouts without the need for any hardware. Being able to set up and enjoy the type of workout that fits your surroundings at any given time makes Apple Fitness Plus a bonus, even more so if you’re well into Apple Music.",
    "Ultimately, if you’re a bit fickle on the exercise front and don't quite trust yourself to keep on working out then, just like other fitness apps and services, both options require a decent level of commitment. Choosing Apple Fitness Plus or Peloton is one thing, but sticking with it is the real test. And money can’t buy that, no matter how smart the tech is."
  ],
  "headers": {
    "5": "Apple Fitness Plus",
    "9": "Peloton",
    "16": "Family-friendly?",
    "19": "General observations",
    "23": "Verdict"
  },
  "links": {
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Apple Watch Series 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "Apple Watch": "https://www.techradar.com/reviews/apple-watch-3-review",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Apple TV": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Fire TV": "https://www.techradar.com/news/fire-tv-stick-vs-fire-tv-stick-4k-vs-fire-tv-cube-amazons-streamers-head-to-head",
    "Roku": "https://www.techradar.com/news/best-roku-streaming-device",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361"
  }
}