{
  "source": "https://www.techradar.com/news/sennheisers-latest-true-wireless-earbuds-are-even-cheaper-than-their-predecessors",
  "title": "Sennheiser’s latest true wireless earbuds are even cheaper than their predecessors",
  "category": "audio-visual",
  "updated": "2021-06-29T06:05:18Z",
  "author": "olivia-tambini",
  "summary": "Lots of upgrades without the price hike",
  "article": [
    "Sennheiser has announced its latest true wireless earbuds. The Sennheiser CX True Wireless are the follow up to the popular CX 400BT – and despite coming with a raft of new features, they’re even cheaper than their predecessors.",
    "The new earbuds come with an improved battery life, with nine hours from the earbuds themselves, and a further 18 hours from the charging case – an increase of seven hours compared to the previous generation.",
    "We've spent a little time getting to know the wireless earbuds – read our hands-on Sennheiser CX True Wireless review for our initial thoughts.",
    "The CX True Wireless also now come with an IPX4 water resistance rating, which means you can use them while working out without the fear that a drop of rain or a little sweat will break them.",
    "Like the CX 400BT, they come with customizable touch controls, and the ability to fiddle with the EQ setting via the Sennheiser Smart Control app.",
    "Connectivity has been improved too, with Bluetooth 5.2 compatibility and SBC, AAC, and aptX codec support, so you should be able to listen to hi-res audio tracks without a hitch. You can also use each earbud independently if you wish, while dual microphones inside each bud should deliver clear calls – and, a new Sidetone feature is designed to make it easier to hear your own voice during calls.",
    "Inside each earbud is a proprietary TrueResponse transducer, which Sennheiser says will deliver “deep basses, natural mids, and clear, detailed treble”. If they sound anything like the previous model, you can expect a gratifyingly detailed sound, with excellent dynamism and attack.",
    "We’re hoping that Sennheiser has addressed the one issue we had with the sound of the CX 400BT; they had a habit of sounding harsh when it came to treble frequencies, which can become uncomfortable during long listening sessions.",
    "That said, any kind of improvement is welcome when you consider that these buds are less expensive than their predecessors, costing $129.95 / £119.99 / AU$199.95.",
    "Not only is that cheaper than the CX 400BT, which cost $199 / £169 / AU$299, but it’s also less expensive than the Apple AirPods, which are among the most popular true wireless earbuds on the planet.",
    "Like the 2019 Airpods, there’s no active noise cancellation, but we wouldn’t necessarily expect that at this price. And, their predecessors were pretty adept when it came to passive noise cancellation thanks to their secure fit, so we don’t think ANC will be particularly missed.",
    "In any case, we’re excited to try out the Sennheiser CX True Wireless for ourselves. If they live up to the specs and deliver a great audio performance at this price point, they could swipe a spot on our guide to the best wireless earbuds you can buy in 2021."
  ],
  "headers": {
    "5": "Affordable AirPods alternatives"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "CX 400BT": "https://www.techradar.com/reviews/sennheiser-cx-400bt-true-wireless",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Sennheiser CX True Wireless review": "https://www.techradar.com/reviews/sennheiser-cx-400bt-true-wireless",
    "hi-res audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335"
  }
}