{
  "source": "https://www.techradar.com/news/real-time-content-the-next-phase-of-the-streaming-wars",
  "title": "Real-time content: the next phase of the streaming wars",
  "category": "computing",
  "updated": "2021-03-19T09:46:39Z",
  "author": "steve-miller-jones",
  "summary": "Strong content security enables reliable streaming services",
  "article": [
    "As consumers moved online during the pandemic, demand for streaming services exploded and competition between a wide range of providers, large and small, heated up. Maintaining these customer bases will require consistent high quality and novel content experiences the competition can’t replicate.",
    "However, providers must also consider the security and protection of their intellectual property. To stay competitive in the next phase of the streaming wars, streaming service providers will need to pair interactive, real-time content experiences with sophisticated and comprehensive anti-piracy measures.",
    "At a time when the popularity of streaming services has never been higher, content security needs to be a top priority. Research shows that piracy costs digital content providers up to $71 billion a year, and it’s only growing. Credential sharing is endemic, with 36% of UK consumers admitting to sharing their login details for streaming services with others.",
    "Streaming providers have to work harder to ensure traffic is passing through legitimate channels. However, how they respond needs to be guided by their priorities. For providers like Netflix, credential sharing between different members of a household is permitted and even encouraged. An overly harsh approach could catch innocent customers in the net, so a data-driven understanding of user activity is critical to stopping actual abuse.",
    "It’s important for providers to consider the full range of options available to them when tackling piracy. In all circumstances, ensure you are using up-to-date security protocols in all your distribution channels. Any gaps or inconsistencies increases your attack surface and makes your content vulnerable to man-in-the-middle attacks. DRM and Watermarking, meanwhile, are effective tools for both encrypting content and helping to protect it from illegal use.",
    "By contrast, identifying credential sharing and problem accounts will take closer collaboration between streaming providers and CDNs. Tracking the activity of individual accounts is important for understanding user behavior, but detecting credential abuse and blocking access can be very complex. Live events in particular are subject to this attack vector.",
    "A CDN partner can play a crucial role here – keeping a detailed log of every content request for a given stream or piece of content. This data is then shared with the streaming service provider, letting them compile a blacklist of compromised accounts that can then be blocked from accessing future content. CDN providers are consistently looking at ways to make the process faster and more efficient. Indeed, the use of AI to rapidly detect account abuse may be a source of future innovation.",
    "In addition to security, streaming providers will also have to innovate their content types and service delivery to remain competitive and relevant for an evolving customer base. Part of this will have to be focused on satisfying a growing itch for interactivity, especially when it comes to live content.",
    "The effects of lockdown and social isolation are pushing consumers towards content that responds to them and which is interactive. The pressure for streaming providers is to deliver experiences that can’t just be passively consumed, but which the user can customize. Video and content providers are already innovating in this area, particularly in live sports streaming. Consumers increasingly have access to more data integrated into the viewing experience, gamification of content, alternate commentaries and customizable audio feeds they can select when they tune in to watch.",
    "Interactive experiences like these won’t revolutionize the viewing experience in the short term. But we’re gradually moving towards a model where the user controls the content experience for themselves. However, it’s important for providers to understand what it takes to deliver these experiences.",
    "Delivering engaging, low-latency and interactive experiences is only possible with real-time streaming from providers. This means vastly more data, processed and distributed to the end user over a much shorter window of time. Yet doing it well requires providers to take on a whole new host of considerations, from infrastructure to capacity and security.",
    "Firstly, how the real-time streaming data is protected needs to be considered. The same measures used to protect long-form or live content may not be suitable as streaming speed can’t be compromised. All providers will have to find a balance between the protection of the content and the speed at which it’s processed and distributed.",
    "Efficient real-time streaming also requires providers to make the best use of industry standards and the most appropriate content formats to mitigate capacity issues. Techniques like Content Aware Encoding can also create high quality video with lower overheads, helping keep costs under control.",
    "New techniques will help providers deliver reliable real-time streaming, but they can’t allow the quality of the underlying content to suffer. Whether a streaming service provider is an industry leader or a midmarket player, consumers expect content libraries to be constantly accessible and of good streaming quality. Regardless of whether the content is legacy or brand new, poor image quality, buffering or long loading times hurt the viewing experience. An expert CDN partner can mitigate these issues, helping the provider understand the ideal location for the content origin to achieve the best streaming performance.",
    "Streaming providers that fail to deliver reliable real-time content will fall behind in the streaming arms race. Satisfying consumer demands requires data-intensive, interactive and in-the moment-content – and that means effective use of the latest standards, techniques and tools to avoid capacity issues. But security must also be a priority. You can’t reap the rewards of real-time streaming without a strong backbone of content security."
  ],
  "headers": {
    "2": "Safety first",
    "7": "Real-time streaming: delivering interactivity and low-latency",
    "14": "Speed and security"
  },
  "links": {
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "CDNs": "https://www.techradar.com/news/best-cdn-providers",
    "data": "https://www.techradar.com/best/best-data-recovery-software"
  }
}