{
  "source": "https://www.techradar.com/news/is-this-the-best-black-friday-deal-for-bibliophiles-top-kindle-unlimited-discount",
  "title": "Is this the best Black Friday deal for bibliophiles? Top Kindle Unlimited discount",
  "category": "tablets",
  "updated": "2021-11-26T21:41:54Z",
  "author": "tom-bedford",
  "summary": "Three months for the price of one",
  "article": [
    "If you're a big book fan – or want to be – you've probably already explored the Black Friday Kindle deals. Well, what if we told you that there was another discount you need to check out?",
    "Amazon's Kindle Unlimited service, which grants access to thousands of digital books, magazines and comic books for a monthly fee, has its own Black Friday deal, too. For reasons beyond our understanding, the offering differs slightly between regions: US consumers can get four months for half a normal month's subscription rate of $4.99, while in the UK you can get your first three months' subscription for the price of one month. That's £7.99 for three months, when normally it'd be one.",
    "(Not in the US or UK? Scroll down for deals in your region).",
    "This deal runs until the end of November 30, so if you're interested, you've only got a while to act. And while you can use the Kindle app on your device of choice to read, listen to, and watch Kindle Unlimited content, if you were thinking of picking up a Kindle ereader to use with the service, we've got deals for those too:",
    "Kindle Unlimited is a subscription service for Kindle users, and it lets you download from a huge library of books, magazines and comic books.",
    "If you're a prolific reader, you could save loads of money using Unlimited, as it's basically an Amazon-sourced library of content.",
    "If you take up the deal, you'll get three months for the price of one, but after those 90 days have elapsed you'll have to revert to paying the usual monthly price of £7.99. So make the most of the service while you have it.",
    "No matter where you live, you'll find all the lowest prices for Kindle Unlimited subscriptions from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Kindle Unlimited Black Friday deal UK",
    "7": "More Kindle Unlimited deals",
    "8": "More Black Friday deals"
  },
  "links": {
    "Black Friday Kindle deals": "https://www.techradar.com/black-friday/black-friday-kindle-deals",
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}