{
  "source": "https://www.techradar.com/news/why-delivery-drones-are-struggling-to-take-off-even-with-dhl-and-amazon-on-board",
  "title": "Why delivery drones are struggling to take off – even with DHL and Amazon on board",
  "category": "cameras",
  "updated": "2021-08-10T15:56:38Z",
  "author": "axel-metz",
  "summary": "Failing to deliver?",
  "article": [
    "Delivery drones have long been thought of as a reasonable next step towards humanity’s robot-filled future. Not quite as ambitious as flying cars but leagues ahead of the humble mailman, cargo-carrying quadcopters once seemed an inevitable extension of the impressive aerial tech we’ve seen from the likes of DJI and Sony.",
    "But not all forward-looking concepts are destined for lift-off. Drone delivery projects from industry heavyweights including UPS and Amazon are struggling to get off the ground – and analysts have told us why these airborne couriers aren't likely to replace their ground-based equivalents anytime soon.",
    "DHL, for instance – one of the world’s largest mail networks – has now officially abandoned its Parcelcopter delivery drone project, eight years after the multi-billion dollar company first began developing the technology.",
    "Reports from Germany (via DroneDJ) suggest the international delivery service no longer intends to manufacture its own drones nor continue testing its Parcelcopter in any capacity, just weeks after Amazon announced a similar shuttering of its equivalent program, Prime Air, in the UK. So why are drones failing to become our aerial couriers?",
    "The Parcelcopter was first launched by DHL in 2013, and was, back then, basically a prototype quadcopter capable of carrying small parcels up to one kilometre. In the years since, the company modified the drone to fly faster, for longer and increased its cargo capacity with every iteration – though the last prototype came in 2018.",
    "It never reached a commercially-viable state, either, and DHL has now branded the whole enterprise an “impressive proof of concept” within a drone industry awash with “unrealistic hype.”",
    "Unlike DHL, Amazon hasn’t yet hammered the last nail in the coffin of its Prime Air project – despite the stripping back of its UK operations, the company remains committed to getting the service off the ground – though insiders recently told Wired that the whole program is “collapsing inwards.”",
    "But that doesn’t mean years of research and development by companies like DHL and Amazon should go to waste. Sure, it seems prudent to acknowledge the difficult realities facing a future of drone-based deliveries – security, safety and practicality among them – though that same development can (and perhaps should) now be totally re-directed towards more practical applications of the technology.",
    "The Parcelcopter’s last rodeo, for example, saw DHL partner with sustainable development agency GIZ and drone-maker Wingcopter to deliver medical supplies to remote regions of east Africa.",
    "That’s certainly a more useful application of DHL’s delivery drones, and big-hitters like Amazon have the capacity to follow suit and accelerate this more practical approach even further.",
    "TechRadar spoke to David Benowitz, Head of Research at Drone Analyst, who told us of the warped public perceptions surrounding this still-developing technology.",
    "“We have seen drones for last mile deliveries dominate the public perception of what drones can achieve in the commercial space for years now,” Benowitz says, “dating all the way back to when [Jeff] Bezos initially claimed Amazon would provide drone deliveries by 2019. While we have certainly seen some advancements in this space, the regulations lag behind and existing delivery networks have gotten more sophisticated.",
    "“I don't expect drone deliveries to never happen,” he adds, “but they may only play a big role where it is economically beneficial to use them. In the meantime, it's important for the world to know just how much work drones are doing in fields like public safety, infrastructure inspections, agriculture mapping and spraying, and so much more.”",
    "It’s clear, then, that a market exists for these drones in industries other than logistics and postal delivery, with the current networks in place for the latter, as Benowitz puts it, already fit for purpose.",
    "Lukas Schroth, Senior Market Analyst at Drone Industry Insights, shares Benowitz’s skepticism. “In my opinion, the near future for drone deliveries in urban areas, especially for consumer goods, does not look that bright,” he told TechRadar. “There is still a lot to be done, especially in terms of legislation, but the lack of infrastructure and social acceptance are also major challenges.”",
    "That idea of social acceptance is an important one. Does anybody actually want flying delivery drones? It’s unlikely that many would be comfortable with the technology in its current state, especially given the adequacy of existing hand-delivery systems. Save for the occasional launched-over-the-fence package, delivery companies are, for the most part, impressively efficient.",
    "In 2021, drone deliveries remain a pipe dream. Not only has the technology failed to come far enough since DHL’s early efforts and Bezos’ 2019 promise, but the very concept is neither practical nor wholly desirable.",
    "The question of whether we see more drones roaming the skies in the near future is altogether larger – but they certainly won’t be delivering Christmas presents any time soon."
  ],
  "headers": {
    "4": "Tried and tested",
    "8": "Aerial assistance",
    "14": "Hitting turbulence"
  },
  "links": {
    "DJI": "https://www.techradar.com/best/best-dji-drone",
    "Sony": "https://www.techradar.com/news/sony-airpeak-drone-release-date-price-rumors-and-leaks",
    "Reports": "https://www.welt.de/wirtschaft/article232996761/Deutsche-Post-DHL-stellt-die-Entwicklung-der-Drohne-Paketkopter-ein.html",
    "DroneDJ": "https://dronedj.com/2021/08/09/dhl-abandons-drone-delivery-plans/",
    "announced": "https://www.wired.co.uk/article/amazon-drone-delivery-prime-air",
    "DHL has now branded": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1144924890148818600&xs=1&url=https%3A%2F%2Fwww.dhl.com%2Fdiscover%2Fbusiness%2Fbusiness-ethics%2Fparcelcopter-drone-technology&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhy-delivery-drones-are-struggling-to-take-off-even-with-dhl-and-amazon-on-board",
    "Wired": "https://www.wired.co.uk/article/amazon-drone-delivery-prime-air"
  }
}