{
  "source": "https://www.techradar.com/news/amd-radeon-rx-6000-mobile-gpus-are-here-to-take-on-nvidia",
  "title": "AMD Radeon RX 6000 mobile GPUs are here to take on Nvidia",
  "category": "computing",
  "updated": "2021-06-01T08:58:21Z",
  "author": "carly-page",
  "summary": "AMD is returning to high-end mobile gaming.",
  "article": [
    "AMD has unveiled laptop versions of its Radeon RX 6000-series graphics cards, which aim to take on Nvidia’s mobile RTX 30-series GPUs.",
    "The lineup is headed by the AMD Radeon RX 6800M, which sees AMD making a long-awaited return to high-end mobile gaming. The graphics card is based on a Navi 22 GPU with 40 CUs - putting it on par with the full-fat AMD Radeon RX 6800.",
    "AMD claims the mobile GPU, which also features 12GB GDDR6 memory and a 145W TGP, will render on average 120 frames per second, and is promising major performance gains over a 2019 gaming laptop packing an Nvidia RTX 2070 graphics card. The Radeon RX 6800M will deliver a 1.7x improvement in Resident Evil: Village, according to AMD, and a 1.4x boost in Cyberpunk 2077.",
    "More interestingly, AMD is also claiming its high-end mobile GPU will outperform the Nvidia RTX 3070 and, in some cases, the Nvidia RTX 3080. The AMD Radeon RX 6800M averaged 141 fps in Resident Evil Village compared to 132 and 137 fps, respectively, and managed to beat out both of Nvidia’s mobile GPUs in Borderlands 3 and Assassin’s Creed Valhalla.",
    "AMD is claiming even more impressive gains when it comes to gaming on battery, suggesting the AMD Radeon 6800M will offer 1.4x the performance of the RTX 3080 in both Resident Evil: Village and Dirt 5.",
    "AMD has also unveiled two lesser-powered mobile GPUs - the AMD Radeon RX 6700M and Radeon RX 6600M. The former, which packs 36CUs, 10GB GDDR6 memory and a TGP of up to 135W, promises up to 100fps gaming at 1440p, while the latter features takes aim at the Nvidia’s mobile RTX 3060 with its 26CUs, 8GB memory and TGP of up to 100W.",
    "According to AMD, the Radeon RX 6800M will deliver impressive gains over the Nvidia RTX 3060 in a number of 1080p games including Borderlands 3 and Dirt 5. However, according to AMD’s own benchmarks, it failed to match the Ampere GPU in Call of Duty: Black Ops Cold War or Cyberpunk 2077.",
    "AMD says its new GPUs, which it’s touting as the fastest “AMD Radeon Graphics for laptops” are available starting now - the Radeon RX 6800M and RX 6600M are shipping starting today, with the RX 6700M set to follow soon.",
    "The first laptops to pack AMD’s new graphics have also started shipping. The all-AMD ROG Strix G15, which pairs an AMD Radeon RX 6800M mobile GPU with a Ryzen 9 5900HX processor, is available today."
  ],
  "headers": {},
  "links": {
    "AMD": "https://www.techradar.com/news/amd-processors-the-best-amd-cpus-in-2019",
    "AMD Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "gaming laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Nvidia RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "Ryzen 9 5900HX": "https://www.techradar.com/reviews/amd-ryzen-9-5900x"
  }
}