{
  "source": "https://www.techradar.com/news/gsma-says-it-will-hold-a-safe-and-secure-mwc-2021",
  "title": "MWC 2021 is officially still going ahead",
  "category": "phones",
  "updated": "2021-05-20T10:49:09Z",
  "author": "steve-mccaskill",
  "summary": "GSMA says it will hold a 'safe and secure' MWC 2021",
  "article": [
    "The GSMA says it would not even be considering staging Mobile World Congress (MWC 2021) in June if it did not think it could do so safely.",
    "The biggest event in the mobile industry calendar was one of the earliest casualties of the pandemic last February, and this year’s show has switched from its usual Spring slot to the summer to give it the best possible chance of going ahead.",
    "Things will inevitably be a little different as MWC 2021 will be a ‘hybrid’ event that combines physical exhibition space and keynotes with virtual sessions and networking.",
    "The GSMA is still unsure of final numbers but believes between 30,000 and 40,000 people could attend, while 70% of all keynote speakers will be in Barcelona.",
    "All attendees will be required to provide a negative Covid test every 72 hours and confirm they have no symptoms every day in order for their pass to be validated, while social distancing, facemask requirements and enhanced ventilation will be in place.",
    "However, despite the improving situation in many parts of the world and the these promised safety measures, many major firms – including Ericsson and Nokia – have confirmed they will not be attending.",
    "The GSMA said MWC 2021 would have a very different feel due to the lower number of visitors and that it understood such concerns, but expressed confidence that it had taken every precaution necessary to stage a safe event.",
    "“Health and safety is of paramount importance for me,” said Mats Granryd, Director General of the GSMA. “We have a lot of exhibitors and we need to make sure we take care of them. The health and safety measures have been approved by the Catalonian authorities. We are not [cutting corners].”",
    "“We would not even attempt to put on an event if we were worried about everyone’s safety,” added GSMA CEO Jon Hoffman. “We will hold a healthy and safe MWC 2021.”",
    "The amount of exhibition space and final number of attendees won’t be known until the very last minute, while the economic impact of this year’s show won’t be known until after the event. The GSMA will also offer local firms in certain industries tickets for just €21.",
    "But despite the withdrawal of many usual exhibitors, Granyrd and Hofman said the mobile industry was eager to meet in person and conduct the many business meetings and deals that are held at the show and in the city each year. They acknowledged that companies might send smaller delegations but believed the most important people would still be in attendance.",
    "“This event is not just about showcasing the latest technology, it’s about new business opportunities,” added Granyrd. “Business is based on trust and the only way to build that trust is to meet people [physically].",
    "“Those who won’t come in the summer have said they will definitely come in February 2022.”",
    "The pandemic has also influenced the theme of this year’s event. The experience of the pandemic has elevated the role of connectivity within society as people became reliant on mobile and broadband networks to work remotely, speak with friends and family, and access essential government services.",
    "Whereas previous themes have been more technologically oriented, ‘Connected Impact’ reflects the user experience and human element of communication.",
    "“We have learned a lot of hard, disturbing stuff through his pandemic,” said Granyrd. “We now see connectivity is not just about intelligence, it’s about making an impact on society, on business, and over me, you, and our families. Connected Impact tries to encompass all that.",
    "“The impact of the mobile industry over these past 15 months has been truly amazing and that’s why we believe this is the right theme.”",
    "Overall, there was an acknowledgement that MWC 2021 would be a very different event to previous years, but there is a hope that things will be more normal when MWC 2022 is held next February.",
    "The cancellation of MWC 2020 was a huge blow to the GSMA, which persevered with plans to hold the event until just weeks before. despite the worsening Coronavirus situation and the withdrawal of many of the biggest names of the industry. It then attracted further controversy by suggesting exhibitors would not be compensated before it offered partial refunds to exhibitors or credit to be used against future events.",
    "MWC will continue to be held in Barcelona until 2024 after an extension of its existing agreement with city."
  ],
  "headers": {
    "3": "MWC 2021"
  },
  "links": {
    "Mobile World Congress (MWC 2021)": "https://www.techradar.com/news/mwc-2021-news"
  }
}