{
  "source": "https://www.techradar.com/news/black-friday-arrived-early-for-blink-cameras-at-amazon-with-prices-from-dollar2499",
  "title": "Black Friday arrived early for Blink cameras at Amazon, with prices from $24.99",
  "category": "cameras",
  "updated": "2021-10-26T16:35:27Z",
  "author": "mackenzie-frazier",
  "summary": "Score early Black Friday deals on Blink home security cameras",
  "article": [
    "While Black Friday is still over a month away, you can score epic deals right now on Amazon's best-selling Blink security cameras. Amazon's early Black Friday sale includes record-low prices on the all-new Blink Mini and Blink indoor and outdoor security cameras. Today's early Black Friday deals on Blink cameras also include a limited-time discount on Beams lighting products. When you purchase a Blink camera, just use promo code BEAMS at checkout, and you can save 20% off on Beams spotlights, motion-activated lights, outdoor string lights, and more.",
    "The Blink security cameras provide security to your home day and night with built-in infrared night vision, customizable motion detection, and live view recording. You'll get alerts sent to your smartphone when motion is detected so you can monitor your home from anywhere. The Blink cameras also feature two-way audio so you can see, hear and speak to people in your home and work with Amazon Alexa for hands-free control.",
    "See more bargains from Amazon with our Amazon Black Friday deals roundup and shop more home security sales with the best cheap home security camera deals that are currently available."
  ],
  "headers": {
    "1": "Black Friday preview: Blink security cameras",
    "2": "More Blink security camera deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Beams spotlights, motion-activated lights, outdoor string lights, and more": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fb%3Fnode%3D23641726011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1261925634765237200-20",
    "security cameras": "https://www.techradar.com/news/best-home-security-camera",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "best cheap home security camera deals": "https://www.techradar.com/deals/the-best-home-security-camera-deals"
  }
}