{
  "source": "https://www.techradar.com/news/zx-spectrum-inventor-sir-clive-sinclair-dead-at-81",
  "title": "ZX Spectrum inventor Sir Clive Sinclair dead at 81",
  "category": "computing",
  "updated": "2021-09-17T13:01:44Z",
  "author": "mayank-sharma",
  "summary": "He invented for the joy of inventing, claims daughter",
  "article": [
    "Sir Clive Sinclair, who has passed away aged 81, will be remembered as one of Britain's most prolific innovators, who has had a profound influence on the software industry in general, and the gaming industry in particular.",
    "Despite battling cancer for over a decade, he was still tinkering with his inventions last week \"because that was what he loved doing\", his daughter Belinda Sinclair told the BBC.",
    "Sinclair, who first became a household name by inventing the Sinclair Executive pocket calculator, is said to have begun inventing gadgets while still at school.",
    "It was however Sinclair’s ZX Spectrum that helped bring affordable personal computing to the masses, being the best-selling British computer (with millions of units sold across the world), until the arrival of the Raspberry Pi.",
    "Sinclair, pretty much like Apple's Steve Jobs, was known for his interest with product design, and his inventions were as much about function as they were about form.",
    "Unlike Jobs however, running a business was not one of Sinclair’s forte.",
    "After his first company folded, he teamed up with former colleague Chris Curry who ran a small electronics company called Science of Cambridge, which was later renamed Sinclair Research.",
    "One of their first products was the ZX80, a small computer that DIYers could buy as kits for £80. It was followed by the ZX81, which managed to eclipsed the success of its predecessor.",
    "Curry soon parted ways with Sinclair, and the two weren’t on the best of terms after the BBC went with Curry’s Acorn for their computer literacy series.",
    "Sinclair followed up the ZX81 with the ZX Spectrum, which, thanks to color display, shattered all sales records, and helped mushroom an entire industry focused on producing software for the computer.",
    "The success of the Spectrum earned Sinclair a knighthood in 1983, at the recommendation of Margaret Thatcher.",
    "Sinclair would go on inventing new gadgets and gizmos, many of which proved to be commercial failures, and none ever reaching close to the popularity of the Spectrum.",
    "However, as someone who invented for the joy of inventing, the failures didn’t prevent Sinclair from tinkering, and he will undoubtedly always be remembered as one of Britain's greatest innovators.",
    "Via BBC"
  ],
  "headers": {
    "4": "Inventor par excellence"
  },
  "links": {
    "Sir Clive Sinclair": "https://en.wikipedia.org/wiki/Clive_Sinclair",
    "ZX Spectrum": "https://en.wikipedia.org/wiki/ZX_Spectrum",
    "Raspberry Pi": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "Chris Curry": "https://en.wikipedia.org/wiki/Christopher_Curry",
    "Sinclair Research": "https://en.wikipedia.org/wiki/Sinclair_Research",
    "ZX80": "https://en.wikipedia.org/wiki/ZX80",
    "ZX81": "https://en.wikipedia.org/wiki/ZX81",
    "weren’t on the best of terms": "https://en.wikipedia.org/wiki/Micro_Men",
    "BBC": "https://www.bbc.com/news/uk-58587521"
  }
}