{
  "source": "https://www.techradar.com/news/how-does-an-air-fryer-work",
  "title": "How does an air fryer work?",
  "category": "appliances",
  "updated": "2021-03-27T10:00:39Z",
  "author": "sophie-bird",
  "summary": "Here’s how you can cook up a feast with very little oil",
  "article": [
    "Do you love french fries (or chips), but are conscious of just how unhealthy these deep fried potato treats can be? You’ve probably heard that the best air fryers can be the solution to indulging in your favorite treat while still keeping your calorie intake down.",
    "However, if you’re not entirely sure how these nifty little kitchen gadgets actually work, then look no further. Here, we’ll explain exactly how air fryers work, what the cooking process involves, and the kind of temperatures you can expect these appliances to reach.",
    "Renowned for speedy cooking times, air fryers can be used to give food a crispy finish - something you’d otherwise need a deep fat fryer to achieve. Unlike traditional fryers, however, air fryers require very little oil, or sometimes no oil at all.",
    "Air fryers have boomed in popularity in recent years, and are now available in a whole range of sizes, specs, and prices, and are often promoted as a healthy alternative to traditional frying methods. Suitable for cooking meats, veggies, frozen foods, and even desserts, air fryers are fast becoming a must-have appliance that more and more people want to try out.",
    "While you’ll be able to cook frozen fried foods in an air fryer, you can also cook pretty much anything you would have previously put in a deep fat fryer. This includes chicken wings, onion rings, and of course, fries. As well as that, these machines are suitable for cooking up seafood, and even desserts such as air-fried apples.",
    "It’s not only air fryers that can cook your food in this way either. If you’d rather have an appliance that can offer several cooking functions in one, consider multi-cookers. As you might guess from the name, multi-cookers can do just about everything, from baking and air-frying to dehydrating fruit and herbs, and cooking rice. The Ninja Foodi Multi-Cooker, for example, can air fry, roast, sear, and pressure-cook to name just a few of its functions. Likewise, the Ninja Foodi MAX Health Grill does a great job of air-frying foods for a healthier alternative.",
    "It’s worth keeping in mind though, that multi-cookers are pretty big, so ensuring that you’ve got space on your countertop is going to be key. And while you are getting several appliances in one, you can expect to pay a fair bit more for multi-cookers too.",
    "Air fryers work by circulating hot air around the food in a very similar way to convection ovens. A heating element inside the air fryer distributes hot air through a fan so that it’s pushed around the food in circular motions. This way of cooking food is actually quicker than traditional methods because the heat is evenly distributed around the food. If you’re cooking frozen fries in an air fryer, you can expect this to take around 15 minutes.",
    "While air-frying might not be quite as fast as deep-frying, you’ll be using significantly less oil, and you won’t need to blot your food onto a paper kitchen towel.",
    "Most air fryers have removable baskets in which you place your food, and these have small holes all around their edges that allow the hot air to reach the food inside. In order for the air to circulate effectively though, you’ll need to make sure you’re not overfilling the basket so that the hot air can reach all sides of the food. Air fryer baskets sit pretty snugly against the sides of the appliance, ensuring that minimal heat is lost during cooking.",
    "Air fryers work by using high heat (around 320-400 degrees Fahrenheit and 160 - 205 degrees centigrade) to cook food. Because of this, you can expect fast cooking times but also a crisp finish to your dishes. The high heat and convection technology mean you won’t need a load of oil to cook your food properly either. You can place frozen food or raw vegetables and meat into the basket of the air fryer, and then close the lid to allow the machine to retain its heat and prevent the room you’re cooking in from becoming hot, rather than your actual food.",
    "These handy appliances also remove the need to preheat food as the high temperatures will cut down cooking time, and without oil, these machines don’t create the odors you’d typically associate with deep fryers. Since you won’t be submerging your food into a vat of oil, you also won’t need to worry about splashing hot oil onto yourself when you take your food out. Once your air fryer has finished cooking, you can simply remove the cooking basket and tip your food out, ready to serve.",
    "If you’re wondering what your food will look like if you use an air fryer, you can still expect crisp, tasty results that you’d get from deep frying, but without the greasiness. Compared to traditional cooking in an oven, air frying will create a more crispy result."
  ],
  "headers": {
    "7": "How do air fryers work?",
    "10": "Do air fryers need oil?"
  },
  "links": {
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Ninja Foodi Multi-Cooker": "https://www.techradar.com/reviews/ninja-foodi-multi-cooker-review",
    "Ninja Foodi MAX Health Grill": "https://www.techradar.com/reviews/ninja-foodi-max-health-grill-and-air-fryer-ag551uk"
  }
}