{
  "source": "https://www.techradar.com/news/10-cross-play-games-to-play-across-ps4-xbox-one-pc-and-nintendo-switch",
  "title": "Best cross-play games to play across console and PC",
  "category": "gaming",
  "updated": "2021-03-31T17:17:27Z",
  "author": "henry-st-leger",
  "summary": "The cross-play games that are truly platform-agnostic",
  "article": [
    "Cross-play games are growing in number by the day, meaning that anyone hoping to play the latest FPS, MMO, or frantic cooking game with their friends online – regardless of the platform they're using – has more avenues to do so than ever. It’s never been easier to play with people all over the world.",
    "Some might not see the fuss around cross-play; after all, don’t you have enough people to play Call of Duty: Warzone with on just your PS4? But something as simple as cross-play can influence which hardware you pick up. After all, if your friends are playing on Xbox and you're playing on PlayStation, you want the option to play with them without having to buy an Xbox too.",
    "And it’s become increasingly clear that we have the technological ability to enable cross-platform games, especially as consoles – like the PS5 and Xbox Series X, or their PS4 and Xbox One predecessors – share increasingly similar processing architecture. More and more developers are opening up their online games so that those who play them can play with their friends, even if they're not all using the same system.",
    "We know some publishers like Ubisoft are looking to make all of their PvP games cross-play, and that trend is only set to continue. So if you’re after cross-play games that allow you to play with your friends, regardless of platforms, here’s our in-depth guide to all the ones you need.",
    "Cross-play is the ability to play an online video game with others across more than one platform – meaning someone playing Fortnite on Nintendo Switch could be on the same server as someone using an Xbox One .",
    "Big-name games that focus on broadly accessible play are the most likely to support cross-play, such as the battle royale game Fortnite, or the building block simulator Minecraft.",
    "However, this is by no means common practice across the board – not helped by the push for exclusive games on most platforms, which prevents a lot of titles from allowing cross-play functionality.",
    "There are a few major players leading the charge here. Microsoft’s Play Anywhere initiative means that many Xbox titles, once bought, can also be played on PC. Given Microsoft develops both the Xbox platform and the Windows operating system, this seems pretty straightforward – and enables cross-play on some (though not all) Play Anywhere games.",
    "We’re seeing growth of cross-play in AAA games between Xbox and PlayStation – and despite the latter lagging behind on this front, progress is being made.",
    "But there is a development cost to including cross-play; hence why you don't see it across the board. If the code for a game isn't written to allow play of this kind, it's not that simple to introduce retrospectively either.",
    "Overwatch developer Wes Yanagi has commented on how \"Cross-play is something that would definitely be compelling for players, and as a player, I would love to see it happen. The truth is that implementing cross-play for Overwatch is more difficult than people realize\" (via GameSpot).",
    "Shawn Layden, the departing chairman of PlayStation Worldwide Studios, was also widely quoted for saying that \"enabling cross-play isn't just about flipping a switch and 'there you go'. It's a very multi-dimensional kind of attribute or feature\" (via Eurogamer).",
    "Even as it becomes more technically possible, platform manufacturers can also be hesitant – cough, Sony, cough – to open up cross-platform play, given they want players to be on their platform and not any others.",
    "But what games actually are cross-play? You can see our guide to the top 10 cross-play games below.",
    "Fortnite (Xbox One, PS4, Switch, PS5, Xbox Series X/S, PC, mobile)",
    "The hugely popular online battle royale game Fortnite is one of the go-to cross-play games for its ease of play and support across consoles, PC, iOS and Android. With Fortnite Chapter 2 having kicked off a brand new island map too, with new mechanics like swimming and motorboats, it's never been a better time to jump in.",
    "Minecraft (Xbox One, Switch, PC, mobile)",
    "Want more crafting than shooting? Minecraft is the bestselling PC game ever, and for good reason: its simple interface and building mechanics allow for a huge amount of player creativity and complexity, whether you're building a floating castle, and underground lava pit, or a giant in-game arcade machine. The world is your blocky oyster.",
    "Rocket League (Xbox One, PS4, Switch, PC)",
    "A quirky soccer remix that sees you knocking around footballs and scoring goals in fast-moving cars – as silly and chaotic as it should be – and one of the earliest games to get such broad cross-play support.",
    "Apex Legends (PS5, PS4, Xbox Series X/S, Xbox One)",
    "Apex Legends is a fantastic battle royale for those with Fortnite fatigue. It also offers players the ability to cross-play across both last-gen and current-gen consoles, so no squad member gets left behind. Well... unless they play on PC or Switch.",
    "Call of Duty: Warzone (PS5, PS4, Xbox Series X/S, Xbox One, PC)",
    "Call of Duty: Warzone is now a standalone battle royale - and a great one at that. Initially released as an add-on for Modern Warfare (2019), Warzone has taken on a life of its own, giving the likes of Fortnite and PUBG a run for their money. Warzone offers cross-play across both last-gen and current-gen consoles plus PC - meaning whatever platform you're playing on, you can join your friends.",
    "Hearthstone (PC, mobile)",
    "A free-to-play card game that expands the lore of World of Warcraft, and has built up a massive following – while the cross-play with mobile allows for far more flexible play across platforms.",
    "PUBG (Xbox One, PS4)",
    "The battle royale game couldn't quite keep up with the success of Fortnite, but it still has a sizeable audience worldwide – and supports cross-play between Xbox One and PS4. You can't cross-play between all platforms, though.",
    "Street Fighter V (PS4, PC)",
    "Limited cross-play, but the 2016 Street Fighter game shows the start of side-scrolling punch-ups moving beyond the restrictions of particular platforms.",
    "Wargroove (Xbox One, Switch, PC)",
    "An indie strategy game inspired by the legacy of Advance Wars – this time in a medieval fantasy setting. More dragons and magic than tanks and airplanes, but the sprite-based warfare is still very much worth your time, whatever the platform.",
    "Dauntless (Xbox One, PS4, PC)",
    "A free-to-play action game published by Epic Games, which you can play either solo or in groups of up to four people. In the vein of Monster Hunter you take on massive 'Behemoths' that have wrecked the land, though these monsters can be handled in maybe 20 minutes.",
    "DC Universe Online (PS4, PC)",
    "An action MMO set in the DC Universe, with the likes of Batman, Flash, the Joker and more populating a comics-inspired world. Why play alone when your friends on PC and PS4 can join you?",
    "No Man's Sky (PS4, Xbox One, PC)",
    "After a languid start, No Man's Sky has continued to go from strength to strength after various sizable updates. The game now supports cross-play, and is also available on Xbox One.",
    "If none of the above interest you – or you just want to know what other cross-play games are out there – here's a quick list of 30 other cross-play games that place nice across two or more platforms.",
    "We know, there are a lot of terms with the word “cross”-something in gaming these days. Cross-play and cross-platform are two that can be easily confused. The difference between cross-play and cross-platform games is, mainly, that a game that supports cross-play is one in which players on different platforms can play together via online multiplayer. So, for example, even though you’re on Xbox and your friend is on PlayStation, you can still play together on Fortnite.",
    "A cross-platform release is slightly different. It just means that a game is available on multiple platforms. A game might be released with Xbox, PlayStation and Switch versions, making it cross-platform, but it won't necessarily include the cross-play support that allows players on these different platforms to play online together.",
    "While we're on the subject of \"cross\" terms. You may have heard this similar term – cross-gen games – thrown around in gaming articles or community forums, particularly with the launch of PS5 and Xbox Series X, but it doesn't really have anything to do with cross-play.",
    "Cross-gen games are those that are released on more than one generation of consoles – like how GTA 5 was released on both PS4/Xbox One and PS3/Xbox 360, or how The Legend of Zelda: Breath of the Wild was released on Wii U as well as Nintendo Switch.",
    "Sometimes cross-gen games do support cross-play; Call of Duty Warzone, for example, offers cross-play across both last-gen and current-gen consoles plus PC, meaning whatever platform you're playing on, you can join your friends."
  ],
  "headers": {
    "4": "What are cross-play games?",
    "7": "Why aren't all games cross-play?",
    "14": "Best cross-play games",
    "38": "Other cross-play games you can play",
    "39": "What’s the difference between cross-play and cross-platform?",
    "41": "What about cross-gen games?"
  },
  "links": {
    "FPS": "https://www.techradar.com/news/best-fps-games",
    "MMO": "https://www.techradar.com/best/best-mmo-games",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Ubisoft are looking to make all of their PvP games cross-play": "https://www.polygon.com/2019/10/30/20940757/ubisoft-cross-play-ps4-xbox-one-pvp-tom-clancys-the-division-2-ghost-recon-breakpoint",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "battle royale game Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "progress is being made": "https://www.techradar.com/news/sony-finally-enables-fortnite-cross-play-for-ps4",
    "GameSpot": "https://www.gamespot.com/articles/overwatch-dev-talks-origins-of-switch-version-tech/1100-6470226/",
    "Eurogamer": "https://www.eurogamer.net/articles/2018-09-29-playstation-chief-on-why-sony-took-so-long-to-enable-console-cross-play",
    "bestselling PC game ever": "https://www.techradar.com/news/the-history-of-minecraft",
    "GTA 5": "https://www.techradar.com/news/gaming/gta-5-review-cvg-gives-its-verdict-1181444",
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review"
  }
}