{
  "source": "https://www.techradar.com/news/oneplus-watch-confirmed-to-launch-alongside-oneplus-9",
  "title": "OnePlus Watch confirmed to launch alongside OnePlus 9 without Wear OS",
  "category": "wearables",
  "updated": "2021-03-18T09:25:41Z",
  "author": "tom-bedford",
  "summary": "Confirming speculation",
  "article": [
    "Update: After confirming the OnePlus Watch is coming - as reported below - company CEO Pete Lau confirmed on the OnePlus forums one extra juicy piece of information - the OnePlus Watch won't run Wear OS.",
    "Wear OS is Google's smartwatch operating system, its wrist-mounted version of Android, though it's rather divisive due to its limited updates and short battery life. Instead, it seems the OnePlus Watch will run different software, but we don't know what yet.",
    "That's another thing to look forward to at the launch. We've kept our original story below as it still stands.",
    "Original story:The OnePlus 9 launch event is on March 23 - something it's been almost impossible to ignore, given how prolifically OnePlus has been teasing aspects of its new phone - and now we know the OnePlus Watch is coming too.",
    "The OnePlus Watch is the company's long-rumored debut smartwatch, which had been teased to be coming soon - now, the company has explicitly confirmed it's coming March 23.",
    "Not much has been confirmed by OnePlus in this newest info-dump, but we've got a new image shown above. This seems to show a large crown for the side of the watch.",
    "It'll also apparently have an 'affordable price point', with a 'fashionable design' and a 'best-in-class user experience'. Those are all OnePlus' words, though, and they're probably a little bias.",
    "The OnePlus 9 launch event is set to take place on March 23 - that's the same day as the Black Shark 4 launch, and it's also rumored to be when an Apple event could take place, so it could be a very busy day.",
    "As well as the OnePlus Watch and OnePlus 9, we're expecting to see a 'Pro' version of the smartphone - this is what OnePlus has been teasing most aggressively.",
    "Check back to TechRadar on the day for all our coverage, analysis, news and reviews on everything OnePlus brings."
  ],
  "headers": {
    "7": "Launch soon"
  },
  "links": {
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "OnePlus forums": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-2852586700010990600&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fget-ready-for-the-oneplus-watch.1399070%2F%3Futm_source%3Dcj%26utm_medium%3Daffiliate%26cjevent%3D69a452a387ca11eb821a00490a18050d%23post-22880059%3A~%3Atext%3DWhen%2520developing%2520the%2520OnePlus%2520Watch%252C%2520we%2Cpeople%2520looking%2520to%2520buy%2520a%2520smartwatch.",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Black Shark 4": "https://www.techradar.com/news/xiaomi-black-shark-4-and-4-pro"
  }
}