{
  "source": "https://www.techradar.com/news/data-in-sport-driving-fan-engagement-and-elite-performance",
  "title": "Data in sport: driving fan engagement and elite performance",
  "category": "computing",
  "updated": "2021-07-13T10:38:29Z",
  "author": "david-ingham",
  "summary": "How data is transforming sport",
  "article": [
    "Data can be considered to be one of the most valuable commodities in today’s world - more so than gold, oil and bitcoin. It underpins most business and performance operations; and the organizations that are able to maximize its use are the most successful.",
    "Success in sport is measurable, most often relating to a team or individual’s performance. Data in sport is now used in two different ways: firstly, to drive this on-field success, identifying areas of performance that have improved or are in need of adjustment, exemplified by British Cycling’s policy of marginal gains. Secondly, data is used to improve the spectator and fan experience. Both examples ultimately enable the club, sport and overall industry to monetize their successes in both these areas rather than just promote a winning team or athlete to a wider audience. One example of this dual importance of data is shown in Formula One, a sport which focuses on getting the most from the available data, both on and off track.",
    "As a sport, Formula One relies on real-time, accurate and secure data. There is often little more than a tenth of a second between two cars’ lap times, which could make the difference firstly between securing pole position and secondly on the grid, and ultimately between winning and failing in the Grand Prix.",
    "The accuracy of the sensors on the cars is paramount; They relay information and queries back to the pits and the factories - often in different countries or even continents from the race location - and then receive data-driven decisions back, all in just a split second. With thousands of these decisions happening every lap, latency is an essential metric. As such, 5G technology and edge computing are combined with cutting edge IoT to drive as much performance advantage as possible, no matter how small.",
    "Motorsport, and particularly its pinnacle in Formula One, may be a more obvious area where data plays a central role in sporting performance but there are very few competitive sports today that do not wholly rely on data to find competitive advantage.",
    "One of the most interesting and perhaps crucial data battlegrounds today is actually away from the pitches, arenas and tracks. As professional sport is increasingly viewed as an entertainment vehicle by broadcasters, fans and governing bodies, organizations are finding new and clever ways to compete and monetize their output through various types of targeted media. These range from linear broadcast to OTT and online-only offerings, as well as exclusive behind-the-scenes access for premium subscribers and other innovative ways of demonstrating value to partners and sponsors. Therefore, retaining and growing an engaged audience is essential.",
    "Of course, the dominant source of money across sport is in television rights. This has been particularly true over the past year or so, when lockdown prevented fans from attending sport in person, which in turn meant the broadcasting of sport was even more of a lifeline for sporting organizations than it was before. However, the longstanding issue for the sports industry, which will no doubt become further complex as technology develops, is the battle for people’s attention and their eyeballs. Digital entertainment is already a highly saturated market with hundreds of platforms streaming content in many forms. The broadcasting of sport therefore is in direct competition with everything from YouTube and Netflix to social media and gaming and all other forms of digital content.",
    "To hold fans’ attention ultimately requires a smarter approach to fan engagement, one that is underpinned by data. Therefore, to go beyond simply growing their fan bases, every sporting organization will have different aims, which will inform the way they analyze their data and tailor their outputs accordingly.",
    "For an elite and expensive sport such as Formula One, accessibility is a growing necessity. Not everyone can afford to go to a race weekend and travel the country or across continents, so reducing the barriers to entry and taking the sport to those who otherwise cannot access it is a priority.",
    "Football, on the other hand, has no such issue. Widely known and widely played, its governing body in England, The Football Association (FA), has a remit that encompasses everything from junior grassroots to the senior international teams. Football has armchair fans who have never kicked a ball, alongside those who still play every week; its audience includes everyone from an 8-year-old girl just starting to play, to a Sunday league coach of several decades. These are all fans of the same sport, yet all have very different needs.",
    "The more important focus should be segmentation. Sporting organizations' have audiences and fans. But each fan may be engaged for a different reason. If you take Formula One as an example again, and in particular a team such as Aston Martin, there will be some who have supported the team through its various iterations to date; there will be some who are longstanding admirers of the Aston Martin brand and have adopted this team on its return to Formula One this season; and there will be some who are followers of Sebastian Vettel and will support him regardless of which car he is racing. The challenge is therefore how to engage with each fan in the way that suits them best - and how, ultimately, to monetize that.",
    "To maximize data’s effectiveness, organizations should only have one priority focus at any one time. The FA, for example, wants to get more people actively playing football as part of its wider objective to capitalize on the 2021 Summer of Football, after a year of cancelled matches, empty stadiums and limited play at the grassroots level due to pandemic restrictions. Its existing data, when properly analyzed with its expert partners, has already helped identify pain points in this process. For example, girls are dropping out of the sport at age 12 or 13. Ultimately, if this issue isn’t fixed there will be a smaller talent pool to trickle through to the senior and professional game. So, improving engagement, securing access to this demographic to get a better understanding of why they stop playing, is helpful to solve this problem.",
    "Making it as easy as possible to get involved is another vital step to retaining these active participants. Digital journeys need to be seamless, as we all expect excellent user experience regardless of the device we use. Using individuals’ data to make the right suggestions at the right time is where a sporting organization can bring value to the fan and ultimately gain value in return. To put this into context, three different Aston Martin fans might be presented with three different online journeys through its website, one centered around the brand and its history, one focused on this season’s car and engineering feats achieved, and one solely detailed on the driver and his achievements. A fan of Sebastian Vettel should not be targeted with classic Aston Martin car content, for example.",
    "Most organizations likely already have more customer and fan data than they know what to do with. What is crucial is to analyze it properly, which in most cases requires finding the right enablement partner with the expertise and resources to identify and segment the different types of fans and help put relevant content and journeys in place.",
    "Sport is more competitive than ever both on and off the field. It is those organizations that make the best use of their data that not only have a far better chase of succeeding in their named sport, but also succeeding in the eyes of the fans that wish to participate in the experience and community that sport can bring. The pandemic has inevitably closed the gap between the digital and in-person experience, and organizations now must continue to bring fans together both at and away from the field, by adopting smart approaches to technology and data."
  ],
  "headers": {
    "2": "Data-driven performance",
    "5": "The fan conundrum",
    "8": "A tailored approach",
    "11": "Priority focus"
  },
  "links": {
    "Data": "https://www.techradar.com/best/best-data-visualization-tools",
    "bitcoin": "https://www.techradar.com/best/mining-rigs",
    "5G": "https://www.techradar.com/best/best-5g-phones",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "streaming": "https://www.techradar.com/news/the-best-free-streaming-software",
    "social media": "https://www.techradar.com/best/best-social-media-management-tools"
  }
}