{
  "source": "https://www.techradar.com/news/amazons-halo-fitness-tracker-can-now-help-you-avoid-throwing-out-your-back",
  "title": "Amazon's Halo fitness tracker can now help you avoid throwing out your back",
  "category": "fitness",
  "updated": "2021-06-03T15:35:39.643Z",
  "author": "cat-ellis",
  "summary": "A virtual personal trainer (sort of)",
  "article": [
    "Amazon has launched a new feature for its Halo fitness tracker, which essentially turns it into a virtual personal trainer. Movement Health analyzes the way you perform basic physical motions and uses AI to suggest ways to improve. The idea is to help build functional strength, so you don't throw your back out or get neck pain performing everyday tasks.",
    "First, the Amazon Halo smartphone app leads you through a series of basic movements (including balances, squats and arm raises), and its computer vision and machine learning technologies check for instabilities in your stability, mobility and posture.",
    "Once the assessment is complete, you'll be given specific details about all of these areas, plus an overall score out of 100. The app will also provide a breakdown of data covering your core, lower body, hips, and shoulders. This whole process should take no more than about 10 minutes.",
    "Next, the app will give you a program of exercises to complete, based on the issues identified during the assessment. These should take around 5-10 minutes to complete, three days a week. Regular assessments with the app should (hopefully) show that you're starting to make progress.",
    "To make sure you're performing the exercises correctly, you'll get spoken guidance from a professional coach and physiotherapist.",
    "The Halo is a very unusual fitness tracker; rather than merely counting steps and monitoring your pulse, it tracks your wellbeing in more novel ways too, such as monitoring your tone of voice for signs of stress or strain.",
    "Other fitness trackers use changes in heart rate or, in the case of the Fitbit Sense, the conductivity of your skin to detect stress levels. The Halo takes a different track, monitoring your vocal tone and word selection throughout the day for 'positivity' and 'energy'.",
    "It's up to you to decide what to do with this information (with no screen, the Halo can't lead you through calming breathing exercises as other devices do), but it can help you get a better understanding of how your mood changes, and which factors might affect it.",
    "Another unusual feature is Body, which requires you to take four photos of yourself in tight clothing, and uses this data to calculate your body fat percentage. It also creates a 3D model of your body, so you can see your physique from all angles (an experience our reviewer didn't particularly enjoy).",
    "So many of the Halo's features use cloud computing rather than on-device processing, there's plenty of potential for new features without the need to upgrade the hardware. It'll be interesting to see what other tools will be added in future updates."
  ],
  "headers": {
    "5": "Halo effect"
  },
  "links": {
    "fitness tracker": "https://www.techradar.com/best/best-fitness-trackers",
    "Amazon Halo": "https://www.techradar.com/reviews/amazon-halo-review",
    "Fitbit Sense": "https://www.techradar.com/reviews/fitbit-sense",
    "our reviewer": "https://www.techradar.com/reviews/amazon-halo-review"
  }
}