{
  "source": "https://www.techradar.com/news/twitters-undo-send-feature-could-be-for-paying-users-only",
  "title": "Twitter's 'undo send' feature could be for paying users only",
  "category": "computing",
  "updated": "2021-03-21T10:30:02Z",
  "author": "david-nield",
  "summary": "As per previous rumors",
  "article": [
    "It looks as though the 'undo send' feature that is apparently being tested behind closed doors at Twitter is going to be a paid-for extra – so you'll only be able to access it if you sign up to be a premium member of the social network.",
    "Well-known tipster Jane Manchun Wong has uncovered a screenshot that lists the undo tweet option as part of a subscription package, though as yet there's no indication of when this Twitter VIP level might actually launch.",
    "The discovery neatly combines two of the rumors that we've heard lately: that Twitter will soon let you bring back a tweet if you're having second thoughts about it, and that it's preparing to put some advanced features behind a paywall.",
    "Users have been clamoring for an edit tweet button for several years now, but it seems as though we're going to have to settle for undoing tweets for the time being: you'll get a few seconds to recall a message before it actually gets posted.",
    "As for what else Twitter might hold back for its paying customers, there has been talk that live video could be one of the features that only subscribers would be able to access in the future, once the new plans launch.",
    "Profile badges, auto responses, social analytics, extra customization options, and the ability to post content at a higher resolution are other features that have been mentioned as perhaps becoming paid-for exclusives in the near future.",
    "There's also speculation that he supercharged Twitter client TweetDeck – which Twitter itself develops – could be used as another incentive to get people to pay up. The idea is, of course, to squeeze more revenue out of the service.",
    "None of this is official or confirmed yet, and a lot of questions remain, but the source is a reliable one. It seems that Twitter does have something in the pipeline, though we'll have to wait and see exactly what a premium subscription looks like."
  ],
  "headers": {},
  "links": {
    "apparently being tested": "https://www.techradar.com/news/twitters-latest-test-isnt-the-edit-feature-youve-been-waiting-for-but-its-close",
    "has uncovered a screenshot": "https://twitter.com/wongmjane/status/1372815977675558915",
    "bring back a tweet": "https://www.techradar.com/news/twitters-latest-test-isnt-the-edit-feature-youve-been-waiting-for-but-its-close",
    "behind a paywall": "https://www.techradar.com/news/twitter-may-roll-out-extra-features-for-paid-users",
    "to recall a message": "https://twitter.com/wongmjane/status/1367704041942179841",
    "has been talk": "https://www.techradar.com/news/twitter-may-launch-a-subscription-platform",
    "have been mentioned": "https://www.techradar.com/news/twitter-may-roll-out-extra-features-for-paid-users",
    "TweetDeck": "https://tweetdeck.twitter.com/"
  }
}