{
  "source": "https://www.techradar.com/news/prime-day-nintendo-switch-lite-deals",
  "title": "You can still save on the Switch Lite in these Prime Day Nintendo Switch deals",
  "category": "gaming",
  "updated": "2021-06-23T09:47:32Z",
  "author": "nick-pino",
  "summary": "Grab these Nintendo Switch Lite deals while you can",
  "article": [
    "If you're on the hunt for a cheap Nintendo Switch Lite then you're in luck as we're still seeing some Nintendo Switch deals lingering from Prime Day. But you'll have to act fast, as they likely won't last much longer.",
    "The handheld-only Switch Lite is perfect for those who aren't fussed about plugging their Switch into the TV and would rather use the device as a handheld instead. The Nintendo Switch Lite is a cheaper and lighter alternative to Nintendo's hybrid console and, thanks to these Nintendo Switch Switch deals, we're seeing it being offered at a discount at Amazon in the US and UK - though, the prices have raised slightly since Prime Day ended. Not in the UK or US? Scroll down for the best Nintendo Switch Lite deals in your region.",
    "Those in the US can pick up a 128GB SanDisk microSDXC card with the purchase of a new Nintendo Switch Lite for $223.80, allowing you to quadruple the amount of usable space for your digital game collection from the off. While those in the UK can pick up a Switch Lite, bundled with Animal Crossing: New Horizons and three months Nintendo Switch Online for just £219.",
    "Check out the best Prime Day Nintendo Switch Lite deals still available right now, below.",
    "No matter where you live, you'll find all the lowest prices for the Nintendo Switch Lite from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "More Nintendo Switch Lite deals",
    "5": "More Amazon Prime Day deals"
  },
  "links": {
    "Nintendo Switch deals": "https://www.techradar.com/news/amazon-prime-day-nintendo-switch-deals-all-the-best-offers-available-now",
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Nintendo Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "$223.80": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNintendo-Switch-Lite-SanDisk-128GB-MicroSDXC%2Fdp%2FB07VHFHHY5%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1936930939453171500-20",
    "Switch Lite": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FNintendo-Switch-Animal-Crossing-Horizons%2Fdp%2FB08NQWZ1LV%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-3335196899487619600-21",
    "Nintendo Switch Online": "https://www.techradar.com/news/nintendo-switch-online-deals-prices-subscription"
  }
}