{
  "source": "https://www.techradar.com/news/new-xiaomi-phone-may-feature-a-4k-screen-but-you-probably-wont-be-able-to-buy-it",
  "title": "New Xiaomi phone may feature a 4K screen, but you probably won't be able to buy it",
  "category": "phones",
  "updated": "2021-10-01T09:21:51Z",
  "author": "james-peckham",
  "summary": "Joining Sony in the land of 4K phones",
  "article": [
    "Smartphone maker Xiaomi may soon be ready to include its first 4K OLED display on a handset, if this new leak is to be believed.",
    "A new handset with a 4K screen was spotted by XDA Developers on the Chinese certification authority's website - that's the TENAA - and it's a big hint that it'll be coming to the China market soon.",
    "According to the listing, the unnamed smartphone features a 6.55-inch 4K OLED display with a resolution of 3840 x 2160. That would equal 672 pixels per inch.",
    "Sony is the only smartphone manufacturer using 4K displays, and its latest handset - the Sony Xperia 1 III - features a 6.5-inch display that equals 643 pixels per inch.",
    "That would mean Xiaomi could take the title of the best resolution available on a smartphone, if this phone is real. Even if the smartphone is real, it's highly likely this phone will be limited to China.",
    "The model number in this listing matches with the new Xiaomi Civi, which was revealed at the end of September and will remain an exclusive phone for the Chinese market.",
    "That handset also features a 6.55-inch display, but there's currently no word on a variant with a 4K display. That model number does heavily suggest this will at least be part of the same family of devices.",
    "There's also the chance that TENAA's information is incorrect, which if true may mean that we won't see a 4K display on a Xiaomi phone anytime soon.",
    "4K screens on smartphones aren't new, it's just not a common technology yet. The Sony Xperia Z5 Premium from 2015 was the first commercially available phone with a 4K display, and Sony's flagship handsets since then have all featured 4K resolutions.",
    "No other manufacturer has deemed 4K a useful spec to include on its phones, and it's an odd thing to see Xiaomi now decide to do. It may be that it's using the Xiaomi Civi line as a way of experimenting with new features.",
    "This may be a way of the company testing demand and seeing how a 4K resolution would work on its smartphones.",
    "If this is a successful endeavor, it may then be a feature it rolls out to other smartphone lines. It's unlikely to debut on the Xiaomi 12, or it may be something we see brought into other handsets like its Mi Mix line."
  ],
  "headers": {
    "8": "Analysis: Should Xiaomi embrace 4K displays?"
  },
  "links": {
    "XDA Developers": "https://www.xda-developers.com/xiaomi-next-flagship-curved-4k-oled-display/",
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "Sony Xperia Z5 Premium": "https://www.techradar.com/reviews/phones/mobile-phones/sony-xperia-z5-premium-1303153/review",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12"
  }
}