{
  "source": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
  "title": "Forza Motorsport car list, news and rumors",
  "category": "gaming",
  "updated": "2021-12-06T17:50:45Z",
  "author": "samuel-tolbert",
  "summary": "Forza Motorsport is gearing up for a grand return",
  "article": [
    "Forza Motorsport is set to be the eighth entry in Microsoft's flagship racing franchise and while we’re still waiting for confirmation of its release date, we're sure it’ll be a real showcase of what the Xbox Series X can do.",
    "Following on from 2017's Forza Motorsport 7, this next game in the series is actually dropping the numbered naming scheme to go simply by Forza Motorsport. That’s because Turn 10 is going for a refreshed, reinvigorated Forza Motorsport experience for its next outing. That approach makes sense since the team stepped back from its standard two-year development cycle after the release of Forza Motorsport 7. With that extra time, they’ve overhauled the ForzaTech engine so that it should deliver a truly next-gen racing experience.",
    "These improvements have meant a longer wait than fans of the series are used to but hopefully it'll be worth it. How much longer we'll be waiting, though, is unclear as there’s currently no release date. Early testing took place in May but we still don’t know when the next round of tests will begin.",
    "Now that Forza Horizon 5 is out in the wild, we’re hoping we’ll see more updates on Forza Motorsport as we go into 2022. While you wait, keep reading for everything we've heard about Forza Motorsport so far.",
    "At the July 2020 Xbox Games Showcase, the game was officially unveiled alongside a quick trailer, which you can take a look at above.",
    "Like the prior Forza Motorsport games, the racing sim is being developed by Turn 10 Studios, one of the many teams that falls under the Xbox Game Studios umbrella.",
    "Surprisingly, the game isn't called Forza Motorsport 8. Forza Motorsport’s creative director Chris Esaki admitted that there’s some confusion regarding the game’s name, and clarified that the eight has been dropped altogether.",
    "“I just wanted to reaffirm that the name of the game is Forza Motorsport,\" said Esaki. \"There’s no sequential eight after the title. It really is an all-new Forza Motorsport experience.”",
    "As it stands, it appears that Forza Motorsport isn't coming to Xbox One consoles. Instead, it's being developed as an exclusive for Xbox Series X, Xbox Series S and PC, which should excite fans who are hoping for a truly next-gen leap for the series.",
    "With the game being targeted for the newest consoles available, we can reasonably expect it to take advantage of some new features, such as ray tracing or even offering a 120fps mode.",
    "Turn 10 revealed that the Forza Feedback Panel will be how players can get their hands on the next Forza Motosport, so the game can be shaped by the community.",
    "Signing up is simple: you need to be at least 18-years-old and agree to a confidentiality statement, which you can opt out of at any time if you decide to leave the program.",
    "The first playtest took place on May 8, and resulted in a “ton of great feedback” from the community, according to Esaki. Esaki said that after the playtest, the team was pretty sure that everyone is “super hyped and energized” by what was shown. He also explained that the reason why only small parts of the game are being tested is so that the team can get “critical feedback” on “focused areas”.",
    "But if you happened to miss out on the first playtest, fear not. Speaking on the Forza Monthly show for May, Forza Motorsport’s creative director Chris Esaki shared that another playtest would take place later in the year, though an update on this is yet to happen.",
    "Unfortunately, a Forza Motorsport release date hasn't been shared but whenever it does arrive, it'll be available on Xbox Series X, Xbox Series S and PC. Factoring in how the pandemic has slowed down game development for many teams and the fact that Forza Horizon 5 only recently released in November 2021, it might be reasonable to expect Forza Motorsport to arrive in sometime 2022 or later.",
    "Like all Xbox first-party games, it'll be available on Xbox Game Pass and Xbox Game Pass Ultimate the day it is released.",
    "Forza Motorsport 7 pulled from sale",
    "Forza Motorsport 7 has been pulled from sale as of September 15, meaning the game and its DLC are no longer be available for purchase and nor is it on Xbox Game Pass. For those hoping this is a sign that the next game’s release is right around the corner, unfortunately that’s not the case.",
    "On Twitter, the official Forza Motorsport account confirmed that the game has been pulled as its third-party licenses (which allow the game to feature real-world cars, tracks and other elements) are set to expire. It’s not too surprising that Microsoft isn’t opting to renew these licenses, though, given Forza Motorsport is coming at some point even if we don’t know exactly when.",
    "Cloud gaming could be key for Xbox One",
    "Forza Motorsport looks set to come to Xbox Series X/S and PC, skipping the Xbox One generation. However, Xbox One owners might not miss out entirely.",
    "In a post to the Xbox Wire blog, Microsoft says that it will be using its cloud streaming technology to serve up games that require the Xbox Series X/S’s power in order to deliver them to the last-gen Xbox One.",
    "“You'll see many games this holiday, including Forza Horizon 5, which will boast DirectX ray-tracing on both Xbox Series X and S, and Battlefield 2042, which will run at 60fps while supporting 128 players on Xbox Series X/S.",
    "“Some games launching next year from our first party studios and partners, such as Starfield, Redfall, and Stalker 2 require the speed, performance, and technology of Xbox Series X/S.",
    "“We're excited to see developers realise their visions in ways that only next-gen hardware will allow them to do. For the millions of people who play on Xbox One consoles today, we are looking forward to sharing more about how we will bring many of these next-gen games, such as Microsoft Flight Simulator, to your console through Xbox Cloud Gaming, just like we do with mobile devices, tablets, and browsers.”",
    "Though Forza Motorsport isn't mentioned explicitly in the blog post, it's possible that it could fall under this umbrella of first-party games.",
    "A 'huge generational leap' over previous games Chris Esaki, the game's creative director, shared details on how Forza Motorsport’s physics have evolved from Forza Motorsport 7. “To put the physics work into perspective… the changes we made from Forza Motorsport 7 till now, is more than the changes we made from [Forza Motorsport] 4 through [Forza Motorsport] 7. It’s basically a huge generational leap coming to the game.” According to Esaki, the tire collision model has also been overhauled. From the first game to Forza Motorsport 7, tires have always had a single point of contact with the track surface, and refreshed at 60 cycles per second (60Hz). In Forza Motorsport, there are now eight points of contact with the track surface, and the engine will refresh at 360 cycles per second (360Hz). That’s a 48x fidelity jump for a single tire collision.",
    "Multiple tire compounds confirmed Multiple tire compounds have been confirmed for Forza Motorsport, a first for the series. Tire compounds such as hard, medium and soft will deepen the gameplay and racing strategy, and Esaki said it will lead to “exciting new gameplay decisions during a race.” Weather warning Environmental factors will also need to be taken into account in Forza Motorsport, and have the potential to make each lap feel different, according to Esaki.",
    "“We’re working on things like track temperature and how it affects things like grip and tyre pressure, and tyre wear. In addition, you can imagine how changes in the time of day and weather, along with the new tyre wear modelling and all of the new compounds lead to a much deeper driving and racing experience.”",
    "What kind of cars can we expect to see in Forza Motorsport, and more importantly, which vehicle will grace the game's cover? While that's hard for us to guess with much accuracy, we can at least get a sense of how many cars will be in the game, based on Forza Motorsport 7's total.",
    "Forza Motorsport 7 featured 700 cars and 32 tracks, which is an impressive amount. While there's no guarantee the next game will beat this figure, mostly owing to the fact the cars will likely have to be remodelled or upgraded for the next-gen systems, we hope Forza Motorsport will at least come close to this figure."
  ],
  "headers": {},
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Forza Motorsport 7": "https://www.techradar.com/news/forza-motorsport-7-will-be-removed-from-sale-later-this-year",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "120fps mode": "https://www.windowscentral.com/list-xbox-series-x-and-s-games-120-fps-supporthttps://www.techradar.com/news/ps5-and-xbox-series-x-games-with-120fps-support",
    "Forza Feedback Panel": "https://www.surveygizmo.com/s3/5751834/T10-Feedback-Program",
    "Forza Monthly show for May": "https://www.youtube.com/watch?v=oxJaXe18WaY",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Twitter": "https://twitter.com/ForzaMotorsport/status/1420792916742590464?s=20",
    "says": "https://www.techradar.com/news/starfield-will-come-to-xbox-one-but-not-how-you-might-think"
  }
}