{
  "source": "https://www.techradar.com/news/dedicated-server-managed-vs-unmanaged",
  "title": "Dedicated server: managed vs unmanaged",
  "category": "computing",
  "updated": "2021-03-17T20:30:00Z",
  "author": "shashank-sharma",
  "summary": "Do you need a safety net or are you experienced enough to forge ahead on your own?",
  "article": [
    "A dedicated hosting plan ensures high availability, scalability and performance. These advantages however come at quite a premium. This is why a Virtual Private Server (VPS) remains a popular stepping stone for businesses and organizations that have outgrown shared hosting, but can’t afford the sticker price of dedicated hosting plans.",
    "But if you want complete control over the server, with the freedom to use it however you want, a dedicated hosting server is your only recourse. It comes with additional advantages such as security as you’re the only client on the server and can deploy additional software such as anti-malware, antivirus, firewalls, etc., to safeguard your server and data. These are in addition to DDoS and other security measures offered by the hosting provider.",
    "At its most basic, a server is a collection of physical components such as motherboard, processor, RAM, storage drivers, etc. A server however is more than the sum of its physical parts. Your server will have an operating system, on top of which you install or deploy additional software or applications. The additional applications can include a control panel to manage different applications and services, and additional applications such as a Content Management System (CMS), an email service, database, etc.",
    "Most web hosting providers offer the choice of managed or unmanaged dedicated servers. There’s a considerable price difference between the two. But you shouldn’t let that be the only factor in deciding the solution you ultimately settle on as you can well lose more than just money with the wrong plan.",
    "When you purchase a dedicated server, you also have to choose whether you want to administer it yourself, or would rather leave it in the hands of the hosting provider. Should you opt for the latter, you can also tap the hosting provider for assistance and troubleshooting support. This is known as managed hosting, where the hosting provider takes on the job of installing software, deploying updates, performing backups, and myriad other tasks that must be routinely performed to keep the server running in top shape.",
    "The managed hosting plans also include technical support and you can also tap the wisdom of the hosting provider to make suitable changes to your server, or its configuration to best suit your needs.",
    "Pros of managed hosting",
    "1. Ease of use",
    "Managed hosting provides for an easier experience as the maintenance of the server and all running applications is handled by the hosting provider.",
    "2. Maintenance and upkeep",
    "The hosting provider takes care of backup, security and myriad other tasks. Apart from installing anti-malware, anti-virus software, and performing routine backups, most hosting providers will also offer to recover your site or data from the backup, should you run into problems.",
    "The different hosting providers differ quite a bit on the range of services they offer. For instance, a hosting provider may include two-three malware removals in the managed hosting plan, and ask you to pay for additional such clean-up and data restoration operations.",
    "3. Support",
    "You can easily tap the hosting provider for troubleshooting, support or even advice on how to best utilize your server.",
    "Cons",
    "1. Less management control",
    "As the hosting provider is tasked with performing backups and deploying security measures, you have less, or no say, in how these crucial tasks are performed. For instance, if the hosting provider aims to perform backups every week, but you want these to be done daily, there’s usually no way to bridge the difference.",
    "2. Less deployment flexibility",
    "Some hosting providers also place restrictions on what applications you can deploy on the server, or the plugins you can add on top, or even certain configuration options.",
    "Such plans, in contrast, are cheaper because the responsibility of managing the operating system and all applications, right from installation, configuration, falls on you alone. You must have the requisite system administrator skills, to be able to deploy updates, perform backups, and otherwise take all measures to keep your server and data safe and secure.",
    "Some hosting providers offer a mixed solution, wherein the initial deployment of the server is handled by the hosting provider before relinquishing control to the client. Even with the unmanaged hosting plans, you can still tap the hosting provider for troubleshooting, but this comes at a hefty cost.",
    "Pros of an unmanaged dedicated server",
    "1. Complete control",
    "The hosting provider leaves you to administer the server per your needs. It’s for you to decide everything from the choice of operating system, to the applications and services deployed on the server.",
    "2. Cost",
    "Such plans are cheaper in comparison to Managed hosting, but you must have the requisite skills or have a team at hand to manage and maintain the server and troubleshoot should the need arise.",
    "Cons of unmanaged dedicated server",
    "1. More administration overhead",
    "All aspects of the maintenance of the server and applications are in your hands, so you must maintain constant vigil to protect and safeguard your server and data from attackers, snoopers, and troublemakers.",
    "If you aren’t a deft hand at tweaking configuration files from the command-line, or prefer the comfort of control panels such as cPanel, Plesk, etc., you will also have to install them yourself.",
    "Purchasing a dedicated server is no different than making any other investment. It’s not a decision you should arrive at lightly or in haste. As both managed and unmanaged hosting have their own merits, you should carefully weigh their differences, and compare it with your skills and strengths as well as the needs of your business.",
    "An honest assessment of the following questions should help you get a sense of which hosting plan might serve you best.",
    "If you are unsure about any of these, a managed hosting solution although expensive will give more peace of mind.",
    "You might also want to check out our many hosting guides:"
  ],
  "headers": {
    "4": "Managed hosting",
    "19": "Unmanaged hosting",
    "30": "Which should you choose"
  },
  "links": {
    "VPS": "https://www.techradar.com/news/best-vps-hosting",
    "shared hosting": "https://www.techradar.com/web-hosting/best-shared-web-hosting",
    "dedicated hosting server": "https://www.techradar.com/news/best-dedicated-server-hosting-providers",
    "anti-malware": "https://www.techradar.com/best/best-malware-removal",
    "antivirus": "https://www.techradar.com/best/best-antivirus",
    "firewalls": "https://www.techradar.com/best/firewall",
    "CMS": "https://www.techradar.com/best/cms",
    "email service": "https://www.techradar.com/news/best-email-provider",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites"
  }
}