{
  "source": "https://www.techradar.com/news/there-will-probably-be-fewer-products-on-sale-this-black-friday-heres-what-you-should-do-about-it",
  "title": "There will probably be fewer products on sale this Black Friday - here's what you should do about it",
  "category": "computing",
  "updated": "2021-11-21T12:18:38Z",
  "author": "joel-khalili",
  "summary": "Consumers may ‘lose the game of discount chicken’ this Black Friday, Salesforce warns",
  "article": [
    "It’s likely there will be fewer total products on sale this Black Friday (November 26), making holiday shopping all the more difficult for consumers, new data suggests.",
    "According to research from software giant Salesforce, an unfortunate cocktail of factors (including the global chip shortage and supply chain disruption) has created “economic and logistical headwinds” that are preventing retailers from offering as wide a range of products and discounts.",
    "The company’s figures, drawn from its digital commerce platform, suggest global retail catalogs shrunk by 4% between November 1 and November 15. In the same period last year, catalogs grew by 34% in the run-up to the big shopping weekend.",
    "It also appears retailers have pulled back on early deals, with global discount rates down 10% compared to 2020. As a result, the average selling price (ASP) is up 11%, which suggests consumers are likely to end up paying more for items this year.",
    "However, despite the smaller product pool and less generous discounts, ecommerce sales are up 18% in the US year-on-year and up 8% worldwide, compared to at this stage last year.",
    "Salesforce suggests this is a reflection of an increase in the popularity of online shopping spilling over from the pandemic, as well as the fact many people are choosing to do their holiday shopping earlier this year.",
    "“With inflation and supply chain issues top of mind for shoppers this year, we’re seeing an increased focus on early holiday shopping,” said Rob Garf, VP and GMT of Retail at Salesforce.",
    "“Consumers may finally lose the game of discount chicken this holiday - with discounts down by 5% from last season. Any discount over 25% is a good one based on what we’re seeing this year, so consumers should act early.”",
    "To ensure you don’t miss out on savings this Black Friday and Cyber Monday, then, it could be sensible to take advantage of early deals as opposed to waiting for the big weekend itself, even if the discounts aren’t quite as spectacular as usual.",
    "We’re now seeing early offers go live from all the major online retailers and the volume of deals is bound to skyrocket next week, so keep your eyes peeled."
  ],
  "headers": {
    "4": "Early Black Friday shopping"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "research": "https://www.salesforce.com/news/stories/holiday-shopping-statistics-trends-2021/",
    "digital commerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "ecommerce": "https://www.techradar.com/news/best-ecommerce-hosting",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}