{
  "source": "https://www.techradar.com/news/the-latest-board-from-raspberry-pi-costs-just-dollar4",
  "title": "The latest board from Raspberry Pi costs just $4",
  "category": "computing",
  "updated": "2021-01-21T11:32:57Z",
  "author": "mayank-sharma",
  "summary": "Powered by Raspberry Pi’s own custom silicon",
  "article": [
    "The Raspberry Pi foundation has just launched their first microcontroller board - and it costs less than a fast food takeaway lunch.",
    "At $4, the Raspberry Pi Pico is an affordable dual-core microcontroller that takes on the likes of the Arduino. While it can’t run a full operating system, the Pico can be easily programmed to control sensors, motors, and other electronics.",
    "“Whether you’re looking for a standalone board for deep-embedded development or a companion to your Raspberry Pi computer, or you’re taking your first steps with a microcontroller, this is the board for you,” shared James Adams, the Chief Operating Officer at Raspberry Pi.",
    "In another first, the Pico is powered by Raspberry Pi’s own custom silicon, the RP2040 Systems on a Chip (SoC). The RP2040 features an Arm Cortex M0+ processor that can be made to run at up to 133 Hz, together with 264K of SRAM and 2MB of onboard storage.",
    "Talking to our friends over at Tom’s Hardware about their foray into making their own SoC, Adams said “we couldn’t see a way to offer something differentiated in the microcontroller space using existing third-party silicon, so we set out to build our own”.",
    "They began working on it in 2016 and had the first iteration ready in 2018, which was then worked upon and improved into the final product that’s now included in the Pico.",
    "Remember however that the Pico is a microcontroller and its use case is different from that of the Raspberry Pi or even the $5 Raspberry Pi Zero.",
    "You can purchase the Pico from the Raspberry Pi store, and the device is also bundled along with the latest issue of HackSpace magazine, owned by the Raspberry Pi Foundation, which also includes several tutorials and guides to orient you with the device.",
    "Via: Tom’s Hardware"
  ],
  "headers": {
    "3": "Raspberry Pi Silicon"
  },
  "links": {
    "Raspberry Pi": "https://www.techradar.com/news/computing/pc/raspberry-pi-everything-you-need-to-know-1069241",
    "Raspberry Pi Pico": "https://www.raspberrypi.org/blog/raspberry-pi-silicon-pico-now-on-sale/",
    "Raspberry Pi computer": "https://www.techradar.com/reviews/raspberry-pi-4-model-b",
    "Tom’s Hardware": "https://www.tomshardware.com/reviews/raspberry-pi-pico-review"
  }
}