{
  "source": "https://www.techradar.com/news/one-of-netflixs-best-shows-is-making-a-surprise-return",
  "title": "One of Netflix's best shows is making a surprise return",
  "category": "entertainment",
  "updated": "2021-04-27T09:18:42Z",
  "author": "henry-st-leger",
  "summary": "Master of None season 3 is back – with a difference",
  "article": [
    "Master of None is back, with a new trailer showing off an unexpected season 3 of the hit series, due to land on Netflix on May 23.",
    "The trailer is most notable for not featuring Aziz Ansari, co-creator and lead actor in the first two seasons of the series. He's still credited as a writer alongside Lena Waithe, and as the sole director, though it appears this season – titled Master of None: Moments in Love – will focus on Denise, previously only a supporting character in the show.",
    "As ever, love is big theme for the series, exploring the romance between Denise (played by Lena Waithe) and a new character played by Naomi Ackie (of Rise of Skywalker fame).",
    "You can watch the trailer below.",
    "Netflix states that \"this new season is a modern love story that intimately illustrates the ups and downs of marriage, struggles with fertility, and personal growth both together and apart. Fleeting romantic highs meet crushing personal losses while existential questions of love and living are raised.",
    "\"Co-created by Ansari and Emmy Award winner Alan Yang, Season 3 delivers an evolution of the series that remains tethered to previous seasons while breaking new storytelling ground of its own.\"",
    "All episodes will be landing at once for the usual Netflix binge, though it's a somewhat surprising announcement given the amount of time that has elapsed since the last season.",
    "Master of None debuted as a Netflix Original in 2015, going on to release a second second in 2017. After that, Ansari gave the impression that a third season would be a while off yet, saying \"Let me relax for a second. Let me just live my life. Forget season three of Master of None, I'm also doing season 34 of Aziz Ansari!\" (via NPR).",
    "Master of None season 2 ended on something of a cliffhanger, with a hazy conclusion of the romance between Dev (Aziz Ansari) and Francesca (Alessandra Mastronardi) – though it looks like we're unlikely to get any additional closure there.",
    "Ansari was also caught up in some controversy after accusations of sexual misconduct – something you can read about in more detail here, and which he went on to address in a 2019 standup tour. So that may well have been a consideration behind him fading into the background for the next series – though it's unclear at this point whether he might appear onscreen in a small capacity."
  ],
  "headers": {
    "6": "Out of the spotlight"
  },
  "links": {
    "Rise of Skywalker": "https://www.techradar.com/reviews/star-wars-the-rise-of-skywalker",
    "NPR": "https://www.npr.org/2017/05/24/529815176/aziz-ansari-on-master-of-none-and-how-his-parents-feel-about-acting?t=1619513327850",
    "here": "https://www.npr.org/2018/01/16/578422491/the-fine-line-between-a-bad-date-and-sexual-assault-two-views-on-aziz-ansari",
    "went on to address in a 2019 standup tour": "https://www.vox.com/2019/2/13/18223535/aziz-ansari-sexual-misconduct-allegation-me-too"
  }
}