{
  "source": "https://www.techradar.com/news/the-next-james-bond-10-stars-who-could-replace-daniel-craig",
  "title": "The next James Bond: 10 stars who could take over from Daniel Craig",
  "category": "entertainment",
  "updated": "2021-09-29T13:36:47Z",
  "author": "richard-edwards",
  "summary": "Who's about to get a license to kill?",
  "article": [
    "It’s a long time since we’ve had to speculate in earnest about the identity of the next James Bond.",
    "Of the six actors to have played 007 in the official series, nobody’s done it longer than Daniel Craig. In fact, when he hangs up his Walther PPK after the long-delayed No Time to Die (read our spoiler-free review here), it’ll be 15 years since he first wore the tuxedo in Casino Royale. And while Sean Connery and Roger Moore both headlined more movies, the Craig era will go down as one of the finest, with both Casino Royale and Skyfall deserving to be ranked alongside the 59-year-old franchise’s best. Which means that whoever gets the gig as the next James Bond actor has some big shoes to fill.",
    "In keeping with tradition when a 007 star departs, the rumor mill is now in overdrive, as fans and media outlets around the world try to second guess where producers Barbara Broccoli and Michael G Wilson – the keepers of the Bond flame – will go next. Will they go younger, with a Jason Bourne-style action hero as they did for Casino Royale? Or will they be looking for a star who can quip with the best of them, in the tradition of Roger Moore and Pierce Brosnan?",
    "Historically speaking, if you’re a male actor with a decent screen profile, who can pull off a passable English accent, and are aged between 30 and 50, chances are your name will be mentioned in conversations about the next James Bond. And this time out, we can expect the talent search to be much more diverse than in the past, with actors of color and women now coming into the mix – though, going on Broccoli’s comments last year, a female Bond still seems unlikely.",
    "“[James Bond] can be of any color, but he is male,” producer Barbara Broccoli told Variety in 2020. “I believe we should be creating new characters for women – strong female characters. I’m not particularly interested in taking a male character and having a woman play it. I think women are far more interesting than that.”",
    "So with Daniel Craig’s final mission for queen and country landing in UK theaters on September 30 (October 8 in the US), we’ve picked out 10 of the leading candidates to be the next James Bond.",
    "The current favorite with the bookmakers has long been held up as a potential successor to Daniel Craig, and it’s easy to see why – Hardy looks good in a suit, has charisma to spare, and has a big Hollywood profile. But, there’s little on his resumé suggests he’d want to be the next James Bond – he’s an actor with a history of idiosyncratic career choices, with even his blockbuster roles (Eddie Brock in Venom, Eames in Inception, Bane in The Dark Knight Rises) leaning towards the eccentric. In fact, it’s hard to imagine him playing a role as by-the-book as 007.",
    "Having narrowly missed out to Daniel Craig ahead of Casino Royale, the 38-year-old Man of Steel star remains a leading contender to be the next James Bond. He’s already proved he looks the part as a secret agent in both The Man from UNCLE and Mission: Impossible: Fallout, and told GQ in 2020 that he would “absolutely jump at the opportunity”. But with The Witcher a major commitment – and the possibility of playing Superman again still open – will he have the time?",
    "Like Hardy, Elba is another star now associated with 007 by default. And having taken roles in the Marvel Cinematic Universe (the Thor movies), the DC Extended Universe (The Suicide Squad), the Alien franchise (Prometheus) and Pacific Rim, his blockbuster credentials are beyond reproach. While he’d undoubtedly be brilliant in the role, however, the big question mark over Elba is his age. At 49, he’s just four years younger than Daniel Craig, and you have to wonder if the producers will want to commit to a leading man who’d be in his mid-to-late fifties by the time his third movie came around.",
    "If we were writing this when No Time to Die was originally slated to come out in March 2020, the question on everybody’s lips would have been, “Regé-Jean who?” Since then, however, his starring role in Bridgerton (Netflix’s biggest show ever) has turned him into one of the hottest talents on the planet – and a frontrunner to play the next James Bond. He’s now signed up to play the lead role in a movie reboot of Leslie Charteris’s spy thriller The Saint, but don’t expect that to stand in the way of Bond if Broccoli and Wilson decide he’s their man. Besides, Roger Moore played the Saint before his long-running stint as 007, so there is a precedent.",
    "When conversations start about the identity of the next James Bond, there’s usually a few British network TV stars in the mix. The leading contender this time out (in the eyes of the bookmakers, at least) is James Norton, who’s become a big name in the UK thanks to Happy Valley, Grantchester, McMafia and War & Peace. Despite a leading role in HBO’s The Nevers, however, his limited Hollywood profile may count against him – something that could also be said of Poldark’s Aidan Turner.",
    "Since his breakout role in Crazy Rich Asians, Golding’s career has only headed in one direction – up. With roles in rom-com Last Christmas and GI Joe spin-off Snake Eyes, he’s clearly on Hollywood’s radar, and – crucially – also seems to be interested in the role. “It is the opportunity for change,” he told the Guardian. “Be it female, male, bi, gay, straight, trans, Asian, black, Latina… Now is the time in history where it doesn’t matter. That is the most amazing feeling. So the possibilities are endless.” His stint as a presenter on the BBC’s The Travel Show should also be good preparation for all that globetrotting.",
    "Another big name who seems to fit the 007 like a glove – Hiddleston even went to the same school, though Bond was expelled from Eton College for his misdemeanours. The Loki star proved his espionage potential in brilliant BBC drama The Night Manager, and would undoubtedly be a bankable lead – but, after a decade in the Marvel Cinematic Universe (and Loki still a going concern), would he really want to tie himself to another mega-franchise? Marvel co-star Benedict Cumberbatch may have similar issues with the role.",
    "He may not have made it past the third season of Game of Thrones, but the former King in the North hasn’t let the events of the Red Wedding stand in his way. He’s about to make his blockbuster debut as a god-like superhuman in Marvel’s Eternals, but his big 007 calling card is undoubtedly his role in hit 2018 Brit drama Bodyguard (created by Line of Duty’s Jed Mercurio). If the producers want their next James Bond to punctuate the action with scenes of intense brooding, Madden could be their guy.",
    "A slightly leftfield option for the next James Bond, admittedly, but Tom Ellis does have some time on his hands now that Lucifer has finally, definitively come to an end on Netflix. Playing the Devil in LA across six seasons, Ellis proved he has suaveness in spades, and if the producers unexpectedly decide they want to ramp up the Roger Moore-style archness, we can’t think of a better candidate.",
    "She’s not necessarily the next James Bond, but it seems Captain Marvel star Lynch will be the next 007 – her No Time to Die character Nomi has reportedly inherited the codename from the exiled Bond. We’ve already seen from the trailers that she’s every bit her predecessor’s equal, so – while Barbara Broccoli’s comments suggest there won’t be a female Bond – there’s no reason Nomi couldn’t front a spin-off movie set in the same universe as the Bond franchise. In fact, the main thing counting against her is that other double-0 agents in Bond movies tend to have a very low life-expectancy.",
    "No Time to Die is in theaters from September 30 in the UK and October 8 in the US."
  ],
  "headers": {
    "6": "Tom Hardy",
    "7": "Henry Cavill",
    "8": "Idris Elba",
    "9": "Regé-Jean Page",
    "10": "James Norton",
    "11": "Henry Golding",
    "12": "Tom Hiddleston",
    "13": "Richard Madden",
    "14": "Tom Ellis",
    "15": "Lashana Lynch"
  },
  "links": {
    "our spoiler-free review here": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "Variety": "https://variety.com/2020/film/features/james-bond-no-time-to-die-barbara-broccoli-michael-wilson-1203466601/",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/henry-cavill-enola-holmes",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "DC Extended Universe": "https://www.techradar.com/news/dc-extended-universe-movies-ranked",
    "Bridgerton": "https://www.techradar.com/news/bridgerton-season-2-first-look-and-what-we-know",
    "The Saint": "https://www.hollywoodreporter.com/movies/movie-news/rege-jean-page-the-saint-movie-1234988363/",
    "The Nevers": "https://www.techradar.com/news/how-to-watch-the-nevers-online-stream-the-new-hbo-max-series-today",
    "Guardian": "https://www.hollywoodreporter.com/movies/movie-news/rege-jean-page-the-saint-movie-1234988363/",
    "Loki": "https://www.techradar.com/news/loki-season-2",
    "Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know"
  }
}