{
  "source": "https://www.techradar.com/news/beats-deals-studio-3-now-available-for-dollar19999",
  "title": "Beats deals: Studio 3 now available for $199.99",
  "category": "audio-visual",
  "updated": "2021-08-17T14:19:08Z",
  "author": "tabitha-baker",
  "summary": "Amazon gets close to a record low price",
  "article": [
    "Beats deals on premium headphones are becoming more and more common as these cups age on the shelves. However, Amazon's discounts have gone a step further this week, offering a sales price on the Beats Studio 3 that sits within 99 cents of the previous record low.",
    "You can pick up the wireless noise cancelling headphones for just $199.95 right now, a $90 saving over the usual $289 cost. Of course, these headphones launched for much more than that back in the day - $349.99 to be exact - however, since then, we've come to recognize a new average price.",
    "That said, savings running this deep don't come around too often. The last time we saw this particular discount was back in June, with prices hovering around the $211 mark since then. So far this year, these Beats deals have only been available a handful of times and generally tend to expire after a few days. If you missed out on previous sales, then we wouldn't recommend waiting too long to jump on this latest offer.",
    "Not in the US? Scroll down for more Beats headphone deals in your region.",
    "There's such a range of Beats headphones currently available that those looking for a cheaper set, or one with a few more up to date features can find plenty more discounts around the web. We're rounding up all the latest offers just below.",
    "We're rounding up plenty more noise cancelling headphone deals right now, but you can also check out all the latest Bose sales and Sony WH-1000XM4 deals for more prices on some of the best cups on the market."
  ],
  "headers": {
    "4": "More Beats deals"
  },
  "links": {
    "for just $199.95 right now": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08528ZCNX%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1231233395952696000-20",
    "Beats headphone deals": "https://www.techradar.com/news/audio/portable-audio/cheap-beats-by-dre-deals-1302753",
    "noise cancelling headphone deals": "https://www.techradar.com/deals/cheap-noise-canceling-headphone-deals",
    "Bose sales": "https://www.techradar.com/deals/the-best-cheap-bose-headphone-deals",
    "Sony WH-1000XM4 deals": "https://www.techradar.com/deals/best-sony-wh-1000xm4-sales-deals-and-prices"
  }
}