{
  "source": "https://www.techradar.com/news/microsoft-teams-just-fixed-one-of-its-smallest-but-most-annoying-flaws",
  "title": "Microsoft Teams just fixed one of its smallest, but most annoying flaws",
  "category": "computing",
  "updated": "2021-08-03T22:02:25Z",
  "author": "anthony-spadafora",
  "summary": "Turning on recordings in Teams will soon also start live transcriptions",
  "article": [
    "Microsoft is currently working on a new feature for Teams that will make it possible for users to easily go back and review what happened during their meetings when using its video conferencing software.",
    "At the beginning of this year, the software giant added a transcription feature to its online collaboration platform so that users could devote their entire attention to meetings. This AI-powered feature combines voice analysis, meeting invitations, attendee names and attachments to discern which meeting participants are speaking and when.",
    "Earlier this summer, Microsoft also added the ability to automatically record meetings in Teams so that users could go back and review meetings in their entirety in case they missed anything.",
    "Now the company is taking things a step further by combining the two features so that Teams users will have a full transcript as well as a full recording of all of their meetings so they won't miss anything.",
    "According to a new post on the Microsoft 365 Roadmap, the company is working on a new feature that will start live transcription at the same time as recordings in Teams.",
    "In order for this feature to work though, both recording and policy settings must be enabled but once this is done, turning on recording will also start live transcription.",
    "While this feature is currently in development, Microsoft says that it should begin rolling out to organizations worldwide using Teams later this month.",
    "Having both a recording and a live transcription of every meeting held in Teams could come in handy for employees that miss a meeting as well as for those who may have missed an important point brought up in a video call with their team members."
  ],
  "headers": {
    "4": "Recordings and live transcription"
  },
  "links": {
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "transcription feature": "https://www.techradar.com/news/microsoft-teams-update-means-youll-never-need-to-take-notes-again",
    "online collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "automatically record meetings in Teams": "https://www.techradar.com/news/microsoft-teams-update-will-mean-theres-always-a-backup-plan",
    "new post": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-8260046781758258000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3DIn%2520development%252CNew%2520Last%2520Week",
    "Microsoft 365 Roadmap": "https://www.techradar.com/news/microsoft-teams-can-now-be-used-for-work-and-play-simultaneously"
  }
}