{
  "source": "https://www.techradar.com/news/how-to-watch-a-discovery-of-witches-season-2-online-stream-new-episodes-anywhere-now",
  "title": "How to watch A Discovery of Witches season 2 online: stream new episodes anywhere now",
  "category": "computing",
  "updated": "2021-01-13T08:54:49Z",
  "author": "kevin-lynch",
  "summary": "TV adaptation of Deborah Harkness’ All Souls trilogy continues",
  "article": [
    "One of the best-loved TV shows around returns after a two-year absence this week - and the first potion they'll be brewing is a resolution to thefirst season's cliffhanger ending. Based on Deborah Harkness’ wildly popular All Souls trilogy, the show is set in a world where witches, vampires and daemons secretly live and work alongside humans, hidden in plain sight. Read on for your full guide to watching A Discovery of Witches season 2 online and stream every new episode as soon as it's released in 2021.",
    "Season 2 is set to revolve around the plot lines of second book in the series, Shadow of Night. The TV adaptation once again stars Matthew Goode and Teresa Palmer, who continue their vampire/witch love story - only this time round, it looks like they'll be thrust back into the past all the way back to Elizabethan London.",
    "The trip looks to take the characters into a darker place, with Matthew struggling with blood rage, a vampire disease hinted at in the previous series. Hiding away the ominous forces of the Congregation, the pair must find a powerful witch teacher to help Diana control her magic and search for the elusive Book of Life.",
    "Joining the cast for this second run is Steven Cree (Outlander), Sheila Hancock (Doctor Who) and James Purefoy (The Following), alongside familiar first series cast members Owen Teale, Alex Kingston and Lindsay Duncan.",
    "The first series proved a massive hit for Sky One in the UK, becoming the channel's most popular drama of 2018, and having had such a long break from the screen, there's huge anticipation for this second run.",
    "Follow our guide below as we explain how to watch A Discovery Of Witches season 2 online and stream every new episode of the new series - wherever you are on earth right now.",
    "For those abroad when A Discovery Of Witches season 2 lands, you’ll be unable to watch the show on your usual home streaming service, due to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream A Discovery of Witches season 2 online anywhere. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch A Discovery Of Witches season 2 anywhere"
  ],
  "headers": {
    "6": "How to watch A Discovery Of Witches online from outside your country",
    "9": "How to watch A Discovery Of Witches season 2 Australia release date and streaming"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}