{
  "source": "https://www.techradar.com/news/us-cracks-down-on-sale-of-hacking-tools-to-russia-and-china",
  "title": "US cracks down on sale of hacking tools to Russia and China",
  "category": "computing",
  "updated": "2021-10-21T11:20:30Z",
  "author": "mayank-sharma",
  "summary": "New rule won’t hinder collaboration on cybersecurity research, asserts US",
  "article": [
    "The US Department of Commerce announced today that it will begin exerting more control over the sale of cybersecurity tools and surveillance software to countries that might pose a national security threat.",
    "The Department’s Bureau of Industry and Security (BIS) issued an interim rule with the intention of reigning in the “export, re-export or transfer” of certain items that it believes can be used for malicious cyber activities.",
    "“These items warrant controls because these tools could be used for surveillance, espionage, or other actions that disrupt, deny or degrade the network or devices on it,” argues the BIS in the rule.",
    "The SiliconANGLE reports that the department believes such tools can lead to human rights abuses when in the hands of authoritarian governments.",
    "The new rule will take effect in 90 days, and would cover software such as Pegasus, a spyware developed by the Israeli NSO Group, that was recently exposed as being used by certain governments to keep tabs on activists, and journalists.",
    "With the new rule, any sale of such software and equipment, to countries including China, and Russia, would require a license from the BIS, which will only grant one after thoroughly vetting the end user.",
    "The Commerce department reportedly argues that the rule has been carefully worded so as to not curb US-based cybersecurity researchers from collaborating with their peers around the world.",
    "“The Commerce Department’s interim final rule imposing export controls on certain cybersecurity items is an appropriately tailored approach that protects America’s national security against malicious cyber actors while ensuring legitimate cybersecurity activities,” clarified Secretary of Commerce Gina Raimondo through a statement.",
    "Via SiliconANGLE"
  ],
  "headers": {
    "4": "Not stifling research"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "interim rule": "https://public-inspection.federalregister.gov/2021-22774.pdf",
    "Pegasus": "https://www.techradar.com/news/pegasus-spyware-spied-on-mobile-users-around-the-world",
    "SiliconANGLE": "https://siliconangle.com/2021/10/20/us-cracks-export-hacking-tools-countries-concern/"
  }
}