{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-2-may-arrive-sooner-than-we-thought",
  "title": "Samsung Galaxy Z Fold 3 and Galaxy Z Flip 2 may arrive sooner than we thought",
  "category": "phones",
  "updated": "2021-04-12T08:45:07Z",
  "author": "james-peckham",
  "summary": "Two new foldable smartphones",
  "article": [
    "The Samsung Galaxy Z Fold 3 and Galaxy Z Flip 2 are expected to land later this year, but it may be that both these phones debut earlier than we'd previously expected.",
    "Many expected Samsung to stick to revealing these new foldable phones around August or September, but a new report from South Korean source The Elec suggests they'll land as early as July.",
    "The report doesn't offer an exact date, but the outlet's sources suggest Samsung will be unveiling these two new phones at some point in July 2021.",
    "Previously, a leaked roadmap for Samsung products that ran up until August 2021 didn't feature either of these foldable phones, so we had expected them to land later in the year.",
    "Samsung is heavily rumored to be unveiling its Galaxy S21 Fan Edition handset in August this year, and it's highly likely that the company won't be debuting the Samsung Galaxy Note 21 around that time.",
    "Samsung CEO DJ Koh has heavily hinted that the company won't be able to make a Samsung Galaxy Note 21 handset this year, so we'll have to wait until 2022 to see a new Note phone debut.",
    "That may be why Samsung is putting a bigger focus on its foldable phones, especially if the Galaxy Z Fold 3 will be compatible with a stylus.",
    "Some leaks previously suggested the next clamshell foldable will be called the Galaxy Z Flip 3 to keep its naming in line with the larger foldable phone line, but it may be just as likely called the Galaxy Z Flip 2. This leak switches back to Z Flip 2, so it's currently unclear what Samsung will call this product.",
    "Via SamMobile"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 2": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "The Elec": "http://www.thelec.kr/news/articleView.html?idxno=11865",
    "Galaxy S21 Fan Edition": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "SamMobile": "https://www.sammobile.com/news/galaxy-z-fold-3-galaxy-z-flip-2-launching-sooner/"
  }
}