{
  "source": "https://www.techradar.com/news/should-you-buy-a-new-kindle-paperwhite-now-or-wait-for-the-black-friday-deals",
  "title": "Should you buy a new Kindle Paperwhite now or wait for the Black Friday deals?",
  "category": "tablets",
  "updated": "2021-10-27T17:00:10Z",
  "author": "tom-bedford",
  "summary": "Will the new model get discounted?",
  "article": [
    "There's a new Amazon Kindle Paperwhite on the block - well there's three actually, with a Kids' version and premium Signature Edition too - and that's pretty interesting timing, because Black Friday is just a month away.",
    "The Black Friday Amazon deals usually bring big discounts on products from the company, including Fire tablets and Echo home hubs as well as Kindle ereaders, and that means we might see the new models discounted...",
    "...or we might not. It's impossible to know right now, with at least a few weeks before the deals even begin, but waiting doesn't guarantee you a cheaper Kindle.",
    "So should you wait or should you buy? We'll look at reasons for each below, so you can treat your bank account as well as your eyes and your imagination.",
    "So you think you can deal with waiting a month for the Black Friday deals? Well, you've got a few things to look forward to.",
    "Discounts on the Kindle Paperwhite 2021 are, quite frankly, unlikely given how new the thing is - but that doesn't mean deals are impossible. Perhaps Amazon will decide to make headlines by reducing the brand-new ereader.",
    "Plus, if you don't need the newest Paperwhite, the previous-gen model will almost definitely get a hearty discount.",
    "And hey - it's not exactly like the price of the newer model will go up if you wait for Black Friday, so if you decide to hold off for a month, you definitely won't end up paying more money than you would now. So there's nothing to lose.",
    "Finally, whether or not Kindle Paperwhites get discounted during the sales season, it's also possible that accessories like cases and carry bags will. So perhaps you'll be able to pick yourself up a bundle.",
    "The main reason to buy the new Kindle Paperwhite is the obvious one: you'll get it straight away. No waiting a month, you could get it in a few days (or in one day, if you have Prime and live in the right place).",
    "You wouldn't have to wait long before putting your feet up in some big fluffy socks, sipping from a mug of something warm and chocolatey, finding a fire or other heat source (pets included), and enjoying a good read.",
    "If you want to feel snug in that safe position, it's also worth considering that deals are, quite frankly, unlikely - you might end up waiting for nothing.",
    "Finally, there's always the looming specter of stock shortages too. Amazon products often don't see these, but it's something affecting the tech industry more and more. There's a shortage of components for gadgets, which means if one becomes super popular, it might be hard to buy it for a while.",
    "Buy now and you won't have to wait ages if there are any availability upsets."
  ],
  "headers": {
    "4": "Reasons to wait",
    "9": "Reasons to buy"
  },
  "links": {
    "Amazon Kindle Paperwhite": "https://www.techradar.com/reviews/amazon-kindle-paperwhite-signature-edition-2021-review",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday Amazon deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals"
  }
}