{
  "source": "https://www.techradar.com/news/google-pixel-repair-workers-accused-of-hunting-through-phones-for-nudes",
  "title": "Google Pixel repair workers accused of hunting through phones for nudes",
  "category": "phones",
  "updated": "2021-12-06T22:30:52Z",
  "author": "anthony-spadafora",
  "summary": "This is why you should always erase a smartphone before sending it in for repair",
  "article": [
    "Sending your Android smartphone in for repair can be stressful enough as it is but one unlucky Google Pixel owner also had her device hacked in the process.",
    "As reported by The Verge, game designer and author Jane McGonigal sent her broken Pixel 5a to an official Pixel repair center in October. Unfortunately though, Google claimed it had never received the phone and she was charged for a replacement device instead.",
    "McGonigal provided further details on the situation while warning other Pixel owners not to send their devices back to the search giant for repair in a recent tweet, saying:",
    "“Yeah, don't send your Google phone in for warranty repair/replacement. As has happened with others, last night someone used it to log into my Gmail, Drive, photos backup email account, Dropbox, and I can see from activity logs they opened a bunch of selfies hoping to find nudes.”",
    "Although Google said it never received McGonigal's Pixel 5a, FedEx tracking information revealed that the device successfully arrived at the company's Pixel repair facility in Texas.",
    "To make matters worse, after receiving a refund for her device, someone used the missing phone to clear two-factor authentication (2FA) checks and log into several of McGonigal's online accounts including her cloud storage and email client.",
    "While this suspicious activity did trigger several email security alerts, McGonigal believes that whoever had her phone used it to access her backup email addresses and move these alerts into her spam folder. While inside her cloud storage, the person who had her phone accessed photos of her in bathing suits and dresses in what appears to be an attempt to access any nude photos she may have had.",
    "According to The Verge, this is the at least the second report of someone sending a Pixel phone in for repair and having their private data and photographs leaked. A spokesperson for Google told the news outlet that the company is currently investigating McGonigal's claim.",
    "If you're worried about someone accessing your online accounts or data when sending a device back for repair, Google's official repair instructions recommend that you backup a device and erase it before sending it in. For those that would rather do the repairs themselves, iFixit has an entire section on its site dedicated to showing you how to fix common Google Pixel problems and the company also sells all of the spare parts and tools you might need when doing so.",
    "We've also highlighted the best Android phones and best Pixel phones",
    "Via The Verge"
  ],
  "headers": {
    "4": "Security risks of mail-in repairs"
  },
  "links": {
    "Android smartphone": "https://www.techradar.com/best/best-android-phones",
    "Google Pixel": "https://www.techradar.com/news/best-pixel-phones",
    "reported": "https://www.theverge.com/2021/12/4/22817758/broken-google-pixel-phone-privacy-leak?scrolla=5eb6d68b7fedc32c19ef33b4",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "recent tweet": "https://twitter.com/avantgame/status/1467192779973398531",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "email client": "https://www.techradar.com/best/best-email-clients",
    "nude photos": "https://www.techradar.com/news/icloud-hacker-stole-intimate-photos-from-hundreds-of-apple-customers",
    "official repair instructions": "https://support.google.com/pixelphone/answer/9004345?hl=en",
    "iFixit": "https://www.techradar.com/news/ifixit-is-crowdsourcing-repair-information-for-hospital-equipment",
    "entire section": "https://www.ifixit.com/Device/Google_Phone",
    "best Android phones": "https://www.techradar.com/best/best-android-phones",
    "best Pixel phones": "https://www.techradar.com/news/best-pixel-phones",
    "The Verge": "https://www.theverge.com/2021/12/4/22817758/broken-google-pixel-phone-privacy-leak?scrolla=5eb6d68b7fedc32c19ef33b4"
  }
}