{
  "source": "https://www.techradar.com/news/you-can-now-play-a-new-bioshock-in-vr-sort-of",
  "title": "You can now play a new BioShock in VR... sort of",
  "category": "gaming",
  "updated": "2021-03-22T09:18:21Z",
  "author": "gerald-lynch",
  "summary": "Half-Life: Alyx mod offers a full underwater campaign",
  "article": [
    "Waiting for news on BioShock 4? You're more likely to find the sea levels rising sooner than you get that – but that's not to say you can't have some fresh BioShock fun today, provided you've got access to a VR headset and a copy of Half-Life: Alyx, that is.",
    "That's because the ambitious Half-Life: Alyx mod, Return to Rapture, now has a full free campaign to download through the Steam Workshop.",
    "Incredibly, it's all been made by just one person. Put together by modder wim.buytaert.1988, it's an incredible mash-up of Half-Life: Alyx mechanics and that chilling deep-sea atmosphere that made BioShock such a memorable experience. Check out the trailer below.",
    "Considering the main Half-Life: Alyx game came out only around a year ago, it's a staggering achievement for a one-man modding team.",
    "The mod imagines the universes of Half-Life and BioShock to be shared, with Half-Life's menacing combine having found Rapture, looking for the secret of Andrew Ryan's gene-splicing ADAM discoveries. After crash landing at Rapture and descending to its core, the game takes the story in its own direction away from the standard BioShock set up, making a good excuse to use Half-Life: Alyx enemies like Combine troops and headcrabs.",
    "Lots of environments seem to have been ripped directly from BioShock, from the neon signage to the Little Sister vending machines, and the general Half-Life: Alyx control system and weapons (with a few BioShock-influenced tweaks) fit the scenario perfectly.",
    "Split into eight downloadable chapters, running around seven hours for the completionist player, there's even an all-new score and voice over work, custom made for the mod. wim.buytaert.1988 told TechRadar that a they'll be adding a few more levels to the campaign soon, too.",
    "Downloading it is a no-brainer for Half-Life: Alyx owners, and it makes us giddy for the possibilities not only of BioShock 4, but also what an official jump to VR for the franchise could bring. If that does happen, publisher Take Two would do well to offer wim.buytaert.1988 a job.",
    "If you're on the hunt for more classic FPS games to play in VR that were not initially intended for the format, check out our guide to porting first-person shooters into virtual reality."
  ],
  "headers": {
    "3": "Worthy of Rapturous applause"
  },
  "links": {
    "BioShock 4": "https://www.techradar.com/news/bioshock-4-everything-we-know-about-the-new-bioshock",
    "Return to Rapture": "https://steamcommunity.com/profiles/76561198280890582/myworkshopfiles/?appid=546560",
    "Steam Workshop": "https://steamcommunity.com/profiles/76561198280890582/myworkshopfiles/?appid=546560",
    "wim.buytaert.1988": "https://steamcommunity.com/profiles/76561198280890582/myworkshopfiles/?appid=546560",
    "guide to porting first-person shooters into virtual reality": "https://www.techradar.com/news/the-best-thing-about-vr-playing-old-school-shooters"
  }
}