{
  "source": "https://www.techradar.com/news/iphone-13-vs-samsung-galaxy-s21-top-selling-mainstream-flagships-clash",
  "title": "iPhone 13 vs Samsung Galaxy S21: top-selling mainstream flagships clash",
  "category": "phones",
  "updated": "2021-12-05T23:52:02Z",
  "author": "jon-mundy",
  "summary": "A tale of two titans",
  "article": [
    "The iPhone 13 is out now, while the Samsung Galaxy S21 has been in the game for most of 2021. So how do these two mainstream flagship phones, launched a whole eight months apart, compare?",
    "We’ve spent a fair amount of time with both phones now, and have found some interesting points of comparison. Apple and Samsung might be old rivals, but they take subtly difference approaches in most areas.",
    "Here’s how the iPhone 13 and the Samsung Galaxy S21 compare.",
    "The iPhone 13 hit shops on September 24, 2021. Prices start from $799 / £799 / AU$1,349 for the entry 128GB model, moving up to $899 / £879 / AU$1,519 for 256GB and $1099 / £1079 / AU$1,869 for 512GB.",
    "The Samsung Galaxy S21 arrived in shops much earlier on January 29, 2021, with prices starting from $799 / £769 / AU$1,249 for the 128GB model. The 256GB model arrived at $849.99 / £819 / AU$1,349.",
    "While Samsung still officially lists these prices on its website, you can find the Galaxy S21 cheaper elsewhere. It’s only going to drop in price as we get nearer to the launch of the Samsung Galaxy S22 in 2022, too.",
    "They might be fierce rivals operating in the same market, but the iPhone 13 and Samsung Galaxy S21 don’t look much alike.",
    "The iPhone 13 takes its design cues from last year’s iPhone 12, with flat surfaces, sharp corners, and a prominent display notch – though the latter is 20% smaller than before.",
    "In the opposite corner, the Samsung Galaxy S21 is all about the curves, with rounded edges and a distinctive ‘Contour Cut’ camera module. It does have a flat display like the iPhone 13, but it has a much more subtle punch-hole camera.",
    "These are two fairly compact phones, and they’re not all that different when it comes to size. At 146.7 x 71.5 x 7.65mm, the iPhone 13 is a tad shorter and slimmer than the 151.7 x 71.2 x 7.9mm Galaxy S21.",
    "Samsung’s phone is ever so slightly lighter at 169g, however, with the iPhone 13 tipping the scales at 174g.",
    "Both phones employ aluminum bodies, but whereas the iPhone 13 goes with a classy glass rear, the Galaxy S21 cheaps out with a plastic finish Samsung calls ‘Glasstic’. We’re not huge fans, in truth.",
    "When it comes to colors, the iPhone 13 gives you Pink, Blue, Midnight, Starlight, and Product Red, while the Galaxy S21 gives you a choice of Phantom Gray, Phantom White, Phantom Pink, and Phantom Violet.",
    "Ultimately, that plastic rear costs the Galaxy S21 the win in the design department. The iPhone 13 gets much closer to the iPhone 13 Pro in look and feel than the Galaxy S21 does to the Galaxy S21 Ultra.",
    "Samsung hits straight back with a slightly more impressive display. These are similarly sized OLEDs at 6.2-inches for the Samsung and 6.1-inches for the Apple, and both get plenty bright.",
    "But while the iPhone 13 has the slightly sharper 1170 x 2532 resolution (versus the 1080 x 2400 Galaxy S21), the Samsung wins out in one vital aspect.",
    "Apple restricted its 120Hz refresh rate improvement to the Pro model this year, leaving the iPhone 13 on sluggish old 60Hz. The Galaxy S21, by contrast, runs at a full 120Hz.",
    "As a result, Samsung’s display simply feels slicker, more responsive, and just plain better than Apple’s.",
    "It also doesn’t have that distracting display notch to contend with, which makes landscape video and gaming content look that little bit better on the Samsung.",
    "Both of these phones take excellent pictures, and both have their advantages in a straight scrap.",
    "The iPhone 13 has a 12MP wide sensor that can pull in 47% more light than the iPhone 12 before it, though its 1.7µm pixels are still a tad smaller than the Galaxy S21’s 1.8μm pixels from its own 12MP sensor.",
    "One thing the Galaxy S21 doesn’t have access to, however, is the iPhone 13’s advanced sensor shift stabilization system, which has been pulled from the iPhone 12 Pro Max. This makes it freakishly steady in the hand, which leads to phenomenal low light shots.",
    "Both phones have fine 12MP 120-degree ultra-wide sensors too, which are capable of taking sharp landscape snaps.",
    "Where the Samsung wins out, however, is with the provision of a 64MP telephoto sensor. True, it only extends to a 1.1x optical zoom, but the larger megapixel count enables a sharp 3x hybrid zoom. That’s better than the iPhone 13’s blurry cropped-in shots.",
    "Both camera systems come with a bag of party tricks. The iPhone 13 introduces Photographic Styles, which lets you fundamentally change the warmth and tone of your snaps. You can even make them more Samsung-like, if you like that vibrant punch.",
    "Cinematic mode supplies a rack focusing effect to your videos, laying on a pronounced depth of field effect that can be changed after the footage has been captured.",
    "Samsung brings its own video tricks. Director’s View lets you see and flick between all three rear lenses, while Vlogger View shoots video from the front and rear cameras simultaneously.",
    "Single Take is well established by now, employing AI and slow-motion recording to capture and process a range of image types in one go.",
    "While the Samsung Galaxy S21 can manage 8K/24fps video to the iPhone 13’s 4K/60fps, however, we’d still give the iPhone the nod for sheer video quality.",
    "Indeed, zoomed shots aside, the iPhone 13 camera wins out in general. It’s one of the best camera systems on the market.",
    "It’s been nip and tuck so far, with both phones offering their own unique slants in each category. But performance is one area where the iPhone 13 absolutely dominates.",
    "Apple claims its 5nm A15 Bionic chipset packs a six-core CPU that’s 50% faster than its Android competition, which presumably includes the Galaxy S21’s Exynos 2100 (or the slightly better Snapdragon 888 in the US model).",
    "In our own CPU-focused Geekbench 5 multi-core test, the iPhone 13 scored 4688 to the Galaxy S21’s 3367. That’s a big gap.",
    "Don’t read too much into the fact that the Galaxy S21 has double the RAM (8GB) either. Android and iOS handle memory completely differently.",
    "In the hands, both phones feel incredibly fast. You can run the most demanding games at top settings on both, though the iPhone 13 is likely to hit a more consistently high frame rate on top graphical settings.",
    "More importantly, it’s almost certain to feel fast for longer. There’s that performance headroom, of course, but also the fact that Apple tends to support its hardware for longer than any Android manufacturer.",
    "Elsewhere, the iPhone 13 gives you 128GB, 256GB, and 512GB storage options. The Samsung Galaxy S21 gives you 128GB or 256GB.",
    "Apple has equipped the iPhone 13 with a 3,240mAh battery. That might sound perilously small compared to the Galaxy S21’s 4,000mAh cell, but these figures can be deceptive.",
    "Thanks to the different way iOS and Android handle their resources, the iPhone’s battery is actually relatively large, while the Galaxy S21’s is relatively small.",
    "Apple has made big claims for the iPhone 13’s stamina, stating that it lasts 2.5 hours longer on a single charge than the iPhone 12. We can support that to a certain extent, as we tended to be left with around 20% at the end of an intensive day of usage.",
    "When it comes to the Galaxy S21, we found that it would generally last a full day of usage on a single charge. However, cranking things up a little (with GPS applications, for example) would occasionally lead to an empty battery before lights out.",
    "Samsung has the slight edge when it comes to recharging, with 25W wired charging support compared to the iPhone 13’s 20W. But neither figure is too hot in the grand scheme of things.",
    "Especially not when you consider that neither manufacturer gives you a charging brick in the box. An option to bundle in a charger would have been nice, at the very least.",
    "Both phones support 15W wireless charging, but the iPhone 13 has the added benefit of the MagSafe ecosystem, which adds a convenient magnetized attachment method to the equation.",
    "Both of these phones get the balance right between price and performance, offering nearly-flagship experiences for less money than their bigger brothers.",
    "They have their flaws, but for the most part it’s a safe bet buying either phone.",
    "We’d give the edge to the iPhone 13, however. It’s considerably newer than the Galaxy S21 for one thing. Combined with Apple’s superior legacy support, this means that it’s going to feel fresher for longer.",
    "It’s also way faster than the Galaxy S21, with a much more capable custom chipset. The iPhone 13’s camera system takes better pictures in most scenarios, too, with the notable exception of zoomed shots.",
    "With the Samsung Galaxy S22 right around the corner, that could all change soon. But for now, Apple has returned to the mainstream flagship smartphone throne.",
    "You might also want to check out the Samsung Galaxy S21 vs Samsung Galaxy S20 comparison."
  ],
  "headers": {
    "3": "iPhone 13 vs Samsung Galaxy S21: price and availability",
    "6": "iPhone 13 vs Samsung Galaxy S21: design",
    "14": "iPhone 13 vs Samsung Galaxy S21: display",
    "19": "iPhone 13 vs Samsung Galaxy S21: cameras",
    "30": "iPhone 13 vs Samsung Galaxy S21: specs and performance",
    "37": "iPhone 13 vs Samsung Galaxy S21: battery",
    "44": "Takeaway"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Samsung Galaxy S21 vs Samsung Galaxy S20": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s20"
  }
}