{
  "source": "https://www.techradar.com/news/amd-ryzen-8000-processors-could-look-like-a-turbo-charged-apple-m1",
  "title": "AMD Ryzen 8000 processors could look like a turbo-charged Apple M1",
  "category": "computing",
  "updated": "2021-04-28T20:16:53.089Z",
  "author": "john-loeffler",
  "summary": "Intel Alder Lake is going to have some serious competition",
  "article": [
    "AMD may be preparing to introduce a 3nm node with hybrid design to their APU lineup starting with Zen 5, posing a serious challenge to Intel's upcoming big.LITTLE Alder Lake chip.",
    "The new APU, which would tentatively be part of AMD's Ryzen 8000-series, could land as soon as 2024, according to KitGuru. It is rumored to feature up to eight performance cores and four efficiency cores, bringing the total number of available threads to 20.",
    "There is also speculation that there will be a new memory subsystem to go along with the new architecture. At the moment, there is no word on whether these changes would extend to AMD Zen 5 CPUs as well, but that definitely can't be ruled out.",
    "The bad news? We don't know anything about the number of GPU cores the new APU would feature, or if it would have additional processing units like the neural processing component in the Apple M1 chip and forthcoming Apple MX chip. We should also stress that this is a single rumor, so take it with a grain of salt.",
    "While AMD has made major strides in catching up to archrival Intel in desktop CPU market share, it is a distant second when it comes to laptops, arguably the biggest growth segment of the consumer PC market.",
    "With Intel making a shift towards the big.LITTLE architecture design pioneered by Arm, AMD's adoption of the design as well shouldn't surprise anyone, even though AMD mocked Intel's earlier adoption of the architecture less than a year ago.",
    "With the improved power efficiency that this architecture provides, an increasing number of laptops are going to feature the chip design in the years ahead as laptop manufacturers battle over battery life – one of customers' top-line concerns when buying a laptop. So, Intel's move to big.LITTLE looked like a solid strategy to lock down its laptop market share dominance in the years ahead, which makes this AMD news a very big deal, if true.",
    "The problem is that Intel's Alder Lake is built on a 10nm node, so if AMD does drop a 3nm Zen 5 APU as soon as 2024, Intel's position in the mobile computing market can quickly go the way its position in the desktop space has. A 3nm big.LITTLE chip from AMD would have all the benefits of energy efficiency while also being a lot more powerful that Intel's rival chip.",
    "It only took AMD about five years to turn its desktop CPU position around, so it's not out of the question to see parity between AMD and Intel in Windows laptops before the decade is out."
  ],
  "headers": {
    "4": "AMD Zen 5 could pose a threat to Intel, too"
  },
  "links": {
    "KitGuru": "https://www.kitguru.net/tech-news/featured-tech-news/joao-silva/amd-zen-5-strix-point-apu-to-be-based-on-3nm-node-and-hybrid-core-architecture/",
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Apple MX chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "desktop CPU market share": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
    "AMD mocked Intel's": "https://www.techradar.com/news/amd-has-a-subtle-dig-at-intel-suggesting-alder-lake-cpus-dont-make-sense"
  }
}