{
  "source": "https://www.techradar.com/news/why-do-sports-games-like-fifa-21-have-surprisingly-good-stories",
  "title": "Why do sports games like FIFA 21 have surprisingly good stories?",
  "category": "gaming",
  "updated": "2021-05-08T15:00:29Z",
  "author": "rhys-wood",
  "summary": "Opinion: Sports games like FIFA 21 don’t get the credit they deserve when it comes to narrative.",
  "article": [
    "Sports games like FIFA 21 and MLB The Show 21 are rightfully lauded for their excellently realized simulations of their real world counterparts. At the same time, those simulation aspects aren’t inaccessible, simultaneously providing fun experiences that encourage long play sessions. This is perfectly supported by each game’s robust career modes, which are compelling not only for their gameplay, but also for their ability to tell fantastic stories.",
    "Not to play into any nerdy stereotypes or anything, but I really don’t like sports. Seeing a ball being kicked up and down a pitch for 90 minutes, or the same cars racing around the same stretch of road for who knows how many laps is more of a test of patience for me than an engaging display of skill and athleticism.",
    "That’s not to discount the incredible work ethic that athletes and motorists display on a daily basis, that alone is worth watching sports for. I personally just find sports to be far more entertaining when you’re not a spectator.",
    "Sports game career modes, then, like those found in FIFA 21, NBA 2K21 or MLB The Show 21, for example, let you get behind the scenes, control your team and potentially even get emotionally attached. Sports games are strangely compelling in how their stories come across, both in game and in your head, and that ability to dynamically form a narrative isn’t something I see a lot of people talk about.",
    "Don’t worry, I promise you I haven’t lost the plot. I am not about to insinuate that FIFA 21 has narrative chops on the level of something like Nier Replicant or Final Fantasy 7 Remake. Rather, sports games - particularly their career modes - often do a fantastic job of getting the player to form narratives in their own heads. It’s weirdly genius.",
    "Let me give you an example of what I mean. While I don’t go out of my way to tune into the Premier League, FIFA has always been a prominent fixture in my life, all the way through school, university and beyond. In my opinion, you don’t need to be a sports fan to enjoy such games, and their dynamic career modes can facilitate that feeling by providing much more to love than just the kick of the ball.",
    "A few FIFAs ago, I found myself absorbed in the career mode. I took on a strictly managerial role, taking a very hands-on approach to shaping my club. I was in full control, handling everything from scouting and transfers to on-pitch formations and strategies. With all this underway, I was already fully invested in my chosen club, Bolton Wanderers. Fun fact: that’s a sentence that has never been uttered before or since.",
    "I usually like to pick underdog teams in sports games because of the immediately interesting setup that entails. Nobody expects an underperforming team to do well, and that in and of itself is enough to generate the foundations of a good story. Pair that with your ability to scout unknown players with bags of potential, and you’ve got a recipe for a dynamic story that resembles a soap opera rather than a run-of-the-mill showcase of football.",
    "But that’s just the beginning, of course. Setting up the career mode, choosing a team and your desired approach to management provides the shell. It’s the craziness that happens from that point on that makes sports game career modes truly irresistible and shockingly fantastic from a storytelling perspective.",
    "Let’s say you’ve just bagged yourself that future star player. They’re so unknown that they don’t even have an icon depicting their real-world appearance. They’re young, have great stats and bags of potential. Even better, you’ve transferred them to your club on the cheap. It’s a risky strategy, eschewing the idea of buying a well-known player that’s almost guaranteed to get you results.",
    "Then, you start to play them. You put them on the first team, even. In their first few games, they’re already scoring nearly as many goals as the league’s top performers. You’ve turned an unknown prospect into a headline stealing prodigy.",
    "Then, the next transfer window rolls around. All the big clubs want your star player, so much so they’re willing to pay millions for them. They’ve seen your success, and now they want it for themselves. What do you do in that situation?",
    "Do you accept the highest offer, potentially dooming your player to a life on the sub bench, but simultaneously shoring up the funds to bolster your team’s weak points? Or, do you refuse, keeping your star player and nurturing them even further to propel your team into the dizzying heights of success?",
    "That’s just one of many plot threads that can form in your mind during a FIFA 21 career mode session. It seems so trivial of a thing to make such a big deal out of, but it’s the kind of thing that makes sports game career modes so thrilling and compelling, more than they have any right to be.",
    "It’s worth noting that FIFA, of course, isn’t the only football game in town that attempts a robust career feature. The much-loved Football Manager series provides a more tactical managerial experience. However, for such a hands-on approach to management, it’s ironic that the day-to-day happenings in Football Manager can often feel totally out of your control.",
    "I much prefer FIFA’s approach, where skill-based real-time gameplay leads you to feel as if your victories are more than earned, and your defeats largely your own fault. This plays into that subconscious narrative far better, in my opinion.",
    "Love or hate sports games, and all the questionable things they do in regards to ‘ultimate teams’, microtransactions and intrusive in-game advertisements, it’s hard to beat a good career mode when they’re done right. That’s because their ability to dynamically form narratives both in-game and in your imagination isn’t dissimilar to how many strategy games approach the same thing.",
    "Take XCOM, for example. This long-running turn-based strategy series couldn’t be further removed from something like FIFA 21 or MLB The Show 21 if it tried. But if you look hard enough, you’ll see that similarities between the two definitely exist.",
    "In XCOM, you command a squad of soldiers proficient at slaying evil extraterrestrials. Your squad, not unlike your chosen team in a FIFA career mode, is the lifeblood of your playthrough. You can name individual squad members, choose what weapons and abilities they take into the fight, and rest them when they grow too battle-weary to continue.",
    "On the battlefield, your actions greatly dictate the fates of your squad members. The hours spent levelling them up, growing their bonds with other squadmates, building up their skills and abilities can all be vaporized in an instant - along with your soldiers’ physical form - when a Sectoid or Thin Man rolls an unavoidable critical hit.",
    "Playing XCOM 2 was one of the very few times I audibly yelled “NO!!!” at losing a character. And sure, while nothing had me quite so up in arms when playing FIFA 21, losing your star players to another team or to injury can definitely breed similar moments of loss and frustration.",
    "Sports games certainly aren’t going to win any awards for their storytelling anytime soon, not least of all because most don’t really feature a traditional narrative to begin with. That being said, it’s always genuinely fascinating to see how your sports game career mode can affect you subconsciously. And whether that’s intentional or not, it’s kind of genius.",
    "Sports games like FIFA 21 and NBA 2K21 are often criticized, rightly so, for being hard to tell apart, offering only incremental upgrades year after year, eventually adding up to create the guise that they’ve changed substantially.",
    "With this in mind, I’d love to see career modes really tap into that narrative potential they have. Employing random events that could positively or negatively impact you, your team and players would be a simple yet effective way to differentiate your career from another player’s.",
    "I remember how the old WWE Smackdown vs Raw series of yesteryear would even have entire cutscenes made just for career modes featuring your player-created wrestler. It’s been done before, so something like that can certainly be achieved with current-gen hardware and upcoming sports titles.",
    "That said, it’s not as if FIFA or other sports titles haven’t tried to put a spin on their career mode offerings. For a few years, the series experimented with a mode called The Journey, a fully story-driven footballing adventure starring a preset character, Alex Hunter. And film director Spike Lee lent his talents to the story mode for NBA 2K16, bringing a cinematic touch for something genuinely different.",
    "The Journey trilogy was impressively ambitious for a FIFA title, but it did lack the occasional randomness and decision-making found in the main career mode. What I’d most love to see is a combination of the two. A solid but non-intrusive plot thread, supplemented by the often chaotic nature of FIFA’s dynamic career modes.",
    "I do hope that sports game developers can break the mold of cookie-cutter annual releases to do something really special with career modes in future. There’s already so much dynamism and unpredictability that goes into them, but I would love games like FIFA 22 and more to really lean into this to provide an unforgettable career mode experience."
  ],
  "headers": {
    "4": "Having a ball",
    "9": "Real choices, real consequences",
    "16": "A narrative of strategy",
    "21": "Football fantasy"
  },
  "links": {
    "FIFA 21": "https://www.techradar.com/reviews/fifa-21",
    "MLB The Show 21": "https://www.techradar.com/news/mlb-the-show-21-xbox-game-pass-series-x",
    "NBA 2K21": "https://www.techradar.com/reviews/nba-2k21",
    "Nier Replicant": "https://www.techradar.com/reviews/nier-replicant",
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "Football Manager": "https://www.techradar.com/news/football-manager-slides-onto-nintendo-switch"
  }
}