{
  "source": "https://www.techradar.com/news/this-rtx-3090-gaming-pc-is-dollar1000-cheaper-with-an-early-black-friday-newegg-deal",
  "title": "This RTX 3090 gaming PC is $1000 cheaper with an early Black Friday Newegg deal",
  "category": "computing",
  "updated": "2021-10-29T21:20:54Z",
  "author": "john-loeffler",
  "summary": "Seriously. It's $1,000 off. What more do you need to know?",
  "article": [
    "As all the early Black Friday deals start to roll out, this gem from Newegg could be your best chance this year at getting a new RTX 3090 gaming PC ahead of the holiday break, especially with $1,000 off the retail price.",
    "The Skytech Prism gaming PC normally retails for $4,499, but you can get it from Newegg right now for just $3,499, which is almost how much it costs to just get an RTX 3090 right now thanks to all the price markups online – assuming you can actually find and RTX 3090 graphics card right now.",
    "(Not in the US? Scroll down for deals in your region).",
    "The Skytech Prism II gaming PC comes loaded with the aforementioned RTX 3090, which itself is being sold online for $3,000 by some retailers (let's not even talk about eBay and StockX profiteers), so just for the RTX 3090, this is a heck of a deal right now.",
    "Add in the Intel Core i9-10900K CPU, 1TB NVMe SSD, 16GB DDR4 3,000MHz RAM and a Z490 motherboard, you start out with great specs with plenty of room to expand your rig for years to come.",
    "And with Black Friday PC gaming deals right around the corner, the money you save on this gaming PC build can help you expand your new rig to your liking.",
    "Did we mention that it's $1,000 off? What are you waiting for?",
    "No matter where you live, you'll find all the lowest prices for Skytech gaming PCs from around the web right here, with offers available in your region.",
    "Find all the best early Black Friday deals from all the major tech retailers from across the web:"
  ],
  "headers": {
    "3": "Today's best Skytech gaming PC Black Friday deal",
    "7": "More Skytech gaming PC deals",
    "8": "More Black Friday deals"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "get it from Newegg right now for just $3,499": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-2829569463449815000&murl=https%3A%2F%2Fwww.newegg.com%2Fskytech-st-prismii-0144-ne-prism-ii%2Fp%2FN82E16883289077",
    "Black Friday PC gaming deals": "https://www.techradar.com/deals/best-black-friday-pc-gaming-deals-2019"
  }
}