{
  "source": "https://www.techradar.com/news/ztes-new-under-display-selfie-camera-is-official-and-it-could-include-3d-face-unlock",
  "title": "ZTE's new under-display selfie camera is official, and it could include 3D face unlock",
  "category": "phones",
  "updated": "2021-02-25T13:36:13Z",
  "author": "rhys-wood",
  "summary": "ZTE looks to improve its under-display technology",
  "article": [
    "ZTE used the MWC Shanghai Conference 2021 to share details on its second-generation under-display selfie camera. The company elaborated on its announcements via Weibo, a popular Chinese social media platform, and the posts have since been machine translated.",
    "ZTE’s new under-display selfie camera technology aims to address issues found in the company’s Axon 20 5G, which was the first phone with an under-display front-facing shooter.",
    "Chiefly, the second-generation tech is looking to bump up pixel density to 400ppi (pixels per inch) for greater image quality, and to reduce a hazing effect that was present on the Axon 20 5G.",
    "A new version of ZTE’s under-display selfie camera technology wasn’t the only trick the company had up its sleeve, however, as it also revealed it’s working on improving 3D facial recognition tech.",
    "ZTE noted in a machine-translated post that 3D face unlock technology was a more secure alternative to 2D-based solutions, and that the tech can also be used for 3D modeling and augmented reality.",
    "The common consensus on ZTE’s previous efforts with its under-display selfie camera tech, including in our own review of the Axon 20 5G smartphone, is that it might be a touch ahead of its time.",
    "The technology was underwhelming, producing lower quality selfies than what’s available on more reliable smartphone cameras.",
    "ZTE’s new tech sounds promising though. Its second-gen under-display selfie camera has potential to be a great alternative to other types of smartphone camera. ZTE’s advancements in its 3D technology could even make its future devices stand out from the crowd, with its focus on readying it for more than just facial recognition and security.",
    "When will this technology be readily available on a phone? That’s currently unclear, but we may see this second-gen selfie shooter on the upcoming ZTE Axon 30 5G. When that phone will arrive isn’t yet clear though."
  ],
  "headers": {
    "5": "Room for improvement"
  },
  "links": {
    "machine translated": "https://www.androidauthority.com/zte-second-generation-under-display-camera-1203259/",
    "Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "Axon 30 5G": "https://www.techradar.com/news/upcoming-zte-axon-30-pro-smartphone-will-sport-a-whopping-200mp-camera"
  }
}