{
  "source": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years",
  "title": "AMD overtakes Intel in desktop CPU market share for the first time in 15 years",
  "category": "computing",
  "updated": "2021-01-05T17:37:06Z",
  "author": "john-loeffler",
  "summary": "Team Red takes the desktop lead",
  "article": [
    "AMD has just edged out Intel in desktop CPU market share for the first time in 15 years on the strength of its Ryzen series of processors, first released in 2017.",
    "The market share figures, gathered by PassMark Software's PerformanceTest benchmarking tool, showed AMD with a 50.8% share of the Windows desktop CPU market worldwide to 49.2% for Team Blue on January 4, 2021. Intel regained a slight 0.4% lead on January 5, but AMD has still passed the silicon Rubicon in its battle with its archrival.",
    "The last time AMD beat out Intel was Q1 2006, with a peak of 53.9% market share, which it lost the following quarter as Intel went on an 11-year tear and came close to claiming nearly 80% of the desktop CPU market in Q4 2016.",
    "With the release of AMD's Ryzen series of CPUs in 2017, however, things quickly turned around for Team Red. It has quickly climbed back to parity with Intel, and with offerings like the Ryzen 7 5800X and Ryzen 9 5900X less than a three months old, there's little reason to think that AMD will slip the way the company did last time.",
    "As more systems are benchmarked, these numbers are bound to change, so it remains to be seen if AMD can keep up its climb, but given Intel's difficulty in moving their processors to a 7nm architecture, AMD appears to have a fairly clear path to beating Intel in the desktop CPU space in the years ahead.",
    "While Intel might have lost this round on the desktop CPU front, its laptop and server CPU market shares are absolutely dominant. As Techspot points out, with 83.7% of Windows laptops tested running an Intel CPU, AMD has a long way to go before they can catch up with Intel. Its even more one-sided on the server side where Intel enjoys a 98.6% market share, with AMD powering just over 1% of servers tested.",
    "While these numbers are heavily lopsided, it only took AMD four years to come back from a similar position getting nearly shut out of the desktop CPU front, so if anyone can, AMD has shown that it certainly has the chops to do it."
  ],
  "headers": {
    "5": "Intel still dominates mobile computing and server markets"
  },
  "links": {
    "market share figures": "https://www.cpubenchmark.net/market_share.html",
    "Ryzen 7 5800X": "https://www.techradar.com/reviews/amd-ryzen-7-5800x",
    "Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "7nm architecture": "https://www.techradar.com/news/intel-admits-7nm-cpus-delayed-perhaps-until-2023-falling-further-behind-amd-ryzen-chips",
    "Techspot": "https://www.techspot.com/news/88148-amd-desktop-cpu-share-passes-intel-first-time.html"
  }
}