{
  "source": "https://www.techradar.com/news/microsoft-officially-retiring-internet-explorer-next-year-moving-on-to-edge",
  "title": "Microsoft officially retiring Internet Explorer next year, moving on to Edge",
  "category": "computing",
  "updated": "2021-05-20T07:32:00Z",
  "author": "john-loeffler",
  "summary": "Not even Microsoft wants to make Internet Explorer its default browser",
  "article": [
    "Microsoft is set to finally drop its 25-year-old Internet Explorer web browser next year so it can focus all of its attention on the Chromium-based Microsoft Edge browser instead.",
    "In a blog post on its website, Microsoft states that \"the Internet Explorer 11 desktop application will be retired and go out of support on June 15, 2022, for certain versions of Windows 10.\" Those certain versions of Windows 10 appear to be those without a long-term service contract, which are popular with a lot of commercial and industrial customers who need a consistent, compatible system for years at a time.",
    "Apparently, the thing that had kept Internet Explorer alive in recent years was how certain older, legacy websites could only be viewed using Internet Explorer. But now that Microsoft Edge can view these sites just fine thanks to its built-in \"Internet Explorer mode,\" there's no reason to actually continue supporting Internet Explorer.",
    "The biggest beneficiaries of this announcement will be web developers who no longer have to code websites with an eye towards supporting the aging, increasingly incompatible Internet Explorer, something Microsoft acknowledges in their announcement as an ongoing problem.",
    "The announced retirement of Internet Explorer has been a long time coming. The browser, once ubiquitous, steadily lost ground to rivals like Mozilla Firefox and Google Chrome over the past 15 years as users opted for more secure, faster, and feature rich browsing experiences. As 9to5Google points out, Google Chrome overtook Internet Explorer as the most popular browser in the US in 2013.",
    "Last year, Microsoft announced that it was pulling support for Internet Explorer from Microsoft 365 apps on August 21, 2021. That sounded the death knell for the browser, so today's announcement is hardly a surprise.",
    "That it's end has finally come really is a cause for celebration. Not only was it a relic of an almost completely different internet, even then it wasn't a very good browser. It's widespread use was more a matter of Microsoft deliberate efforts to keep out rival browsers on their operating system, something that won them an incredibly-rare-in-modern-times antitrust lawsuit from the otherwise extremely pliably Clinton and Bush administrations in the early 2000s.",
    "Perhaps the most damaging aspect of Internet Explorer - other than its rampant security flaws - is the fact that its widespread use as the default browser for untold millions of users over the years held back browser development for about a decade as rival browsers like Netscape were unceremoniously snuffed out.",
    "It's finally time for it to go, and its end couldn't have come soon enough."
  ],
  "headers": {
    "4": "RIP Internet Explorer"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "blog post": "https://blogs.windows.com/windowsexperience/2021/05/19/the-future-of-internet-explorer-on-windows-10-is-in-microsoft-edge/",
    "9to5Google": "https://9to5google.com/2021/05/19/microsoft-is-killing-internet-explorer-for-good-next-year-in-favor-of-edge/",
    "pulling support for Internet Explorer from Microsoft 365 apps": "https://www.techradar.com/news/microsoft-is-finally-killing-off-internet-explorer"
  }
}