{
  "source": "https://www.techradar.com/news/keeping-track-of-your-colleagues-just-got-a-whole-lot-easier-in-google-sheets",
  "title": "Keeping track of your colleagues just got a whole lot easier in Google Sheets",
  "category": "computing",
  "updated": "2021-11-18T21:30:00Z",
  "author": "anthony-spadafora",
  "summary": "People chips are now rolling out in Google Sheets",
  "article": [
    "Google is rolling out a new update for its spreadsheet software that will make it just as easy to work with people as it is to work with numbers in Google Sheets.",
    "Earlier this year with the launch of smart canvas, Google made it possible to bring together all of its online collaboration tools in Google Workspace in any document a user is currently working on. At the same time, the search giant also introduced smart chips which enable users to add interactive building blocks to connect people, content and events into one seamless experience.",
    "Just last month, Google released its new universal @ menu to make it easier to add tables and images in addition to smart chips directly in Google Docs. By simply typing “@” while in a document, users can now see a list of recommended files, people, meetings, content elements and formats to insert into their office documents.",
    "Now in a new update to Google Sheets, Google is bringing this same functionality to spreadsheets in an effort to further foster collaboration.",
    "According to a new post on the Google Workspace blog, Google has now made it possible to add people chips directly into a Google Sheet.",
    "By typing “@” inside a cell in Sheets, users will be able to quickly view more information about their colleagues or contacts including their location, job title and contact information. However, people chips can also be used to take actions such as booking a meeting in Google Meet, starting a chat, sending an email and more directly from a smart chip in Sheets.",
    "While this may seem like a small update, it can be quite useful for those who need to keep track of a lot of people online such as an editor working with freelancers or a small business owner working with suppliers.",
    "People chips will be available by default to all paid Google Workspace users as well as those with personal Google accounts and this feature is now gradually rolling out so it may take a few days before you can access it in Sheets.",
    "We've also rounded up the best free office software, best online collaboration tools and best cloud storage"
  ],
  "headers": {
    "4": "People chips in Google Sheets"
  },
  "links": {
    "spreadsheet software": "https://www.techradar.com/best/spreadsheet-software",
    "Google Sheets": "https://www.techradar.com/reviews/google-sheets",
    "smart canvas": "https://www.techradar.com/news/google-workspace-update-wants-to-bring-all-your-work-tools-together",
    "online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "universal @ menu": "https://www.techradar.com/news/google-docs-sticks-it-to-microsoft-word-with-latest-update",
    "Google Docs": "https://www.techradar.com/reviews/google-docs",
    "new post": "https://workspaceupdates.googleblog.com/2021/11/insert-people-chips-in-google-sheets.html",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "freelancers": "https://www.techradar.com/best/best-freelance-websites",
    "best free office software": "https://www.techradar.com/best/free-office-software",
    "best online collaboration tools": "https://www.techradar.com/best/best-online-collaboration-tools",
    "best cloud storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}