{
  "source": "https://www.techradar.com/news/oneplus-new-gaming-trigger-buttons-work-on-ios-and-android-phones",
  "title": "OnePlus' new gaming trigger buttons work on iOS and Android phones",
  "category": "phones",
  "updated": "2021-04-22T15:32:29Z",
  "author": "david-lumb",
  "summary": "OnePlus Gaming Triggers are clip-on accessories, but they're India-only for now.",
  "article": [
    "After launching its first smartwatch weeks ago, OnePlus just teased a new phone accessory: physical clip-on buttons that act as shoulder triggers for gaming, and supposedly work on all iOS and Android phones.",
    "The company actually teased it was cooking up these gaming triggers during the OnePlus 9 launch event, Input pointed out. But we hadn’t heard anything official about the OnePlus Gaming Triggers, as they’re called, until they were revealed today by OnePlus CEO Pete Lau via a tweet:",
    "The gaming triggers look to be two separate physical accessories that clip over the front and back edges of a phone such that, when it’s roasted, the triggers work like shoulder buttons found on game console controllers – or more accurately, like physical versions of the capacitive touch shoulder buttons built into the Asus ROG 5 and other top gaming phones.",
    "The Triggers appear to be physical buttons with ‘Omron switches’ for tactile feedback that work with your phone through capacitive conduction (aka as stand-ins for finger presses), according to the device’s listing page on the OnePlus India store. In photos, the touch buttons overlap with (and presumably touch) top parts of the screen, so players likely need to remap on-screen control areas to parts of the display where the Gaming Triggers can reach.",
    "The OnePlus Gaming Triggers are currently on sale on the OnePlus India store for ₹1,099 (around $15 / £11 / AU$19). OnePlus confirmed to TechRadar that the triggers will also be sold in China and Europe, but it’s unclear when they’ll be sold in other regions.",
    "Just how well these buttons will work is another story, and rest assured, we’d love to try them out. While they wouldn’t be as easy to use as other mobile gaming peripherals that pair with phones, their non-digital nature means they could be clipped on and used in seconds without a lengthy setup, and supposedly work even with phones donning screen protectors and protective cases.",
    "This low-tech solution could be a useful alternative to the host of mobile gaming accessories and controllers on the market, like the Backbone or Razer Kishi peripherals, which clip controller halves on either side of a phone (much like the Nintendo Switch) but are pricey and hefty. While two shoulder buttons are no replacement for additional joysticks and buttons, the OnePlus Gaming Triggers could be at least cheaper and more portable for mobile gamers who are fine with touch controls but want just a bit more utility."
  ],
  "headers": {
    "5": "Physical triggers? On MY smartphone??"
  },
  "links": {
    "smartwatch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "Input": "https://www.inputmag.com/tech/oneplus-teases-gaming-triggers-you-clip-onto-your-phone-for-more-pew-pew-pew",
    "Asus ROG 5": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "listing page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1435552344373154000&xs=1&url=https%3A%2F%2Fwww.oneplus.in%2Fproduct%2Foneplus-gaming-triggers&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Foneplus-new-gaming-trigger-buttons-work-on-ios-and-android-phones",
    "Razer Kishi": "https://www.techradar.com/reviews/razer-kishi"
  }
}