{
  "source": "https://www.techradar.com/news/do-super-bowl-ads-still-matter",
  "title": "Do Super Bowl ads still matter?",
  "category": "entertainment",
  "updated": "2021-01-29T20:04:59Z",
  "author": "tabitha-baker",
  "summary": "And are they still relevant In the age of social media?",
  "article": [
    "The Super Bowl is consistently the biggest broadcast of the year, and ad slots have been worth millions of dollars since the mid-90s. Over the years less and less emphasis is placed on the value of TV advertising and yet the price of a Super Bowl live stream commercial slot has been shooting up.",
    "In the age of marketing desensitization, social media, Google advertising - and in the light of the ongoing pandemic and major brands like Budweiser and Pepsi sidestepping Super Bowl LV's slots - why do Super Bowl ads still matter?",
    "Social media ads are far more pervasive than their TV counterparts. We might skip them as soon as we can or employ ad-blockers to keep them off our screens as much as possible, but they remain a constant in our online lives, however much they rely on quantity over quality.",
    "Cheap and effective, it's this kind of advertising that we've now become desensitized to, leaving us with a new attention span for campaigns that offer something different. This isn't usually achieved through everyday TV advertising - it still represents too much of an intrusion on our favorite shows and movies for us to pay much heed. However, the culture surrounding the creativity, budget, and star power of Super Bowl commercials are a completely different story.",
    "From Coca-Cola to Apple to Wendy's, we have a hall of fame full of Super Bowl commercials that champion values opposite to the bombardment of low quality ads we see everywhere we turn. Companies flood cash into these 30-second snippets of air time, competing to offer the most memorable advertisements with the biggest stars.",
    "It's that culture of spectacle mixed with originality that holds our attention for one night of the year, and the more money pumped into each ad the more we watch - the more we watch, the more they spend.",
    "It's a cycle, however, that isn't completely estranged from more modern advertising. Adopting social media to tease out the creativity or novelty of their ads, companies today often launch their Super Bowl campaigns weeks before the big night itself.",
    "Doritos' #NowItsHot campaign in 2019 saw Chance The Rapper and the Backstreet Boys collaborating on a particularly fire I Want It That Way remix to kickstart a series of releases in the weeks and months leading up the Super Bowl itself. That night saw a 30-second call back to the initial campaign video airing during CBS's coverage of the big game.",
    "Of course, this wasn't just a tweet and a YouTube video. The campaign saw a new Snapchat filter, Spotify releases and concert posters plastered across the streets of New York City. It was a massive campaign with untold cash flow, all to advertise a new chip flavor, and all centred around a fleeting Super Bowl ad slot.",
    "Even if you skip those Super Bowl ads, flip the channel for a few minutes, or watch an ad-free broadcast, the campaigns built around the championship will still get through thanks to YouTube and endless replays after the event on, you guessed it, social media.",
    "There's a difference, however, between a Doritos #NowItsHot ad and the company's run of the mill social media broadcasting. We place a certain credence on TV Super Bowl ads because of that expectation of value - of quality over quantity. However, now that the two are increasingly becoming intertwined, we find ourselves placing the same credence on a social Super Bowl campaign.",
    "We know that this is a special ad, that it's original, creative, and - crucially - more than an effort to have you buy a certain brand of chips. It's an attempt to stand out and to have your message stand out, and regardless of the medium, we will always have far more time for brands that go beyond a sales pitch.",
    "Super Bowl ads still matter because they prioritize the very values of advertisement that are sometimes eschewed for the quick, low quality ads we see every day. They challenge brands to speak beyond their products, creating real spectacles and engaging with something beyond their immediate goals. It didn't matter that Doritos was funding Chance The Rapper's collaboration with The Backstreet Boys, the resulting content was bigger than the sum of its parts."
  ],
  "headers": {
    "2": "Quality over quantity?",
    "6": "Larger than life",
    "10": "More than a mere sales pitch"
  },
  "links": {
    "Super Bowl live stream": "https://www.techradar.com/news/watch-super-bowl-live-stream-2021-free-online",
    "Super Bowl commercials": "https://www.techradar.com/news/the-best-ever-super-bowl-commercials-our-favorite-5-of-all-time"
  }
}