{
  "source": "https://www.techradar.com/news/planning-on-buying-a-laptop-stock-issues-could-make-that-trickier-in-the-near-future",
  "title": "Planning on buying a laptop? Stock issues could make that trickier in the near future",
  "category": "computing",
  "updated": "2021-02-11T11:56:59Z",
  "author": "darren-allan",
  "summary": "Component shortages set to be detrimental to the booming laptop market",
  "article": [
    "The PC market has been booming in recent times, driven by the pandemic and scores of people working from home (or learning from home) as a result, but laptop shipments are about to take a turn for the worse, according to a new report.",
    "DigiTimes reckons that shortages of components used in laptops could “dampen notebook shipments” throughout the first quarter of 2021, which is traditionally a quieter time for shipment numbers anyway.",
    "Those parts which are proving particularly troublesome to source include laptop screens and related components (remember we heard about LCD panel shortages back in December 2020, too).",
    "This is going by the industry sources DigiTimes spoke to, but as ever with speculation coming from the supply chain, take it with a healthy degree of skepticism.",
    "On top of this, we’ve also recently heard that PC makers are facing additional problems in terms of logistics, and are falling behind when it comes to fulfilling outstanding orders (and having to explore more expensive means of shipping). All of which adds up to a fairly bleak picture…",
    "As mentioned, laptop shipments are normally slower in Q1, after the post-holiday season demand falls off, and due to the Chinese Lunar New Year celebrations, during which staffing levels are down.",
    "Previously, DigiTimes had indicated that laptop shipment numbers wouldn’t drop during Q1 2021 as much as in previous years, but has now revised that prediction based on these component supply difficulties. As to how much of a fall we might witness in laptop shipments, no hard figures were mentioned.",
    "That said, the industry sources that talked to DigiTimes indicated that Chinese manufacturers are planning to run with a more normal level of output for the Lunar New Year holidays (which is about to begin) in 2021, in order to attempt to offset the problems that will supposedly be caused by these component shortages – at least to some extent.",
    "Laptop makers are also stocking up on these components already, again to help cope with the coming shortages, by all accounts. The fact that action seems to have been taken already to counteract any gremlins in the supply works could mean that the impact on shipments may be minimized, but all of this is speculation – as indeed is the DigiTimes report.",
    "Via Tom’s Hardware"
  ],
  "headers": {
    "5": "Slow start"
  },
  "links": {
    "DigiTimes": "https://www.digitimes.com/news/a20210209PD204.html",
    "LCD panel shortages back in December 2020": "https://www.techradar.com/news/monitors-could-soon-get-pricier-so-you-might-want-to-buy-one-now",
    "falling behind when it comes to fulfilling outstanding orders": "https://www.techradar.com/news/laptops-desktops-shortage-set-to-continue-for-the-foreseeable-future",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/laptop-shortage-in-first-quarter-2021-report"
  }
}