{
  "source": "https://www.techradar.com/news/cobra-kai-season-4-release-date-is-coming-this-year-netflix-confirms",
  "title": "Cobra Kai season 4 release date is coming this year, Netflix confirms",
  "category": "entertainment",
  "updated": "2021-04-22T18:21:20Z",
  "author": "samuel-roberts",
  "summary": "At the end of the year, Cobra Kai makes a comeback",
  "article": [
    "Netflix has narrowed down the release date of Cobra Kai season 4, confirming that the popular Karate Kid spin-off show will return in the final quarter of 2021. The show began production again back in February 2021.",
    "The show joins You season 3, Sex Education season 3, and The Witcher season 2 as other big Netflix hitters landing on the service in the second half of this year. Netflix explains that the glut of big shows and movies coming out is related to how Covid-19 has impacted its productions.",
    "\"What happened in the first part of this year was that a lot of the projects that we’d hoped to come out earlier did get pushed because of the post-production delays and Covid delays and we think we’ll get back to a much steadier state in the back half of the year, certainly in Q4 where we have the returning seasons of some of our most popular shows like The Witcher and You and Cobra Kai as well as some big tentpole movies that came to market a little slower than we’d hoped like Red Notice and Escape From Spiderhead,\" said Netflix's Ted Sarandos this week according to Deadline, as the streamer discussed its earnings.",
    "Cobra Kai began life as a YouTube Premium show – this is the first produced since Netflix acquired the series. Season 3 of the show released back in January of this year, with 45 million Netflix households tuning in.",
    "Two seasons in Cobra Kai in one year is a bit of a treat – especially since many viewers only discovered the show last year when Netflix bought the rights to the series.",
    "The series, following the continued rivalry of Daniel LaRusso (Ralph Macchio) and Johnny Lawrence (William Zabka) years after the events of The Karate Kid, primarily from Johnny's point of view, is one of the easiest series to watch on Netflix. The secret? 30-minute episodes. Not every show needs to be an hour long, and this really hits the spot in more of a sitcom-length format.",
    "Check out our guide to Cobra Kai season 4 for more on what's happening next with the show."
  ],
  "headers": {
    "4": "Cobra Kai continues"
  },
  "links": {
    "Cobra Kai season 4": "https://www.techradar.com/news/cobra-kai-season-4",
    "You season 3": "https://www.techradar.com/news/you-season-3",
    "Sex Education season 3": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Deadline": "https://deadline.com/2021/04/delayed-seasons-of-the-witcher-you-will-return-q4-2021-1234740619/"
  }
}