{
  "source": "https://www.techradar.com/news/powerful-all-amd-gaming-laptops-are-on-the-horizon",
  "title": "Powerful all-AMD gaming laptops are on the horizon",
  "category": "computing",
  "updated": "2021-04-06T11:00:20Z",
  "author": "jess-weatherbed",
  "summary": "The next generation is upon us",
  "article": [
    "Excitement for the launch of the AMD RX 6000 mobile series has been rife since they were announced back in March, alongside the launch of the AMD Radeon 6700 XT graphics card, with a few scattered benchmarks leaking since then to further fan the flames. Thanks to some new information posted by established leaker @TUM_APISAK, a new CPU-Z validation suggests that Asus is developing an all-AMD version of the beloved ROG Strix G15 gaming laptop that will feature a Ryzen 9 5900HX CPU and Radeon RX 6800M GPU.",
    "Previous rumors had been circling that suggested the mobile AMD Radeon offerings would be fairly beastly, and new information provided by APISAK suggests the RX 6800M will come with 12GB of VRAM on a 192-bit bus. Interestingly, this doesn't seem to be a slimmed-down GPU either, with 40 compute units (CUs) suggesting you're getting the full power of Navi 22. The Nvidia mobile GPUs don't perform as well as their desktop namesakes, so an RTX 3070 mobile won't be kicking out the same performance or power as the desktop RTX 3070 card. This isn't to say the unreleased AMD Radeon mobile cards will be running at the same levels as the desktop variants, but the idea of a full-fat Navi 22 GPU inside a laptop is certainly an exciting prospect. As will all leaks and unofficial information, don't take any of this as gospel until we hear it directly from the mouth of Team Red.",
    "The mobile GPUs for the Radeon 6000 series have yet to be officially revealed, which has given Nvidia a comfortable lead in gaming laptop sales. The Nvidia GeForce RTX 3000 series was introduced for laptops back on January 26, after the RTX 3060, RTX 3070 and RTX 3080 mobile cards were announced at CES 2021. In fact, over 70 devices were available at launch with the latest Ampere-powered graphics. With any luck, a fresh injection of gaming laptops will help more gamers get their hands on the latest hardware. The ongoing shortage of silicon and the increasing popularity of crypto mining has resulted in many graphics cards being completely unobtainable for anyone not using bots to buy up inventory. Laptops are sadly not immune from any of these complications of course, as we have no idea how many products will be available with the new Radeon 6000 series mobile hardware at launch, and the continuing Etherium boom has meant not even gaming laptops are safe from being put to work in farming rigs. For now, let's keep our fingers crossed that an official announcement comes soon to shed further light on the situation.",
    "Via Notebook Check"
  ],
  "headers": {
    "2": "Painting the town red"
  },
  "links": {
    "AMD Radeon 6700 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6700-xt",
    "benchmarks leaking": "https://www.techradar.com/news/cant-get-an-rx-6900-xt-amd-gaming-laptops-might-be-here-soon",
    "@TUM_APISAK": "https://twitter.com/TUM_APISAK/status/1379246092152233986",
    "CPU-Z validation": "https://valid.x86.fr/qak83s",
    "ROG Strix G15": "https://www.techradar.com/news/asus-launches-rog-strix-series-of-laptops-and-desktop",
    "Ryzen 9 5900HX": "https://www.techradar.com/news/amd-ryzen-9-5900hx-leak-shows-what-could-be-a-laptop-chip-that-can-be-overclocked",
    "Radeon RX 6800M": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "don't perform as well as their desktop namesakes": "https://www.techradar.com/news/the-new-nvidia-rtx-mobile-gpus-are-here-and-we-put-them-to-the-test",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "CES 2021": "https://www.techradar.com/news/the-best-gaming-laptops-of-ces-2021",
    "Etherium": "https://www.techradar.com/how-to/how-to-mine-ethereum-on-your-pc",
    "put to work in farming rigs": "https://www.techradar.com/news/cryptominers-bulk-buying-rtx-3000-laptops-in-china-to-mine-ethereum",
    "Notebook Check": "https://www.notebookcheck.net/AMD-Radeon-RX-6800M-graphics-card-shows-up-online-alongside-a-Ryzen-9-5900HX-processor-in-an-Asus-laptop.531023.0.html"
  }
}