{
  "source": "https://www.techradar.com/news/nintendo-needs-a-better-virtual-console-now-that-the-steam-deck-is-here",
  "title": "Nintendo needs a better virtual console now that the Steam Deck is here",
  "category": "computing",
  "updated": "2021-07-17T17:00:54Z",
  "author": "bill-thomas",
  "summary": "Opinion: Steam's new handheld will be a paradise for emulators",
  "article": [
    "The Steam Deck has been announced and preorders are open, which means people are going to be able to buy the handheld device (assuming it's not sold out until 2030), and play their entire Steam Library, that likely has games going back to the 90s. But there are going to be some unscrupulous users who aren't just going to play Steam games – they're going to use the platform's open software to run all their favorite classic games from other platforms.",
    "That means that people who have been wanting to play their favorite N64, GameCube and even NES and SNES games will have a way to do it on the go through an emulator, even if it's probably not the way Nintendo wants people to do it.",
    "The Nintendo Switch launched more than four years ago now, and it still has fewer classic games than the significantly weaker Nintendo 3DS. Right now, you can only play the handful of NES and SNES games that Nintendo includes with its online membership. There are 120 games total between these two consoles, and nothing from the N64 or GameCube.",
    "This has always been an oversight from Nintendo, but now that there's a competing handheld that people will be able to use to emulate literally every Nintendo game, it needs to actually put some effort into providing its beloved library to gamers.",
    "It's likely that there are a lot of games in its library where getting the licenses to re-release them would be a nightmare, but that's probably not true for the entirety of Nintendo's catalog. There are probably hundreds of games that Nintendo could release for the Nintendo Switch with minimal effort, and the Steam Deck marks the perfect time for the company to actually do that.",
    "There are probably thousands – if not millions – of Nintendo fans that would love to throw money at Nintendo just to play their favorite games again, and Nintendo should absolutely start catering to that fanbase.",
    "Because if Nintendo doesn't start offering more of its games, Valve isn't exactly going to stop people from running emulators on its platform.",
    "The Steam Deck obviously has the completely opposite approach to its library than the Nintendo Switch. For the most part the Steam Deck is basically just a gaming PC that you can play on the bus, which means that being able to play all your older games would have been expected no matter what.",
    "But Valve took it a step further, and while the Steam Deck will ship with SteamOS installed, it's a completely open platform, and you can even wipe it and install Windows 10 if you so choose (though you will have to fork over the cash for a license).",
    "Even Tim Sweeney had praise for the Steam Deck for its approach to storefronts, and the whole reason the Epic Games Store even became a thing is because he didn't like Steam.",
    "Gamers that go with the Steam Deck are going to be able to play any game they want, no matter how old it is, or even who is selling it. It's an approach that I'm a huge fan of, and I'll definitely be using it to play a bunch of old Final Fantasy games – especially since the Pixel Remasters for Final Fantasy 1-6 aren't going to be released on Nintendo Switch for some reason. I guess that's just another win for the Steam Deck."
  ],
  "headers": {
    "2": "Where are all the games?",
    "7": "A different approach"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Steam games": "https://www.techradar.com/news/the-best-steam-games",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Tim Sweeney had praise for the Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Pixel Remasters for Final Fantasy 1-6 aren't going to be released": "https://www.techradar.com/news/the-best-final-fantasy-game-is-getting-a-remaster-no-not-that-one-again"
  }
}