{
  "source": "https://www.techradar.com/news/new-apple-arvr-headset-leak-gives-more-details-on-incoming-eye-tracking-tech",
  "title": "New Apple AR/VR headset leak gives more details on incoming eye-tracking tech",
  "category": "wearables",
  "updated": "2021-03-20T16:30:36Z",
  "author": "david-nield",
  "summary": "Better than hand controllers",
  "article": [
    "It seems almost certain that an Apple AR/VR headset is on the way in some form or another, and we've now got a better idea of one of the features that any augmented reality or virtual reality wearable might be bringing with it.",
    "As per noted Apple analyst Ming-Chi Kuo (via MacRumors), an upcoming mixed reality headset from Apple will indeed feature advanced eye tracking, enabling user control of functions and mentions, and possibly providing biometric authentication too.",
    "\"Apple's eye tracking system includes a transmitter and a receiver,\" explains Kuo. \"The transmitting end provides one or several different wavelengths of invisible light, and the receiving end detects the change of the invisible light reflected by the eyeball, and judges the eyeball movement based on the change.\"",
    "This eye-tracking system might even replace hand controllers Kuo says, at least in some situations. It could potentially make the headset easier to operate than rival devices, and cut down on processing load because it would know exactly where the user was looking.",
    "This isn't a completely new rumor, as we've been hearing about Apple's interest in eye tracking technology since at least as far back as 2017. The eye-tracking talk resurfaced most recently in a report from the Information published in February 2021.",
    "It now seems as though there are two Apple wearable devices on the way: the one we're talking about here combines augmented reality and virtual reality into what is sometimes called \"mixed reality\" (Microsoft uses the same term for its HoloLens).",
    "It's likely to be a headset that looks more like the VR devices we're accustomed to today – the likes of the Oculus Quest and the HTC Vive – but it will apparently mix completely self-contained digital experiences with augmented reality experiences where computer-generated images are overlaid on the real world.",
    "Then there are the more lightweight Apple Glasses: from what we've heard so far, these will be similar to Google Glass, and will be out much later than the mixed reality headset. Apple may well end up including its eye-tracking technology in this device too."
  ],
  "headers": {
    "4": "Two wearables on the way"
  },
  "links": {
    "Apple AR/VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "MacRumors": "https://www.macrumors.com/2021/03/18/apple-mixed-reality-headset-eye-tracking/",
    "at least as far back as 2017": "https://www.techradar.com/news/apples-eye-tracking-acquisition-points-towards-ar-glasses",
    "published in February 2021": "https://www.techradar.com/news/apples-vr-headset-could-feature-dual-8k-screens-and-an-eye-watering-price-to-match",
    "its HoloLens": "https://www.techradar.com/reviews/microsoft-hololens-2",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses",
    "Google Glass": "https://www.techradar.com/reviews/gadgets/google-glass-1152283/review"
  }
}