{
  "source": "https://www.techradar.com/news/windows-11-spotted-running-android-apps-so-support-could-be-arriving-soon",
  "title": "Windows 11 spotted running Android apps – so support could be arriving soon",
  "category": "computing",
  "updated": "2021-10-15T09:56:57Z",
  "author": "darren-allan",
  "summary": "In preview builds, anyway, but this is a hopeful sign for the full release too",
  "article": [
    "Windows 11 doesn’t boast Microsoft’s promised native support for Android apps yet, as those keen to have it have doubtless noticed if they’ve adopted the new OS, but the good news is that it looks like this much-awaited feature could be coming before too long.",
    "Or at least we’ve caught a glimpse of Android apps now running under Windows 11 in testing, going by a leak from Bilibili (China) as highlighted by Windows Latest.",
    "The theory is – and naturally, take this with some degree of caution, as with any leak – that Microsoft is now testing the Android Subsystem for Windows 11, and that’s exactly what these spilled screenshots (which include a glimpse of WeChat) show.",
    "If testing is underway internally, this indicates that pretty soon we can expect the feature to make its way to the regularly released preview builds of Windows 11 (and subsequently on to the full version of Microsoft’s OS).",
    "It’s a good sign, at any rate, and it’s backed up by the fact that Amazon’s App Store has been present in the Microsoft Store since about a month ago (though it’s not yet available for download, of course). Amazon’s store is how Microsoft will deliver Android apps in Windows 11 (rather than Google Play – and obviously with the limitations therein, as not every app is carried by Amazon, by any means).",
    "What’s also interesting here is that the spilled screen grabs show multiple Android apps open in different windows at the same time, so multi-tasking will be facilitated here, as you might expect. Furthermore, any Android application will act like Windows software, in terms of being able to resize windows and so forth (and they’ll work with the Notification Center too). The more seamless the integration, the better, naturally.",
    "Support for Android apps was something that was expected to debut with the initial version of Windows 11, as mentioned, but as soon as we started getting close to the release of the new OS, with no sign of the feature in test builds, it became clear enough that it wasn’t going to make the cut.",
    "Since then, the question has become exactly how long are we going to have to wait for Android apps to grace the Windows 11 desktop? And at least seeing tangible evidence that testing is underway suggests that we might not have all that long to go – at least until Android support hits the official Windows 11 preview builds. Testing is expected to start before 2021 ends, of course, so we might just see something happen in the next month on that front.",
    "The road to release for the full version of Windows 11 could be a longer and windier one, though, and we must remember that Microsoft has dropped to a cadence of just one major feature update per year – so the next OS upgrade isn’t coming until the second half of 2022. Because this is such a big feature, it may not pitch up until then, but you never know, there’s always the possibility of a feature pack update arriving beforehand, earlier in 2022. We’ll just have to see.",
    "Meantime, Android apps can still be used with Microsoft’s OS as long as you go through the Your Phone app, but that’s a limited way of doing things, and hardly the same as having native support built-in."
  ],
  "headers": {
    "6": "Analysis: An exciting glimpse, but there’s still no official timeframe"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Microsoft’s promised native support for Android apps yet": "https://www.techradar.com/news/windows-11-will-bring-native-android-apps-to-the-microsoft-os",
    "leak": "https://space.bilibili.com/947625",
    "Windows Latest": "https://www.windowslatest.com/2021/10/15/windows-11-leaked-screenshots-give-us-a-first-look-at-android-apps/",
    "Amazon’s store is how Microsoft will deliver Android apps in Windows 11": "https://www.techradar.com/news/why-windows-11-going-with-amazon-for-its-android-apps-and-not-google-is-a-masterstroke",
    "Your Phone app": "https://www.techradar.com/news/windows-10-now-runs-multiple-android-apps-with-your-phone"
  }
}