{
  "source": "https://www.techradar.com/news/mozilla-says-its-new-firefox-vpn-offers-greater-security-than-ever",
  "title": "Mozilla says its new VPN offers greater security than ever",
  "category": "computing",
  "updated": "2021-03-30T15:01:33Z",
  "author": "mike-moore",
  "summary": "Mozilla VPN 2.1 comes a year after its first release",
  "article": [
    "Mozilla, the company behind the popular Firefox browser, has unveiled its second generation VPN as it looks to help keep its users safe online.",
    "Mozilla VPN 2.1 brings a number of new features and tools in an attempt to ensure user data remains secure in the face of growing cyberthreats, as well as a growing move towards remote working.",
    "Now, the company has launched two new features that it says will help give users an added layer of protection online, with its VPN promising encryption and device-level protection.",
    "\"Since our launch last year, we’ve had thousands of people sign up to use our trusted Mozilla VPN service,\" the company wrote in a blog post. \"Mozilla has built a reputation for building products that respect your privacy and keeps your information safe. With Mozilla VPN service you can be sure your activity is encrypted across all applications and websites, whatever device you are on.\"",
    "Mozilla released its first-generation VPN less than a year ago, with the service available across Windows, Android, iOS, Mac and Linux platforms - a great help to businesses looking to assist employees when working from home.",
    "Now, Mozilla VPN is looking to offer extra protection by alerting users when they join a network that is not password protected or has weak encryption. Availabvle now on Windows, Linux and Mac, this alert will allow users to quickly toggle the VPN service on, meaning you don't have to worry about whether it is interfering with other software or services.",
    "The upgraded platform also now offers Local Area Network Access, meaning that a user's devices are able to interact with each other (e.g in a home office) without having to turn the VPN off. Available on Windows, Linux, Mac and Android, Mozilla says this new feature is ideal for home workers who want to keep all their devices connected surely.",
    "The upgraded version of Mozilla VPN s available now for just $4.99 per month across the United States, Canada, the United Kingdom, Singapore, Malaysia, and New Zealand, with more countries expected soon."
  ],
  "headers": {
    "3": "Mozilla VPN 2.1"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}