{
  "source": "https://www.techradar.com/news/the-cambridge-audio-evo-music-streamer-aims-to-link-all-your-tunes-in-one-stylish-package",
  "title": "The Cambridge Audio Evo music streamer aims to link all your tunes in one stylish package",
  "category": "audio-visual",
  "updated": "2021-04-07T16:15:01Z",
  "author": "axel-metz",
  "summary": "Where all your songs belong",
  "article": [
    "Given the innumerable ways you can listen to music nowadays – from the ease of streaming services like Tidal and Spotify to the old school sentimentality of radio – it makes sense to bring all your audio services together into one central system.",
    "It’s good news, then, that British Audio company Cambridge Audio has announced its new all-in-one music player, the Evo – and it might be the best-looking streamer on the market.",
    "The Evo’s minimalist aesthetic should see it slip comfortably into the setups of most living rooms, with a design that takes inspiration from the company’s first ever product, the P40, which launched back in 1968.",
    "A combination of walnut wood side panels and black anodised aluminum keeps things modern, though, and Cambridge Audio says the Evo also comes with a choice of panels made from Richlite, a new material made primarily from recycled paper.",
    "At the front of the all-in-one streamer sits a dual-concentric rotary dial, alongside a 6.8-inch LCD display panel that’ll mean you’ll be able to spot what’s playing from a fair distance – if you can’t already hear it, that is.",
    "The Cambridge Audio Evo is powered by a Hypex NCore Class D amplification, which essentially means the detail of your music is preserved while the system remains compact and energy efficient. It’s available in two models: the Evo 150, rated at 150 watts per channel, and Evo 75, at 75 watts per channel.",
    "As for its connections, Cambridge Audio says the Evo comes packed with a wide array of digital and analogue ports, meaning you’ll be able to link up any source – from your CD player to your turntable. Along with optical, coaxial and RCA inputs, there’s also a TV ARC input for connecting your TV using a HDMI cable.",
    "If you prefer to keep things personal, though, a 3.5mm port will let you plug in your favourite pair of headphones and listen to music at your leisure. You can also connect your wireless devices, too, using the Evo’s built-in Bluetooth connectivity.",
    "As you’d expect from an all-in-one music streamer, at the heart of the Evo lies Cambridge Audio’s StreamMagic platform, which allows you to access any number of streaming services at the tap of a button.",
    "You can use the StreamMagic app or the included remote to easily switch between inputs and play all your music from every connected source. Cambridge Audio says both models use ESS Sabre DACs to ensure all digital music is converted to analogue sound without compromising on detail.",
    "That means you’ll be able to stream music from AirPlay, Spotify, Bluetooth, Chromecast, Tidal and more from one centralised system – which is a pretty handy trick.",
    "The Cambridge Audio Evo 150 and Evo 75 will be available from April 2021, and cost $3,000 / £2,249 (around AU$3,900) and $2,250 / £1,799 (around AU$2,950), respectively."
  ],
  "headers": {
    "8": "Stream queen"
  },
  "links": {
    "streaming services": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "turntable": "https://www.techradar.com/news/best-turntables",
    "StreamMagic": "https://fan.go2jump.org/aff_c?offer_id=6238&aff_id=1&source=trd&aff_click_id=trd-us-1242162126516392000&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-cambridge-audio-evo-music-streamer-aims-to-link-all-your-tunes-in-one-stylish-package&url=https%3A%2F%2Fwww.cambridgeaudio.com%2Fgbr%2Fen%2Fproducts%2Fstreammagic"
  }
}