{
  "source": "https://www.techradar.com/news/european-banks-team-up-to-take-on-us-online-payments-dominance",
  "title": "European banks team up to take on US online payments dominance",
  "category": "computing",
  "updated": "2021-05-04T09:56:39Z",
  "author": "rob-clymo",
  "summary": "Plan aims to offer better value products for the European market",
  "article": [
    "A collection of Europe’s biggest banks and credit card processors are joining forces in an attempt to create a payment giant able to take on a marketplace currently dominated by the US.",
    "The plan, instigated by a Brussels-based company, has a deadline of September in order to develop a set of proposals designed to offer an online and in-store payment structure along with other options for settling bills as well as ATM withdrawals.",
    "Banks so far signed up for the European Payment Initiative (EPI) collaboration include Deutsche Bank, BNP Paribas, ING, UniCredit and Santander, which already process more than half of all payments in Europe. The incentive has also been given support from the European Union, along with financial regulators based in the euro zone.",
    "The project has also attracted a solid level of funding thus far, with €30 million in place for the EPI from backers. “The idea is to build a European payments champion who can take on PayPal, Mastercard, Visa, Google and Apple,” commented Joachim Schmalzl, President of the EPI.",
    "Adding extra weight to the setup is the fact that Schmalzl is on the board of directors for the German Association of Savings Banks and is a keen supporter of the project. However, the initiative has yet to firm up an official brand name.",
    "Currently, the timeline aims to have real-world applications in place and ready for launch by early next year. The objective is to develop a system for real-time payments between consumers, to be followed by a scaled up payments tool for the latter part of 2022.",
    "If successful the new payment processing structure could offer the EU more autonomy, especially as currently card payments are processed in the main by companies based in the US. To underline the dominance of US firms in the payment processing sphere: four out of every five transactions in Europe are processed by Mastercard and Visa, according to lobbying group EuroCommerce.",
    "The move is in response to what the collaboration sees as a market dominance that is detrimental for consumers and traders alike, with relatively high fees adding to what Schmalzl refers to as an ‘oligopoly’. The new payments setup could offer traders and consumers alike more choice, he claims.",
    "However, there have been other attempts to break the US dominance of the payment processing arena. The Monnet Project, for example, was launched in 2011 and had the backing of 24 European lenders, but ultimately failed to produce a workable business model.",
    "Via Financial Times"
  ],
  "headers": {
    "4": "Payment processing"
  },
  "links": {
    "credit card processors": "https://www.techradar.com/best/best-credit-card-processing-service",
    "in-store payment": "https://www.techradar.com/best/best-merchant-services",
    "payments": "https://www.techradar.com/best/best-credit-card-processing-service/news/best-mobile-payment-app",
    "payments tool": "https://www.techradar.com/best/best-merchant-services",
    "card payments": "https://www.techradar.com/best/best-mobile-card-payment-reader",
    "Financial Times": "https://www.ft.com/content/f274255d-eb96-44fe-90e9-fe5532cc47ac"
  }
}