{
  "source": "https://www.techradar.com/news/watch-firefly-aerospaces-new-alpha-rocket-blow-up-in-spectacular-fashion",
  "title": "Watch Firefly Aerospace's new Alpha rocket blow up in spectacular fashion",
  "category": "appliances",
  "updated": "2021-09-03T20:25:34Z",
  "author": "john-loeffler",
  "summary": "While it's not supposed to do that, it still looks cool as hell",
  "article": [
    "Firefly Aerospace's first attempt at getting their Alpha rocket into outer space ended in a spectacular explosion today, and it was thankfully caught on video by a helpful spectator.",
    "A spectator of today's launch by private space company Firefly Aerospace going by Adrian T on YouTube captured the flight of the company's Alpha rocket as it took off from Vandenberg Space Force Base in California and captured the moment the rocket encountered an anomaly shortly before exploding into an impressive fireball.",
    "Firefly Aerospace released a statement on Twitter about the test flight and said the company gathered a lot of valuable data from it, even though it didn't make it into space as planned. Firefly doesn't know yet what caused the anomaly, but we've reached out to the company for more info and we'll update the story if we hear any new details.",
    "While it's tempting to see such spectacular explosions as \"failures\", that's not really the right way to look at rocket launches.",
    "Getting a rocket into space is one of the most difficult feats of engineering there is, which is why we derisively say that simple tasks aren't \"rocket science\". But as with everything science and engineering – not to mention life itself – \"failures\" are often even more important than successes.",
    "Without a doubt, Firefly Aerospace wanted to see their rocket make it into outer space, that's what its entire company is built around, after all. But we learn more about something when things go wrong than when things go right.",
    "The history of successful space flight is built on a legacy of rocket failures like the US's first ever attempt at getting a rocket into orbit in the late 1950s, the Vanguard rocket nicknamed 'Kaputnik' after it blew up on the launchpad but ended up paving the way for the successful Apollo program."
  ],
  "headers": {
    "3": "Analysis: space is hard"
  },
  "links": {
    "spectator of today's launch": "https://www.youtube.com/watch?v=aQFo45F0zN4",
    "released a statement": "https://twitter.com/Firefly_Space/status/1433664059975643161?s=20"
  }
}