{
  "source": "https://www.techradar.com/news/xbox-series-x-restock-for-xbox-insiders-using-xbox-one",
  "title": "Next Xbox Series X restock is exclusive to Xbox One 'Insiders' – here's how to buy it",
  "category": "gaming",
  "updated": "2021-05-17T03:44:15Z",
  "author": "matt-swider",
  "summary": "Microsoft's Xbox Insiders program is introducing the Console Purchase Pilot on the Xbox One console.",
  "article": [
    "Microsoft's Xbox Series X restock strategy is changing today with the introduction of what it calls the 'Console Purchase Pilot', allowing 'Xbox Insiders' located in the US to register for a chance to buy the $499 Xbox Series X and $299 Series S consoles.",
    "Information about registering for a chance to reserve the Xbox Series X is located on the Xbox Insider Hub of the Xbox One interface, according to the official Xbox Insider Twitter account. The tweet notes that space will be limited and not all who register will be able to buy the console, which seems obvious at this point. We've reached out to Microsoft representatives to get information about the restock date and time, and we'll update this and our Twitter when we get an answer.",
    "For the very-much-in-demand Xbox Series X, this represents a new way for Microsoft to sell the real console to gamers instead of shady resellers. That said, it doesn't necessarily help attract gamers who aren't already loyal to the Xbox brand, so expect to see continue to see further Xbox Series X restock opportunities from Walmart, Best Buy, GameStop, Amazon and Target in the coming days and weeks.",
    "We're tracking the Xbox Series X restock offerings at a dozen stores in the US, and our monitoring is working 24/7. Recently, the official Microsoft Xbox store has had new inventory of the Xbox Series X or Series S every week, although this past Sunday at 11:59pm EDT (the usual restock time), we didn't see the Series X drop. This may have something to do with the company gearing up for its new 'Console Purchase Pilot'.",
    "As soon as the Xbox Series X is back in stock, the account of Xbox restock Twitter tracker Matt Swider will send you an alert that looks a lot like this one below.",
    "Click on it to follow Matt Swider and turn on notifications to gets real-time alerts next-gen console alerts.",
    "When the Xbox Insiders program launches, we'll be sure to update this page with details on how it works and how many people report that they were able to buy the console with our help."
  ],
  "headers": {
    "4": "Get Xbox Series X restock alerts"
  },
  "links": {}
}