{
  "source": "https://www.techradar.com/news/mastercard-says-it-will-support-some-cryptocurrencies-soon",
  "title": "MasterCard says it will support some cryptocurrencies soon",
  "category": "computing",
  "updated": "2021-02-11T21:40:10Z",
  "author": "anthony-spadafora",
  "summary": "US payments giant is bringing crypto to its network",
  "article": [
    "US payments giant Mastercard has announced that it will soon start supporting select cryptocurrencies directly on its network to provide customers, merchants and businesses with more choices when it comes to how they use their money.",
    "The move comes after more users have begun using credit cards from Mastercard and other companies to buy crypto assets especially during the recent surge in value of Bitcoin. At the same time, the firm has increasingly seen its customers take advantage of crypto cards to access their assets and convert them into traditional currencies for spending.",
    "However, as this is a big change for Mastercard, the payments giant plans to be quite selective regarding which cryptocurrencies it will support. The decision to offer support for one cryptocurrency over another will be based on the company's principles for digital currencies which focus on consumer protections as well as compliance.",
    "Mastercard won't recommend that its customers start using cryptocurrency but the firm will enable customers, merchants and businesses to move digital value, whether that be traditional or crypto, however they want.",
    "By opening up its network to select cryptocurrencies, Mastercard will create new possibilities for both shoppers and merchants. For instance, merchants may get new customers that have already flocked to digital assets or sellers will be able to build loyalty with their existing customers who want this additional option.",
    "In a new blog post, EVP of digital asset and blockchain products and partnerships at Mastercard, Raj Dhamodharan explained that not all of today's cryptocurrencies will be supported on the company's network. This is because many of the hundreds of digital assets in circulation will need to tighten their compliance measures in order to meet the company's requirements.",
    "Mastercard will support cryptocurrencies that follow local laws and regulations in the regions in which they are used, have consumer protections built-in, include strict compliance protocols including Know Your Customer and are stable enough to be a vehicle for spending and not just investment.",
    "The company is also working with several major central banks worldwide as they review plans to launch new digital currencies called CBDCs (central bank digital currency).",
    "We'll likely hear more from Mastercard once its crypto plans have been finalized but interested users can already obtain a crypto card from the payments giant through its partnership with Wirex and BitPay last year."
  ],
  "headers": {
    "4": "Cryptocurrency support"
  },
  "links": {
    "Mastercard": "https://www.techradar.com/news/new-mastercard-launch-allows-fast-and-secure-cross-border-payments",
    "cryptocurrencies": "https://www.techradar.com/news/what-is-bitcoin",
    "recent surge": "https://www.techradar.com/news/bitcoin-price-hits-new-record-high-after-tesla-confirms-dollar15bn-purchase",
    "blog post": "https://www.mastercard.com/news/perspectives/2021/why-mastercard-is-bringing-crypto-onto-our-network/",
    "Know Your Customer": "https://www.techradar.com/news/why-centralized-kyc-will-never-be-viable",
    "crypto card": "https://www.techradar.com/news/mastercard-inks-cryptocurrency-card-deal-with-london-based-wirex"
  }
}