{
  "source": "https://www.techradar.com/news/oneplus-9t-is-canceled-and-oneplus-10-will-feature-brand-new-software",
  "title": "OnePlus 9T is canceled, and OnePlus 10 will feature brand new software",
  "category": "phones",
  "updated": "2021-09-20T12:00:00Z",
  "author": "james-peckham",
  "summary": "Confirmed by OnePlus CEO Pete Lau",
  "article": [
    "Expecting a OnePlus 9T this year? OnePlus CEO Pete Lau has confirmed it won’t be introducing a T-series product later in 2021.",
    "In a briefing where TechRadar was present, Lau said, “We will have a new product to be launched, but this year we will not be launching a T-series product.”",
    "It’s unclear what product Lau is referring to, and it may be that this is a new iteration of its Nord series, or the leaked OnePlus 9 RT which is apparently a T version of the mid-range OnePlus 9R which didn't come out in many regions.",
    "This likely means you’ll be waiting until the OnePlus 10 to see a new flagship smartphone from the brand, which we don’t currently expect to land until early 2022.",
    "This news had been leaked from a variety of different sources, but this is the first time we've heard the information directly from OnePlus.",
    "Often, OnePlus will introduce a flagship handset near the start of year and then a further iteration - known as the T-series - will then be introduced around six months later.",
    "For example, the OnePlus 8 was revealed in April 2020 and followed by a OnePlus 8T in October of the same year.",
    "Lau's comments were made around the company's integration with fellow smartphone manufacturer Oppo.",
    "OnePlus and Oppo have now announced that it will unify its codebase between both manufacturers and it will combine OxygenOS software with ColorOS. That means you'll see this unnamed software platform on future OnePlus phones as well as future Oppo phones.",
    "Lau said in a blog post, \"By combining our software resources to focus on one unified and upgraded operating system for both OnePlus and Oppo devices globally, we will combine the strengths from both into one even more powerful OS: the fast and smooth, burdenless experience of OxygenOS, and the stability and rich features of ColorOS.\"",
    "The company has also confirmed that its 2022 flagship - likely, though not confirmed, to be called the OnePlus 10 - will be the first device from the company to feature the new software.",
    "It'll then roll it out with future software updates to existing devices from the OnePlus 8 onwards. We've yet to hear which Oppo products will receive the new software, but we'll be sure to update this article when we hear more.",
    "The global chipset shortage is likely the culprit behind OnePlus choosing not to introduce a new smartphone in the latter months of 2021.",
    "Samsung didn’t introduce the Galaxy Note 21 due to a similar issue, and while Lau didn’t comment on the reasons, we do expect it may be part and parcel of why the company won’t introduce a OnePlus 9T.",
    "There’s also the fact the OnePlus 9 and OnePlus 9 Pro are suitably great smartphones. The latter appears very high on our ranking of the best smartphones, so the company may not see much reason to introduce a OnePlus 9T.",
    "With the company’s attention now moving to other areas such as mid-range smartphones and its new integration with Oppo, it may be that we see some changes in the cadence to OnePlus smartphones over the next few years."
  ],
  "headers": {
    "7": "New software changes for OnePlus",
    "12": "Analysis: Why is OnePlus choosing this route?"
  },
  "links": {
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "OnePlus 9 RT": "https://www.techradar.com/news/oneplus-9rt-may-be-real-suggests-a-specs-leak",
    "OnePlus 9R": "https://www.techradar.com/reviews/oneplus-9r",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "best smartphones": "https://www.techradar.com/news/best-phone"
  }
}