{
  "source": "https://www.techradar.com/news/huawei-puts-software-and-intelligent-vehicles-at-heart-of-new-strategy",
  "title": "Huawei puts software and intelligent vehicles at heart of new strategy",
  "category": "computing",
  "updated": "2021-04-13T12:32:04Z",
  "author": "steve-mccaskill",
  "summary": "Huawei diversifies its portfolio amid mobile challenges",
  "article": [
    "Huawei says it is shifting its focus towards software development and intelligent vehicle components to boost its resilience against the political challenges that have hampered its traditional strengths in devices and networks.",
    "The Chinese firm has endured a difficult couple of years following the imposition of sanctions that have severely limited its access to American technologies as well as moves by several governments to restrict its role in the rollout of 5G networks in their countries.",
    "The measures have ended any ambition of becoming the world’s leading smartphone manufacturer, while its carrier business has suffered from being excluded from several key markets – including the UK.",
    "Although domestic demand allowed Huawei to increase revenues and profits in 2020, there is an understanding that this is not a long-term solution.",
    "The company still plans to play a major role in the development and standardisation of key network technologies – including 5G and ‘5.5G’ – but will diversify into other areas that are less reliant on access to advanced process techniques than smartphones.",
    "“Moving forward, we will continue to find ourselves in a complex and volatile global environment. Resurgence of COVID-19 and geopolitical uncertainty will present ongoing challenges for every organisation, business, and country,” said Eric Xu, Huawei rotating chairman.",
    "“We believe deeply in the power of digital technology to provide fresh solutions to the problems we all face. So we will keep innovating and driving digital transformation forward with our customers and partners to bring digital to every person, home and organisation for a fully connected, intelligent world.”",
    "Huawei has identified several fields where it can establish leadership and plans to direct its research efforts accordingly. These include advanced network technologies that can support a greater number of connections and use cases, the development of advanced computing power and industrial AI applications, and denser storage systems.",
    "There are also ambitions to create multi-modal experiences that combine computing and sensing, telehealth applications, and intelligent energy systems that can help combat climate change.",
    "“In the decade to come, we can expect to see many great improvements in society,” added William Xu, Director of the Board and President of Huawei's Institute of Strategic Research. “To promote these efforts, we hope to join forces with different industries, academia, research institutes, and application developers to address the universal challenges facing humanity. With a shared vision, we all have a role to play as we explore how to make connections stronger, computing faster, and energy greener.”",
    "Huawei recently agreed to sell its Honor smartphone subsidiary, while it also plans to charge royalties for the use of its patents in 5G devices."
  ],
  "headers": {
    "3": "Huawei patents"
  },
  "links": {
    "Huawei": "https://www.techradar.com/deals/huawei-mobile-phone-deals",
    "imposition of sanctions": "https://www.techradar.com/news/huawei-urges-uk-to-reconsider-5g-ban-after-trump-defeat",
    "5G networks": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Honor smartphone subsidiary": "https://www.techradar.com/news/honors-first-huawei-less-phone-could-be-coming-soon",
    "charge royalties": "https://www.techradar.com/news/huawei-says-it-will-start-charging-royalties-on-every-5g-phone-sold"
  }
}