{
  "source": "https://www.techradar.com/news/microsoft-is-making-windows-11-less-annoying",
  "title": "Microsoft is making Windows 11 less annoying",
  "category": "computing",
  "updated": "2021-12-06T11:30:59Z",
  "author": "jamel-smith",
  "summary": "Windows 11 keeps on improving",
  "article": [
    "Microsoft is working on a new Windows 11 feature that’ll remember if you turned on Wi-Fi or Bluetooth while the computer was in Airplane mode.",
    "With the current version of Windows 11, if you open the Quick Settings menu and click on Airplane mode, this would disable all wireless connections like Wi-Fi, Bluetooth and cellular networks.",
    "However, Microsoft is changing the feature, so if you turn on Bluetooth while your computer is in Airplane mode, Windows will automatically remember your preference, and Bluetooth will already be enabled when you next turn on Airplane mode. This is promised to make it easier to keep you connected to headphones while traveling.",
    "Microsoft is also working on some new improvements for the Windows 11 Notification Center, adding a new feature where three high-priority notifications can be stacked and shown at the same time. The idea is that apps that have high-priority notifications like alarms, calls and reminders can use this feature, which can currently be tested out in the latest preview update.",
    "This new improvement could reduce clutter in the notification feed, as it’ll now house up to four notifications at the same time; one normal notification and three high-priority notifications.",
    "Plus, Microsoft is also working on more customization options for the Start menu and taskbar. The new options will allow users to display more apps and recommendations in the Start menu.",
    "However, Microsoft hasn’t provided a date for when these updates will officially arrive, but we can see them being a part of the next big Windows 11 update - which could arrive around October or November 2022."
  ],
  "headers": {
    "3": "Improvements for Windows 11 notification center"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/reviews/windows-11"
  }
}