{
  "source": "https://www.techradar.com/news/flexibility-the-key-to-successful-working",
  "title": "Flexibility: The key to successful working",
  "category": "computing",
  "updated": "2021-05-05T13:24:17Z",
  "author": "andy-wilson",
  "summary": "Flexibility empowers staff to flourish, wherever they may be",
  "article": [
    "The way we work has undergone a significant shift over the past year, with the majority of the workforce transitioning to home working almost overnight. Even as we start to transition out of lockdown, in one form or another, remote working is here to stay. How businesses and individuals adapt to this change will shape future working life.",
    "Employees have been calling for greater flexibility in how and where they work for years, and it’s these evolving demands that will characterize the world of work next year.",
    "Up until the pandemic, much of our working life was based in and around the office; a space for making connections and facilitating in-person collaboration. But while many of us have missed physically being with our colleagues, working at home has given us the chance to spend more time with our families and freedom to manage our personal lives. It turns out none of us really miss battling to book meeting rooms, remember that? In fact, research has shown that 90% of employees now say that they would like to continue to work from home after the pandemic.",
    "As we ease out of lockdown, many offices will become spaces purely for collaboration and connectivity, in ways that cannot be achieved at home – and an important aspect of this will be their physical design.",
    "No longer will offices be just a gathering of desks and individual workspaces to go about your everyday routine. Instead, they will be floors structured into breakout hubs for team building - and rooms covered with whiteboards. As a result, our time spent in these spaces will become more intentional, such as meeting with colleagues to brainstorm on ideas - and it is this shift in mindset that will allow greater flexibility in how people work, both in a team and individually.",
    "One of the key benefits of remote work is the ability to tailor your working hours to suit your personal situation. We’re beginning to see employees take much more control over their own time, while meeting their work demands and enjoying greater flexibility – which doesn’t always resemble a linear eight-hour day.",
    "An example of this is putting in place core collaboration hours. This means that every employee has a four-hour window in the day for synchronous collaboration (i.e. meetings).",
    "This doesn’t mean workdays are shortening to four hours - instead it allows businesses to help employees draw boundaries between when synchronous collaboration (responding to teammates, discussing ideas, etc), and asynchronous work (individual work to complete outside of meetings, or time for “deep work”), should happen.",
    "By giving employees the flexibility and autonomy to take control of their day, companies can allow them to work in the way that is best for them. Mental health is a vital aspect of this as remote working can lead to an “always on” attitude. However, by setting boundaries with team members and communicating openly about working hours, we can encourage employees to switch off and spend time doing the things they love.",
    "Being in the office always enabled us to learn valuable insights from colleagues and peers on the job. But, when done right, remote working can also provide these opportunities and ensure that no one is left behind.",
    "Creating formal training, onboarding and buddy systems are great ways to make sure that everyone has access to senior leaders, the tools they need to do their job well, and the continued chance to upskill.",
    "Outside of traditional on-the-job training, employees learn from building their everyday relationships. In order to maintain company culture in a remote working setting, for example, businesses need to purposefully recreate the conversations co-workers have while bumping into each other grabbing a coffee.",
    "Businesses can also hold “ask me anything” style forums, and a series of informal at-home “fireside chats” with executives that are open to the whole company. This helps to make leaders more accessible to the wider workforce, while making work feel more human.",
    "No one can truly say what the future will hold for the world of work, but one thing is clear: remote working is here to stay.",
    "It is imperative that businesses hone in on the mental wellbeing of their employees during this time, and find a solution that offers greater agility; as well as equipping them with the tools for closer collaboration. Those that do so will quickly distinguish themselves from the competition and reap the rewards.",
    "Working from home has been a challenge for many of us, and so moving forward, business leaders will focus on easing the bumps of the past year. A lot of this comes down to a mindset shift in how companies operate, and the flexibility that is needed to empower staff to flourish, wherever they may be."
  ],
  "headers": {
    "2": "The transformation of physical office space",
    "5": "Non-linear workdays",
    "9": "Ensuring a level-playing field",
    "13": "The future of work"
  },
  "links": {
    "home working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}