{
  "source": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
  "title": "Loki TV show on Disney Plus: release date, trailer, cast, plot, MCU connections and more",
  "category": "entertainment",
  "updated": "2021-06-04T15:56:19Z",
  "author": "emma-boyle",
  "summary": "More stories to tell, more mischief to make",
  "article": [
    "Everybody loves a good villain, right? Even though his adoptive brother took top billing in the original Thor movie, Tom Hiddleston’s Loki was instantly the star attraction. This manipulative Norse god of mischief was always the kind of charismatic bad guy movie fans love to hate – even when he was giving Iron Man, Captain America and the rest the runaround in the original Avengers movie. That’s why the new Loki TV show on Disney Plus is such an exciting proposition.",
    "Focussing on the Asgardian’s Infinity Stone-powered exploits after escaping with the Tesseract in Avengers: Endgame, the six-part series will see Loki jumping through time, meddling with history. This brings him into the orbit of the Time Variance Authority, an organisation with a mission to keep the Marvel Cinematic Universe’s timelines flowing as they should.",
    "Following on from WandaVision and The Falcon and the Winter Soldier, the Loki TV show is the MCU’s latest venture onto Disney Plus. It’s also the next step in the ambitious Phase 4 of Marvel’s epic storytelling endeavor – which will return to the big screen in July with Black Widow.",
    "So ahead of its June 9 release date, we’ve pulled together multiple timelines to explain everything you need to know about the Loki TV show on Disney Plus, including its cast, story, trailers and connections to the wider MCU.",
    "Originally confirmed for release on June 11, 2021, Loki has now been brought forward slightly, arriving two days earlier than expected on June 9, 2021.",
    "That also means new episodes of the six-episode season will arrive on Disney Plus on Wednesdays – a break with the trend established by previous high-profile Disney Plus shows such as The Mandalorian, WandaVision and The Falcon and the Winter Soldier, which all debuted on Fridays.",
    "Loki was originally planned for a release in May 2021, but the dates shifted in February 2021.",
    "The first full trailer for Loki was released as part of Disney’s Investor day in December 2020. It offered our first look at Owen Wilson's Mobius M. Mobius, a member of the Time Variance Authority (TVA), who will play a big role in this show.",
    "This second trailer, released in April 2021, introduces extra characters and gives more hints at how Loki's story ties into that of the Time Variance Authority – while also showing us a little more of the Brazil-like, bureaucratic nightmare world of the TVA.",
    "Caution: the following section contains spoilers for Avengers: Endgame.",
    "If you're asking yourself, “Didn't I see Loki die in Avengers: Infinity War?”, you're not wrong. The god of mischief was murdered by Thanos in the opening act of that movie, and that version of the character remains dead.",
    "But if you watched Avengers: Endgame, you'll remember that in the course of the team's time-jumping escapades in that movie, Tony Stark (Iron Man), Scott Lang (Ant-Man), Steve Rogers (Captain America) and Bruce Banner (Hulk) go back to the battle of New York in 2012. Their actions in this scene result in Loki – the Loki who was the antagonist in the original Avengers movie – escaping capture with the Space Stone, housed within the Tesseract. This act creates a branching timeline.",
    "The Loki TV show follows Thor's brother into this new continuity, so it's worth remembering that this isn’t going to be the Loki we saw evolve over the course of the Avengers movies and Thor sequels – this is the god of mischief who's just been humiliated by Stark, Rogers and the other Avengers, so he's unlikely to be operating on the side of the good guys.",
    "Tom Hiddleston has confirmed that the new series will answer some huge questions raised by Avengers: Endgame concerning the fate of the trickster god. Hiddleston had this to say about the show during an appearance on The Late Show With Stephen Colbert:",
    "\"In the years since Avengers: Infinity War and Avengers: Endgame, which came out this Spring… Two questions I’ve been asked are 'is Loki really dead?' and 'what’s Loki doing with that cube?' It’s always the cube somehow. And this series will answer both of those questions.”",
    "\"In many ways it's the character you know, but in a context you’ve never seen him in before,\" Hiddleston told Entertainment Weekly.",
    "Fans also think they've spotted an Avenger in the trailer – Natasha Romanoff, aka Black Widow. See for yourself below.",
    "The first trailer for the Loki TV show saw the title character messing around in the past – indeed, it's strongly implied he's legendary criminal DB Cooper, who stole $200,000 back in 1971 before disappearing after jumping from an aircraft. These timeline-altering activities presumably tie into how Loki ends up in the hands of the Time Variance Authority, who in Marvel's comics, monitor the various timelines of that fictional multiverse and keep reality in check. Going on what we've seen in the second big Loki TV show trailer, TVA agent Mobius M. Mobius will enlist the Asgardian to help fix the damage he's done.",
    "In an interview with MTV, Hiddleston teased that in the series Loki will “come up against more formidable opponents, the like of which he has never seen”. It's unclear to what extent the TVA will act as the villains of the show, though this teaser offers a few hints at how the organisation operates:",
    "The Loki TV show is expected to be a crime thriller, and we're looking forward to a funny show, given the credentials behind the scenes. The lead writer on the series is Michael Waldron (who's worked in the Rick and Morty writers' room), while Sex Education's Kate Herron is the series' director.",
    "Other than what we've learned from the trailers, the events of the series and what part it’s going to play in the wider Phase 4 is still something of a mystery. Kevin Feige has, at the very least, hinted that the Loki TV show will tie into the Doctor Strange sequel, Doctor Strange in the Multiverse of Madness, which is expected to release in 2022.",
    "Seeing as Waldron is also a writer on the Doctor Strange sequel, expect some strong story links between the two multiverse-themed Marvel projects.",
    "It’s long been confirmed that Tom Hiddleston will be reprising his role as Loki, a part he’s been playing since the first Thor film was released in 2011 – after three Thor movies and three Avengers outings, the Loki TV show will be his seventh outing in the role.",
    "Owen Wilson will play the Time Variance Authority’s Mobius M. Mobius, an agent who originated in the comics, and will apparently be Loki’s handler in the TV show.",
    "His TVA boss, Judge Renslayer (who pops up a couple of times in the trailers) will be played by The Morning Show’s Gugu Mbatha-Raw. “It’s unlike any other character I’ve played before,” she told Total Film magazine. “She has quite a lot of power, so that’s been interesting, because she’s somewhat of an authoritative character. But then we start to see the cracks that begin to show within that.”",
    "Indeed, there's been plenty of speculation that Judge Renslayer is actually Ravonna Renslayer, a character from the Marvel comics. There she was the daughter of a 40th century ruler of Earth named King Carelius. Renslayer eventually got together with Kang the Conqueror, who – probably not by coincidence – will be the villain in the upcoming Ant-Man threequel, Quantumania. In other words, it looks like Loki won't just be setting up Doctor Strange in the Multiverse of Madness.",
    "The TVA’s enforcer, meanwhile, is Hunter B-15, played by Lovecraft Country’s Wunmi Mosaku. “Mobius is in a coat and tie and almost would be like a G-Man,” Wilson explained to Total Film. “Whereas Hunter B-15 is a badass soldier. They have the same goals, but very different methods and ideas on how that is going to be accomplished.”",
    "Beyond that, in true MCU tradition, there’s a good bit of mystery surrounding the characters other actors will play in the show. Sophia Di Martino (Flowers), Sasha Lane (Hellboy) and Richard E. Grant (Withnail and I) have all been cast in the Loki TV show but the characters they will play are yet to be confirmed.",
    "It's also been reported (via Deadline) that Jamie Alexander could reprise her role from the Thor movies as Asgardian warrior Lady Sif, but nothing official has been announced just yet.",
    "The Loki TV show’s writer Michael Waldron has apparently just signed a big deal with Disney, as of January 2021. That includes working on the – as-yet unconfirmed – Loki season 2, according to a report from Deadline – not to mention a new Star Wars movie produced by Marvel Studios boss Kevin Feige.",
    "So while not every Disney Plus Marvel show is expected to return for a second season – with some envisioned as limited series – Loki looks likely to continue further down the line."
  ],
  "headers": {
    "4": "Loki TV show release date: June 2021",
    "7": "Loki trailer: see the show in action",
    "9": "Loki's story: what's the show about?",
    "22": "Loki TV show cast: who's involved in the show?",
    "29": "Loki season 2 looks like it's happening, too"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "brought forward slightly": "https://www.techradar.com/news/disney-plus-is-dropping-loki-slightly-early",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Entertainment Weekly": "https://ew.com/tv/2019/08/01/tom-hiddleston-loki-series-disney-plus/",
    "DB Cooper": "https://en.wikipedia.org/wiki/D._B._Cooper",
    "MTV": "https://www.youtube.com/watch?v=e_MLd7PRdbQ",
    "Sex Education": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know",
    "hinted": "https://www.techradar.com/news/loki-tv-show-will-tie-into-doctor-strange-2-making-disney-plus-a-necessity-for-fans",
    "Total Film": "https://www.gamesradar.com/uk/totalfilm/",
    "upcoming Ant-Man threequel, Quantumania": "https://www.techradar.com/news/ant-man-3-could-see-the-return-of-an-old-mcu-villain",
    "Deadline": "https://deadline.com/2021/01/loki-michael-waldron-kevin-feiges-star-wars-movie-as-part-of-newoverall-deal-with-disney-1234665495/"
  }
}