{
  "source": "https://www.techradar.com/news/steam-deck-pre-orders-flood-in-and-512gb-model-now-isnt-shipping-for-a-year",
  "title": "Steam Deck pre-orders flood in and 512GB model now isn’t shipping for a year",
  "category": "gaming",
  "updated": "2021-07-17T11:32:53Z",
  "author": "darren-allan",
  "summary": "Those reserving now won’t get their top-end model until Q3 2022",
  "article": [
    "Steam Deck pre-orders flooded in when they went live yesterday, and on Valve’s page for the handheld PC, devices are shown as not shipping until Q2 at the earliest in the US – and Q3 for the top-end version – so perhaps unsurprisingly, pre-ordered machines are already on sale via eBay for extortionate markups.",
    "Yes, this is an all-too-familiar situation these days when a piece of hardware proves to be in demand, and the Steam Deck certainly appears to be on a lot of shopping lists for gamers out there.",
    "So much so that when the device went up for pre-order yesterday, a lot of folks were complaining about not being able to bag a reservation due to the website crashing, or the checkout process failing, and other thorny issues preventing a purchase. One thing’s for sure, though, namely that a lot of pre-orders were made, hence the availability date for the Steam Deck being pushed back.",
    "The official announcement declared that the Steam Deck will be available in December and start shipping from then onwards, with the first pre-orders being served first.",
    "However, in the US you are now looking at a ship date of Q2 in 2022, meaning April onwards, and the situation is even worse for the Steam Deck with 512GB of storage which won’t be made available until Q3. In other words, July 2022, or a year from now.",
    "The situation in the UK is the same, but slightly better when it comes to the base Steam Deck which still has an availability date of Q1. How long that will last is up for debate, but probably not a great deal longer at a guess.",
    "Also, the catch with that entry-level device is that it only has 64GB of storage space, and as we’ve already pointed out elsewhere, realistically that’s not really enough for PC gaming. Plus it’s eMMC storage as well, meaning it’s a good deal slower than the NVMe SSDs featured on the other Steam Deck models.",
    "While Valve implemented preventative measures to stop scalpers from creating multiple Steam accounts to buy up and resell a number of devices – at least initially, as new accounts aren’t eligible to make a reservation until tomorrow – that hasn’t stopped pre-order machines going up for sale on eBay. That said, it will doubtless have helped limit the amount of this kind of scalping going on, but price gouging is still evident.",
    "As PC Gamer reports, a 512GB model already sold for $1,599 on eBay, and the top-end Steam Deck with that amount of storage is currently available for around $1,250 on ‘Buy it now’, almost double Valve’s asking price of $649.",
    "Why pay so much? Forking out way over the odds is becoming more tempting for those with a lot of cash sloshing around and the desire to have a Steam Deck handheld sooner rather than later, because with those ship dates getting pushed further back, buying an earlier reservation will, of course, mean you’re jumping the queue."
  ],
  "headers": {
    "7": "Serious reservations"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "page for the handheld PC": "https://store.steampowered.com/steamdeck",
    "we’ve already pointed out elsewhere": "https://www.techradar.com/news/dont-buy-the-base-model-steam-deck",
    "preventative measures to stop scalpers": "https://www.techradar.com/news/valve-aims-to-kill-off-scalping-with-steam-deck-pre-orders",
    "PC Gamer": "https://www.pcgamer.com/steam-deck-reservations-are-already-selling-on-ebay-for-absolutely-stupid-prices/",
    "Steam Deck handheld": "https://www.techradar.com/news/steam-deck-vs-nintendo-switch-oled-two-different-approaches-to-handheld-gaming"
  }
}