{
  "source": "https://www.techradar.com/news/evidence-mounts-the-samsung-galaxy-note-21-will-have-an-under-screen-front-camera",
  "title": "Evidence mounts the Samsung Galaxy Note 21 will have an under-screen front camera",
  "category": "phones",
  "updated": "2021-01-20T10:06:19Z",
  "author": "tom-bedford",
  "summary": "A trademark emerges",
  "article": [
    "The Samsung Galaxy Note 21 could have an under-display front camera that's invisible to the naked eye, according to some early hype, but these assertions seem a lot more plausible thanks to a trademark filed by Samsung.",
    "As spotted by GizChina, Samsung has trademarked the term 'UPC' or 'Under-Panel Camera', with the Korea Intellectual Property Office, as a new marketing term for smartphone and TV displays.",
    "The trademark doesn't go into detail on the UPC - the listing is for the name, not the actual tech - but it's a pretty self-explanatory title. This seems to be a trademark for cameras that sit under smartphone or TV screens.",
    "Sure, there's no confirmation this is for the Samsung Galaxy Note 21, but when you put this news alongside the myriad other leaks and rumors suggesting that Samsung is working on an under-display front camera for a phone, it makes it seem pretty likely - though the Samsung Galaxy Z Fold 3 is also a likely candidate.",
    "Samsung isn't the only company we've heard is working on an under-display camera, though as far as we can tell it's the only one to have trademarked a marketing name for it.",
    "Oppo previously showed off a concept device with a front-facing snapper housed under its screen, and we've also heard Google and Xiaomi are working on similar things.",
    "The real front-runner in this race is ZTE though, as its Axon 20 5G smartphone has an under-display front camera, and it's available to buy in some regions right now.",
    "Perhaps by the end of 2021 we'll have seen several phones with this novel snapper placement, from a few different companies.",
    "Via PhoneArena"
  ],
  "headers": {
    "4": "The under-display camera race"
  },
  "links": {
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "GizChina": "https://www.gizchina.com/2021/01/19/samsung-sub-screen-camera-will-be-used-in-smartphones-laptops-and-tvs/",
    "the Samsung Galaxy Z Fold 3 is also a likely candidate": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-an-under-display-camera",
    "concept device": "https://www.techradar.com/news/this-phone-of-the-future-has-no-buttons-ports-bezels-or-visible-selfie-camera",
    "Axon 20 5G": "https://www.techradar.com/news/zte-axon-20-5g-the-worlds-first-phone-with-an-under-display-camera-is-on-sale-now",
    "PhoneArena": "https://www.phonearena.com/news/Samsung-files-trademark-for-name-of-under-screen-camera_id129613"
  }
}