{
  "source": "https://www.techradar.com/news/nasa-reviewing-a-dozen-private-space-station-bids-that-could-save-the-agency-dollar1-billion-a-year",
  "title": "NASA eyeing a dozen private space station bids, could save the agency $1 billion a year",
  "category": "appliances",
  "updated": "2021-09-21T20:20:40Z",
  "author": "john-loeffler",
  "summary": "SpaceX, Blue Origin, and Boeing are some of the notable bidders",
  "article": [
    "NASA announced this week that it has fielded proposals from about a dozen private space companies to build privately run space stations in Low Earth Orbit, which it anticipates will ultimately save the agency $1 billion to $1.5 billion a year and allow it to focus more on deep space exploration.",
    "The news also comes as NASA announced that it is restructuring its Human Exploration and Operations Mission Directorate into two new directorates within the agency. The first, called Exploration Systems Development (ESD), will be led by former associate NASA administrator Jim Free.",
    "Kathy Lueders, currently heading up the Human Exploration and Operations Mission Directorate, will run a second new directorate, known as Space Operations (SO), which will take over responsibility for missions and systems that successfully pass out of ESD, including new commercially developed space stations, orbital flights, and missions to the moon, Mars, and beyond.",
    "The news about the transition to private space stations, courtesy of CNBC, comes as recent news reports underscore how much the International Space Station (ISS) has aged. Superficial cracks have spread along the surface of at least one of its modules, the station suffered a disruptive anomaly from a misfiring thruster on a docked Russian module, and air pressure drops have been reported in the crew living section of the station, indicating a potential air leak.",
    "The station has been continuously occupied since 2000, and 21 years is a long time to be exposed to the ravages of the vacuum of outer space. The ISS is slated to continue operations through 2024, with the possibility of extending its mission to 2028, but with the Russian Federation indicating that it won't be sticking around past 2024, the ISS is understandably coming to the end of its service.",
    "The ISS costs NASA about $4 billion a year to operate, which is a substantial sum considering it has its eye squarely set on the Artemis moon mission, slated for returning humans to the moon as early as 2025.",
    "NASA's restructuring also isn't a surprise given its renewed focus beyond Earth's orbit. In a town hall with NASA staff announcing the splitting off of the two directorates, NASA administrator Bill Nelson said that whatever plans NASA might be entertaining, the Artemis mission must come first before anything else.",
    "\"That’s our focus, that’s our responsibility,” Nelson said. “There’s so much new technology that has to be developed for the moon and Mars, as well as cultivating the international partnerships that are going to be with us.\"",
    "Nelson also stressed that this shouldn't be seen as demoting or pushing aside Lueder, who guided NASA's wildly successful partnership with private companies like SpaceX and United Launch Alliance (ULA) through NASA's Commercial Crew Program for the past several years.",
    "Instead, it's a recognition that as the scope of NASA's ambitions grows, the structure of the agency must evolve with it. Nelson said that the responsibilities of managing orbital flights, a space station, and now the Artemis mission simply \"got too big. One person can’t do it all.\"",
    "The primary focus of the ESD directorate will now be developing the kind of technology that NASA will need to safely send astronauts, including the first woman and the first person of color, to the moon and return them to Earth safely, including the construction of a Gateway space station in orbit around the moon that will help facilitate the construction of a permanent settlement of its surface.",
    "There is no getting around the fact that none of this would be happening without SpaceX. There are several major private space companies currently operating and partnering with NASA to ferry supplies to the ISS and deliver payloads into orbit, but nearly all of them are restructured or joint ventures between companies like Lockheed Martin, Northrup Grumman, and Boeing.",
    "These are all legacy military and aerospace contractors who have been working with the US government since the 1960s and who enjoyed a steady flow of lucrative contracts for decades, but whose inevitable bloat is starting to show.",
    "Boeing and SpaceX were both awarded contracts for a crew capsule that fly astronauts to the ISS from American soil, freeing NASA from having to rely on – and pay for passage on – Russia's Soyuz rocket. The race to see which company could get its crew capsule into space first, docked with the ISS using an uncrewed capsule, and ultimately fly astronauts to the ISS should have been a close one, but it turned out not to be the case.",
    "Boeing suffered a dispiriting setback when its Starliner crew capsule encountered a thruster anomaly during its uncrewed mission in December 2019 where it failed to dock with the ISS. Since that mission, Boeing has been unable to return Starliner to space, with another launch failure occurring on the launchpad in early August when an \"unexpected valve position\" sent the Starliner back to its hanger and scrubbed any hope of another launch attempt before 2022.",
    "Meanwhile, not only has SpaceX been ferrying cargo to the ISS for years, and safely delivered 10 astronauts to the station, last week's successful Inspiration4 mission was crewed entirely by civilians and was fully operated by SpaceX, all without NASA involvement.",
    "That NASA is making these announcements and changes now could be a coincidence, but SpaceX having crossed the threshold of successfully commercializing LEO without government assistance last week speaks to the sophistication of its engineering and its experience conducting space operations, and is an important signal that commercial space operations has reached a level of maturity that frees up NASA from holding everyone's hand.",
    "One of the major stories of this modern era of space flight is that SpaceX is the prototypical tech company while standing out for this exact same reason. The tech industry is typically overenthusiastic about \"disrupting\" industries it perceives as calcified and inefficient, when in most cases a company's success has more to do with hype, labor arbitrage, and clever tax gimmickry, not to mention non-existent regulation of its worst (and most profitable), practices.",
    "Elon Musk can be a divisive figure for many people, myself included – don't even get me started on the Tesla Bot – but there is simply no denying that Musk and SpaceX have completely run circles around a US military-industrial complex that has spent decades milking US government contracts without showing significant returns on those investments in the post-Apollo era.",
    "SpaceX is consistently outbidding companies like Lockheed Martin, Boeing, and others who aren't used to having to bid low to get a contract, and it's starting to seriously cut into these companies' bottom lines.",
    "So much of the coverage around Jess Bezos and Blue Origin's lawsuit against NASA over the awarding of the Artemis moon lander to SpaceX is naturally focused on Jeff Bezos, but Blue Origin hasn't even put anything in orbit yet, much less demonstrate that it can land on the moon.",
    "To bolster its bid, Blue Origin partnered with Northrop Grumman and Lockheed Martin to demonstrate that they had the technical ability to deliver on its proposal. Under the assumption that NASA would award two bids, and that SpaceX would likely get one of those, Blue Origin submitted a nearly $6 billion bid to SpaceX's $2.9 billion.",
    "It's no wonder then that SpaceX keeps winning contract after contract while legacy players like Northrop Grumman and Lockheed Martin keep finding themselves out in the cold. But if those billions of dollars that NASA has been saving thanks to SpaceX gets Artemis closer to making it to the moon, then, blessedly, the system is working the way everyone tells us it should."
  ],
  "headers": {
    "11": "SpaceX is allowing NASA to aim higher and farther",
    "17": "Not everyone is happy about these developments though"
  },
  "links": {
    "CNBC": "https://www.cnbc.com/2021/09/20/nasa-evaluating-private-space-station-proposals-for-iss-replacement.html",
    "Superficial cracks": "https://www.techradar.com/news/russian-cosmonauts-find-new-cracks-in-international-space-station-module",
    "seriously cut into these companies' bottom lines": "https://observer.com/2020/10/spacex-nasa-military-contracts-threaten-government-contractors-lockheed-martin/"
  }
}