{
  "source": "https://www.techradar.com/news/amazons-infectious-new-sci-fi-thriller-encounter-will-get-under-your-skin",
  "title": "Amazon’s infectious new sci-fi thriller, Encounter, will get under your skin",
  "category": "entertainment",
  "updated": "2021-12-07T16:44:29Z",
  "author": "axel-metz",
  "summary": "Exclusive: director Michael Pearce on the familiar fears of his new movie",
  "article": [
    "Michael Pearce’s Encounter, which arrives on Prime Video December 10, is a tricky film to describe. So genre-bending is its premise that the director himself has a hard time nailing down an appropriate elevator pitch.",
    "“I call it a coming-of-age film trapped within a psychological road thriller,” Pearce tells us over Zoom, “but I might change that description tomorrow.”",
    "In fairness to the British filmmaker, who rose to prominence with his 2017 sleeper hit Beast, that’s a fairly apt summary of Amazon’s latest road trip-cum-sci-fi adventure: Encounter stars Riz Ahmed as Malik, a decorated Marine on a mission to save his estranged young sons from an extraterrestrial infection sweeping the Earth.",
    "If that sounds like a story written with the zeitgeist in mind, you might be surprised to learn that Pearce’s latest film is actually the product of a screenplay (from Giri/Haji creator Joe Barton) that lay dormant for some years before landing on the director’s plate.",
    "“After Beast, I wanted my next three or four movies to be based on other people's material, or maybe a book I could find,” he explains. “So I read a lot of scripts, and I was looking for stuff that was part character study and part elevated genre film. But to my surprise, there wasn't much of that around. I was either reading dramas or harder genre films.",
    "“And then Joe’s script came to me. I just immediately identified with these characters, particularly this relationship between a father and his two young boys, and how it was a portrayal of the coming-of-age moment that this family goes through.”",
    "Pearce is referring here to the narrative thread at the heart of Encounter. Ahmed’s Malik spends much of the movie traversing America’s western plains with his two sons, Jay and Bobby (played by newcomers Lucian-River Chauhan and Aditya Geddada), who he abducts from their potentially infected mother and tries to escort to the safety of a US military base.",
    "Things aren’t that simple, of course, but this is a precarious film to contextualize in greater detail. There’s plenty more to say about the experience of its central protagonist, a veteran tormented by the threat of bugs and bacteria, though doing so risks spoiling Encounter’s most effective surprises.",
    "Luckily, Pearce’s newest feature is only half concerned with its otherworldly creepy crawlies, and equally interested in exploring the relationship between the family at its center. Encounter belongs as much to Chauhan and Geddada as it does Ahmed, and the changing dynamic within the trio is ultimately what convinced the director to bring the project to life.",
    "“Sometimes, parents need help from their children to get through a crisis,” Pearce says, “and [the script] was talking about all these themes in a really nuanced way. It felt deeply personal to me – I experienced a similar coming-of-age moment with my younger brother and my dad – and I just thought, ‘wow, now I have a character study and a genre film and a personal story in one.’”",
    "The resonance of that “personal story” won’t only be limited to those with siblings, either – something Pearce discovered when audience-testing Encounter for the first time.",
    "“You know, we did a lot of test screenings for this film,” he explains. “It was my first experience [doing that], taking 400 ‘average Americans’ from different demographics and having them watch the movie. And it was actually really touching, because a lot of people from a massive variety of backgrounds connected with different themes. Whether that's someone who’d been in the military, or someone who'd experienced similar conditions to that family, the evolution that these characters go through reflected their own experience.",
    "“So, hopefully people are connected to the very human truth we're trying to put on screen. [We want them to] have fun with some of the genre stuff, but ultimately, they go with the movie because it's this intimate portrayal of a family.”",
    "Encounter is near-universally relatable in its examination of unconditional family trust, though viewers may find the increasingly dramatic elements of its plot geared more towards American audiences – despite the fact that both its director and leading man are British.",
    "“Joe’s script was already set in the States and I didn't want to add to it, but it also felt like a uniquely American story,” Pearce tells us. “When you think of road movies, the landscapes are just so captivating. That geography doesn't exist [in the UK].",
    "“But then there’s [also] the commentary on gun violence in the film, which is a really shocking phenomenon for us as Brits. There were just so many aspects in the script that somehow had greater resonance in 2020, too. There were rampant conspiracy theories in the US at the time, an increase in right-wing militia groups – all of these things meant it wasn't a story that could be transposed anywhere else.”",
    "Oh, and have we mentioned the pandemic-sized elephant in the room? Hearing that Pearce picked up Barton’s screenplay after it’d spent years on the shelf might lead one to wonder whether that decision came from a wish to press on the open wound of the pandemic – but the contemporary relevance of Encounter was purely circumstantial, as the director explains.",
    "“When I was developing the script, [the pandemic] didn't exist,” he tells us. “I cast Riz in January 2020, we were getting ready to shoot in the Spring, and then Covid hit in February. So the story was actually already set.”",
    "“I mean, the script wasn't locked,” Pearce adds, “so we did think, at one point, about whether we should fully embrace Covid in the world of the story, but we felt that it would date the movie. There were a few little tweaks made here and there, but we decided that the film was already reflecting our current moment – this invisible threat affecting the population – so we didn't need to push it too much.”",
    "Given the sci-fi trimmings, road-trip structure and pandemic-tainted premise of Encounter, then, it would be reasonable to assume that Pearce’s sophomore project bears little similarity to the low-budget debut feature that made his name several years ago. But the director is keen to stress the opposite.",
    "“There's a relationship between the two [movies] insomuch as this is [also] using genre to do a character portrait,” he explains. “Beast is a psychological thriller, or even maybe a bit of a romantic thriller, but it's really a portrayal of a complicated woman. And [Encounter], although it’s a road movie or sci-fi thriller, it’s still a portrayal of another complicated figure.",
    "“Then the other thing that I carried over [from Beast] was that sense of vacillating between quite an observational style of shooting, and giving the actors a lot of freedom to improvise. To feel that we're capturing something very truthful and authentic in their performances, whilst also jumping inside the heads of these characters.",
    "“I love movies where the point of view is shifting and you’re forced to question not just your relationship with a character, but the nature of reality and what you're seeing and hearing.”",
    "Make no mistake, though: Encounter is a much noisier, more imposing affair than Pearce’s 2017 effort. Grander in scale than Beast by a long way – “the variety of landscapes that you get in California is quite special”, he says – this is the work of a filmmaker clearly enjoying the larger budget at his disposal. But where did the director turn to for inspiration?",
    "“The big sci-fi influence for Joe's original script was Invasion of the Body Snatchers,” Pearce reveals. “Especially the 1970s movie – it’s such a great template, because the threat is your next-door neighbor. It’s not contingent on any big special effects to be sinister. So for me it was that and Paris, Texas, which is such a tender portrait of a father-son relationship set against these really vast, epic landscapes.",
    "“And then my director of photography [Benjamin Kračun] and I watched some desert-set thrillers where we really appreciated the rigorous camera language. Things like No Country for Old Men and Sicario were big references.”",
    "Once Malik and his boys hit the road in Encounter, the influence of those last two movies becomes clear as day – and Pearce’s sweeping camerawork more than holds its own against the work of Denis Villeneuve or the Coen brothers.",
    "It’s worth repeating that Encounter marks the debut of both the young actors starring alongside Ahmed. Lucian-River Chauhan and Aditya Geddada were 10 and eight, respectively, at the time of filming, and yet the pair manage to command roles which could so easily have proven too demanding. Pearce admits he was initially skeptical about working with such inexperienced talents.",
    "“It was kind of daunting at the beginning, because so many people had told me that it's difficult to work with kids,” he explains. “It was a long casting process to find the two of them, and because we couldn't meet before we started shooting, we really needed to feel a lot of security that they were the right kids for the part. I spent a lot of time talking with them over Zoom and just got to know them as people, so by the time we did meet for the shoot, we were already close buddies.”",
    "But Pearce needn’t have worried. “It was my first time directing children,” he admits, “and you know, they almost became the thing that saved us while making this film through Covid. They turned up with these big smiles every day, and that affected the whole crew.",
    "“I felt they were both very emotionally mature, and I didn't need to speak in a completely different language; I didn't need to trick or manipulate a performance out of them. I was really just trying to make them feel like the set was a playful, fun environment where they could discover things and try ideas out. And they came with such confidence, they were so spirited and enthusiastic every day.”",
    "The director’s praise is well founded, too. It’s no easy task for any actor, let alone a young newcomer, to hold their own alongside Ahmed, one of the most accomplished performers working today, but both Chauhan and Geddada – the former in particular – prove in Encounter that they’ve got the talent to forge long careers in the industry.",
    "Come for the aliens, vistas and hypnotic cinematography, then, but stay for the performances of two child stars who turn a potentially run-of-the-mill sci-fi thriller into a poignant family drama. It's their involvement – not the extraterrestrial parasites – that makes Encounter so infectious.",
    "Encounter is available to stream on Amazon Prime Video from December 10."
  ],
  "headers": {
    "6": "Fathers and sons",
    "13": "An American horror story",
    "19": "Learning from the Beast",
    "27": "No child's play"
  },
  "links": {
    "Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows"
  }
}