{
  "source": "https://www.techradar.com/news/the-witcher-blood-origin-spin-off-on-netflix-casts-its-first-character",
  "title": "The Witcher: Blood Origin spin-off on Netflix casts its first character",
  "category": "entertainment",
  "updated": "2021-01-25T15:18:11Z",
  "author": "axel-metz",
  "summary": "Another British star",
  "article": [
    "Netflix has confirmed the casting of Jodie Turner-Smith in its upcoming spin-off series, The Witcher: Blood Origin.",
    "Set in an elven world 1200 years before the original series, Blood Origin will reveal the story of the first 'prototype' Witcher and the events that lead to the pivotal conjunction of the spheres – a formative event in the series' fiction, when the worlds of monsters, men and elves merged to become one. Blood Origin will be a six part, live-action limited series, and act as a prequel to 2019’s hit Netflix series The Witcher.",
    "Turner-Smith will play the role of Éile, an elite warrior blessed with the \"voice of a goddess\" who has left her clan and position as Queen's guardian to follow her heart as a nomadic musician. \"A grand reckoning\" forces her to return to her past – which we can only assume to mean a disastrous convergence of magic and malice.",
    "The British actress is known for her role in 2019’s Queen and Slim, for which she earned awards recognition and starred alongside Daniel Kaluuya. She also appeared in Nightflyers, the Netflix series based on the novella by George R.R. Martin, and is set to star opposite Colin Farrell and Michael B. Jordan, respectively, in the upcoming movies After Yang (A24) and Without Remorse (Amazon Studios).",
    "Declan de Barra will serve as executive producer and showrunner of The Witcher: Blood Origin, alongside Lauren Schmidt Hissrich, creator of the original The Witcher series. Andrzej Sapkowski, author of the book series upon which the Netflix show is based, will serve as creative consultant for the prequel.",
    "Blood Origin is just one of the prequel projects for the fantasy series that Netflix has in the works. Animated movie The Witcher: Nightmare Of The Wolf, set to premiere some time in 2021.",
    "The movie will focus on the origin story of Geralt’s mentor and fellow Witcher, Vesemir. Described as a \"charming relic of the witcher Golden Age”, Vesemir is the oldest and most experienced witcher in the series.",
    "He will also appear in the second season of Netflix’s The Witcher alongside Henry Cavill, and will be portrayed by Killing Eve star Kim Bodnia."
  ],
  "headers": {
    "5": "We don’t know Witcher way to look"
  },
  "links": {
    "The Witcher: Blood Origin": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "the book series upon which the Netflix show is based": "https://www.techradar.com/how-to/how-to-read-the-witcher-books-in-order",
    "The Witcher: Nightmare Of The Wolf": "https://www.techradar.com/news/netflix-confirms-the-witcher-spin-off-is-coming-in-2021",
    "second season": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix"
  }
}