{
  "source": "https://www.techradar.com/news/the-case-for-helping-employees-with-their-home-office-setup",
  "title": "The case for helping employees with their home office setup",
  "category": "computing",
  "updated": "2021-01-29T14:58:55Z",
  "author": "eleanor-mcbryde",
  "summary": "Discussing the debate around employee home offices",
  "article": [
    "With the positive progress on Covid vaccines in development, we know one thing already: we won’t be going back to ‘normal’ life any time soon. The government has recently stated that where possible, employees should continue to work from home until at least April 2021. It’s quite possible that this date could be extended further. Some large companies have announced their own, later dates (office-based Amazon staff for example won’t be going back until at least June 2021).",
    "Even for those quite content to work from home – and few miss the realities of daily commuting – the extension of the remote working mandate is a mixed blessing. When the first work from home announcement came in March 2020, few would have expected us to be in the same boat one whole year later. And even now that most have settled into this new routine, this prolonged period of being away from the office is problematic for many. Plenty of employees have been living day to day, unable to invest in a proper “home office” setup for reasons of economy or space.",
    "This isn’t solely problematic for reasons of comfort, important though that is: our working setup has a very real impact on our productivity and wellbeing. After just two weeks of lockdown, over 50% of respondents to an Institute of Employment Studies WFH wellbeing study reported new neck pain (58%), shoulder pain (56%) and the dreaded back pain (55%). One has to wonder how those figures would look now, many, many weeks later.",
    "To a hard-nosed procurement, finance or IT professional weighing up the benefits of providing staff with new kit or allowances to work from home, making sure colleagues are comfortable might seem a bit ‘cuddly’ or not a savvy investment. But consider this: all of those employees with new or more acute neck, back or shoulder pain represent a potential cost to the business in time spent at appointments with doctors or physios – or even on long-term sick leave for serious problems caused by subpar working positions.",
    "At this point it’s worth mentioning what the law says about employers’ responsibilities. Companies have a general duty to carry out risk assessments for all work activities conducted by their employees, and a subsequent obligation to take measures to reduce any risks. There is also a specific duty to identify risks for individuals who regularly use display screen equipment as a significant part of their usual work. While at present it’s not practical for an employer’s representative to visit employees at home to assess their working conditions and posture, it would be wise to ask employees to conduct their own checklist-style assessments and flag any issues. This has the added incentive of demonstrating care for the welfare of employees who may well feel isolated from their managers and teams in the current climate.",
    "It’s important to note that employers’ obligations do not disappear simply because employees may be working from home and ignoring them could lead to expensive problems further down the line – especially as the time spent working away from the office is extended further. It’s not hard to imagine a post-Covid world in which employers are left with hefty bills and medical absence requests from staff who’ve been hunched over tiny laptop screens for the past 12 months and now need treatment to fix crooked necks, shoulders and backs.",
    "Employers’ liabilities for injuries is front of mind for many, but there are other, more subtle risks too. Productivity losses from suboptimal equipment and home working setups are harder to quantify, but finance and IT professionals are some of those who will be feeling the loss of their ‘three-screen’ setup at work the most. This makes many tasks more difficult and time consuming than they are in the office, but it’s unlikely that many have the space at home or the inclination to set up a three-monitor bank like they have in the office.",
    "A sensible option here is the category of ultrawide monitors, which provide additional screen area without the need to install multiple devices which are messy, can be difficult to organize and require more space. Some modern monitors are also far more adjustable, making them ideal for achieving a safe and comfortable setup in the office or at home. Ergonomic models for example have highly adjustable stands and bases enabling almost infinite adjustments to screen position to ensure employees are stressing their eyes or bodies while working.",
    "Far from seeing new equipment as a sunk cost, some forward-thinking employers are seeing this period as a chance to replace outdated monitors in the office by purchasing new, ergonomic models on behalf of employees. If your staff rush back to the office, their new monitor comes with them and replaces their old one. If not, their employer is safe in the knowledge that staff are comfortable and productive at home – freeing staff from potential injury and absolving the employer of any liabilities in that area.",
    "We don’t know what long term issues we could be storing up for the future during this extended period of working from home. The word ‘unprecedented’ is greatly overused in relation to Covid-19, but it applies to a scenario in which almost all office-based workers were sent home practically overnight.",
    "Essentially this is a big experiment, and we don’t know what outcomes await us around lost productivity or declining employee health and wellbeing. The question now is: how can employers best support employees in this prolonged period of working from home? Yes there will be costs involved, but most employers would prefer to be remembered as having properly cared for their staff during a very challenging period. There are myriad benefits of doing so, not least the fact that employees will remember how they were treated when the economy and labor markets start to open up again. Having some good faith in store with your workforce when the upturn comes is a valuable long-term investment."
  ],
  "headers": {
    "4": "Employers’ responsibilities",
    "7": "Ergonomic workspaces",
    "9": "Long-term investment"
  },
  "links": {
    "employees": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "remote working": "https://www.techradar.com/news/remote-working-five-steps-to-getting-the-best-from-remote-teams",
    "work from home": "https://www.techradar.com/best/work-from-home-essentials-tech-worth-buying-for-remote-working",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "display screen": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "ultrawide monitors": "https://www.techradar.com/news/ultrawide-monitor"
  }
}