{
  "source": "https://www.techradar.com/news/why-the-garmin-instinct-solar-is-still-my-all-time-favorite-running-watch",
  "title": "Why the Garmin Instinct Solar is still my all-time favorite running watch",
  "category": "fitness",
  "updated": "2021-08-01T10:00:00.998Z",
  "author": "cat-ellis",
  "summary": "Opinion: one year after its launch, the Instinct Solar shines on",
  "article": [
    "One year ago, Garmin released the Instinct Solar – a new version the chunky Instinct multi-sports watch with added Power Glass to stretch out its battery life. And after all that time, and all the watches I've tested, it's still my favorite.",
    "I’m fortunate enough to be able to test a wide range of running watches and fitness trackers on TechRadar – from super-affordable entry-level activity bands through to top-end smartwatches equipped with advanced training tools. I always return review samples after testing, but last year I tried a watch that I missed so much, I bought my own shortly afterwards. It was the humble, chunky Instinct Solar.",
    "Garmin has introduced solar versions of its high-end Fenix 6, Enduro, Quatix and Tactix lines in recent months, along with the Instinct. Each is topped with Garmin’s Power Glass, which harvests energy from the sun to keep the watch’s battery topped up and extend its life between charges. You’ll still need to charge your watch the regular way first, but after that it’ll keep running for much longer than the regular Instinct with just a couple of hours of sunlight exposure each day.",
    "The Instinct is the most frugal power-wise, and in theory, with the power-saving settings tweaked just so, it could keep going indefinitely, but in actual use you’re still looking at battery life measured in weeks rather than days.",
    "Daylight from a window will do just fine, but the Instinct Solar is built for getting outdoors and having fun. It’s not the most stylish watch Garmin makes by quite a large margin – in fact it’s fairly ugly compared to the likes of the Venu 2 or Fenix 6 – but it’s seriously rugged. I’ve taken it running, cycling, hiking, paddleboarding and kayaking, and despite taking some pretty hard knocks along the way, it looks and works just like the day I unpacked it.",
    "In fact, it’s tougher than me – when I fell and broke my ankle in the Peak District, it came away completely unscathed. Its stress monitoring app later informed me that I’d had ‘many stressful moments’ and should probably take it easier the following day.",
    "Much like its case, the Instinct Solar's display isn’t the most attractive around (it’s a monochrome memory-in-pixel affair that helps conserve battery life) but despite lacking the glorious color and high resolution of Garmin watches like the Venu 2 or top-tier Forerunners, it’s brilliant in its own way.",
    "This is due to the dual-screen design, with a small secondary display just large enough to show a number or an icon. You can pick which stat is shown here when the watch is idle (with options including date, step count and temperature) but it really comes into its own when you’re browsing the Instinct Solar’s menus.",
    "Like many rugged watches (the Coros Apex is another example), the Garmin Instinct Solar eschews a touchscreen in favor of physical controls that can be operated with wet hands or while wearing gloves. The upper right button performs dozens of different functions, which could be a real headache to remember, but the little secondary display always shows exactly what it will do in the current context.",
    "It’s one of the watch’s biggest strengths, though it could also have been of its greatest weaknesses, as it means the Instinct Solar doesn’t support additional watch faces and apps downloaded through Garmin Connect IQ. Thankfully, it has all the essentials I need in a running watch already – including great navigation tools.",
    "As you'd expect from a Garmin watch, GPS is super accurate. It might have become synonymous with sports watches, but this is a company that first made its name in marine navigation systems, and whose first customer was the US Navy.",
    "That particular tool has come into its own when I'm leading club runs. Following the same paths every week would make training seriously dull, so it's important for me to come up with new routes to spice things up. That said, there are few things more embarrassing than trying to memorize a route ahead of time, only to miss a turning and have to sheepishly check my phone to see where I went wrong.",
    "With the Instinct Solar, I can upload a route ahead of time and follow it with breadcrumb trails. The watch doesn't give super detailed maps, but that's fine; the dual screen display makes it clear which direction to go, and if something were to go wrong, I could always use the TracBac feature to get the group back to the meeting point. This is also a handy tool for timed out-and-back runs.",
    "It's far from flashy, but the Instinct Solar still shines. If you're looking for a mid-range running watch then I highly recommend adding it to your shortlist."
  ],
  "headers": {
    "2": "Here comes the sun",
    "6": "Grayscale is A-OK",
    "10": "Never walk alone"
  },
  "links": {
    "Instinct Solar": "https://www.techradar.com/reviews/garmin-instinct-solar",
    "Instinct": "https://www.techradar.com/reviews/garmin-instinct",
    "Fenix 6": "https://www.techradar.com/reviews/garmin-fenix-6",
    "Quatix": "https://www.techradar.com/news/garmin-launches-solar-smartwatch-that-lasts-up-to-24-days-between-charges",
    "Garmin watches": "https://www.techradar.com/best/garmin-watch",
    "Venu 2": "https://www.techradar.com/reviews/garmin-venu-2",
    "Coros Apex": "https://www.techradar.com/reviews/coros-apex"
  }
}