{
  "source": "https://www.techradar.com/news/flash-player-in-windows-10-will-soon-be-toast",
  "title": "Flash Player in Windows 10 will soon be toast",
  "category": "computing",
  "updated": "2021-05-04T13:29:09Z",
  "author": "sead-fadilpasic",
  "summary": "Mandatory Windows 10 update will soon eliminate Flash Player",
  "article": [
    "Roughly two months from now, Microsoft will completely eliminate Flash Player from its Windows 10 operating system, applying the final nail in the coffin to the often-maligned software.",
    "According to Windows Latest, the media player will be removed as part of July's mandatory Patch Tuesday update.",
    "Anyone that wants to speed up the process can install optional, non-security Windows 10 updates that will be shipped in June. There is also the option of manually installing the update (KB4577586), which has been available on Microsoft’s servers since February.",
    "Once the Windows 10 patch is installed, Flash Player will no longer be available. The OS is expected to block the player from being reinstalled in the future, as well as prevent the patch from being uninstalled.",
    "Those that want to hold onto Flash Player for as long as possible should turn off automatic Windows 10 updates.",
    "Microsoft has slowly been phasing out Flash Player from its products, removing it from its browsers (Edge and Internet Explorer 11) in February this year. There are many reasons the company has decided to retire the tech, including numerous cybersecurity issues and the availability of superior alternatives, such as HTML5, WebGL or WebAssembly.",
    "Microsoft is far from the only software company to have has decided to kill off Flash Player; Apple, Google, Mozilla, Facebook and even Adobe have all said it's time to say goodbye to the media player.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Flash Player"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Flash Player will no longer be available": "https://www.techradar.com/news/windows-10-update-will-finally-kill-off-adobe-flash-unless",
    "phasing out Flash Player": "https://www.techradar.com/news/why-flash-player-removal-should-be-a-priority",
    "Google": "https://www.techradar.com/news/google-may-finally-be-killing-off-flash",
    "Windows Latest": "https://www.windowslatest.com/2021/05/04/windows-10-patch-tuesday-security-update-will-remove-flash-player-in-july/"
  }
}