{
  "source": "https://www.techradar.com/news/overwatch-2s-fan-favourite-characters-have-a-brand-new-look",
  "title": "Overwatch 2's fan-favorite characters have a brand-new look",
  "category": "gaming",
  "updated": "2021-06-10T19:40:02Z",
  "author": "samuel-tolbert",
  "summary": "Sleek new looks",
  "article": [
    "Overwatch 2 is still a ways off but Blizzard Entertainment showed up briefly during the Summer Game Fest 2021 kickoff event to share a new look at two of the iconic characters from the first Overwatch and how their appearance is changing in Overwatch 2.",
    "Specifically, Sombra and Baptiste have new and improved looks that stay true to their prior designs, which you can check out in the gallery below.",
    "Overwatch 2 is moving to a 5v5 gameplay setup, a change meant to improve balance, especially in regards to Tank characters and how they play on the field.",
    "While nothing has been confirmed yet, the developers are also excited about the possibility of introducing a ping system and cross-play between platforms.",
    "Longtime Overwatch director Jeff Kaplan stepped down earlier this year, with Aaron Keller stepping into his role as game director on Overwatch 2.",
    "Activision-Blizzard has already confirmed that Overwatch 2 won't be released at any point in 2021. Players will likely get more updates on the development of Overwatch 2 later in the year, though Blizzard has also stated that there won't be an in-person BlizzCon 2021.",
    "Instead, a digital event is being planned for sometime early next year, though details are still light at this time.",
    "Whenever Overwatch 2 does arrive, it'll be available on Xbox Series X, Xbox Series S, Xbox One, PC, PS5 and PS4."
  ],
  "headers": {
    "5": "No release date...this year"
  },
  "links": {
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "Summer Game Fest 2021": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "developers are also excited": "https://www.techradar.com/news/overwatch-2-devs-excited-by-possibilities-of-cross-play-and-a-ping-system",
    "stepped down": "https://www.techradar.com/news/jeff-kaplan-leaves-blizzard-entertainment-ahead-of-overwatch-2",
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021-is-canceled",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}