{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-fe-could-be-canceled-according-to-mysterious-report",
  "title": "Samsung Galaxy S21 FE could be canceled, according to mysterious report",
  "category": "phones",
  "updated": "2021-06-14T08:51:34Z",
  "author": "tom-bedford",
  "summary": "Another canceled Samsung phone?",
  "article": [
    "Samsung might be having a tough year - after loads of rumors suggested the Galaxy Note 21 could have been canceled, a new one has suggested the Galaxy S21 FE, the only other big non-foldable phone we were expecting from the company in 2021, may have gone the way of the dodo too.",
    "This comes from Korean news site ET News, which spoke to suppliers involved in Samsung's supply chain. According to the report, the global chipset shortage meant Samsung had to ditch its Galaxy S21 FE plans and has therefore contacted its suppliers to suspend orders for the device.",
    "This makes it sound quite last-minute, as though the Galaxy S21 FE was in one of the final stages of production, before being canned.",
    "The global chipset shortage is a big ongoing issue in the tech world with not enough silicon to build the processors (think of them as your gadget's brain) needed for phones, computers, games consoles and more.",
    "According to other reports, this is why the Note 21 is thought to be canceled. The global chipset shortage has affected loads of other companies too.",
    "It's hard to know exactly what the report says, though, because quite soon after being published, it was taken offline, in a mysterious turn of events.",
    "The fact that ET News' report on the Samsung Galaxy S21 FE has been taken offline, is a big red flag for its veracity.",
    "It's possible the website received new information to contradict the published report, or something else happened, so that the site decided the information it had published was incorrect.",
    "So is the Samsung Galaxy S21 FE canceled? While there's no way of knowing for sure right now, it's probably best to wait for more information before making an assumption - rumors can be wrong and phone details can change.",
    "We don't even know for sure that the Galaxy Note 21 isn't coming, and Samsung's own CEO weighed in on that topic. TechRadar has reached out to Samsung for comment on this story, and we will update this article when we hear back.",
    "We're still expecting the Samsung Galaxy Z Flip 3 and Z Fold 3 to come later in the year - they were slated to launch alongside the S21 FE phone - and there's no reason to believe they've been bumped off. So we'll definitely get more Samsung phones this year, though whether they're foldable and expensive, or flat and cheap, remains to be seen."
  ],
  "headers": {
    "6": "What's been canceled: the report or the phone?"
  },
  "links": {
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "ET News": "https://www.etnews.com/20210613000038",
    "Samsung's own CEO weighed in on that": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones"
  }
}