{
  "source": "https://www.techradar.com/news/it-looks-like-facebook-is-getting-into-the-newsletter-game-too",
  "title": "It looks like Facebook is getting into the newsletter game too",
  "category": "computing",
  "updated": "2021-01-29T14:08:41Z",
  "author": "barclay-ballard",
  "summary": "Following Twitter, Facebook is joining the newsletter space",
  "article": [
    "The online newsletter space could be set to get another high-profile entrant after Facebook confirmed that it is working on its own tools for journalists and writers. The proposal, which will form part of the Facebook Journalism Project, is reportedly still at a very early stage but is likely to mirror existing newsletter services",
    "Three people familiar with the matter told The New York Times that Facebook’s new tools would offer independent writers support for building their follower numbers across the social network, help them curate email lists and, potentially, provide paid subscription tools to help writers monetize their newsletters.",
    "The launch of bespoke newsletter services would help Facebook in its efforts to be seen as a source of legitimate news. The social network launched its News Tab in 2019 and has since pledged to donate more than $100 million in order to provide a boost to the struggling local news sector.",
    "Facebook is not the only major tech player to explore the newsletter space. Earlier this week, Twitter announced that it had acquired the newsletter service Revue in order to help writers that use its platform to generate revenue. Twitter has already made Revue’s Pro features free for all account holders and lowered the paid newsletter fee to 5%.",
    "The newsletter space has grown substantially as a result of the COVID-19 crisis, with many writers left with little choice but to monetize their services independently after the pandemic caused significant job losses in the media sector. Services like Patch and Substack are also offering solutions for writers attempting to make a living in difficult circumstances.",
    "More details regarding Facebook’s newsletter service will surely follow over the coming months but it is likely to tie in nicely with the stated aims of the Facebook Journalism Project, which intends to “strengthen the connection between journalists and the communities they serve.”",
    "Via Engadget"
  ],
  "headers": {
    "3": "Will write for pay"
  },
  "links": {
    "The New York Times": "https://www.nytimes.com/live/2021/01/28/business/us-economy-coronavirus#facebook-is-said-to-be-planning-newsletter-tools-to-court-independent-writers",
    "2019": "https://about.fb.com/news/2019/10/introducing-facebook-news/",
    "Revue": "https://www.techradar.com/news/twitter-might-soon-start-sending-out-email-newsletters",
    "Patch": "https://www.techradar.com/news/patch-is-working-on-an-intriguing-website-builder-and-newsletter-platform-for-journalists",
    "Substack": "https://www.techradar.com/news/substack-wants-to-help-liven-up-your-boring-newsletters",
    "Facebook Journalism Project": "https://www.facebook.com/journalismproject",
    "Engadget": "https://www.engadget.com/facebook-newsletter-tools-independent-writers-080213025.html"
  }
}