{
  "source": "https://www.techradar.com/news/huge-pixel-6-leak-reveals-almost-every-detail-about-the-new-phones",
  "title": "Huge Google Pixel 6 leak reveals almost every detail about the new phones",
  "category": "phones",
  "updated": "2021-10-12T14:31:57Z",
  "author": "david-nield",
  "summary": "Cameras, battery, screen sizes and more",
  "article": [
    "It seems some retailers are a little too eager to start showing off the features of the Pixel 6 and the Pixel 6 Pro, due to be unveiled on October 19. A retailer in the UK has published listing pages for both phones, revealing plenty of the specs and features we've got to look forward to this time around.",
    "First spotted by well-known tipster @evleaks, the pages for the Pixel 6 and Pixel 6 Pro were still up as we write this, but may have been pulled by the time you read it. We get lots of pictures and information about improvements coming with these phones – like the \"150% more light\" that the main 50MP rear camera lens lets in.",
    "Starting with the Pixel 6, it's described as \"uniquely yours\" by Google. We hear about an \"all-day adaptive battery\" and five years of software updates, and up to 80 percent faster performance – though faster than what, we're not sure. The rear camera module features both a 50MP main camera and an ultrawide camera, according to the listing.",
    "We also get details of improved scratch resistance, IP68 protection, and a 6.4-inch display with a \"high refresh rate\". Down at the bottom of the listing are details of the new, chunkier-looking Pixel Stand, a 30W USB-C Pixel Charger, and a translucent Pixel 6 Case for extra protection.",
    "The Pixel 6 Pro, meanwhile, is described as \"the smartest and fastest Pixel yet\" – we get mentions of the on-device AI, computational photography and power efficiency of the Google Tensor chip, and there's a 50MP wide + 48 telephoto + 12MP ultrawide rear camera with 4x optical zoom.",
    "It looks as though the front camera on the Pixel 6 Pro offers an ultrawide mode as well. With the Pro the screen is listed as 6.7 inches and a 120Hz refresh rate is specifically mentioned. We should get all of these details confirmed, and more besides, when Google launches the phones on October 19.",
    "A lot of the details we've read about today have already been leaked by Evan Blass (aka @evleaks), and it's worth noting one of the tipster's recent tweets about the Pixel 6: that engagement with updates around this phone is much higher than normal for a Pixel.",
    "That suggests that – pre-launch, at least – Google has managed to build up enough hype around the Pixel 6 and the Pixel 6 Pro to shift substantial numbers of the handsets. That's been a problem for previous Pixels, even though devices like the Pixel 5 have typically been well-received by reviewers.",
    "Could the Pixel 6 be the phone that pushes the series further towards the mainstream? The eye-catching redesign, with the large rear camera bump and unconventional coloring options, probably helps. It's worth remembering that for all its qualities, the iPhone 13 looks like just another iPhone.",
    "We've now had so many leaks around the Pixel 6 that there's not much left for Google to reveal (it actually announced the phones back in August). On paper, it looks like it could be one of the phones of 2021, but we'll have to wait to test it to know for sure."
  ],
  "headers": {
    "3": "Specs appeal",
    "6": "Analysis: the Pixel 6 has the hype to take on the iPhone 13"
  },
  "links": {
    "Pixel 6": "https://www.awin1.com/awclick.php?awinmid=2264&awinaffid=103504&clickref=trd-us-4377997683254031400&p=https%3A%2F%2Fwww.carphonewarehouse.com%2Fgoogle%2Fpixel6-river-content.html",
    "on October 19": "https://www.techradar.com/news/google-pixel-6-launch-event-confirmed-and-you-dont-have-long-to-wait",
    "@evleaks": "https://twitter.com/evleaks/status/1446818179636924419",
    "Pixel 6 Pro": "https://www.awin1.com/awclick.php?awinmid=2264&awinaffid=103504&clickref=trd-us-5213307695239728000&p=https%3A%2F%2Fwww.carphonewarehouse.com%2Fgoogle%2Fpixel6-pro-river-content.html",
    "engagement with updates around this phone": "https://twitter.com/evleaks/status/1446122633557262341",
    "Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "so many leaks": "https://www.techradar.com/news/google-pixel-6-gets-properly-advertised-and-extensively-leaked",
    "back in August": "https://www.techradar.com/news/google-pixel-6-and-pixel-6-pro-officially-revealed-by-google"
  }
}