{
  "source": "https://www.techradar.com/news/bethesda-is-making-a-new-indiana-jones-game-yes-really",
  "title": "Bethesda is making a new Indiana Jones game – yes, really",
  "category": "gaming",
  "updated": "2021-01-12T16:39:08Z",
  "author": "vic-hood",
  "summary": "Indy is back",
  "article": [
    "Lucasfilm Games has officially announced that a new Indiana Jones game is in the works at Wolfenstein developer MachineGames, with Bethesda Game Studios head Todd Howard set to be executive producer of the project.",
    "Publisher Bethesda has released a teaser trailer for the Indiana Jones game (which hasn't got an official name yet), and it's brief, but enough to get you feeling nostalgic about the movies. The trailer pans across a desk covered with books, a camera and papers, before landing on the iconic fedora and whip of Dr Henry 'Indiana' Jones Jr. It's not much to go on, but it's enough to get us excited. Check it out below.",
    "StarWars.com, Lucasfilm's official news outlet, says the game is an \"original, standalone tale set at the height of the career of the famed adventurer\".",
    "Unfortunately, there's no word on when we'll get our hands on it, but we're expecting it'll be a few years yet – especially given that Bethesda is also working on both Starfield and Elder Scrolls 6 currently. And, with Microsoft buying out Bethesda's parent company Zenimax Media last year, it'll be interesting to see if it features any Xbox-exclusive elements.",
    "It seems Indiana Jones has had a bit of a resurgence of late. Indiana Jones 5 is currently is the works, though it's had somewhat of a turbulent production to date.",
    "Indiana Jones 5 is currently scheduled for July 29, 2022, but we'd be surprised if the game's release tied in with the movie, which switched directors last year.",
    "While it may be a while before we get our hands on this new Indiana Jones game, we can't wait to see what MachineGames has cooking for our favorite archaeologist."
  ],
  "headers": {
    "4": "More Indy"
  },
  "links": {
    "StarWars.com": "https://www.starwars.com/news/indiana-jones-game",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Microsoft buying out Bethesda's parent company Zenimax Media": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "turbulent production": "https://www.techradar.com/news/heres-why-indiana-jones-5-didnt-come-together-before-spielberg-left-as-director"
  }
}