{
  "source": "https://www.techradar.com/news/sonos-wireless-headphones-what-we-know-about-the-rumored-sony-wh-1000xm4-rivals",
  "title": "Sonos wireless headphones: what we know about the rumored multi-room supporting cans",
  "category": "audio-visual",
  "updated": "2021-11-11T12:42:54Z",
  "author": "olivia-tambini",
  "summary": "The first Sonos wireless headphones could arrive soon",
  "article": [
    "It might not be long before we see the first-ever Sonos wireless headphones. The popular wireless speaker giant is expected to branch out into the world of personal audio for the first time in its 18-year history.",
    "Many people are speculating that the new wireless headphones could be on the way very soon. Sonos CEO Patrick Spence divulged in a call with investors that the brand would be releasing a new product in March.",
    "We now know that the product Spence was referring to was likely the Sonos Roam, described by him at an event on March 9 as “the smartest speaker we have ever built.”",
    "But just because new wireless headphones from Sonos weren’t announced in March 2021 like some expected doesn’t mean they aren’t still on the cards.",
    "Rumors about an upcoming pair of Sonos headphones – particularly wireless ones – have been circulating for a while now, first emerging in early 2019.",
    "Previous patents have described how the first Sonos headphones would interact with other Sonos products, allowing them to seamlessly integrate with existing multi-room audio setups – something that the likes of Sony and Sennheiser can’t offer.",
    "According to a report from Bloomberg, the headphones will likely have multiple virtual assistants that would function similarly to the company's Sonos Arc and Sonos One speakers, and would focus on competing with Sony, Apple, Bose and Sennheiser by offering high-end audio performance.",
    "Bloomberg’s sources also suggested that Sonos could target a price point of around $300 (£200 / AU$400) – cheaper than the Sony WH-1000XM4, but not by much – and would launch in 2020.",
    "Of course, they never materialized, and we're left wondering when the Sonos headphones will appear. In any case, the rumored headphones could really shake up the audio world if they do emerge with the exclusive features we've been hearing about.",
    "[Update: TechAdvisor has reported that RHA - an audio company recently bought by Sonos - was working on a pair of \"premium\" over-ear headphones with features that could have rivalled the AirPods Max. While we're not convinced that these will re-materialize as the first Sonos headphones, it's interesting to hear how RHA's expertise in this field could inform the brand going forward.]",
    "In terms of a release date, Sonos CEO Patrick Spence confirmed during the company’s recent earnings call that the next Sonos product will be announced in March.",
    "We now know this was referring to the new Sonos Roam portable speaker.",
    "However, Spence did mention that Sonos continues to aim to release “at least” two new products each year – so the wireless headphones could make up that second slot. We'll keep an ear out.",
    "Bloomberg says that the first Sonos wireless headphones will likely cost about $300 / £220 / AU$400, putting them in direct competition with the likes of the Sony WH-1000XM4 and the Bose Noise Cancelling Headphones 700.",
    "If Sonos could undercut these models, it could really shake up the competition – though judging by Sonos’ wireless speakers, we aren’t expecting a super budget-friendly price.",
    "New patent images have recently revealed a better look at the rumored Sonos wireless headphones.",
    "A recent filing at the German Patent and Trademark Office offers a glimpse of what looks to be a close-to-final design for the upcoming headphones, and suggests several changes compared to similar design patents from September 2020, which detailed two different wireless models.",
    "Now, it seems the Sonos wireless headphones won’t have rods protruding from the headband like the Bose Noise Cancelling Headphones 700, as one previous design suggested, but will instead see the rods go straight down into the ear cups like the Sony WH-1000XM4. There’ll also be no additional piece that wraps around the back of each ear cup, which we saw in the other previous design.",
    "These new patent images also reveal a now-visible Sonos wordmark on the earcups of the headphones, whereas previous designs featured no such logo. It’s worth noting that much of the design is rendered in broken lines, meaning the placement of certain features could change, but given the amount of time Sonos’ wireless headphones have been in development, we’ll bet this patent offers something close to a final blueprint.",
    "Another notable difference on this patent is what looks to be an earphone adapter, which could suggest replaceable ear cushions for the headphones. A USB-C port, various buttons and a 3.5mm audio port are also visible in the new drawings.",
    "Since we saw this patent, we heard that Sonos could be working on a pair of true wireless earbuds, according to a patent discovered by Zats Not Funny(via Pocket Lint).",
    "The patent describes two different wireless earbuds designs, as well as three options for charging cases with some novel approaches to extend playtime, including detachable battery plates.",
    "Sonos products typically follow a sleek, minimalist design aesthetic, in black and white color variations.",
    "We’d expect to see more of the same from the first Sonos headphones, with minimal external hardware and a slick user interface, perhaps making use of touch sensitive housings that allow you to control your music playback without digging your phone out of your pocket.",
    "While a patent is never a firm indication that a product will see the light of day, it has given us an idea of some of the features we might see from a pair of Sonos headphones.",
    "The first is wireless connectivity via Bluetooth – we’d imagine that Sonos would opt for the latest Bluetooth 5.1 codec to ensure strong connections, as well as aptX Low Latency for video and gaming.",
    "The patent also describes noise-cancelling tech, which is an increasingly sought-after feature for over-ear headphones. Hopefully, Sonos will employ adaptive noise-cancelling as seen with the Sony WH-1000XM4; this clever tech adapts the level of noise cancellation to your environment in real time, ramping up for loud environments and turning down for quiet environments.",
    "According to the patent, the headphones will also come with built-in microphones to allow you to summon your device’s voice assistant – it’s also possible that a voice assistant (either Google Assistant or Alexa) could come built-in to the headphones directly, as with previous Sonos speakers.",
    "The most interesting feature revealed in the patent describes how the wireless headphones might interact with existing Sonos speakers, with what the company calls 'swapping':",
    "\"For example, if a particular piece of content play is currently playing on the wireless headphone, a swap changes the playback to play that piece of content on one or more other playback devices on the local network.\"",
    "So in theory, you could be listening to music on your Sonos headphones and swiftly switch that music over to your Sonos Bluetooth speaker, whether it's part of a multi-room audio system or a standalone smart speaker like the Sonos One or the Sonos Move.",
    "It’s certainly an exciting prospect, and it would really set the rumored headphones apart from the competition."
  ],
  "headers": {
    "4": "Cut to the chase",
    "10": "Sonos wireless headphones release date",
    "13": "Price",
    "15": "Design",
    "24": "Features and what we want to see"
  },
  "links": {
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "popular wireless speaker": "https://www.techradar.com/news/best-speaker",
    "in a call with investors": "https://www.techradar.com/news/the-first-sonos-headphones-could-arrive-soon-with-new-product-confirmed-for-march",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam",
    "early 2019": "https://www.techradar.com/news/sonos-first-headphones-are-rumored-to-be-wireless-and-high-end",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2019-01-24/sonos-is-said-to-plan-headphones-in-move-outside-the-home",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "Sonos One": "https://www.techradar.com/reviews/sonos-one-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "TechAdvisor": "https://www.techadvisor.com/news/audio/sonos-headphones-rha-atlas-3810392/",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "portable speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "recent filing": "https://register.dpma.de/DPMAregister/uebersicht",
    "Sonos could be working on a pair of true wireless earbuds": "https://www.techradar.com/news/sonos-could-be-working-on-its-first-wireless-earbuds",
    "Zats Not Funny": "https://zatznotfunny.com/2021-05/sonos-earbuds/",
    "Pocket Lint": "https://www.pocket-lint.com/headphones/news/sonos/157025-is-sonos-working-on-earbuds-as-well-as-headphones",
    "The patent": "https://pdfaiw.uspto.gov/.aiw?PageNum=0&docid=20210037306&IDKey=FE7B7E762086&HomeUrl=http%3A%2F%2Fappft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D1%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPG01%2526s1%3D62867938%2526OS%3D62867938%2526RS%3D62867938",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Bluetooth speaker": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review"
  }
}