{
  "source": "https://www.techradar.com/news/why-the-time-is-right-for-international-vpn-day",
  "title": "Why the time is right for International VPN Day",
  "category": "computing",
  "updated": "2021-08-19T07:12:28Z",
  "author": "mike-williams",
  "summary": "Today is International VPN Day... and this is why you should care",
  "article": [
    "Are you ready to celebrate International VPN Day? As it's the first, probably not. Maybe you're wondering what it's about, whether it's really necessary.",
    "After all, you could argue that consumer VPNs have been around for a long time - popular provider HideMyAss was created in 2005. They're not a secret, they're even advertised on TV. And if you regularly use public Wi-Fi or have ever wondered why your favorite Netflix content is only available in some other country, chances are you already know many of the VPN basics.",
    "While there's a lot of truth in this, it's not the whole story. The VPN world is changing, fast, and making people fully aware of online threats, cybersecurity issues and the tools that can use to protect themselves has never been more important.",
    "VPN technology might be familiar to experienced users in the West, but there many others who haven't yet got the privacy message, and they'll be joined by hundreds of millions over the next few years.",
    "A Malwarebytes survey found US VPN usage has grown from 1.5% in 2011 to 36% in 2021. That's a very positive privacy result, but it still leaves 64% staying VPN-free, and the survey also found that 42% of respondents didn't even know what a VPN was.",
    "Keep in mind that VPN usage alone doesn't guarantee safety, either. Just look at the tens of millions who think they're secure because they've installed some no-name Android VPN app run by an obscure company with no website or privacy policy, and only a Gmail address for contact. Let's be realistic, there are plenty of people who use a VPN but are still taking serious risks.",
    "But whatever the state of the US market, it's dwarfed by the new audience in developing countries, where increasing wealth and an expanding digital ecosystem is seeing rapid growth in internet adoption.",
    "Atlas VPN estimates India internet use rose from 243 million users in 2015, to 678.6 million in 2020, for instance, and is on track to hit one billion by 2025. That's the equivalent of almost the entire US population (328 million in 2019) joining the internet world in just five years. It's no wonder that India VPNs are growing in popularity.",
    "Factor in growth across the rest of world, and it's no surprise that Research and Markets predicts the global VPN market will leap from an estimated US$35.4 billion in 2020, to $107.6 billion by 2027.",
    "This kind of explosion in internet use doesn't just mean a larger customer base for existing web companies. New services, products and platforms will appear to support them, each with their own security issues, and raising awareness of these privacy problems is going to be a major task all by itself.",
    "Although much of the growth in internet adoption is the natural result of a wealthier population, there are some specific reasons powering the increase in VPN use.",
    "Covid has created a whole new set of issues, for instance, as locked-down economies saw a shift to home working, video conferencing and remote access to business resources. That's a whole load of new and very sensitive web activity which would never have happened pre-Covid, and just about all of it will need some form of protection.",
    "As businesses return to the office, some of this demand might fall away. But with others seeing the benefits of remote working, it looks like this represents a permanent shift in how (and where) we work.",
    "There's a far more disturbing driver behind VPN growth, though, and that's the path some governments take in banning websites or services, censoring content, and generally cracking down on social or political freedoms.",
    "Atlas VPN reports high adoption of VPNs in Middle Eastern countries, for instance, where internet restrictions are some of the most stringent in the world. VPN use reportedly surged in Hong Kong after China's new security laws were announced in 2020, and India has gone as far as shutting down all internet access (the longest internet blackout stretched from August 4, 2019 to March 4, 2020.)",
    "The reality is there are very real reasons to distrust the authorities in many countries around the world, and while that situation continues (and it doesn't look like it's changing any time soon) the demand and need for VPNs will only increase.",
    "When you've grown up in a comfortable and (mostly) safe world, where you've used computers and been online for most of your life, you'll naturally get confident in how to protect yourself online. You've got a VPN, maybe you've installed a proxy browser extension, you know when and why browsing incognito might be a good idea.",
    "That's great, too, but you don't have to look far to find a world that's very different. Where millions of internet users face daily cyber-dangers at home and work, and in some cases, can't check a friend's social media page, talk to family or just say what they think without some technical VPN-type assistance.",
    "The reality is, while we've come a long way along the path to internet privacy, there's much, much more to do. And if International VPN Day can bring just a fraction more awareness to the issues, and the potential answers, then it gets two thumbs up from us."
  ],
  "headers": {
    "3": "VPN awareness",
    "7": "Explosive growth",
    "10": "A dangerous world",
    "16": "Internet privacy? We've only just begun"
  },
  "links": {
    "VPNs": "https://www.techradar.com/vpn/best-vpn",
    "HideMyAss": "https://www.techradar.com/reviews/hidemyass-vpn",
    "VPN basics": "https://www.techradar.com/vpn/what-is-a-vpn",
    "Malwarebytes survey": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5109857576369258000&xs=1&url=https%3A%2F%2Fblog.malwarebytes.com%2Fmalwarebytes-news%2F2021%2F01%2Fvpn-usage-is-increasing-says-survey&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhy-the-time-is-right-for-international-vpn-day",
    "US VPN": "https://www.techradar.com/vpn/us-vpn-usa",
    "Android VPN app": "https://www.techradar.com/vpn/best-vpn-for-android-our-5-top-choices",
    "Atlas VPN": "https://www.techradar.com/reviews/atlas-vpn",
    "hit one billion by 2025": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1167301872835491300&xs=1&url=https%3A%2F%2Fatlasvpn.com%2Fblog%2Findia-estimated-to-reach-1-billion-internet-users-by-2025&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwhy-the-time-is-right-for-international-vpn-day",
    "India VPNs": "https://www.techradar.com/vpn/best-india-vpn",
    "Research and Markets": "https://www.researchandmarkets.com/reports/4845864/virtual-private-network-vpn-global-market",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "remote access to business resources": "https://www.techradar.com/vpn/remote-access-vpn",
    "banning websites or services": "https://www.techradar.com/vpn/which-websites-and-online-services-are-banned-in-china",
    "VPN use reportedly surged in Hong Kong": "https://www.techradar.com/news/vpn-downloads-soar-following-new-china-law",
    "shutting down all internet access": "https://www.techradar.com/news/internet-shutdown-in-india-shows-the-dark-side-of-digital-dependence-to-businesses-and-livelihood",
    "proxy browser extension": "https://www.techradar.com/vpn/best-chrome-vpn"
  }
}