{
  "source": "https://www.techradar.com/news/another-big-samsung-phone-could-come-without-a-charger",
  "title": "Another big Samsung phone could come without a charger",
  "category": "phones",
  "updated": "2021-09-01T08:57:49Z",
  "author": "james-rogerson",
  "summary": "The FE might come charger-free",
  "article": [
    "It seems Samsung is serious about dropping chargers from its phones, as following the likes of the Samsung Galaxy S21 range and the Samsung Galaxy Z Fold 3 launching without one, it now seems that the Samsung Galaxy S21 FE probably won’t come with one either.",
    "We’ve come to that conclusion because SamMobile appears to have obtained a copy of the manual for the Samsung Galaxy S21 FE, and it states that the wall charger is sold separately.",
    "That’s not all the manual says though: it also mentions that the Samsung Galaxy S21 FE will have an IP68 rating for water and dust resistance, and that it will have an in-screen fingerprint scanner, a high refresh rate screen, Dolby Atmos audio, wireless charging, and reverse wireless charging.",
    "There are also pictures of the phone shown, which match what we’ve seen before and include a triple-lens camera. Full specs for this aren’t shared, but there is a mention of an ultra-wide lens. What there’s no mention of is a microSD card slot, and there doesn’t appear to be a 3.5mm headphone port either.",
    "While we’d take this manual with a pinch of salt, it certainly looks to be the real deal, so the details in it are probably accurate. We should find out for sure soon, as while an exact release date is unclear, leaks suggest the Samsung Galaxy S21 FE will probably land sometime in October.",
    "While some buyers will probably resent not getting a wall charger with their expensive phone, there are some very good reasons not to include one. First of all, most people probably already have a perfectly good one they can use. If you’re anything like us you probably have about 20.",
    "And that’s the issue with including them – so many of these chargers are being produced, and largely going unused. It’s bad for the environment and adds unnecessary cost to phones.",
    "So by not including them, not only will mass producing phones become slightly less harmful to the environment, it could also save you money on the handset – or that money might be used to improve the phone in other ways.",
    "Of course, in some cases companies are sure to just pocket the savings. That’s less good, but the environment still benefits, and that’s probably the most important thing here.",
    "Via XDA Developers"
  ],
  "headers": {
    "5": "Opinion: wall chargers are on the way out, and that’s a good thing"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "SamMobile": "https://www.sammobile.com/news/galaxy-s21-fe-5g-user-manual-makes-no-mention-of-microsd-slot/",
    "land sometime in October": "https://www.techradar.com/news/samsung-galaxy-s21-fe-release-date-may-be-way-way-later-than-we-expected",
    "XDA Developers": "https://www.xda-developers.com/samsung-galaxy-s21-fe-user-manual-leak/"
  }
}