{
  "source": "https://www.techradar.com/news/samsung-could-be-making-a-gaming-phone-and-were-ready-for-it",
  "title": "Samsung could be making a gaming phone – and we're ready for it",
  "category": "phones",
  "updated": "2021-05-14T16:30:24Z",
  "author": "david-nield",
  "summary": "Gamers assemble",
  "article": [
    "Samsung makes phones across just about every price point there is, but as yet it hasn't released a dedicated gaming phone like the ones previously pushed out by Xiaomi, Asus and others. Two related trademarks that Samsung just applied for suggests that might be about to change.",
    "The trademarks, applied for in Europe in relation to mobile devices and spotted by LetsGoDigital, are for the phrases 'Activate Fan Mode' and 'Unleash Your Fan Power' – and you don't have to be the world's greatest detective to infer that they refer to a cooling fan of some description.",
    "If a phone needs a cooling fan, that suggests its internal components are being pushed right to the limit, and to us that sounds like a gaming phone rather than just another flagship. The other gaming phones that we've seen to date all make use of some kind of advanced cooling technology, including fans.",
    "While the trademarks do briefly refer to phones and tablets, so there is a connection, we are making a few assumptions here – there's no guarantee that Samsung is currently working on a gaming phone or that one is going to be released in the near future, but it's an interesting filing nevertheless.",
    "If Samsung does decide to take the plunge with a gaming phone then the device will be joining a growing field: from the original Razer Phone in 2018 to the ZTE Nubia RedMagic 6 in 2021, we've seen plenty of these gaming-focused handsets in recent years.",
    "So what makes a gaming phone different from a flagship phone? Extras like trigger buttons around the edges of the display, LED lighting on the back, and more sophisticated cooling solutions are often deployed. There are typically plenty of optimizations on the software side too, with tools for maximizing performance and cutting out distractions during those all-important gaming sessions.",
    "Samsung's expertise on both the hardware and the software side has us convinced that it can make one of the best gaming phones to date. This is a phone maker that's been pioneering the use of folding displays and cutting-edge components, so we're very confident it can pull off an eye-catching gaming phone.",
    "These devices may only be appealing to a certain niche of users – and are possibly too over-the-top for most of us to consider – but we're hoping that if the Samsung gaming phone is real, that it helps establish this as a category that can push the rest of the industry forward. The success of the Nintendo Switch shows that the appetite for on-the-go gaming is there, if it can be tapped into."
  ],
  "headers": {
    "4": "Welcome Samsung"
  },
  "links": {
    "every price point": "https://www.techradar.com/reviews/samsung-galaxy-a52-5g-review",
    "Xiaomi": "https://www.techradar.com/news/xiaomi-black-shark-4-launched-and-its-a-gaming-phone-with-big-compromises",
    "Asus": "https://www.techradar.com/reviews/asus-rog-phone-5",
    "LetsGoDigital": "https://nl.letsgodigital.org/smartphones/samsung-activate-fan-mode/",
    "gaming phones": "https://www.techradar.com/news/best-phone-for-gaming",
    "Razer Phone": "https://www.techradar.com/reviews/razer-phone-review",
    "ZTE Nubia RedMagic 6": "https://www.techradar.com/reviews/nubia-red-magic-6",
    "best gaming phones": "https://www.techradar.com/news/best-phone-for-gaming",
    "folding displays": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "cutting-edge components": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}