{
  "source": "https://www.techradar.com/news/black-friday-tv-deal-the-worlds-best-oled-tv-has-already-crashed-to-its-lowest-price-yet",
  "title": "Will this LG C1 OLED Black Friday TV deal get any cheaper this year?",
  "category": "televisions",
  "updated": "2021-11-16T19:27:45Z",
  "author": "gareth-beavis",
  "summary": "The 5-star OLED TV from LG is somehow still on sale",
  "article": [
    "If you're looking to buy one of the best OLED TVs during Black Friday this year, the the LG C1 OLED is one that you'll struggle to beat.",
    "In our five-star LG C1 OLED review, we found that it offered amazing color reproduction, clear and defined images and a whole host of other useful smart features... and it's just $1,296.99 (was $1,499.99) over at Amazon, where nearly all screen sizes have been heavily discounted.",
    "It's been this price for a while now - we first reported this deal nearly two weeks ago - so we're shocked it's still on sale. While it could drop further in the Black Friday deals, or even as late as Cyber Monday, if you want this before Christmas you might want to snaffle it earlier to avoid shipping delays.",
    "If you want to get analytical, the awesome 55-inch CX OLED (2020's mode) was mostly sold for $1,380 last year - so the price cuts are already plunging lower than expected.",
    "Why should you buy this? It's a five-star product, and one of the best TVs on TechRadar - and that's a rare thing indeed. You might buy it for the color reproduction, the suite of high-end inputs to allow you to game on a next-gen console at full power or the excellent smart features interface (many members of the TechRadar team own an LG OLED, and they all rave about what it offers).",
    "It's more expensive than some 4K, large-screen TVs out there, but it's very much worth the upgrade - and we've not even mentioned how thin this thing is, allowing you to wall mount and use the inbuilt gallery mode to let you show works of art.",
    "Note, the LG C1 series OLED TV is also on sale at Best Buy(where you can also get the 88-inch model for $5,000) and Walmart's early Black Friday TV deals event, if you'd prefer to pick it up from those retailers instead.",
    "We're honestly shocked that this is available still as an early Black Friday TV deal, and if you've been hankering after the C1, then you might not save that much more come the main sales period. Alternatively, you can wait and check out Amazon Black Friday deals page on the day.",
    "Outside the US? See the best TV deals in your region just below.",
    "Looking for more discounts? Head over to our main cheap TV deals page to see a full list of recommendations from LG, Samsung, Sony, and other leading brands. Also:"
  ],
  "headers": {
    "4": "Black Friday TV deals: LG C1 OLED",
    "9": "More Black Friday TV deals"
  },
  "links": {
    "just $1,296.99 (was $1,499.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FLG-OLED55C1PUB-Alexa-Built-Smart%2Fdp%2FB08WFV7L3N%2F%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7988238266019164000-20",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "best TVs": "https://www.techradar.com/news/best-tv",
    "is also on sale at Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1110585245036162800&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Flg-65-class-c1-series-oled-4k-uhd-smart-webos-tv%2F6453312.p%3FskuId%3D6453312&article_name=Will%20this%20LG%20C1%20OLED%20Black%20Friday%20TV%20deal%20get%20any%20cheaper%20this%20year%3F&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fblack-friday-tv-deal-the-worlds-best-oled-tv-has-already-crashed-to-its-lowest-price-yet",
    "Walmart's": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-6570058910614994000&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FLG-65-Class-4K-UHD-Smart-OLED-C1-Series-TV-with-AI-ThinQ-OLED65C1PUB%2F604778663%3Fathbdg%3DL1700",
    "Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals",
    "cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales"
  }
}