{
  "source": "https://www.techradar.com/news/iris-and-western-union-team-up-to-offer-global-payroll-services",
  "title": "IRIS and Western Union team up to offer global payroll services",
  "category": "computing",
  "updated": "2021-05-17T15:52:02Z",
  "author": "rob-clymo",
  "summary": "Partnership aims to streamline multi-currency payroll tasks",
  "article": [
    "IRIS Software Group has teamed up with Western Union Business Solutions to offer simplified global payroll and payments solutions worldwide.",
    "In an international partnership that will span five years, the deal aims to meet growing demand for international cross-border payroll and currency payments, particularly for organizations that have a global workforce.",
    "Demand is increasing for more integrated payroll solutions that can not only handle salaries but cover finance, HR and other vital business operations on a global scale. IRIS will combine its own specialist skills in payroll, benefits, payments and HR solutions with Western Union Business Solutions, which handles the logistics involved in sending, receiving and managing international payments.",
    "IRIS FMP is already well-versed in covering international payroll, benefits, payments and HR solutions, with the company claiming approximately 20% of the UK’s workforce is paid by its payroll offerings, while 90% of the global workforce is covered by IRIS HR and payroll solutions.",
    "Meanwhile, Western Union Business Solutions claims similar high global coverage, with a presence in 200 countries and territories around the world.",
    "“Working with a trusted partner brings swathes of security for customers, as both parties understand the challenges of global payroll and payments in both mature and emerging international markets,” said David Munn, Director of International Payroll Services for IRIS FMP.",
    "By combining the two company’s expertise, the partnership aims to let payroll managers and accountants calculate and process employee salaries more efficiently. That, combined with Western Union’s skill at getting money to the right destination should ensure that employees are paid correctly and on time, even when it involves multi-currency transactions.",
    "“Globalisation, increased legislation, and the acceleration of digital technology are propelling multinational and global organisations to reimagine their payroll operations,\" added Frederic Simon, Regional Vice President Europe at Western Union Business Solutions.",
    "\"They need to ensure they can pay international employees on time, in the right currency, with confidence and ease has become table stakes. Our collaborative partnership with IRIS FMP, will help provide an end-to-end enhanced value proposition and strengthen our commitment to accommodate the payroll and payments needs for global organisations.”"
  ],
  "headers": {
    "5": "Payroll services"
  },
  "links": {
    "payroll": "https://www.techradar.com/best/best-payroll-software",
    "payments solutions": "https://www.techradar.com/best/best-payment-gateways",
    "currency payments": "https://www.techradar.com/best/best-money-transfer-apps",
    "finance": "https://www.techradar.com/best/best-personal-finance-software",
    "HR": "https://www.techradar.com/best/best-hr-software",
    "HR solutions": "https://www.techradar.com/best/best-hr-software/best/best-hr-outsourcing",
    "international payments": "https://www.techradar.com/news/payments-is-a-journey-not-a-destination"
  }
}