{
  "source": "https://www.techradar.com/news/skydio-drones-spreads-their-wings-to-take-on-dji-outside-the-us",
  "title": "Skydio drones spreads their wings to take on DJI outside the US",
  "category": "cameras",
  "updated": "2021-07-28T09:47:00Z",
  "author": "mark-wilson",
  "summary": "International enterprise launch could be just the start",
  "article": [
    "Skydio has launched its autonomous drones in Australia and New Zealand for enterprise and public sector customers, marking the first time its flying cameras have been available outside the US.",
    "The Skydio 2 and business-focused Skydio X2 have both been given Regulatory Compliance Mark (RCM) certification, which is Australia's seal of approval for electronics products. That means the Skydio 2 is available now for businesses or government agencies, while the Skydio X2 can be pre-ordered ahead of availability in Q3 (so sometime before October).",
    "It's not yet clear whether Skydio plans to follow this up with a consumer Skydio 2 launch in the region, but the US company says the announcements \"mark the next step in Skydio’s international expansion strategy in Asia Pacific\".",
    "The Skydio 2 is a compact drone that sits somewhere in between the DJI Air 2S and DJI Mavic 2 Pro. It weighs only 775g and is fronted by a three-axis gimbal, which holds a 12MP camera that's capable of shooting 4K/60p or 1080p/120p video.",
    "Skydio's autonomous drone, which has impressive 360-degree obstacle avoidance, is currently only available to buy in North America, with Skydio stating that it's \"not currently certified for use or warrantied outside of the US and Canada\". The news about its Australia certification suggests that's about to change, though, at least for businesses and emergency services initially.",
    "We've asked Skydio if it plans to follow this up with a consumer launch of the Skydio 2 in the region and will update this story when we hear back. But while its consumer page says it \"hopes to expand to other countries soon\", it certainly sees enterprise and government as the bigger opportunities right now – and that's backed up by the amount of services it'll be offering with its drones.",
    "Alongside that DJI-rivalling obstacle avoidance, which on the Skydio 2 is delivered by six 4K cameras, the company will be offering software like Skydio 3D scan, an autonomous scanning system for producing 3D models of buildings and bridges. Businesses that need to plug drone-captured data into their systems can also use Skydio Cloud, a secure cloud-based service for footage and metrics.",
    "Update 28/7/21: Skydio updated us on its international expansion plans with this statement from Skydio spokesperson Kate Sheehy: \"While we don't have additional updates to share at this time, expanding the availability of our products to consumer, enterprise and public sector customers outside the U.S. remains a priority and we look forward to sharing more in the coming months.\"",
    "It's a shame that Skydio still hasn't announced a consumer launch for the Skydio 2 outside the US, but there are a few good reasons for that – and the news about an enterprise takeoff in Australia and New Zealand is a significant step that could give DJI some much-needed worldwide competition.",
    "It hasn't been the best year for DJI, with the Chinese market leader hit by the news that it was being added to the US government's 'Entity List' – restricting it from using US technologies and components – in the middle of a pandemic that kept many drone flyers indoors.",
    "This left a possible opening for rivals like Skydio, but the US drone maker has had its fair share of turbulence, too. Lockdowns forced Skydio to close down its California-based assembly line in the early days of the pandemic, which meant it couldn't fulfill pre-orders for the Skydio 2 and wasn't able to ship any drones for several months. It's aiming to catch up with its order backlog \"by the end of September\".",
    "The Skydio 2 also needed a big software update to improve the safety of its vertical touch-downs, while the company had to raise the drone's price to $1,349 (around £985 / AU$1,830) \"due to a global shortage of chips and other components\". That'll sound very familiar to anyone who's tried to buy a webcam, PS5 or virtually any piece of tech in the last year.",
    "All of this has meant the potential attack on DJI's drone dominance hasn't quite materialized. According to a survey from US drone insurance company Skywatch, DJI only lost about 7% of its market share (from 94% to 87%) in the US between 2018 and mid-2021, with the main beneficiaries being Autel and Skydio. While this only a small snapshot of the drone market (the data was based on a survey of Skywatch customers), it does give a sense of how DJI has managed to continue flying high despite some rough conditions.",
    "It looks like that delayed attack from rivals like Skydio and Autel, though, might finally be ready for lift-off, as supply chains start to settle down and travel opens up. All of which should ultimately be good news for aerial photography fans worldwide, as an understandably quiet year for new drone launches leads into a more promising 2022."
  ],
  "headers": {
    "8": "Analysis: Competition for DJI drones finally has lift-off"
  },
  "links": {
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s",
    "DJI Mavic 2 Pro": "https://www.techradar.com/reviews/dji-mavic-2-pro",
    "Skywatch": "https://www.skywatch.com/"
  }
}