{
  "source": "https://www.techradar.com/news/how-to-watch-star-trek-lower-decks-online-and-stream-every-episode-from-anywhere-now",
  "title": "How to watch Star Trek: Lower Decks online and stream every episode from anywhere now",
  "category": "computing",
  "updated": "2021-01-22T07:03:51Z",
  "author": "kevin-lynch",
  "summary": "Rick and Morty writer Mike McMahan's cartoon is based on the sci-fi classic",
  "article": [
    "From warping minds with off-the-wall adult cartoon Rick and Morty, writer Mike McMahan's latest animated show sees him turn his attention to all things warp speed. Read on as we explain how to watch Star Trek: Lower Decks online, wherever you are in the world right now.",
    "Set after the movie Star Trek: Nemesis (but before Picard), the cartoon comedy show follows the support crew on one of Starfleet's least important ships, the U.S.S. Cerritos. The show is the first Star Trek animated series in decades, and features a pretty big name voice talent.",
    "The cast includes The Boys’ Jack Quaid (Ensign Brad Boimler), Space Force’s Tawny Newsome (Ensign Beckett Mariner), Master of None’s Noël Wells (Ensign Tendi) and The Good Place’s Eugene Cordero(Ensign Rutherford).",
    "Essentially a workplace sitcom, the show follows the day-to-day lives of the under-appreciated crew as they come up against a host of galactic threats.",
    "McMahan, who was responsible for some of Rick and Morty's most beloved episodes including Total Rickall, as well as being the co-creator of the Hulu series Solar Opposites.",
    "His Trekkie credentials are also legit, having been the brains behind the hugely popular Star Trek: The Next Generation season 8 Twitter account, which imagined what the show might have looked like had it continued beyond its seventh series.",
    "Read on for your full guide to streaming Star Trek: Lower Decks - for fans in the UK and Australia you can watch for nothing thanks to a FREE 30-day Amazon Prime trial .",
    "For anyone abroad right now when Star Trek: Lower Decks Decks lands in the UK and Australia - or wanting to tune in from countries where it's been around a bit longer - you’ll be unable to watch the sci-fi comedy due to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream the the new series online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch your favourite TV shows from anywhere",
    "More from Amazon Prime:"
  ],
  "headers": {
    "7": "How to watch Star Trek: Lower Decks online from outside your country",
    "10": "How to watch watch Star Trek: Lower Decks online in Australia"
  },
  "links": {
    "FREE 30-day Amazon Prime trial": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Famazonprime%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8470072922142578000-21",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}