{
  "source": "https://www.techradar.com/news/netflix-teases-superhero-drama-jupiters-legacy-with-first-look-images",
  "title": "Netflix teases superhero drama Jupiter's Legacy with first look images",
  "category": "entertainment",
  "updated": "2021-03-01T17:38:19Z",
  "author": "tom-power",
  "summary": "The Millarworld is coming to Netflix",
  "article": [
    "Netflix has revealed a batch of first look images for its upcoming adaptation of comic book Jupiter's Legacy.",
    "The streamer posted a 50-second teaser video on its official NX Twitter account on Monday, which showed a variety of comic book-style sketches being turned into high-definition TV stills. The photographs show off a number of the series' main players, including Josh Duhamel as protagonist Sheldon Sampson/The Utopian and Leslie Bibb as Grace Sampson/Lady Liberty.",
    "Netflix also uploaded the eight images in their final, real-world form after the teaser footage. Check out a gallery of the images revealed below:",
    "Jupiter's Legacy launches on Netflix on May 7.",
    "Netflix will certainly hope so. We have previously talked about how Jupiter's Legacy, and the Millarworld - Mark Millar's multiple comic book series - in general, could help the streamer to build up its own portfolio of superhero offerings.",
    "The Umbrella Academy has already shown that there is an audience for superhero style productions on Netflix, particularly in the wake of the streaming service losing its Marvel characters including Daredevil and Jessica Jones a few years back. With Marvel and DC superhero films also enjoying massive success, Netflix will want to strike while the iron is hot and compete with other properties, such as Amazon's adaptation of The Boys, for viewers' attention.",
    "The good news is that a key mind behind Daredevil is also involved in Jupiter's Legacy production. Steven S. DeKnight was the showrunner on Daredevil's critically-acclaimed first season, while Lorenzo di Bonaventura (Bumblebee, Deep Water Horizon) is also on board as an executive producer.",
    "With other Millarworld properties hopefully making the jump to Netflix, the streamer will no doubt hope that Jupiter's Legacy will be well-received. Kick-Ass and Kingsman have enjoyed success on the silver screen, and Jupiter's Legacy will hope to replicate that on our TVs."
  ],
  "headers": {
    "4": "Can Jupiter's Legacy fill the superhero void in Netflix's program slate?"
  },
  "links": {
    "build up its own portfolio": "https://www.techradar.com/news/why-netflixs-next-big-superhero-tv-show-has-nothing-to-do-with-marvel-or-dc",
    "The Umbrella Academy": "https://www.techradar.com/news/the-umbrella-academy-season-3"
  }
}