{
  "source": "https://www.techradar.com/news/apple-is-no-longer-the-worlds-biggest-wearables-brand",
  "title": "Apple is no longer the world's biggest wearables brand",
  "category": "wearables",
  "updated": "2021-09-08T13:30:48Z",
  "author": "tom-may",
  "summary": "Xiaomi takes the top spot. But does it matter?",
  "article": [
    "Hot on the heels of trumping Apple's smartphone sales, Xiaomi has now become the number one seller of wearables worldwide, bar none.",
    "According to data from market analysts Canalys, Xiaomi has pushed Apple into second place during Q2 of this year, both in terms of units shipped and market share.",
    "This was a pretty close-run thing. Xiaomi shipped around eight million wearables to Apple’s 7.9 million, and their market shares were 19.6% and 19.3%. But we imagine that champagne corks are still popping at the Beijing-based firm, as beating Apple at anything, at all, is a very big deal.",
    "That's especially true given the closest competition are trailing behind significantly, with third-placed Huawei on 9.2% market share, Fitbit in fourth with 7.3%, and Samsung in fifth with 6.1%.",
    "Apple, however, probably aren't too bothered. Because although this headline figure might make it look like Xiaomi is 'winning', it's not really comparing like with like.",
    "Apple's sales and market share are purely driven by the Apple Watch, while Xiaomi has a range of different fitness trackers, smart bands and smartwatches, most of which aren't in competition with the Apple Watch at all. Xiaomi also owns Redmi and Huami, which produces the Amazfit and Zepp sub-brands, and so both of these further inflate its total numbers.",
    "And ultimately, while Xiaomi is shipping the most wearables overall, it's only fifth in global wristwatch sales, with Apple far and away the clear leader here.",
    "In fact, Apple is absolutely dominating the global wristwatch market right now, with a healthy 31.1% share, way ahead of second-place Huawei on 18.9%, Garmin on 9.8%, Samsung on 5.2% and Xiaomi on a lowly 2.1%.",
    "That's not to completely take away from Xiaomi's success, of course. So how has it happened?",
    "Well, this was partly a case of 'a rising tide lifts all boats'. The wearables market as a whole saw a 5.6% year-on-year growth during this period, with an estimated 40.9 million wearables shipped overall.",
    "But it also stands testament to the fact that Xiaomi’s wearables are some of the best cheap fitness trackers around.",
    "Indeed, as we said in our recent review of the Xiaomi Mi Smart Band 6, “If you're in the market for a cheap fitness tracker, it’s well worth adding to your shortlist. It boasts some impressive features you'd expect to find in a much more expensive device, such as all-day stress tracking and a pulse oximeter, and its screen is exceptionally bright, vivid and responsive.”",
    "It’s not perfect by any means: we found its connected GPS didn’t work very well with workouts, and the band wasn't always particularly comfortable. But overall it strikes a great balance between performance and affordability.",
    "And it seems the global public agrees. Because despite not even launching in India, the Mi Smart Band 6 made a big contribution to Xiaomi’s Q2 results. And with the device finally launching in India on 26 August, things are looking very promising for Xiaomi wearable sales in the next quarter.",
    "Xiaomi also continues to lure cash-strapped buyers with the Mi Smart 6’s predecessor, the Mi Smart Band 5. While this still-cheaper model lacks onboard GPS, it does offer 24/7 activity tracking, continuous heart rate monitoring, 11 different sport modes, and the ability to record outdoor sessions by connecting to your phone's GPS.",
    "At the opposite end of the price scale, the impending arrival of the Apple Watch 7 is likely to shake up the market once more – not to mention the expected launch of the cheaper Apple Watch SE2. So even though the 'number one wearables' position isn't as important as you might have thought, Apple may be soon reclaiming it anyway..."
  ],
  "headers": {
    "4": "Not the whole story",
    "8": "How did Xiaomi's success happen?"
  },
  "links": {
    "trumping Apple's smartphone sales": "https://www.techradar.com/news/xiaomi-sales-trump-apple-once-again",
    "data": "https://www.canalys.com/newsroom/global-wearable-band-shipments-up-6percent-as-the-market-shifts-to-wristwatches",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "best cheap fitness trackers": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "Xiaomi Mi Smart Band 6": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-6",
    "finally launching in India": "https://www.techradar.com/news/mi-band-6-price-specs-review-sale-date",
    "Mi Smart Band 5": "https://www.techradar.com/reviews/xiaomi-mi-smart-band-5",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Apple Watch SE2": "https://www.techradar.com/news/apple-watch-se-2"
  }
}