{
  "source": "https://www.techradar.com/news/sonys-next-spider-man-spin-off-movie-has-found-its-lead-star",
  "title": "Sony's next Spider-Man spin-off movie has found its lead star",
  "category": "entertainment",
  "updated": "2021-05-27T09:09:32Z",
  "author": "tom-power",
  "summary": "Goodbye Quicksilver, hello Kraven the Hunter",
  "article": [
    "Sony isn't slowing down in its efforts to earn a slice of the superhero pie. The studio has a slate of upcoming Spider-Man spin-off movies up its sleeve, with Venom: Let There Be Carnage set to be the next film off the production line when it lands in September.",
    "While the marketing campaign for that flick is starting to pick up speed, Sony is pressing on with casting the leads in its other upcoming Spider-Man rogues gallery film line-up.",
    "The latest announcement to be made concerns Sony's Kraven the Hunter movie - and its main actor will be a familiar face to anyone who has watched the second MCU Avengers movie.",
    "Multiple outlets, including Deadline and IGN, reported overnight that Aaron Taylor-Johnson will star in Sony's Kraven the Hunter spin-off movie. Sony later confirmed the casting on its official Twitter account, too.",
    "Superhero and comic book movies are nothing new to Taylor-Johnson. The Godzilla actor portrayed Quicksilver in Marvel's Avengers: Age of Ultron movie in 2015, while he starred as Dave Lizewski/Kick-Ass in Lionsgate's 2010 and 2013 film adaptations, which were based on Mark Millar's graphic novel of the same name.",
    "We aren't aware of Kraven the Hunter's plot yet, but we do know some of the individuals who are working behind the scenes to make it a reality.",
    "J.C. Chandor, the director behind 2019's Triple Frontier, will direct the superhero flick from a screenplay written by The Equalizer's Richard Wenk. Ari Arad and Matt Tolmach will produce the movie, which is set to arrive in theaters in January 2023.",
    "Sony will hope so and, by all accounts, the studio's shared universe has got off to a solid start.",
    "Venom, the first movie in the Sony Pictures Universe of Marvel Characters (SPUMC) that arrived in 2018, was a huge box office success. The Tom Hardy-starring anti-hero flick took a surprising $856.1 million at the global box office despite its mixed critical reception, so it isn't a shock that Sony greenlit a sequel as soon as possible.",
    "Sony will hope that Venom: Let There Be Carnage produces a similar monetary outcome when it lands in theaters on September 24, but it remains to be seen if the studio's future movies will have the same impact.",
    "The next movie on the docket after Venom 2 is Morbius. The vampiric anti-hero movie, which stars Jared Leto as the titular character, has already seen its release pushed back five times since its original July 2020 launch date.",
    "The film's first trailer only received a fraction of the views that Venom's teaser acquired (18m to 82m) when it landed on YouTube in January 2020, and it's unclear if audiences will still have an appetite for Morbius when it eventually arrives next year.",
    "As for Sony's Kraven the Hunter movie, Taylor-Johnson's casting is a solid one. He's already shown that he can lead a movie in a variety of roles and, according to Deadline's report on his casting, it was Taylor-Johnson's work on upcoming movie Bullet Train that convinced Sony he was the right actor to play Kraven.",
    "The problem that Sony will have with its Spider-Man anti-hero or villain films, though, is whether audiences will know enough about them - or whether they can even work without Spider-Man involved.",
    "Sure, their Venom film adaptation was a gamble, but viewers were aware of who this individual was before Sony's 2018 movie. Venom had already appeared as one of three villains Sam Raimi's Spider-Man 3, and the character is one of Spider-Man's most famous foes in the comics. Installing Venom as the lead in his own movie, then, wasn't much of a stretch for audiences, even if it was certainly helped by Hardy's casting as Eddie Brock/Venom.",
    "While Kraven and Morbius are two other fairly popular Spider-Man villains among certain sections of the superhero's comic fanbase, they don't have the same weight that Venom does. Add in the fact that it's incredibly unlikely that Spider-Man will feature in either flick, and both films (Kraven's especially) might not work as intended.",
    "Yes, Venom did without Spider-Man so there's every possibility that Kraven and Morbius could, too. Unless the Kraven movie is an origin story, though, this movie will arguably struggle more than the Morbius film will. Spider-Man is so integral to Kraven's various story arcs in Marvel comics, so it'll be intriguing to see how Sony cooks up this movie in particular.",
    "In that respect, Sony has its work cut out to convince audiences to watch both movies when they're released in 2022 and 2023. If Kraven and Morbius follow a similar blueprint to Venom, they can help to usher in Sony's live-action connected universe. If they bomb at the box office, though, the SUPMC might have failed before it's truly got going."
  ],
  "headers": {
    "7": "Analysis: Can Kraven the Hunter help usher in Sony's Spider-Verse?"
  },
  "links": {
    "Venom: Let There Be Carnage": "https://www.techradar.com/news/venom-2-trailer-is-reportedly-coming-today-and-it-may-feature-a-big-superhero-cameo",
    "Deadline": "https://deadline.com/2021/05/kraven-the-hunter-aaron-taylor-johnson-spider-man-villain-1234764921/",
    "IGN": "https://www.ign.com/articles/kraven-the-hunter-sony-spider-man-spinoff"
  }
}