{
  "source": "https://www.techradar.com/news/dune-director-claims-mcu-movies-are-all-the-same-and-fans-arent-happy",
  "title": "Dune director claims MCU movies are all the same – and fans aren't happy",
  "category": "entertainment",
  "updated": "2021-09-17T09:10:06Z",
  "author": "tom-power",
  "summary": "\"Marvel movies are nothing more than a ‘cut and paste’ of others\"",
  "article": [
    "Dune director Denis Villeneuve has suggested that Marvel movies are \"nothing more than a cut and paste of others\".",
    "Almost two years after Martin Scorcese's riposte that MCU films \"aren't cinema\", Villeneuve has added his two cents to the debate – and his response has angered sections of the Marvel fanbase.",
    "Speaking to El Mundo (as first seen by The Direct), Villeneuve was asked for his thoughts on Marvel Studios' multi-billion dollar franchise, and what impact it was having on the moviegoing experience.",
    "“Perhaps the problem is that we are in front of too many Marvel movies that are nothing more than a ‘cut and paste’ of others,” Villeneuve replied. “Perhaps these types of movies have turned us into zombies a bit… But big and expensive movies of great value there are many today. I don’t feel capable of being pessimistic at all [about the future of other big movie productions].”",
    "The Arrival and Blade Runner 2049 director's comments didn't stop there. In a separate interview with French publication Premiere (as reported by IndieWire), Villeneuve appeared to double down on his earlier quotes.",
    "Responding to another Marvel movie question, Villeneuve said: “If we’re talking about Marvel, the thing is, all these films are made from the same mold. Some filmmakers can add a little color to it, but they’re all cast in the same factory. It doesn’t take anything away from the movies, but they are formatted.”",
    "Suffice to say, Marvel fans have reacted angrily to Villeneuve's comments.",
    "Sections of the MCU fanbase have suggested that Villeneuve's quotes are ironic, with some saying that Dune is another example of the film industry's current penchant for movie remakes.",
    "Meanwhile, others claimed that Villeneuve's decision to criticize the MCU was solely with the intention of generating interest in Dune ahead of its release next month:",
    "Marvel fans weren't the only ones who slammed Villeneuve for his responses, either. Doctor Strange director Scott Derrickson retweeted his response to Scorcese's 2019 comments about the MCU, before suggesting that anyone criticizing Marvel films \"shouldn't assume they're all the same\".",
    "Not everyone was totally against Villeneuve's quotes, though. Some fans, including those who enjoy MCU movies, argued that it was okay to dislike Marvel films, while others hit out at those interviewing Villeneuve over their attempts to create discourse online.",
    "So, is criticism of Villeneuve (and his comments) valid? In a sense, yes. Fans are passionate about things that they like, so Marvel fanatics are sure to defend the movie series if they feel it's regularly been attacked by those involved in the filmmaking business.",
    "However, the vilification of Villeneuve is excessive. The Dune director is clearly more reserved than Scorcese in what he says and, at one point, he does note that Marvel Studios' formula for moviemaking isn't actually a bad thing; he just doesn't agree with how Marvel goes about crafting its superhero flicks.",
    "Scorcese and Villeneuve aren't the only directors to hit out at how superhero movies are made, either. James Gunn, who has helmed both of Marvel's Guardians of the Galaxy films and Warner Bros' The Suicide Squad, has claimed that superhero flicks have become \"boring\" to watch.",
    "Is Gunn deserving of a free pass from Marvel fans, or comic book film fanatics generally, just because he's been involved in the production of them? Not really. In our view, his criticisms are just as valid as Villeneuve's, regardless of the fact that Gunn has earned the proverbial t-shirt for his work in this genre.",
    "Whether it's through new technologies or blending genres together in ways that haven't been done before, movies need to constantly evolve to prevent the industry from stagnating.",
    "And that, in our opinion, is where Villeneuve is coming from. Marvel movies do tend to stick a basic developmental formula – there's always a climactic, CGI-laden third act battle, for example – and, while that's been hugely successful, it's something that Villeneuve doesn't necessarily agree with. In that sense, his criticisms are valid, even if diehard Marvel fans won't agree with them."
  ],
  "headers": {
    "6": "Analysis: is MCU fan criticism of Villeneuve's comments over the top?"
  },
  "links": {
    "El Mundo": "https://www.elmundo.es/cultura/cine/2021/09/15/6140b623fdddff11618b4602.html",
    "The Direct": "https://thedirect.com/article/marvel-denis-villeneuve-movies-zombies",
    "Premiere": "https://www.premiere.fr/Cinema/News-Cinema/Denis-Villeneuve--Avec-Dune-j-ai-essaye-de-faire-le-film-le-plus-populaire-possible",
    "IndieWire": "https://www.indiewire.com/2021/09/denis-villeneuve-marvel-movies-zombies-1234665235/",
    "shouldn't assume they're all the same": "https://twitter.com/scottderrickson/status/1438679063036502020",
    "it was okay to dislike": "https://twitter.com/FilmItLee/status/1438516810576400390"
  }
}