{
  "source": "https://www.techradar.com/news/the-samsung-one-connect-box-is-back-for-2021-but-something-needs-to-change",
  "title": "The Samsung One Connect box is back for 2021, but something needs to change",
  "category": "televisions",
  "updated": "2021-01-30T11:00:02Z",
  "author": "henry-st-leger",
  "summary": "Cables, begone!",
  "article": [
    "Ah, the Samsung One Connect box. The long-running cabling solution for premium Samsung TVs has been something of an unsung hero for the past few years, offering TV shoppers a way to hide away unsightly wires and connections and keep the periphery of the TV screen clear of clutter.",
    "It’s a relief, then, to see it receive a 2.0 model that continues the One Connect’s legacy – but things seem a little different this time around.",
    "A blog post from Samsung on its 2021 TV range gives a small nod to the “Slim One Connect box”, calling it “an all-new cable management system that can be attached to the TV’s back – allows for an easier install and cleaner aesthetic.”",
    "It’s specifically named in reference to Samsung’s Neo QLED 8K TVs, of which there are three in this year’s range, so we’re assuming (hoping?) it’s available for the whole trio. The mention of attaching the box “to the TV’s back” suggests some more flexible uses for the hardware, too, with the option to hide cabling behind the TV itself, rather than simply below or to the side of the screen.",
    "We actually first caught sight of the new One Connect box during the CES 2021 expo, when it appeared in a promo video espousing the features of this year’s new Samsung TV range. While it only appeared for a moment, and details are currently still scarce, there’s a lot we can tell just from the outside of the box.",
    "The new model is definitely slimmer and shorter, with the curved body and smooth sheen of a polished pebble – quite different from the rectangular shape and pointed corners of the previous iteration.",
    "The great benefit of the One Connect box is that it minimizes the impact of cabling multiple devices together, drawing wires and connections away from the screen you have to stare at, and ensuring the mess is both out of sight and out of mind. The existing model makes use of a single, translucent cable that somehow carries power from the mains as well as signals from anything plugged into your HDMI ports and the like.",
    "A more compact shape really doubles down on this, reducing the amount of space needed for the box – no small feat given a whole TV’s worth of connections will be packed in. In a world of massive next-gen gaming consoles too (cough, PS5, cough), being able to save some room in your media cabinet is more urgent than ever.",
    "The screengrabs we managed to source from its brief appearance in Samsung's First Look video even show the box attaching to the back of a TV stand, which is a change from the previous model – and something that's surely only possible because of the slimmer and lighter design. (Check out the box at 30:00 in the video below.)",
    "We’re yet to receive official specifications for the Slim One Connect box, but we very much expect to see HDMI 2.1 ports, given how common they now are in Samsung’s TV range, with support for HDMI eARC (enhanced audio return channel) that allows audio passthrough to a soundbar. It'll likely be prioritized for 8K TVs, too, as well as the new MicroLED series coming this year.",
    "Samsung seems to be shaking up its strategy for the box quite often – in 2019, the box was available for every Samsung TV from the Q85R upwards, as well as the Serif and The Frame designer TVs. In 2020, though, you could only get it with the Q95T QLED (a variant of the Q90T) or the flagship Q950TS 8K QLED.",
    "In mid-2020 we even wrote a piece on why so few Samsung TVs were able to ship with the box, with Samsung telling us that the “quite expensive” hardware meant the company was reluctant to manufacture en masse or expect customers to pay the additional cost.",
    "At the time, we wrote the following: “Given it essentially turns a TV into two separate hardware devices – one that inputs, and one that displays – that price markup is pretty unsurprising, and it means that what could have become a standard feature of new Samsung TVs has been relegated to the sidelines.”",
    "We’re hoping this refresh sees the One Connect box become more standardized across the range, though, ideally with the option to add alongside any purchase of any new Samsung TV – for the QLED range, at least – something that still eludes the TV brand’s many customers.",
    "We’ll be sure to let you know when more information on the Slim One Connect box comes through. The true value in an upgraded model, though, will be in how easily TV shoppers can access it, and if it’s limited to just a couple of 2021 televisions, the One Connect box’s chances for glory will be looking pretty slim."
  ],
  "headers": {
    "4": "Same but different",
    "10": "Make your mind up!"
  },
  "links": {
    "blog post": "https://www.awin1.com/awclick.php?awinmid=17946&awinaffid=103504&clickref=trd-us-7840843637228836000&p=https%3A%2F%2Fnews.samsung.com%2Fuk%2Fsamsung-electronics-debuts-2021-neo-qled-microled-and-lifestyle-tv-lines-highlighting-commitment-to-sustainable-and-accessible-future",
    "Samsung’s Neo QLED 8K TVs": "https://www.techradar.com/news/samsung-neo-qled-tvs-meet-the-future-of-quantum-dot-tvs",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "HDMI eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "new MicroLED series coming this year": "https://www.techradar.com/news/samsung-has-a-microled-tv-that-can-split-into-four-different-screens",
    "Q85R": "https://www.techradar.com/reviews/samsung-q85r-4k-hdr-qled-tv",
    "Serif": "https://www.techradar.com/reviews/samsung-serif-tv-2019",
    "The Frame": "https://www.techradar.com/reviews/samsung-the-frame-tv-2020",
    "Q95T": "https://www.techradar.com/reviews/samsung-q95t-4k-qled-tv",
    "Q90T": "https://www.techradar.com/reviews/samsung-q90t-qled-tv",
    "Q950TS 8K QLED": "https://www.techradar.com/reviews/samsung-q950ts-8k-qled-tv-75q950ts",
    "why so few Samsung TVs were able to ship with the box": "https://www.techradar.com/news/samsung-oneconnect-box-is-still-a-marvel-so-why-do-so-few-samsung-tvs-get-it",
    "new Samsung TV": "https://www.techradar.com/news/new-samsung-tv-2021",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "TV brand": "https://www.techradar.com/best/best-tv-brands"
  }
}