{
  "source": "https://www.techradar.com/news/a-new-captain-america-means-the-mcu-is-setting-itself-up-for-the-future",
  "title": "A new Captain America means the MCU is setting itself up for the future",
  "category": "entertainment",
  "updated": "2021-08-30T12:12:35Z",
  "author": "richard-edwards",
  "summary": "Why Marvel’s superhero brands are bigger than the people who wear the suits",
  "article": [
    "If there’s one inevitability that links all long-running franchises it’s that sooner or later, one or more of your leading actors will become unavailable. Whether that’s caused by scheduling conflicts or a simple desire to go off and try new things, there are several ways the powers-that-be can face up to the challenge.",
    "The most straightforward option is to simply recast and pretend nothing has changed – see Becky in Roseanne, Aunt Viv in The Fresh Prince of Bel-Air and numerous Game of Thrones characters – but that runs the risk of leaving viewers wondering why a pivotal character has undergone radical facial reconstruction overnight. James Bond’s producers, meanwhile, prefer to make a headline-grabbing song-and-dance of recasting British intelligence’s most universal export every few years, and generally treat it as an opportunity to take the franchise in a new direction.",
    "Arguably the most ingenious solution to a departing star came in 1966, when Doctor Who’s writers enshrined in canon the convenient fact that Time Lords can regenerate into new bodies. More than five decades later, nobody bats an eyelid that the UK’s most famous sci-fi character has been played by 13 (or 14, if you’re being pedantic) different actors.",
    "Now, reports that Sam Wilson (played by Anthony Mackie) may be about to take the lead in Captain America 4 – having first inherited Steve Rogers’ mantle in The Falcon and the Winter Soldier’s finale – suggest the Marvel Cinematic Universe has come up with a new way to tackle the problem.",
    "As we’ve come to expect from the most successful movie series in box office history, the MCU’s approach to overcoming the departure of Chris Evans – one of its biggest names – is super-smart. It should also ensure that the franchise stays relevant through Phase 4 and beyond.",
    "Marvel hasn't even had to resort to reboots or Marvel’s fledgling multiverse to make it work. Instead, the solution is simple storytelling common sense – and means that less familiar newcomers to the MCU such as Eternals, and Shang-Chi and the Ten Rings won't have to do all the heavy-lifting.",
    "Just as the MCU took inspiration from its comic book source material in creating a vast shared universe where all its heroes can pop up in each other’s movies, having new characters step into famous uniforms is a direct lift from Marvel pages. On top of Sam Wilson becoming the new Cap, the 21st century has seen the introductions of Miles Morales as a new Spider-Man, Amadeus Cho as a new Hulk, Jane Foster as a new Thor, and Riri Williams as Iron Man replacement Ironheart.",
    "Not only has the strategy improved the diversity of a superhero line-up that’s traditionally been dominated by white men, it can help make decades-old superhero tropes feel relevant again. If you thought writers were running out of challenges to sling at Peter Parker, there’s no need to worry because Miles Morales’ characteristics will undoubtedly showcase those Wallcrawler abilities in a new light.",
    "And while Parker, Rogers and Bruce Banner will always be synonymous with Spidey, Cap and the Hulk, it’s important to bear in mind that they’re usually remembered more for what they do as their superpowered alter-egos than what they do in civilian life – the same way that Clark Kent can blend into the background, while Superman is one of the most recognizable figures in pop culture. Indeed, superhero brands are usually bigger than any particular incumbent of the role – or the actor playing them.",
    "When faced with the exit of its two biggest stars, most franchises would recast, reboot, or find a strange halfway house as the X-Men saga did when it turned its timeline into an indecipherable mess with four prequel movies and three Wolverine-spin-offs. Yet thanks to Marvel’s ingenious succession planning, the loss of Robert Downey Jr and Chris Evans should amount to a mere blip on the MCU landscape.",
    "Downey, in particular, did so much to make the role of Tony Stark his own that it’s impossible to imagine anyone else playing Marvel’s most famous genius, billionaire, playboy and philanthropist. It’s a recasting headache best avoided – see also: finding a successor Hugh Jackman as Wolverine – and the MCU has seemingly sidestepped the dilemma entirely by bringing Ironheart (played by Dominique Thorne) into the mix in next year’s Black Panther: Wakanda Forever and her upcoming TV show. If you like your heroes running around in technologically advanced battle armor, Marvel Studios has still got you covered.",
    "Crucially, prioritizing super-brands over specific characters allows Marvel to preserve its most important asset – that epic continuity. Sure, the MCU could make like Gotham City – where the upcoming The Batman will be the start of the fourth Caped Crusader arc since 1989 – and retell Stark’s story from day one. But then you risk destroying the legacy of 13 years of storytelling, and devaluing Stark’s sacrifice in Avengers: Endgame. Besides, Marvel already has What If…? reinventing popular characters, making movie reboots somewhat redundant.",
    "We perhaps didn’t realize it at the time, but when Anthony Mackie’s Sam Wilson agreed to become Captain America in The Falcon and the Winter Soldier, he was helping secure the MCU’s future as the biggest movie/TV franchise in the known universe. Who knows, maybe Natalie Portman’s Jane Foster playing god in Thor: Love and Thunder could be Chris Hemsworth's excuse to hang up his hammer after a memorable decade in the role? Or, when Tom Holland decides he’s too old to play the teenage Peter Parker, could Miles Morales swing in to save the day?",
    "Marvel Studios has long been redefining the way we look at superhero movies and TV shows. By allowing its most iconic heroes to live on after the original incumbents of the super-suits have moved on, chances are they’re going to be doing it for years – and even decades – to come."
  ],
  "headers": {
    "6": "Embracing the future",
    "10": "Life after Stark"
  },
  "links": {
    "James Bond": "https://www.techradar.com/how-to/how-to-watch-the-james-bond-movies-in-order",
    "Doctor Who": "https://www.techradar.com/best/best-doctor-who-episodes",
    "Captain America 4": "https://www.techradar.com/news/captain-america-4-with-sam-wilson-is-great-news-but-he-needs-a-better-story-this-time",
    "The Falcon and the Winter Soldier’s finale": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-episode-6-recap-an-emotional-and-inspirational-finale",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Shang-Chi and the Ten Rings": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "X-Men saga": "https://www.techradar.com/how-to/how-to-watch-the-x-men-movies-in-order",
    "Black Panther: Wakanda Forever": "https://www.techradar.com/news/black-panther-2-release-date-cast-plot-and-everything-you-need-to-know-about-wakanda-forever",
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer",
    "What If…?": "https://www.techradar.com/news/marvels-what-if-is-surprisingly-popular-compared-to-other-mcu-shows"
  }
}