{
  "source": "https://www.techradar.com/news/hbo-max-horror-fantasy-drama-the-nevers-gets-a-pretty-awesome-first-trailer",
  "title": "HBO Max horror-fantasy drama The Nevers gets a pretty awesome first trailer",
  "category": "entertainment",
  "updated": "2021-02-04T21:26:27Z",
  "author": "samuel-roberts",
  "summary": "Check out the new TV show from the creator of Buffy the Vampire Slayer",
  "article": [
    "HBO Max has revealed the first trailer for new drama The Nevers, a new genre-blending fantasy/horror series created, written and directed by Buffy the Vampire Slayer and Avengers overseer Joss Whedon. The show will debut on HBO in April, rolling out with six episodes, and will stream on HBO Max.",
    "The new series is set in the final years of Victorian London, where people called the 'Touched' start to develop powers – some of which are kind of cool, others of which are more on the upsetting side. The show features a massive ensemble cast, but the two leads are Amalia True (Laura Donnelly), a widow who's adept at beating people up, and an inventor called Penance (Ann Skelly). They fight on the behalf of this lowe class group of gifted people.",
    "Here's the first teaser, which looks pretty promising:",
    "Whedon, who's a complicated figure to discuss these days, stepped down from the show back in November 2020. Other Buffy writers are involved with the show, including Doug Petrie and Jane Espenson.",
    "The cast for The Nevers also includes Olivia Williams, Nick Frost, Pip Torrens, Tom Riley, Kiran Sawar and Ben Chaplin, among other recognizable British TV names.",
    "Prior to Game of Thrones, HBO had True Blood, but otherwise was better known for more serious, realistic dramas than sci-fi and fantasy. These days, it's a very different story – 2019's Watchmen, His Dark Materials and last year's Lovecraft Country show that making these kinds of series are a priority for the premium cable channel.",
    "The Nevers, then, is the next link in the chain on that effort. It certainly looks like no expense has been spared to bring it to the small screen."
  ],
  "headers": {
    "5": "The search for the next Game of Thrones"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "complicated figure": "https://www.thewrap.com/joss-whedon-feminist-hypocrite-infidelity-affairs-ex-wife-kai-cole-says/",
    "stepped down from the show back in November 2020": "https://variety.com/2020/tv/news/joss-whedon-hbo-series-the-nevers-exit-1234840465/"
  }
}