{
  "source": "https://www.techradar.com/news/icloud-update-offers-seamless-switching-between-mac-and-pc",
  "title": "iCloud update offers seamless switching between Mac and PC",
  "category": "computing",
  "updated": "2021-08-17T10:03:49Z",
  "author": "joel-khalili",
  "summary": "iCloud Passwords service for Windows gets a much-needed upgrade",
  "article": [
    "Apple has rolled out an update for iCloud for Windows that minimizes the friction associated with hopping between Mac and PC.",
    "Bundled with version 12.5 comes an upgrade for iCloud Passwords, which now functions as a fully fledged password manager, allowing users to browse, manage and update credentials saved in their iCloud Keychain from their Windows device.",
    "iCloud Passwords functionality was first introduced to Windows earlier this year, but only in the form of a Chrome extension, which suffered from both limited functionality (users could not browse or edit passwords) and a turbulent rollout.",
    "The new iCloud for Windows app, however, lets users manage their stored passwords without having to fire up an Apple device; an obvious plus.",
    "To access the new iCloud Passwords functionality, users will need to download the latest version of iCloud for Windows via the Windows Store. If a previous version is already installed on the machine, an update can be triggered via the same page.",
    "Once installed, users should then enable iCloud Password via the iCloud settings page and set up biometric or pin-based login through Windows Hello.",
    "After these steps are complete, passwords stored in the iCloud Keychain will synchronize across Windows and Apple devices and management facilities should become available via the Windows app.",
    "An obvious alternative would be to shift passwords from iCloud Keychain to a third-party password manager (LastPass, Dashlane etc.) that offers cross-platform support. Another benefit is that these services are likely to offer a deeper range of advanced features, such as dark web monitoring or even cloud storage.",
    "Nonetheless, the iCloud for Windows update will provide a boost for anyone who finds themselves embedded into the Apple ecosystem, but also needs to access online accounts from a Windows device on occasion.",
    "Via TheVerge"
  ],
  "headers": {
    "4": "iCloud for Windows"
  },
  "links": {
    "Mac": "https://www.techradar.com/best/best-business-mac",
    "PC": "https://www.techradar.com/news/best-business-desktop-pcs",
    "password manager": "https://www.techradar.com/best/password-manager",
    "LastPass": "https://www.techradar.com/reviews/lastpass",
    "Dashlane": "https://www.techradar.com/reviews/dashlane",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "TheVerge": "https://www.theverge.com/2021/8/16/22627512/icloud-for-windows-12-5-password-manager-keychain"
  }
}