{
  "source": "https://www.techradar.com/news/oneplus-nord-2-may-launch-soon-without-a-snapdragon-chipset",
  "title": "OnePlus Nord 2 may launch soon without a Snapdragon chipset",
  "category": "phones",
  "updated": "2021-03-05T00:23:37Z",
  "author": "david-lumb",
  "summary": "OnePlus Nord 2 could be the first OnePlus phone to go for a MediaTek chipset",
  "article": [
    "A new rumor claims that not only is there a successor to the mid-range OnePlus Nord – aptly called the OnePlus Nord 2 – but that it will launch without a Snapdragon chipset, opting instead for silicon from MediaTek.",
    "Qualcomm’s Snapdragon chipsets have powered most leading Android phones over the years, especially those sold in the US and Europe, and in every OnePlus phone reaching all the way back to the 2014 OnePlus One and its Snapdragon 801. But the OnePlus Nord 2 will pack the MediaTek Dimensity 1200 chipset instead, sources told Android Central. They also claimed the phone will launch in Q2 2021, which could be as soon as next month.",
    "The OnePlus Nord used a mid-to-upper tier 7nm Snapdragon 765G chipset, and the Nord 2’s 6nm Dimensity 1200 is purported to be an improvement. Both are octa-core silicon, but the latter is capable of higher sheer speeds: the Snapdragon 765G has a prime core at 2.3Ghz and performance core at 2.2Ghz (both Cortex-A76) with six efficiency cores at 1.8Ghz (Cortex-A55), while the Dimensity 1200’s prime core gets up to 3.0Ghz (Cortex A78), has three other A78 cores going up to 2.6Ghz, and four efficiency cores (Cortex A55) up to 2.0Ghz.",
    "Whether that translates to better performance in every situation is up to speculation given other factors like RAM and OS integration, but it’s a big step for MediaTek to take in expanding into a previously Qualcomm Snapdragon-only brand. It also raises questions for the affordability of the Nord 2 – and whether the more powerful chipset will raise the price of the rumored affordable phone.",
    "The real question might be what place the Nord 2 holds in the lineup of OnePlus phones. 2020 saw the launch of the OnePlus Nord N10 5G and the lower-spec Nord N100, both of which were lower-powered than the original OnePlus Nord.",
    "While we expected a OnePlus Nord SE to bridge the gap in offering more power then the N10 5G but at a better value than the Nord, we haven’t heard much about its release plans. Thus, we expect the Nord 2 to be the true mid-range inheritor – and the more affordable alternative to the upcoming OnePlus 9 – when it launches in the coming months, assuming this report is to be believed."
  ],
  "headers": {
    "4": "Next budget OnePlus generation"
  },
  "links": {
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "Android Central": "https://www.androidcentral.com/oneplus-nord-2-q2-2021-mediatek-dimensity-1200",
    "OnePlus Nord N10 5G": "https://www.techradar.com/reviews/oneplus-nord-n10-5g",
    "Nord N100": "https://www.techradar.com/news/oneplus-nord-n10-5g-and-n100-announced-as-two-new-super-cheap-phones",
    "OnePlus Nord SE": "https://www.techradar.com/news/oneplus-nord-se"
  }
}