{
  "source": "https://www.techradar.com/news/oculus-quest-2-120hz-support-has-been-delayed-but-its-still-coming",
  "title": "Oculus Quest 2 120Hz support has been delayed – but it's still coming",
  "category": "gaming",
  "updated": "2021-03-08T13:23:59Z",
  "author": "axel-metz",
  "summary": "Virtual reality check",
  "article": [
    "We know that a 120Hz refresh rate update is coming to the Oculus Quest 2, bringing with it smoother gameplay for certain compatible VR titles – but it won’t arrive as early as planned.",
    "We had expected the update to arrive sometime towards the end of March, but Facebook has now updated its official Quest Platform Roadmap to move 120Hz support back to somewhere in the Q2 2021 window.",
    "The update to the roadmap doesn’t come with an attached comment to shed light on the reasoning behind the delay, but interestingly does see the ‘Confidence’ listing associated with 120Hz support for the Quest 2 move from ‘Medium’ to ‘Low’ – suggesting further delays might be on the horizon.",
    "We already know that delivering a 120Hz refresh rate in VR is fraught with difficulty. Only last week, Facebook consulting CTO John Carmack put a pin in the all-encompassing reach expected of the update, stating that “Only a few existing games will be tweaked for 120 [Hz], but some new titles will consider it an option in their design phase.”",
    "It’s worth remembering that the Quest 2 originally launched with a default 72Hz refresh rate, which was later updated to allow for a smoother 90Hz experience should game developers be able reach that mark (which many still haven’t).",
    "It’s therefore unrealistic to expect the Quest 2 and its library of games to suddenly accommodate 120Hz support when many of its titles are still stuck at 72Hz. The more logical expectation is to see dedicated, 120Hz-compatible games built from scratch, while more menial experiences like the Oculus Browser enjoy the update in the nearer future.",
    "Of course, those rocking a high-end gaming PC and an Oculus Link connection would likely benefit from the refresh rate boost, along with the limited number of games referenced by Carmack, but the wider point remains that the Oculus Quest 2 isn’t designed to run at 120Hz.",
    "In terms of when to expect 120Hz support to arrive for the Quest 2, then, sometime between May and June now seems a likely bet. When you’ll be able to enjoy a vast library of VR games in 120Hz remains an altogether larger question.",
    "Via UploadVR"
  ],
  "headers": {
    "4": "An expectedly bumpy road"
  },
  "links": {
    "update": "https://www.techradar.com/news/oculus-quest-2-will-be-updated-with-120hz-refresh-rate-says-facebook-insider",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "certain compatible VR titles": "https://www.techradar.com/news/oculus-quest-2-120hz-option-may-only-be-limited-to-a-few-games",
    "Quest Platform Roadmap": "https://www.techradar.com/news/oculus-quest-2-will-be-updated-with-120hz-refresh-rate-says-facebook-insider",
    "put a pin in the all-encompassing reach": "https://www.techradar.com/news/oculus-quest-2-120hz-option-may-only-be-limited-to-a-few-games",
    "UploadVR": "https://uploadvr.com/oculus-quest-2-120hz-support-delayed/"
  }
}