{
  "source": "https://www.techradar.com/news/samsung-knox-is-getting-a-lot-easier-to-use",
  "title": "Samsung Knox is getting a lot easier to use",
  "category": "phones",
  "updated": "2021-09-02T02:26:50Z",
  "author": "anthony-spadafora",
  "summary": "New enhancements provide an improved user experience and additional functionality",
  "article": [
    "Samsung is updating its Knox mobile security suite and cloud service with new features and upgrades that will improve usability for both end users as well as admins.",
    "According to a new blog post from the Korean tech giant, the latest Knox cloud service release will provide improvements and enhancements from a user experience and functionality standpoint.",
    "Of the common components receiving changes the first is the Knox account and license. Registered SamsungKnox.com users will now be able to use the Sign in with Google option on the login screen to login with a Google account that is registered with their corporate email domain and is linked to their Samsung account.",
    "Next off, the Knox Admin Portal will now allow users to show and hide services on the left navigation menu. The services that users choose to show will then be visible on the menu as well as during the device sync process. Samsung has also added the ability to use Ping Identity for Single-Sign-On (SSO) in the Knox Admin Portal.",
    "As part of the latest Knox cloud service release, Knox Manage is getting iPad OS support in addition to support for devices running iOS 13 or higher. This means that IT admins can now manage iPad devices regardless of their OS version in addition to Samsung phones.",
    "Knox Manage also received another big update and IT admins now have the ability to enroll multiple Windows devices at the same time.",
    "Knox Asset Intelligence, which is Samsung's MDM solution, meanwhile now allows you to track, locate and retrieve assets in large public and private spaces using a new interactive and accurate indoor positioning solution. By using the new Finder app, you can set up your devices to report their locations as blue dots in the console.",
    "If your organization has frontline workers using Knox Capture, you can now get detailed insights and trends about barcode scanning on enrolled devices and identify scan issues. These captured insights include total scan counts per each barcode symbol, hourly scan count distributions and more.",
    "Since releasing Knox back in 2013, Samsung has continued to make a number of improvements to the platform to help organizations as well as consumers secure and keep track of their devices."
  ],
  "headers": {
    "4": "Knox product updates"
  },
  "links": {
    "blog post": "https://www.samsungknox.com/en/blog/upcoming-changes-for-knox-products-in-september-2021",
    "Sign in with Google": "https://www.techradar.com/news/the-oldest-android-devices-wont-be-able-to-use-google-sign-ins-from-september",
    "Ping Identity": "https://www.techradar.com/news/aws-secures-company-data-on-the-go-with-worklink-launch",
    "SSO": "https://www.techradar.com/best/best-identity-management-software",
    "iPad OS": "https://www.techradar.com/news/new-ipados-15",
    "Samsung phones": "https://www.techradar.com/news/best-samsung-phones",
    "MDM solution": "https://www.techradar.com/best/best-mdm-solutions"
  }
}