{
  "source": "https://www.techradar.com/news/ps5-digital-edition-vs-xbox-series-s-which-digital-only-console-should-you-buy",
  "title": "PS5 Digital Edition vs Xbox Series S: which digital-only console should you buy?",
  "category": "gaming",
  "updated": "2021-12-02T14:42:20Z",
  "author": "adam-vjestica",
  "summary": "The two disc-less systems go head-to-head",
  "article": [
    "The PS5 Digital Edition and the Xbox Series S consoles are similar because they both ditch the classic disc drive in favor of an all-digital approach. This means they’re cheaper than disc-based consoles. But if you have your heart set on a digital variant, what are the key differences between the PS5 Digital Edition vs Xbox Series S? And importantly, have you taken the time to consider the pros and cons of ditching physical media for good?",
    "Now that both companies offer a digital-only model for their next-gen consoles – it’s a first for Sony – you might think that’s all there is to consider between the two. Microsoft or Sony? But you’d be missing out on some important details. For starters, while the PS5 Digital Edition is essentially a PS5 without a disc drive, the Xbox Series S is an entirely different proposition when you compare it to the Xbox Series X.",
    "To help relieve you of any buying headaches and rushed decisions, we’ve got all the details you need to know about both digital consoles below. That way you can make the right choice based on your gaming needs and your budget size.",
    "You'll also find the latest where to buy a PS5 and Xbox Series S stock information here on TechRadar as soon as we find out. If you're having trouble finding either of the two consoles in stock (which is still a lot of people) keep checking back for restocking news.",
    "By removing the 4K Blu-Ray drive, Sony has managed to knock $100 off the price of the PS5 Digital Edition compared to the standard PS5. It's available now depending on your territory, and retails for $399 / £359 / $AU599.95.",
    "In comparison, Microsoft’s Xbox Series S is the cheapest current-gen console on the market at just $299 / £249 / AU$499. It released alongside Microsoft’s flagship console, the Xbox Series X, on November 10, 2020.",
    "The Xbox Series S has a price advantage of $100 over the PS5 Digital Edition, then, but as we’ll go on to explain, that doesn’t mean it’s a clear cut victory for Microsoft's smaller box – unless price is your most important factor.",
    "The PS5 Digital Edition is literally identical to the standard PS5 apart from the fact it doesn’t include a 4K Blu-Ray drive. Its removal helps give the console a more symmetrical shape, but appearance aside, you won’t find any differences when it comes to technical specs between Sony’s two PS5 consoles. Check out the specs below:",
    "If you’re happy to forgo physical media and prefer buying your games digitally, then the PS5 Digital Edition makes sense. There are a few caveats to consider, though. Physical games tend to be cheaper than their digital counterparts, and are more prone to heavy price cuts and sales. You can trade them in and recoup some of your investment, too. There’s also something rather comforting about owning a disc as opposed to a digital copy, but this isn’t an issue for some.",
    "With digital titles often costing full price, if not more, it means that the $100 you initially save might quickly disappear once you've bought a few $70 / £69.99 PS5 games, and you’ll have no choice but to pay full price on the PlayStation Store.",
    "The Xbox Series S, on the other hand, is fundamentally different to the Xbox Series X, and in turn, the PS5 Digital Edition. Microsoft’s cheaper console targets a resolution of 1440p instead of 4K, and has a significantly less powerful GPU. However, thanks to the advances in hardware over the last few years, the system should prove to be extremely capable, albeit less so than the PS5 Digital Edition when it comes to raw specs. Check out the Xbox Series S specs below:",
    "Microsoft’s strategy of targeting both the high and low-end of the market is an interesting one, and the company has already tipped the Xbox Series S to outsell its more expensive sibling.",
    "While it’s easy to dismiss the Xbox Series S as being the weakest console and therefore the most inferior of the bunch, it still promises to deliver a next-gen experience. It supports all the key technological advancements that both the PS5 and Xbox Series X boast: that includes ray-tracing, super-fast load times, and 120fps capabilities. But its more modest resolution target means it can achieve these goals for a much lower price point.",
    "It also means Microsoft’s been able to create the smallest, and its arguably most aesthetically pleasing console to date. The Xbox Series S is significantly smaller than the Xbox Series X, and absolutely tiny compared to the gargantuan PS5, so if you’re looking for something that’s more discreet and able to fit into any space, the Xbox Series S might appeal.",
    "One thing to note, though, is that the Xbox Series S only comes with a 512GB SSD. That means space will fill up fast, but Microsoft has said that game files should be 30% smaller than on Xbox Series X as they won’t be using 4K textures, which can seriously bloat up some titles. There's also a expandable storage solution at launch in the form of Seagate's 1TB Expansion Card, but it's pricey.",
    "Games are subjective – and that’s why competition and variety is so important. Thankfully, there’s a deluge of great-looking games on the way for both consoles, but both Sony and Microsoft’s approach is different once again.",
    "With its superb library of exclusive games on PS4, Sony is backing its studios to deliver enticing titles once again to help sell its new console. The PS5’s launch is being bolstered by games such as Spider-Man: Miles Morales, Demon’s Souls and Sackboy: A Big Adventure, all of which can only be found on Sony’s console, and more blockbusters are on the way with Horizon Forbidden West and Ratchet & Clank: Rift Apart.",
    "Microsoft, meanwhile, doesn’t have a new first-party studio game at launch after Halo Infinite was unexpectedly delayed. Instead, the appeal of Xbox Series S and X revolves around Microsoft’s phenomenal Xbox Game Pass service, which includes hundreds of games that can be downloaded and played à la carte. It also includes backwards compatibility for four generations of Xbox games, meaning players can return to Xbox 360, original Xbox and Xbox One games, all of which promise to look and play better than ever before.",
    "Both systems will be accompanied by various timed exclusives and third-party titles, of course, such as Yakuza: Like a Dragon on Xbox and Godfall on PS5. The choice then ultimately comes down to which games you find appealing, or which ecosystem you’ve already invested in.",
    "The decision over which digital console to buy will honestly come down to personal preference: both remove the disc drive, so physical media is a no-go, and the Xbox Series S is aimed squarely at opening up the market to make next-gen gaming more affordable. The $100 saving on the PS5 Digital Edition is appealing at first glance, but you may end up spending more in the long run, so bear that in mind if you're sticking firmly with Sony's machines.",
    "Either way, both consoles promise to offer a superior experience over their predecessors. As it stands, both Xbox Series S pre-orders and PS5 pre-orders are extremely hard to find, so it’s clear there’s demand for both disc-less systems."
  ],
  "headers": {
    "4": "PS5 Digital Edition vs Xbox Series S price and release date",
    "7": "PS5 Digital Edition vs Xbox Series S specs",
    "15": "PS5 Digital Edition vs Xbox Series S games",
    "19": "PS5 Digital Edition vs Xbox Series S verdict"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "where to buy a PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Xbox Series S stock": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now",
    "Spider-Man: Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Yakuza: Like a Dragon": "https://www.techradar.com/news/yakuza-games-in-order-by-release-date-in-chronological-order-and-ranked",
    "Xbox Series S pre-orders": "https://www.techradar.com/news/xbox-series-s-price-pre-order-specs-live-now"
  }
}