{
  "source": "https://www.techradar.com/news/metal-gear-solid-silent-hill-and-castlevania-games-reportedly-in-the-works",
  "title": "Metal Gear Solid, Silent Hill and Castlevania games reportedly in the works",
  "category": "gaming",
  "updated": "2021-10-01T15:16:05Z",
  "author": "vic-hood",
  "summary": "Konami could be bringing back its biggest brands",
  "article": [
    "Konami is working on new Metal Gear Solid, Castlevania and Silent Hill games, according to a new report.",
    "A report by VGC, which spoke to anonymous publishing sources, claims that publisher Konami is working on \"new installments and remakes for its biggest franchises, including Metal Gear Solid, Silent Hill and Castlevania.",
    "According to VGC's report, Konami has underwent a restructure earlier this year and is now focusing on reviving its biggest franchises within the premium gaming space.",
    "So what's Konami working on? Well, apparently the first of these titles is a new Castlevania game, which is allegedly in development right now internally at Konami and will be \"reimagining\" of the gothic action-adventure series.",
    "VGC's sources also claim that a Metal Gear Solid remake is indeed in early development, but not at Demon's Souls developer Bluepoint Games as was previously rumored. Instead this remake is allegedly in the works at Virtuos, which has co-developed games such as Horizon Zero Dawn and The Outer Worlds, with sources suggesting that this title could revisit Metal Gear Solid 3 rather than the original game.",
    "But it sounds like the other Metal Gear Solid games could get a remake too, with sources saying Konami plans to release remasters of the original Metal Gear Solid games for consoles ahead of the release of this remake.",
    "Last but not least, the rumors of a Silent Hill revival are apparently true with sources telling VGC that \"multiple Silent Hill games are currently in development at various external development studios\".",
    "Apparently Konami plans to showcase these titles during events next year, all being well.",
    "The report seems to confirm several rumors that have been floating around for some time now.",
    "There has been speculation that a Metal Gear Solid Remake for PS5 is in the works at Konami for a while now, with recent PlayStation family acquisition Bluepoint Games suggested as the developer. The report suggests that remake rumors are true, but that developer speculation has been somewhat off the mark.",
    "The news that Virtuos could actually be the studio working on the MGS remake may not appeal to everyone, but it's actually a perfect choice. The developer has previously ported to Switch the likes of BioShock: The Collection and the XCOM 2 Collection, so it knows what it's doing when it comes to successfully bringing big games to new platforms.",
    "Rumors of a Silent Hill revival have also been rife for a while now, with some speculating that The Medium developer Bloober Team could be working on a reboot of the iconic horror series following a partnership with Konami. While the report doesn't tell us a whole lot about exactly what's in the works, it does seemingly confirm that a Silent Hill reboot is in the works – even if Konami previously shot down those rumors.",
    "The more surprisingly claim in the report is that there's a new Castlevania game on the horizon. The Castlevania series has had somewhat of a resurgence in recent years, with the release of a Netflix TV series and an Apple Arcade title. It'll be interesting to see what Konami has planned for the series and just how much it plans to reimagine the franchise.",
    "Konami hasn't confirmed any of the claims in VGC's report, but TechRadar has contacted the company for comment."
  ],
  "headers": {
    "8": "Analysis: more weight to rumors"
  },
  "links": {
    "VGC": "https://www.videogameschronicle.com/news/konami-is-set-to-revive-metal-gear-castlevania-and-silent-hill/",
    "Metal Gear Solid Remake for PS5": "https://www.techradar.com/news/a-metal-gear-solid-remake-could-be-coming-exclusively-to-ps5",
    "Silent Hill revival": "https://www.techradar.com/news/silent-hill-reboot-rumors-resurrected-as-konami-pairs-with-the-perfect-developer",
    "The Medium": "https://www.techradar.com/reviews/the-medium"
  }
}