{
  "source": "https://www.techradar.com/news/microsoft-excel-is-getting-a-new-feature-that-might-just-save-your-skin-one-day",
  "title": "Microsoft Excel is getting a new feature that might save your skin one day",
  "category": "computing",
  "updated": "2021-01-26T09:09:40Z",
  "author": "joel-khalili",
  "summary": "Microsoft Excel blunders have become a regular news item",
  "article": [
    "Update: 25 January Microsoft has since removed the product roadmap entry describing the new Show Changes feature. Asked why the listing was removed, the company declined to comment.",
    "Original story: Spreadsheet software Microsoft Excel is an undeniably powerful tool, but one that also creates opportunity for mishap. As the UK government and NHS found out the hard way in 2020, small spreadsheet errors can snowball rapidly, with significant real-life consequences.",
    "In a bid to safeguard against disaster, Microsoft is working on a small tweak to Excel that will allow users to remedy mistakes and recover lost information more easily.",
    "According to an entry in the company’s product roadmap, a new Show Changes feature is under development that will effectively log the history of each cell. “Excel can now show you the changes you made to the cells in your workbook, including the previous value of the cells,” the listing explains.",
    "Microsoft has not provided a specific launch date for the update, but expects the Show Changes feature to land at some point next month.",
    "Although information is a little sparse for now, it’s easy to imagine a number of applications for the new feature, especially if multiple colleagues are all collaborating on the same workbook simultaneously.",
    "For example, if data is altered accidentally by a slip of the keyboard, but not registered immediately, the ability to bring up the previous cell values will allow for an easy fix later down the line.",
    "In an accounting scenario, meanwhile, whereby the value of a given cell is dictated by a formula, the new feature will also presumably offer insight into uptrends and downtrends over time.",
    "A similar function is already available in rival service Google Sheets, so the Microsoft Excel update will restore parity between the two services in this respect. In Sheets, right-clicking on a cell and selecting “Edit History” allows users to scroll through previous cell values via simple backwards and forwards arrows.",
    "The new Excel feature comes hot on the heels of two updates to the web client, both designed to make it easier for users to annotate their spreadsheets effectively. The first introduced the ability to mark cells with the ink and highlighter functions and the second allowed users to create notes that can be shared between colleagues.",
    "Love it or loathe it, Excel is a significant part of many people’s professional experience, so extra facilities to guard against mistakes and improve collaboration are likely to be popular additions."
  ],
  "headers": {
    "5": "Microsoft Excel update"
  },
  "links": {
    "Microsoft Excel": "https://www.techradar.com/reviews/microsoft-excel",
    "UK government": "https://www.techradar.com/news/excel-spreadsheet-blunder-sees-thousands-of-positive-covid-19-tests-go-missing",
    "NHS": "https://www.techradar.com/news/a-simple-spreadsheet-error-cost-the-nhs-millions",
    "an entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1117417846217375600&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D54526",
    "Google Sheets": "https://www.techradar.com/reviews/google-sheets",
    "two updates to the web client": "https://www.techradar.com/news/microsoft-excel-is-making-it-way-easier-to-annotate-your-spreadsheets-online"
  }
}