{
  "source": "https://www.techradar.com/news/nokia-launches-first-off-the-shelf-industrial-edge-for-enterprises",
  "title": "Nokia launches first off-the-shelf industrial edge for enterprises",
  "category": "computing",
  "updated": "2021-10-07T15:49:19Z",
  "author": "steve-mccaskill",
  "summary": "Industry 4.0 push gets major boost",
  "article": [
    "Nokia says its “world first” off-the-shelf industrial edge platform will provide businesses of all sizes with the capability and simplicity to embrace Industry 4.0 applications and digitise their operational technology (OT).",
    "Edge computing will be essential for many Industry 4.0 applications that require the rapid collection and analysis of large volumes of time sensitive data.",
    "Whereas traditional cloud platforms send data to and from the point of collection to a centralised data centre, edge computing processes this information as close as possible to the point of collection. This makes latency-sensitive applications, such as autonomous vehicles and automation, a reality.",
    "Nokia says that although businesses recognise the benefits of edge computing, there are complexity, skills and economic barriers associated with deployment, integration and lifecycle management.",
    "The cloud-native Nokia MX Industrial Edge combines high performance compute, storage, networking and a one-click software management layer to form a unified, on-premise platform that can be scaled up as required and is simple to manage.",
    "This unification, it argues will make the desired outcome of “develop once and deploy everywhere”, a practical possibility.",
    "Initially, the company is targeting asset-intensive industries such as manufacturing, energy and transportation that have a lot of operational technology ready to be digitised.",
    "\"Industry 4.0 is transforming asset-intensive industries by integrating and digitalizing all processes and systems across the industrial value chain,” declared Stephan Litjens, Head of Enterprise Solutions at Nokia. “This will result in an explosion of data – and taking the right actions based on that data in near real-time will be critical to the success of digital transformation initiatives.",
    "“Ensuring performance, along with aspects like keeping data local and secure while being resilient against internet connectivity failures, are not possible with a centralized cloud, making the on-prem edge the architecture of choice for this new breed of OT applications. The Nokia MX Industrial Edge is built from the ground up to deliver the guaranteed performance, security and reliability that OT digitalization use cases require.”",
    "The platform will be available in a variety of configurations to support businesses of all sizes – from SMBs through to large enterprises – and will work with other Nokia applications that use Nokia Digital Automation Cloud (Nokia DAC).",
    "The launch is the latest part of Nokia’s pursuit of the enterprise market, an area it hopes will complement its existing telecoms equipment business. Although many firms will turn to a mobile operator to assist them deploy infrastructure such as private 5G networks, some will look to go it alone using unlicensed spectrum.",
    "“All industrial and enterprise campuses, such as factories, logistics hubs, ports, etc. are multi-solution and multi-partner environments,” added Litjens. “By adopting an ecosystem-neutral approach and integration plug-ins, our customers get unparalleled flexibility and benefit from the widest array of applications and use cases to adopt innovations to advance their digital transformation.”"
  ],
  "headers": {
    "3": "Nokia edge"
  },
  "links": {
    "Industry 4.0": "https://www.techradar.com/news/what-is-industry-40-everything-you-need-to-know"
  }
}