{
  "source": "https://www.techradar.com/news/sony-wf-1000xm3-wireless-earbuds-get-deep-discounts-with-these-prime-day-deals",
  "title": "Sony WF-1000XM3 wireless earbuds get deep discounts with these Prime Day deals",
  "category": "audio-visual",
  "updated": "2021-06-22T22:24:57.516Z",
  "author": "olivia-tambini",
  "summary": "Incredible wireless earbuds deals in the US and the UK",
  "article": [
    "Thought the best Prime Day deals were over? Think again – the incredible Sony WF-1000XM3 have been subject to some outstanding discounts in the US and the UK.",
    "In the US, Amazon has slashed the price of the WF-1000XM3 from $229 to $148. Not only that, but you're also getting a free $20 Amazon gift card thrown in, so you're really saving $101 with this deal.",
    "UK buyers can also save big on the Sony WF-1000XM3, which are available for £129.99, the lowest price we've ever seen. (Not in the US or UK? Scroll down for Sony WF-1000XM3 deals in your region).",
    "The Sony WF-1000XM3 wireless earbuds are quite simply some of the best wireless earbuds you can buy right now and a perennial favorite here at TechRadar.",
    "They're a great option for those who want an understated, sleek, feature-packed set of noise-cancelling earbuds that still manage to come in at a reasonable price. While the noise-cancelling might not reach the lofty levels of excellence featured on their Sony WH-1000XM4 over-ear cousins (which are also highly discounted for Prime Day), they still square up to anything offered from the likes of Apple and Bose.",
    "While they've been usurped by the Sony WF-1000XM4, we'd still recommend grabbing this deal while you can – in fact, there are lots of reasons to buy the Sony WF-1000XM3 this Prime Day instead of the newer model, not least because they're much easier on the wallet.",
    "No matter where you live, you'll find all the lowest prices for the Sony WF-1000XM3 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Sony WF-1000XM3 deals on Prime Day",
    "6": "More Sony WF-1000XM3 deals",
    "7": "More Amazon Prime Day deals in the UK"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "to $148": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB07T81554H%2Fref%3Dtwister_B07T85W8P7%3F_encoding%3DUTF8%26th%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1319194216434414800-20",
    "for £129.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB07T2FGG2Z%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1229545242800173300-21",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "best wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "highly discounted for Prime Day": "https://www.techradar.com/news/sony-wh-1000xm4-deal-the-best-headphones-of-2021-hit-lowest-ever-price",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "reasons to buy the Sony WF-1000XM3 this Prime Day": "https://www.techradar.com/news/the-sony-wf-1000xm4-are-the-best-wireless-earbuds-but-dont-buy-them-on-prime-day"
  }
}