{
  "source": "https://www.techradar.com/news/new-steam-deck-details-from-valve-and-amd-just-made-the-delay-more-agonizing",
  "title": "New Steam Deck details from Valve and AMD just made the delay more agonizing",
  "category": "computing",
  "updated": "2021-11-16T11:26:54Z",
  "author": "matt-hanson",
  "summary": "The potential is huge – but so is the wait",
  "article": [
    "At its recent Steamworks Virtual Conference, Valve revealed more exciting details about its Steam Deck console – and from what we’ve seen, it’s shaping up to be a very exciting little device indeed.",
    "So, the fact that it has been delayed until February 2022 due to global supply chain issues hurts even more, as we want to get our hands on one right now.",
    "While we’ve known quite a bit about the specs of the Steam Deck for a while now, Valve and AMD revealed that the custom AMD chip that will be powering the console is called the Aerith SoC, and features a four-core, eight-thread Zen2 CPU and an AMD RDNA 2 GPU. During the conference, Valve and AMD’s close partnership was highlighted, along with the decision to design the chip with consistency in mind, rather than trying to hit high frequencies.",
    "This means that the Steam Deck should offer a consistent gaming experience across the titles you play on it, while allowing the 40-watt hour battery to offer gaming time of seven to eight hours. By trying to hit higher frequencies, the chip may look better on paper, and offer higher frame rates in some cases, but it could lead to performance issues and a faster-draining battery, and that’s a trade-off Valve and AMD understandably don’t want to make.",
    "The Steam Deck will also perform the same whether it's played in handheld mode or docked, again offering consistency for the player, but this may disappoint anyone who hoped to get a performance boost when the handheld is plugged into the dock (either the Valve-made one, or any USB-C hub).",
    "Valve hasn’t implemented power restrictions on the chip, instead leaving it up to game developers, although it recommends that they limit frames to help preserve battery life.",
    "The Steamworks Virtual Conference was aimed at game developers looking to port their games onto the Steam Deck, so there was understandably a lot of focus on the new developer tools that can help ensure that games run their very best on the handheld.",
    "While most games that are on Steam will play on the Steam Deck, developers are being encouraged to test their games to ensure they play as well as possible. That doesn’t just mean making sure they hit consistent frame rates, but also that their controls feel good when using the Steam Deck’s controls, and that text is legible on the Steam Deck’s seven-inch screen. After all, many of these games were designed to be played on PCs with much larger displays.",
    "This is all promising stuff, and should make a lot of games run brilliantly on the Steam Deck. Valve also talked about how it will allow developers to optimize their games for Steam Deck, such as using specific texture packages for Steam Deck versions that reduce the download and install size of the games.",
    "Due to the Steam Deck’s small, low resolution screen, you don’t need high resolution textures, which will mean games will take up less space in the Steam Deck’s storage. This will be particularly welcome for people who have the cheapest Steam Deck model, which comes with just 64GB of eMMC PCIe Gen 2 storage.",
    "The information that Valve, along with AMD, shared about the Steam Deck has got us even more excited for the handheld. While Valve’s previous forays into hardware haven’t always hit the mark, a powerful and portable handheld that can take on Nintendo’s dominance and offer up an instant library of thousands of PC games has lots of potential.",
    "The fact that Valve and AMD are focusing on consistency over raw performance is another plus here, and the tools Valve is offering to developers could mean that Steam Deck players get an excellent experience when playing games on the handheld.",
    "All of this makes the wait for the delayed launch even harder. While people who got their orders in early now have to wait until February 2022, those who order later may not get their hands on the device until towards the end of next year. That wait is really going to suck, but maybe some of the Black Friday gaming laptop deals we're already starting to see could help.",
    "Via PC Gamer"
  ],
  "headers": {
    "6": "Boosted developer support",
    "10": "Analysis: Playing the waiting game"
  },
  "links": {
    "Steamworks Virtual Conference": "https://www.techradar.com/news/valve-will-spill-steam-deck-secrets-soon",
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "delayed until February 2022": "https://www.techradar.com/news/suppy-chain-crisis-hits-steam-deck-delayed-until-february-2022",
    "USB-C hub": "https://www.techradar.com/deals/best-usb-c-adapters",
    "games that are on Steam will play on the Steam Deck": "https://www.techradar.com/news/valve-claims-the-steam-deck-can-handle-any-game-you-throw-at-it-including-aaas",
    "haven’t always hit the mark": "https://www.techradar.com/news/dont-get-too-excited-the-steam-deck-could-easily-join-valves-hardware-graveyard",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Black Friday gaming laptop deals": "https://www.techradar.com/black-friday/black-friday-gaming-laptop-deals",
    "PC Gamer": "https://www.pcgamer.com/valve-and-amd-dropped-plenty-of-new-steam-deck-info/"
  }
}