{
  "source": "https://www.techradar.com/news/microsoft-is-already-getting-pushy-about-windows-11",
  "title": "Microsoft is already getting pushy about Windows 11",
  "category": "computing",
  "updated": "2021-10-26T09:42:15Z",
  "author": "jess-weatherbed",
  "summary": "Despite the well-established compatibility issues",
  "article": [
    "Microsoft has started to roll out a fresh update for Windows 10 that will preload the divisive PC Health Check app onto your device via the latest Windows Update (KB5005463), mentioning that the update won’t be pushed out to people already using the new operating system.",
    "This app is used to quickly inform users if their device meets the requirements to upgrade to the new Windows 11 OS, but given the strict system requirements needed to run it, many laptops and desktops are ineligible, despite some of them running seriously beefy components.",
    "OnMST reports that the app will automatically update itself, rather than make you keep it up to date manually, which is a small blessing – but for users who are fully aware their system isn’t eligible to run the new OS (or had no plans to upgrade regardless), this could be seen as an unnecessary nuisance.",
    "Thankfully though, this update is completely optional, so you can ignore it or prevent your system from downloading it if you're signed up for automatic system updates. Having the PC Health Check tool on your system won’t do any harm, but it’s reasonable that some folks won’t want any unnecessary programs on their devices.",
    "“This update installs the PC Health Check application onto Windows 10, version 2004 and later devices. However, we will not install PC Health Check on Windows 11 devices. PC Health Check includes diagnostics to monitor device health and troubleshooting to improve performance, all from the convenience of a single dashboard,” the company explained on the support page.",
    "Despite Microsoft's statement, we anticipate that prompts to upgrade will start to get intrusive over the coming months or years. After all, if the PC Health Check tool was only being pushed to \"monitor device health and troubleshooting to improve performance\" then surely Windows 11 would also see some benefit from having it?",
    "There are good reasons why people are in no rush to upgrade to Windows 11, with cases of computers using AMD Ryzen processors seeing a drop in gaming performance, and perfectly usable devices without a TPM 2.0 (Trusted Platform Module) component installed unable to meet the strict system requirements put in place by Microsoft to boost security.",
    "Irrespective of whether avoiding upgrading is willful or due to incompatible hardware, there shouldn’t be any need to rush to upgrade to Windows 11, as Windows 10 will be supported until 2025. That said, Microsoft is known for being pushy when it comes to people using its products (as anyone who doesn’t use the Edge browser can attest), so a tool that was designed to check Windows 11 compatibility being rolled out across current Windows 10 devices isn’t filling us with confidence.",
    "Optional or not, we anticipate that Microsoft will adopt firmer tactics to make Windows 10 users upgrade over the next few years before support for the older OS is dropped, and for good reason. It’s in the company's best interests to move its customers over to this new, more secure operating system even if a small minority of that user base is stubborn."
  ],
  "headers": {
    "2": "It's optional...for now",
    "5": "Analysis: a disguised nuisance"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "latest Windows Update (KB5005463)": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9307527443260199000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-us%2Ftopic%2Fkb5005463-pc-health-check-application-e33cf4e2-49e2-4727-b913-f3c5b1ee0e56",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "strict system requirements": "https://www.techradar.com/news/windows-11-system-requirements-is-your-pc-compatible",
    "OnMST": "https://www.onmsft.com/news/microsoft-pc-health-check-app-windows-10",
    "PC Health Check tool": "https://www.techradar.com/news/tpm-20-windows-11-pc-health-check-and-the-potential-messy-upgrade",
    "drop in gaming performance": "https://www.techradar.com/news/windows-11-is-killing-game-performance-for-pcs-with-amd-processors",
    "TPM 2.0": "https://www.techradar.com/news/hardware-vendors-can-avoid-tpm-20-for-windows-11-if-needed-heres-how",
    "Windows 10 will be supported until 2025": "https://www.techradar.com/news/microsoft-is-planning-to-kill-off-windows-10-in-2025-does-this-confirm-windows-11"
  }
}