{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-probably-wont-have-an-s-pen-slot-after-all",
  "title": "Samsung Galaxy Z Fold 3 probably won’t have an S Pen slot after all",
  "category": "phones",
  "updated": "2021-04-15T09:41:32Z",
  "author": "hamish-hector",
  "summary": "And we could find out why in July",
  "article": [
    "The latest in Samsung’s folding phone lineup - expected to be called the Galaxy Z Fold 3 - could be shown off as early as July, though the latest leaks suggest we might be a little disappointed with its S Pen support.",
    "The latest reports from South Korean site Naver say that despite still trying to incorporate the S Pen into the Galaxy Z Fold 3’s design until last month, plans have now been scrapped. Supposedly this was done to make the Galaxy Z Fold 3 more dust and water-resistant, and because the phone just wasn’t big enough to house all of its components and an S Pen.",
    "Instead, Samsung could offer a phone case that can hold both the Galaxy Z Fold 3 and S Pen in a similar way to the Galaxy S21 Ultra’s stylus support.",
    "Apart from the fact it will likely fold like a book, we don’t know anything about the Galaxy Z Fold 3 for certain. However, multiple leaks and rumors can give us an idea of what we should expect in July if there is a reveal event.",
    "The most interesting leak is that the Galaxy Z Fold 3 could incorporate an under-display camera, and would be the first Samsung phone to do so. We’ve heard this one a few times and it means that the selfie camera notch would be removed, instead putting the camera behind the display.",
    "This would give you a bit of extra screen space, and a cleaner design at the cost of reduced photo quality.",
    "It’s also been suggested that the Galaxy Z Fold 3 will become Samsung’s new productivity-focused flagship. Reports have said that the Galaxy Note line will be discontinued, which explains why Samsung wants to incorporate the S Pen and give the Galaxy Z Fold 3 a less busy display.",
    "Until we know more, we’ll have to take all of this with a pinch of salt. We might soon find out for certain what the Galaxy Z Fold 3 looks like. As we learn more we’ll be sure to keep you updated."
  ],
  "headers": {
    "3": "What features could the Galaxy Z Fold 3 come with?"
  },
  "links": {
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "July": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-2-may-arrive-sooner-than-we-thought",
    "S Pen support": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-be-the-next-phone-to-get-s-pen-support",
    "South Korean site Naver": "https://n.news.naver.com/mnews/article/119/0002484883?sid=105",
    "Galaxy S21 Ultra’s": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "an under-display camera": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-have-an-under-display-camera",
    "heard this one a few times": "https://www.techradar.com/news/samsungs-next-foldable-phone-could-use-an-under-display-camera",
    "Reports have said": "https://www.techradar.com/news/report-samsung-galaxy-note-series-to-be-replaced-by-z-fold-next-year"
  }
}