{
  "source": "https://www.techradar.com/news/all-the-new-smartphones-we-still-expect-will-launch-this-year",
  "title": "All the new smartphones we still expect will launch this year",
  "category": "phones",
  "updated": "2021-12-05T14:12:08Z",
  "author": "tom-bedford",
  "summary": "Some December phone launches are confirmed, while others are anticipated",
  "article": [
    "Some tech companies aren't letting the last few weeks of 2021 go to waste, even launching new smartphones in the run-up to Christmas.",
    "While some new phone releases are confirmed events, others are rumors that may or may not happen in the next few weeks. Accordingly, we've created a list of new smartphone launches based on the likelihood they'll actually happen in December of 2021.",
    "Of course, none of these releases will be as big as what we'll see in the first few months of 2022. The giant tech conferences, CES in January and MWC in late February/early March, will likely coincide with massive phone launches like the releases of Samsung Galaxy S22, OnePlus 10 and Oppo Find X4. It's hard not to get excited by those!",
    "Still, there are phones in our December 2021 list that are intriguing enough to entice more than a few tech fans.",
    "We know the Honor 60 is launching, and it's happening very soon: December 1, to be exact.",
    "This China-only launch of the phone will likely be followed by a global release in a few weeks' time. That means we'll soon see the phone in all of its technical glory, but might not know its price until the global launch.",
    "The Honor 60 is the brand's next mid-range phone, following in the footsteps of the recently unveiled Honor 50. We don't expect the 60 to come with too many upgrades since it has only been six months since the last iteration was first released.",
    "This is another confirmed December release, but we already saw the official launch of Sony's Xperia Pro-I earlier in 2021.",
    "The Sony Xperia Pro-I is a super-premium mobile designed specifically for photographers. This phone has fantastic cameras and also works as a second display for many of Sony's cameras. The Xperia Pro-I is launching on December 2 in the UK and December 10 in the US.",
    "The phone will be expensive, at $1,799 / £1,599 (around AU$2,400), but keep in mind that it's designed for professional photographers, and not your average phone fan.",
    "While this launch hasn't technically been confirmed, we've heard so many rumors about Motorola's plan to release a top-end smartphone by the end of 2021 that we had to include it in this section.",
    "Top chipset maker Qualcomm is expected to soon launch its new premium processor, and we've heard rumors that Motorola is eager to release the first phone using it. This means they might release a new phone by the end of this year, in close competition with Xiaomi, who also has a phone on this list.",
    "We don't know if the new device is the Moto G200 or the Motorola Edge 30 Ultra, both of which are rumored to launch in the next few months. Either way, we'd be very shocked if Motorola didn't release another smartphone by the end of the year.",
    "The Xiaomi Mi 11 was launched in the last days of 2020 at a China-only event before getting a global unveiling in February of this year. We think it's possible Xiaomi will repeat that timing with their Xiaomi 12, but there are others who think the mobile might launch in January. For this reason, we've put this device in the 'possibly' section.",
    "This is Xiaomi's next flagship phone, and the first main-series device since it dropped its 'Mi' branding. We're expecting top specs and a premium design, but we don't actually know all that much about the device yet.",
    "Either way, of all the phones on this list, the Xiaomi 12 will likely end up as one of the biggest releases of the year — regardless of which year it launches. When it does show up, it's definitely a phone we'll be reporting on so stay tuned.",
    "There was a rumor that Oppo would launch its first foldable phone in November 2021. Clearly, that didn't happen, but it's possible the launch was just delayed by a few weeks.",
    "A December Oppo release would line up with the company's annual Inno Day, where it shows off new tech innovations that later feature on its devices. Inno Day was in December in 2019, November in 2020, and we still have yet to hear about 2021's Inno Day.",
    "It wouldn't be a surprise to see the Oppo foldable phone at Inno Day 2021, but we have low expectations the release will happen before the end of the year.",
    "Early in 2021, we heard about a flagship phone from HMD Global called the Nokia X50, which was likely to follow 2019's Nokia 9 PureView in place of the rumored Nokia 10. According to the rumors we heard, this X50 would launch by the end of 2021.",
    "Rumors about top-end phones from HMD Global rarely pan out, which means this whisper alone isn't enough to keep an X50 launch on the 'possibly' list. But, we also know that at some point during 2021, HMD Global changed the way it named its phones.",
    "Currently, there are Nokia C, G and X phones, with entries at each level being respectively more premium. Taking this into consideration, a mid-range Nokia X50 is far more likely than a premium one. So if there is another Nokia phone out this year, there's a good chance it's an X50 with mid-range specs and a low price.",
    "Admittedly, that's not a lot to go on, but a Nokia X50 launch is still more likely than releases for some of the other devices on this list.",
    "Earlier in 2021, a few rumors suggested we could see the Samsung Galaxy S22 in late December, which would buck the usual trend of Samsung's phones launching in January or February of each year.",
    "A December release might have made sense as a response to the cancellation of the Galaxy S21 FE, while positioning the S22 as a more formidable rival of both the iPhone 13 and the Xiaomi 12. But scrapping the Galaxy S21 FE was also only a rumor, and it seems likely that handset will launch after all.",
    "We don't think the S22 will launch in December, but because of some talk in the domain, we had to include it on this list.",
    "We heard quite a few rumors about the Google Pixel Fold in the build-up to the Pixel 6 launch, and we were excited about the possible coming of Google's first foldable smartphone. But sadly, that never came to be.",
    "Still, it's impossible to totally rule out the existence of this phone since several big-profile leakers said the device was coming. One of those leakers also expected other companies, like Oppo, Xiaomi and Vivo, to launch foldable phones by the end of 2021, but with the ongoing chipset shortage affecting the tech world, we're not holding our breath.",
    "As mentioned above, Vivo is another smartphone maker that was expected to release a foldable phone in 2021, but of all the new phone rumors we've heard, we'd say this launch is the least likely to happen. The primary reason is that Vivo is not an established enough smartphone company to start working on a flashy foldable.",
    "Still, we won't rule this potential phone release out completely since Vivo is owned by BBK Electronics, which also owns Oppo, OnePlus and Realme, companies we've seen share tech developments. It's possible that through collaborative work, Vivo might just surprise us with a foldable smartphone earlier than expected. But over the next few weeks? Hardly likely."
  ],
  "headers": {
    "4": "Honor 60",
    "7": "Sony Xperia Pro-I",
    "10": "Motorola's next smartphone",
    "13": "Xiaomi 12",
    "16": "Oppo foldable phone",
    "19": "The Nokia X50",
    "23": "Samsung Galaxy S22",
    "26": "Google Pixel Fold",
    "28": "Vivo foldable phone"
  },
  "links": {
    "CES": "https://www.techradar.com/news/ces-2022",
    "MWC": "https://www.techradar.com/news/mwc-2022",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "Oppo Find X4": "https://www.techradar.com/news/oppo-find-x4",
    "Honor 50": "https://www.techradar.com/reviews/honor-50-review",
    "Oppo would launch its first foldable phone": "https://www.techradar.com/news/oppos-first-foldable-phone-could-be-out-next-month",
    "Nokia X50": "https://www.techradar.com/news/nokia-x50-could-land-this-year-with-five-rear-cameras",
    "Nokia 9 PureView": "https://www.techradar.com/reviews/nokia-9-pureview",
    "Nokia 10": "https://www.techradar.com/news/nokia-10",
    "a few rumors": "https://www.techradar.com/news/the-samsung-galaxy-s22-could-land-this-year",
    "Samsung's phones": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Google Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "several big-profile leakers": "https://www.techradar.com/news/the-google-pixel-fold-could-be-real-and-coming-this-year"
  }
}