{
  "source": "https://www.techradar.com/news/cant-wait-for-nintendo-switch-pro-onexplayer-handheld-pc-is-the-answer",
  "title": "Can’t wait for Nintendo Switch Pro? Onexplayer handheld PC is the answer",
  "category": "gaming",
  "updated": "2021-05-27T17:02:45.598Z",
  "author": "gerald-lynch",
  "summary": "Onexplayer puts PC gaming in the palm of your hands",
  "article": [
    "The Nintendo Switch has stolen all the headlines when it comes to handheld gaming in recent years – so much so that at times it seems its only rival is that of its rumored upcoming successor, the Nintendo Switch Pro – which could be in our hands much sooner than you'd think. But there’s a small army of handheld PCs rising through the ranks, ready to challenge the Nintendo Switch’s portable dominance, with all the flexibility that PC gaming comes with. The Onexplayer is one such upstart, and makes the best case yet for bringing PC gaming to the palm of your hands.",
    "Looking like an oversized Switch, with split Xbox-like controllers attached to either side of its 8.4 inch display, the Onexplayer ships with a significant, key difference compared to the Nintendo Switch – it’s running full-fat Windows 10 as its operating system, powered by an Intel Tiger Lake processor with Intel Iris Xe graphics.",
    "In other words, so long as you’re ready to accept some visual compromises, you can fire up your entire existing library of PC games, be they from Steam, Epic Games, GOG, or elsewhere on the go with the Onexplayer.",
    "It’s quite a remarkable piece of engineering, and the Onexplayer designers (the One Netbook team, which has previously built a number of ultraportable laptops), have made some clever design decision to make Windows 10 almost feel built for the form factor.",
    "Let’s first take a look at what’s happening under the hood. Beneath that 8.4 inch IPS LCD touchscreen display (notably larger than the Switch’s 6.2-inch LCD, and sharper too at a 2560 x 1600 resolution), you’ll have the option of kitting out the Onexplayer with either a Core i5-1135G7, Core i7-1165G7 or Core i7-1185G7. These are Intel’s top-of-the-line mobile CPUs, with the Iris Xe integrated graphics the company’s most capable yet.",
    "16GB of DDR4 RAM comes as standard, while you’ve the choice of 512GB, 1TB or 2TB flash storage. Wi-Fi 6 and Bluetooth 5 connectivity is onboard, while a rear-side power button also houses a finger print scanner. In terms of ports, you’re looking at 2 x USB4 (40 Gbps), 1 x USB 3.0 Type-A, a 3.5mm audio jack and a microSD card reader. These are placed smartly along the Onexplayer’s top edge, while there’s a magnetic connection along the bottom edge for a sold-separately keyboard.",
    "It’s a busy machine when it comes to fans, as you’d imagine given the compact nature of the components. Rear vents pull cool air in and pump it out of the top of the device, placed in such a way that it’s unlikely your fingers will cover them. The Onexplayer seems set up to be very cautious when it comes to fan settings – in our testing, they appear to be set up to cycle at a high speed on and off every couple of minutes, regardless of load.",
    "What’s most striking of course is the form factor. With two full-size split controllers either side of the display, just like with the Nintendo Switch, you’ve an all-in-one machine ready to play your favourite PC games.",
    "An analogue stick sits either side of the display in an offset, Xbox-like configuration, comfortably sized and with just the right amount of resistance. A cross-D-Pad sits on the left side, while X, Y, A and B buttons sit on the right. You’ve got four shoulder buttons, including two triggers that are pressure sensitive, letting you fine tune acceleration in racing games or quick fire in FPS titles.",
    "All this however makes for quite a large and heavy device. You’re looking at overall measurements of 280 x 128 x 25mm and a weight of 825g. That’s the trade off for that big screen, but the Onexplayer at least offers a kickstand on its rear for propping up on a table. You’ll probably find it most comfortable to use stretched out on a sofa resting on your lap.",
    "There are a handful of other buttons here too. As well as standard Start and Select / Back buttons, you’ve also got a key that brings up the touchscreen keyboard (which also acts as a toggle to use the control sticks as a mouse alternative), and a Turbo button, which lets you boost the 20 watt chip configuration to a more powerful 28 watts. You’ll find volume controls and a button to mute the built-in mic within easy reach on the rear of the device.",
    "Ever wanted to play GTA V in your hand? Well now you can – provided you’re willing to make a few concessions.",
    "Once firing up the Onexplayer and putting in your Windows credentials, downloading your gaming storefront of choice and grabbing a few games, the Onexplayer is literally what it sets out to be – a gaming PC in your hand.",
    "Of course “gaming PC” needs some qualification here. There is no discrete GPU in the Onexplayer, so you’re demanding that the integrated Intel graphics here is doing some serious heavy lifting. The Turbo button option means that the chipset is able to punch admirably above its weight. But if you come in expecting 60fps and ray tracing, you’re barking up the wrong tree.",
    "Instead, this is a portable way to bring most games on the go with you, running at modest specifications and, as you’d imagine, older and less demanding games will prove the most enjoyable here. We tried everything from GTA V to Fallout: New Vegas on the Onexplayer, and were genuinely surprised that pretty much everything, even Rockstar’s gigantic open world, ran enjoyably well.",
    "To reiterate, concessions must be made – despite the 2560 x 1600 display, we were dialling resolution back to 720p for Alien Isolation and GTA V, and putting almost every graphical setting back to minimum performance levels. What’s striking though is that, even with this limitations, the quality of the screen and the maturity of PC game developer’s abilities to scale to low powered hardware is that, in the case of games like Alien Isolation and Doom 2016 (which both have native Nintendo Switch ports), the games still looked better on the Onexplayer. In the case of Doom, it was fantastically fluid in fact – a testament to ID Software’s remarkably scalable engine.",
    "That 2560 x 1600 display can be put to full use at times too, but keep your expectations in check – 2D titles will look lush at maximum resolution, but demanding 3D titles will struggle above lower resolutions. Keep in mind that, provided your connection speed is up to scratch, this is an ideal way to use cloud gaming services like Google Stadia and Xbox Game Pass’s cloud offering, too.",
    "The takeaway point though? You can actually play AAA games on this thing – even if not at AAA settings.",
    "That’s all before considering the added flexibility that the Onexplayer offers over other traditional handheld rivals. This is a full Windows PC – just minus the keyboard and mouse accessories you’d expect to complete a desktop set up.",
    "As such, if you wanted to use this as a portable workstation, you totally could. Fire up a browser, stream a Netflix movie, tweak a Powerpoint presentation – these are all activities that the Onexplayer is capable of doing, and at a comfortable pace too, thanks to its top-end laptop innards. Remember you’ve got USB-C and USB 4 ports here, as well as SD card storage, so you’re able to plug in any essential accessories you may usually use with Windows.",
    "What’s more interesting is that the USB 4 port has the advantage of the extra bandwidth that the standard brings with it, and that includes eGPU support. While we weren’t able to test this with our unit, in theory you could supercharge the Onexplayer with an external GPU source without issue.",
    "The flexibility extends to the nature of PC gaming too. You’re not tied to a single store front; you have all the mods in the world available to you; retro gamers can enjoy emulators and back catalogue games, and you’ve got access to all your standard PC community services from Discord to Twitch.",
    "Be in no doubt, this is an expensive device. Depending on the configuration you buy, retail pricing sets the entry level model at $1059 (about £700), with the Ultimate edition’s Super Early Bird crowdfunding backers pricing set at $1499 (about £1060 – note there’s no retail price for that model yet).",
    "But it does point to the growing capabilities of handheld PC gaming. A few CPU generations ago this would have been just a pipe dream. But here’s an upstart manufacturer pushing boundaries in terms of what can be achieved with this sort of hardware. It won’t fit every need, and is definitely an enthusiast piece of kit when compared to the pick-up-and-play friendly Nintendo Switch family. But if you’ve ever hoped to go on a GTA rampage on the back of a bus, the Onexplayer might be the answer."
  ],
  "headers": {
    "3": "The guts",
    "7": "The controllers",
    "11": "The performance",
    "18": "The flexibility",
    "22": "The future?"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "in our hands much sooner than you'd think": "https://www.techradar.com/news/nintendo-switch-pro-might-be-revealed-before-e3-and-it-could-release-very-soon",
    "Steam": "https://www.techradar.com/news/the-best-steam-games",
    "Epic Games": "https://www.techradar.com/news/epic-games-store-exclusives-early-access-and-how-it-could-take-on-steam",
    "GOG": "https://www.techradar.com/news/gog-galaxy-20-might-be-able-to-take-on-steam-thanks-to-the-epic-games-store",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}