{
  "source": "https://www.techradar.com/news/mass-effect-legendary-edition-isnt-hurting-the-original-games-atmosphere",
  "title": "Mass Effect: Legendary Edition isn't hurting the original game's atmosphere",
  "category": "gaming",
  "updated": "2021-04-19T17:20:22Z",
  "author": "samuel-tolbert",
  "summary": "Opinion: blurry textures aren't immersive",
  "article": [
    "Mass Effect: Legendary Edition is an event. There's no denying the impact of the original trilogy and the way it is revered among hardcore gaming circles, so the announcement of this remastered collection bringing the entire journey of Commander Shepard across three games together on modern hardware was met with fanfare around the gaming world.",
    "Packing in almost all of the DLC (RIP, Pinnacle Station) with improved graphics and controls, particularly for the first game, this feels like one of the most-requested remasters in all of gaming. It's something of a dream announcement for many, myself included.",
    "Even so, in the past couple of weeks, there's been something of an online fervor as people insist that the remaster — particularly the first game — doesn't look as good as the original version. Notable complaints include how the atmosphere has been ruined in multiple scenes, or visibility has been increased where it was intentionally dark beforehand, with still more scenes being accused of being too bright and warm.",
    "Frankly, these comparisons show a fundamental misunderstanding of the remastering process and working with Unreal Engine as a whole - and here's why.",
    "When the first Mass Effect released back in 2008, it had a resolution of around 720p and texture quality to match. You can't just scale everything up to 4K and expect it to hold up well, more work is going to be needed. Something that looked hidden in the dark at a lower resolution isn't going to hold up well with cleaner visuals.",
    "BioWare's ideas for Mass Effect were limited by the hardware of the time. To bring the visual quality to be more consistent with not just Mass Effect 2 and Mass Effect 3 but more importantly the original concept art, major changes have to be made in places. This is BioWare's true vision for the game seeing the light of day. BioWare has openly stated that the lighting situation was a pain in the first Mass Effect, with textures going unseen in the darkness.",
    "Just take a look at the icy world of Noveria. The remastered version has lower visibility, more realistically showing the difficulty of seeing through a fierce snowstorm. Yet because the image isn't as dark overall, people are convinced it looks worse.",
    "Eden Prime is a world described as a paradise in the in-game lore repository known as the Codex. Therefore, it's only natural that this remaster would clean up the bizarrely dark and red skies, improving the lighting and, yes, making it brighter overall.",
    "Memories are easily tainted with rose-tinted glasses and nostalgia influencing how we remember the actual objective visual quality of a scene versus how it really looked. Another particular before-and-after shot being bandied around is the one of Captain Anderson below.",
    "The lighting is better now, as is the skin quality and material texture, with BioWare working to improve on Unreal Engine 3 and the early limitations that first resulted in heavily crushed blacks (a process resulting in a lack of detail, hiding blurred areas in total darkness). The result of these changes is that skin, metal and other textures react more realistically to lighting, enhancing the overall presentation and realism.",
    "Another game that suffered from the same kind of vocal minority backlash online was Bluepoint Games' Demon's Souls remake for the PS5, though on a grander scale overall, given the nature of the conversion. The original Demon's Souls — a cult classic title — suffered from a small budget and the PS3's architectural limitations, meaning it simply didn't age well and grand changes were necessary.",
    "Scenes that once lacked any detail were filled with rich color and design that mostly stayed true to the Gothic atmosphere and are in fact far creepier in many places, such as the entirety of Latria. It's the same issue, where people mistook a lack of any real depth or texture, masked in shadow, as \"atmosphere\" to the expense of any other detail.",
    "The complaints are even worse with Mass Effect because it's not a completely separate team handling the new version, it's being done directly by and with the supervision of the original studio! There is simply no argument to be made for artistic integrity when the original artists are the ones responsible for the changes. This is BioWare's vision for all three chapters of the Mass Effect trilogy, built as it was intended.",
    "Is this lengthy process of improving and altering assets going to result in some scenes looking quite different than how we remember them? Sure, of course, it will. That doesn't mean the atmosphere has been ruined. Rather, BioWare is now able to better showcase the original ideas, matching the concepts first turned into art so many years ago."
  ],
  "headers": {
    "4": "Can't just flip a switch",
    "8": "Faces that belong to human beings"
  },
  "links": {
    "Mass Effect: Legendary Edition": "https://www.techradar.com/news/mass-effect-legendary-edition",
    "RIP, Pinnacle Station": "https://www.techradar.com/news/mass-effect-legendary-edition-will-be-missing-a-fan-favourite-dlc",
    "major changes": "https://www.ea.com/games/mass-effect/mass-effect-legendary-edition/news/visual-improvements",
    "openly stated": "https://www.unrealengine.com/en-US/blog/mass-effect-2",
    "Demon's Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "PS5": "https://www.techradar.com/reviews/ps5"
  }
}