{
  "source": "https://www.techradar.com/news/nvidia-reflex-now-gives-you-sharper-reactions-in-rainbow-six-siege",
  "title": "Nvidia Reflex now gives you sharper reactions in Rainbow Six Siege",
  "category": "computing",
  "updated": "2021-03-30T13:00:48Z",
  "author": "darren-allan",
  "summary": "Drives down latency to make you a sharper shooter",
  "article": [
    "Nvidia’s Reflex feature now supports Tom Clancy’s Rainbow Six Siege, fans of the shooter will doubtless be pleased to hear – and DLSS support is ready for Outriders, too, ahead of that game’s imminent launch.",
    "Reflex aims to reduce input lag, which is vital for those playing shooters even vaguely competitively. This is the lag between, for example, pressing your mouse button and the gun actually firing on-screen, so shaving milliseconds off this is effectively translating to slightly quicker reflexes (hence the name).",
    "Essentially, Reflex is reducing the delay between an action being taken by your fingers, and it actually happening in the game world – the lag applied to your input by the system. And obviously enough, the lower that is, the better.",
    "You’ll need the latest Nvidia driver, as well as the fresh patch for Rainbow Six Siege, to benefit – and the improvement could be up to 30% lower system latency in certain cases, Nvidia reckons (using the Vulkan API in that best-case scenario).",
    "Nvidia gives some example latency figures, including a reduction to as low as 13ms (from 17ms) using Reflex with an RTX 3080 GPU in Rainbow Six Siege. With a GTX 1660 Super graphics card, the reduction is from 37ms to 26ms.",
    "Nvidia observes that out of the 10 most popular current shooters, seven now have Reflex support, including Fortnite and Valorant. You may recall that Overwatch was another high-profile introduction earlier in March, with even bigger claims of latency reduction to the tune of 50%.",
    "As mentioned at the outset, Nvidia’s new driver also brings in optimizations and support for DLSS in Outriders, a co-op loot shooter (with RPG elements) of which there’s an extensive demo kicking about. The full game comes out later this week on April 1.",
    "According to Nvidia’s own benchmarking, DLSS improves the average frame rate of Outriders in 4K resolution from 65 fps to 107 fps on an RTX 3080 (partnered with an Intel Comet Lake 10900K CPU). The RTX 3060 shows an increase from 31 fps to a much smoother 53 fps at 4K."
  ],
  "headers": {
    "5": "Wider support"
  },
  "links": {
    "DLSS support": "https://www.techradar.com/news/nvidia-dlss-brings-faster-frame-rates-to-more-games-thanks-to-unreal-engine-plug-in",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "GTX 1660 Super": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Valorant": "https://www.techradar.com/how-to/how-to-get-a-valorant-beta-key",
    "Overwatch": "https://www.techradar.com/news/gaming/overwatch-review-1322640",
    "bigger claims of latency reduction to the tune of 50%": "https://www.techradar.com/news/nvidia-reflex-improves-overwatch-performance-by-drastically-cutting-latency",
    "extensive demo kicking about": "https://www.techradar.com/how-to/how-to-play-the-free-outriders-demo",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc"
  }
}