{
  "source": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-2-trailer-what-you-may-have-missed",
  "title": "The Legend of Zelda: Breath of the Wild 2 trailer - what you may have missed",
  "category": "gaming",
  "updated": "2021-06-15T17:33:55.982Z",
  "author": "techradar-team",
  "summary": "Here’s what you may have missed from the new Breath of the Wild 2 trailer",
  "article": [
    "Nintendo finally gave us an update on The Legend of Zelda: Breath of the Wild 2 during its E3 2021 showcase, revealing a release window of 2022 for the highly-anticipated sequel and a brand new teaser trailer.",
    "The new Breath of the Wild 2 trailer lasts around a minute and a half and packs in a lot, so it’s easy to miss some key details. Fortunately, here at TechRadar, we’ve scrupulously scanned the new BOTW 2 trailer and identified some of its most important elements.",
    "Read on for everything you might have missed from the new The Legend of Zelda: Breath of the Wild 2 trailer - and make sure to check out the trailer below.",
    "The shadowy zombie figure at the beginning of the trailer has a horseshoe belt and what looks like clamps on his arm. Not distinctly Ganondorf-like in terms of design elements, which was a big part of fan speculation – could he be a secondary villain, or will he be a new entry to the series?",
    "The 2017 teaser offers more tidbits here, with a shadow seemingly in the shape of Demise, the end villain from Skyward Sword, who is the initial embodiment of series antagonist Ganondorf. We’ve seen nothing to disprove that in this new trailer, but not much more to confirm it either.",
    "Those bloody Bokoblins are back, and this time they’ve got some seriously mean looking friends on their side. Remember those stone giants from Breath of the Wild? Well, Bokoblins have set up camp on top of them, making for mobile fortresses that you’ll have to take down. Yikes.",
    "Yep, your eyes did not deceive you. Just because you defeated the evil consuming Breath of the Wild’s Hyrule Castle, it doesn’t look like the poor old battlements are done with being possessed just yet. As seen in the new trailer, forceful red tendrils seem to be using some sort of unholy power to force the castle up into the air – seemingly making this key Zelda landmark airborne. The sky certainly seems to be the limit for Breath of the Wild 2, and we’re excited to see how Link will be finding his way up to these lofty heights.",
    "The stasis ability seems to have been given a facelift, with a new way to map the trajectory and propel forwards objects. It also looks like the slowing of time effect now comes with a grayscale filter on everything except the moveable object. We can expect, then, to see an upgrade for the other abilities too, in addition to the newer ones seen in the trailer – seemingly channelled through the glowing glove shown off in the trailer. The Sheikah Slate from Breath of the Wild (2017) made more sense when the game co-launch on the Wii U – with its tablet controller – and it looks like Link may be transitioning to a glove to use similar powers this time around.",
    "It looks like Link will be able to let his hair down in Breath of the Wild 2, as we saw the Hyrlian hero’s blonde locks flowing in the wind while free-falling to the ground below, and when sprinting across the plains of Hyrule. When in combat, however, Link’s hair was held in the classic short pony-tail style that we saw in Breath of the Wild, which might suggest there’s more customization options for how Link will appear in the game.",
    "In what appears to be a new ability, it looks like Link may be able to use the power of water to move through specific parts of the terrain. It’s unclear exactly how this new portal-like ability works, but we saw Link pass through a stone bridge and appear on the other side, as if by magic. Being able to bypass the need to scale every cliff face or building in the game would be welcome in Breath of the Wild 2 (especially if it rains), and could make traversal a lot less time-consuming.",
    "Sure, you can “be like water”, but if you want to get things a little steamier, it appears that Link will have a new flame-throwing ability, too. A short sequence in the trailer sees Link doing battle with a snake-like creature hanging from the ceiling of a cave, fending it off with what seems like a flame cast from his Sheikah slate."
  ],
  "headers": {
    "3": "No Ganondorf?",
    "5": "Bokoblin forts on top of giants",
    "6": "Floating Hyrule Castle",
    "7": "Upgraded abilities Sheikah Slate",
    "8": "Link’s free-flowing hair",
    "9": "Be like water",
    "10": "Link’s A-flame-aning"
  },
  "links": {
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "E3 2021": "https://www.techradar.com/news/e3-2021"
  }
}