{
  "source": "https://www.techradar.com/news/huawei-sees-huge-revenue-drop-as-sanctions-continue-to-bite",
  "title": "Huawei sees huge revenue drop as sanctions continue to bite",
  "category": "phones",
  "updated": "2021-08-09T09:47:37Z",
  "author": "mike-moore",
  "summary": "Fall follows sale of Honor phone arm and continued sanctions",
  "article": [
    "Huawei has seen its biggest-ever drop in revenues as the company continues to struggle against the effects of sanctions and bans across the world.",
    "The Chinese smartphone firm reported revenues in the first half of 2021 fell 30% compared to the previous year to Rmb320 billion (£35.5 billion).",
    "Revenues from its consumer electronics arm, which includes phones, tablets and laptops, fell by 47% year-on-year with its infrastructure arm seeing a 14.2% fall.",
    "Huawei Chair Eric Xu said that given the scale of sanctions levied on the company, its main priority was firstly ongoing survival.",
    "“We’ve set our strategic goals for the next five years, our aim is to survive, and to do so sustainably,” Xu said in a statement, adding that 2021 would be a “challenging year.”",
    "“Despite a decline in revenue from our consumer business caused by external factors, we are confident that our carrier and enterprise businesses will continue to grow steadily.”",
    "Huawi has been affected by a number of major sanctions in recent years following accusations against the company - all of which it denies.",
    "This includes US sanctions that have limited the company's access to American technologies such as chips and Google applications, affecting device development and the desirability of its handsets to consumers.",
    "This has seen the company drop out of the top five biggest global smartphone makers, with domestic rivals Xiaomi taking advantage of the gap in the market.",
    "Huawei is pressing ahead with a revived device strategy focused around its own HarmonyOS operating system, with a series of new product releases scheduled, along with a shift towards software and cloud services.",
    "Company founder Ren Zhengfei noted that the company was still attempting a “pivot to software”, with its Harmony OS software having been installed in around 50 million mobile devices.",
    "“We must dare to lead the world in the pure software domain,” said Ren in a statement. “In domains where software overlaps with hardware, we should focus on optimising software to complement hardware.\"",
    "Via Financial Times"
  ],
  "headers": {
    "3": "Huawei fall"
  },
  "links": {
    "Huawei": "https://www.techradar.com/news/best-huawei-phones",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "number of major sanctions": "https://www.techradar.com/news/uk-experts-criticise-huawei-progress-on-addressing-security-issues",
    "Xiaomi taking advantage": "https://www.techradar.com/news/xiaomi-leapfrogs-apple-to-become-the-worlds-second-biggest-smartphone-vendor",
    "Financial Times": "https://www.ft.com/content/dc170be7-262e-4616-9ef9-2a49c611c26b"
  }
}