{
  "source": "https://www.techradar.com/news/moto-g50-leaked-press-renders-show-off-this-cheaper-alternative-to-the-g100",
  "title": "Moto G50 leaked press renders show off this cheaper alternative to the G100",
  "category": "phones",
  "updated": "2021-03-24T14:48:31Z",
  "author": "james-rogerson",
  "summary": "In blue and grey",
  "article": [
    "Motorola always seems to have more handsets on the way, and alongside the long-rumored Moto G100 (which could be the Motorola Edge S in all but name) it now looks like a phone dubbed the Moto G50 might be about to land too.",
    "The latest news on this front comes from DealnTech, which has acquired what appears to be official press renders of the phone, showing it in blue and grey shades.",
    "You can see a triple-lens camera on the back, complete with text that reads ‘48MP Quad Pixel’ – meaning one of those snappers (presumably the main one) will have a 48MP sensor that combines four pixels into one, for 12MP photos.",
    "There also appears to be a fingerprint scanner on the back, while around the front there’s a single-lens camera in a teardrop notch.",
    "There’s no real other information here, but Playfuldroid recently spotted that the Moto G50 had been certified in China, where it was listed as having a 5,000mAh battery and 10W charging, while earlier leaks pointed to a 48MP main camera, a 5MP macro one, and a 2MP depth sensor, along with a 13MP snapper on the front, a 90Hz screen refresh rate, 128GB of storage, and 4GB of RAM.",
    "We might not have to wait long for official details about it, as Motorola is making some sort of announcement on March 25 (tomorrow at the time of writing), and DealnTech speculates that we’ll see both the Moto G50 and the likely far more expensive Moto G100 then.",
    "That said, we've elsewhere heard the Moto G100 will land in April, so we're not sure yet, but one way or another we'd expect to see both of these phones before long."
  ],
  "headers": {},
  "links": {
    "Motorola Edge S": "https://www.techradar.com/reviews/moto-g100-review",
    "DealnTech": "https://www.dealntech.com/this-is-what-the-moto-g50-looks-like/",
    "Playfuldroid": "https://playfuldroid.com/moto-g50-bags-tenaa-certification-images-revealed/",
    "will land in April": "https://www.techradar.com/news/moto-g100-could-have-the-samsung-galaxy-s21-beat-in-some-ways"
  }
}