{
  "source": "https://www.techradar.com/news/state-of-origin-2021-game-2-live-stream-nsw-vs-qld-from-anywhere",
  "title": "State of Origin 2021 Game 2: live stream NSW vs Qld from anywhere",
  "category": "entertainment",
  "updated": "2021-06-27T07:00:00Z",
  "author": "jasmine-gearie",
  "summary": "It’s a must-win match for Queensland at Suncorp Stadium",
  "article": [
    "The NSW Blues had a stunning victory in Game 1 of the State of Origin, thrashing the Maroons 50-6 on their home turf in Townsville. Queensland will need to turn it around in tonight’s game at Suncorp Stadium for a chance at winning the series.",
    "Game 2 will kick off tonight at 7:50pm AEST – here’s how you can live stream State of Origin no matter where you are.",
    "The Maroons have had to take a serious look at their lineup following their crushing loss in Game 1, and injury turmoil has hit the squad.",
    "Initially, 18-year-old Reece Walsh was tapped to make his Origin debut tonight as fullback, but Walsh has been ruled out of tonights clash’s following a hamstring strain. Valentine Holmes will now return as fullback for Queensland.",
    "More chaos hit the Maroons on Sunday, when Ronaldo Mulitalo was chosen to make his Origin debut only to have been axed from the side just hours before kick off.",
    "The New Zealand-born player was deemed ineligible after it was reported he came to Queensland after turning 13, which goes against Origin’s rules of eligibility. Xavier Coates will now take Mulitalo’s place as winger.",
    "Blues coach Brad Fittler hasn’t had to dramatically switch up his side in the lead up to Game 2, with the only changes coming in the form of Junior Paulo, who will replace an injured Jake Trbojevic, and Angus Crichton, who will take Paulo’s seat on the bench.",
    "While the Blues played a stellar game in the series opener, they’ll face an entirely different beast at Suncorp. With the recent Covid-19 outbreak in Sydney, many Blues supporters have had to refund their tickets to tonight’s game. In their place, Suncorp Stadium will be filled with a hot pot of loud and proud fans barracking for the home side.",
    "Suncorp is always a difficult game for Blues, and tonight, the Maroons will be hoping to turn their fortunes around with a powerful performance for the home crowd. Want to see how it unfolds? Here’s how to watch State of Origin Game 2 live no matter where you are.",
    "All three State of Origin games will be shown live and free on Channel 9 in Australia. You can watch Game 2 tonight, Sunday, June 27 at 8:10pm AEST. You can also stream the game from Channel 9’s streaming platform, 9Now.",
    "It will also be aired on a delayed broadcast on Fox Sports and streaming service Kayo after the game is over.",
    "Fans living outside Australia, New Zealand or the Pacific Islands can catch the State of Origin online with the Watch NRL streaming service.",
    "Watch NRL requires a subscription and has three different plans to choose from:",
    "Weekly: US$17 / £13 / €17 / AU$20 Monthly: US$33 / £25 / €33 / AU$39 Annual: US$165 / £130 / €155 / AU$199",
    "If you’re an Aussie that wants to catch that free Channel 9 coverage but are currently abroad, then you’ll discover that the access is geo-blocked. It’s not unsurpassable, as you could try using a VPN to set the IP address of your laptop, phone or streaming device back to one in Australia and watch as if you were in the country.",
    "Use a VPN to stream the State of Origin from anywhere"
  ],
  "headers": {
    "9": "How to watch the State of Origin Game 2 in Australia",
    "11": "How to watch the State of Origin Game 2 from overseas",
    "14": "How Australians live stream State of Origin Game 2 from abroad"
  },
  "links": {
    "9Now": "https://www.9now.com.au/state-of-origin",
    "Kayo": "https://goto.kayosports.com.au/c/338476/515039/8808?subId1=trd-us-7905843754629657000&sharedId=trd-us&u=https%3A%2F%2Fkayosports.com.au%2F",
    "Watch NRL": "https://www.watchnrl.com/",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}