{
  "source": "https://www.techradar.com/news/google-workspace-individual-offers-everything-to-start-and-run-your-small-business",
  "title": "Google Workspace Individual offers all you need to start and run a small business",
  "category": "computing",
  "updated": "2021-07-13T10:36:23Z",
  "author": "mike-moore",
  "summary": "All you need for your SMB in one simple package",
  "article": [
    "Starting up and growing a business in the hybrid working era is set to get a welcome boost after Google Workspace announced the launch of a specially designed collection of its most useful business software tools.",
    "Google Workspace Individual looks to target small business owners or other users looking to promote a “passion project” with specially curated and targeted services.",
    "First announced in June 2021, the package is now available for users in five countries - the US, Canada, Mexico, Brazil, and Japan - costing $9.99 per month, although there is currently a $2 discount until January 2022, with a 14-day free trial also available.",
    "Google says that Workspace Individual, \"makes it easy to connect and engage with people wherever they are, so you can spend less time on everyday tasks and more time with customers.\"",
    "The platform includes \"premium\" calls through the Google Meet video conferencing service, with users able to benefit from longer group calls (up to 24 hours), call recording, breakout rooms, polls and more.",
    "It also offers shareable booking pages integrated directly with Google Calendar, letting anyone schedule an appointment with you quickly and easily. Customers can also pick from several different types of appointments, including consultations or site visits.",
    "Gmail on Workspace Individual will also soon get a selection of specially-designed professional email layouts that can be customized with your business' branding, along with unique newsletter and promotion messages.",
    "The launch comes after Google recently announced that a version of Workspace would be available to anyone with a Google account, meaning friends, family or groups of any kind can stay connected, work together and share helpful information from a single place.",
    "Users will have access to the full Google Workspace experience including Gmail, Chat, Calendar, Drive, Docs, Sheets, Meet and more as the search giant is bringing 'Google Workspace to Everyone'"
  ],
  "headers": {
    "3": "Google Workspace Individual"
  },
  "links": {
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "First announced": "https://www.techradar.com/news/google-workspace-is-getting-a-major-upgrade-to-rival-microsoft-365",
    "says": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-3110982247482116600/https://workspace.google.com/individual/",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "email": "https://www.techradar.com/best/best-email-clients"
  }
}