{
  "source": "https://www.techradar.com/news/xiaomi-mi-mix-4-with-under-display-camera-doesnt-mean-your-next-phone-will-have-one",
  "title": "Xiaomi Mi Mix 4's clever camera probably won't be on your next phone",
  "category": "phones",
  "updated": "2021-08-06T09:42:50Z",
  "author": "james-peckham",
  "summary": "More phones, but unlikely to be on the best sellers yet",
  "article": [
    "The Xiaomi Mi Mix 4 is almost certain to feature an under-display camera - it has now been teased by an executive from the company - but that doesn't mean your next smartphone is set to feature the technology.",
    "While the Xiaomi Mi Mix 4 may be sold in markets around the world later this year, we're not expecting it to be a top-selling phone. The Mi Mix series is where the company has traditionally debuted its new upcoming technologies before they come to its high selling handsets, such as the expected Xiaomi Mi 12 series.",
    "This is likely the start of under-display cameras becoming mainstream, but the rumors suggest we'll be waiting a touch longer until this technology becomes the norm on smartphones.",
    "A few leaks suggest that Samsung's upcoming Galaxy Z Fold 3 foldable smartphone may also introduce an under-display camera. That's the first time we've seen the technology debut on a Samsung product, if that happens.",
    "Oppo has also introduced a new version of its under-display camera technology - that's the third generation of this tech - and it may be the first time we see this on an upcoming smartphone.",
    "Previously, we've only seen ZTE debut the technology on its Axon 20 5G and Axon 30 5G smartphones. We've tried the older of those two handsets, and we found the selfie images to be considerably more washed out than other handsets with traditional front-facing selfie shooters.",
    "So why won't this be the norm on smartphones for a while? We believe this technology will gradually evolve, and it's unlikely we'll see this technology used on upcoming smartphones like the iPhone 13 or Samsung Galaxy S22.",
    "One report suggested that Samsung's production won't be ready to make it to the scale needed for the company's big flagship series, so this will be an exclusive feature in the company's lineup for the Galaxy Z Fold 3 for the foreseeable future.",
    "If you desperately want to try a smartphone with an under-display camera, your options are set to become a lot wider in the coming months. Expect to see more and more companies introduced this technology over the next year, but that said we don't expect to see mainstream flagship devices adopting the technology until mid-2022 at the earliest.",
    "Via Phone Arena"
  ],
  "headers": {},
  "links": {
    "Xiaomi Mi Mix 4": "https://www.techradar.com/news/xiaomi-mi-mix-4-news",
    "Xiaomi Mi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "has also introduced": "https://www.techradar.com/news/oppo-may-have-mastered-the-under-display-camera-so-could-we-see-this-in-the-find-x4",
    "Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Phone Arena": "https://www.phonearena.com/news/xiaomi-mi-mix-4-under-panel-camera-teased_id134143"
  }
}