{
  "source": "https://www.techradar.com/news/pirate-video-streaming-service-host-arrested",
  "title": "Pirate video streaming service host arrested",
  "category": "computing",
  "updated": "2021-03-11T21:42:08Z",
  "author": "anthony-spadafora",
  "summary": "Mobdro's days are numbered",
  "article": [
    "As the number of paid streaming services has increased, more and more users are turning to piracy to watch their favorite content and over the past several years, the pirate streaming app Mobdro has managed to gain an estimated 43m users.",
    "While Mobdro shares some similarities with other standalone piracy apps including Popcorn Time, Showbox and TerrariumTV, it has become a fan-favorite due to its wide range of content including live TV and sports channels which are presented in an easy-to-use interface.",
    "However, the app's growing popularity led it to catch the attention of the European Union Agency for Criminal Justice Cooperation (Eurojust) and investigations into Mobdro began back in 2018 after complaints were received from La Liga, the Premiere League and the Alliance for Creativity and Entertainment.",
    "According to Eurojust, the main suspect of the investigation into Mobdro “used primary domains and servers” to illegally access legally operating streaming services to show their content in its app.",
    "Following the investigations into the pirate streaming app, Eurojust recently coordinated an “action day” against Mobdro in which law enforcement searched four locations and made it impossible for the app to be uploaded to platforms and servers in Spain, Portugal and the Czech Republic.",
    "In total, one suspect was arrested by Spanish authorities and three others were taken into custody for questioning in Spain and Andorra.",
    "In a statement, Eurojust provided further insight on the work the agency has been doing to disrupt pirate streaming operations, saying:",
    "“Audio-visual piracy via the illegal transmission of television and streaming signals has seen a big increase in recent years, with Eurojust coordinating action days at the request of national authorities since 2019. In these operations, close to 6 000 servers have already been seized in order to block the abuse of audio-visual services of legally operating and copyrights-paying enterprises by criminal organisations, which also use this kind of crime for money laundering purposes.”",
    "While Mobdro has now been taken down, other illegal streaming apps and services will likely rise up to take its place given its large user base and profitability over the years it was in operation.",
    "Via Torrent Freak"
  ],
  "headers": {
    "4": "Mobdro takedown"
  },
  "links": {
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Mobdro": "https://www.techradar.com/news/mobdro-the-app-that-wants-to-take-on-kodi-for-a-shot-at-the-streaming-crown",
    "Popcorn Time": "https://www.techradar.com/news/television/popcorn-time-the-netflix-of-torrents-will-be-reborn-in-the-browser-1314485",
    "Showbox": "https://www.techradar.com/news/popcorn-time-gets-new-competition",
    "Eurojust": "https://www.techradar.com/news/bad-news-torrent-fans-one-of-the-worlds-largest-piracy-rings-has-been-raided",
    "statement": "https://www.eurojust.europa.eu/eurojust-supports-spanish-action-against-illegal-streaming-football-matches",
    "illegal streaming": "https://www.techradar.com/news/illegal-film-streaming-sites-thriving-under-lockdown",
    "Torrent Freak": "https://torrentfreak.com/mobdro-pirate-streaming-police-arrest-suspect-three-others-questioned-210310/"
  }
}