{
  "source": "https://www.techradar.com/news/how-edge-computing-can-unlock-the-potential-of-iot",
  "title": "How edge computing can unlock the potential of IoT",
  "category": "computing",
  "updated": "2021-09-03T14:07:14Z",
  "author": "tim-lovejoy",
  "summary": "The opportunities that lie in IoT",
  "article": [
    "Cloud technology has long been accepted as fundamental to the way the modern world operates, with even the most skeptical and reluctant sectors now embracing the value it offers. What comes next, as IoT devices proliferate in our work and home lives, is a move towards edge computing, which has particular advantages for the public sector.",
    "IoT presents vast opportunities across the public sector. Autonomous transport, health monitoring devices, traffic and lighting applications, law enforcement are all possibilities as well as smart bin sensors to ensure rubbish never overflows.",
    "These functionalities require low latency applications, which are processed at the edge of the network in order to maximize the functionality. Ultimately, as IoT decentralizes computing infrastructure, edge computing looks set to hold an advantage over cloud or centralized computing. Yet in reality, they will have to work closely, in tandem.",
    "This hybrid approach will have many benefits, not least in convincing some of the more cautious decision makers within the public sector of the role of IoT, and in turn edge computing, in making operations more efficient.",
    "To fully harness the potential of IoT and smart devices, edge computing needs to be embraced. Data from the edge is processed in real time, eliminating even the tiniest lag. This speed is everything. The latency is reduced, in turn decreasing the time taken to get actionable insights from any live data. In short, it allows for highly informed, real-time decision making.",
    "The governmental and public sector benefits are particularly apparent. Emergency and crisis situations in particular require decisions to be made almost instantly. The combination of IoT and edge computing will allow these decisions to be informed by real-time information, potentially saving lives.",
    "As such, there is a promise of improved efficiency – which can in turn lead to cost savings, revenue-making opportunities, or simply better services.",
    "But what are the risks in terms of compliance and cybersecurity when exploring edge computing?",
    "Concerns around the security of the cloud can be rationalized, especially where strict regulations are in place to protect citizen data and prevent potentially dangerous disruption to services. And to date, the primary way of reducing the apparent risk posed by hosting data in the cloud is to keep it local – at present, mainly meaning on a private server.",
    "Edge computing enables data to be kept locally for decision making in real time – and this is why it could be a game-changer. It can limit the distance travelled by any data and therefore reduces some of the security risk associated with moving it to the cloud or another data center. And there is a smaller window in which anything can be disrupted or corrupted as data remains highly localized. For data that needs to persist for longer term information gathering, this is sent back to the cloud for retention, so the art of the possible is virtually endless.",
    "The bottom line is the most important one for the majority of businesses, and this is certainly true in the public sector. Budgets tend to be tighter, and digital transformation projects can be limited by financial concerns.",
    "Edge computing can actually bring cost savings. This is especially true in regards to data ingest charges where only sending the data that needs to persist into the cloud reduces data movement charges. With data essentially being processed on site rather than in the cloud, organizations can reduce their cloud capacity requirements and associated costs.",
    "Smarter use of cloud infrastructure also offers cost optimization benefits. Cloud in tandem with edge is a great example of how the architecture can work more flexibly and offer improved savings based on actual usage and requirements, while being fully scalable.",
    "This required flexibility is also encouraging new solutions to come to market, with infrastructure that can bridge the gap between public and private clouds. As cloud environments evolve to encompass various combinations of edge and multicloud offerings, the simplicity and flexibility this technology can provide alongside expert partners will help reduce any unnecessary costs while delivering tailored and agile solutions for organizations.",
    "As all organizations become even more data heavy, using the right combination of technologies is essential. Whether it is bringing expertise in house, co-sourcing, or taking counsel from expert partners, the benefits of harnessing the right combination of edge and cloud to complement the increasing deployment of IoT is becoming essential.",
    "The good news for the public sector is that we are only at the start of the IoT revolution. But with immense opportunities for it to improve the services that we interact with every day, now is the time to think smartly about how to embrace its potential."
  ],
  "headers": {
    "4": "Living on the edge",
    "7": "A more secure solution",
    "10": "Cutting costs",
    "14": "Opportunities ahead"
  },
  "links": {
    "Cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "IoT": "https://www.techradar.com/news/what-is-the-iot-everything-you-need-to-know",
    "Data": "https://www.techradar.com/best/best-data-visualization-tools",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "security": "https://www.techradar.com/news/best-internet-security-suites"
  }
}