{
  "source": "https://www.techradar.com/news/save-dollar-ten-on-ring-fit-adventure-at-best-buy-this-weekend",
  "title": "Save $10 on Ring Fit Adventure at Best Buy this weekend",
  "category": "gaming",
  "updated": "2021-02-05T13:00:18Z",
  "author": "tabitha-baker",
  "summary": "At home fitness for the Switch",
  "article": [
    "Ring Fit Adventure deals have been rare over the last year, especially considering stock of the at-home workout game has been so low. With rising demand at the beginning of the pandemic and a unique physical-only release, the gamified workout tool has seen very few discounts in the last few months.",
    "However, Best Buy's latest Nintendo Switch deals are dropping that price down from $79.99 to $69.99 this weekend. That's a particularly impressive discount considering just how popular this peripheral has been over the course of the year.",
    "Ring Fit Adventure uses a ring-shaped device with a leg strap to hold your Joy-Con controllers while you battle through monsters and bosses using timed workouts to complete the RPG adventure.",
    "It's a potent combination of fitness, gameplay, customization, and motivation that has helped the title soar in popularity, especially during periods of lockdown. We don't expect this particular Ring Fit Adventure deal to stay in stock too long these days either.",
    "Not in the US? You'll find more Ring Fit Adventure deals further down the page.",
    "If you're after some cheap Joy-Con for your Ring Fit Adventure, there's a few discounts that may pique your interest. If you're yet to grab a console, though, we're tracking all the latest Nintendo Switch bundles right here. You'll also find Pro Controller deals if you know where to look, and we're rounding up all the latest Mario Kart Live: Home Circuit prices if you're after more peripherals."
  ],
  "headers": {
    "5": "More Nintendo Switch deals"
  },
  "links": {
    "down from $79.99 to $69.99 this weekend": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-7450668445713586000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fring-fit-adventure-nintendo-switch%2F6352149.p&article_name=Save%20%2410%20on%20Ring%20Fit%20Adventure%20at%20Best%20Buy%20this%20weekend%20&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsave-dollar-ten-on-ring-fit-adventure-at-best-buy-this-weekend",
    "Ring Fit Adventure deals": "https://www.techradar.com/deals/cheap-ring-fit-adventure-deals-prices",
    "cheap Joy-Con": "https://www.techradar.com/deals/best-nintendo-switch-joy-con-price-sales-cheap",
    "Nintendo Switch bundles": "https://www.techradar.com/news/nintendo-switch-deals",
    "Pro Controller deals": "https://www.techradar.com/deals/nintendo-switch-pro-controller-price-sales-cheap",
    "Mario Kart Live: Home Circuit prices": "https://www.techradar.com/deals/best-mario-kart-live-home-circuit-price-deals-sales"
  }
}