{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-vs-samsung-galaxy-s10",
  "title": "Samsung Galaxy S21 vs Samsung Galaxy S10: 2021's Android phone versus 2019's",
  "category": "phones",
  "updated": "2021-04-02T13:00:14Z",
  "author": "jon-mundy",
  "summary": "Has Samsung rolled its signature smartphone back too far?",
  "article": [
    "With the Samsung Galaxy S21, the South Korean giant has taken an interesting left turn. For arguably the first time in the history of the plain-numbered Galaxy S line, Samsung has taken its foot off the pedal and focused a little more on value.",
    "That’s great for those looking for a classy flagship phone at a slightly more respectable price point. But it does beg the question: just how much of an upgrade is the Samsung Galaxy S21 over the Samsung Galaxy S10?",
    "It may be two generations removed from the S21, but the tenth-anniversary-marking Galaxy S10 was built at a time when Samsung threw (almost) everything but the 5G into its signature model.",
    "Talking of which, just how does the Samsung Galaxy S10 5G figure into all this? All of these questions and more will answered in the following feature.",
    "The Samsung Galaxy S21 landed in shops on January 29, 2021, at a price of $799 / £769 / AU$1,249 for the 128GB model. Rather unusually for the smartphone market, this wasn't more expensive than the launch price of the Galaxy S20 before it.",
    "The Samsung Galaxy S10 landed on March 8, 2019. At its launch, prices started from $749 / £669 / AU$1,149 for the 128GB model which, unlike the Galaxy S21, was more expensive than its immediate predecessor the Galaxy S9. There was also a 512GB model made available for $1,149 / £999 / AU$1,699.",
    "This was year zero for 5G phones, so a separate Galaxy S10 5G model shipped in June 2019 to accompany the rollout of the first 5G networks in the US and the UK. The starting price for this model was an eye-watering $1,299/£1099 (around AU$1,850) for the 256GB version and $1,399 (around £1,100, AU$1,990) for the 512GB version.",
    "Neither of these models is being sold as new through Samsung in the UK or the US, but you might still find a brand new unit through the usual third party avenues. At the time of writing, Amazon UK was selling a new 4G model for £498, while Amazon US was selling the same model for $575.",
    "It’s interesting to compare the designs of these two phones. On the one hand, the Samsung Galaxy S21 is the newer, and thus fresher design. On the other hand, in hitting a more aggressive price point with the Galaxy S21 the Galaxy S10 arguably feels more premium.",
    "To meet its (relatively) lower price point, the Samsung Galaxy S21 adopts a ‘Glasstic’ material for its rear surface, which is essentially a mixture of glass and plastic. But you probably guessed that from the name.",
    "It doesn’t feel quite as high-spec as the Galaxy S10, which goes with a classic combination of glass surfaces and aluminum body. Still, the S21’s matte finish serves to eliminate fingerprints, and metal edges around the outside of the device reinstate a certain sense of class.",
    "The S21 certainly looks the part, especially with Samsung’s bold new color options (Phantom Gray, Phantom White, Phantom Pink, and Phantom Violet) and matte finish. Perhaps we’re being a little premature here, but the phone’s distinctive ‘Contour Cut Camera’ module looks instantly iconic, swooping into the frame of the device from one angle and standing loud and proud from another.",
    "Overall, we’d take the S21’s distinctive design over the rather safe and samey S10’s any day. It might come in attractive shades of Flamingo Pink, Prism Black, Prism Blue, Prism White, Canary Yellow and Prism Green - some of which have a lovely shimmery effect to them - but its dull horizontal camera configuration seems rather vanilla.",
    "Around front, the S10 subscribes to Samsung’s old curved-screen way of thinking. Which looks great (there are virtually no side bezels here), but it also raises a couple of practical issues such as false presses and annoying visual distortions.",
    "The Galaxy S21 mercifully flattens its display out. It doesn’t look as sleek as its predecessor, but it’s quite a bit more usable as a result.",
    "Both phones feature hole punch selfie cameras, but the Galaxy S21 places it centrally, while the Galaxy S10 shifts it over to the right. The Galaxy S10 5G, meanwhile, expands the camera module itself to a lozenge shape, which is more intrusive.",
    "In terms of size, the Galaxy S10 comes in two configurations: 149.9 x 70.4 x 7.8mm for the 4G model and 162.6 x 77.1 x 7.9 mm for the Galaxy S10 5G. The Galaxy S21 splits the difference at 151.7 x 71.2 x 7.9 mm, but sits far closer to the dimensions of the Galaxy S10 4G. That’s the case when it comes to weight too, with the Galaxy S10 at 157g, the Galaxy S10 5G at a meaty 198g, and the Galaxy S21 at 169g.",
    "One notable omission from the Galaxy S21 compared to the S10 (and S20) models is the Bixby button. We don’t lament its passing, in truth. Samsung’s personal assistant has always felt rather superfluous, and so did having a dedicated button for it.",
    "The Samsung Galaxy S21 and the Samsung Galaxy S10 share similarly sized displays - 6.2-inches for the S21, 6.1-inches for the S10.",
    "Aside from this, and the fact that both use Samsung’s peerless AMOLED panel technology, there are a few interesting differences here. Would it surprise you to learn that the Galaxy S10 display is the sharper of the two, and by some way? It adopts a 1440 x 3040 or QHD+ resolution, while the newer S21 makes do with a mere 1080 x 2400 / FHD+ resolution.",
    "While the older phone can go much sharper, however, the newer handset can go much faster. With a 120Hz adaptive refresh rate, content on the Galaxy S21 has the potential to scroll past with literally double the smoothness of the Galaxy S10.",
    "Overall, we tend to think that this is a worthwhile trade-off, particularly with the knock-on effect to battery life. Sure, the Galaxy S21 Ultra can handle QHD and 120Hz simultaneously, but that has a much bigger display and battery, and it costs significantly more money.",
    "We prefer the Galaxy S20’s either/or option to both the S21 and the S10, however.",
    "We should also mention the S10 5G’s screen, which at 6.7-inches screen is significantly larger than both of the others. Other than size, it’s identical to the Galaxy S10 in terms of resolution and display properties.",
    "And what display properties they are for all three models. Samsung makes the best displays in the business, and indeed supplies those AMOLED beauties to many of its rivals. While the S21 is the best-calibrated screen here, all three phones benefit from HDR10+ support, vibrant (yet customizable) colors, deep blacks, and strong peak brightness.",
    "At the time of the S10’s release, it was crowned the most color accurate smartphone display ever. That’s remained true for every successive Galaxy S display, though technically the Galaxy S21 Ultra is the champ right now. You’re no longer getting Samsung’s absolute best in the plain Galaxy S, which might stick in some people’s craws.",
    "Each phone has an ultrasonic fingerprint sensor stashed underneath their display. None of these is lightening quick, but the Galaxy S21 speeds things up and expands the surface area by a considerable 70%, which makes for a much less authentication experience than with the Galaxy S10.",
    "Both of these phones pack triple-lens camera systems as standard, but the fine details show up some key differences that give the S21 a clear edge.",
    "The Samsung Galaxy S21 comes with a 12MP main unit, plus 64MP telephoto and 12MP ultra-wide. Around front there’s a 10-megapixel selfie cam.",
    "The Samsung Galaxy S10 features a 12MP regular lens, a 12MP telephoto and a 16MP ultra-wide. Like the S21, you get a 10-megapixel selfie cam up front.",
    "Interestingly, the Galaxy S10 5G model differs a little from its 4G brother. It’s a quad-camera setup, with the exact same sensors as the 4G model in addition to a Time of Flight (ToF) sensor for accurate depth sensing and enhanced AR.",
    "We mentioned that the S10 5G featured a longer, more intrusive display notch, and the reason for that is that it also packs a ToF camera up front. Not only does this bolster your selfie portraits, but it enables you to shoot Live Focus selfie videos. It’s quite impressive.",
    "In general shooting, the Galaxy S21 camera is the best here by quite some margin. This despite the fact that the hardware is pretty much identical to the S20 before it.",
    "Interestingly, some of the S21 hardware ostensibly appears to be a downgrade when compared to the S10. Besides the lower-resolution ultra-wide sensor, there’s the S10’s nifty f/1.5 + f/2.4 dual aperture, which can change to suit the lighting conditions. The S21’s main snapper is stuck in between with a fixed f/1.8 aperture.",
    "Look a little closer at the spec sheet, however, and you’ll see that the Galaxy S21 captures larger pixels - 1.8 microns rather than the S10’s 1.4 microns. Thanks to this, and Samsung’s improved algorithms, the S21 takes noticeably better shots in low light.",
    "Meanwhile, the Galaxy S21’s much denser 64MP telephoto sensor enables it to capture very effective 3x hybrid optical zoom shots.",
    "Samsung has also made some considerable video enhancements, including Director’s View, which grants you a live view of all three rear lenses at once and then enables you to jump between them. Vlogger View, meanwhile, lets you record video from the front and rear cameras simultaneously. Samsung’s Single Take feature has been improved for the S21 too, with better AI and a larger emphasis on slow-motion recording.",
    "As a result of these tweaks and changes, anyone graduating from the Galaxy S10 to the Galaxy S21 will see big improvements to their photography.",
    "Samsung’s approach to processor tech has become infamously fragmented over the years. And so we have a situation where the US and China versions of the Galaxy S21 and the Galaxy S10 are faster and more efficient than their International equivalents.",
    "The Galaxy S21 gets either Samsung’s own Exynos 2100 (for the International model) or Qualcomm’s Snapdragon 888 (for the US and China). Meanwhile both models of the Galaxy S10 get the same split between the Exynos 9820 and the Snapdragon 855.",
    "In both cases, it’s a little annoying to know that we in the UK are using an inferior version to our American cousins. Still, performance is roughly equivalent when it comes to processing power and battery efficiency, and you’ll struggle to tell the difference unless you whip out the benchmark tools.",
    "Talking of which, the Galaxy S21 scored 3367 on our Geekbench 5 multi-core test, while the Galaxy S10 5G scored a mere 2197. When you pitch the two devices against one another, all the aforementioned ambiguity goes out of the window. The Galaxy 21 quite clearly wipes the floor with the Galaxy S10, which is as it should be.",
    "The Galaxy S10 will still be able to run apps and intensive tasks quite capably, and Samsung’s legacy software support seems to have improved in recent times. But it’s still two years older than the Galaxy S21, and as such, it’s not going to feel fluid for as long.",
    "Both the S21 and the S10 come with 8GB of RAM as standard. In the case of the Galaxy S21, this is another way in which it’s actually stepped back from the Galaxy S20, which had 12GB.",
    "On the storage front, the Galaxy S21 technically loses out to its predecessor. While both come with 128GB as standard, you can only upgrade to a 256GB option with the newer phone. The Galaxy S10 offers a 512GB model. Meanwhile the S10 5G offers 256GB and 512GB variants.",
    "The Samsung Galaxy S21 would initially seem to be the clear winner in the stamina stakes. At 4000 mAh, its battery is much bigger than the 3400 mAh unit of the Galaxy S10.",
    "Add in the Galaxy S21’s more efficient Exynos/Snapdragon processor, and the fact that its display is only 1080p versus 1440p, and victory is seemingly assured.",
    "That’s not quite how it pans out. The S21 display’s 120Hz refresh rate evens things out significantly, even with its variable nature, which means that it can drop as low as 1Hz when the situation dictates.",
    "We generally found that the Galaxy S21 would easily last a full day on a single charge. But hitting the phone’s GPS signal and other power-hungry features can you running out of power just before bed time.",
    "All of which sounds spookily similar to our experience with the Galaxy S10, which would regularly got to the end of a day of moderate usage with around 20% left in the tank.",
    "It’s nip and tuck as to which is better. Basically, these are two all-day phones, as long as you don’t absolutely thrash them with constant media consumption, or leave Pokemon Go running constantly.",
    "One of the things that has the potential to sap the Galaxy S21’s battery a little faster is 5G connectivity, which isn’t something the stock Galaxy S10 has to deal with. There’s a reason the Galaxy S10 5G bumps the battery capacity up to 4,500 mAh. Even then, with the enhanced model’s big QHD+ display and less efficient processor, we were only able to get through a day of moderate usage on a single charge.",
    "Both the Galaxy S21 and the Galaxy S10 5G support 25W wired charging, which isn’t particularly fast in the grand scheme of things. Not when rivals like Oppo are hitting 65W. The stock Galaxy S10 is even slower at 15W.",
    "All three phones support similar 15W wireless charging and 4.5W reverse wireless charging, however, which is a decent provision.",
    "Samsung’s decision to make the Galaxy S21 more affordable makes for an interesting comparison to its two-years-older predecessor. The Samsung Galaxy S10 looks and feels more premium, and also trumps the S21 on display sharpness and storage options.",
    "When you factor the Galaxy S10 5G into the equation - in many ways a completely different phone to the plain S10 - things get even more interesting. This souped-up model has a larger display, bags of storage, a bigger battery and a few extra depth-sensing camera tricks up its sleeve.",
    "In every other way, however, the Galaxy S21 wins out. It’s much faster, its display and fingerprint sensor are more responsive, and its camera is comfortably better and more flexible than either S10 model.",
    "While Samsung might not have given us the very best Galaxy S21 that it could have, that two year gap is very real, and it’s simply a better phone the S10. It’s also available at a fairly competitive price by modern standards, partially neutralizing the Galaxy S10’s discounted price advantage."
  ],
  "headers": {
    "4": "Samsung Galaxy S21 vs Samsung Galaxy S10 price and availability",
    "8": "Design",
    "18": "Display",
    "27": "Camera",
    "38": "Specs and performance",
    "45": "Battery life",
    "54": "Takeaway"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S9": "https://www.techradar.com/reviews/samsung-galaxy-s9-review",
    "5G phones": "https://www.techradar.com/best/best-5g-phones"
  }
}