{
  "source": "https://www.techradar.com/news/nokia-to-issue-more-optimistic-2021-forecast",
  "title": "Nokia to issue more optimistic 2021 forecast",
  "category": "computing",
  "updated": "2021-07-13T09:22:15Z",
  "author": "steve-mccaskill",
  "summary": "Nokia's 5G efforts appear to be paying off",
  "article": [
    "Nokia says it expects to publish a revised, more optimistic forecast for 2021 in a sign that its turnaround programme under new CEO Pekka Lundmark is bearing fruit.",
    "The Finnish networking giant had warned investors to expect a “transitional” year as it did “whatever it takes” to win the 5G radio market.",
    "This warning was in place despite a stronger than expected final quarter of 2020.",
    "The company locked in a fiercely contested battle with other Network Equipment Providers (NEPs) such as Ericsson and Huawei. However, the company was surprised by the earlier-than-expected shift to 5G and has struggled with the high cost of developing 5G technologies.",
    "Lundmark was appointed as CEO last summer to remedy the situation and he initiated a major internal restructure that saw the company organised into four main business divisions - Mobile Networks, IP and Fixed Networks, Cloud and Network Services, and Nokia Technologies.",
    "In order to stay competitive, as many as 10,000 jobs were thought to be at risk as Nokia reset its cost base to redirect funds into R&D, future capabilities, and costs related to salary inflation.",
    "“We are progressing well with our three-phased plan to achieve sustainable, profitable growth and technology leadership,” declared Lundmark. “Our first half performance has shown evidence of this in good cost control and also benefited from strength in a number of our end markets. We continue to expect some headwinds in the second half as we have previously highlighted but our performance in the first half provides a good foundation for the full year.”",
    "The previous outlook of revenues between €20.6 billion and €21.8 billion will be revised on July 29."
  ],
  "headers": {
    "3": "Nokia job cuts"
  },
  "links": {}
}