{
  "source": "https://www.techradar.com/news/xbox-indie-games-showcase",
  "title": "New Xbox games: the biggest announcements from the indie showcase",
  "category": "gaming",
  "updated": "2021-03-26T19:23:02Z",
  "author": "vic-hood",
  "summary": "The biggest Xbox trailers and announcements",
  "article": [
    "The Xbox indie game showcase took place on March 26 and was packed full of new Xbox games landing in 2021 and beyond.",
    "Officially called /twitchgaming Showcase: ID@Xbox, the showcase was a collaboration between ID@Xbox (Microsoft's indie games program) and streaming platform Twitch and featured 100 games, with new trailers and gameplay for more than 25 titles.",
    "We've rounded up all the biggest announcements and trailers from the showcase below, as well as a list of the games confirmed to be hitting Xbox Game Pass on day one.",
    "Xbox Indie Showcase kicked off with a new trailer ExoMecha, a free-to-play online competitive first-person shooter. The trailer gave us a closer look at the frantic, multiplayer gameplay and is giving us major Titanfall meets Pacific Rim vibes.",
    "For Xbox Series X, the game will have a 4K high fidelity mode and a 120 fps mode. Exomecha will also feature crossplay, so you will be able to play with your friends from both Xbox One and PC. Releasing August 2021 for Xbox Series X/S, Xbox One and PC.",
    "The Ascent got a new trailer, giving us a closer look at the top-down arcade shooter's gameplay. The Ascent is a solo and co-op action RPG set in a \"cyberpunk world\". In this game, mega-corporation The Ascent Group has collapsed, and chaos has ensued. You need to work out what happened and try to stop gangs and hostile corporations from taking over.",
    "It's got some serious Cyberpunk 2077 vibes and is due to release in 2021 for Xbox Series X/S, Xbox One and PC (landing on Xbox Game Pass on day one)",
    "We also got a look at gameplay for Omno, an exploration game that sees you gliding across expansive deserts, solving puzzles in a minimalist style world. Coming sometime in 2021 to Xbox Series X/S, Xbox One, PS4 and Xbox Game Pass on day one.",
    "We already knew about The Wild at Heart, but Microsoft finally confirmed the game will release on May 20, 2021 during the indie game showcase. This exploration title sees you gliding across expansive deserts, solving puzzles in a minimalist style world. Currently confirmed for Xbox One and PC. It's coming Xbox Game Pass on day one.",
    "If you like something a bit weird then Voidtrain may be for you. There's a lot going on in the new trailer for Voidtrain but this first-person shooter sees you traveling between dimensions on a super train of sorts, gathering resources to upgrade your train and build better weapons. Available in single player, or in online multiplayer with up to four people. Due to release in 2022.",
    "Set in Canada, Moonglow Bay sees you playing as a rookie angler, coping with the death of your partner. Part fishing simulator part adventure game, Moonglow Bay sees you trying to uncover what happened to your partner while trying to help rebuild the dilapidated town. It looks like Minecraft mixed with The Touryst, with a big ol' dash of Stardew Valley, plus there's drop-in-drop-out local-play so you can play with friends. Coming to Xbox Series X/S, Xbox One and PC (plus Xbox Game Pass on day one) in 2021.",
    "Previously available on PC, Microsoft revealed Art of Rally is coming to Xbox consoles - though there's no official date. The colorful stylized racing game will be available on Xbox One, Xbox Series X/S and Xbox Game Pass on day one.",
    "Narita Boy is a stylistic, 2D side-scrolling combat game that sees you stepping into the shoes of Narita Boy, a legendary hero called upon to defend the Digital Kingdom. It's coming to Xbox One and PC (plus PS4 and Nintendo Switch) on March 30, 2021. It'll arrive on Xbox Game Pass on day one.",
    "We already knew Hello Neighbor 2 was on the way but this trailer gives us a better idea of what to expect from the stealth horror sequel. This time you play as a PI, who is looking into the disappearances of people from the neighborhood of Raven Brooks. You suspect Mr Peterson, the terrifying adversary from the original game, and aim to break into his house - but this time he's even more alert. The AI in Hello Neighbor 2 constantly evolves and learns from its experiences, so expect behavior changes as more people play the game.",
    "Hello Neighbor 2 is coming to Xbox Series X/S, Xbox One and PC. You can also play the Alpha right now.",
    "The Soup Pot is a cooking simulator game that is sure to make you hungry. You can discover and learn more than 100 recipes and cook all sorts of meals, using fresh ingredients and supermarket items. There's even the option to improvise while making the food. Soup Pot is coming to Xbox Series X/S, Xbox One and PC in August 2021.",
    "Rust is coming to Xbox One in Spring 2021 (between March and May). The Xbox indie game showcase gave us a look at what gameplay will look like on console.",
    "Demon Turf is a 3D platformer with attitude, which sees you playing as Beebz who is determined to take over the Demon Turfs and become the Demon Queen herself. Coming in 2021 to Xbox One, PC and Xbox Series X/S. The demo is available to play now.",
    "We got a closer look at the upcoming Chivalry 2, a multiplayer first-person slasher inspired by epic medieval movie battles. Chivalry 2 is coming to PlayStation 4, PC, PlayStation 5, Xbox Series X/S and Xbox One on June 8, 2021.",
    "Song of Iron is a side-action game about a lone warrior, who is the last of his people. The warrior sets off to find the gods so he can regain their favor and take his revenge. Coming to PC, Xbox Series X/S and Xbox One in mid-2021.",
    "A zen sci-fi game, Exo One sees you gliding around a stunning world as an alien craft. It's coming to Xbox One, Xbox Series X/S and PC in 2021.",
    "Nobody Saves the World is an action-RPG from the developers of Guacamelee and sees you exploring a vast overworld, beating back calamity and generally just saving the world. Transform into a ranger, a knight, and a horse in this madcap RPG. It's \"Coming soon-ish\" to Xbox One, Xbox Series X/S, Pc and Xbox Game Pass on day one.",
    "Announced at the showcase, Astria Ascending from Artisan Studios is a turn-based RPG with a beautiful, hand-drawn art style. It's coming to Xbox One, Xbox Series X/S, PC and Xbox Game Pass on day one in 2021.",
    "The Last Oasis released today and is a Nomadic Survival MMO. In Last Oasis you can build walking mobile bases to travel to new lands, join a clan and fight for your territory and scavenge resources. Available now on Xbox One and PC.",
    "Lost Eidolons is a tactical turn-based RPG that sees you playing as defamed mercenary Eden with the aim of reclaiming the war torn empire. Coming to Xbox consoles and PC in 2022.",
    "Yep. Lawn Mowing Simulator is what you would expect... a lawnmowing simulator. Releasing in 2022 for Xbox Series X/S, Xbox One and PC.",
    "Loot River is a rogue-like dungeon crawler featuring procedurally-generated labyrinths. The game features real-time combat with spatial block-shifting, allowing you to slide blocks of ancient ruins fight beasties, loot, explore, level-up and cast spells. Coming to PC, Xbox One and Xbox Series X/S at an unnanounced date.",
    "We got a closer look at the new airship map coming to Among Us sometime in early 2021. We know that Among Us is coming to Xbox sometime soon, but unfortunately still don't know exactly when.",
    "In Death's Door you play as a crow in a world where nothing dies naturally anymore. Crows are in charge of reaping the souls of the dead but when your assigned soul gets stolen, you get sent to a world where nothing has died for centuries to track it down - but things get a bit out of control. A hack n' slash dungeon crawler with light RPG elements, Death's Door is coming to Xbox X/S, Xbox One, and PC in \"Summer\" (so between May and July) 2021.",
    "A new trailer for Second Extinction gave us another look at the co-op cooperative shooter including a brief glimpse at some of the weapons we can expect to gun down dinos with. It also revealed that Second Extinction is coming to Xbox Game Pass and Xbox Game Preview on April 28, 2021.",
    "We are the Caretakers is sci-fi squad management RPG about protecting endangered animals and your planet from extinction. It's coming to Xbox One, Xbox Series X/S and PC \"soon\".",
    "This dev highlights video for S.T.A.L.K.E.R. 2 already aired earlier today, but gives us a look a closer look at the game's weapons and enhanced character models. There's also a special focus on character teeth. The game will launch on Xbox Game Pass on day one.",
    "We got a brief trailer for Twelve Minutes, an interactive thriller starring James McAvoy, Daisy Ridley and Willem Dafoe that sees you playing as a man stuck in a time loop he's trying to escape. It's \"coming soon\" PC, Xbox One and Xbox Series X/S.",
    "From Annapurna, The Last Stop looks reminiscent of Freaky Friday. The game focuses on John, Donna and Meena, whose worlds collide during a supernatural crisis. The game essentially acts as three stories in one. During the showcase we saw a fairly lengthy gameplay demo for the game that showed off The Last Stop's choice-based dialog system and quick-time events.",
    "Microsoft confirmed the following games will be available on Xbox Game Pass from day one:"
  ],
  "headers": {
    "3": "Exomecha",
    "5": "The Ascent",
    "7": "Omno",
    "8": "The Wild at Heart",
    "9": "Voidtrain",
    "10": "Moonglow Bay",
    "11": "Art of Rally",
    "12": "Narita Boy",
    "13": "Hello Neighbor 2",
    "15": "Soup Pot",
    "16": "Rust",
    "17": "Demon Turf",
    "18": "Chivalry 2",
    "19": "Song of Iron",
    "20": "Exo One",
    "21": "Nobody Saves the World",
    "22": "Astria Ascending",
    "23": "Last Oasis",
    "24": "Lost Eidolons",
    "25": "Lawn Mowing Simulator",
    "26": "Loot River",
    "27": "Among Us",
    "28": "Death's Door",
    "29": "Second Extinction",
    "30": "We are the Caretakers",
    "31": "S.T.A.L.K.E.R. 2",
    "32": "Twelve Minutes",
    "33": "The Last Stop",
    "34": "Xbox Game Pass"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Stardew Valley": "https://www.techradar.com/news/games-of-the-generation-stardew-valley-is-a-welcome-break-from-the-chaos-of-the-world",
    "play the Alpha": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3322389102580985300&murl=https%3A%2F%2Fwww.xbox.com%2Fen-GB%2Fgames%2Fhello-neighbor-2"
  }
}