{
  "source": "https://www.techradar.com/news/are-purple-iphone-12-deals-worth-it-or-should-you-wait-for-the-iphone-13",
  "title": "Are purple iPhone 12 deals worth it - or should you wait for the iPhone 13?",
  "category": "phones",
  "updated": "2021-05-20T17:10:08Z",
  "author": "alex-whitelock",
  "summary": "Damn purple iPhone 12, why you so nice looking?",
  "article": [
    "The launch of the iPhone 12 in purple so late in the product's life cycle has left a burning question in the mind of many an Apple fanatic - are purple iPhone 12 deals worth it right now or should I wait for the iPhone 13?",
    "Sure, the iPhone 12 in purple is a great new look for this device and one that's generating a lot of interest, but it's coming a full seven months after this device's initial launch. If the latest rumors are correct, the iPhone 13 could be coming as soon as September, so it's definitely worth considering all options on the table.",
    "To help out our Apple fans with a penchant for purple, we've rounded up the best iPhone 12 deals (in purple) just down below as well as everything we know so far about the iPhone 13. In short, details are really sketchy right now and promotions on the iPhone 12 are actually pretty strong, so it's not as easy of a decision as you might think...",
    "They're pretty damn great right now - especially if you happen to have a device ready to trade-in. Overall, we'd say these are the strongest set of iPhone 12 deals yet since launch, particularly the Verizon promotions since there's essentially two ways to bag yourself a free iPhone 12 right now.",
    "According to the latest iPhone 13 rumors, we're most likely looking at mid-September release date for the next iteration of Apple's flagship smartphones.",
    "As you'd imagine, concrete details are very thin on the ground right now, although rumors again suggest a fairly similar design overall with a few key internal upgrades - most likely a 120Hhz screen and bigger sensors for the cameras. Aesthetically, it could be that not much changes since the iPhone 12 itself had a pretty big facelift on release, although it's been suggested that the iPhone 13 could have a smaller rear camera housing bump.",
    "It could also be the case that the iPhone 13 is cheaper on release than the iPhone 12 since tech features like 5G capability have 'matured' now. Fingers crossed it'll debut at $699 this year instead of $599, although we of course expect the iPhone 12 to get a hefty price cut too when it's released - at least $100 at the official Apple store.",
    "Tough call. Apple really likes to hold back a few colors for later in a device's life cycle to generate a 'second-wave' of interest around the device. It did this very thing a couple of years ago with the iPhone 7 in ProductRed - a color that's now widely available on subsequent releases. Details on actual colors for the iPhone 13 are quite sketchy right now, although rumors have suggested there's going to be a new 'Matte black' color for the Pro models specifically. It's likely Apple could keep color options on the iPhone 13 pretty muted on release to give people a reason to still buy the iPhone 12.",
    "If you're absolutely besotted with the iPhone 12 in purple and happen to be eligible for one of the above iPhone 12 deals, then you shouldn't feel too bad about upgrading now. If you can wait until September and can stomach the thought of a more boring color, however, then it's probably worth it holding off until the iPhone 13 for now.",
    "It's also worth bearing in mind that the annual Memorial Day sales and even Amazon Prime Day are just around the corner now. To be honest, we cover these events every year and it doesn't tend to feature particularly good iPhone deals, although you never know - we could see a switch up at the Verizon or AT&T store pages over these events."
  ],
  "headers": {
    "3": "How good are these purple iPhone 12 deals?",
    "4": "What do we know about the iPhone 13?",
    "7": "Will the iPhone 13 be available in Purple?",
    "8": "So, should I wait or buy an iPhone 12 deal now?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "iPhone deals": "https://www.techradar.com/deals/iphone-deals"
  }
}