{
  "source": "https://www.techradar.com/news/hurry-the-all-new-apple-watch-7-gets-a-rare-price-cut-in-early-black-friday-deal",
  "title": "Hurry - the all-new Apple Watch 7 gets a rare price cut in early Black Friday deal",
  "category": "wearables",
  "updated": "2021-10-26T02:00:59Z",
  "author": "mackenzie-frazier",
  "summary": "Score an early Black Friday deal on the Apple Watch Series 7",
  "article": [
    "Black Friday deals on Apple's latest devices are typically reserved for the upcoming November sale, but we've just spotted a first-time price cut on the all-new Apple Watch 7. Right now, Amazon has the Apple Watch Series 7 on sale for $389.99 (was $399.99). That's the lowest price we've seen for the 41mm smartwatch and the best deal you can find right now.",
    "The all-new Apple Watch 7 was unveiled earlier this month and now includes a 70% brighter Always-On display, faster charging, and 20% more screen area, making it easier to use and read. The design also got a refresh with softer and more rounded edges and new sizes of 41mm and 45mm. The Apple Watch 7 still includes all the nifty features of the Series 6 smartwatch, such as blood oxygen monitoring, an ECG app, and activity tracking. While the $10 discount might not seem like much, deals on brand-new Apple devices are extremely rare and usually reserved for the official Black Friday 2021 sale. Today's early Black Friday deal applies to the Midnight Black sport band, and as of right now, it's currently in stock and ready to ship.",
    "Shop more offers with our roundup of the best Apple Watch 7 deals and learn about the upcoming Black Friday Apple Watch deals event. You can also see our guide to the best Black Friday Apple deals that are happening right now."
  ],
  "headers": {
    "1": "Apple Watch 7 deal",
    "2": "More Apple Watch deals"
  },
  "links": {
    "on sale for $389.99 (was $399.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-Watch-Midnight-Aluminum-Sport%2Fdp%2FB09HF7W3N6%2Fref%3Dsr_1_1_sspa%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1163468465090700500-20",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Apple Watch 7 deals": "https://www.techradar.com/deals/apple-watch-7-deals-sales",
    "Black Friday Apple Watch deals": "https://www.techradar.com/black-friday/black-friday-apple-watch-deals-sales",
    "Black Friday Apple deals": "https://www.techradar.com/black-friday/apple-black-friday-deals"
  }
}