{
  "source": "https://www.techradar.com/news/i-need-an-unbreakable-bluetooth-speaker-these-portable-party-prime-day-deals-are-the-answer",
  "title": "I need an unbreakable Bluetooth speaker – these portable party Prime Day deals are the answer",
  "category": "audio-visual",
  "updated": "2021-06-22T11:14:31Z",
  "author": "henry-st-leger",
  "summary": "These Prime Day Bluetooth speaker deals are shockproof, waterproof, and even party-proof",
  "article": [
    "Last week I broke my Bluetooth speaker. All it took was a moment, a careless slip of the hands, a one-meter jump to freedom on the hardwood floor – and the speaker was no more.",
    "I'd had my Pure DiscovR for near enough three years, after reviewing (and praising) the five-star Bluetooth speaker for its brilliant audio and sci-fi design – not least its privacy features like a physical mute function. But as an indoor speaker, and one not designed to bear the slings and arrows of outdoor use, it was only going to be so hardy in the long run.",
    "We're in the final phase of Amazon Prime Day, though, which means there are plenty of alternative Bluetooth speakers deals to consider – often on models that are shockproof (able to take a hit on a hard floor), as well as splash-proof or waterproof for surviving trips outside the living room.",
    "If you're taking a speaker to the beach, a pool, or even just a picnic, it can be reassuring to know that the speaker isn't more fragile than you are – and even if you're planning on keeping it indoors most of the time, you can rest easy knowing your Bluetooth speaker can handle being knocked off a shelf without immediately shutting down its operations for good.",
    "Scroll down for all of today's best Prime Day Bluetooth speaker deals in the UK, with some choice US deals listed below them.",
    "There's a big mix of price points above, but it's important to remember that you're getting an even bigger mix of specifications.",
    "The most expensive Bluetooth speakers might not be the hardiest, of course, and it's worth looking at what speaker best meets your needs. The Bose model above will likely be the best for sound quality outright, though others will feature longer battery life, or more advanced water resistance if you're thinking of taking your speaker poolside – or even into the pool with you.",
    "Check out some other Bluetooth speaker deals in your region below too:"
  ],
  "headers": {
    "5": "Prime Day Bluetooth speaker deals (US)"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}