{
  "source": "https://www.techradar.com/news/bose-quietcomfort-45-everything-we-know-so-far",
  "title": "Bose QuietComfort 45: everything we know so far",
  "category": "audio-visual",
  "updated": "2021-08-19T14:01:37Z",
  "author": "olivia-tambini",
  "summary": "Is Bose about to launch new noise-cancelling headphones?",
  "article": [
    "Audio giant Bose is reportedly on the verge of releasing its latest noise-cancelling headphones, the Bose QuietComfort 45. The new headphones have been the subject of rumor ever since an FCC filing was revealed in July, and since then, we’ve seen a number of high profile leaks that have shown us what the QuietComfort 45 will look like, and the specs we can expect to see when they launch.",
    "While Bose hasn’t confirmed the existence of the QuietComfort 45, it makes sense that the company would launch a new pair of noise-cancelling headphones in 2021. The previous model – the Bose QuietComfort 35 II – were released way back in 2017, and while there’s been a pair of true wireless earbuds launched in the QuietComfort range fairly recently (the excellent Bose QuietComfort Earbuds), we haven’t seen a brand new pair of over-ear QuietComfort headphones for quite some time.",
    "The Bose’s QuietComfort 35 headphones were some of the first to offer noise-cancelling at the kind of standard we’re used to today, and enticed a new market of commuters and office workers to try the technology.",
    "Bose has also seen success with its Noise Cancelling Headphones 700; a departure from the QuietComfort range, these strikingly designed wireless headphones proved that excellent sound doesn’t have to come at the expense of a sleek design.",
    "While Bose was among the first companies to bring active noise cancellation to the masses, its biggest rival, Sony, has been more successful in recent years; its current flagship cans, the Sony WH-1000XM4 are the best headphones you can buy today.",
    "Since the WH-1000XM4 launched in late 2020, few headphones have come close to beating them in terms of audio quality, noise cancellation, connectivity, and value for money. Will the Bose QuietComfort 45 finally unseat the don of consumer headphones? Only time will tell, but judging by the frequency of recent leaks, we won’t have long to wait.",
    "While there hasn’t been any confirmation from Bose on the existence of the QuietComfort 45 headphones, we think they’ll launch fairly soon.",
    "That’s because we’ve seen a number of high profile leaks recently, including an FCC filing and what appeared to be marketing images from the company itself.",
    "The new noise-cancelling headphones were even apparently leaked by US retailer Staples, in a listing that was swiftly taken down after being spotted by German website WinFuture.",
    "Previous models like the Bose QuietComfort 35 II have been released between June and October – and it could be that Bose is looking to follow suit with this new model, perhaps releasing it around when IFA 2021 would normally take place (the annual tech expo has been cancelled this year due to ongoing uncertainty around the pandemic).",
    "In any case, we’re expecting to see the Bose QuietComfort 45 before the year is out, and probably before the holiday sales period starts in November – and that means we could see some brilliant Bose headphones deals over Black Friday 2021.",
    "It’s rumored that the Bose QuietComfort 45 will cost $329, after a product listing was seemingly posted early – and swiftly retracted – by US retailer Staples (via WinFuture). That works out at around £240 / AU$460, though it’s important to remember that these prices could still change.",
    "That’s a little cheaper than their predecessors, the Bose QuietComfort 35 II, which were released in 2017 for $350 / £330 / AU$500. That’s cheaper than the Bose Noise Cancelling Headphones 700, too, which cost $399 / £349.95 / AU$599.95 at launch (though you can usually find them with a discount now that they’re a little older).",
    "So, how does that compare to other noise-cancelling headphones on the market? Well, our favorite pair (and the best headphones of 2021), the Sony WH-1000XM4, cost $349 / £349 / AU$549 when they launched in August 2020, though there are cheaper alternatives available. Models like the JBL Tune 750BTNC and the EarFun Air Pro are worth checking out if you’re on a strict budget.",
    "Can't wait for a Bose QuietComfort 45 release date? Check out the best Bose headphones deals below:",
    "We got our first look at the Bose QuietComfort 45 from an FCC filing, which showed that the headphones would have a similar design to their predecessors, with a generously padded headband, plastic housings, a foldable build, and swivelling earcups.",
    "We’ve since been given an even better peek at the new headphones after promotional material for the Bose QuietComfort 45 showed that they will come with a USB-C charging port, which replaces the outdated micro-USB port seen on the QuietComfort 35 II.",
    "There will also be a 3.5mm audio port and a cable included in the box, according to WinFuture.",
    "The images show the QuietComfort 45 in cream and black, though we’d expect to see a few more options available at launch; the previous model came in silver, and rose gold, as well as a few limited edition color schemes.",
    "According to the leaked Staples listing, the headphones will be “shockingly light” thanks to a mixture of synthetic leather and glass-filled nylon.",
    "Most of the Bose QuietComfort 45 specs that we know about so far have come from the Staples listing, which revealed that the headphones will come with active noise cancellation with an aware mode that mixes environmental sound into the headphones for times when you want to quickly tune into your surroundings.",
    "The noise cancellation should be very impressive indeed if it represents an improvement compared to the headphones’ predecessors – Bose, after all, is a market leader in the world of noise-cancelling headphones and earbuds.",
    "The listing also reveals that the headphones will feature Bose’s TriPort acoustic architecture – if this feature works in the same way as the Noise Cancelling Headphones 700, they’ll use external vents to increase the acoustic volume inside the earcups, which should make for a powerful sound without the need for a bulky build.",
    "We’re also expecting very good things in terms of audio performance. Both the QuietComfort 35 II and the newer Bose Noise Cancelling Headphones 700 offered a great level of detail and clarity.",
    "Although the battery inside the QuietComfort 45 is smaller than its predecessors (reduced from 495mAh to 460mAh), the battery life will reportedly be increased from 20 hours to 24 hours, with two-and-a-half hours of playback gained from a quick 15-minute charge. That extra four hours will definitely be appreciated, even if the Bose headphones won’t match rivals like the Sony WH-1000XM4 in terms of endurance.",
    "As for connectivity? WinFuture says the Bose QuietComfort 45 will come with Bluetooth 5.1, and will support multipoint pairing, which will allow them to be paired with two devices simultaneously."
  ],
  "headers": {
    "3": "Cut to the chase",
    "6": "Bose QuietComfort 45 release date",
    "11": "Bose QuietComfort 45 price",
    "15": "Bose QuietComfort 45 design",
    "20": "Bose QuietComfort 45 features"
  },
  "links": {
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "FCC filing was revealed in July": "https://www.techradar.com/news/bose-quietcomfort-45-headphones-revealed-in-fcc-filing",
    "Bose QuietComfort 35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "marketing images from the company itself": "https://www.techradar.com/news/bose-quietcomfort-45-headphones-leak-reveals-tried-and-tested-design",
    "WinFuture": "https://winfuture.de/news,124669.html",
    "IFA 2021": "https://www.techradar.com/news/ifa-2021-cancelled-due-to-global-health-uncertainties",
    "Bose headphones deals": "https://www.techradar.com/deals/the-best-cheap-bose-headphone-deals",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "JBL Tune 750BTNC": "https://www.techradar.com/reviews/jbl-tune-750btnc",
    "EarFun Air Pro": "https://www.techradar.com/reviews/earfun-air-pro"
  }
}