{
  "source": "https://www.techradar.com/news/the-best-air-fryer-is-still-at-its-lowest-price-ever-so-what-are-you-waiting-for",
  "title": "The best air fryer is still at its lowest price ever, so what are you waiting for?",
  "category": "appliances",
  "updated": "2021-06-22T08:39:55Z",
  "author": "sophie-bird",
  "summary": "Save a massive 35% with this Prime Day air fryer deal",
  "article": [
    "Some of the best Prime Day deals are still available, including this discount on our best air fryer, the Instant Vortex Plus. This air fryer was a complete game-changer for us, and it's still discounted to $64.95 from $99.99 at Amazon - the cheapest it’s ever been. (Not in the US? Scroll down to see the best air fryer deals in your region.)",
    "If you've not grabbed this deal yet, then it's time to get your skates on as it won't last forever.",
    "When we tested the Instant Vortex Plus, we were blown away by the results. Even though it uses little to no oil, we didn't have to put up with soggy fries and anemic-looking chicken wings - it turned out delicious crispy fries, with soft fluffy potato centers, and succulent juicy wings with crisp skin.",
    "This huge Prime Day air fryer deal means you can save 35% today, and believe us when we say that once you try the Instant Vortex Plus, you won’t want to go back to traditional frying ever again.",
    "Making fries in an oven gives you tasty results but it’s quite a time-consuming process - and then there's the mess to clean up after too. Peeling and chopping the potatoes, par-boiling them, coating them in low-calorie spray oil or olive oil, and turning them halfway through 30 minute cooking time all mounts up.",
    "We found that the Instant Pot Vortex Plus shaved 10-15 minutes off the prep and cooking time, and the frying basket that the fries cook in can simply be shaken to rotate the fries to ensure they’re crisp all the way around. The best bit? The results were extremely crisp and even - a better result than we could achieve in the oven. This is thanks to the use of hot air which circulates around the food. You only need a little oil - a 1.1lb / 500g batch of fries uses 2tsp of oil, which is considerably less than deep-frying.",
    "No matter where you live, you'll find all the lowest prices for the air fryers from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Prime Day air fryer deals in the UK",
    "6": "More air fryer deals",
    "7": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best air fryer": "https://www.techradar.com/news/best-air-fryer",
    "Instant Vortex Plus": "https://www.techradar.com/reviews/instant-vortex-plus-air-fryer-review",
    "$64.95 from $99.99 at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FInstant-Broiler-Roaster-Dehydrator-Reheating%2Fdp%2FB08R6KMBQT%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1270394828597937000-20"
  }
}