{
  "source": "https://www.techradar.com/news/home-depot-4th-of-july-sale-deals-2020-still-available-today",
  "title": "Home Depot 4th of July sale 2021: see the best deals still available today",
  "category": "news",
  "updated": "2021-07-05T10:09:08Z",
  "author": "alex-whitelock",
  "summary": "There are still quite a few Home Depot 4th of July sales still available today",
  "article": [
    "Even though the festivities have now officially come to a close, the Home Depot 4th of July sale is still available on quite a few items. If you're on the hunt for cheap appliances or yard items then you'll find a ton of great products still discounted in particular. Unfortunately, a lot of home decor items and furniture have returned to full price - although there are still options thanks to the ongoing 'summer savings' event. If you're interested, we've got a full roundup of the best Home Depot 4th of July sales still available just below.",
    "As you'd expect, it's prime time to refit your kitchen with cheap appliances or buy larger items for your yard - not just because there's a ton of discounts today, but also because Home Depot has a ton of great free delivery options. Of particular note is the large array of discounts on premium refrigerators, ranges, and freezers from leading brands like Samsung and LG - which are also subject to rebates of up to $700 when you buy in bulk.",
    "Of course, if you're simply looking for smaller items like home decor, furnishings, or things like power tools then you'll also find a ton of options in the Home Depot 4th of July sale. Just below is a quick roundup of the main categories on sale alongside the average savings. If you're looking for recommendations, then at the bottom of the page you'll find a couple of highlights that we've picked out for each category.",
    "Aside from the big savings, another good reason to check out these deals at Home Depot is the wide range of free delivery options - which applies to literally millions of items in their inventory. Normal items over $45 are all eligible for free delivery, as are all appliances over $396. Some items are even eligible for free two-day quick delivery, so keep an eye out on the individual product pages to see what's on offer.",
    "Many of these deals will be ongoing for a few more days as part of the Home Depot 'Summer savings' event. We have, however, seen a lot of deals sell out or go back up to full price already - so definitely don't hang around because you're already quite late to the party. For more last-minute deals, we recommend our main 4th of July sales hub, where you'll see the latest offers from Lowe's, Amazon, and Dell to name just a few."
  ],
  "headers": {
    "4": "Home Depot 4th of July sale 2021"
  },
  "links": {
    "rebates of up to $700 when you buy in bulk": "https://homedepot.sjv.io/c/221109/456723/8154?subId1=trd-us-5769125794790870000&sharedId=trd-us&u=https%3A%2F%2Fwww.homedepot.com%2Fc%2FAppliance_Savings",
    "4th of July sales": "https://www.techradar.com/deals/the-best-4th-of-july-sales-and-deals"
  }
}