{
  "source": "https://www.techradar.com/news/the-boys-season-3",
  "title": "The Boys season 3: cast, potential plot and what we know so far",
  "category": "entertainment",
  "updated": "2021-12-10T15:46:05Z",
  "author": "tom-power",
  "summary": "Get a look at Blue Hawk in The Boys season 3",
  "article": [
    "The Boys season 3 may have wrapped production a while ago, but news continues to be drip fed out to eagerly awaiting fans ahead of its official release. Not only have we received word of another spin-off show being in the works, but Amazon Prime's R-rated hit TV show has also given us our first-look at another new villain in Blue Hawk. You can learn more about these, as well as check out the latest 'Seven on 7' video, further down the page.",
    "That's not all that we know about The Boys season 3, however. The next instalment in the satirical superhero show doesn't have a launch date just yet, but there's plenty that we do know ahead of its arrival. If you're after more news on The Boys season 3, then, you've come to the right place.",
    "Below, we've compiled the very latest information on The Boys' third season on Amazon Prime Video. That includes its potential story threads, its growing cast, when we might see the series return to our screens, and much more. It all sounds completely diabolical, as a certain Billy Butcher would say.",
    "A word of warning before we begin: we'll be dealing with huge spoilers for The Boys seasons 1 and 2, as well as the graphic novels. So, unless you want to go into The Boys season 3 without having anything potentially ruined, you may want to turn back now.",
    "It wasn't a big shock to learn that The Boys season 3 was greenlit by Amazon. After all, according to Business Insider, The Boys became the first non-Netflix series to debut on Nielsen’s top streaming shows list. So clearly there's a massive audience for it, but you don't need us to tell you that.",
    "Regardless, per the International Alliance of Theatrical Stage Employees (IATSE) website, season 3 was scheduled to wrap in late August. Principal photography, though, didn't end up wrapping until mid-September. As Jack Quaid, who plays Hughie in the TV adaptation, revealed via Instagram, production ended on September 10.",
    "So when could The Boys season 3 arrive? Well, we'll need to see a trailer first (more on this in a moment), and we don't expect to see one before 2021 ends, either. If one drops in early 2022, The Boys' third season might launch in mid-2022.",
    "And it sounds like showrunner Eric Kripke wants it out as soon as possible. Taking to Twitter, Kripke revealed that picture editing was complete, but lots of VFX and music work was still required. It might be a number of months before season 3 is with us, then:",
    "No. Production has wrapped, but it'll be a while before one arrives. As soon as a teaser is revealed, you'll be the first to know.",
    "There are plenty of returning favorites for The Boys season 3:",
    "The Boys season 3 cast should also feature a few more returning characters, but there's no official word on whether they'll appear yet. That could include Laila Robins as ex-CIA Deputy Director Grace Mallory, Cameron Crovetti as Homelander and Becca's son Ryan Butcher and Giancarlo Esposito as Vought CEO Stan Edgar.",
    "As for new cast members, the biggest news is that Supernatural's Jensen Ackles (aka Dean Winchester) has been hired to portray Soldier Boy, the first ever Vought-manufactured superhero.",
    "We dive into what Soldier Boy's arrival could mean later on. For now, though, here's Ackles in his costume, complete with an R-rated tongue-in-cheek comment aimed at a specific Marvel supersoldier:",
    "In addition to Ackles' Soldier Boy, Deadline reports that Katia Winter (Blood & Treasure) has been cast as Little Nina. In the graphic novels, Little Nina is a Russian mob boss who has a penchant for sex toys, but we're still waiting on official confirmation from Amazon on her potential arrival.",
    "The Boys season 3 cast grew further in June 2021. Entertainment Weekly revealed that Sean Patrick Flanery, Nick Wechsler and Miles Gaston Villanueva have joined the show as Gunpowder, Blue Hawk and Supersonic respectively. Meanwhile, Variety announced that former Walking Dead star Laurie Holden joined as Crimson Countess.",
    "In early November, we received our first official look at Crimson Countess' costume via Holden's official Instagram page:",
    "And, in December, we received our first look at Weschler's Blue Hawk via his personal Instagram page. So we're just waiting on official looks at Villaneuva's Supersonic and Flanery's Gunpowder now from the new Supe line-up:",
    "Of the above quartet, only Crimson Countess and Gunpowder have appeared in the comics. Both could be described as villains – though such things are relative in The Boys universe – with Crimson Countess a riff on WandaVision’s Scarlet Witch, and Gunpowder a weapons expert. Interestingly, Gunpowder briefly appeared in a TV interview in The Boys season 1, though he was played by a different actor.",
    "Finally, Deadline has reported that Frances Turner (The Man in the High Castle) will portray Monique, the wife of Mother's Milk in season 3. Kristen Booth (The Hot Zone: Anthrax) and Jack Doolan (Marcella) will also appear as Supe siblings Tessa and Tommy, aka the TNT Twins.",
    "Spoilers follow for The Boys season 2 and the graphic novels.",
    "While season 2 wrapped up plenty of its plot threads, there are still some that need addressing.",
    "One of the biggest concerns Stormfront (Aya Cash), who was severely injured by Ryan Butcher in the season 2 finale. So far, Vought boss Stan Edgar has only suggested she's \"in a secure location\".",
    "Ahead of the show's return, though, it seems that Stormfront will appear in some form. According to a 'Seven on 7' YouTube video, which you can view below, she's still alive. A group of Stormfront loyalists, called the Stormchasers, have risen up since her accident, too, to carry on her racist vision of the future. So The Boys (and the world at large) will have to deal with them.",
    "Regardless, Stormfront’s diminished state means that there‘s a vacancy to join Homelander in the 'Big Bad' department. Now that Congresswoman Victoria Neuman has been outed as the Supe who explodes heads – as seen in season 2's final scene – she fits the bill.",
    "That means things could get bad for Hughie. As we've seen, The Boys have temporarily disbanded, with Hughie now working for Neuman. We don't know how long it'll be before Hughie realizes that his new boss is as bad as Homelander, or what Neuman's master plan is, but he'll find out soon enough.",
    "Meanwhile, Soldier Boy is primed to cause some chaos, and his graphic novel backstory hints at some really mature content that's likely to appear in the TV adaptation. In the comics, there are two versions of Soldier Boy, with the show likely introducing the first generation's version.",
    "Soldier Boy is a Supe who becomes a US icon during World War II, but his backstory isn't as honorable as the general public think. He ends up killing his fellow Supes, as well as US soldiers, during one specific mission. Lieutenant Greg Mallory, whose gender has been changed for the TV show, kills Soldier Boy in the comics as recompense. However, given that this Soldier Boy is alive and well in the TV universe, his backstory and character arc need to be altered.",
    "The arrival of Soldier Boy also ushers in the the introduction of another superhero group – Payback. Dubbed the \"second most popular superhero team\" behind The Seven, Payback are the team led by, in the comics at least, the second iteration of Soldier Boy. Stormfront is also a member of this unit, so her live-action counterpart already has ties to the TV show's version of Soldier Boy.",
    "Season 3's first episode is titled 'Payback' – as revealed by Eric Kripke on Twitter. This might be a subtle tease about how Homelander plans to exact revenge on certain individuals, but it's more likely to hint at Payback's arrival.",
    "If it does, we could get a flashback episode introducing Soldier Boy and his backstory. That may lead nicely into The Boys season 3's main plot, and also act as a novel way to open The Boys' next instalment with a bunch of new Supes.",
    "Kripke has also elaborated on how Soldier Boy may fit into The Boys season 3. Speaking to Deadline in June 2021, Kripke said: \"A big element of the comics actually are flashbacks to World War II and Vietnam. I always really loved it because you got to see how the superhero phenomenon didn’t just affect the present, but how it affected parts of the past as well.\"",
    "Soldier Boy's appearance will also introduce one of the graphic novels' most shocking storylines: Herogasm, which sees Vought's superhero line-up travel to a remote tropical island to engage in a massive, secret company-organized orgy.",
    "At the time of publication, Herogasm was considered to be the most controversial moment in the entire series. It contains one particular scene involving Homelander and Soldier Boy having sex, but The Boys season 3 won't include this particular sequence, as Kripke confirmed in October 2020:",
    "Kripke has since teased Herogasm's sequence, saying that filming it was the \"craziest dailies\" that he'd ever seen. Speaking to Vanity Fair, Kripke doesn't think that anything else that he films (for the TV adaptation) will ever top it.",
    "While there will be plenty of risqué moments in The Boys season 3, there will also be plenty of blood, gore and violence. Speaking to Collider about the show's production, Laz Alonso (Mother's Milk) revealed that it'll be the bloodiest season yet. Alonso's comments were backed up by Jack Quaid, who told Inverse that \"no one is okay\" is the show's next instalment.",
    "There are other less important plot points that need some form of resolution in The Boys season 3.",
    "Compound V – the substance that gives people superpowers – isn't being released to the general public anymore. It'll be interesting to see if this is the first and last time that it'll be offered out, or if it'll still fall into the wrong hands and lead to the emergence of new supervillains.",
    "Additionally, there's bound to be more infighting among The Seven. A-Train and Starlight have been readmitted to the team, but The Deep hasn't. Homelander is still a member, so no doubt he'll be gunning for Starlight. Add in the fact that Black Noir is in a vegetative state after suffering a peanut allergy in season 2, and Queen Maeve's presence in The Seven, and things could get ugly fast.",
    "We should find out more about other superpowered beings. Cindy, the telekinetic individual who broke out of the Sage Grove testing facility, was last seen hitchhiking towards an unknown destination. And we need to find out what happened to Love Sausage – yes, the guy with the abnormally long penis (played by Andrew Jackson) who attempts to strangle Mother's Milk at the testing facility. Kripke has teased that Love Sausage may appear, but we'll have to wait and see.",
    "The new season may also be taking a note out of Avengers: Endgame's book and jumping forward in time. Per on set photographs, The Boys season 3 may occur in 2024, judging by a poster where real-life Senator Ted Cruz is making a presidential run:",
    "Speaking of politics, Kripke hasn't been shy in saying that season 3 will focus on how The Boys reflects present day (and historical) America, among other themes.",
    "\"In the third season, we got interested in the history of the Vought universe and its fractured reflection of the United States,\" he told THR. \"It’s like how people say that there are “good old days” and that somehow there’s some sort of past that we need to be great again and return to.",
    "\"Make America great again for who exactly? [In] Soldier Boy... we’re able to delve into issues as disparate as toxic masculinity and racism and some of the wars we’ve been through. We’ve been able to explore not just the here and now but the past — and that’s exciting.\"",
    "To tide fans over until season 3's arrival, a YouTube tie-in series covers the wider Boys universe in more general terms.",
    "'Seven on 7' with Cameron Coleman is a news-style episodic miniseries that bridges the gap between seasons 2 and 3. Starring Matthew Edison as the titular news anchor, it's broadcast on the fictional Vought News channel and details the latest news surrounding the world's greatest superhero group, as well as secondary Supes and other important characters.",
    "Speaking to The Wrap, Kripke said 'Seven on 7' is \"all real, canon stuff\", so it'll contain interesting snippets for fans to keep abreast of ahead of season 3. Check out the first six episodes below:",
    "Kripke has revealed that he's planned for five seasons. However, he also teased the prospect of more instalments in October 2020:",
    "It's unsurprising, seeing as Supernatural – the show that made Kripke's name – was originally supposed to run for five seasons, but ended up making it to 15.",
    "Kripke may decide, then, that The Boys needs more time to wrap up its story. There are 72 issues of Ennis and Robertson's comics and, while the TV show has gone in its own direction story wise, there's enough plot left to tell for at least three or four seasons.",
    "Besides, assuming audiences continue to watch The Boys, Amazon is likely to keep renewing its biggest TV show for as long as possible. In other words, you can bet on The Boys running for a number of seasons yet.",
    "Regardless of how the main series runs for, The Boys universe is here to stay. We're getting two spin-off shows in the future: The Boys: Diabolical, which will be an R-rated animated anthology series, and an unnamed live-action, Hunger Games-style TV show that'll follow a bunch of college age Supes as they look to graduate from the only Supe-oriented school in the US. Given how enjoyable The Boys, we're all for more projects in this world."
  ],
  "headers": {
    "4": "The Boys season 3 release date: 2022?",
    "8": "The Boys season 3 trailer: is there one?",
    "9": "The Boys season 3 cast: who's returning and who's new?",
    "19": "The Boys season 3 plot: what can we expect?",
    "43": "The Boys season 3: YouTube miniseries bridges the gap between seasons 2 and 3",
    "46": "The Boys season 3: how many seasons will there be?"
  },
  "links": {
    "another spin-off show": "https://www.techradar.com/news/the-boys-is-getting-another-spin-off-and-it-lands-next-year",
    "Amazon Prime": "https://www.techradar.com/reviews/amazon-prime-review",
    "Business Insider": "https://www.businessinsider.com/nielsen-viewership-data-amazons-the-boys-a-major-hit-2020-10?r=US&IR=T",
    "website": "https://www.iatse873.com/current_productions",
    "Deadline": "https://deadline.com/2021/06/eric-kripke-the-boys-amazon-prime-magazine-emmy-1234778805/",
    "Entertainment Weekly": "https://ew.com/tv/the-boys-casts-three-new-superheroes-meet-supersonic-blue-hawk-gunpowder/",
    "Variety": "https://variety.com/2021/tv/news/the-boys-season-3-cast-laurie-holden-1235005314/",
    "WandaVision": "https://www.techradar.com/news/wandavision-season-2-what-we-know-after-the-finale",
    "Twitter": "https://twitter.com/therealKripke/status/1316423642125725696",
    "Vanity Fair": "https://www.vanityfair.com/hollywood/2021/08/awards-insider-eric-kripke-the-boys-interview",
    "Collider": "https://collider.com/the-boys-season-3-blood-jensen-ackles-laz-alonso-interview/",
    "Inverse": "https://www.inverse.com/entertainment/jack-quaid-interview-boys-season-3-lower-decks-season-2",
    "may appear": "https://ew.com/tv/the-boys-season-2-finale-twist/",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/the-boys-showrunner-on-pressures-of-adapting-supehero-genre-satire-1234996471/",
    "The Wrap": "https://www.thewrap.com/the-boys-season-3-herogasm-spinoff-supe-college-seven-on-7-digital-series-eric-kripke/",
    "The Boys: Diabolical": "https://www.techradar.com/news/the-boys-is-getting-another-spin-off-and-it-lands-next-year",
    "unnamed live-action, Hunger Games-style TV show": "https://www.techradar.com/news/the-boys-is-getting-a-hunger-games-style-spin-off-show"
  }
}