{
  "source": "https://www.techradar.com/news/mclarens-new-205mph-supercar-is-actually-a-plug-in-hybrid-and-its-had-a-tech-overhaul",
  "title": "McLaren's new 205mph supercar is actually a plug-in hybrid – and it's had a tech overhaul",
  "category": "car-tech",
  "updated": "2021-02-17T12:10:59Z",
  "author": "axel-metz",
  "summary": "Beauty outside, brains inside",
  "article": [
    "McLaren has announced its latest plug-in hybrid (PHEV) supercar, the Artura, and it's packed to the rafters with tech.",
    "It's the company's first PHEV since the limited-production McLaren P1, which launched back in 2012, and ditches almost every facet of its V8-engine models in favor of an all-new design and internals that reflect the era of electrification.",
    "Being a PHEV means the Artura uses batteries to power an electric motor alongside conventional fuel to power an internal combustion engine (ICE).",
    "It's not as nuts as the P1 – a 217mph hypercar you'd struggle to pick up nowadays for less than $1.5 million – but the Artura still packs a punch with a 0-60mph acceleration of just 3 seconds and a top speed of 205mph, thanks to a 671bhp twin-turbo V6 engine and 92bhp electric motor.",
    "It’s also considerably less expensive than its older brother at £182,500 (around $250,000 or AU$ 330,000). We wouldn't be as bold as to say that's a reasonable price, but for a brand with the billionaire pedigree of McLaren it's certainly not the choke-inducing price tag we've come to expect of its supercars.",
    "The Artura is pretty light, too, weighing just 27kg more than a 720S, especially impressive considering its powertrain features both an ICE and a 7.4kWh battery.",
    "That's largely thanks to McLaren's all-new ultra-light chassis – made from McLaren Carbon Fibre Lightweight Architecture (MCLA) – which allows for a roomier cabin yet a shorter wheelbase than most of its other cars. It's final weight is 1,498kg – that's almost a tonne less than a Bentley Continental GT, for comparison.",
    "The hybrid nature of the Artura means it can cruise for up to 19 miles in a pure EV electric vehicle) mode thanks to the battery, and its combined fuel economy exceeds 50mpg - although with all that power underfoot, you'll need to be feather-light with your input to keep things ecnomical.",
    "That's not ground-breaking numbers for a PHEV – 19 miles might get you to the shops and back – but it's likely McLaren is saving the more impressive battery-powered figures for its in-development all-electric GT, scheduled to arrive in 2025.",
    "As we've come to expect from McLaren, the Artura is a candy store of fancy technology.",
    "Standard fare gizmos like adaptive LED headlights, cruise control, autonomous emergency braking, road-sign recognition and lane departure warnings all feature here, while more geeky elements – like tires that contain chips which tell the car its optimum temperature, pressure and safety settings – make the Artura feel like a very new-generation PHEV.",
    "Inside, engineers have worked hard to improve noise, vibration and harshness levels, and the car is now capable of engine-off running (a feature not typical of the manufacturer). McLaren says the Artura will be quiet when cruising, but that drivers can expect a roaring soundtrack at high speeds.",
    "Perhaps most interesting is its smartphone-like, vertically-oriented screen unit, angled towards the driver to complement a new and improved infotainment system in the narrow centre console - something previous McLarens have fallen down on.",
    "Major controls, including the chassis and powertrain modes, are now controlled via fingertip buttons that can be easily operated without a driver's hands leaving the wheel.",
    "All in all, then, the McLaren Artura looks set to offer drivers a unique alternative to the more conventional supercars on the market. It's not cheap, of course, but at least it's no P1."
  ],
  "headers": {
    "9": "Gadgets galore"
  },
  "links": {
    "Bentley Continental GT": "https://www.techradar.com/news/bentley-continental-gt"
  }
}