{
  "source": "https://www.techradar.com/news/how-to-watch-the-shrink-next-door-online-on-apple-tv-plus",
  "title": "How to watch The Shrink Next Door online on Apple TV Plus",
  "category": "computing",
  "updated": "2021-11-12T06:30:30Z",
  "author": "daniel-pateman",
  "summary": "Paul Rudd and Will Ferrell delight in this dark comedy miniseries",
  "article": [
    "Will Ferrell and Paul Rudd exhibit a wildly unhealthy attachment style in the new comedy drama from Apple TV Plus. Based on the popular 2019 podcast from Wondery, which detailed the true story of a psychiatrist who inveigled his way into a patient’s life over three decades, this 8-part miniseries looks set to be a darkly compelling hoot. We’ll detail below how to watch The Shrink Next Door online with a subscription to Apple TV Plus.",
    "Adapted by Michael Showalter and written by the multi award-winning Georgia Pritchett (HBO’s Succession), The Shrink Next Door stars Ferrell as “Marty” Markowitz, a kind but eager-to-please business owner running his dead parent’s fabric company, who’s recommended to Dr Isaac “Ike” Herschkopf (Rudd) by his sister Phyliss after one too many breakdowns.",
    "Ike’s methods prove to be incredibly successful, and the encouraging but overfamiliar doctor becomes a fixture in Marty’s life, his “Psychiatrist, Business Partner, and Best Friend”. At best their relationship is considered unprofessional, eliciting concerned comments from Ike’s own wife Bonnie. At worst, it allows Ike to control Marty’s life and coerce him into doing all sorts of unfathomable things.",
    "Ferrell and Rudd prove a compelling double act, while Kathryn Hahn (WandaVision, Transparent) is typically excellent as Marty’s suspicious sister. So, if you like dark, character-driven dramas, lay back on your chaise longue and prepare to be stunned, as we explain how to watch The Shrink Next Door online with an Apple TV Plus subscription.",
    "While Apple's answer to Netflix has a comparatively tiny library of films and shows to get stuck into – 80 and counting – what's available is top-notch, well-produced fare with little in the way of filler.",
    "The Morning Show was the calling card for Apple TV Plus at launch, costing $15 million per episode. It was complemented by the epic sci-fi drama See starring Jason Momoa, space drama For All Mankind, and period comedy Dickinson. Following this was exciting new programming like M. Night Shyamalan’s moody horror series, Servant, and the experimental thriller Calls.",
    "Of course, the service's breakout hit has been the Jason Sudeikis comedy Ted Lasso, following the titular American football coach hired to manage a Premier League football team. It's earned an army of fans and a impressive amount of awards attention, netting 20 Primetime Emmy nominations this year – a record for a freshman series.",
    "The small but great library is set to grow at a steady pace - alongside recent seasons of Ted Lasso and The Morning Show, Apple TV Plus looks to have a pretty strong-looking upcoming schedule of new exclusive content.",
    "The Martin Scorsese-directed Killers of the Flower Moon, promises a 'large-scale Western' that stars big guns Leonardo DiCaprio and Robert De Niro.",
    "The Tragedy of Macbeth, meanwhile, will premiere on the streaming service on January 14, 2022. It's a pared back, black-and-white film version of the classic Shakespeare play, adapted by Joel Coen and starring Denzel Washington. And viewers are invited to watch The Afterparty that same month: a murder mystery comedy set at high school reunion, with each episode depicting events from another character's perspective. It'll feature a brilliant bevvy of stars, including Tiffany Haddish, Dave Franco, Broad City's Ilana Glazer, Sam Richardson, Ben Schwartz and more.",
    "Read more:"
  ],
  "headers": {
    "4": "What else should I know about Apple TV Plus?"
  },
  "links": {
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "subscription to Apple TV Plus": "https://tv.apple.com/channel/tvs.sbd.4000?at=1001l369U&ct=trd-us-7973138282282310000&itscg=30200&itsct=Future_TV",
    "Succession": "https://www.techradar.com/news/where-to-watch-succession-season-3-online",
    "Apple TV Plus subscription": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9521262327870405000&sharedId=trd-us&u=https%3A%2F%2Ftv.apple.com%2Fgb%3Fctx_brand%3Dtvs.sbd.4000%26l%3Den",
    "Ted Lasso": "https://www.techradar.com/news/how-to-watch-ted-lasso-season-2-online-stream-the-apple-tv-plus-series-now"
  }
}