{
  "source": "https://www.techradar.com/news/why-the-canon-eos-r3-marks-the-end-of-canon-dslrs",
  "title": "Why the Canon EOS R3 marks the end of Canon DSLRs",
  "category": "cameras",
  "updated": "2021-07-01T20:38:50Z",
  "author": "mark-wilson",
  "summary": "A symbolic changing of the photographic guard",
  "article": [
    "Every so often in tech there's a changing of the guard, a symbolic passing of the baton, from one technology to the next – and the Canon EOS R3 is that moment for its DSLRs.",
    "The EOS R3 is currently only a 'development announcement', but we know enough about the mirrorless flagship – including its 30fps burst shooting powers – to get a sense of what kind of camera it is.",
    "And that's a camera that will put a final lens cap on Canon's DSLR cameras, consigning them to a role as background bokeh balls rather than photographic focal points.",
    "Today's Canon DSLRs will continue to be trusty companions that are cherished by many, and rightly so. But the photographic world has moved on, and the EOS R3 is significant because it pushes the last remaining DSLR die-hards – pro sports snappers – emphatically towards the fully digital experience of mirrorless cameras.",
    "And for Canon's DSLRs, there's no going back from here.",
    "Before we zoom into the why the Canon EOS R3 is so significant, it's worth stepping back to see the big picture.",
    "Canon DSLRs (or Digital Single Lens Reflex) have been around for over 20 years. They started in 2000 with Canon's first entirely self-made DSLR, the Canon EOS D30, which followed some earlier toe-dipping ventures with Kodak.",
    "Cameras like the EOS D30, quickly followed by landmarks including the Canon EOS-1D (its first pro DSLR) and Canon EOS-1Ds (its first full-frame DSLR), took the baton of innovation from its 35mm film cameras, which kicked off the Canon EOS range in 1987.",
    "The big SLR-to-DSLR shift took place in 2005, after which all new EOS cameras used digital sensors rather film ones. And the arrival of the new Canon EOS R3 means we may well see 2021 as a similar inflection point – after which all new cameras were mirrorless rather than DSLRs.",
    "But why? After all, some photographers – including the pro sports snappers the EOS R3 is aimed at – would argue that mirrorless cameras aren't an inherently better technology than DSLRs, and in a few crucial ways even inferior.",
    "While there is some truth to this, the reality for camera manufacturers in 2021, even giants like Canon, is that they're in a fight for survival. And the biggest guarantee of thriving in the next two decades is moving exclusively to mirrorless.",
    "Mirrorless cameras differ from DSLRs in a few crucial ways. Our 'Mirrorless vs DSLR' guide goes into detail on the big technical differences, but the fundamental one – which has many knock-on effects – is their approach to viewfinders.",
    "DSLRs contain a mirror, angled at 45 degrees, that reflects light from the lens directly into your eye through an optical viewfinder. Mirrorless cameras don't have this mirror (hence the name), instead sending the light directly onto an image sensor and displaying the scene in an electronic viewfinder (EVF).",
    "This approach brings a few advantages to mirrorless cameras, one of which is size – without a clunky mirror that needs to be flipped up every time you press the shutter, they're generally smaller than DSLRs. Except the new Canon EOS R3, which is huge and significantly bigger than stablemates like the Canon EOS R5.",
    "Why is the EOS R3 so big? Because it's designed for professional sports photographers, who prize two traditional DSLR hallmarks: great handling and long battery lives. If, as expected, the Canon EOS R3 deliver the goods on both of those things, it should finally convince DSLR-clutching sports snappers to switch to mirrorless.",
    "But it's not quite as simple as that. As Canon told us in 2020 at the launch of its last (and surely final) professional DSLR, the Canon EOS 1D X Mark III, sports photographers have another reason for sticking to their trusty DSLRs: viewfinder lag.",
    "In short, electronic viewfinders will always have a minuscule lag compared to a DSLR's optical viewfinder, because the latter reflect light from the scene directly into your eye, rather than via circuitry. The question is whether EVFs have now reached the point of 'good enough' even for sports photographers – and the arrival of the Canon EOS R3 suggests they have.",
    "We don't yet have any exact details about the Canon EOS R3's electronic viewfinder. But it'll likely be the best one seen on any Canon camera so far, with the camera giant telling us it'll offer an \"optical viewfinder experience\". That likely means a 240fps refresh rate and almost non-existent lag.",
    "The specs we do know about are also pretty mouth-watering for pro action photographers. The R3 will be the first EOS camera to feature a new Canon-made, back-illuminated stacked CMOS sensor. Canon says this will \"achieve next-level, high-speed photography and filmmaking\". It'll also support incredible 30fps burst shooting with AF/AE tracking, another step up from the 1D X Mark III's max of 20fps.",
    "In some ways, the Canon EOS R3's new Eye Control Function – which lets you move the AF point around the viewfinder using your eye – is a timely, symbolic nod to its DSLRs. We last saw this feature on the Canon EOS 3 back in 1998. You could say it's a bit like NASA's decision to equip its Ingenuity drone, due to take off on Mars any day now, with a small piece of fabric from the Wright brothers' first plane.",
    "So the Canon EOS R3 is undoubtedly shaping up to be the best sports camera that Canon has ever made. It'll be a step up from the Canon EOS R5, a camera that eclipsed the Canon 1D X Mark III DSLR in almost every respect. But the camera itself is only half the story. There is one other big reason why mirrorless trailblazers like the EOS R3 mean the end for new DSLRs: lenses.",
    "All of the big camera manufacturers, including Canon and Nikon, say that their new mirrorless lens mounts allow them to make better lenses than their DSLR counterparts.",
    "And there are good reasons for this. The shorter flange distances (the space between the lens mount and camera sensor) and wider diameters of the new Canon RF and Nikon Z lens mounts help them create a larger 'angle of incidence'. The larger this is, the easier it is to make high-performing lenses.",
    "That's why Canon has been exclusively focused on making new RF lenses for its mirrorless cameras, rather than updating its older EF lenses for DSLRs. There's simply no incentive for it to refresh, or in some cases even continue manufacturing, EF lenses.",
    "We've recently seen strong rumors suggesting that Canon has just discontinued as many as 24 EF lenses. When we asked Canon if this was true, it told us: \"We have a diverse collection of EF lenses available and will continue to manufacture and market them where there is customer demand.\"",
    "So not only are there no new lenses coming out for Canon DSLRs, it's possible that many current ones won't be available to buy (new, at least) in the near future either. Some current Canon DSLR owners may be okay with that, but the focus motors in older lenses simply can't keep pace with the latest autofocus systems.",
    "For cutting-edge performance and lenses, then, we're now at the point where there's simply no choice but to upgrade to mirrorless cameras like the Canon EOS R3.",
    "Professional sports cameras were really the last hold-out for DSLRs – but the imminent arrival of the Canon EOS R3 means their time is now up.",
    "Of course, today's existing Canon DSLRs – like the Canon EOS Rebel SL3 / 250D and mid-range Canon EOS 90D – will continue to be reliable photographic workhorses and offer decent value for hobbyists. But the EOS R3 is the death knell for hopes of any new Canon DSLR launches.",
    "With increasingly strong rumors about many EF lenses being discontinued, it feels like 2021 is shaping up to be another handover year – just like 2005 was between Canon's film and digital cameras.",
    "That's a slight shame for those who value choice, but the sharp decline in camera sales in the last decade – as much as 87%, according to CIPA figures – means that Canon simply can't justify developing two separate lens and camera systems: its mirrorless RF mount and DSLR-friendly EF mount.",
    "The fact that this involves tempting photographers to upgrade their existing lens collection to an entirely new one is, of course, a big bonus for camera manufacturers. But for photographers, it's no longer just the case that the future is mirrorless – with the arrival of the EOS R3, new Canon DSLRs are also now almost certainly a thing of the past."
  ],
  "headers": {
    "5": "Wide-angle view",
    "11": "One-way mirror",
    "17": "Best of both?",
    "21": "Glass ceiling",
    "27": "Final fight"
  },
  "links": {
    "Canon EOS R3": "https://www.techradar.com/reviews/canon-eos-r3",
    "Canon EOS-1Ds": "https://www.techradar.com/reviews/cameras-and-camcorders/cameras/digital-slrs-hybrids/canon-eos-1ds-mk-ii-60823/review",
    "full-frame DSLR": "https://www.techradar.com/news/best-full-frame-camera",
    "Mirrorless vs DSLR": "https://www.techradar.com/news/mirrorless-vs-dslr-cameras",
    "Canon EOS R5": "https://www.techradar.com/reviews/canon-eos-r5",
    "Canon EOS 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "Canon 1D X Mark III": "https://www.techradar.com/reviews/canon-1dx-mark-iii",
    "discontinued as many as 24 EF lenses": "https://www.techradar.com/news/canon-just-discontinued-a-load-more-ef-lenses-for-its-dslr-cameras",
    "Canon EOS Rebel SL3 / 250D": "https://www.techradar.com/reviews/canon-eos-rebel-sl3-eos-250d",
    "Canon EOS 90D": "https://www.techradar.com/reviews/canon-eos-90d",
    "CIPA figures": "https://www.statista.com/chart/5782/digital-camera-shipments/"
  }
}