{
  "source": "https://www.techradar.com/news/this-iconic-gaming-console-wants-you-to-work-while-playing",
  "title": "This iconic Atari gaming console could help you to work while playing",
  "category": "computing",
  "updated": "2021-10-08T09:35:28Z",
  "author": "anthony-spadafora",
  "summary": "The Atari VCS can now run Google Workspace apps",
  "article": [
    "Atari has announced that its Atari VCS console now supports Google Workspace, meaning gamers also now have the option to work as well as play on its small form-factor PC.",
    "With the addition of Google Workspace, Atari VCS owners can now easily access Gmail, Google Calendar, Sheets, Slides, Docs and Google Drive all from their living room in between play sessions.",
    "Google's online collaboration software can be accessed right from the Atari VCS dashboard and users can make changes to their documents using either the Atari VCS Companion app or a mouse and keyboard.",
    "However, if you want a full PC experience on the Atari VCS, the console's PC mode allows you to install Windows 10 or Linux and while unconfirmed by Atari, several users have even managed to get Windows 11 up and running on the device.",
    "As the Atari VCS is the only video gaming system with Chrome built-in, it's a true two-in-one device that can be used for both work and play. The system also features a compact chassis that can be tucked away in an entertainment center under your TV or set up on your office desk without taking up too much space.",
    "In terms of the device's hardware, the Atari VCS features an AMD Raven Ridge 2 APU, an AMD Ryzen GPU, 32GB of eMMC storage and 8GB of DDR4 RAM. However, the RAM is upgradeable and thanks to the inclusion of an internal M.2 slot, you can add a larger M.2 SSD for even more storage.",
    "The Atari VCS is available in two configurations: the Atari VCS Onyx Base System for $299 and the Atari VCS Black Walnut All-In Bundle for $399. Since the device supports a wide range of existing controllers including Microsoft's Xbox controller and both Sony's DualShock and DualSense controllers, you can save a bit by opting for the base model though you will miss out on using Atari's new Classic Joystick.",
    "Whether you just want to play some retro video games in your living room or are looking for a game console with Google Workspace support and full PC functionality, check out our full Atari VCS review to see if Atari's latest console could be the perfect work from home device for you."
  ],
  "headers": {
    "4": "Work or play"
  },
  "links": {
    "Atari VCS": "https://www.techradar.com/reviews/atari-vcs",
    "Google Workspace": "https://www.techradar.com/reviews/google-workspace",
    "small form-factor PC": "https://www.techradar.com/best/best-thin-client",
    "Gmail": "https://www.techradar.com/reviews/google-gmail",
    "Google Calendar": "https://www.techradar.com/reviews/google-calendar",
    "Sheets": "https://www.techradar.com/reviews/google-sheets",
    "Slides": "https://www.techradar.com/reviews/google-slides",
    "Docs": "https://www.techradar.com/reviews/google-docs",
    "Google Drive": "https://www.techradar.com/reviews/google-drive-for-g-suite",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "mouse": "https://www.techradar.com/news/computing-components/peripherals/what-mouse-10-best-mice-compared-1027809",
    "keyboard": "https://www.techradar.com/news/computing-components/peripherals/what-keyboard-10-best-keyboards-compared-1028011",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Linux": "https://www.techradar.com/best/best-linux-distros",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "office desk": "https://www.techradar.com/best/best-office-desks",
    "M.2 SSD": "https://www.techradar.com/best/best-m2-ssd",
    "controllers": "https://www.techradar.com/news/best-controllers-for-pc-2019-the-best-pc-game-controllers-you-can-buy-today",
    "Atari VCS review": "https://www.techradar.com/reviews/atari-vcs",
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}