{
  "source": "https://www.techradar.com/news/lg-b1-oled-comes-to-us-in-surprise-online-listing",
  "title": "Surprise! Budget LG OLED TV lands in US after release U-turn",
  "category": "televisions",
  "updated": "2021-09-02T10:58:06Z",
  "author": "henry-st-leger",
  "summary": "The LG B1 has come to the US, against all odds",
  "article": [
    "The LG B1 OLED has come to the US, meaning any North American shoppers are able to order the budget OLED TV through the LG website.",
    "The surprise listing seems to contradict previous communications from LG, which previously only planned to release the LG B1 in the UK, preferring to push its 48-inch OLED, the LG C1, and the truly entry-level LG A1 (which starts at $1,199) in the territory, instead of this year's B Series.",
    "You can now buy the LG B1 OLED for $1,399 at a 55-inch size, $1,999 at a 65-inch size, and $3,099 at a 77-inch size.",
    "You may be frowning at the word 'budget', but the pricing is relatively competitive for a new OLED TV, the cheapest of which hover around $1,000 in times of sales, and usually launch at around the price of this 55-inch model – if not a lot more.",
    "The B Series OLED has traditionally been LG's cheapest annual OLED TV release, though the arrival of an even lower-end A Series model – which ships without HDMI 2.1 ports, and skimps a little on audio – had appeared to shake up LG's release plans a little.",
    "Now, though, it seems that LG is content to push the LG B1 through its own website, though it looks like you won't be able to get this set through other retailers such as Best Buy or Walmart. The model's listing page refers to it as an \"online exclusive\", so we wouldn't waste time scouring for it in stores.",
    "We are somewhat relieved to see the LG B1 come to the US, albeit in a limited capacity. We've long approved of the B Series range as a way to bring decent OLED pictures into your home for less, and for those of you keen to keep those HDMI 2.1 ports for next-gen consoles and the like (PS5, Xbox Series X, etc), it will offer a bit more flexibility than a truly bargain OLED like the A1.",
    "Don't forget, though, that the 48-inch LG C1 is pretty affordable these days, and it may be worthwhile looking to see if a C Series model at any size is within your budget – you'll get a top-notch a9 Gen 4 AI processor instead of the a7 iteration used in the A1 and B1 OLEDs, and which should prevent the video noise that can crop up in the cheaper chipset."
  ],
  "headers": {
    "6": "The cheap seats"
  },
  "links": {
    "LG B1 OLED": "https://www.techradar.com/news/lg-b1-oled-price-release-date-specs",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "48-inch OLED": "https://www.techradar.com/best/48-inch-oled-tv",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "LG A1": "https://www.techradar.com/news/lg-a1-oled-price-release-date-specs-sizes",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}