{
  "source": "https://www.techradar.com/news/a-treasure-trove-of-unreleased-xbox-games-has-been-discovered-and-there-are-some-great-surprises",
  "title": "A treasure trove of unreleased Xbox games has been discovered – and there are some great surprises",
  "category": "gaming",
  "updated": "2021-09-20T16:04:35Z",
  "author": "gerald-lynch",
  "summary": "From He-Man to Pac-Man",
  "article": [
    "Game development is as much a tale of the also-rans as it is the big blockbusters. For every Halo, there’s an FPS prototype that didn’t make the cut, for every Mario Kart a racer whose engines stalled before it left the starting grid.",
    "Today we’re getting a wonderful glimpse into some of the titles that nearly graced the original Xbox and Dreamcast, thanks to the unveiling of a priceless stash of unreleased builds and prototype games over at Hidden Palace.",
    "Hidden Palace, if you’ve never heard of it, is a video game development preservation community – collecting not just such early builds and prototypes, but also unreleased artwork, hardware, code and more. Its latest push has been “Project Deluge” collating materials from thousands of development discs and sharing the best of what’s been found.",
    "The latest release is a real wonder, showing off early versions of Tony Hawk’s Pro Skater, Jet Grind Radio, WWF Attitude and more for Dreamcast. But it’s the Xbox stuff where some really wild stuff sits.",
    "Perhaps the greatest gem here is an unreleased English localization of Dinosaur Hunting: Ushinawareta Daichi, which despite seeming all-but-complete, never made it outside of Japan. It’s a bit like Jurassic Park crossed with Monster Hunter, and was destined for the original Xbox.",
    "Next up is another near-complete game, starring that Saturday morning cartoon idol, He-Man. He-Ma: Defender of Grayskull saw a PS2 release in Europe, but nowhere else, and its Xbox version, preserved now by Hidden Palace, never saw the light of day. Another interesting find is a near-complete build of Pac-Man World Rally. It made it to PS2 and Gamecube, but this Xbox build never went past the prototyping stage.",
    "That so many of these games were close to completion but never made it to their intended home on the Xbox speaks volumes about the console wars of the time. The original Xbox was a powerhouse, and one that paved the way for Microsoft’s modern Xbox Series X successes. But it couldn’t compete with the mighty PS2, which remains the best-selling console of all time with over 155 million units sold worldwide. It’s likely publishers saw a greater return possible by just focussing on a PS2 release, and leaving Xbox ports of the time to flounder.",
    "One last curio to highlight from the hundreds of items here is an unreleased title called The Vatz. Developed by Beenox Studios for PC and Xbox, it was set to be shown off at E3 2002, and worked on a custom engine called Goliath that was said to be capable of advanced physics rendering. Set to be a vertical slice to entice publishers, the demo was as far as development on the third--person sci-fi game went, and it faded into obscurity.",
    "There’s much, much more to be found over at Hidden Palace, and there’s even the ability to download the builds for those that want to attempt to make them run on original hardware or emulating software – a feat that’s more than possible, according to the site. Have a dig around, and let us know if you spot any treats we’ve missed here."
  ],
  "headers": {
    "4": "Raiders of the lost Xbox"
  },
  "links": {
    "Halo": "https://www.techradar.com/reviews/halo-infinite",
    "Mario Kart": "https://www.techradar.com/news/25-years-of-mario-kart-6-ways-it-changed-racing-games-forever",
    "Hidden Palace": "https://hiddenpalace.org/",
    "latest release is a real wonder": "https://hiddenpalace.org/News/Project_Deluge:_Xbox_and_Dreamcast",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS2": "https://www.techradar.com/news/best-ps2-games-anniversary"
  }
}