{
  "source": "https://www.techradar.com/news/netflix-owns-the-rights-to-a-host-of-roald-dahl-stories-and-the-tv-possibilities-are-endless",
  "title": "Expect more Netflix TV shows based on Roald Dahl's stories after massive buyout",
  "category": "entertainment",
  "updated": "2021-09-22T09:25:19Z",
  "author": "henry-st-leger",
  "summary": "Netflix's Roald Dahl acquisition bodes very well",
  "article": [
    "Netflix has just acquired the screen rights to a host of Roald Dahl stories, meaning that the likes of Charlie and The Chocolate Factory, Matilda, The Witches, The Twits and James and The Giant Peach could be coming to the streaming platform in a variety of guises.",
    "While Netflix already has a number of licensed Roald Dahl productions in the works, including an animated series that tells the story of Charlie and The Chocolate Factory – as well as its Charlie and The Great Glass Elevator follow-up – this latest acquisition gives Netflix a lot more free reign when it comes to adapting the late author's classic works.",
    "In a press release, the streaming platform has announced that \"the Roald Dahl Story Company (RDSC) and Netflix are joining forces to bring some of the world's most loved stories to current and future fans in creative new ways.\"",
    "Netflix claims the new deal allows for \"a much more ambitious venture\" compared to its previous, more limited partnership with the Roald Dahl estate, with opportunities \"across animated and live action films and TV, publishing, games, immersive experiences, live theatre, consumer products and more.\"",
    "Netflix has made no secret of its multimedia plans, recently hiring executives to support its move into gaming, while experimenting with all sorts of interactive storytelling on its own platform – such as the Black Mirror Bandersnatch special.",
    "Given the lasting power of so many of Roald Dahl's stories – note the upcoming 'Wonka' reboot coming in 2023 and starring Timothée Chalamet – it's no doubt a smart move from Netflix, and this deal expands well beyond its initial plans in merely animated TV shows based on Dahl's properties.",
    "While so much of Netflix's strategy over the past few years has been in creating its own original content – to escape reliance on purely licensing hit shows from other platforms and production companies – there's no doubt that owning some existing IP can only help its efforts to stay on top of the streaming pack.",
    "That's especially true when it comes to children or family content. Disney Plus may have, well, all the Disney movies – but the platform is also more limited in variety of tone for its reliance on flagship franchises.",
    "Netflix's Roald Dahl acquisition opens up a fleet of opportunities across both live-action and animated shows, with the remit to mix and match different flavors of storytelling in a way the House of Mickey generally avoids, given it seems to prefer a consistency of tone across its properties on the whole – as with the many Marvel movies put out over the past few years.",
    "What's so wonderful about the stories of Roald Dahl is the knife edge they tread between children's humor and a dark maturity – such as the monstrous creatures of The Witches, or the psychological cruelty of The Twits.",
    "These stories can be played for laughs or lightness, but they can equally be adapted with a bleaker or more adult tone – and Netflix has good form for variety when it comes to content produced for its platform. We can only hope it fares better than the last Charlie and the Chocolate Factory movie, or the rather unexciting BFG adaptation we saw in 2016."
  ],
  "headers": {
    "6": "Netflix is owning it"
  },
  "links": {
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1050334171552251600/https://about.netflix.com/en/news/netflix-acquires-iconic-roald-dahl-story-company",
    "recently hiring executives to support its move into gaming": "https://www.techradar.com/news/netflix-may-add-video-games-to-its-streaming-catalog-in-the-next-year",
    "all sorts of interactive storytelling on its own platform": "https://www.techradar.com/news/netflixs-heist-tv-show-puts-storytelling-in-your-hands-but-dont-expect-bandersnatch-2",
    "Bandersnatch": "https://www.techradar.com/news/the-black-mirror-movie-bandersnatch-hits-netflix-on-december-28-2018?region-switch=GB"
  }
}