{
  "source": "https://www.techradar.com/news/could-the-last-of-us-tv-show-get-a-new-trailer-this-saturday",
  "title": "Could The Last of Us TV show get a new trailer this Saturday?",
  "category": "gaming",
  "updated": "2021-09-24T12:22:27Z",
  "author": "hamish-hector",
  "summary": "The Last of Us Day celebration has 'all-new' content",
  "article": [
    "Naughty Dog took to the PlayStation Blog to announce that ‘all-new’ Last of Us content will be revealed this weekend. While we don't know what it could be for certain, our money is on a trailer for The Last of Us series on HBO.",
    "The announcement will drop on Sunday, September 26, as it marks this year’s The Last of Us Day - the company’s annual celebration of The Last of Us community - and is often accompanied by news and smaller events.",
    "Ahead of the announcement, Naughty Dog also unveiled a whole load of new merch available in Europe and the US from clothing to accessories to a £2,000 guitar (only available in Austria, France, Germany, Ireland, Italy, Spain, and the UK).",
    "The big reveal will come on Saturday though, with the all-new content being shown off at 9 AM PT/ 5 PM BST / 2 AM Sunday ACT. Be sure to tune in at the official site if you want to catch it live.",
    "We don’t know exactly what to expect from this new The Last of Us announcement, but we have a few predictions for what it might be.",
    "Back in April reports suggested that Naughty Dog is working on a The Last of Us Remake for the PS5. While this wouldn’t really be ‘all-new’ content - as it would be from a game we’ve played before - as the reports are already out there it would make sense for a reveal sooner rather than later.",
    "Our other main guess though is that the reveal could be something related to The Last of US TV show. While the series only began filming a couple of months ago - and we imagine production is several months from completion - there is a chance that a short trailer could have been cut together from what’s been shot so far.",
    "Thankfully we don’t have long to wait to see what the reveal actually is."
  ],
  "headers": {
    "4": "Analysis: What is the new The Last of Us content?"
  },
  "links": {
    "PlayStation Blog": "https://blog.playstation.com/2021/09/23/the-last-of-us-day-is-upon-us-celebrate-with-new-wearables-and-more-at-the-playstation-gear-store/",
    "The Last of Us series on HBO": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "£2,000 guitar": "https://gear.eu.playstation.com/Product/1529268-The_Last_of_Us_PartIIxTaylor_Guitar?cat=TLOU#frm%3DTLOU%26p%3D0",
    "official site": "https://www.playstation.com/en-us/games/the-last-of-us-part-ii/tlouday-2021/",
    "The Last of Us Remake": "https://www.techradar.com/news/the-last-of-us-remake-is-coming-to-ps5-according-to-report"
  }
}