{
  "source": "https://www.techradar.com/news/iphone-se-3-could-be-years-away-but-an-iphone-se-plus-might-land-first",
  "title": "iPhone SE 3 could be years away, but an iPhone SE Plus might land first",
  "category": "phones",
  "updated": "2021-10-26T09:08:35Z",
  "author": "james-rogerson",
  "summary": "Two iPhone SEs in three years",
  "article": [
    "The iPhone SE (2020) is well over a year old now, so we had hoped we might see the iPhone SE 3 soon, but the latest leak suggests that’s not to be.",
    "According to leaker Ross Young, the iPhone SE 3 has been delayed until 2024, so it might not land for years. Apparently when it does land though it will have a larger 5.7 - 6.1-inch LCD screen. That’s up from 4.7 inches on the iPhone SE (2020).",
    "Young doesn’t say anything else about the phone, but if that size is accurate then we’d think it will probably sport a more modern design, with smaller bezels and no home button, more in line with the iPhone 13 than the iPhone 8 that the current SE is based on. Otherwise it could be a substantially large phone, and one that might look incredibly dated by 2024.",
    "However, anyone who’s after a new affordable iPhone won’t necessarily have to wait that long, as Young adds that we’ll apparently see an iPhone SE Plus in 2022. This is said to have the same 4.7-inch LCD screen as the iPhone SE (2020) and the iPhone 8, but with the addition of 5G.",
    "We’d expect more will change than just the connectivity options – at the very least we’d think a slightly newer chipset would probably be included to keep the iPhone SE Plus current, but Young doesn’t comment on that.",
    "We would however take all of this with a pinch of salt. While Young has a solid track record, just the other day we heard that the next iPhone SE would launch in early 2022 but with a design based on the iPhone XR – which would likely mean a 6.1-inch screen. So that’s at odds with what Young says about the iPhone SE Plus. For now, it’s hard to say which – if either – leak is right.",
    "Most iPhone SE rumors have been focused on the iPhone SE 3, but we’ve actually been hearing about an iPhone SE Plus since slightly before the iPhone SE (2020) even launched.",
    "However, previous leaks had suggested the iPhone SE Plus would have a larger screen than the iPhone SE (2020), whereas Young reckons it will be the same size.",
    "A larger display would fit better with the name, especially as Apple has previously used ‘Plus’ to denote larger screens, as with the iPhone 8 Plus for example. So there’s a lot of uncertainty surrounding this phone, and we’d take everything we’re hearing with a pinch of salt until more concrete details emerge.",
    "Via Phone Arena"
  ],
  "headers": {
    "6": "Analysis: it’s not the first time we’ve heard about an iPhone SE Plus"
  },
  "links": {
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1452783737146462209",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "iPhone SE Plus": "https://www.techradar.com/news/iphone-se-plus",
    "with a design based on the iPhone XR": "https://www.techradar.com/news/iphone-se-3-could-be-based-on-a-surprisingly-modern-iphone",
    "would have a larger screen": "https://www.techradar.com/news/iphone-13-series-could-still-get-a-mini-model-at-the-cost-of-the-iphone-se-3",
    "iPhone 8 Plus": "https://www.techradar.com/reviews/iphone-8-plus-review",
    "Phone Arena": "https://www.phonearena.com/news/Leak-iPhone-SE-3-delayed-iPhone-SE-Plus-tipped-to-feature-5G-LCD-screen_id135967"
  }
}