{
  "source": "https://www.techradar.com/news/marvels-what-if-is-surprisingly-popular-compared-to-other-mcu-shows",
  "title": "Marvel's What If...? is surprisingly popular compared to other MCU shows",
  "category": "entertainment",
  "updated": "2021-08-27T09:57:51Z",
  "author": "samuel-roberts",
  "summary": "Comparing the debuts of MCU shows",
  "article": [
    "Marvel is currently three episodes into What If...?, its animated anthology show. While superficially it might seem like a step down from a live-action, canonical series with a Marvel Cinematic Universe-sized budget, fans have seemingly been lapping it up.",
    "That's according to streaming aggregator Reelgood, which has two million monthly users in the US, and measured each Marvel show by percentage of streaming and engagement shares on its platform among the 100 most-watched shows. It did this for each first episode of each Marvel show. It doesn't compare each one directly in terms of popularity, but it tells us how much attention they were capturing compared to the 99 other biggest shows at that moment.",
    "According to Reelgood, the Marvel show with the most 'shares' among its top 100 most-watched series in the US during its first week is actually Loki. That captured 9.2% – and that makes sense, since it was the first to debut Disney Plus' Wednesday release model, which has subsequently been adopted by other big originals on the streamer.",
    "WandaVision is next, with 7.6% share among the top 100 shows on Reelgood on week one. Reelgood notes it only counts users who clicked play on both episodes that released that week, to keep it fair.",
    "Surprisingly, What If...? is next with 6.9% share among Reelgood's viewers, beating out The Falcon and the Winter Soldier's 5.4%. Timing may be a factor here: What If...? released in the summer months, a famously quiet time for US TV, while The Falcon and the Winter Soldier released in the busier month of March.",
    "Still, it shows that the animated series is far from a footnote for Marvel – and that the premise of seeing different heroes in villains in situations you've never experienced before has a lot of appeal. No wonder a second season is expected to land in 2022.",
    "This seems to be the summer of the animated anthology on Disney Plus. Neither Marvel or Star Wars are releasing anything big and new until the end of the year, now – but What If...? and the upcoming Star Wars: Visions are keeping the fires burning for those who can't get enough of them.",
    "Ultimately, Disney's strategy for shotgunning out Star Wars and Marvel content will only work if there's some variety in the mix. And given how Netflix has seen success in cranking out 2D animated shows like Castlevania and Masters of the Universe: Revelation, this seems like a smart strategy.",
    "After What If...?, Marvel's next big thing on Disney Plus is November's Hawkeye. Shang-Chi, though, releases next week in theaters worldwide."
  ],
  "headers": {
    "6": "Analysis: People want something different"
  },
  "links": {
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Reelgood": "https://reelgood.com/",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Star Wars: Visions": "https://www.techradar.com/news/star-wars-visions-looks-totally-different-and-thats-why-you-should-watch-it",
    "Shang-Chi": "https://www.techradar.com/news/shang-chi-is-the-best-mcu-movie-since-avengers-endgame"
  }
}