{
  "source": "https://www.techradar.com/news/should-you-buy-the-ipad-2020-with-prime-day-deals-or-wait-until-the-ipad-2021",
  "title": "Should you buy the iPad (2020) with Prime Day deals or wait until the iPad (2021)?",
  "category": "tablets",
  "updated": "2021-06-22T03:19:45Z",
  "author": "tom-bedford",
  "summary": "Can you deal with the wait?",
  "article": [
    "When looking into the Prime Day deals, a big question on everyone's mind is 'should I buy the new device now, or wait until later?' and with Apple's yearly iPad release pattern, you could well be wondering that about the company's entry-level iPads.",
    "The latest iPad 10.2 (2020) came out in late 2020, after a launch alongside the iPhone 12 series, and there are a few modest Prime Day iPad deals that reduce its price a little bit. But in a couple of months, we're expecting to see an iPad (2021) that replaces the 2020 model.",
    "That begs the question: should you buy the new iPad 10.2 in the sales, or wait until the next-gen model is unveiled, and then buy that or one of the 2020 devices? We'll run you through the reasons to wait, and the reasons to buy, and let you make your own mind up.",
    "Before that, though, we need to know what we're actually looking at, so we'll list the best Prime Day iPad deals for the entry-level model that we can find. (Not in the US or UK? Scroll down for deals in your region).",
    "In the next section, we're going to explore how Apple is bad at discounts. This means the deals aren't great, but it also means they probably won't get any better than they're at right now.",
    "What we're saying is, that pithy $30 / £20 discount might be all we're getting. That would mean there's no point waiting for Black Friday, so you may as well buy a tablet now. You could pick up some cases or stands in the discounts too.",
    "Plus, if you buy a new iPad now, you actually get it now. If you wait until the new model is out, you're going to be empty-handed for at least three months, which might be an inconvenience.",
    "Oh, and we don't know anything about the iPad (2021) just yet - it might not even be worth waiting for.",
    "We're going to have to drop some hard truths here: Apple deals, both during Prime Day and Black Friday, are usually not very good. The company tends to only reduce the costs of its products by trivial amounts, typically less than 10%, and given Apple devices are really expensive to begin with, it doesn't make them much better buys.",
    "The iPad 10.2 deals we've seen during Prime Day are, quite frankly, not very good. That's not to say we'll see better discounts at other times of the year, like during Black Friday - but it's hard to get excited for $30 / £30 off.",
    "In fact, if you don't need an iPad, there are way better Prime Day deals out there on other tablets, especially Amazon Fire and Samsung Galaxy Tabs.",
    "If you really want an Apple iPad, and don't mind the fact the price has barely been reduced, maybe you don't need to worry about discounts at all. In that case, there's no harm in waiting for the 2021 iPad, as it'll have a few improvements on the current model, and will be out in a couple of months.",
    "From third-party retailers, we might see the iPad (2020) see a fair price reduction when the iPad (2021) comes out. That does depend on stock, though, so if you wait you might end up empty-handed. That's just something to bear in mind.",
    "No matter where you live, you'll find all the lowest prices for the iPad 10.2 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Reasons to go for the iPad Prime Day deals",
    "8": "Reasons to avoid the iPad Prime Day deals",
    "13": "More iPad 10.2 deals",
    "14": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "iPad 10.2 (2020)": "https://www.techradar.com/reviews/new-ipad-102-2020",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021"
  }
}