{
  "source": "https://www.techradar.com/news/are-magnesium-frames-the-future-of-e-bikes-ducatis-engineers-think-so",
  "title": "Are magnesium frames the future of e-bikes? Ducati's engineers think so",
  "category": "fitness",
  "updated": "2021-07-15T11:57:46Z",
  "author": "cat-ellis",
  "summary": "The new MG20 is surprisingly light and doesn't cost the Earth",
  "article": [
    "The motorbike experts at Ducati have released a new folding e-bike with a magnesium frame to cut down weight – and it costs a lot less than you might expect.",
    "The Ducati MG20 weighs 20.6kg according to eBikeTips, and is available to order for €1,599 (about $1,900 / £1,400 / AU$2,500). That makes it one of the most affordable folding electric bikes around, which is a surprise considering the materials – as well as the prestige of the Ducati name.",
    "Ducati is no stranger to e-bikes. The Italian company launched the MIG-RR electric mountain bike in 2019, and released three aluminum folding e-bikes in 2020. It's also been working with magnesium since 2018, when it debuted its first bicycle with magnesium-forged wheels, so it's unsurprising that its engineers have set out to combine the two.",
    "Folding bikes are notoriously heavy due to the need for tough, durable locking hinges and thicker tubes that keep the bike rigid and safe in use. That weight is all the more noticeable when they're compacted down and can't be shouldered like a regular diamond frame bicycle. Folding e-bikes are even heftier due to the need for a battery, so anything that can shave off a couple of kilos is a welcome improvement.",
    "That said, the Ducati MG20 isn't the lightest folding e-bike around. The MiRider One weighs a modest 17.2kg including the battery, so there's definitely scope for developing even lighter, more commuter-friendly folders in future.",
    "We're also curious to see how power assistance will work with the Ducati MG20. E-bikes usually offer several power assistance levels that adjust the output from the motor, but the MG20 works differently, with speed options that limit the assistance to 7.5 mph, 11 mph, or 15.5 mph respectively.",
    "Ducati explains that the bike's motor will adjust automatically according to the road surface, incline and force placed on the pedals – much like the Cowboy 4, which recently took the top spot in our roundup of the best electric bikes of 2021.",
    "It'll be interesting to see how this affects the riding experience, particularly because promotional photos of the MG20 appear to show a shifter on the right handlebar grip. This suggests that the rider will have control over the bike's gearing, which could result in a ride that feels more natural to experienced cyclists than the Cowboy's hands-off approach."
  ],
  "headers": {
    "5": "A more hands-on ride?"
  },
  "links": {
    "folding e-bike": "https://www.techradar.com/best/best-folding-e-bikes",
    "Ducati MG20": "https://www.ducatiurbanemobility.com/electric-mobility/mg-20/",
    "eBikeTips": "https://ebiketips.road.cc/content/news/ducati-have-made-a-magnesium-folding-e-bike-3177",
    "electric bikes": "https://www.techradar.com/best/electric-bike",
    "MIG-RR": "https://ducatistore.co.uk/news/ducati-e-mountain-bike-mig-rr/",
    "three aluminum folding e-bikes": "https://ebiketips.road.cc/content/news/ducati-strike-again-with-launch-of-three-new-folding-e-bikes-2485",
    "MiRider One": "https://www.techradar.com/reviews/mirider-one",
    "Cowboy 4": "https://www.techradar.com/reviews/cowboy-4",
    "the best electric bikes of 2021": "https://www.techradar.com/best/electric-bike"
  }
}