{
  "source": "https://www.techradar.com/news/microsoft-teams-update-tackles-one-of-the-most-frustrating-video-conferencing-issues",
  "title": "Microsoft Teams update tackles one of the most frustrating video conferencing issues",
  "category": "computing",
  "updated": "2021-07-02T09:52:55Z",
  "author": "joel-khalili",
  "summary": "Music to your ears, literally",
  "article": [
    "Microsoft is working on an upgrade for collaboration platform Teams that will improve the quality and accuracy of music fed into meetings.",
    "As per a new entry to the company’s product roadmap, Microsoft Teams will soon process audio in a more intelligent way, dialling the bitrate up and down depending on available resources.",
    "“In music mode, we support up to 32 kHz sampling rate mono audio at 128 kbs, and optimize our audio processing settings for reproducing music with high fidelity,” Microsoft explained.",
    "“Teams will automatically adjust the audio bitrate based on the available bandwidth, going down to 48 kbps while still delivering good music quality. We also provide users the option to turn off components such as echo cancellation, noise suppression and gain control if needed.”",
    "To reap the full benefits of the change, Microsoft says Teams users should opt for high quality external speakers or headset, but advises against Bluetooth models. Unsurprisingly, the company reckons the in-built Surface Book speakers will fare pretty well too.",
    "The new mode is still currently under development, but is scheduled to go live for all Teams users later this month.",
    "Since the pandemic began, many remote workers will have sat through meetings and presentations with a musical element. If personal experience is anything to go by, the audio quality will rarely have been high.",
    "Although music doesn’t feature regularly in day-to-day meetings, the move to boost audio quality in Teams will be celebrated nonetheless, addressing one of the remaining disadvantages of remote versus in-person meetings.",
    "The new music mode expands upon existing work on the Satin audio codec, which is designed to improve the audio quality of Teams calls taking place over congested networks.",
    "“As we enter a new decade, users can now choose from several high-end connectivity alternatives such as high-speed broadband, optical fiber, and 5G. Yet, large segments of Microsoft’s user base are still limited to low cable internet speeds or slower 3G and 4G cellular networks,” the company explained.",
    "“Satin has been designed to provide great audio quality even under high packet loss. In addition, its great quality at low bitrates allows us to use more of the available bandwidth for providing better resiliency to packet loss.”",
    "Currently, the Satin codec is only active on one-on-one calls, but will soon be applied to group meetings too."
  ],
  "headers": {
    "6": "Microsoft Teams audio"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "new entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1215424870865293000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D83520",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "headset": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "Surface Book": "https://www.techradar.com/reviews/pc-mac/laptops-portable-pcs/laptops-and-netbooks/microsoft-surface-book-1306306/review",
    "remote workers": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Satin audio codec": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9113040478044088000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-teams-blog%2Fsatin-microsoft-s-latest-ai-powered-audio-codec-for-real-time%2Fba-p%2F2141382&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-teams-update-tackles-one-of-the-most-frustrating-video-conferencing-issues",
    "broadband": "https://www.techradar.com/news/internet/broadband/best-business-broadband-deals",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}