{
  "source": "https://www.techradar.com/news/pcie-60-is-almost-here-with-double-the-data-transfer-rate",
  "title": "PCIe 6.0 is almost here, with double the data transfer rate",
  "category": "computing",
  "updated": "2021-10-08T13:09:37Z",
  "author": "mayank-sharma",
  "summary": "PCIe 6.0 standard drops soon, but it’ll take another year or more to make its way to you",
  "article": [
    "The final specification for PCI-Express (PCIe) 6.0, expected to double the data transfer speeds between the main components of computers, will be finalized in a matter of months, according to reports.",
    "Al Yanes, president and chairperson of the standards organization PCI-Special Interest Group (SIG), told The Register that the group is aiming for an end of year or early 2022 release.",
    "Before you get too excited though, note that it will take a little longer for the new specification to trickle down to end users.",
    "\"The rule of thumb is that we typically see products utilizing the latest PCIe architecture 12 to 18 months after final specification release,\" Yanes added.",
    "The new specification will succeed PCIe 5.0, which was finalized back in 2019.",
    "The new specification reportedly supports transfer speeds of up to 64 gigatransfers per second (GT/s), which would translate to transfers at up to 128 GB/s per direction in a x16 configuration, which is double that of PCIe 5.0.",
    "\"PCIe 6.0 technology bandwidth capabilities are more suited for high end applications at this time... accelerators, ML [machine learning] and HPC [High Performance Computing] applications that need high IO bandwidth,\" points out Yanes.",
    "Spokespersons for both Intel and Nvidia, the traditional users of the technology, declined to directly comment on adding support for PCIe 6.0 in their wares, when quizzed by The Register.",
    "Interestingly however, the new standards’ increased transfer rates might just help carve out a new usage segment.",
    "\"We have seen tremendous interest in automobile solutions and we have formed a new PCIe technical workgroup to focus on how to increase the adoption of PCIe technology in [the] automobile industry due to the increased demand for bandwidth in that ecosystem,\" shared Yanes.",
    "Via The Register"
  ],
  "headers": {
    "4": "Exploring new avenues"
  },
  "links": {
    "PCI-Express": "https://www.techradar.com/how-to/how-to-install-a-graphics-card",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "Nvidia": "https://www.techradar.com/news/nvidia-geforce",
    "The Register": "https://www.theregister.com/2021/10/07/pcie6_specification/"
  }
}