{
  "source": "https://www.techradar.com/news/which-type-of-coffee-maker-should-i-buy",
  "title": "Which type of coffee maker should I buy?",
  "category": "appliances",
  "updated": "2021-11-01T08:23:49Z",
  "author": "sophie-bird",
  "summary": "All the different types of coffee maker so you can get your caffeine fix",
  "article": [
    "With one of the best coffee makers around, your morning ritual to make a nice cup of Joe will no longer be a chore. There are so many types of coffee makers on the market so you’d be forgiven for losing track of which type does what.",
    "We’ll be including all the main types of coffee makers, explaining what they do, and pointing out anything you should know before you buy one. When it comes to brands, you’ll also be spoiled for choice with well-known options such as the Nespresso Vertuo Plus going up against the likes of the Gaggia Gran Deluxe.",
    "All the coffee maker types serve a different purpose and if you’re not sure which is the right type for you, consider what you’re going to use the machine for. This might sound strange since you’re going to want to make coffee with it, but there’s no point opting for a machine that has lots of fancy features that you’ll never use because you prefer your coffee simple and tasty. If you want endless choices for making latte art or a perfect cappuccino foam, choosing a coffee maker that’s too simplistic will be equally frustrating.",
    "Keep reading to find out more about all the different types of coffee makers for that delicious cup of java.",
    "Single-serve coffee makers do what they say on the tin and create just one serving of coffee per use. Sometimes known as pod coffee makers, these machines have different capabilities depending on the type you choose. Some machines such as the Nespresso Vertuo Plus use pods, whereas others use ground coffee. If you do decide to choose a pod machine, factor in the cost of these pods and look into whether they can be recycled or not. For those that prefer a manual coffee machine, you can also get single-serve French press coffee makers.",
    "Espresso machines use a pump to push pressurized water through ground coffee. This pressure creates a concentrated ‘shot’ of coffee known as espresso. Espresso machines create small volumes of strong coffee rather than carafes of coffee but you can add water to espresso to create an americano.",
    "Some espresso machines simply make a shot of coffee to enjoy on its own, or to top up with hot water. You can also get espresso machines with a steam arm so that you can froth milk to create lattes, cappuccinos, and other hot drinks.",
    "French press coffee makers (also known as a cafetière) are some of the easiest machines to use because they are purely manual. There aren’t any fancy features or fiddly things to master. To make coffee in these makers, you simply need to swill the cafetière with warm water and empty it out. Add scoops of ground coffee into the cafetière and pour over water that’s just off the boil so that it doesn’t affect the taste of the coffee. After leaving for a few minutes, you can then gently push down the coffee plunger and you’ll be left with ready-to-drink coffee.",
    "French press coffee makers are ideal if you want fuss-free coffee and you don’t want to buy capsules. These machines don’t use any electricity and you can also use the leftover coffee grounds on your garden, in homemade barbecue rubs, and even in DIY cleaning products. Keep in mind that this method of making coffee can be quite messy and you’re pretty limited on the types of coffee you can make this way.",
    "Filter coffee machines are ideal if you want to brew a few cups of coffee to enjoy over a few hours. These machines are electric-powered and include two pots, they’re sometimes known as drip filter machines. The top pot is where you place your coffee and the hot water and steam filter through the coffee grounds so that brewed coffee drips down into a lower carafe. Most drip coffee makers have a warming plate beneath the carafe so that you can enjoy a hot coffee even hours after making your first brew.",
    "Drip coffee makers are good if you prefer to have more than one coffee in a morning, and if you enjoy an americano. There isn’t functionality to froth milk, however, so you won’t be able to make lattes or flat whites. These machines do require a filter to catch the coffee grounds and some drip coffee machines have reusable filters while others use disposable filters.",
    "Cold press coffee makers are essentially exactly the same as a French press and use ground coffee, but the difference is you use filtered room temperature water, rather than hot. This method of making coffee is also more time-consuming because you need to leave the coffee to brew for 12 hours or more.",
    "Cold press coffee is sometimes confused with ice coffee but cold press doesn’t actually have any ice. You can keep cold press coffee in your fridge for weeks if it’s sealed properly.",
    "Bean-to-cup coffee machines take care of every step in the making process. You simply add coffee beans to the machine and then it grinds them before turning them into espresso and adding milk.",
    "Most of these machines have multiple options for the types of drinks you can make with them. You can normally choose between frothy milk or no milk at all, and many machines have easy-to-use cleaning settings."
  ],
  "headers": {
    "4": "1. Single-serve coffee machines",
    "5": "2. Espresso machines",
    "7": "3. French press coffee maker",
    "9": "4. Filter coffee machines",
    "11": "5. Cold press coffee machines",
    "13": "6. Bean-to-cup coffee makers",
    "15": "Today's coffee maker savings:"
  },
  "links": {
    "best coffee makers": "https://www.techradar.com/best/best-coffee-machines",
    "Nespresso Vertuo Plus": "https://www.techradar.com/reviews/nespresso-vertuo-plus-review",
    "Gaggia Gran Deluxe": "https://www.techradar.com/reviews/gaggia-gran-deluxe",
    "Espresso machines": "https://www.techradar.com/best/best-espresso-machine-2021-make-barista-quality-coffee-at-home"
  }
}