{
  "source": "https://www.techradar.com/news/xiaomi-shows-super-high-res-cameras-are-becoming-mainstream-on-cheap-phones",
  "title": "Xiaomi shows super-high-res cameras are becoming mainstream on cheap phones",
  "category": "phones",
  "updated": "2021-10-26T07:59:51Z",
  "author": "tom-bedford",
  "summary": "More 108MP camera phones",
  "article": [
    "Gone, apparently, are the days when cheap phones would have murky cameras and rubbish specs, as it's been confirmed that yet another low-budget handset is getting a super-high-res 108MP camera.",
    "Xiaomi has posted on Chinese social media platform Weibo regarding its upcoming Redmi Note 11 and Note 11 Pro, which are due to be launched on October 28; the company shared a teaser of the phones with an unmissable '108MP' across it.",
    "A subsequent teaser showed the sensor, with information breaking down this type of component for the layman, listing its resolution and how pixel binning works.",
    "The company has been slowly releasing teasers for its upcoming Redmi Note 11 launch, mainly in the way of lifestyle shots for the phones. The launch event on October 28 is expected to be China-only, though the phones will likely get a global release.",
    "So it seems the Redmi Note 11 Pro, and maybe the vanilla model too, will get a 108MP main sensor, though we don't know the specs of the other rear cameras yet. This isn't the first phone with such a sensor from Xiaomi, or even the first low-cost one, with the Redmi Note 10 Pro getting one, but it shows normalization of this spec.",
    "Though the first 108MP phone was actually a mid-ranger (the Xiaomi Mi Note 10), for a long time the vast majority of phones with this kind of sensor were top-end ones like the Xiaomi Mi 10, Samung Galaxy S20 Ultra and Motorola Edge Plus.",
    "18 months after those handsets began launching, we've seen 108MP snappers trickle down to budget phones. Recently the Realme 8 Pro, Motorola Edge 20 Lite and the aforementioned Redmi Note 10 Pro all got one.",
    "So now, you don't need to pay a lot of money if you want a super-high-res camera sensor.",
    "This is how tech features generally work - they debut in expensive handsets, and gradually come to more affordable devices. The same could be said for multiple rear cameras, in-screen fingerprint sensors and facial recognition.",
    "The only difference with 108MP cameras is that you could argue that the real use case of high-res pictures hasn't really been found for all audiences yet. Only certain users need this kind of sharp snap, and lots of phone buyers likely won't benefit from such a sensor.",
    "When the Xiaomi Redmi Note 11 gets a global release we'll test it to see how well it works, but it still remains to be seen how many average consumers need a 108MP camera."
  ],
  "headers": {
    "5": "Analysis: 108MP sensors all around"
  },
  "links": {
    "cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "Weibo": "https://weibo.com/3021514657/KEuvbbbYM",
    "subsequent teaser": "https://weibo.com/3021514657/KEuHmDPnH",
    "how pixel binning works": "https://www.techradar.com/how-to/what-is-pixel-binning-and-how-can-it-help-my-smartphone-photography",
    "Redmi Note 10 Pro": "https://www.techradar.com/reviews/xiaomi-redmi-note-10-pro",
    "Xiaomi Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Xiaomi Mi 10": "https://www.techradar.com/reviews/xiaomi-mi-10",
    "Samung Galaxy S20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s20-ultra-full-review",
    "Motorola Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Realme 8 Pro": "https://www.techradar.com/reviews/realme-8-pro",
    "Motorola Edge 20 Lite": "https://www.techradar.com/reviews/motorola-edge-20-lite"
  }
}