{
  "source": "https://www.techradar.com/news/deathloop-pc-specs-give-pc-gamers-an-advantage-over-ps5-but-at-a-cost",
  "title": "Deathloop PC specs give PC gamers an advantage over PS5 – but at a cost",
  "category": "computing",
  "updated": "2021-09-09T10:48:44Z",
  "author": "matt-hanson",
  "summary": "It's gonna be a great game wherever you play",
  "article": [
    "Deathloop is Bethesda’s upcoming game for PS5 and PC that has an interesting time loop twist to its gameplay, and its PC requirements give us a hint at how ambitious this game will be, especially on PC.",
    "However, even the minimum recommended specs (as published by Bethesda) are reasonably high, especially compared to other modern games, and that means the PS5 version may be the best version for many people – as long as they’ve managed to snag one of the elusive consoles, that is.",
    "Minimum requirements:",
    "Recommended requirements:",
    "Ultra 4K requirements:",
    "As you can see from the specs above, those are quite demanding hardware requirements. While we’re not surprised to see the 4K Ultra requirements ask for the RTX 3080, one of the most powerful – and expensive – GPUs on the market, even the minimum request of a Nvidia GTX 1060 (6GB) or AMD Radeon RX 580 (8GB) is pretty high.",
    "If your PC doesn’t meet those requirements, and you’re excited about the game, then we’re afraid it looks like it’s time for an upgrade.",
    "However, if you do have the hardware, then Deathloop is looking to be shaping up to be something really special on PC.",
    "Bethesda has also revealed what PC-exclusive features will be coming to the game, and that includes support for ultrawide monitors and AMD FidelityFX Super Resolution support.",
    "Ultrawide monitor support allows the game to be played at 21:9 (or wider) aspect ratios. Pretty much every modern game on PC supports this, but it’s still nice to get confirmation. Having a wider aspect ratio allows for a much more immersive gaming experience, as the game fills up more of your field of view, and it can also give you a competitive advantage, as you’re able to see enemies that normal monitors can’t show – until it’s too late.",
    "Meanwhile, AMD FidelityFX Super Resolution is technology that upscales games so it can run at higher resolutions with less impact on performance and minimal degradation of image quality. We recently spoke to AMD about FidelityFX Super Resolution as part of this year’s PC Gaming Week.",
    "This will help gamers with either AMD or Nvidia GPUs get more consistent framerates, so it’s great to see here.",
    "You’ll also be able to tweak the field of view, headbob and turn on or off loads of graphical settings, which makes the PC version appear to be the definitive one to get – as long as you have a capable rig.",
    "Does this make the PS5 version obsolete? Absolutely not. Those relatively demanding specs means that for many people, the PS5 version will be the best version to get.",
    "Even if you’re going to upgrade, the 4K ultimate version requires an RTX 3080 – a GPU that should cost $699 (£649, about AU$950), but due to stock shortages often goes for twice that amount.",
    "That GPU alone is more expensive, then, than the PS5, which although also supply constrained, sells for $399.99 / £359.99 / AU$599.95 for the digital version. The PS5 version should also run at 4K, and while it probably won't match the Ultra settings on PC, it'll still look fantastic.",
    "However, while the PS5 itself is cheaper, it’s still more affordable to buy games on PC. Deathloop will launch on PS5 and PC on September 14, and on PS5 it’ll cost $59.99 (£59.99, AU$99.95).",
    "Meanwhile, on PC it’ll cost significantly less in the UK at £49.99. In the US, it’ll cost the same $59.99, and in Australia it’ll also be AU$99.95.",
    "UK PC gamers could be getting the best deal, then. Prices for PC games usually drop faster than on console, which is worth bearing in mind.",
    "If you’re an Xbox owner, then you’re out of luck. Despite Microsoft now owning Bethesda, Deathloop remains a console exclusive on PS5 – for the moment, at least."
  ],
  "headers": {
    "2": "Deathloop PC specs",
    "5": "Hardware demands",
    "13": "What about the PS5 version?"
  },
  "links": {
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "as published by Bethesda": "https://bethesda.net/en/article/4mVL7pSx3tYuwe9HPfEPmm/deathloop-pc-specs-launch-details",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "ultrawide monitors": "https://www.techradar.com/news/ultrawide-monitor",
    "AMD FidelityFX Super Resolution": "https://www.techradar.com/news/amd-finally-takes-on-dlss-with-fidelityfx-super-resolution",
    "recently spoke to AMD about FidelityFX Super Resolution": "https://www.techradar.com/news/we-were-a-bit-too-ambitious-how-amd-is-upping-the-game-with-fidelityfx-super-resolution",
    "PC Gaming Week": "https://www.techradar.com/news/welcome-to-techradars-pc-gaming-week-2021",
    "Nvidia GPUs": "https://www.techradar.com/news/nvidia-geforce"
  }
}