{
  "source": "https://www.techradar.com/news/phishing-scams-using-google-meet-links-are-on-the-rise",
  "title": "More and more phishing scams are using Google Meet links",
  "category": "computing",
  "updated": "2021-08-12T13:47:08Z",
  "author": "mayank-sharma",
  "summary": "Using open redirects, scammers can get past most email security solutions",
  "article": [
    "Cybersecurity researchers have noticed a sharp increase in phishing attacks that rely on Google’s open redirects using Google Meet and Google DoubleClick.",
    "The use of the open redirects allows threat actors to camouflage malicious links as trustworthy ones and get them past a majority of email security solutions.",
    "“Most email security solutions are not able to identify the misuse of open redirects when analyzing the URL in real-time….Threat actors use authentic and trustworthy domains that allow open redirects, such as Google, to more effectively trick users into clicking a link and falling victim to the attack,” explain researchers from email threat protection platform, GreatHorn.",
    "The researchers add that unless the complete URL has been identified as “known bad”, the links will have trouble floating into the inbox.",
    "GreatHorn claims that between Q1 2021 and Q2 2021, there has been an 84% increase in phishing attacks that leverage Google’s open redirects using Google Meet and Google DoubleClick.",
    "These attacks are primarily focused on getting users to fall victim to credential harvesting, payment fraud and auto-downloads of malware.",
    "While Google DoubleClick abuse registered a 141% increase, Google Meet saw an increase of 57% as compared to the previous quarter.",
    "The researchers suggest that abusing Google DoubleClick isn’t new, and in fact, the platform has nurtured this vulnerability since 2008."
  ],
  "headers": {
    "4": "Murky waters"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "email security": "https://www.techradar.com/best/best-secure-email-providers",
    "explain": "https://www.greathorn.com/blog/google-and-open-redirects-preventing-your-users-from-becoming-a-victim-of-attacks/",
    "email": "https://www.techradar.com/news/best-email-provider",
    "GreatHorn": "https://www.techradar.com/news/most-phishing-attacks-lure-corporate-users-with-explicit-content",
    "malware": "https://www.techradar.com/best/best-malware-removal"
  }
}