{
  "source": "https://www.techradar.com/news/efootball-2022s-failure-is-fifa-22s-success",
  "title": "eFootball 2022's failure is FIFA 22's success",
  "category": "gaming",
  "updated": "2021-10-01T10:00:44Z",
  "author": "henry-st-leger",
  "summary": "Opinion: Konami's eFootball scores a painful own goal, as FIFA 22 goes strength to strength",
  "article": [
    "What has happened with Konami’s eFootball 2022? The reimagining of the long-running PES (Pro Evolution Soccer) series was meant to herald a new age of sport simulation, rebranding and remaking the series to offer a slick rival to the ongoing FIFA series with a free-to-play structure to pull players in.",
    "Alas, it wasn't to be. The soccer sim eFootball 2022 is now the most-hated game on Steam, with an 8% approval rating at the time of writing and screenshots of the game engine's hilariously off-kilter animations circulating social media like wildfire.",
    "Player faces look straight out of a PS2 Harry Potter game, despite the facial-scanning tech used to get player likenesses into the game. Gameplay animations too, are oddly fluid and floating, missing that tactile, grounded feeling needed for immersive sports sims. Some 'eFootballers' run around with their arms trailing behind them like the streamers attached to a desk fan. It's a PR disaster.",
    "But this failure is all the more painful for the release of FIFA 22, which launches today on PC and consoles – including PS5, Xbox Series X and Nintendo Switch.",
    "EA often gets flack for iterative gameplay mechanics, but the consistency of the FIFA series – some current issues on the Xbox Series S aside – is a great strength for it right now, offering the usual quality of past titles with a few new licks of paint.",
    "In our FIFA 22 review, we wrote that \"FIFA 22 breathes new life into the series’ once-familiar gameplay with the addition of HyperMotion technology, and makes well-intentioned strides to refresh its most dated modes [...] It’s not without the same issues that have plagued the franchise for several years, and a few of its supposed enhancements still feel like superficial additions, but this is the first soccer simulator that truly looks and plays like a next-generation experience.\"",
    "The biggest change is the addition of HyperMotion technology – which recreates motion-captured movements of players in real-life matches for in-game animations, significantly improving Fifa's visuals and behaviors. There is still the usual fleet of microtransactions to complain about, of course – but they're easier to avoid than the bulbous faces of your favorite athletes in Konami's botched game.",
    "The website for Konami's eFootball states that \"Our ambition was to recreate the perfect football environment, from the grass on the pitch, to the players' movement, all the way to the crowds in the stadium. To this end, we decided to create a new football engine, with revamped animation system and game controls. The final result was even more impressive than we had originally conceived.\"",
    "The result clearly hasn't matched up to that promise, with over 10,000 unhappy Steam reviews making for an \"Overwhelmingly Negative\" rating.",
    "As a free-to-play game, we expect to see further updates and fixes for eFootball in the near future, but it's hard to see the huge gulf between these games being crossed at this point – and Konami's insistence on an all-new game engine that wasn't up to scratch may have killed eFootball at the outset."
  ],
  "headers": {
    "7": "On the bench"
  },
  "links": {
    "eFootball 2022": "https://www.techradar.com/news/how-the-pro-evolution-of-konamis-efootball-came-to-be",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "some current issues on the Xbox Series S aside": "https://www.techradar.com/news/gamers-cry-foul-as-fifa-22-on-xbox-series-s-disappoints",
    "FIFA 22 review": "https://www.techradar.com/reviews/fifa-22",
    "website": "https://www.konami.com/efootball/en/"
  }
}