{
  "source": "https://www.techradar.com/news/apples-newest-store-reinvents-an-italian-palace",
  "title": "Apple’s newest store reinvents an Italian palace",
  "category": "phones",
  "updated": "2021-05-26T11:58:09Z",
  "author": "axel-metz",
  "summary": "A piece of history",
  "article": [
    "Part of Apple’s global appeal has always been the sense of luxury generated by its minimalist stores – and the tech giant is about to open its most impressive to date.",
    "On May 27, Apple will open the doors to its first store in the centre of Rome, Apple Via del Corso, which reinvents the 19th-century Palazzo Marignoli to take customers back in time as they browse for the latest iPhone.",
    "The impressive new store sits on the city's most famous shopping street, and boasts an adjacent large garden courtyard lined with native Camphora trees. To be honest, the whole thing looks like something out of a James Bond set.",
    "To restore the integrity of the palace and maintain its original aesthetic, Apple worked with architects and local restoration teams to reimagine the entirety of the palazzo's two floors, which are connected by a grand marble staircase.",
    "Restored artworks line the walls and ceilings, and large glass windows mean the entire store is lit by natural light during the day. To enter, visitors will pass through a vaulted colonnade leading to the sprawling ground floor, while the central staircase – which is absolutely huge, by the way – leads up to a series of traditional palazzo rooms.",
    "And there’s also a ballroom, obviously. Here, Apple will host Today at Apple sessions for the first time in Rome, inviting artists across the fields of music, art, design and content creation to events centered around creativity.",
    "“We can’t wait to begin a new chapter in Rome with the opening of Apple Via del Corso,” said Deirdre O’Brien, Apple’s senior vice president of Retail. “The new store represents a celebration of the unique history and art of Roman culture.”",
    "Apple’s Via del Corso isn’t the first time the company has impressed us with its eye for architectural design.",
    "Apple operates more than 500 retail stores in 25 countries, with each location generating more revenue per square foot than any other retailer (in the US, at least). Many of them are located in historic buildings, like the Palazzo Marignoli, which adds a unique sense of theater to customers’ shopping experience.",
    "The tech giant reportedly paid $2.5 million to renovate space in New York's iconic Grand Central Terminal, for example, not to mention the company’s flagship Berlin store, which sits inside a giant limestone opera house.",
    "The point being, Apple doesn’t do low-key when it comes to its stores – and its latest Rome venture is no exception."
  ],
  "headers": {
    "7": "In with the old"
  },
  "links": {
    "Apple Via del Corso": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3686296582326293000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fnewsroom%2F2021%2F05%2Fapple-via-del-corso-opens-thursday-may-27-in-rome%2F",
    "iPhone": "https://www.techradar.com/reviews/iphone-12-pro-max-review"
  }
}