{
  "source": "https://www.techradar.com/news/dell-hp-warn-pc-prices-could-rise-due-to-global-chip-shortage",
  "title": "Dell, HP warn PC prices could rise due to global chip shortage",
  "category": "computing",
  "updated": "2021-05-28T11:10:28Z",
  "author": "mike-moore",
  "summary": "But both see results boost",
  "article": [
    "The global chip shortage may have a significant effect on PC sales and supplies throughout the rest of the year as the industry attempts to recover following the pandemic, two of the world's leading manufacturers have warned.",
    "Dell and HP have said that demand could outstrip supply when it comes to PCs for some time as the computing world gets back up to speed.",
    "Industries across the world have been affected by the slowdown in manufacturing of computer chips during the pandemic, with foundries and manufacturing plants in Taiwan, Japan and other areas all affected by coronavirus outbreaks and lockdowns.",
    "Both companies issued the warnings as they revealed their latest financial results, with Dell and HP both revealing better than expected quarters.",
    "In its Q1 2021 results, Dell reported earnings of $938 million and revenues of $24.5bn, up 12%. This included PC unit revenue growing 20% year-on-year to reach $13.3bn with operating income of $1.1bn, as consumer PC revenues increased 42% with commercial sales up 14%.",
    "However the company warned that PC prices could soon rise in order to cope with the scarcity of parts.",
    "\"The supply situation has not kept up with the demand environment as we think about the need for semiconductors,\" Dell CFO Thomas Sweet said in the company's earnings call. \"And that's an industry-wide issue, and clearly an issue that the technology industry is dealing with.\"",
    "Elsewhere, Dell's infrastructure unit saw Q1 revenues rise 5% to $7.9bn, with servers and networking revenue up 9%.",
    "HP said that PC-related sales rose 27% in its Q2 2021, with notebook sales growing 47% year-on-year to help push the quarterly revenues to $15.9bn, up 27.3% from the previous year.",
    "However the company also highlighted that this significant growth in demand from business and consumers alike could also mean that prices could rise a result.",
    "\"It's just all about demand outpacing supply and really creating that favorable environment,\" said Marie Myers, HP CFO. \"So, it's basically just the laws of supply and demand, which helped us with better pricing in the quarter. Regardless of whether you're sort of talking year-on-year or quarter-on-quarter, that improvement in gross margin was primarily driven by favorable pricing, which showed up as fewer promotions and as cost improvements.\"",
    "Via Reuters"
  ],
  "headers": {
    "3": "PC price rises?"
  },
  "links": {
    "chip shortage": "https://www.techradar.com/news/worldwide-chip-shortage-could-last-years-says-dell-founder",
    "Dell": "https://www.techradar.com/news/dell-laptop-deals",
    "HP": "https://www.techradar.com/news/hp-memorial-day-sale-the-best-deals-on-laptops-desktops-monitors-and-more",
    "Reuters": "https://www.reuters.com/technology/dell-beats-revenue-estimates-strong-demand-remote-working-products-2021-05-27/"
  }
}