{
  "source": "https://www.techradar.com/news/best-rpgs",
  "title": "Best RPGs 2021: the top role-playing games for console and PC",
  "category": "gaming",
  "updated": "2021-04-17T11:32:58Z",
  "author": "lloyd-coombes",
  "summary": "Grab your broadsword and ready your controller",
  "article": [
    "Looking for the best RPGs (or role-playing games) around? Then you've come to the right place.",
    "These days it’s more often than not that a game features RPG elements. Whether that’s a skill tree, dialogue options, or anything else that was once a staple of the genre, there’s always something for players to tweak and customize in everything from online shooters to sports titles.",
    "That’s not to say that the genre has been neglected, though. In fact, the last couple of years alone have treated us to some sensational RPGs across all platforms – from monster-catching to monster hunting, spiritual successors to full-blown remakes, and vast open worlds you can take with you wherever you go.",
    "If you’re longing to level up, dying for a dice roll, or simply want to swing a sizeable sword around, then here are the best RPGs you can find across PC and console.",
    "If you’ve ever thought that the sailing, raiding and pillaging life of a Viking is for you, then Assassin’s Creed Valhalla is probably as close as you’re ever going to get to give it a go.",
    "In recent years, the Assassin’s Creed games have begun to make the shift towards becoming RPGs and Assassin’s Creed Valhalla is the latest and arguably best in the series for this. In our review we awarded Assassin’s Creed Valhalla 3.5 stars, praising the game’s memorable protagonist Eivor who’ll be your primary company on your grand adventure through the Viking Age.",
    "The game is available on PC as well as both last and current-gen consoles, with some visual and performance enhancements for those on PS5 and Xbox Series X.",
    "Platforms available: Xbox One, Xbox Series X, PS4, PS5, PC",
    "It may be nearly a decade old, but Skyrim remains one of the most vital RPGs out there - primarily because of its incredible mod scene on PC. If you played this game back in 2011 and put it to bed, give it another go with some of the graphics and immersion mods. It's like playing Skyrim 1.5.",
    "Bethesda has also released The Elder Scrolls V: Skyrim Special Edition, which includes all of the add-ons that have been released, along with some graphical overhauls. If you have a VR headset, then you can also get The Elder Scrolls V: Skyrim VR for PC and PS4, which gives you an even more immersive experience.",
    "If you've not played it all, where have you been? This open-world fantasy epic makes it possible to spend hundreds of satisfying hours without even tackling the main story. Few games craft as rich a world as this, and there's enough content to play the game as a whole bunch of different characters without feeling like you're being funnelled into a single \"hero\" mould.",
    "We won't spoil the main storyline, but let's just say it features more dragons than Game of Thrones, and you even get to wield some dragon power yourself.",
    "Platforms available: Xbox One, PS4, PC and Nintendo Switch",
    "One of 2019’s finest titles, and one of the most recent on this list, Disco Elysium is a dialogue-driven RPG set in a sizable, dystopian city.",
    "Eschewing combat entirely, problems are instead solved with the use of the protagonist using the ‘Thought Cabinet’, a manifestation of dialogue choices and thematic decisions that permeate every aspect and decision made throughout the story.",
    "It’s a risky decision, but one that pays off in no small part due to personable, politically ambiguous writing that is almost entirely player-driven. It’s a must-play for PC players and is coming to console this year.",
    "Platforms available: PC (coming to console in 2021)",
    "The Yakuza games have always mixed mature themes with utterly bonkers shenanigans, and Yakuza: Like a Dragon really lets loose in the latter regard. While you can still expect plenty of hard-hitting plot points during the game’s lengthy and turbulent story, the entire fighting system has been re-imagined as a turn-based JRPG – and it works surprisingly well.",
    "Each character can take on various classes, such as becoming a crooning musician or cutesy J-Pop idol, and each has their own abilities in battle. It’s certainly a different approach, then, but one that really lets the series’ freak flag fly.",
    "Yakuza: Like a Dragon is available on PS4, PS5, Xbox One, Xbox Series X and PC. Those on the latest consoles can take advantage of some resolution and frame rate upgrades.",
    "Platforms available: PS4, PS5, Xbox One, Xbox Series X and PC",
    "Persona 5 might be the most stylish JRPG you’ll ever play. Everything from its animation, character designs, acid-jazz inspired soundtrack, and even its menus, screams cool.",
    "Telling the story of a group of jaded teens ‘changing the hearts’ of evildoers and touching on themes of abuse, breaking free from societal norms, and much more, there’s depth to Persona 5’s story and characters that only grows over the 100-hour campaign.",
    "Part social sim, part dungeon-crawler with excellent turn-based combat, the 2020 Royal version adds even more on top of the already huge base game. There are new characters, new battle elements, an entirely new dungeon and a fresh semester. It’s the best version of PS4’s finest JRPG.",
    "Platforms available: PS4",
    "Demon’s Souls is a PS5 exclusive and it’s arguably one of the best-looking action RPGs you can play on Sony’s latest console. From the spectacular lighting and hulking bosses to its phenomenal texture detail, it’s a gorgeous sight to behold. Load times are also practically non-existent, too, with level transitions taking around three seconds at most.",
    "A remake of the 2009 PlayStation 3 game, with some excellent improvements, Demon’s Souls will test your gaming chops with its punishing difficulty. However, if you have the strength to persevere, the elation that awaits is frankly unsurpassed. Just be prepared to die hundreds of times before you emerge victoriously.",
    "Check out our full Demon’s Souls review.",
    "Platforms available: PS5",
    "If you're after a classic western RPG with a great story, look no further than The Witcher 3. This game has more quality storytelling in some of its fetch side quests than some other games have in their main storylines.",
    "You are Geralt, gruff and grey-haired monster hunter chap, a sort of heroic land pirate type. This is a deep-dive adventure you'll want to set a few months aside for, a bit like Skyrim.",
    "These two duke it out as favorite accessible beards and swords RPGs, but The Witcher 3 snags the writing and moody-faced adult themes awards. While comparing the two feels natural, Skyrim is a mostly first-person game where The Witcher 3 is third-person like the other Witcher titles. It's also not easy either. You've been warned.",
    "Platforms available: PS4, Xbox One, PC and Nintendo Switch",
    "This is what you get if you take the DNA of Balder's Gate and Planescape: Torment, but start making the game almost 20 years after those titles appeared. Pillars of Eternity II: Deadfire is a classic isometric party-based RPG, a style that went out of fashion just after the turn of the millennium, but one that's good to have back.",
    "Pillars of Eternity II: Deadfire is saturated with old-school role-playing flavor. It's the story of a blighted land, and playing it is no cakewalk. You'll need strategy, as hack 'n' slash tactics don't work here. Combat is fluid rather than turn-based, but you can pause the action at any point to issue your party orders. If you played and loved Baldur's Gate or Icewind Dale, you'll feel right at home.",
    "Platforms available: Xbox One, PC, PS4 and Nintendo Switch",
    "An isometric RPG with incredible lore and world-building, Divinity: Original Sin II is a game that completely commits to the idea of player choice.",
    "From character classes that play entirely differently to one another (like the undead character that can only speak to others with a disguise) to the ability to interact with NPCs in whichever way you choose, you can play through much of the game without getting your hands dirty with combat.",
    "Thankfully if you do decide to swing your sword, combat is a turn-based treat. You can destroy an explosive barrel to deal huge damage to an enemy, or electrify a puddle to fry them.",
    "Then there’s the cast of characters, each feeling surprisingly real considering their origins, and each written with plenty of care and stuffed full of charisma. A modern classic.",
    "Platforms available: Xbox One, PC, PS4 and Nintendo Switch",
    "We still can’t quite believe that Final Fantasy 7 Remake exists. Considering it was a game that was considered vaporware for so long, the end product (or at least this first part of it) absolutely astounds with its beauty.",
    "By taking elements from many of the Final Fantasy titles that followed the 1997 original, Square Enix has crafted arguably the finest combat system the series has ever seen, allowing players to switch from one iconic party member to the next.",
    "Final Fantasy 7 Remake fills in story blanks that we didn’t know needed filling back on the original PlayStation, bringing characters to life in a way we couldn’t have dreamed possible. It’s a love letter to the franchise’s past while giving a glimpse into what’s coming in the future.",
    "Platforms available: PS4",
    "The Nioh Collection is the ultimate Nioh experience for fans and new players alike. Packing in remastered version of both Nioh and Nioh 2, plus all the DLC to date, this definitive collection is the best way to experience the action RPG series.",
    "You can play it on both PlayStation 4 and PlayStation 5. Those who are on the latest generation will be able to take advantage of some PS5 enhancements, including 4K support at up to 120fps. These improvements alongside the PS5’s fast loading times make for a stunning, brutal and fluid gameplay experience.",
    "Platforms available: PS4, PS5",
    "The Legend of Zelda franchise has long been known for quality, but in leaning into Western sensibilities and taking inspiration from the likes of Skyrim, it has reached its zenith.",
    "Breath of the Wild led many to pick up the Nintendo Switch, and for good reason – it’s an open-world that doesn’t feel crowded with side-quests and icons to unlock. Every quest is given as a suggestion, an open-ended question that doesn’t need an answer.",
    "From dozens of puzzle-focused shrines, chances to experiment with a robust physics system, or tough but rewarding combat, few games reward exploration like Breath of the Wild. Even years on from launch, players are finding fresh ways to play in this version of Hyrule.",
    "Platforms available: Nintendo Switch",
    "Leaving the ‘Dexit’ drama aside, Pokémon Sword and Shield are essentially RPG comfort food. Players can spend hours catching monsters like it’s the mid-nineties, grinding levels and aiming to breed competitive Pokémon – or you can just enjoy its campaign.",
    "In the franchise’s first mainline jump to HD, the new Galar Region is stuffed full of detail that simply couldn’t be found on the handheld-only versions. Pokémon wander the world freely, grass sways in the wind, and the new free-camera Wild Area allows for raids that can be enjoyed with friends.",
    "It might not be the quantum leap forward many were hoping for, but like its protagonists, the franchise is edging closer to being the best there ever was with every instalment.",
    "Platforms available: Nintendo Switch",
    "Strategy RPGs might be a tough nut to crack for genre newcomers, but Nintendo’s latest entry in the Fire Emblem franchise is as welcoming as you’d like it to be.",
    "Able to be played as both a relative newcomer and a hardened veteran of the series, Three Houses does away with characters found in earlier iterations and instead brings in a vast new cast.",
    "As a tutor at a monastery that prepares its students for life on the battlefield, you’ll come to know each of your charges well – and come to protect them with your life, especially if you have permadeath enabled.",
    "Borrowing Persona’s social interactions and having them factor into decisions during combat makes every decision feel critical, and with three perspectives the entire game warrants multiple playthroughs, too.",
    "Platforms available: Nintendo Switch",
    "Ready for punishment? Dark Souls III is the latest game in the series that wants to make you cry. This is a new kind of grind. It's not really about levelling-up your character, but a sort of mind-grind where you need to learn environments and enemy attack patterns to survive.",
    "It's like games from the old days, but those unflinching tangy bits are poured into a modern action role-player. Dark Souls III has the deepest RPG elements of the series to date too, even if we include Demon's Souls and Bloodborne.",
    "As well as choosing a class, your weapons have class-related skills that are a key part of getting ahead in Dark Souls III. It's not just about carefully-timed thwacks anymore.",
    "This game requires a certain mood, but for all its grim-ness, it's frequently totally beautiful too.",
    "Platforms available: PS4, Xbox One and PC",
    "If you want an RPG but have had quite enough of all the swords and sorcery nonsense, Fallout 4 needs to be on your to-buy list. As any Fallout fan will know, the game is set in a nuclear apocalypse, where every puddle of water pumps radiation into your skin and even the cockroaches are deadly.",
    "Well, if you're rubbish at the game anyway.",
    "This time around, you wake up from cryostasis in one of the bunker Vaults to find your spouse killed and your son kidnapped. You have to find him, even though he was taken 20 years before you wake up.",
    "Throw in some great quest writing and the ability to design your own little towns, and you have a bit of a role-playing winner. As with Skyrim, there is also Fallout 4 VR for people who have a virtual reality headset.",
    "Platforms available: PS4, Xbox One and PC",
    "It took about five minutes post-release for Undertale to be called a cult classic. It's a story-driven role-player with a JPRG edge, but how it approaches its battles and its work is quite different from the norm.",
    "In Undertale, combat can be non-violent. It's what you want most of the time, because you'll feel awful for hurting the game's 'enemies'.",
    "Even how you fight isn't normal. Fights take place as a bullet hell arcade-style game that plays out as your character and the enemy talk. It's an RPG that prods your emotions. It might even make you cry.",
    "Platforms available: Nintendo Switch, PS4 and PC",
    "We've been spoilt with ultra-high quality RPGs over the last few years. Dragon Age Inquisition is where to head if you find the Witcher 3 that bit too brooding and serious.",
    "You play Inquisition as an almost god-like figure. Marked with a sigil on your hand, you're a chosen one, who can close up rifts in the sky that keep appearing. Neat, right?",
    "As well as making you a bit of a medieval The Matrix Neo figure, your position means you end up with some political power at your fingertips, choosing who to tick off and not. Of course, this is the narrative story sauce atop a regular action RPG sundae. Dragon Age Inquisition is slightly less open than The Witcher 3 or Skyrim, based around large areas rather than an almost one-piece world, but it's still massive.",
    "Platforms available: PS4, Xbox One, PlayStation 3 andXbox 360",
    "If you don't mind heading back a few years for your RPG fix, you shouldn't miss Mass Effect 2. This is, so far, the sweet spot of the space opera RPG series from EA. It's much more accessible than the first Mass Effect, and much less of a thin adventure than Mass Effect 3.",
    "It is a grand space opera of a game, a sprawling story of warring factions, alien racial tensions and legitimately interesting characters that are much more than ciphers.",
    "Mass Effect 2 is also a great RPG for those who might be turned off by standard role-playing trappings - like impenetrable stat screens and chat that sounds like it has been cribbed straight from The Lord of the Rings. This is an EA game, and has a lot of that big publisher accessibility to it.",
    "Platforms available: PC, PlayStation 3 and Xbox 360"
  ],
  "headers": {
    "4": "Assassin's Creed Valhalla",
    "8": "The Elder Scrolls V: Skyrim Special Edition",
    "13": "Disco Elysium",
    "17": "Yakuza: Like a Dragon",
    "21": "Persona 5 Royal",
    "25": "Demon's Souls",
    "29": "The Witcher 3: Wild Hunt",
    "33": "Pillars of Eternity II: Deadfire",
    "36": "Divinity Original Sin II",
    "41": "Final Fantasy 7 Remake",
    "45": "The Nioh Collection",
    "48": "The Legend of Zelda: Breath of the Wild",
    "52": "Pokémon Sword and Shield",
    "56": "Fire Emblem: Three Houses",
    "61": "Dark Souls III",
    "66": "Fallout 4",
    "71": "Undertale",
    "75": "Dragon Age: Inquisition",
    "79": "Mass Effect 2"
  },
  "links": {
    "our review": "https://www.techradar.com/reviews/assassins-creed-valhalla-review",
    "Yakuza games": "https://www.techradar.com/news/yakuza-games-in-order-by-release-date-in-chronological-order-and-ranked",
    "Demon’s Souls review": "https://www.techradar.com/reviews/demons-souls-review",
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "Pokémon Sword and Shield": "https://www.techradar.com/reviews/pokemon-sword-and-shield-review",
    "Dark Souls III": "https://store.steampowered.com/app/374320/DARK_SOULS_III/",
    "Fallout 4": "https://www.techradar.com/news/gaming/fallout-4-the-good-the-bad-and-the-ugly-of-the-boston-wastelands-1308511"
  }
}