{
  "source": "https://www.techradar.com/news/xiaomis-first-cheap-phone-of-2021-is-coming-soon-but-dont-expect-mi-11-news",
  "title": "Xiaomi's first cheap phone of 2021 is coming soon, but don't expect Mi 11 news",
  "category": "phones",
  "updated": "2021-01-04T14:55:39Z",
  "author": "tom-bedford",
  "summary": "Not the launch you were expecting",
  "article": [
    "Following the Xiaomi Mi 11 unveiling on December 28 in China, fans of the brand were hoping the next Xiaomi event would be the global launch of the phone – but it turns out that's not the case, as the next Xiaomi phone is a new affordable handset.",
    "Via its Twitter account, Xiaomi confirmed the Redmi Note 9T is launching globally on January 8, via an online event hosted on Twitter, Facebook and YouTube.",
    "This phone is the successor to the Xiaomi Redmi Note 8T, an affordable smartphone that was launched in late 2019. The tweet confirms it's a 5G phone, and a follow-up tweet gave us a first look at the design, although we'll have to wait until January 8 to find out more.",
    "So Xiaomi's first event of the year isn't the Mi 11, but the company recently confirmed that a global event for its 2021 flagship is \"coming soon\", so if you're holding out for that handset you'll just have to wait a bit longer.",
    "The Redmi Note 8T launched in November 2019 alongside the Xiaomi Mi Note 10. With the one-year anniversary of the latter device having come and gone we'd given up hope that the Mi Note 11 would appear; but perhaps, like the Note 9T, it's just been delayed.",
    "Either way, Xiaomi spent much of 2020 releasing more and more new phones, and there's no reason to think 2021 will be any different. We'll be on hand to cover the Redmi Note 9T launch, and any other reveals the brand has in store."
  ],
  "headers": {
    "3": "Mi-ve over Mi 11"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi phone": "https://www.techradar.com/news/best-xiaomi-phones",
    "Twitter account": "https://twitter.com/Xiaomi/status/1346078929686122497",
    "Xiaomi Redmi Note 8T": "https://www.techradar.com/reviews/xiaomi-redmi-note-8t-review",
    "5G phone": "https://www.techradar.com/best/best-5g-phones",
    "company recently confirmed": "https://twitter.com/Xiaomi/status/1343556054945312781",
    "Xiaomi Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Mi Note 11": "https://www.techradar.com/news/xiaomi-mi-note-11"
  }
}