{
  "source": "https://www.techradar.com/news/hp-laptop-with-fast-intel-core-i5-cpu-is-a-cracking-black-friday-bargain-at-dollar379",
  "title": "HP laptop with fast Intel Core i5 CPU is a cracking Black Friday bargain at $379",
  "category": "computing",
  "updated": "2021-11-12T15:47:14Z",
  "author": "darren-allan",
  "summary": "HP’s 15.6-inch notebook is a steal at Walmart",
  "article": [
    "There’s an excellent Black Friday deal on a very affordable HP laptop at Walmart, which manages to pack in a cutting-edge 11th-gen Intel CPU while being priced at considerably under $400 (Not in the US? Scroll down for deals in your region).",
    "In fact, the HP 15-dy2095wm is a 15.6-inch laptop that’ll only set you back $379 in this Black Friday offer which is now live, although note that it just went out of stock, and has now come back in again. In other words, if you want one, we'd recommend moving quickly...",
    "At any rate, as mentioned, the star of the show here is an Intel Core i5-1135G7 processor, a quad-core (8-thread) Tiger Lake CPU capable of boosting up to 4.2GHz, and with integrated Iris Xe Graphics. It’s backed with 8GB of system RAM and a 256GB NVMe SSD for storage, plus you get Windows 11 off the bat.",
    "The Core i5 processor will see you fine for all everyday computing tasks you might throw at it, and indeed with Iris Xe Graphics, you’ll be golden for light gaming too (graphics settings will likely have to be toned down, though, and don’t expect to tackle any remotely demanding games of course – that requires a discrete GPU).",
    "In short, you’re getting a lot of power for the money with the core specs here, and the only weak point is that 256GB of storage, which is on the thin side – but for less than $400, something has got to give somewhere, and it’s not like that’s an untenable size for an SSD in a laptop.",
    "The 15.6-inch screen is Full HD resolution and benefits from fairly slim bezels, and HP claims a battery life of 7 hours and 15 minutes with a “mixed usage” workload. There’s also fast charge tech which ensures that the HP portable can charge from empty to 50% in around 45 minutes.",
    "No matter where you live, you'll find all the lowest prices for laptops from around the web right here, with offers available in your region."
  ],
  "headers": {
    "6": "More laptop deals",
    "7": "More Black Friday deals"
  },
  "links": {
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}