{
  "source": "https://www.techradar.com/news/7-new-tv-shows-and-movies-on-netflix-amazon-prime-and-more-this-weekend",
  "title": "7 new TV shows and movies on Netflix, Amazon Prime and more this weekend",
  "category": "entertainment",
  "updated": "2021-01-08T13:00:27Z",
  "author": "emma-boyle",
  "summary": "It’s a new year with new movies and TV shows to stream",
  "article": [
    "As a month, January can feel long but, thanks to the abundance of streaming services that are available to us, there are enough new TV shows and movies to ensure that it isn’t dull.",
    "We may only be finishing up the first full week of the new year, but there are a surprising number of interesting new things to stream this weekend, from light and entertaining TV series like Nicolas Cage’s History of Swear Words on Netflix to inspiring dramas like Herself on Amazon Prime Video.",
    "Below, we’ve listed some of the highlights from across the streaming services and we’ve explained how you can stream each one in the US and the UK (where possible) so that your weekend is as entertaining as can be.",
    "Do you like Nicolas Cage? Do you like swearing? Then do we have some good news for you. Nicolas Cage’s History of Swear Words is a new comedy documentary series from Netflix in which the actor explores the “history, evolution and cultural impact” of some of the most popular English-language curse words used today. It’s very much a ‘does what is says on the tin’ title, to be honest.",
    "Alongside Cage, expect to see other famous faces like comedian Sarah Silverman and actor Nick Offerman as well some real experts in the field of language and swearing. This is a good watch if you’re interested in the etymology of swear words, yes, but it’s also worth a look if you just want to see Nicolas Cage swear for a bit.",
    "Now streaming on Netflix",
    "Lupin is a brand new Netflix Original series which stars Omar Sy as Assane Diop, a man whose life was turned upside down when he was a teenager after his father was accused of a crime he didn’t commit by a wealthy family. The series follows Assane 25 years later when he uses “Arsène Lupin, Gentleman Burglar” as his inspiration to stage a heist that will avenge his now-dead father.",
    "Now streaming on Netflix",
    "Pieces of a Woman is a new Netflix film directed by Kornél Mundruczó on his first English-language outing with Vanessa Kirby in the leading role. Telling the story of “a heartbreaking home birth” which “leaves a woman grappling with the profound emotional fallout, isolated from her partner and family by a chasm of grief”, Pieces of a Woman is an emotionally impactful, personal drama. The film is sitting at a strong 78% on Rotten Tomatoes at the moment and lead actress Vanessa Kirby is generating a great deal of attention for her performance; after picking Best Actress at the Venice Film Festival there's now some Oscars buzz surrounding her.",
    "Now streaming on Netflix",
    "Attention documentary and sports fans: Tiger is a new documentary from HBO which is set to tell the story of the rise, fall and eventual comeback of Tiger Woods. Expect never-before-seen footage as well as interviews with some of those who can claim to have been closest to him over the course of his career. Tiger will be shown in two parts, with the first arriving this week and the second coming next week.",
    "Part 1 of Tiger will premiere on HBO and HBO Max on January 10 in the US. A UK release for streaming is yet to be detailed.",
    "After a limited release in cinemas, Herself is now available to stream on Amazon Prime. This drama, directed by Phyllida Lloyd (Mamma Mia) with its co-writer Clare Dunne also acting in the leading role, follows Sandra, a mother of two young daughters, who escapes her abusive husband and sets out to build her own home when she’s failed by the housing system. Herself has a very strong 91% rating on Rotten Tomatoes and its reviews, which have praise for Claire Dunne’s performance and the film’s empowering story, suggest that we can expect a much-needed uplifting story.",
    "Now streaming on Amazon Prime Video in the US. Unfortunately, this one isn't available on Amazon Prime Video in the UK just yet—its expected theatrical release has been delayed.",
    "After a long wait, Dickinson fans are finally getting to tune into the second season of Apple’s popular series about one of America’s favorite poets. With Hailee Steinfeld reprising her leading role, expect this season to explore Emily Dickinson’s relationship with fame as she’s “pulled out of her private literary life and thrust into the public eye.” This is a period piece with warmth and humor—perfect for chasing away any January blues.",
    "As an extra-indulgent treat, the first three episodes of the new season available to stream now with future episodes arriving weekly on Fridays.",
    "Now streaming on AppleTV+",
    "If you’re getting excited about Phase 4 of the Marvel Cinematic Universe and the final week’s wait for its first series WandaVision feels interminable then Marvel Studios: Legends could be just the show you need to keep the hype going. Or to refresh your memory; it's been a long year.",
    "This new series, exclusive to Disney Plus, will take viewers deeper into the stories of their favourite MCU characters, with each episode focusing on an individual character. The first two episodes, available from January 8, will feature Wanda Maximoff and Vision ahead of the premiere of WandaVision on January 15.",
    "Marvel Studios: Legends is primarily aiming to set the stage for the next phase of the MCU so it could also be ideal viewing for those who aren’t completely up to date with all of the latest goings on in the MCU and watch to get some background information ahead of trying the new shows.",
    "Now streaming on Disney Plus"
  ],
  "headers": {
    "3": "Nicolas Cage’s History of Swear Words (Netflix)",
    "6": "Lupin (Netflix)",
    "8": "Pieces of a Woman (Netflix)",
    "10": "Tiger (HBO Max)",
    "12": "Herself (Amazon Prime Video)",
    "14": "Dickinson (Season 2) (Apple TV+)",
    "17": "Marvel Studios: Legends (Disney Plus)"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained"
  }
}