{
  "source": "https://www.techradar.com/news/hmd-globals-debut-android-tablet-is-a-cheap-amazon-fire-hd-10-rival",
  "title": "HMD Global's debut Android tablet is a cheap Amazon Fire HD 10 rival",
  "category": "tablets",
  "updated": "2021-10-06T09:00:36Z",
  "author": "tom-bedford",
  "summary": "The Nokia T20 is a really affordable tablet",
  "article": [
    "After a few months of speculation and teases, HMD Global has unveiled its debut Android tablet, the Nokia T20. This isn't the first-ever Nokia tablet we've seen, but the first since HMD bought the rights to the Nokia name.",
    "The Nokia T20 is a super-affordable tablet, that's best placed as a competitor to the Amazon Fire HD 10 - it has a similar screen size and price, and is targeted at the same kind of audience.",
    "That audience is families, a point HMD Global repeatedly made in the media briefing - this is designed to be a tablet that a group of variously-aged relatives can pass around, and all get different uses from. It comes pre-loaded with Google's Entertainment Space and Kids' Space - no points for guessing what they're for - and has a big battery for when no-one wants to take responsibility for charging the thing.",
    "Unlike the aforementioned Amazon tablet, the T20 isn't locked to Amazon's restrictive Fire OS operating system, instead boasting stock Android.",
    "The Nokia T20 comes with a 10.4-inch screen as well as a low-end Unisoc T610 chipset, a big 8,200mAh battery and a front and back camera - there's also a 3.5mm headphone jack so you can plug headphones in.",
    "As with most Nokia products, this is an affordable device, starting at just £179 (roughly $240, AU$330) in the UK - HMD Global suggested a US launch could be on the cards, but no solid information on that was provided.",
    "Strangely, no official keyboard folio or stylus is going on sale (unless third-party manufacturers take it upon themselves to provide these extras), so this probably isn't a great choice for students or business users, but then again that's not the audience HMD is aiming for.",
    "We've already tested the tablet, although only briefly, and you can find out our thoughts in our Nokia T20 hands-on review - expect our full thoughts shortly.",
    "For a long time now, year-on-year sales for tablets have been dropping, according to Statista, but that was completely changed with worldwide Covid lockdowns. That's not exactly a surprise, given we were all stuck inside working, learning and 'relaxing' for the best part of 18 months - tablets can be useful for work or play.",
    "As a result, we've seen a massive resurgence in inexpensive Android tablets with the Huawei MatePad 11, Realme Pad, Xiaomi Pad 5 and a few more all breaking cover in the last few months. Clearly, companies are hoping there's a big enough market for lots of slates.",
    "The Nokia T20 is one of the most affordable slates we've seen, and it could prove popular for this reason - though the 2K screen and hardy body increase its appeal. However the T20 isn't really competing with those other tablets - they're all 'in it together' against the changing markets.",
    "With global lockdowns ceasing, and Covid-19 becoming increasingly a thing of the past, it remains to be seen whether the tablet market will live again. Perhaps buyers around the world have now rediscovered the slates, and will keep picking up new ones when they need to - or maybe, now we can go back to work or school, we'll be returning to our handy smartphones or laptops."
  ],
  "headers": {
    "8": "Analysis: a boom in Android tablets"
  },
  "links": {
    "Android tablet": "https://www.techradar.com/news/mobile-computing/tablets/15-best-android-tablets-in-the-world-905504",
    "Nokia T20": "https://www.techradar.com/reviews/nokia-t20-review",
    "Amazon Fire HD 10": "https://www.techradar.com/reviews/amazon-fire-hd-10-2021-review",
    "Nokia T20 hands-on review": "https://www.techradar.com/reviews/nokia-t20-review",
    "Statista": "https://www.statista.com/statistics/272070/global-tablet-shipments-by-quarter/",
    "Huawei MatePad 11": "https://www.techradar.com/reviews/huawei-matepad-11-review",
    "Realme Pad": "https://www.techradar.com/news/realme-pad-android-tablet",
    "Xiaomi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review"
  }
}