{
  "source": "https://www.techradar.com/news/ios-15-is-out-now-heres-how-it-changes-your-iphone",
  "title": "iOS 15 is out now - here's how it changes your iPhone",
  "category": "computing",
  "updated": "2021-09-20T17:02:58Z",
  "author": "daryl-baxter",
  "summary": "The focus behind the iOS curtain",
  "article": [
    "After months of speculation and improvements during its public beta, iOS 15 is now available for the iPhone 6S and above.",
    "It’s a software update that focuses on productivity, privacy and connectivity, with some features being delayed for a future release.",
    "However, at first glance, your iPhone may look similar to before you updated. But once you dig deeper, there’s plenty that makes iOS 15 a substantial release.",
    "While this year has a bunch of new features there are a few key ones we’d recommend taking note of, as it’s likely you’ll come across them within the first five minutes.",
    "Notifications see another refinement, with the new Focus feature now able to quietly deliver them at certain times or locations. You can also create custom profiles for notifications, so if you work from nine to five, anyone who messages you will be informed that you’re at work without you having to do anything. .",
    "These are also synced across your other Apple devices thanks to iCloud, so you only need to create a profile once, and it’ll match across your iPad, Mac and more.",
    "FaceTime sees some improvements in this first release of iOS 15, where you can send a web link to anyone to join a call, similar to Zoom and Google Meets. This works with someone who has a Windows PC or an Android smartphone, so if there’s a quick meeting you need to create, FaceTime can now add to the sudden video conference calls each week.",
    "Safari has seen some major changes in iOS 15, too. The address bar can now be moved to the bottom, saving your thumb some extra work in reaching it. The user interface also adapts to the website you’re viewing at the time. For example, if the website you’re reading is in red Safari will adapt to that same shade.",
    "You can also swipe on the address bar to switch between your active tabs, cutting out the need to open a new window where in iOS 14 the software would show in a card stack.",
    "Finally, the weather app has seen some major improvements, with new animations to reflect the current weather, alongside notifications for when it’s about to rain. There’s also maps that can show you an animated timeline in which you can follow the path of a storm, or the rate of snow and rain.",
    "The newest update for your iPad also sees some new features, albeit upgrades we saw come to iPhone back in 2020.",
    "Widgets are finally untethered from the column in iPadOS 15, so you can place and arrange as many widgets as a home screen requires. There’s also a bigger XL widget size for iPad, so you can have one covering up to one third of a home screen.",
    "Multi-tasking also sees a redesign once more for iPadOS, where you can easily launch apps in split-view by pressing the three dots at the top of every app. Previous to iPadOS 15, the only way you could launch another app was from the dock. But now you can access any app from your home screen and the software will bring it alongside another app.",
    "App Library is also here from iOS 14, making it easier to manage your apps. All the other features from iOS 15 you’ve read about are also here, apart from a dedicated weather app.",
    "This is a new feature in iOS 15, iPadOS 15 and soon macOS 12 Monterey where you can watch or listen to content with friends and family, with the help of FaceTime.",
    "While Apple showcased it at WWDC 2021 and it was available to use in the public betas, the company removed it in August explaining that more time was needed to get it ready.",
    "Expect to see SharePlay in a future release soon, most likely iOS 15.1."
  ],
  "headers": {
    "3": "What to take notice of in iOS 15",
    "10": "What about iPadOS 15?",
    "14": "Where’s SharePlay?"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update"
  }
}