{
  "source": "https://www.techradar.com/news/google-wants-your-business-to-buy-lots-of-pixel-phones",
  "title": "Google wants your business to buy lots of Pixel phones",
  "category": "phones",
  "updated": "2021-02-15T11:30:37Z",
  "author": "mike-moore",
  "summary": "New Google Pixel for Business site wants to entice enterprise customers",
  "article": [
    "Google has launched a new site aimed at attracting companies into buying its Pixel phones for business use.",
    "The company's new Pixel for Business site looks to show off the potential of its devices for business use as Google looks to shift more of its phones to customers around the world.",
    "Noting that \"the Google phone\" is \"built for business\", the site looks to show how the range of devices - namely the Pixel 4a, Pixel 4a 5G and Pixel 5, can be a useful addition to your business' suite of products.",
    "The site goes on to emphasise the security features of the Pixel devices, which are \"safe and secure, all by design\". Among the highlighted features are the Titan M security chip, Google security services, biometric protection via fingerprint and face unlock, and three years of security and OS updates.",
    "Google also looks to promote the mobile device management (MDM) advantages to using Pixel phones, which is says can be done \"simply and seamlessly\". The site notes that Pixel devices can reprotedly be deployed to works straight out of the box, are highly customisable with a wide range of management APIs, and can offer separate work and personal profiles for extra safety and privacy.",
    "\"Pixel is designed with all the tools and technology to support your business needs across hardware, software and built-in AI,\" Google notes.",
    "The launch comes as many businesses and their emploees continue to adapt to the new way of working caused by the coronavirus pandemic and related stay-at-home lockdowns. This has necessitated new ways of communication and collaboration, with many firms spending big to make sure their workers have up-to-date devices capable of keeping connected wherever they are.",
    "There's no mention of any enterprise-specific pricing or deals for Pixel devices, which Google has sold to consumers mainly via its own online store. However the UK version of the Pixel for Business site mentions relationships with some of the country's top mobile resellers, so such deals may be on offer.",
    "Via 9to5Google"
  ],
  "headers": {
    "3": "Pixel for Business"
  },
  "links": {
    "phones for business": "https://www.techradar.com/news/best-business-smartphone",
    "Pixel for Business": "https://pixel.google/intl/en_gb/business/",
    "Pixel 5": "https://www.techradar.com/deals/google-pixel-5-deals",
    "9to5Google": "https://9to5google.com/2021/02/14/google-pixel-for-business/"
  }
}