{
  "source": "https://www.techradar.com/news/intel-rocket-lake",
  "title": "Intel Rocket Lake release date, specs and price – everything we know",
  "category": "computing",
  "updated": "2021-01-11T21:30:10Z",
  "author": "bill-thomas",
  "summary": "Trimming back to 8 cores and focusing on frequency at CES 2021",
  "article": [
    "At CES 2021, Intel has followed up its 10th-generation Comet Lake-S processors with new Rocket Lake-S processors, led by the Intel Core i9-11900K, just under a year later.",
    "This marks a remarkably short generation of processors for 10th-generation Comet Lake processors like the Core i9-10900K, but Intel has brought some new features and compatibility that soften the blow a bit. Namely, the new 11th-generation processors will be compatible with existing 400-series motherboards after a BIOS update, and this new generation brings PCIe 4.0 compatibility to Intel's desktop platforms for the first time.",
    "Intel Rocket Lake processors were announced at CES 2021, but aren't available yet. We still don't have a solid release date. However, with all the rumors pointing to a March release date even before CES, and with Intel claiming they're coming \"later in Q1,\" we're sure they'll come out within the next couple of months.",
    "Led by the Intel Core i9-11900K, these processors will peak at 8 cores and 16 threads, which might seem like a bit of a step back from the Core i9-10900K's 10 cores and 20 threads. Intel claims that by backporting the 10nm Cypress Cove core design to the 14nm manufacturing node, there are simply too many transistors to fit more than 8 cores on the CPU die. However, that loss of two cores in the flagship comes with a supposed 19% uplift in Instructions per Clock (IPC) performance.",
    "Through this, Intel is claiming to be able to beat the AMD Ryzen 9 5900X by up to 7% in games, though with the sheer amount of cores Team Red's processor offers, it'll probably still pull ahead in creative workloads. All of these performance claims will have to be tested in-house, and you can bet we'll be getting right on that as soon as we get the chance to give these processors a full review.",
    "Right now, we only have information on one Intel Rocket Lake processor, the Core i9-11900K, but we will update this page as we learn about the rest of the lineup, likely starting next month.",
    "Here are all the processors in the 11th-gen Rocket Lake-S lineup and the specs:",
    "All we have to point to the performance of these new Intel processors are the claims of Intel. Until we get them in-house for a full review, we can't definitively say what they can do one way or another, but that doesn't mean we can't talk about it.",
    "With these Rocket Lake-S processors, Intel is again emphasizing the importance of frequency and IPC performance. And, we can't even necessarily blame Intel for that. Traditionally, when it comes to PC gaming, single-threaded performance has always been king, and still is when it comes to games that aren't pushing the boundaries of what hardware can do. You don't exactly hear of League of Legends pushing Ryzen's 12 cores to their limits.",
    "However, as always, it brings up the question of what this performance will look like in the future. And, really, it's a tossup right now. According to the December 2020 Steam Hardware Survey, which is one of the best ways to look at hardware adoption, most people are still using either 4-core or 6-core processors. 8-core processors like the Core i9-11900K still only make up 11.51% of the market, and 12-core processors just 0.67%.",
    "At the same time, though, both the PS5 and Xbox Series X have 8-core Zen 2 processors from AMD. This could help influence how developers optimize games for multi-core processors.",
    "Really, we won't know whether multi-threaded performance will supersede single-core performance as the most important thing for PC gaming. But right now, just looking at the PC space, single-core performance is still extremely important.",
    "Intel did deign to include PCIe 4.0 compatibility this time, though, and honestly, it's about time. There are a number of 400-series motherboards that are already PCIe 4.0 ready, so if you have one of those and want to take advantage of an ultra-fast SSD, you can just update the BIOS and plug in one of these 11th-gen processors when they become available. You will, however, need to check with your motherboard manufacturer to make sure the board is compatible.",
    "Like always, when picking out the right platform – whether it's Intel Core or AMD Ryzen – we urge you to really look at what you plan to do with the PC and what games you play, and check how performance looks for the workloads that matter to you. Even if these Intel processors come out and hit all the promises Intel is making here at CES 2021, there is no \"best processor\" for absolutely everyone."
  ],
  "headers": {
    "2": "Intel Rocket Lake release date",
    "3": "Intel Rocket Lake specs",
    "7": "Intel Rocket Lake performance"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Comet Lake-S": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "Rocket Lake-S": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
    "December 2020 Steam Hardware Survey": "https://store.steampowered.com/hwsurvey/Steam-Hardware-Software-Survey-Welcome-to-Steam",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Zen 2": "https://www.techradar.com/news/amd-zen-2",
    "best processor": "https://www.techradar.com/news/best-processors"
  }
}