{
  "source": "https://www.techradar.com/news/graphics-card-maker-warns-on-dangers-of-buying-second-hand-mining-gpus",
  "title": "Graphics card maker warns on dangers of buying second-hand mining GPUs",
  "category": "computing",
  "updated": "2021-08-01T14:24:38Z",
  "author": "darren-allan",
  "summary": "Used market is more of a minefield than ever",
  "article": [
    "With China’s cryptocurrency crackdown, we’ve been hearing about GPUs previously employed in mining setups being sold second-hand, but for those feeling tempted to pick up what might seem like a bargain – or at least a reasonably priced product – one graphics card maker has attempted to clarify the dangers involved in picking up an ex-mining card.",
    "Palit has been talking to Polish tech site Benchmark.pl (as flagged by PC Gamer), and notes that going by independent testing carried out on graphics cards which have been used for crypto-mining, a 10% drop in GPU performance can be expected for each year the board has been used for 24/7 mining (so almost 9,000 hours of constant usage equals a 10% drop).",
    "Of course, this makes some assumptions, but it’s delivered as an average expectation of the performance baggage an ex-mining graphics card might carry. There is, of course, no way of really knowing how hard the miner may have driven any particular resold GPU, and as PC Gamer points out, some folks are more careful than others – and may even have undervolted the card for better efficiency, and looked after it somewhat.",
    "However, it’s more than likely that graphics cards involved in mining operations will have been abused, being pushed hard 24/7, and running hot in badly ventilated environments, so they likely won’t be in great shape as Palit is pointing out.",
    "A further problem is that miners realize that when folks see a card is an ex-mining board, they’ll be more wary and less likely to buy, so the obvious thing to do is lie and not admit that the GPU has been one of those toiling away in the heat of the mines. They will simply claim that these are nearly-new cards, or indeed repackage them to look like entirely new products.",
    "In other words, as we’ve argued before, with the influx of second-hand mining GPUs going on, you’ve got to be very careful about the used market for graphics cards full-stop. In particular, look out for suspicious things like a card for sale having had the stock cooler replaced (not something you’ll normally see).",
    "Naturally, Palit has something of a bias here in persuading folks that they should be buying new rather than used GPUs, seeing as that’s its business. But the dangers inherent in picking up such a graphics card are something that we’ve warned about in the past, as mentioned above, and there are clear risks involved.",
    "Buying a second-hand GPU is a bit of a minefield (ahem) at any time, but with big mining operations closing up shop, if used cards need to be shifted, it’s obviously in their interest to do that sharpish before the market corrects further (while extortionate prices and stock difficulties are still a thorn in buyers’ sides – a reality that seems to be changing, slowly but surely). So right now, it is a point worth making that buyers of used graphics cards – or more to the point, purportedly new GPUs on the likes of eBay and StockX – should be more careful than ever about who they’re buying from.",
    "Of course, the cryptocurrency mining crackdown is also good news in terms of the prices of new GPUs going down as well, with the crypto side of the demand equation falling off. All of which means that unless you’re really, really desperate, playing a waiting game for now, rather than leaping at buying a graphics card, is likely the smartest choice to make."
  ],
  "headers": {
    "6": "Analysis: Clear and present danger"
  },
  "links": {
    "we’ve been hearing": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown",
    "Benchmark.pl": "https://www.benchmark.pl/aktualnosci/karta-graficzna-z-koparki-kryptowalut-warto-kupic.html",
    "PC Gamer": "https://www.pcgamer.com/uk/palit-used-mining-graphics-cards-advice/",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "as we’ve argued before": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown",
    "mining GPUs": "https://www.techradar.com/best/mining-gpu",
    "warned about in the past, as mentioned above": "https://www.techradar.com/news/cryptominers-are-selling-off-rtx-cards-in-bulk-after-chinas-crypto-crackdown",
    "reality that seems to be changing": "https://www.techradar.com/news/graphics-card-prices-are-finally-crashing-but-hold-fire-on-buying-one",
    "prices of new GPUs going down": "https://www.techradar.com/news/china-crypto-mining-crackdown-could-give-you-a-better-chance-of-getting-a-new-rtx-3080"
  }
}