{
  "source": "https://www.techradar.com/news/samsung-galaxy-s21-could-be-among-the-first-phones-to-get-android-12",
  "title": "Samsung Galaxy S21 could be among the first phones to get Android 12",
  "category": "phones",
  "updated": "2021-06-21T08:48:42Z",
  "author": "james-rogerson",
  "summary": "Work has apparently started",
  "article": [
    "Samsung makes excellent smartphones, but one thing it’s not usually so excellent on is timely software updates, with even its flagship phones often not being among the first handsets to get new Android versions. But that could all change with Android 12.",
    "According to Max Weinbach (a leaker with a solid track record), Samsung has started development of Android 12 for the Samsung Galaxy S21, Samsung Galaxy S21 Plus, and Samsung Galaxy S21 Ultra. Given that Samsung reportedly didn’t begin work on updates to Android 11 until August of last year, this is very promising.",
    "The Samsung Galaxy S20 range didn’t start getting Android 11 until December 2020, but if this leak is right then Samsung could be a couple of months ahead, meaning we might see Android 12 on the Samsung Galaxy S21 range in October. There’s even a chance it will arrive at or around the same time as Android 12 first launches for any phones, which it’s likely to do in September.",
    "Of course, this is just speculation for now, especially as it’s possible that this leak is inaccurate, so we’d take it with a pinch of salt.",
    "It’s worth noting also that Samsung isn’t currently part of the Android 12 beta program, suggesting that it still started work on Android 12 builds later than the companies that are already offering betas on some of their phones.",
    "Still, if the above leak is true then this is a definite step in the right direction, and with Samsung also promising three years of operating system updates for many of its phones, it could soon be among the very best Android phone makers for software support.",
    "Via Phandroid"
  ],
  "headers": {},
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Max Weinbach": "https://twitter.com/MaxWinebach/status/1406026982660390915",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Samsung Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "until August of last year": "https://twitter.com/MaxWinebach/status/1406030904930226179",
    "Android 12 beta": "https://www.techradar.com/how-to/how-to-get-the-android-12-beta-on-your-smartphone",
    "promising three years of operating system updates": "https://www.techradar.com/news/how-future-android-updates-for-samsung-phones-will-work",
    "Phandroid": "https://phandroid.com/2021/06/21/android-12-for-samsung-galaxy-s21-could-arrive-by-end-of-the-year/"
  }
}