{
  "source": "https://www.techradar.com/news/tcl-tv-catalog-2019",
  "title": "TCL TV 2021 range: every new TCL TV for this year",
  "category": "televisions",
  "updated": "2021-11-23T07:59:33Z",
  "author": "olivia-tambini",
  "summary": "Every TCL TV to consider in 2021",
  "article": [
    "In 2020, TCL launched a number of new TVs, proving you don’t need to pay a small fortune to get a good new TV. Now we’re nearing the end of 2021, the brand is continuing this trend.",
    "TCL might not produce the best of the best TVs, but its 2021 releases are all solid choices packed with TV tech in affordable packages. This is why, over the past few years, TCL has rapidly taken over the mid-range TV space.",
    "In fact, TCL has held a steady 10 per cent market share of the global LCD TV market over the past few years as one of the largest TV manufacturers alongside Samsung and LG. In recent times, it's announced plans to bring a Pro version of its flagship X925 8K Mini LED TV to Australia too. That means it's more likely than ever that you'll come across a TCL TV in your hunt for the perfect television for your home.",
    "That's likely to be increasingly the case in the future too. TCL has big plans for its upcoming TV ranges over the coming years, including OLED TVs that could go as large as 110 inches.",
    "The brand has brought us a range of TV tech over the years, That includes budget HDR sets to 8K QLEDs. 2020 marked the first time that TCL brought QLED TVs to the UK, along with a new 8K TV (the TCL X915), which is now IMAX Enhanced certified. It also includes Roku TV in many of its TV sets now – which was new to the UK earlier this year.",
    "What we feel makes TCL standout is its Mini LED offering. The brand deserves recognition for being the first TV maker to commercialise the technology, before the likes of Samsung, LG or Philips got in on the action.",
    "It’s already making plans to shake up the mid-range TV space in 2022 and beyond with the announcement of a new bunch of Mini LED TVs, including the X925 and X925 Pro. Both pack in 8K resolution and the latest iteration of TCL's Mini LED backlights.",
    "Short on time? Read our guide to the 5 best TCL TVs you can buy this year. If you want to see the full 2021 line-up so far and see how it compares to previous years, keep reading to see everything you need to know about TCL's latest TVs.",
    "A number of new TCL TVs are only available in the US in 2021. This includes the TV maker's 5-series, 6-series and 8-series sets, as well as TVs aimed at those with larger spaces.",
    "TCL 5-Series 4K QLED Roku TV (available in 50, 55, 65, 75-inch): More upgrades are coming, with a QLED facelift for the much-loved 5-Series TV range, which has been one of our favorite cheap TVs since its 2018 release. QLED brings an expanded color gamut to the 5-Series at a starting price of just $399.",
    "Read our TCL 4K QLED Roku TV review",
    "TCL 6-Series Mini LED 4K Roku TV (available in 55, 65, 75-inch): One of the TVs we're most excited about this year is the all-new TCL 6-Series QLED TV with Mini LED that should boost the contrast and black levels to rival OLED while retaining TCL's signature budget price point. These TVs went on sale on August 11 2020.",
    "TCL 8-Series Mini LED 8K Roku TV (available in 65, 75-inch): A Mini LED TV, a QLED TV, an 8K TV, and Roku TV all rolled into one. This is an 8K version of the TCL 8-Series launched in 2019, and you can expect quantum dot-assisted contrast, advanced upscaling, improved viewing angles, and Dolby Vision support to boot. Due to launch in the US (and Europe) in 2020.",
    "Read our hands-on TCL 8-Series Mini LED 8K Roku TV review",
    "XL Collection: A number of TCL’s US TVs come under the XL Collection umbrella. This is a collection of TVs that exceed 80-inches but have a number of different features. The idea being they’re for people who want to go big with their home cinema but want choice about which features to opt for.",
    "TCL X925PRO (85-inch): One of the XL Collection is the X9 series, TCL's new 85-inch OD Zero mini-LED powered 8K TV. It has a super thin design, Dolby Atmos 3D audio and FullView edge-to-edge glass. It’s also packing TCL’s latest OD Zero technology, as well as Google TV. With four HDMI inputs, two of which are HDMI 2.1, low latency and high refresh rates, it’s a great option for gaming. The X9 will be available in the US later this year for $9,999.99.",
    "In Europe and the UK, you won't find all of the TVs listed above, but there are new Mini LED TVs, a range of HDR smart TVs and a new 4K OLED, too.",
    "TCL Roku TV RP620K Series (available in 43, 50, 55 and 60-inch sizes): This is the 4K Roku TV from TCL this year, which comes in a range of sizes. There’s HDR Dolby Vision support, as well as lots of apps and features. During our testing, we concluded the RP620K is a great 4K TV option on a budget. The TCL Roku TV RP620K Series is available now.",
    "Read our full review: RP620K",
    "TCL Mini LED 4K C825 Android TV (55 and 65-inch sizes): The only QLED Android TV you’ll find that has TCL’s Mini LED technology inside, along with a Quantum Dot display. It also has 4K HDR, Dolby Vision IQ, Android TV with Google Assistant and a Onkyo 2.1 soundbar built-in, all within a very slim design thanks to the Mini LED. The TCL C825L Series is available in the UK now for £1299 and £1499.",
    "RS520K HD TCL ROKU TV (32, 40-inch sizes): An affordable HD TV model, running on Roku OS, the larger size of the RS520K comes with a full HD display and a 1080p resolution at £279 and the smaller HD display has a 720p display at £229.",
    "TCL X925PRO (85-inch): TCL's new 85-inch OD Zero mini-LED powered 8K TV is going to be available in both the US and the UK. It has a super thin design, Dolby Atmos 3D audio and FullView edge-to-edge glass. It’s also packing TCL’s latest OD Zero technology, as well as Google TV. With four HDMI inputs, two of which are HDMI 2.1, low latency and high refresh rates, it’s a great option for gaming. The X9 will be available in the UK in 2022, no word on pricing in this region yet though.",
    "TCL X925 (65 and 75-inch): Unlike the Pro version, this 8K TV comes in smaller sizes with 65 and 75-inch models on offer. The other notable difference is the non-Pro version doesn't have the OD Zero backlight tech. However, there's still a lot to be excited about here, including Mini LED, support for HDR10, HDR10+, HLG, and Dolby Vision IQ as well as an integrated soundbar.",
    "TCL C728K (55 and 65-inch sizes): A 4K TV with a Quantum Dot display with 4K HDR Pro, there’s no Mini LED here or integrated soundbar, like many of the models above. However, there is support for all the latest HDR formats, including HDR10+, Dolby Vision and Dolby Vision IQ. Onkyo speakers are on-board for immersive Dolby Atmos sound quality.",
    "TCL C725K (50, 55, 65 and 70-inches): One of the more affordable models from TCL compared to its 8K counterparts, the TCL C725K is similar to the C71 we saw in 2020. There’s a QLED panel here, as well as HDR10+ and Dolby Vision support. It has a streamlined design and Onkyo speakers are on-board. Prices start at £549 for the 50-inch model.",
    "So what makes a TCL TV a TCL TV? One of the defining traits of TCL TVs is that many have Roku TV built-in, which appears in most of the mid-range models in North America and recently arrived on TCL TVs in the UK too.",
    "By leveraging Roku's strengths, TCL TVs have an incredible library of subscription-based streaming services like Hulu, Netflix, and Amazon Prime Video.",
    "TCL's focus in 2020 was on enhancing existing TV ranges with QLED and Mini LED technology, as well as pushing further into 8K resolution technologies. TCL co-founded the 8K Association, which works to “define 8K display performance standards and support the outreach and promotion of 8K to consumers and to industry partners, like streaming services.\"",
    "As its name implies, Mini LED panels pack in more LEDs into each inch of a screen than traditional TVs – over 25,000 in the 75-inch 8-Series Mini LED TV – promising even light distribution, uniform color reproduction and wider viewing angles.",
    "TCL has already beefed up its Mini LED offering with OD Zero. The OD refers to the optical distance between the Mini-LED backlight layer and the LCD screen, which is eliminated in OD Zero TVs so TCL can create thinner TVs with better images and performance.",
    "The first TCL TVs with HDMI 2.1 support have arrived in 2021 too, enabling 8K/60Hz and 4K/120Hz video passthrough over cable input.",
    "TCL's QLED (quantum dot) displays support a wide color gamut display, approaching 100% of the DCI-P3 color space coverage. This, alongside TCL’s Mini LED technology, should make for more vibrant colors, heightened contrast, and better viewing angles.",
    "TCL doesn't currently trade in OLED TVs, though it does have plans down the line for OLED panels that feature emissive quantum dot pixels: something that we know Samsung is working on too.",
    "TCL continues to work on a number of more unusual form factors, like massive curved screens and concrete subwoofers, though most don't usually make it to western markets.",
    "Although, TCL's XL Collection features a range of TVs that exceed 80-inches but have a number of different features. The idea being they’re for people who want to go big with their home cinema but want choice about which features to opt for.",
    "TCL's 6-Series TVs have gained popularity in the last few years and have long-offered cutting-edge features like full-array local dimming, quantum dot and, as of last year, Mini LED as well, and now you can add 8K resolution to the list, too. Earlier this year TCL announced that its uber-popular 6-Series TVs will have 8K support.",
    "Reading in the UK? Here's our pick of the best TCL sets of 2020.",
    "TCL C71 QLED (available in 50, 55, 65-inch): The first TCL QLEDs to hit the UK start with the C71, a 4K HDR television running on the Android TV OS. Featuring a \"frameless\", zero-bezel design and adjustable TV stand, along with multi-HDR support and voice assistant integration, it has the trappings of a high-end television but starts at just £499 for the smallest 50-inch model. Now available in the UK.",
    "TCL C81 QLED (available in 55, 65, 75-inch): The C81 takes things up a notch with an Onkyo soundbar and Dolby Atmos support, but otherwise cleaves pretty close to the C71. Now available in the UK.",
    "TCL X915 8K QLED (available in 75 inches): This 8K TV is IMAX Enhanced certified, meaning you can watch compatible films in an IMAX aspect ratio and crisp 4K HDR picture. There's no release date for the UK yet, though, so hold tight to find out when it's announced. (It's currently rolling out to the rest of Europe and Australia, though.)",
    "TCL P715K 4K TV (available in 43, 55, 65, 75-inch): This 4K TV starts at just £379 for its smallest 43-inch size, and comes with support for hands-free voice control through Alexa. Releasing in September, with the 75-inch model following later in October.",
    "TCL X10 QLED (available in 75 inches): At CES 2019, we discovered that the 8K 2019 TCL Roku TV (or TCL X10 QLED outside the US) boasts QLED and mini LED technology for improved picture quality. Specifically, these smaller LEDs offers more local dimming, with 300% more contrast control zones compared to its last-generation sets.",
    "This creates deeper blacks, more vibrant colors and, most importantly, better viewing angles. Support for 8K, Dolby Vision, and Quantum Dot display technology should make for an impressive picture, particularly in the flagship 75-inch model.",
    "It also has an integrated Onkyo soundbar, which supports Dolby Atmos, and is 14.5mm at its thinnest point.",
    "TCL 8-Series (available in 75 inches and larger): The forthcoming TCL 8-Series 8K Roku TV takes a lot of what we liked about the TCL 6-Series 4K Roku TV and quadruples the pixel count while slimming down the thickness. At the starting size of 75 inches, it's a sight to behold.",
    "Like the 2019 TCL Roku TV, the new 8-Series has QLED and mini LED technology for a clear, precise, and vibrant display. The TCL 8K TV also supports a wide color gamut display, approaching 100% of the DCI-P3 color space coverage, Dolby Vision, and more of the ultra-contrast control zones tech we've seen on TCL's higher-end 6-Series televisions.",
    "The 75-inch flagship model can skillfully convert today’s 4K and full HD resolution content and delivers a new sense of depth and clarity, says the company. It'll also be future-proofed for when native 8K content does get here thanks to HDMI 2.1 support.",
    "Like the 2019 TCL Roku TV, it has a built in Onkyo soundbar with Dolby Atmos support.",
    "TCL 6-Series (available in 55, 65, and 75 inches): 2018’s TCL 6-Series has been updated to include a new 75-inch model for 2019. Models in the 6-Series boast three types of HDR support, Roku TV, and copious amounts of LED control zones.",
    "The TCL 6-Series is available now, at a special pre-order introductory price of $649 for the 55” (55R617), $999 for the 65” (65R617) screen size, and $1800 for the 75” (75R617).",
    "Model numbers: 55R617, 65R617, and new for 2019, the 75R617",
    "TCL 5-Series (available in 43, 49, 55, and 65 inches): 2018 saw the launch of the TCL 5-Series, a little brother to the 6-Series that packs many of the same features. You can expect HDR Pro Gamma and support for the three main types of HDR, plus Wide Color with NBP Photon technology and Roku TV built-in. As far as motion is concerned, the 5-Series has 240 Natural Motion technology … which probably equates to a native refresh rate of 120Hz.",
    "The TCL 5-Series is available now at $429.99 for the 43” (43S517), $449.99 for the 49” (49S517), $499.99 for the 55” (55S517), and $899.99 for the 65” (65S517).",
    "Model numbers: 43S517, 49S517, 55S517, 65S517",
    "Everything you need to know about the best TVs to look out for in 2021:",
    "Philips TV 2021: everything new this year",
    "LG TV 2021: every new LG TV for 2020",
    "New Samsung TV 2021: every QLED, LED, and designer TV",
    "Panasonic TV 2021: what's new with Panasonic?",
    "Hisense TV 2021: are laser TVs and DualCell worth a look?"
  ],
  "headers": {
    "8": "TCL TV: new for 2021 (US)",
    "16": "TCL TV: new for 2021 (UK)",
    "25": "TCL 2021 TV technology",
    "36": "TCL TV: new for 2020 (UK)",
    "48": "TCL 6-Series (2019)",
    "51": "TCL 5-Series (2018)"
  },
  "links": {
    "Samsung and LG": "https://www.techradar.com/news/samsung-vs-lg-tv-which-tv-brand-is-better",
    "Pro version of its flagship X925 8K Mini LED TV to Australia": "https://www.techradar.com/news/tcl-is-bringing-a-pro-version-of-its-flagship-x925-8k-mini-led-tv-to-australia",
    "OLED TVs that could go as large as 110 inches.": "https://www.techradar.com/news/tcl-oled-tvs-could-go-as-large-as-110-inches",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "TCL X915": "https://www.techradar.com/news/tcl-takes-a-lesson-from-samsung-with-qled-and-8k-tvs-for-the-uk",
    "IMAX Enhanced": "https://www.techradar.com/news/imax-enhanced-an-inside-look-at-the-new-standard-heading-to-home-theaters",
    "new to the UK": "https://www.techradar.com/news/tcl-roku-tvs-finally-come-to-uk",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "Mini LED TVs": "https://www.techradar.com/news/tcls-new-mini-led-tvs-are-coming-next-year-how-much-of-an-upgrade-are-they",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "the 5 best TCL TVs": "https://www.techradar.com/best/tcl-tv",
    "TCL 4K QLED Roku TV review": "https://www.techradar.com/reviews/tcl-6-series-qled-roku-tv-55r625-65r625",
    "TCL 8-Series Mini LED 8K Roku TV review": "https://www.techradar.com/reviews/tcl-8-series-8k-qled-roku-tv",
    "RP620K": "https://www.techradar.com/reviews/tcl-rp620k-4k-tv",
    "C71": "https://www.techradar.com/news/tcls-bargain-qled-tvs-are-now-available-for-preorder-but-should-you-buy-one",
    "Hulu": "https://www.google.com/search?q=hulu+techradar&oq=hulu+techradar&aqs=chrome..69i57.2080j0j7&sourceid=chrome&ie=UTF-8",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "we know Samsung is working on too": "https://www.techradar.com/news/samsungs-take-on-oled-tvs-wont-be-here-anytime-soon",
    "curved screens and concrete subwoofers": "https://www.techradar.com/news/tcl-is-making-some-crazy-tvs-heres-why-you-cant-buy-them",
    "TCL announced": "https://www.techradar.com/news/the-tcl-6-series-could-feature-the-most-affordable-8k-tv-ever-made",
    "TCL C81 QLED": "https://www.techradar.com/reviews/tcl-c81-qled-tv",
    "CES 2019": "https://www.techradar.com/news/ces-2020-day-3-all-the-latest-news-analysis-and-cool-new-gadgets",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "6-Series 4K Roku TV": "https://www.techradar.com/reviews/tcl-6-series-r615-r617",
    "Philips TV 2021": "https://www.techradar.com/news/philips-tv-2021-every-oled-miniled-and-ambilight-tv-coming-this-year",
    "LG TV 2021": "https://www.techradar.com/news/lg-tv-2021",
    "New Samsung TV 2021": "https://www.techradar.com/news/new-samsung-tv-2021",
    "Panasonic TV 2021": "https://www.techradar.com/news/panasonic-tv-2021",
    "Hisense TV 2021": "https://www.techradar.com/news/new-hisense-tv-2021"
  }
}