{
  "source": "https://www.techradar.com/news/succession-season-3",
  "title": "Succession season 3: release date, trailer and everything we know so far",
  "category": "entertainment",
  "updated": "2021-10-18T13:42:15Z",
  "author": "harry-shepherd",
  "summary": "Succession season 3 is finally here",
  "article": [
    "Succession season 3, the third instalment of HBO’s award-winning drama about a wealthy dynasty, has finally arrived.",
    "One of the best shows of recent years, Jesse Armstrong's series documents how Logan Roy (Brian Cox) will hand down his media empire – with each of his kids vying for a piece of the pie under his cruel watch.",
    "Blurring the lines between comedy and drama, its second season blew us away back when it aired in 2019, and two years later we're finally going to learn about the fallout from its extraordinary cliff-hanger ending.",
    "Succession season 3 was confirmed all the way back in 2019, and though the Covid-19 pandemic put a pin in our hopes for its imminent return to our screens, we've now got all the details of its cast and plot as new episodes continue to drop weekly.",
    "Below, we’ll take you through everything worth knowing about Succession season 3. Naturally, spoilers for the first two seasons follow, so proceed with caution.",
    "Episode 1 of Succession season 3 aired on October 17, 2021. Subsequent episodes are set to release every Monday evening.",
    "The show's official account tweeted the date in September, having previously confirmed that season 3 would premiere in the \"last quarter of 2021.\"",
    "Incidentally, its October 17 arrival marked almost the two year anniversary of the season 2 finale, which aired on October 13, 2019.",
    "Both the previous seasons landed in the summers of 2018 and 2019, and considering that season 3 was commissioned by HBO only two episodes into season 2, a summer 2020 launch made sense – that is, before the arrival of Covid-19.",
    "Amid the pandemic-induced chaos, WarnerMedia Entertainment shut down production on all its series, including Succession and Barry, which ruled out season 3’s expected 2020 release date. Writing for the new season did continue, though, and cast members hinted at a 2021 return following confirmation that filming got back underway in February.",
    "Succession fans took to Twitter (see the thread below from user @waystarceo) to outline updates to the show's filming schedule throughout 2021, if you're interested in seeing just how stop-start season 3's production has been.",
    "Given that early episodes of Succession season 3 are now airing, we know which cast members are returning to the drama, as well as who'll be joining them in later episodes.",
    "According to The Hollywood Reporter, most of the show’s actors successfully nabbed a pay bump to $300K-350K per episode before filming began, which gave us a good idea of who would be reprising their roles. Brian Cox, Jeremy Strong, Sarah Snook, Kieran Culkin and Alan Ruck were among those who negotiated a pay rise, so it was no surprise to see all the Roy family mainstays return for the new episodes.",
    "Matthew Macfayden and Nicholas Braun were also mentioned in the article, so we knew Tom Wambsgans and Cousin Greg would re-appear, too (with the latter confirming his involvement in an aforementioned GQ interview).",
    "As for new names joining the show, Oscar winner Adrien Brody (The Pianist, The Grand Budapest Hotel) is playing Josh Aaronson, a billionaire activist investor who becomes pivotal in the battle for the ownership of Waystar.",
    "Big Little Lies' Alexander Skarsgård also makes his Succession debut, with sources describing his character as “a successful, confrontational tech founder and CEO.”",
    "Emmy-nominated actor Hope Davis signed on for a multi-episode arc, too, playing Sandy Furness, daughter of Sandi Furness (yes, that’s not a typo) – Logan Roy’s long-time rival.",
    "In other words, expect plenty more dialogue-duelling conversations and boardroom bust-ups in Succession's third season.",
    "According to HBO, season 3 of Succession will, again, find Kendall and Logan going head-to-head in a Shakespearian battle. \"Ambushed by his rebellious son Kendall at the end of Season 2, Logan Roy begins Season 3 in a perilous position,\" an official statement reads. \"Scrambling to secure familial, political, and financial alliances, tensions rise as a bitter corporate battle threatens to turn into a family civil war.\"",
    "We still haven't fully recovered from the twist that concluded season 2, to be honest. As Kendall Roy (Jeremy Strong) was due to take the fall for the sexual harassment allegations and subsequent cover up attempt plaguing Waystar Royco, he ignored his prepared press statement and blamed his father, Logan. He refused to be the 'blood-sacrifice' for the firm and finally stood up for himself, and fans have been debating what that could mean for Succession season 3.",
    "In the first teaser trailer for season 3, that trouble relationship shows no sign of improving. Check it out below.",
    "The narrative twists and turns make Succession almost impossible to predict. How will Logan react to his son's betrayal? Will he be able to maintain his grip on the firm? His final, inscrutable smirk seemed to suggest a kind of pained pride – he seemed impressed by his son's bravery despite being humiliated on national television.",
    "We know, however, that Logan has proof of Kendall's involvement in the accidental death of a waiter in season 1's trip to the UK, so it's likely that dark secret will eventually see the light of day.",
    "Kieran Culkin's Roman Roy could be vital in this new run of episodes, too. A popular Succession theory maintains that each series focuses on one particular member of the Roy family: season 1 was Kendall, Shiv was season 2. Could Roman be the focal point of Succession season 3? Culkin light-heartedly claimed it as \"my theory\" in a chat with Entertainment Weekly.",
    "Even the main cast can have little idea of where the plot is going. Take the unlikely 'thing' going on between Roman and Gerri (J. Smith-Cameron), for instance. \"I'm not sure where the writers land on that question,\" Smith-Cameron told Entertainment Weekly. \"I think they were kind of floating this idea, but it’s the nature of television writing, and definitely our show, that there is a sort of fluid feeling of sticking your toe in the water of a certain storyline, and then deciding as you go along.\"",
    "Could future series transcend American borders? While scriptwriter Lucy Prebble told Deadline back in 2019 that the writing team don't \"want it to be too on the nose about what is happening now in the world,\" there are \"talks about going more international than we’ve gone before, which is to do with the relationship between the media industry and international countries.\"",
    "Perhaps the question of who truly holds power will go beyond just the Roy inner circle in Succession's future. That said, since this interview was conducted pre-pandemic, it's possible that plans around the show have subsequently changed, at least in terms of where the action in new episodes will take place.",
    "Speaking of which: how will the pandemic play into Succession season 3?",
    "Sarah Snook, who plays Shiv on the series, told Variety that if Jesse Armstrong (the show’s creator) chose to include the pandemic as part of season 3’s storyline, “he wants to be delicate about it and classy.”",
    "“I think it’s a thing that everybody’s aware of, and audiences are really intuitive these days,” she said. “Even just seeing a mask in the background of something or hand sanitiser, those things that have become part of our daily lives, those things maybe, but nothing that is so overt that is going to really tackle it head on, because that’s not the show.”",
    "Nicholas Braun was equally cryptic about the pandemic's role in the new season. In his chat with GQ, he suggested that whether or not the show addresses Covid, it will \"stand out from the previous series, if only aesthetically.\" He also confirmed that the cast and crew have been grounded in New York, meaning that gallivanting to yachts in Europe or estates in Scotland is not an option.",
    "It doesn’t seem like the pandemic will play a major role in Succession’s main plot, then, but it might be used to explain some less-than-cosy board meetings and socially-distanced gatherings, at least. It's fairly clear we shouldn't expect much globe-trotting, either.",
    "Still, we have seen reports suggesting filming for certain episodes is taking place in Italy (which is corroborated by what we see briefly in the above teaser trailer, too). The show's costumer, Midge Denton, recently shared images which hint at a European setting for the season finale – so maybe there will be some travelling, after all.",
    "Succession's premise shouldn't be as enticing as it is: who cares about the problems of rich people as they scheme to get even richer? It shouldn't work, but Jesse Armstrong's unpredictable HBO knockout got its claws in us early and left us desperate for more.",
    "After that season 2 finale, there are plenty of threads to be tied up, and if the improvement between seasons is anything like as noticeable as last time, we're in for a real treat.",
    "We've also got an indication of when Succession will end, too. According to the show's executive producer, Georgia Pritchett, Succession is unlikely to go beyond five seasons. “I think the maximum would be five seasons, but possibly more like four,” she told the Times, \"at this point [Armstrong] is saying only one more.”",
    "Before that, though, we'll update this page each time we learn more details about the show's plot, cast and any new info surrounding upcoming episodes of Succession season 3.",
    "Now, where's Succession season 4?"
  ],
  "headers": {
    "5": "Succession season 3 release date",
    "11": "Succession season 3 cast: which Roys are returning?",
    "18": "Succession season 3 story: it's likely about Logan vs Kendall (again)",
    "33": "Can Succession capitalize on the success of season 2?"
  },
  "links": {
    "commissioned by HBO": "https://ew.com/tv/2019/08/20/succession-renewed-season-3-hbo/",
    "filming got back underway": "https://www.techradar.com/news/succession-season-3-has-started-filming-but-a-release-date-is-harder-to-pin-down",
    "@waystarceo": "https://twitter.com/waystarceo/status/1390913157548310528?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1390913157548310528%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.techradar.com%2F",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/succession-salaries-stars-get-major-pay-raises-season-3-1291064/",
    "GQ interview": "https://www.gq-magazine.co.uk/culture/article/nicholas-braun-interview",
    "sources": "https://variety.com/2021/tv/news/succession-season-3-hbo-alexander-skarsgard-1234965151/",
    "HBO": "https://deadline.com/2019/08/succession-renewed-season-3-hbo-1202672468/",
    "fans have been debating": "https://www.reddit.com/r/SuccessionTV/comments/dywhrs/predictions_for_season_3/",
    "Entertainment Weekly": "https://ew.com/tv/2019/10/12/succession-season-2-finale-kieran-culkin/",
    "Deadline": "https://deadline.com/2019/11/succession-hbo-lucy-prebble-american-werewolf-london-wellcome-fellowship-1202796832/",
    "Variety": "https://variety.com/2020/tv/podcasts/succession-sarah-snook-emmys-an-american-pickle-1234727027/",
    "GQ": "https://www.gq-magazine.co.uk/culture/article/nicholas-braun-interview",
    "reports": "https://twitter.com/waystarceo/status/1401783526802923523",
    "Georgia Pritchett": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8505600079383465000&xs=1&url=https%3A%2F%2Fwww.thetimes.co.uk%2Farticle%2Fgeorgia-pritchett-in-succession-we-take-powerful-people-dig-deep-and-find-their-humanity-jkg837qv9&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsuccession-season-3"
  }
}