{
  "source": "https://www.techradar.com/news/iphone-13-touch-id-is-it-time-for-an-in-screen-fingerprint-sensor",
  "title": "iPhone 13 Touch ID – is it time for an in-screen fingerprint sensor?",
  "category": "phones",
  "updated": "2021-07-15T16:06:16Z",
  "author": "david-lumb",
  "summary": "The case for, and against, in-screen Touch ID coming in the iPhone 13",
  "article": [
    "One of the most exciting rumors we’ve heard about the upcoming iPhone 13 is a feature Android phones have had for years: an in-screen fingerprint sensor. So how likely is Apple’s next flagship phone to get it?",
    "We’ve heard so many rumors that Touch ID is coming back to iPhones that it feels like a question of when, not if. But it could be coming in 2022 or later, as a couple other predictions suggest.",
    "Apple switched away from fingerprint sensors in its flagship phones when it introduced the iPhone X in November 2017, and its priciest phones have relied solely on facial recognition since. While Face ID has been very accurate and dependable for unlocking and secure authentication for apps, users have wanted an alternate method for years – a murmur which rose to a clamor in 2020 as widespread mask usage obscured its use.",
    "While Apple did release a ‘fix’ for the issue in iOS 14.5 – using a paired Apple Watch to unlock your iPhone – it was barely a half-measure, since it doesn’t authenticate for app functionality and requires a pricey wearable, too. In-screen Touch ID wouldn’t just be helpful in the current still-masked climate, but is just genuinely useful when facial recognition is too awkward. Don’t take our word for it – ask any Android user, or the many iPhone 7 and iPhone 8 owners who aren’t upgrading because they don’t want to lose Touch ID.",
    "Given the persistent demand for an in-screen fingerprint sensor in a new flagship iPhone, how likely is it to arrive in the iPhone 13?",
    "Granted, we’ve been hearing rumors that iPhones will get in-screen Touch ID for years, including one in September 2019 saying the iPhone 12 would get the feature – but even that leak suggested it could come in the 2021 phones (aka the iPhone 13) instead.",
    "Since then, other rumors have claimed that the iPhone 13 will get in-screen Touch ID – in October 2020, leakers suggested ‘MESA uts’ was coming to iPhones, with ‘MESA’ being a keyword for Touch ID and ‘uts’ for under the screen.",
    "The rumors continued into 2021, with a Bloomberg report in January suggesting the feature was coming in the iPhone 13. Another leak suggested the upcoming iOS 15, which is expected to launch alongside the iPhone 13, supports dual biometric authentication through both Touch ID and Face ID. This will exclusive to Apple’s next flagship phone, implying that it will get in-screen fingerprint scanning.",
    "Various Apple patents suggest the feature is coming, like a couple filed in July 2020 for an ‘Optical-Fingerprint Detection System’ which at least suggests the company is seriously investigating the tech and, conceivably, integrating it into its phones. Another patent also suggests that the cameras could get ‘subepidermal imaging’ to scan the veins under the skin as an even more robust authentication, though it seems linked to Face ID rather than fingerprint sensing.",
    "Other rumors cite analysts with knowledge of Apple’s supply chain, who claim the feature is coming in the iPhone 13, and will not only keep Face ID but improve it – with other leaks suggesting the front-facing cameras will be hidden under the display, too, to finally get rid of the notch.",
    "Other rumors, like one from early 2021 citing Apple employees who spoke with the Wall Street Journal, still suggest in-screen fingerprint sensors are coming to flagship iPhones, but don’t specify a timeframe. The feature will arrive, but maybe not for a while.",
    "Other rumors are more specific that the feature won’t come in the iPhone 13. Noted Apple analyst Ming-Chi Kuo predicted in-screen Touch ID will come in the 2022 line of iPhones, which presumably means the iPhone 14, though it could also include a mid-range successor to the iPhone SE 2020.",
    "Clearly, the rumors favor the feature coming to the iPhone 13, but that also reflects the nature of rumors themselves, which often correctly predict the existence of an upcoming feature but get the timeframe wrong. There are plenty of reasons in-screen Touch ID could skip the iPhone 13 but arrive in the iPhone 14, like if Apple isn’t done implementing the tech, or runs into supply and manufacturing issues.",
    "Or Apple could just hold off on the feature because the company is never in a particular rush to jump on novel technology, with a tendency to let others debut and iterate new things only for Apple to then develop its own very refined version that becomes the new standard when it’s released years later. Apple did this with true wireless earbuds (AirPods), tablets (iPads), and even the smartphone itself, making touchscreen-dominant design the market norm when it released the first iPhone in 2007.",
    "If Apple waits until 2022 to implement in-screen Touch ID, it won’t turn people off of the iPhone 13. The phone range will likely sell well, given the success and sales of the iPhone 12 and all the flagship iPhones before it. But if this year’s Apple flagships have the feature, it could convince Touch ID holdouts to make the jump – and join the modern generation of smartphones."
  ],
  "headers": {
    "5": "Why in-screen Touch ID could be coming to iPhone 13",
    "10": "Why in-screen Touch ID could wait til the iPhone 14 or later"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "‘fix": "https://www.techradar.com/news/ios-145-update-adds-mask-less-iphone-unlock-ps5-xbox-series-x-controller-support-and-more",
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "iPhone 7": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-7-1327947/review",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "get the feature": "https://www.techradar.com/news/iphone-12-could-launch-with-in-screen-fingerprint-sensors-iphone-12-could-bring-back-touch-id-with-in-screen-fingerprint-sensor",
    "suggested": "https://www.techradar.com/news/move-over-iphone-12-apples-iphone-13-may-feature-under-display-touch-id",
    "suggesting": "https://www.techradar.com/news/iphone-13-could-feature-in-screen-face-id-or-touch-id-unlock",
    "leak": "https://www.techradar.com/news/new-ios-15-features-leaked-including-a-redesigned-control-center-for-your-iphone",
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "Optical-Fingerprint Detection System": "http://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&r=22&p=1&f=G&l=50&d=PG01&S1=(apple.AANM.+AND+20200702.PD.)&OS=aanm/apple+and+pd/7/2/2020&RS=(AANM/apple+AND+PD/20200702)",
    "suggests": "https://www.techradar.com/news/iphone-12-or-iphone-13-could-make-face-id-much-more-secure-with-this-new-tech",
    "claim": "https://www.techradar.com/news/another-iphone-13-leak-points-to-in-screen-touch-id-and-a-smaller-notch",
    "citing": "https://www.techradar.com/news/iphone-13s-in-screen-touch-id-sensor-more-likely-thanks-to-new-report",
    "Wall Street Journal": "https://www.wsj.com/articles/whats-in-the-next-iphone-check-samsungs-new-galaxy-s21-11611931084?mod=searchresults_pos3&page=1",
    "predicted": "https://www.techradar.com/news/apple-reportedly-developing-a-foldable-iphone-flip-though-it-could-be-years-away",
    "iPhone SE 2020": "https://www.techradar.com/reviews/iphone-se"
  }
}