{
  "source": "https://www.techradar.com/news/microsoft-edge-is-getting-a-mega-speed-boost-to-help-it-topple-google-chrome",
  "title": "Microsoft Edge is getting a mega speed boost to help it topple Google Chrome",
  "category": "computing",
  "updated": "2021-05-25T15:33:03Z",
  "author": "mike-moore",
  "summary": "Faster browsing and better battery life coming with Microsoft Edge 91",
  "article": [
    "The newest version of Microsoft Edge is set to give the browser a significant speed boost, as well as welcome power usage upgrades.",
    "At Microsoft Build 2021, the company revealed new information on Microsoft Edge 91, the latest edition of its browser, as it looks to take on the likes of Google Chrome and Mozilla Firefox.",
    "In a blog post announcing the news, Microsoft said that Edge 91, which will be available to download within the next few days, will be \"the best performing browser on Windows 10\".",
    "The company says that the speed increases for Microsoft Edge are down to two new features: startup boost and sleeping tabs.",
    "The former ensures that Microsoft Edge launches more quickly by running a set of core processes for the browser in the background, meaning it opens faster than ever before. Microsoft says this is all done without adding additional resources when browser windows are open, with its own internal tests finding that Edge startup times increased by between 29% and 41%.",
    "First announced back in September 2020, sleeping tabs looks to offer improved battery life and performance for users who have multiple tabs open at the same time.",
    "The feature frees up system resources from unused tabs to optimize the performance of the browser, and puts adverts in background tabs to sleep in order to help save every last drop. Microsoft says that sleeping tabs now saves up to 82% of the usual memory demand.",
    "Microsoft also gave a mention to Internet Explorer, its venerable browser which is being retired and removed from Windows 10 over the next few months.",
    "For those users finding it difficult to move on, the company is offering an \"Internet Explorer mode\" in Microsoft Edge, where business and consumer users alike can still use IE-based sites and apps alongside modern ones in their browser."
  ],
  "headers": {
    "3": "Faster than ever"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/how-to/computing/how-to-use-microsoft-edge-1312585",
    "browser": "https://www.techradar.com/best/browser",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "blog post": "https://blogs.windows.com/msedgedev/2021/05/25/whats-new-edge-build-2021/",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "sleeping tabs": "https://www.techradar.com/news/microsoft-edge-will-now-hog-much-less-of-your-computers-processing-power",
    "Internet Explorer": "https://www.techradar.com/news/microsoft-officially-retiring-internet-explorer-next-year-moving-on-to-edge"
  }
}