{
  "source": "https://www.techradar.com/news/microsoft-accidentally-spills-windows-365-pricing-details",
  "title": "Microsoft accidentally spills Windows 365 pricing details",
  "category": "computing",
  "updated": "2021-07-16T10:04:31Z",
  "author": "joel-khalili",
  "summary": "Windows 365 presentation slide leaks pricing early",
  "article": [
    "Microsoft has accidentally let slip pricing details for Windows 365, its new virtualization service that lets customers access a Windows desktop from any device via the cloud.",
    "Originally, the company said it wouldn’t reveal Windows 365 pricing until launch day, on August 2. But a rogue slide shared during a session at Microsoft Inspire has let the secret out early, at least partially.",
    "According to the slide, Microsoft will charge $31 per user per month for a cloud-based Windows PC with two CPUs, 4GB of RAM and 128GB storage. This SKU sits underneath Windows 365 Business, one of two available Windows 365 branches, designed for smaller businesses with 300 employees or less.",
    "“This is pricing for just one SKU. Microsoft will have many more options, both in terms of configurations and price points, to share when the product becomes generally available,” said Microsoft in a statement shared with The Verge.",
    "Although no further pricing has been confirmed, it’s clear cheaper options will be available at launch, because at least two Windows 365 configurations offer either less firepower or cloud storage.",
    "Announced earlier this week, Windows 365 has been billed as “a new way to experience Windows 10 or Windows 11” and could open up a range of new opportunities for businesses, from a cost, administration and productivity perspective.",
    "Instead of hosting the operating system and applications locally, soaking up both storage and computing resources, Windows lets users stream their apps, data and settings to any of their devices - including those that run on macOS, Linux and Android.",
    "The beauty of the system, Microsoft says, is that businesses aren’t locked to a specific performance configuration or number of users; Windows 365 allows customers to dial up and down resources and ramp employees on and off as needed.",
    "The least powerful Windows 365 configuration offers a Windows PC with one CPU, 2GB RAM and 64GB storage. Microsoft says this package is designed for frontline and call center workers, or employees who only require access to lightweight CRM software.",
    "At the other end of the scale, users who frequently perform compute-heavy tasks (say, creatives or software engineers) will have access to a configuration powered by 8 CPUs, with 32GB RAM and 512GB storage.",
    "Without access to complete pricing information, it is difficult to compare Windows 365 with Azure Virtual Desktop or similar services offered by other players in the market. Further, existing virtual desktop services are often charged on a per usage basis, whereas Windows 365 is designed to factor everything into the flat rate."
  ],
  "headers": {
    "5": "Windows 365 pricing"
  },
  "links": {
    "Windows 365": "https://www.techradar.com/news/windows-365-release-date-features-and-everything-else-you-need-to-know",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "The Verge": "https://www.theverge.com/2021/7/15/22578396/microsoft-windows-365-pricing-skus-monthly-subscription-cost",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "CRM software": "https://www.techradar.com/best/the-best-crm-software",
    "virtual desktop": "https://www.techradar.com/best/virtual-desktop-services"
  }
}