{
  "source": "https://www.techradar.com/news/exclusive-oneplus-nord-ce-design-first-look-and-how-oneplus-designed-it",
  "title": "Exclusive: OnePlus Nord CE 5G design first look, and how OnePlus designed it",
  "category": "phones",
  "updated": "2021-06-08T07:00:24Z",
  "author": "james-peckham",
  "summary": "This is what the OnePlus Nord CE looks like",
  "article": [
    "The OnePlus Nord CE 5G is set to be officially unveiled later this week, and we’ve been given an exclusive image of the upcoming smartphone directly from OnePlus to share with you, so you can see the rear of the handset for the first time.",
    "The image above is the upcoming OnePlus Nord CE in its Blue Void color. Unsurprisingly, the new phone looks a lot like the original OnePlus Nord, but there are a couple of differences.",
    "This new handset’s moniker stands for ‘Core Edition’, and the company is stripping back a few specs from the original Nord for this phone and offering it at a more affordable price (which we hope to hear about on June 10).",
    "What has changed from the original OnePlus Nord? The placement of the flash on the rear of the phone is different, and we’ve also got that previously mentioned new color (but it isn’t dissimilar to the company’s Blue Marble on the first Nord).",
    "The phone also looks to have three cameras on the rear, which is one less than the original Nord. We’ve yet to learn the exact specs of what this shooter will be able to do, but the fact two of the cameras look similar sizes suggests that one is the main and the other will be an ultra-wide.",
    "It’s unclear what the third lens is for, but it may be either a depth or a macro camera. We also don’t yet have any photos of the front of the phone.",
    "Oliver Zhang, Head of Product at OnePlus, told TechRadar, “CE stands for Core Edition, and the whole design philosophy hinges around the idea of “core”. The essence of “core” is reduction - distilling the product down to the most important things.",
    "“You see mid-range phones on the market with very exaggerated specifications. We actively avoided some of those features and kept the things we felt would really make a difference to the daily smartphone experience, like fast charging (Warp Charge 30T Plus), a 90Hz AMOLED display, or 5G.”",
    "So you shouldn’t expect huge specs on the OnePlus Nord CE, but the company is keen to include things that matter to the average person.",
    "Zhang’s confirmation of a 90Hz screen makes sense, as the OnePlus Nord featured the same technology, and a high refresh rate screen is a technology commonly available on cheaper smartphones from rival brands like Xiaomi.",
    "That fast-charging technology that Zhang mentions is a new version of the company’s tech. It likely won’t act as fast as flagship phones like the OnePlus 9 Pro, but the addition of the Plus name suggests it will offer a better charging experience than the OnePlus Nord with its Warp Charge 30 tech.",
    "Zhang didn’t share what Warp Charge 30T Plus is capable of (the name suggests it’s 30 watts), but a leak last week suggested that it’d offer 70% charge from zero in just 30 minutes. That matches the OnePlus Nord, so it may well be that this won’t beat last year’s phone in the charging department.",
    "Why does the OnePlus Nord CE look similar to the OnePlus Nord? The company received positive feedback on the original handset. In fact, TechRadar’s review said it had an eye-catching look and a design that “bellies the affordable price”.",
    "Zhang said, “When designing Nord CE, we focused on the core elements which really contribute to a great everyday experience, but also kept in mind some of the things which users really loved about the original Nord.",
    "“Design was one of those elements we received a lot of positive feedback on, so we decided not to drastically change the design.”",
    "It makes sense that the company continued with this look for its next handset, but a couple of tweaks were made to distinguish it from 2020’s smartphone.",
    "It seems OnePlus fans responded well to the color of the original Nord, too. That seems to be why OnePlus has stuck with a similar shade for its new Blue Void color. Zhang said “That signature blue color was something our users loved a lot, and we wanted to keep it. But we put a new spin on it, because we wanted the Nord CE to have its own personality.”",
    "OnePlus has also brought the AG matte finish from the flagship phone series onto its mid-range devices for the first time here with the Nord CE. It’s fingerprint resistant, and it was a technology we saw the company debut on the Glacial Green color OnePlus 8, and it later came to the OnePlus 9.",
    "Zhang said, “It is quite an expensive technique to use on mid-range devices, but thanks to improvements in manufacturing and production, we’ve been able to bring this to a more accessible device and allow more users to experience better smartphone designs.”",
    "The OnePlus Nord CE is set to be an affordable phone, but this is a difficult market for OnePlus to make a splash in, as there are a lot of cheaper handsets out there vying for your money in that space.",
    "“When designing any of our products, we focus on the experience first and select the necessary components to deliver that end experience,” said Zhang.",
    "“The biggest challenge is to create different experiences for different types of users, while consistently delivering the high quality that OnePlus users deserve. Over the years, we’ve come to understand what early adopters are looking for in a flagship phone, but the Nord series has in mind a different type of user.",
    "“We put ourselves in the shoes of a new user who might be less sensitive to specs and features but still wants a reliable and nicely designed smartphone.”",
    "Exactly what those specs will be aside from the screen refresh rate, charging technology, 5G connectivity and amount of rear cameras is unclear. We’ll have to wait until later this week to hear more from OnePlus.",
    "OnePlus is hosting an event on June 10 where it will debut the OnePlus Nord CE. The company has already confirmed the handset is set to debut in Europe and India, so those in the US or Australia are unlikely to be able to buy this.",
    "OnePlus has confirmed the OnePlus N200 5G will be launching in other markets later this year, but we don’t yet know exactly where or when you’ll be hearing about that device. Plus, we expect to hear about a OnePlus Nord 2 and a OnePlus 9T at some time this year too."
  ],
  "headers": {
    "12": "Back to the design",
    "19": "Who is the OnePlus Nord CE for?"
  },
  "links": {
    "OnePlus Nord CE 5G": "https://www.techradar.com/reviews/oneplus-nord-ce-5g",
    "OnePlus Nord": "https://www.techradar.com/reviews/oneplus-nord",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled"
  }
}