{
  "source": "https://www.techradar.com/news/theres-much-more-to-consider-than-a-tesla-bot-uprising",
  "title": "There's much more to consider than a Tesla Bot uprising",
  "category": "appliances",
  "updated": "2021-08-20T15:41:54Z",
  "author": "chris-teague",
  "summary": "Thankfully, it can't move faster than 5mph",
  "article": [
    "Tesla founder Elon Musk is known for creating a boundary-pushing electric car brand, an underground tunnel-building company that also makes flamethrowers, and a rocket company that carries people and gear into space.",
    "If the controversial billionaire has his way, he'll soon add another title to that list next year. Musk slid a surprise announcement into the end of Tesla's annual AI Day event this year, and it's one that could make a lot of people nervous.",
    "Tesla is working on a humanoid robot, the prototype for which is coming in 2022. Dubbed Tesla Bot, it will use some of the tech that power's Tesla's semi-autonomous driving features.",
    "Musk notes the Tesla Bot's purpose in life is to take over jobs that are dangerous and repetitive work, with the ultimate goal being to make physical labor a choice in the future.",
    "The Bot measures in at a human-like 5'8\" and 125 pounds. Musk said the Tesla Bot is intended to be friendly, but just in case it turns against its human overlords, it has a top speed of 5 mph and is designed to not be extremely powerful.",
    "You can watch the Tesla AI Day event below",
    "Perhaps more interesting than the robot itself is Musk’s view of the future of work. Assuming we can physically build a fleet of humanoid robots and avoid having them exterminate all of humanity, they could represent a massive shift in the types of work people need to do to survive.",
    "Musk believes that robots can replace jobs that are dangerous or repetitive, freeing those people to do other things, such as study and learn other skills.",
    "He also noted that he's in favor of universal basic income, but said it's not on the cards until robots are able to pick up the slack with menial tasks.",
    "If Musk is right and robots do take over less desirable jobs, the bigger problem might be public education.",
    "People are going to be scared of losing jobs and may not understand the concept of a guaranteed income, and on the other side of that coin, a large portion of the United States is afraid of the socialism boogeyman, which may make them apprehensive of anything that distributes wealth to others in society.",
    "Finally, Hollywood has programmed many to live in fear of a future where robots walk among us, so there's no telling how receptive the public will be to this concept."
  ],
  "headers": {
    "6": "Analysis: more to consider than a robot uprising"
  },
  "links": {}
}