{
  "source": "https://www.techradar.com/news/the-last-of-us-tv-show-will-have-10-episodes-but-how-many-seasons",
  "title": "The Last of Us TV show will have 10 episodes – but how many seasons?",
  "category": "entertainment",
  "updated": "2021-07-07T09:53:22Z",
  "author": "axel-metz",
  "summary": "More details, and even more questions",
  "article": [
    "Writer and producer Craig Mazin has confirmed that HBO’s upcoming The Last of Us TV show will have a 10-episode first season.",
    "The news comes from a comment made by Mazin during a recent appearance on the Scriptnotes podcast (good spot, Culture Crave), where he also confirmed that there are only two directors left to be announced for the hotly-anticipated TV adaptation of Naughty Dog's iconic PS3 game.",
    "We already know Jasmila Zbanic, Ali Abbasi and Kantemir Balagov will be directing episodes, and that Chernobyl director Johan Renck was forced to pull out of helming the pilot due to scheduling conflicts. Both Mazin and co-writer Neil Druckmann will also be serving as executive producers on the show.",
    "Given that HBO-series episodes tend to run about an hour long, it’s fair to assume that season one of The Last of Us TV show will tell its tale in around 10 hours. As for what that length tells us about its plot? Well, not all that much.",
    "We still don’t know whether the series will mirror the plot of the first game in its entirety, or whether it will combine the stories of both the original and The Last of Us 2 across multiple seasons.",
    "The series will also “deviate greatly” from the source material in some episodes, according to showrunner Druckmann, but only in terms of its focus on drama over hardcore action. He also revealed that, for himself and co-writer Mazin, the “philosophical underpinnings of the story“ were the essential aspects they wanted to get right with the adaptation.",
    "Troy Baker, voice actor for main character Joel in the games, has provided a vague window of “three [or] four seasons” being necessary to match the story beats of the original at an appropriate pace – rather than constraining its plot to a rushed single season.",
    "HBO has also made passing reference to \"future seasons\" beyond an initial first season, though any continuations are likely to depend on the success of season one.",
    "Beyond this recent confirmation of its initial episode-count, though, the only other concrete details we’ve got so far regarding The Last of Us TV show revolve around its cast.",
    "Bella Ramsey, who starred in Game of Thrones, is set to play Ellie, while Joel will be portrayed by fellow Game of Thrones actor-turned Mandalorian Pedro Pascal.",
    "We know Tess (Joel's partner of sorts), Marlene (a member of the Fireflies), Riley (a childhood friend and romantic interest of Ellie), and Maria (wife of Joel's younger brother) are all going to be part of the show, too, though we haven’t yet had casting details for every character.",
    "Merle Dandridge will play Maria in the series, while Gabriel Luna will also star as Tommy, Joel's younger brother. Joel's daughter, Sarah, has also been cast – she will be played by newcomer Nico Parker.",
    "As for its release date, all we know is The Last of Us TV show is \"coming soon to HBO\" – though early 2022 seems the most likely arrival time.",
    "Via GamesRadar"
  ],
  "headers": {
    "8": "Who is playing who?"
  },
  "links": {
    "The Last of Us TV show": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "Scriptnotes": "https://open.spotify.com/episode/6AP8PLFwGkszAgIHd6B4Z9?si=d5Mbn-HMRHSsJ_q9DNRkzQ&utm_source=copy-link&dl_branch=1&nd=1",
    "Culture Crave": "https://twitter.com/CultureCrave/status/1412486441297272833",
    "Chernobyl director Johan Renck": "https://www.techradar.com/news/hbos-the-last-of-us-tv-show-signs-up-chernobyl-director",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "according to showrunner Druckmann": "https://www.techradar.com/news/the-last-of-us-tv-show-will-see-some-episodes-deviate-greatly-from-the-game",
    "Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "has also been cast": "https://www.techradar.com/news/the-last-of-us-tv-show-casts-joels-daughter-so-what-does-this-mean-for-its-plot",
    "GamesRadar": "https://www.gamesradar.com/the-last-of-us-tv-shows-first-season-will-have-10-episodes/"
  }
}