{
  "source": "https://www.techradar.com/news/polaroid-vs-instax",
  "title": "Polaroid vs Instax: which is the best instant camera brand?",
  "category": "cameras",
  "updated": "2021-11-16T10:25:37Z",
  "author": "tom-morgan",
  "summary": "Which classic instant camera brand is the best for you?",
  "article": [
    "Instant cameras have been booming again lately, with new models like the Polaroid Go and Fujifilm Instax Mini 40 recently arriving for new analogue thrills. But with both brands having huge heritage in the field, which one deserves to win the great 'Polaroid vs Instax' debate? And how do you decide which is the best instant camera for you?",
    "That's a tough question, but one we're in a good position to answer having grown up with the original cameras (even if that does give away how old we are). Today's Polaroid and Instax ranges have never been in better health, but to really understand the brands we need to step back into their origin stories.",
    "Instant film has been giving photographers almost immediate results since the medium's inception in the 1940s. By using chemical reactions to self-develop each image, instant photos develop in minutes, skipping out on the long wait times associated with processing 35mm film negatives. Many photographers also grew to love the distinctive, almost ethereal color balance and tonal range of instant film.",
    "As the popularity of digital cameras grew rapidly in the early 2000s, interest in analogue film took a nosedive, but instant has since had a real resurgence. Now, a new generation of photographers understand the appeal of having a physical photo, rather than just a digital image on a computer or smartphone screen.",
    "There two major companies flying the flag for instant film are a resurgent Polaroid and Fujifilm's Instax sub-brand. Both have their own cameras, a range of different film formats and different interpretations of what 'instant' means. But which one is the best for you? Let's find out.",
    "Most photographers will be familiar with Fujifilm and Polaroid: the two brands first started producing camera equipment in the late 1930s, and were household names while analogue film was at its peak.",
    "It was Polaroid that would initially champion instant film with the Land Camera Model 95 in 1948. It produced sepia-colored prints in about one minute; color film would take a further two decades to arrive. Polaroid eventually offered the widest range of instant cameras and film formats, to such a point where the brand name became synonymous with the medium. The fact it owned the patents to instant film helped ensure rivals like Kodak couldn't compete in the arena.",
    "Fuji's first foray into instant was a little later in the 1980s with cameras like the Instax 100, but only after it managed to avoid a potential lawsuit for infringing Polaroid's film patents. Those patents would expire in 1998, at which point Fuji introduced its first Instax camera.",
    "This coincided with the arrival of the earliest digital cameras, an industry change the Japanese company was far more prepared for than Polaroid. Only Fuji would survive intact, and has since gone on to become the new market leader with its own range of cameras and instant film formats.",
    "Polaroid as we know it today began life as The Impossible Project. This group of instant photography fans purchased the final Polaroid factory and its production equipment from the holding company set up in the wake of the brand's 2001 bankruptcy.",
    "It began selling film for existing Polaroid cameras, then started producing its own, and eventually purchased the Polaroid name outright. Hence the arrival of the Polaroid Now and Polaroid Go, its first new releases under the original brand name.",
    "The present-day Polaroid line-up consists of three cameras: the entry-level Polaroid Now, the more advanced OneStep+ and the pocket-friendly Polaroid Go. Polaroid also sells officially refurbished versions of an original 1980s model called the Polaroid 600, which uses bespoke 600 film.",
    "Both the Now and OneStep+ use I-Type film, but the former's autofocus lens makes it more of a point-and-shoot camera aimed at newcomers to the medium. The OneStep+ costs slightly more, but gains Bluetooth connectivity and a smartphone companion app, which unlocks more creative shooting modes.",
    "The Polaroid Go, meanwhile, is the smallest model in the range. It produces prints that are half the size of traditional I-Type film, yet still has advanced features like a selfie timer and a double-exposure mode.",
    "Fuji has a much more extensive line-up of cameras, divided between Instax Mini, Instax Square and Instax Wide formats. The Instax Mini range has the most affordable and beginner-friendly models, including the Fujifilm Instax Mini 11 – which is currently top of our guide to the best instant cameras.",
    "It has an auto exposure system that helps combat the overly sensitive nature of instant film when shooting outdoors. The Fujifilm Instax Mini 40 is essentially the same camera, but in a nicer body for only slightly more money.",
    "The Fujifilm Instax SQ1 and Fujifilm Instax SQ6 shoot with square format film, and are more advanced than the Mini range, with multiple shooting modes and more premium construction. They are also physically larger, and more expensive. There's also the SQ20 hybrid instant camera, which takes digital photos as well as instant ones, but its digital shots are only on par with early 2010s smartphones.",
    "Finally, the Instax Wide 300 (above) is as big as Instax models get. It has adjustable focus, a clip-on close-up attachment and takes impressively sharp images, but film packs are among the most expensive and it lacks the more advanced functions advanced photographers might expect.",
    "Until recently, Polaroid sold only one main kind of film: I-Type, which produces square format photos. A pack holds eight shots, with each one measuring 10.7x8.8cm (4.2x3.4in). The actual photo area is smaller, at 7.9x7.7cm (3.1x3.0in), but still significantly larger than most of Fuji's Instax formats (including Square).",
    "Color and black and white film versions are available, with a selection of different border colors. It also produces the physically identical 600 film, which is intended for use in original Polaroid cameras, but is also compatible with the modern range.",
    "The new 'Go' film is exclusive to the Polaroid Go, and is physically much smaller. At 6.7x5.4cm (2.6x2.1in) and with a 4.7x4.6cm (1.9x1.8in) photo area, each photo is even more compact than Fuji's rival Instax Mini format. Currently only color film is available, and sold in sets of two eight-shot packs.",
    "Fuji's Instax Mini, Square and Wide film can't be mixed and matched: each one is designed for a specific Instax camera series. The credit card-sized Instax Mini is the most common, and most affordable, with multipack bundles found at most retailers. Each pack holds ten 5.4x8.6cm (2.1x3.4in) shots, which have an image area of 4.6x6.2cm (1.8x2.4in). The beginner-friendly film is ideal for fun, spur-of-the-moment shooting and selfies with friends.",
    "Instax Square is, as the name suggests, a square format film that, at 8.6x7.2cm (3.4x2.8in), is roughly a third larger than an Instax Mini photo. Each shot has an image area of 6.2x6.2cm (2.4x2.4in) and can be purchased in a selection of different border colors and patterns – though not quite as many as Instax Mini. Both color and monochrome film is available, with the larger image size being better suited to portraits and more detailed scenes.",
    "Finally, Instax Wide film packs use 8.6x10.8cm (3.4x4.2in) photos with a 6.2x9.9cm (2.4x3.9in) image area – making them exactly twice as wide as an Instax Mini print. Color and monochrome film types are available, but the only border color option is white. Given its limited support, Instax Wide largely appeals to instant photography fans who own multiple cameras.",
    "Okay, so now it's time to answer the big question – which is the best instant camera brand, Polaroid or Instax?",
    "For sheer size, Polaroid's I-Type has the edge over two of Fuji's three film types, and despite the different aspect ratios, is also a close match for Instax Wide. Cameras that support it generally have good optics, which make for clear and detailed images. On the other hand, there aren't many to choose from, and packs remain expensive to buy. For the price of a single pack of eight color I-Type shots, you can get two packs of ten Instax Mini film.",
    "With several sizes to choose from, as well as an extensive range of compatible cameras, both from Fuji itself and smaller third party manufacturers, Instax is simply the more flexible option.",
    "Photographers already familiar with the quirks of instant will appreciate Instax Square, which is typically used by more advanced cameras, but beginners should go straight for Instax Mini. Film packs are especially affordable and the cameras that support it are usually simple, point-and-shoot affairs.",
    "This may change once the wallet-friendly Polaroid Go establishes itself, but for now, Instax is the overall winner in our book."
  ],
  "headers": {
    "5": "Polaroid vs Instax: How did we get here?",
    "11": "Polaroid vs Instax: the cameras",
    "18": "Polaroid vs Instax film: how does it differ?",
    "24": "Polaroid vs Instax: which is better?"
  },
  "links": {
    "Polaroid Go": "https://www.techradar.com/reviews/polaroid-go",
    "Fujifilm Instax Mini 40": "https://www.techradar.com/reviews/fujifilm-instax-mini-40",
    "best instant camera": "https://www.techradar.com/news/best-instant-camera",
    "Polaroid Now": "https://www.techradar.com/reviews/polaroid-now",
    "Fujifilm Instax Mini 11": "https://www.techradar.com/reviews/fujifilm-instax-mini-11",
    "best instant cameras": "https://www.techradar.com/news/best-instant-camera",
    "Fujifilm Instax SQ1": "https://www.techradar.com/reviews/fujifilm-instax-sq1",
    "Fujifilm Instax SQ6": "https://www.techradar.com/reviews/fujifilm-instax-sq6-review"
  }
}