{
  "source": "https://www.techradar.com/news/no-time-to-die-is-the-most-beautiful-bond-film-says-director-cary-joji-fukunaga",
  "title": "The best way to watch James Bond 'No Time to Die', according to its director",
  "category": "entertainment",
  "updated": "2021-10-04T09:05:15Z",
  "author": "gerald-lynch",
  "summary": "The latest cinema technologies bolster Daniel Craig’s final outing as Bond",
  "article": [
    "Did you manage to catch No Time to Die in the cinema this weekend? For more than 50 years the James Bond franchise has dazzled cinemagoers with its suave spies, atomic action and glorious gadgetry. But there’s perhaps more riding on No Time To Die, the latest entry in the series, than any Bond film before it.",
    "Delayed several times because of the ongoing pandemic, fans are hoping Daniel Craig’s last outing as 007 will see his serialised take on the character go out on a high – particularly at a time when the future of the character is being debated.",
    "For director Cary Joji Fukunaga, these pressures were secondary to that golden rule of film making – shoot the best movie you possibly can.",
    "“I want for the diehard Bond fans to feel like they got everything they hoped for out of the film, and then to also have them completely surprised by the new things they learn about Bond through the experience,” says Fukunaga, speaking with TechRadar.",
    "A franchise with as much cultural cache as Bond always has lots of resources thrown at it, and Fukunaga and his team took advantage of every tool given to them. As such, it’s the first Bond film to hit cinemas with the Dolby double-whammy in tow – No Time to Die can be seen in select cinemas with both Dolby Atmos spatial surround sound and the Dolby Vision HDR imaging technology.",
    "“Dolby Atmos sound was pretty fun to mix,” says Fukanaga, whose previous credits include Beasts of No Nation and the outstanding HBO drama True Detective.",
    "“I love being on a mix stage – my very first experience in the film world was on a mix stage. I got the opportunity, when I was in college, to sit in on a final sound mix with Anthony Minghella on The Talented Mr. Ripley, and with Walter Murch, the editor and sound designer who worked with [Francis] Coppola. So my appreciation of the sound mix goes back to my very first professional experience during the final sound mix on Talented Mr. Ripley. Just to watch the intricacies of sound and just the details, whether it's the foley or the dialogue or whatever is being mixed in, plus the atmosphere, plus the score, and seeing the effect of that – I've always had just a huge respect for sound.”",
    "Fukanaga has always had an ear for innovation when it comes to sound design in his films – an early film school project (to later become the director’s first major picture) could have benefited hugely from the dynamic movement Dolby Atmos’s object based audio movement would have afforded.",
    "“I had a video teacher in high school that always said, ‘an audience will forgive bad picture, but will never forgive bad sound’,” the director recalls.",
    "“So, you know, I've always felt that was an important aspect to anything I made. Even at film school there are projects that I made that were driven more by sound than by picture. My big second year project, which ended up leading to my first film Sin Nombre, which is about a group of immigrants that were trapped in a refrigerated trailer in the dark – I wanted to do it completely in the dark, and just do a complete sound experience, with three dimensional sound for the audience. But my professors wouldn't allow me to do that, so I had to shoot some image of some kind, and it kind of shifted the structure of the story. But that was the aim.",
    "“With Bond in Dolby Atmos and Dolby Vision, anything that heightens the immersive experience of the audience, that transports them in a way, when that low bass kicks and just kind of shakes their guts. That's what I'm aiming for.”",
    "And what an experience it is in Dolby Cinema. TechRadar were lucky enough to see the film at an Atmos / Vision presentation at the Odeon Luxe cinema in Leicester Square, London, the UK's new flagship home of Dolby Cinema. It makes an already lavish production even more jaw dropping – from the muzzle flash of gunfire in a darkened secret lair to the blinding whites of a frozen, snowy lake, Dolby Vision's HDR output leads to a crisp and detailed image unlike any other you're likely to see in lesser cinemas. Likewise, Dolby Atmos's overhead surround sound roars in No Time to Die, whether Bond's racing through European streets in his iconic Aston Martin, or evading the sights of a menacing helicopter in the sky.",
    "But no technology is a silver bullet to a successful on-screen result. Careful daily work and edits, paired with the enduring magic of shooting on analogue film, has been important to ensuring No Time to Die retains the visual magic fans of the spy have come to expect.",
    "“We had the same dailies color grader, as we did in the final color grade,” explains Fukunaga.",
    "“I think it's really essential because you need that continuity, you need the looks that you're exploring in the camera test, and then once you're shooting, to reflect what's in the final image, especially in the edit. Just having in the edit dailies, beautiful dailies really that were very close to what ended up being the final picture, meant that when we were finally looking at the final picture, it was pretty interesting to see that the changes we did make we're pretty subtle.",
    "“You know, [director of photography] Linus Sandgren is not the kind of guy that uses a ton of power windows and stuff to shape a final image. Part of that is due to the fact that we shot on film – I still believe originating on film is still the most beautiful way to create a final product image. So, the digital tools that we use after are just able to take all that beautiful grain, and the information that's inside that grain, and further that into this glossy beautiful thing.”",
    "Though many months have passed since No Time to Die’s initial release date, the actual final film has been locked in for some time. “There was no tweaking after COVID lockdown, so what we turned in at the beginning of March is what we're all going to be watching in cinemas this week,” reveals the director.",
    "But that painstaking work early in the production has paid dividends in Fukanaga’s eyes – this may be the best looking, and best sounding, Bond film, ever.",
    "“I think that the mix is pretty incredible,” praises Fukanaga.",
    "“Paul [Massey, re-recording mixer] and Oliver [Tarney, supervising sound editor] and everyone did an amazing job with that. And then on a picture level shooting on 35mm and then 5-perf 70mm and 15-perf have provided an amazing base medium to create a gorgeous final image I'm very happy with.",
    "“This may be, you know, one of the more beautiful films I've ever worked on, so you know I'm hoping that Bond fans will also feel that cinematically it's one of the most beautiful Bond films.”",
    "No Time to Die is in international cinemas now, and will land in US theaters on Friday, October 8. It’ll be available in Dolby Vision and Dolby Atmos screenings at theatres with Dolby Cinema technology across the globe."
  ],
  "headers": {
    "4": "The Dolby double",
    "12": "The new with the old"
  },
  "links": {
    "No Time To Die": "https://www.techradar.com/news/no-time-to-die-is-a-fitting-end-for-daniel-craigs-bond-but-its-no-skyfall",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Dolby Vision": "https://www.techradar.com/news/dolby-vision-is-it-worth-paying-extra-for-the-premium-hdr-format"
  }
}