{
  "source": "https://www.techradar.com/news/apple-iphone-users-are-loving-the-ios-15-update",
  "title": "Apple iPhone users are loving the iOS 15 update",
  "category": "computing",
  "updated": "2021-09-21T15:09:45Z",
  "author": "henry-st-leger",
  "summary": "The new iOS 15 update is going down a treat",
  "article": [
    "The new iOS 15 update is going down a treat with Apple iPhone owners, who are shouting their love for everything from scroll wheel clocks to 3D map affects.",
    "A quick glance through Twitter shows a number of glowing reviews from on-the-ground iPhone users, exploring the myriad of tweaks, changes and features that have landed with the latest iOS update.",
    "Alongside the kind of updates we press pundits tend to concern ourselves with – security features and the like – are a host of small, attentive changes that are already winning users over and reminding them why they fell in love with Apple's iOS platform in the first place.",
    "One of the most prominent additions is the ability to play background sounds alongside music – with multiple users taking to Twitter to shout about the excellent vibes that come with mixing rain sounds with their saddest Apple Music artists.",
    "Other users are relieved at the return of the scroll wheel for selecting alarm times, which in iOS 14 had been replaced with a much-less-liked virtual keyboard. It's now back as default, as you can see below:",
    "Keyboard enthusiast @JonPorty isn't mourning the change, though, as he's too busy complimenting the ease of swiping between tabs and accessing the tweaked location of the address bar in Safari. (As others point out, there are now wallpapers to choose for Safari, too.)",
    "Apple's built-in map app has also got a majorly 3D overhaul, with a full-bodied perspective that feels straight out of Pokémon Go.",
    "Others are finding respite in the patter of rain in the Apple weather app, which now lands and bounces off sections of the UI, like the roof of a building or canopy – giving an additional sense of depth (we can't wait to see what it looks like with snow, either).",
    "While these small and largely cosmetic features may not be enough to swing a smartphone purchase either way, they do add up – and the amount of love shown on social media could well help Apple push its new iPhone 13, iPhone 13 Pro, iPhone 13 mini and iPhone 13 Max models to a wider audience.",
    "Daryl Baxter, TechRadar's Software & Downloads Writer, tells us that \"This year Apple has focused on refining features rather than introducing revolutionary ones, such as Focus and LiveText.",
    "\"iOS 15 is a release that requires users to scratch beneath the surface to discover the refinements, but once they do, they’ll wonder how they managed without them, as I’m discovering with Focus and even the new Weather app.\"",
    "If that's enough to entice you to update from an older iOS build, here's how to get iOS 15 on your phone now."
  ],
  "headers": {
    "8": "Analysis: a refinement of the Apple formula"
  },
  "links": {
    "iOS 15": "https://www.techradar.com/news/ios-15-update",
    "security features": "https://www.techradar.com/news/apple-says-ios-15-makes-it-harder-for-hackers-to-spoof-your-identity",
    "multiple": "https://twitter.com/steeztalksrap/status/1440295924182372352",
    "users": "https://twitter.com/Lojitthan1/status/1440318891041849345",
    "iOS 14": "https://www.techradar.com/news/ios-148",
    "there are now wallpapers to choose for Safari, too.": "https://twitter.com/theITW/status/1440323737123835915",
    "straight out of Pokémon Go": "https://twitter.com/oturbisoluklann/status/1440290669226958860",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPhone 13 Max": "https://www.techradar.com/reviews/iphone-13-pro-max-review",
    "Daryl Baxter": "https://www.techradar.com/author/daryl-baxter",
    "how to get iOS 15 on your phone": "https://www.techradar.com/how-to/how-to-get-ios-15-developer-beta-on-your-iphone"
  }
}