{
  "source": "https://www.techradar.com/news/ps5-restock-in-usa-best-buy-gamestop-sony-direct-dates",
  "title": "PS5 restock: GameStop restock confirmed for today – here's the official time",
  "category": "gaming",
  "updated": "2021-08-30T09:10:44Z",
  "author": "matt-swider",
  "summary": "Our PS5 restock Twitter tracker Matt Swider sent out a Best Buy in-stock alert yesterday, and GameStop and Sony Direct may be next. Here's how to know.",
  "article": [
    "The PS5 restock at GameStop is today, and the official time has been confirmed for 11am EDT for an online-only restock. You can get an alert from our 24/7 PS5 restock Twitter tracker Matt Swider, who will send you an alert when PS5 is in stock – if you follow his account and turn on notifications. Hundreds of followers were able to get the Best Buy PS5 restock for either the $399 PS5 Digital and $499 in the last 24 hours. Timing and persistence count for these restock events.",
    "► When? How? Follow our PS5 restock Twitter tracker Matt Swider and turn on notifications for live restock news. It's the fastest way to get PS5 restock updates.",
    "► Don't buy from other Twitter users – which are all scams. Only buy from the US stores Matt alerts you about. No one will legitimate sell a PS5 for just $550.",
    "Click on this last major Target restock date from Friday of last week, when Target had the $499 PS5 Disc and $399 PS5 Digital in stock. The GameStop PS5 restock will look similar.",
    "The GameStop restock date is likely today, July 15, according to emails sent to our PS5 restock expert Matt Swider and others. The retailer is hyping up its Power Rewards Pro membership, which is now being required if you want 'early access' to ordering the console (how long that access lasts is completely unknown). There may also be an Xbox Series X restock tomorrow also featuring bundles.",
    "Specifically, the retailer mentioned that you'll need a sign-up for its Pro membership ($15 a year) by midnight this morning (meaning a few hours ago) in order for it to count for the upcoming console stock. It didn't specify when this next restock will happen, but it's safe to assume, given that deadline, that we'll see GameStop restock PS5 bundles tomorrow. And if it does happen, we'll be there with a tweet telling you in advance of our next PS5 restock live stream.",
    "The PS5 restock at Best Buy yesterday was the first major console drop this week. We did also see Antonline restock a PS5 bundle yesterday morning, but that sold out in under two minutes, and it wasn't for everyone given the fact that the price was $800+ (though everything was at face value and MSRP for the game and accessory kit included).",
    "Best Buy had both PS5 Digital and Disc for sale with the PS5 console by itself, but as always, this online order confused some people because they needed to buy it by selecting your local store (there's no shipment option and no, you can't buy PS5 in stores yet). This means not every location has inventory and not all of Matt Swider's followers were able to get the console yesterday.",
    "The good news is that there are at least two more PS5 restock opportunities that are being hinted at by major retailers in the US, with GameStop and Sony Direct leading the charge for the remainder of the week, and Walmart a possibility.",
    "On Friday, July 16, it'll be exactly one month since the last Sony Direct PS5 restock – well, the last restock everyone was invited to participate in. The Sony Direct virtual queue doesn't always open up to everyone (see: the June 23 restock that was limited to people with that Sony Direct email invite and left everyone else hanging).",
    "While everyone who got the email invite yesterday in advance of the Friday restock at Sony Direct has been asked to click a link in their email (one-time use) at 3pm EDT / 12pm PDT, Sony usually opens up a second virtual queue at 5pm EDT / 2pm PDT – if there are leftover consoles. Given the fact we've seen hundreds of people buy a PS5 from this open-to-everyone queue, there's a good chance it'll happen at 5pm EDT.",
    "Here's the Sony Direct PS5 restock Twitter alert to look out for.",
    "The next likely Walmart PS5 restock date is later today, July 15, as we haven't seen major stock from the retailer since June 17. With more people having received their orders from the prior PS5 restock (yes, Walmart takes this long to ship to some customers), we're likely going to finally see another round at 3pm this upcoming Thursday.",
    "The good news is that Matt Swider often gets advance notice if there's going to be a Walmart PS5 restock, citing a press release that the retailer issues to TechRadar. The official word comes almost three hours in advance of the restock at 12pm EDT.",
    "You may have missed this or have forgotten about it after the overshadowing Best Buy PS5 restock on Wednesday, but Antonline also had the PlayStation 5 in stock with a mega bundle. It included two games (Spider-Man: Miles Morales and Demon's Souls), along with a 12-month membership to PlayStation Plus, two DualSense controllers and a PlayStation camera. The PS5 price is $829.94, and with sales tax in most US states, you'll pay close to $900.",
    "The good thing about the Antonline PS5 restock is that everything is at face value, so you're not paying a premium for just the console like you would a reseller. The retail site doesn't mess around with the add-to-cart button (meaning once orders open, the checkout process is first-come, first-serve) and Antonline ships the PS5 quickly. It just lasts two minutes in stock, so you'll need our alerts.",
    "The Target PS5 restock just happened last Friday, so we don't expect there to be another for a week or two. Target went three weeks without a restock of the PlayStation 5, so it's safe to assume it needs way more than a single week to move inventory through its warehouses and to individual stores. There have been a few Target PS5 Digital restocks on Monday and Tuesday, the theory being it's at stores that got late shipments of the restock last week.",
    "In 2021, the Target PS5 restock date has always been on a Wednesday or Thursday – except for this past week in which is happened on a Friday (maybe because of the 4th of July holiday). It's also usually at 7:40am EDT, but the PS5 Disc went on sale at 7:07am EDT, which is why we always advise checking for our alert during the 7am EDT hour. Again, no PS5 restock date is expected from Target this week.",
    "The true Newegg PS5 restock is part of its Newegg Shuffle, not the individual console product pages where the prices are well beyond MSRP care of third-party resellers. Newegg Shuffle is the retailer's popular products lottery in which is raffles the ability to purchase GPU, CPU and console items daily – often in bundle form.",
    "The PS5 console doesn't always make it into the selection. In fact, we've been seeing it as part of the Newegg Shuffle every other week. We'll send out an alert daily before the two-hour window in which the Newegg Shuffle period is open for new entries (usually the time is from 11am EDT to 1pm EDT).",
    "The next Sam's Club PS5 restock date is likely next month, as we've already seen the Sony console in stock at the Walmart-owned club store in July, specifically the date was July 1. We don't see Sam's Club offer many PS5 bundles week-to-week, but the benefit to this store, as opposed to Costco, for example, is that you don't have to be a member – you can pay a small fee to buy the console and checkout as a guest.",
    "With Sam's Club restock dates being so rare, we don't advise staying up until 1am EDT every night in order to snag the PS5. However, that's been the most popular time from Sam's Club since launch and we'll send out an alert via our Twitter tracker like the one you see below.",
    "Costco doesn't restock PS5 often – maybe once a month – and it's limited to Costco members, which is actually a good thing if you're a paid member. Even then, it sells out of its bundles just as quickly as Best Buy, GameStop and Walmart. This is due to the fact that its bundles are at face value for the games and accessories. You'll have less than three minutes on most Costco PS5 restock dates to get the console.",
    "Our PS5 restock alerts for Costco, like the one below, is a good reason to tracker the PlayStation 5 with us on Twitter. It can crop up at any moment.",
    "Monday, July 12, could be slow, as are always Monday restock events. But we're still tracking PS5 24/7 at a dozen retailers in the US. We're working overtime to help out the 750,000 followers of Matt Swider, all trying to buy the PS5. It's actually gotten easier to find PS5 in stock during the summer months (it's still not what we'd consider easy), but we don't expect that to last. By the end of September, every parent will want PS5 for the kid during Christmas, so we suggest trying to get it before Black Friday and Cyber Monday.",
    "We'll continue to update PS5 restock news at more retailers gain inventory of the Sony console. Of the main retailers in the US, GameStop has become the easiest to buy the console from thanks to its bundles that turn off resellers. Even then, it sells out consistently without everyone being able to buy it, accordingly to the vocal followers of PS5 restock tracker Matt Swider. We'll keep checking tonight as well as tomorrow, July 15."
  ],
  "headers": {
    "4": "GameStop PS5 restock date likely today",
    "6": "PS5 restock news: Best Buy sells out in minutes",
    "9": "Sony Direct PS5 restock date and time",
    "12": "Walmart PS5 restock date: almost always Thursday",
    "14": "Antonline PS5 restock happened too",
    "16": "Target PS5 restock date",
    "18": "Newegg PS5 restock date",
    "20": "Sam's Club PS5 restock date",
    "22": "Costco PS5 restock date"
  },
  "links": {
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "Follow our PS5 restock Twitter tracker Matt Swider": "https://www.twitter.com/mattswider",
    "Xbox Series X restock": "https://www.techradar.com/news/xbox-series-x-restock-in-usa-best-buy-walmart-target-microsoft-availability",
    "PS5 restock live stream": "https://www.youtube.com/watch?v=6_2svMc3gos",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}