{
  "source": "https://www.techradar.com/news/playstation-announces-black-friday-sale-with-discounts-on-recent-ps5-releases",
  "title": "PlayStation announces Black Friday sale with discounts on recent PS5 releases",
  "category": "gaming",
  "updated": "2021-11-18T18:24:02Z",
  "author": "emma-boyle",
  "summary": "Deathloop, Far Cry 6 and Returnal make the list",
  "article": [
    "Sony Interactive Entertainment has announced its plans for Black Friday 2021and they include PlayStation Store discounts on some fairly recent releases for PS4 and PS5.",
    "In an official PlayStation Blog post, Chris Howe, the Group Manager for Content Lifecycle Marketing at SIE confirmed that PlayStation’s Black Friday deals will begin on November 19 at midnight local time, with “great deals” and “deep discounts” to be expected on “a variety of titles on the PlayStation Store”.",
    "This is followed by a long list of all the titles that PlayStation players can expect to see discounted on the PlayStation Store when the sale begins. There are some pretty attention-grabbing recent releases for both PS4 and PS5 in the list, including Deathloop, Far Cry 6 and FIFA 22. PS5 exclusives Ratchet and Clank: Rift Apart and Returnal are even in there, too.",
    "Aside from recent releases, there are some other great games in there that you might have missed when they were first released but should definitely experience at some point. Titles like Hitman 3, Demon’s Souls, Dishonored 2 and Red Dead Redemption 2 really stand out. And, hey, if you’re a fan of The Sims 4 on console then it’s a good time to pick up some expansion packs as there are plenty of them up for grabs—13 in total.",
    "Of course, while it’s exciting to see it confirmed that such recent releases are going to be discounted in a mere matter of hours, the post doesn’t actually confirm exact prices for the games. Instead, it says that “all discounts will be revealed on PlayStation Store tomorrow”, so right now it’s a case of keeping your fingers crossed and hoping that the games you have your heart set on will get the deepest discounts. The sale will last until November 29, 23.59pm local time, so there’s a fairly decent window of time in which you can consider your purchases.",
    "PlayStation Direct will also have deals to look out for, with a promise that these will include “the DualSense wireless controller + NBA 2K21 Jumpstart Bundle” as well as “numerous PS5 and PS4 titles”. Away from games, the blog post mentions a 20% discount on apparel, accessories, collectables and more at the PlayStation Gear Store. Getting that discount is just a matter of using the code \"BLACKFRIDAY20\" at the checkout.",
    "Black Friday is generally a pretty good time to pick up games that you’ve had your eye on for a while or games that you don't want to take a chance on unless you're getting money off them. It’s not everyone that can pick up every game as soon as it’s released, whether due to constraints on time or money. If you have been holding out for a title, Black Friday is generally the time to go for it as, on top of finally getting a game you want, often you’re also getting the added bonus of a small (or maybe even large) discount.",
    "It’s not just games that are good to pick up on Black Friday, either. For PlayStation owners especially, it’s a great time to renew your PlayStation Plus membership. The blog post does state that there’ll be “deals on PlayStation Plus and PlayStation Now memberships” so it could be a pretty good time to pick up a 12 month membership and not have to worry about it again until next Black Friday, when you can usually be pretty sure you’ll get it for a decent bit of money off again.",
    "At TechRadar we’re tracking the best Black Friday deals so keep checking the site for the latest. Aside from the games, for those who are still seeking the elusive PS5 console, we’re also tracking PS5 Black Friday deals and even the best PS5 SSD deals for when you do finally get your hands on one and want to fill it up with all your discounted titles."
  ],
  "headers": {
    "6": "Opinion: A good time if you've been holding out"
  },
  "links": {
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation Blog post": "https://blog.playstation.com/2021/11/18/playstations-black-friday-deals-2021/",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Hitman 3": "https://www.techradar.com/reviews/hitman-3",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Red Dead Redemption 2": "https://www.techradar.com/news/games-of-the-generation-red-dead-redemption-2-is-so-real-youll-feel-the-saddle-sores",
    "The Sims 4 on console": "https://www.techradar.com/how-to/how-to-cheat-in-the-sims-4",
    "PlayStation Plus membership": "https://www.techradar.com/black-friday/black-friday-ps-plus-deals",
    "PS5 Black Friday deals": "https://www.techradar.com/black-friday/best-black-friday-ps5-deals-2021",
    "best PS5 SSD deals": "https://www.techradar.com/news/ps5-ssd-black-friday-deals"
  }
}