{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-s21-fe-is-rumored-to-cost-the-same-as-the-s20-fe",
  "title": "The Samsung Galaxy S21 FE is rumored to cost the same as the S20 FE",
  "category": "phones",
  "updated": "2021-12-03T14:00:05Z",
  "author": "david-nield",
  "summary": "Hitting the mark",
  "article": [
    "The Samsung Galaxy S21 FE is expected to finally make its debut next month, and according to the latest rumor, it's going to go on sale at the same price point as the Samsung Galaxy S20 FE that it's replacing.",
    "This comes from well-known tipster Roland Quandt, who has said that the Galaxy S21 FE will retail for $699 in the US. Other territories aren't mentioned, but the 5G version of the Galaxy S20 FE was originally sold for $699 / £699 / AU$1,149.",
    "A previous leak put the European pricing for the Galaxy S21 FE at €649, so we're starting to get close to the complete picture when it comes to how much of your hard-earned cash you'll have to part with to get yourself this phone.",
    "We've seen so many leaks and rumors around the Galaxy S21 FE that there's not going to be much left for Samsung to reveal in January. The handset is expected to make its debut at the CES 2022 event at the start of next month.",
    "The smartphone is said to sport a 6.5-inch, 2400 x 1080 pixel resolution OLED display, and is apparently fitted with a 4,500mAh battery – those specs match the Samsung Galaxy S20 FE exactly, so there's no change there.",
    "There is going to be a faster processor though, with the Galaxy S21 FE following the lead of the Samsung Galaxy S21 by making use of a Snapdragon 888 chipset. That's expected to be paired with a modest 6GB of RAM and 128GB of internal storage.",
    "The Fan Edition phones that Samsung now puts out each year have traditionally done a good job of taking the best bits of the Galaxy S series flagships – typically the screen quality and the processor power – and putting them in a more affordable package.",
    "RIght now all the indications are that the Galaxy S21 FE is going to offer plenty of value for money, but as always pricing is crucial: Samsung can probably get away with a starting price of $699 for the phone, but it isn't going to want to go any higher than that.",
    "Remember that the standard Galaxy S21 has an official retail price of $799 / £769 / AU$1,249, and you may even be able to get it cheaper than that with the Galaxy S22 around the corner. Samsung does well to cover a multitude of price points with its phones, but it can make it difficult for some in the range to stand out.",
    "And there's plenty of competition around at this price point as well, from the OnePlus 9 to the Google Pixel 6. The Samsung Galaxy S21 FE has had a long road to market, and it'll be interesting to see just how many people find it appealing enough to buy."
  ],
  "headers": {
    "3": "What we know so far",
    "6": "Analysis: the price needs to be right"
  },
  "links": {
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Roland Quandt": "https://twitter.com/rquandt/status/1466216215572099073",
    "previous leak": "https://www.techradar.com/news/samsung-galaxy-s21-fe-leak-shows-off-all-the-phones-color-options",
    "CES 2022": "https://www.techradar.com/news/ces-2022",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6"
  }
}