{
  "source": "https://www.techradar.com/news/loki-was-supposed-to-die-in-the-worst-mcu-movie",
  "title": "Loki was supposed to die in the worst MCU movie",
  "category": "entertainment",
  "updated": "2021-05-21T09:07:01Z",
  "author": "tom-power",
  "summary": "Loki wasn't expected to return after Thor: The Dark World",
  "article": [
    "Loki is less than three weeks away from debuting on Disney Plus, and Marvel Studios is in full marketing mode as a result.",
    "There's still lots we don't know about the God of Mischief's upcoming TV show, but one thing is for sure – Loki's Disney Plus series almost didn't happen in the first place.",
    "Why? Because the Trickster God was supposed to be killed off in Thor: The Dark World.",
    "Spoilers follow for Thor: The Dark World.",
    "Ahead of Loki's launch on June 9, Entertainment Weekly sat down with star Tom Hiddleston, Marvel Studios president Kevin Feige and series showrunner Michael Waldron to discuss the TV show in more detail.",
    "There's plenty of fascinating content within EW's cover story (more on some of that in a moment). Perhaps the most interesting tidbit, though, is the confirmation that Loki was supposed to die in Thor 2.",
    "For those who need reminding, Loki appeared to die after his and Thor's confrontation with Malekith's right-hand man Algrim. However, as we see during the film's finale, Loki is alive and well, and is masquerading as Odin, the King of Asgard.",
    "Despite Loki's popularity – Hiddleston's portrayal of the character in Thor and The Avengers won him legions of fans back in 2009 and 2011 respectively – Marvel had planned to kill him in Thor 2. After test audiences for The Dark World refused to believe he died fighting the Dark Elves, though, the studio altered Thor 2's ending to reflect fans' expectations.",
    "It's intriguing to learn that Marvel Studios are open to changing their plans for the MCU.",
    "This is a studio that plans its movies (and TV shows) years in advance, and it's likely that Feige and company already know where they'll take the MCU (or should that be Marvel Cinematic Multiverse?) in Phase 5 and beyond. However, bringing Loki back from the dead in Thor: The Dark World proves that they can change tack based on test audiences' reactions, which might open the door for other alterations down the line.",
    "This is already evident by the fact that Feige has declined to comment on how Loki's Disney Plus series may affect the MCU moving forward.",
    "Speaking to EW, Feige refused to confirm if Loki factored into other upcoming Marvel projects, including Doctor Strange 2. Curiously, this appears to go against comments he's made previously, with Feige telling Bloomberg (back in November 2019) that Loki would tie into the events of Doctor Strange in the Multiverse of Madness.",
    "At the time, Feige said: “I’m not sure we’ve actually acknowledged that (Loki tying into Doctor Strange 2) before, but it does.”",
    "It seems strange that Feige would backtrack somewhat on those comments. He doesn't explicitly say that Loki won't set up Doctor Strange 2's events in some way, but refusing to confirm that Loki's series will may indicate that Marvel's blueprint has changed since then. If that's the case, it means that their plans are more flexible than we previously thought.",
    "What Feige does tease, though, is the possibility that we might get some surprising MCU cameos in Loki's Disney Plus series.",
    "He told EW: \"Part of the fun of the multiverse and playing with time is seeing other versions of characters, and other versions of the titular character in particular.\"",
    "Who could show up? Your guess is as good as ours. There are lots of potential candidates, and there have even been rumors that Kang the Conqueror, the MCU's supposed next big bad, could appear in some capacity. We already know that a character in Loki - Judge Ravonna Renslayer - has ties to Kang the Conqueror through Marvel's comics, so there's a good chance he could show up or, at the very least, be mentioned.",
    "As for whether Hiddleston will reprise his most iconic role in a second season, Loki's star is keeping schtum on the matter.",
    "\"I'm open to everything,\" he says. \"I have said goodbye to the character. I've said hello to the character. I said goodbye to the character [again]. I've learned not to make assumptions, I suppose. I'm just grateful that I'm still here, and there are still new roads to explore.\"",
    "It's possible that we could get Loki season 2, but that seems like it'll be dependent on how the Marvel Cinematic Multiverse (MCM) plays out. Loki season 1 will only scratch the surface of of the MCM, so there are plenty of other worlds, dimensions, and universes that Loki could travel to in the future.",
    "For now, though, it doesn't sound like Loki season 2 is up for discussion. We'll have to make do with the character's six-episode miniseries when it lands on Disney Plus on Wednesday, June 9."
  ],
  "headers": {
    "8": "Analysis: reversing Loki's death in Thor 2 shows Marvel is willing to alter its MCU plans"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Entertainment Weekly": "https://ew.com/tv/tom-hiddleston-loki-digital-cover/",
    "Bloomberg": "https://www.bloomberg.com/news/features/2019-11-07/inside-disney-bob-iger-on-star-wars-pixar-and-more",
    "rumors": "https://thedirect.com/article/loki-disney-tesseract-marvel-studios-tom-hiddleston-episodes",
    "could appear": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/n2z7s5/on_the_loki_imdb_costume_department_crew_page/"
  }
}