{
  "source": "https://www.techradar.com/news/firefox-vs-edge-the-fiercest-rivalry-in-the-browser-industry",
  "title": "Edge vs. Firefox: The browser wars rage on",
  "category": "computing",
  "updated": "2021-08-09T16:28:56Z",
  "author": "joel-khalili",
  "summary": "Firefox and Edge are neck and neck in the rankings",
  "article": [
    "The browser industry has found itself in a position of stalemate, despite the efforts of Chrome, Edge, Safari and Firefox to outdo one another, new data shows.",
    "As per the latest figures from Statcounter, no major browser has experienced a rise or fall in market share of more than 1.74% since the start of the year.",
    "In spite of the bounty of new features pushed out by smaller rivals, the most significant growth was achieved by market leader Google Chrome, which has expanded its share from 63.38% to 65.12% since January.",
    "Further down the rankings, change in market share has been even less pronounced: Safari experienced a drop of 0.6% and Firefox of 0.32%, while Edge grew its user base by the equivalent amount.",
    "Arguably the most fascinating rivalry in the browser industry is between Mozilla Firefox and Microsoft Edge, two services fighting for the honor of third largest browser (behind Chrome and Safari).",
    "Since its re-release in January 2020, Microsoft Edge has gone from strength to strength and now holds 3.4% of the market. In May, Edge even overtook Firefox in the rankings for the first time.",
    "The growth of Microsoft’s new flagship can be attributed to a range of factors, including renewed marketing efforts and a commitment to making improvements that bring the experience in line with other modern browsers.",
    "However, despite the company’s best efforts, the growth of Edge has stalled since the turn of the year, in part due to the pool of Internet Explorer and Edge Legacy users running dry, many of whom have now already made the transition. Although the Edge market share is up on the 3.08% held in January, there has been only a 0.1% change in the last six months.",
    "Mozilla, meanwhile, has found it difficult to pull Firefox out of a downward spiral that now extends back a number of years. According to Statcounter, the browser has either lost or maintained market share in ten of the last twelve months.",
    "The fact Firefox managed to retake third position from Edge last month (with a share of 3.45%) is a victory of sorts, but will be cold comfort for anyone who remembers a time in which Mozilla enjoyed a whopping 30% of the market, behind only Internet Explorer.",
    "Perhaps sensing it cannot compete with Microsoft and Google when it comes to features, Mozilla’s favored battleground is now data privacy. On top of privacy-centric features for Firefox, the company has rolled out a range of new privacy products, including a VPN service. It has also been vocal about its disapproval of reform to online advertising proposed by Google, which it sees as equally invasive as third-party cookies.",
    "No browser is positioned to challenge the lead of Google Chrome in the near future, short of regulatory reform that blocks Google from drawing advantage from its positions in the search, collaboration and OS markets.",
    "However, the battle between Firefox and Edge further down the rankings is delicately poised. The pair have been neck and neck all year, but this sort of equilibrium rarely lasts for long."
  ],
  "headers": {
    "4": "Firefox vs. Edge"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "latest figures": "https://gs.statcounter.com/",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Firefox": "https://www.techradar.com/reviews/mozilla-firefox",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}