{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-spotted-in-online-listing",
  "title": "Nvidia GeForce RTX 3080 Ti spotted in online listing",
  "category": "computing",
  "updated": "2021-04-26T10:32:52Z",
  "author": "jess-weatherbed",
  "summary": "The MSI flavored 3080 Ti is already making waves",
  "article": [
    "The Nvidia GeForce RTX 3080 Ti has made a few appearances in the news over recent weeks with rumors regarding its launch date seemingly settling on May 26 – with the RTX 3070 Ti to follow hot on its heels. One version of the graphics card, the MSI 3080 Ti Ventus 3X OC, has already been mentioned when it was spotted on a shipment bound for the US. The very same GPU has now appeared in a listing on Polish retailer website X-Kom, albeit without any images or the ability to preorder the card.",
    "It's likely the listing is in preparation of an official launch date for the product as the retailer is allowing customers to enquire about stock availability (indicating they are fully aware the page is live), but X-Kom is unable to provide information based on the price of the GPU or any shipment dates. There isn't any official price for the GeForce RTX 3080 Ti just yet, but speculation points to it being on the pricey side at ¥7,999 in China, which is around $1,099 / £800 / AU$1,420. This is still cheaper than the RTX 3090, but certainly not an affordable piece of hardware for everyone. Despite the lack of any actual images, we expect the MSI 3080 Ti Ventus 3X OC graphics card will look identical to the RTX 3080 and RTX 3090, featuring a 2.5 slot and triple-fan cooling solution as well as a graphene backplate. It's also anticipated the GPU will use dual 8-pin connectors for power and feature the standard HDMI and triple Display Port outputs.",
    "It's currently anticipated that the GeForce RTX 3080 Ti will have 10,240 CUDA cores, 12GB of GDDR6X video memory, and a 384-bit memory bus, placing it (unsurprisingly) between the RTX 3080 and RTX 3090 graphics card specifications. There have also been reports that Nvidia will include the same mining performance limiter with the 3080 Ti that we've seen included in the RTX 3060 GPU to reduce the hashrate of the GPU by 50% when crypto-mining activity is detected, something that aims to prevent the cards being scooped up en masse for use in mining rigs and farms. This didn't initially end well for the GeForce RTX 3060, with the limiter being removed by Nvidia's own update and eventually being fully cracked by miners, but Team Green has since gone back to redesign the GPU in a bid to keep its tech in the hands of gamers. The new version of the hash rate limiter could be what we see in all new Ampere cards going forward, but this has yet to be officially confirmed. As with any news we get outside of the official source, take all this with a healthy portion of salt until Nvidia makes an announcement. We can at least establish that the RTX 3080 Ti does in fact exist, so all we can do is wait and hope that enough stock is available to purchase when it finally hits the shelves.",
    "Via VideoCardz"
  ],
  "headers": {
    "2": "Pro gamer, anti mining"
  },
  "links": {
    "Nvidia GeForce RTX 3080 Ti": "https://www.techradar.com/news/your-nvidia-geforce-rtx-3090-might-secretly-be-an-old-rtx-3080-ti",
    "RTX 3070 Ti": "https://www.techradar.com/news/the-nvidia-rtx-3070-ti-might-actually-release-after-cancellation-rumor",
    "shipment bound for the US": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-gpu-could-be-closer-to-launch-than-we-thought",
    "X-Kom": "https://www.x-kom.pl/p/649727-karta-graficzna-nvidia-msi-geforce-rtx-3080-ventus-3x-oc-12g-gddr6x.html#Specyfikacja",
    "GeForce RTX 3080 Ti": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-might-have-just-been-leaked-by-hp",
    "speculation points to it being": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-leaks-reveals-high-price-and-how-it-will-combat-cryptominers",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "mining performance limiter": "https://www.techradar.com/news/nvidia-might-throttle-crypto-performance-of-the-rumored-rtx-3080-ti",
    "RTX 3060 GPU": "https://www.techradar.com/news/nvidia-to-launch-new-anti-cryptomining-gpu-to-replace-the-rtx-3060",
    "Nvidia's own update": "https://www.techradar.com/news/did-nvidia-just-unlock-rtx-3060-cryptomining-by-mistake",
    "new version of the hash rate limiter": "https://www.techradar.com/news/sorry-cryptominers-new-geforce-rtx-3080s-rtx-3090s-may-get-mining-limiters",
    "Ampere cards": "https://www.techradar.com/news/nvidia-ampere",
    "VideoCardz": "https://videocardz.com/newz/msi-geforce-rtx-3080-ti-ventus-3x-oc-listed-by-polish-retailer"
  }
}