{
  "source": "https://www.techradar.com/news/epic-black-friday-deal-drops-the-apple-watch-se-to-just-dollar219-the-lowest-price-ever",
  "title": "Epic Black Friday deal drops the Apple Watch SE to just $219 - the lowest price ever",
  "category": "wearables",
  "updated": "2021-11-21T04:14:17Z",
  "author": "mackenzie-frazier",
  "summary": "Grab the Apple Watch at a record-low price ahead of Black Friday",
  "article": [
    "The Black Friday deals event is less than a week away and we've already spotted a fantastic offer on the best-selling Apple Watch SE. Amazon just dropped the Apple Watch SE to only $219 (was $279). That's a $60 discount and the cheapest deal we've seen for the budget smartwatch. Black Friday Apple Watch deals are always some of the hottest bargains and this is the best offer we've spotted so far. Discounts on the Apple Watch 6 and 7 have been difficult to find recently due to low stock issues. As of right now, the Apple Watch SE is in stock and ready to ship to we've grab this incredible Black Friday deal now before it's too late.",
    "The Apple Watch SE shares many of the same features as the Apple Watch 6 but at a lower price point. While the SE lacks the always-on display and ECG app, the smartwatch tracks activity, sleep, and calories burned and will notify you when a high or low heart rate is detected. The water-resistant smartwatch also helps you stay connected with the ability to receive notifications, take calls, and reply to texts directly from your wrist. If you're looking for more Black Friday Apple Watch deals, you can also find discounts on the Apple Watch 6 and the Apple Watch Series 3 below.",
    "Shop more offers with our roundup of the best Black Friday Apple deals that are happening now."
  ],
  "headers": {
    "1": "Today's best Black Friday Apple Watch deal",
    "2": "More Black Friday Apple Watch deals"
  },
  "links": {
    "to only $219 (was $279)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-Watch-GPS-40mm-Aluminium%2Fdp%2FB09G93BDQP%2F%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9408831154254438000-20",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Apple Watch SE": "https://www.techradar.com/reviews/apple-watch-se-review",
    "Black Friday Apple Watch deals": "https://www.techradar.com/black-friday/black-friday-apple-watch-deals-sales",
    "Black Friday Apple deals": "https://www.techradar.com/black-friday/apple-black-friday-deals"
  }
}