{
  "source": "https://www.techradar.com/news/an-open-source-apple-m1-chip-is-possible-not-that-apple-would-ever-allow-it",
  "title": "An open-source Apple M1 chip is possible – not that Apple would ever allow it",
  "category": "computing",
  "updated": "2021-09-20T15:31:03Z",
  "author": "rhys-wood",
  "summary": "Researchers are attempting to reverse-engineer Apple's M1 chip",
  "article": [
    "Researchers are attempting to reverse-engineer Apple's M1 chip, which could allow it to be used in an open-source capacity. In layman's terms, this would (in theory) make the M1 chip compatible with other operating systems like Windows 11 and Linux.",
    "Reported by Wccftech, a number of researchers and professionals have been hard at work tinkering with the ins and outs of Apple's silicon, with Apple QuickTime developer Maynard Handley publishing a 350-page document online which details the M1 chip and the reverse-engineering process so far.",
    "An eventual and successful result would show that it's possible to make the M1 compatible with operating systems other than macOS. However, we don't know when (or if) the project will bear fruit, as the M1 Exploration document is still very much in its early stages at a revision of 0.70.",
    "As such, expect it to be a while before we know for definite if Apple's M1 chip can be made compatible with the likes of Windows et al. Naturally, the project will also involve countless hours of trial and error, progress roadblocks and other irritations that come with the complex process of reverse-engineering.",
    "The M1 chip remains under lock and key at Apple, and will naturally be exclusive to macOS devices going forward. While this has an obvious benefit for the company itself, it's a shame that the impressive power of the M1 won't be accessible to the vast majority of PC users.",
    "It's highly unlikely that Apple would greenlight open-source versions of its M1 silicon, meaning that the so-called M1 Exploration process will probably remain a passion project more than anything. Still, we'd very much welcome the possibility of an open-source M1, and if it is possible, could have consumers registering interest to Apple directly.",
    "We might also look at this reverse-engineering project as a proof of concept for future Apple chips, like the upcoming M1X and 2022's M2 rumored to debut in revised MacBook Pro and MacBook Air models respectively. Apple is quite notorious when it comes to keeping its toys to itself in regards to both hardware and software. As such, Apple could double down by making future chips even more difficult to reverse-engineer."
  ],
  "headers": {
    "4": "Analysis: If the M1 could, then the M1 should"
  },
  "links": {
    "Apple's M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Wccftech": "https://wccftech.com/apple-m1-reverse-engineering-attempts/",
    "350-page document": "https://drive.google.com/file/d/1WrMYCZMnhsGP4o3H33ioAUKL_bjuJSPt/view",
    "macOS": "https://www.techradar.com/news/macos-12",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "M2": "https://www.techradar.com/news/rumored-macbook-pros-could-use-m1x-chip-this-year-with-m2-coming-in-2022",
    "MacBook Pro": "https://www.techradar.com/reviews/macbook-pro",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020"
  }
}