{
  "source": "https://www.techradar.com/news/blockchain-hacks-led-to-billions-in-losses-last-year",
  "title": "Blockchain hacks led to billions in losses last year",
  "category": "computing",
  "updated": "2021-01-14T00:24:52Z",
  "author": "anthony-spadafora",
  "summary": "Cybercriminals launched 122 attacks targeting blockchains in 2020",
  "article": [
    "In addition to coronavirus scams, cybercriminals also leveraged the pandemic to launch blockchain-related cyberattacks on unsuspecting users and organizations to steal billions last year.",
    "Atlas VPN has released a new report revealing that blockchain hackers stole nearly $3.78bn in 122 attacks throughout 2020. In fact, the amount of blockchain-related attacks that occurred last year alone account for almost a third of all attacks targeting blockchain projects.",
    "These figures are based on data provided from Slowmist Hacked which tracks and aggregates information regarding disclosed attacks aimed at blockchain projects, apps and tokens. Blockchain scams are also included in this data and they made up 13 percent of all blockchain hacking events that occurred in 2020.",
    "The monetary losses from blockchain hacks were calculated based on conversion rates from January of this year, so the cybercriminals behind them may have actually even stolen more money than the amount reported by Slomist Hacked and AtlasVPN.",
    "Ethereum (ETH) DApps or decentralized applications based on the Ethereum smart contract were the most frequently targeted blockchain project last year. In total, there were 47 successful attacks aimed at ETH Dapps in 2020 which costs victims around $436.36m or $9.28m per hack.",
    "As cryptocurrencies such as Bitcoin saw a major resurgence last year, cryptocurrency exchanges experienced 28 breaches that together amounted to $300.15m in losses or $10.72m per hack.",
    "Blockchain wallets, which are used to story cryptocurrencies, were also targeted by cybercriminals in 27 successful attacks that brought in $3.03bn or $112.12m per hack. Blockchains themselves were even affected by hacks in 2020 with 12 successful attacks launched at different blockchains and the cybercriminals responsible earned $5.91m or $492k per each breach.",
    "As we begin the new year, expect hackers to continue targeting blockchains and cryptocurrencies since these attacks were so profitable for them in 2020."
  ],
  "headers": {
    "4": "Blockchain targets"
  },
  "links": {
    "coronavirus scams": "https://www.techradar.com/news/coronavirus-malware-scams-return-with-a-venegeance",
    "Atlas VPN": "https://www.techradar.com/reviews/atlas-vpn",
    "new report": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_9901798852204540000&xs=1&url=https%3A%2F%2Fatlasvpn.com%2Fblog%2Fblockchain-hackers-stole-3-8-billion-in-122-attacks-throughout-2020&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fblockchain-hacks-led-to-billions-in-losses-last-year",
    "blockchain": "https://www.techradar.com/news/what-is-blockchain-everything-you-need-to-know",
    "Ethereum": "https://www.techradar.com/news/against-all-odds-ethereum-20-is-finally-here",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "cryptocurrency exchanges": "https://www.techradar.com/best/mining-rigs",
    "Blockchain wallets": "https://www.techradar.com/news/best-bitcoin-wallets"
  }
}