{
  "source": "https://www.techradar.com/news/browser-maker-brave-launches-privacy-first-search-engine",
  "title": "Browser maker Brave launches privacy-first search engine",
  "category": "computing",
  "updated": "2021-06-22T16:17:42Z",
  "author": "abigail-opiah",
  "summary": "Brave Search looks to offer independent privacy search alternative",
  "article": [
    "The makers of the Brave browser has announced the rollout of a new independent option for online search that it says will give users a new level of privacy.",
    "Online users of Brave's browser will soon have access to the newly released Brave Search beta that fully controls their online experience.",
    "Brave Search is built on top of an independent index, and doesn’t track users, their searches, or their clicks, according to the company.",
    "The Brave Search beta has been released globally on all Brave browser versions (desktop, Android, and iOS) as one of the options alongside other search engines, before becoming the default later this year.",
    "It is also available from any other browser at search.brave.com.",
    "Brave Search was announced last March when Brave acquired Tailcat, and since then it has been tested by over 100,000 early access users.",
    "Brendan Eich, company CEO and co-founder, said Brave Search is the industry’s most private search option, as well as the only independent search engine, giving users the control and confidence they seek in finding an alternative to big tech.",
    "“Unlike older search engines that track and profile users, and newer search engines that are mostly a skin on older engines and don’t have their own indexes, Brave Search offers a new way to get relevant results with a community-powered index, while guaranteeing privacy,\" Eich added.",
    "\"Brave Search fills a clear void in the market today as millions of people have lost trust in the surveillance economy and actively seek solutions to be in control of their data.”",
    "Brave already offers privacy-preserving Brave Ads, Brave News, and a Firewall+VPN service, and Brave Search includes anonymized contributions from the community to improve and refine results."
  ],
  "headers": {
    "3": "Brave Search beta"
  },
  "links": {
    "Brave": "https://www.techradar.com/reviews/brave-web-browser",
    "browser": "https://www.techradar.com/best/browser"
  }
}