{
  "source": "https://www.techradar.com/news/many-firms-are-worried-about-remote-work-productivity-but-arent-doing-anything-about-it",
  "title": "Many firms are worried about remote work productivity but aren't doing anything about it",
  "category": "computing",
  "updated": "2021-09-21T10:19:35Z",
  "author": "sead-fadilpasic",
  "summary": "Automation does wonders for remote workers",
  "article": [
    "Most businesses are well aware of the fact that remote workers can only be productive with proper technologies at their disposal, and yet, are doing very little to acutally provide such tools, a new report from Ricoh Europe claims.",
    "Polling 250 decision-makers across the UK and Ireland, Ricoh found that just a third (36%) of firms provided their employees with the tools and technologies needed to keep their productivity levels high while working from home.",
    "At the same time, almost half (49%) of employers understand that investing in AI and automation improves the productivity of their remote workforce.",
    "As a result, most employees are ill-prepared for remote and hybrid working. Yet, just a quarter (23%) of decision-makers believe their company will return to the “old normal” in the next 12 months.",
    "Behind these findings lies the fact that employers often don’t understand the barriers to productivity that their employees are facing, the report suggests.",
    "Business leaders often overestimate the time their workers spend on work that delivers real value to customers. At the same time, employees are saying they’re being flooded with “less impactful” assignments.",
    "The majority (64%) of leaders believe their workers spend up to three hours a day on high-value activity, when in reality, they spend just over an hour (73 minutes). Furthermore, half (49%) believe in-office collaboration is vital for the future success of their organization.",
    "“It is important to remember that technology that aids productivity for hybrid work will benefit people while they are in the office, too,” commented David Mills, CEO, Ricoh Europe. “This is particularly true for automation and AI-based tools, which employees increasingly crave, because it frees them from repetitive, low-value work, to focus on more rewarding tasks.”",
    "For Nicola Downing, COO, Ricoh Europe, investing in new technologies also means investing in talent retention. Businesses “risk losing the talent that has stayed with them for the duration of the pandemic if they fail to invest in the technology that will boost productivity for the hybrid work era and beyond,” he says.",
    "“Employers should remember that establishing hybrid working practices, which put employee needs at the heart of decision making, demonstrates commitment and understanding of the challenges these workers have faced, increases productivity and fosters loyalty.”"
  ],
  "headers": {
    "4": "Understanding the barriers to productivity"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}