{
  "source": "https://www.techradar.com/news/heres-what-the-past-year-tells-us-about-the-future-of-hybrid-work",
  "title": "Here's what the past year tells us about the future of hybrid work",
  "category": "computing",
  "updated": "2021-03-26T16:55:02Z",
  "author": "stuart-templeton",
  "summary": "The age of the physical office may be over, but the age of the employee-led office has only just begun",
  "article": [
    "It wasn’t clear then, but this time last year, as employees packed up their desks and headed home, work entered a new era.",
    "Twelve months on, many are yet to return to the office. And, whether due to organizations downscaling their physical space, employees having moved out of city centers or new flexible policies, some won’t be heading back—even once rules allow. The age in which the physical office is the assumed default is over.",
    "The last year hasn’t been without challenges, but overall workers are generally more satisfied with remote work than they were office-based work. Looking ahead, the vast majority of employees (72.2%) want a hybrid remote-office model in the future, compared to just 11.6% who want to return to full-time office work.",
    "It’s become clear to leaders too, that the idea of productivity being tied to the office is a myth. As a result, some of the biggest businesses on the planet are opting to give every employee the option to work remotely moving forward.",
    "The virtual office is here to stay. With the past year putting many misconceptions about remote work to rest, and giving businesses a chance to adapt, organizations should now focus on employee experience in the remote and hybrid world. According to future of work expert Jacob Morgan, employee experience is all about “creating an organization where employees want, not need, to show up to work—by focusing on culture, technology, and physical space.”",
    "Last year, businesses had to be flexible. The pandemic was fast moving, and to keep employees safe, and organizations running, plans had to be adapted rapidly. On an individual level, employees needed to be able to home-school children, prioritize shopping for essential supplies, and/or care for unwell relatives.",
    "It quickly became clear that tying work to a 9-5 schedule doesn't always make sense. Making flexibility a default both in terms of hours worked, and location, helps teams shape work around life commitments, while remote options with less time on the commute can mean more time for meaningful work or other commitments.",
    "While increased flexibility has helped many adapt to the pandemic, the lack of office-based work has created a challenge for some when it comes to checking in with teams. Likewise, many will miss those chance encounters with colleagues, deskside conversations or kitchen chats, that added color to the office-based day. Flexibility only goes so far if employees feel disconnected.",
    "To overcome this, organizations have to strike the right balance of scheduling one-on-one calls, holding informal meetings, and even trying out new tools that simulate those serendipitous office moments. Meanwhile leadership should get ‘pulse checks’ using tools like Culture Amp, which survey how people are feeling and help leaders take action to support workers. Going further, investing in apps like Calm and Headspace can promote psychological wellbeing and help teams manage stress or uncertainty.",
    "Overall, a culture with employee experience in the virtual or hybrid office should default to flexibility and support, with technology that encourages action on employee feedback and actively promotes wellbeing.",
    "To further solidify a culture, it’s important that apps and interactions tie into a digital HQ—a single space for work and social connections. It’s here that virtual and hybrid culture lives. The digital HQ should enable flexible, asynchronous work, and boost employee experience by keeping the virtual office cohesive, rather than a fragmented set of different pieces of software acting independently.",
    "Using a channel-based messaging platform can keep all conversations, docs, apps, and information about work in one place. Channels can also be created to cultivate non-work interests, like book clubs or Netflix recommendations. Leaders can enable team members to air concerns by setting up transparent “Ask Me Anything” channels. And, by defaulting to the channel—in which everyone on a given project or topic has access to all information being shared—instead of email, which silos information, core work processes can be kept transparent and accessible.",
    "While the virtual office is at the center of the future of work, employees still need a physical space, whether at home, in the office, or elsewhere, to work from. Rather than either maintaining existing office spaces or abandoning them entirely, organizations should think about how they can provide employees with the physical space they need to create the best employee experience.",
    "While it’s likely to be a longer-term adjustment than the initial move to remote work, businesses might consider smaller, more flexible satellite offices closer to people’s homes rather than mammoth city-center HQs. How those spaces are laid out needs to be dictated by the individual company (and health requirements) as well as the need to ensure employees feel safe.",
    "Instead of defaulting to a smaller open-plan office, leaders should survey employees to see what they want; it may be that spaces for collaboration and interaction, quiet meeting rooms for one-ones with clients, or even individual booths, take priority over standard desks.",
    "If one thing has become clear over the past year, it's the need to look at every element of work from the employee perspective.",
    "Employee experience and wellness, not just productivity, should be a management KPI for organizations adapting to a hybrid and remote future. Defaulting to flexibility and encouraging engagement, underpinning the virtual office with a cohesive collaboration platform and taking a purpose-led approach to physical space will be vital for organizations shaping a better employee experience for the future.",
    "The age of the physical office may be over, but the age of the employee-led office has only just begun."
  ],
  "headers": {
    "5": "Creating a flexible and caring culture",
    "10": "The virtual work hub",
    "12": "Rethinking what physical workspaces",
    "15": "Putting employees in the driving seat"
  },
  "links": {
    "remote work": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}