{
  "source": "https://www.techradar.com/news/apple-music-hi-fi-tier-could-land-alongside-airpods-3-bringing-key-advantage-over-spotify",
  "title": "Apple Music Hi-Fi tier tipped to appear in coming weeks, launch with Airpods 3",
  "category": "audio-visual",
  "updated": "2021-05-01T19:46:59Z",
  "author": "david-nield",
  "summary": "But why not go Hi-Res Audio?",
  "article": [
    "It seems as though Apple could be planning to spring a surprise when it launches the AirPods 3: industry sources have claimed that a lossless, high-fidelity audio streaming tier is going to be added to Apple Music at the same time - but crucially, without a price hike.",
    "That's according to Hits Daily Double (via MacRumors) and, while still a rumor, would make sense for Apple to add the option for users. Back in February Spotify HiFi was announced as a lossless, CD-quality tier coming later this year - although a price has yet to be given - and speculation has been mounting over whether Apple might respond.",
    "While Hits Daily Double says Apple Music's new, higher-quality offering will be a new \"tier\", it also mentions it will be at the same $9.99 per month price as the current plan, which makes it sound as though the extra Hi-Fi quality is going to be a free upgrade for users.",
    "Whatever the details of the new package, Apple is playing catch up – although Spotify hasn't launched its lossless, uncompressed audio streaming plan yet, you can sign up for such a plan on services like Deezer, Tidal, Qobuz and Amazon Music Unlimited.",
    "But if Spotify charges a premium for its HiFi tier, like other rivals such as Amazon, have done, that would be a significant advantage for Apple over its immensely-popular rival.",
    "Apple Music streaming quality currently tops out at 256kbps AAC, and while that's very crisp and clear, it's still compressed – if you've got a high-end speaker set or pair of headphones, you'll be able to hear the difference in high-quality audio.",
    "CD-quality audio (16-bit/44.1 kHz) is the equivalent of 1,411 kbps, while studio-quality audio (24-bit/192 kHz) is the equivalent of 9,216 kbps. That studio-quality level is available on Tidal, Qobuz and Amazon, though Deezer and Spotify (in the coming months) stick to CD quality.",
    "Exactly where Apple Music Hi-Fi lands on the quality spectrum – and how much extra it might cost – remains to be seen. With the WWDC 2021 software showcase event coming up at the start of June, it would give Apple the perfect opportunity to announce the update.",
    "If this rumor is to be believed, the third-generation AirPods will break cover at the same time: they're said to be arriving with shorter stems, and could incorporate a variety of new fitness tracking features as well.",
    "Sure, it seems unlikely that a brand would offer something higher quality for free, but Apple does have a history of doing this. The company offered 4K, HDR-quality movies for free if you've already purchased them in HD, and it can clearly afford to invest in the Apple Music service as it's just reported huge revenues once more.",
    "So, being the only provider to bring 'HD' audio for $9.99 per month would be a huge marketing win, and could encourage more people to join the Cupertino brand's service.",
    "It's unlikely that Apple would bring out a 'true' Hi-Res Audio service in the near future, until the iPhone is upgraded to allow it. You'd need a DAC (digital to analogue converter) to play Hi-Res Audio, so it would be a waste right now to offer the upgrade.",
    "So, this makes sense for Apple to do - but whether it will, we'll find out in June this year."
  ],
  "headers": {
    "5": "A treat for the Apple Music users",
    "9": "Why no Hi-Res Audio?"
  },
  "links": {
    "AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Hits Daily Double": "https://hitsdailydouble.com/news&id=326262&title=APPLE-GOING-HI-FI%253F",
    "MacRumors": "https://www.macrumors.com/2021/05/01/apple-music-hifi-tier-new-airpods-coming-weeks/",
    "Back in February": "https://www.techradar.com/news/spotify-hifi-is-here-to-take-on-tidal-with-hi-res-audio-streaming",
    "Spotify HiFi": "https://www.techradar.com/news/spotify-hifi-release-date-price-quality-features-rumors-and-song-catalog",
    "Deezer": "https://www.techradar.com/reviews/deezer",
    "Tidal": "https://www.techradar.com/reviews/tidal",
    "Qobuz": "https://www.techradar.com/news/qobuz-hi-res-audio-streaming-service-lands-in-australia-and-new-zealand",
    "Amazon Music Unlimited": "https://www.techradar.com/deals/how-much-does-amazon-music-unlimited-cost-and-is-the-price-worth-it",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "at the start of June": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "third-generation AirPods": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "DAC": "https://www.techradar.com/news/phone-and-communications/mobile-phones/if-iphone-7-ditches-the-audio-jack-these-three-dacs-will-keep-the-music-spinning-1321629"
  }
}