{
  "source": "https://www.techradar.com/news/vr-meeting-might-one-day-be-cool-thanks-to-facebooks-new-avatars",
  "title": "VR meetings might one day be fun thanks to Facebook's new avatars",
  "category": "gaming",
  "updated": "2021-03-22T12:51:58Z",
  "author": "gerald-lynch",
  "summary": "More expressive avatars on the way",
  "article": [
    "In a socially-distanced world, being able to be close to our friends, family and colleagues is as important as it is difficult. But there might be a compromise to be had with VR meeting places, and it's something that Facebook is looking to capitalise upon with its new-look virtual reality avatars.",
    "Showcasing the Pixar-like creations during a SXSW chat with CNET's Scott Stein, the new Facebook VR avatars will debut on Oculus Quest and Oculus Quest 2 through the Facebook Horizon social VR platform.",
    "Compared to the disembodied hands and torsos of the current Oculus avatars, these new creations are much more expressive. Not only do they finally have arms, but the lip-syncing to a user's speech is far improved, as is the reactivity of facial expressions and eye movements. Touch-controller hand gestures also add to the sense of in-person presence. All in, it seems a far more natural way to interact in VR compared to earlier avatar attempts.",
    "Familiarity is important in VR in terms of grounding the user in the experience, but with the endless possibilities that virtual reality offers, it seems Facebook is often left wrestling with whether or not to allow its users superhuman capabilities.",
    "“There’s a very interesting tension on our teams right now, between taking some of the cues from the real world, and social stuff, or stuff that may be just instinctive for people and building it into the products and experiences we have,” said Rabkin.",
    "\"Exploring on the other side, what should the new norms be? Because the laws of physics, in some ways, are different in virtual worlds. We’re thinking about sound. We’re thinking about interruption. We’re thinking about space. We’re thinking about distance. How close is too close? How far is too far?”",
    "How far Facebook decide to push it will be revealed soon – Facebook Horizons is currently in a closed beta, and while no release date has been set, we're expecting to see the platform opened up to a wider array of Oculus owners in the near future."
  ],
  "headers": {
    "3": "Real vs hyper-real"
  },
  "links": {
    "during a SXSW chat": "https://online.sxsw.com/event/sxsw-online/planning/UGxhbm5pbmdfMzUyOTQ0",
    "Oculus Quest": "https://www.techradar.com/reviews/oculus-quest-review",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}