{
  "source": "https://www.techradar.com/news/should-i-buy-a-compact-camera-in-2021",
  "title": "Should I buy a compact camera in 2021?",
  "category": "cameras",
  "updated": "2021-07-31T08:00:00Z",
  "author": "tim-coleman",
  "summary": "Smartphone cameras are great, so why buy a compact?",
  "article": [
    "Smartphones have evolved so spectacularly that their point-and-shoot brilliance is just one of the many of the icons on our homescreen. So are dedicated compact cameras really still relevant, or worth buying?",
    "They certainly have a fight on their hands. In the space of ten years, phone cameras have turned from after-thoughts into multi-cam, high-resolution, computational wizards that can handling challenging scenarios from low light to popping-portraits.",
    "One-trick-pony, point-and-shoot compacts that offer similar (or worse) picture quality to recent smartphones didn't really stand a chance in the face of such vast investment and progress from our multi-purpose pocket devices.",
    "So how exactly are compact cameras still relevant, even desirable, in 2021? Far from conceding, camera manufacturers have redefined what is expected from our pocket cameras and we are continuing to enjoy the fruit today. Here are all the kinds of increasingly capable compact cameras that are still relevant today – and our thoughts on which ones you should still buy.",
    "With point-and-shoot compacts mostly phased out in 2021, the most cutting-edge compact cameras (outside smartphones) can be categorized into seven main groups; premium, big-sensor, travel-zoom, rugged, action, instant and what we'll call vlogging cameras. Here's a brief run-through of each type.",
    "In 2012, the Sony Cyber-shot RX100 was announced and redefined what a compact camera is. By including a much larger 1-inch image sensor, high-quality fast lens and sturdy metal body, the premium compact was born. Seven iterations on with the Sony RX100 VII (above) facing wide competition, premium compacts are more expensive than ever, but they pack incredible features that can make those life memories look all the better.",
    "One step up from premium compacts (in terms of size) is what we call the big-sensor compact. While it's sometimes a stretch to label them 'compact', these cameras include either an APS-C or full-frame sensor paired with a moderate wide-angle, fixed-focal length and fast aperture lens. Ideal for low light, environmental portraits, street and reportage photography, they include cameras like the Fujifilm X100V (above) and Ricoh GR III.",
    "A travel zoom is based on two main qualities; compact size and a vast optical zoom range. A case in point is the Panasonic TZ200 (above) with its 15x optical zoom range, covering anything from landscapes to close-ups of far away action – it's a slip-in-your pocket camera for traveling and offers better optical zoom than the latest smartphones.",
    "Rugged compacts such as the Olympus TG-6 (above) are designed to withstand the toughest environments, being fully waterproof, shockproof and freezeproof. When your smartphone's just malfunctioned after a brief dunking in a paddling pool, the appeal of rugged cameras is all too clear.",
    "An action camera is a tiny, mountable box-camera with an ultra-wide-angle lens that's primarily designed to capture your adrenaline-filled adventures in 4K. Immortalized by GoPro but with many other brands jumping on the bandwagon, the latest GoPro Hero 9 Black (above) is worth checking out.",
    "Instant cameras synonymous with Polaroid are in an entire category of their own. Downright fun and simple to use, their charm is their appeal, providing immediate mini photo prints to keep or share. Our current favorite entry point is the Fujifilm Instax Mini 11, though there are now genuinely compact alternatives like the Polaroid Go (above).",
    "One final category rides the current surge in demand for vlogging cameras. Although many cameras can vlog, in 2021 we are seeing cameras primarily marketed and designed with the solo vlogger in mind, such as the compact Sony ZV-1 (above).",
    "The laws of physics restricts the physical size of image sensors and lenses in a smartphone. Why is size so important? Well, image quality is hampered by small sensor size and compact cameras provide more physical depth to play with, making larger sensors possible.",
    "At their best and often with jaw-dropping efficiency, smartphones rely on 'computational' photography as a workaround of small-sensor limitations – for example, 'portrait mode' can blur the background for popping-portraits. However, computational photography is never 100% reliable.",
    "Portrait mode works by applying a uniform blur to your subject's surroundings with no true depth, and even in 2021 remains susceptible to digital artifacts. Those with a keen eye notice these imperfections. Conversely, a large sensor, fast-aperture compact creates genuine depth of field blur.",
    "Another limitation to sensor size is dynamic range, because a smaller sensor captures less highlight and shadow detail in a single picture. Again, smartphones use computational photography via a multi-frame capture called HDR to increase dynamic range. Such an approach is fine when your scene is static, but if there is fast movement going on, then you'll get unwanted ghosting.",
    "Phone 'night modes' pose the same headache regarding movement, because they use long-exposure and stabilization to get bright, sharp shots. Ultimately, computational photography is tackling smartphone sensor size and is certainly closing the image quality gap, but real-world limits remain.",
    "Smartphone multi-cam units offer different focal lengths and optical zooms are creeping into high-end smartphones in 2021 such as the Samsung Galaxy S21 Ultra. However, smartphone lens technology is still no match to compact cameras like travel-zooms that offer a much greater reach.",
    "Other handling benefits with dedicated cameras include those with the option of a viewfinder, which is especially helpful for clear viewing in bright light. Those with tilting screens also make shooting at awkward angles a breeze, while superior weather-proofing and build quality (especially in the case of rugged compacts) are also great reasons to have a dedicated camera. Lastly, autofocus performance is an entirely different proposition on compacts.",
    "Creating more cutting-edge compact cameras comes at a literal cost. If you are going to buy a good one, it'll set you back the same amount as a decent smartphone, which is obviously way more than just a camera. Cost aside, there is more to the smartphone camera case.",
    "Convenience is up there as the single biggest reason in favor of smartphones over compact cameras. As the cliché goes, the best camera is the one that you have with you – and who doesn't walk around with their smartphone? There's still a degree of intentionality required in keeping a dedicated compact camera to hand, even if it easily slips into your pocket.",
    "One underrated benefit of the smartphone's ubiquity is also its ability to give you a degree of inconspicuousness, which ideal for something like documentary and street photography, or relaxed family portraits.",
    "Convenience stretches to more than just availability, too. The whole process of using a smartphone camera is about as easy as it gets. As we said earlier, computational photography gets you the best possible quality image at the click of a button; auto HDR, portrait mode, night mode shots. These kind of effects can take a lot more effort to apply to compact camera shots. When the scenario is right, you can't beat the image processing of a smartphone.",
    "Then there is sharing pictures. No Bluetooth and Wi-Fi connections to fiddle with, smartphone pictures are in your smartphone immediately for further editing, instant sharing and hassle-free cloud storage.",
    "There are also strides towards 'pro' camera features in smartphones; manual exposure control, histogram display and shooting in raw format. But the reality in 2021 remains that auto computational photography does, in most cases, a better job of squeezing the best quality from the sensor than manually tweaking a raw file.",
    "Let's now take a closer look at our favorite compact cameras in 2021 and why you would use them instead of your smartphone.",
    "A premium pocket camera with pro features, the Sony Cyber-shot RX100 VII (above) outmuscles any smartphone especially for capturing action pictures and videos. This is thanks to its autofocus, image stabilization prowess, and high-speed shooting modes, all in a camera with a much larger sensor than a smartphone and decent optical zoom range.",
    "The retro-chic Fujfilm X100V street-shooter (above) boasts excellent image quality thanks to its large APS-C image sensor – this combines nicely with its sharp, edge-to-edge 35mm f/2 aperture lens to make it especially at home when shooting in low light. It's packed with dedicated exposure control dials that are sure to please photo enthusiasts, too.",
    "Smartphones struggle to get you close to subjects in the same way as a travel-zoom like the Panasonic TZ200 (above). Its 15x optical zoom has a 24-360mm range, whereas a smartphone typically starts at 28mm and, at longer focal lengths, usually only offers a digital zoom that dramatically decreases image quality the further you zoom in.",
    "Rugged and action cameras usually have a similar-size image sensor to smartphones and comparable image quality, but they are designed to be taken into scenarios that you simply wouldn't want to risk your phone in. Strapped to a helmet for hitting the slopes, underwater action, the GoPro Hero 9 Black (above) and Olympus TG-6 are the ones for your extreme adventures.",
    "It might be easy to share your smartphone images on social, but can you print photo keepsakes on-the-fly? Our favorite easy-to-use instant camera, the Fujifilm Instax Mini 11, uses one of the most affordable film stocks that produces prints with gorgeous colors.",
    "Smartphones are the most convenient tools for vlogging, but the Sony ZV-1 takes the quality up a notch thanks to its larger 1-inch sensor and fast lens, which combine to create some lovely shallow depth of field. Its blazing autofocus offers an AF mode that's ideal for product influencers, while there's also a flip-out LCD screen, hotshoe for accessories and 3.5mm mic port.",
    "If you're looking to take pictures that go beyond the scope of your smartphone, there are a few ways to do it – and compact cameras remain one of those options. But as we've discussed, it's important to pick the right model, as it's now no longer the case that dedicated cameras always carry a hardware edge or image-taking edge over phones.",
    "Each compact camera mentioned in this article offers specific tools for specific scenarios – for example, a large APS-C sensor for taking your image quality or creative control up a level, or rugged models for those times when you don't want to risk a precious slab of glass with your entire life on it.",
    "While the image quality gap is closing in general, computational photography is not 100% reliable, and there are ways in which compact cameras make better quality pictures for specific scenarios; lens reach, larger image sensors, better autofocus performance.",
    "Of course, image quality is only one consideration when it comes to choosing a camera. The fact that a phone is most likely to be the camera in your pocket, and is a multi-purpose device that keeps those around you at ease in a way a dedicated camera do not, may just provide photo opportunities that you would otherwise not get.",
    "A smartphone is also the most convenient picture-taking and sharing tool. If the scenario is fitting to a smartphone camera's strengths – for example, wide-angle, bright light, or simple compositions – then you're unlikely pine for more. Take time to learn how to use a smartphone for photography, though, and you may just elevate your pictures to the point where you start to want a dedicated camera."
  ],
  "headers": {
    "12": "In what ways are compact cameras still better than smartphones?",
    "19": "What are the downsides of compact cameras?",
    "25": "What are the best compact cameras you can buy in 2021?",
    "32": "Compact cameras vs smartphones: which is the best for me?"
  },
  "links": {
    "Sony RX100 VII": "https://www.techradar.com/reviews/sony-cyber-shot-rx100-vii",
    "Fujifilm X100V": "https://www.techradar.com/reviews/fujifilm-x100v",
    "Ricoh GR III": "https://www.techradar.com/reviews/ricoh-gr-iii-review",
    "Panasonic TZ200": "https://www.techradar.com/reviews/panasonic-lumix-zs200-tz200",
    "Olympus TG-6": "https://www.techradar.com/reviews/olympus-tough-tg-6",
    "GoPro Hero 9 Black": "https://www.techradar.com/reviews/gopro-hero-9-black",
    "Fujifilm Instax Mini 11": "https://www.techradar.com/reviews/fujifilm-instax-mini-11",
    "Polaroid Go": "https://www.techradar.com/reviews/polaroid-go",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review"
  }
}