{
  "source": "https://www.techradar.com/news/grand-theft-auto-san-andreas-is-in-development-for-oculus-quest",
  "title": "Grand Theft Auto San Andreas is in development for Oculus Quest 2",
  "category": "vr",
  "updated": "2021-10-28T18:41:00Z",
  "author": "nick-pino",
  "summary": "'I'm excited for gamers to experience this iconic open world in virtual reality'",
  "article": [
    "Facebook CEO Mark Zuckerberg announced that the classic Rockstar Games title Grand Theft Auto: San Andreas is coming to Quest 2.",
    "The project has been in development for some time, however it was only just announced at Facebook's Oculus Connect event held on October 28.",
    "\"I'm excited for gamers to experience this iconic open world in virtual reality,\" Zuckerberg said during the presentation.",
    "Unfortunately there's no release date yet, but one may potentially be given during the upcoming Oculus Games Showcase happening later next year.",
    "While you'd think that a Grand Theft Auto VR game would be the biggest announcement to come out of an Oculus event, there were a number of substantially bigger stories including a first look at a new souped-up VR headset and the announcement that Facebook will change its name to Meta.",
    "Admittedly, the news of the iconic Rockstar game coming to VR would've been more exciting had, you know, Facebook showed any of it.",
    "Instead, Facebook... er, Meta CEO Mark Zuckerberg says we'll have to wait until the Oculus Games Showcase being held next year to learn more."
  ],
  "headers": {
    "4": "Analysis: Somehow this was only the second biggest story of Oculus' Connect event"
  },
  "links": {
    "Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Connect": "https://www.techradar.com/how-to/how-to-watch-facebook-connect-and-what-we-want-to-see-at-the-oculus-event",
    "souped-up VR headset": "https://www.techradar.com/news/new-oculus-vr-headset-officially-teased-at-facebook-connect-2021",
    "Facebook will change its name to Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta"
  }
}