{
  "source": "https://www.techradar.com/news/what-itll-take-to-get-me-to-dump-my-windows-pc-for-a-new-imac",
  "title": "What it'll take to get me to dump my Windows PC for a new iMac",
  "category": "computing",
  "updated": "2021-04-24T14:30:00Z",
  "author": "john-loeffler",
  "summary": "I have demands, Apple",
  "article": [
    "Apple made big news this week with the announcement of new iMacs powered by the Apple M1 chip, and I'm once again looking on with a certain amount of envy as the dedicated Mac users I know are looking forward to some shiny new tech that is genuinely impressive as well as eye-catching – no matter what our Richard Devine thinks.",
    "I've been a PC user since the halcyon days of the notorious Packard Bell Legend 300CD running Windows 3.1, and with the exception of a couple of MacBook Pro and MacBook Air devices that I never used and ended up giving to family members who needed a straight-forward, easy-to-use device, it's been Windows all the way down.",
    "Which is a shame. Apple computers – especially their latest M1-powered devices – are genuinely excellent machines that have a lot going for them, especially for someone who is increasingly being drawn into the Apple ecosystem after adding an iPhone, Apple Watch, and iPad Pro to my daily tech suite.",
    "A Mac computer, either a MacBook Pro or iMac Pro, feels like the inevitable next step for me, but it's always been a bridge too far. But that feels like its changing with the latest generation of Mac products, and the idea of going all-in with Apple is more and more of a possibility. So what would it take for me to finally submit to the sirens' song of the Mac?",
    "As someone who's used some version of a Microsoft operating system since I first sat down at a keyboard with an old MS-DOS machine, I have almost never run across software that I could not run on my computer – hardware limitations being the rare exception.",
    "In my most formative computing years, software developers simply didn't write much software for a Mac computer because of very esoteric but very important differences in the way Macs and PCs handled their file systems and machine level commands. To have your software run on both machines, a developer effectively had to code it twice, and since 95% of the PC market was using Windows, why bother with Apple at all?",
    "Thanks to a number of innovations in software development over the years, these differences mean very little to a developer now, if it's even an issue at all. What's more, so many apps are being run through cloud computing now that the distinction between operating systems is becoming meaningless.",
    "This means that there's very little software out there that a Mac can't run at this point. Even high performance gaming is becoming possible thanks to services like GeForce Now and there are many apps that are exclusive to Apple products as well.",
    "Apple also has the advantage of having much tighter control over the hardware configurations of their machines, giving an Apple system a level of stability that a Windows user can only dream of as they stare helplessly at a Blue Screen of Death for the hundredth time.",
    "I've heard things about a butterfly keyboard or something not working and everyone being up at arms about it. This is such a familiar experience for PC owners that we don't even complain about hardware failures. What's the point?",
    "What's more, there's no denying that Apple has an eye for design that has no equal in the PC world. The Dell XPS 13 is gorgeous, but it is an exception. Most high-end desktop PC systems are usually gaming rigs that light up like a carnival whenever you turn it on, and high-end laptops like the Gigabyte Aero 17 still have that RGB gaming pedigree that they just can't shake.",
    "Even the Razer Book 13, which comes closer to the MacBook Pro than just about any laptop I've tested, is still essentially copying the Apple MacBook Pro design wholesale. That pretty much tells you all you need to know about who is setting the trends here.",
    "Now, with the new iMac design bringing color back to their desktop AIO PCs – including purple! – Apple is redefining what PC design is going to be judged against in the years ahead.",
    "Complaints about Apple's \"walled-garden\" design philosophy are largely overblown, but they aren't baseless. What makes Apple such an appealing device for a mass audience is also what makes it feel so restrictive for those of us who are regularly working with software or programs downloaded from Github or other sites.",
    "Yes, these are major vectors for malware, so restricting the kinds of apps that can run on a Mac to those found in the App Store definitely helps keep people like my Mom from getting their computers exposed to malicious code that can cause all kinds of havoc.",
    "And yes, there is an option in the settings menu that lets you bypass this security measure so you can install whatever you want and run it on a Mac, but it's a cumbersome solution to the problem that I highly doubt will change.",
    "A similar issue is with the hardware itself. Apple controls what hardware goes into their products and locks users out of swapping in better components as time goes on. While this greatly improves system stability, you'll also never see an RTX 3080 in an iMac, which limits just how far an iMac can go in terms of performance.",
    "Introducing a new kind of iMac that gives those of us who like to dig around in the guts of the machine more freedom to do so would be an absolute game changer. This would obviously necessitate some changes to macOS to allow developers to code new drivers to get everything to work with the operating system, and since this both surrenders some control over the Apple user experience to others while also introducing potential instability into the system from badly-coded drivers, I find it highly unlikely that Apple will ever do such a think.",
    "What's more, just because Apple can run just about any software out there now doesn't necessarily mean that it can run any of it as well as a Windows PC, especially since I can always install more powerful hardware in the latter, but not the former. Unless the new Apple M1X chip shocks the world and turns out to be an absolute beast of an SoC, it's not going to match the combination of an AMD Ryzen 5000-series processor paired with an Nvidia Ampere graphics card and later iterations of Apple Silicon will likely lag behind the current gen CPUs and GPUs from Teams Red, Green, and Blue.",
    "Still, I can hope. Until then, I'll rely on my Windows 10 PC for most of my work, if I end up touching a Mac at all – unless Apple wants to try and change my mind by sending me a new iMac, of course. In that case, I'll take it in purple, please."
  ],
  "headers": {
    "4": "Why Apple computers are more appealing than ever",
    "13": "What Apple would need to do to finally get me on board with a new iMac"
  },
  "links": {
    "Apple M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "Richard Devine": "https://www.techradar.com/news/the-new-imac-isnt-pretty-its-just-badly-designed",
    "MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "MacBook Air": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iMac Pro": "https://www.techradar.com/reviews/imac-pro",
    "Dell XPS 13": "https://www.techradar.com/reviews/dell-xps-13-late-2020-review",
    "Gigabyte Aero 17": "https://www.techradar.com/reviews/gigabyte-aero-17-2021-review",
    "Razer Book 13": "https://www.techradar.com/reviews/razer-book-13-2020",
    "Apple M1X chip": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date"
  }
}