{
  "source": "https://www.techradar.com/news/lenovo-has-five-new-android-tablets-including-a-huge-ipad-pro-rival",
  "title": "Lenovo has five new Android tablets including a huge iPad Pro rival",
  "category": "tablets",
  "updated": "2021-06-28T09:51:24.744Z",
  "author": "tom-bedford",
  "summary": "Going hard for MWC 2021",
  "article": [
    "In usual years, annual tech event MWC 2021 would be huge for mobile, tablet and smartwatch announcements. This year, though, a four-month delay, and most big tech companies pulling out, has made the event a much smaller affair - but apparently Lenovo didn't get the memo, because it's just announced a surprisingly big suite of new tablets.",
    "This quintet of new Android devices covers a range of prices from bottom-end to premium, and the most important is the Lenovo Yoga Tab 13. With a 13-inch screen, this is one of the only tablets that offers you a display as big as the iPad Pro 12.9, which might make it useful to lots of people.",
    "We'll run you through all the new Lenovo tablet specs below, so you can see how they compare - it's worth pointing out that Lenovo hasn't provided complete information about all the slates, so there will be a good few empty boxes, but hopefully we'll find out this information before too long.",
    "While the specs have lots of gaps right now, we can see how they all compare.",
    "Firstly, the Tab M devices seem like portable entertainment devices in the same vein as Amazon Fire tablets, except with Android 'proper' instead of Amazon's restrictive fork.",
    "Then the Yoga devices are more powerful, with specs that should see them better for creativity, productivity and business purposes. They've also got built-in stands with hooks so you can display or prop them up in a variety of poses.",
    "So how does the Lenovo Tab P11 Plus fit in? Well it basically seems like a version of the Yoga Tab 11 but without the stand, and therefore with a more 'standard' tablet design.",
    "Lenovo only provided us with pricing in euros, so take the converted price information above with a pinch of salt - we could see the slates release for a different amount when they're launched.",
    "While it looks like you can pick up most of Lenovo's new Android tablets soon, the Tab M8 is the wildcard, as we don't know much about it. Its price likely won't be too much more than the M7's though.",
    "The Yoga Tab 13's iPad Pro comparisons continue with its high price, but the other slates look much more affordable, so if you're in the market for a new Android slate they could be good choices."
  ],
  "headers": {
    "3": "What are the Lenovo tablets like?",
    "7": "Lenovo tablet pricing and availability"
  },
  "links": {
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "quintet of new Android devices": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3252293397684733400&xs=1&url=https%3A%2F%2Fnews.lenovo.com%2Fpressroom%2Fpress-releases%2Fsleek-tablets-smart-clock-streamline-your-connected-home-mwc%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Flenovo-has-five-new-android-tablets-including-a-huge-ipad-pro-rival",
    "iPad Pro 12.9": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Amazon Fire tablets": "https://www.techradar.com/news/amazon-fire-tablet-vs-amazon-kindle"
  }
}