{
  "source": "https://www.techradar.com/news/netflix-is-making-a-tomb-raider-animated-tv-show",
  "title": "Netflix is making a Tomb Raider TV show – and fans of the game should be excited",
  "category": "entertainment",
  "updated": "2021-01-27T16:47:09Z",
  "author": "samuel-roberts",
  "summary": "Set after the last three games",
  "article": [
    "Netflix has teamed up with the movie studio Legendary to make a new Tomb Raider animated series, it's been announced. The show will fit in to the continuity established the most recent trilogy of Lara Croft games: 2013's Tomb Raider, Rise of the Tomb Raider and Shadow of the Tomb Raider.",
    "The series will continue the story of those games – and have no association with the most recent live-action Tomb Raider movie that starred Alicia Vikander. Screenwriter Tasha Huo, who's working on the upcoming The Witcher: Blood Origin spin-off, is the series' writer and executive producer.",
    "Netflix made a big splash with its surprisingly great adaptation of the Castlevania games, which has now released three seasons on the streaming service. An animated show based on Capcom's Devil May Cry is also in the works.",
    "Netflix is also making a live-action TV show based on the Assassin's Creed games. Clearly, the streamer sees the potential in adaptations of video games, despite the famously troubled history of such projects.",
    "Clearly, Netflix isn't making a whole bunch of game adaptations by accident, and the quality of Castlevania suggests it's setting a high bar for the way these properties are brought to audiences.",
    "A key thing that's likely to help these projects is that the people making them are more likely to have grown up playing the games they're actually adapting. This clearly wasn't the case with game adaptations from the '90s or '00s, which rarely captured the essence of the licenses they were based on, and fell flat as a result.",
    "Do games actually make for good TV shows or movies? That's a larger question. The most recent Tomb Raider and Assassin's Creed films didn't exactly blow people away. But in a world with so many high-quality superhero movies, often adapted from relatively simple source material, the batting average of these adaptations should be a lot higher than it is now."
  ],
  "headers": {
    "4": "Game adaptations will probably get better"
  },
  "links": {
    "Rise of the Tomb Raider": "https://www.techradar.com/news/gaming/rise-of-the-tomb-raider-is-best-played-on-xbox-one-1304963",
    "Shadow of the Tomb Raider": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot",
    "The Witcher: Blood Origin": "https://www.techradar.com/news/the-witcher-blood-origin-on-netflix-release-date-story-setting-and-what-to-expect",
    "live-action TV show based on the Assassin's Creed games": "https://www.techradar.com/news/netflix-is-making-an-assassins-creed-tv-show-will-it-be-better-than-the-movie"
  }
}