{
  "source": "https://www.techradar.com/news/microsoft-is-ending-support-for-windows-thin-pc",
  "title": "Microsoft is ending support for another iconic Windows offering",
  "category": "computing",
  "updated": "2021-09-02T12:38:28Z",
  "author": "mayank-sharma",
  "summary": "There are lots of better options than Windows Thin PC now, suggests Microsoft",
  "article": [
    "Microsoft is finally retiring its Windows Thin PC product on October 12, 2021, after almost a decade in service.",
    "Launched in 2011, Microsoft introduced Windows Thin PC to help customers repurpose their existing, but under-powered PCs as thin clients, giving users a cost-effective alternative to virtual desktop infrastructure (VDI).",
    "While Windows Thin PC was well-received on launch, over time however, it faded from the limelight, with the availability of more useful, and feature-rich alternatives, along with the evaporating cost-disadvantages of VDI.",
    "“For organizations still maintaining Windows Thin PC, Microsoft recommends that you consider moving to a newer remote desktop client,” suggested Microsoft in the brief reminder.",
    "Windows Thin PC is a stripped down version of Windows 7 for Windows XP-running PCs that lacked the resources to support the full version of Windows 7.",
    "The product was aimed primarily at business users to help companies experience the best of Windows 7, while saving on the hardware upgrade costs on their existing computers.",
    "Despite being named Thin, Windows Thin PC didn’t run on thin client devices. However the product did offer a wonderful thin client experience thanks to use of features such as RemoteFX to enable remote desktop clients to use the graphics hardware on the remote server.",
    "Of course, computing has moved quite a lot in the last decade and with the availability of feature-rich remote desktop platforms, it was only a matter of time before Windows Thin Client joined Windows 7, which itself reached end of life in 2020."
  ],
  "headers": {
    "4": "Thin isn’t in"
  },
  "links": {
    "Windows": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "thin clients": "https://www.techradar.com/best/best-thin-client",
    "VDI": "https://www.techradar.com/news/why-vdi-is-even-more-important-for-hybrid-working",
    "remote desktop": "https://www.techradar.com/news/best-remote-desktop-software",
    "brief reminder": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7477987474970076000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fwindows-embedded%2Fwindows-thin-pc-ending-support-on-october-12-2021%2Fba-p%2F2708588&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-ending-support-for-windows-thin-pc",
    "end of life in 2020": "https://www.techradar.com/news/windows-7-end-of-life-everything-you-need-to-know-about-the-death-of-windows-7"
  }
}