{
  "source": "https://www.techradar.com/news/iphone-13-leak-suggests-apples-developing-face-id-that-works-with-masks",
  "title": "iPhone 13 leak suggests Apple's developing Face ID that works with masks",
  "category": "phones",
  "updated": "2021-08-25T23:36:51Z",
  "author": "david-lumb",
  "summary": "New iPhone cameras could recognize faces even with masks",
  "article": [
    "A new iPhone 13 leak shows a potential new front-facing camera setup that could let the phone use Face ID facial authentication even while users wear masks.",
    "While the leak speaks of a new camera setup that could end up in the next range of iPhones, it contains an image (technically a rendered version of an image the leaker isn’t making public) of a prototype case with the cameras aligned at the top that clips around an iPhone 12. The info and image were shared by leaker Jon Prosser via a tweet and Front Page Tech:",
    "According to the post, the camera array has the same measurements as those in an iPhone 13 CAD render that Prosser showed in a video back in June. To wit: the prototype case has its camera on the far left with the varying front-facing sensors to the right of it (the iPhone 12 line has its front-facing camera on the second to the right), which matches what Font Page Tech had seen of the iPhone 13’s layout.",
    "The leak goes on to claim that Apple employees are testing the new camera layout while wearing masks and/or glasses, with varying styles of each.",
    "The rendered image was modeled by Prosser's regular collaborator RendersByIan, who saw videos and photos of an alleged 75 Apple prototypes and made the resulting image to be representative of the test models. It’s possible that no prototype exactly matches what’s seen in the render, but it does give us an idea of Apple’s testing process and what could end up in the iPhone 13 cameras.",
    "As always, be skeptical of leaks, but also understand what they are: predictions based on evidence that may not make it into final models of the iPhone 13 or the iPhones to come after.",
    "There are rumors that the premium iPhone 13 Pro handsets will have improved photo capabilities through advanced LiDAR and machine learning, as well as better video, which aren’t as exciting as new hardware or design. But given all the other rumors suggesting the phone range will have more incremental than monumental upgrades, we’d guess these to be more likely.",
    "Less likely is any new functionality that would require new hardware, like under-display Touch ID or USB-C instead of Lightning ports. Rumors get downright improbable when they delve into patent filings, like this one mentioning a rotating display that would hide the notch when front-facing cameras aren’t in use. We’re sure Apple is looking into some of these things – but whether they end up in your iPhone 13 or any later iPhone is unlikely. It’s much easier for Apple to give us one or two new features and iterate on everything else."
  ],
  "headers": {
    "5": "Analysis: lots of leaked features tested, few included"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "tweet": "https://twitter.com/jon_prosser/status/1430548772308754432",
    "Front Page Tech": "https://www.frontpagetech.com/2021/08/25/exclusive-apple-testing-new-face-id-hardware-that-works-with-masks-foggy-glasses/",
    "video": "https://www.techradar.com/news/iphone-13-leak-says-video-upgrades-are-coming-and-its-just-what-we-need-in-2021",
    "advanced LiDAR": "https://www.techradar.com/news/why-the-iphone-13-pros-lidar-scanner-could-be-its-secret-photographic-weapon",
    "Touch ID": "https://www.techradar.com/news/apple-tested-under-display-touch-id-for-iphone-13-but-dont-expect-it-to-happen",
    "ports": "https://www.techradar.com/news/your-next-iphone-may-finally-ditch-lightning-for-usb-c-because-of-this-new-law",
    "this one": "https://www.techradar.com/news/your-iphone-may-one-day-have-a-disappearing-notch"
  }
}