{
  "source": "https://www.techradar.com/news/after-squid-game-netflix-is-changing-how-it-measures-a-shows-popularity",
  "title": "Squid Game shakes up how Netflix measures success for its TV shows",
  "category": "entertainment",
  "updated": "2021-10-20T09:39:10Z",
  "author": "axel-metz",
  "summary": "Squid Game literally changed the game",
  "article": [
    "Just a week after Squid Game became the most popular Netflix show of all time, the streamer is preparing to change the way it measures viewership of its movies and TV shows.",
    "In its latest earnings report, Netflix outlined plans to shift away from the two-minute-per-view metric used in recent years to instead record the total hours watched within a given title’s first 28 days of release.",
    "“We think engagement as measured by hours viewed is a slightly better indicator of the overall success of our titles and member satisfaction,” Netflix bosses said in a letter to shareholders. “It also matches how outside services measure TV viewing and gives proper credit to rewatching.”",
    "The streamer also plans to change the way it publicly reveals viewing data “so [its] members and the industry can better measure success in the streaming world.”",
    "In reality, that looks likely to mean total-hours-viewed figures for movies and TV shows will be made public by Netflix “more regularly” than the rather sporadic viewership announcements currently issued by the company.",
    "The switch will mark the third time Netflix has changed the way it records the popularity of its content. Before implementing the two-minute standard in 2019, the streamer used to measure single views based on whether a member had completed 70% of a movie or TV show.",
    "As expected, Netflix was reportedly loud and proud about the success of its latest hit, Squid Game, in its most recent earnings report, confirming that the South Korean drama has indeed now surpassed Bridgerton as the streamer’s most successful show.",
    "Netflix says the series clocked up 142 million views in the first 28 days of release, a period which also saw 4.4 million new subscribers added to the service – making Squid Game worth a mind-boggling $900 million.",
    "Even more impressive, Netflix reported a figure of 213.56 million global subscribers in its earnings report, meaning Squid Game has been watched by a whopping two-thirds of its total paying households.",
    "Prior to the show’s release, Bridgerton held the title of Netflix’s most successful TV series, raking in 82 million views in the first 28 days of release. Both the debut seasons of Lupin and The Witcher currently sit in joint third place, with 76 million views each.",
    "As for total hours viewed, though, Squid Game’s numbers are even more frightening in comparison to other shows on the streamer.",
    "Netflix previously confirmed that its once-most-popular-series, Bridgerton, generated 625 million hours of global consumption in the first 28 days of release, and while it hasn’t yet disclosed an equivalent number for Squid Game, Bloomberg estimates that figure to be in the region of – wait for it – 1.4 billion hours.",
    "Squid game season 2, anyone?",
    "Via THR"
  ],
  "headers": {
    "6": "So, what are the most popular Netflix shows?"
  },
  "links": {
    "Squid Game": "https://www.techradar.com/news/squid-game-ending-explained-what-happens-next",
    "sporadic viewership announcements": "https://www.techradar.com/news/squid-game-is-on-track-to-dethrone-bridgerton-as-the-biggest-show-on-netflix",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-10-17/squid-game-season-2-series-worth-900-million-to-netflix-so-far",
    "Squid game season 2": "https://www.techradar.com/news/squid-game-season-2",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/netflix-change-public-viewer-reporting-1235033741/"
  }
}