{
  "source": "https://www.techradar.com/news/tiktok-sale-to-oracle-shelved-by-biden-administration",
  "title": "TikTok sale to Oracle shelved by Biden administration",
  "category": "phones",
  "updated": "2021-02-10T21:33:59Z",
  "author": "anthony-spadafora",
  "summary": "TikTok sale has reportedly been pushed back indefinitely",
  "article": [
    "TikTok's parent company ByteDance may no longer be required to sell of its US assets to Oracle as the plan to require the social media network to divest its US operations has been pushed back indefinitely by President Biden.",
    "The move comes as President Biden's administration is now in the process of reviewing the Trump administration's efforts to address the security risks posed to the United States by Chinese tech companies.",
    "Back in August of last year, former President Trump made the decision to ban TikTok due to the way in which the personal data of US users could be obtained by the Chinese government. However, the US wasn't the first country to ban the app as India banned TikTok back in June of 2020 citing similar security concerns surrounding the data and privacy of Indian users.",
    "While the TikTok ban was never enforced in the US, ByteDance is still in a legal battle with the US government though many federal courts have tried to stop the US commerce department from shutting down TikTok's operations in the US.",
    "According to a new report from the Wall Street Journal, ByteDance representatives and US national security officials have remained in talks regarding a potential sale of TikTok's US operations even while the Trump administration shifted its focus from security to the 2020 US election.",
    "Spokesperson for the National Security Council, Emily Horne explained in a statement to the Wall Street Journal that the US is still reviewing the risks posed to its citizen's data by foreign apps, saying;",
    "“We plan to develop a comprehensive approach to securing U.S. data that addresses the full range of threats we face. This includes the risk posed by Chinese apps and other software that operate in the U.S. In the coming months, we expect to review specific cases in light of a comprehensive understanding of the risks we face.”",
    "At a recent press conference, White House press secretary Jen Psaki reaffirmed Horne's statement when she told reporters that the Biden administration is in the process of reviewing all potential threats to US data. However, she did not provide further details regarding a potential TikTok sale.",
    "For now it seems that TikTok will be able to continue operating in the US but the social network could face further scrutiny if it is discovered that the app does pose a risk to the data of its users.",
    "Via The Guardian"
  ],
  "headers": {
    "4": "Securing US data"
  },
  "links": {
    "ByteDance": "https://www.techradar.com/news/tiktok-launches-range-of-new-e-commerce-tools",
    "ban TikTok": "https://www.techradar.com/news/us-tiktok-ban-threat-caused-massive-surge-in-vpn-search",
    "India banned TikTok": "https://www.techradar.com/news/indian-government-bans-tiktok-and-58-other-chinese-apps",
    "new report": "https://www.wsj.com/articles/tiktok-sale-to-oracle-walmart-is-shelved-as-biden-reviews-security-11612958401",
    "2020 US election": "https://www.techradar.com/news/us-election-2020-malware-scam-targets-undecided-voters",
    "TikTok": "https://www.techradar.com/how-to/how-to-change-your-tiktok-password",
    "The Guardian": "https://www.theguardian.com/technology/2021/feb/10/tiktok-sale-to-oracle-and-walmart-shelved-as-biden-reviews-security-say-reports?CMP=fb_a-technology_b-gdntech"
  }
}