{
  "source": "https://www.techradar.com/news/biden-administration-hid-a-secret-call-for-coders-where-no-one-else-would-find-it",
  "title": "Biden administration hid a secret call for coders where no one else would find it",
  "category": "computing",
  "updated": "2021-01-21T13:27:45Z",
  "author": "joel-khalili",
  "summary": "Expert programmers, the US Digital Service needs you",
  "article": [
    "On his first day as President of the United States, Joe Biden acted swiftly to neutralize a number of the policies enacted by his predecessor, signing 17 executive actions in all.",
    "Although most are of a political flavor, the move to reinvigorate the presidency has also extended to the digital realm, as demonstrated by a secret message concealed in the HTML code of the White House website.",
    "For those technology-savvy enough to find it, hidden in the updated website is a call for programmers to join the US Digital Service (USDS): “If you’re reading this, we need your help building back better.”",
    "Introduced under the Obama administration in 2014, the US Digital Service is a federal agency that provides consultation services for technology projects undertaken by the government.",
    "Technologists are brought in to work for the agency for between six and twenty-four months, with a maximum “tour-of-service” of four years.",
    "The call for fresh talent hidden under the hood of the White House website was also echoed by the USDS on Twitter.",
    "“We are a startup at the White House working to deliver better government services to the America people through technology and design,” tweeted the agency. “The best technology. The best government. And we want you.”",
    "The website application page itself offers sparse information about the precise expertise the agency is looking for and the specific projects new recruits may be working on.",
    "“The roles and responsibilities of any given USDS staff member vary tremendously, because agencies have different technological needs. Even projects within the same agency require distinct skill sets,” explains an FAQ listing.",
    "“Because of the unpredictability and breadth of our engagements, we focus on hiring technical experts who can adapt to a project’s needs, though we also hire specialists for particular projects.”",
    "Via Reuters"
  ],
  "headers": {
    "3": "US Digital Service"
  },
  "links": {
    "tweeted the agency": "https://twitter.com/USDS/status/1351952632257064961?s=20",
    "Reuters": "https://www.reuters.com/article/us-usa-biden-digital-service/in-hidden-message-on-white-house-website-biden-calls-for-coders-idUKKBN29P2IZ"
  }
}