{
  "source": "https://www.techradar.com/news/hoping-for-new-macbooks-at-wwdc-2021-perhaps-prepare-for-disappointment",
  "title": "Hoping for new MacBooks at WWDC 2021? Perhaps prepare for disappointment",
  "category": "computing",
  "updated": "2021-06-07T14:51:02Z",
  "author": "darren-allan",
  "summary": "Apple MacBooks may not launch at WWDC after all",
  "article": [
    "Apple won’t be showing off any new MacBooks imminently at WWDC 2021, going by a fresh rumor that could foretell a disappointing blow for many hopefuls.",
    "Note that this very much runs against the grain of the rumor mill of late, which has been pretty much awash with speculation about a MacBook launch of some kind being about to happen. But that is, of course, the thing about rumors – you can’t rely on them.",
    "And equally that’s true with this latest nugget delivered by well-known leaker l0vetodream, who on Twitter (as spotted by MacRumors) declared that the purported new MacBook Pro 14-inch and MacBook Pro 16-inch models may not be revealed any time soon (so obviously meaning not at WWDC).",
    "Now, first of all, the (translated) tweet doesn’t sound certain on this, so this does not feel like the firmest ground for ruling out a MacBook launch anyway. As mentioned, there have been plenty of rumors insisting that some kind of Apple laptop refreshing will happen later today, with speculation built mainly around one or two new MacBook Pro models.",
    "Those rumors include a Morgan Stanley analyst (predicting that we might even see a new M2 chip inside the machines), an analyst from Wedbush, and Jon Prosser (another authoritative Apple leaker) among others.",
    "Given all that, it would arguably be somewhat surprising if Apple didn’t reveal a MacBook at WWDC – but certainly nothing is guaranteed either way, and we’ll learn the truth soon enough.",
    "Perhaps a middle-ground could be some kind of teaser from Apple, as opposed to a full reveal of any kind. Interestingly, the most recent rumor we reported on – from the Morgan Stanley analyst, Katy Huberty – observed that there could be an unveiling at WWDC, but the hardware itself might not launch until much later in 2021.",
    "That ties up with other recent chatter on the grapevine of the great component shortage possibly affecting MacBook production, not to mention talk of potential delays to 2022 for Mini LED-toting MacBooks (which these new models will purportedly be).",
    "Anyhow, as we said – not long to wait now, and fingers crossed we get more than just a brief glimpse or teaser of any revamped MacBooks at WWDC."
  ],
  "headers": {
    "6": "Teaser time?"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "Twitter": "https://twitter.com/L0vetodream/status/1401877134201655300",
    "MacRumors": "https://www.macrumors.com/2021/06/07/no-hardware-at-wwdc-suggests-leaker/",
    "MacBook Pro 14-inch": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "MacBook Pro 16-inch": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "predicting that we might even see a new M2 chip": "https://www.techradar.com/news/new-macbook-pro-could-appear-at-wwdc-2021-sporting-m2-chip",
    "analyst from Wedbush": "https://www.techradar.com/news/yet-another-rumor-suggests-new-m1-macbooks-are-coming-at-wwdc-2021",
    "Jon Prosser": "https://www.techradar.com/news/is-apple-set-to-reveal-new-macbook-pro-at-wwdc-2021",
    "observed that": "https://www.techradar.com/news/new-macbook-pro-could-appear-at-wwdc-2021-sporting-m2-chip",
    "great component shortage possibly affecting MacBook production": "https://www.techradar.com/news/new-apple-macbooks-and-ipads-could-get-delayed-due-to-chip-shortages",
    "talk of potential delays to 2022": "https://www.techradar.com/news/the-latest-macbook-rumor-could-disappoint-a-lot-of-people",
    "Mini LED-toting MacBooks": "https://www.techradar.com/news/macbook-pro-2021-models-could-get-stunning-mini-led-screens"
  }
}