{
  "source": "https://www.techradar.com/news/amazon-will-soon-stop-accepting-uk-visa-credit-cards",
  "title": "Amazon will soon stop accepting UK Visa credit cards",
  "category": "computing",
  "updated": "2021-11-17T11:47:57Z",
  "author": "mike-moore",
  "summary": "High fees named by Amazon as the reason behind Visa card block",
  "article": [
    "UK shoppers will soon no longer be able to use their Visa-issued credit cards to pay for purchases on Amazon.",
    "The ecommerce giant has said it will stop accepting Visa credit cards within the next few months as it looks to push back against the apparently high fees the company charges for transactions.",
    "\"As a result of Visa's continued high cost of payments, we regret that Amazon.co.uk will no longer accept UK-issued Visa credit cards as of 19 January, 2022,\" Amazon said in a statement.",
    "Although credit cards will no longer be accepted, UK customers will still be able to use their Visa debit cards to make purchases on Amazon. Credit cards from other providers such as Mastercard and American Express are also unaffected, Amazon confirmed.",
    "\"The cost of accepting card payments continues to be an obstacle for businesses striving to provide the best prices for customers. These costs should be going down over time with technological advancements, but instead they continue to stay high or even rise,\" Amazon's statement added.",
    "\"With the rapidly changing payments landscape around the world, we will continue innovating on behalf of customers to add and promote faster, cheaper, and more inclusive payment options to our stores across the globe.\"",
    "In its own statement, Visa criticized Amazon for \"threatening to restrict consumer choice\" in the future. \"When consumer choice is limited, nobody wins,\" the firm added.",
    "Visa said it was looking to work with Amazon on a deal to allow customers to keep using its credit cards, but could not confirm when it hoped to come to a conclusion by.",
    "The news, first reported by Bloomberg, is the latest salvo in an ongoing dispute between Visa and Amazon which has been bubbling away for some time now, with Amazon imposing charges on Visa customers in some countries within the last few months.",
    "This includes a 0.5% surcharge on Visa credit card purchases on its Singapore website back in September 2021, which was followed shortly by similar surcharges on Visa transactions in Australia.",
    "The company has a much close relationship with Mastercard, launching the Amazon Platinum Mastercard back in 2017 offering customers rewards and money back when they buy on Amazon."
  ],
  "headers": {
    "3": "Amazon UK Visa credit cards"
  },
  "links": {
    "credit cards": "https://www.techradar.com/best/best-credit-card-processing-service",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-11-17/amazon-will-stop-accepting-visa-credit-cards-issued-in-the-u-k?srnd=technology-vp"
  }
}