{
  "source": "https://www.techradar.com/news/pubg-new-state-finally-gets-a-release-date-on-ios-and-android",
  "title": "PUBG: New State finally gets a release date on iOS and Android",
  "category": "phones",
  "updated": "2021-10-22T06:00:00Z",
  "author": "axel-metz",
  "summary": "New State is just around the corner",
  "article": [
    "Developer Krafton has announced that its new mobile game, PUBG: New State, will be available to download on November 11, 2021.",
    "The date was revealed as part of a media showcase highlighting the new features coming to the PUBG Mobile successor, which is set to offer iOS and Android mobile users the “full, uncompromised battle royale gaming experience currently available in PUBG: Battlegrounds.”",
    "New State mixes up the PUBG formula by dropping players into the futuristic city of Troi in the year 2051, and will mark “one of the most realistic and technologically advanced mobile games to date,” according to Krafton and PUBG Studios",
    "During the hour-long showcase, the game’s developers spoke of the ways in which New State will define the standard for battle royale games to come – starting with its graphical fidelity.",
    "New State will use a state-of-the-art rendering technology to bring its mobile gaming experience on a level with the PC version of PUBG, employing features like global illumination, auto instancing and auto-exposure. The gunplay system, too, has been completely redesigned thanks to these new graphical enhancements – you can check it out in action via the tweet below.",
    "New State’s impressive graphics won’t be limited to users of the latest mobile hardware, either. During the showcase, Krafton confirmed that the game has been optimized to be enjoyed by the majority of players, hence its forgiving system requirements: iOS 13 or later on at least an iPhone 6S, and Android OS 6 on any Android device with at least 2GB RAM.",
    "Players will also get to experience original gameplay features like weapon customization and a drone store in PUBG: New State, as well as a unique recruitment system allowing players to recruit enemies to their squad.",
    "At launch, the game will arrive with four unique maps, including its new flagship arena, Troi, and franchise staple Erangel, which has been “updated with futuristic twists.” As with all other PUBG titles, New State will be updated regularly with new content, gameplay tweaks and “a season-based service focused on gameplay balance and fun.”",
    "Take a look at the new map, Troi, in New State's launch trailer below.",
    "Speaking of balance, Krafton also spoke of its anti-cheat strategy during the media showcase. In order to promote a safe and fair gameplay environment in New State, the developer will ban the use of unauthorized programs, emulators, keyboards and mice, and actively detect and restrict hacks to prevent cheating and protect the game’s code.",
    "That reassurance should please New State’s inevitably huge player base – Krafton proudly announced that the game has now surpassed more than 50 million pre-registrations on iOS and Android devices since being officially revealed earlier this year.",
    "It’ll launch as a “free-to-play experience,\" though naturally we expect New State to be riddled with optional in-game purchases from the get-go. Still, it’s refreshing to see New State freshen up the tried-and-tested PUBG formula – and you can bet we’ll be joining the battle on November 11."
  ],
  "headers": {},
  "links": {
    "PUBG: New State": "https://www.techradar.com/news/pubg-mobile-new-state-release-date-price-trailer-and-everything-we-know-so-far",
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "PUBG: Battlegrounds": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds"
  }
}