{
  "source": "https://www.techradar.com/news/cyberpunk-2077-is-better-than-ever-but-is-that-enough-to-save-it",
  "title": "Cyberpunk 2077 is better than ever - but is that enough to save it?",
  "category": "gaming",
  "updated": "2021-12-02T11:15:54Z",
  "author": "rhys-wood",
  "summary": "Opinion: Cyberpunk 2077’s substantial 1.2 patch still doesn’t change the half-baked experience.",
  "article": [
    "Cyberpunk 2077’s post-launch road has been as rocky as the Badlands that surround Night City. The game launched in such a broken, buggy state that it will likely take months - if not years - of dedicated patchwork and improvements to get the game in a passable state (let’s not forget that Sony delisted Cyberpunk from the PlayStation Store).",
    "Now, a couple of patches and one very real cyberattack later, developer CD Projekt Red has managed to address hundreds (yes, hundreds) of progress halting bugs and visual glitches to its credit, sprinkling in some quality of life features along the way. That being said, we still have no idea when the PS5 and Xbox Series X upgrades will arrive for the game, and when they do arrive, I worry it will be far too late for anyone to really care.",
    "Such bugs, delays to patching and the uncertainty of a current-gen release wouldn’t have been such an enigma, though, if Cyberpunk 2077 was simply given more time in the oven. Instead, CD Projekt Red was adamant to rush to a premature launch date to satisfy the whims of upper management and those omnipresent shareholders.",
    "That’s a real shame because underneath it all, there’s still a really good game waiting to be played in Cyberpunk 2077. The game itself is on the cusp of greatness, but it’s tragically held back by CD Projekt Red’s poor decision making and crunched employees. Cyberpunk 2077 on the PS5 and Xbox Series X might be the big overhaul of the game we’re in need of, then, but by the time it comes out, will anyone give a damn?",
    "I think most would agree that Cyberpunk 2077 would have benefitted from releasing at least a year later than it did. While it would have been understandably frustrating for fans to wait until the end of 2021 or early 2022 - especially after a litany of months-long delays already - this unarguably would have put Cyberpunk in a better position critically.",
    "For example, CD Projekt Red could have found the time to properly optimize for PS5 and Xbox Series X. As it stands, those consoles run the last gen version of the game, albeit benefiting from the beefed up resolution and performance options offered by the PS4 Pro and Xbox One X that are further enhanced by PS5 and Xbox Series X hardware. If you were to play Cyberpunk 2077 on a base PS4 or Xbox One, then...well, just don’t do that. Please.",
    "After the 1.2 patch, Cyberpunk 2077 is at least more playable now than it’s ever been, at least on PC, PS5, Xbox Series X/S and surprisingly, Google Stadia (which to date hosts one of the most stable versions of Cyberpunk 2077). But a playable game does not necessarily make Cyberpunk an essential purchase all of a sudden.",
    "The tragic truth is that there’s still a really good game buried among the rubble, despite the various improvements to performance and playability CD Projekt Red has managed to inject into the game, Cyberpunk 2077 remains a frustratingly half-baked thing to play through. Many of Cyberpunk’s gameplay systems still feel woefully underdeveloped, and there’s plenty of head-scratching omissions that I genuinely couldn’t believe weren’t in the game.",
    "One of the most baffling features missing from Cyberpunk 2077 is the ability to change V’s physical appearance after the initial creation process. You’d better make sure you’re 100% happy with how your V looks, then, because the only way you’ll get to make changes is through modding or starting the game from scratch - something you might not want to do given that Cyberpunk isn’t exactly a short game.",
    "But surely you must be able to at least change things like hair and makeup, right? Well, no. This is something I actually had to Google because I genuinely couldn’t believe Cyberpunk 2077 didn’t feature any kind of post-creation editing, despite the fact that Night City is filled with ripperdocs whose entire job involves swapping body parts for cyber augmentations. Given they can do this, would it be that much of a stretch to have ripperdocs dabble in aesthetics, too?",
    "Maybe this shouldn’t be as big a deal as I’m making it out to be, though. Cyberpunk 2077 is, after all, largely played from a first-person perspective. That said, the game still presents plenty of opportunities for you to see V in-game, being that through mirrors or via the game’s superb photo mode.",
    "Cyberpunk’s gameplay system woes don’t begin and end with aesthetic shortcomings, though, as the game’s Street Cred feature is plainly underdeveloped. This pretty much just acts as a secondary experience bar that unlocks a greater variety of weapons, clothing and cyberware as it increases.",
    "The big problem here is that I don’t think such a reward structure doesn’t warrant its own experience system. These rewards could quite have easily been tied into general level progression. The Street Cred system itself, meanwhile, could have been so much more.",
    "Opening the world map, you can see which gangs operate in each of Night City’s districts. I think it would have made much more sense to treat Street Cred more as a reputation system between all the gangs. Much like we see in games like Fallout: New Vegas, helping or hindering one faction could have had consequences with others.",
    "Instead, each of Cyberpunk’s gangs are just palette swaps. They don’t offer unique enemy types, nor do you see them attacking other districts, leaving the supposedly dangerous Night City feeling a little more sterile as a result.",
    "Finally, and perhaps most crucially, Cyberpunk 2077 just doesn’t have all that much gameplay variety. Yes, you can approach each mission in a variety of ways, be that through stealth, hacking, gunplay or melee combat. Cyberpunk certainly isn’t lacking in those departments. The real problem, then, is that the structure of most missions and side jobs are almost identical.",
    "You go to a building, you infiltrate it however you see fit, you leave, collect your reward, never visit that building again, rinse and repeat. Night City might be one of the most breathtaking realizations of an open world in gaming to date, but the developers clearly didn’t have time to fill it with many exciting things to do outside of the admittedly fantastic main campaign.",
    "My biggest worry, then, is that Cyberpunk 2077 will likely forever be tarnished by its shoddy development history. That’s one thing, but CD Projekt Red will now come under much unwanted scrutiny for any project it announces in the future, and that’s got to be a level of stress that the company’s employees could absolutely do without.",
    "There’s a great foundation just waiting to be built and improved upon in Cyberpunk 2077. The main campaign and almost all of the major side quests were a blast to play through, and the game’s loaded with brilliantly written characters (both Johnny Silverhand and Judy Alvarez are superbly charming). It’s just a shame that Cyberpunk’s best parts might well be buried in the larger conversation of how disappointing the final product ended up being."
  ],
  "headers": {
    "4": "Cyberwhat?",
    "8": "Cyberwhy?",
    "17": "Cyberflunk"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "very real cyberattack": "https://www.techradar.com/news/cyberpunk-2077-patch-12-delayed-with-cd-projekt-red-cyber-attack-to-blame",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Cyberpunk 2077 on the PS5 and Xbox Series X": "https://www.techradar.com/news/cyberpunk-2077-for-ps5-and-xbox-series-x-what-we-know-so-far",
    "just don’t do that": "https://www.techradar.com/news/cyberpunk-2077-apology-promises-fixes-for-the-ps4-and-xbox-one-versions",
    "superb photo mode": "https://www.techradar.com/best/best-video-game-photo-modes-capture-the-perfect-in-game-picture"
  }
}