{
  "source": "https://www.techradar.com/news/lego-star-wars-the-skywalker-saga-might-finally-be-getting-a-release-date",
  "title": "Lego Star Wars: The Skywalker Saga might finally be getting a release date",
  "category": "gaming",
  "updated": "2021-06-07T16:13:49Z",
  "author": "gerald-lynch",
  "summary": "Lego Con could bring balance to the Force",
  "article": [
    "Remember Lego Star Wars: The Skywalker Saga? We might finally get some solid information on the brick-built game, as Lego announces its first ever live event.",
    "Lego Star Wars: The Skywalker Saga is set to be the latest in the long-line of Lego games, and was first revealed at E3 2019, with a succession of release dates between October 2020 and “Spring 2021” following. Each came and went, before the game was indefinitely delayed in April 2021.",
    "But there’s a new hope for the galaxy of Lego gamers eager to wield a plastic lightsaber once again, as Lego has announced Lego Con, an online live event showcasing the best of the toy brands upcoming products. Could Lego Star Wars: The Skywalker Saga make an appearance, and finally get a release date?",
    "The first ever Lego Con will be livestreamed directly from the Lego House in Billund, Denmark on June 26 (6pm CEST / 5pm BST / 9am PST). The all-ages show is expected to last at least an hour.",
    "Lego has given an indication of what will be on show, including Lego Harry Potter, Ninjago and Dots sets. But it seems unlikely that it’ll leave out its Lego Star Wars cash-cow, and the long-awaited game associated with it.",
    "It’ll also be the perfect time to give a noise-free update on the game, following a busy month for the games industry that will see the annual E3 showcase and Summer Games Fest dominate headlines. Setting aside a unique space for the game could be just what it needs to get fans excited again.",
    "Lego Star Wars: The Skywalker Saga will cover scenes from all nine ‘core’ Star Wars films, and will lean into a more open-world like design than previous Lego Star Wars games, with hub areas based around familiar film locations like Naboo, Tatooine and Hoth. Combat has been revamped with combo based lightsaber action and an over-the-shoulder ranged combat view. Expect a deeper Lego game than we’ve previously seen, based on a new engine, when the game eventually releases on Xbox Series X, Series S and Xbox One, PC, PS4 and PS5, and Nintendo Switch."
  ],
  "headers": {
    "3": "Lego Con line-up"
  },
  "links": {
    "Lego Star Wars: The Skywalker Saga": "https://www.techradar.com/news/lego-star-wars-the-skywalker-saga-release-date-trailers-news-and-gameplay",
    "E3": "https://www.techradar.com/news/e3-2021",
    "Summer Games Fest": "https://www.techradar.com/news/summer-game-fest-2021-everything-you-need-to-know",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch"
  }
}