{
  "source": "https://www.techradar.com/news/how-consumers-will-drive-the-next-wave-of-payments-tech",
  "title": "How consumers will drive the next wave of payments tech",
  "category": "computing",
  "updated": "2021-07-13T14:01:07Z",
  "author": "roy-aston",
  "summary": "The changing ways of paying",
  "article": [
    "The events of the last year have not only accelerated the shift to online as social distancing measures and lockdowns have limited access to physical stores, but it’s also created increased appetite for the adoption of new payment methods.",
    "All around the world people are shopping differently and paying differently. International research we commissioned in March this year among 8,000 consumers found that 86% said their payment habits have changed over the last 12 months, and 59% had tried a new payment method. It seems that choice has never been more important.",
    "And, the early signs are that our new habits will endure. Consumers are discovering more convenient ways of buying and paying, and, as in other aspects of their lives that have changed due to the pandemic, they will adopt new behaviors into the long-term if they make their lives easier.",
    "Payments providers have played a big part in helping merchants react quickly and shift to online methods of operation to fulfil immediate consumer needs over the last 12 months, but there’s more that can be done. Technology is in an advanced place, but as always, it’s the uptake that will define how impactful that tech will be. A lot of it isn’t being used, or isn’t being used in the right way yet. Take 3DS2 (3D Secure 2). While its ability to improve online payments security and reduce fraud is obvious, merchants’ concerns around it increasing checkout drop-off is affecting the speed of migration. In reality, it has great potential to be used to optimize the user’s checkout experience and improve the mobile payments process.",
    "The wider challenge for payments providers over the next 12 months is helping merchants transition from the first step of establishing online payments as part of building their ecommerce presence to machine learning and artificial intelligence use cases around customer and credit management.",
    "The big areas to look at this year include:",
    "It’s no surprise that 5G is proving to be more evolution than revolution. But when we talk about using new technologies to support changing consumer habits, there is little doubt that 5G is going to be central to making this happen. For example, being able to use data in real-time, at the exact point of purchase or consumption, to make checkout interactions more engaging through incentives.",
    "The improved connectivity and speed that 5G brings will also remove barriers to businesses and help them reach new customers as well as enable individuals to set up businesses in more remote areas. More significantly, and fundamentally, it will give people access to services they couldn’t reach before. The payments ecosystem will play a pivotal role in accelerating inclusivity and driving worldwide mobile transactions with the right payments solutions. This will be truly transformational in emerging markets.",
    "As always, fraud isn’t far from the agenda – both for businesses and for consumers. While people are, as we’ve seen, embracing new buying and payment methods, they still have concerns which online retailers must understand and act on if they’re to secure consumer confidence and maximize the growth opportunity that the acceleration to digital represents. As consumers continue to move online, they’re also now more conscious – and concerned – about fraud. And it’s in this area too that we will see positive changes as 5G enables merchants to build advanced security and speed into transactions.",
    "Maintaining consumer confidence and trust is ultimately the priority as we transition to a more advanced use of technology. Moving data more fluidly end-to-end is one thing, but doing right by that data at all stages of its journey, while providing full transparency to the consumer, is another.",
    "There’s vast opportunity in connecting the data and consumer insights from payments providers, fintechs, retailers, merchants and banks. By doing this, and combining these digital identities, new levels of personalization are possible. But to maintain consumer trust, recommendations and incentives based on this information need to be appropriate, delivered at the right time and worthwhile. It’s then that it really improves the consumer experience. Combine it with a frictionless and personalized checkout and it becomes a significant competitive advantage, which has never been more important during these unprecedented times."
  ],
  "headers": {
    "3": "The challenge ahead",
    "6": "Delivering on the promise of 5G",
    "9": "Putting trust first"
  },
  "links": {
    "payment": "https://www.techradar.com/best/best-payment-gateways",
    "security": "https://www.techradar.com/news/best-internet-security-suites",
    "mobile payments": "https://www.techradar.com/news/best-mobile-payment-app",
    "ecommerce": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning",
    "artificial intelligence": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "5G": "https://www.techradar.com/best/best-5g-phones"
  }
}