{
  "source": "https://www.techradar.com/news/volvo-c40-recharge-price-confirmed-and-its-more-expensive-than-the-tesla-model-y",
  "title": "Volvo C40 Recharge price confirmed, and it's more expensive than the Tesla Model Y",
  "category": "car-tech",
  "updated": "2021-07-20T16:32:15Z",
  "author": "chris-teague",
  "summary": "The Volvo C40 Recharge price starts at $58,750",
  "article": [
    "Volvo is one of several major automakers that have announced electrification plans in 2021. The Swedish automaker stated a goal of converting 50 percent of its global sales to fully electric cars by 2025.",
    "The first dedicated EV to come from this effort is the C40 Recharge, a compact crossover. This week, Volvo announced pricing for the vehicle, which will start at just under $60,000.",
    "The C40 isn't Volvo's first swing at a fully electric vehicle, but it's the first that the company has built for electrification from the ground up.",
    "The automaker released an electric version of its compact XC40 crossover a few years back, but it was an EV conversion from a platform meant to support an internal combustion engine.",
    "Volvo's move to a dedicated EV platform gives it the ability to position battery packs and other equipment to maximize interior space and driving dynamics.",
    "As TechRadar reported back in March, the C40 will carry a range of 260 miles at launch and will only be sold online. In addition to unlimited data for onboard connected services, the C40 will get over-the-air (OTA) updates that improve its efficiency and extend its range.",
    "Volvo will offer the C40 Recharge in an Ultimate trim level, which the automaker says packs every available option into the vehicle.",
    "The list of standard kit includes a fixed panoramic moonroof, pixel LED lighting, a Harman Kardon premium audio system, a surround-view monitor, exclusive 20-inch wheels, and a Pilot Assist system.",
    "The vehicle's infotainment system is Android-based and will come with embedded Google services. Volvo also notes that the C40's interior will be completely leather-free.",
    "The Volvo C40 Recharge price starts at $58,750, but that's before destination fees and taxes are applied. It is also before any government incentives are applied, such as state and federal tax credits or rebates.",
    "Further lessening the financial blow, Volvo collaborates with Electrify America to provide 250KWh of free charging for its model year 2022 vehicles. The charging benefits have to be used within the first three years of ownership, but once the time period has expired, owners will be eligible to join Electrify America’s Pass+ plan at Volvo's expense."
  ],
  "headers": {
    "6": "Packed with features"
  },
  "links": {
    "TechRadar reported": "https://www.techradar.com/news/the-new-volvo-c40-electric-car-has-a-260-mile-range-that-will-increase-with-updates"
  }
}