{
  "source": "https://www.techradar.com/news/the-best-players-in-madden-nfl-22",
  "title": "The best players in Madden NFL 22",
  "category": "gaming",
  "updated": "2021-08-20T11:00:03Z",
  "author": "justin-koreis",
  "summary": "Separating the stars from the scrubs",
  "article": [
    "Players, more so than scheme or play calling, make the difference on the football field of Madden NFL 22. Great players seem to defy the laws of physics, with their super human ability to disrupt opponent's offenses, or beat their defenses for huge plays.",
    "We’ve gone through every position group, looked over every roster to find the best players in Madden NFL 22. While these rankings are weighted heavily based on overall rating, Superstar X-Factor (denoted XF), and certain attribute advantages also matter.",
    "1. Patrick Mahomes (99) (XF)",
    "2. Tom Brady (97) (XF)",
    "3. Aaron Rodgers (96) (XF)",
    "4. Russell Wilson (94) (XF)",
    "5. Lamar Jackson (91) (XF)",
    "Patrick Mahomes at 99 for another year is no surprise, given his sustained excellence. Tom Brady’s seventh Superbowl win helped this rating take a jump from 90 last year to 97 now. Replace Superbowl with MVP, and that is Aaron Rodgers's story as well. Russell Wilson reached as high as 99 mid-season last year, but has fallen back down to earth with a merely excellent 94 overall. Lamar Jackson rounds out the top five, falling slightly from the form that had him on the Madden cover a year ago.",
    "1. Christian McCaffrey (97) (XF)",
    "2. Derrick Henry (96) (XF)",
    "3. Nick Chubb (96) (XF)",
    "4. Dalvin Cook (95) (XF)",
    "5. Alvin Kamara (94) (XF)",
    "Christian McCaffrey at #1 is somewhat surprising. He missed most of last season with injury, and Derrick Henry became just the eighth player in NFL history to rush for over 2,000 yards in a season. Nick Chubb remains roughly equal as a power back to Derrick Henry, while Dalvin Cook and Alvin Kamara present elite options as elusive backs. No fullbacks were rated high enough to make the top five.",
    "1. Tyreek Hill (98) (XF)",
    "2. Davante Adams(99) (XF)",
    "3. DeAndre Hopkins (98) (XF)",
    "4. Stefon Diggs (97) (XF)",
    "5. Julio Jones (95) (XF)",
    "Technically Davanta Adams has the highest overall rating among wide receivers, but the speed kills in Madden, and Tyreek Hill has him beat in that factor by a wide margin. DeAndre Hopkins is close behind, and ties Adams with the best catch rating in the game. Stefon Diggs has improved his overall by five points from last year, while Julio Jones remains almost unchanged with a 95 overall.",
    "1. Travis Kelce (99) (XF)",
    "2. George Kittle (96) (XF)",
    "3. Darren Waller (93)",
    "4. Mark Andrews (88)",
    "5. Hunter Henry (87)",
    "Travis Kelce remains the best tight end in football, digital or otherwise. George Kittle is close, but then there is a steep drop off to Darren Waller, and again to Mark Andres and Hunter Henry.",
    "1. Zach Martin (98)",
    "2. David Bakhtiari (96)",
    "3. Terron Armstead (95)",
    "4. Quenton Nelson (95)",
    "5. Trent Williams (94)",
    "Offensive line ratings are dominated by left tackles, but the guard play of Zach Martin is too strong to ignore. He finds himself with the highest rating, with only fellow guard Quenton Nelson breaking a category normally dominated by tackles David Bakhtiari, Terron Armstead, and Trent Williams.",
    "1. Jalen Ramsey (99) (XF)",
    "2. Stephon Gilmore (97) (XF)",
    "3. Tyrann Mathieu (95) (XF)",
    "4. Jaire Alexander (95) (XF)",
    "5. Buddha Baker (93)",
    "There are few things Madden NFL 22 players want to see less than Jalen Ramsey lined across from them on defense. He is a game wrecker at corner, and can erase even the best wide receivers from gameplans. Stephon Gilmore and Jaire Alexander are not far behind, while the versatile Tyrann Mathieu and Buddha Baker can be stars in multiple defensive positions.",
    "1. Khalil Mack (96) (XF)",
    "2. T.J. Watt (94) (XF)",
    "3. Chandler Jones (94) (XF)",
    "4. Fred Warner (94)",
    "5. Lavonta David (93) (XF)",
    "No surprise to see Khalil Mack at the top of the list, he’s been unstoppable for his entire career. T.J. Watt led the league in sacks last year, earning himself a bump up to 94 overall. Chandler Jones and Lavonte David are both familiar names on this list, but newcomer Fred Warner has made his debut in the top 5, replacing Bobby Wagner as the game’s best middle linebacker.",
    "1. Aaron Donald (99)(XF)",
    "2. Myles Garrett (98) (XF)",
    "3. J.J. Watt (94) (XF)",
    "4. Fletcher Cox (94) (XF)",
    "5. Cameron Jordan (93) (XF)",
    "If a score greater than 99 were possible then Aaron Donald would have it. His run as the most dominant player in the NFL does not look to be ending soon. Myles Garrett may be his heir apparent, but don’t write off the veterans yet. J.J. Watt, Fletcher Cox, and Cameron Jordan are all defensive beasts, despite being in their 30s.",
    "1. Justin Tucker (87) (XF)",
    "2. Johnny Hekker (86) (XF)",
    "3. Jason Sanders (85)",
    "4. Sam Koch (84)",
    "5. Harrison Butker (84)",
    "Take a look at the NFL record books and you will see kickers score far and away more points than any other position in the NFL. The best continues to be Justin Tucker, a Hall of Fame specialist if ever there was one. Johnny Hekker is the best punter, and can almost single-handedly win his team the position battle. Jason Sanders is an extremely accurate kicker, while Harrison Butker has more power. Brett Kern can match Hekker for control, but comes short on punting distance."
  ],
  "headers": {
    "2": "Quarterbacks",
    "8": "Running backs",
    "14": "Wide Receivers",
    "20": "Tight End",
    "26": "Offensive Line",
    "32": "Defensive Backs",
    "38": "Linebackers",
    "44": "Defensive Line",
    "50": "Kickers and punters"
  },
  "links": {}
}