{
  "source": "https://www.techradar.com/news/facebook-wants-to-put-your-eyes-on-vr-headsets-and-its-truly-frightening",
  "title": "Oculus VR headsets could get an external screen that let's you see who's inside",
  "category": "wearables",
  "updated": "2021-08-04T10:04:04Z",
  "author": "henry-st-leger",
  "summary": "Facebook Reality Labs unveils a very weird prototype",
  "article": [
    "A new VR headset prototype has been unveiled by Facebook Reality Labs, featuring an external screen that could let fellow VR users or observers see the eyes and face of whoever's inside.",
    "The fledgling technology marks a reversal of the camera passthrough of the Oculus Quest 2's built-in lenses, which can record external surroundings and display them within the headset's visor – instead using internal cameras to show your eyes on an external display.",
    "This internal camera projects \"a three-dimensional view of the wearer's eyes [...] in a perspective correct manner\" onto a screen located on the outside of the headset, even allowing someone to make (somewhat awkard) eye contact with others in their vicinity.",
    "Called 'reverse pass-through VR', the prototype tech is ostensibly designed to aid \"more seamless interactions between people with and without headsets in social or professional contexts\" – especially \"natural eye contact\".",
    "So whether you're screaming at the VR arcade or wandering around a virtual building at a real estate agency, this kind of technology could help reduce the sense of awkwardness and isolation that still comes from being siloed in a VR headset – allowing nearby users to view each other in real life, albeit through several layers of screen.",
    "This prototype is just the latest project from Facebook Reality Labs, which is the R&D division for Facebook's AR/VR arm, and in March spoke out about its designs for mind-controlled wrist wearables.",
    "While the technology displayed by Facebook Reality Labs is at the prototype stage, there's certainly a case to be made for its commercial use.",
    "The isolating nature of VR can be off-putting for some, and the big challenge for VR headset manufacturers like the Facebook-owned Oculus will be in widening the audience of VR beyond die-hard technology geeks and gamers such as ourselves.",
    "Helping the technology to feel social, and more grounded in our actual surroundings, can only help make VR more accessible to the everyday user.",
    "However, if we're talking about a whole second screen on the outside of a headset – as well as internal cameras – there will be costs involved.",
    "The great strength of the Quest 2 is that it's a relatively affordable standalone headset, and seeing that price jump up for secondary screen many won't use doesn't seem like a smart move either.",
    "We could see a dedicated 'social' iteration of the headset, possibly one with generally lower specifications compared to flagship Oculus models – for younger, older, or more casual users.",
    "However, it's also just as likely for this reverse pass-through tech to never make it to market at all. The study states that \"Improved facial reconstruction [...] remains a challenge\", which suggests that launching this technology early could result in some quite unnatural eye contact, which we imagine nobody wants.",
    "Given the prototype stage that this technology appears to be at, we don't expect it to appear in the Oculus Quest 3, at least, and we can see its application being far more useful when VR headsets finally slim down to something more approaching 'normal' spectacles.",
    "Via RoadtoVR"
  ],
  "headers": {
    "6": "Analysis: How much eye contact do we need?"
  },
  "links": {
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Facebook Reality Labs": "https://research.fb.com/publications/reverse-pass-through-vr/",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "mind-controlled wrist wearables": "https://www.techradar.com/news/mind-monitoring-wristwear-and-hands-free-input-are-the-future-of-ar-and-vr-control-says-facebook",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "RoadtoVR": "https://www.roadtovr.com/facebook-reality-labs-research-reverse-passthrough-prototype/"
  }
}