{
  "source": "https://www.techradar.com/news/wandavision-episode-9-mid-credits-scene-explained",
  "title": "WandaVision episode 9 mid-credits scene explained: how it sets up Captain Marvel 2",
  "category": "entertainment",
  "updated": "2021-03-05T14:15:17Z",
  "author": "tom-power",
  "summary": "Monica is moving up in the world",
  "article": [
    "Spoilers for WandaVision episode 9 follow.",
    "WandaVision episode 9 had a lot to cover in terms of telling Wanda's story, but the Disney Plus series also had the task of setting up future MCU projects. While the show does a stellar job of tying up its loose plot threads, it also teases what's next for its key characters.",
    "We imagine you have questions after WandaVision's season finale, and one of those pertains to Monica Rambeau. There's a mid-credits scene in WandaVision episode 9 that concerns the MCU's newest superpowered being, and how it plays out will definitely lead into Captain Marvel 2.",
    "It shouldn't come as a surprise, but there are big spoilers for WandaVision episode 9 for here on out. If you haven't watched the entire episode - including that mid-credits stinger - turn back now or prepare to have the ending ruined for you.",
    "Let's explore the mid-credits scene before we dive into how it sets up Captain Marvel 2. After Wanda - or the Scarlet Witch, as we now know her - has saved Westview from Agatha Harkness (and herself, arguably), FBI agent Jimmy Woo and Monica reunite as Woo's team begin cleaning up the town. Monica is approached by an unnamed agent, who requests that Monica follows her to the movie theater for a debrief.",
    "Monica walks into the building but there are no other people present. Concerned, she turns to the agent. The person tells Monica that she was sent by an \"old friend of your mother\" before revealing her true identity. She's a skrull (referred to as 'Skrull agent' in the credits), but it's unclear which skrull she is.",
    "You might have guessed it's Soren, the wife of Talon who we saw in 2019's Captain Marvel. However, she could also be the pair's daughter, who Monica befriended in the same film – though wouldn't Monica recognize her if she was meant to be a pre-existing character?",
    "Most likely, she's just a skrull agent who's not familiar with Monica yet.",
    "Anyway, the skrull agent says she hears that Monica has been \"grounded\" - a reference to Tyler Hayward's comment earlier in the season - before saying that \"he would like to meet with you\". Monica asks where, the skrull looks and points upwards, and Monica smiles before the screen cuts to black.",
    "The most obvious answer is that Monica is set for a reunion with Brie Larson's Captain Marvel in the follow-up to her standalone movie. The film's plot is currently unknown but Teyonah Harris, who stars as Monica in WandaVision, has already been cast in Captain Marvel 2. We know, then, that she'll play some key part in the sequel.",
    "We also know that Monica won't be on the best of terms with Carol Danvers - aka Captain Marvel - when they are reunited. Carol wasn't around when Monica's mother - Maria - passed away during The Blip, so she isn't happy about this.",
    "A Reddit fan theory has suggested Carol's powers - born from radiation that the Tesseract gave off when Carol obtained her abilities - may have been the cause behind Maria's cancer in the first place. If Carol was inadvertently the reason behind her best friend's death, it could explain some of the hinted-at friction between Monica and Cap.",
    "In any case, it's clear that Monica has been tapped to become part of Nick Fury, the Skrulls and humanity's joint venture to protect Earth and other planets from intergalactic threats. A post-credits scene in Spider-Man: Far From Home showed that Fury was already onboard a Skrull spacecraft as it observes the universe for cosmic bad guys, so it's safe to assume that this is where Monica is being taken.",
    "Who the \"he\" is, that Soren refers to, is likely to be Fury or Talos. If that is the case, we might also see Monica appear in upcoming Disney Plus series Secret Invasion, but this show doesn't have a release date yet.",
    "For now, though, Monica will definitely be part of Captain Marvel 2, which is set to arrive November 11, 2022."
  ],
  "headers": {
    "4": "WandaVision season finale mid-credits scene explained",
    "9": "How does WandaVision set up Captain Marvel's sequel?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "Disney Plus series": "https://www.techradar.com/best/best-disney-plus-shows",
    "Reddit fan theory": "https://www.reddit.com/r/WANDAVISION/comments/ldpzdh/theory_about_why_maria_rambeau_reacted_harshly_to/"
  }
}