{
  "source": "https://www.techradar.com/news/this-kids-fitness-tracker-lets-your-little-ones-make-video-calls-from-their-wrists",
  "title": "This kids' fitness tracker lets your little ones make video calls from their wrists",
  "category": "fitness",
  "updated": "2021-06-30T09:12:55Z",
  "author": "cat-ellis",
  "summary": "TCL's new kid-friendly smartwatch will help them stay in touch",
  "article": [
    "Chinese company TCL is launching a new 4G kids' smartwatch that lets them make calls and send messages, allows parents to keep track of their whereabouts, and includes a built-in front-facing camera. TCL announced the MoveTime Family Watch 2 at MWC 2021, alongside a raft of new TVs, phones, and even a pair of smart glasses that mimic an external 40-inch display.",
    "While kids' watches like the Fitbit Ace 3 and Garmin Vivofit Jr 3 focus purely on encouraging youngsters to develop healthier exercise and sleep habits, safety has always been a big part of the TCL MoveTime series. The original MoveTime Family Watch allowed parents to monitor their kids' whereabouts via GPS using a dedicated parental app, with 3G for making voice calls and sending text messages.",
    "In addition to the new camera, the MoveTime Family Watch 2 features more accurate GPS positioning, plus improved battery life for parents' peace of mind (Wareable reports that it will last up to seven days between charges). It'll also be possible for parents to set up geofenced zones, with alerts if their little ones stray outside a defined area.",
    "The watch will go on sale in mainland Europe in August this year for €149 (about $180 / £130 / AU$240). Global prices and launch dates have yet to be announced.",
    "The MoveTime Family Watch 2 isn't the first kids' smartwatch capable of making video calls, but this is the first sign of them becoming mainstream.",
    "Last year, Fitbit acquired Doki Technologies, a Hong-Kong based startup that built the first kid-friendly watch capable of making video calls. The purchase led to speculation that the next Fitbit Ace might be a fully fledged smartwatch with this capability built in.",
    "However, this turned out not to be the case, and when the Fitbit Ace 3 arrived in early 2021, it was a no-frills fitness tracker like its predecessor. It monitors activity and sleep patterns, which are synced to the parent's phone, and is packed with a range of games, but there's no color screen, camera, GPS or cellular capability.",
    "It's possible that Garmin may move into this territory soon (after all, the company made its name in GPS technology) but for now the MoveTime Family Watch 2 is one of very few wearables that will allow you to keep tabs on kids who are too young to have their own phones."
  ],
  "headers": {
    "4": "The next generation"
  },
  "links": {
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "a pair of smart glasses": "https://www.techradar.com/news/tcls-mwc-2021-lineup-includes-smart-glasses-that-mimic-a-140-inch-display",
    "Fitbit Ace 3": "https://www.techradar.com/reviews/fitbit-ace-3",
    "Garmin Vivofit Jr 3": "https://www.techradar.com/news/garmin-launches-smart-new-kids-fitness-tracker-packed-with-fun-games",
    "Wareable": "https://www.wareable.com/smartwatches/tcl-movetime-family-watch-2-price-specs-release-date-8474",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Doki Technologies": "https://www.techradar.com/news/fitbit-is-reportedly-working-on-a-4g-smartwatch-for-kids",
    "Garmin": "https://www.techradar.com/best/garmin-watch"
  }
}