{
  "source": "https://www.techradar.com/news/putting-customer-experience-at-the-heart-of-digital-banking",
  "title": "Putting customer experience at the heart of digital banking",
  "category": "computing",
  "updated": "2021-05-12T14:13:22Z",
  "author": "alexa-guenoun",
  "summary": "Putting customer experience at the heart of digital banking.",
  "article": [
    "Back in 1995, when Jeff Bezos established Amazon, his mission was to be the “Earth's Most Customer-Centric Company.\" As Chief Executive, Bezos would leave a single empty chair at the table during meetings – a symbolic gesture to communicate that the customer is always the most important person in the room. He went on to explain that innovative companies must \"listen to the customer and invent for the customer.\"",
    "This is even more relevant today. Fast and simple digital experiences have now become the norm for consumers throughout their lives. And it has become central to banking too.",
    "It is a hard environment for banks who face disruption from increasing regulatory pressures, new entrants as well as profitability challenges. The pandemic has hit the fast forward button on digital. And as big tech has become increasingly involved in the sector – more pressure has been put on banks to step up their digital offering. Banks are recognizing this trend. A recent Temenos report, in partnership with the Economist Intelligence Unit (EIU) found that 31% of banking leaders expect big tech to become their main competitors in the next five years, and 66% thought new technologies would transform their industry in the same period.",
    "The good news for banks is that they still hold a substantial competitive advantage. They enjoy strong customer relationships and trust. Add the rich data these relationships provide, as well as banks’ established levels of capitalization and compliance, it’s clear that banks remain well-placed to succeed. However, to thrive in the digital era banks must utilize sophisticated banking technology. Doing so will enable them to match the seamless and intuitive customer experiences offered by big tech, while maximizing those areas where they hold a natural edge. Companies like Amazon are constantly evolving to match customer expectations and requirements. How else does a firm go from selling books to providing Amazon Web Services?",
    "To enhance their customer experiences, banks need to rethink their business models. Banks can’t go at it alone anymore. They need to create agile digital ecosystems and leverage their scale and existing commercial relationships to deliver a whole new customer experience.",
    "A customer-first mentality means that financial institutions need to think about the customer relentlessly and make things easy for them. Since smartphones are fundamental to our lives, convenience therefore means mobile-first - and solutions should be designed for mobile and scaled up to desktop.",
    "Banks will be unable to create seamless and intuitive customer experiences with legacy technology. It requires advanced digital banking solutions. Take for instance, Application Programming Interfaces (APIs) which allow banks to separate their customer experience from the manufacturing of products and services. APIs allow banks to connect ecosystems of financial and non-financial services, placing themselves at the center. Banks have been consuming APIs from service providers for features like KYC, Payments and Fraud Detection for years. But when a bank uses APIs, it can be a game changer - allowing the bank’s products and services to be embedded in other experiences.",
    "Cloud computing is another advanced technology that can drive great customer experience in banking. It offers more speed, agility, and innovation. Crucially, cloud technology creates a hyper-efficient cost model, where savings can be passed onto the customer. Passing cost benefits on to end-users has been a driver of customer loyalty and satisfaction for companies like Amazon for many years.",
    "Finally, artificial intelligence allows banks to analyze their vast amounts of data. This provides learnings that enable them to continuously improve and evolve their customer service. When HSBC North America launched a credit card offering, analytics tools showed that a specific input box was leading to significant rates of abandoned application. By using this learning, the bank was able to quickly improve the customer experience and boost completion rates.",
    "In today’s world, trust is more precious than ever. It is banks’ most valuable advantage, and they need to maintain and extend it wherever possible. In the world of customer experience, banks can do this by combining technology with the human touch that has been key to forming these trusted relationships.",
    "Banks can also help to boost trust in their technology-enabled customer experiences by ensuring their AI is explainable. Big tech uses machine algorithms all the time - like recommending which movies to watch next on Netflix. But decisions on loans and mortgages can be life changing - and customers will want to understand why they have been turned down. Explainable AI (XAI) can clearly show why a negative decision was reached, providing customers with steps to remedy this. Explainability also allows programmers to combine the inherent efficiency of AI with human perspective - providing even better experience for customers.",
    "Like so many industries before it, digital technology has given banks a “fight or flight” choice. Will they battle for their customer relationships, or retreat to becoming utility providers. The transformative power of banking technology and their inherent competitive advantages gives bank a fighting chance. But time is of the essence. Stand still and they will be left behind."
  ],
  "headers": {
    "4": "A new digital age for banking ecosystems",
    "5": "Advanced technologies",
    "9": "Maintaining the trust advantage"
  },
  "links": {
    "customer": "https://www.techradar.com/best/best-customer-feedback-tools",
    "data": "https://www.techradar.com/best/best-data-visualization-tools",
    "customer experiences": "https://www.techradar.com/best/cx-tools",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "Cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}