{
  "source": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
  "title": "Samsung Galaxy Z Fold 3 review",
  "category": "phones",
  "updated": "2021-11-22T00:34:20Z",
  "author": "matt-swider",
  "summary": "The best foldable phone – so far",
  "verdict": "The Samsung Galaxy Z Fold 3 is the first foldable phone that we recommend to people who would normally call themselves ‘early adopters’, yet held off on buying last year’s Z Fold 2 for good reason. Those fence-sitters will be swayed by the new Z Fold 3’s S Pen support, greater durability and water-resistance in an otherwise familiar-looking foldable design with unchanged cameras. It’s still mighty expensive, and therefore not for the average consumer, but it starts at a slightly lower price than its predecessors, making it ideal for those who've been looking to buy into the form factor but have been waiting on the sidelines.",
  "pros": [
    "S Pen support – finally",
    "More durable design",
    "Slightly cheaper than Fold 2"
  ],
  "cons": [
    "Still very expensive",
    "Cameras could be better",
    "No front-screen S pen support"
  ],
  "article": [
    "The Samsung Galaxy Z Fold 3 is designed to convince you that the third time's a charm when it comes to buying into the future of foldable phones, and without a Galaxy Note 21, there's a lot of pressure on Samsung to make good on that adage.",
    "Good news: we've fully tested the Galaxy Fold 3 for nearly two weeks now, and it's become the first foldable phone that we can recommend to those who would ordinarily consider themselves early adopters, but who passed up on the first two iterations of Samsung’s foldable, without hesitation.",
    "We've been closely evaluating its familiar 2-in-1 design, determined to fold and unfold the 7.6-inch flexible display until we could do it in our sleep in order to properly test its durability.",
    "The result? This version of Samsung’s foldable phone feels stronger than its two predecessors: it’s waterproof this time, while its mini-tablet-sized inner screen withstood our meanest stylus strokes with the new S Pen and S Pen Pro.",
    "S Pen support makes perfect sense on a screen of this size, and it was something that people were clamoring for with the first two Folds. There’s more writing and drawing real estate here than on any Galaxy Note smartphone, yet not so big that it’s inconvenient like a full-sized traditional tablet that has to be stowed in a bag. The Galaxy Z Fold 3 can be closed to half and stuck in a pocket.",
    "It may well change the way you use your phone day to day, especially if you spring for the S Pen and a case to carry it in – unfortunately, the stylus is sold separately and doesn’t tuck inside the phone. That inconvenience will be jarring for long-time Note fans, even if we found the new stylus bigger and easier to use than the Note’s toothpick-sized S Pen.",
    "Also, you’ll need to dial back your camera expectations: this is yet another foldable with cameras that are good, but which lack the zoom-in oomph of the Samsung Galaxy S21 and last year’s Note 20 Ultra. There is one standout camera perk: an under-the-screen camera neatly obviates the need for punch-hole on the more seamless inner display, although the 4MP camera quality loss is noticeable.",
    "The big hook to the Galaxy Fold 3 is its slightly cheaper price compared to the Galaxy Z Fold 2, and, maybe more convincingly, the excellent trade-in deals Samsung is offering in many regions when you pre-order ahead of the official release date.",
    "Those who had their doubts about the first two generations of Samsung’s foldable, were right to hold ‘em, but now it may be time to fold ‘em.",
    "The Samsung Galaxy Z Fold 3 release date was August 27, 2021 in the US and UK, while in Australia it’s September 10, 2021.",
    "The Z Fold 3 price is cheaper than the launch price of the Galaxy Z Fold 2, but be warned: foldable phones are still notably more expensive than conventional top-end smartphones like the Samsung Galaxy S21 Ultra or iPhone 12 Pro Max.",
    "It starts at $1,799 / £1,599 / AU$2,499 for a model with 256GB of storage, while if you want extra capacity you can get a 512GB Galaxy Fold 3 for $1,899 / £1,699 / AU$2,649. The Z Fold 2 started at $1,999 / £1,799 / AU$2,999 when it was released in 2020.",
    "In the US, Samsung is offering some tempting trade-in deals – up to $800 off if you turn in an older device, be it a phone, tablet or wearable, or any combination of the three, and you can add up to four devices to reach that maximum value. You could, then, get this phone for $999, and that’s a much more compelling price tag.",
    "In the UK you’ll be able to get up to £250 trade-in on your phone, and those who pre-ordered got a Fold Starter Kit which includes a charger, a case for your Z Fold 3 and an S Pen stylus.",
    "In Australia, Samsung is offering trade-in discounts of up to AU$500, along with a choice of bonus gift bundle, which varies between the two models. You could score Galaxy Buds Pro, Galaxy Buds Live, or one of the power or productivity packs that includes items like the S Pen, phone case and charging mat.",
    "The Samsung Galaxy Z Fold 3 retains the book-like design and functionality of its two predecessors, with a limited but usable 6.2-inch Cover Display on the outside of the handset that opens up to reveal a massive 7.6-inch display on the inside.",
    "The two displays, and a hinge mechanism that allow you to fold and unfold this phone, combine for the most head-turning mobile gadget design in 2021. Yes, we’ve seen it twice before, but most people we showed the Galaxy Fold 3 to still haven’t seen anything like it.",
    "And that’s what you’re paying for: the wow factor of being able to pull a phone out of your pocket and unfold it to not only reveal a 7.6-inch tablet-like display, but to also show that you're symbolically ahead of the technology curve.",
    "Samsung has made improvements to the hinge, and the materials used are more durable than those employed in all previous foldable phones we've tested. In fact, Samsung is claiming the Z Fold 3 is 80% stronger than its prior foldables; and sure enough, there’s a noticeable difference when you unfold the device, especially if you’re upgrading from Gen 1.",
    "It’s sturdier than the Fold 2, and the company’s Ultra Thin Glass feels less mushy this time around – that’s important whether you’re playing games or swiping through Instagram and TikTok videos.",
    "The Z Fold 3 design is remarkable, even if it doesn’t always seem practical. You'll have to get over the fact that you're paying a premium to carry the thickest flagship smartphone in decades when today’s thin-and-light phones are significantly cheaper. It’s a touch lighter than the Z Fold 2 at 271g compared to 282g, but it’s still a hefty handset.",
    "New in the Z Fold 3 is water resistance, and we did test this out without breaking our super-expensive review unit. We even unfolded it underwater – and while we flinched, the phone’s durability didn’t. However, its IPX8 rating means you won’t be able to take this phone to the beach, as it’s not dust-resistant. Grains of sand will be the Achillies’ heel of foldable phones for some time to come, it seems.",
    "Samsung’s tablet-like 7.6-inch screen with a 120Hz refresh rate continues to be the key selling point of its foldable smartphone.",
    "With a wide 24.5:9 aspect ratio, the Fold 3 has become our preferred way to read ebooks and surf the web on a phone. Columns on websites actually appear next to each other instead of being stacked vertically, and we even got spreadsheet work done without feeling defeated, as we usually do on a traditional smartphone.",
    "You'll still have to learn to ignore the still-noticeable middle crease that's a part of this inner AMOLED display. But we found that easy, as we quickly became mesmerized by the large screen, and what it offers us in everyday use cases.",
    "We've got a lot of joy out of playing games without our thumbs covering up the entire display when reaching for on-screen controls. We also showed off a YouTube video to a group of friends without having to hand over our device and without them having to squint – the Z Fold 3 screen is just that big.",
    "The Cover Display, expanded to 6.2 inches when the Z Fold 2 launched in 2020 due to overwhelming feedback on the Z Fold 1, exhibits the same dimensions here – it’s tight, especially when you’re trying to tap away on the thin keys of the narrow Cover Display keyboard, but at least the screen refresh ratio has been bumped up to 120Hz, matching what we've had on the inner display previously.",
    "The Galaxy Z Fold 3 is compatible with the S Pen – and it’s a difference-maker for a phone that’s unofficially billed as the Note 21 Ultra replacement.",
    "Samsung is selling a brand-new S Pen specially designed for this foldable phone. Actually, there are two of them: the S Pen Fold Edition, and the larger S Pen Pro, with Bluetooth for Air Actions and USB-C charging.",
    "While in the Note series the included S Pen was toothpick-sized and housed within the body of the phone, these new S Pen accessories are separate purchases and larger, so they don’t tuck into the Fold. But we found the size, similar to the size of the S Pen for Samsung’s tablets, to be more artist- and note-taker-friendly.",
    "If you’re worried about puncturing the delicate screen of the Z Fold 3, don’t be. Its stylus tip will retract if too much pressure is applied, and so far we haven’t had an issue when drawing and scribbling notes during our testing.",
    "The only thing we feel is missing here is S Pen support on the Cover Display. Samsung has included its screen-off memos on the larger inner display, and the idea seems like a natural fit for the Cover Display.",
    "The Samsung Galaxy Z Fold 3 cameras are good, but not groundbreaking; you’ll either be satisfied with the finely detailed photos and video, or disappointed that this Note 21 Ultra-replacement doesn’t take things much further than last year’s Z Fold 2. It depends on how much camera-phone comparison shopping you do.",
    "The camera specs mirror what we got a year ago: a 12MP f/1.8 main camera, a 12MP f/2.2 ultrawide camera, and a 12MP f/2.4 telephoto camera that’s capable of 2x optical zoom. You’ll get optical image stabilization in the telephoto and ultra-wide cameras on this new device, but little else has changed.",
    "The Z Fold 3 takes sharp and bright photos with punchy colors, as you’d expect from almost any Samsung phone in 2021; but upon closer inspection, we found that the S21 Ultra main camera from six months ago captures more detail, as does the iPhone 12 Pro Max from nearly a year ago. You might not miss it though, unless you look at the results side-by-side or have a keen eye for detail.",
    "The Z Fold 3 offers a standard 2x optical zoom, which feels limited given that over the prior 18 months Samsung has raved non-stop about its Space Zoom cameras in the S21 Ultra, Note 20 Ultra S20 Ultra. Sure, the 100x Space Zoom was overkill, but photos at 30x and 10x were usable, and the Z Fold 3, despite its top-end price, can’t manage anything close to that.",
    "The camera setup does include one space-age-like trick, though. There’s an under-display camera within the 7.6-inch main display of the Galaxy Z Fold 3, and the punch-hole is hidden by a patch of pixels when it’s not in use. It’s not completely invisible, but the crosshatch pattern does a fine job at making the screen a bit more uniform.",
    "During everyday use of the Z Fold 3, we've found that the aforementioned crosshatch pattern that partially obscures the interior display's camera disappears from sight when you aren't staring directly at it, making it far less distracting than the black pinhole cutout that would've been there otherwise.",
    "Unfortunately, this cutting-edge tech is ahead of its time. We found that the 4MP f/1.8 camera captures photos that are noticeably less sharp than those taken with the 10MP f/2.2 selfie camera that’s on the Cover Display. And that’s a shame, because the tablet-esque screen would otherwise make for a great video conferencing interface. But who wants to use the worst camera of the five onboard, which projects you as a slightly blurry figure? The idea is neat, but it’s half-baked.",
    "The Galaxy Fold 3 runs on the Qualcomm Snapdragon 888 chipset no matter what part of the world you’re located in (there’s no Samsung-made Exynos processor here, where previous Samsung flagships have featured a mix of own-brand and Qualcomm chips), and it’s plenty fast enough to handle the true app multitasking that a device like this needs to be capable of pulling off.",
    "That’s important, because Samsung has taken app pairing (where you can use two apps at the same time) and its slide-out dock to the next level by allowing you to make the app dock permanent and arrange the interface (up to three app windows open at once) pretty much any way you’d like.",
    "This is a big development for anyone who’s ever wished their phone software acted more like the software on their laptop. Being able to switch between apps without having to retreat to a home screen or slide out a dock every time feels like a game-changer for an Android phone when Android tablets have always lagged behind the iPad and iPadOS.",
    "We almost want to declare this the best Android 11 tablet you can buy (although it would also be the most expensive one by some distance).",
    "There are two configurations of the Z Fold 3: 256GB with 12GB of RAM, which will be perfectly adequate for most people, and 512GB with 12GB of RAM. If you’re doing comparative phone shopping, and take into account that Apple’s iPhone 12 Pro Max starts at 128GB, that closes the price gap a little.",
    "That combination of RAM and the powerful Snapdragon 888 chipset also makes the Galaxy Z Fold 3 a bit of a gaming powerhouse, allowing it to run graphically intensive games like PUBG, Call of Duty Mobile and Asphalt 9 Legends without breaking a sweat – even on ultra settings.",
    "While Samsung has offered phones with 1TB of storage in the past, that’s not an option here, and there’s no microSD card slot to get you any more storage beyond 512GB. Frankly, with cloud storage becoming ubiquitous, there’s little desire on the part of manufacturers to go higher than this, at least until 4K and 8K video recordings become popular.",
    "The Galaxy Z Fold 3 battery is 4,400mAh – maybe Samsung packed so much tech into the flexible body that it felt the need to chop 100mAh off of last year’s capacity, which was 4,500mAh.",
    "Power users – the intended market for this phone – will feel the loss. While we could get through most of the day using both screens, if we also enabled 5G and used the camera liberally we’d find ourselves reaching for the fast charger or a Qi wireless charger before the end of most nights.",
    "Here’s what’s complicated about that: there's no charger in the box with the Galaxy Z Fold 3, so you'll want to keep your existing charger or buy one separately. It’s a move we also saw from Apple with its iPhone 12 series, and it’s designed to cut down on electronic waste, and it probably doesn’t hurt that all of these much thinner smartphone boxes will save on shipping costs, too.",
    "First reviewed: August 2021"
  ],
  "headers": {
    "0": "Two-minute review",
    "9": "Samsung Galaxy Z Fold 3 release date and price",
    "15": "Design",
    "22": "Display",
    "27": "S Pen",
    "32": "Cameras",
    "39": "Specs, software and performance",
    "46": "Battery life",
    "49": "Don’t buy it if..."
  },
  "links": {
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Note 20 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-note-20-ultra-review",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "Galaxy Buds Pro": "https://www.techradar.com/reviews/samsung-galaxy-buds-pro",
    "Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}