{
  "source": "https://www.techradar.com/news/6-new-movies-and-tv-shows-on-netflix-amazon-prime-and-hbo-max-this-weekend-feb-12-2021",
  "title": "6 new movies and TV shows on Netflix, Amazon Prime, HBO Max and more this weekend",
  "category": "entertainment",
  "updated": "2021-02-12T17:00:34Z",
  "author": "samuel-roberts",
  "summary": "What's worth streaming this weekend",
  "article": [
    "Looking for something to stream this Valentine's Day weekend? If you're in the mood for love (er, in the emotional sense), consider checking out our list of the best romantic movies on Netflix. Otherwise, the list of new releases below should be enough to keep you occupied over the coming days.",
    "This week, we've got an eclectic mix of movies and shows to check out, with a potential Oscar winner, and at least two movies that only teenagers are likely to enjoy. Still, in these largely locked-down times who can argue with having any new content to stream? There's also a new animated series from the Bob's Burgers people that looks pretty neat.",
    "Here's what's streaming on Netflix, HBO Max, Amazon Prime Video, Hulu and Mubi this weekend.",
    "Not interested in watching a romantic movie this weekend? Consider this serious Oscar contender instead, which is the latest of Warner Bros' big movies to land on HBO Max in the US alongside a theatrical release. This film about Black Panther Party chairman Fred Hampton stars Daniel Kaluuya and LaKeith Stanfield, and explores the betrayal of Hampton by informant William O'Neal, as well as his death at the hands of Chicago law enforcement and the FBI in 1969. The critical response is wholly positive to this one – don't miss it if you've got HBO Max.",
    "Instead of just being available on VOD in the UK, which would make sense, Judas and the Black Messiah will apparently release in theaters (will they even be open?) on February 26.",
    "Now streaming on HBO Max",
    "As you might expect, Netflix has its own romantic comedy offering for Valentine's Day, with this third entry in the popular teen series starring Lana Condor and Noah Centineo now streaming. In this third entry, Lara Jean (Condor) ponders her future life in college, and how her current relationship ties into that. Critics liked the first movie, but were cool on the second – early reception to this one seems positive, but it probably helps if you're closer to the characters' ages.",
    "Now streaming on Netflix",
    "From the animation house and executive producer behind Bob's Burgers, and therefore looking pretty similar in its visual style, The Great North is Fox's newest animated series. It's about a single fisherman dad (played by Nick Offerman from Parks and Rec) living in Alaska and trying to keep it together, even though his wife walked out on the family years ago, which he's in denial about.",
    "Episodes 1 and 2 aired last month, but the full series begins this weekend. It's unclear when it releases in the UK.",
    "Now streaming on Hulu, with new episodes releasing each week",
    "It takes some real bravery to adapt the world of Thomas Harris' The Silence of the Lambs after an all-time great movie and an astonishingly good TV series in Hannibal, but here's another take, this time focused on the story of agent Clarice Starling (played here by Rebecca Breeds). Hannibal Lecter won't be appearing in this crime show, it's worth pointing out.",
    "Critical responses are pretty indifferent so far, and a UK release is unclear.",
    "Now streaming on CBS All Access, with new episodes releasing weekly",
    "There's only one time loop movie you should be watching this Valentine's Day: Palm Springs. And if not that? Edge of Tomorrow. And if not either of those? You could consider this teen romcom, which is conceptually similar to Palm Springs, where a young man stuck in a time loop finds that a young woman is also repeating the same day alongside him. Together, they'll team up to try and figure out how to break the loop, or indeed, if they even want to.",
    "Critics like this one – it has 79% positive reviews on Rotten Tomatoes at the time of writing.",
    "Now streaming on Amazon Prime Video",
    "Before directing the underrated Birds of Prey, director Cathy Yan made this acclaimed 2018 movie about a pig farmer, a home-owner, a busboy, a rich girl and an American expat whose lives come together when a host of dead pigs are seen floating down a river towards Shanghai. Specialist streamer Mubi has finally released this social satire in the US and the UK, and you can watch it now.",
    "Now streaming on Mubi"
  ],
  "headers": {
    "3": "Judas and the Black Messiah (HBO Max)",
    "6": "To All the Boys: Always and Forever (Netflix)",
    "8": "The Great North (Hulu)",
    "11": "Clarice (CBS All Access)",
    "14": "The Map of Tiny Perfect Things (Amazon Prime Video)",
    "17": "Dead Pigs (Mubi)"
  },
  "links": {
    "best romantic movies on Netflix": "https://www.techradar.com/best/best-romantic-movies-on-netflix",
    "animated series": "https://www.techradar.com/news/best-netflix-animated-series",
    "Palm Springs": "https://www.techradar.com/news/how-to-watch-palm-springs-online-stream-hulu",
    "79% positive reviews on Rotten Tomatoes": "https://www.techradar.com/news/how-to-watch-palm-springs-online-stream-hulu",
    "Birds of Prey": "https://www.techradar.com/reviews/birds-of-prey"
  }
}