{
  "source": "https://www.techradar.com/news/5-of-the-best-ps5-games-you-need-to-buy-this-black-friday",
  "title": "5 of the best PS5 games you need to buy this Black Friday",
  "category": "gaming",
  "updated": "2021-11-20T12:00:00Z",
  "author": "hamish-hector",
  "summary": "Five of the best PS5 games at an even better price",
  "article": [
    "Black Friday is less than a week away and we're already seeing some of the best PS5 games discounted as part of this year's early Black Friday sales.",
    "While it might not be November 26 quite yet you should already be on the lookout for great savings as we're at the point where most deals won't get better - and you could end up disappointed if they sell out before you can snatch them up.",
    "To lend we've rounded up five of the best PS5 games you need to keep an eye on this Black Friday, as well as some early deals that will give you a huge discount on the titles in the US and UK.",
    "Make sure you check out our Black Friday PlayStation Plus deals, Black Friday PS5 external hard drives deals and Black Friday PS4 and PS4 Pro deals pages for more excellent PlayStation discounts too.",
    "Marvel's Spider-Man Miles Morales was one of the first titles to launch on the PS5 and it's still one of the best games on the platform.",
    "In it, you play as Miles Morales as he comes into his own as the latest hero of New York while Peter Parker is away on vacation. The details are absolutely stunning and the story Insomniac weaves for us is captivating - we just wish it was longer.",
    "If you've yet to play this game on the PS5 you have to correct that mistake as soon as you possibly can - and it's a great way to while away the time as we wait for Marvel's Spider-Man 2.",
    "Ratchet & Clank: Rift Apart was released earlier this year and yet it's already discounted at Amazon this Black Friday. These early sales shouldn't scare you off as a sign the game isn't good though, as Rift Apart has been nominated for Game of the Year at this year's Game Awards.",
    "That's because the game takes full advantage of everything the PS5 has on offer - introducing immersive haptic feedback through the DualSense and fast-paced traversal across multiple dimensions thanks to the power of the console. Despite everything that's new, players will also experience the classic charm we've come to expect from Ratchet & Clank games.",
    "Ghost of Tsushima was the perfect game to sunset the PS4 and only narrowly lost out to The Last of Us Part 2 for 2020's Game of the Year at the Game Awards.",
    "Its dedication to its art style and the polished yet varied gameplay combined into a near-perfect title. The PS5 Director's Cut elevated the already great game even further thanks to graphical upgrades and new content that give players of the original a reason to return.",
    "While the $70 / £70 price tag was a tough one to swallow, Amazon's Balck Friday deals have brought the game down to a much more reasonable price - giving you a more affordable way to enjoy one of PlayStation's best exclusives.",
    "Plenty of games and films have played with the idea of time loops, but very few do it better than Deathloop and that's probably why it's one of this year's Game of the Year contenders.",
    "You play as Colt, one of the few people to realize the day is repeating and you want out - the only way to do that though is to kill those in charge. You have to find a way to eradicate everyone in just one day or all your progress resets to square one - how hard can that be?",
    "If you're the sort of player that enjoyed finding all of the secrets and hidden ways to end your target's life in the Hitman World of Assignation trilogy then Deathloop is the perfect way to scratch that itch.",
    "Demon's Souls is a brutally punishing affair, but every time you get knocked down it just gives you more of a drive to pick yourself back up and go and enact your revenge and whatever killed you last.",
    "This remaster of the classic game is perfect choice for fans of the Dark Souls games thanks to its stunning next-gen visuals that add an extra layer of immersion to its already atmospheric locations.",
    "No matter where you live, you'll find all the lowest prices for PS5 games from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "1. Marvel's Spider-Man: Miles Morales",
    "7": "2. Ratchet & Clank: Rift Apart",
    "9": "3. Ghost of Tsushima Director's Cut",
    "12": "4. Deathloop",
    "15": "5. Demon Souls",
    "17": "More PS5 game deals",
    "18": "More Black Friday deals (UK)"
  },
  "links": {
    "best PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "early Black Friday sales": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Black Friday PlayStation Plus deals": "https://www.techradar.com/black-friday/black-friday-ps-plus-deals",
    "Black Friday PS5 external hard drives deals": "https://www.techradar.com/news/ps5-external-hard-drive-black-friday-deals",
    "Black Friday PS4 and PS4 Pro deals": "https://www.techradar.com/cyber-monday/ps4-and-ps4-pro-cyber-monday-deals-bundles-2020",
    "Marvel's Spider-Man Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Marvel's Spider-Man 2": "https://www.techradar.com/news/marvels-spider-man-2",
    "Game Awards": "https://www.techradar.com/news/game-awards-2021-the-nominees-and-what-we-expect-to-see",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "The Last of Us Part 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "Hitman World of Assignation trilogy": "https://www.techradar.com/reviews/hitman-3"
  }
}