{
  "source": "https://www.techradar.com/news/how-to-watch-the-luminaries-online-free-stream-anywhere",
  "title": "How to watch The Luminaries online: stream the entire miniseries from anywhere now",
  "category": "computing",
  "updated": "2021-02-14T23:59:02Z",
  "author": "aatif-sulleyman",
  "summary": "Eleanor Catton's award-winning novel inspires this epic show",
  "article": [
    "Based on Eleanor Catton's epic, complex Man Booker Prize-winning novel of the same name, The Luminaries is an other-worldly murder mystery love story that follows Anna Wetherell (Eve Hewson) as she voyages alone to New Zealand's South Island in search of a new life during the 1860s West Coast Gold Rush, only to be dragged into a vortex of love, greed and fickle fortune. Read on as we explain how to watch The Luminaries online and stream every episode, no matter where you are in the world right now.",
    "At the end of the journey Anna meets Emery Staines (Himesh Patel), who's heading to New Zealand to dig for gold, and they forge an instant, transformative connection, one that they're unable to explain but are overwhelmed by.",
    "However, they're almost instantly torn apart by fate, which itself is ably assisted by the scheming, domineering Lydia Wells (Eva Green), a one-woman force of nature who runs The House Of Many Wishes, a fortune parlor that has become a Mecca for gold-diggers.",
    "An opportunist and an entrepreneur, Lydia knows exactly how much power she wields over the gold-seekers, and blinded by greed and her secret love for ex-convict Francis Carver (Marton Csokas), she's grown accustomed to getting whatever she wants whenever she wants it.",
    "But, not being driven by fame and fortune, Anna alone has no desire to be favored by Lydia, who you cross at your own peril. Follow our guide below as we explain how to watch The Luminaries online and stream every episode of the miniseries from all over the world - including absolutely FREE for anyone located in the UK on iPlayer.",
    "For anyone abroad right now wanting to watch The Luminaries, you’ll likely be unable to watch the miniseries due to annoying regional restrictions.",
    "Luckily, there’s an easy solution. Downloading a VPN will allow you to stream The Luminaries online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch The Luminaries from abroad"
  ],
  "headers": {
    "5": "How to watch The Luminaries online from outside your country",
    "8": "How to watch The Luminaries: Canada release date"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}