{
  "source": "https://www.techradar.com/news/bill-gates-isnt-a-fan-of-bitcoin",
  "title": "Bill Gates isn't a fan of Bitcoin",
  "category": "computing",
  "updated": "2021-02-26T10:58:41Z",
  "author": "mayank-sharma",
  "summary": "Prefers to invest in companies “that make products”",
  "article": [
    "Unlike several of his 'big tech' contemporaries, Microsoft founder Bill Gates remains immune to the charms of Bitcoin.",
    "In a conversation with Andrew Sorkin on the social network Clubhouse, Gates, one of the oldest tech billionaires, revealed that he hasn’t invested in the cryptocurrency that’s caught the fancy of the world.",
    "Despite Bitcoin’s recent record-setting valuations, that’s made some of his younger peers, particularly Tesla’s CEO Elon Musk, quite a chunk of change, Gates continues to be immune to the charms of the digital currency.",
    "Gates’ disdain for Bitcoin isn’t new. In an earlier interview with Bloomberg, he advised people to be cautious putting their savings into Bitcoin.",
    "\"Elon has tons of money and he's very sophisticated, so I don't worry that his Bitcoin will sort of randomly go up or down,\" Gates said, adding, \"I do think people get bought into these manias, who may not have as much money to spare, so I'm not bullish on Bitcoin, and my general thought would be that, if you have less money than Elon, you should probably watch out.\"",
    "When it comes to his money, Gates told Sorkin in his Clubhouse chat, that he prefers to invest in companies \"that make products\", and went on to cite malaria and measles vaccines as examples.",
    "The Bill & Melinda Gates Foundation has already gifted more than $2.9 billion in grants to combat the infectious disease particularly in Sub-Saharan Africa and South Asia.",
    "Unlike Tesla's Musk and Jack Dorsey, CEO of Twitter and Square, who are vocal Bitcoin advocates, Gates, along with Berkshire Hathaway’s Warren Buffett are skeptical of the cryptocurrency.",
    "Via: BBC"
  ],
  "headers": {
    "3": "Real causes"
  },
  "links": {
    "Microsoft": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Bitcoin": "https://www.techradar.com/news/what-is-bitcoin",
    "social network": "https://www.techradar.com/best/best-social-media-management-tools",
    "Elon Musk": "https://www.techradar.com/news/tesla-has-already-made-dollar1bn-profit-on-its-bitcoin-investment",
    "said": "https://www.bloomberg.com/news/videos/2021-02-23/bill-gates-on-misinformation-bitcoin-pandemic-video",
    "Jack Dorsey": "https://www.techradar.com/news/square-follows-tesla-by-going-big-on-bitcoin",
    "Warren Buffett": "https://www.forbes.com/sites/zackfriedman/2021/01/03/bitcoin-hit-34000-but-heres-why-warren-buffett-will-never-own-it/?sh=2f1725ce42bb",
    "BBC": "https://www.bbc.com/news/technology-56195869"
  }
}