{
  "source": "https://www.techradar.com/news/box-cloud-and-data-are-critical-so-its-time-to-get-on-board",
  "title": "Box: Cloud and data are critical, so it's time to get on board",
  "category": "computing",
  "updated": "2021-07-14T12:48:12Z",
  "author": "mike-moore",
  "summary": "Box sees great opportunity in EMEA, new President says",
  "article": [
    "Businesses across Europe have had to make a lot of alterations to the way they work and collaborate over the past 18 months, with demand for online services higher than ever.",
    "Box has been able to benefit from this surge in demand with its comprehensive suite of tools and services, having branched out from its traditional cloud computing and cloud storage work into content management as well.",
    "So it would appear that Sébastien Marotte, the company's new EMEA President, has chosen an excellent time to join. TechRadar Pro spoke to Marotte about how he is settling in to the new role, as well as his plans for Box across the region.",
    "Marotte joined Box after spending the last ten years at Google, where he was responsible for growing the enterprise business from scratch.",
    "But Marotte says that he was drawn to Box due to the company's willingness and ability to move from traditional storage towards content management - what he calls, “moving to something really different but that is key and at the heart of every business.\"",
    "“I come from a world where during the last five years, I was pushing the message that cloud and data are critical...and extending that to content was very comforting to me,\" he notes.",
    "“I really care more about offering solutions that are solving business problems rather than selling technology and features,\" he adds. \"I got really convinced that companies need a single platform to host all their content, connected to their IT system, with the right level of security….and Box is bringing that to the table.\"",
    "Marotte highlights how Box has \"serious ambition\" when it comes to EMEA, with the company recently adding a number of high-profile customers to its roster, such as BT.",
    "He notes there are plans to double-down on investment across the region, as well as continuing to support Box's already strong sales strategy and partner ecosystem.",
    "With its stable of enterprise offerings, Box should appeal to many businesses that have been forced to pivot or evolve the way they work, especially with hybrid working becoming more popular across the world.",
    "“It’s a great opportunity for us,\" Marotte notes, \"the new way of working, which will very much be a hybrid model, will require all employees to be equipped with the right tools to access the content they need to run their business.\"",
    "Box is well equipped to help address these needs, having expanded into the cloud collaboration market several years ago, with Mariotte adding that bringing all content within a single platform allows a business to make sure its data is not only accessible, but securely accessible from any device at any time of the day.",
    "He says that the growth of SaaS applications, especially with remote working, can provide businesses with a serious security challenge to overcome, as well as layering on unnecessary technological debt, but notes that “if we can find a way to break silos and seriously secure data, it’s a serious opportunity for Box\".",
    "Enabling integrated workflows can help businesses of all sizes work smarter, as well as harder, Marotte concludes, stating his aim to have Box as a key partner for companies across the EMEA region as they embrace a new way of working",
    "“I’ve no doubt that we can dramatically improve efficiency and productivity,\" he added."
  ],
  "headers": {
    "7": "Serious ambition"
  },
  "links": {
    "Box": "https://www.techradar.com/reviews/box",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}