{
  "source": "https://www.techradar.com/news/xbox-series-x-is-seeing-phenomenal-growth-in-japan-no-seriously",
  "title": "Xbox Series X is seeing ‘phenomenal growth’ in Japan – no, seriously",
  "category": "gaming",
  "updated": "2021-06-18T14:52:47Z",
  "author": "adam-vjestica",
  "summary": "Maybe fourth time’s the charm for Xbox in Japan",
  "article": [
    "It’s early days, but it looks like the Xbox Series X and Xbox Series S might be resonating with Japanese consumers – that’s according to Xbox’s head of the Asia region, Jeremy Hinton, at least.",
    "Xbox hasn’t had much luck in Japan, and is often on the receiving end of some pretty embarrassing sales numbers and a lack of support from Japanese developers. That’s apparently changed, though, as Hinton has said the region is now “Xbox’s fastest growing market worldwide” and that stock is often selling out “within minutes”.",
    "Speaking to IGN Japan, Hinton said they’ve “seen phenomenal growth” in the last year, with a high percentage of sales coming from Japanese consumers who have previously shunned Xbox consoles in the past.",
    "“There is no doubt that the demand is absolutely growing in Japan, and I see that in the data that I can see, we have a really high percentage of consoles being bought by people who have never owned Xbox consoles in the past,” Hinton said.",
    "Hinton also revealed that those who had picked up an Xbox console in the past are now upgrading to the Series X and Series S, which will be encouraging news for Microsoft.",
    "“And the next segment of consumers buying consoles are upgrading from Xbox 360, which was quite a successful generation for us in Japan,” Hinton said. “So we're seeing strong leading indicators in terms of us reaching new people. Demand is certainly higher, we see stock sell out within minutes.”",
    "It looks like it’s the more affordable Xbox Series S that is resonating with Japanese consumers most, however, with Hinton saying that the svelte white box has seen stronger demand compared to the Xbox Series X. It’s led to more development kits being sent to independent developers in Japan, and more Japanese content in the Xbox ecosystem.",
    "\"We've got more Japanese-developed content in our ecosystem now than we've had at any point within our history... I think we have more development kits with independent developers in Japan than we've ever had in our history before, and there's a lot of talent and a growing independent scene in Japan.\"",
    "Xbox’s mission to be successful in Japan has often seemed like a fruitless battle, especially when compared to how dominant Sony and Nintendo have been. The original Xbox was largely ignored, along with the Xbox One. The company saw greater success with the Xbox 360, however, thanks to a number of high profile Japanese developed exclusives.",
    "Even though it’s a low bar to surpass, Microsoft will be pleased that its new consoles are at least attracting some interest in Japan, and it’s been working hard to encourage more Japanese talent to develop for Xbox. The Yakuza games, Dragon Quest, Final Fantasy and upcoming games like Scarlett Nexus show that Xbox is on the right path when it comes to Japanese dev support - now it needs to keep building on that momentum.",
    "Via IGN"
  ],
  "headers": {
    "8": "Big in Japan"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "IGN Japan": "https://jp.ign.com/xbox-series-x/52649/interview/xbox",
    "Xbox 360": "https://www.techradar.com/news/gaming/consoles/how-the-xbox-360-won-the-console-war-1196990",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Yakuza games": "https://www.techradar.com/news/yakuza-games-in-order-by-release-date-in-chronological-order-and-ranked",
    "IGN": "https://www.ign.com/articles/xbox-japan-fastest-growing-market"
  }
}