{
  "source": "https://www.techradar.com/news/hidden-hi-fi-why-are-wireless-speakers-being-disguised-as-pieces-of-furniture",
  "title": "Hidden hi-fi: why are wireless speakers being disguised as pieces of furniture?",
  "category": "audio-visual",
  "updated": "2021-05-30T09:00:53Z",
  "author": "olivia-tambini",
  "summary": "Sonos, Bang & Olufsen, and more are building speakers that blend in",
  "article": [
    "The world of wireless speakers is changing. While barely indistinguishable minimalist designs are still very much in vogue – think of the Amazon Echo and the Apple HomePod mini – we’re now seeing an increasing number of speakers with innovative designs that allow them to double up as home furnishings, and even pieces of actual furniture.",
    "Recently, audio giants including Sonos and Bang & Olufsen have expanded their lineups to include such speakers, producing everything from speakers disguised as lamps and books, to speaker arrays that can be built directly into your ceiling.",
    "The desire to make hi-fi systems more homely isn’t a modern phenomenon, however. In fact, it’s a trend that can be traced all the way back to the 1920s – and contemporary brands are mining the past for solutions that work for the modern music lover.",
    "Before televisions dominated our living rooms, the must-have home entertainment centerpiece was the console radio. These large, expensive devices were housed in ornate wooden casings or cabinets that the family would gather around to listen – and by the 1930s, they were seen as an aspirational purchase for middle-class families. Some even included built-in phonographs, and their art deco designs made them just as aesthetically pleasing as they were sonically.",
    "Fast-forward to the 1950s, and the one-piece hi-fi system – and this is where interior design and audio technology really came together to create something truly spectacular. Like an updated version of the console radio, these products comprised stereo speakers, an amplifier, a turntable, and radio, all neatly tucked away in a wooden cabinet.",
    "Some of these systems even included secret drinks cabinets and television sets – the ultimate in mid-century luxury. For a real thrill, check out the Koronette Stereo; this 60s German console came with a bar and a fireplace built-in (yes, really).",
    "As turntables gave way to cassette players, and cassette players gave way to CD players, the home hi-fi system became altogether more functional. And once smartphones, MP3 players, and music streaming entered the picture, the fashion for making audio devices that were also lusted-after pieces of furniture was all but over – and only the most dedicated audiophiles would consider buying a multi-speaker setup, with all its accompanying cables, stands, and clutter.",
    "It’s not just audio advances that caused retro console radios, turntables, and all-in-one systems to decline in popularity. In the UK, house sizes have plummeted to levels not seen since before the 1930s, while in the US, the number of renters is continuing on an upward trend that started in the mid-70s.",
    "Many of us simply don’t have the space for a full hi-fi system, with precious floor space being taken up by devices we deem more important – our TVs, for example. And, with many of us moving frequently between rental homes, expensive, heavy pieces of furniture aren’t the signifiers of middle-class prosperity they once were. The fact that IKEA is the fourth most valuable retailer in the world tells you all you need to know about our priorities when it comes to home furnishing.",
    "And, with portable audio getting better all the time, why would you want the expense and heft of a full hi-fi system in your home? These days, you can carry pretty much every song you can think of on a device in your pocket, and listen to them on true wireless earbuds that can fit in your palm.",
    "Nevertheless, there’s a growing appreciation for high-quality sound – just look at the increasing number of streaming services that offer hi-res audio – and it’s not just the very wealthy or dedicated audiophiles leading the charge. That means popular consumer audio brands like Sonos have had to adapt to the needs of music lovers today.",
    "As Sara Morris, principal product manager at Sonos told us, “there are areas in the home where a speaker doesn’t fit”, whether that’s because of a lack of space, power, or because “technology isn’t the focus, like in bedrooms”.",
    "“By building speakers into home furnishings we can overcome both of these challenges and let people decorate their home with both the objects and the sound”, she explains, which is something the company has done in tandem with the aforementioned home furnishings store, IKEA, producing the Symfonisk bookshelf and lamp speakers.",
    "Morris says the response to these unusual hidden speakers has been “overwhelmingly positive”. And there may be more Symfonisk speakers on the way soon, including one that takes the form of a piece of wall art, if recent leaks are to be believed.",
    "Sonos has even gone as far as integrating audio devices into the home itself; its Architectural range, produced in collaboration with architectural speaker specialists Sonance includes ceiling speakers that “disappear into any space”. These speakers offer all the modern conveniences you’d expect from Sonos, as Morris explains: “When these speakers are connected to Sonos Amp, the Amp will automatically detect them, and adjust the sound to be best for that speaker”.",
    "Sonos isn’t the only consumer audio company that’s looking at how it can seamlessly integrate speakers into the home. Bang & Olufsen recently released a wireless speaker that looks like a book, allowing you to place it unobtrusively on a shelf, as well as a modular speaker that can be wall-mounted to save precious space. Meanwhile, JLA has created high-fidelity downwards-firing speakers that double up as stylish coffee tables, while Transparent’s Acoustic Sculpture blends art and audio in a way we’ve never seen before.",
    "So there’s clearly a desire for great-sounding speakers that can serve a double function, either as design focal points or as practical pieces of furniture. But does that mean the grandiose hi-fi systems of the past are gone?",
    "Morris doesn’t think so. “I think there will always be a design appreciation for traditional-looking hi-fi systems – it really comes down to personal preferences,” she says.",
    "“Our system and products are designed to fit in with our customers’ lives, not the other way around, and you should be able to play what you want, when you want, however and wherever you want.”",
    "The fact of the matter is, the beautifully adorned mid-century hi-fi cabinets that came complete with built-in bars just don’t fit into the average home of today. As Morris tells us, “traditional hi-fi furniture is based around the perfect listening environment, which simply doesn’t exist in most people’s lives today”.",
    "“But taking that into consideration, and knowing there are barriers for some customers in bringing speakers into their spaces, we can overcome those obstacles by building them into furniture.”",
    "You can, of course, still buy complex audio setups, and many audiophiles still do so. And many of us are equally happy with anonymous-looking smart speakers that blend into the background. But, for those looking for a solution that combines the best of both worlds, blending high-end audio performance with the latest in interior-design chic, speakers that are integrated into our furniture feels like the home entertainment trend of the future."
  ],
  "headers": {
    "3": "The console radio",
    "7": "The quest for space",
    "10": "The Sonos solution",
    "16": "Is the hi-fi centerpiece dead?"
  },
  "links": {
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Apple HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini",
    "turntable": "https://www.techradar.com/news/best-turntables",
    "smartphones": "https://www.techradar.com/news/best-phone",
    "MP3 players": "https://www.techradar.com/news/best-mp3-players-techradars-guide-to-the-best-portable-music-players",
    "since before the 1930s": "https://www.which.co.uk/news/2018/04/shrinking-homes-the-average-british-house-20-smaller-than-in-1970s/",
    "started in the mid-70s": "https://www.statista.com/statistics/187577/housing-units-occupied-by-renter-in-the-us-since-1975/#:~:text=In%202020%2C%20there%20were%20approximately,term%20upward%20swing%20since%201975.",
    "fourth most valuable retailer": "https://www.statista.com/topics/1961/ikea/",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Symfonisk bookshelf": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-bookshelf-speaker",
    "lamp speakers": "https://www.techradar.com/reviews/sonos-ikea-symfonisk-lamp-speaker",
    "if recent leaks": "https://www.techradar.com/news/sonos-and-ikeas-next-collab-could-integrate-speakers-into-wall-art",
    "Sonance": "https://www.sonance.com/company",
    "a wireless speaker that looks like a book": "https://www.techradar.com/news/bang-and-olufsens-new-wireless-speaker-looks-just-like-a-book",
    "a modular speaker that can be wall-mounted": "https://www.techradar.com/news/bandos-new-modular-wireless-speaker-might-be-the-most-beautiful-ever-made",
    "JLA": "https://www.jla.design/"
  }
}