{
  "source": "https://www.techradar.com/news/what-my-smartwatch-taught-me-about-my-anxiety",
  "title": "What my smartwatch taught me about my anxiety",
  "category": "fitness",
  "updated": "2021-07-31T09:30:00.235Z",
  "author": "josephine-watson",
  "summary": "Sometimes, tech knows best",
  "article": [
    "I’ve struggled with anxiety for as long as I can remember, specifically with social anxiety and panic disorder, and more recently, thanks to the pandemic, agoraphobia.",
    "Now, I’ve arrived at a good place when it comes to recognizing and managing my condition, but that certainly doesn’t stop it from impacting my daily life.",
    "I’m far from alone in this – a 2016 report from the World Health Organization found that between 1990 and 2013, the number of people worldwide suffering from depression and/or anxiety increased by nearly 50%, from 416 million to 615 million.",
    "Of course, some of this is down to population growth and greater awareness of mental health issues, but there’s no doubt that now, more than ever, anxiety is on the rise.",
    "For better or worse, this is naturally a market that consumer tech companies want to tap into, and which many already focus on – from Apple’s upcoming mindfulness revamp in the watchOS 8 update to the addition of stress and sleep tracking in the Samsung Galaxy Watch 3.",
    "For myself and many others, a telltale sign of anxiety is increased heart rate and heart palpitations, and on an average day I’ll experience two or three periods of this at varying degrees of severity.",
    "Most smartwatches include a heart rate monitor, and this can be used for more than simply giving you feedback on your performance when you’re working out; and wearables are increasingly coming with stress level monitoring too.",
    "I’ve been using the Garmin Forerunner 45 for a few months now to help me monitor my heart rate and stress levels, and detect any patterns that emerge. Here’s what I’ve learned so far, and how it’s already changed the way I operate day to day.",
    "Anxiety is the body’s natural response to a perceived threat, but with an anxiety disorder, these feelings are heightened, and can be triggered by a wide variety of stimulants which can sometimes be irrational.",
    "The knock-on effect of heightened anxiety is beyond mental fretting. Physically, your autonomic nervous system (ANS) – also known as your fight or flight instinct – is triggered, which can lead to physical reactions in the heart, lungs, digestive system, and/or muscles.",
    "It’s only been more recently that I’ve started to take these symptoms seriously as a way to both pre-empt upcoming panic attacks and identify stressors I could better avoid.",
    "For example, one of the first things I noticed about my heart rate was how rapidly and regularly it would increase before a meeting, especially if I was headed to a session more than 30 minutes long.",
    "By recognizing that my ‘10 minutes to go’ meeting notification triggered an irrational anxious response, I’ve been able to create a routine that takes me away from my desk in the period prior to the meeting to make a drink, freshen up and, if I feel the need, arrange my thoughts on paper. It’s not always possible, but so far this ritual has decreased the regularity of pre-meeting heart rate spikes significantly.",
    "While beats per minute (BPM) is a relatively straightforward metric to interpret – although not always accurate in smartwatches –, stress indicators can be a little harder to unpack.",
    "Some smartwatch producers vary in how they define stress level monitoring, but most smartwatches use heart rate variability as an indirect indicator of how the body is doing.",
    "My Forerunner 45 and a number of other smartwatches use this metric to generate a ‘stress score’, which is presented as a number on a scale running from 0-100.",
    "Again, there’s a margin of error here – positive excitement can similarly trigger increased stress levels, so I went into my next experiment with this in mind after doing some research.",
    "Naturally, throughout the day my stress levels would gradually increase, but there were some interesting peaks and troughs. For example, the last hour of my working day saw a significant spike in my stress levels, which lasted all the way through to around 7pm.",
    "This is usually around the time I start to look back on what I’ve done in a day, and as someone who struggles with imposter syndrome, I tend to get stressed about whether or not I’ve accomplished enough.",
    "Seeing how the increase in my stress levels carried over beyond working hours and into my personal time made me realize just how much of an impact this particular anxiety was having on my day.",
    "So, instead of spending this time reflecting, I now use the last part of my day to clear out small tasks and then start planning the next day’s workload.",
    "Small though these changes may be, I’ve noticed an overall improvement in my health and wellbeing as a result. My heart rate is now much more balanced throughout the day, and as soon as I notice my stress levels starting to increase, I know to take a step back and breathe, before the anxiety really hits.",
    "Smartwatches aren’t a cure-all for anxiety, however. In fact, they can sometimes add to stress levels. Increasingly, reports are showing that BPM and stress level tracking can actually serve to heighten anxiety for many people.",
    "A 2020 study from the University of Copenhagen investigating the clinical use of activity trackers in heart patients found that, while their use drove overall lifestyle improvements and a better understanding of their illnesses, anxiety levels also increased.",
    "From increased paranoia around small, potentially harmless bodily functions and changes to self-diagnosis from unrelated data that hasn’t been filtered through the medical lens, there’s potential for smartwatches to do more harm than good.",
    "This phenomenon is also recognized in studies of sleep, too, with orthosomnia – a medical term for an unhealthy obsession with getting perfect sleep – causing some smartwatch users to become addicted to sleep tracking.",
    "Following heart rate and stress level patterns are also by no means a way to handle all types of anxiety, or every instance of it. There were several occasions when I could feel my body gearing up its fight or flight responses while my smartwatch maintained my levels were normal.",
    "Like most self-managed mental health strategies and practices, using tech to monitor heart rate and stress levels is something worth trying, but with a pinch of salt. While my experience with using a smartwatch for anxiety management equipped me with some new information on certain triggers, in no way did it offer sufficient support, or enough information to tear me away from my healthy relationship with doctors and therapists.",
    "So while wearables, and the health data they provide, can be useful tools for many people, they’re just a small part of a more comprehensive approach to managing and improving our wellbeing."
  ],
  "headers": {
    "8": "Heart rate and anxiety",
    "22": "Too much of a good thing?"
  },
  "links": {
    "increased by nearly 50%, from 416 million to 615 million": "https://www.who.int/news/item/13-04-2016-investing-in-treatment-for-depression-and-anxiety-leads-to-fourfold-return",
    "watchOS 8 update": "https://www.techradar.com/news/watchos-8-update",
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Garmin Forerunner 45": "https://www.techradar.com/reviews/garmin-forerunner-45",
    "heart rate variability": "https://www.livescience.com/49452-trackers-measure-stress-heart-rate-variability.html",
    "2020 study": "https://www.jmir.org/2020/7/e15873"
  }
}