{
  "source": "https://www.techradar.com/news/right-now-you-can-get-an-amazing-samsung-gaming-monitor-for-just-dollar169",
  "title": "Right now you can get an amazing Samsung Gaming Monitor for just $169",
  "category": "computing",
  "updated": "2021-10-27T22:04:54Z",
  "author": "jackie-thomas",
  "summary": "Black Friday is coming early for PC gamers",
  "article": [
    "While Black Friday 2021 isn't until November 26, we're already starting to see some pretty awesome deals start to come in, and right now we've got a big one if you're looking for a new gaming monitor.",
    "At Amazon, you can get the Samsung CRG5 gaming monitor for just $169, which knocks a whopping $110 off of its list price. That's a huge 39% savings and makes this premium monitor a budget item.",
    "While the CRG5 does only have a 1,920 x 1,080 resolution - which some may see as outdated by today's standards - it balances it with a curved display and a 144Hz refresh rate. Both of these combine to make playing the best PC games on this monitor both immersive and competitive.",
    "And the best part about getting a 1080p monitor these days is that you won't need to spend thousands of dollars on a PC to run it to its full potential. Affordable (by todays standards) GPUs like the AMD Radeon RX 6600 and Nvidia GeForce RTX 3060 are custom-built to play games at this resolution, and should have no problem hitting the max 144 fps here, especially in games like Paladins or League of Legends.",
    "If all that wasn't enough, the 3,000:1 contrast ratio will make all of your games look just as colorful as they are fast on this display.",
    "No matter where you live, you'll find all the lowest prices for the Samsung CRG 5 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "More Samsung CRG5 deals"
  },
  "links": {
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "gaming monitor": "https://www.techradar.com/news/best-gaming-monitor"
  }
}