{
  "source": "https://www.techradar.com/news/new-halo-infinite-artwork-offers-clues-to-single-player-campaign-story",
  "title": "New Halo Infinite campaign artwork offers clues to single player story",
  "category": "gaming",
  "updated": "2021-06-09T12:54:56Z",
  "author": "rhys-wood",
  "summary": "Calendar artwork gives fans a sneak peek",
  "article": [
    "Some never-before-seen Halo Infinite concept art has been spotted in a 2022 physical calendar for the upcoming Xbox Series X title, and the included images could be giving fans a sneak peek at what to expect when we dive into the game’s campaign when it releases.",
    "Spotted by Twitter user Shinobi602, the concept art featured in the Halo Infinite 2022 calendar is, predictably, nothing short of gorgeous. It’s all typical Halo fare, with shots including Master Chief battling a horde of Brutes, as well as artwork depicting Installation 07 (also known as Zeta Halo) which serves as the setting of Halo Infinite.",
    "Arguably the most curious piece of artwork, though, shows a convoy of Brute Choppers, the iconic enemy vehicle that debuted in Halo 3. This likely hints that control of multiple factions’ vehicles will remain present in Halo Infinite, which would be a boon for the game’s much more open-ended design.",
    "Despite not even being close to launch yet (let alone having a concrete release date), the merch train for Halo Infinite has already left the station. Long sleeve tees and jackets are already available to buy on Microsoft’s official store for the game. There was even a limited edition flavor of Pringles - Moa Burger - made to promote the upcoming Xbox shooter back in March.",
    "The promotional side of things have been rather mixed for Halo Infinite so far. Last year’s debut gameplay showcase likely didn’t go as developer 343 Industries had hoped, demonstrating a graphical quality well below what was expected of the then-to-be-released Xbox Series X. The feedback received from that demo pressured 343 to delay the game.",
    "Despite this, it’s highly likely that we’ll see Halo Infinite make a return at Xbox’s E3 2021 presentation, but whether or not it will be a triumphant one remains to be seen. Hopefully 343 Industries were able to take the feedback to heart, and can deliver a Halo experience worthy of Bungie’s original run with the iconic series."
  ],
  "headers": {
    "3": "Infinite merch"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "2022 physical calendar": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_6363826947015615000&xs=1&url=https%3A%2F%2Fwww.calendars.com%2Fshop%2Fhalo-2022-wall-calendar%2F202200003545%3FSSAID%3D389818%26utm_source%3Dsas%26utm_medium%3Daffiliate_program%26utm_content%3D124220%26utm_campaign%3D389818%26sscid%3D61k5_ai6wp&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnew-halo-infinite-artwork-offers-clues-to-single-player-campaign-story",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Microsoft’s official store": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1187431892984370200&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fstore%2Fb%2Fhalo-gear",
    "limited edition flavor of Pringles": "https://twitter.com/Halo/status/1367254382560112640?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1367254382560112640%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fscreenrant.com%2Fhalo-infinite-reach-moa-burger-pringles%2F"
  }
}