{
  "source": "https://www.techradar.com/news/android-12-feature-could-make-samsung-galaxy-s21-ultra-sized-phones-easier-to-use",
  "title": "Android 12 feature could make Samsung Galaxy S21 Ultra-sized phones easier to use",
  "category": "phones",
  "updated": "2021-02-16T11:46:12Z",
  "author": "tom-bedford",
  "summary": "One-handed mode",
  "article": [
    "Since smartphones seem to have pretty huge displays, with the Samsung Galaxy S21 Ultra and Xiaomi Mi 11 both hitting 6.8 inches diagonally, some people with smaller hands might find it hard to properly reach all the extremities of the screen. A new feature for Android 12 might help fix that.",
    "Android 12, the 2021 version of the yearly Android update which comes to most non-iPhone smartphones, seems like it could come with a togglable one-handed mode to make the phone easier to use without employing all ten of your digits. This comes from XDA Developers, which found reference to the feature in the Android Open-Source Project (AOSP).",
    "Android is open-source software, meaning anyone can borrow it and tweak it to suit their needs, and the AOSP is the repository for the source code as it appears in phones. The presence of the one-handed mode reference in the AOSP likely means the feature will come to Android 12, though it's certainly not confirmed.",
    "Android is an open-source software, and many smartphone companies edit the source quite a bit before putting it onto smartphones. Some brands, like Samsung and Sony, in fact already have their own one-handed modes.",
    "For the most part, these modes shrink the visible display down to around two-thirds or half the size it was before, and move the usable area to the bottom-left or bottom-right of the screen, so it's easier to reach with one hand. Typically, the rest of the screen that isn't in use is turned off when this happens.",
    "That's not necessarily the only way to implement a one-handed mode, though, and it's possible in Android 12 we could see another way. Possibilities include shifting the key controls to one side, to make them easy to reach, or an on-screen joystick to control the touch.",
    "Either way, a one-handed mode would allow people with smaller hands be better able to use huge phones. It'll allow them to still be able to enjoy the large display real estate when it matters, like for streaming TV shows or playing games.",
    "The Android 12 update is expected to start rolling out to phones near the end of the year, but before that we should see Google formally announce the software update in the middle of the year."
  ],
  "headers": {
    "3": "How could this Android 12 feature work?"
  },
  "links": {
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "XDA Developers": "https://www.xda-developers.com/android-12-one-handed-mode-leak/"
  }
}