{
  "source": "https://www.techradar.com/news/this-weekends-gaming-laptop-deals-feature-hefty-dollar300-price-cuts-on-razer-asus-dell-and-more",
  "title": "This weekend's gaming laptop deals feature hefty $300 price cuts on Razer, Asus, Dell and more",
  "category": "computing",
  "updated": "2021-02-20T18:20:51Z",
  "author": "alex-whitelock",
  "summary": "Here are three great options to check out",
  "article": [
    "If you're looking to get your game on for less, we've spotted three great gaming laptop deals that we think are solid buys this weekend. They aren't super cheap like some of our previous recommendations, but we think they're every bit worth the money.",
    "Starting with this awesome Dell G5 15 SE at the official store for $799.99 (was $1,159.99), for example, you'll be hard-pressed to find a better value machine at this price point. Being a 'special edition' Dell G5 affords this machine exclusively AMD components, and, as you'd expect, that means exceptional performance for the buck. A Ryzen 7 processor, Radeon 5600M graphics card, 16GB of RAM, and a 256GB SSD mean this one's a great buy if you're looking for good 1080p performance on a relatively low budget.",
    "If you were looking to spend a bit more, however, we'd recommend checking out this Asus ROG Strix G15 for $999 at Microsoft. Not only has this machine got an RTX 2060 graphics card, but it's also got an Intel Core i7-10870H, 16GB of RAM, and a 512GB SSD, making it really stand out at this price.",
    "Our final choice is this stunning 2020 Razer Blade 15 Base for $1,484.90 (was $1,799.99) at Amazon, which, while not being the best value on paper, is a hefty price cut on a really premium all-aluminum gaming laptop. Of course, being last year's model it's not quite the shiniest machine on the market anymore, but the RTX 2060, Intel Core i7-10750H, 16GB of RAM, and 512GB SSD means it'll still run all the latest games with suitable aplomb.",
    "Outside the US? Check out the best gaming laptop deals near you just below.",
    "For cheaper alternatives, see our main cheap gaming laptop deals page for plenty of great low-cost options. You could also check out our Razer Blade gaming laptop deals page if you're wanting to read more about these awesome premium machines."
  ],
  "headers": {
    "5": "Gaming laptop deals"
  },
  "links": {
    "for $799.99 (was $1,159.99)": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-2302560776175354000/https://deals.dell.com/en-us/productdetail/7j89",
    "for $999": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-6380046527804860000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fp%2Fasus-rog-strix-g15-gl-g512lv-uh76-laptop%2F91zvwftt94ws",
    "$1,484.90 (was": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRazer-Blade-Base-Gaming-Laptop%2Fdp%2FB086MGYM49%2Fr%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1138564263506184800-20",
    "$1,799.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FRazer-Blade-Base-Gaming-Laptop%2Fdp%2FB086MGYM49%2Fr%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1273376153286016800-20",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "Razer Blade gaming laptop deals": "https://www.techradar.com/deals/razer-blade-laptop-deals-sales-price"
  }
}