{
  "source": "https://www.techradar.com/news/google-play-store-will-soon-show-you-how-much-apps-know-about-you",
  "title": "Google Play Store will soon show you how much apps know about you",
  "category": "phones",
  "updated": "2021-10-19T23:00:36Z",
  "author": "anthony-spadafora",
  "summary": "Data safety section will appear on Play Store listings early next year",
  "article": [
    "Google has announced that it will add a new Data safety section to apps in the Google Play Store early next year to help Android smartphone users better protect their personal data.",
    "This new Data safety section will provide developers with a transparent way to show potential users of their apps if and how they collect, share and protect user data before users install a new app on their devices.",
    "According to a new post in the Android Developers Blog, Google is rolling out a new Data safety form in the Google Play Console. By going to the App content section in Play Console, developers can review, fill out and submit the search giant's new form before users begin seeing the Data safety section in the Play Store beginning next February.",
    "If a developer's information about their apps is approved, their store listing will automatically update with their data safety information. However, if no information has been submitted or if it has been rejected, users will see “No information available” on an app's Play Store listing. This may lead privacy-conscious users to avoid downloading an app in the first place which could hurt a developer's sales or advertising revenue.",
    "Beginning in February of next year, Android users will see the a Data safety summary underneath the “About this app” section on Play Store listings.",
    "An app's profile will show what data it collects or shares though it will also highlight other safety details such as whether an app has security practices like data encryption in transit, if an app has committed to follow Google's Families policy and whether or not an app has been independently reviewed for conformance with a global security standard.",
    "By tapping on the summary, users can see additional details like the type of data that is collected and shared (location, contacts, personal information, etc.), how the data is used (app functionality and personalization) and whether data collection is optional or required to use the app in question.",
    "We'll likely hear more about Google's new Data safety section in the Play Store once the company is ready to roll out this new feature early next year."
  ],
  "headers": {
    "4": "Data safety section"
  },
  "links": {
    "Google Play Store": "https://www.techradar.com/news/google-play-security-protection-fails-crucial-tests-once-again",
    "Android smartphone": "https://www.techradar.com/best/best-android-phones",
    "new post": "https://android-developers.googleblog.com/2021/10/launching-data-safety-in-play-console.html?",
    "Android": "https://www.techradar.com/news/android-12-news",
    "data encryption": "https://www.techradar.com/best/best-encryption-software"
  }
}