{
  "source": "https://www.techradar.com/news/xiaomi-mi-mix-fold-release-date-price-features-and-everything-you-need-to-know",
  "title": "Xiaomi Mi Mix Fold release date, price, features and everything you need to know",
  "category": "phones",
  "updated": "2021-04-05T17:40:18.872Z",
  "author": "james-rogerson",
  "summary": "A foldable screen and futuristic photography",
  "article": [
    "Samsung could now have some serious competition in the foldable phones space now that Xiaomi has launched its first foldable, and the phone – dubbed the Xiaomi Mi Mix Fold – has a lot going for it.",
    "From a big 8-inch screen to a cutting-edge liquid lens camera and top-end power, there are plenty of impressive aspects to this phone, and we’ve detailed them all below.",
    "You’ll also find details of the release date, price, and availability of the Xiaomi Mi Mix Fold – currently it’s not available in many places, but we’ll update this article if and when that changes.",
    "The Xiaomi Mi Mix Fold was announced in China on March 30, 2021, with pre-orders opening there the same day, and the phone set to ship in China on April 16. Sadly, at the time of writing it hasn’t been confirmed for the US, UK or Australia, but that might change.",
    "Or at least, the Xiaomi Mi Mix Fold may well land in the UK and Australia at some point, but we’d be very surprised if it launched in the US, as Xiaomi doesn’t currently sell its phones there.",
    "As for the price, the Mi Mix Fold starts at 9,999 yuan (around $1,520 / £1,100 / AU$2,000) in China. That’s for a model with 12GB of RAM and 256GB of storage.",
    "It rises to 11,000 yuan (roughly $1,675 / £1,210 / AU$2,200) for a model with 12GB of RAM and 512GB of storage, and 13,000 yuan (approximately ($1,980 / £1,430 / AU$2,600) for one with 16GB of RAM and 512GB of storage.",
    "Of course, US, UK and Australian prices won’t be an exact conversion if and when it launches in these regions.",
    "The Xiaomi Mi Mix Fold has a big 8.01-inch 1860 x 2480 interior foldable main screen (for a pixel density of 387 pixels per inch), with a 4:3 aspect ratio, a 60Hz refresh rate, a maximum brightness of 900 nits, and HDR10+ and Dolby Vision support.",
    "The main AMOLED screen folds inwards when the phone is closed, much like the Samsung Galaxy Z Fold 2, so you can only use this screen when it’s opened out to full size.",
    "The rest of the time you can make use of an exterior 6.5-inch 840 x 2520 AMOLED cover display, with HDR10+, a 90Hz refresh rate, and a peak brightness of 900 nits. It’s very narrow, with a 27:9 aspect ratio, and curiously it’s the better of the two displays in one way given its higher refresh rate.",
    "It also has a higher touch sampling rate of 180Hz, compared to 120Hz for the foldable main screen – that being a measure of how often the screen checks for inputs from your finger. This all makes sense though, as many people will probably use the non-foldable outer display the bulk of the time, only opening the Mi Mix Fold up for tasks that need the extra space.",
    "That cover display has a punch-hole camera in the top right corner, and larger bezels around it than you’d expect on a flagship phone – but that’s in line with secondary screens on other foldables.",
    "The back of the Xiaomi Mi Mix Fold (when folded shut) meanwhile includes the main camera array in the top left corner, and either a glass or ceramic finish (depending on which model you buy).",
    "The folding interior screen has fairly small bezels and no camera, unlike other foldables – so for selfies and video calls you’ll want to use the cover display.",
    "The Xiaomi Mi Mix Fold comes in at 173.3 x 133.4 x 7.6mm when unfolded and 173.3 x 69.8 x 17.2mm when folded shut, and it weighs a hefty 317g for the glass-backed model or 332g for the ceramic one.",
    "It only comes in black, but if you opt for the ceramic model then there’s a laser engraving on the back and a gold colored middle frame and volume buttons. There’s no water resistance rating here, but that’s typical for foldable phones.",
    "The highlight of the Xiaomi Mi Mix Fold arguably isn’t even its foldable screen, but rather its liquid lens camera. This is a new thing for smartphones, and it uses some of the same principles as the human eye, with a lens-like structure being formed by liquid wrapped in film.",
    "As it’s not solid, the lens can allegedly change shape (with the help of a motor), letting it take photos at between 3x optical and 30x hybrid zoom, or to take macro shots from just 3cm away.",
    "This lens uses an 8MP sensor, but it’s joined by a 108MP f/1.8 primary camera (which uses a more conventional lens), and a 13MP f/2.4 ultra-wide one, with a 123-degree field of view.",
    "The Xiaomi Mi Mix Fold also has a 20MP front-facing camera (that is, front-facing when the main screen is folded shut), and it can shoot video in up to 8K quality at 30fps.",
    "As for the battery, the Xiaomi Mi Mix Fold has two, with a combined capacity of 5,020mAh. Fast charging is supported at an impressive 67W, which the company claims can get the phone from zero to 100% in just 37 minutes. However, there’s no wireless charging here.",
    "The Xiaomi Mi Mix Fold has a top-end Snapdragon 888 chipset and either 12GB or 16GB of RAM, putting its specs up there with the best phones around.",
    "The Mi Mix Fold also has a cooling system, so it can keep pumping out the power without overheating, and it comes with either 256GB or 512GB of storage, but no microSD card slot.",
    "It’s a 5G phone of course, and it runs Android 10 overlaid with Xiaomi’s MIUI 12. The software then is slightly dated given that Android 11 has been out for a while now.",
    "There’s also a side-mounted fingerprint scanner and four speakers. It’s the first smartphone to have a quad-speaker setup, and with sound tuned by Harman Kardon too, the audio is likely to be an impressive aspect. However, as with most flagships there’s no 3.5mm headphone port."
  ],
  "headers": {
    "3": "Xiaomi Mi Mix Fold release date and price",
    "8": "Design and display",
    "17": "Camera and battery",
    "22": "Specs and features"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Android 11": "https://www.techradar.com/news/android-11"
  }
}