{
  "source": "https://www.techradar.com/news/whatsapp-is-making-big-changes-to-archived-chats",
  "title": "WhatsApp is making big changes to archived chats",
  "category": "computing",
  "updated": "2021-03-09T10:04:54Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Messaging app is bringing a new experience to archived chats",
  "article": [
    "WhatsApp will soon make it easy to see how many chats you have archived, and will no longer de-archive conversations that receive new messages.",
    "Like many other message app, WhatsApp includes the option to archive chats that you no longer need to be front and center.",
    "Late last year we saw references to a new Vacation Mode option for the Archived Chats function. which implied a means of blocking notifications for chats for a short period. This option was later renamed to Read Later, but now there are signs of further changes and development.",
    "The latest beta version of WhatsApp for iOS shows that this feature is back to its original name of Archived Chats. In addition to the change in name, WABetaInfo has also spotted further changes to the way the feature works.",
    "One of the changes is the arrival of a counter. This is a simple tool that serves as a visual indicator of how many of the chats you have archived have received new responses.",
    "In another change, when archived chats do receive further responses, they will no longer be automatically unarchived as was the case in previous implementations of the feature.",
    "It's good to see that users are being given greater control over the way archived chats work. While for some people it makes perfect sense to use the receipt of a new reply to a chat to automatically unarchive it, for other people archiving is likely to be something that should be regarded as a permanent choice.",
    "At the moment, the name change and new functionality are showing up in the iOS version of WhatsApp. It would, however, be surprising if they did not also make their way to the Android app, or even the desktop edition of WhatsApp.",
    "Via WABetaInfo"
  ],
  "headers": {
    "5": "Dip into the archives"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/whatsapp-messenger-beta-for-ios-2-21-50-11-whats-new/"
  }
}