{
  "source": "https://www.techradar.com/news/honors-next-android-phone-launches-very-soon-just-weeks-after-we-saw-the-last-one",
  "title": "Honor's next Android phone launches very soon - just weeks after we saw the last one",
  "category": "phones",
  "updated": "2021-11-22T14:05:43Z",
  "author": "tom-bedford",
  "summary": "Honor 60 launches December 1",
  "article": [
    "It sounds like the tech events of 2021 aren't all over yet; not only are the Xiaomi 12 and an unknown Motorola mobile rumored to be coming, but Honor has confirmed the day its next Android phone will debut is December 1.",
    "The company shared on its official Weibo page (that's a Chinese social media platform) a teaser for the early-December event, and also confirmed the device would be the Honor 60, which is obviously the successor to the Honor 50.",
    "The post mentions \"dreams of the stars\" and \"stars all over the sky\", and the video teaser uses lots of night-sky imagery; perhaps this refers to a cosmic-themed design, or astrophotography modes, or both.",
    "Judging by the post on Weibo, this will be a China-only launch, where we'll only hear about availability and pricing in China, but the phone itself will likely come to other regions over time.",
    "The Honor 50 did just this, and in fact it only debuted in Europe some weeks before this Honor 60 teaser. This might make it seem like the next device has been really rushed out, but in fact it's just that the Honor 50 took a while to come west.",
    "If there's anything interesting shown off at the Honor 60 event, we'll make sure to bring it to you.",
    "When it was Huawei's sub-brand, Honor used to make waves in Europe. Since leaving Huawei, despite making lots of progress in China, Honor has struggled to reclaim its old glory in the west.",
    "The Honor 50 didn't solve that issue, possibly because its staggered launch made it hard to know when or where it was out.",
    "Plus, the phone was good, but not great, and it perhaps wasn't priced competitively enough to make it really stand out in a crowded market.",
    "It's early days for the company though, at least in its new skin, and it'll likely take a fair few lessons from the Honor 50 in designing the Honor 60. Hopefully we'll see something really impressive on December 1."
  ],
  "headers": {
    "6": "Analysis: will the Honor 60 make waves?"
  },
  "links": {
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Android phone": "https://www.techradar.com/best/best-android-phones",
    "Honor 50": "https://www.techradar.com/reviews/honor-50-review"
  }
}