{
  "source": "https://www.techradar.com/news/ps5-exclusive-forspoken-heading-up-square-enixs-tokyo-game-show-plans",
  "title": "PS5 exclusive Forspoken heading up Square Enix’s Tokyo Game Show plans",
  "category": "gaming",
  "updated": "2021-09-29T18:06:36Z",
  "author": "emma-boyle",
  "summary": "But no Final Fantasy 16",
  "article": [
    "Square Enix has detailed its full schedule for this year’s Tokyo Game Show and it includes fresh looks at some of its most highly-anticipated titles including Forspoken, Marvel’s Guardians of the Galaxy and Stranger of Paradise: Final Fantasy Origin.",
    "The full schedule spans three whole days, from October 1 through to October 3, with Square Enix’s main showcase taking place on October 1 at 7pm JST/ 11am BST/ 3am PST.",
    "After that, there’ll be livestreams which focus on individual titles, presumably for deeper dives. PS5 exclusive Forspoken is first up with its own stream coming later on October 1, while others like Marvel’s Guardians of the Galaxy and Stranger of Paradise: Final Fantasy Origin will take the stage on October 2. Final Fantasy 7: The First Soldier will wrap things up on October 3.",
    "There are even some additional special events sprinkled in between the streams, including a Square Enix music special and jazz live painting which we’ll probably tune into because how could we not.",
    "We got our last update on Forspoken not so long ago, during September’s PlayStation Showcase. While Square Enix hasn’t gone so far as to detail what additional information we can expect to see about the game during its presentation, we're hoping for some more gameplay footage and maybe even a more narrowed-down release date.",
    "Square Enix’s full schedule can be found below with the relevant YouTube streams linked for quick access:",
    "As for the rest of Tokyo Game Show, it’s already been confirmed that there’ll be streams from other big names, including Xbox, Ubisoft, Capcom and Konami between September 30 and October 3.",
    "It’s worth tempering expectations for Xbox’s showcase, though, as in a post on Xbox Wire, Head of Xbox Asia Jeremy Hinton confirmed that Xbox’s stream will be a community event rather than an announcement showcase, with “no new global debuts” but plenty of “regionally relevant updates on previously announced games coming later this year.”",
    "Square Enix has a fairly strong showing, then, for Tokyo Game Show this year. But despite the large number of Final Fantasy streams at this show, there's still a couple of glaring Final Fantasy-shaped holes, Final Fantasy 16 being one of them and Final Fantasy 7 Remake Part 2 being another.",
    "Well, it’s perhaps not a huge shock that these games don't appear to be present at TGS this year. It’s likely that Square Enix is trying to focus on its titles that are expected to release late this year and early next year. Given Final Fantasy 16 and Final Fantasy 7 Part 2 both don't have release dates yet it feels safe to say they’re going to be a little later than that.",
    "It was only earlier this year that Final Fantasy 16’s producer Naoki Yoshida expressed doubt about the game making the Tokyo Game Show deadline, saying that the development team would prefer to show off the game closer to its launch as opposed to drip-feeding information to fans over a long period of time."
  ],
  "headers": {
    "6": "Sunday 3 October",
    "8": "Analysis: Final Fantasies"
  },
  "links": {
    "Forspoken": "https://www.techradar.com/news/forspoken-release-date-trailers-news-and-rumors",
    "Marvel’s Guardians of the Galaxy": "https://www.techradar.com/reviews/marvels-guardians-of-the-galaxy",
    "Stranger of Paradise: Final Fantasy Origin": "https://www.techradar.com/news/first-final-fantasy-game-to-be-re-imagined-in-brand-new-action-title",
    "full schedule": "https://www.jp.square-enix.com/tgs21/eu_na/stream/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "September’s PlayStation Showcase": "https://www.techradar.com/news/live/playstation-showcase-live-blog",
    "confirmed": "https://www.techradar.com/news/microsoft-confirms-next-xbox-live-stream-but-dont-get-your-hopes-up",
    "Final Fantasy 16": "https://www.techradar.com/news/final-fantasy-16-release-date-trailer-news-and-rumors",
    "Final Fantasy 7 Remake Part 2": "https://www.techradar.com/news/final-fantasy-7-remake-part-2",
    "earlier this year": "https://twitter.com/aitaikimochi/status/1413737154279211008?s=20"
  }
}