{
  "source": "https://www.techradar.com/news/was-this-nvidia-rtx-3070-deal-on-wish-too-good-to-be-true",
  "title": "Was this Nvidia RTX 3070 deal on Wish too good to be true?",
  "category": "computing",
  "updated": "2021-08-24T10:27:46Z",
  "author": "jess-weatherbed",
  "summary": "Someone got lucky...",
  "article": [
    "A tech-focused TikTok account has managed to purchase a Zotac GeForce RTX 3070 Twin Edge OC White Edition graphics card for $680 (around £500 / AU$950) through an unlikely source.",
    "Keith Over (@Kayjayohpcs) documented the arrival of the card and its apparent legitimacy after ordering it from the American online e-commerce platform Wish, a retailer that has been criticized for listing counterfeit goods through independent sellers, and for its unusual online advertisements. Even in this seemingly fortunate incident, Over's notes that a grey version of the GPU was ordered, despite the White Edition being delivered.",
    "We have reached out to verify that the purchase is genuine.",
    "We always recommend going through official retailers when trying to secure elusive hardware like the PlayStation 5 or an RTX 3080 graphics card, but sometimes it's easy to forget that services like Wish or Aliexpress are genuine e-commerce platforms.",
    "That said, we would still advise you to be careful when buying expensive tech from sites you're not familiar with.",
    "Over notes that the listing for the RTX 3070 card has since been removed after he returned to buy additional units after confirming the card's apparent legitimacy. Both GeForce Experience and Windows 10 Task Manager managed to detect the GPU, something that is difficult to simulate on fake versions of graphics cards.",
    "It's especially interesting that the card was listed for such a low price, with the MSRP of the RTX 3070 being set at $499 (£469, AU$809). We can't find a recommended list price for the Zotac version of the GPU, but prices across pretty much every GPU released in the last 12 months have been inflated to astronomical levels, with the RTX 3080 tripling its RRP on average.",
    "If you've been hunting for an RTX 3070 GPU (or any high-value hardware) then things can feel a little futile right now. Despite this, it's important to protect yourself when buying in-demand products, and the best way to do that is to stick to trusted retailers that specialize in consumer technology. In the US, you can try Best Buy and Micro Center, or sign up for the Newegg Shuffle, and the UK can check out websites like Overclockers and Scan.",
    "The market is a mess at the moment, we get that – after all, we've been reporting on it for months. But many of the suspicious listings online are preying on people's desperation, trying to offer hardware that's been impossible to buy, at a price that seems too good to be true. However, if it does look too good to be true, it probably is, and you're going to lose your investment.",
    "Where possible avoid individual sellers, especially on social media. As our own Matt Swider mentions on his Twitter stock reports for the PS5, you have no way of knowing their legitimacy. Buying consoles or PC components isn't recommended on community sites either, so if you see a listing on Craigslist or Facebook Marketplace, keep in mind the risks involved with buying from an unofficial source.",
    "This is a waiting game. Until the market stabilizes and more stock becomes available, don't buy from scalpers or scammers. There are a few viable alternatives that could keep you going until you can buy your dream GPU at a sensible price:"
  ],
  "headers": {
    "3": "If you Wish card enough...",
    "7": "Analysis: Protect your purchases"
  },
  "links": {
    "@Kayjayohpcs": "https://www.tiktok.com/@kayjayohpcs?lang=en&is_copy_url=1&is_from_webapp=v1",
    "has been criticized for listing counterfeit goods through independent sellers": "https://www.digitalcommerce360.com/2018/07/17/wish-faces-criticism-over-suspected-counterfeits/",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3070": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "GeForce Experience": "https://www.techradar.com/how-to/geforce-experience",
    "RTX 3080 tripling its RRP on average": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-gpu-stock-nightmare-continues-as-prices-skyrocket",
    "Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-2433818880481354000&url=https%3A%2F%2Fwww.bestbuy.com%2F%3Fintl%3Dnosplash&article_name=Was%20this%20Nvidia%20RTX%203070%20deal%20on%20Wish%20too%20good%20to%20be%20true%3F&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwas-this-nvidia-rtx-3070-deal-on-wish-too-good-to-be-true",
    "Micro Center": "https://www.microcenter.com/",
    "Newegg Shuffle": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=44583&u1=trd-us-3274982971729458000&murl=https%3A%2F%2Fkb.newegg.com%2Fknowledge-base%2Fnewegg-shuffle-faq%2F",
    "Overclockers": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7246859645415242000&xs=1&url=https%3A%2F%2Fwww.overclockers.co.uk%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwas-this-nvidia-rtx-3070-deal-on-wish-too-good-to-be-true",
    "Scan": "https://www.awin1.com/awclick.php?awinmid=15473&awinaffid=103504&clickref=trd-us-2293855688646475000&p=https%3A%2F%2Fwww.scan.co.uk%2F",
    "Matt Swider": "https://twitter.com/mattswider"
  }
}