{
  "source": "https://www.techradar.com/news/amazon-prime-video-just-landed-another-big-new-movie",
  "title": "Amazon Prime Video just landed another big new movie",
  "category": "entertainment",
  "updated": "2021-04-08T10:40:53Z",
  "author": "samuel-roberts",
  "summary": "Chris Pratt's The Tomorrow War lands later this year",
  "article": [
    "Amazon Prime Video has swung big for landing exclusive movies during the pandemic, grabbing the likes of Borat 2 and Coming 2 America to give you something to watch during a fallow time for cinema. Now, it's made another massive get, grabbing the Chris Pratt sci-fi movie The Tomorrow War from Paramount, which was originally set to land in theaters in late 2020.",
    "The film will instead be released on July 2 on Amazon Prime Video. Chris McKay, who directed the Lego Batman movie, is behind the film, which also stars Yvonne Strahovski and JK Simmons.",
    "The Tomorrow War is an original big-budget sci-fi movie, which is something of a rarity in Hollywood these days. After a team of time travelers transport from 2051 to the present day, they warn humanity that the only way to win is for people from the present to travel forward in time to help them win. Father Dan Forester (Pratt) colludes with a scientist (Strahovski) and his father (Simmons) to help change the course of the future.",
    "Back in January, Deadline reported that Amazon was looking at grabbing the film for $200 million, and that the response from streaming services was enthusiastic generally. Encouragingly, test screenings for the film were positive, too, suggesting this might actually be a good watch.",
    "Godzilla Vs Kong proved to be a pleasant surprise for box office observers. The movie has made almost $300 million globally and counting, despite being released on HBO Max in the US, VOD in some territories, and with many theaters in the US not yet operating at full capacity.",
    "That suggests that many people have definitely had enough of just watching movies at home, and are keen to get back into the cinema. For the time being, though, streaming still seems like it'll compose the bulk of our movie watching in 2021 – Black Widow, for example, will launch in both theaters and on Disney Plus for a premium fee in July.",
    "Amazon, for its part, also has the Tom Clancy movie Without Remorse coming up on April 30, starring Michael B. Jordan – another movie it bought from Paramount and Skydance."
  ],
  "headers": {
    "4": "When will movies return to normal?"
  },
  "links": {
    "Borat 2": "https://www.techradar.com/news/how-to-watch-borat-2-online-stream-borats-subsequent-moviefilm-anywhere",
    "Coming 2 America": "https://www.techradar.com/news/how-to-watch-coming-2-america-online-stream-eddie-murphy-sequel-anywhere",
    "Amazon Prime Video": "https://www.techradar.com/best/best-amazon-prime-shows",
    "Deadline": "https://deadline.com/2021/01/chris-pratt-the-tomorrow-war-streaming-deal-hulu-netflix-amazon-apple-1234672038/",
    "Godzilla Vs Kong": "https://www.techradar.com/news/how-to-watch-godzilla-vs-kong-stream-online",
    "Disney Plus": "https://www.techradar.com/reviews/disney-plus-review"
  }
}