{
  "source": "https://www.techradar.com/news/diablo-2-resurrected-beta-is-free-to-play-for-all-this-weekend",
  "title": "Diablo 2: Resurrected beta is free to play for all this weekend",
  "category": "gaming",
  "updated": "2021-08-18T11:29:55Z",
  "author": "gerald-lynch",
  "summary": "There's no level cap, either",
  "article": [
    "Diablo 2: Resurrected, the remastered take on Blizzard's classic action-RPG game, is getting an open beta this weekend that anyone can take part in.",
    "Kicking off on August 20 and running until the end of that weekend, anyone on PC, Xbox Series X or Series S, Xbox One, PlayStation 4 or PlayStation 5 can download the beta and play through the latest build of the dungeon crawler.",
    "It's quite a generous beta too – the first two acts of the game are open to play, as are the Barbarian, Sorceress, Amazon, Druid and Paladin classes, with no level cap restrictions meaning you can grind to your hearts content – even if your character won't carry over to the retail build of the game.",
    "The beta will also act as a stress test for the game's cross-progression system. While PlayStation, Xbox and PC players can't play together, those with a copy of the game on multiple platforms can bring a character over from one device to another and play with their level, items and progression intact.",
    "We were lucky enough to get early access to the beta over the past weekend, and remain impressed with the care that's gone into the remaster. The 4K visuals are crisp (and the easy-access to the original graphics a nice easter egg), while quality of life improvements such as stash size, controller support and UI enhancements are well implemented.",
    "We did notice some performance issues – an odd motion blur effect would occur during busy scenes, for instance – but we're hoping these will be tidied up ahead of the games full release.",
    "Keep an eye out for our full Diablo 2: Resurrected review ahead of the game's full release on September 23."
  ],
  "headers": {},
  "links": {
    "Diablo 2: Resurrected": "https://www.techradar.com/news/diablo-2-remastered-and-resurrected-news-release-date-trailers",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PlayStation 5": "https://www.techradar.com/reviews/ps5"
  }
}