{
  "source": "https://www.techradar.com/news/pokemon-legends-arceus-trailer-release-date-news",
  "title": "Pokémon Legends Arceus release date, trailer, starters and news",
  "category": "gaming",
  "updated": "2021-12-08T18:17:40Z",
  "author": "rhys-wood",
  "summary": "Pokémon Legends Arceus is taking us back to the past",
  "article": [
    "Pokémon Legends: Arceus is the highly-anticipated Pokémon game that marks a new direction for the series, revealed during February 2021's Pokémon Presents live stream. Since this first reveal, we've learned a good deal more about the game ahead of its fast-approaching January 2022 release date.",
    "Announced alongside Pokémon Brilliant Diamond and Pokémon Shining Pearl (remakes of the revered Nintendo DS titles), it looks like Pokémon Legends: Arceus is going to be a game that breaks new ground for the series, with a historical setting and some new mechanics.",
    "Confirmed for Nintendo Switch, Pokémon Legends: Arceus will act as a prequel to the main series, taking players to a much older version of Pokémon Diamond and Pearl’s Sinnoh region (known here as the Hisui region), where Pokémon roamed freely, and they'll be charged with completing one of the region's first Pokédexes.",
    "Pokémon Legends: Arceus is scheduled to launch worldwide on January 28 2022 but, in the meantime, we've gathered together everything we know about the game right here for your perusal.",
    "[Update: It looks like Pokémon Legends: Arceus could be in a playable state. Read on to find out more.]",
    "Pokémon Legends Arceus will release on January 28, 2022, for Nintendo Switch. The Pokémon Company revealed the new Pokémon game's release date with a tweet back in May, 2021. Pre-orders are live now.",
    "New Hisuian Pokémon forms",
    "A brand new trailer for the game released in October shows two new Hisuian Pokémon forms: Zorua and Zoroark. Zorua is a Ghost/Normal type, known as the “Spiteful Fox Pokémon”.",
    "According to an official description, Zorua “migrated to the Hisui region after being driven from other lands by humans, who shunned the Pokémon for manifesting uncanny illusions. But the Zorua perished, unable to survive the harsh Hisuian environment and strife with other Pokémon. Their lingering souls were reborn in this Ghost-type form through the power of their malice toward humans and Pokémon.”",
    "Zoroark is also a Ghost/Normal type known as the “Baneful Fox Pokémon”. It’s described as “ferociously hostile and aggressive toward people and other Pokémon”. ​​The “spiteful power emitted from Hisuian Zoroark’s long, writhing fur projects terrifying illusions—and can also inflict physical harm upon foes, damaging their bodies from both inside and out. And the illusions that Zoroark projects have expressions of such utter malice toward every last thing upon this world that those who see them are said to be driven mad by the terror.”",
    "Mysterious footage",
    "An October trailer for Pokémon Legends Arceus takes a creepier approach than we're used to, showing a Pokémon professor exploring the wild just as players will before appearing to come under attack from what appears to be a wild Zoroark.",
    "Frenzied Nobles trailer",
    "Released on September 28, 2021, this Pokémon Legends Arceus trailer shows off new gameplay features, such as being able to ride Pokémon in the wild across land, air and bodies of water. You can even pull off trick shots with Pokéballs while riding to catch wild Pokémon.",
    "New characters, known as Wardens, are introduced. It's unclear as to how these characters will impact the game, but they seem integral to elements of the story.",
    "A new Pokémon named Cleavor will appear as what the game is calling a 'frenzied noble'. These Noble Pokémon act as boss fights, and it seems like the player trainer will have to calm them down through battle in order to catch them.",
    "Finally, character customization has been confirmed, and players are able to dress their trainer in period-appropriate attire, as well as change up their hairstyles back in the hub area of Jubilife Village.",
    "Gameplay trailer Debuting at the August 18, 2021 Pokémon Presents livestream, this trailer gave us a more in-depth glimpse at what we can expect from Pokémon Legends Arceus. We got a better look at exploration, and how wild Pokémon can interact with the playable trainer.",
    "Reveal trailer Pokémon Legends Arceus was arguably the biggest news from the Pokémon Presents showcase, where it debuted alongside a trailer showing off some early in-engine gameplay.",
    "Pokémon Legends Arceus returns players to the Sinnoh region, albeit in a time long before the events of any mainline Pokémon game. So old, in fact, that the region is being referred to as Hisui. The game evokes a historical Japanese setting, evident in its artwork, landscapes and character designs.",
    "Pokémon Legends Arceus looks quite unlike any other effort we’ve seen so far in the series, and looks to expand on open-world elements found in Pokémon Sword and Shield. Those games featured a pretty scaled back open-world element, the Wild Area, which felt a little tacked on, like a separate entity to the rest of the game world.",
    "In Pokémon Legends Arceus, it appears that the scope of the open world is greater than previous entries in the series. It won't be Breath of the Wild open by any means but there will be multiple open areas to explore rather than just one. Trailers so far have introduced us to the hub town of Jubilife Village, as well as the Galaxy Expedition team, from where you'll prepare for your expeditions. According to The Pokémon Company, \"Jubilife Village will serve as the base for surveying missions. After receiving an assignment or a request and preparing for their next excursion, players will set out from the village to study one of the various open areas of the Hisui region.\"",
    "Stealth-like elements are likely to play a role in Pokémon Legends Arceus. In the trailers, we see the player character not only throw Pokéballs from great distances, but also perform a dodge roll and hide in tall grass. The recent showcase confirmed that not all Pokémon will react to your presence in the same way, and many will be hostile towards you.",
    "Curiously, players won’t have to enter a battle in order to catch Pokémon. This is now done more fluidly via the open setting, where players can attempt to sneak up on Pokémon, then aim and throw Pokéballs at them for a catch. Whether or not we can still catch Pokémon via battles remains to be seen, though.",
    "Speaking of battling, that element of the series is retained in Pokémon Legends Arceus, featuring the familiar turn-based gameplay. Animations seem to be more theatrical and improved across the board, perhaps in response to a criticism often leveled at Pokémon Sword and Shield where battle animations were somewhat tepid.",
    "By throwing Pokéballs containing your partner Pokémon near a wild one, you're able to seamlessly transition into battle, according to the game's website. This might make the game take an approach similar to that seen in the Pokémon anime series, and definitely has our interest piqued.",
    "Pokémon games usually get you going with one ‘starter’ Pokémon at the outset of your journey, and that’s no different in Pokémon Legends Arceus. What is different, though, is that the three Pokémon on offer this time are all from separate generations. They are Cyndaquil (Gen 2), Oshawott (Gen 5) and Rowlet (Gen 7), representing the usual Fire, Water and Grass types respectively.",
    "Pokémon Legends: Arceus will task players with filling one of the region's first Pokédexes so it's natural to wonder which Pokémon we're going to be chasing down in the game. There's no comprehensive official list just yet but thanks to our friends at GamesRadar, we do have a list of the twenty Pokémon that appeared in the game's announcement trailer as well as some more that have since been confirmed.",
    "That's quite a few so far. Given the game is set in the Sinnoh region, it's not entirely surprising that there are a lot of Generation 4 Pokémon in that list and it seems reasonable to assume that their evolutionary forms will also probably be present in the game.",
    "We expect that in the run-up to the game's release, Nintendo and Game Freak will confirm more of the Pokémon that we can expect to see in Pokémon Legends: Arceus so we'll keep updating this list as and when they're revealed.",
    "Seems to be in a playable state?",
    "It looks like Pokémon Legends Arceus is in a playable state, if long-time Nintendo fan Christina Aguilera is to be believed. In an interview with Elle, Aguilera discussed a recent campaign she’s done with Nintendo for the Switch and revealed that while filming, her \"daughter was able to fall in love with a new game. We had a brief moment to [try out] Pokemon Legends: Arceus.\" Aguilera went on to say, \"It's so gorgeous, the graphics and the setting that you get to explore in, so she was loving that so much, she wouldn't give me a turn.\" That’s a pretty ringing endorsement.",
    "This doesn’t, of course, mean the game is ready to ship to players. As Aguilera pointed out, they only got to try it, rather than keep it. But it does suggest Pokémon Legends: Arceus is close to being ready.",
    "Bonuses for players who have played previous games",
    "Pokémon fans who have played previous games in the series will benefit from bonuses when they pick up Pokémon Legends: Arceus.",
    "According to the game’s official site, \"if you have play records from the Pokemon Sword or Pokemon Shield game, you'll be able to take on a research request in Pokemon Legends: Arceus in which you'll have a chance to add the mythical Pokemon Shaymin to your team.\" The quest won’t be available until after the game’s end credits but, hey, it gives you something more to do after you finish the main story.",
    "The site says you’ll also be able to claim a Shaymin Kimono Set. This can be found in-game by speaking to the clothier after you join the Galaxy Expedition Team which, apparently, should take about one hour of playtime.",
    "There’s also bonuses for those with save data from Let's Go Pikachu or Let's Go Eevee on their system. These players will get either a Pikachu or Eevee mask, to be unlocked from the clothier at the same point in the game.",
    "Confirming the gameplay loop",
    "The Pokémon Company has shed a little more light on the gameplay loop players can expect in Pokémon Legends: Arceus. It appears that the game is not a full open world experience a la Breath of the Wild as it originally seemed and operates more on the basis of the player exploring individual hub areas. In a statement to Kotaku, The Pokémon Company said, “In Pokémon Legends: Arceus, Jubilife Village will serve as the base for surveying missions. After receiving an assignment or a request and preparing for their next excursion, players will set out from the village to study one of the various open areas of the Hisui region.",
    "“After they finish the survey work, players will need to return once more to prepare for their next task. We look forward to sharing more information about exploring the Hisui region soon.”",
    "Boss fights Revealed during the August 18 Pokémon Presents livestream, some Pokémon in the Hisui region will be more hostile than others. Especially strong Pokémon bore a red aura around their eyes, and would even attack the trainer directly. It seems like these encounters will be treated as boss fights, or harder fights at the very least. We expect to come across a lot of them in an effort to complete our Pokédex.",
    "Base camp and regions You'll start any expedition by choosing a general area on the overworld map. From there, you'll begin your journey at a base camp, where you can stock up on items from your inventory, or even buy and craft more of them.",
    "You'll also return to the base camp should you black out while exploring. This can happen if wild Pokémon hurt you too much, which means trainers will have to tread a lot more carefully than usual.",
    "New Pokémon and variants confirmed Just because Hisui will eventually become the Sinnoh region doesn't mean we won't be seeing any new Pokémon. In fact, the August 18 Pokémon Presents livestream confirmed just that. New Pokémon Wyrdeer and Basculegion will be joining the roster, and we imagine more new critters will follow.",
    "Region-specific variants are also confirmed to be returning with the announcement of Hisuian Braviary and Growlithe. Previous games in the series have done this to great success, such as with Alolan Vulpix and Galarian Ponyta, so we're glad to see the feature returning.",
    "E3 2021 Unfortunately, we didn't hear more about Pokémon Legends Arceus at Nintendo's E3 2021 showcase but we're hoping to hear more about Arceus in the coming months.",
    "Pokémon Legends Arceus has been compared to The Legend of Zelda: Breath of the Wild, and while we now know it won't be quite as open as that game, it does appear to taking a slightly different approach from what we've seen from the series before.",
    "We're hoping that the hub-like approach that's been mentioned provides some new and interesting ways to play and explore in the world of Pokémon, feeling simultaneously more diverse and more cohesive than the Wild Area of Sword and Shield.",
    "If Pokémon Sword and Shield got one thing right, it was its eclectic bunch of superbly written characters. We’d love to see this trend continue in Pokémon Legends Arceus, especially when the historical setting could provide all sorts of fun characters and archetypes.",
    "Earlier we mentioned that recent Pokémon games’ animation quality has been lacking, particularly when it comes to Pokémon battles. That’s because the same animations have been consistently reused since the first true 3D entry in the mainline series, Pokémon X and Y.",
    "While we know it’s important to many fans that the National Dex (the complete roster of Pokémon across all generations) be represented again in some way, we think it could be equally beneficial to feature a scaled-back roster of Pokémon with a greater variety of revamped animations.",
    "Touching a bit more on that, it’s possible that given the time period in which Pokémon Legends Arceus takes place, it’s possible that certain Pokémon might not even exist yet. This makes Pokémon Legends Arceus a prime testing ground for Game Freak to really wow us with improvements to animation quality across the board, particularly if there are fewer Pokémon overall to work with."
  ],
  "headers": {
    "5": "Pokémon Legends Arceus: cut to the chase"
  },
  "links": {
    "Pokémon Brilliant Diamond and Pokémon Shining Pearl": "https://www.techradar.com/news/pokemon-diamond-and-pearl-remakes",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "tweet": "https://twitter.com/Pokemon/status/1397539085921800194",
    "official description": "https://press.pokemon.com/en/releases/NEW-DETAILS-REVEALED-FOR-POKEMON-BRILLIANT-DIAMOND-POKEMON-SHINING-PEA",
    "Pokémon Sword and Shield": "https://www.techradar.com/reviews/pokemon-sword-and-shield-review",
    "game's website": "https://legends.pokemon.com/en-gb/",
    "GamesRadar": "https://www.gamesradar.com/pokemon-legends-arceus-pokedex/",
    "Elle": "https://www.elle.com/culture/celebrities/a38191227/christina-aguilera-nintendo-switch-interview/?",
    "official site": "https://legends.pokemon.com/en-us/shop/bonus-3/",
    "Kotaku": "https://kotaku.com/pokemon-legends-arceus-is-clearly-not-going-to-be-open-1847817836",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "The Legend of Zelda: Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review"
  }
}