{
  "source": "https://www.techradar.com/news/employees-say-passwords-are-preventing-them-from-doing-their-jobs",
  "title": "Employees say passwords are preventing them from doing their jobs",
  "category": "computing",
  "updated": "2021-12-03T11:15:05Z",
  "author": "sead-fadilpasic",
  "summary": "People are getting locked out of their computers",
  "article": [
    "Passwords are a major hindrance to productivity, as people regularly forget their credentials and get locked out of their computers and apps. Often, it takes employees hours to get back to work.",
    "This is according to a report from authentication company Axiad, based on a poll of 2,000 US workers, which states that the majority (60%) are prevented from doing their jobs by password-related issues.",
    "Almost the same percentage (59%) have had to reach out to IT after getting locked out of their devices, while 48% sought out help after being unable to log into productivity and collaboration apps.",
    "In many occasions, people have no one to blame but themselves, as almost half (48%) said they have forgotten their passwords at some point. It takes an average of five hours to fix these authentication issues, going up to 9+ hours in 15% of cases.",
    "Axiad says most workers (67%) know about multi-factor authentication, but almost half (46%) of IT departments never ask staff to use anything other than passwords to protect their accounts.",
    "Passwords are often considered among the weakest links in the cybersecurity chain. Many employees don’t use a password generator and instead create weak passwords, while others use the same credentials across multiple services.",
    "Although cybersecurity experts recommend using a password manager to store account credentials securely, too many employees choose to write their passwords down on paper for the sake of convenience.",
    "This has become a became a particularly pronounced problem since most people started working from home, as being away from the office gives them a false sense of security.",
    "“Frustrations are high when so many password-based authentication issues get in the way of employees doing their job. IT leaders can and must take more initiative to move away from passwords and transition to a user-centric passwordless authentication that reduces these frustrations,” said Bassam Al-Khalidi, Co-CEO & Co-Founder, Axiad.",
    "\"Beyond multiple passwords, multiple MFA solutions can be just as challenging for users to manage. If there’s an issue with their YubiKey or mobile authentication app, users need to know which platform to go to and how to fix it. These new authentication methods can’t succeed unless the solution puts the employees front and center and simplifies their login experiences,” added Al-Khalidi."
  ],
  "headers": {
    "5": "Poor password practices"
  },
  "links": {
    "Passwords": "https://www.techradar.com/best/password-manager",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "collaboration apps": "https://www.techradar.com/best/best-online-collaboration-tools",
    "password generator": "https://www.techradar.com/best/password-generator",
    "working from home": "https://www.techradar.com/best/wfh-apps"
  }
}