{
  "source": "https://www.techradar.com/news/this-jagermeister-cooled-gaming-pc-isnt-the-weirdest-build-weve-seen-but-its-close",
  "title": "This Jägermeister-cooled gaming PC isn't the weirdest build we've seen - but it's close",
  "category": "computing",
  "updated": "2021-08-11T10:21:30Z",
  "author": "jess-weatherbed",
  "summary": "Or milk, or beer, or juice.....",
  "article": [
    "Have you ever wanted your gaming PC to smell like a student house party? Probably not, but for a niche pool of people who want to make that dream a reality, we have some good news for you.",
    "Popular computing YouTuber Bitwit built a Jägermeister-themed custom loop gaming PC this week, an interesting design by itself but decidedly elevated by the fact that the system had 1.5 liters of chilled Jägermeister running through it in place of traditional coolant. At least temporarily that is, given that switching distilled water or purpose-made coolant for sugary alcohol is unsurprisingly not very good for your PC components.",
    "Kyle Hansen, the host of YouTube channel Bitwit, was careful throughout his video to stress that the coolant-swapping experiment was mostly focused on aesthetic rather than actual performance, but that didn't mean the build didn't contain some top-quality hardware, including 64GB of Corsair Dominator Platinum RGB memory, an EVGA RTX 3080, an AMD Ryzen 9 5950X, and a 1,000W power supply.",
    "The real Jägermeister was eventually swapped out for a similar-looking coolant fluid to preserve the lifespan of the PC, with Hansen stating \"countless demonstrations across the web have shown that alcoholic beverages, whether it be Jägermeister or beer, are prone to rotting if left in a water cooling loop for too long\". A smelly issue for sure, but that's not all. Unsuitable liquids such as booze and soda will corrode the metal fittings in a custom loop over time, and alcohol is known to eat away at acrylic.",
    "For the duration that the genuine German digestif was flowing through the loop, tests actually revealed that it's not too terrible at cooling computers. The Ryzen 9 5950X temperature hit around 57 degrees Celsius (134 Fahrenheit) in a loop of Cinebench R23, which is far from a great recording but still manages to do a decent job.",
    "It's very ill-advised you do something like this for the long term, but people forget (or have never been exposed to) the fact that there's a vast PC modding community out there that are happy to risk PC components on a quest to create some seriously cool looking systems.",
    "Was this build a stupid idea? We certainly don't think so. People have been using all sorts of ill-advised liquids to experiment with watercooling solutions, most of which aren't intended to be serious. Another popular computing YouTuber, JayzTwoCents, has a few videos of computers having coolant replaced with milk, orange juice and even beer.",
    "So why swap out genuine coolant at all? Mostly because it's just some silly fun, but you never really know what you might stumble across, even when the experiments seem outrageous. A popular build within the modding community is to submerge a PC in mineral oil to better disperse heat, a messy system but one that works better than traditional air or water cooling if you can get it right. And then you have a PC that you can put into a fish tank, which is certainly a unique look (but please don't add any live fish, be kind to your pets).",
    "The PC modding community also doesn't need to focus so much on optimizing performance as they do the raw aesthetics of their builds. You can even buy specially made coolant fluid from trusted suppliers like CryoFuel that contains micro glitter, almost all of which have a warning that the liquid is to be used for showcasing rather than everyday gaming builds as they can clog up your system.",
    "You can see crazy, impressive builds at shows like Computex (we last attended in 2019 and took note of some weird and wonderful PCs), and in the CoolerMaster Case Mod World Series.",
    "If you're happy to risk your PC components then frankly, why not experiment a little? We certainly wouldn't advise messing around with your only system, especially if it has expensive hardware like an RTX 3090 graphics card inside, but If you're aware of the risks then this could be your introduction to a fun new hobby. Bear in mind that modifications will likely void the warranty of your hardware and don't do anything truly stupid like setting your system on fire, but otherwise – go have some fun."
  ],
  "headers": {
    "2": "Don't try this at home",
    "6": "Or maybe do try it, we're not your mom"
  },
  "links": {
    "Bitwit": "https://www.youtube.com/channel/UCftcLVz-jtPXoH3cWUUDwYw",
    "custom loop gaming PC": "https://www.techradar.com/how-to/how-to-water-cool-your-pc",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD Ryzen 9 5950X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here",
    "JayzTwoCents": "https://www.youtube.com/channel/UCkWQ0gDrqOCarmUKmppD7GQ",
    "beer": "https://www.youtube.com/watch?v=tNLBN1-Bl5E",
    "submerge a PC in mineral oil": "https://www.techradar.com/news/this-rtx-3090-cryptomining-rig-is-completely-submerged-in-mineral-oil-for-some-reason",
    "PC that you can put into a fish tank": "https://www.youtube.com/watch?v=8xKfNjcmlqI",
    "weird and wonderful PCs": "https://www.techradar.com/news/the-weird-and-wonderful-pcs-of-computex-2019",
    "CoolerMaster Case Mod World Series": "https://community.coolermaster.com/cmws/",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090"
  }
}