{
  "source": "https://www.techradar.com/news/the-new-lexus-nx-has-two-features-thats-got-us-saying-finally",
  "title": "The new Lexus NX has two features that's got us saying 'finally!'",
  "category": "car-tech",
  "updated": "2021-06-14T10:25:29Z",
  "author": "john-mccann",
  "summary": "The new Lexus NX gets touchy and plugy",
  "article": [
    "The new Lexus NX is the latest generation of the mid-size SUV from the Japanese car maker, and as well as being the first car from the brand to feature a plug-in hybrid (PHEV) option, the new NX also, finally, broadens the firm's touch screen display offering.",
    "While there's the 2.4 turbo gas engine powered NX 350 on the model list, the one we're more interested in is Lexus' new PHEV model, the NX 450h+.",
    "This is the first time Lexus has offered a plug-in hybrid powertrain option on any of its cars, and it follows on from the all-electric UX 300e (which we've just driven, review coming soon).",
    "Lexus says the 18.1kWh battery in the new NX can offer up to 40 miles of range in a purely EV (electric vehicle) mode using the on-board electric motor, while you also get a 2.5 liter, 4-cylinder gasoline engine, and when the two work together the Lexus NX 450h+ will be able to achieve a 0-60mph time of six seconds.",
    "We've driven a number of Lexus over the years, and while there's no doubting the premium quality, excellent driving experience and eye-catching looks, they've been lacking one important tech feature - a touch screen.",
    "While Lexus has begun to roll out touch screen infotainment displays in the past couple of years, it's been slow and limited to just a few models. Even the firm's all-electric UX 300e, which was revealed in 2020 and hit roads in 2021, doesn't benefit from a touch screen currently.",
    "It's good to see then, that the new 2022 Lexus NX comes with a 9.8-inch touch-enabled infotainment display at the top of the center console, and if you opt for the F-Sport spec you'll see that screen upgraded to a sizable 14-inch offering.",
    "On-screen you'll be treated to an all-new interface and virtual assistant from Lexus, which it says will make the system easier to use and more useful for driver and passenger.",
    "As for the instrument cluster, you'll find a 7-inch display, which a 10-inch HUD (head-up display) will be an optional extra for those who want key driving data projected onto the windshield.",
    "There's also support for wireless Android Auto and Apple CarPlay, as well as the ability to enable a 'Digital Key' which allows your smartphone to act as the key to not only lock and unlock, but also start the engine. You'll also get the option of adding a wireless phone charger too, if your smartphone supports the wire-free top-up.",
    "The new Lexus NX price and release date are yet to be confirmed, with Lexus only saying that production will start in the third quarter of 2021, with a UK and Europe launch happening in the fourth quarter of the year.",
    "The current NX range, however, starts at $37,610 / £36,075 / $65,178, which gives us a rough guide on what the new generation may cost."
  ],
  "headers": {
    "4": "A host of tech options"
  },
  "links": {}
}