{
  "source": "https://www.techradar.com/news/ps5-deals-hit-hd-camera-with-big-savings-and-record-low-prices",
  "title": "PS5 deals hit HD Camera with big savings and record low prices",
  "category": "gaming",
  "updated": "2021-08-18T19:26:57Z",
  "author": "tabitha-baker",
  "summary": "Record low prices in the US and UK",
  "article": [
    "While the console itself may still be difficult to get hold of, PS5 deals on accessories are becoming more and more frequent and we've spotted one of the best yet. Amazon has just dropped the PS5 HD Camera all the way down to its lowest price yet in a rare $20 saving. Now just $39.99 (was $59.99), we were lucky to even see stock of this peripheral six months ago, let along a sub-$40 price tag.",
    "We've only ever seen PS5 deals hit the HD Camera twice before, and only then with $10 off the MSRP. Other retailers aren't matching this discount yet either, which means Amazon currently has the best price around.",
    "Those in the UK can also take advantage of some record low prices as well. 365 Games is leading the way here, with a £38.49 sales price over the £49.99 RRP. That £11.50 discount beats out Amazon's own £39.77 record with free shipping. However, with a 2-3 day delivery window after dispatch those looking to get their hands on it sooner won't be paying too much more to go with Amazon.",
    "All of these offers are listed just below, but you'll find plenty more PS5 deals on extra accessories further down the page as well.",
    "PS5 accessories were previously difficult to find at all, let alone with a discount. However, we have seen a few price drops on some of the more readily available peripherals like the DualSense controller. These are rare, however, so if you do spot a price below MSRP below you're getting an excellent offer.",
    "We're always on the lookout for DualSense PS5 controller deals and Pulse 3D headset sales as well. However, if you're all stocked up on extra accessories, check out the latest cheap PS5 game deals."
  ],
  "headers": {
    "4": "More PS5 deals"
  },
  "links": {
    "$39.99 (was $59.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08FC5V8L7%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8944171348665885000-20",
    "£38.49 sales price": "https://www.awin1.com/awclick.php?awinmid=5778&awinaffid=103504&clickref=trd-us-1075194802592091900&p=https%3A%2F%2Fwww.365games.co.uk%2Fps5-accessories%2Fplaystation-5-hd-camera-for-ps5",
    "Amazon's own £39.77 record": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB08H9724CC%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1252263512616230100-21",
    "PS5 deals": "https://www.techradar.com/deals/ps5-pre-orders-live-now-everything-we-know",
    "DualSense PS5 controller deals": "https://www.techradar.com/news/dualsense-ps5-controller-deals-price-sales",
    "Pulse 3D headset sales": "https://www.techradar.com/news/ps5-pulse-3d-headset-pre-orders",
    "cheap PS5 game deals": "https://www.techradar.com/deals/best-cheap-ps5-game-deals-and-prices"
  }
}