{
  "source": "https://www.techradar.com/news/amazon-prime-day-vs-black-friday-what-should-you-buy-when",
  "title": "Amazon Prime Day vs Black Friday: what should you buy when?",
  "category": "news",
  "updated": "2021-06-05T12:33:27Z",
  "author": "tabitha-baker",
  "summary": "What's the difference between the two events and should you wait for November?",
  "article": [
    "Amazon Prime Day may just be around the corner, but the biggest sale of the year is still reserved for November. Whether or not you should wait for Black Friday to pick up that new TV or laptop, though will be down to timings (do you need your gadget right now) and how each sale period treats the items you're looking for.",
    "We've been tracking both Amazon Prime Day and Black Friday for years now, so we know when certain items are likely to be at their cheapest, but we also know how easy or difficult it is to find and grab the best deals during each event.",
    "That's why we're showing you all the differences between Amazon Prime Day and Black Friday, and whether you should hold off until November for that big purchase.",
    "While both sales tend to touch upon the same devices and gadgets, there are several key differences between Amazon Prime Day and Black Friday that hold bearing over the quality of deals and whether you'll actually be able to get to them before they sell out.",
    "Prime Day is, obviously, primarily an Amazon event, which means most of the savings will be coming from one retailer with others working to compete against them. That means the deals are easier to find, and easier to price check, with a smaller number of retailers offering competing offers. That's much better if you're not interested in waiting around for an extra $5 off your Chromebook.",
    "However, Black Friday is a much larger event set across multiple retailers with far more variety. While that does mean you've got to cast a wider net, checking more stores and hoping your flash sale isn't beaten by another one in a few minutes, retailers are all competing with each other (rather than just Amazon), so we tend to see prices fall a little further.",
    "It's also worth noting that you'll need a Prime membership to take part in Amazon Prime Day. While that's not such a barrier to entry as it may seem (Amazon hands out free trials like candy in the run up to the event), Black Friday does see prices drop for all.",
    "That's where Black Friday loses its lead, though. As the biggest sale period of the year, it's incredibly competitive. In our coverage we've found that both Black Friday and Amazon Prime Day will offer deals on high profile items like MacBooks, iPads, and premium headphones, but limited stock deals run out incredibly quickly in November, and flash sales can happen anywhere.",
    "On Prime Day, flash sales are clearly signposted, with regular updates from Amazon throughout the event.",
    "Plus, Prime Day takes place over two days, with top deals released throughout the period. Black Friday offers are starting earlier and earlier these days, but the best deals are still concentrated on a single day, with Cyber Monday picking up any offers that haven't run out of stock yet.",
    "All of that means that, while prices may be slightly lower on Black Friday, you're more likely to actually get your hands on a deal over Prime Day, without the stress of dwindling stock numbers forcing you to make such a speedy decision.",
    "Amazon Prime Day and Black Friday also operate slightly differently from product to product, which means you're better off seeking out some gadgets in one sale than you would be another. To help you decide when to take the leap, we're running through some common items that we've been tracking for the last few years just below.",
    "If you're shopping in the budget range, you'll likely find lower prices on TVs over Black Friday. Last year's cheapest set would have cost you $88 in November (a Sceptre 32-inch 720p display), with Prime Day's lowest price sitting at $149.99 on a Toshiba 32-inch smart TV. Interestingly, though, Prime Day's budget options were actually offering better value for money, with far more up to date specs and apps.",
    "However, once we turn our attention to 4K displays, we do see far more stable pricing in Prime Day TV deals (units are cheaper, in stock for longer, and big discounts aren't part of fast flash sales). A Hisense 43-inch 4K TV cost just $219.99 over Prime Day, with the cheapest 4K display worth your time on Black Friday coming in at $267.99 (a Samsung 43-inch 7-Series).",
    "There is a slight caveat here, though. You're more likely to find discounts on bigger brands in Black Friday TV deals, as Amazon tends to stick to its own exclusives a lot more on Prime Day. We do see the likes of LG and Samsung getting involved during the summer event, but not at prices that would undercut Amazon's cheaper Fire-enabled displays.",
    "Outside of this cheaper realm, though, pricing strategies are fairly similar between the two events, especially now that more retailers are jumping on Amazon's Prime Day period.",
    "Timings do mean that the year's newest releases may be a little too fresh for Prime Day discounts, before dropping a little further in price for Black Friday. However, if you don't care about that slight processor or audio upgrade, Prime Day is better for last year's models as they're largely off the shelves by November.",
    "Amazon itself doesn't do laptops particularly well, though we do see plenty of other retailers jumping on this weakness during Prime Day, offering a wide range of laptops deals. Without that extra competition in the summer, though, we tend to see better laptop deals over Black Friday.",
    "In fact, Black Friday laptop deals are particularly notorious and you'll find a massive range of prices up for grabs at a range of retailers, with specs that offer better value for money than those found at Amazon over Prime Day as well. Last year, for example, $399 could get you a 14-inch HP with an AMD Athlon Silver processor, 4GB RAM and a 128GB SSD over Prime Day. However, on Black Friday we spotted a $359 price tag on a 14-inch HP with a 10th gen i3 processor, 8GB RAM and a 256GB SSD.",
    "With all that said, though, last year's offers may not be too representative. The pandemic had largely wiped out stock of cheaper laptops, and retailers weren't too keen on discounting these budget buys considering demand was surging. We expect cheaper deals to be available this year, and considering other retailers will be in a better position to up their game in the summer, it's still worth keeping an eye on Prime Day laptop deals.",
    "Plus, these super low Black Friday prices tend to come courtesy of very brief flash sales. We see more limited-stock discounts on laptops than any other device over Black Friday, with incredible offers sometimes selling out in a matter of minutes. That means that, while the prices may wildly lower in November, your chances of actually buying the best deal on the machine you're looking for are also diminished significantly.",
    "In general, we do see Black Friday offering lower prices on headphones, with the AirPods Pro clocking in at $189.99 last November compared to Prime Day's $199.99 price.",
    "However, it's worth noting that headphones tend to hold their value a lot longer than laptops and TVs. That means price differences between the two sales are far less severe, as was the case with that $10 change on the AirPods Pros. In fact, we see prices simply returning to their Prime Day positions just as often as we see them drop further over Black Friday. That's usually the case on older models like the Bose QuietComfort II. These headphones may bottom out at a certain price, where retailers are unable to sell them for any less until a new version appears.",
    "What wins this game for Prime Day headphone deals, though, is that additional competition in November. Colors that are more popular tend to sell out far quicker, and usually not at the lower prices of other versions. Take the Beats Solo Pro, for example. Last year we only saw Prime Day prices drop to $199 at Best Buy, however come November you could pick up a pair for $169 - just not the black or white ones. Those colorways sold out far quicker over Black Friday at their original Prime Day $199 cost, with the remaining colors like the lighter blue model dropping their prices by an extra $30.",
    "On the face of it, then, Black Friday does offer better headphone prices, but you're less likely to get the best deal for you considering the crowds are much heavier. That means you should hold off until Black Friday if you're after the lowest price possible and you're willing to work for it, otherwise Prime Day is likely to offer an easier time and similar discounts.",
    "Last year's Amazon Prime Day was delayed to October, which eventually had a knock on effect on the quality of smartwatch deals up for grabs. That's because Samsung and Apple both launched their next generation of fitness trackers weeks before the delayed date. In Apple's case that meant very few discounts on the SE or Series 6, and a lack of stock on the older Series 5.",
    "However, by Black Friday these models had had some time to mature, if only a month or so, and we eventually saw a $40 discount on the Series 6 that beat Prime Day Apple Watch deals. While that does skew our understanding of what to buy when this year, those who missed out on smartwatch deals in 2020 will likely be rewarded with the offers on the table in 2021.",
    "Amazon Prime Day is back to its summer dates, now, and that means last year's generation will be well positioned for some extra discounts. If annual tradition rings true, Apple will launch its Series 7 in September. If you're after the Series 6, then, stock will likely have run out by the time Black Friday rolls around which means Prime Day will be looking to make a splash in order to tempt customers towards its current generation stock while it's still around.",
    "However, the Series 7 will have enjoyed a few months on the shelves before Black Friday, and will likely see a similar discount to last year's Series 6 offers.",
    "Many smartwatch brands follow this schedule of releases, though perhaps not quite as annually as Apple, however brands like Garmin, Fitbit and Samsung don't tend to pull their older generations of the shelves too quickly. That means you may find super low prices on any model that has been replaced in the months leading up to Black Friday, and we do see that Fitbit and Garmin devices in particular offer lower prices in November.",
    "In the budget end, however, you might as well pick up a new smartwatch in June. Once prices start hitting $120 / £120 there's a much smaller margin for discount and you won't be saving too much more come November.",
    "The best tablets like the iPad and Samsung Galaxy Tab range sell fast on both Amazon Prime Day and Black Friday, though you are more likely to make it to check out in the summer sale. Less competition and fewer flash sales to contend with mean you'll be able to beat the crowd a little easier in June.",
    "Plus, we've seen prices on big ticket items like the iPad Pro remaining the same over both Prime Day iPad deals and Black Friday iPad deals ($749 for the 11-inch, was $799, and $949 for the 12.9-inch, was $999) - though it should be noted this was when Prime Day took place in October and therefore much closer to Black Friday's November date.",
    "Black Friday does have more retailers in the game, some of which may have stock of older models with far lower prices and, unable to beat larger stores' discounts on newer models, offer bundled accessories for less as well.",
    "That's what happened on Black Friday last year, with B&H Photo offering a 2018 256GB 12.9-inch cellular iPad Pro with a Magic Keyboard for $1,249, down from $1,648. If you weren't concerned with the latest upgrades that was a particularly enticing offer that wasn't around over Prime Day.",
    "When it comes to Samsung's offerings, last year's October dates meant that the S7 and S7 Plus weren't quite ready for discounts, and did much better over Black Friday as a result. In 2021, though, these tablets will be perfectly positioned for some blockbuster Prime Day discounts before any new models in September / October - new releases that won't have matured enough to offer the same level of saving over Black Friday.",
    "If you're looking for an 8th generation iPad or a Samsung Galaxy Tab S7, then, we'd recommend jumping on this month's Prime Day offers. iPad Pro hopefuls could hold off for a better price over Black Friday, or a bundle deal on an older model, but we don't tend to see significant discounts on these devices until a new generation is released, so extra savings in November could be minimal."
  ],
  "headers": {
    "3": "Amazon Prime Day vs Black Friday: what's the difference?",
    "11": "Amazon Prime Day vs Black Friday: what to buy when"
  },
  "links": {
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Prime membership": "https://www.techradar.com/deals/what-is-amazon-prime-your-guide-to-cost-free-trials-membership-benefits-and-more",
    "Prime Day TV deals": "https://www.techradar.com/amazon-prime-day/prime-day-tv-deals-2021",
    "Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals",
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals",
    "Prime Day laptop deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-laptop-deals",
    "Prime Day headphone deals": "https://www.techradar.com/amazon-prime-day/best-prime-day-headphone-deals",
    "Prime Day Apple Watch deals": "https://www.techradar.com/amazon-prime-day/best-prime-day-apple-watch-deals-2020",
    "Prime Day iPad deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-ipad-deals-sales-2020",
    "Black Friday iPad deals": "https://www.techradar.com/black-friday/black-friday-ipad-deals"
  }
}