{
  "source": "https://www.techradar.com/news/grand-theft-auto-the-trilogys-rumored-high-price-is-criminal",
  "title": "Grand Theft Auto: The Trilogy’s rumored high price is criminal",
  "category": "gaming",
  "updated": "2021-10-12T13:17:16Z",
  "author": "jamel-smith",
  "summary": "$70 for 20-year-old games?",
  "article": [
    "An online retailer has recently listed (and then removed) Grand Theft Auto: The Trilogy for $70/£70 (around AU$95) on PS5 and Xbox Series X/S. Rockstar has yet to confirm the official pricing for the trilogy, but if this leak is true, it means this remaster could be very expensive.",
    "The prices for last-gen console versions were also listed by the retailer at $60/£60 (around AU$80).",
    "On October 8, Rockstar announced Grand Theft Auto: The Trilogy, which includes remastered versions of GTA 3, GTA: Vice City and GTA: San Andreas. The Remaster will include graphical and gameplay enhancements for all three titles while maintaining the feel and look of the originals.",
    "With the announcement, Rockstar also confirmed that it’ll be removing the existing versions of the games on all platforms. So that means the only way to buy GTA 3, GTA: Vice City and GTA: San Andreas will be by buying GTA: The Trilogy.",
    "$70/£70/AU$95 pricing for new games has largely become the new normal. Rockstar’s parent company Take-Two Interactive was the first game company to announce $70 pricing for new game releases, with NBA 2K21. Take-Two said its customers were ready for the new premium price point, going on to say it thinks the “price is justified,” due to the value and the kind of experience players can have only on next-gen consoles. Take-Two then went on to note that the last time prices increased in the US was around 2005 and 2006, so customers should be ready for a price increase.",
    "Take-Two wasn’t the only publisher to adopt the new premium price for games, with Sony also raising prices.",
    "Before the PS5 was released last year, CEO of Sony Interactive Entertainment, Jim Ryan, defended the company’s decision to increase prices of new games to $70, saying he considered the new price tag as being “fair,” and pointing out the growing development resources needed for new ambitious games.",
    "Though many gamers were outraged by the new $70 price point, this anger hasn’t appeared to affect sales as new Sony and Take-Two games have maintained great sales numbers despite the price increase. For example, Ghost of Tsushima Directors Cut, a $70/£70 priced graphical upgrade with DLC for the PS5, debuted at number one on the UK boxed games sales chart in August.",
    "But the new premium price point is still annoying, to say the least. Should we really be paying $70/£70 for three games that came out nearly 20 years ago? Probably not. And semi-quoting Take-Two’s defensive comments, these games aren’t the experience players can only have on next-gen consoles, as we have completed these games a countless number of times since their original PS2 release.",
    "We’ll see if the graphical and gameplay upgrades will justify the supposed $70/£70 price point, but to be honest most people will still buy this trilogy anyway.",
    "Via Video Games Chronicle"
  ],
  "headers": {
    "4": "Opinion: $70 games, an unfortunate new normal"
  },
  "links": {
    "Grand Theft Auto: The Trilogy": "https://www.techradar.com/news/gta-trilogy-definitive-edition-proves-that-in-a-digital-world-no-classic-game-is-safe",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Take-Two said": "https://www.gamesindustry.biz/articles/2020-08-03-take-two-interactive-next-gen-software-price-increases-reflect-the-quality-of-the-experience",
    "defended the company’s decision": "https://www.techradar.com/news/sony-defends-price-of-ps5-games-but-says-it-wont-go-any-higher",
    "debuted at number one": "https://www.thegamer.com/ghost-of-tsushima-directors-cut-boxed-chart/",
    "Video Games Chronicle": "https://www.videogameschronicle.com/news/gtas-definitive-edition-remasters-could-cost-70-according-to-a-retailer/"
  }
}