{
  "source": "https://www.techradar.com/news/one-of-motorolas-best-cheap-phones-is-finally-on-sale-in-the-us",
  "title": "One of Motorola's best cheap phones is finally on sale in the US",
  "category": "phones",
  "updated": "2021-07-23T12:00:20Z",
  "author": "tom-bedford",
  "summary": "The Moto G100 is here",
  "article": [
    "Motorola is one of the biggest sellers of cheap phones in the US, with its affordable Moto G devices bringing great specs at low prices, and one of the top Moto phones is finally on sale.",
    "This is the Moto G100, which went on sale in April in other regions; we don't know what caused the delay, but it's finally here and available to buy.",
    "The Moto G100 costs $599.99, though at the time of writing it's available for $100 less as part of a launch deal. You can pick it up via Motorola's website, for an unlocked model.",
    "Why the high price for a 'cheap phone'? Well, besides the phone you're also getting a dock and cable for Ready For - this is Motorola's DeX-style multitasking application, so you can plug the phone into a TV, monitor or another screen to unlock extra functions like gaming or big-screen streaming.",
    "This is definitely the priciest member of the Moto G line though.",
    "We wouldn't be writing this article if the Moto G100 wasn't worth buying - if you want a budget phone that has strong specs across the board, it's a great option.",
    "Worth noting is the phone's Snapdragon 870 chipset, which is impressively powerful for a Moto G phone, and it ensures the device is quick for gaming, video editing, multitasking and more.",
    "There are three rear cameras here as well as two front ones, which gives you versatility for selfies, and the screen is big at 6.7 inches across.",
    "We gave the Moto G100 three and a half stars out of five in our full review, which is a good but not stellar score. The reason? Well, the inclusion of Ready For means you're paying extra for a service you might not necessarily use. Oh, and the thing is fairly slow to charge.",
    "Still, at this price, there are few handsets as powerful as the Moto G100, and some people might find Ready For super useful. We'll let you be the judge - read our full Moto G100 review here."
  ],
  "headers": {
    "5": "Is the Moto G100 worth buying?"
  },
  "links": {
    "cheap phones": "https://www.techradar.com/best/best-cheap-phones",
    "Moto phones": "https://www.techradar.com/news/best-moto-phones",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Motorola's website": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-3477503962417410600&url=https%3A%2F%2Fwww.motorola.com%2Fus%2Fsmartphones-moto-g100%2Fp%3FskuId%3D627&article_name=One%20of%20Motorola's%20best%20cheap%20phones%20is%20finally%20on%20sale%20in%20the%20US&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fone-of-motorolas-best-cheap-phones-is-finally-on-sale-in-the-us",
    "Ready For": "https://www.techradar.com/news/ready-for-what-is-motorolas-dex-alternative-and-how-does-it-work",
    "full Moto G100 review here": "https://www.techradar.com/reviews/moto-g100-review"
  }
}