{
  "source": "https://www.techradar.com/news/some-juicy-amd-ryzen-5000-gaming-laptop-processors-have-just-appeared-online",
  "title": "Some juicy AMD Ryzen 5000 processors have just appeared online",
  "category": "computing",
  "updated": "2021-01-06T18:33:53Z",
  "author": "john-loeffler",
  "summary": "AMD has some new APUs coming",
  "article": [
    "A listing online indicates that AMD has a pair of new Ryzen SKUs coming, including the Ryzen 9 5980HX for laptops.",
    "The listings appeared on the USB Implementers Forums website this week ahead of CES 2021, possibly offering a preview of what AMD has planned for the new year. The listings for a Ryzen 9 5980HX indicate a new mobile APU while another listing for a Ryzen 7 5700G indicate a desktop Cezanne processor.",
    "Both APUs would be build using AMD's new Zen 3 processing architecture and should feature at least eight cores and 16 threads, according to Videocardz, but actual specs of the APUs weren't listed so that's just speculation for now.",
    "Hopefully we'll see more next week when AMD presents its keynote CES address where it's expected that they will announce their Ryzen 5000H-series processors along with new graphics cards and desktop processors.",
    "Even though AMD has finally caught up to Intel in desktop CPU market share, they are still way behind on the laptop front, where Intel claims more than 80% of the market.",
    "With the success of their desktop processors and the continued growth of the laptop market, 2021 might be the year AMD starts to focus more intently on the laptop side of things with their Cezanne APUs.",
    "Intel isn't likely to give ground as easily here though, as they are expected to announce new Tiger Lake processors during CES as well and with Intel Evo showing real promise, they aren't in as precarious a position on the mobile computing side of things as they are with desktops."
  ],
  "headers": {
    "4": "AMD mobile CPUs still lagging behind Intel"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "Ryzen 9 5980HX": "https://www.usb.org/single-product/3972",
    "Ryzen 7 5700G": "https://www.usb.org/single-product/4400",
    "Cezanne": "https://www.techradar.com/news/amd-cezanne-leak-hints-at-next-gen-laptop-cpus-with-rdna-2-graphics-that-go-for-intels-jugular",
    "Videocardz": "https://videocardz.com/newz/amd-ryzen-9-5980hx-and-ryzen-7-5700g-apus-appear-on-usb-if-website",
    "AMD has finally caught up to Intel": "https://www.techradar.com/news/amd-overtakes-intel-in-desktop-cpu-market-share-for-the-first-time-in-15-years"
  }
}