{
  "source": "https://www.techradar.com/news/jupiters-legacy-is-the-subversive-superhero-tv-show-netflix-needs-right-now",
  "title": "Jupiter’s Legacy is the subversive superhero TV show Netflix needs right now",
  "category": "entertainment",
  "updated": "2021-05-07T07:02:00Z",
  "author": "tom-power",
  "summary": "The Millarworld is off to a strong start on Netflix",
  "article": [
    "Superhero-led TV series have been more of a rarity on Netflix recently. The successful adaptation of The Umbrella Academy aside, productions centered on superpowered people have been scarce on Netflix since it canceled the last of its interconnected Marvel TV shows in February 2019 - the odd exception like Melissa McCarthy's critically-panned Thunder Force aside.",
    "As rival superhero shows, including Amazon’s The Boys and Disney Plus’ WandaVision, pull in large viewing figures, Netflix required its own superhero universe. Purchasing Millarworld - writer Mark Millar’s comic empire - in August 2017 was Netflix’s attempt to muscle in on the increasingly congested superhero market, and its first TV offering is now ready to take flight.",
    "Jupiter’s Legacy is Netflix’s next post-Marvel superhero endeavour and, judging by its first season, it’s a real contender. Jupiter’s Legacy offers a fresh take on the established superhero formula with an unusual setting and unique characters, and does so without discarding what has made other superhero live-action adaptations so popular.",
    "Based on the comics created by Millar and Frank Quitley, Jupiter’s Legacy tells the story of the Union, the world’s first superhero group.",
    "After a century of protecting humanity, the Union’s remaining members - the Utopian (Josh Duhamel), Lady Liberty (Leslie Bibb), Brainwave (Ben Daniels) and The Flare (Mike Wade) - struggle to hand over their responsibilities to their unprepared superpowered children.",
    "As the next generation similarly wrestles with their parents’ high standards and legendary reputations, tensions arise between the groups - and it isn’t long before loyalties are truly tested when a seemingly unsolvable mystery threatens to ignite a superhero civil war.",
    "Jupiter’s Legacy isn’t your typical superhero origins story. Yes, the series reveals how the Union came into possession of their abilities, but it doesn’t do so formulaically. This part of the series is told in flashbacks, which take place around The Great Depression, and are intertwined with present day events across season 1’s eight episodes.",
    "The world of Jupiter’s Legacy, then, differs from Marvel, DC and other superhero movies and TV shows that audiences have become accustomed to. It’s more ‘What if Superman and Wonder Woman had kids but didn’t trust them to follow in their footsteps?’, rather than showing the duo at the peak of their powers. It’s a distinctive angle on superheroes that, like Zack Snyder’s take on Batman, shows that even superheroes can become world weary after years of fighting for the common good.",
    "While Jupiter’s Legacy tells the story of its first heroes decades into their careers, it doesn’t overlook themes that’ll be familiar to viewers. Legacy, family and culpability are just some of the topics that the series covers, and they’ll resonate with audiences regardless of its superhero slant.",
    "If there’s one main problem with Jupiter’s Legacy’s established universe, though, it’s that it throws viewers into the deep end when it comes to character introductions and setting up story threads.",
    "The series feels comic book-esque in its structuring, particularly with how its modern day events are spliced together with flashbacks, and it should be commended for that approach. This is a TV show based on a comic series, after all, so anything that harkens back to the source material’s panel structure is a welcome one.",
    "Still, it’s likely that many viewers won’t have read, or even be aware of, Millar and Quitley’s original works. The first couple of episodes may feel like a whirlwind for the uninitiated, with numerous characters introduced and a modern day plot that’s pretty breathless. Things settle down as the series progresses but, even then, it can be difficult to keep track of Jupiter’s Legacy’s many locations - it might’ve been helpful to put location names on screen - and individuals.",
    "That’s especially true of its supporting cast. Most are provided with little screen time and, in some cases, superheroes are introduced in a specific scene and then never seen in the series again. True, there needs to be a balance between moving the story forward and presenting these side characters to audiences in order to flesh out the world. However, it’s tough to feel for these individuals during emotional or perilous moments when you can’t remember who they are, or whether they’re meant to be good or bad.",
    "If the initial story or character introductions are hard to follow, what about the action? Jupiter’s Legacy’s set-pieces are good if not especially breathtaking, and do a fine job of exhibiting each hero or villain’s unique abilities.",
    "Fights are punchy and to the point, so don’t expect any third act Marvel or DC battles here. There’s one lengthy fight in the first episode, which feels like Infinity War’s Avengers vs. Thanos brawl, that’s expertly choreographed and examines the ramifications of being a superpowered being.",
    "It’s a shame, then, that this is the biggest and best fight in the series. While other showdowns make for fun watches, they feel more like skirmishes than physically demanding bouts. Sure, Jupiter’s Legacy is primarily a drama, so its action is always going to be secondary, but a couple of extra set-piece moments would’ve been nice to see.",
    "Accompanying its action, the show’s CGI elements are largely fantastic. There are a few moments in later episodes where the use of blue or green screen technology is noticeable, but thankfully these aren’t because of the superhero VFX portions. The transition from practical to superhero ability visuals is also seamless and, while that should be expected of a tentpole Netflix production, it’s pleasing to see the mark being hit.",
    "The series’ cast are generally marvellous, too. Jupiter’s Legacy’s main actors do a fine job of portraying how their individual characters are weighed down by varying expectations, with Duhamel particularly captivating as a disillusioned Superman-Captain America hybrid.",
    "Jupiter’s Legacy positions itself in an intriguing space in the superhero genre. In telling a story that focuses on the twilight years of the world’s most beloved superheroes, it stands apart from similar movie and TV properties. It’s a welcome change, too, from the usual origin stories that audiences already know, even though it still feels familiar in a few ways.",
    "There are missteps in earlier episodes but those flaws, lack of large-scale action and character introductions aside, are ironed out as the series progresses. Once they are, Jupiter’s Legacy reaches its full potential with its morally questionable characters, smart plot and philosophical themes. If a second season is forthcoming, Jupiter’s Legacy could be the answer to Netflix’s post-Marvel TV show prayers.",
    "Jupiter’s Legacy season 1 is now available to stream exclusively on Netflix."
  ],
  "headers": {
    "3": "Days of future past",
    "13": "Combat ready",
    "18": "What we think"
  },
  "links": {
    "The Umbrella Academy": "https://www.techradar.com/news/the-umbrella-academy-season-3",
    "The Boys": "https://www.techradar.com/news/the-boys-season-3",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained"
  }
}