{
  "source": "https://www.techradar.com/news/red-hat-snaps-up-container-security-experts-stackrox",
  "title": "Red Hat snaps up container security experts StackRox",
  "category": "computing",
  "updated": "2021-01-08T11:11:33.616Z",
  "author": "barclay-ballard",
  "summary": "The terms of the deal are undisclosed",
  "article": [
    "Open-source software developer Red Hat has announced its intention to acquire container security firm StackRox as part of a move that will see the company continue to support a secure, multi-cloud environment.",
    "Further details surrounding the purchase, including the price paid by Red Hat, have not been disclosed.",
    "StackRox has rapidly built up a strong reputation for delivering innovative Kubernetes-native security. The firm’s capabilities should fit well within Red Hat OpenShift, a hybrid cloud platform that offers a layered approach to container and Kubernetes security.",
    "“Securing Kubernetes workloads and infrastructure cannot be done in a piecemeal manner; security must be an integrated part of every deployment, not an afterthought,\" Paul Cormier, President and CEO at Red Hat, commented.",
    "“Red Hat adds StackRox's Kubernetes-native capabilities to OpenShift's layered security approach, furthering our mission to bring product-ready open innovation to every organization across the open hybrid cloud across IT footprints.”",
    "Kubernetes is one of the world’s fastest-growing open-source projects and gives users the ability to automate many of the manual processes involved in deploying, managing, and scaling containerized applications. However, container usage still faces a number of challenges in the enterprise space, particularly concerning security, monitoring, data management, and networking.",
    "With the purchase of StackRox, Red Hat aims to focus on refining Kubernetes’ native controls and creating a cohesive security solution across the entire IT stack. The partnership will also deliver enhanced security for developers, providing more safeguards for cloud-native development and operations (DevSecOps).",
    "\"By joining Red Hat, we will be able to accelerate product innovation and achieve far greater scale, on a global level, than we would be able to achieve as an independent startup,\" Stackrox wrote in a blog post.",
    "\"Red Hat sees the tremendous Kubernetes security benefits our customers have enjoyed, understands how security remains a top priority, and knows that together we can further increase the value we provide to our customers.\"",
    "For current users of StackRox, Red Hat has confirmed that the platform will continue to support a multitude of Kubernetes offerings, including Amazon Elastic Kubernetes Service, Microsoft Azure Kubernetes Service, and Google Kubernetes Engine. The acquisition is expected to close in the first quarter of the year, subject to regulatory scrutiny.",
    "Via TechCrunch"
  ],
  "headers": {
    "5": "Still open source"
  },
  "links": {
    "commented": "https://www.redhat.com/en/about/press-releases/red-hat-acquire-kubernetes-native-security-leader-stackrox",
    "TechCrunch": "https://techcrunch.com/2021/01/07/redhat-is-acquiring-container-security-company-stackrox/"
  }
}