{
  "source": "https://www.techradar.com/news/marvels-guardians-of-the-galaxy-game-could-repeat-avengers-biggest-mistake",
  "title": "Marvel’s Guardians of the Galaxy game could repeat Avengers’ biggest mistake",
  "category": "gaming",
  "updated": "2021-06-28T15:52:06Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Marvel’s Guardians of the Galaxy gives me déjà vu",
  "article": [
    "Candidly speaking, I don’t really like the Marvel franchise – or more specifically, the films.",
    "That may border on blasphemy in some circles, but I sort of rue the day that Marvel’s cast of characters leapt from the comic book pages and onto the big screen.",
    "To put things into perspective, I never made it to the end of 2014’s Guardians of the Galaxy film starring Chris Pratt and Dave Bautista, simply because I couldn’t stand to watch it any longer.",
    "Imagine my face, then, when I attended a confidential pre-E3 2021 briefing, only for the grand reveal to be a Guardians of the Galaxy game... To say I was disappointed was an understatement.",
    "But here’s the thing: despite my initial reservations (and underlying resentment of the Marvel Cinematic Universe clouding my judgment), I actually think that this original take on the Guardians of the Galaxy franchise could be right up my street – but I’m only cautiously optimistic for now.",
    "Marvel’s Guardians of the Galaxy is a third-person action-adventure game developed by Eidos Montreal and published by Square Enix. You play as Peter Quill, otherwise known as Star-Lord. He’s the same devilishly handsome and happy-go-lucky guy that’s depicted in the comics, and he’s the leader of a rag-tag team known as the Guardians. It’s your job to bring this band of misfits together and stop a chain of cataclysmic events from destroying the galaxy.",
    "At first glance, Marvel’s Guardians of the Galaxy looks a lot like Crystal Dynamic’s Marvel’s Avengers that was released last year, which may cause alarm bells to ring. Avengers was a multiplayer-focused action-RPG experience that wasn’t particularly well-received by fans or critics, mostly due to its repetitive gameplay and focus on arbitrary grinding. Seeing signs of its DNA in Marvel’s Guardians of the Galaxy, then, is cause for concern.",
    "Just like Marvel’s Avengers, the Guardians aren’t modelled on their Hollywood counterparts – which is slightly jarring at first. However, the Guardians who will accompany you on this galactic adventure – Rocket Raccoon, Drax the Destroyer, Gamora and Groot – are all presented with a painstaking-level of detail that helps make the lack of recognizable faces easier to overcome. Rocket in particular looks extremely convincing, as talking raccoons go.",
    "While the Guardians looking like cosplayers is a minor complaint that I think is easy to overcome, the biggest worry I have is the game’s combat. It looks uncomfortably close to the button mashing bore fest that was present in Marvel’s Avengers, and I really hope that’s not the case.",
    "I saw Star-Lord and co. unleash various powerful attacks as they fought against a variety of creatures and villains, taken from years of Galaxy of the Guardians history. You can also call upon your fellow Guardians to pull off spectacular and devastating moves, as they’ll always be battling by your side.",
    "It was all very flashy and stylish, and fans of Star-Lord will certainly get a kick out of being able to use his elemental blasters and hover boots in combat, or when traversing the game’s alien environments. But the admittedly brief footage I saw failed to convince me that the game’s combat won’t become overly repetitive after a few hours. Yes, you’ll be able to gain experience points after each encounter, rack up style points, and the usual skill tree containing countless new abilities to unlock will be present – but it’s nothing we haven’t seen before, and was one of the reasons so many grew tired of Marvel’s Avengers shortly after launch.",
    "Thankfully, the game’s story looks like it could be a real winner. Developer Eidos Montreal focused on delivering a single-player, narrative-driven experience, one that's influenced by your interactions with the other Guardians. You’ll be challenged to make decisions that can have light-hearted consequences or haunting repercussions, and the game’s dialog will react accordingly.",
    "For example, to activate a bridge on the other side of a chasm, Drax picks up Rocket with the intention of unceremoniously throwing him over. Before he does so, however, you’re given the choice as to whether he should chuck your furry friend or not. In the clip I saw, the decision was made to throw Rocket, which led to him being furious at your actions. How this situation plays out if you chose not to throw Rocket remains to be seen.",
    "Another section of the game included choosing which Guardian should be offered as a “prisoner” and why, with the dialog branching into multiple options for you to select. Interestingly, this decision could be undone at a later point, but every encounter was refreshingly organic and seemed to have a tangible cause and effect.",
    "It’s this side of the game that really appeals to me, as I found myself genuinely enjoying the banter of the Guardians, and was curious to see what the outcomes of future decisions could be. It should be noted, however, that the game’s beginning and ending will play out the same way, which some may find slightly disappointing. Still, there will be plenty of shenanigans leading up to that point that you can shape how you see fit.",
    "The Marvel Guardians of the Galaxy game has a lot of promise, then, even for someone who openly dislikes most Marvel content. That in itself is a small win for the game, but I expect that those who are positively mad about Marvel will be far more enamoured than I when the game releases on October 26, 2021 for PS5, PS4, Xbox Series X, Xbox Series S, Xbox One and PC."
  ],
  "headers": {
    "5": "Guardian angels",
    "11": "Talking therapy",
    "15": "Starry-eyed"
  },
  "links": {
    "Marvel": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Marvel’s Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales"
  }
}