{
  "source": "https://www.techradar.com/news/googles-ios-apps-havent-been-updated-in-over-a-month",
  "title": "Google's iOS apps haven't been updated in over a month",
  "category": "phones",
  "updated": "2021-01-06T12:45:34Z",
  "author": "barclay-ballard",
  "summary": "Could Apple's new privacy labels be to blame?",
  "article": [
    "Google has not updated the vast majority of its iOS apps for more than a month, leading to speculation that the company is not yet ready to comply with Apple’s new App Store Privacy Labels policy.",
    "Business media brand Fast Company noticed that Google last issued updates to its iOS apps on December 7, the day before Apple’s new policy came into force.",
    "However, further investigation suggests that there may be less to this story than meets the eye. TechCrunch reports that Google has, in fact, updated a couple of its apps (Socratic by Google and Google Slides) since the App Store’s new rules were imposed but did not include privacy labels.",
    "In addition, the lack of updates in December is not exactly unheard of. Many software developers slow down or stop issuing updates during the festive season, simply to give their employees some well-earned time off. Other major tech firms, including Amazon, have also been slow to adopt Apple’s new privacy labels.",
    "It’s worth adding that although Google may not be deliberately withholding updates so it does not have to comply with the App Store’s new rules, that doesn’t mean that the addition of privacy labels isn’t presenting something of a challenge for the technology firm.",
    "Google has a significant number of apps on the iOS ecosystem and compiling each one's privacy information will take time. It has been suggested that Apple may simply be showing Google a little leeway, giving the firm some extra time to get its privacy labels ready. A company spokesperson has stated that Google expects labels to begin rolling out later this week or next week at the latest.",
    "A prolonged lack of updates would normally be a cause for concern, particularly in terms of security, but the iOS operating system has its own robust security credentials in place to protect users. Updates to Google’s apps are likely to be forthcoming soon – along with those new privacy labels.",
    "Via TechCrunch"
  ],
  "headers": {
    "4": "Late labelling"
  },
  "links": {
    "Fast Company": "https://www.fastcompany.com/90591066/googles-ios-apps-havent-been-updated-in-weeks-apples-privacy-labels-could-be-the-reason-why",
    "TechCrunch": "https://techcrunch.com/2021/01/05/google-to-add-app-store-privacy-labels-to-its-ios-apps-as-soon-as-this-week/"
  }
}