{
  "source": "https://www.techradar.com/news/philips-hue-vs-wiz-which-smart-lights-are-right-for-your-home",
  "title": "Philips Hue vs WiZ: which smart lights are right for your home?",
  "category": "smart-home",
  "updated": "2021-09-20T11:51:40Z",
  "author": "carrie-ann-skinner",
  "summary": "Is Philips Hue a better choice than WiZ for your smart lighting?",
  "article": [
    "Adjusting the lighting in your home is a simple way to change the ambiance of a space. For example, if you’re working from home during the day, you may want a fresh, bright, clinical-type of light to help you concentrate, while when relaxing in the evening, a warm white shade similar to the hue created when the sun is setting will create a cozy atmosphere.",
    "Smart lights are the easiest way to achieve this. They replace your existing incandescent bulbs, allowing you to tweak the color via your smartphone, brighten or dim the bulb or even switch it on or off. So it’s no surprise that smart lights are one of the most popular smart home devices right now. According to market research firm Statista, the smart lighting market is projected to be worth $105.2bn by 2023, up from ‘just’ $8.68 billion in 2018.",
    "Philips Hue is one of the biggest names in the smart lighting market, but the parent company Signify, also owns WiZ, a little-known brand that comes in at a far more affordable price than its sibling. This may leave you in a quandary over which brand would best suit your needs – since not only do the bulbs look different, they connect to the internet in different ways and some of the features they offer differ too.",
    "Which you choose will really rather depend on whether you’re looking for inexpensive bulbs that offer simplicity, or whether you’re considering a long-term project of building smart lighting throughout your home.",
    "Read on to discover how these two smart lighting systems compare – or, if you’ve already decided on Philips Hue, check out the best available prices right now:",
    "Before we dive into the array of smart bulbs, ceiling, and table lamps Philips Hue and WiZ offer, it’s important to consider both bulbs’ brightness.",
    "Unlike incandescent bulbs, which are measured in watts, the brightness of LED bulbs is measured in lumens. These bulbs are more power-efficient than incandescent bulbs, and therefore use less energy. As a guide, an 800-lumen LED bulb emits the same level of light as a 60W incandescent bulb, while to replace a 40W bulb with light of a similar brightness, look for an LED option that offers 450 lumens.",
    "Philips Hue offers a range of smart LED light bulbs designed to replace your existing bulbs, along with LED table and floor lamps, indoor and outdoor wall lights, ceiling pendants, lightstrips and light bars. In addition, you also get accessories such as motion sensors, dimmer switches, and even a smart plug. In terms of brightness, Philips Hue bulbs and lights range from 500 to 1,600 lumens, depending on the model you choose. They’re available worldwide.",
    "Philips Hue smart light bulbs are available in both an Edison screw fitting (E27) and Bayonet fitting (B22), and in four color options. White is a static, 2,700K (a unit of color temperature called Kelvins) fairly warm light that can’t be tweaked, while White Ambiance allows you to adjust the shade of white, from 2200K (a warm, bright white) to 6500K (a cool, clinical glow). There’s also a range of Filament bulbs that offer a more vintage look. These emit a static 2,100K warm light. The White Ambiance option is due to hit shelves soon.",
    "Alternatively, Philips Hue lighting also comes in an option called Color and White Ambiance, which as well as the different hues of white, also offers 16 million different colors to choose from.",
    "WiZ’s range of smart lights is much smaller. Just like Hue, its bulbs are designed to replace your existing bulbs, while there are also a handful of ceiling lights, table lamps, a light strip, and a smart plug in its range. Unlike Hue, the brand doesn’t offer any outdoor smart lighting. Available in both an Edison screw fitting (E27) and Bayonet fitting (B22), ranging from 355 to 1,600 lumens, WiZ bulbs are on sale in the US and UK. Unfortunately, they’re not available in Australia.",
    "Wiz smart lights come in four different color options. Dimmable is a warm white light with a static 2,700K color temperature, and while the color can’t be tweaked, the light can be dimmed. Tunable White bulbs from WiZ can be dimmed, with the shade adjustable anywhere from 2700-6500K. Filament bulbs can also be dimmed, although only from 2000-5000K, which means this option doesn’t offer the cooler end of the spectrum.",
    "Finally, WiZ’s Full Color bulbs offer 16 million different shades of white and color to choose from.",
    "Note that the two brands differ in how their smart lighting connects to the internet. When Philips Hue first launched, the smart lighting required a hub to work. The Philips Hue Bridge relayed commands from your smartphone to the cloud and then back to the bulbs, so they could be controlled even when you weren’t at home. The bulbs didn’t have Wi-Fi built into them back then.",
    "More recent Philips Hue bulbs have Bluetooth built in, so they can be controlled via your smartphone when you’re in the same room. This makes them more affordable – but you’ll still need a Hue Bridge if you want to control the lights when you’re not close by, or to access the benefits of accessories such as motion sensors to trigger the lights automatically.",
    "However, WiZ smart light bulbs connect directly to your home Wi-Fi network and are controllable when you’re close by or when you’re out.",
    "So just how much will you have to spend to automate the lighting in your home? WiZ’s smart light bulbs are slightly more affordable than those from the Philips Hue range, but we’ve found that the Hue bulbs are more reliable and offer some features that WiZ doesn’t – which, in our eyes, makes them worth the extra money.",
    "Philips Hue White bulbs are priced at $14.99 / £14.99 / AU$34.95, while the White Ambiance single bulbs will set you back $24.99 / £24.99 / AU$54.95. The colored versions are priced at $49.99 / £49.99 / AU$99.95. Starter kits, which comprise two bulbs and a bridge, cost $69.99 / £119.99 / AU$159.99 for the white version and $119.99 / £129.99 / AU$179.99 for the color options.",
    "Side lamps are priced from $69.99 / £69.99 / AU$164.95 while wall lamps will set you back from $64.99 / £64.99 / AU$164.95. Lightstrips cost from $69.99 / £69.99 / AU$134.95.",
    "Prices for WiZ bulbs start from $8.99 / £9.99 for a non-tunable white option and rise to $10.99 / £11.99 for tunable white. The colored bulbs are priced at $13.99 / £14.99 and filament bulbs will also set you back from $13.99 / £12.99.",
    "You can expect to pay from $25.99 / £29.99 for ceiling lights, while lightstrips are priced at $13.99 / £39.99 and table lamps cost from $55 / £49.99.",
    "Both Philips Hue and WiZ offer the basic functions you’d expect to see from smart lights. You can switch the bulbs on and off from your smartphone, dim the brightness and change the color. When we put them to the test, both brands responded instantly when controlled via the relevant smartphone app.",
    "You can also create groups of lights that can be controlled simultaneously. In the case of Philips Hue that’s 10 lights, or 50 lights if you’re using a Philips Hue Bridge. WiZ says the maximum number of lights you can group together depends upon how many Wi-Fi devices your router can support, and the number you already have in your home. It added that it was possible to group as many as 200 together.",
    "During testing, we found both apps easy to use. Plus, integration with Amazon Alexa, Google Assistant and HomeKit means no matter which voice assistant you’re using in your smart home, the smart lights will integrate easily, allowing you to use your voice or the smartphone app for control.",
    "However, Philips Hue lights have more robust customization options. For example, you can set outdoor lights to come on at sunset but go off at 2am, rather than waiting for sunrise, whereas WiZ lights can be set to schedule, but this can only be time-based. Philips Hue also offers multi-user geofencing, so the app will check to see if others are home first before activating location-based automations, whereas WiZ doesn’t offer any geofencing capability. Finally, Hue Labs provides access to features created by third parties for the Hue lighting system – again, this isn’t something WiZ offers.",
    "Both systems also offer a Circadian Rhythm feature that sees the lights gradually brighten in the morning with cool tones, becoming more neutral and brighter during the day, then dimming and taking on a warmer tone in the evening, to mimic natural light. This feature is more simplistic and easier to use in the WiZ app, whereas Philips Hue bulbs offer the ability to customize this to suit your routines. For those that are new to smart lighting, the Hue app’s offering might become a little confusing",
    "Both Philips Hue and WiZ are easy-to-use smart lighting systems that make automating the lights in your home a breeze. Philips Hue offers a wider array of smart lighting, a more stable internet connection, and better customization when it comes to home automations. For those looking to really make the most of smart lighting, these are the bulbs to go for.",
    "WiZ, meanwhile, is the more affordable option. It’s simple to set up, since it doesn’t require a bridge, which will appeal to those just starting out on the road to automating their lighting, and don’t want a myriad of options they have to customize."
  ],
  "headers": {
    "4": "Best Philips Hue deals",
    "5": "Range",
    "16": "Price",
    "21": "Features",
    "26": "Verdict"
  },
  "links": {
    "Smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "Statista": "https://www.statista.com/statistics/813066/world-smart-lighting-market-revenue/",
    "Philips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review"
  }
}