{
  "source": "https://www.techradar.com/news/ios-145-beta-3-just-revealed-another-tweak-coming-to-your-iphone-soon",
  "title": "iOS 14.5 beta 3 just revealed another tweak coming to your iPhone soon",
  "category": "phones",
  "updated": "2021-03-03T09:45:59Z",
  "author": "james-peckham",
  "summary": "Remarkably similar to beta 2. but one key change",
  "article": [
    "The next iPhone update - that's iOS 14.5 - is likely coming soon, and a third beta for the software has revealed another tweak you can expect in the upgrade alongside mask support for Face ID and other changes.",
    "The iOS 14.5 beta 3 enables a new tab within the Find My app called 'Items'. At WWDC 2020, Apple revealed it would bring in support for third-party tracking accessories that could be connected through this element of the app.",
    "What are third-party tracking accessories? Think of products like Tile, which is a Bluetooth tracker that allows you to keep an eye on your keys or other personal items. This change may mean these sorts of products can be tracked within Apple's own software rather than a separate Tile app.",
    "This is also a big sign that Apple is moving toward making its Apple AirTags trackers, a longer rumored competitor to Tile, available in the near future. Could we see them launch at the company's rumored March event? That's certainly a possibility alongside products like the rumored iPad Pro 2021.",
    "Little else changes in beta 3 for iOS 14.5, and that's a good sign that the final update may be landing soon on smartphones around the world.",
    "iOS 14.5 is set to be a relatively large upgrade, bringing the option to change your default music player on your iPhone, better app tracking transparency and support for both PS5 and Xbox Series X controllers.",
    "An exact release date for iOS 14.5 is currently unclear, and the latest iOS 14.4 is only around a month old at time of writing. If Apple's previous upgrades are anything to go by, we may be waiting until near the end of the monthMarch for Apple's final software to land.",
    "Via 9to5Mac"
  ],
  "headers": {},
  "links": {
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "mask support for Face ID": "https://www.techradar.com/news/ios-145-will-provide-a-great-excuse-to-buy-an-apple-watch-mask-support-for-face-id",
    "Tile": "https://www.techradar.com/news/bring-it-on-says-tile-amid-apple-tracker-rumors",
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "rumored March event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "9to5Mac": "https://9to5mac.com/2021/03/02/ios-14-5-beta-3-enables-new-items-tab-in-find-my-to-track-airtags-and-third-party-accessories/"
  }
}