{
  "source": "https://www.techradar.com/news/live-text-is-no-longer-exclusive-to-m1-macs-but-what-is-it",
  "title": "Live Text is no longer exclusive to M1 Macs - but what is it?",
  "category": "computing",
  "updated": "2021-07-29T16:33:16Z",
  "author": "daryl-baxter",
  "summary": "Live Text now available to all",
  "article": [
    "The latest beta release of macOS 12 Monterey has made the Live Text feature available to Macs running on Intel hardware, as well as Apple’s own M1 chip.",
    "Apple’s newest macOS version brings more refinements to the Mac, such as SharePlay and Shortcuts to further improve your workflow. It builds on last year’s redesign with macOS 11 Big Sur, but also looks to improve how you use and share your content, which is where Live Text comes in.",
    "While it was generally accepted that certain features would only be possible on an M1 Mac, Apple has seemingly answered the prayers of some Intel users and made Live Text available to all.",
    "When you view a document, you may want to highlight the text and copy it into an email or even a tweet, but as it’s an image, you’re reduced to manually transcribing it, wasting time.",
    "With Live Text, if you’re using your iPhone or iPad, you can take a photo of a menu, for example, and Live Text will let you copy and paste the menu’s text into another app.",
    "It’s similar to Google Lens, and now that it’s going to be available in the Intel version of macOS 12 Monterey, due out in the end of 2021, it gives even more users an opportunity to copy and paste text from an image with ease.",
    "According to prolific YouTuber Rene Ritchie, Apple had heard the requests and in-turn found a way for Live Text to work without the M1 chip.",
    "Apple is still committed to releasing new Macs with Intel chips – for the next few years, at least. While the PowerPC transition in 2005 lasted under a year, this time it looks like it will be much longer, especially with the pandemic delaying plans across the industry - Apple included.",
    "It was surprising to already see features exclusive to M1 Macs only a year after the transition was confirmed, but with further rumors of an M1X MacBook Pro being delayed until October this year, users are curious to see if there’s other exclusive features heading to Monterey that we don’t know about.",
    "After my 2013 MacBook Air finally gave up the ghost in May, I’ve been waiting for a new MacBook Pro with baited breath, especially with the rumors that slots for HDMI and SD cards are returning, alongside the phasing out of the Touch Bar.",
    "However, for those still contently using Intel Macs, it’s encouraging to see Apple go the extra mile to make Live Text work on these machines, and it may be a small hint that the Apple Silicon transition may take a little longer than the 2022 date that was previously announced.",
    "Via MacRumors"
  ],
  "headers": {
    "3": "What is Live Text?",
    "7": "Analysis: Still life in the Intel Macs yet"
  },
  "links": {
    "macOS 12 Monterey": "https://www.techradar.com/news/macos-12",
    "macOS 11 Big Sur": "https://www.techradar.com/news/macos-11-big-sur",
    "would only be possible": "https://www.techradar.com/news/apples-new-macos-monterey-brings-features-to-m1-macs-only",
    "Google Lens": "https://www.techradar.com/how-to/how-to-use-google-lens-on-your-iphone-or-ipad",
    "M1X": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "MacRumors": "https://www.macrumors.com/2021/07/27/macos-monterey-live-text-intel-based-macs/"
  }
}