{
  "source": "https://www.techradar.com/news/ipad-mini-6-sounds-more-and-more-like-a-pint-sized-ipad-pro-every-day",
  "title": "iPad mini 6 sounds more and more like a pint-sized iPad Pro every day",
  "category": "tablets",
  "updated": "2021-07-20T14:03:42Z",
  "author": "tom-bedford",
  "summary": "Peripheral support and USB-C",
  "article": [
    "The iPad mini 6 must be, at this point, the most leaked iPad that's still not released (we've been hearing information for about two years at this point). Recent rumors point to it looking quite similar to the iPad Pro, and a new report concurs.",
    "According to a source close to website 9to5Mac, the next iPad mini will have a USB-C port (dropping Apple's proprietary Lightning), smart connectors for clip-on peripherals, and the A15 Bionic chipset, which we'll probably see in the iPhone 13 further down the line.",
    "The first two pieces of information there make the new small-sized iPad sound useful as a portable workstation. USB-C will potentially make the iPad mini 6 charge quicker, as well as allowing it to work with a wider range of third-party extras, and transfer data quicker, the last of those being useful for using a portable hard drive alongside the slate. We've actually heard this change rumored already - a lot.",
    "A smart connector will let you connect keyboard folios and perhaps Magic Keyboards to the tablet, which would let you avoid relying on Bluetooth for these accessories (which can drain battery quickly, and doesn't always work right).",
    "We don't know about the A15 Bionic chipset just yet, though it likely won't be as powerful as the M1s used in iPad Pros. That's okay, though, because few people need that level of processing power.",
    "9to5Mac's report also briefly touched on the new iPad (2021), the next entry-level slate we're expecting. Apparently this will have a 10.2-inch screen, and may ditch the home button, aping the iPad Air 4's move.",
    "Some rumors suggest the iPad mini 6 will also do this, which would result in every single one of Apple's iPads having a similar all-body screen with no huge bezels at the side to house buttons.",
    "We'll have to see if this is the case - if the home button goes, all iPads will have to rely on Apple's troublesome Face ID, or copy the iPad Air 4 and have Touch ID in side-mounted buttons instead."
  ],
  "headers": {
    "5": "Also, entry-level iPad"
  },
  "links": {
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "9to5Mac": "https://9to5mac.com/2021/07/20/new-ipad-mini-exclusive-a15-processor-usb-c/",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review"
  }
}