{
  "source": "https://www.techradar.com/news/microsoft-will-update-windows-10-with-new-features-every-year-matching-windows-11",
  "title": "Microsoft will update Windows 10 with new features every year, matching Windows 11",
  "category": "computing",
  "updated": "2021-11-17T11:23:52Z",
  "author": "allisa-james",
  "summary": "November 2021 was the latest update",
  "article": [
    "Microsoft announced that it’s planning to push down Windows 10 feature updates annually, which will match it with the update rate for Windows 11. This year’s Windows 10 update was released today, with the next one set for the second half of 2022.",
    "“We will transition to a new Windows 10 release cadence to align with the Windows 11 cadence, targeting annual feature update releases,” according to Microsoft’s head of Windows servicing and delivery, John Cable.",
    "Despite all the hype surrounding this release schedule, this year’s update is rather minor with the only major feature of note being GPU compute support in the Windows Subsystem for Linux (WSL). The 2022 update content hasn’t been revealed at this time but Microsoft has made it clear that at least one version of the OS will be supported until October 14th, 2025.",
    "It seems that as Microsoft continues to support Windows 10, the company has been rolling out Windows 11 at a rapid rate. At first, this seems at odds with each other, but when considering how long it takes for users to adapt to a brand new OS the decision makes sense.",
    "Earlier this month Windows 10 received the redesigned Microsoft Store through the Insider Program — the very same one that 11 launched with — while it rolled out for the November 2021 update for everyone else. And back in April, it was announced that DirectX 12 would not be tied to Windows 10 updates but instead be made available to every version of the OS.",
    "Microsoft does seem to be encouraging Windows 10 users to make the upgrade through the PC Health Check app on their devices, allowing those who use it to see whether they can run Windows 11.",
    "But the fact remains that many of those devices aren’t actually able to make the switch thanks to fairly strict requirements. Meaning that it’s important for the tech giant not to alienate current Windows 10 users, and the best way to do so is by ensuring that they still receive full support well into the future.",
    "Via The Verge"
  ],
  "headers": {
    "3": "Analysis: There’ll still be support for Windows 10, for a while anyway"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 11": "https://www.techradar.com/reviews/windows-11",
    "redesigned Microsoft Store": "https://www.techradar.com/news/windows-10-is-getting-windows-11s-new-microsoft-store",
    "DirectX 12": "https://www.techradar.com/news/microsofts-big-change-to-windows-10-updates-will-be-great-news-for-gamers",
    "encouraging Windows 10 users": "https://www.techradar.com/news/microsoft-is-already-getting-pushy-about-windows-11",
    "fairly strict requirements": "https://www.techradar.com/news/windows-11-system-requirements-is-your-pc-compatible",
    "The Verge": "https://www.theverge.com/2021/11/16/22785452/microsoft-windows-10-future-feature-updates-annual-2022"
  }
}