{
  "source": "https://www.techradar.com/news/the-samsung-sero-tv-probably-wont-get-a-successor-heres-why",
  "title": "The Samsung Sero TV probably won't get a successor – here's why",
  "category": "televisions",
  "updated": "2021-02-05T15:51:01Z",
  "author": "henry-st-leger",
  "summary": "Samsung's rotating television may have been a misstep",
  "article": [
    "When the Samsung Sero TV released, it was thrilling to see a rotating television actually come to market. This wasn't just a kooky prototype, or a poorly constructed gimmick display, but a premium television designed with care and attention – and poised to ride on a wave of social media obsession through the likes of TikTok, Instagram, and more.",
    "It gets clearer every day, though, that the Samsung Sero is unlikely to have a future beyond its eyebrow-raising launch last year.",
    "There are a few things working against the success of the Sero. One is obviously the commercial viability of a rotating television. The Sero launched at $1,599 / £1,599 / AU$1,995 – with ongoing sales bringing that down somewhat in recent months – for quite a compact 43-inch screen.",
    "And despite the innovative design, it's also by nature difficult to simply slot into the average living room, working best when placed on the floor rather than a counter, and without the option to mount it on a wall (seeing as it comes with a built-in TV stand that doubles as a speaker).",
    "One of the more low-key announcements made by Samsung for its 2021 range is one of the most telling, too: the painting-inspired Samsung The Frame television will now be able to hang in portrait on a wall. This feature is only available on the 43-inch model, too – the same size as the Sero – making it a rather deft way of taking over the Sero's key functionality.",
    "Samsung has told us directly that the Frame wouldn't be getting any rotating features, per se – but having a permanent display on your wall for vertical social media videos and feeds makes a lot more sense than a bulky television that needs the space and components to mechanically shift in position.",
    "The final nail in the Sero's coffin, though, may have more to do with software than hardware. Samsung made headlines last year with a partnership with TikTok – which saw the social video platform so notorious for viral dance routines, sea shanties, and whatever else is trending that day get a smart TV app on new Samsung TVs (2018 models onward) across the UK and Europe.",
    "However, the Sero still doesn't have the app, despite being the only dedicated social media television in Samsung's range. It's set to come later in 2021, and the difficulty of making a native TV app that works in portrait, instead of landscape, is likely causing some delay – but it risks becoming irrelevant if its potential is fulfilled elsewhere.",
    "Now, in 2021, as the TikTok TV app moves to Android TVs, it's becoming clear that there is a push towards social experiences on televisions – but pursuing it through software expansion rather than dedicated hardware is a much easier path.",
    "These app expansions are still in their early days: the TikTok TV app has yet to come to the US, and we're yet to see Twitter or Instagram follow suit. But the social trend on TVs is moving ahead without the Sero, and we can't imagine it keeping up."
  ],
  "headers": {},
  "links": {
    "Samsung Sero": "https://www.techradar.com/reviews/samsung-sero-tv-review",
    "43-inch": "https://www.techradar.com/news/best-40-inch-tv",
    "Samsung The Frame": "https://www.techradar.com/news/should-i-buy-samsung-the-frame-tv",
    "partnership with TikTok": "https://www.techradar.com/news/new-samsung-tvs-are-getting-a-tiktok-app-heres-why-that-matters",
    "smart TV": "https://www.techradar.com/news/best-tv",
    "new Samsung TVs": "https://www.techradar.com/news/new-samsung-tv-2021",
    "TikTok TV app moves to Android TVs": "https://www.techradar.com/news/smart-tvs-get-social-with-new-tiktok-app-as-the-samsung-sero-gets-left-behind"
  }
}