{
  "source": "https://www.techradar.com/news/the-lord-of-the-rings-on-amazon-prime-has-an-official-synopsis-and-were-excited",
  "title": "The Lord of the Rings on Amazon Prime has an official synopsis, and we're excited",
  "category": "entertainment",
  "updated": "2021-03-01T18:12:40Z",
  "author": "samuel-roberts",
  "summary": "The Lord of the Rings TV show is starting to sound promising",
  "article": [
    "The Lord of the Rings is coming to Amazon Prime Video at some point in the future in the form of a mega-budget prequel TV series – and now, Amazon has confirmed the official synopsis for the show, which reveals locations we'll see in the series, as well as a tease that the show will focus on Sauron's rise to power.",
    "Set in the Second Age of Middle-earth – The Hobbit and The Lord of the Rings take place in the Third Age – the show will \"will take viewers back to an era in which great powers were forged, kingdoms rose to glory and fell to ruin, unlikely heroes were tested, hope hung by the finest of threads, and the greatest villain that ever flowed from Tolkien’s pen threatened to cover all the world in darkness\".",
    "The series will begin in a relatively peaceful time, and take us to locations like the Misty Mountains, the elf city of Lindon and the kingdom of Númenor – the latter of which casual Tolkien readers probably remember reading about in The Lord of the Rings' appendices, as well as being referenced by Elrond in The Fellowship of the Ring film. The Second Age also features in The Silmarillion. The large cast of the show will apparently feature both \"familiar and new\" characters.",
    "Originally reported by TheOneRing.net, we reached out to Amazon Prime Video to confirm the synopsis was authentic. They sent over this official copy for The Lord of the Rings on Prime Video:",
    "\"Amazon Studios’ forthcoming series brings to screens for the very first time the heroic legends of the fabled Second Age of Middle-earth's history. This epic drama is set thousands of years before the events of J.R.R. Tolkien’s The Hobbit and The Lord of the Rings, and will take viewers back to an era in which great powers were forged, kingdoms rose to glory and fell to ruin, unlikely heroes were tested, hope hung by the finest of threads, and the greatest villain that ever flowed from Tolkien’s pen threatened to cover all the world in darkness.\"",
    "\"Beginning in a time of relative peace, the series follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence of evil to Middle-earth. From the darkest depths of the Misty Mountains, to the majestic forests of the elf-capital of Lindon, to the breathtaking island kingdom of Númenor, to the furthest reaches of the map, these kingdoms and characters will carve out legacies that live on long after they are gone.\"",
    "Director JA Bayona (A Monster Calls, Jurassic World: Fallen Kingdom) worked on the show's pilot. TheOneRing also reports that seasons 1 and 2 will film back-to-back in New Zealand starting this month. As mentioned, a release date for The Lord of the Rings is unknown. A massive ensemble cast is planned for the show – indeed, back in December, Amazon confirmed 20 actors had been added to the show.",
    "If you need a way to pass the time, here's a nice interactive Middle-earth map on Amazon.",
    "It's hard to visualize what The Lord of the Rings looks like as a TV show, but you can expect it to be lavish: as has been widely reported, Amazon paid $250 million for the rights, with THR saying that the show has a five-season commitment.",
    "As a business move, it makes sense – especially in a landscape where Disney Plus is making 10 TV shows based on Star Wars, and 10 series based in the Marvel Cinematic Universe. Fighting for attention is what streamers have to do as the competition heats up, and nothing does that better than a universe that people are already familiar with."
  ],
  "headers": {
    "8": "The biggest bet in streaming right now"
  },
  "links": {
    "The Lord of the Rings": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "TheOneRing.net": "https://www.theonering.net/torwp/2021/01/12/110065-exclusive-official-show-synopsis-for-amazons-lord-of-the-rings-series/",
    "Amazon confirmed 20 actors": "https://www.techradar.com/news/the-lord-of-the-rings-tv-show-on-amazon-prime-video-just-added-20-cast-members",
    "nice interactive Middle-earth map on Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fadlp%2Flotronprime%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6653944195224996000-20",
    "THR": "https://www.hollywoodreporter.com/live-feed/how-lord-rings-tv-series-landed-at-amazon-not-netflix-1099213"
  }
}