{
  "source": "https://www.techradar.com/news/xiaomis-foldable-phone-set-for-possible-march-reveal",
  "title": "Xiaomi's foldable phone set for possible March reveal",
  "category": "phones",
  "updated": "2021-03-25T11:41:36Z",
  "author": "axel-metz",
  "summary": "Try not to flip out",
  "article": [
    "Xiaomi has teased the return of its Mi Mix lineup of smartphones, the next of which is expected to be the company’s premiere foldable phone, suggesting we could get a first official look at the folding device on March 29.",
    "We already expect to see the release of the Xiaomi Mi 11 Pro and Mi 11 Ultra at a ‘mega launch’ event at the end of the month, after leaked promotional material suggested as much, and now it seems we’ll be getting an official look at the return of the Mi Mix range, too.",
    "The news comes after Xiaomi took to Weibo to share promotional material for an upcoming Mi Mix device, with a tagline reading: “March 29 Xiaomi 2021 new product launch. We have something new to show you.”",
    "While confirmation of the launch date is written in English, Chinese text visible on the same material seems to read: “Xiaomi Mix, after two years, has returned strongly! With endless technical strength, we can live up to the expectations of hundreds of millions of users.” This text has been machine translated, but it’s pretty clear what it means.",
    "Of course, we don’t know for sure that this refers to the rumored Xiaomi Mi Mix 4 Pro Max, a device which would mark the company’s first foray into foldable phone technology, but we’re certainly set for the reveal of a new Mix-branded Xiaomi phone – the first since the launch of the Mi Mix 3 in 2019.",
    "The Mi Mix line was Xiaomi’s range of mid-range devices, and was likely scrapped as the company’s flagship Mi line also consisted of mid-range phones. However, in recent years, Mi devices have now become premium models, so there’s a space in Xiaomi’s line-up for a mid-range Mix up. This could imply the arrival of a new range of regular phones, then, rather than foldables.",
    "However, while it’s wise to temper expectations when it comes to foldable phone reveals, we’re fairly certain that Xiaomi’s first foldable device, whenever it arrives, will carry the Mix name.",
    "This comes after leaked prototype images revealed a visible Mix logo on the rear of a foldable phone, which further images suggested will be adopting an inward-folding design similar to the Galaxy Z Fold 2 and Huawei Mate X2.",
    "These photos also hint at a triple camera setup, aligned horizontally, of the sort we’ve seen on the Samsung Galaxy S21, though it’s likely that these represent placeholders in a very early design.",
    "We’ve seen tweets from industry insiders, too, suggesting that the upcoming foldable will bear the Mix name, including one from Ross Young, founder of Display Supply Chain Consultants.",
    "It seems likely, then, that the Mix device (or devices) Xiaomi is referencing in this latest promotional material may end up being the Mi Mix 4 Pro Max.",
    "Recent patents have also hinted at the Chinese company’s plans for a foldable device, so it seems the stars are finally aligning for a Xiaomi foldable reveal on March 29.",
    "Via GSMArena"
  ],
  "headers": {
    "6": "Mixing it up"
  },
  "links": {
    "‘mega launch’ event": "https://www.techradar.com/news/xiaomi-mi-11-pro-ultra-and-lite-launch-event-teased-coming-soon",
    "leaked promotional material": "https://www.techradar.com/news/xiaomi-mi-11-pro-and-ultra-launching-soon-to-rival-the-oneplus-9-pro",
    "Weibo": "https://weibo.com/xiaomishouji?refer_flag=1005050010_",
    "first foray into foldable phone technology": "https://www.techradar.com/news/xiaomis-mi-mix-foldable-phone-appears-in-more-leaked-images",
    "Mi Mix 3": "https://www.techradar.com/reviews/xiaomi-mi-mix-3-review",
    "leaked prototype images": "https://www.techradar.com/news/xiaomis-foldable-phone-was-spotted-in-public-and-its-got-a-big-problem",
    "further images": "https://www.techradar.com/news/xiaomis-mi-mix-foldable-phone-appears-in-more-leaked-images",
    "inward-folding design": "https://www.techradar.com/news/new-xiaomi-foldable-phone-may-mimic-samsung-galaxy-z-fold-2",
    "Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Huawei Mate X2": "https://www.techradar.com/news/huawei-mate-x2",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1366461247953072128",
    "Recent patents": "https://weibo.com/2430711645/K4MVFDfMd?from=page_1005052430711645_profile&wvr=6&mod=weibotime&type=comment#_rnd1615983949640",
    "GSMArena": "https://www.gsmarena.com/xiaomi_will_announce_new_mi_mix_device_at_march_29_event-news-48361.php"
  }
}