{
  "source": "https://www.techradar.com/news/kia-wont-be-making-the-autonomous-apple-car-but-it-might-make-the-apple-scooter",
  "title": "Kia won't be making the autonomous Apple car, but it might make the Apple scooter",
  "category": "car-tech",
  "updated": "2021-02-26T16:16:31Z",
  "author": "hamish-hector",
  "summary": "Where we're going, we don't need cars",
  "article": [
    "Despite previous reports that Apple's negotiations with Hyundai affiliate Kia had ended, it now appears that talks are back on. However electric car fans might still be a little disappointed as they're over a different kind of vehicle.",
    "It has now emerged that while the talks on the autonomous electric car have fallen through, there are still ongoing discussions about other electric vehicles between Apple and Kia. This information - coming via Reuters - suggests the pair could instead be working on \"last mile mobility\" - a vehicle that would carry you from your car to your destination. The most likely suspect is an electric scooter.",
    "This might seem a bit out of nowhere but Hyundai - Kia's sister company - is developing an electric scooter and has called it \"last mile mobility for the future\" on its YouTube channel.",
    "The same video shows the scooter emerging from a dedicated storage and charging space in the car, and being ridden by its user to their destination directed by a map on their smartphone.",
    "What seems odd about the rumor is that Hyundai's scooter isn't impressive when it comes to the hardware. Without a car, the scooter does not appear to be anything special, and it doesn't look like car partnership discussions have reopened between Apple and Kia or Hyundai.",
    "Some analysts have pointed out that the exact wording of the previous announcement was that negotiations had ended on an \"autonomous vehicles\" collaboration - leaving open the possibility of working together on a non-autonomous option - but Apple still seems set on a driverless car.",
    "Perhaps Apple could integrate a version of the scooter with its own separate vehicle, though what Hyundai would gain from that kind of partnership is yet to be seen - as it would lose the uniqueness of its product. For now, we'll just have to wait until a deal is made."
  ],
  "headers": {
    "4": "Scooting to success?"
  },
  "links": {
    "Apple's negotiations": "https://www.techradar.com/news/hyundai-kia-seem-to-have-called-off-talks-for-apple-car",
    "autonomous electric car": "https://www.techradar.com/news/apple-car",
    "Reuters": "https://www.reuters.com/article/us-autos-tech-apple-kia-motors-idUSKBN2AQ060",
    "electric scooter": "https://www.techradar.com/deals/best-cheap-electric-scooter-price-deals-sales",
    "YouTube channel": "https://www.youtube.com/watch?v=vEkr2e34m90"
  }
}