{
  "source": "https://www.techradar.com/news/intel-rocket-lake-cpus-supposedly-to-arrive-in-march-gigabyte-lets-slip",
  "title": "Intel Rocket Lake CPUs supposedly to arrive in March, Gigabyte lets slip",
  "category": "computing",
  "updated": "2021-01-08T10:13:33Z",
  "author": "darren-allan",
  "summary": "Press release seemingly revealed launch date, before being swiftly changed",
  "article": [
    "We’ve heard a whole bunch of rumors about how Intel’s next-gen Rocket Lake processors will be launched in March 2021, and Gigabyte would seem to have confirmed this intended release schedule in a press release – which the hardware maker swiftly altered after the news started spreading online.",
    "Gigabyte’s press release was an announcement of the fact that its Intel Z490 (PCIe 4.0) motherboards will support Intel’s 11th-gen (Rocket Lake) CPUs via a firmware update, before casually throwing in this nugget: “The latest 11th Gen. Intel Core processors will be launched on March 2021.” (As spotted by PC Mag).",
    "As mentioned, this sentence has since been changed, presumably after Gigabyte realized that somebody slipped up here, so it now reads: “The latest 11th Gen. Intel Core processors will be launched soon.”",
    "There have been quite a few rumors pointing to a March launch date, including most recently a post which was purportedly from an MSI rep which mentioned an intended end of March release.",
    "Certainly if the weight of all this speculation is anything to go by, it seems like a fair bet that Intel wants to push Rocket Lake out in just a couple of months. And that makes sense in terms of the company desperately needing an answer to Ryzen 5000 processors, not to mention that Alder Lake is supposed to be out later in 2021, so that wouldn’t leave much room for maneuver in the timeframe of getting 11th-gen chips on the shelves.",
    "Still, as we’ve said before, Intel might well be intending a certain launch date right now, but that could change – nothing is set in stone when it comes to a hardware launch, as we’ve seen plenty of times before. Furthermore, remember that in the past, Intel has indicated a Q1 2021 launch window, so March would make sense from that perspective, too.",
    "Gigabyte’s press release, incidentally, also makes it clear that the BIOS update which brings support for Rocket Lake to Z490 boards will also deliver the resizable BAR function (and that’ll come to H470 motherboards, too).",
    "That’s the feature which allows for a performance boost in games by giving the CPU full access to GPU memory, a neat trick which AMD first brought to light in the form of its Smart Access Memory (SAM) tech. According to some early testing, Intel processors could benefit from up to 20% performance gains in some games thanks to resizable BAR."
  ],
  "headers": {
    "4": "Blast off seems imminent?"
  },
  "links": {
    "rumors": "https://www.techradar.com/news/intel-rocket-lake-cpus-could-arrive-march-2021-too-late-to-combat-amd-ryzen-5000",
    "this nugget": "https://www.gigabyte.com/Press/News/1870",
    "PC Mag": "https://uk.pcmag.com/processors/130823/gigabyte-intels-rocket-lake-desktop-cpus-will-arrive-in-march",
    "There have been": "https://www.techradar.com/news/intel-rocket-lake-cpus-again-rumored-to-land-in-march-2021",
    "rumors pointing to a March launch date": "https://www.techradar.com/news/intels-next-gen-rocket-lake-cpus-could-be-here-sooner-than-you-think",
    "MSI rep which mentioned an intended end of March release": "https://www.techradar.com/news/intels-rocket-lake-cpus-could-arrive-in-march-to-combat-amd-ryzen-5000-threat",
    "Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000",
    "Alder Lake is supposed to be out later in 2021": "https://www.techradar.com/news/intel-alder-lake-processors-could-bring-big-changes-but-youll-have-to-wait-until-the-end-of-2021",
    "Smart Access Memory (SAM) tech": "https://www.techradar.com/news/amd-shows-intel-how-its-done-by-bringing-its-most-exciting-tech-to-older-motherboards",
    "Intel processors could benefit from up to 20% performance gains": "https://www.techradar.com/news/intel-cpus-could-see-up-to-20-performance-gains-from-amds-smart-memory-tech"
  }
}