{
  "source": "https://www.techradar.com/news/get-dollar550-off-the-rtx-3060-alienware-aurora-r12-with-this-black-friday-deal",
  "title": "Get $550 off the RTX 3060 Alienware Aurora R12 with this Black Friday deal",
  "category": "computing",
  "updated": "2021-11-27T00:50:50Z",
  "author": "john-loeffler",
  "summary": "Out of this world gaming at a fantastic price",
  "article": [
    "If you're looking for a great Black Friday PC gaming deal, look no further than this Alienware Aurora R12 gaming PC starting at just $1,289 over at Dell right now.",
    "Gaming PCs are usually among the more exciting Black Friday deals – especially higher end PCs like the Alienware Aurora – since the typical retail cost is higher than many can comfortably afford, and Black Friday is usually a great time to pick one up. (Not in the US? Scroll down for deals in your region).",
    "The recently redesigned Alienware Aurora R12 starts out with an Intel Core i7-11700F processor, an Nvidia GeForce RTX 3060 graphics card, 16GB RAM, and a 256GB SSD, making it more than capable of delivering outstanding 1080p gaming performance and even some great 1440p gaming with some less intense AAA titles.",
    "You can also customize the system to your liking on Dell's website and still save money this Black Friday, so play around with the different options and see what works best for you.",
    "No matter where you live, you'll find all the lowest prices for the Alienware Aurora R12 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "2": "Today's best Alienware Aurora R12 Black Friday deal",
    "4": "More Alienware Aurora R12 deals",
    "5": "More Black Friday deals"
  },
  "links": {
    "Black Friday PC gaming deal": "https://www.techradar.com/deals/best-black-friday-pc-gaming-deals-2019",
    "Alienware Aurora R12 gaming PC starting at just $1,289 over at Dell right now": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1542072414629088300/https://deals.dell.com/en-us/productdetail/bqop",
    "Gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "recently redesigned": "https://www.techradar.com/news/new-25th-anniversary-alienware-aurora-pc-will-turn-heads-while-offering-better-performance"
  }
}