{
  "source": "https://www.techradar.com/news/google-pixel-5a-or-pixel-watch-at-google-io-expect-significant-product-reveals-in-may",
  "title": "Google Pixel 5a or Pixel Watch at Google IO? Expect 'significant product' reveals in May",
  "category": "phones",
  "updated": "2021-04-28T09:01:47Z",
  "author": "balakumar-k",
  "summary": "Sundar Pichai drops a hint",
  "article": [
    "Alphabet, the parent company of Google, has just reported big earnings for Q1 of 2021, and the company's CEO used the announcement to tease that it will have “significant product updates and announcements” during Google IO 2021.",
    "Sundar Pichai said those words during the company's earnings report, but he didn't share any specifics on the products we can expect at the event. Google IO is set to take place between May 18 and May 20.",
    "Many are speculating this could mean we'll be seeing the Google Pixel 5a at the launch - a product that Google has already confirmed exists - and maybe an update on the long rumored Google Pixel Watch.",
    "Both Google's Pixel 3a and Pixel 3a XL were announced at the 2019 event, so this wouldn't be the first time we've seen the company announce new hardware during Google IO.",
    "Those handsets were unveiled during the opening keynote of the 2019 event, so we may see a similar thing during the 2021 show for whatever hardware the company decides to reveal.",
    "The event couldn't happen last year due to the pandemic, and Google has switched to a free-to-attend, virtual-only event for 2021.",
    "Apart from the Pixel 5a, another product that is triggering curiosity is Google's custom chipset called Whitechapel. Earlier leaks suggested it would be an octa-core ARM chip, likely made in collaboration with Samsung.",
    "It may be this is the chipset that would feature in the Google Pixel 6. There's no guarantee we'll hear about this during the launch, but it might be something the company decides to at least tease.",
    "There is also considerable speculation about the Pixel Watch, as we've seen a variety of leaks and rumors around the rumored smartwatch in recent months.",
    "We'd have expected even more leaks if it was landing imminently, but Google may tease or announce it at IO, and then actually release it much later in the year. If this wearable launches, it will be the first time Google has entered the smartwatch market.",
    "This is all speculation for now, but with Pichai teasing multiple products we may see a variety of reveals from across Google's mobile business.",
    "In the earnings call, Google announced a revenue of $55.31 billion, while Google Cloud saw its revenue touch $4.05 billion. YouTube ads came in at $6.01 billion during the quarter - a 49% rise from a year ago."
  ],
  "headers": {
    "3": "All eyes on Pixel 5a",
    "6": "Can we expect an announcement on Pixel Watch?"
  },
  "links": {
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Google Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6"
  }
}