{
  "source": "https://www.techradar.com/news/this-black-friday-laptop-deal-will-get-you-a-powerhouse-dell-for-less",
  "title": "This Black Friday laptop deal will get you a powerhouse Dell for less",
  "category": "computing",
  "updated": "2021-11-27T00:24:05Z",
  "author": "jackie-thomas",
  "summary": "$1,249 for an RTX 3060 laptop? Yes please",
  "article": [
    "Some Black Friday laptop deals force you to do a double take, and this Dell Inspiron deal is definitely one of those - even if it's generally a laptop just for creatives.",
    "Right now on Dell's website, you can get the Dell Inspiron 16 Plus for just $1,249 as a Black Friday deal, equipped with an Intel Core i7-11800H, 16GB of RAM, a 1TB SSD and most importantly, an Nvidia GeForce RTX 3060 - though it is just a 60W version.",
    "If you saw this laptop out in the wild, you might think it's pretty old at first glance, and that's largely because of who the Dell Inspiron 16 Plus is made for. Creative professionals that just need the horsepower will love the utilitarian design, and the ports on offer are plentiful - a USB-A and a SD Card slot in 2021?",
    "But even if you're not a creative professional, this laptop will be more than powerful enough to tear through most workloads, and the RTX 3060 in here will make it a pretty decent gaming laptop. Although, at just 60W, the RTX 3060 won't be the fastest version out there - saying that, it'll still be fast enough to play pretty much any PC game you throw at it (but at 1080p).",
    "No matter where you live, you'll find all the lowest prices for the Dell Inspiron 16 Plus from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "More Dell Inspiron 16 Plus deals",
    "5": "More Black Friday deals in the UK"
  },
  "links": {
    "Black Friday laptop deals": "https://www.techradar.com/black-friday/black-friday-laptop-deals",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "Black Friday deal,": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "PC game": "https://www.techradar.com/news/best-pc-games"
  }
}