{
  "source": "https://www.techradar.com/news/dell-set-to-spin-off-vmware-into-independent-company-also-selling-boomi-cloud-arm",
  "title": "Dell set to spin off VMware into independent company, also selling Boomi cloud arm",
  "category": "computing",
  "updated": "2021-04-15T11:01:21Z",
  "author": "mayank-sharma",
  "summary": "The demerger is expected to complete later in the year",
  "article": [
    "Dell Technologies has announced plans to spin off its majority stake in virtualization giant VMware into an independent company.",
    "The demerger was first proposed in a filing in July 2020, and is finally expected to close in Q4 2021, subject to regulatory approval.",
    "“By spinning off VMware, we expect to drive additional growth opportunities for Dell Technologies as well as VMware, and unlock significant value for stakeholders,\" company founder and CEO Michael Dell said in a statement.",
    "Founded in 1984, Dell initially went public in 1988, before one of the largest leveraged buyouts ever seen put it back into the private ownership of Michael Dell in 2013. After buying EMC, the company undertook a complex financial move to become public again to help the company raise funds.",
    "According to the release, post the VMware demerger, Michael Dell will stay on as chairman of VMware’s board, while Zane Rowe, the VMware CFO who became interim CEO following the departure of Pat Gelsinger to become Intel in January, will continue in the role while the company looks for a permanent replacement.",
    "The breakup is reportedly the latest in a series of moves by the tech giant to reduce its debt, most of which it inherited from its acquisition of data management firm EMC in 2016, which also brought along VMware. Dell’s 81% stake in VMware is valued at $52 billion.",
    "For the same reasons, Dell is also reportedly contemplating sale of its platform-as-a-service (PaaS) business Boomi. The company is said to be on the hunt for potential buyers for the cloud broker platform that’s said to be valued at up to $3 billion.",
    "Via: ZDNet"
  ],
  "headers": {
    "3": "Debt restructuring"
  },
  "links": {
    "Dell": "https://www.techradar.com/news/the-best-dell-laptops",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "VMware": "https://www.techradar.com/news/vmware-launches-new-multi-cloud-platform-to-accelerate-app-modernization",
    "departure of Pat Gelsinger": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo",
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "contemplating sale": "https://www.bloombergquint.com/markets/dell-is-said-to-explore-sale-of-boomi-cloud-business",
    "platform-as-a-service (PaaS)": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "cloud broker": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "ZDNet": "https://www.zdnet.com/article/dell-technologies-to-spin-vmware-into-independent-company/"
  }
}