{
  "source": "https://www.techradar.com/news/ipad-mini-2021-vs-ipad-mini-2019",
  "title": "iPad mini (2021) vs iPad mini (2019): which small tablet is the best one for you?",
  "category": "tablets",
  "updated": "2021-09-18T12:00:55Z",
  "author": "jennifer-allen",
  "summary": "A mini match",
  "article": [
    "With the iPad mini (2021) launching very soon, the older iPad mini (2019) immediately looks less appealing than it used to. However, does it still stand up to the test? Is it worth still buying the older iPad mini (2019) or should you stick solely to the iPad mini (2021) when looking for a new slate? We have the answers to these questions and more.",
    "As is generally the way with all things Apple, both the iPad mini (2021) and iPad mini (2019) are fairly respectable tablets in their own right.",
    "Thanks to some key upgrades, the iPad mini (2021) looks far more appealing now, but that doesn't mean that the iPad mini (2019) is a total write-off, especially as you should be able to find it for less than the iPad mini (2021), providing you know where to look.",
    "If you're struggling to decide whether to go for the pricier option or to play it safe with something older, we're here to help. We've looked at all the features and specs both tablets provide, as well as how their designs differ, so you can figure out which tablet is the one for you.",
    "The Wi-Fi only iPad mini (2021) starts at $499 / £479 / AU$749 for 64GB of storage. The price rises to $649 / £619 / AU$979 for 256GB of storage.",
    "If you want to go the cellular/5G route, expect to pay a bit more for the benefit of having an internet connection wherever you go. The iPad mini (2021) goes on sale on September 24, but you can pre-order it now from the Apple website.",
    "Buying the iPad mini (2019) is trickier than before as in typical Apple style, you can no longer buy the older slate directly from Apple. However, many retailers are likely to be selling off their remaining stock, so you may be able to find it at a considerable discount if you shop around.",
    "The iPad mini (2019) is available with 64GB of storage as standard or you can increase that to up to 256GB depending on the deal you find. We can't see it being sold for its standard launch price of $399 / £399 / AU$599 anymore.",
    "A lot has changed between the iPad mini (2021) and iPad mini (2019). Notably, the iPad mini (2021) has an 8.3-inch Liquid Retina display compared to the iPad mini (2019)'s 7.9-inch Retina display. That changes quite a lot for the dimensions of the tablets, but the iPad mini (2021) still manages to be smaller.",
    "While the iPad mini (2019) offers dimensions of 203.2 x 134.8 x 6.1mm, the iPad mini (2021) has a smaller height of 195.4mm followed by the same width and is ever so slightly deeper at 6.3mm. The iPad mini (2021) also offers an all-screen design with narrow bezels that ensure an edge-to-edge screen that looks far more appealing than the dated-looking iPad mini (2019).",
    "The Wi-Fi only iPad mini (2021) is also slightly lighter, weighing 293g compared to the iPad mini (2019)'s 300.5g. The cellular version of the iPad mini (2021) is similarly light at 297g, with the iPad mini (2019) weighing in at 308.2g. None of these differences are substantial but they're worth thinking about.",
    "Perhaps one of the biggest changes for the iPad mini (2021) is that it does away with the home button on the bottom. Now, Touch ID is conducted via the button at the top right hand corner of the device like with the iPad Air 4. The removal of the home button gives more room for the touchscreen and is a bit more elegant too.",
    "Looks wise, you also have more options with the iPad mini (2021), as it's available in four different colors compared to the iPad mini (2019)'s three options. The iPad mini (2021) comes in Space Gray, Pink, Purple, and Starlight, while the older iPad mini only offers Silver, Space Gray, or Gold.",
    "Other design changes include the iPad mini (2021) now using a USB-C connector compared to the iPad mini (2019)'s older Lightning connector. The iPad mini (2021) also supports the 2nd Generation Apple Pencil as well as all previous accessories.",
    "Plus, the iPad mini (2021) has superior speakers, with a stereo speaker system ensuring that sound is experienced in stereo even in landscape rather than the fairly flat tones of the older iPad mini (2019).",
    "Big changes have happened between the iPad mini (2019) and iPad mini (2021). The iPad mini (2021) has an 8.3-inch Liquid Retina display while the iPad mini (2019) has a smaller 7.9-inch regular Retina display. It makes a huge difference to how things look.",
    "Using an edge-to-edge display helps you focus on what's going on more too, which makes it far more practical, as well as stylish.",
    "Both screens offer a maximum brightness of 500 nits and a pixel density of 326 pixels per inch, but the iPad mini (2021) offers a resolution of 2266 x 1488, compared to the iPad mini (2019)'s 2048 x 1536. Both slates also have True Tone support and Wide Color (P3) display.",
    "The slight downside here is that the iPad mini (2021) still doesn't offer a 120Hz refresh rate. That remains the domain of the iPad Pro range, with both iPad minis continuing to offer 60Hz refresh rates. It's not the biggest of losses at this price though and browsing should still be fairly smooth.",
    "While it's unlikely you're buying a small tablet for the sake of its camera, the iPad mini (2021) is far improved here. It now offers a 12MP ultra-wide camera for the front snapper with an f/2.4 aperture, compared to the iPad mini (2019)'s less wide 7MP camera with an f/2.2 aperture. In addition, the iPad mini (2021)'s selfie camera supports Smart HDR 3 for photos.",
    "Best of all, the iPad mini (2021)'s front camera supports Center Stage - something we're seeing creep through on the latest devices, including the newly announced iPad 10.2 (2021) but it's a feature that was previously only on the iPad Pro 2021. It means the camera can follow you around while you take a video call, providing far better focus.",
    "The rear camera on the iPad mini (2021) also sees an upgrade, with a 12MP f/1.8 camera compared to the iPad mini (2019)'s 8MP camera and f/2.4 aperture. A quad-LED True Tone flash helps matters further for the iPad mini (2021).",
    "When it comes to video recording, the iPad mini (2021) is also superior because it now offers 4K video recording at 24fps, 25fps, 30fps or 60fps via the rear camera. Extended dynamic range for video up to 30fps is also possible. The iPad mini (2019) meanwhile tops out at 1080p.",
    "Battery life continues to be the same with the always somewhat vague promise of up to 10 hours of browsing or watching videos, or up to 9 hours if you're doing so via a cellular network.",
    "Specs wise, the iPad mini (2021) is miles ahead of the iPad mini (2019). A lot has happened in those two years and the iPad mini (2021) sports an A15 Bionic chipset (the same as the iPhone 13 range) making it much faster than the A12 Bionic in the iPad mini (2019).",
    "Apple reckons it's 40% faster in terms of CPU processing and 80% faster for the GPU compared to the iPad mini (2019). With a newer processor than even the iPad Air 4, the iPad mini (2021) is at its most appealing to those who want a fast but highly portable tablet.",
    "Elsewhere, the differences are less noticeable. Both the iPad mini (2021) and iPad mini (2019) are available with either 64GB or 256GB of storage, with the latter clearly the best option for future-proofing.",
    "Both tablets run iPadOS, with the iPad mini (2021) shipping with iPadOS 15 already installed - though the iPad mini (2019) will be updated to this imminently. As expected with any Apple tablet, apps should run fairly speedily thanks to good optimization.",
    "Finally, if you're keen to embrace 5G, you will need to plump for the iPad mini (2021). The iPad mini (2019) only supports 4G/LTE if you buy a cellular model.",
    "The iPad mini (2021) is a huge upgrade compared to the iPad mini (2019). That's not to say that the iPad mini (2019) isn't worth buying if you can find it at a good price, but the iPad mini (2021) is the clear winner here.",
    "It's much faster thanks to the A15 Bionic chipset, plus its front camera is much improved for video calls. The latter might not matter to you but you'll appreciate the speed boost.",
    "The iPad mini (2021)'s display is also a real winner for a tablet of this size. Cutting down on the bezels substantially makes a big difference and it should be a lot nicer to look at than before, and the slight screen size increase makes no difference to how portable it is.",
    "If you're not too fussed about having the latest technology then the iPad mini (2019) is still a worthwhile choice. Apple is generally good at supporting its devices for a long time, so there's no reason to think the iPad mini (2019) would be made redundant too soon.",
    "However, the iPad mini (2021) is speedy enough that it should be future-proofed for a while to come, which makes it the better choice on paper unless you can find the older slate for a considerable discount."
  ],
  "headers": {
    "4": "iPad mini (2021) vs iPad mini (2019) price and availability",
    "8": "Design",
    "15": "Display",
    "19": "Camera and battery",
    "24": "Specs and features",
    "29": "Takeaway"
  },
  "links": {
    "iPad mini (2021)": "https://www.techradar.com/reviews/ipad-mini-2021",
    "iPad mini (2019)": "https://www.techradar.com/reviews/ipad-mini-2019",
    "Apple website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7451748374296585000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fshop%2Fbuy-ipad%2Fipad-mini",
    "iPad Air 4": "https://www.techradar.com/reviews/ipad-air-4-review",
    "iPad 10.2 (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad Pro 2021": "https://www.techradar.com/reviews/ipad-pro-11-2021-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPadOS 15": "https://www.techradar.com/news/new-ipados-15"
  }
}