{
  "source": "https://www.techradar.com/news/microsoft-edge-update-downloads-will-soon-be-a-lot-easier-to-find",
  "title": "Microsoft Edge update downloads will soon be a lot easier to find",
  "category": "computing",
  "updated": "2021-07-22T11:26:45Z",
  "author": "mike-moore",
  "summary": "Users report Microsoft Edge cropping up on Windows 11 store",
  "article": [
    "It looks like the next generation of Microsoft Edge will be delivered via Windows 11, giving users a much smoother way of downloading the browser.",
    "Users testing out the latest preview versions of Windows 11 have spotted that the all-new Microsoft Store allows developers to publish unpacked Win32 desktop apps directly to the the marketplace.",
    "This means that teams behind software such as web browser, as well as other key Windows tools such as Microsoft Teams, will be able to get their latest updates and releases out to users quicker than ever before.",
    "WindowsLatest notes that users with the latest Windows 11 preview betas are already able to download and install Microsoft Edge from the store - although this does only appear to be the installer for the browser, not the finished version.",
    "In order to finish installing Edge, users will still need to open a seperate window to download extra resources. All Chromium-based browsers such as Edge are supported, meaning Chrome and Vivaldi should also be present in Windows 11, with Mozilla also saying it'll release a Firefox download soon.",
    "Recent data from Statcounter shows that Edge has now overtaken established rival Firefox in the rankings to run second behind Chrome in the browser wars.",
    "Its figures suggest Microsoft Edge now holds 3.4% of the browser market, while Firefox has slipped to 3.29%, continuing a downward trajectory that has seen the browser either lose or maintain market share in ten of the last twelve months.",
    "The news also comes shortly after it was revealed Microsoft Teams will also be playing a key role in Windows 11, which is set to be released later in 2021.",
    "The new build is set to integrate the Microsoft Teams chat feature directly into the taskbar in Windows 11, allowing users to start chats or video conferencing calls with just a few clicks. The feature appears to be closely linked to the Microsoft Teams desktop client for now, as users clicking on the chat button in the Windows 11 preview will instead have this open on their machine, but more expansions should arrive soon.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "Microsoft Edge Windows 11"
  },
  "links": {
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "browser": "https://www.techradar.com/best/browser",
    "Edge has now overtaken": "https://www.techradar.com/news/microsoft-edge-just-left-a-serious-rival-in-its-dust",
    "Microsoft Teams": "https://www.techradar.com/news/windows-11-is-putting-microsoft-teams-front-and-centre",
    "Windows Latest": "https://www.windowslatest.com/2021/07/21/microsoft-edge-is-finally-coming-to-windows-11s-microsoft-store/"
  }
}