{
  "source": "https://www.techradar.com/news/nsa-doesnt-think-quantum-computers-can-break-public-key-encryption",
  "title": "NSA doesn't think quantum computers can break public key encryption",
  "category": "computing",
  "updated": "2021-09-03T16:27:06Z",
  "author": "mayank-sharma",
  "summary": "Don’t worry about encryption, instead tackle the human factor, advice infosec experts",
  "article": [
    "The US National Security Agency (NSA) isn’t really sure when or even if quantum computers will be able to crack public key cryptography.",
    "Post-Quantum Cryptography is an emerging field of research, with researchers devising mechanisms to shore up current encryption algorithms against the seemingly unlimited computing performance promised by quantum computers.",
    "The NSA however has expressed its reservations about the potential of quantum computing in a FAQ titled Quantum Computing and Post-Quantum Cryptography.",
    "“NSA does not know when or even if a quantum computer of sufficient size and power to exploit public key cryptography (a CRQC) will exist,” said the security agency in response to whether it is worried about the potential of adversarial use of quantum computing.",
    "Public-key encryption drives most of the standards and protocols on the internet and the cloud, which help ensure the integrity of the data even when it’s been hijacked by snoopers.",
    "In the FAQ, the NSA describes a Cryptographically Relevant Quantum Computer (CRQC) as a quantum computer that’s capable of actually attacking real world cryptographic systems, something that’s currently infeasible.",
    "While it agrees that such a computer would be “devastating” to the digital security infrastructure, it seems to suggest that it doesn’t believe such a CRQC would ever materialize.",
    "However, the growing research in quantum computing has moved the agency to also support the development of post-quantum cryptographic standards, along with plans for eventual transition to such standards.",
    "However, speaking to industry experts, The Register concludes that research on cryptography standards aren’t much of a concern to cybersecurity specialists.",
    "“In a world where users will divulge their passwords in return for chocolate or in response to an enticing phishing email, the risk of quantum computers might not be our biggest threat,” Martin Lee, a technical lead at Cisco's Talos security division told The Register.",
    "Via The Register"
  ],
  "headers": {
    "4": "Encryption isn’t the weakest link"
  },
  "links": {
    "quantum computers": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario",
    "cryptography": "https://www.techradar.com/news/what-is-cryptography",
    "Post-Quantum Cryptography": "https://www.techradar.com/news/this-quantum-chip-has-been-infected-with-dangerous-malware-but-for-a-good-cause",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "in a FAQ": "https://media.defense.gov/2021/Aug/04/2002821837/-1/-1/1/Quantum_FAQs_20210804.PDF",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "passwords": "https://www.techradar.com/best/password-manager",
    "phishing email": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "The Register": "https://www.theregister.com/2021/09/01/nsa_quantum_computing_faq/"
  }
}