{
  "source": "https://www.techradar.com/news/apple-fitness-plus-updates-take-the-fight-to-fitbit-and-peloton",
  "title": "Apple Fitness Plus updates take the fight to Fitbit and Peloton",
  "category": "fitness",
  "updated": "2021-09-14T19:25:42Z",
  "author": "cat-ellis",
  "summary": "Guided pilates and meditation classes to tempt subscribers",
  "article": [
    "Apple has announced a huge update for Apple Fitness Plus that aims to win over Fitbit Premium and Peloton subscribers. Fitness Plus now offers guided Pilates classes, mindfulness sessions, and group workouts so you can take part in a virtual class with friends and family members.",
    "On-demand workout services really came into their own during the pandemic, with gyms around the world closing their doors and people looking for ways to exercise from home. Apple joined the fray in December 2020 with Fitness Plus – a service that aimed to win over Fitbit Premium and Peloton users with a cheaper subscription price and new classes added every week.",
    "When it launched, Fitness Plus offered HIIT (high-intensity interval training), yoga, cycling, treadmill running, treadmill walking, dance, core, strength, and rowing classes. Now Apple has added guided Pilates sessions as well, with new classes added every month – an option you won’t find in Fitbit Premium.",
    "There are also new mindfulness classes in Fitness Plus, with guided meditation sessions for subscribers. Fitbit has been putting real emphasis on mental wellbeing in recent months, with sessions on mindful eating and body positivity, plus classes led by meditation guru Deepak Chopra, but Apple could well use its clout to deliver many more classes and enlist the help of other big names in future updates.",
    "Apple is also taking aim at Peloton with a new group workout option. In April 2020, Peloton launched a new ‘Sessions’ feature that let small groups of friends work out together in a virtual class. Each Session has its own small leaderboard, and participants can encourage and compete with one another via the webcams on their Peloton bikes or treadmills.",
    "Now Apple Fitness Plus offers a very similar feature, which lets up to 32 people take part in a class together, and chat using the camera on their iPhone or iPad. It may be enough to tempt some Peloton users to make the switch, particularly if their regular workout buddies have an Apple Watch.",
    "There were far fewer new fitness updates for the Apple Watch. Rumors that the Apple Watch 7 might feature advanced new health tracking hardware, including blood pressure and blood glucose sensors, proved to be unfounded.",
    "The biggest updates to the watch’s health features all related to cycling – the Apple Watch 7 can start tracking bike rides automatically, and pause them when you take a break. That’s a convenient feature, but one already present in even entry-level sports watches from the likes of Garmin.",
    "Apple has also extended its fall detection feature to cycling, calling emergency services automatically if you take a tumble and don’t act quickly to cancel the alarm.",
    "If you do fall, the watch should be unscathed thanks to its more crack-resistant lens. The watch also has IPX6 water resistance, allowing it to survive high-pressure water jets, so you can give it a good wash to remove any mud.",
    "There’s an update for e-bike riders as well – the Watch 7 can track battery-assisted rides, and calculate calories more accurately. The company has yet to explain exactly how this will work, but it seems likely that it will use a combination of heart rate data plus speed to determine how much assistance you’re receiving from the bike’s battery, and how much effort you’re putting in.",
    "Apple Fitness Plus is rapidly becoming one of the biggest names in home workouts, but Peloton still has one big advantage: live, interactive classes that better replicate the experience of sweating it out in a real studio.",
    "All of the workouts on Fitness Plus are pre-recorded, so the experience isn’t quite as intense – and because there’s no branded Apple gym equipment, you can’t take part in a spin class that will adjust the resistance of your bike on the fly. That might change soon, though.",
    "Since 2017, it’s been possible to use a service called Apple Gymkit to pair an Apple Watch with compatible gym equipment for more accurate workout data. The Peloton Bike+ is one of those compatible machines, but earlier this year Apple disabled Gymkit for some Peloton workout types, to the annoyance of many owners.",
    "The problem lay with Peloton’s Bike Bootcamp classes, which include both strength and cardio cycling. Apple explained that Gymkit wasn’t designed for that sort of exercise, and rather than adapt its app, it pulled support for Bike Bootcamp.",
    "One way for Apple to avoid such problems in future, and keep a firmer hold on users’ data, would be to begin manufacturing its own spin bikes and treadmills. It would be a big departure for the company, but no more so than an Apple Car – and since Peloton appears to have its own fitness tracker in the works to rival the Apple Watch, it might be necessary."
  ],
  "headers": {
    "6": "Workouts with Apple Watch 7",
    "11": "Analysis: could we soon see an Apple bike?"
  },
  "links": {
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Apple joined the fray in December 2020": "https://www.techradar.com/news/apple-fitness-plus-is-coming-next-week-so-you-can-workout-at-home-with-your-iphone",
    "classes led by meditation guru Deepak Chopra": "https://www.techradar.com/news/fitbit-launches-new-stress-busting-meditation-tools",
    "Peloton launched a new ‘Sessions’ feature": "https://www.techradar.com/news/peloton-offers-smaller-virtual-classes-for-friends",
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "blood pressure": "https://www.techradar.com/news/are-wearables-the-future-of-blood-pressure-monitoring",
    "blood glucose": "https://www.techradar.com/news/could-the-apple-watch-7-really-measure-blood-glucose-and-why-is-it-important",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "e-bike": "https://www.techradar.com/best/electric-bike",
    "pair an Apple Watch with compatible gym equipment": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1224702814728502500&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-gb%2Fguide%2Fwatch%2Fapdf855bb3c0%2Fwatchos",
    "Apple disabled Gymkit for some Peloton workout types": "https://www.theverge.com/2021/4/16/22387412/peloton-apple-watch-integration-gymkit-statement-terms-of-service",
    "Apple Car": "https://www.techradar.com/news/apple-car",
    "Peloton appears to have its own fitness tracker in the works": "https://www.techradar.com/news/peloton-could-soon-launch-its-own-fitness-tracker"
  }
}