{
  "source": "https://www.techradar.com/news/heres-how-grid-studio-are-bringing-framed-apple-nintendo-and-sony-nostalgia-to-your-walls",
  "title": "Here's how Grid Studio are bringing framed Apple, Nintendo and Sony nostalgia to your walls",
  "category": "computing",
  "updated": "2021-07-24T11:00:29Z",
  "author": "daryl-baxter",
  "summary": "A disassembled PSP to hang up on your office wall",
  "article": [
    "A company by the name of Grid Studio has been lovingly taking apart certain devices and placing them into picture frames for customers to hang up in their homes this past year.",
    "Nostalgia is a powerful thing, and that includes the devices we used to use every day, before they were replaced by a more powerful model.",
    "We may remember how we used them in important events in our lives, or how they were our first - whether that was our first smartphone, gaming handheld or watch. For many of us, it’s good to remember the devices that made the most difference to us.",
    "This is where Grid Studio comes in. Established in September 2020, and based in Shenzhen, China, a team of six disassemble long-abandoned products and frame them in attractive layouts for anyone to buy. We’ve had a few sent to us which showcase just how well these deconstructed devices look in a frame.",
    "Having bought an iPhone 4 frame a few months ago, displaying a PlayStation Portable, Apple Watch Series 1, and iPhone 3GS side by side really makes you realise just how small or large the components were that made up these portable products, that were small enough to be stored in our pockets or bags back when we were at school or in our first jobs.",
    "The PSP hit me immediately, sprawled across a square frame that lays bare the components that made up Sony’s first handheld gaming console, launched back in 2004. It brings me back to a time where me and a few friends would play GTA: Liberty City Stories in the common room during college.",
    "They come incredibly well-packaged, with a neat bow and stamp laid across the packaging. Once you take the frame out, the nostalgia hits you like cold water - the components sprawled across the frame, with the logo and descriptions of each part elegantly described. You can tell that every frame is passionately made with an aim to show the deconstructed device in all its glory.",
    "After hanging them up in the office, there’s a temptation for more, but also for what Grid Studio could do next. From consoles to Apple Macs, there’s huge potential here to tap into nostalgia from every generation of computers and gaming devices.",
    "They retail from $169.99 in the US and £139.99 (around AU$229) plus shipping, but the delivery usually takes a week to arrive. These are a perfect gift for either yourself or someone who has a lot of fond memories using certain devices.",
    "While the company has only been open for 18 months, it’s already been making an impact for offices around the world. We asked how the company began and what future products could be on the horizon.",
    "“One of our founders had a lightbulb moment after disassembling his own equipment, hand-painted some drawings and pasted the parts on paper, and made a great piece of artwork. In the beginning, this was just a hobby, but one of our partners thought it should be shared with more people who also love this kind of art, so Grid Studio essentially started from there,” Joe, one of the three co-founders at Grid Studio told us.",
    "“We work with partners who help us collect equipment, usually from mobile phone repair shops and some agents.”",
    "With the amount of orders growing as word spreads, Joe remarks that creating these frames can be a challenge. “This is completely challenging. As you know, much of the equipment is very old. We need to select and clean it many times to make sure it looks beautiful.",
    "And the size and weight of some equipment is too large, we need to use more glue to paste, which requires multiple tests to ensure that it will not fall.”",
    "The VP of iPad at Apple also requested a frame from Grid Studio too. “We can’t sell a frame with a larger volume and weight for the time being, but we did make a first-generation iPad frame for the vice president of the iPad product marketing department not long ago. But due to the large weight and volume, we spent a lot of time dealing with shipping issues as the costs are very high. We are looking for a better solution to this so we can offer this and other products in the future.”",
    "We wondered why there’s such a market for these frames already, and what else could be coming up from the company.",
    "“In the beginning, this was born out of a hobby, and we didn't expect to be loved by so many technology fans due to the nostalgia of what we’re offering. Many Apple employees also appreciate our products, so we’ve gained a lot of confidence from all of this. Our next plan is to continue to complete the frames of the Google Pixel series, the Game Boy line, and then the Sony PlayStation.”"
  ],
  "headers": {
    "4": "Back to the Past",
    "9": "Sourcing Grid Studio"
  },
  "links": {
    "Grid Studio": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1396613416775751700&xs=1&url=https%3A%2F%2Fgridstudio.cc%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fheres-how-grid-studio-are-bringing-framed-apple-nintendo-and-sony-nostalgia-to-your-walls",
    "PSP": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1352377712666542000&xs=1&url=https%3A%2F%2Fgridstudio.cc%2Fcollections%2Fall%2Fproducts%2Fgrid-psp1000&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fheres-how-grid-studio-are-bringing-framed-apple-nintendo-and-sony-nostalgia-to-your-walls",
    "Game Boy": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1597367317524535600&xs=1&url=https%3A%2F%2Fgridstudio.cc%2Fcollections%2Fall%2Fproducts%2Fgame_boy_pocket&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fheres-how-grid-studio-are-bringing-framed-apple-nintendo-and-sony-nostalgia-to-your-walls"
  }
}