{
  "source": "https://www.techradar.com/news/how-to-watch-black-is-king-beyonce-movie-disney-plus",
  "title": "How to watch Black is King online: stream the Beyonce film on Disney Plus today",
  "category": "computing",
  "updated": "2021-03-19T17:14:33Z",
  "author": "james-laird",
  "summary": "The only place you'll find Bey's visual album for streaming",
  "article": [
    "There are new releases - and then there are new releases from Beyonce. The latter demands that you to cancel your plans and set aside an appropriate amount of time to take in the latest work of the cultural icon, of which 2020 release Black is King represents Bey's latest work. Black is King showcases a star truly at the height of her powers, so read on as we explain how to watch Black is King online and stream the Disney Plus exclusive right now.",
    "It's a visual album that's both a reimagining of 2019's Lion King live-action film and a companion to the studio album that accompanied it - Bey's very own The Gift.",
    "The visual album stars not only the Queen, but also her former Destiny's Child partner-in-crime Kelly Rowland, husband Jay-Z, and frequent collaborator Pharrell Williams. That's in addition to featuring Naomi Campbell, Lupita Nyong'o, and Tina Knowles Lawson.",
    "So, banging tunes are a given as Black is King “reimagines the lessons of The Lion King for today’s young kings and queens in search of their own crowns” and celebrates \"the beauty of tradition and black excellence\".",
    "Filming took over a year across multiple locations, including South Africa, west Africa, Belgium, Los Angeles, New York and London, so it certainly sounds like it's going to be quite the spectacle.",
    "Yep, this 100% falls into the 'can't miss' category of what to watch this weekend, so let's get to the nitty-gritty already. Follow our guide below as we explain where to watch Black is King online and stream Beyonce's new movie today. If you're short on time right now, here's a hint: get yourself a Disney Plus subscription and that's the hard work done.",
    "Disney Plus is showing no signs of slowing down since the service first launched last November and in addition to being the exclusive release platform of Black Is King last year, it's brought us new Pixar movies like Soul, Star Wars spin-off The Mandalorian, Mulan, Hamilton, WandaVision and much more.",
    "The streaming service has apps for iOS and Android (of course), and is available to watch online via the likes of Amazon Fire TV Stick, PS4, Xbox One and Roku streaming devices.",
    "Now that Disney has set the precedent of releasing its live-action Mulan remake on the service instead of in theaters through its Premier Access program, expect the company to keep bring more blockbuster films that were originally intended to be shown on the big screen to Disney Plus in 2021.",
    "And finally, there's the new Star on Disney Plus payload that most global markets get to enjoy and sees the amount of content available through Disney Plus more than double, with a particular eye to shows grown-ups are going to enjoy. It costs a tiny bit more, but is worth it based on our initial impressions - and you can still save big by going with an annual subscription.",
    "Read more:"
  ],
  "headers": {
    "6": "What else should I know about Disney+?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Disney Plus subscription": "https://disneyplus.bn5x.net/c/221109/564546/9358?subId1=trd-us-1001193475985769000&sharedId=trd-us&u=https%3A%2F%2Fwww.disneyplus.com%2F",
    "Amazon Fire TV Stick": "https://www.techradar.com/reviews/amazon-fire-tv-stick-2020",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Roku streaming devices": "https://www.techradar.com/news/best-roku-streaming-device",
    "Star on Disney Plus": "https://www.techradar.com/news/disney-plus-star-explained"
  }
}