{
  "source": "https://www.techradar.com/news/forza-horizon-5-has-the-longest-highway-in-the-series-and-i-cant-wait-to-tear-it-up",
  "title": "Forza Horizon 5 has the longest highway in the series – and I can't wait to tear it up",
  "category": "gaming",
  "updated": "2021-08-10T11:41:39Z",
  "author": "vic-hood",
  "summary": "Opinion: Life is a highway and I'm going to ride it",
  "article": [
    "Developer Playground Games has revealed Forza Horizon 5's full Mexico-inspired map.",
    "Players got a look in episode 5 of the Forza Horizon: Let's Go! video series, with the developer providing a guided tour to Forza Horizon 5's huge map – which is 50% larger than the map in Forza Horizon 4.",
    "But what really caught my attention was the highway that runs through the map, stretching from the bottom left-hand corner to the top-right hand corner. According to Playground Games, this highway is the largest seen in the series to date – and I can't wait to burn rubber on it.",
    "There's plenty to be excited about with Forza Horizon 5. The next entry in the veteran racing series will make some serious improvements on its predecessors, with features such as audio ray tracing and a localized weather system set to make it the most dynamic and immersive open-world racing game we've seen to date.",
    "But while Forza Horizon 5's 11 unique biomes and stunning Mexican setting have certainly got me excited, at the end of the day, the crux of any Forza title is its driving.",
    "What I love about the Forza Horizon series is its open-world and that feeling of (almost) limitless driving possibilities. So, while all the bells and whistles are certainly a plus, the feature that arguably has me most excited is that huge highway that stretches through the map.",
    "The town where I was born in Northern Ireland serves as a gateway to one of the most stunning coastal roads in the world: the Antrim Coast Road. Before moving to London, if I had a stressful day, there was nothing more freeing than jumping in my Seat Ibiza and hitting the road. I could drive for hours, taking in the sights: just me and the car.",
    "Living in London doesn't exactly offer that experience, so seeing that huge stretch of road running through Forza Horizon 5's Mexican map has seriously enticed me, especially given that Forza Horizon 4 didn't really offer a long, straight highway such as this.",
    "Sure, it's not the exact same, but with Forza Horizon 5, I can once again hit a long stretch of road to clear my head. I can put on headphones, let that audio ray tracing feed me the realistic rumblings of rubber hitting the road and take in flashes of Mexican towns, countryside and deserts as I sail down the open road. It's the little things.",
    "Aside from my own personal excitement to once again hit the open road, it's reassuring to see that Playground Games has opted to include such a long stretch of highway in Forza Horizon 5.",
    "In a practical sense, speed demons should be able to utilize this lengthy highway to push their car to its limits and truly get a sense of what their automobile is capable of.",
    "It's unclear whether the highway will fall into a range of biomes, but it looks like this could be the case. So, I would imagine that the highway will also serve as a good testing ground for how your car handles, at a basic level, in Forza Horizon 5's varying weather conditions, before you begin exploring the ruins, jungles and deserts on offer.",
    "There are still a few months to wait until we get our hands on Forza Horizon 5, which is due to release on November 5. While we already know a fair bit about the next entry in the veteran racing series, we're hoping to find you even more at Xbox's Gamescom 2021 showcase."
  ],
  "headers": {
    "3": "Hitting the road",
    "9": "Burning rubber"
  },
  "links": {
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Forza Horizon: Let's Go!": "https://www.youtube.com/watch?v=rrepYmQqS2c",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "audio ray tracing": "https://www.techradar.com/news/forza-horizon-5-uses-ray-tracing-but-not-how-you-think",
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show"
  }
}