{
  "source": "https://www.techradar.com/news/apex-legends-mobile-news",
  "title": "Apex Legends Mobile release date, beta, news, leaks and what you need to know",
  "category": "phones",
  "updated": "2021-08-06T04:34:47.946Z",
  "author": "tom-bedford",
  "summary": "Apex Mobile is in closed beta now",
  "article": [
    "Apex Legends Mobile isn't just a rumored or hoped-for port of the popular Battle Royale game, but a confirmed upcoming mobile game that certain people are already playing.",
    "Right now, Apex Legends Mobile is in closed beta in India and the Philippines, and apparently only a few thousand people are part of the tests. There's even a Google Play Store listing for the phone.",
    "Hopefully, we'll see full availability - or at least an open beta - at some point in the future. There's no promise of that yet though, and that's fine by us. In late 2019, EA initially confirmed that Apex Legends Mobile could be released around the end of 2020, so clearly its release dates aren't set in stone.",
    "Most popular multiplayer games have seen big changes when they've been ported over to mobile. PUBG Mobile has a tweaked map and added AI players compared to the main game, and Call of Duty: Mobile is its own separate entity based on maps, weapons and guns from the popular series. Wild Rift adapted League of Legends to smartphones by shrinking its map and tweaking hero abilities for touchscreen controls.",
    "Respawn hasn't clarified how Apex Legends will differ from the base game, but we expect them to explain later how it's been adapted to preserve the battle royale shooter gameplay to smartphone screens. We also don't know whether the developers will opt to use the 'standard' controls shooting games use on mobile phones, or possibly try out some new features like Call of Duty: Mobile did with its automatic aim-down-sights.",
    "To help you understand what Apex Legends Mobile is shaping up to be before its release, we've compiled everything you need to know as well as a wish-list of what we'd like to see in Apex Legends mobile.",
    "Let's start with the price: Respawn has confirmed that Apex Legends Mobile is free to play, and will have a battle pass and other unlockable cosmetics.",
    "Apex Legends was a free download on PC, PS4 and Xbox One, with the option to buy cosmetics on the side; it makes sense that's true for Apex Legends Mobile too. We do know that the game will get some cosmetics and extras that are exclusive to the mobile version. It's unclear what kinds of in-game transactions beyond the battle pass you'll find inside Apex Legends Mobile, however.",
    "In addition, most similar mobile ports like Fortnite, PUBG Mobile and Call of Duty: Mobile are free, with micro-transactions instead of an up-front payment.",
    "The Apex Legends Mobile release date is still unclear, but EA originally said it'll coming at some stage after April 1, 2021.",
    "Weeks after that projected starting point, Respawn announced the first Apex Legends Mobile beta tests would start with limited player groups 'soon' in India and the Philippines, and will come to more players and expand to more regions throughout 2021.",
    "EA reportedly set a new (and very vague) release window for Apex Legends Mobile – its full release will roll out later this year (aka the financial year, which ends in April 2022), according to Apex Legends News.",
    "So an Apex Legends Mobile release date might be a way off, and although we could be surprised with an earlier release, it's probably best not to get our hopes up.",
    "Respawn officially introduced Apex Legends Mobile in April 2021 and announced the game would soon be playable in beta – first in India and the Philippines for limited tests, and then expand to more players and regions through 2021.",
    "While the official blog post didn't answer many questions, it did clarify some early points: the mobile version wouldn't have cross-play with the PC and console versions, would have a battle pass and unlockables exclusive to mobile, and would launch in beta first on Android with iOS support coming after.",
    "Here are some representative screenshots included in the post and collected in a tweet:",
    "Here are some of the features of Apex Legends Mobile we'd like to see, including changes (or lack thereof) from the base game, and ways it'd work on a mobile phone.",
    "This is an easy one, and something we expect you'll be able to do when it launches. We'd love for cross-play to be supported by Apex Legends Mobile, but just across mobile devices.",
    "It wouldn't be fair to be competing against those on console or PC, but it'd be great if Android players could be mixed in the same matches as those on iOS. That's especially the case as the people you want to meet up with and play online may have differing devices.",
    "Fortnite Mobile is capable of running at 120Hz on the iPad Pro, but that's all for now and we'd like to see Apex go above and beyond that for its mobile iteration.",
    "With a lot of top-end mobile devices now sporting 120Hz frame rate displays, we'd hope this would soon become the norm in games like Apex Legends, at least for phones that can support it.",
    "This is unlikely to happen at launch, but it'd be a big benefit and make the gameplay even smoother than other mobile titles.",
    "We don't want to say goodbye to Kings Canyon, but that may be a necessity for a mobile version of Apex. Traversing that map may be difficult in a short mobile game, so maybe Respawn could work on a smaller map for this edition?",
    "It could still be a mobile version of Kings Canyon, but considering how long it takes to travel from one side of the map to the other this may be a difficult thing to do in the Kings Canyon or World's Edge we know and love.",
    "This is another simple one; we'd like Apex Legends Mobile to be easy to download and install to your phone.",
    "Epic Games decided not to host its version of Fortnite Mobile in the Google Play Store at launch, so you had to download it in a roundabout way with an APK and that was a bit of a pain.",
    "We'd like to see EA make a big song and dance about its Apex Legends mobile release, and launching that on the App Store and Google's alternative would be a good way to do that.",
    "Mobile connectivity can be unreliable at the best of times, so perhaps it's time to have a single player mode of Apex Legends in the mobile title so you don't have to rely on the connection of those around you.",
    "By this we mean, we'd like to see you play as a team of one, so your game plans won't be scuppered if another player disconnects (in fact, that might be advantageous for you).",
    "This won't be anywhere near as fun as working as a team, but it may be a good addition for those with poorer connectivity or those who want to avoid working with others.",
    "Plug-and-play controllers are great ways to play mobile games, as they imitate the console controller experience and stop you becoming reliant on the often-fiddly on-screen controls.",
    "However, some games like Fortnite, PUBG Mobile and Call of Duty: Mobile don't work on all - we tested the Razer Kishi recently and these games weren't supported, so we couldn't use it on them.",
    "We'd like to see Apex Legends Mobile launch with a bespoke control scheme for mobile game pads, so we have the option of using the controllers if we so wish.",
    "Sometimes you just can't get online to play games, and we'd like Apex Legends to have an offline mode so we can still enjoy the experience without needing to be connected to the internet.",
    "One option for this is to bring over the Story Mode from the main version which lets you play linear levels with select equipment and enemies based on areas from the map. These are short, but are a fun alternative to the online battle royale.",
    "Another option is to offer a version of the battle royale game where you only play against AI opponents. Of course the AI would need to be pretty good, so you don't feel like you're fighting lifeless robots (as that would be no fun) but it could be a good training mode for the actual game.",
    "Mobile gaming can be a huge battery drain, but some titles have ways to mitigate this issue to an extent, and we'd like Apex Legends to bring some into play.",
    "For example, Old School RuneScape lets you set a frame-rate cap if you like, which reduces battery drain (and makes the game easier to play on older phones), and that'd work well here for people who don't have 120Hz phones as mentioned above.",
    "Good optimization in the game would also stop it draining power as much, and possibly shorter match lengths as well so each individual one doesn't take as much off your phone's battery life."
  ],
  "headers": {
    "6": "Apex Legends Mobile release date and price",
    "13": "Apex Legends Mobile: everything we've heard",
    "16": "Apex Legends Mobile: what we want to see",
    "17": "1. Cross-play for mobile devices",
    "19": "2. 120Hz support across all devices",
    "22": "3. A reworked map",
    "24": "4. Easy to download",
    "27": "5. A solo mode",
    "30": "6. Support for plug-and-play controllers",
    "33": "7. An offline mode",
    "36": "8. Variable frame-rate and other battery features"
  },
  "links": {
    "Google Play Store listing": "https://play.google.com/store/apps/details?id=com.ea.gp.apexlegendsmobilefps&hl=en_GB&gl=US",
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "Call of Duty: Mobile": "https://www.techradar.com/news/call-of-duty-mobile-season-7-start-date-delay-and-new-battle-royale-map",
    "Wild Rift": "https://www.techradar.com/news/league-of-legends-mobile",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "some stage after April 1, 2021": "https://www.techradar.com/news/apex-legends-mobile-wont-be-here-as-quickly-as-expected-but-its-coming-next-year",
    "announced": "https://www.techradar.com/news/apex-legends-mobile-beta-launch-plans-announced-heres-where-to-play-it-first",
    "Apex Legends News": "https://twitter.com/alphaINTEL/status/1423018881791184906",
    "introduced": "https://www.techradar.com/news/apex-legends-mobile-beta-launch-plans-announced-heres-where-to-play-it-first",
    "blog post": "https://www.ea.com/games/apex-legends/news/apex-legends-mobile-regional-betas",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-11",
    "Razer Kishi": "https://www.techradar.com/reviews/razer-kishi"
  }
}