{
  "source": "https://www.techradar.com/news/microsoft-365-update-should-mean-youll-never-disconnect-unexpectedly-again",
  "title": "Microsoft 365 update should mean you'll never disconnect unexpectedly again",
  "category": "computing",
  "updated": "2021-02-22T10:38:15Z",
  "author": "barclay-ballard",
  "summary": "Microsoft 365 will now allow remote staff to keep connected to apps, helping those that face uncertain internet access",
  "article": [
    "Those Microsoft 365 users that face long periods without internet access will no longer have to worry about their licensing tokens being revoked after the company revealed a change in policy regarding offline access.",
    "The change will prove hugely beneficial for field workers and other remote desktop workers that might have to go without reliable internet access for weeks at a time.",
    "Previously, 365 apps required a user to connect to the internet at least once every 30 days or the device’s licensing token would not be renewed and the app in question would provide reduced functionality. However, this timeframe can be challenging for some industries, leading Microsoft into a rethink.",
    "“We’re aware that in industries, including government, oil and gas, manufacturing, agriculture, and scientific research, some people work in secure or remote environments where they have limited or no internet connectivity for longer periods of time,” a Microsoft blog post explained. “To address this, we’re now providing extended offline access* to enable devices to stay activated without connecting to the internet for up to 180 days.”",
    "It’s worth noting, however, that not every business will receive access to the 365 extension automatically. Organizations should contact their account representative to check whether they are eligible to receive extended offline access.",
    "In other Microsoft-related news, the company also confirmed that it will now be introducing device-based subscriptions for shared devices. The policy change means that individuals working in industries where shared devices are common can access the latest and most secure productivity tools available without each individual needing their own Azure Active Directory identity.",
    "Businesses and vendors have been learning from the surge in remote working that has accompanied the COVID-19 pandemic. New features being added to Microsoft 365 and other digital tools demonstrates that firms like Microsoft clearly want to make the transition as seamless as possible.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "Check your eligibility first"
  },
  "links": {
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review",
    "remote desktop": "https://www.techradar.com/news/best-remote-desktop-software",
    "apps": "https://www.techradar.com/best/best-apps-for-small-business",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1149098757427817500&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-365-blog%2Fenabling-productivity-for-everyone-with-microsoft-365-apps-for%2Fba-p%2F2111517&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-365-update-should-mean-youll-never-disconnect-unexpectedly-again",
    "productivity tools": "https://www.techradar.com/best/best-productivity-apps",
    "ZDNet": "https://www.zdnet.com/article/microsoft-365-adds-new-feature-so-remote-staff-with-no-internet-dont-lose-access-to-apps/"
  }
}