{
  "source": "https://www.techradar.com/news/xiaomi-12-might-actually-be-smaller-than-xiaomi-mi-11-was-and-were-glad",
  "title": "Xiaomi 12 might actually be smaller than Xiaomi Mi 11 was – and we're glad",
  "category": "phones",
  "updated": "2021-12-02T11:07:40Z",
  "author": "tom-bedford",
  "summary": "A slightly smaller screen",
  "article": [
    "The Xiaomi Mi 11 was certainly a chunky smartphone, as its 6.81-inch screen made it one of the biggest flagship phones we saw all through 2021 - but it seems like the Xiaomi 12 might have slimmed down a little.",
    "This comes from the website GizmoChina, which apparently got its hands on a screen protector for the upcoming Xiaomi 12 Pro - by the sounds of it, this was sent to them by a third-party screen protector manufacturer, but it isn't explicitly stated where this came from.",
    "GizmoChina put the Xiaomi 12 Pro screen protector on a Xiaomi Mi 11, and it seems the plastic film doesn't line up on the older device - in fact, it doesn't reach the edges, which suggests the 12 Pro display is smaller than the 11's.",
    "If you're querying possible discrepancies between the 'Pro' model of the Xiaomi 12, and the Mi 11: the Mi 11 Pro, and Mi 10 Pro, both had the same screen size as their non-Pro siblings, which suggests the Xiaomi 12 and 12 Pro will have the same dimensions too.",
    "Another intriguing change is that the Xiaomi 12 screen protector has a space for a front-facing camera that's at the top-center of the display - this is different to the Mi 11, and many other Xiaomi phones, which have it in the top left.",
    "It's no secret that the average smartphone size is gradually creeping up and up - it's hard to buy a new mobile if you don't want your hand stretched at least somewhat. Still, the Xiaomi Mi 11 was very big.",
    "In our review, we noticed \"people with smaller digits may still find it a stretch to reach the upper part of the screen\" because of the big size, though thanks to the handset's relatively thin body it wasn't too unwieldy.",
    "The Xiaomi Mi 11 Ultra also had a 6.81-inch screen, but that phone felt even bigger because of its gigantic rear camera bump.",
    "Despite the fact we weren't too down on the Xiaomi Mi 11's size in our review, we can't help feel a twinge of joy knowing the Xiaomi 12 could be smaller - unless you've got mighty mitts, big mobiles can be uncomfortable to use for long periods of time.",
    "That's not to say all Xiaomi 12 phones will be smaller, and we imagine there's still an enormous 'Ultra' model being planned with more powerful rear cameras than you can shake a stick at - but at least the 'normal' phone could be a cosy little-un."
  ],
  "headers": {
    "5": "Analysis: how big is too big?"
  },
  "links": {
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "GizmoChina": "https://www.gizmochina.com/2021/12/01/exclusive-heres-how-a-xiaomi-12-pros-screen-protector-looks-on-a-mi-11/",
    "Mi 10 Pro": "https://www.techradar.com/reviews/xiaomi-mi-10-pro-review",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review"
  }
}