{
  "source": "https://www.techradar.com/news/bmw-x3-xdrive30e-review",
  "title": "BMW X3 xDrive30e review: a premium dose of EV driving with petrol peace of mind",
  "category": "car-tech",
  "updated": "2021-05-29T12:00:33Z",
  "author": "john-mccann",
  "summary": "And a wealth of tech to keep you engaged, connected and safe",
  "article": [
    "The BMW X3 xDrive30e offers up a premium dose of all-electric driving with the peace of mind of a petrol engine for those longer journeys. This plug-in hybrid electric vehicle (PHEV) gives you SUV styling and space, while keeping you green when you're driving around town.",
    "There are now plenty of plug-in hybrid SUVs on the market, and while there are cheaper alternatives, for those looking for additional comfort and technology the BMW X3 xDrive30e may be worth the extra expense.",
    "The standard, petrol-only X3 starts at £42,140 / $43,000, while the plug-in X3 starting price is £49,250 / $49,600. We drove the BMW X3 xDrive30e M Sport XB1, with the upgrade trim and a few optional extras and packs taking the price up to £56,415 / $58,965.",
    "The X3 xDrive30e is distinctly BMW, and sits seamlessly into the X3 lineup, with a muscular stance. The signature kidney-shaped grille isn't as oversized as on some of BMW's more recent models, such as the new 4 Series, but it still provides a distinct nose that, along with the lights and contour hood, is unmistakably BMW when caught in the rear view mirror.",
    "Sitting in the middle of the 'X' range, the X3 is a full-size SUV, offering an elevated ride height and plenty of space for both driver and passengers.",
    "Slide into the driver's seat and you'll find a comfortable, airy cabin. The accommodating seats provide a pleasing level of support that makes long journeys a breeze, and they're heated too, which is useful when the mercury drops. Our X3 xDrive30e also came with a heated steering wheel.",
    "It's a pleasing aesthetic, and while the finish may not be quite as premium as on some of BMW's more expensive offerings, you do still get the sense that this is a well-made vehicle, and corners haven’t been cut.",
    "You'll find a pair of cup holders plus a space for your phone (which also houses a wireless charger) in the central section between the front seats, and the arm-rest between them lifts up to reveal additional storage. The door pockets are a reasonable size too, ensuring that there's plenty of space to put phones, keys, and more.",
    "The rear cabin can seat three adults relatively comfortably, with a good amount of head and leg room. Rear seat passengers get access to two dedicated USB-C ports for easy device charging, as well as their own climate controls.",
    "The door pockets here are also a reasonable size, and there are magazine pockets on the back of the front seats. Our BMW X3 came with a panoramic sunroof, which offers a great view of the sky for those in the back.",
    "There's a pleasing amount of space in the trunk too, and its high, flat load window makes it easy to move items in and out.",
    "The BMW X3 xDrive30e features a 2.0-litre, four-cylinder petrol engine and an electric motor which combined produce 252hp. This helps the car to a top speed of 130mph, and it can get from 0-62mph in 6.1 seconds, which is relatively nippy considering the X3 isn't the most aerodynamic of cars.",
    "Power is delivered reasonably well, but at times we did notice a very slight lag between putting our foot down and the X3 xDrive30e responding as the petrol engine kicked in. When it does respond though, you know about it, allowing you to overtake with ease.",
    "There are four drive modes, with 'Sport' offering the best responsiveness under the foot, as well as a nosier exhaust note. The default mode is 'Comfort', which provides a smooth, quiet experience with good handling.",
    "The eight-speed automatic transmission works well, but for those who like a little more control over gear shifts there are paddle controls neatly located behind the steering wheel.",
    "Both modes take advantage of the hybrid engine at low speeds and under braking, but for those looking to be a bit greener you can switch to 'Eco Pro', which increases the amount of regenerative braking while also throttling acceleration for more energy-efficient driving.",
    "However, the joy of a plug-in hybrid is that you can ditch the petrol engine entirely for some journeys and drive in a fully EV mode, which BMW calls 'eDrive'.",
    "BMW says the X3 xDrive30e can manage up to 34 miles on a single charge in 'eDrive', although during our time with the car we were only reliably getting 22 miles. That's still a useful amount of all-electric range, though, and will cover most trips around town and some daily commutes.",
    "You'll struggle to get 34 miles from the X3 however, and there are other plug-in hybrids that can offer this sort of range more reliably, such as the Kia Niro PHEV.",
    "Charging is easy, with the port located behind a flag above the front wheel arch, and as the battery, which is situated under the rear seats, is relatively small compared to those in a fully electric car it can be topped up quickly.",
    "At a fast charging station you'll be looking at comfortably under an hour, while at home on our 22kWh cable we'd get a full charge in around two hours.",
    "BMW's in-car infotainment system is among the best out there, with a clear, modern interface that's easy to navigate and full of useful features – including news and weather services, giving you something to read while you're charging.",
    "The main attraction here is the central touch display which sits atop the center console, and while this can be controlled by manipulating the screen with your digits, BMW also offers its more familiar (for current BMW owners) iDrive physical control wheel and shortcut buttons.",
    "These give you easier access to the main features when driving, as the tactile nature of the physical dial means you don't need to look away from the road as often.",
    "However, the touch input also has its benefits, providing you with greater accuracy and faster input when it comes to typing addresses into the navigation system.",
    "The built-in navigation is very good, and directions are mirrored between the digital cluster display and the HUD (heads-up display) that's projected into your eye line on the windshield.",
    "The HUD is a useful addition, putting key information – including your speed, speed limits, driver aids and nav instructions – right in front of you, allowing you to keep your eyes on the road.",
    "Another feature we're fond of is the support for wireless Apple CarPlay and Android Auto. Many manufacturers still make you plug your smartphone into the car via a USB cable in order to use these systems, but BMW is one of the leaders in offering a wireless solution.",
    "It makes it so much easier to connect to CarPlay or Auto as soon as you hop in the vehicle, as there's no need to fiddle with any cables. Plus, if your smartphone supports wireless charging you'll never need a USB cable in your car again, as the wireless charging pad can keep you topped up.",
    "There is a USB-A port available beside the charging pad if your phone doesn't support wireless top-up, and there's a USB-C port in the storage area under the arm-rest too.",
    "CarPlay and Auto allow you to use core phone apps such as Google Maps, Apple Maps, Spotify and WhatsApp on the car's display, and the mapping applications also get their directions mirrored in the cluster and HUD – again, something which isn't common but is extremely useful.",
    "The X3 xDrive30e comes equipped with reversing and 360-degree cameras, and BMW offers the additional feature of showing you how wide your doors open on the top-down, 360 view.",
    "This is especially useful when you're parking in tighter spaces, as you can see if you'll be able to open your doors fully – which will be important for parents with small kids that they need to be able to get in and out of the vehicle.",
    "The BMW X3 xDrive30e has another trick up its infotainment sleeve too: gesture control. This feature has been available in a range of BMW models for a few years now, and allows you to adjust the volume and skip music tracks by waving your hand in the air.",
    "This enables you to control your music without having to take your eyes off the road, and it works pretty well, so long as you hold your hand at the required height; you'll likely want to rest your elbow on the central arm-rest and have your forearm horizontal.",
    "You point a finger towards the main display and rotate clockwise to increase the volume, and counterclockwise to lower it. To skip forward a track you make a fist, stick your thumb out to the right and move your hand to the right, and move it in the opposite direction to go back a track.",
    "It's a nice touch, and a fun feature to show off to passengers, but really it's all a little redundant, as you'll find volume and track-skip controls on the steering wheel.",
    "These on-wheel controls can also be operated without taking your eyes off the road, and are generally easier to use than attempting to get your hand in the right position.",
    "The X3 xDrive30e's sound system provides powerful, deep bass and great audio clarity even at high volume, ensuring that your songs, podcasts and mobile calls all sound good when you're on the road.",
    "The BMW X3 xDrive30e offers a wealth of technology to keep you engaged, connected and safe, with some features that are unique to BMW proving to be useful, and fun, additions.",
    "There's comfortably enough space for families with kids, while the quiet, comfortable cabin makes the X3 xDrive30e a pleasing environment for even long-range drives.",
    "The addition of the plug-in hybrid drivetrain may not quite get you BMW's quoted all-electric range, but you'll still be able to make many trips around town without using a drop of gas."
  ],
  "headers": {
    "3": "BMW X3 xDrive30e design",
    "11": "BMW X3 xDrive30e drive, range and charging",
    "21": "BMW X3 xDrive30e specs and tech",
    "39": "Verdict"
  },
  "links": {}
}