{
  "source": "https://www.techradar.com/news/acer-confirms-new-attack-on-servers",
  "title": "Acer confirms new attack on servers",
  "category": "computing",
  "updated": "2021-10-18T14:37:43Z",
  "author": "mayank-sharma",
  "summary": "Acer’s is a global network of vulnerable servers, claim hackers",
  "article": [
    "Acer has confirmed that its servers in Taiwan have also been breached, after hackers themselves shared details about the incident with privacy watchdogs, PrivacyAffairs.",
    "The incident comes days after the same threat actor that identifies itself as the Desorden Group, was auctioning data it had managed to extract from the after-sales service system in India.",
    "“We have recently detected an isolated attack on our local after-sales service system in India and a further attack in Taiwan,” confirmed Acer spokesperson Steven Chung in a statement.",
    "Chung pointed out that unlike the breach in India, the attacked server in Taiwan contained no customer information, without giving more details. Desorden however shared that the server contained product information and employee data, adding that it only grabbed the latter.",
    "Referring to Acer as a “global network of vulnerable servers” Desorden claims that besides the breached servers in India, and Taiwan, Acer servers in Malaysia, and Indonesia are just as vulnerable.",
    "According to samples shared by the hackers, the breach of the Taiwanese servers has leaked internal documents, personally identifiable information (PII) of its employees, as well as what appears to be login credentials to some of Acer’s Taiwanese servers and internal admin panels.",
    "Tim Wade, technical director, at cybersecurity company Vectra AI tells TechRadar Pro that breaches such as the one suffered by Acer show that businesses must rethink their protective strategies. Instead of focusing on traditional prevention tools, businesses must assume that they’ve already been breached, and work backwards to build resilience.",
    "“By assuming you’re compromised and actively searching for signs of an attack, you are in a much stronger position to detect all sorts of attacks in good time and stop them before they become breaches,” reasons Wade.",
    "Via PrivacyAffairs"
  ],
  "headers": {
    "4": "More to follow?"
  },
  "links": {
    "Acer": "https://www.techradar.com/news/the-best-acer-laptops",
    "PrivacyAffairs": "https://www.privacyaffairs.com/acer-taiwan-hacked/",
    "extract from the after-sales service system": "https://www.techradar.com/news/acer-admits-hackers-stole-data-on-millions-of-customers",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses"
  }
}