{
  "source": "https://www.techradar.com/news/next-call-of-duty-warzone-upgrade-is-aimed-at-ps5-and-xbox-series-x-players-with-4k-tvs",
  "title": "New Call of Duty: Warzone upgrade is aimed at PS5 and Xbox Series X players with 4K TVs",
  "category": "gaming",
  "updated": "2021-03-03T16:53:32Z",
  "author": "adam-vjestica",
  "summary": "But you’ll need to make even more space for it",
  "article": [
    "Call of Duty: Warzone and Modern Warfare have received an upgrade for PS5 and Xbox Series X owners to enjoy in the form of a new high resolution texture pack.",
    "The optional add on, which weighs in at 8.4GB on PS5 (thanks, VGC), lets players enjoy “the most detailed textures for weapons and Operators in Modern Warfare and Warzone”, according to the game’s store page.",
    "The listing notes that the high resolution texture pack is only recommended to those who have “high-resolution displays”, so there’s not much point installing the pack if you don’t own a 4K TV.",
    "If you’ve longed for sharper textures when playing Call of Duty: Warzone and Modern Warfare on PS5 or Xbox Series X, the texture pack should help improve the look of the game, particularly when your character is pressed face first against a wall as you hide from a pursuer.",
    "Call of Duty: Warzone continues to receive regular updates and has recently added a new zombie mode that brings the stumbling undead into the battle royale game. The texture pack should make the new Call of Duty: Warzone Season 2 content look nicer on the eye, then, provided you’ve got a capable display.",
    "Thankfully, the high resolution texture is an optional download, so you don’t have to install it if you don’t want to. And thanks to Call of Duty games’ massive file sizes, you might not be able to. Activision recently warned players on 500GB PS4 consoles that they might have to “make room” if they wanted to install the latest updates for Call of Duty: Warzone, Modern Warfare and Black Ops Cold War."
  ],
  "headers": {
    "5": "Space invader"
  },
  "links": {
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Modern Warfare": "https://www.techradar.com/reviews/call-of-duty-modern-warfare-2019-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "VGC": "https://www.videogameschronicle.com/news/ps5-and-ps4-pro-get-a-new-call-of-duty-warzone-high-resolution-texture-pack/",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "500GB PS4 consoles that they might have to “make room”": "https://www.techradar.com/news/call-of-duty-ps4-players-may-need-to-make-room-for-the-new-update-activision-warns"
  }
}