{
  "source": "https://www.techradar.com/news/tamagotchi-is-coming-back-as-a-smartwatch",
  "title": "Tamagotchi is coming back... as a smartwatch?",
  "category": "wearables",
  "updated": "2021-06-18T09:04:33Z",
  "author": "tom-bedford",
  "summary": "Pet, meet wrist",
  "article": [
    "If you know Tamagotchi largely through nostalgia lenses, you probably see the digital pet-keeping toys as a small plastic circle with a black-and-white screen and three buttons, which a very specific generation went wild for in the late 90s and early 00s.",
    "A lot has happened to Tamagotchi products in the meantime - the latest devices literally have cameras you can use to take pictures of yourself with - but the brand is about to take its biggest, most futuristic step yet, as it's turning its digital pets into smartwatches.",
    "As reported by Kotaku, Bandai (which makes Tamagotchi) has begun teasing the Tamagotchi Smart - this is, if the pre-amble didn't make it clear, a wearable version of the virtual minion breeder.",
    "A teaser shows off the new product, intended to commemorate the brand's 25th anniversary. The gadget has three buttons, a color screen, and a strap that runs from the body. There are two colors of device shown: cyan and pink.",
    "This doesn't seem to be just a toy though, and the device has some smartwatch features. It has a step counter, actual watch functions, voice commands and possibly NFC too - the video isn't too clear on this point. Presumably that's NFC so your Tamagotchi can play with other virtual pets, not so you can pay for things with Google Pay or the like.",
    "The Tamagotchi smartwatch has a port in the side, where you can plug in a 'TamaSmaCard'. From what we see in the trailer, this is basically a way of getting new characters or accessories to your pet, presumably as a form of physical microtransaction.",
    "From the trailer, it seems that Tamagotchi Smart is designed for kids - but that's always the case for cute-animal-simulators like this, and the actual audience often ends up quite different. Expect mainly 30-year-olds to buy it, then.",
    "Apparently, the Tamagotchi Smart will go on sale in Japan in November, and while there's no word on international availability, the pervading import market for gadgets like this suggests it could get released in other regions in some form or another."
  ],
  "headers": {
    "3": "Wristricted availability"
  },
  "links": {
    "Kotaku": "https://kotaku.com/new-tamagotchi-is-a-wearable-smart-device-1847119315"
  }
}