{
  "source": "https://www.techradar.com/news/new-asus-zenfone-8-leaks-reveal-mini-design-and-ip68-rating",
  "title": "New Asus Zenfone 8 leaks reveal Mini design and IP68 rating",
  "category": "phones",
  "updated": "2021-05-03T10:52:03Z",
  "author": "david-nield",
  "summary": "The countdown continues",
  "article": [
    "The Asus Zenfone 8 launch has been confirmed for May 12, with Pro and Mini models also said to be on the way – and thanks to a new leak and a new teaser from Asus itself, we now know a little bit more about the upcoming handsets.",
    "First Gadget Tendency has pictures of what is purportedly the Asus Zenfone 8 Mini, inside transparent and opaque cases – and these pictures have indeed come from a third-party case maker rather than directly from Asus.",
    "The images don't actually reveal a whole lot, but you can see the rear camera array up in the corner on the back of the phone, and the position of various ports and buttons. The Zenfone 8 Mini is shown in a stylish black and blue gradient color too.",
    "The blog post predicts a Snapdragon 888 chipset and a 5.9-inch display for the Asus Zenfone 8 Mini, which matches up with rumors that we've already heard. The fingerprint scanner is built into the screen apparently, and the on-board battery capacity is rumored to be 4,000mAh.",
    "Another little Zenfone 8 tidbit that we've come across today has been provided by Asus itself: in a tweet, the company has confirmed that the handsets will have full water and dust protection thanks to an IP68 rating.",
    "That just about confirms that the Zenfone 8 won't have the rotating camera that the Zenfone 7 had (something we already suspected). Trying to seal so many open and moving parts would be a considerable challenge, so it's much more likely that Asus is going to go with a more conventional front and rear camera – just like the one shown in the case renders.",
    "Mosey on over to the official splash page for the launch and you'll see that Asus is promising something \"big on performance\" yet \"compact in size\" – that \"compact\" reference is presumably in regards to the Mini model, and we haven't heard as much about the standard or Pro models yet.",
    "We will of course be bringing you all the announcements as they happen from the Asus event. The show gets underway on May 12 at 10am PT / 1pm ET / 6pm BST (that's 3am AEST on May 13 in Australia)."
  ],
  "headers": {},
  "links": {
    "confirmed for May 12": "https://www.techradar.com/news/asus-confirms-the-zenfone-8-is-launching-on-may-12-with-a-compact-version-rumored",
    "Gadget Tendency": "https://gadgettendency.com/this-is-how-one-of-the-smallest-smartphones-on-snapdragon-888-looks-like-published-images-of-asus-zenfone-8-mini/",
    "already heard": "https://www.techradar.com/news/asus-zenfone-8-minis-specifications-revealed-in-a-benchmark-listing",
    "tweet": "https://twitter.com/ASUS/status/1388840703933956101",
    "already suspected": "https://www.techradar.com/news/asus-zenfone-8-wont-have-the-cool-android-phone-feature-of-the-zenfone-7",
    "the official splash page": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5592581002627958000&xs=1&url=https%3A%2F%2Fwww.asus.com%2Fevent%2FZenFone8%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnew-asus-zenfone-8-leaks-reveal-mini-design-and-ip68-rating"
  }
}