{
  "source": "https://www.techradar.com/news/totally-rated-dying-light-2-shambles-toward-a-late-2021-release",
  "title": "Totally Rated: Dying Light 2 shambles toward a late 2021 release",
  "category": "gaming",
  "updated": "2021-06-07T14:24:36Z",
  "author": "rhys-wood",
  "summary": "Dying Light 2, Sonic Colors: Ultimate and Horizon Forbidden West round out this week's Totally Rated",
  "article": [
    "It's games, games and more games on this week's Totally Rated, starting out with the highly anticipated zombie apocalypse sequel, Dying Light 2.",
    "We also put on the rose-tinted shades for a return to one of Sonic's best 3D outings with the Sonic Colors: Ultimate remaster, which now has a release date.",
    "And thankfully, we didn't have to go too deep into the jungle to unearth new details surrounding the much hyped PS5 title, Horizon Forbidden West.",
    "It won't be too much longer before gamers get to experience the long-delayed Dying Light 2. The sequel to last generation's second best zombie apocalypse game (give it up for Sunset Overdrive), Dying Light 2 has a lot to prove when it releases on December 7, 2021.",
    "The news of the release date came straight from the mouth of developer Techland during a recent livestream that understandably dialed up hype and anticipation for the game, as GamesRadar’s Rachel Weber described: “Dying Light 2 is officially coming this year, and with a fresh new title to boot.\"",
    "“Now called Dying Light 2 Stay Human, Techland has given us another helping of gameplay in the most recent update.\"",
    "“With a broader view of the upcoming open-world zombie game, the bigger and more ambitious title will take us to The City in the 'modern Dark Ages'. Coming to the PS5 and Xbox Series X as well as last-gen consoles, we won't have too long to wait to dive right into the action.\"",
    "“The sequel was originally revealed at E3 2018, and got our hearts racing. Techland is promising 100 hours of content, with a 15-20 hour campaign, and after the bits of Dying Light 2 we've seen, the more the better.”",
    "The Dying Light 2 release date has officially been confirmed and is set for December 7, 2021 on PS5, PS4, Xbox Series X, Xbox One and PC.",
    "Sonic Colors was original released in 2010 on the Nintendo Wii and DS, and is often regarded by series fans as being one of the better 3D outings in the whole series.",
    "It seems like Sega agrees with that sentiment, too, as the first 3D remaster in the series' history will be coming in the form of Sonic Colors: Ultimate, and is due to release on September 7 on all major platforms.",
    "“Sonic Colors combines 2D and 3D platforming as Sonic tries to save the Wisps, an alien race enslaved by Doctor Eggman,” said GamesRadar’s Alyssa Mercante.",
    "“In the game's main hub, Doctor Eggman's Incredible Interstellar Amusement Park, there are five small planets chained together, which Sonic travels between.\"",
    "“The gameplay looks great in the Sonic Colors: Ultimate trailer, with gorgeous flashes of neon lights and colors, and beautifully detailed environments. Sonic's abilities look fantastic, and the colorful Wisps are vibrant and adorable.\"",
    "“The Sonic Colors: Ultimate announcement was made during the Sonic Central live stream, which celebrated the fast blue dude's 30th anniversary.\"",
    "“Sonic Colors will release digitally and physically for PS4, Xbox One, Nintendo Switch, and PC via the Epic Games Store on September 7.\"",
    "Finally, Horizon Forbidden West was looking mighty promising in a gameplay showcase courtesy of Guerrilla Games and the most recent of Sony's State of Play showcases.",
    "Josh West from GamesRadar said: \"Guerrilla Games is expanding the exploration opportunities in Horizon Forbidden West.\"",
    "\"While we have only seen a small slice of the open world, which Guerrilla promises will be massive, we were able to see the depth the studio is bringing to the PS5 sequel.\"",
    "\"The landscape and architecture of San Francisco is worlds apart from the Colorado setting of Horizon Zero Dawn, and Aloy has a number of new tools to help her traverse this new space.\"",
    "\"An upgrade to the Focus ability is undoubtedly the most impactful, giving Aloy the ability to spot free-climbing areas all throughout the environment – a massive change to traversal, given that she was previously limited to climbing-specific markers on the map in Horizon Zero Dawn.\"",
    "\"Free-climbing can also be used in tandem with the Pullcaster, a grappling hook that makes quick work of big distances, and the Shieldwing, a glider that gives Aloy more tactical command of vertical spaces.\"",
    "Totally Rated features reviews and opinions of what's hot and what's not in the tech and gaming world.",
    "Bringing together leading titles from across the industry, we hear first hand from those who have reviewed - and rated - the very latest games and products on the market.",
    "New episodes of Totally Rated will roll out every Thursday."
  ],
  "headers": {
    "3": "Dying Light 2's apocalypse will soon be upon us",
    "9": "Will Sonic Colors ultimately save the franchise?",
    "16": "Horizon goes west"
  },
  "links": {
    "Dying Light 2": "https://www.techradar.com/news/dying-light-2-release-date-trailers-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer"
  }
}