{
  "source": "https://www.techradar.com/news/ps5-isnt-good-value-compared-to-xbox-series-x-and-im-sick-of-it",
  "title": "PS5 isn’t good value compared to Xbox Series X, and I’m sick of it",
  "category": "gaming",
  "updated": "2021-04-18T16:24:03.820Z",
  "author": "adam-vjestica",
  "summary": "Opinion: Greatness awaits on PS5, for the payers",
  "article": [
    "Despite being enamored with the PS5 at launch, my enthusiasm for the system has slowly begun to wane. The PlayStation 5 is an accomplished console with some fantastic features, but one ugly truth is starting to become abundantly clear: the PS5 can’t compete with Microsoft’s Xbox Series X when it comes to value. And it’s why I’ve found myself playing on Xbox Series X far more than PS5.",
    "Even before Microsoft’s flagship console was released, I stated that the Xbox Series X was already better value than the PS5. And honestly, that gap has widened considerably almost five months since the consoles released, to the point where it’s making Sony’s tried and trusted strategy look horribly outdated.",
    "It’s worth reiterating, but Microsoft really doesn’t care if you buy an Xbox Series X. With Xbox Game Pass and Xbox Game Pass Ultimate, the company has created a revenue stream that’s available across Xbox consoles, PC, Android phones, and soon, iOS devices and browsers. It means there are practically no more barriers to entry anymore, and anyone who is interested in Xbox or playing games in general can do so – even those who only own a PS5 or Nintendo Switch will probably have access to a PC or smartphone.",
    "Unlike Microsoft, then, Sony has to sell you a PS5 if it wants to make money. It can’t monetize users who don’t own its hardware – outside of PC players subscribing to PS Now to stream PS4, PS3 and PS2 games via the cloud or picking up the odd PS4 port – and historically, platform holders don’t tend to make any profit on hardware until many years into a console generation. It’s traditionally software sales, add-ons, subscriptions and even accessories that provide the biggest yields.",
    "On the face of it, though, selling consumers a PS5 clearly isn’t a problem for Sony. It’s done an admirable job at shifting millions of PlayStation 5 consoles thanks to the innovative DualSense controller, an alluring first-party lineup of titles, and competitive pricing. It helps that the PS4 was also a phenomenal success story for Sony, which will have generated a lot of goodwill and loyal customers in the process.",
    "But once Sony sells you a PS5, it needs to turn that hardware loss into a profit. It’s no surprise that Sony’s hottest commodities – its first-party lineup – now cost $70 / £70, and that it continues to sign exclusivity deals with third-party publishers like Square Enix for blockbuster games like Final Fantasy 16. It’s also tried to make PlayStation Plus more appealing by including 20 games for free for PS5 owners, and PS Now thankfully added the option to download games – though its library still pales in comparison to Xbox Game Pass, and there are no PS5 titles available. Microsoft’s service has 37 Xbox Series X/S optimized titles for comparison’s sake, a number which will continue to grow.",
    "Microsoft, meanwhile, is in a completely different position. It simply wants to attract more Xbox Game Pass subscribers to drive its bottom line. If it manages to sell hardware, it’s a massive bonus and obviously a lucrative one, but it’s no longer solely reliant on needing consumers to do so.",
    "While a company’s profit and loss chart doesn’t bother me in the slightest, these differing strategies are starting to ultimately affect the consumer, and it’s Microsoft’s approach that is paying dividends for gamers, and myself, who simply want to play more titles.",
    "Much like how Netflix has changed the film and television industry, Xbox Game Pass has delivered the same type of seismic shift for video games. Unsurprisingly, it’s the key reason why I turn on my Xbox Series X almost every night: there’s always something to play that’s either passed me by, just been added or recently optimized for Microsoft’s current-gen consoles.",
    "If you didn’t know already, Microsoft’s subscription service lets you access hundreds of games for a monthly fee of $9.99 / £7.99 / AU$10.95. Any game that’s on Xbox Game Pass can also be bought at a 20% discount if you’d prefer to own it forever, and downloadable content is discounted by 10%. Subscribers also get access to every Xbox Game Studios title on day one, which includes the likes of Gears 5, Sea of Thieves, Forza Horizon 4 and upcoming games like Halo Infinite, Everwild and Forza Motorsport. Pretty great, right?",
    "That in itself might be enough for some people to subscribe, but Microsoft has managed to sweeten the deal even further in recent months by securing an increasing number of noteworthy third-party titles. Outriders and the previously PlayStation exclusive baseball sim MLB: The Show 21 are both available on Xbox Game Pass day one, and Octopath Traveler, one of the best Nintendo Switch games, dropped on the service at launch. If you want to play Outriders or MLB: The Show 21 on PS5, you’re looking at $60 and $70 respectively.",
    "Xbox Game Pass Ultimate, Microsoft’s highest Game Pass tier which costs $14.99 / £10.99 / AU$15.95 a month, ups the stakes even further – almost to an unfathomable degree. With an Xbox Game Pass Ultimate subscription, you get all of the above, along with access to Xbox Game Pass on PC, Xbox Live (required if you want to play online), Xbox Cloud Gaming (Beta), perks for various titles and EA Play. If you’re someone who just loves to play games, particularly across multiple platforms, it’s a simply phenomenal value proposition that can’t be beat.",
    "To get an equivalent experience on PS5, you’d need to pay $9.99 a month for PS Plus, $9.99 for PS Now and $4.99 a month for EA Play. That’s $24.97 a month in total, and you don’t get access to cloud gaming on Android devices or the option to download and play PS4 or PS5 titles on PC.",
    "That’s already $9.98 more a month, then, but where PS5 gamers really get hit hard is when a game like MLB: The Show 21 comes out or a big PlayStation exclusive. You’ll need to pay a further $70 / £70 on top of your existing $24.97 monthly fee – a price which Sony believes gamers are willing to pay for its first-party titles. That’s $94.97 altogether or 84% more compared to the flat fee of $14.99 that Xbox gamers will have to pay if an Xbox Game Studios title, like Halo Infinite, releases the same month. And remember, you're still getting less for your money in the first place.",
    "As someone who basically only spends their disposable income on video games (I really should buy some more clothes one day), this price differential is simply too significant to ignore. And it’s for this reason that I’ve found myself gravitating back towards the Xbox Series X after initially being wooed by Sony’s new console. There are simply more games to play right now, and I don’t need to break open my wallet to experience the majority of them.",
    "As good as the PS5 is, it’s really starting to feel like a luxury purchase. I can’t help but ask “what’s next?” whenever I boot up the PS5. I want to be playing new games on it, and PS Plus has thankfully delivered some hits like Control: Ultimate Edition, Oddworld: Soulstorm and Destruction All-Stars (a game which was originally set to cost $70 at launch).",
    "But it’s Microsoft who is constantly giving me reasons to turn on its console. Xbox Game Pass is the key driver in all of this, but features like FPS Boost also help make me feel like I’m getting more bang for my buck. Xbox also has a clever reward system in place that encourages you to play and complete quests to earn Microsoft Reward points. You can then redeem these by either entering competitions or simply getting Xbox credit. You’re essentially being paid to play.",
    "Sony, it seems, is happy to sit back until its next big title comes out. But that simply isn’t enough to warrant owning a $499 / £449 console when the competition is bending over backwards to please its install base. Even when Sony does show its more generous side with its Play At Home initiative, the titles on offer are often games PlayStation owners will have undoubtedly played before or many years old.",
    "Giving away one of its exclusive games seems counterintuitive: if you own a PlayStation, how many users didn’t play Ratchet & Clank, Horizon: Zero Dawn or Uncharted 4? Not many I’d argue, as it’s the reason so many bought a PlayStation 4 in the first place.",
    "Sony needs to do more then. PlayStation Plus continues to be a valuable service, and is currently the only means of getting PS5 games without paying full price. But PlayStation Now is still a wholly unattractive proposition, and remarkably, more expensive than Xbox Game Pass in the UK (£8.99 for PS Now, £7.99 for Xbox Game Pass). Sony doesn’t make its first-party games available on PS Now, either, and if they do ever appear, it’s often months if not years later. PS Now only gives subscribers access to PS4, PS2 and PS3 games, the latter of which can only be streamed.",
    "It's unlikely that Sony would ever put it's prized assets on PlayStation Plus day one, but imagine if there was a PlayStation Plus Platinum tier that at least included PS Now and EA Play? That would at least keep Sony somewhat competitive against Xbox Game Pass Ultimate.",
    "It’s time for Sony to do more to satisfy users who have made the decision to pick up a PS5, and not just try to tempt new users in or away from the competition with one or two high profile games. Even Nintendo – a company that is notoriously tight-fisted when it comes to discounts and sales – has a reward system in place for users who buy games digitally, but Sony, at least in Europe, has nothing of the sort.",
    "As it stands, the PS5 really feels like it’s only aimed at the payers – not the players Sony supposedly cares so much about."
  ],
  "headers": {
    "4": "Cash back",
    "8": "Hard to pass up",
    "11": "Ante up",
    "14": "Raw deal",
    "19": "Gimme the goods"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series X was already better value than the PS5": "https://www.techradar.com/news/the-xbox-series-x-is-already-better-value-than-the-ps5-heres-why",
    "Microsoft really doesn’t care if you buy an Xbox Series X": "https://www.techradar.com/news/microsoft-really-doesnt-care-if-you-buy-an-xbox-series-x-heres-why",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS Now": "https://www.techradar.com/reviews/gaming/playstation-now-1213666/review",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "millions of PlayStation 5 consoles": "https://www.techradar.com/news/more-ps5-stock-promised-as-sony-confirms-its-biggest-console-launch-ever",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Final Fantasy 16": "https://www.techradar.com/news/final-fantasy-16-release-date-trailer-news-and-rumors",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-free-games",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows",
    "Gears 5": "https://www.techradar.com/reviews/gears-5-review",
    "Sea of Thieves": "https://www.techradar.com/news/sea-of-thieves-review",
    "Forza Horizon 4": "https://www.techradar.com/news/forza-horizon-4-review",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Everwild": "https://www.techradar.com/news/everwild-release-date-trailers-news-rumors",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Outriders": "https://www.techradar.com/reviews/outriders-review",
    "MLB: The Show 21": "https://www.techradar.com/news/mlb-the-show-21-xbox-game-pass-series-x",
    "best Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Xbox Game Pass on PC": "https://www.techradar.com/how-to/how-to-set-up-xbox-game-pass-for-pc",
    "Xbox Live": "https://www.techradar.com/news/xbox-live-gold-free-games",
    "Xbox Cloud Gaming": "https://www.techradar.com/how-to/how-to-stream-xbox-games-on-your-phone-or-tablet",
    "Sony believes gamers are willing to pay for its first-party titles": "https://www.techradar.com/news/sony-defends-price-of-ps5-games-but-says-it-wont-go-any-higher",
    "Control: Ultimate Edition": "https://www.techradar.com/news/februarys-ps-plus-free-games-include-ps5-improved-control-and-destruction-allstars",
    "Oddworld: Soulstorm": "https://www.techradar.com/news/soulstorms-messy-start-nearly-made-me-give-up-im-glad-i-didnt",
    "Destruction All-Stars": "https://www.techradar.com/news/destruction-allstars-is-worth-a-spin-but-lacks-longevity",
    "FPS Boost": "https://www.techradar.com/news/list-of-xbox-fps-boost-games-on-xbox-series-x-and-xbox-series-s",
    "Play At Home": "https://www.techradar.com/news/grab-horizon-zero-dawn-for-free-on-ps4-and-ps5-right-now",
    "Horizon: Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Uncharted 4": "https://www.techradar.com/news/gaming/uncharted-4-a-thief-s-end-review-1320412",
    "reward system": "https://my.nintendo.com/about_gold_point?lang=en-US"
  }
}