{
  "source": "https://www.techradar.com/news/whatsapp-confirms-that-an-ipad-version-is-on-the-way",
  "title": "WhatsApp confirms that an iPad version is on the way",
  "category": "computing",
  "updated": "2021-06-04T10:42:41Z",
  "author": "daryl-baxter",
  "summary": "iPad version finally confirmed",
  "article": [
    "In an interview with WABetaInfo, Mark Zuckerberg and WhatsApp CEO Will Cathcart confirmed that WhatsApp is coming to the iPad, alongside more features on the way.",
    "The messaging app has been a staple of smartphones for years now, eclipsing Apple and Google’s own messaging apps for something that’s used by billions around the world.",
    "In the last year, the usage has grown exponentially, with more demand for privacy and even better features to help manage the many group chats we’ve all become accustomed to.",
    "Even though the messaging of WhatsApp’s new privacy guidelines was terribly mismanaged earlier this year, upcoming features look to alleviate these frustrations and confusions with multi-device support and more disappearing messaging options.",
    "Currently, you can access the messaging app on your iPad by using the web version of WhatsApp by accessing it through a web browser. However this comes with more disadvantages than advantages, as there’s no native push notification support, very slow loading times when trying to display a message, and even sending gifs is a hit and miss experience.",
    "In the interview, Will Cathcart confirmed that a native app was on its way, saying:",
    "“We’d love to support WhatsApp on the iPad! Getting multi-device right will make it possible for us to build things like that.”",
    "It seems as though multi-device support had to work in order for an iPad app to be viable, which is now a possibility. Cathcart later confirms that up to four of your devices will be able to use the same WhatsApp account at the same time, so it may be that your account won’t need your phone number to access the same chats.",
    "It looks as though the team are focusing on expanding the disappearing messages first. While they can already disappear after a certain amount of time, there’s also the upcoming ability to view a message once, and then it will disappear.",
    "This could include photos or videos, similar to how Snapchat works, where you would view it once and not see it again, so this could be very useful for someone who wants to send over confidential information.",
    "Cathcart also confirmed that multi-device support is coming to the beta version of WhatsApp within the next two months, so it’s not a far cry to see iPad support appear by the end of August 2021.",
    "Via WABetaInfo"
  ],
  "headers": {
    "4": "WhatsApp on iPad",
    "8": "When is the iPad app appearing?"
  },
  "links": {
    "WABetaInfo": "https://wabetainfo.com/will-cathcart-and-mark-zuckerberg-confirm-to-wabetainfo-3-features-to-come-on-whatsapp/",
    "terribly mismanaged": "https://www.techradar.com/news/whatsapp-flip-flops-on-privacy-policy-threats-again"
  }
}