{
  "source": "https://www.techradar.com/news/microsoft-accidentally-shows-off-a-new-media-player-for-windows-11",
  "title": "Microsoft accidentally shows off a new Media Player for Windows 11",
  "category": "computing",
  "updated": "2021-09-29T10:47:11Z",
  "author": "daryl-baxter",
  "summary": "Visualizations and skins to come?",
  "article": [
    "Microsoft looks to be redesigning more apps for Windows 11, with a Media Player application having been accidentally shown off during a video podcast.",
    "According to Windows Latest, the company was showcasing the Focus feature from the Clock app when another window appeared, showing the user interface for an app called Media Player.",
    "This may mean that Windows Media Player, last updated in 2012, may be about to return for Windows 11 when the upgrade arrives in October.",
    "The new app was shown during a Windows Insider webcast, now made private, which showcased a user interface that looked similar to Windows Media Player, but with the color scheme of the TV & Movies app that’s been available since Windows 8.",
    "Windows Media Player has been available to download since 2012 with minor updates, but it's been abandoned in favor of other applications with similar functions.",
    "But while there’s third-party choices such as VLC and KMPlayer, Microsoft has an opportunity to make Windows Media Player a staple for media apps on Windows.",
    "If you ever used Windows XP or a previous version, there’d be a good chance that you had your music library stored within Windows Media Player.",
    "It used to be pre-installed but later available to download on Microsoft’s site where you could use a variety of skins and visualizations that would rival Winamp, another media player from the late 90s.",
    "In the years since the app would get updated with a new look or new features from time to time, but in 2009 the 12th version was released, and in turn abandoned.",
    "With the breadth of media players that’s been available to download, Windows Media Player was left by the wayside. Microsoft themselves added to this by introducing a Movies & TV app in Windows 8 that also gave you the ability to buy content from the Windows Store, but this has also seen fewer updates in recent years.",
    "However, with Media Player seemingly about to debut in Windows 11, it could be a signal that Microsoft wants the app to see a return for its users.",
    "Windows Media Player has a pull of nostalgia to it, whether that’s from the skins or visualizations, but just its name gives the app the right connotations for users who just want to play some music as soon as their PC has upgraded to Windows 11.",
    "Some users just want to use the apps that are pre-installed on their PC without having to look for any alternatives. This is where Windows Media Player can help with these plights.",
    "While we may not see trippy visualizations in this reboot of Media Player at first, it’s an encouraging start by Microsoft to focus on the apps that users want to see tailor-made for Windows 11.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "What does Media Player look like?",
    "6": "Analysis: the return of Windows Media Player?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows Latest": "https://www.windowslatest.com/2021/09/29/microsoft-accidentally-teases-new-media-player-for-windows-11/",
    "Windows Insider webcast": "https://www.youtube.com/watch?v=MiI20Imtp6s",
    "available to download since 2012": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1208804883891654400&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-gb%2Fwindows%2Fget-windows-media-player-81718e0d-cfce-25b1-aee3-94596b658287"
  }
}