{
  "source": "https://www.techradar.com/news/intel-launches-rocket-lake-cpus-positioning-core-i9-11900k-to-take-out-amds-ryzen-5900x",
  "title": "Intel launches Rocket Lake CPUs, positioning Core i9-11900K to take out AMD’s Ryzen 5900X",
  "category": "computing",
  "updated": "2021-03-16T15:00:07Z",
  "author": "darren-allan",
  "summary": "Outdoes the 5900X in some games and productivity tests – going by Intel’s own results",
  "article": [
    "Intel has officially unveiled Rocket Lake, its 11th-gen desktop processors which are headed up by the Core i9-11900K.",
    "Built on the new Cypress Cove architecture, Rocket Lake CPUs usher in a claimed 19% improvement in terms of IPC (Instructions per Clock) performance compared to current Comet Lake products, a figure Intel has mentioned before. (That IPC gain is based on Intel’s own internal benchmarking on SPEC CPU 2017 with the 11900K and 10900K running at the same fixed clock speed).",
    "Intel further notes that the Xe integrated graphics that these processors benefit from deliver an up to 50% performance boost compared to 10th-gen chips (going by 3DMark Fire Strike results, again from Intel’s own testing).",
    "As previously rumored, the flagship Intel Core i9-11900K has a base clock of 3.5GHz, all-core Turbo of up to 4.7GHz, and can boost up to a maximum of 5.3GHz (for short periods with TVB or Thermal Velocity Boost). It’s an 8-core CPU with 16-threads and 16MB of shared L3 cache on-board (actually a smaller amount than the 20MB on the 10900K).",
    "The Core i9-11900K is also shown in game benchmarks (some of which have also already been leaked), with Intel demonstrating that it’s 14% faster than the 10900K in Microsoft Flight Simulator (at 1080p), and 11% quicker than AMD’s Ryzen 9 5900X (12-core CPU).",
    "Total War: Three Kingdoms shows the 11900K as being 13% and 10% faster than the 10900K and 5900X respectively, but Gears 5 has more modest gains of 9% and 3% respectively (all of these are at 1080p), the latter of which is not going to really be that noticeable.",
    "Still, these seem promising numbers for Team Blue, although we must exercise some caution, as ever, when it comes to any internal testing, and the way in which benchmarks (or other variables) can be selected to potentially present products in the very best light.",
    "Intel further details some benchmarks for the mid-range Core i5-11600K in the same games, a 6-core (12-thread) CPU with a base clock of 3.9GHz and all-core Turbo of up to 4.6GHz. In this case, however, there’s only a comparison with the 10600K provided, and not a Ryzen rival.",
    "The 11600K comes out with a bigger 16% lead in both Total War: Three Kingdoms and Gears 5 at 1080p resolution versus the 10600K, and a 7% uplift in Microsoft Flight Simulator (and Grid 2019).",
    "Productivity benchmarks – again from Intel’s own internal testing – are also provided, and for video creation workflow, the 11900K is shown as a whopping 88% faster than the 10900K, and 35% quicker than the Ryzen 5900X. For photo creation, it’s 8% better than the 10900K, and 14% swifter than the 5900X, and for Microsoft Office productivity, the gains are 12% and 8% respectively.",
    "When it comes to the Intel Core i5-11600K, video creation is 61% faster than its 10th-gen predecessor, and the difference is 18% and 12% in favor of Rocket Lake for photo creation and Microsoft Office productivity respectively.",
    "Rocket Lake further delivers support for DDR4-3200MHz system memory, 20 PCIe 4.0 lanes, plus enhanced overclocking capabilities.",
    "The latter includes the ability to implement real-time memory overclocking, allowing for the speed of system RAM to be tuned on-the-fly, and memory overclocking will also be possible on Intel’s H570 and B560 chipsets. There are a bunch of other features for hardcore PC tinkerers, including an AVX disable (or enable) setting and AVX2 and AVX-512 offset and voltage guard-band override.",
    "On the heavyweight computing side, Intel’s Deep Learning Boost and Vector Neural Network Instructions will help to considerably improve performance with deep learning workloads.",
    "Pricing details for Rocket Lake still haven’t been made available, but Intel has already let us know that the 11th-gen processors will go on sale March 30."
  ],
  "headers": {
    "9": "Productive predictions"
  },
  "links": {
    "Rocket Lake": "https://www.techradar.com/news/intel-rocket-lake",
    "processors": "https://www.techradar.com/news/best-processors",
    "Comet Lake": "https://www.techradar.com/news/intel-comet-lake-release-date-news-and-features",
    "rumored": "https://www.techradar.com/news/rocket-lake-leak-reveals-final-specs-of-flagship-intel-core-i9-11900k-desktop-cpu",
    "have also already been leaked": "https://www.techradar.com/news/intel-rocket-lake-leak-hints-at-core-i9-11900k-cpus-gaming-performance",
    "AMD’s Ryzen 9 5900X": "https://www.techradar.com/reviews/amd-ryzen-9-5900x",
    "overclocking": "https://www.techradar.com/news/intel-scraps-insurance-plans-for-cpu-overclockers-and-the-reason-might-surprise-you",
    "11th-gen processors will go on sale March 30": "https://www.techradar.com/news/intel-finally-confirms-its-new-rocket-lake-s-processors-will-launch-on-march-30"
  }
}