{
  "source": "https://www.techradar.com/news/lightroom-is-getting-these-powerful-photoshop-tools-on-desktop-and-mobile",
  "title": "Lightroom is getting these powerful Photoshop tools on desktop and mobile",
  "category": "cameras",
  "updated": "2021-09-29T09:01:55Z",
  "author": "mark-wilson",
  "summary": "New masking tools are unmasked",
  "article": [
    "If you regularly use Lightroom to polish your photos, you'll likely have been equal parts impressed and frustrated by its editing tools – but Adobe is promising to make selective tweaking a lot easier with a big update that's coming soon.",
    "From October 26th, Lightroom will be getting some long overdue masking tools that will bring some of the AI-powered tricks we've recently seen added to Photoshop (like Sky Replacement) to its popular photo editor and organizer. These upgrades will come to Lightroom, Lightroom Classic and Adobe Camera Raw.",
    "The changes promise to make choosing specific parts of your photo – like a person, or the sky – a one-click affair, which should make it far easier to, for example, fix overexposed parts of a photo or make more granular tweaks.",
    "The new changes will be found in the panel below Lightroom's histogram. Instead of the brush and gradient buttons, there will be a new 'masking' button – this contains all of Lightroom's masking options, including the new 'select subject' and 'select sky' options.",
    "What's particularly interesting about Lightroom's new approach, which Adobe says is the biggest upgrade to its selective enhancements since Lightroom 2 in 2008, is that you can effectively layer extra masks on top of ones you've chosen. This isn't a full Photoshop-style layers approach, but it's a welcome taste of it.",
    "The example given by Adobe below shows how quickly it now is to choose the background (by inverting the 'select subject' mask), then remove the sky from that selection. This means you can quickly adjust the exposure, shadows and contrast in the ground and background, without affecting other parts of the image.",
    "While this may sound like a relatively minor boost to Lightroom's editing options, Adobe says it involved overhauling the program's image processing engine over a year-and-a-half. This process has apparently meant that Adobe has \"some fun new tech brewing\" that it'll be releasing sometime next year. For now, though, its new tools will help it keep pace with its more nimble rivals like Luminar and Affinity Photo.",
    "For a long time, Lightroom has lacked the traditional masking tools that we've seen in Photoshop. Instead, photographers have tended to use a combination of local adjustment tools and range masks to choose particular parts of a photo to edit.",
    "The previous existence of those tools mean that Lightroom's new features will feel more like an added convenience than a revolution to keen users of the program.",
    "For example, Lightroom's 'auto mask' tool has been on hand to help you choose particular parts of a photo, while the very useful luminance range mask is a popular way to choose specific areas to adjust based on a defined level of brightness.",
    "But there's no doubt that the one-click selection of subjects and the sky, if they do indeed work as flawlessly as Adobe's demo, will help speed up many photographers' editing workflows.",
    "Even better, Adobe has said that many users have requested that the Lightroom experience is consistent across desktop and the mobile app, which has apparently meant that the \"AI-powered tools work on mobile devices equally as well as on desktop\". This includes the color range masks that were previously only available on the desktop app.",
    "We're looking forward to taking all of the new tools for a spin from October 26th to see if Lightroom can move up the pecking order of our guide to the best photo editing apps."
  ],
  "headers": {
    "7": "Analysis: Welcome tools for speedier photo edits"
  },
  "links": {
    "Lightroom": "https://www.techradar.com/reviews/adobe-photoshop-lightroom-cc",
    "best photo editing apps": "https://www.techradar.com/best/best-photo-editing-apps"
  }
}