{
  "source": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-be-many-months-away",
  "title": "Samsung Galaxy Z Fold 3 and Z Flip 3 could be many months away",
  "category": "phones",
  "updated": "2021-02-05T09:47:46Z",
  "author": "james-rogerson",
  "summary": "Five more months to go",
  "article": [
    "If you were hoping to see a new foldable phone from Samsung anytime soon you might be out of luck, as a leaker claims that we may not see either the Samsung Galaxy Z Fold 3 or the Samsung Galaxy Z Flip 3 for five months.",
    "That’s according to @UniverseIce (a Twitter leaker with a solid track record), and in the case of the Samsung Galaxy Z Fold 3 shouldn’t be much of a surprise, given that the Samsung Galaxy Z Fold 2 was only unveiled in August, but it’s more disappointing for the Samsung Galaxy Z Flip 3.",
    "The original Samsung Galaxy Z Flip landed in February 2020, so it’s now been around a year since it came out. There was then the Samsung Galaxy Z Flip 5G in July, but that basically just added 5G and a slightly faster chipset, so we were hoping for a proper new model soon.",
    "Of course, this source only says we “may” have to wait five months, so they don’t sound at all certain, but previous leaks mostly suggest we’ll be waiting until the second half of the year for both, so this is in line with what we’ve heard before.",
    "There are some voices of dissent, with one claiming for example that the Samsung Galaxy Z Fold 3 could land in June, but that would be almost five months from now anyway, so we certainly wouldn’t expect to see these phones anytime soon.",
    "That also means we might not see another high-end handset from Samsung for a while, as the only other one on the horizon is the Samsung Galaxy Note 21, which isn’t expected before August and which some sources claim isn’t even happening. So if you’re in the market for the best phone that Samsung has to offer, it’s likely to be the Samsung Galaxy S21 Ultra for quite a while yet."
  ],
  "headers": {},
  "links": {
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "@UniverseIce": "https://twitter.com/UniverseIce/status/1357334862622040065",
    "Samsung Galaxy Z Fold 2": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-2-review",
    "Samsung Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "the Samsung Galaxy Z Fold 3 could land in June": "https://www.techradar.com/news/samsung-galaxy-s21-and-fold-3-may-support-s-pen-while-the-note-might-be-dead",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review"
  }
}