{
  "source": "https://www.techradar.com/news/you-could-buy-this-gucci-xbox-series-xbut-itll-cost-you-dollar10000",
  "title": "You could buy this Gucci Xbox Series X – but it'll cost you $10,000",
  "category": "gaming",
  "updated": "2021-11-13T11:07:26Z",
  "author": "emma-boyle",
  "summary": "It comes with Game Pass Ultimate. Bargain.",
  "article": [
    "In a brand collaboration you might not have seen coming, Microsoft and the luxury fashion house, Gucci, have teamed up to create a custom, limited edition and very expensive Xbox Series X.",
    "Only 100 of the consoles will be available worldwide and the branded bundle will set you back the sizeable sum of $10,000. That $10,000 will get you a numbered, laser-engraved console, two customized Xbox controllers and an Xbox and Gucci branded carry case. Oh, and an Xbox Game Pass Ultimate subscription, though it’s unclear how long the subscription lasts. Our fanciful hearts say lifetime, our heads say probably not.",
    "So, what makes the Gucci Xbox Series X so special? Well, it comes with Gucci’s familiar monogram motif laser-cut across its surface. According to Gucci, the pattern is “an evolution of the original Gucci Rhombi design from the '30s” and the ‘GG’ “becomes a wordplay – not only representing Guccio Gucci's initials but also the gaming phrase 'Good Game.'”",
    "Then, of course, there’s the vintage luggage-inspired carry case that’s been specifically designed to house the console and controllers in an Xbox-green lining. The customized controllers don’t have the laser-engraved pattern of the console; instead they feature Gucci House Web stripe in blue and red.",
    "The Gucci Xbox Series X goes on sale on November 17 but, presumably to add to the sense of exclusivity, you can only get it in-store at Gucci's New York City, London, Tokyo, Beverly Hills, Mexico City, Milan, Berlin, and Beijing stores.",
    "2021 is a big year for both Xbox and Gucci, with the former celebrating its 20th anniversary and the latter its 100th. If this console strikes you as a slightly extravagant means of celebrating, there's always the recently announced Xbox Series X controller and headset that's inspired by the original Xbox. Or you could just tune into the planned Xbox Anniversary celebration stream on November 15 at 10:00 a.m. PT / 1:00 p.m. ET / 6:00 p.m. GMT.",
    "As soon as I saw this Gucci branded Xbox I was immediately reminded of the time I saw a Dolce and Gabbana branded toaster. My first thought then, as now, was “why have you done this?” My second was “why is there a part of me that wants this?” The third, of course, is always “it’s how much?” and then I laugh, and laugh, and laugh.",
    "Looking back and forth between the console and the carry case, I find myself in a kind of weird cycle of rejection of both brands. The console makes me think “please remove the Gucci from my Xbox” but when it comes to the carry case, I think, “please remove the Xbox from my Gucci.” The controllers can stay as they are – I’m kind of into it.",
    "The Gucci Xbox Series X is a pretty bold-looking console and while it might not be to everyone’s taste, laser-engraving the pattern does at least err on the side of luxury. Better than slapping a sticker on it and hoping for the best.",
    "Thanks to shortages, it’s still not the easiest thing in the world to actually get an Xbox Series X and the shortages are expected to continue into 2022. Those who have been struggling to find a console ahead of Christmas might find themselves looking at this with mild disbelief.",
    "If you are desperately seeking an Xbox Series X and you happen to have $10,000 floating around that you wouldn’t miss, then this seems like a better route than the scalpers. If that’s absolutely not an option, then keep an eye on TechRadar. We’re always tracking Xbox Series X re-stocks and have our ears to the ground for Xbox Series X deals on Black Friday 2021, with reports that stock could improve over the period."
  ],
  "headers": {
    "6": "Opinion: It’s a look"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/deals/cheapest-xbox-game-pass-deals-prices",
    "According to Gucci": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8883450664126557000&xs=1&url=https%3A%2F%2Fwww.gucci.com%2Fus%2Fen%2Fst%2Fcapsule%2Fxbox-gucci&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fyou-could-buy-this-gucci-xbox-series-xbut-itll-cost-you-dollar10000",
    "Xbox Series X controller and headset that's inspired by the original Xbox": "https://www.techradar.com/news/new-xbox-series-x-controller-is-a-must-have-for-original-xbox-fans",
    "Xbox Anniversary celebration": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9232618661945975000&murl=https%3A%2F%2Fnews.xbox.com%2Fen-us%2F2021%2F11%2F08%2Fxbox-20-anniversary-broadcast-tune-in-details%2F",
    "expected": "https://www.techradar.com/news/xbox-series-x-restock-issues-will-continue-to-be-a-challenge-for-quite-a-while",
    "the scalpers": "https://www.techradar.com/news/halo-infinite-collectors-edition-sells-out-faster-than-microsoft-can-announce-it",
    "Xbox Series X re-stocks": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Xbox Series X deals on Black Friday 2021": "https://www.techradar.com/black-friday/xbox-series-x-black-friday-deals-2021",
    "reports that stock could improve over the period": "https://www.techradar.com/news/more-xbox-series-x-stock-could-arrive-just-in-time-for-black-friday"
  }
}