{
  "source": "https://www.techradar.com/news/tableau-launches-new-enterprise-plans-big-data-tools",
  "title": "Tableau launches new enterprise plans, big data tools",
  "category": "computing",
  "updated": "2021-09-03T01:31:41Z",
  "author": "anthony-spadafora",
  "summary": "Bringing analytics capabilities to an entire organization",
  "article": [
    "The cloud analytics firm Tableau has unveiled a number of new data and analytics platform capabilities in addition to new enterprise subscription plans designed to help customers' digital transformation efforts.",
    "The Salesforce-owned company aims to empower everyone in an organization by giving them access to trusted and governed data at a time when 87 percent of IT and business leaders are concerned that security and governance are slowing the pace of innovation according to a new report from Mulesoft.",
    "Tableau's new enterprise subscription plans will also make it easier to procure and deploy its analytics platform across an entire organization. This is because the company has made the decision to bundle analytics with Data Management and Server Management.",
    "Chief product officer at Tableau, Francois Ajenstat explained how the company's latest update to its platform can help organizations scale analytics in a press release, saying:",
    "“Tableau has long been a favorite to help individuals see and understand data,” said Francois Ajenstat, Chief Product Officer, Tableau. “We’re making it easier for IT leaders to make it a favorite across the entire enterprise and deliver an end-to-end solution to leverage the full power of data analytics.”",
    "With its latest platform update, Tableau is making data challenges easier to manage, easier to scale and easier to trust for enterprise organizations.",
    "Tableau Prep now makes it easier for users to reduce loads as well as costs of server resources automatically and generate rows to more easily map out trends in data.",
    "Governance is also easier with new features to help ensure and maintain data quality by alerting organizations to any potential issues while also providing easier visibility into the type of data they have and where it came from. At the same time, Tableau admins will be able to centrally configure which users and groups have access to which slices of data configure access.",
    "When it comes to scaling analytics, Enterprise Deployment Guidelines (EDG) provide the Tableau reference architecture for the company's enterprise customers with a prescriptive methodology to achieve requirements around availability, scalability and security. Dynamic Scaling is a new feature to the platform that helps enterprises appropriately resource their deployments while ensuring enough containers are available during peak demand times.",
    "Tableau's data prep and catalog improvements along with the company's new enterprise subscription plans will be available later this month with the release of Tableau 2021.3."
  ],
  "headers": {
    "5": "New capabilities and improvements"
  },
  "links": {
    "cloud analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "Salesforce": "https://www.techradar.com/news/salesforce-wants-to-make-it-easier-to-do-business-after-the-pandemic",
    "new report": "https://www.mulesoft.com/lp/reports/it-business-alignment-barometer",
    "Mulesoft": "https://www.techradar.com/news/salesforce-adds-rpa-to-mulesoft-with-servicetrace-deal",
    "press release": "https://www.tableau.com/about/press-releases/2021/tableau-launches-new-innovations-and-enterprise-plans-strengthen",
    "Tableau": "https://www.techradar.com/news/salesforce-snaps-up-tableau-in-biggest-acquisition-yet",
    "containers": "https://www.techradar.com/news/what-is-container-technology",
    "Tableau 2021.3": "https://www.tableau.com/products/our-platform"
  }
}