{
  "source": "https://www.techradar.com/news/how-to-watch-rick-and-morty-season-5-finale-where-you-are",
  "title": "How to watch Rick and Morty season 5 finale where you are",
  "category": "computing",
  "updated": "2021-09-05T01:00:41Z",
  "author": "alex-hughes",
  "summary": "The latest season of Rick and Morty is coming to an end",
  "article": [
    "After a short hiatus, we're finally back and ready to finish up the latest season of Rick and Morty. With just two episodes remaining in the fifth season of Dan Harmon's futuristic comedy, read on to see how to watch Rick and Morty season 5 episodes 9 and 10 online.",
    "Picking up where we left off in episode 8, Rick has done some pretty deep soul searching. He's rekindled his friendship with the one and only Bird Man, and we got an insight into their friendship and Rick's backstory.",
    "Now with a special 1-hour finale to finish the season, we could be taken anywhere. This will be the first time the show has produced a special length episode, allowing for a big send off.",
    "Whether these last two episodes will continue the theme we saw from the previous episode, delving into Rick's past life is unclear. Based on a small promo Adult Swim released, it looks like Rick and Morty will be going seperate ways for this big episode combination.",
    "Read on to see how to watch Rick and Morty season 5 final online and stream episodes 9 and 10. We've gathered viewing information for key regions including the UK, US, Australia and Canada.",
    "Not at home when the final two episodes of Rick and Morty air? If you end up being away, you will unfortunately find the content you are trying to watch is geo-blocked where you are.",
    "Luckily, there is a very simple solution to this - a VPN. This piece of software alters your IP address to that of another country, which means you can gain access to your preferred streaming service and watch episodes of your favorite shows from anywhere."
  ],
  "headers": {
    "5": "How to watch Rick and Morty online from outside your country",
    "7": "How to watch Rick and Morty season 5 finale in Australia"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}