{
  "source": "https://www.techradar.com/news/game-awards-2021-the-nominees-and-what-we-expect-to-see",
  "title": "The Game Awards 2021: date, time, nominees and announcement predictions",
  "category": "gaming",
  "updated": "2021-12-09T11:53:00Z",
  "author": "hamish-hector",
  "summary": "The Game Awards 2021 kicks off in just a few hours",
  "article": [
    "The Game Awards 2021 promises to be one of the biggest events of the gaming calendar, with six titles competing for the prestigious Game of the Year crown and plenty of reveals and announcements expected.",
    "There are multiple gaming award events throughout the year but The Game Awards is definitely the biggest - drawing in fans desperate to watch their favorite titles win as well as those excited to see trailers and reveal for projects on their way in 2022 and beyond.",
    "This year the front runner is Deathloop which has received eight nominations across all the categories; however, we'll have to wait and see how many it actually wins. Interestingly, Cyberpunk 2077 (one of this year's most divisive games) has also received a few nominations, including best RPG, so this could mean that developer CD Projekt Red is winning back some public favor.",
    "But it's not just the awards that we watch The Game Awards for. Usually, the show is jam-packed with world premieres, announcements and reveals for some of the biggest upcoming games - plus plenty of surprises and special guests. So even if you're not interested in the trophies, it's worth tuning in for.",
    "Below we've outlined the nominees for The Game Awards 2021 as well as our announcement predictions, when and where the event takes place and everything else you need to know.",
    "Hosted by games journalist Geoff Keighley, The Game Awards is easily one of the biggest events in the gaming calendar. The annual awards ceremony honors achievements in gaming, with categories such as best narrative, best indie game, game of the year and much more.",
    "But The Game Awards isn't simply an awards ceremony, it also acts as a game showcase. Typically the event is jam-packed with world premieres, announcements and reveals for some of the biggest upcoming games - plus plenty of surprises and special guests.",
    "In 2014, The Game Awards revealed the first gameplay trailer for Breath of the Wild, while, at The Game Awards 2019, Microsoft gave us our first look at The Xbox Series X console. Last year saw the reveal of Elden Ring gameplay for the first time, alongside the tease of a new Mass Effect game. Expect similar big announcements at this year's show.",
    "The Game Awards 2020 is available to watch (and rewatch) right here and on YouTube as a VOD. If you want to see what kind of announcements we saw last year you can check them out.",
    "The Game Awards 2021 takes place on December 9 at 8pm ET / 5pm PT (or December 10 at 1am GMT / 12pm AEDT) at the Microsoft Theater in Los Angeles.",
    "This year The Game Awards returns to being an in-person event, after going digital last year due to the pandemic. If you haven't been lucky enough to receive an invite to the Microsoft Theater, don't fret, as you can watch the whole thing online.",
    "Check out our guide on how to watch The Game Awards 2021 to find out more.",
    "So what should we expect from The Game Awards 2021? Well, for a start, we know that there will be \"four or five things\" as big as the Elden Ring gameplay reveal at Summer Game Fest 2021, including the announcement of brand-new games from major studios. Keighley has also teased that viewers will get a sense of \"true next-generation gameplay at the show\", which means we can likely expect some reveals or premieres for upcoming Xbox Series X and PS5 games.",
    "Rocksteady Studios has confirmed that it will be providing an update on The Suicide Squad: Kill The Justice League at the show, with Creative Director and co-founder of Rocksteady, Sefton Hill, tweeting that the developer can't wait to \"share the mayhem\". Hill didn’t go into any particular detail when it comes to what exactly the team will be bringing to the show but he did round his tweet out with a GIF of what looks like possible gameplay footage. Thus far, Kill the Justice League trailers have been shown as part of DC FanDome in both 2020 and 2021 but we've yet to see an official gameplay trailer - hopefully we will at the event.",
    "The Matrix Awakens: An Unreal Engine 5 Experience is also set to be revealed at The Game Awards. We don't know much about this \"interactive storytelling experience\" yet, but the website description reads: \"Get ready for a glimpse into the future of interactive storytelling and entertainment with UE5\". So, expect a mind-blowing tech demo with appearances from the cast of Matrix Resurrections, including Keanu Reeves. It is available to pre-download on PS5 and Xbox Series X right now.",
    "Former BioWare General Manager, Aaryn Flynn has also teased that the new game from his studio Improbable will be announced at the show.",
    "What we shouldn't expect, however, are any announcements or reveals from Activision Blizzard. Keighley has confirmed the publisher won't be involved in The Game Awards outside of its nominations, so don't expect any new Call of Duty, or updates on upcoming titles such as Diablo 4 and Overwatch 2.",
    "Apart from that, we're looking at mainly rumors. Keighley has said that most of the rumors he's read online have been wrong, but that we could see some of the games fans are expecting. Just some of the games that rumors suggest will make an appearance include Breath of the Wild 2, the new Splinter Cell game, BioShock 4, Forza Motorsport, Fable, Starfield and Hogwarts Legacy. There are also rumors of a Chrono Cross remake and the reveal of the next fighting game from NetherRealms Studios.",
    "But it's not just games that are showcased at The Game Awards, so we're hoping to get a proper look at HBO's The Last of Us TV show and another trailer for the Uncharted TV series . It's already been confirmed that the world premiere trailer for Sonic the Hedgehog 2 will debut at the show, with Ben Schwartz and Jim Carrey set to introduce it. We'll also get to see the next Sonic game too, according to Keighley.",
    "Here's the list of the nominees for (most) award categories at this year's Game Awards. We've skipped over those relating to eSports and Content Creator of the Year, but you can find those nominations on the Game Awards' official site.",
    "Some categories are fairly self-explanatory – such as Best RPG or best Action Game – but others can be a little more confusing. Under those titles, you'll find our brief explanation of how winners are picked as well as information on how that category can give us hints what games will win the show's most prestigious awards.",
    "If you want to vote for your favorite games to win, remember to head to the Game Awards website to cast your votes ahead of this year's event - but you better be quick, there's not long left to vote.",
    "Game of the Year is awarded to – you guessed it – the best game that released in the past year according to fans and judges. It's often a difficult category to predict before the night begins, though as the prizes start rolling in it can quickly become clear which game is the favorite.",
    "Based on previous winners we suspect it'll be a single-player Action/Adventure game with elements of open-world exploration (with six of the seven past winners falling into this category). A lot of this list also ticks those boxes so this year it's anyone's game.",
    "Best Game Direction is a tough one to quantify next to Game of the Year as the two categories can often feel pretty similar – and that's why most years the winner is the same for both awards.",
    "Sorry Returnal, but as the only game on this list not featured in the Game of the Year category you might be at a statistical disadvantage.",
    "What game from this year had the best narrative? This is a fairly self explanatory category where judges are asked to consider the underlying story above all other aspects when judging the games.",
    "'Are video games art?' is an oft debated subject, and this category aims to pick the game from the past year that proves the answer is a resounding 'Yes'.",
    "If you love listening to video game soundtracks, this category is one to pay attention to as you will definitely want to add the winning score to your playlist.",
    "Typically longer adventure titles have an advantage here as players spend a lot longer listening to the score than with shorter experiences but we'll have to see.",
    "Audio design differs from score and music as it is about judging the immersive feel of a game's audio and how well real word sounds are translated into the virtual space.",
    "For example Call of Duty: Modern Warfare won in 2019 for its emphasis on making guns fired indoors sound different from afar to those fired outside – both being different again to if a weapon is fired in a doorway.",
    "Games for Impact celebrates games that offer a thought provoking experience with an important social message to share. In previous years we've seen games awarded for spreading awareness of mental health and trans issues, and we feel this list is full of must-play titles every year.",
    "These games won't have released this year, but the developers have been providing new content and updates that keep the experience as fresh as when it originally launched.",
    "This category celebrates games from creatives outside of the traditional publisher system – independent creative teams that typically offer a more unique experience than you'd expect from a AAA blockbuster.",
    "You'll find quite a few of these games on our best VR games list – and given that several are exclusive to the Oculus platform you'll find them on our bets Oculus Quest games list too.",
    "We loved I Expect You To Die 2 and Lone Echo 2 when we played them, though we expect Resident Evil 4 will go over well with voters too.",
    "Normally the 'Best [blank] Game' categories are fairly self explanatory so we don't need to explain them however Best Family Game is an odd one. While plenty of adults will adore these titles this category is a polite way to say 'Best Game for Kids' - something that is fun for all the family.",
    "Lastly, we have the category that looks towards gaming's future and honors a title that isn't out yet but that fans are incredibly excited for.",
    "Last year Elden Ring won and it looks set to be on track to win again this year. That would put it in good stead to win Game of the Year after it releases – as both Last of Us Part 2 and Breath of the Wild won this category before going on to deliver on fan's expectations.",
    "If you want to know more about the games on this list we've rounded up everything you need to know about Elden Ring, God of War Ragnarok, Horizon Forbidden West, The Legend of Zelda: Breath of the Wild 2, and Starfield. Hopefully, we'll learn even more about some of these games during the event.",
    "Best game direction winner (2020)",
    "Best narrative winner (2020)",
    "Best art direction winner (2020)",
    "Best score and music winner (2020)",
    "Best audio design winner (2020)",
    "Best performance winner (2020)",
    "Games for impact winner (2020)",
    "Best ongoing game winner (2020)",
    "Best indie game winner (2020)",
    "Best mobile game winner (2020)",
    "Best community support winner (2020)",
    "Best VR/AR game winner (2020)",
    "Innovation in accessibility winner (2020)",
    "Best action game winner (2020)",
    "Best action/adventure game winner (2020)",
    "Best RPG winner (2020)",
    "Best fighting game winner (2020)",
    "Best family game winner (2020)",
    "Best SIM/Strategy game winner (2020)",
    "Best sports/racing game winner (2020)",
    "Best multiplayer game winner (2020)"
  ],
  "headers": {
    "8": "Watch last year's The Game Awards",
    "22": "Game of the Year 2021",
    "24": "Best Game Direction",
    "26": "Best Narrative",
    "27": "Best Art Direction",
    "28": "Best Score and Music",
    "30": "Best Audio Design",
    "32": "Games for Impact",
    "33": "Best Ongoing Game",
    "34": "Best Indie Game",
    "35": "Best VR / AR Game",
    "37": "Best Family Game",
    "38": "Most Anticipated Game",
    "41": "Game of the Year 2020 winner"
  },
  "links": {
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Breath of the Wild": "https://www.techradar.com/news/the-legend-of-zelda-breath-of-the-wild-review",
    "The Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Elden Ring": "https://www.techradar.com/news/elden-ring",
    "new Mass Effect game": "https://www.techradar.com/news/bioware-confirms-theres-a-new-mass-effect-game-in-development",
    "how to watch The Game Awards 2021": "https://www.techradar.com/news/the-game-awards-2021-the-biggest-announcements-and-reveals",
    "\"four or five things\"": "https://www.techradar.com/news/the-game-awards-has-four-or-five-things-as-big-as-the-elden-ring-reveal",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "confirmed": "https://twitter.com/geoffkeighley/status/1467007741214347264?s=20",
    "update on The Suicide Squad: Kill The Justice League": "https://www.techradar.com/news/suicide-squad-game",
    "Matrix Resurrections": "https://www.techradar.com/news/new-matrix-resurrections-trailer-revives-the-past-to-deliver-a-new-puzzling-future",
    "teased": "https://twitter.com/AarynFlynn/status/1467908880667578370",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Overwatch 2": "https://www.techradar.com/news/overwatch-2-release-date-features-and-rumors",
    "Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "new Splinter Cell game": "https://www.techradar.com/news/a-new-splinter-cell-is-finally-in-the-works-according-to-a-new-report",
    "BioShock 4": "https://www.techradar.com/news/bioshock-4-everything-we-know-about-the-new-bioshock",
    "Forza Motorsport": "https://www.techradar.com/news/forza-motorsport-everything-you-need-to-know",
    "Fable": "https://www.techradar.com/news/fable-4-on-xbox-series-x-trailer-release-date-game-pass-and-what-we-know",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Hogwarts Legacy": "https://www.techradar.com/news/harry-potter-rpg-everything-we-know",
    "The Last of Us TV show": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show",
    "Uncharted TV series": "https://www.techradar.com/news/uncharted-movie-trailer",
    "world premiere trailer for Sonic the Hedgehog 2": "https://twitter.com/thegameawards/status/1468588799932329984",
    "Keighley": "https://twitter.com/geoffkeighley/status/1468582690618175493?s=20",
    "eSports": "https://www.thegameawards.com/nominees/best-esports-game",
    "Content Creator of the Year": "https://www.thegameawards.com/nominees/content-creator-of-the-year",
    "Game Awards' official site": "https://www.thegameawards.com/",
    "Game Awards website": "https://www.thegameawards.com/",
    "I Expect You To Die 2": "https://www.techradar.com/reviews/i-expect-you-to-die-2-review",
    "Lone Echo 2": "https://www.techradar.com/reviews/lone-echo-2-review",
    "Resident Evil 4": "https://www.techradar.com/reviews/resident-evil-4-vr-review",
    "God of War Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2"
  }
}