{
  "source": "https://www.techradar.com/news/madden-22-focuses-on-franchise-mode-and-the-impact-of-fans",
  "title": "Madden 22 focuses on franchise mode and the impact of fans",
  "category": "gaming",
  "updated": "2021-06-17T16:40:52Z",
  "author": "adam-vjestica",
  "summary": "The 12th man is in full effect in Madden 22",
  "article": [
    "It’s always difficult for annualized sports games to deliver something truly new to fans each year. But when a developer focuses on what players actually want, rather than what it thinks they need, it can often result in a positive outcome. Thankfully, it looks like Madden 22 is doing exactly that.",
    "Although this year’s big new innovation comes in the form of ‘momentum’, which we’ll talk about in more detail below, EA’s latest entry in its gridiron games might deliver the franchise mode that Madden fans have been crying out for.",
    "For the first time, you’ll be able to build, grow and customize four staff positions: Head Coach, Offensive Coordinator, Defensive Coordinator and Player Personnel. You’ll also be able to implement comprehensive weekly strategies, and EA has promised that Franchise mode will see improvements post-launch via live service updates.",
    "But why is EA doubling down on Franchise mode in particular? Well, EA shared the surprising stat that 80% of Madden games take place against AI opponents. The aim, then, has been to ensure that Franchise mode gets the attention it deserves, and that each game in Madden 22 feels fresh when playing against the computer. Madden 22 also hopes to capture the dynamic nature of American football, and everything that entails.",
    "To achieve this, EA has created a new system it’s calling ‘Dynamic Gameday’, which will impact every aspect of gameplay throughout Madden 22. Dynamic Gameday is made up of three elements: gameday atmosphere, momentum and star-driven AI, which promise to create unique stories and possibilities during each and every match. The catch is, though, it’ll only be available on the PS5, Xbox Series X and Xbox Series S versions of the game.",
    "The first component of Madden 22’s Dynamic Gameday is the gameday atmosphere. EA has upped the presentation elements for this year’s entry, with new environments and spontaneous moments that can change the course of a game based on the unique atmosphere of each NFL stadium. Each team’s players and touchline staff will also respond more realistically to what’s happening during a game.",
    "Gameday momentum is an entirely new mechanic that tries to capture the swings that occur in each game, along with adding home field advantage that makes away days so difficult for traveling teams. You’ll have to battle against a number of perks known as ‘M-Factors’ which can make situations such as passing, kicking and running with the ball far more difficult. Each NFL team’s stadium will have a unique M-Factor, such as having to account for higher wind speed when playing at Soldier Field in Chicago, which will make kicking a successful field goal more challenging.",
    "The final component of Dynamic Gameday is Next Gen Stats Star-driven AI. That might sound like another buzzword, and in many ways it is, but EA said it should make the NFL superstars and unique personalities of each team appear more true-to-life, and will lead to you having to make more strategic choices depending on who you’re playing against. You may have been able to employ the same tried and tested plays in the past, but the opposition in Madden 22 should now pose a unique challenge, and will evolve over the course of a season depending on how their real world counterparts’ strategies change.",
    "It all sounds very promising, then, if you’re playing the PS5 and Xbox Series X/S versions, but it’s disappointing that EA has decided to lock the game’s main new mechanics to the next-gen versions only. Still, if Madden 22 can deliver on its goal of delivering the most authentic experience to date, and really capture the thrills and spills of a NFL game, the sacrifice might be worth it.",
    "Madden 22 will be released on August 20 for PS4, PS5, Xbox Series X, Xbox Series S, Xbox One, PC and Google Stadia."
  ],
  "headers": {
    "4": "The crowd goes wild",
    "8": "Next-gen only"
  },
  "links": {
    "Madden 22": "https://www.techradar.com/reviews/madden-nfl-22-review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia"
  }
}