{
  "source": "https://www.techradar.com/news/iphone-13-leak-says-video-upgrades-are-coming-and-its-just-what-we-need-in-2021",
  "title": "iPhone 13 leak says video upgrades are coming, and it's just what we need in 2021",
  "category": "phones",
  "updated": "2021-08-10T13:19:52Z",
  "author": "james-peckham",
  "summary": "A big improvement for video recording",
  "article": [
    "A new report says the upcoming iPhone 13 series will feature a whole host of new video recording features, and it suggests some of the biggest upgrades are set to be software improvements for filming from the handsets",
    "According to Mark Gurman at Bloomberg, a trusted source for Apple related leaks, the iPhone 13 series will feature a Portrait mode for videos as well as a new higher quality format called ProRes.",
    "Alongside other rumored improvements including an A15 chipset and high refresh rate screens, this new report suggests the video recording will be a big focus of Apple's push for the new handsets.",
    "Apple has paid particular attention to improving photography on its smartphones over the last five years – and perhaps even longer – but video recording has never been the main focus.",
    "The iPhone 12 series featured some fantastic quality cameras, and we're expecting similar quality on the upcoming iPhone 13 series with perhaps a couple of tweaks to improve them further.",
    "Focusing on video software improvements in 2021 makes sense. Throughout the Covid-19 pandemic, video recording has become even more important as we've sat on video calls and filmed footage of our lives to send to our loved ones.",
    "This new rumor suggests that Portrait mode – that's where your phone has a blurry effect behind your subject – will be available on FaceTime through these new handsets.",
    "These improvements may not be inspired by the pandemic, but they're useful features for those who have adopted video calling as a way to communicate over the last year and a half.",
    "The new ProRes video feature mentioned in the report is likely designed for those with more experience of filming video, but this story suggests it'll mimic similar features to ProRaw which debuted on the iPhone 12 series in 2020. It's expected to just be available on the iPhone 13 Pro and iPhone 13 Pro Max.",
    "It will mean you're able to record video in a higher quality, and that will open up more editing options after you've filmed your footage. This is unlikely to be a feature that most users use every day, but it's an additional option for those who want more tools to play around with.",
    "Finally, Gurman's leak also suggests there will be new photo filters on the iPhone 13 series.",
    "Bloomberg's report says, \"Users will be able to choose from several styles to apply to their photos, including one for showing colors at either a warmer or cooler temperature while keeping whites neutral.",
    "\"Another option will add a more dramatic look with deeper shadows and more contrast, and the company is planning a more balanced style for showing shadows and true-to-life colors with a brighter appearance.\"",
    "Gurman's history of reporting Apple leaks has been largely accurate, so it's likely we'll be seeing these new features debut on Apple's new handsets when they land later in 2021.",
    "We're unclear when the new iPhone will land, but September 14 is our best bet for the announcement date, as that's when we tend to see iPhones debut."
  ],
  "headers": {
    "10": "What else have we learned?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-08-10/apple-readies-new-iphones-with-pro-focused-camera-video-updates",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "ProRaw": "https://www.techradar.com/news/what-is-apple-proraw-the-new-photo-format-coming-to-iphone-12-pro-explained"
  }
}