{
  "source": "https://www.techradar.com/news/what-is-daas-everything-you-need-to-know-about-desktop-as-a-service",
  "title": "What is DaaS? Everything you need to know about Desktop as a Service",
  "category": "computing",
  "updated": "2021-03-09T16:52:46Z",
  "author": "anas-sabbar",
  "summary": "All your questions about DaaS, answered",
  "article": [
    "Simply put, Desktop as a Service (DaaS) is a cloud service, just like IaaS, PaaS, and SaaS, through which a service provider allows the user to access a virtual desktop from anywhere via the internet. A particularly advantageous solution for small and medium-sized businesses.",
    "This service allows the user to take advantage of a Virtual Desktop Infrastructure (VDI) hosted by a cloud service provider. In contrast with SaaS, DaaS is a model in which users don't pay for software, rather they pay for a \"desktop\" or the computing resources that the desktop occupies. The desktop itself is a consumption good.",
    "VDIs are based on virtualization infrastructures such as Hyper-V, KVM, Xen, or OpenVZ. These solutions enable desktop virtualization in the same way that a VPS (Virtual Private Server) virtualizes computing resources such as CPU, RAM, or disk space. In other words, a VDI protocol transforms a desktop interface into a virtual resource accessible to the user via an Internet connection.",
    "Typically, a user might pay a monthly fee to gain the right to use all of the software that is currently available on their DaaS's desktop image or supplement it with their own. Users can run any program that they want, but the cost of running programs will be limited by the amount of computing resources that the desktop consumes. To increase the power of their desktop, the clients spend money on \"permissions\". Permissions allow a user to run more programs, use more computing resources, or do other things.",
    "The users can also share their desktop with other people who also use the DaaS. When a user shares their desktop, users of the shared desktop also have access to the resources that the user has access to. Desktop as a Service eliminates software deployment, common problems with desktop systems such as driver conflicts and slow device detection, as well as security risks due to malware or viruses.",
    "While a Remote Desktop is a traditional desktop that links a physical computer to another through screen-casting; Desktop as a Service is an entire desktop system that is accessible through the internet. Thanks to a cloud computing platform, all aspects of the system are highly secured and redundant. This provides the end-users with a safe and reliable computing experience.",
    "Desktop as a Service should not be confused with Data as a Service, and Device as a Service.",
    "Data as a Service involves monthly invoicing of the client for use of data repository spaces (servers in a data center). Data as a Service entails information processing: a refined sorting of data provided by the supplier, which values this contribution and prices it.",
    "Device as a Service is a different technique using the same acronym. This time, it is a question of computer manufacturers renting their physical devices to companies. For example, HP's DaaS service consists of coordinating the rental and reallocation of their computer fleet.",
    "A highly secure and reliable solution",
    "The main benefit of this technology is that it allows the user to utilize a VDI (Virtual Desktop Infrastructure) through the internet, using any device (smartphone, tablet, laptop) from any location on the planet. For businesses, DaaS allows a workforce to be more mobile, using their desktops from a virtual interface. In most cases, the connection protocols are designed, developed, maintained, and updated by the vendor. However, vendors sometimes leave it up to companies to develop and manage their own VPNs.",
    "Data backup and recovery",
    "Another major advantage of DaaS is the way in which data is backed up, secured, and can be retrieved in the event of a problem. As explained above, the DaaS backend is managed by a data center provider, while the front end is managed by the customer. Therefore, all customer data installed on the system is backed up, secured, maintained, and can be restored by the provider. Thus, the user does not need to waste time performing backups of his data, applications, programs, and security protocols.",
    "A frugal solution",
    "The third major advantage of DaaS is that it allows companies to maintain their working capacity without having to pay for a costly in-house VDI solution. This benefit can be likened to that of a vendor-hosted cloud server. An in-house dedicated server requires the company to invest in a server, maintain it, install it, patch it, and replace it in the event of a problem.",
    "This will cost much more than a server hosted by a service provider. By using a provider, a company will only pay for the server's resources and a minimal price associated with the datacenter cost related to that server. Just like a Cloud server hosted by a third party, Desktop as a Service is, therefore, an excellent alternative for small and medium-sized companies that want to offer their employees the benefits of a VDI but do not have the financial means to invest in internal infrastructure.",
    "This service reduces both investment and operational costs. Companies pay only for the virtual office and do not have to invest in hardware, maintenance, or individual operating systems for each employee.",
    "Power, productivity and flexibility",
    "DaaS allows your employees to become more agile through the use of virtual desktops. The OS and applications of their choice will be at their disposal at all times and from anywhere- allowing you to modernize your workplace and accommodate your employee’s more specific needs easily.",
    "Some specialty applications can be quite power-hungry, especially in fields like design, engineering, game development. DaaS solutions truly even the playing ground for small and medium businesses through access to powerful infrastructure, with a longer lifetime value for the devices the virtual desktops are used on.",
    "In recent years, over 85% of businesses count on employees to use personal devices for at least one application – which has led to a spread of the Bring Your Own Device policy (BYOD). This is beneficial for both the company as well as providing efficiency and flexibility for the employee. At the end of the day, a lean and agile workplace is a super-productive workplace, and DaaS solutions can make that a reality."
  ],
  "headers": {
    "6": "Not to be confused with Data as a Service and Device as a Service",
    "9": "The benefits of Desktop as a Service"
  },
  "links": {
    "IaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "PaaS": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "virtual desktop": "https://www.techradar.com/best/virtual-desktop-services",
    "Remote Desktop": "https://www.techradar.com/news/best-remote-desktop-software",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "tablet": "https://www.techradar.com/news/best-business-tablets",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "VPNs": "https://www.techradar.com/vpn/best-vpn"
  }
}