{
  "source": "https://www.techradar.com/news/box-shield-will-soon-be-even-better-at-fighting-ransomware",
  "title": "Box Shield will soon be even better at fighting ransomware",
  "category": "computing",
  "updated": "2021-10-06T20:30:00Z",
  "author": "anthony-spadafora",
  "summary": "Malware deep scanning is coming to Box Shield later this year",
  "article": [
    "The cloud storage provider Box has announced that it has added new capabilities to its security control and intelligent threat detection solution Box Shield to better protect businesses from ransomware.",
    "With this latest update, Box Shield can now reduce the risk of ransomware by scanning files in near real-time as they are uploaded to Box. These new capabilities in Box Shield leverage deep learning technology along with external threat intelligence to analyze files and stop sophisticated malware before it's able to cause business disruption.",
    "Chief product officer at Box, Diego Dugatkin provided further insight on the company's approach to security and Box Shield's new capabilities in a press release, saying:",
    "“The number of ransomware attacks surged by 288 percent in the first half of 2021 and this will only increase as more businesses go digital. Our approach to security is to provide customers with one secure platform to manage and secure their content, and Box Shield brings together user-friendly security controls and intelligent threat detection natively into the Box Content Cloud. By leveraging the latest deep learning technology, we are adding an extra layer of threat detection to Box Shield, making it even easier for IT and security teams to identify malware in near real-time without slowing down work.”",
    "While other malware detection solutions can disrupt work by quarantining potentially malicious content which needs to be manually reviewed, Box Shield eliminates these obstacles by embedding malware detection into the company's Box Content Cloud.",
    "At its BoxWorks 2021 virtual event, Box has extended the detection capabilities of Box Shield by adding deep learning technology that complements traditional hash-based or file-fingerprint scanning approaches that utilize known malware datasets. As a result, the company's customers can benefit from an additional layer of security that looks inside of individual files to identify malware and then automatically clears the files or blocks the malware's spread in near real-time.",
    "Box Shield already scans over 48bn files a year but with these new capabilities, users will benefit from higher malware detection rates with fewer false positives.",
    "Box also announced enhanced machine learning-powered alerts for anomalous user behavior such as suspicious downloads in Box Shield. Admins will now receive more detailed alerts with context explaining why the company's machine learning algorithm has deemed certain behaviors risky.",
    "Both malware deep scanning and enhanced alerts will be available for Box Shield customers later this year."
  ],
  "headers": {
    "4": "Using deep learning for malware detection"
  },
  "links": {
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Box": "https://www.techradar.com/reviews/box",
    "ransomware": "https://www.techradar.com/best/best-ransomware-protection",
    "Box Shield": "https://www.techradar.com/news/box-boosts-malware-detection-to-help-remote-workers",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "press release": "https://www.businesswire.com/news/home/20211006005315/en/Box-Announces-New-Malware-Deep-Scan-Capability-in-Box-Shield-To-Combat-Ransomware",
    "malware detection": "https://www.techradar.com/news/us-government-is-working-on-mysterious-malware-detection-project",
    "Box Content Cloud": "https://www.techradar.com/news/box-wants-to-help-keep-your-data-safe-in-the-cloud",
    "virtual event": "https://www.techradar.com/best/best-virtual-event-platforms",
    "deep learning": "https://www.techradar.com/news/what-is-deep-learning",
    "machine learning": "https://www.techradar.com/news/what-is-machine-learning"
  }
}