{
  "source": "https://www.techradar.com/news/iphone-13-range-likely-to-land-in-september",
  "title": "iPhone 13 leak just hinted at its launch date",
  "category": "phones",
  "updated": "2021-03-23T10:25:27Z",
  "author": "james-rogerson",
  "summary": "Apple's phones are apparently on track",
  "article": [
    "In news that isn’t particularly surprising, the iPhone 13 range will reportedly land in September – which is the normal month for Apple smartphones, but one the company didn’t hit for the iPhone 12, due to Covid-related delays.",
    "According to supply chain analysis from Daniel Ives at Wedbush Securities, seen by 9to5Mac, Apple will release the iPhone 13 range in the third week of September. That said, there’s apparently the possibility that “product model tweaks” could mean that at least some of the models don’t get released until October.",
    "In any case, from the wording it sounds like this is when the phones would hit stores, meaning you can expect them to be announced earlier. And based on past form, even if the release of some models slips into October, we’d expect they’ll all be announced in September.",
    "For reference, the iPhone 11 was announced on September 10 of its release year and went on sale on September 20, so we might well see similar dates for the iPhone 13.",
    "This far from launch, we would take these claims with a pinch of salt, especially as there aren’t any other iPhone 13 release date rumors yet, but we were guessing the launch would be in September anyway, so this seems likely.",
    "Beyond the release date, this Wedbush Securities report also predicts that Apple will build 25% more units of the iPhone 13 than the iPhone 12, amounting to around 100 million. So it sounds like there should be healthy demand for Apple’s next handset, with growing interest in 5G apparently playing a role."
  ],
  "headers": {
    "3": "On schedule and in demand"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "9to5Mac": "https://9to5mac.com/2021/03/22/iphone-13-september-launch-report/",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review"
  }
}