{
  "source": "https://www.techradar.com/news/ps5-six-months-on-and-gaming-memories-noise-cancelling-podcast-episode-64",
  "title": "PS5 six months on, and gaming memories: Noise Cancelling podcast episode 64",
  "category": "phones",
  "updated": "2021-05-14T15:13:58Z",
  "author": "adam-vjestica",
  "summary": "Episode 64 of our tech podcast is out now",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "The show is presented by Gareth Beavis, Editor in Chief of TechRadar, and Sherri L. Smith, Editor in Chief of Laptop Mag.",
    "This week our guests are Adam Vjestica, Senior Gaming Writer at TechRadar, and Sam Loveridge, Global Editor in Chief of GamesRadar+, who join us (remotely, of course) to talk about the last seven days in tech.",
    "In this week's episode, we're talking about games, games and more games. Specifically, video games! The podcast begins with our usual Big Question: if you could make your own crypto currency, what would it be called and why?",
    "We also chat about our very first video game consoles, whether the PS5 is worth it six months later, and induct a new gadget into our Hall of Fame. With E3 coming up, we also touch on our favorite gaming events, along with the worst moments we experienced, and ask \"where is the Nintendo Switch Pro?\"",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple Podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 64:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/uk",
    "Tom's Guide": "https://www.tomsguide.com/uk",
    "GamesRadar+": "https://www.gamesradar.com/uk/",
    "crypto currency": "https://www.techradar.com/best/mining-rigs",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "E3": "https://www.techradar.com/news/e3-2021",
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple Podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-7339342967934796000&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}