{
  "source": "https://www.techradar.com/news/google-is-making-it-much-easier-to-resurrect-closed-tabs-in-chrome",
  "title": "Google is making it much easier to resurrect closed tabs in Chrome",
  "category": "computing",
  "updated": "2021-04-15T09:58:54Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Bring your tabs back, regardless of when you closed them",
  "article": [
    "Chrome will soon allow you to restore accidentally closed tabs more easily, and find exactly the one you want no matter how long ago you closed it.",
    "It's something we've all done – closed a browser tab with an erroneous mouse click or the wrong keyboard shortcut.",
    "To help make things a little easier – particularly for those with a poor memory for keyboard shortcuts – Google is introducing a new method of reopening closed tabs in Chrome. It's part of the recently added tab search feature, and it makes life a whole lot easier.",
    "The new tab restoration method is not only a nice additional method of getting tabs back, it's more versatile than using a keyboard shortcut. Accessible via the tab search pop-up menu, it will show a list of recently closed tabs, which you can also search to find the one you need.",
    "The problem with the keyboard shortcut method is that it works like the Undo feature of many apps, reopening tabs in reverse chronological order. Using the tab search menu lets you pick any recently closed tab and open it with a quick click, regardless of when it was closed.",
    "You can test out the new feature in the latest Canary build of Chrome. This version of the browser may be unstable, but can be safely installed in addition to the main release version without problems.",
    "The new tab options can be accessed without the need to enable any hidden settings. While the new tab restoration method is undeniably useful, it's still handy to try to remember the keyboard shortcut; if you're using Windows ,it's Ctrl + Shift and T, while in macOS it's Command + Shift + T.",
    "Via Android Police"
  ],
  "headers": {
    "5": "Back to life"
  },
  "links": {
    "the latest Canary build of Chrome": "https://www.google.com/chrome/canary/",
    "Android Police": "https://www.androidpolice.com/2021/04/14/google-chrome-is-testing-a-handy-new-way-of-restoring-accidentally-closed-tabs/"
  }
}