{
  "source": "https://www.techradar.com/news/microsoft-is-actively-looking-for-a-fix-for-unresponsive-xbox-series-x-controllers",
  "title": "Microsoft is 'actively' looking for a fix for unresponsive Xbox Series X controllers",
  "category": "gaming",
  "updated": "2021-03-08T14:16:07Z",
  "author": "adam-vjestica",
  "summary": "Some Xbox Wireless Controllers are having issues",
  "article": [
    "Microsoft is investigating reports that some Xbox Wireless Controllers are failing to register button taps when playing on Xbox Series X, Xbox Series S and PC.",
    "The issue appears to only affect the new Xbox controllers that feature a dedicated share button, a more ergonomic design and a new D-pad,",
    "YouTube user TrueGamingHD uploaded a video of the unresponsive controller in action (thanks, PC Gamer), and you can see that while the controller remains connected, the console doesn't register a number of inputs.",
    "Speaking to The Loadout, Microsoft said that it was aware of the problem, and is actively working on a solution.",
    "\"At Microsoft, we put all of our products through rigorous quality assurance testing and are committed to providing customers with an unparalleled gaming experience,\" Microsoft said. \"We are aware some players may be experiencing unresponsiveness with their new Xbox Wireless Controllers and our teams are actively working on a solution. For the best experience, we encourage customers to visit Xbox Support for assistance.\"",
    "The issue is an odd one, as it appears to be a problem with the controller’s wireless communication rather than a clear hardware issue. While the Xbox isn’t immune to interference, it'll be interesting to see whether an update to the controller will help solve this undeniably frustrating issue.",
    "Microsoft's controller, along with Sony's DualSense controller and Nintendo's Joy-Con controllers, have come under fire due their susceptibility to 'stick drift'. All three companies have had class action lawsuits filed against them over drifting issues, and a recent teardown of the DualSense showed that stick drift might be inevitable."
  ],
  "headers": {
    "5": "Drifting by"
  },
  "links": {
    "Xbox Wireless Controllers": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "PC Gamer": "https://www.pcgamer.com/microsoft-xbox-controller-unresponsive-issue-fix/",
    "The Loadout": "https://www.theloadout.com/xbox/unresponsive-controllers-solution",
    "DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "stick drift": "https://www.techradar.com/news/an-angry-gamer-is-suing-microsoft-over-xbox-one-controller-stick-drift-issue",
    "class action lawsuits filed against them over drifting issues": "https://www.techradar.com/news/nintendo-is-being-sued-over-joy-con-drift-again",
    "stick drift might be inevitable": "https://www.techradar.com/news/ps5-stick-drift-might-be-inevitable-according-to-this-comprehensive-teardown"
  }
}