{
  "source": "https://www.techradar.com/news/this-trivial-smartwatch-feature-helped-me-improve-my-running",
  "title": "This trivial smartwatch feature helped me improve my running",
  "category": "phones",
  "updated": "2021-04-18T07:00:52Z",
  "author": "tom-bedford",
  "summary": "Positive comments",
  "article": [
    "I just hit my personal best for my standard running route, knocking about two-and-a-half minutes off the typical 45-minute, 8km workout. I was pretty pleased about this, since I’d struggled to consistently beat the course in under 45 minutes.",
    "‘Outdoor running, 4/12/2021, 12:36, 8.05km’ said my smartwatch. I wasn’t exactly expecting it to throw a party, invite celebrity guests, bust out the champagne – but this seemed an awfully utilitarian response. Oh well, it’s only a smartwatch; keep calm and carry on.",
    "But I’ve long-wondered whether the way in which a smartwatch logs our workout can affect our future workouts?",
    "I’m currently taking part in a challenge to run the distance of America’s Route 66 in two years – find out all about the journey here – and in my columns, I’m exploring the way technology (and other things) can help or hinder the experience.",
    "I’ve actually been wanting to write about the language of wearables for a while now, and it’s as a result of my penchant for Honor wearables. You see, devices from the company often shower you with praise on completing a task.",
    "‘Longest run’, ‘Fastest 5k time’, ‘Fewest times tripped over pavement and fell on face’. When you finish a run with an Honor smartwatch, you’ll see various medals, awards and accolades pop up. These are often quite particular, which makes it feel like it would be impossible not to get at least one achievement (although the pavement one is a joke).",
    "At first I found it a little condescending, but that quickly changed. When I started using other wearables, as I invariably do for my job (testing such items means you have to keep picking up and trying new ones, and shelving old ones), I missed these silly little medals.",
    "But why? For that, we’ve got to look to positive reinforcement.",
    "I first learned about reinforcement years ago, when studying child language acquisition (don’t ask).",
    "To cut many, many lessons short (you’d thank me if you’d sat in them yourself), reinforcement is the process by which reactions to our behavior can influence future behavior. Positive reinforcement is when the knowledge of a potential reward encourages us to do something, negative reinforcement is when the removal of something negative encourages our behaviour instead.",
    "For example, positive reinforcement could take the form of you baking your tech writer a cake when they’ve written a good article – it will encourage them to write many more great articles. Negative reinforcement is when you’re an awful baker and you bake your tech writer a cake when they’ve written a poor article – the writer will be encouraged to write better to avoid your crummy concoctions.",
    "While a ping of ‘congratulations’ on a smartwatch doesn’t quite match the delivery on your desk of a scrumptious cheesecake (note to Ed: preferably strawberry or caramel; definitely not lemon), it’s nevertheless a reward that hits hard in that post-run endorphin rush, making you feel good about your workout.",
    "Receiving a nice word or remark can make your day, whether it’s from a person or your smartwatch (obviously, the former is better). And the more I’ve received congratulations and virtual pats on the back from my smartwatches, I found myself running faster and further.",
    "In part this was so I could continue receiving those medals and achievements, but also simply because I felt better about running. The positive reinforcement through a message on-screen was great, but its effects lasted far longer, because it improved my attitude to my workouts.",
    "But now, accompanied by another smartwatch, I’ll run until my legs are burning, just for an ‘Outdoor running, 4/12/2021, 12:36, 8.05km’. Even pet cats are capable of showing more support than that.",
    "Clearly, a super-positive smartwatch isn’t necessary for hitting personal bests – after all, I reached my new time without one – but it’s always nice to have your achievements recognized, however slight they are.",
    "Perhaps being dependent on a smartwatch to make you feel positive isn’t such a good thing, though. The best thing would be to feel good regardless of how you run – and to just bake your own cheesecakes.",
    "But when you’re running the distance of Route 66, you can’t rely on such wholesome sentiments; I need to find extreme measures to hit my weekly goal… such as making ice-cream with leftover tech. These columns come out fortnightly, and I’ve still have more than 2,000 miles left to run, so you can expect more like this soon."
  ],
  "headers": {
    "4": "Save a kind word",
    "8": "What is positive reinforcement?",
    "12": "If you haven't got something nice to say..."
  },
  "links": {
    "find out all about the journey here": "https://www.techradar.com/news/im-running-across-the-entirety-of-america-and-i-cant-do-it-without-technology",
    "making ice-cream with leftover tech": "https://www.techradar.com/news/can-this-gaming-phones-cooler-help-make-ice-cream-i-tried-it-for-science"
  }
}