{
  "source": "https://www.techradar.com/news/mac-users-may-have-to-wait-to-get-one-of-the-iphones-best-features",
  "title": "Mac users may have to wait to get one of the iPhone’s best features",
  "category": "computing",
  "updated": "2021-07-26T12:03:38Z",
  "author": "darren-allan",
  "summary": "Face ID might not be here until 2023",
  "article": [
    "Apple may not bring Face ID technology (that allows for unlocking a device just by looking at the screen) to Macs for some time yet, according to a fresh rumor.",
    "This comes from well-known Apple leaker Mark Gurman, who earlier in the year (in February) said Apple was previously planning to bring Face ID to the Mac in 2021, but those plans had been delayed (after references to Face ID were spotted in macOS as early as the summer of 2020). Now Gurman is talking about a delay in the order of a ‘couple’ of years, so if Face ID is introduced to Apple computers, it might not happen until 2023.",
    "As MacRumors reports, Gurman wrote in his newsletter: “It won’t happen this year, but I’d bet Face ID on the Mac is coming within a couple of years. I expect all iPhones and iPads to transition to Face ID within that timeframe, too.”",
    "Obviously, that’s just how Gurman believes things are set to pan out, and as with any speculation it should be regarded with some caution. The long and short of it is, though, that it appears Face ID won’t be coming to Macs any time soon.",
    "However, the Bloomberg journalist believes that eventually all Apple’s products will transition to Face ID tech, including more affordable pieces of hardware that use Touch ID (such as the iPhone SE).",
    "A number of Mac fans are keen to get Face ID on board so they can just glance at their screen to login, as a more convenient way to work rather than using the Touch ID fingerprint sensor.",
    "As the MacRumors article points out, Gurman claims Apple was going to incorporate Face ID tech in the redesigned 24-inch iMac that emerged recently, but the inclusion of facial recognition was put back to a future iMac refresh (not the next model, presumably, which could emerge in 2022 going by the latest from the rumor mill). This is because it’s more difficult to include Face ID with Macs as the screens are thinner than with phones or tablets, making it more of an issue to fit in the needed depth sensors.",
    "Apple engineers will overcome these space-related issues, no doubt, and as Gurman indicates Face ID should get here eventually on Macs. Even if it’s not as soon as future Mac buyers might like, particularly when you consider that Windows Hello facial recognition has been around for a long time with Microsoft-powered laptops.",
    "That said, Apple’s control over both hardware and software should help ensure that Mac implementations don’t suffer from the same kind of potential exploits we’ve seen aimed at Windows Hello (via third-party pluggable USB cameras)."
  ],
  "headers": {
    "5": "Analysis: Better late than never"
  },
  "links": {
    "Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "after references to Face ID were spotted in macOS": "https://www.techradar.com/news/apple-macs-could-get-face-id-going-by-clues-in-macos-big-sur",
    "MacRumors": "https://www.macrumors.com/2021/07/25/face-id-for-mac-couple-of-years/",
    "iPhone SE": "https://www.techradar.com/news/iphone-se-3-could-be-as-powerful-as-the-iphone-13-but-it-might-look-dated",
    "redesigned 24-inch iMac": "https://www.techradar.com/reviews/imac-24-inch-2021",
    "potential exploits we’ve seen aimed at Windows Hello": "https://www.techradar.com/news/microsoft-fixes-serious-windows-hello-security-flaw"
  }
}