{
  "source": "https://www.techradar.com/news/hp-unveils-new-range-optimized-for-remote-working-at-ces-2021",
  "title": "HP unveils new laptops and more optimized for remote working",
  "category": "computing",
  "updated": "2021-01-25T16:57:44Z",
  "author": "jess-weatherbed",
  "summary": "Freedom to work anywhere with these new products",
  "article": [
    "With the global pandemic causing many people to shift to remote working, HP has introduced some new product ranges, announced at the CES 2021 trade show, that are designed to help make working from anywhere easier and more enjoyable. One of the most exciting announcements is two additions to its professional laptop family: the HP Elite Dragonfly G2 and the HP Elite Dragonfly Max. We were so impressed when we reviewed the original HP Elite Dragonfly back in January 2020 that we dubbed it \"a dream come true for the traveling professional\", awarding it a full 5/5 stars score and the Editor's Choice recommendation.",
    "It's pretty hard to make business laptops exciting, but the Dragonfly had us enthusing about everything from its high-powered specs to its gorgeous aesthetics – and the next generation models of this crowd-pleaser look to be following in its predecessor's footsteps, with plenty of exciting features to look forward to. The HP Elite Dragonfly G2 is claimed to be the world's lightest compact business convertible laptop, weighing in at under 1kg, making this a perfect workhorse for frequent travelers.",
    "This isn't just about the looks of course, and we should expect a powerful machine under that glamorous shell. The new Dragonfly models will include 11th-generation Intel processors and the latest integrated graphics, as well as super-fast 5G or gigabit-class 4G LTE (Long Term Evolution) connectivity. HP is also making sure this flagship laptop is one of the most sustainable on the market, with 80% of mechanical parts made from recycled materials, and even the finish and accents incorporating waste such as ocean-bound plastics. We won't know for sure if the HP Elite Dragonfly G2 lives up to its impressive legacy or meets our lofty expectations until we get it in for review, which we're certainly looking forward to. The Elite Dragonfly G2 is expected to launch in February, priced from £1,699 in the UK; US and Australia pricing and release info have yet to be confirmed, but that's around $2,300 or AU$3,000). The Max is set to follow in March, priced from £1,899 (around $2580, AU$3,300).",
    "We're seeing a trend for 16:10 aspect ratio displays this year, and the new HP Envy 14 laptop, which HP describes as a 'mobile personal creative studio', is joining that particular party. The multi-touch enabled IPS display has an 11% greater viewing area than traditional 16:9 laptops, which can provide a great boost to productivity when you're limited to only one screen. The new HP Envy 14 will include 11th-gen Intel Core processors and up to Nvidia GeForce GTX 1650 Ti graphics, and will incorporate advanced thermal solutions to prevent all that power from overheating the device. HP is also promising up to 16.5 hours of battery life, which is a huge improvement on the previous HP Envy 13 model if this proves accurate. The Envy 13 managed to last around 10 hours in our benchmarking tests and received a very favorable overall score, so the Envy 14 is built on solid foundations. Keeping with the theme of hybrid working, the new Envy 14 features HP Enhanced Lighting for better illumination during conference calls and meetings in inconsistent environments, a physical shutter for your webcam, and a dedicated microphone mute key. AI Noise Removal is also included, to muffle noisy background environments during video chats.",
    "The HP Envy 14 is expected to be available in February for a starting price of £999.99 in the UK (around $1,350 or AU$1,750 – again pricing and release dates for the US and Australia are tbc).",
    "Alongside new monitors and laptops, HP has also introduced a few products that are themed around a hybrid working model that may require frequent travel. The HP Elite Wireless Earbuds are designed for switching between PC conference calls and mobile devices for music listening, meaning you can have discreet, in-ear audio feedback during meetings without the need to carry a separate headset for Zoom or Microsoft Teams. The noise cancellation is also perfect for anyone working in noisy environments such as trains or cafes. The HP Elite Wireless Earbuds can be bundled with the HP Elite Dragonfly Max or purchased separately, and we're expecting to see these retail for $199 (around £150, AU$260) from April. HP has also announced the HP 635, a small wireless mouse that can be connected via Bluetooth, and the HP Renew laptop backpack and laptop bag, both of which feature plentiful storage and are made from recycled plastic bottles. Both the bags are expected to be available in February, priced at £59.99 ($80, AU$100) and £49.99 ($65, AU$90), respectively."
  ],
  "headers": {
    "3": "Making the competition green with Envy",
    "5": "Move more, stress less"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "HP Elite Dragonfly": "https://www.techradar.com/reviews/hp-elite-dragonfly#:~:text=The%20HP%20Elite%20Dragonfly%20is,go%20wrong%20with%20this%20laptop.",
    "HP Envy 13": "https://www.techradar.com/reviews/hp-envy-13-2020"
  }
}