{
  "source": "https://www.techradar.com/news/how-fans-have-created-the-sonic-games-youve-always-wanted",
  "title": "How fans have created the Sonic games you've always wanted",
  "category": "gaming",
  "updated": "2021-09-04T11:00:00Z",
  "author": "daryl-baxter",
  "summary": "Gotta go fans",
  "article": [
    "Sonic recently celebrated his 30th anniversary, showcasing new games, new merch and a fantastic symphony that played through many classics from throughout the years.",
    "However, another aspect that doesn’t get talked about often is the amazing community that has allowed fans to create Sonic games in their own image - the games that they had hoped SEGA would one day develop.",
    "In recent years, these fan games have become so sophisticated that they easily rival the official games, with remakes of past zones that have new control schemes to make Sonic fresh and exciting.",
    "With this in mind, we’ve got three fan games that we simply had to tell you about, and how they showcase just what a Sonic game can be capable of.",
    "This is a free-roaming take on Green Hill Zone that features many surprises. Released in 2017, it was developed for a fan game contest that’s held every year, and this was created with an aim of seeing just how a 3D Sonic game could work with a different control scheme, and graphics that look as though they’ve been made in the mid-nineties.",
    "Think of a Sonic game that crosses with Breath of the Wild, with a sprawling Green Hill Zone, and you have Sonic Utopia. The control scheme is retro-inspired but works well, with the mouse able to make Sonic jump or perform a super peel out, while the WASD and space keys all control the blue blur with ease. You never feel like you lose sight or control, and everything is in your grasp.",
    "There’s plenty of Easter eggs in this fan game, with a hidden area that houses Labyrinth Zone, a level from Sonic 1 which would guarantee anxiety as the drowning music will constantly play.",
    "The SEGA Master System versions of Sonic games don’t get much love. The most recent appearance of the 8-bit games were in Sonic Adventure DX, released back in 2003 as hidden games once you collected enough emblems throughout the game.",
    "Fortunately, the community came through here, but went one step further. Both Sonic 1 and Sonic 2 have been remade from the ground up, but also with new features that borrows from the 2017 release of Sonic Mania Plus.",
    "You get extra zones, such as Marble Zone - a level from Sonic 1 on the SEGA Genesis, but also has music that was discovered by the community. There’s also other characters to play as, such as Tails, Knuckles, Mighty and Ray.",
    "Super forms are also here once you collect the 7 Chaos Emeralds, and there’s even abilities lifted from other 8-bit Sonic games, such as the Rocket Shoes from Sonic Chaos. Add on a boss rush mode and even more secrets to uncover, you’ve got two remakes here that SEGA should take notice of. They not only give the two Master System games a new lease of life, but also showcase how the new features give the impression that they’ve always been a part of these games for thirty years.",
    "It’s still a work in progress, but you can play the remakes right now on your PC or Android device, in native widescreen.",
    "Think of this as the fan game equivalent of Sonic Generations, but with classic zones from the Master System and Genesis era remade into a modern take.",
    "Released in 2020 as a demo and updated for SAGE 2021 (Sonic Amateur Games Expo), which is a festival celebrating fan games of Sonic and more. You can play Angel Island Zone and Ice Cap Zone from Sonic 3 alongside Oil Ocean Zone and Mystic Cave Zone from Sonic 2, and Aqua Lake Zone from the Master System version of Sonic 2.",
    "Everything has been given a remake in every level, while staying true to the source material - from the badniks to the music, even to the bosses that were originally included.",
    "You can run at high speeds and explore each zone before you face off against the boss. The game controls just like Sonic Forces and Sonic Generations on PC, so make sure you have a controller ready to go for this.",
    "It’s built on the Unity engine, so there aren’t high specifications here, but playing it in ultra settings in 1440p is a sight to behold, especially if you’re using headphones. Everything feels immersive, it’s almost as if it’s DLC to Sonic Generations, it’s that good.",
    "There’s always been an underwritten fact that a community of Sonic fans have had their idea of how a Sonic game should play, and it’s only in the last five years that we’ve seen them match up to the official games.",
    "Remade levels that would have had a minimal chance of appearing, alongside remade 8 bit games that have not been seen since the Gamecube release of Sonic Adventure DX.",
    "It’s the fans that keep part of this memory of Sonic alive - that feeling of running fast, and with no gimmicks. While there’s been plenty, from transformations into a werewolf in Sonic Unleashed, to blatantly copying Super Mario Galaxy with Sonic Lost World in 2014, the fan games go back to the zones that many remember, but in a style that works for the modern era.",
    "With Sonic ready to celebrate the next thirty years, it would be great to see another game in the style of Sonic Mania, one made by fans who know what makes a Sonic game fun. To see this made with Sonic Encore, it could appeal to those fans who felt left out with that release, and even introduce others to remade zones that have only been seen in their original forms for the last thirty years.",
    "But regardless of what SEGA has planned for the blue blur, you can always depend on the passionate fans to impress with games like these, and hopefully we see the company take notice of these incredible efforts soon, just like they did for Sonic Mania."
  ],
  "headers": {
    "4": "Sonic Utopia",
    "7": "Sonic 1 & 2 SMS Remake",
    "12": "Sonic Encore",
    "17": "Analysis: celebrating 30 years in style"
  },
  "links": {
    "symphony": "https://youtu.be/UGTlBHNvjsU?t=1700",
    "Released in 2017": "https://sonicfangameshq.com/forums/showcase/sonic-utopia-early-demo.33/",
    "remade": "https://sonic-sms-remake.blogspot.com/",
    "in 2020 as a demo": "https://sonicfangameshq.com/forums/showcase/sonic-encore.536/",
    "updated for SAGE 2021 (Sonic Amateur Games Expo)": "https://sonicfangameshq.com/forums/showcase/sonic-encore-sage-21-demo.974/",
    "festival": "https://sagexpo.org/"
  }
}