{
  "source": "https://www.techradar.com/news/now-tenet-is-on-hbo-max-and-sky-nolans-movie-deserves-a-second-chance",
  "title": "Tenet is now on HBO Max and Sky – and Nolan's take on Bond deserves a second chance",
  "category": "entertainment",
  "updated": "2021-05-19T14:47:46Z",
  "author": "samuel-roberts",
  "summary": "Opinion: Christopher Nolan's movie didn't get the reception it deserved",
  "article": [
    "The biggest shock at the 2021 Oscars was probably Anthony Hopkins winning Best Actor over the late Chadwick Boseman. Second place, though – at least if you ask me – has to go to the injustice of Tenet missing out on a nomination for Best Original Score.",
    "Ludwig Göransson (the composer of the toe-tapping theme to The Mandalorian you like so much) created an innovative, thrilling soundtrack that even goes backwards at key moments, to reflect the characters' own journeys through time in the film.",
    "Tenet's score is one thing about the Christopher Nolan's Bond-esque sci-fi thriller that I recommend unconditionally. Another is the performances of its two suave leads, John David Washington and Robert Pattinson, who play 'The Protagonist' and Neil respectively. The film is all about this well-dressed pair of agents, part of an organization called Tenet, trying to stop the collapse of time itself at the hands of dangerous Russian crime lord Andrei Sator – played by Kenneth Branagh. They need to achieve this by moving backwards and forwards through time to essentially out-strategize Sator, who has the same capability.",
    "Tenet is otherwise hard to recommend without caveats. It's a knotty, frequently breathtaking sci-fi film that needed a bit of a lighter touch in how it introduced its big ideas. Since this is a movie involving time travel of a sort, you basically need a big chart explaining everything that happened in the plot.",
    "For most people, that's too much hard work to enjoy a film.",
    "I do empathize. Tenet is slightly too confusing – its ideas aren't as elegantly sown as they were in Nolan's similarly high-concept sci-fi movie Inception. But now it's available on HBO Max in the US and Sky in the UK, I'm hoping the conversation around Tenet becomes more about the film itself, and less about the ill-advised effort to release a blockbuster mid-pandemic last year.",
    "You owe it to yourself to experience this film, and below I'll discuss why, while trying to avoid major spoilers.",
    "Tenet is the only true blockbuster that hit the big screen last year. Perhaps fatally, the movie released in the US when theaters in Los Angeles and New York were simply not open – and because not everyone had the chance to see the movie at the same time, we were denied the same shared pop culture moment that makes the release of any blockbuster exciting.",
    "That means we missed out on many of the things that make the release of a big movie a shared experience: silly memes, people quoting memorable lines from the script, or strangers arriving in your Twitter mentions to tell you why your opinion on the film is wrong. I saw it three times last year. I was ready for the discourse.",
    "Take Inception as a comparison point – a line like Tom Hardy's \"You musn't be afraid to dream a little bigger, darling!\" is familiar to anyone who knows that film. Tenet, which made less than half what Inception did at the box office, has simply not attained that level of cultural impact.",
    "There's loads to like about this film. For one, I do like it when blockbusters are challenging enough that you don't necessarily have all the answers on a first watch. That doesn't mean Nolan gets a free pass for how incoherent it is at times – something critics took him to task on – but it does leave a number of fan theories open to interpretation.",
    "Secondly, and this is the part of the film I love the most, it's a great male friendship movie. The Protagonist and Neil basically each get to be James Bond in this story. Tenet is not a wise-cracking buddy comedy, but it has its moments, and the film successfully makes them a winning pair who fast become friends – and then team up to save the universe.",
    "Their dynamic offers something I feel like I haven't seen Nolan do before. While there is arguably a background romance in this film between The Protagonist and Sator's wife, Kat (played by Elizabeth Debicki), it's quietly secondary to the relationship between these two secret agents.",
    "Indeed, the film's emotional impact ultimately rests on how invested you get in this friendship – it's a brilliant creative choice. It reminds me that the reason I remember enjoying The Force Awakens, other than getting to enjoy the return of Star Wars, is that it invested more time in the friendship between Rey and Finn than director JJ Abrams really got credit for.",
    "Essentially, Tenet asks the question of what a James Bond movie would look like as more of a buddy romp – and the answer is, it's more entertaining than the lone wolf stories that typify that series. The wrapping just happens to be this very complicated sci-fi plot that's probably more of a headache to enjoy than it should've been.",
    "In spite of Tenet's theatrical release possessing a lot of baggage, in retrospect, I can see why Nolan wanted it on the big screen. There is real visual ambition to this film – sometimes that means watching cars flip backwards through time down a freeway, and on other occasions it means seeing Kenneth Branagh comedically reverse-walk into a time machine.",
    "It does what a blockbuster should do, with a movie studio's bags of cash: it shows you something you feel like you've never seen before. In fact, it does that over and over again – a convoluted and confusing story is just the price to pay for getting to see that spectacle in motion.",
    "Even on your TV at home, though, Tenet will feel like a lovely surprise if you haven't seen it yet. Nolan and his crew shot the movie in locations like India, Estonia and Norway among others – the globetrotting aspect of the film lends it that extra Bond-esque feeling. It's also a phenomenal-sounding film – albeit one where the dialogue gets obscured somewhat, a familiar issue with Nolan's movies. Göransson's score is so good and fresh-feeling that it's like he's figuring out a new genre of movie soundtrack as he goes. I've been listening to it non-stop for the better part of a year.",
    "Tenet deserves a second chance – and now everyone can watch it at home, I hope it gets one. If you've been frustrated every time you've seen No Time To Die slip down the release schedules, this feels as close to Nolan's take on Bond as we'll likely ever get.",
    "Tenet is available to watch now on HBO Max in the US and Sky in the UK."
  ],
  "headers": {
    "7": "Bond as a buddy movie",
    "15": "You simply need to see it"
  },
  "links": {
    "2021 Oscars": "https://www.techradar.com/news/oscars-2021-winners-the-full-list-from-nomadland-to-mank"
  }
}