{
  "source": "https://www.techradar.com/news/ipad-mini-2021-has-yet-another-screen-issue-apparently",
  "title": "iPad mini (2021) has yet another screen issue, apparently",
  "category": "phones",
  "updated": "2021-10-06T09:01:36Z",
  "author": "tom-bedford",
  "summary": "Jelly problems and now discoloration",
  "article": [
    "Just one week after the iPad mini (2021) had a widely-reported jelly scrolling issue on the display, which affected the way text was shown on-screen when a user was scrolling, yet another problem with the new tablet's panel has been discovered.",
    "As reported by a user on Reddit, Apple's newest small-body slate has a 'Discoloration and Distortion' issue, according to the title of the thread.",
    "The original poster noticed that, if you press harder than a gentle tap on the tablet's display, some dots of discoloration appear across the screen - a couple of commenters in the thread report they've had the same issue.",
    "Apparently, this problem can be found if you hold the tablet in portrait orientation, and push on the screen - there are three dots across the top in separate areas. The poster says it's most noticeable in dark mode, and recommends heading into the Notes app to test it out.",
    "Our iPad mini reviewer didn't notice this issue, so it doesn't seem to be affecting every unit, but the original poster says they found the issue with their tablet, a replacement they were sent, and lots of other models in an Apple Store, so it doesn't seem to be a singular occurrence either.",
    "If enough iPad users have noticed this kind of display issue, it seems it's not just a minor and hard-to-replicate design quirk, but an actual issue with the device. We've reached out to Apple for comment on the issue and will update this article when we hear back.",
    "In the Reddit post, the OP states the Apple store Genius technician \"was very surprised and mentioned that I should keep my eye out for a recall - he said he wouldn’t be surprised if there is one.\"",
    "Of course this is reported speech from a private conversation, and can't be taken as confirmation a recall will happen. But between the jelly scrolling and discoloration issues, it's clear there are a few issues with Apple's iPad mini 6.",
    "Apple doesn't have much of a precedent for wide recalls, but on its website you can find a list of limited recalls for specific problems with its devices. These don't seem frequent, as there were only four in 2020 and there has only been one in 2021 so far. This was for an issue with certain iPhone 12 devices which didn't make sounds when you were on a call.",
    "So it's very possible that, if it deems the problem widespread enough, Apple will add affected iPad minis to its recall list. That doesn't mean you'll have to send your slate back if it's unaffected, and if you don't mind the problems, you don't necessarily need to send it back either.",
    "Either way, if the experiences of the Reddit poster show us anything, it's that you can already get a replacement if you want. But you should probably wait until the discoloration issues have been solved before you do."
  ],
  "headers": {
    "6": "Analysis: will there be a recall?"
  },
  "links": {
    "iPad mini (2021)": "https://www.techradar.com/reviews/ipad-mini-2021",
    "jelly scrolling issue on the display": "https://www.techradar.com/news/ipad-mini-2021-has-a-jelly-scrolling-issue-that-sometimes-blurs-the-screen",
    "Reddit": "https://www.reddit.com/r/apple/comments/q1zpj6/ipad_mini_6_screen_clearance_issue_causing/",
    "on its website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6561548485532863000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-gb%2Fservice-programs",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12"
  }
}