{
  "source": "https://www.techradar.com/news/oppo-wants-to-be-a-genuine-alternative-in-brand-conscious-uk-market",
  "title": "Oppo wants to be a genuine alternative in 'brand-conscious' UK market",
  "category": "phones",
  "updated": "2021-11-13T09:22:05Z",
  "author": "steve-mccaskill",
  "summary": "Oppo MD Kevin Cho explains how it wants to offer design and technology features that others aren't",
  "article": [
    "Oppo may not be as familiar to British consumers as Apple and Samsung, or even Huawei, but its status as the world’s fourth largest smartphone manufacturer demands respect. According to Gartner, the Chinese manufacturer has a global market share of 10.2%, boosted by an astonishing growth rate of 42.4%",
    "Like its compatriots Vivo and Xiaomi, Oppo has traditionally been boosted by strong demand in its homeland and other parts of Asia thanks to affordable, feature packed handsets. Western Europe was the logical next step in the pursuit of growth.",
    "Oppo phones debuted in the UK back in January 2019, hoping to disrupt a market dominated by a handful of players. However, speaking to TechRadar Pro¸ the company’s UK and Ireland Managing Director Kevin Cho strategy is not to compete solely on value – it wants to offer technologies and design features that other vendors aren’t.",
    "“The UK is one of the most brand conscious markets,” he explains. “For most new entrants it’s a question of delivering value or specifications. For us, as a brand, value for money is not the only way [to succeed]. We feel we differentiate as we operate in the intersection between technology and beauty. We don’t see the need to compromise.",
    "“it’s about being a viable alternative in a market that has not been disrupted traditionally by other brands. We’ve made great strides in penetrating the market by bringing different options and new technologies.",
    "“All of our competitors [innovate] but we believe in delivering features that actually matter to people’s lives.”",
    "Cho extols the virtues of Oppo’s recent handsets, citing their unibody and curved design characteristics, and claims technological features like fast charging, low battery life and immersive visual experiences are something that only it can offer.",
    "The launch of 5G is also an opportunity. Although Samsung made sure that it was an option for early adopters, the late arrival of a compatible iPhone and Huawei’s well documented struggles meant there was a gap for another manufacturer. Oppo provided one of the launch devices for EE’s 5G network.",
    "However, Cho does not yet see 5G as a key driver of sales. He sees it as a natural development that will become more important as operators roll out their services and new use cases emerge.",
    "“There has been buzz about 5G [in the industry] for the past two or three years but we’ve now almost started to reach the tipping point where we’re going to have pervasiveness.,” he says, citing the inevitable consequences of the pandemic on 5G deployment and adoption. “For the first time, the handset penetration is ahead of network rollout. As soon as the operators catch up then the use cases will be increasingly relevant.”",
    "Devices are just one part of the equation – marketing and business operations are just as important. Oppo took the learnings and best practices acquired from expansions into when",
    "Cho has headed up Oppo’s UK operations for the past two and a half years, and identified lessons ad strategies through similar expansions into Australia, New Zealand and other parts of Europe that could be replicated and customised for the UK market.",
    "“These are great examples of how we have a strong grasp of consumer behaviour within a market,” he explains. “We came in as a new entrant with little brand awareness and some scepticism so you need to build that credibility and trust.",
    "“We’ve built our credibility through a pragmatic approach that doesn’t just involve great technology but also a willingness to compromise.",
    "“Oppo UK has the vision to be the easiest company to partner with, whether it’s the way we deliver, supply, finance or how we go to market. Every six months when we formulate our marketing plan we put [that philosophy] at the centre and bring our partners into that process to create that affiliation as partners.”",
    "In order to cement these relationships with partners and customers, and localise the brand, Oppo has doubled the size of its UK & Ireland team since 2019.",
    "“Expanding our [UK] presence doesn’t just give us more capability and resource, it also gives us a local culture,” he says. “If you look at our team structure – 70% of our employees are actually from the UK and Ireland. We believe that by creating that local team we can genuinely engage and connect with the local markets.”",
    "Marketing also helps. In addition to international sponsorship like The International Cricket Council (ICC) and FC Barcelona, Oppo has partnered with one of the most famous properties in British sport – Wimbledon. The association with such a prestigious tournament was designed to raise awareness and credibility even further.",
    "“Wimbledon is quite picky when it comes to partnerships and our collaboration goes beyond just having the logo next to the Oppo brand,” says Cho. “The Wimbledon sponsorship is incredibly important to demonstrate to the UK consumer about what we are as a brand.”",
    "Oppo’s UK ambitions go beyond smartphones and into connected devices and accessories. The business market is also something it will pursue once its presence has matured.",
    "But there’s no escaping the size of the challenge it faces in the UK market where only Huawei has had any real success in breaking the Apple-Samsung duopoly in recent years.",
    "So how will it define success? The first step is to become that main alternative and build from there.",
    "“I don’t think there’s ever a ceiling [but] I think establishing ourselves as that clear third alternative,” Cho suggests. “We want to make sure we’re not just here as a flash in the pan but a long-term fixture in the broader tech ecosystem in the UK, delivering differentiated technology that matters.”",
    "Considering an 5G phone? Here are the best 5G phone deals around"
  ],
  "headers": {
    "3": "Device innovation",
    "10": "Business expansion"
  },
  "links": {
    "Oppo": "https://www.techradar.com/news/best-oppo-phones",
    "Apple": "https://www.techradar.com/news/best-iphone",
    "Samsung": "https://www.techradar.com/deals/samsung-mobile-phone-deals",
    "best 5G phone deals": "https://www.techradar.com/best/best-5g-phones"
  }
}