{
  "source": "https://www.techradar.com/news/many-businesses-plan-to-cut-the-wages-of-remote-workers",
  "title": "Many businesses plan to cut the wages of remote workers",
  "category": "computing",
  "updated": "2021-08-17T10:56:16Z",
  "author": "sead-fadilpasic",
  "summary": "Location allowances are also taking a hit",
  "article": [
    "Despite businesses cutting back overheads as a result of remote working, most business owners are contemplating reducing the salaries of employees who decide to work from home on a permanent basis.",
    "This is according to a new report from HR software provider CIPHR, which claims that two-thirds (68%) of business owners in the UK are thinking about pay cuts for employees who decide not to come back to the office.",
    "At the same time, half (53 percent) admitted to saving money as a result of the rise of remote working during the pandemic.",
    "Polling some 150 business owners, CEOs and senior managers for the report, CIPHR also found that hybrid workers (those who come into the office for at least a few days a week) most likely won’t suffer pay cuts.",
    "Small businesses (up to 50 employees) are the ones most likely to let their employees work remotely, it was said.",
    "Location allowances are also taking a hit. According to the report, 86% of employers have already suspended, reduced, or completely removed these payments during the pandemic. While for the majority (72 percent) these changes are temporary, for 14% they are permanent.",
    "Of the remaining 14% that haven’t made any changes to location allowances yet, almost a third (29 percent) are currently thinking about it.",
    "Some employees might be content to exchange a pay cut for the ability to work from home permanently. A survey of 1,000 UK-based office workers, conducted by Citrix and OnePoll in January this year, found that a significant majority would be willing to accept a pay cut to stay remote.",
    "On average, respondents said they would be willing to accept a 14% pay cut for the opportunity to work remotely, which would work out at just over £4,000 per year based on the average UK salary.",
    "However, businesses will need to navigate a number of ethical questions as they look to tweak payment structures in the coming months. Antagonizing employees could also backfire, leading to an exodus of talent.",
    "“Employers need to tread very carefully if they are going to look to remove location allowances or cut wages based on location, as a result of the shift to more home working. Not only because of the legal and ethical considerations and consequences but the long-term impact on employee loyalty and risk of increased turnover,” said Claire Williams, Director of People and Services at CIPHR.",
    "“If employers have very clear policies and contractual arrangements in relation to location allowances, then this will be easier to navigate. But that won’t necessarily make it more palatable for the employee who is receiving the news that their earnings are going to reduce through no fault of their own.",
    "“That said, the impact of the pandemic on the economy and organizations across the globe means that some difficult and very commercially focused decisions will have to be made to ensure long-term survival and success. Good communication is key, especially when explaining why certain decisions have been made to the detriment of the workforce.”"
  ],
  "headers": {
    "5": "Location allowances"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid workers": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "survey": "https://www.techradar.com/news/many-workers-would-accept-a-pay-cut-for-remote-working"
  }
}