{
  "source": "https://www.techradar.com/news/tiktok-vr-company",
  "title": "TikTok parent company just bought a VR headset producer – will virtual reality finally go viral?",
  "category": "vr",
  "updated": "2021-08-30T17:17:16Z",
  "author": "nick-pino",
  "summary": "Ready for TikTok dances in VR? It could happen.",
  "article": [
    "ByteDance, the company that owns TikTok, has just closed a deal to acquire Pico, one of HTC and Oculus’ main rivals, and makers of the Pico Goblin 2 and Pico Neo 2 headsets.",
    "The financial details around the deal have yet to be disclosed, but according to CNBC ByteDance says that Pico’s “comprehensive suite of software and hardware technologies, as well as the talent and deep expertise of the team, will support both our entry to the VR space and long-term investment in this emerging field.”",
    "What’s worth paying attention to in that statement is Pico’s intention to enter the VR space and its plans to support VR long-term – language that mirrors what Facebook has said about Oculus in the past.",
    "On the surface, Oculus and Pico do have a lot in common: they each make standalone headsets with comparable specs and are supported by their own proprietary software. The fact that each is now tied to a major social media platform is both interesting and could be a bit of foreshadowing about where the VR space might be heading in the years to come.",
    "With so few details about the acquisition and ByteDance’s plans for the future of Pico, it’s hard to make any definitive predictions about what’s going to happen in the VR space. That being said, the fact that ByteDance has a foothold in the social media space does seem to suggest that we’ll see some interplay between the two companies.",
    "As UploadVR points out in its coverage of the story, there hasn’t been any information about ByteDance expanding too far outside of its home in mainland China. That contrasts with HTC in Taiwan – makers of the HTC Vive and HTC Vive Focus headsets – which has become more of a household name.",
    "Should Pico make its way into international markets it’s going to have a real fight on its hands against the Oculus Quest 2 – easily one of the best VR headsets out there right now – but with TikTok in its pocket, it has a captive audience to advertise to when it finally goes global."
  ],
  "headers": {
    "4": "Analysis: Is VR about to go viral?"
  },
  "links": {
    "CNBC": "https://www.cnbc.com/2021/08/30/tiktok-owner-bytedance-acquires-pico-and-takes-first-step-into-virtual-reality.html",
    "UploadVR": "https://uploadvr.com/bytedance-buying-pico/",
    "HTC Vive": "https://www.techradar.com/reviews/wearables/htc-vive-1286775/review",
    "HTC Vive Focus": "https://www.techradar.com/reviews/htc-vive-focus-3",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "best VR headsets": "https://www.techradar.com/news/the-best-vr-headset"
  }
}