{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-watch-active-4-and-watch-active-3-could-both-be-on-the-way",
  "title": "The Samsung Galaxy Watch Active 4 and Watch Active 3 could both be on the way",
  "category": "wearables",
  "updated": "2021-02-19T11:28:23Z",
  "author": "david-nield",
  "summary": "Or other Samsung smartwatches",
  "article": [
    "The Samsung Galaxy Watch 3 left a very good impression on us, so we're keen to see what the next wearable from the electronics giant looks like – and the rumor is that a couple of new smartwatches are on the way in the not-too-distant future.",
    "Based on some digging by GalaxyClub (via SamMobile), we have model numbers SM-R86x and SM-R87x incoming. Considering recent Galaxy Watch devices have come with the label series SM-R8xx, it's a safe bet that we're looking at another in the line.",
    "And... that's just about all that we know at the moment. The new report doesn't make any mention of specs or features, or give any indication about what these watches will be called or when they'll be released – but we can still make some educated guesses.",
    "While Samsung's phones – such as the Galaxy S21 series – are usually refreshed on a yearly basis, it hasn't been the same for its wearables up to this point. That makes it a little bit harder to predict what's coming, and we haven't heard much in the way of rumors so far.",
    "The Galaxy Watch series hasn't been the easiest to keep track of since the original wearable launched back in August 2018. There was no Galaxy Watch 2 the year after, confusingly, but there was a Galaxy Watch Active and then a Galaxy Watch Active 2, both of which made their debuts in 2019.",
    "In 2020 we got the Galaxy Watch 3, but as yet there hasn't been an update to the cheaper, sportier Active line: could this be what the new model numbers are referring to? It seems probable that one of the upcoming wearables could well be the Samsung Galaxy Watch Active 3.",
    "That leaves one model reference unaccounted for. Considering the Galaxy Watch 3 has only been with us since August 2020, it seems early for the Galaxy Watch 4 – though perhaps these two mystery devices won't launch at the same time. We could see one in the next few weeks, and one in August.",
    "One of the new features that may show up on one or both of the planned devices could be the ability to monitor blood sugar, according to recent rumors, which in some scenarios can be a life-saving health indicator to have access to."
  ],
  "headers": {
    "4": "Galaxy Watch history and future"
  },
  "links": {
    "Samsung Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "GalaxyClub": "https://www.galaxyclub.nl/nieuws/samsung-werkt-alweer-aan-nieuwe-galaxy-watch-modellen/",
    "SamMobile": "https://www.sammobile.com/news/new-samsung-galaxy-watch-models-for-2021/",
    "Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "back in August 2018": "https://www.techradar.com/reviews/samsung-galaxy-watch-review",
    "Galaxy Watch Active": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-review",
    "Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Samsung Galaxy Watch Active 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "the ability to monitor blood sugar": "https://www.techradar.com/news/apple-watch-7-and-samsung-galaxy-watch-4-both-could-get-potentially-life-saving-new-feature"
  }
}