{
  "source": "https://www.techradar.com/news/tiktok-influencers-exposing-millions-to-misleading-stock-tips-and-financial-advice",
  "title": "TikTok influencers exposing millions to 'misleading' stock tips and financial advice",
  "category": "computing",
  "updated": "2021-02-08T17:22:35.272Z",
  "author": "joel-khalili",
  "summary": "Reddit isn’t the only social platform used to peddle investment advice",
  "article": [
    "Popular creators on breakout social media platform TikTok are jumping on the stock market bandwagon, exposing millions of viewers to misleading financial advice, new analysis suggests.",
    "An investigation into more than 1,000 stock-related TikTok videos by crypto exchange Paxful found that 14% failed to offer any sort of disclaimer that might warn viewers of the risks. These videos had a combined 28.4 million views and 3.6 million likes.",
    "Much of the offending content advised followers to purchase specific assets, as opposed to a broader asset class or genre, and were often guilty of implying guaranteed profit or suggesting a specific purchase volume.",
    "More than half (52%) of the TikTok accounts analyzed had published at least one “misleading” post, the vast majority (60%) of creators failed to include a disclaimer in their bio and just 10% offered information about their qualifications.",
    "Last week, interest in trading among individual investors shot through the roof as a result of the meteoric rise in the value of GameStop stock. The price surge was propelled by an organized group of amateur investors on social platform Reddit, who aimed to apply pressure on short sellers.",
    "While some will have profited from the endeavor, others likely incurred heavy losses as a result of the price correction that soon followed, highlighting the risks associated with financial advice shared over social platforms (even though many of the redditors were diligent about caveating their posts).",
    "The surge in interest also appears to have spilled over onto alternative services, such as TikTok, which caters predominantly to younger demographics with fewer resources to gamble on speculative investments.",
    "“The recent bull market and market volatility have led to increased interest in learning about investing, as well as people who are using social media to sell get-rich-quick type courses to uneducated beginners,” explained financial psychologist Dr. Brad Klontz.",
    "In order to mitigate the risks of financial advice shared over social media, Dr. Klontz suggests it’s vital to take the time to research the qualifications of the creator and also to seek out supplementary advice that is specific to personal needs and means.",
    "The largest red flag, he says, is when a creator makes a highly specific recommendation, advising followers to purchase a specific stock or insurance product.",
    "“TikTok is the fastest-growing social media platform. Like it or not, people are getting information on personal finance and investing there,” said Dr. Klontz.",
    "“These platforms can be helpful for education but the content should never be used as advice. There’s no one approach to investing that is best for everyone, so general advice is rarely appropriate.”"
  ],
  "headers": {
    "4": "TikTok stock tips"
  },
  "links": {
    "TikTok": "https://www.techradar.com/news/tiktok-found-to-be-tracking-user-data-on-android-devices",
    "Paxful": "https://paxful.com/insights/influencer-investors/",
    "meteoric rise in the value of GameStop stock": "https://www.techradar.com/news/gamestop-fever-rwallstreetbets-and-the-stock-trading-frenzy-explained"
  }
}