{
  "source": "https://www.techradar.com/news/nintendo-was-making-a-live-action-legend-of-zelda-tv-show-until-leakers-ruined-it",
  "title": "Here's why you won't get a Legend of Zelda Netflix show anytime soon",
  "category": "entertainment",
  "updated": "2021-02-02T16:50:12Z",
  "author": "henry-st-leger",
  "summary": "What might have been...",
  "article": [
    "A live-action Netflix TV show based on The Legend of Zelda video game franchise was in the works a few years ago, it seems – until leaks around the project caused Nintendo to scrap it entirely.",
    "The revelation has come from comedian and College Humor alumni Adam Conover, who made the claim in a recent episode of The Serf Times, a YouTube and Twitch channel news show (via IGN).",
    "Conover says that he was working on a claymation Star Fox adaptation at the time, with official involvement from Nintendo – and that both this and the Zelda Netflix show were canned after information started leaking.",
    "We got official confirmation back in 2015, from former Nintendo President Satoru Iwata, that a Netflix-Nintendo collab was not in the works, shortly after the news was leaked to the press.",
    "It seems like Nintendo preferred to shut down the project rather than risk continued leaks as production moved forward – in what might be a huge loss for the fandom, or a huge gain, depending on whether you think the series would have been any good.",
    "Regardless, it's unlikely a Zelda Netflix show would have lived up to the excellent parody movie trailer that IGN made in 2008 – which you can view below.",
    "It may be that we see Nintendo and Netflix work on a similar project in the future – the former has been more open-minded in recent years around bringing its biggest properties to the world of film and TV, as with the upcoming animated Mario movie in the works at Illumination (Despicable Me).",
    "Either way, it's likely to be a big year for Zelda announcements – the franchise is having its 35th anniversary, and it's almost certain we'll see Breath of the Wild 2 get a confirmed launch date before 2021 is out, while a port of Skyward Sword on Nintendo Switch has been rumored for a while too.",
    "Given the flurry of remasters, Switch ports, expansions, and battle royale games announced during Mario's own 35th anniversary in 2020, who knows what else might be on the cards?"
  ],
  "headers": {
    "6": "The year ahead"
  },
  "links": {
    "Netflix TV show": "https://www.techradar.com/best/best-netflix-shows",
    "The Serf Times": "https://www.youtube.com/watch?v=voJpYUCbeqc&feature=emb_logo",
    "IGN": "https://www.gamesradar.com/uk/legend-of-zelda-netflix-series/",
    "upcoming animated Mario movie": "https://www.techradar.com/news/new-super-mario-bros-movie-planned-for-2022-and-miyamoto-is-involved",
    "port of Skyward Sword": "https://www.techradar.com/news/a-new-zelda-game-is-coming-to-switch-and-its-not-breath-of-the-wild-2",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "battle royale games": "https://www.techradar.com/best/best-battle-royale-games"
  }
}