{
  "source": "https://www.techradar.com/news/gran-turismo-7-will-let-ps5-and-ps4-players-to-race-against-each-other",
  "title": "Gran Turismo 7 will let PS5 and PS4 players to race against each other",
  "category": "gaming",
  "updated": "2021-09-17T10:28:29Z",
  "author": "vic-hood",
  "summary": "And here's why campaign mode is always online",
  "article": [
    "Gran Turismo 7 will allow for crossplay between PS5 and PS4, the series creator has confirmed.",
    "In an interview with Eurogamer, Gran Turismo creator Kazunori Yamauchi confirmed that the next entry in the veteran racing series will allow PS4 and PS5 players to race against one another.",
    "Yamauchi also explained how Gran Turismo 7's dynamic weather and time system will see both moving in \"real-time\", with the weather having an effect on driving conditions and the time simulation allowing you to race from morning to noon.",
    "But while dynamic weather was noticeably absent from Gran Turismo's predecessor, GT Sport, another feature will be making a comeback. Yamauchi confirmed that the damage model from GT Sport, which allows players to see visual damage to their vehicle, will return to Gran Turismo 7 with improvements.",
    "Yamauchi also confirmed that Gran Turismo 7's campaign mode and Cafe will be online only, following speculation over a PlayStation Blog post, explaining that this is to prevent people from cheating by modifying save data.",
    "\"The requirement for the online connection isn't specific to the Cafe per se - it's just to prevent cheating overall from people trying to modify the save data, so that's the reason for the online connection,\" Yamauchi explained when asked about whether Cafe mode was online only.",
    "\"The online connection is required for the campaign mode,\" Yamauchi later confirmed when asked specifically about campaign mode. \"The only part of the game that doesn't require an online connection is the arcade mode, because that has no effect on the save data, so that's possible. But anything that has to do with the save data requires a connection.\"",
    "It will come as welcome news to Gran Turismo fans that the racing title will allow for crossplay between PS4 and PS5. After all, it wasn't that long ago that a PS4 version of the game was confirmed, following claims the Gran Turismo 7 would be a PS5 exclusive.",
    "For those who may be concerned that PS5 players will have a leg up over PS5 players, have no fear. It seems that Gran Turismo 7 will have the same frame rate on both consoles, with only visual improvements, loading times and controller features differentiating them, meaning that PS4 and PS5 players will be on even footing when race time comes.",
    "But while news of crossplay is positive, the confirmation that Gran Turismo 7's campaign mode - and everything apart from arcade mode - will be online only is less welcome news. While it's understandable that developer Polyphony Digital is trying to combat cheating, it appears to be doing so at the expense of players - who may suffer from a poor gameplay experience if their internet connection isn't quite up to scratch.",
    "With Gran Turismo 7 not releasing until March 4, 2022, we're hoping that the developer finds a decent compromise in an effort to prevent fan backlash."
  ],
  "headers": {
    "7": "Analysis: a mixed bag"
  },
  "links": {
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-09-16-the-big-gran-turismo-7-interview",
    "speculation": "https://www.techradar.com/news/gran-turismo-7s-campaign-mode-is-always-online-and-fans-arent-happy"
  }
}