{
  "source": "https://www.techradar.com/news/google-pixel-6-could-be-far-cheaper-than-the-iphone-13",
  "title": "Google Pixel 6 could be far cheaper than the iPhone 13",
  "category": "phones",
  "updated": "2021-10-19T09:23:09Z",
  "author": "james-rogerson",
  "summary": "Surprisingly affordable",
  "article": [
    "There’s been a worry for a while now that the Google Pixel 6 and Google Pixel 6 Pro could be expensive phones, with leaks and even vague comments from a Google executive pointing in that direction, but it’s now looking like they might actually be surprisingly affordable.",
    "Most pricing leaks so far have been in euros, so even if they’re correct they don’t give us a clear idea of how much the Pixel 6 range will cost in other regions. But now two sources point to the US pricing being $599 (around £435 / AU$810) for a 128GB Pixel 6, and $898 (roughly £655 / AU$1,215) for a 128GB Pixel 6 Pro.",
    "This claim initially came from Twitter user @EvanLei1, who posted a photo of shelves in Target listing those prices, and claimed that store staff said those prices were correct.",
    "Shortly after this, M. Brandon Lee of This is Tech Today corroborated these prices, posting images of what appears to be store inventory search pages showing the same prices. Incidentally, Lee also claims that Google will be losing money on these phones.",
    "We’d still take these prices with a pinch of salt, especially as they seem very low, but with two sources backing them up there’s a good chance they’re accurate, especially with the Google Pixel 6 range due to be announced on October 19, which is tomorrow at the time of writing.",
    "For comparison, the iPhone 13 starts at $799 / £779 / AU$1,349, so in the US at least the Google Pixel 6 would be substantially cheaper, and even the Pixel 6 Pro would only be slightly more expensive.",
    "It’s a similar story with the Samsung Galaxy S21, which starts at $799 / £769 / AU$1,249. Move up to the iPhone 13 Pro or Samsung Galaxy S21 Plus and you’re then paying more than the Pixel 6 Pro is rumored to cost, at $999 / £949 / AU$1,699 or $999 / £949 / AU$1,549 respectively, and those aren’t even the top models in their ranges.",
    "In fact, these prices would mean the Google Pixel 6 is even cheaper than the Google Pixel 5, as that costs $699 / £599 / AU$999. Of course, the Pixel 5 will presumably either be discontinued or substantially reduced when the Pixel 6 launches.",
    "So if these prices are indeed right then the Pixel 6 range could be remarkably affordable for what it is. That said, we can’t be sure that the UK and Australian prices will be as promising, as we’re still using conversions for them, but with the Pixel 6 range just a day away we should find out very soon.",
    "Via SlashGear"
  ],
  "headers": {
    "5": "Analysis: undercutting the competition"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "vague comments from a Google executive": "https://www.techradar.com/news/google-pixel-6-pro-price-might-rival-the-iphone-13-and-samsung-galaxy-s21-plus",
    "@EvanLei1": "https://twitter.com/EvanLei1/status/1449875442953949184",
    "M. Brandon Lee": "https://twitter.com/thisistechtoday/status/1449909532939804678",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Samsung Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "SlashGear": "https://www.slashgear.com/pixel-6-and-pixel-6-pro-us-prices-are-almost-unbelievable-17695581/"
  }
}