{
  "source": "https://www.techradar.com/news/sex-education-season-4",
  "title": "Sex Education season 4: everything we know so far",
  "category": "entertainment",
  "updated": "2021-11-19T16:06:14Z",
  "author": "axel-metz",
  "summary": "Sex Education season 4 is on the way",
  "article": [
    "Moordale fans, rejoice! Sex Education season 4 has been confirmed by Netflix.",
    "The groundbreaking high school drama is one of the best Netflix shows, and it's no surprise to see the streamer renew Sex Education for a fourth outing given how quickly season 3 shot to the top of its most-watched charts.",
    "We, for one, are excited to be returning to its high school halls for season 4 – especially after season 3's cliffhanger finale left major questions unanswered.",
    "Netflix officially confirmed that Sex Education season 4 is on the way during its inaugural Tudum fan event in September. Check out the announcement below:",
    "Below, then, we’ve rounded up all the latest news, rumors and tidbits that might give us a clue as to where the mega-popular Netflix show could go next. We've also explored our own predictions of what's coming up in the story.",
    "Naturally, spoilers for Sex Education’s first three seasons are disclosed ahead, so proceed with caution.",
    "Has it been renewed? Yes. Netflix announced Sex Education season 4 on September 25, 2021.",
    "Cast: We expect the likes of Asa Butterfield, Ncuti Gatwa and Gillian Anderson to all return. Producers are currently casting for new characters, too.",
    "Story predictions: With Moordale cash-strapped and set to close at the end of Sex Education season 3, we could see this forming the main narrative arc of season 4.",
    "Release date: Shooting is scheduled to take place between April and November 2022, so we don't expect it to arrive before early 2023.",
    "At present, there’s been no confirmed release date for Sex Education season 4, but the show has already been officially renewed by Netflix, even though season 3 was only released in September.",
    "Basically, that means season 4 is definitely on the way, but it's not likely to arrive for some time – our best bet is early 2023.",
    "That estimate was corroborated by a recent casting call for season 4, in which producers on the show voiced their desire to hire two trans actors for a pair of new characters. \"The project shoots April-November 2022,\" the call said – meaning we're certainly not going to see Sex Education season 4 next year.",
    "We're pleased the show will be returning, though, even if there’s only so many years Moordale’s students can remain at the fictional school before it becomes illogical for them to continue roaming the classrooms as twenty-somethings destined for university.",
    "Still, that may indeed be a path the show decides to take, and now Netflix has renewed the show for season 4, it’s likely to follow the release schedule of previous entries – a pandemic-hampered third season notwithstanding – which each landed in January of 2019 and 2020, respectively.",
    "January 2023 seems the likeliest window, then, at this early stage.",
    "As for who is likely to return to the show in season 4, we'd anticipate seeing series mainstays Asa Butterfield, Ncuti Gatwa and Gillian Anderson all reprise their roles as Otis, Eric and Jean, respectively.",
    "The likes of Connor Swindells (Adam), Aimee Lou Wood (Aimee), Kedar Williams-Stirling (Jackson), Mimi Keene (Ruby) and Mikael Persbrandt (Jakob) all seem likely to return, too, along with most of the show’s new season 3 characters, like headteacher Hope (Jemima Kirke) and new student Cal (Dua Saleh).",
    "The future of Emma Mackey’s Maeve Wiley is less clear, though, given her departure to America at the end of season 3. She’s still a major player in Sex Education’s ongoing will-they-won’t-they narrative between Otis and Maeve, so we’d of course anticipate her return at some point, it’s just not immediately clear whether that would be in season 4, or perhaps a further season later down the line.",
    "If we were betting on it, though, we reckon Maeve will be back along with the others.",
    "As per the above casting call, several new actors will be joining the show, too – but hopefully in a more substantial capacity than the greatly under-used Jason Isaacs in season 3.",
    "As above, Sex Education’s third season conjured an air of finality for certain narrative threads – but it blew open a lot more, too.",
    "It seems likely that Maeve’s jetting off to America will have consequences for her screen time in season 4, which may see Otis forced to get over his love for her once and for all, despite the promise of a mutual romance before Maeve’s decision to leave the country. New episodes may pick up if and when she returns from her travels, but it seems more logical that the show would explore how Otis copes in her absence.",
    "Other characters, though, seem in for an even rockier ride. Adam and Eric decided to go their separate ways after a season of romantic highs and lows, with the latter’s kissing another man in Nigeria acting as the nail in the coffin for a relationship which always seemed oddly balanced, given Adam’s ongoing journey to understanding his own sexuality. But we also saw Adam growing closer to Eric’s ex Rahim in season 3’s later episodes, suggesting there’s potential for a romance between the pair that once seemed impossible.",
    "Elsewhere, after receiving the results of a paternity test, it seems as though Jean’s new baby daughter, Joy, may not be Jakob’s after all. This twist isn’t confirmed yet, but her shock – and “oh shit!” – at the result suggests the pair are in for some awkward conversations ahead.",
    "Then there’s the question of Jackson and Cal’s relationship moving forward, Hope’s as-yet-unexplored struggle to conceive a child and, in perhaps the biggest plot shake-up of all, the immediate future of Moordale.",
    "In season 3’s final episode, it was revealed that the school would be closing due to a lack of investors – a move supposedly brought about by the students’ reluctance to back down from their calls for sexual liberation on campus.",
    "This could have big implications for Sex Education season 4. Will Moordale’s students and staff be forced to move elsewhere? If so, it’s unlikely everyone would be able to stay together, which would by-and-large kill the dynamic of the show. A more likely outcome might see the series' main characters rally alongside the local community to generate some last-ditch funding for the school, a challenge which would probably occupy an entire season.",
    "That would be our best guess for the main narrative hook of Sex Education’s fourth run. Sure, it’ll be interesting to see how Otis copes in Maeve’s absence, how Adam deals with his break-up with Eric and how Jean plans on telling Jakob that her child probably isn’t his – but without Moordale school, there’s no Sex Education."
  ],
  "headers": {},
  "links": {
    "best Netflix shows": "https://www.techradar.com/best/best-netflix-shows"
  }
}