{
  "source": "https://www.techradar.com/news/apple-music-could-be-hitting-your-ps5-soon",
  "title": "Apple Music could be hitting your PS5 soon",
  "category": "gaming",
  "updated": "2021-10-15T10:52:23Z",
  "author": "jamel-smith",
  "summary": "Lossless music for gamers?",
  "article": [
    "Apple Music may be appearing on your PS5 very soon according to a Reddit post.",
    "A Reddit user posted a picture of Apple Music appearing under the Spotify option (currently the only music streaming service available on PlayStation) in the PS5’s music menu accessed from the control center.",
    "The Apple Music option appeared after the Reddit user made a new account on his PS5. But, upon clicking the Apple Music icon, the PS5 displayed an error message saying “this app is playable only on PS4.”",
    "Apparently, this is the standard error message the PS5 shows when there’s a missing app, because many of the PS5 media apps are just PS4 apps running on the PS5 via backwards compatibility.",
    "Eurogamer was able to replicate the Apple Music prompt by creating a new US account, but they were unable to reproduce getting the prompt. This has led to speculation that Sony is currently testing the feature before its released to the public.",
    "Apple Music coming to Sony’s PS5 shouldn’t be a surprise for anyone, since the two companies have been working together recently. Apple and Sony recently teamed up to offer PS5 owners a free six-month subscription to Apple TV Plus. Also, Apple showed off the PS5 DualSense controller at an Apple event, touting the controller as a great accessory for Apple Arcade subscribers to play their games with, as the controller is now compatible with Apple devices using iOS 14.5, iPadOS 14.5, tvOS 14.5, macOS 11.3 and newer. You can now even buy the DualSense controller from the Apple Store.",
    "Apple is hosting an event on Monday October 18, so could we see the company slip in the announcement of Apple Music coming to PlayStation there? It would be great to have Apple Music come to the PS5, as maybe Apple could take advantage of the PS5’s 3D audio functionality to bring Apple Music’s Spatial Audio to the console."
  ],
  "headers": {
    "5": "Analysis: Collaborations between Apple and Sony keep on coming"
  },
  "links": {
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Reddit user": "https://www.reddit.com/r/AppleMusic/comments/q68jxg/since_when_was_this_a_thing_i_made_a_new_account/?utm_source=share&utm_medium=web2x&context=3",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-10-14-it-looks-like-apple-music-may-be-coming-to-playstation-5",
    "PS5 owners a free six-month": "https://www.techradar.com/news/apple-tempts-ps5-gamers-with-free-six-months-of-apple-tv-plus",
    "DualSense controller": "https://www.techradar.com/news/you-can-now-buy-ps5-dualsense-controllers-from-apple"
  }
}