{
  "source": "https://www.techradar.com/news/blizzard-accidentally-released-the-blizzcon-2021-press-kit-everything-we-know-so-far",
  "title": "Blizzard accidentally released the Blizzcon 2021 press kit - everything we know so far",
  "category": "gaming",
  "updated": "2021-02-19T12:16:29Z",
  "author": "jess-weatherbed",
  "summary": "WoW, that's embarrassing",
  "article": [
    "Blizzard has accidentally released its press kits for BlizzCon 2021, or BlizzCon Online, ahead of the digital event. According to the leak, which is currently unverified, the content is specific to the World of Warcraft: Shadowlands and World of Warcraft: Classic games, so if you want to avoid spoilers until the official announcement then avoid the below information dump. No confirmed information has been leaked regarding Blizzard's other titles, so we're keeping our fingers crossed that content for Diablo, Overwatch, and more to look forward to during the live streamed event.",
    "Our first major content patch for the Shadowlands expansion seems to be on the horizon with additional gameplay that will provide a plethora of new features, from fresh raid and dungeon content to new cosmetic armor sets. Some leaked artwork potentially confirms Anduin's long-rumored reappearance in the series and the ability to fly your mounts through the skies of the shadowlands. A new area is being introduced which promises to provide new quests and activities. New content is also coming for your covenants, with a united front across the kyrian, night fae, necrolords, and venthyr to take the fight directly to the Jailer. A new eight-boss mythic mega-dungeon is being introduced alongside an expansion to the rogue-like Torghast in the form of a new raid that will allegedly pit you against the nefarious Sylvanas Windrunner herself. The leaked features list is truly expansive and should keep anyone exploring the afterlife realms busy until the next big content drop, whether you love grinding out for new equipment or joining your friends in battle against Azeroth's greatest villains.",
    "Speculation for the release of World of Warcraft: Burning Crusade Classic has been present on the internet for some time, but this leaked press kit finally confirms that it'll be coming to PC once again 14 years after its original release. Anyone who subscribes to the standard version of World of Warcraft can also play WoW: Classic without paying an additional subscription, meaning you can enjoy the upcoming Burning Crusade Classic at no additional cost. Prior to Burning Crusade Classic’s release, WoW Classic players can decide whether to advance each of their characters to the Burning Crusade era with the rest of their realm, or to continue playing the original WoW Classic content on new Classic Era servers. It isn't clear if this means you can change your choice after you have made the decision to remain in vanilla or jump into the new content. You can also now play as a Blood Elf or Draenei, should you choose to play the Burning Crusade expansion.",
    "Running from February 19 to February 20, BlizzCon 2021 will be an entirely online event with a main channel for highlights and replays and a further five dedicated to World of Warcraft, Hearthstone, Diablo, Overwatch and 'Strategy', which appears to involve StarCraft and a retrospective behind-the-scenes.",
    "The full schedule for BlizzCon 2021 can be found on the official site. Those looking to tune in will be able to start watching the Opening Ceremony across all the channels on February 19 at 2:00 PM PT / 5:00 PM ET / 10:00 PM GMT.",
    "Via Wowhead"
  ],
  "headers": {
    "1": "Shadowlands content patch",
    "2": "World of Warcraft: Burning Crusade Classic"
  },
  "links": {
    "BlizzCon 2021": "https://www.techradar.com/news/blizzcon-2021",
    "World of Warcraft: Shadowlands": "https://www.techradar.com/reviews/world-of-warcraft",
    "World of Warcraft: Classic": "https://www.techradar.com/news/how-to-get-into-world-of-warcraft-classic-what-you-need-to-know-about-vanilla-wow",
    "on the official site": "https://blizzcon.com/en-gb/schedule",
    "Wowhead": "https://www.wowhead.com/news=320972/world-of-warcraft-blizzconline-leaks-shadowlands-chains-of-domination-and-the-bu"
  }
}