{
  "source": "https://www.techradar.com/news/steam-autumn-sale-2021-10-of-the-best-games-to-buy-on-the-cheap",
  "title": "Steam Autumn sale 2021: 10 of the best games to buy on the cheap",
  "category": "gaming",
  "updated": "2021-11-26T17:47:46Z",
  "author": "tom-power",
  "summary": "Bag yourself a bargain in the Steam Autumn sale",
  "article": [
    "The 2021 Autumn Steam sale has arrived. Black Friday may be taking over a plethora of online retailers right now, but Valve's gaming platform is also getting in on the action.",
    "Rather than actually taking part in the Black Friday sales, Steam is doing its own thing. Just like every other year, then, really. Still, the Autumn Steam sale is the perfect time to pick up one, two, or even a whole bunch of new games that you've been eager to play. Or add to your back catalog, whichever takes your fancy.",
    "Usually, games that are available on Steam are also ported to other consoles, including Xbox and PlayStation. If you're in the market for some Black Friday deals concerning either of these systems, check out our Xbox Series X Black Friday and PS5 Black Friday buying guides. We've also got one for Nintendo Switch, too, if you've been long searching for that console hybrid.",
    "But we digress. There's a seemingly infinite number of games that have had their prices slashed in the Autumn Steam sale – or the Fall Steam sale, if any US residents are reading this – so you may feel overwhelmed about which titles you should be spending your hard-earned cash on.",
    "That's where we come in. We've taken a deep dive into every corner of Steam's current sale, which began on November 24 and runs right through to December 1, to search for the best (and cheapest) games that you'll want to pick up. You can thank us later – or, if you prefer, right now. It's Thanksgiving weekend in the US, after all.",
    "As we mentioned in our intro, there are plenty of games that have been discounted in the Steam Autumn sale. As such, it can be hard to work out which ones you should opt for.",
    "Chances are good you've already got a list of titles that you want to bag. But the Steam Autumn sale can throw up the odd surprise or two, and this may change which game you prioritize.",
    "Alternatively, you may be going for a scattergun approach. You've got a bundle of cash that's burning a hole in your pocket, and you aren't overly fussed about what you should buy. This might be particularly true if you're a gamer who dabbles in multiple genres as opposed to a single one, including first-person shooters, JRPGs, sports sims, and other game types.",
    "Regardless of how you want to play this, we've hand selected 10 of the best Steam Autumn sales for the Black Friday and Cyber Monday 2021 period. You can check them out in the bullet-point list below, and we've handily linked out to each Steam page. All you need to do is click on the link and you'll be whisked away to the right part of Steam. We're nice like that.",
    "These, then, are the 10 best Steam Autumn sale deals around:",
    "You may have missed it earlier, so we'll repeat it for anyone who did: the Steam Autumn sale will end on Wednesday, December 1 at 10 AM PT. That's 1 PM ET for east coast US citizens, 6 PM GMT for UK dwellers, 11:30 PM IST for Indian residents, and 4 AM AEST (on Thursday, December 2) for Australian readers.",
    "That means, at the time of writing, you've got six days left to decide what you want to buy. After that, you'll be waiting until the Steam Winter Sale rolls around, in mid to late December, for the next sales period.",
    "If you're after some other Black Friday gaming deals, we've got you covered. You can check out our Black Friday gaming laptops buying guide for discounts on the latest computing hardware, our Black Friday PC gaming deals hub for other price reductions, or Black Friday gaming chairs if you need a new seat to chill out on while you game.",
    "We mentioned our Xbox Series, PS5 and Switch hubs before, too. But, if you need something more refined for those consoles, we've got you covered. Read up on our Black Friday Xbox controller deals hub, view our Black Friday PS4 deals buying guide, check out our Black Friday PS Plus buying guide, and our Cyber Monday Nintendo Switch deals article.",
    "And, speaking of Cyber Monday, why not view our dedicated hub for that, which covers all of the best deals that'll be available until Monday, November 29?",
    "The sales, offers and discounts will keep coming, so be sure to bookmark all of these pages and regularly check back in with our experts for more over the next few days.",
    "In the US:",
    "In the UK:"
  ],
  "headers": {
    "5": "What are the best games in the Steam Autumn sale?",
    "10": "When does the Steam Autumn sale end?",
    "12": "More Black Friday gaming deals",
    "16": "More Black Friday deals"
  },
  "links": {
    "Black Friday sales": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Xbox Series X Black Friday": "https://www.techradar.com/black-friday/xbox-series-x-black-friday-deals-2021",
    "PS5 Black Friday": "https://www.techradar.com/black-friday/best-black-friday-ps5-deals-2021",
    "Nintendo Switch": "https://www.techradar.com/black-friday/nintendo-switch-black-friday-deals",
    "Black Friday gaming laptops buying guide": "https://www.techradar.com/black-friday/black-friday-gaming-laptop-deals",
    "Black Friday PC gaming deals hub": "https://www.techradar.com/deals/best-black-friday-pc-gaming-deals-2019",
    "Black Friday gaming chairs": "https://www.techradar.com/news/black-friday-gaming-chair-deals-2021-what-to-expect",
    "Black Friday Xbox controller deals hub": "https://www.techradar.com/black-friday/black-friday-xbox-controller-deals",
    "Black Friday PS4 deals buying guide": "https://www.techradar.com/black-friday/black-friday-ps4-deals",
    "Black Friday PS Plus buying guide": "https://www.techradar.com/black-friday/black-friday-ps-plus-deals",
    "Cyber Monday Nintendo Switch deals": "https://www.techradar.com/cyber-monday/nintendo-switch-cyber-monday-deals-2020-bundles-games-accessories-and-more",
    "our dedicated hub": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}