{
  "source": "https://www.techradar.com/news/these-cheap-apple-airpods-pro-rivals-boast-better-battery-life-on-a-budget",
  "title": "These cheap Apple AirPods Pro rivals boast better battery life on a budget",
  "category": "audio-visual",
  "updated": "2021-01-11T14:02:58Z",
  "author": "olivia-tambini",
  "summary": "Edifier launches its latest wireless earbuds for CES 2021",
  "article": [
    "Noise-cancelling wireless earbuds have exploded in popularity following the success of models like the Apple AirPods Pro and the Sony WF-1000XM3, but these hard-working buds can often be very expensive.",
    "Edifier's latest true wireless earbuds buck that trend however, offering noise cancellation and a compact form factor for just $99 (about £70 / AU$130).",
    "Available in March, the new Edifier TWS NB2 Pro were announced as part of the Hi-Fi specialist's suite of CES 2021 launches, with the Las Vegas tech expo moving online in response to the coronavirus pandemic.",
    "According to to Edifier, the new earbuds are \"certified to block medium to low environmental frequencies\", which suggests some higher frequency sounds, like alarms or high-pitched speech, will still leak through the buds.",
    "If you want to fully tap into your surroundings, an ambient sound function lets environmental noise pass through the buds without stopping your music, much like the AirPods Pro.",
    "While Edifier hasn't shared much in the way of audio specs, the company has a fairly good reputation among the Hi-Fi crowd, specializing in PC and bookshelf speakers. Saying that, we weren't exactly enamored by the super cheap Edifier TWS1, which didn't deliver on sound quality despite their fantastic battery life.",
    "Connectivity comes courtesy of Bluetooth 5, while a Qualcomm low-power consumption chipset allows for a relatively long battery life. The buds themselves offer nine hours of playback with ANC switched off (seven hours when ANC is on), with the charging case provides an additional 23 hours of juice – far longer than the more expensive AirPods Pro.",
    "As for the design, the TWS NB2 Pro look pretty slick, taking the protruding stems of Apple's earbuds and giving them a more angular look. Silicone eartips should provide a comfortable fit as well as a good seal against environmental noise, and while Edifier hasn't provided any information on controls, those protruding stems look as though they could contain touch-capacitive sensors.",
    "There's also an IP54 dust and water-resistance rating, which means you should be able to use the earbuds for working out, without the fear that a little sweat or rain will break them.",
    "All those specs sound pretty impressive when you consider the relatively low price of the TWS NB2 Pro, and if Edifier can deliver on sound quality, these earbuds could be a compelling alternative to the best true wireless earbuds on the market today."
  ],
  "headers": {
    "3": "Long-lasting buds"
  },
  "links": {
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WF-1000XM3": "https://www.techradar.com/reviews/sony-wf-1000xm3-wireless-earbuds",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "bookshelf speakers": "https://www.techradar.com/news/best-stereo-speakers",
    "Edifier TWS1": "https://www.techradar.com/reviews/edifier-tws1-true-wireless-earbuds",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}