{
  "source": "https://www.techradar.com/news/denon-launches-its-first-dolby-atmos-soundbar-with-airplay-2-and-alexa-smarts",
  "title": "Denon launches its first Dolby Atmos soundbar with AirPlay 2 and Alexa smarts",
  "category": "audio-visual",
  "updated": "2021-01-20T06:36:25Z",
  "author": "olivia-tambini",
  "summary": "This hardworking soundbar also comes with HEOS multiroom",
  "article": [
    "CES 2021 may be drawing to a close, but soundbars continue to dominate the virtual tech expo, with Denon announcing its first Dolby Atmos-enabled soundbar.",
    "The Denon Home Sound Bar 550 can be used as a standalone soundbar to boost your TV's built-in speakers, or as part of a wireless setup with the Denon Home 150, 250, and 350, which can be used as rear-channel surrounds.",
    "There's also the option of adding in the Denon DSW-1H wireless subwoofer to create a complete wireless 5.1 system and really boost those bass frequencies.",
    "Support for the HEOS ecosystem, which includes the Denon Home range as well as other Denon and Marantz devices, means you can add the soundbar to a wireless multiroom audio system without the need for annoying cables cluttering your home.",
    "A six-driver array means the Sound Bar 550 can deliver Dolby Atmos and DTS:X 3D surround sound, which should make for an immersive experience when you settle in to watch a movie.",
    "If you want to use your soundbar to listen to music, there's support for Hi-Res Audio too, either from your streaming service of choice or via your own local music library via the HEOS Built-in platform. Plus, there's AirPlay 2 support, so you can easily stream music from your Apple devices.",
    "Built-in microphones means that the Denon Home Sound Bar 550 can also double up as an Alexa smart speaker, adding voice assistance to your living room without the need for an additional Amazon Echo. This feature won't be available straight away, however, coming via a firmware update in the first few months of 2021.",
    "Once that firmware update lands, you'll be able to use voice commands to control the soundbar's volume, change inputs, and toggle through different audio modes, which include Music, Movie, and Pure.",
    "You can manually control the soundbar as well, with a nifty control panel that lights up when you approach it, or with the included remote control or HEOS app.",
    "Available for preorder on February 1 and expected in stores from mid-February, the Denon Home Sound Bar 550 doesn't come cheap costing $599 / £599 / AED 3,499 (about AU$770).",
    "Saying that, it is cheaper than the Sonos Arc, which costs $799 / £799 / AU$1,399 – and with comprehensive multiroom support, a suite of compatible wireless speakers, and support for Dolby Atmos, Denon's latest soundbar could be a worthy rival for the best soundbar of 2021.",
    "It's not alone, either. CES has seen in a glut of Sonos-rivaling soundbars, including the tiny LG QP5 Éclair, which offers Dolby Atmos in a compact package that will suit smaller spaces.",
    "However, it's Samsung that will likely prove to be Sonos' biggest rival this year, having announced the 11.1.4-channel HW-Q950A, which comes with Dolby Atmos support and some seriously innovative rear speakers.",
    "Unlike most soundbar setups, the included wireless rear speakers each come with a side-firing channel, blasting your music or TV audio at you from every angle in conjunction with the bar's upfiring tweeters.",
    "With these soundbars yet to hit the market, only time will tell whether Sonos will be usurped in 2021 – still, we can't wait to test these new soundbars and find out."
  ],
  "headers": {
    "9": "Should Sonos be worried?"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "Denon Home 150": "https://www.techradar.com/news/watch-out-sonos-denons-new-wireless-speakers-set-to-rival-multi-room-giant",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Alexa smart speaker": "https://www.techradar.com/news/the-best-alexa-speakers",
    "Amazon Echo": "https://www.techradar.com/reviews/amazon-echo-2020",
    "Sonos Arc": "https://www.techradar.com/reviews/sonos-arc",
    "wireless speakers": "https://www.techradar.com/news/best-speaker",
    "best soundbar": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "LG QP5 Éclair": "https://www.techradar.com/news/this-eclair-shaped-dolby-atmos-soundbar-could-be-a-satisfying-treat-for-tight-spaces",
    "11.1.4-channel HW-Q950A": "https://www.techradar.com/news/samsungs-new-dolby-atmos-soundbar-could-be-its-most-immersive-yet"
  }
}