{
  "source": "https://www.techradar.com/news/acer-unveils-the-worlds-first-17-inch-chromebook",
  "title": "Acer unveils the world’s first 17-inch Chromebook",
  "category": "computing",
  "updated": "2021-11-23T07:41:23Z",
  "author": "matt-hanson",
  "summary": "The company’s next@Acer event showed off some goodies",
  "article": [
    "Acer has announced a whole range of new laptops, desktops, and Chromebooks, and perhaps the most exciting amongst them is the Acer Chromebook 317 – the world’s first 17-inch Chromebook.",
    "In the 10 years that Chromebooks have been with us, there hasn’t been a 17-inch Chromebook, even though there are some brilliant 17-inch laptops running Windows 10, and Acer has obviously decided that there’s enough demand for a large-screen Chromebook.",
    "Rather than the small and affordable devices that make our best Chromebook list, the Acer Chromebook 317 is a large and premium device with a full HD 17.3-inch display, full HD webcam with dual microphones (on some models) and optional backlighting on the keyboard. From what we’ve seen of the Acer Chromebook 317 at Acer’s event, the device looks and feels more like a premium Windows 10 laptop.",
    "It’s still fundamentally a Chromebook, however. It runs Chrome OS, offers up to 10 hours of battery, and includes Wi-Fi 6 connectivity. It’s powered by Intel Celeron processors, which in a Windows 10 laptop would feel woefully underpowered, but when running Chrome OS should be fine. It’ll go on sale in June, starting at $379.99 (around £270 / AU$490), which is quite a bit cheaper than standard 17-inch laptops.",
    "Acer also updated its sleek Chromebook Spin 713 with 11th gen Intel Core i7 processors and Thunderbolt 4 connectivity. This Intel Evo-certified Chromebook comes with a 13.5-inch 2,256 x 1,504 display, DTS Audio, 10-hour battery, and a military-grade chassis. It’s looking like it could be one of the most premium Chromebooks ever made. This will go on sale in June for $699.99 (around £500 / AU$900).",
    "There’s also two new 14-inch Chromebooks – the Chromebook 514 (which also comes in an Enterprise edition for businesses), for $599.99 (around £430 / AU$770) and the Chromebook 314, which is aimed at students, which will cost $269.99 (around £190 / AU$350) when it goes on sale in the US in July.",
    "Acer also showed off new and updated laptops. Perhaps the most exciting is the new Acer Swift X, which packs the latest AMD Ryzen 5000 mobile processors, along with Nvidia GeForce RTX 3050 Ti GPUs. This means this slim and light laptop (it’s just 17.9mm thick) is impressively powerful, and can even handle 4K video editing and the odd game as well.",
    "The Acer Swift X will arrive in June for $899.99 (£899.99, around AU$1,160).",
    "The Acer Predator Triton 500 SE gaming notebook, meanwhile, comes with 11th generation Intel processors (up to a Core i9) and up to an RTX 3080 laptop GPU.",
    "The Predator Helios 500 is also getting an update to include 11th gen Intel processors and an RTX 3080 laptop GPU.",
    "The Acer Predator Triton 500 SE will go on sale in June in the US, starting at $1,749,99 (around £1,300 / AU$2,300). The Predator Helios 500 will arrive in August, starting at $2,499.99 (around £1,800 / AU$3,200).",
    "We should hopefully be getting in Acer’s new Chromebooks and laptops to review soon, so will let you know just how good these devices are."
  ],
  "headers": {
    "6": "New laptops"
  },
  "links": {
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "brilliant 17-inch laptops": "https://www.techradar.com/news/best-17-inch-laptop",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "Acer Swift X": "https://www.techradar.com/reviews/acer-swift-x"
  }
}