{
  "source": "https://www.techradar.com/news/google-could-be-set-to-expand-fitbit-premium-and-some-users-arent-happy",
  "title": "Google could be set to expand Fitbit Premium, and some users aren’t happy",
  "category": "fitness",
  "updated": "2021-02-22T14:23:59Z",
  "author": "rhys-wood",
  "summary": "Google's plans for Fitbit have us concerned",
  "article": [
    "Google could be looking into ways of expanding its Fitbit Premium subscription plans via additional pricing tiers following the completion of its $2.1 billion acquisition of the fitness hardware company last month.",
    "The new tiers could be introduced as part of Google's efforts to monetize users' historical fitness data, as suggested by a report on Android Central. This falls in line with Google’s commitment to not use a customer’s data for advertising purposes, a key condition imposed by regulators in allowing the acquisition to occur.",
    "In a blog post, Google’s Senior Vice President of Devices and Services, Rick Osterloh, reassured Fitbit users that their data won’t be falling into the hands of third parties. He wrote: “This deal has always been about devices, not data, and we’ve been clear since the beginning that we will protect Fitbit users’ privacy.”",
    "The notion that Google could be expanding Fitbit Premium comes via a survey emailed to customers about the subscription service. The survey hints that Google is looking at the possibility of introducing cheaper subscription tiers for those who only require a more basic Fitbit experience.",
    "However, users noticed something potentially worrying about the cheapest subscription offer, namely its inclusion of historical fitness data. This is a feature that has always been free to non-paying users of Fitbit, but that could be about to change.",
    "This would potentially make Fitbit products less useful for those who don’t wish to pay for its Premium membership service. It would also be a way for Google to get more people paying for Fitbit Premium by way of a cheaper price point.",
    "While we don’t yet know for certain what Google ultimately is planning for Fitbit, the brand's products are already available on the Google Store, so we’re fairly certain that we'll see new Fitbit hardware in the future, possibly with Google’s own Wear OS built in."
  ],
  "headers": {
    "3": "Running away with it"
  },
  "links": {
    "Fitbit Premium": "https://www.techradar.com/news/fitbit-premium-what-is-it-and-who-is-it-for",
    "Android Central": "https://www.androidcentral.com/so-thats-how-google-going-monetize-your-fitbit-data",
    "In a blog post": "https://blog.google/products/devices-services/fitbit-acquisition/"
  }
}