{
  "source": "https://www.techradar.com/news/huawei-p50-series",
  "title": "Huawei P50 release date, price, what you need to know and how the P50 Pro differs",
  "category": "phones",
  "updated": "2021-10-21T15:16:42Z",
  "author": "tom-bedford",
  "summary": "Huawei's new flagship phone line",
  "article": [
    "The Huawei P50 and P50 Pro were both officially unveiled in July 2021, which was already late compared to when we expected, but as of October they still haven't been put on sale for global buyers.",
    "At the moment, you can only buy the phones in China. Huawei has now confirmed it'll be bringing its smartphones to other countries, but not until early 2022.",
    "It's possible the ongoing global chipset shortage is to blame, and we've heard the Huawei Mate 50 series could be delayed or canceled as a result too.",
    "The Huawei P50 and P50 Pro are the 2021 entries into the company's long-running line of photography-focused smartphones, with top specs across the board but particularly in the camera department. You can find out everything there is to know about the devices below.",
    "The Huawei P50 and P50 Pro prices have been confirmed for China, and there are a few different price points for different storage sizes. Firstly, let's look at the standard Huawei P50 prices, as well as conversions in different regions (these won't necessarily be the on-sale prices in those regions).",
    "So that's a fairly typical mid-range price in most regions, though we don't expect the conversions will prove fully accurate if or when the device lands in markets outside China. We don't know a release date in China for the standard model just yet.",
    "Now on to the Huawei P50 Pro price.",
    "Those conversions suggest some pretty high prices for the Huawei P50 Pro, especially the 12GB RAM version.",
    "The Huawei P50 Pro release date was August 12 in China. We expected a global launch for both the Pro and the Pro Plus at some point in August or September, but it was instead delayed until early 2022.",
    "We don't yet know exactly when you'll be able to buy the Huawei P50, or which countries it'll be available in. In fact, we wouldn't expect you'll be able to ever buy this phone in the US.",
    "The Huawei P50 has a flat-edge OLED screen that's 6.5 inches diagonally, and broken up by a central cutout for the front camera on the top edge. The resolution is 1228 x 2700, while the refresh rate is 90Hz and the touch input is 300Hz.",
    "The Huawei P50 Pro has mostly the same display specs, but it's slightly bigger at 6.6 inches, and has a 120Hz refresh rate. Unlike the 'vanilla' phone, its screen curves at the edges.",
    "The phones look pretty similar (other than the display) with the rear cameras housed in two large circles on the back. The devices have USB-C ports, but no 3.5mm headphone jacks.",
    "Huawei made a point of stating that the devices are IP68 resistant against dust and water, and also that they're both fairly lightweight, with the standard model weighing 181g and the Pro 195g – that's a fair bit less than your average iPhone, for example.",
    "Now onto the department Huawei phones are known for: their cameras. The standard P50 has three rear shooters, with a 50MP main, 12MP periscope zoom and 12MP ultra-wide snapper. That's a fair complement of cameras, with the periscope module supporting 5x optical zoom.",
    "The P50 Pro has 64MP telephoto , 50MP main, 40MP monochrome and 13MP ultra-wide cameras – that's a series of very high-res snappers, with the periscope one apparently facilitating a head-scratching 200x digital zoom (as well as 3.5x optical).",
    "The front-facing camera on both those phones is 13MP, so a little low-res compared to the other snappers, but more than you'll need for selfies.",
    "The Huawei P50 has a 4,100mAh battery, while if you opt for the Pro you're getting a slightly bigger 4,360mAh power pack. Both of those figures seem quite modest for a flagship phone, so we hope there are some smart software optimizations to keep the devices ticking over for a decent length of time.",
    "There's 66W wired charging for both handsets, which is pretty fast for a smartphone, though about the same as for other flagships on the market. The Pro also has 50W wireless charging.",
    "All new Huawei P50 phones run HarmonyOS 2, the company's Android rival that it unveiled earlier in the year. Admittedly the software doesn't feel a million miles from Android, but it brings a few changes.",
    "Firstly, Huawei's AppStore has a fairly limited number of apps on it, although you can work around this by using Petal Search, a way of installing other apps you want from the web.",
    "HarmonyOS was designed to work well in collaboration with other Huawei devices, so if you have a tablet or smartwatch from the company you should be able to make the most of it.",
    "So what about the chipset? In the Huawei P50 it's the Snapdragon 888, the top-end processor available to Android phones – but with one change. It's a 4G version, so neither the Huawei P50 or P50 Pro let you connect to 5G networks.",
    "A spokesperson for Huawei told TechRadar, \"For reasons that are known to everyone, Huawei is left with no option but launch 4G variants for Huawei P50 Series.\""
  ],
  "headers": {
    "4": "Huawei P50 series release date and price",
    "10": "Design and display",
    "14": "Cameras and battery life",
    "19": "Performance and software"
  },
  "links": {
    "has now confirmed": "https://www.techradar.com/news/huawei-p50-will-launch-worldwide-but-not-until-2022",
    "Huawei Mate 50": "https://www.techradar.com/news/huawei-mate-50"
  }
}