{
  "source": "https://www.techradar.com/news/whatever-the-weather-preparing-data-centers-for-the-effects-of-climate-change",
  "title": "Whatever the weather: Preparing data centers for the effects of climate change",
  "category": "computing",
  "updated": "2021-01-29T17:55:28Z",
  "author": "chris-rason",
  "summary": "Climate change and extreme weather has an extreme impact on data centers",
  "article": [
    "The global data center industry is set to grow exponentially, with the International Data Corporation (IDC) estimating that over 175ZB of data will be stored by 2025. Sustainability and environmental considerations are priorities amid this growth, particularly as climate change-related extreme weather poses challenges for facilities worldwide.",
    "Ambitious climate change targets are being rolled out by governments and businesses to reduce emissions and create a more sustainable global economy. With a critical industry like the data center market, promoting sustainability and implementing renewable facilities is important to reaching this. In fact, many key players have set themselves net zero and even carbon neutrality goals for the future.",
    "The data center climate change challenge is not merely to become ‘greener’, however. Extreme weather patterns have a grave effect on facilities worldwide, posing a multitude of issues for the servers, critical power and cooling infrastructure. Should these not be mitigated ahead of time, providers and operators risk huge costs and reputational damage from downtime or construction delays.",
    "Grid supply failure is a prominent risk to data centers and most have backup generators in place for situations where power is lost. These are designed for short power cuts, so if grid supply is lost for prolonged periods, further temporary power may be required to provide more reliable backup power than the built-in backup generators.",
    "As could be seen last year in North America, forest fires, tornadoes and other serious storms have been becoming more frequent and devastating with climate change. For data centers, such weather can cut off grid supply, meaning backup power has been needed for much longer periods. While onsite generation can be used for a short period of time, more extensive temporary backup power may be required.",
    "Temporary power solutions can provide a reliable replacement for the grid while power is restored. Rental equipment can be more cost effective than implementing more extensive permanent backup generators, while hybrid solutions using energy storage and generators can reduce emissions. Employing plans for more extensive temporary backup generation for these periods of stormy weather are therefore vital to reduce the potentially costly effects of extreme weather.",
    "Flooding and heavy rain also causes grid supply issues for data centers, yet it can also damage server equipment and critical cooling and power infrastructure. Especially for data centers in the Asia Pacific (APAC) region where heavy rain is commonplace, most operators have planning in place should their data center become flooded. Often, as part of contingency planning, companies are on hand to enact flood recovery procedures for removing surface water.",
    "A study by the University of Reading found that climate change is set to increase the likelihood of flood and torrential rain in Europe, particularly in key data center regions like the UK, Germany and other parts of Northern Europe. For operators and providers who may be experiencing torrential rain and flooding for the first time, these procedures may not be on standby. It is therefore vital that they have plans in place to deal with flooding, and the effects it has on power and equipment, as quickly as possible.",
    "This includes where critical temporary equipment can be introduced in the event that flooding incapacitates parts of buildings. For instance, if a basement plant room with cooling equipment and power generation becomes flooded, there needs to be connection points higher up in the building so that supplementary generators or coolers can be introduced while water is removed. These considerations must be made in the contingency planning stage for any facility so that downtime and its ensuing costs are avoided.",
    "Rising temperatures also account for increases in humidity across the globe as a hotter atmosphere allows for more water vapour to be absorbed. According to the Met Office, relative humidity – the percentage of moisture in the atmosphere – is rising particularly in high latitude regions such as India, a key data center hub for APAC. Not only can humidity damage computer equipment, but it can also cause persistent mould and damp issues that damage the building’s fabric and pose a health risk to occupants working there.",
    "This is especially challenging in the construction phase of a data center and can come from a variety of sources. Whether from humid air outside or from building materials and equipment brought into the site, if not dealt with correctly, costly problems can persist in the future. When relative humidity is above 60%, building materials can be damaged irreparably, concrete and paint will not set or dry correctly, and damp and mold issues can begin to take hold early on. Costs for replacing martials and further labour can then stack up, while delays to projects with strict deadlines may end in further spending and even fines.",
    "A common mistake is that introducing large amounts of heat will dry a space, where as in actuality, this expands the atmosphere allowing for the energised water particles to be drawn into the air. When the heat is removed, the moisture returns. To bring the relative humidity to optimum, a combination of heat, air movement, and moisture removal with a dehumidifier is needed. To ensure a space is correctly dehumidified, providers can consult a temperature and moisture control specialist such as Aggreko, who use environmental conditions monitoring to reach optimum conditions safely.",
    "Many data center facilities will be reaching a working age of over 15 years and as the sector grows and will have had more equipment installed to keep up with demand. While in their initial working life the critical cooling and powering infrastructure may have been able to keep up with equipment levels with the server halls, longer serving data centers are now starting to see the strain.",
    "In the UK and continental Europe, the increasingly hot summers that have been recorded in the past few years are furthering pressure on the cooling capability of ageing facilities. Server room temperature can be dangerously high and cause massive outages when the older cooling system is unable to keep up. In the likely event that temporary cooling is required, connections points need to be available on mechanical coolers or cooling towers, to allow equipment to be introduced immediately. This is another aspect that must be picked up and implemented as part of a contingency plan.",
    "This isn’t necessarily a problem limited to older facilities, but can also affect newer facilities using free cooling. Free cooling is an effective way to control temperature, however it can often struggle when temperatures remain high over prolonged periods. Europe has seen extended spells of hot weather which leaves such data centers at risk. If temperatures remain higher than 25oC over a prolonged period, it can cause facilities to overheat, meaning temporary equipment may be required. In these instances, there must also be established connection points for supplementary cooling for quick integration when hot weather strikes.",
    "Climate change will continue to affect data centers globally in the coming years and planning for extreme weather will allow providers and operators to mitigate any delays, costs, and reputational damage from downtime or construction disruption. Some of the impact brought by storms, flooding, extreme heat and even forest fires are unavoidable. However, there are processes and temporary equipment available that can be quickly implemented to alleviate issues when such plans are in place.",
    "As different regions face these challenges, operators and providers can consult experts in contingency planning and temporary critical equipment.",
    "In the midst of supply chain issues and delays caused by Covid-19, this local expertise and equipment can keep data centers operational and construction and maintenance on track. At a time where digital infrastructure is keeping the world moving, downtime is not an option and so it pays to be prepared for anything, especially with uncontrollable variables such as weather in the mix."
  ],
  "headers": {
    "3": "Power cuts",
    "6": "Keeping dry",
    "9": "Humidity is rising",
    "12": "Heating up aging data centers",
    "15": "Planning for anything"
  },
  "links": {}
}