{
  "source": "https://www.techradar.com/news/sony-xperia-1-iii-shown-off-from-all-angles-in-case-renders",
  "title": "Sony Xperia 1 III shown off from all angles in case renders",
  "category": "phones",
  "updated": "2021-04-05T13:05:08Z",
  "author": "james-rogerson",
  "summary": "Along with the Sony Xperia 10 III",
  "article": [
    "It looks likely that the Sony Xperia 1 III will be announced on April 14, but despite that date fast approaching, we haven’t actually seen much of it yet. Now though, some case renders have given us a close look at the likely design.",
    "Olixar (a case maker) has listed a transparent case for the Sony Xperia 1 III on its site, and the accompanying images show the phone off from a variety of angles, highlighting the phone’s rumored periscope camera, alongside other lenses.",
    "You can also see a tall, flat, likely 21:9 screen with a front-facing camera in a bezel at the top, a 3.5mm headphone port on the top edge, and a shortcut key on the right edge, along with the side-mounted fingerprint scanner and volume rocker.",
    "That key and some camera tweaks aside, it’s a design that looks a lot like the Sony Xperia 1 II, as well as looking near identical to previously leaked images. So this is probably more or less what you can expect from the Sony Xperia 1 III – especially as there’s a fair chance Olixar had access to the design early, in order to make this case.",
    "And it’s not just the Sony Xperia 1 III that Olixar has shown off, as the company also has a case for the Sony Xperia 10 III, showing a triple-lens camera on the back, a tall, narrow screen on the front with a bezel above it, and a design that’s seemingly identical to the Sony Xperia 10 II. This is a design that we’ve also seen leaked previously.",
    "We would of course take these images with a pinch of salt for now, but one or both of these phones will likely be unveiled on April 14, so we should know how accurate these renders are soon.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Sony Xperia 1 III": "https://www.techradar.com/reviews/sony-xperia-1-iii",
    "on April 14": "https://www.techradar.com/news/sony-xperia-1-iii-gets-possible-launch-date",
    "listed a transparent case": "https://www.olixar.com/ultra-thin-sony-xperia-1-iii-case-100-clear",
    "rumored periscope camera": "https://www.techradar.com/news/sony-xperia-1-iii-specs-and-features-leaked-and-theyre-impressive",
    "Sony Xperia 1 II": "https://www.techradar.com/reviews/sony-xperia-1-ii-review",
    "previously leaked images": "https://www.techradar.com/news/samsung-galaxy-s21-releases-today-but-sony-xperia-1-iii-could-beat-its-cameras",
    "has a case for the Sony Xperia 10 III": "https://www.olixar.com/ultra-thin-sony-xperia-10-iii-case-100-clear",
    "Sony Xperia 10 II": "https://www.techradar.com/reviews/sony-xperia-10-ii",
    "leaked previously": "https://www.techradar.com/news/sony-xperia-10-iii-renders-and-specs-shared-by-a-leaker",
    "GSMArena": "https://www.gsmarena.com/olixar_shows_off_sony_xperia_1_iii_and_10_iii_case_designs_and_the_phones_themselves-news-48512.php"
  }
}