{
  "source": "https://www.techradar.com/news/bowsers-fury-shows-nintendo-can-teach-an-old-plumber-new-tricks",
  "title": "Bowser’s Fury shows Nintendo can teach an old plumber new tricks",
  "category": "gaming",
  "updated": "2021-03-13T15:00:01.779Z",
  "author": "rhys-wood",
  "summary": "New world, new Bowser, fresh everything",
  "article": [
    "Nintendo is a company that works in mysterious ways. Its peerless creativity, polish and attention to detail are constantly at odds with baffling corporate decisions like limited-time releases, ditching the Virtual Console and using the same outdated netcode for online play for well over a decade.",
    "Still, when Nintendo’s firing on all cylinders, it shows that its approach to game design truly is timeless. Enter Bowser’s Fury, a full-fledged expansion to Super Mario 3D World, bundled in with the Nintendo Switch port of the overlooked Wii U classic.",
    "Bowser’s Fury differs tremendously from Super Mario 3D World in a variety of ways, but most impressively shows how the 3D Mario formula can successfully translate to a truly open world setting.",
    "Bowser’s Fury starts predictably enough, with Mario finding himself falling into an unknown realm called Lake Lapcat (that’s still somehow populated with recognizable Mushroom Kingdom denizens) where Bowser is once again running amok.",
    "It’s not the same old goofball Bowser we’re used to seeing, though, as the king of the koopas has undergone a monstrous transformation. He’s now the size of a skyscraper, and looking far more threatening than he’s ever done before.",
    "It’s not long before we run into Bowser Jr. who explains to Mario that something nefarious has, obviously, happened to his dad. Mario’s skeptical at first, naturally, but the two form an unlikely alliance as they seek to return Bowser to his original form.",
    "From there, familiar Mario platforming hijinks ensue, but there’s a few twists to keep the formula fresh. For one, the world is almost fully open and explorable, differing from past games which separated levels via hubs, paintings or portals.",
    "As such, you can see the vague shapes of future levels you’ll be traversing in the far distance, leaving the player to wonder: ‘ooh, what’s that all about?’ Strangely, though, the open world is far from the most impressive thing about Bowser’s Fury. That lies in how the game approaches the titular baddie himself.",
    "See, Bowser isn’t just some one-and-done boss this time around. Instead, he’ll make regular appearances on the open world map based on an invisible timer. The only indication for when to anticipate his arrival is his massive shell, which slowly spins and emerges from the sludgy waters he resides in.",
    "Bowser’s timely appearances bring to mind Outer Wilds’ ingenious use of the sun to determine how much time you have left on your current run, or The Legend of Zelda: Majora’s Mask’s iconic moon that slowly plummets onto the game world over the course of a few short days.",
    "It all sounds very exciting, but the important thing is that Nintendo absolutely nails the concept when put into practice. You’d think that Bowser constantly showing up to ruin your day would drag down Bowser’s Fury’s pace, but in actuality the opposite happens.",
    "Bowser’s appearances can grow predictable, yet you’re never entirely prepared for them. If you’re smack in the middle of a platforming challenge, Bowser showing up to pepper you with falling fireballs and magma beams keeps you on your toes. It also means there’s a chance your second run through an area might not be quite the same as your first.",
    "There are also hidden secrets that can only be accessed when Bowser is in full-on ‘Fury’ mode, meaning there’s an opportunity to use his rage to your advantage, too.",
    "It gets better. Remember the Super Bell from Super Mario 3D World? That returns in Bowser’s Fury, but as is the running theme for the expansion, there’s a big twist - literally. A giant version of the Super Bell becomes available at certain points of progression. This makes Mario grow to a comparable size to Bowser, and the two can go head-to-head Godzilla-style.",
    "You’ll want to take these opportunities as soon as they’re available, too. Bowser’s never too hard to deal with, but by getting him to retreat, you can explore the finer points of the map without the worry of him showing up again - at least for a little while.",
    "Bowser’s Fury might only be a bite-sized adventure compared to Super Mario Galaxy, Super Mario Odyssey and the like, but the most exciting thing about it is how it could be signaling what we can expect from 3D Mario titles in future.",
    "I see Bowser’s Fury as a testing ground for Nintendo - a smaller (but still loaded with things to do) map being used as a proof of concept as a way to both sweeten the deal of a port (remember that Bowser’s Fury is bundled with Super Mario 3D World on the Switch) and as a means to try out a fully connected open world for the future of the Mario series.",
    "Bowser’s Fury already stands on similar footing to games like Super Mario Odyssey and Super Mario Sunshine, despite its relatively small scale. Ironically, though, it’s arguably the most ambitious Mario title for some time, and shows how future Mario titles can benefit from and build upon the open-world formula present in Bowser’s Fury."
  ],
  "headers": {
    "3": "Bowser's delight",
    "10": "Extra spicy platforming",
    "15": "What's next for Mario?"
  },
  "links": {
    "limited-time releases": "https://www.techradar.com/news/psa-super-mario-3d-all-stars-wont-be-available-on-nintendo-switch-after-today",
    "Virtual Console": "https://www.techradar.com/news/nintendo-switch-online-is-failing-fans-on-its-retro-games",
    "Bowser’s Fury": "https://www.techradar.com/reviews/super-mario-bros-3d-world-bowsers-fury-review",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Outer Wilds": "https://www.techradar.com/news/gaming/outer-wilds-is-a-game-that-asks-what-if-you-only-had-20-minutes-to-live-1288956",
    "The Legend of Zelda: Majora’s Mask’s": "https://www.techradar.com/news/legend-of-zelda-remake-developer-is-hiring-for-a-mysterious-new-project"
  }
}