{
  "source": "https://www.techradar.com/news/this-futuristic-vr-tech-could-be-a-game-changer-for-virtual-reality-headsets",
  "title": "This futuristic VR tech could be a game-changer for virtual reality headsets",
  "category": "gaming",
  "updated": "2021-04-08T10:54:24.639Z",
  "author": "axel-metz",
  "summary": "Crystal clarity",
  "article": [
    "A company building light-field display technology for mixed reality headsets has teased the impressive performance of its latest prototype – and it could be a game-changer for VR.",
    "In a new promotional video, Swiss manufacturer CREAL demonstrates a headset capable of focusing at long distances and rendering high resolution imagery up close, marking a leap forward for mixed reality technology which has been hampered by less-than-clear visual fidelity.",
    "It’s worth noting that CREAL doesn’t produce its own standalone headsets, rather a specific type of light-field display that it hopes will be adopted by the likes of Oculus and Sony for its PSVR 2 headset. Given that this technology is capable of generating imagery that accurately represents how we see light from the real world, we don’t expect it’ll be long before we see it integrated into mass-market VR products.",
    "According to CREAL, light-field displays support both focus mechanisms of the human visual system – vergence (stereo overlap) and accommodation (individual eye focus). This might sound complex, but essentially means that its new technology can allow VR headsets to focus at any depth, while most on the market today can only operate at a fixed focal depth.",
    "The above video demonstrates how CREAL’s light-field technology allows the headset to shift focus from one part of the scene to the other, much like the human eye. It also won’t rely on the eye-tracking technology of existing headsets to determine that focus, but will instead be capable of focusing at any depth, at any time – a sort of continuous camera running in the background.",
    "As well as enabling dynamic focus, though, light-field technology also makes virtual imaging much sharper than has been previously possible. CREAL says its display runs at 240Hz and is “approaching retinal resolution” – which marks a dramatic improvement over even the best commercially-available headsets on the market right now, like the Oculus Quest 2.",
    "As you can see from the company’s prototype design, the improved capabilities of light-field technology mean the headset itself appears far larger than existing models. It’s essentially a yellow-tinged brick for the face, at this point.",
    "But CREAL says it’s confident of shrinking the technology to allow for a more reasonably-sized, consumer-focused headset – and it’s set a target of 2022 to do so. That could mean the next generation of VR headsets may benefit from these potentially groundbreaking light-field displays – though maybe not as soon as the Oculus Quest 3 releases.",
    "What’s more, the company plans to adapt the technology to be implemented into smaller AR products, so the likes of the Apple Glasses may also become beneficiaries of CREAL’s breakthrough.",
    "For once, then, the path is looking a little clearer for the future of mixed reality."
  ],
  "headers": {
    "6": "Goodbye yellow brick load"
  },
  "links": {
    "CREAL": "https://www.creal.com/",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses"
  }
}