{
  "source": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-and-rtx-3070-ti-already-spotted-in-razer-pcs",
  "title": "Nvidia GeForce RTX 3080 Ti and RTX 3070 Ti already spotted in Razer PCs",
  "category": "computing",
  "updated": "2021-05-24T10:23:04Z",
  "author": "matt-hanson",
  "summary": "More evidence emerges",
  "article": [
    "Yet more evidence has emerged that suggests we could be getting two new powerful graphics cards from Nvidia – the GeForce RTX 3080 Ti and RTX 3070 Ti – this time from an apparent slipup from Razer.",
    "As Hothardware reports, a Twitter user spotted that a Chinese website was offering ready-made gaming PCs with the as-yet-unannounced Nvidia GeForce RTX 3080 Ti and RTX 3070 Ti graphics cards as options.",
    "The web page offering the desktop PC has since been taken down, but Twitter user @harukaze5719 took a screenshot, which you can see below.",
    "According to Hothardware, the site was offering a range of specifications, including AMD Ryzen 5000 series processors, 16GB of RAM and SSD storage.",
    "While this could just be a mistake by a Chinese retailer, the amount of evidence now swirling about an imminent RTX 3080 Ti and 3070 Ti launch means we’re more inclined to believe that the listings were real, and the retailer accidentally put them live.",
    "For a start, it would be unlikely for the retailer to pluck product names out of the air as placeholders unless it had a good idea that they were coming.",
    "The website also listed the RTX 3080 Ti as having 12GB of memory, and the 3070 Ti coming with 8GB of RAM. Again, this would be weird information to make up, and it tallies with other rumors we’ve heard about the GPUs.",
    "Attention is now turning to Nvidia’s keynote address at Computex 2021, which will be held on June 1 at 1AM EST / 6AM BST / 3PM AEST. We’ve heard rumors that Nvidia will announce the RTX 3080 Ti and 3070 Ti then, which means we won’t have long to wait.",
    "It’s looking increasingly like that we’ll see some exciting new GPUs from Nvidia, then. While it still remains difficult to get hold of existing GPUs, we hope Nvidia has a plan in place for getting any upcoming GPUs into the hands of gamers, rather than scalpers and miners."
  ],
  "headers": {
    "4": "Should we get excited?"
  },
  "links": {
    "GeForce RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "Hothardware reports": "https://hothardware.com/news/geforce-rtx-3080-ti-rtx-3070-ti-already-available-in-razer-desktop-pc-preorders",
    "Computex 2021": "https://www.techradar.com/news/computex-2021",
    "Nvidia will announce the RTX 3080 Ti and 3070 Ti then": "https://www.techradar.com/news/nvidia-geforce-rtx-3080-ti-again-rumored-for-early-june-launch-with-rtx-3070-ti-to-follow"
  }
}