{
  "source": "https://www.techradar.com/news/best-true-crime-shows-on-netflix",
  "title": "The best true crime shows on Netflix",
  "category": "entertainment",
  "updated": "2021-04-10T12:00:41Z",
  "author": "jon-o-brien",
  "summary": "From Tiger King to Making a Murderer",
  "article": [
    "Not content with turning its entire subscriber base into couch potatoes, Netflix also appears to have transformed the majority of us into armchair detectives. Previously dominated by amateurish re-enactments, bone-dry talking heads and countless zoom-ins of the same photos, the true crime genre has now become the kind of cinematic, highly engrossing TV that starts conversations at the watercooler (or it did pre-Covid, anyway).",
    "From wild tales of cult life to a whole host of unsolved mysteries, here’s a look at 10 original series which, rightly or wrongly, have made real-life criminality must-see entertainment.",
    "Where else could we start than the genesis of the streaming generation’s true crime fixation? What’s interesting is how much Netflix trusted viewers to commit to the oft-exasperating case of Steven Avery, a man who after serving an 18-year jail term for crimes he didn’t commit, then finds himself convicted of the deadliest.",
    "You needed to invest 10 solid hours in its twists and turns, with much of its screen time dedicated to lengthy, uninterrupted courtroom and police interview footage that was arguably far more damning to those purportedly on the right side of the law. Eschewing the usual flashy tropes, Making a Murderer simply lets the evidence, or lack thereof, do the talking.",
    "While some of Netflix’s particularly harrowing true crime stories can lean towards the exploitative (see The Vanishing at the Cecil Hotel), this seven-parter maintains a dignified respect for its tragic subject, murdered nun Catherine Cesnik. Director Ryan White jumps between late ‘60s Baltimore and the present day to investigate her still-unresolved case, uncovering a web of disturbing decades-old secrets along the way. Linking to a much wider picture of systemic abuse, the expertly researched The Keepers is also that rare investigative series that admirably puts the focus more on the victims than the perpetrators.",
    "In light of all the memes, fancy dress inspirations and Dancing with the Stars appearances, it’s easy to forget that there were several serious offenses at the heart of Netflix’s biggest true crime phenomenon: animal abuse, arson, attempted murder (and those are just the ones beginning with ‘A’).",
    "Indeed, although Tiger King often invited us to laugh at the mulleted, polyamorous, country-singing zookeeper Joe Exotic, and his “hey, all you cool cats and kittens” nemesis Carole Baskin, it could also get very sinister very quickly. Premiering just as everyone needed some escapism from the real world, it’s little wonder that such unadulterated chaos became a lockdown hit.",
    "As with Tiger King, this outlandish four-part series proves that sometimes even the most imaginative scriptwriters can’t compete with real life. Here, a mild-mannered pizza delivery guy holds up a bank with a bomb collar around his neck, only for it to detonate after a live TV stand-off with police.",
    "Was he coerced or a conspirator? Jail-cell interviews with a suspected serial killer and the discovery of a macabre treasure hunt don’t make things any clearer. However, they do help to unravel a deranged plot that was evil and diabolical, but far from genius.",
    "Documenting a chapter of recent, largely untold American history, Wild Wild Country is a sprawling, morally ambiguous saga about the machinations of a cult that infiltrated 1980s Oregon. Political fraud, arson and even bioterrorism were just some of the methods the Rajneeshees adopted to try to gain political power before their movement spectacularly imploded.",
    "Jaw-dropping archival footage taken by both devotees and outsiders help to explain the reasons leader Osho and his disciples made such an impact. But the recollections from deceptively terrifying ex-spokeswoman, and real brains of the whole operation, Ma Anand Sheela, stick longer in the memory.",
    "From its clickbaity title to its finger-pointing finale, Don’t F*** with Cats is undoubtedly at the more sensationalist end of Netflix’s true crime spectrum. Although, to be fair, it would be difficult for anyone to tackle such a lurid subject matter – fame-hungry kitten killer turns to homicide while being tracked down by online warriors – with much restraint.",
    "The three-time BAFTA nominee sure isn’t for the faint-hearted, and you’ll never hear John Lennon’s “Happy Xmas (War Is Over)” in quite the same way again. But once you’ve stopped covering your eyes with your hands, you’ll be gripped by an unimaginable story that highlights both the perils and the potential of internet vigilantism.",
    "Essentially America’s Hollywoodised answer to Crimewatch, Unsolved Mysteries intrigued and terrified audiences equally back in the late ’80s, with Robert Stack’s solemn narration only adding to the heebie-jeebie vibes.",
    "Now dedicating each episode to just one case, Netflix’s host-free reboot is able to dig much deeper into the series’ wheelhouse of unexplained deaths, missing persons and shocking murders, inspiring countless Reddit theories and several credible new leads in the process. We could have done without the obligatory silly UFO/ghost stories. But otherwise, this engaging revival of the true crime genre’s daddy is the closest the streaming service gets to public service broadcasting.",
    "A true David vs. Goliath tale, The Pharmacist initially centers on grieving father Dan Schneider’s dogged pursuit to find out who killed his drug-addicted son. But this highly personal quest soon veers into something far more wide-reaching, when he uncovers a scandal relating to America’s opioid epidemic.",
    "Utilizing the exhaustive audio and video footage the amateur investigator compiled during his quest, the miniseries impressively manages to compel from both angles. And although Schneider’s obsessive nature isn’t appreciated by everybody, including the man’s own family who are desperate to move on with their lives, his efforts are never anything less than awe-inspiring.",
    "Produced by a team of Academy Award-winning documentarians, this sobering and frequently infuriating nine-parter provides a damning indictment of the United States judicial system. Highlighting the work of the Innocence Project, the series explores the non-profit’s attempt to overturn eight serious convictions, and how everything from police coercion to pseudoscience can heavily influence the choice between freedom, incarceration and even death.",
    "The Innocence Files isn’t an easy watch, but it’s a vital one that not only shows just how stacked the odds are against the underprivileged, but demands this to change.",
    "A seemingly unremarkable grandfather living in Cleveland is accused of being Ivan the Terrible, a WWII concentration camp guard who sent nearly 30,000 people to their death. A case of mistaken identity, or a final chance for survivors to receive some long overdue justice? That’s one of many questions posed in this thought-provoking deep dive into the case of John Demjanjuk.",
    "The Devil Next Door can’t provide many clear-cut answers. But with its substantial use of courtroom testimonies, newsreel footage, and remarkably candid interviews with both the prosecution and the defense, it gives audiences sufficient resources to make up their own minds."
  ],
  "headers": {
    "2": "Making a Murderer",
    "4": "The Keepers",
    "5": "Tiger King",
    "7": "Evil Genius: The True Story of America's Most Diabolical Bank Heist",
    "9": "Wild Wild Country",
    "11": "Don’t F*** With Cats: Hunting an Internet Killer",
    "13": "Unsolved Mysteries",
    "15": "The Pharmacist",
    "17": "The Innocence Files",
    "19": "The Devil Next Door"
  },
  "links": {}
}