{
  "source": "https://www.techradar.com/news/windows-10-update-will-give-the-settings-panel-a-much-needed-overhaul",
  "title": "Windows 10 update will give the settings panel a much-needed overhaul",
  "category": "computing",
  "updated": "2021-06-07T17:33:53Z",
  "author": "anthony-spadafora",
  "summary": "Colorful icons and additional options are coming to Microsoft's updated Settings app",
  "article": [
    "Microsoft's upcoming Sun Valley update for Windows 10 will give the operating system's settings panel a complete overhaul with new colorful icons and a proper dark mode.",
    "The software giant first introduced its modern settings menu over eight years ago in Windows 8 though at the time it was known as “PC settings”. With the release of Windows 10 in 2015, the PC settings app was renamed to “Settings” and included more options that had previously been exclusive to the operating system's Control Panel.",
    "While Microsoft had originally said that it would eventually migrate all of the options in Control Panel to Settings once the app was fully developed, the software giant instead moved a few settings each year as opposed to doing so all at once.",
    "As reported by Windows Latest, the Settings app will be getting a major upgrade with the release of Microsoft's Sun Valley update this fall that will be based on the company's new design language.",
    "Ahead of its next big Windows 10 update, Microsoft is working on new icons for some of the core options within its Settings app to make them stand out a bit more. The updated app will also feature a reorganized layout and more colorful icons.",
    "Just like with Control Panel, the Settings app will also be getting a navigation menu on the left side. This will make it easier for users to find and access primary options such as Updates & Security, Personalization, Bluetooth and more. These options will also be visible when users navigate between pages using the app.",
    "The updated Settings apps will also give users more options when it comes to customizing Windows 10. For instance, Microsoft is working on adding new settings pages to the app that will allow users to personalize their touch keyboard by changing the size of its keys, colors and multitasking controls. Additionally, a new feature in the multitasking settings page will make it possible to have separate virtual desktops for each monitor when using multiple monitors.",
    "While things could change somewhat before the release of Microsoft's Sun Valley update, it is still not clear as to whether or not the company plans to do away with Control Panel entirely by moving all of its options to the Settings app or if Control Panel and Settings will continue to exist side by side.",
    "Via Windows Latest"
  ],
  "headers": {
    "4": "Settings app redesign"
  },
  "links": {
    "Sun Valley": "https://www.techradar.com/news/windows-10-21h2-update",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Control Panel to Settings": "https://www.techradar.com/news/microsoft-begins-killing-off-the-control-panel-in-windows-10",
    "reported": "https://www.windowslatest.com/2021/06/07/windows-10-is-getting-a-brand-new-settings-app-with-sun-valley-update/",
    "new design language": "https://www.techradar.com/news/windows-10-will-get-a-revolutionized-new-look-according-to-microsoft",
    "virtual desktops": "https://www.techradar.com/best/virtual-desktop-services",
    "Windows Latest": "https://www.windowslatest.com/2021/06/07/windows-10-is-getting-a-brand-new-settings-app-with-sun-valley-update/"
  }
}