{
  "source": "https://www.techradar.com/news/theres-a-new-cheap-hisense-4k-tv-out-for-black-friday-but-not-everyone-can-get-it",
  "title": "There's a new cheap Hisense 4K TV out for Black Friday – but not everyone can get it",
  "category": "televisions",
  "updated": "2021-11-17T17:21:15Z",
  "author": "rhys-wood",
  "summary": "The Hisense U6GR ULED TV is now on sale",
  "article": [
    "Over the past few years, Hisense has been a pioneer in offering fantastic 4K TVs at aggressively competitive prices. That looks to be no different with the recently launched Hisense U6GR ULED TV, available now to buy in the US.",
    "The catch is that not everyone will be able to buy Hisense's latest TV. It's currently only available for purchase at Costco, meaning that you'll need to be a Costco member in order to purchase the new TV.",
    "The Hisense U6GR ULED TV launches in 55-inch and 65-inch variants. The former costs $549 at Costco, while its larger model will run you $749. Interestingly, the TV is currently listed as a Black Friday deal, meaning that the current price tag could well be a discount. We'll find out on November 29 when, according to the listing, that price looks like its set to change.",
    "When it comes to specs, the U6GR sounds like what we've come to expect from Hisense. Despite being a mid-range brand, the company typically doesn't skimp on quality.",
    "The U6GR features Hisense's bespoke ULED technology, offering a vividly colorful panel that looks fantastic for the price range. The TV also offers support for HDR10 and Dolby Vision HDR alongside Dolby Atmos spatial audio.",
    "Like past Hisense TVs, the U6GR also features Roku TV as its operating system, which we love for its responsiveness and robust collection of streaming apps installed right out of the box, including Netflix, Apple TV Plus and Prime Video.",
    "If you'd love the Hisense U6GR ULED TV, but aren't willing or able to take out a Costco membership, don't fear. There are plenty of similar 4K smart TVs at similar price points from both Hisense and other manufacturers that you can buy elsewhere.",
    "Take Hisense's own R8F 4K ULED Roku TV. It's a slightly older model, but still offers much of the same features as the U6GR including its superb image quality, Dolby Atmos spatial audio, HDR and a surprisingly affordable price point. Like the U6GR, 55-inch and 65-inch variants exist at $499 and $699 respectively. Plus, as an older model, the R8F is definitely a TV to look at during the Black Friday and Cyber Monday deals period.",
    "For UK buyers, the Hisense U7QF QLED TV is is a similar price range, and is even featured in our best 4K TVs buying guide. Featuring a sharp 4K image and HDR10+ support, it can be bought at online retailers for £699 or £999 for the 55-inch and 65-inch variants respectively.",
    "Ultimately, what's important is that you have options whether you can get your hands on the new U6GR ULED TV or not. While you will need a Costco membership to buy Hisense's latest, you won't for other fantastic TVs in its repertoire, many of which are sure to have big discounts over Black Friday."
  ],
  "headers": {
    "6": "What should I buy if I can't get the Hisense U6GR?"
  },
  "links": {
    "Hisense": "https://www.techradar.com/news/should-i-buy-a-hisense-television",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "Costco": "https://www.costco.com/hisense-55%22-class---u6g-series---4k-uled-lcd-tv.product.100811412.html",
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "HDR10": "https://www.techradar.com/news/hdr10-vs-dolby-vision-heres-what-you-need-to-know-about-the-hdr-format-war",
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Prime Video": "https://www.techradar.com/reviews/audio-visual/av-accessories/amazon-prime-instant-video-1208342/review",
    "R8F 4K ULED Roku TV": "https://www.techradar.com/reviews/hisense-r8f-4k-ultra-hd-roku-tv",
    "Cyber Monday deals": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Hisense U7QF QLED TV": "https://www.techradar.com/reviews/hisense-u7qf-qled-tv",
    "best 4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "HDR10+": "https://www.techradar.com/news/hdr10-the-new-hdr-standard-thats-taking-a-leaf-out-of-dolbys-book"
  }
}