{
  "source": "https://www.techradar.com/news/amazfit-could-be-about-to-launch-a-new-sports-smartwatch-the-t-rex-pro",
  "title": "Amazfit could be about to launch a new sports smartwatch, the T-Rex Pro",
  "category": "wearables",
  "updated": "2021-01-26T10:07:07Z",
  "author": "cat-ellis",
  "summary": "Everyone walk (or run, or cycle) the dinosaur",
  "article": [
    "It looks like Amazfit is primed and ready to launch a successor to last year's Amazfit T-Rex – a tough sports watch designed to tackle the great outdoors.",
    "Eagle-eyed reporters at Gadgets & Wearables have spotted a new Federal Communications Commission (FCC) certification for a device called the Amazfit T-Rex Pro. It looks like the device was originally known as the T-Rex 2, but was renamed in December last year.",
    "This certification is necessary for the release of a new wireless device in the US, suggesting that the new watch will be released globally before long. This is an interesting move, since Amazfit (owned by Huami) often releases its devices in China before the rest of the world.",
    "Most of the information in the listing is confidential, but a label sample suggests that it will keep the same round face as the original T-Rex, and will have on-board GPS, automatic workout detection and music playback.",
    "Assuming it follows the same rugged design as its predecessor, it could be a more affordable rival to the likes of the tough Polar Grit X and Garmin Instinct – particularly if it's capable of mapping, which was one feature sorely missing from the first T-Rex",
    "It's been a busy few months for Amazfit, with the reveal of the GTS 2e and GTR 2e budget smartwatches at CES 2021 earlier in January, the unveiling of the GTS 2 Mini and Pop Pro in December, and the launch of the GTR 2 and GTS 2 in October – and the company shows no signs of slowing down.",
    "We'll keep you updated as soon as we know more about the new T-Rex, and will bring you a full review as soon as possible."
  ],
  "headers": {
    "5": "Far from extinct"
  },
  "links": {
    "Federal Communications Commission (FCC) certification": "https://fccid.io/2AC8UA2013",
    "a label sample": "https://fccid.io/2AC8UA2013/Label/Label-sample-rev01-5094442",
    "Polar Grit X": "https://www.techradar.com/reviews/polar-grit-x",
    "Garmin Instinct": "https://www.techradar.com/reviews/garmin-instinct-solar",
    "GTS 2e and GTR 2e": "https://www.techradar.com/news/amazfits-new-gts-2e-and-gtr-2e-cheap-smartwatches-are-official-and-coming-soon",
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "GTS 2 Mini and Pop Pro": "https://www.techradar.com/news/amazfit-reveals-new-gts-2-mini-and-pop-pro-smartwatches-with-impressive-specs",
    "GTR 2 and GTS 2": "https://www.techradar.com/news/amazfit-launches-two-new-stress-tracking-smartwatches-after-months-of-teasing"
  }
}