{
  "source": "https://www.techradar.com/news/amazon-kindle-could-get-a-brand-new-way-to-read-books",
  "title": "Amazon Kindle could get a brand-new way to read books",
  "category": "tablets",
  "updated": "2021-04-15T11:04:11Z",
  "author": "tom-bedford",
  "summary": "Amazon's Kindle Vella is here",
  "article": [
    "What do Arthur Conan Doyle, Charles Dickens and Jules Verne have in common? Those three authors, as well as countless others, found success through serializing their novels, and Amazon is now offering a way for people to do the same via its own platforms.",
    "Amazon Kindle Vella is a new platform run by the tech giant, that lets self-publishing authors serialize their works. This basically means they can stagger the release of chapters, to keep readers coming back for more.",
    "The first few 'episodes' of each story, as they're called, are free to read. Then, you can spend 'tokens', or the in-app currency, to buy more episodes - the cost is dependant on the word count. This can be a way for authors to hook their readers, then make money from their writing.",
    "It's not exactly clear how much you could make from Kindle Vella, but prices start at $2 for 200 tokens (which will get you about 20,000 words worth of stories) and go up to $15 for 1,700 tokens (or 170,000 words). Authors get half of whatever people spend on them - Amazon does share some royalty calculations which make it seem like revenue might not be huge, though.",
    "You can subscribe to stories to get notified when new entries are published, and award stories 'likes' and 'crowns' if you like them a lot - authors are even able to respond to readers, by leaving a note at the end of each episode, so it sounds like Vella could be great for authors creating a rapport with their readers.",
    "As the earlier prices suggest, Amazon's Kindle Vella platform is only available in the US to begin with. But that was the case for Amazon's Halo and Luna tech too, and at least the former of those got rolled out globally later - so if Vella is popular enough, perhaps we'll get to see it in more regions later.",
    "Something that might disappoint Kindle fans is that you can't actually use Kindle Vella on Amazon's line of ereaders - at launch, it can only be used online, or through the Kindle iOS app (nope, it's not on Android either).",
    "It sounds like the service would be a great fit for Kindle ereaders though: they're already quick to update if you download new books or need new magazines, and many find them great for reading, so people might be more disposed to spending money on new chapters if they've just been reading via a Kindle, than online or on an iPhone.",
    "Hopefully, then, we'll see Amazon Kindle Vella roll out on Kindle ereaders soon, either existing ones or the new models we're hoping to see in 2021.",
    "Whether you're a reader on Kindle, iOS, browser or another device, Vella is great to see though, as it's another way of budding writers getting the exposure and platform they otherwise wouldn't. Whether the low royalties will enable lots of writers to commit, though, remains to be seen - at least it's more than rival service WattPad, which only lets select authors monetize their works."
  ],
  "headers": {
    "6": "Kindle surprise"
  },
  "links": {
    "royalty calculations": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1182327758349695000&xs=1&url=https%3A%2F%2Fkdp.amazon.com%2Fen_US%2Fhelp%2Ftopic%2FG6F5YEPRLMKR3PV7%23unlockepisodes&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Famazon-kindle-could-get-a-brand-new-way-to-read-books"
  }
}