{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-changed-my-mind-on-a-second-viewing",
  "title": "Zack Snyder's Justice League changed my mind on a second viewing",
  "category": "entertainment",
  "updated": "2021-03-27T15:49:15Z",
  "author": "samuel-roberts",
  "summary": "Opinion: In some ways, anyway",
  "article": [
    "Like Batman v Superman before it, I can't wholeheartedly say that Zack Snyder's Justice League is a good film. It's kind of good… and I'm only coming around to that point of view having watched the four-hour movie twice during the past week.",
    "What's become complicated about the Snyder Cut is the fan movement around it, and how people are reacting to that. A cursory look into various hashtags associated with the movie reveal familiar elements of internet commenter culture – and that's something I'm generally happy to avoid.",
    "I think this has made it hard for some cultural commentators to take the movie seriously, which I sort of understand – although this evidently isn't the case for all critics. I was surprised the film achieved high-scoring reviews from The Telegraph and The Guardian, for example. But I don't think those reviews are entirely off the mark, after letting the movie sink in to my brain over the past seven days.",
    "Exactly like my relationship with Batman v Superman, my first negative reaction to this new cut has given way to an appreciation of what the film does get right. That doesn't mean I'm able to ignore its issues. I think Zack Snyder's Justice League has a few fundamental flaws: it is at least an hour too long, and despite more effort afforded to characterizing the CG villain Steppenwolf, he isn't much more compelling here than he was in the 2017 theatrical cut. These are fundamental problems to me, even if your mileage might vary.",
    "So here's what I liked following a second viewing, and why I believe this is firmly a better movie overall than the original theatrical cut – even if I still don't love it.",
    "As a character piece, this film is self-indulgent, with prolonged sequences introducing or reintroducing each hero before they team up. But I do think Snyder's version is pretty good at getting under the skin of most of its heroes, and encouraging you to root for them in a way you didn't watching the theatrical cut.",
    "It's like you get a micro-origin story for The Flash, Aquaman, Cyborg and Wonder Woman at the start of the movie, making up for the fact that many of these heroes hadn't previously debuted in the DC Extended Universe in full prior to this. Not all of Snyder's creative choices worked for me – the corny music that plays when Barry Allen (Ezra Miller) saves Iris West (Kiersey Clemons) from a traffic accident is one such example, though I love that scene otherwise – but I do think this movie is good at selling the fact that its characters have inner lives. The theatrical cut simply did not do this.",
    "And yes, Ray Fisher's Cyborg is the biggest beneficiary of Snyder's approach, here. I think Fisher gives a great performance in this role, even if I can see how Victor Stone's dour, body horror-infused origin might seem out of place to execs who are dying for their own cheery Marvel-style movies.",
    "The first half of this film is full of massive diversions, which is a problem I think Snyder could've solved by simply cutting a lot of scenes down. But the one advantage of the running time is that everyone gets their moment, even if the price you pay is waiting a full two hours to actually see the Justice League do their thing.",
    "This is mainly where my impression of the movie improved over my first viewing. Maybe it's because the film has been swimming through my head for a week, but I like that none of their origins feel like stories I've seen in a superhero movie before, and I've grown to like these characters a little more. And even if the existence of this cut is massively indulgent in general, it would have been a waste for people to miss out on some of the beautiful footage shot by cinematographer Fabian Wagner that help tell their story. That alone makes the Snyder cut worth excavating, to me.",
    "Still, this film accidentally introduces its own issues with characterization: none of Amy Adams' scenes in this cut feel like they make the most of the actress. She's a widow who now has no inner life after the death of Superman, which is a boring take on Lois Lane.",
    "Elsewhere, I think Snyder vastly improves the film's action action. It feels like these sequences have more breathing room, thanks to the runtime – and the ways in which the theatrical cut reconfigured the film's final fight with Steppenwolf in an abandoned city seem particular egregious next to the version seen here.",
    "I think the last set piece in this film is fantastic on a second viewing. Again, Snyder takes the time to give every character their big hero moment – and the film finally gets the big hero moment that the theatrical cut so badly needed, as Barry Allen travels back in time to stop Steppenwolf from merging the film's boring McGuffins, the Mother Boxes.",
    "The Snyder Cut is a fascinating artefact for showing how the studio lost faith in his vision: the way Superman was reintroduced by the theatrical cut was wildly different, and a misplaced effort to make things cheerier. Mostly serious sequences were peppered with jokes, a clear effect of uncredited replacement director Joss Whedon's work on the film.",
    "That said, Whedon's levity had some positive impact on the movie at times, and I miss a few of his better gags in this version. I know Snyder's fans won't agree with that – but I still think this cut could use more jokes.",
    "By the time I reached the end of this film for the second time, some occasionally bad visual effects aside, I felt certain I was looking at net gain overall.",
    "For better or worse, I think Snyder has a very clear perspective on the DC characters that goes beyond creating wise-cracking heroes in the MCU mold – although Justice League certainly has its own version of that in Ezra Miller's Barry Allen.",
    "I felt like I learned a lot about Snyder's perspective on comic book superheroes from a great New York Times interview published in the past week. \"[Batman v Superman is] the closest thing to a cult film that could exist at this level of pop culture. Am I a provocateur? A little bit. Is my job to make some pop-culture piece of candy that you eat and forget about the next day? Nah. I would rather [expletive] you up in a movie than make it nice and pretty for everybody.\"",
    "Snyder says he's purposefully made his films difficult; he compares Batman v Superman to his adaptation of Watchmen (a film I mostly like), in that his 2016 movie was meant to be 'deconstructionist' of its heroes. I'd argue the film wasn't all that successful at deconstructing Batman as a character, something that I feel like I've seen over and over again across different media – but I appreciate that he really does have a point of view.",
    "I feel the subsequent DC films that are supposed to be more 'fun' – such as Wonder Woman 1984 and Shazam! – actually lack that. They're instead working too hard to appeal to a broader audience, and end up feeling a little pacifistic.",
    "Snyder's films have teeth. He has Superman mutilate and beat Steppenwolf before Wonder Woman beheads the villain. This tone might not sit right with everyone, but I don't think the world needs any more superhero movies that ape what the MCU does. Snyder gets that, even if I'll never agree with some of his creative decisions as a filmmaker.",
    "Zack Snyder's Justice League: it's far from perfect, but there's definitely something about it.",
    "Zack Snyder's Justice League is streaming now on HBO Max in the US and Sky/Now in the UK."
  ],
  "headers": {
    "5": "Long character takes",
    "16": "A point of view"
  },
  "links": {
    "Batman v Superman": "https://www.techradar.com/news/with-zack-snyders-justice-league-nearing-release-how-bad-was-batman-vs-superman",
    "Zack Snyder's Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "New York Times interview": "https://www.nytimes.com/2021/03/14/movies/zack-snyders-rough-and-tumble-ride-with-justice-league.html"
  }
}