{
  "source": "https://www.techradar.com/news/darkside-hackers-say-they-just-want-to-make-money-following-pipeline-attack",
  "title": "DarkSide hackers say they just want to make money following pipeline attack",
  "category": "computing",
  "updated": "2021-05-11T10:21:34Z",
  "author": "mayank-sharma",
  "summary": "DarkSide promises to screen the targets in the future",
  "article": [
    "The DarkSide ransomware group responsible for shutting down one of the major fuel pipelines in the US has issued a press release claiming that it’s not political and only wants to make money without causing problems for society.",
    "The DarkSide ransomware targeted the Colonial Pipeline with the classic double-extortion attack late last week, making away with 100GB of data while encrypting Colonial’s network.",
    "Cybersecurity experts from Cybereason who have been tracking the DarkSide ransomware gang since it first appeared in August 2020, told TechRadar Pro that the group follows a Ransomware-as-a-Service (RaaS) business model, and hawks its tools and expertise to other cybercriminals.",
    "From its statement, it appears that the attack on Colonial Pipeline was conducted by one of its “customers” and in light of the fallout of the attack, DarkSide promises to screen all future attacks by its affiliates.",
    "“We are apolitical, we do not participate in geopolitics, do not need to tie us with a defined government and look for our motives. Our goal is to make money, and not creating problems for society. From today we introduce moderation and check each company that our partners want to encrypt to avoid social consequences in the future,” read a statement on DarkSide’s website.",
    "Experts believe the attack and the subsequent shutdown will have a negative impact on fuel prices, the longer it takes to unscramble Colonial’s network and restart the pipeline.",
    "In a new blog post analyzing the Colonial attack, Cybereason notes that DarkSide goes out of its way to appear virtuous, going as far as putting up a code of conduct for its criminal customers advising them against attacking certain targets, including hospitals, schools, nonprofit organizations, and even government agencies.",
    "In fact, in an earlier post, Cybereason notes that in the past DarkSide tried to donate around $20,000 in stolen Bitcoin to several charities, who later refused to accept the funds because of the dodgy benefactor.",
    "Via CNBC"
  ],
  "headers": {
    "5": "Cyber Robinhoods"
  },
  "links": {
    "shutting down one of the major fuel pipelines": "https://www.techradar.com/news/major-us-fuel-pipeline-taken-down-by-ransomware-attack",
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Cybereason": "https://www.techradar.com/news/massive-global-botnet-takes-advantage-of-microsoft-exchange-vulnerabilities",
    "CNBC": "https://www.cnbc.com/2021/05/10/hacking-group-darkside-reportedly-responsible-for-colonial-pipeline-shutdown.html"
  }
}