{
  "source": "https://www.techradar.com/news/the-five-best-dishes-to-make-in-a-blender-and-elevate-your-cooking",
  "title": "The five best dishes to make in a blender and elevate your cooking",
  "category": "appliances",
  "updated": "2021-07-10T07:00:00Z",
  "author": "carrie-ann-skinner",
  "summary": "This kitchen appliance is often overlooked for so many dishes",
  "article": [
    "Cooking the same meals every week can be a great way to save money, but can also lead to you getting bored easily. This is where one of the best blenders can come in handy - they can be used to create sauces, condiments, dips, cocktails and even desserts to bring new life to your dull dishes.",
    "Before you write us off as crazy, hear us out. We know you could splash out on one of the best Instant Pots, which offers a multitude of cooking methods, or one of the best air fryers so you can create healthier versions of treats like fries and chicken wings with less oil that a deep fat fryer.",
    "However, opting for a blender means you can make your own sauces and condiments such as hollandaise sauce, guacamole or mayonnaise, without much effort at all. You’ll be able to impress your friends and family, leaving them thinking you’ve morphed into a MasterChef contender. No longer will this kitchen appliance languish on your kitchen counter, only being used when you’re in the mood for a smoothie.",
    "If you like the sound of this, then we’d recommend you opt for a jug blender. While they take up a lot of space on your countertop and can be expensive, they’ll be able to create a wide array of dishes. Personal blenders, which are also known as smoothie makers and are offered by brands like Ninja and Nutribullet, may seem attractive because they’re cheaper but they’ll struggle to successfully prepare items such as mayonnaise, because unlike with a jug blender you can’t remove a section of the lid and add ingredients during blending.",
    "Want to get your hands on the best blenders now? Check out these great deals for some of the best on the market.",
    "Blenders have grown in popularity over the last few years, according to research by the Association of Home Appliance Manufacturers homes with blenders use them an average of 6.3 times per month, which is an increase on the 4.4 times per month in 2009.",
    "However, with a quarter of blender users admitting to making smoothies in them five times or more we’re clearly not getting the most out of them.",
    "In need of some inspiration on putting your blender to good use? We’ve rounded up five of the best dishes you can make in a blender.",
    "As we’ve mentioned already, more powerful blenders from the likes of Vitamix, KitchenAid and Breville are capable of crushing ice but always consult the instruction manual before adding ice to your blender - particular if the pitcher is made of thin plastic which can crack under the force of spinning ice cubes.",
    "To ensure as little strain on your blender as possible, allow ice cubes to rest on the counter for five minutes before adding to your blender, and add a small amount of water (this can be strained out after blending). Leave plenty of space for the ice to bounce around, and start off on the slowest setting, slowly increasing it over time. If possible, remove the lid during blending and redistribute the ice.",
    "If your blender is powerful enough to crush ice and has a glass pitcher, then it should also be able to grind coffee beans too. Avoid using a blender with a plastic pitcher for grinding coffee beans as there’s a chance the smell could linger and the beans could scratch the plastic pitcher.",
    "Just like when crushing ice, use small amounts - ¼ cup / 32g at a time, so the beans have room to move around and use a medium speed setting in small bursts to break them down - if you use the continuous blend function, the temperature inside the blender will increase and could start cooking the natural oils in the beans, which will result in a bitter flavor.",
    "It’s worth noting using a blender will create a coarse grind that is best suited to drip coffee makers rather than espresso machines."
  ],
  "headers": {
    "5": "What can you make in a blender?",
    "8": "Can you crush ice and grind coffee beans in a blender?"
  },
  "links": {
    "best blenders": "https://www.techradar.com/best/best-blenders",
    "best Instant Pots": "https://www.techradar.com/news/best-instant-pot-pressure-cookers-slow-cookers",
    "best air fryers": "https://www.techradar.com/news/best-air-fryer",
    "Association of Home Appliance Manufacturers": "https://blog.aham.org/facts-about-blenders-a-kitchen-staple/",
    "coffee makers": "https://www.techradar.com/best/best-coffee-machines"
  }
}