{
  "source": "https://www.techradar.com/news/iphone-11-deals-are-back-at-verizon-at-just-dollar10-a-month-this-weekend-ends-sunday",
  "title": "iPhone 11 deals are back at Verizon at just $10 a month this weekend - ends Sunday",
  "category": "phones",
  "updated": "2021-02-06T15:25:42Z",
  "author": "alex-whitelock",
  "summary": "Bag a bargain on a fantastic device",
  "article": [
    "iPhone 11 deals are back this week at Verizon, giving Apple fans a chance to score this older (but still amazing) device for just $10 a month this weekend.",
    "No trade-in's are required here, simply pick up the iPhone 11 at Verizon via the online store and with an unlimited plan by Sunday and you'll cut your bill down to just $10 a month. Spread over 24 months, that equates to a total saving of $359.99 overall - which isn't too shabby for an Apple flagship.",
    "If you prefer a larger device, then the iPhone 11 Pro also has the same deal on at Verizon this weekend - cutting the price right down from a staggering $33.33 a month to a measly $12 a month.",
    "Interestingly, iPhone 11 deals at Verizon have actually been pretty rare in 2021, which makes this opportunity all the sweeter. The carrier tends to focus very much on the newer iPhone 12 series - offering big trade-ins and buy-one get-one free promotions nearly every week. As you'd expect, these are fine deals, but they're expensive and not quite as readily available at these iPhone 11 deals specifically. You don't have to trade-in with these iPhone 11 offers, for example, or pay out for an unwanted plan on a second device.",
    "Subsequently, if you're not too fussed about getting that latest and greatest Apple device into your palms, and are happy to 'settle' for the iPhone 11 series (still an amazing phone), then these Verizon deals are looking pretty fine in our eyes. Remember though, you've got until Sunday to decide whether these are for you.",
    "Not in the US? See the best iPhone deals in your region just below.",
    "For more Apple goodness, see our main iPhone 11 deals page. Alternatively, see your options with the latest device at our iPhone 12 deals page."
  ],
  "headers": {
    "6": "iPhone 11 deals at Verizon this weekend"
  },
  "links": {
    "for just $10 a month": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1065150811344952300/https://www.verizon.com/smartphones/apple-iphone-11/",
    "measly $12 a month": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1081881045500776400/https://www.verizon.com/smartphones/apple-iphone-11-pro/",
    "big trade-ins and buy-one get-one free promotions": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1032712467639552400/https://www.verizon.com/smartphones/apple-iphone-12/",
    "iPhone 11 deals": "https://www.techradar.com/deals/iphone-11-deals-contracts",
    "iPhone 12 deals": "https://www.techradar.com/deals/apple-iphone-12-deals"
  }
}