{
  "source": "https://www.techradar.com/news/where-to-watch-the-expanse",
  "title": "Where to watch The Expanse: stream every season online",
  "category": "entertainment",
  "updated": "2021-03-26T10:57:32Z",
  "author": "john-faulds",
  "summary": "Must-see sci-fi drama available to stream on Prime Video",
  "article": [
    "The Expanse is pretty much the hottest thing in Sci-Fi right now, and you’d be hard-pressed not to have been caught up in the buzz surrounding this critically acclaimed series. If you haven’t watched a single episode, but feel like the time has come to rectify that situation, read on as we explain where to watch The Expanse.",
    "The Expanse, which is now up to Season 5, was originally developed by US cable channel Syfy, but the channel canceled the show after Season 3. That’s when Amazon Prime Video stepped in, producing Seasons 4 and 5, with Season 6 currently in production.",
    "The Expanse is set in a future where mankind has colonized the solar system and Mars has become an independent military power that rivals Earth for supremacy.",
    "Adding to the interplanetary tensions is an alliance of people known as the Belters who inhabit the asteroid belts at the far edges of the solar system, as well as the moons of Jupiter and Saturn. Long mistreated by the authorities on Earth and Mars, who view them as second-class citizens, the Belters struggle for more respect and independence.",
    "Now that you know what the series about, we’ll explain in more detail how and where to watch The Expanse.",
    "As the show is now an Amazon Original series, you’ll only be able to watch The Expanse with an Amazon Prime or Prime Video subscription. Amazon Prime is available in 19 different countries, including the US, UK, Australia, Canada, China, Japan, Belgium, Germany, and The Netherlands.",
    "Viewers in the UK also have the choice between a full Amazon Prime subscription or the slightly cheaper Prime Video-only subscription.",
    "Prime Video has a library of more than 26,000 movies and 2,700 TV shows, so once you’ve come to the end of The Expanse, you’ll have plenty more choices.",
    "If you find yourself abroad in a country but want to watch Amazon Prime as if you were at home, that's probably down to geo-blocking restrictions.",
    "Thankfully, help is at hand. Downloading a VPN will allow you to watch your favorite show no matter where you are, simply by changing your IP address to one that's back in your country of residence. Here's how to get started with this essential bit of streaming software.",
    "More from Amazon Prime Video:"
  ],
  "headers": {
    "5": "Where else can I watch I watch The Expanse online",
    "8": "How to watch The Expanse online outside of your country"
  },
  "links": {
    "Amazon Prime": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FThe-Expanse-Season-1%2Fdp%2FB08B49T8TZ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7848013650052194000-20",
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}