{
  "source": "https://www.techradar.com/news/this-top-mobile-browser-is-secretly-tracking-millions-of-ios-and-android-users",
  "title": "This top mobile browser is secretly tracking millions of iOS and Android users",
  "category": "computing",
  "updated": "2021-06-02T13:00:09Z",
  "author": "mayank-sharma",
  "summary": "UC Browser assigned unique IDs to users and even recorded websites visited in Incognito mode",
  "article": [
    "Cybersecurity researchers have found that a popular mobile web browseris sending records of websites visited by users, even in Incognito mode, to its servers.",
    "UC Browser is developed by UCWeb, which is a subsidiary of Chinese tech giant Alibaba, and is reportedly popular throughout many parts of the world, with over 500 million downloads on the Android Play Store alone.",
    "However, owing to the Indian government’s security concerns over Chinese apps, UC Browser remains banned in the country, where it had been one of the most popular mobile browsers.",
    "The issues with UC Browser were initially flagged by security researcher Gabi Cirlig, and have since been verified by two other independent researchers on behalf of Forbes.",
    "In a blog post, Cirlig explains that he was able to observe UC Browser’s irregular behavior by reverse engineering some encrypted data he noticed the browser was piping back to its servers. Thanks to his efforts he was then able to observe that every time he visited a website, the browser would encrypt and transmit the details about the visit.",
    "Cirlig has a knack for unearthing unscrupulous activities of Chinese browsers. Last year he found Xiaomi’s browser exhibiting a similar behavior and routing details about visited websites, even when in incognito mode, back to its headquarters.",
    "In UC Browser’s case, Cirlig noticed that along with the website the browser would also roll in the user’s IP addresses in the transmission to its headquarters.",
    "Even more worryingly, he shared that the browser would assign an ID number to each user, which could be used to track their movements across different websites.",
    "Although it isn’t clear exactly what Alibaba and its subsidiary are doing with the data, Cirlig told Forbes that “this kind of tracking is done on purpose without any regard for user privacy.”",
    "Interestingly, as of Tuesday morning, the English-language version of UC Browser is no longer listed on the Apple App Store, though it can still be downloaded from Google’s Play Store.",
    "Via Forbes"
  ],
  "headers": {
    "5": "Individual tracking"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "web browser": "https://www.techradar.com/best/browser",
    "remains banned": "https://www.techradar.com/news/india-bans-mi-browser-and-this-is-what-xiaomi-has-to-say",
    "Forbes": "https://www.forbes.com/sites/thomasbrewster/2021/06/01/exclusive-alibabas-huge-browser-business-is-recording-millions-of-android-and-iphone-users-private-web-habits/"
  }
}