{
  "source": "https://www.techradar.com/news/black-friday-gaming-deal-save-big-on-these-excellent-epos-headsets",
  "title": "Black Friday gaming deal: save big on these excellent EPOS headsets",
  "category": "gaming",
  "updated": "2021-11-29T21:07:06Z",
  "author": "vic-hood",
  "summary": "Discounts on headsets for PS5, Xbox Series X, Switch and PC",
  "article": [
    "Looking for an excellent Black Friday gaming headset deal? Then you're in luck, as we're seeing big discounts on a range of EPOS headsets at several retailers right now.",
    "These excellent Black Friday deals see EPOS gaming headsets getting some chunky discounts, ranging from the brand's more affordable headsets right up to its premium offerings - with many of the headsets having multiplatform compatibility, working across console and PC.",
    "In the US, the wonderful GSP 370 Wireless Gaming Headset has been discounted from $199.99 to $129.99 at Best Buy. Meanwhile, in the UK, the GSP 601 Gaming Headset has been reduced from £199 to £99 at Box. (Not in UK or US? Scroll down for deals in your region.)",
    "Looking for more video game deals? Then check out our dedicated Nintendo Switch Black Friday deals, PS5 Black Friday deals, and Xbox Series X Black Friday deals pages.",
    "US",
    "UK",
    "EPOS gaming headsets are some of the best around (especially its collaborations with Sennheiser), offering premium quality and top-notch sound. What's more, we find that many of these headsets can easily double up as headphones and their sleek look makes them excellent for work meetings and office use.",
    "Usually, EPOS headsets are quite pricy, so these Black Friday deals are a welcome sight - especially as the discounts are quite substantial.",
    "However, it's worth noting that, if any of the headset deals above tickle your fancy, you should check that it's compatible with the platforms you want to use it with.",
    "No matter where you live, you'll find all the lowest prices for EPOS gaming headsets from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "Today's best Black Friday EPOS gaming headset deals",
    "9": "More EPOS gaming headset deals",
    "10": "More Black Friday deals (UK)"
  },
  "links": {
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "$199.99 to $129.99 at Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-5176507017269122000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fepos-gsp-370-wireless-gaming-headset-with-a-closed-design-black%2F6425992.p%3FskuId%3D6425992&article_name=Black%20Friday%20gaming%20deal%3A%20save%20big%20on%20these%20excellent%20EPOS%20headsets&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fblack-friday-gaming-deal-save-big-on-these-excellent-epos-headsets",
    "£199 to £99 at Box": "https://track.webgains.com/click.html?wgcampaignid=138485&wgprogramid=13045&clickref=trd-us-3005325336056470500&wgtarget=https%3A%2F%2Fwww.box.co.uk%2F1000413-EPOS-Sennheiser-GSP-601-Gaming-Headset_3029849.html",
    "Nintendo Switch Black Friday deals": "https://www.techradar.com/black-friday/nintendo-switch-black-friday-deals",
    "PS5 Black Friday deals": "https://www.techradar.com/black-friday/best-black-friday-ps5-deals-2021",
    "Xbox Series X Black Friday deals": "https://www.techradar.com/black-friday/xbox-series-x-black-friday-deals-2021"
  }
}