{
  "source": "https://www.techradar.com/news/how-to-play-the-newly-resurfaced-tomb-raider-remake",
  "title": "How to play the newly-resurfaced Tomb Raider remake",
  "category": "gaming",
  "updated": "2021-01-07T16:04:25Z",
  "author": "axel-metz",
  "summary": "Raid tombs, old school-style",
  "article": [
    "A lost edition of Tomb Raider: 10th Anniversary has leaked online, and anyone can play it.",
    "The game was originally developed in 2006, when Core Design was working on a remake of the original Tomb Raider for Sony PSP. Despite being “almost finished” – that’s according to studio manager Gavin Rummery (via Eurogamer) – it was canned in favour of a cross-platform remake by Crystal Dynamics, later released as 2007’s Tomb Raider: Anniversary.",
    "Allegedly, the canceled project was picked up and reskinned into an Indiana Jones game, which also never saw the light of day following the shutting down of Core Design in 2010.",
    "Now, the assets have been rediscovered and posted in an internet archive, allowing nostalgic fans to launch and play a 15-year-old incarnation of Lara Croft. Steps to do so sound confusing, but are actually pretty simple, so we’ll break down the basics.",
    "First, you’ll need to download a patch into Microsoft Visual Studio, ensuring you also have access to a PS4 or Xbox 360 controller (keyboard controls haven’t been figured out just yet). Then, you’ll want to download artbase and extract it to C: drive (with a folder structure of C:\\artbase\\tombraider etc. – otherwise, the game won’t run).",
    "From here, you can use run.bat to launch Tomb Raider: 10th Anniversary. All the files for the game can be found in the internet archive, and a more detailed guide from Tomb of Ash reveals all the info on bug fixes, cheats and general updates to the game’s functionality.",
    "When you do make it into the game, there are no enemies – consider it a more scenic experience – but you’ll be able to explore levels in Greece, Peru and, of course, Croft Manor.",
    "Fans behind the resurrection of the canceled project say they made several requests to license holders for permission to publish the game, but never received a reply. Thankfully, an exemption designed to help the Internet Archive preserve vintage software means this 15-year-old Lara is likely to stick around for as long as is needed to climb, jump and swim your way through Tomb Raider: 10th Anniversary’s pixelated nostalgia."
  ],
  "headers": {
    "4": "How to play the Tomb Raider remake"
  },
  "links": {
    "Eurogamer": "https://www.eurogamer.net/articles/2016-10-27-20-years-on-the-tomb-raider-story-told-by-the-people-who-were-there",
    "internet archive": "https://archive.org/details/IndyTRAEbuild",
    "Visual Studio": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1231832140917170000&xs=1&url=https%3A%2F%2Fvisualstudio.microsoft.com%2Fdownloads%2F%3FranMID%3D46107%26ranEAID%3DkXQk6%2AivFEQ%26ranSiteID%3DkXQk6.ivFEQ-xFfAnHDxxPF4C6gMDWV8PA%26epi%3DkXQk6.ivFEQ-xFfAnHDxxPF4C6gMDWV8PA%26irgwc%3D1%26clickid%3DSKNw2w1zrxyLTelwUx0Mo3EOUkEyYTWFnWYozU0%26OCID%3DAID2000143_AFF_1243925_3327_kXQk6.ivFEQ-xFfAnHDxxPF4C6gMDWV8PA_190407%26WT.mc_id%3DAID2000143_AFF_1243925_3327_kXQk6.ivFEQ-xFfAnHDxxPF4C6gMDWV8PA_190407%26OWTGT%3DAFF_1243925&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhow-to-play-the-newly-resurfaced-tomb-raider-remake",
    "Tomb of Ash": "https://www.tomb-of-ash.com/trae-indy-build/",
    "exemption": "https://archive.org/about/dmca.php"
  }
}