{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-leaked-overnight-by-mistake",
  "title": "Zack Snyder's Justice League leaked overnight by mistake",
  "category": "entertainment",
  "updated": "2021-03-09T09:58:55Z",
  "author": "tom-power",
  "summary": "Was it removed as quick as a flash?",
  "article": [
    "The release of Zack Snyder's Justice League is right around the corner, but it appears that some people simply can't wait that long for its arrival. Despite the movie being set for a March 18 release, some HBO Max users were able to watch a portion of the film after it was accidentally leaked ahead of schedule. Quite why it replaced Tom and Jerry, though, is just as puzzling.",
    "According to Variety, subscribers to the streamer managed to watch the first hour of the Snyder Cut on Monday evening.",
    "Curiously, users who logged into HBO Max to watch Tom and Jerry - HBO Max's most recent film release - were unexpectedly treated to the first quarter of the upcoming superhero flick. Multiple HBO Max viewers took to Twitter to post images and videos of the glaring error, but it wasn't long before Warner Bros. rectified the problem.",
    "Check out Twitter user @gbral's tweet below for an example of the huge faux-pas:",
    "It's unclear how Zack Snyder's Justice League leaked ahead of schedule. It's possible that HBO Max were simply gearing up for its release next week. As such, it's likely that the movie has been uploaded to the streamer's servers ahead of March 18, and somebody accidentally pushed the \"launch\" button nine days before its release.",
    "A WarnerMedia spokesperson told Variety that \"Zack Snyder's Justice League was temporarily available on HBO Max and the error was addressed within minutes\".",
    "However, that official line is in contrast to viewer claims that it was available to view for over an hour. Luckily for Warner Bros. and HBO Max, the resolution prevented anyone from watching the entire movie and potentially posting spoilers online.",
    "We won't have long to wait for Zack Snyder's Justice League to arrive, but bear in mind that there may be slight spoilers doing the rounds online now. If you want to watch the Snyder Cut with no prior knowledge of new scenes, Easter eggs, or other content, it'll be worth keeping your guard up from here on out."
  ],
  "headers": {
    "4": "Why did the Snyder Cut get released early?"
  },
  "links": {
    "Variety": "https://variety.com/2021/film/news/zack-snyder-justice-league-hbo-max-tom-and-jerry-1234925141/"
  }
}