{
  "source": "https://www.techradar.com/news/lg-shakes-up-oled-tvs-with-new-83-inch-screen-size-and-a-budget-oled-range",
  "title": "The LG A Series is a brand new budget OLED TV – here's why that matters",
  "category": "televisions",
  "updated": "2021-01-11T15:20:14Z",
  "author": "henry-st-leger",
  "summary": "Exhibit A",
  "article": [
    "LG Electronics has taken to the (virtual) stage at the CES 2021 expo, and announced a brand new budget OLED TV series, the A1 OLED.",
    "It's just one among myriad new announcements from the TV maker, including the arrival of a new 42-inch compact OLED size, a brightness boost with the 'OLED evo' LG Gallery Series OLED, and the introduction of MiniLED technology in its 2021 LCD TVs.",
    "Given the high cost of entry for even a low-spec OLED TV, though, a new budget model is certainly going to attract attention.",
    "The A Series will seemingly be replacing the B Series OLED we saw in previous years, and making use of LG's cheaper a7 processor. So don't expect OLED evo brightness or AI picture processing – and do expect some video noise in dark scenes. Still, we'll be carefully watching to see if LG manages to get the balance right between price and performance, without compromising as hard on the latter as the disastrous Hisense O8B OLED.",
    "We're light on details at the moment, but we expect there'll be similar drop in performance to warrant the lower price. The B Series models of the past two years definitely struggled more with video noise and banding in dark scenes, but still made for an excellent picture overall.",
    "The change in name (from B to A) is curious, though, suggesting that specs could be even further compromised to bring down price – something that hasn't gone well for budget OLED TV makers in the past.",
    "It's just the latest in some major shake-ups from LG in recent times, as with the discontinued E Series OLED – which was replaced by the Gallery Series GX in 2020.",
    "We'll be sharing more information on the A Series as and when LG deigns to tell us more, though we expect 2021 will see the most affordable OLED TVs yet. It's not just the A Series that's getting some changes, though.",
    "It seems LG is also expanding its range of TV sizes, with an 83-inch size set to come to every new OLED 4K TV LG is releasing in 2021. We heard direct from LG Display itself that an even smaller 42-inch size is on its way for 2021 too.",
    "That makes for a total of six TV sizes for 4K models: 42-inch, 48-inch, 55-inch, 65-inch, 77-inch, and 83-inch. (The 88-inch size is exclusive to 8K models.)",
    "Why the odd number? We expect LG Display (which manufactures all OLED TV panels used today) was hoping to differentiate from existing TV screen sizes, though it may be to do with the particular capabilities and dimensions of the production lines in its new factories.",
    "LG Display has been making strides when it came to TV sizes, releasing a new 48-inch OLED panel size in 2020 that was utilized for the LG CX OLED, Sony A9/A9S, and Philips OLED+935, among others.",
    "LG's 8K OLED models will still be releasing in 77-inch and 88-inch sizes as before, though. But if you're opting for 4K, you'll have a huge amount of choice in what screen size to bring into your home – as well as what price point you're willing to buy at."
  ],
  "headers": {
    "8": "New TV sizes for all"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "LG Gallery Series OLED": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "introduction of MiniLED technology": "https://www.techradar.com/news/lgs-first-qned-mini-led-tv-will-feature-up-to-30000-tiny-leds",
    "Hisense O8B OLED": "https://www.techradar.com/reviews/hisense-o8b-oled-tv",
    "hasn't gone well for budget OLED TV makers in the past": "https://www.techradar.com/news/budget-oled-tvs-are-tempting-but-are-manufacturers-jumping-the-gun",
    "E Series OLED": "https://www.techradar.com/news/the-e9-oled-was-one-of-lgs-best-tvs-so-where-did-it-go",
    "Gallery Series GX": "https://www.techradar.com/reviews/lg-gallery-gx-oled-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "smaller 42-inch size": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them",
    "new factories": "https://www.techradar.com/news/lg-oled-tvs-are-having-production-issues-heres-why-that-matters",
    "48-inch OLED": "https://www.techradar.com/best/48-inch-oled-tv",
    "LG CX OLED": "https://www.techradar.com/reviews/lg-cx-oled-tv",
    "Sony A9/A9S": "https://www.techradar.com/news/sonys-first-48-inch-oled-tv-is-finally-here",
    "Philips OLED+935": "https://www.techradar.com/reviews/philips-oled935-tv"
  }
}