{
  "source": "https://www.techradar.com/news/walmart-ps5-and-xbox-restock-today",
  "title": "Walmart PS5 restock: sold out after two-hour marathon – where to look next",
  "category": "gaming",
  "updated": "2021-08-30T09:15:43.885Z",
  "author": "matt-swider",
  "summary": "When will PS5 restock next? The PS5 restock at Walmart is sold out after two hours, and so did the limited Xbox Series X stock in just 30 minutes.",
  "article": [
    "5:30pm update: The Walmart PS5 restock has officially sold out, according to the notice posted on the US retailer's website. It took two hours for PS5 inventory to sell out, as it kept coming back in waves every ten minutes. Xbox Series X was in stock too, 30 minutes prior to the Sony console, but it was more limited, selling out in a half hour.",
    "Miss it? Follow our PS5 and Xbox restock Twitter tracker to receive alerts. It's the fastest way to get real-time updates of console stock. It'll look something like this:",
    "Prior story The Walmart PS5 and Xbox restock today is about to take place, which is good news because the Amazon PS5 restock has been pushed back to an unknown time. Sign up for alerts for all PS5 and Xbox console drops today and in the future.",
    "Both next-gen consoles will be up for grabs, the first, Xbox, starting at 2:30pm EDT, according to Walmart. The PS5 restock happens at 3pm EDT, just 30 minutes later.",
    "\"The items will only be available for delivery,\" a Walmart spokesperson told TechRadar. In other words, you shouldn't show up to Walmart retail stores to try to buy or claim your console. Unlike the recent Target and Best Buy PS5 restock, it's not an in-store pick-up situation.",
    "The Xbox restock is actually going to happen in two phases in case you miss it. First, the standalone console will be available today and the time is set for 2:30pm EDT. It'll be available again next week, too, on March 25 at 3pm EDT as part of Microsoft's finance plan, known as Xbox All-Access.",
    "Walmart hasn't officially shared how much console inventory it has of (we know that Amazon has 46,000 PS5 consoles in stock, although the original scheduled time was pushed back). But we do know you're basically buying a place in line – buyers from the drop two weeks ago are still waiting for PS5 shipments.",
    "We've been getting the Twitter restock alerts out there faster than PS5 restock apps, – and we're doing this for free. Of course, you'll still need to be fast to buy the Sony console. For example, the PS5 restock at Target sold out in less than 15 minutes. We saw something similar with the Xbox restock at the same time.",
    "Through Twitter, we're tracking the next PS5 stock from more than 12 sources, and we've seen a few PS5 consoles pop up over the last week and, even better news, high success rates for people who have been looking for restock for months.",
    "Even if you don't get to buy the console for Saturday, there may be a PS5 drop any one of the days in the upcoming week."
  ],
  "headers": {
    "3": "Walmart PS5 and Xbox restock tips",
    "7": "PS5 restock stores in the US",
    "8": "PS5 Walmart restock success stories"
  },
  "links": {
    "Walmart PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Follow our PS5 and Xbox restock Twitter tracker": "https://twitter.com/mattswider",
    "Amazon PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "Xbox restock": "https://www.techradar.com/news/xbox-series-x-restock-at-gamestop-date-and-time-confirmed-heres-when"
  }
}