{
  "source": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-could-have-a-much-brighter-screen-than-the-iphone-13",
  "title": "Samsung Galaxy S22 Ultra could have a much brighter screen than the iPhone 13",
  "category": "phones",
  "updated": "2021-10-28T09:10:23Z",
  "author": "james-rogerson",
  "summary": "And the S22 could look like the iPhone 13",
  "article": [
    "The Samsung Galaxy S22 range is inevitably going to be compared to the iPhone 13 range, as Apple is Samsung’s biggest smartphone rival. But there’s at least one area where the Samsung Galaxy S22 Ultra might have a substantial lead over any iPhone.",
    "According to Ice Universe (a leaker with a good track record), the Samsung Galaxy S22 Ultra’s peak brightness is higher than the peak brightness of any other Samsung OLED panel.",
    "They didn’t say exactly how bright it can get, but the Samsung Galaxy S21 Ultra tops out at an already very high 1,500 nits. For comparison, the iPhone 13 range all top out at 1,200 nits. So Samsung’s current flagship can already get brighter than Apple’s phones, and if this leak is right then its next one will get brighter still.",
    "Don’t count on this same upgrade coming to the standard Samsung Galaxy S22 or the Galaxy S22 Plus though. Ice Universe doesn’t mention them, and the Samsung Galaxy S21 and Galaxy S21 Plus don’t get as bright as the S21 Ultra (though they do manage a still-impressive 1,300 nits).",
    "Speaking of the Samsung Galaxy S22 and Galaxy S22 Plus, in a slightly older leak the same source claimed that they will have flat screens and flat rear panels, along with a symmetrical bezel, adding that this leaves them looking a lot like the iPhone 13 range – albeit without a notch.",
    "We’re not convinced they would really look that similar though, since leaks suggest the camera layout is very different to the iPhone, and since they won’t have a notch. Also, the Galaxy S21 and S21 Plus already have a flat screen and almost symmetrical bezels, so the only real change here would be a flat back, rather than the slightly curved edges on the current models.",
    "Based on everything we’re hearing so far, it sounds like the Samsung Galaxy S22 and Samsung Galaxy S22 Plus will be a lot like their predecessors, with most of the interesting upgrades being reserved for the Galaxy S22 Ultra.",
    "That includes a new Note-like design, an S Pen slot, and – as per this latest leak – a brighter screen. But making the screen brighter isn’t likely to be a very noticeable upgrade most of the time.",
    "The Samsung Galaxy S21 Ultra already has one of the brightest displays you’ll find on a smartphone, and that extra shine will mostly only be beneficial in direct sunlight, which can otherwise leave screens looking washed out.",
    "Even then, we don’t typically find the Galaxy S21 Ultra hard to see, so the S22 Ultra’s display might just look a bit better under those conditions, which probably isn’t a reason to buy it."
  ],
  "headers": {
    "6": "Analysis: the S22 Ultra is the one to watch, but not for its brightness"
  },
  "links": {
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Ice Universe": "https://twitter.com/UniverseIce/status/1453599037865611265",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Plus": "https://www.techradar.com/reviews/samsung-galaxy-s21-plus-review",
    "claimed that they will have flat screens": "https://twitter.com/UniverseIce/status/1452886318585876480"
  }
}