{
  "source": "https://www.techradar.com/news/apple-fitness-plus",
  "title": "Apple Fitness Plus: price, features and everything you need to know",
  "category": "fitness",
  "updated": "2021-09-14T19:46:43Z",
  "author": "gareth-beavis",
  "summary": "Apple's home workout subscription service",
  "article": [
    "Apple Fitness Plus is a subscription-based workout service that gives you a huge choice of exercise classes to try at home, including high-intensity interval training (HIIT), indoor cycling, treadmill running, yoga, strength, and pilates.",
    "The main thrust of Fitness Plus is being able to choose the workout you want - each pre-recorded video has a specific workout type, music, time and trainer, so you're able to select whichever you're in the mood for, aping gym class schedules and giving you the choice of workouts on the go.",
    "Heart rate data from your Apple Watch is displayed on-screen while you work out, showing just how hard you're pushing yourself, and encouraging you to try that extra little bit harder.",
    "When you want to get out and about, you'll also have access to a tool called Time to Walk, which lets you take a stroll while listening to inspiring stories from a celebrity or athlete. These are much like podcasts, and can be loaded onto your Apple Watch before you head out, so you can listen without your phone.",
    "The pricing for the new Fitness Plus service is pretty simple on its own: it's $9.99 / £9.99 / AU$14.99 per month, or $79.99 / £79.99 / AU$119.99 if you want to take it out for the year.",
    "However, if you sign up for the premium tier on Apple One, Apple's new services subscription service, then you'll get Fitness Plus, News Plus, Apple TV Plus, Apple Arcade and Apple Music - along with massive amounts of iCloud storage - for $29.95 / £29.95 / AU$39.95 per month.",
    "Also, if you're thinking of buying an Apple Watch (Series 3 or later) then you'll get three months of Fitness Plus free, and if you already own said wristwear, then you'll still get a full free month of dribbling sweat all over your iPhone.",
    "The easiest way to describe Apple Fitness Plus is to compare it to something like Peloton, where you're exercising with interactive videos on an iPhone or iPad. However, unlike Peloton, Apple Fitness Plus doesn't have a live element to it, which means all the videos are on demand.",
    "What's on the videos? Well, a variety of different disciplines, from a treadmill run to core work, to a mindful cooldown, and you'll play them back from your Apple tablet, phone or connected Apple TV.",
    "If you're thinking that this is just something you can watch for free on YouTube, then you've not got the full picture here. The Apple Watch you're wearing will bring over information like the amount of calories you've burned, the time you've been working out and your heart rate (to give information on how hard you're working).",
    "When the instructor on the screen wants you to focus on your heart rate, that metric will expand to make it more prominent for you - it's a fusion of pre-recorded video, plus dynamic and interactive stats from your own effort.",
    "Trainers can also trigger different highlights to your metrics - whether that's how filled your 'move rings' (Apple's daily measurement of your movement) are, or how long left in a specific interval, those elements will change accordingly.",
    "There were no group features when Fitness Plus launched, but in September 2021, Apple announced a new feature that allows up to 32 people to take part in a virtual class simultaneously – much like Peloton Sessions.",
    "Whether you're working out in a group or alone the 'Burn Bar', which will show you how far ahead you are of the average user in any given workout. This is equalized for weight and height, so it's meant to be a true reflection of the effort you're putting in without losing out to someone at a genetic advantage.",
    "The Fitness Plus platform is also designed to give you balance in your workouts - when you open the app, you'll see suggested videos to do, and if you've been doing a lot of high intensity interval training (HIIT) or running of late, it'll guide you towards more stretching or cross training instead.",
    "It'll also encourage you to push a little bit harder on occasion, but there's no way to have a dedicated fitness program to help you get fitter over time - that's up to you, choosing the right workout you feel you need.",
    "If you're just starting out, or the idea of taking part in even a virtual studio class is a little daunting, there's an 'absolute beginner' class to let you get up to speed with your fitness goals before jumping right in. There are also modifications to suit older and pregnant people.",
    "There's a wealth of new fitness trainers on offer for the new Fitness Plus service, from all walks of life and disciplines - a trainer who began surfing and jiu jitsu before finding yoga, elite athletes, pro runners and more.",
    "The idea is that this is a team you can recognize over time, much as you would in a studio fitness set up. The different trainers will appear in each other's videos from time to time (socially distanced, we assume) so there will be a level of cohesion between the sessions, and allow you to find your favorites when it comes to who you want to work out with.",
    "While the key thing you're going to need to make the Fitness Plus app work is the subscription, you'll also obviously need an Apple Watch - this is another move from Apple to get users to embed themselves even more firmly in its ecosystem.",
    "In terms of which Watch, anyone with an older model will probably be out of luck - you'll need the Apple Watch 3 and above to use Fitness Plus, and an iPhone, iPad or Apple TV to access the service.",
    "If you've got a compatible Apple Watch, you'll also need to make sure it's running the latest watchOS software to let it beam across to other devices.",
    "Fitness Plus is also compatible with GymKit, which adds another layer of data to things. That means that if you're using a connect treadmill, for instance, the speed you're running at will be transferred to your Watch and will be shown in your metrics on screen.",
    "Apple Fitness Plus released on December 14 2020 in Australia, Canada, Ireland, New Zealand, the UK, and the US, meaning you can get your subscription in time for the New Year. You know, that time when people are thinking 'I really should get fit', but then manage a couple of days of gym time before going back to their normal routine.",
    "Whether having a dedicated subscription is going to be the thing that pushes them to stay involved remains to be seen, but with an iPhone in your pocket and an Apple Watch on your wrist, you'll be able to workout literally anywhere.",
    "Although maybe pick your moment. In the supermarket queue might get some raised eyebrows when you're really trying to PUMP IT HARD."
  ],
  "headers": {
    "4": "Apple Fitness price",
    "7": "Apple Fitness Plus features",
    "17": "Apple Fitness Plus trainers",
    "19": "Apple Fitness+ specs and requirements",
    "23": "Apple Fitness release date"
  },
  "links": {
    "Apple One": "https://www.techradar.com/news/apple-one-subscription-service-release-date-price-and-news",
    "News Plus": "https://www.techradar.com/news/apple-news-plus",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "Apple Arcade": "https://www.techradar.com/news/apple-arcade-price-games-controllers-and-if-its-worth-it",
    "Apple Music": "https://www.techradar.com/reviews/apple-music",
    "Peloton Sessions": "https://www.techradar.com/news/peloton-offers-smaller-virtual-classes-for-friends"
  }
}