{
  "source": "https://www.techradar.com/news/new-surface-pro-x-launch-date-specs-and-price-everything-we-know-so-far",
  "title": "New Surface Pro X launch date, specs and price: everything we know so far",
  "category": "computing",
  "updated": "2021-09-22T16:19:17Z",
  "author": "jess-weatherbed",
  "summary": "We welcome Microsoft’s next-generation Surface Pro X",
  "article": [
    "Microsoft held its Fall 2021 event on September 22, revealed a fresh lineup of Surface products, and introduced a new Surface Pro X 2-in-1 device.",
    "Pre-orders are now live for the other newly-announced products in the Surface range, but we only know that the new Surface Pro X will be releasing in 2022, and it isn't currently available for pre-order. Given it's shipping with Windows 11, we were expecting a sale date after October 5 (the launch date for Windows 11), but 2022 could mean a wait of anything from a few months to over a year.",
    "The 2019 model of the Surface Pro X wasn't well received, but Microsoft has its sights set on improving existing features as well as adding new additions, such as the aforementioned Windows 11 operating system, plus the new Surface Slim Pen 2, and a Wi-Fi-only model.",
    "Battery life will also be addressed, with Microsoft stating that users can expect up to 15 hours of use on a single charge. The previous generation of Surface Pro X didn't impress us with its meager battery life, achieving just under eight hours of real-world use in our benchmarks, so if this anticipated battery life adheres to Microsoft's claims, this will have greatly improved one of the biggest issues we had with the older model.",
    "While we wait to get a hands-on review, we’re here to keep you updated on everything you need to know about the device before it hits the streets. Keep this page bookmarked, as we will update it as soon as any new information comes our way.",
    "There have been no announcements regarding an on-the-shelf launch for the new Microsoft Surface Pro X, other than it will be made available sometime in 2022. in fact, the New Surface Pro X didn't get much of a mention at all during the event, so it's still mostly clouded in some mystery.",
    "The original Microsoft Surface Pro X was released back on October 1, 2019, but we know that this refreshed model will ship with Windows 11, and as the OS is launching on October 5, it was always going to be highly unlikely that you'd be able to wander into a store and pick one up before then.",
    "There are also going to be models available with Windows 10, but it's unclear if the devices that have Windows 10 pre-installed will be made available any earlier than those running Windows 11.",
    "The pricing for the different variants of the Surface Pro X hasn't been revealed, but the previous model gained criticism for being a particularly expensive price of kit.",
    "Microsoft has announced that this updated model will start at $899 (around £660 /AU$1250 ), which is still expensive but cheaper than the original which started at $999 (£999, AU$1,699) for 8GB of memory (RAM) and a 128GB solid-state drive (SSD).",
    "A model was also available with double the storage for $1,299 (£1,269, AU$2,149), and double the RAM (16GB) with a 512GB SSD, which costs $1,799 (£1,819, AU$2,899), so it's likely we will see similar increases in this New Surface Pro X as the specifications vary.",
    "We're aware of the various specifications that will be available in the Microsoft Surface Pro X, but there's no current clarification on what models will be available, and how the pricing will differ between them.",
    "There are four different operating systems available across home and business as Microsoft will be launching the Surface Pro X with either Windows 11 or Windows 10 for those that need to retain the older OS.",
    "We're not sure if this will make the device any cheaper, but support is planned for Windows 10 for the next five years, so if you're forced to use the older OS you don't need to concern yourself too much.",
    "Both Wi-Fi 5 and Bluetooth 5 connectivity will be available as standard, but the Surface Pro X also has Gigabit LTE capabilities for some speedy downloads. Microsoft also announced that a Wi-Fi-only model will be made available, but it's unclear if this restricted device will be the cheapest available model in the lineup.",
    "It's a bit off that it comes with the older WI-Fi standard, not the newer Wi-Fi 6, so we'll follow up with Microsoft to see why that is.",
    "The display is listed with a 2880 x 1920 resolution, which is great news for creatives and folk who like a crisp image, but this doesn't shine a light to the miniLED tech being used in the Apple M1 iPad Pro which will likely be the surface Pro X's biggest competitor.",
    "Memory-wise, it seems both an 8GB or 16GB version will be made available, and storage has similar flexibility with options of 128, 256, or 512GB in the form of a removable SSD. It's unlikely that this is 'consumer' replaceable, but we're willing to be surprised.",
    "You'll be restricted to just two USB-C 3.2 slots for peripherals but this is a standard for 2-in-1 devices, and with Bluetooth technology, you can easily connect most wireless devices should you need."
  ],
  "headers": {
    "5": "New Surface Pro X release date",
    "8": "New Surface Pro X price",
    "11": "New Surface Pro X specs"
  },
  "links": {
    "Fall 2021 event": "https://www.techradar.com/news/microsoft-announces-surface-go-3-surface-laptop-studio-surface-pro-8-and-more-ahead-of-windows-11-launch",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "2019 model of the Surface Pro X": "https://www.techradar.com/reviews/microsoft-surface-pro-x-review",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Wi-Fi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "miniLED tech being used in the Apple M1 iPad Pro": "https://www.techradar.com/news/powerful-new-m1-macbook-pro-models-expected-to-feature-mini-led-display"
  }
}