{
  "source": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
  "title": "Oculus Quest 3: rumors, predictions and likely release date",
  "category": "gaming",
  "updated": "2021-11-30T15:25:44Z",
  "author": "axel-metz",
  "summary": "Here's what we know about the Oculus Quest 3",
  "article": [
    "A lot has changed for Facebook and Oculus in recent months. For starters, Facebook as a company is now called Meta, and its upcoming VR headset, dubbed Project Cambria, isn't actually a Quest device, at all.",
    "Project Cambria is, instead, a completely new headset IP, designed to introduce users to groundbreaking VR technology that will help Facebook – sorry, Meta – establish the earliest days of its aptly-named metaverse project.",
    "So, where does that leave the Oculus Quest 3?",
    "Well, Meta has clarified that development is still underway on the next generation of its more budget-friendly VR headsets, which spells good news for those worried that Project Cambria might have sent the Quest 3 to the grave.",
    "At an earnings call for the company earlier this year, company CEO Mark Zuckerberg told investors that Meta has been working on \"new hardware [that] will fit the same platform [as the Quest 2]\" for some time. We're still not certain whether those comments were made in reference to an Oculus Quest 3 headset, a newer version of the Oculus Quest 2 or indeed this newly-announced Project Cambria, but we expect to hear more on the matter soon.",
    "As it happens, a new and improved Quest 2 model is now on the shelves, packing 128GB of storage for exactly the same price as the existing base version – making it better value, and an easier recommendation, than ever.",
    "But we're still intrigued to see what new Quest products Meta may have up its sleeve, in addition to the more expensive Project Cambria, over the next year or so.",
    "So, what do we know so far about this potential Oculus Quest 3 headset? Below, we've rounded up all the latest news, rumors and predictions for the most anticipated product in the world of VR.",
    "We weren't expecting to see a new Oculus device until 2022, but with Project Cambria now supposedly launching next year (though no set date has been given yet), we could see Meta's next Quest headset delayed to 2023.",
    "We'd be surprised to see it launch as late as that, though, given Meta's clear appetite to establish itself as the home of mainstream VR gaming. But with the potential for clashes between its own hardware launches now a genuine reality, the company might put some distance between its VR releases.",
    "Still, with the Quest 2 launching in October 2020, only a year and a half after the original, there's still a chance that the Quest 3 could follow a similar timeline.",
    "The signs are promising, too, and more information is being revealed about the next Quest device as the year goes on. In an interview with The Information, Zuckerberg not only confirmed that the Quest 3 is definitely in the works, but that the company is already in the early stages of work on the Oculus Quest 4.",
    "“Because of how hardware gets developed, you kind of need to know what your next three products are going to look like all at the same time,\" Zuckerberg said.",
    "\"It’s not like software, where we’re changing it every couple of weeks. We have product teams spun up now working on the next few generations of virtual reality and what Quest 3 and 4 are gonna look like.“",
    "Although there's a big difference between actually creating these products and defining what they're \"gonna look like\", this is good news for those who are keen to find out more about the Quest 3.",
    "It's not all sunshine and rainbows, though. In April 2021, details were shared of a recent online chat between two key Oculus executives who suggested its next device is more likely to be an incremental Oculus Quest 2 Pro upgrade rather than a full-on Oculus Quest 3 follow-up – but again, this may have been in reference to the aforementioned upgraded Quest 2, available now, or indeed the recently-announced Project Cambria. Meta hasn't been super clear, either way.",
    "In a more recent Twitter Q&A, vice president of Meta Reality Labs, Andrew Bosworth, said that right now, a Quest 3 headset is still “a little way off” – but a 2022 arrival could still prove a reality.",
    "We've got our fingers crossed, anyway.",
    "Given the improvements made by the Quest 2 over its predecessor, we’d expect the Quest 3 to remain a standalone VR headset with customary improvements to battery life, processing power and resolution. The Quest 2 boasts a 50% sharper picture than the original device, which sets an impressive benchmark for the Quest 3 to follow.",
    "The Quest 2 also upped the refresh rate to 90Hz from the original Quest’s default 72Hz, and increased that figure again to 120Hz earlier in the year.",
    "It would follow, then, that the Quest 3 will come equipped with a minimum refresh rate of 120Hz, although time will tell whether upcoming VR titles can take full advantage of the upgrade, given that most games still don’t yet support that higher refresh rate.",
    "Interestingly, a Swiss VR tech manufacturer, CREAL, recently demonstrated its breakthrough in light-field display technology, showing off a headset capable of focusing at long distances and rendering high resolution imagery up close. This technology is capable of generating imagery that accurately represents how we see light from the real world, and though not yet available for the mass-market, it may be something we see arrive with the Quest 3.",
    "CREAL also says its display is capable of running at 240Hz – double the 120Hz refresh established by the Quest 2 update – though this does seem a little too big of a jump for the Quest 3 to make.",
    "We could also see changes to form factor, possibly decreasing the headset's weight further or focusing on comfort-related alterations. As per recent rumors, we've seen multiple clips showing a device dubbed 'Seacliff' – the supposed codename for a new Oculus VR headset – which could indicate some of the design changes coming to Meta's next device.",
    "In these videos, one of which you can find below, we see a new VR headset (that seems to be wireless like the Oculus Quest 2) sporting a much less bulky front visor, with the weight instead distributed across the front and with a pack at the back.",
    "After the cryptic announcement of Project Cambria, though, we're fairly confident that Seacliff is instead codename for, well, Project Cambria – though the video nonetheless hints at potential form changes we could still yet see in a new Quest headset.",
    "We're sure the software of any new Oculus device will be updated to improve hand tracking, too – especially as the kind of haptic feedback we're seeing in the PS5 DualSense controller seems like it could elevate VR experiences if it came to the Quest's pair of controllers in a meaningful way.",
    "An almost inevitable feature of the Quest 3, though, will be its integration with the Meta ecosystem, meaning you’ll likely need a Meta account to access the platform. This prerequisite means you’ll again be subject to Meta’s data monitoring practices – so if you’re morally against the Quest 2’s data-harvesting methods, you’ll be out of luck once more.",
    "The company has made a conscious effort to distance itself from its previous business model, mind, with its VR division now wholly separate from its Facebook platform – suggesting you may not need the latter to enjoy the products developed by the former.",
    "How much would an Oculus Quest 3 model cost? Well, the Oculus Quest 2 comes in two variants: a model with 64GB of storage, priced at £299 / $299 / AU$479, and a 256GB version for £399 / $399 / AU$639.",
    "That’s a significant saving over the initial price of the original, entry-level Oculus Quest. We don't expect a Quest 3 to get too much cheaper, though, and we've seen Oculus adopt a 'same price, but better specs' strategy when upgrading the Oculus Rift to the Rift S.",
    "Having said that, knowing Meta's plans to see its hardware become the go-to mainstream VR platform, it could either opt to make the Quest 3 more accessible to all (i.e. cheaper than the Quest 2) or, instead, adopt an Apple-esque model of making its products seem more appealing (read: exclusive) by hiking their price.",
    "We've already heard mutterings that the upcoming Project Cambria headset will be on the expensive side, so it follows that the Quest 3 could be even pricier – if it does indeed end up being the superior device, that is.",
    "In our review of the Oculus Quest 2, it was hard to find fault with a VR headset that proved immersive, comfortable and easy to use. And yet, while it clearly leads the pack in the VR market, it still falls foul of some of the pitfalls that the technology as a whole suffers from. Here’s a list of updates we want to see on the Oculus Quest 3:",
    "Improved motion sickness prevention",
    "One of those technological pitfalls, and perhaps an unavoidable one, is the motion sickness that can often ensue when using any VR headset. Depending on your tolerance for whirring and blurring, the Quest 2 can be one helluva dizziness-inducer. While there isn’t yet a clear path to making any VR headset immune to user dizziness, it’s nonetheless something we’d like to see improved on the Oculus Quest 3.",
    "A better fit",
    "The same goes for the fit of the device. While the Quest 2 is indeed a comfortable weight when on the head, it can still be a little claustrophobic to achieve a good, tight fit. Again, it’s a problem encountered by almost all VR headsets, and a base-level issue that the next generation of hardware should at least attempt to better address. Those aforementioned design rumors suggest the new Oculus device could solve some of these issues.",
    "Improved Oculus Store",
    "Other improvements we’d like to see include a more effective in-VR Oculus Store. While the equivalent store on browser and in the app makes it easy to discover new releases and search for upcoming games, the store inside the headset itself seems to roll the dice on what apps are shown with no way to quickly navigate to new content. This makes it difficult to pre-order games and discover new titles to purchase when using the device, which is a pivotal part of ensuring the headset maintains replayability.",
    "A neighbourhood-like social space",
    "While the Quest 2 has a competent party invitation system to get you game-to-game with your friends, there isn’t a social space to engage with others in-between. It would be interesting to see the Quest 3 introduce a virtual social space, in the same vein as NBA 2K’s neighbourhood area, to share some downtime with others. What’s with the multi-person furniture in the current home environment if there’s nobody to share it with? Luckily, Meta's new metaverse project – ambitious as it seems – suggests virtual social spaces will be at the forefront of all future Quest headsets.",
    "Improved media sharing",
    "Sharing screenshots and videos on Oculus devices has never been easy, and it’s an issue that the Quest 2 tried to address with little success. You still need to jump through several hoops before you’re able to share your VR content, which is often captured haphazardly anyway, so we’d like to see the Oculus 3 make the whole deal more accessible. 1080p video, app integration, proper audio syncing – that’d all be nice, too.",
    "While VR gaming is a medium that has certainly gained popularity in recent years – the Quest 2 reportedly received five times as many pre-orders as its predecessor – it's still not considered to have cracked the mainstream market.",
    "At least, that’s the opinion of Mark Zuckerberg, who reportedly said in 2018 that 10 million VR users were needed to ensure that the Oculus platform was \"sustainable and profitable for all kinds of developers.” He did add, though, that “once we get across this threshold, we think that the content and the ecosystem are just going to explode\" (as reported by RoadtoVR).",
    "There’s also a gaping hole in the market right now that the Oculus Quest 3 could aim to fill. The Valve Index is one of the best VR headsets we've tested so far, but transistor shortages have effectively shut down manufacturing of the device for the past year, making it very difficult to get hold of one. A new Oculus device, then, could learn from the successes of Valve’s headset and achieve a real foothold in the VR industry.",
    "Rumours, of course, are also swirling that an Apple VR headset is in the works (along with an Apple car, smart glasses, TV and so on…) which could mean heavy competition in the years to come. Multiple tech heavyweights fighting for the top spot can only be a good thing for VR gaming, though, so we await with bated breath to see what the Oculus Quest 3 can bring to the table."
  ],
  "headers": {
    "44": "The road ahead for Oculus Quest 3"
  },
  "links": {
    "now called Meta": "https://www.techradar.com/news/facebook-is-changing-its-name-to-meta",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "Project Cambria": "https://www.techradar.com/news/new-oculus-vr-headset-officially-teased-at-facebook-connect-2021",
    "metaverse project": "https://www.techradar.com/news/facebooks-whole-metaverse-thing-its-simply-ridiculous-and-we-have-questions",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "new and improved Quest 2 model": "https://www.techradar.com/news/the-new-oculus-quest-2-boasts-better-vr-value-than-ever",
    "the original": "https://www.techradar.com/reviews/oculus-quest-review",
    "The Information": "https://anchor.fm/the-informations-411/episodes/BONUS-EPISODE--Mark-Zuckerberg-on-the-Future-of-AR-and-VR-ervthr",
    "work on the Oculus Quest 4": "https://www.techradar.com/news/oculus-quest-3-and-4-already-in-development-says-mark-zuckerberg",
    "details were shared": "https://www.techradar.com/news/oculus-quest-pro-will-arrive-long-before-any-oculus-quest-3-vr-headset",
    "Oculus Quest 3": "https://www.techradar.com/news/oculus-quest-3-price-release-date-specs",
    "increased that figure again to 120Hz": "https://www.techradar.com/news/oculus-quest-2-will-be-updated-with-120hz-refresh-rate-says-facebook-insider",
    "recently demonstrated its breakthrough": "https://www.techradar.com/news/this-futuristic-vr-tech-could-be-a-game-changer-for-virtual-reality-headsets",
    "recent rumors": "https://www.techradar.com/news/new-oculus-quest-vr-leaks-ahead-of-this-weeks-facebook-connect",
    "PS5 DualSense controller": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Oculus Rift": "https://www.techradar.com/reviews/gaming/gaming-accessories/oculus-rift-1123963/review",
    "Rift S": "https://www.techradar.com/reviews/oculus-rift-s-review",
    "review": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "design rumors": "https://www.techradar.com/news/new-oculus-quest-vr-leaks-ahead-of-this-weeks-facebook-connect",
    "RoadtoVR": "https://www.roadtovr.com/zuckerberg-quest-2-mainstream-vr-headset-facebook-q4-2020-earnings/",
    "Valve Index": "https://www.techradar.com/reviews/valve-index",
    "Apple VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "Apple car": "https://www.techradar.com/news/apple-car"
  }
}