{
  "source": "https://www.techradar.com/news/klarna-launching-into-consumer-bank-accounts",
  "title": "Klarna launching into consumer bank accounts",
  "category": "computing",
  "updated": "2021-02-10T10:40:19Z",
  "author": "rob-clymo",
  "summary": "It's an idea that could compliment Klarna's existing 'buy now, pay later' service",
  "article": [
    "Klarna is looking to offer consumer bank accounts in Germany using its mobile app to deliver financial services, complimented by a Visa debit card.",
    "The mobile banking service, launched today, will initially only be available to a limited number of customers with a wider rollout set to follow over the next few months.",
    "Customers will get a bona fide bank account, complete with a German IBAN, which will enable them to receive money as well as set up deposits and debits. Meanwhile, the accompanying debit card offers two free ATM withdrawals per month and has been designed to work with Google Pay and Apple Pay.",
    "Klarna has evolved dramatically since its early days when the fintech’s interests lay solely on payment processing for e-commerce websites. The company has made a name for itself by specializing in offering ‘buy now, pay later’ multiple installment options for pricier goods.",
    "The benefit for merchants using the Klarna system has always been that they get the money from the transaction right away. Klarna handles the credit aspect with consumers directly.",
    "With the unveil of its bank account option Klarna is now taking that convenience directly to consumers. The app service offers all of the trimmings of domestic app-based banking services and provides a dynamic overview of your account activity.",
    "All that comes alongside Klarna’s automatic tracking of past purchases and advisory’s on upcoming payments while providing access to stores, the ability to track ongoing deliveries and configure price-drop notifications.",
    "As an example, the bank account package could make it easier for consumers to search for something, purchase it and then spread payments for the item over three months. It has the potential to provide a more rounded consumer experience.",
    "This may not be the last big announcement from Klarna in the coming months too. The fintech is aiming to add savings accounts to its product portfolio, having already launched one in Sweden.",
    "The account comes with flexible and fixed-term savings option, which if rolled out to a wider arena could prove tempting to consumers looking for an alternative option for their personal finances.",
    "Klarna’s new consumer service is built around its own banking system, which allows it to sidestep the need for a banking-as-a-service partner to handle accounts. As such, it’ll be pitched against other popular German digital banks including N26 and Vivid Money."
  ],
  "headers": {
    "4": "Bank account"
  },
  "links": {
    "bank accounts": "https://www.techradar.com/best/best-personal-finance-software",
    "mobile banking": "https://www.techradar.com/best/best-money-transfer-apps",
    "ATM withdrawals": "https://www.techradar.com/news/withdraw-cash-at-atms-using-your-smartphone-heres-how",
    "Google Pay": "https://www.techradar.com/how-to/how-to-use-google-pay",
    "Apple Pay": "https://www.techradar.com/how-to/how-to-use-apple-pay",
    "payment processing": "https://www.techradar.com/best/best-payment-gateways",
    "e-commerce websites": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "banking services": "https://www.techradar.com/news/fear-of-fintech-5-misconceptions-keeping-you-from-the-future-of-finance",
    "Klarna": "https://www.techradar.com/news/swedish-bank-and-payments-giant-goes-all-in-with-aws-for-cloud",
    "personal finances": "https://www.techradar.com/best/best-personal-finance-software",
    "digital banks": "https://www.techradar.com/news/over-half-of-us-consumers-considering-a-move-to-digital-banks"
  }
}