{
  "source": "https://www.techradar.com/news/samsung-galaxy-a82-leaked-images-make-it-look-like-a-samsung-s21-fe",
  "title": "Samsung Galaxy A82 leaked images make it look like a Samsung S21 FE",
  "category": "phones",
  "updated": "2021-04-13T05:00:33Z",
  "author": "david-lumb",
  "summary": "The Samsung A82 may launch without a fun camera after all",
  "article": [
    "New leaked images and video purportedly show the Samsung Galaxy A82, but unlike its predecessor and contrary to rumors, there’s no innovative camera setup – simply a set of static, rear-facing shooters.",
    "In that sense, the Samsung A82 may end up resembling what we expect the Samsung Galaxy S21 FE will look like with its triple-rear cameras in a vertical line.",
    "We got our first looks at the Samsung Galaxy A82 thanks to a series of new leaks, first in an unboxing video posted by SamMobile showing a phone called the Samsung Galaxy A Quantum 2 – a successor to the variant of the Galaxy A71, the Samsung Quantum, that launched in some regions last May.",
    "From the video, the Quantum 2 looks designed similarly to the Samsung A52 and Samsung A72 announced in March, with the same raised camera block but even fewer lenses on the back – a trio, like the Samsung S21. This model comes in a white color and looks to have a slightly curved waterfall screen, volume rocker button and lock button the right, and USB-C port on the bottom (though no 3.5mm headphone jack). Reportedly, the A82’s box contained a 15W fast charger and cable.",
    "Another pair of leaked images (above) appeared in a post on Chinese social media site Weibo showing off a phone the user claims is the Galaxy A82, which looks a lot like the Quantum 2 above – though in a dark gray color. Presumably, they’re the same phone, though it’s always possible that one is a slight variant of the other and they have differences in specs.",
    "From these images, it looks like the Samsung A82 will arrive with a very conventional (read: immobile) camera block. We expected the phone to pack a more innovative camera system, like its predecessor, the Samsung Galaxy A80, which had a mechanism that flipped the rear cameras forward for selfie shots.",
    "While some leaks suggested the A82 would have a simple punch-hole for its front-facing camera, others hyped up a more novel solutions like a vertical column that points out the back of the phone and swivels up to point forward for selfie shots. Alas, a punch-hole makes a lot more sense (and is surely cheaper to produce). Unless we hear different, we’d expect this solution in the final phone, but we could always be surprised."
  ],
  "headers": {
    "5": "Samsung A82: where’s the fun camera?"
  },
  "links": {
    "Samsung Galaxy A82": "https://www.techradar.com/news/samsung-galaxy-a82",
    "SamMobile": "https://www.sammobile.com/news/galaxy-quantum-2-camera-specs-leaks-video/",
    "announced": "https://www.techradar.com/news/samsung-galaxy-a52-and-a72-are-here-and-bring-flagship-features-to-mid-range-phones",
    "Samsung S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "post": "https://weibo.com/5673255066/KawlTizbN?type=comment#_rnd1618265152889",
    "solutions": "https://www.techradar.com/news/samsung-galaxy-a82-could-have-an-innovative-selfie-camera"
  }
}