{
  "source": "https://www.techradar.com/news/manufacturing-breakthrough-paves-the-way-for-gigantic-quantum-computers",
  "title": "Manufacturing breakthrough paves the way for gigantic quantum computers",
  "category": "computing",
  "updated": "2021-07-02T21:30:36Z",
  "author": "anthony-spadafora",
  "summary": "New multi-chip quantum processor allows for predictable scaling",
  "article": [
    "Quantum computers could soon be even larger than they already are thanks to a new manufacturing breakthrough from the full-stack quantum computing company Rigetti Computing.",
    "The firm has announced the launch of the world's first multi-chip quantum processor which incorporates a proprietary modular architecture that solves some of the key scaling challenges associated with fault-tolerant quantum computers.",
    "Rigetti Computing plans to build a quantum computer with 80 qubits powered by its multi-chip quantum processor later this year and make it available to customers on its Quantum Cloud Services platform.",
    "Founder and CEO of Rigetti Computing, Chad Rigetti provided further insight on the company's new multi-chip quantum processor in a press release, saying:",
    "“We’ve developed a fundamentally new approach to scaling quantum computers. Our proprietary innovations in chip design and manufacturing have unlocked what we believe is the fastest path to building the systems needed to run practical applications and error correction.”",
    "There are a number of inherent challenges involved when it comes to scaling quantum computers. For instance, as chips increase in size, there is a higher likelihood of failure and lower manufacturing yield which makes it increasingly more difficult to produce high-quality devices.",
    "Thankfully though, Rigetti Computing has managed to overcome these roadblocks by developing the technology necessary to connect multiple identical dies into a large-scale quantum processor. At the same time, this modular approach helps reduce manufacturing complexity and allows for accelerated and predictable scaling.",
    "The company's multi-chip approach will enable future systems to scale in multiplicative ways and next-generation architectures currently in development at Rigetti include individual chips with more qubits as well as advanced technologies that will be used to connect more of these chips into larger processors.",
    "We'll likely hear more on the performance of Rigetti Computing's multi-chip quantum processor once the company's new 80-qubit quantum computer is completed later this year."
  ],
  "headers": {
    "5": "Scaling quantum computers"
  },
  "links": {
    "Quantum computers": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario",
    "Rigetti Computing": "https://www.techradar.com/news/aws-reveals-first-quantum-computing-partners",
    "quantum processor": "https://www.techradar.com/news/google-is-working-on-a-mega-quantum-computer",
    "qubits": "https://www.techradar.com/news/ibm-has-doubled-the-power-of-its-quantum-computer",
    "press release": "https://www.globenewswire.com/news-release/2021/06/29/2255028/0/en/Rigetti-Computing-introduces-world-s-first-scalable-multi-chip-quantum-processor.html"
  }
}