{
  "source": "https://www.techradar.com/news/ps5-restock-help",
  "title": "I helped thousands of people buy PS5, but I'm bad at buying it myself – how to get it",
  "category": "gaming",
  "updated": "2021-03-15T13:12:50Z",
  "author": "matt-swider",
  "summary": "PS5 restock tips: learn from my past mistakes",
  "article": [
    "Update: We will see PS5 restock at several retailers this week. We'll send you instant notifications via Twitter the minute it's back in stock. See below for how to sign up.",
    "I've helped thousands of people get the PS5 and they've sent me 'console-hand-photos' with ear-to-ear grins to prove it. That's powered me to continue to help.",
    "But the truth is I haven't gotten the PlayStation 5 myself – yet. I'm not following my own advice. And I've hit every speed bump since launch, which you can learn from.",
    "It'll look like:",
    "I turned my Twitter account into a PS5 restock tracker one month ago. I didn't really plan on it. I only meant to complain about how hard it was to buy a PlayStation 5 after so many failed attempts. I posted a link to the next drop the next day and people began to thank me profusely. It snowballed from there.",
    "It turns out, I'm not alone. More than 150,000 new followers later, I'm helping actors, US senators, TV news anchors, Olympians, college sports figures and execs at top tech companies. I've enjoyed seeing the reach of my help. But more than celebrity, I love seeing the console-in-hand photos of smiling everyday gamers the most.",
    "My focus has shifted from buying as PS5 to ensuring others get one. That's been far more rewarding. But you'd think I'd still be able to buy one by now, right? From my many failed attempts come lessons I should pass on – if you're still looking for the new Sony console four months after launch.",
    "On PS5 launch day – November 12, 2020 – I had a doctor's appointment and foolishly thought, 'I'll just buy PS5 while I'm in the waiting room'. When I didn't get it then, I thought, 'I'll just get it before Black Friday and Cyber Monday. No? Before Christmas. Nothing? Surely sometime in January? Wait, I still don't have it in March?!'",
    "Getting notifications as soon as there's a PS5 restock has become critical. You're not only trying to 'secure the bag' before other people. An army of scalper bots that are designed to purchase the system without hesitation, letting scalper resell the PS5 for 2x and, at the height of scarcity, 3x what it's worth.",
    "Follow a Twitter account and turn on notifications. There are others doing it besides myself, including Jake Randall, Cameron Ritz and Chito Gaming to name a few. Not all retailers are first come first serve (Sony Direct is a lottery system) and most consoles sold are within a 30-minute window (people give up to easily when, really, inventory is released in waves). But being there minute one helps.",
    "My biggest mistake early on was to spurn the PS5 bundle. Bundles, by nature, more pricey; they come with PS5 games, controllers, and some other PS5 accessories.",
    "The good news is scalpers have a difficult time reselling bundles – it's a lot harder to resell the console with Spider-Man: Miles Morales and NBA 2K21, for example. You'd have to find someone who wants both games and a second controller.",
    "As long as you want those extras, the bundle is a great choice and inventory often lasts longest at GameStop. While Walmart and Best Buy in the US crash, GameStop doesn't fall victim to the weight of scalper bots. Bundles just aren't worth it for them.",
    "Some caveats: If you don't want something like NBA 2K21, don't buy the bundle. If NBA 2K1 costs $50 - $60 now at Amazon, but the GameStop bundle still values it at $70, don't buy the bundle. And if the bundle is marked up tremendously, like we see from third-party marketplace sellers, don't buy the bundle.",
    "Otherwise, embrace the bundle. I wish I did sooner.",
    "I mostly stuck to Amazon, Best Buy and Walmart when initially looking for my PS5. That was a mistake. Amazon has had very few restocks since launch, while Best Buy and Walmart require constant refreshing – the page often crashes until they sell out.",
    "From the many tweet replies I've gotten, followers have seen biggest success from GameStop, Target and ANTonline. GameStop has been the easy for people to get (see my point about the bundle), while Target lets you do in-store pick up after an online order (don't show up at the store without a confirmed purchase).",
    "ANTonline is a newcomer to a lot of people, but from the feedback I've gotten over the past month, the tech-focused store ships the fastest. Their loaded bundles also sell out in three to five minutes, which is a lifetime in the PS5 restock world.",
    "I would be hesitant to trust stores outside of this list simply because there have been several scam sites trying to sell the PS5. You'll get neither your PS5 nor your money back, especially if you're asking you to use Apple Pay or the Cash App (they'll say they accept PayPal initially, but then switch it on you saying it's not working).",
    "It's very easy to think that the hard part of a PS5 restock is getting the console into your virtual basket. But it's at checkout where I've found the biggest issues.",
    "Sony PlayStation Direct, Sony's official online store for its gaming brand, works as a lottery system, and if you get picked, it gives you just 10 minutes to checkout. This means you'll have to decide on the shipping speed (paid PlayStation Plus members get extra fast 1-2 day shipping), fill in your address and enter your credit card info.",
    "I made the mistake of using American Express, a credit card that isn't supported by Sony Direct. When I tried to use a different card, the original error message wouldn't go away. I could only refresh the page, at which point the console was gone from my cart and I was booted back into the lottery line with no chance of getting it again.",
    "The next week, when I got through Sony's queue, I used Visa. It too was rejected. Someone on Twitter suggested I disable all pop-up blocks, adblockers and Chrome extensions. Something may be conflicting with Sony's website, leaving me unable to complete the transaction. So far, I haven't gotten picked again to test that theory.",
    "My desire to own a PS5 ebbs and flows. Before Christmas, I really wanted one. Then I saw success with an Xbox Series X restock. I only tried for Sony's console a few times in January. By mid-February I was at it again and started the PS5 restock tracker.",
    "I've also been burned by being distracted – often tweeting out advice but not paying attention to my cart or captcha verification questions. I've failed so many that surely some of these online ordering processes think I'm a robot.",
    "Persistence has been the No.1 trait of successful PS5 buyers, according to the many replies I've gotten on Twitter. People who started following me at 21,000 followers have been jumping on every notification I sent them for a month – and have been trying for four months total. Some have only finally seen success. They usually say \"I was about to give up, but...\"",
    "Too many people try for a week and hit a page that says 'Sold out' or 'Out of stock'. Knowing that this is common and that PS5 inventory releases in waves is key. Often times these folks go away, then Best Buy, Target or Walmart turns the 'Add to cart' page on again and others get it. it's frustrating, but keep at it.",
    "While writing this, I had some late-breaking success, though I'm still waiting to see if it's going to transpire into a PS5. During the most recent GameStop PS5 restock, I snagged a bundle (again point 2 for the win), and I'm waiting on delivery.",
    "Will I enjoy Spider-Man: Miles Morales? Will I ever need that second controller? It doesn't matter as much as getting the console in hand at this point.",
    "I've gotten so far before that I won't be 100% certain that the PS5 is mine until I have it in my hands. Four months is too long to wait to own a console, and I'm of the same mindset of many people. I've already burned through the best Netflix shows and best Disney Plus shows, and I'm eager for more interactive entertainment."
  ],
  "headers": {
    "7": "1. I wasn't following a PS5 tracker account",
    "10": "2. I didn't embrace the PS5 bundle – you should",
    "15": "3. I wasn't checking all PS5 stores",
    "19": "4. I used the wrong credit card to buy PS5",
    "23": "5. I didn't have the dedication to buy PS5",
    "27": "Late-breaking success: happy PS5 ending?"
  },
  "links": {
    "PS5 restock tracker": "https://www.techradar.com/news/ps5-restock-tracker-weekend-march/news/ps5-restock-twitter-tracker-saturday-february-27",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Jake Randall": "https://twitter.com/Jake_Randall_YT",
    "Cameron Ritz": "https://twitter.com/CameronRitz",
    "Chito Gaming": "https://twitter.com/ChitoGaminYT",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "PS5 accessories": "https://www.techradar.com/best/ps5-accessories",
    "NBA 2K1 costs $50 - $60 now at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNBA-2K21-PlayStation-5-Standard%2Fdp%2FB08D7DKLPC%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9983619288757930000-20",
    "PlayStation Plus": "https://www.techradar.com/news/playstation-plus-deals",
    "Xbox Series X restock": "https://www.techradar.com/news/xbox-series-x-restock-at-gamestop-date-and-time-confirmed-heres-when",
    "best Netflix shows": "https://www.techradar.com/best/best-netflix-shows",
    "best Disney Plus shows": "https://www.techradar.com/best/best-disney-plus-shows"
  }
}