{
  "source": "https://www.techradar.com/news/ready-for-what-is-motorolas-dex-alternative-and-how-does-it-work",
  "title": "Ready For: what is Motorola’s DeX alternative, and how does it work?",
  "category": "phones",
  "updated": "2021-03-25T13:59:19.883Z",
  "author": "tom-bedford",
  "summary": "Hope you're Ready For it",
  "article": [
    "Debuting alongside the Moto G100 (though technically, and seemingly accidentally, unveiled a week prior) is Ready For. This is Motorola’s own multitasking mode, in the same vein as Samsung’s DeX, which does much the same thing for Samsung phones.",
    "With Ready For, you can plug your smartphone into a computer monitor, TV, or any other HDMI-compatible screen, and access a range of functions, like improved video calling and the ability to stream video via your phone onto the larger display.",
    "Currently, Ready For works with the Motorola Edge Plus and Moto G100, but the company has confirmed future phones will be compatible too. Below, we’ll run you through what Ready For does, and how you can use it.",
    "There are two phones that are compatible with Ready For, at the time of writing. They are the Motorola Edge Plus and Moto G100, so you’ll need one of these devices to access the service - other handsets, even Motorola ones, won’t work.",
    "You’ll also need a USB-C to HDMI cable to connect the phone to your external monitor - the Moto G100 comes with one, as well as a dock, though you technically don’t need the dock to use Ready For.",
    "Finally, you’ll need an external monitor to connect to - by this we mean a computer screen or a TV - we also used Ready For alongside a projector. If you don’t have such a display, we’ve got a guide to the best monitors you can buy.",
    "Some of Ready For’s functions also need extra gadgets. For example, the gaming function requires a Bluetooth games controller, and the work mode is much easier with a Bluetooth mouse and keyboard.",
    "Make sure your phone is charged up too. While using Ready For, your phone doesn't actually get charged (despite being plugged into the other device), so you'll be draining power as you work.",
    "One of Ready For’s main uses is to turn your phone into a portable work station, for productivity reasons. You can plug the phone into a monitor, then see your emails and various apps (like Google Docs) all at the same time and on a bigger display than your phone's.",
    "The Ready For operating system works a lot like Windows, so you can open multiple different apps and tabs at the same time.",
    "It’s easiest to do this if you have a Bluetooth keyboard and mouse, so you can type and click away just as if you were on a computer. You can use the phone as a trackpad if you want, but this isn’t anywhere near as convenient as an actual mouse.",
    "We found Ready For quite useful for multi-tasking using various apps, but we weren’t using a mouse and keyboard, which would have made productivity much smoother.",
    "Ready For is pretty useful for video calls, working with a range of apps like Google Meet, Duo, Messenger, and more. This lets you use your larger monitor to see the people on the call, while the phone cameras are used for your video.",
    "That’s not all, though - AI software in the camera makes you look better on calls by automatically following you if you move around, so you can walk from one side of the room to another and everyone on the call will always see a close crop on you.",
    "You can choose how close this crop is, and how sensitive Ready For is with following you, but it’s useful for people who wander about on calls, like if you’re teaching a class a practical activity.",
    "We found this crop incredibly accurate, and there’s clearly some smart software at work here. It was also really useful to be able to choose which phone lens to use for the call (standard or ultra-wide on the Moto G100) depending on our setting.",
    "Ready For can work a bit like a Chromecast (well, a wired version) as you can use it to stream media from apps like Netflix and Google Play Video.",
    "It’s pretty easy to do this - you just boot up Ready For, head over to the Media Center, and choose your app of choice. We found ourselves browsing Netflix in no time at all.",
    "Ready For actually outputs in 4K, even if your phone screen doesn’t show that, which is useful for people with monitors or TVs that show high-res content.",
    "If you’re an avid mobile gamer, you can play games through Ready For and they’ll be shown on a big screen. This works well if you’ve got a Bluetooth controller (as most console controllers are), as you can use this to game, turning your Motorola phone into a mini console.",
    "Of all the Ready For functions, this is the one we didn’t test, due to not having a Bluetooth controller. But we imagine it’s super useful for competitive games like PUBG Mobile and Call of Duty: Mobile, so you can play them on huge screens as though it’s an actual console."
  ],
  "headers": {
    "3": "How to use Ready For",
    "8": "Ready For working",
    "12": "Ready For video calling",
    "16": "Ready For streaming",
    "19": "Ready For gaming"
  },
  "links": {
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review",
    "Motorola Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "best monitors you can buy": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662"
  }
}