{
  "source": "https://www.techradar.com/news/halo-infinite-xbox-series-x-console-is-a-space-themed-monolith-how-to-get-it",
  "title": "Halo Infinite Xbox Series X console is a space-themed monolith – how to get it",
  "category": "gaming",
  "updated": "2021-08-25T19:11:18Z",
  "author": "david-lumb",
  "summary": "And a Halo Infinite edition controller is coming, too",
  "article": [
    "The Gamescom 2021 showcase finally revealed the Halo Infinite release date, but that’s not all – there will be a limited edition Halo Infinite Xbox Series X console and controller coming out, too, and preorders are live.",
    "If you've already got a system, there's also an Xbox Elite Wireless Controller patterned after the Master Chief that's up for pre-order now, too.",
    "The console pre-order is live on Microsoft's Xbox store for $549 / £479 (around AU$755), and pre-orders should go live soon on other retailers.",
    "The console itself dresses up the Xbox Series X with a Halo-themed skin – sorry, there’s not a speck of Master Chief green in sight, but series fans will appreciate the geometric gray and black with burnished gold detail as feeling a bit more USMC, making the ‘black fridge’ console look a bit more like the Pillar of Autumn. The top of the console has a cool starfield effect, so perhaps it’s more like peering out of a cockpit? Interesting choices here.",
    "Xbox Senior Marketing Manager Josh Munsee first tweeted the news, which was followed up by an official tweet with pre-order link:",
    "The limited-edition Xbox Series X’s controller gets its own skin, too, with the same light gray and black-rimmed with gold look. Munsee confirmed in a follow-up tweet that fans won't be able to buy this separately, so your way way to get a new one is ordering the limited edition console outright.",
    "For fans who desperately need Halo flavor in their gamepads, the Xbox Elite Wireless Controller Series 2 – Halo Infinite Limited Edition (phew) is up for pre-order here for an eye-watering $199 / . This controllers is properly Master Chief themed, with the Spartan's signature green over the thumbsticks and buttons while the grips are wrapped in black, along with a bit of Mjolnir-armor-helmet-visor gold on the d-pad.",
    "Details on the console are coming in quickly – Munsee tweeted in a follow-up that “pre-order pages will be going up as quickly as retail partners can get them live.” It’s unclear how much stock they’ll have available, but given Munsee’s first tweet mentioning the supply “will BE LIMITED,” hopefully fans will be able to snag one."
  ],
  "headers": {
    "6": "The Master Chief gets his own controller"
  },
  "links": {
    "Gamescom 2021": "https://www.techradar.com/news/gamescom-2021-the-best-games-of-the-show",
    "Halo Infinite release date": "https://www.techradar.com/news/halo-infinite-finally-has-a-release-date-and-its-sooner-than-youd-think",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "live": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9572366472275743000&murl=https%3A%2F%2Fwww.xbox.com%2Fen-US%2Fconsoles%2Fxbox-series-x%2Fhalo-infinite-limited-edition",
    "tweeted": "https://twitter.com/joshmunsee/status/1430599466864635905",
    "tweet": "https://twitter.com/joshmunsee/status/1430606028874215425",
    "here": "https://twitter.com/joshmunsee/status/1430606028874215425"
  }
}