{
  "source": "https://www.techradar.com/news/smart-pos-terminals-could-be-the-future-for-digital-payments",
  "title": "Smart POS terminals could be the future for digital payments",
  "category": "computing",
  "updated": "2021-07-06T09:45:52Z",
  "author": "rob-clymo",
  "summary": "Consumer demand for a wider array of payment options is driving growth",
  "article": [
    "The number of smart point-of-sale (POS) terminals is set for a major increase over the next few years as retailers and customers alike embrace the technology, new research has claimed.",
    "A Juniper Research study found demand for smart POS systems is soaring as features including analytics and loyalty data can now be integrated into the terminal itself, with the number of devices set to increase from 13.7 million units in 2021 to 35 million by 2026 - a growth of 156%.",
    "Businesses are looking for increasingly sophisticated payment systems as consumer desire for making digital payments continues to grow, and Juniper’s prediction is that the smart POS marketplace will see huge growth if the trend continues.",
    "The benefits of smart POS systems are many and varied, with the rapidly evolving tech able to handle the likes of inventory management, synchronization across stores and full automation of loyalty schemes, all of which gives consumers a wider range of options at the digital checkout, alongside the likes of QR code payments.",
    "Increasingly, POS hardware has to do much more than older, outdated point-of-sale terminals. The research suggests that by 2026 some 57% of all payments via POS systems will be contactless globally. The figure is just 25% currently, with the growth being helped by increasing contactless payment limits that allow consumers more freedom at the e-commerce checkout.",
    "POS manufacturers are therefore being encouraged to integrate new capabilities into their hardware and software systems. In addition, the report findings also suggest businesses should factor in the provision for more mobile-based POS terminals for those still operating in physical bricks and mortar stores.",
    "Similarly, soft POS – the ability to use Near Field Communication (NFC) on mobile devices in order to accept contactless payments – will increase in the near future. This could be key for small business owners because it offers a more affordable way of accepting card payments.",
    "Indeed, soft POS payments could increase from the current 3.2 million in 2021 to nearly 24 million by 2026 based on current usage trends. However, the profile of soft POS systems needs to increase due to it not currently being an instantly recognisable payment option for consumers."
  ],
  "headers": {
    "4": "Smart POS"
  },
  "links": {
    "POS": "https://www.techradar.com/news/the-best-pos-system",
    "POS systems": "https://www.techradar.com/news/how-to-choose-a-pos-system-for-a-small-business",
    "digital payments": "https://www.techradar.com/news/more-than-61-billion-people-will-use-digital-payments-by-2023",
    "smart POS": "https://www.techradar.com/news/global-pos-sales-to-top-dollar173-trillion-worldwide-by-2026",
    "digital checkout": "https://www.techradar.com/news/more-and-more-shoppers-are-picking-digital-wallets",
    "QR code payments": "https://www.techradar.com/news/qr-codes-finally-find-their-groove-during-the-pandemic",
    "POS hardware": "https://www.techradar.com/news/how-much-does-a-pos-system-cost-what-you-need-to-know-about-software-and-hardware-prices",
    "contactless": "https://www.techradar.com/news/best-mobile-payment-app",
    "e-commerce checkout": "https://www.techradar.com/best/best-shopping-cart-software",
    "mobile-based POS": "https://www.techradar.com/news/mobile-pos-to-account-for-half-of-digital-payments-by-2024",
    "Near Field Communication": "https://www.techradar.com/news/what-is-nfc",
    "small business": "https://www.techradar.com/best/best-small-business-software"
  }
}