{
  "source": "https://www.techradar.com/news/quibis-short-form-shows-could-be-snapped-up-by-roku-according-to-report",
  "title": "Quibi’s short-form shows could be snapped up by Roku, according to report",
  "category": "entertainment",
  "updated": "2021-01-04T19:38:22Z",
  "author": "emma-boyle",
  "summary": "A chance of a new home",
  "article": [
    "The mobile-first streaming platform Quibi may have lived a short, unsuccessful life but there’s a chance its content could live on, if a recent report is accurate.",
    "According to the Wall Street Journal, Quibi is engaged in “advanced talks” to sell the streaming rights of its catalog of short-form shows to Roku Inc. If the deal goes through, Roku would be able to exclusively release Qubi’s library of original content on the free, ad-supported Roku channel.",
    "While the report states that there's every chance the deal could fall through, if it went ahead it could be a small saving grace for Quibi after its disappointingly short life.",
    "Set up as a mobile-first streaming service by Jeffrey Katzenberg in April 2020, Quibi’s focus was on offering short-form content geared towards mobile viewers low on time. It could have been great in a world with widespread commuting, but with the coronavirus pandemic keeping people around the world at home, it seems like it was always facing an uphill battle.",
    "Despite securing some good shows with big names like Liam Hemsworth, Anna Kendrick and Sophie Turner attached, Quibi wasn’t able to bring in the numbers it needed and its shutdown was announced in October 2020 before the app stopped functioning entirely last month.",
    "Although they weren’t enough to keep Quibi afloat, there’s a chance some of its shows could be beneficial to Roku. Roku is known for its streaming hardware rather than original content so if it did acquire the rights to Quibi’s content, it would have something distinctive to offer on its own channel, on its own devices.",
    "If Roku wanted to get into original programming it would mean facing competition from long-established services like Amazon and Netflix; acquiring the rights to Quibi's catalog could be a faster and more cost-effective way for Roku to test the waters. There's a chance some of Quibi's shows could actually take off on the Roku platform given the huge popularity of the devices.",
    "The WSJ's report doesn’t specify any of the financial details of the deal or any individual shows which might be on the table, while Quibi and Roku themselves have declined to comment. According to the WSJ, there’s every chance the whole thing could still fall through, so we won't set our hearts on getting back into Quibi's bite-size library just yet."
  ],
  "headers": {
    "5": "Why would Roku be interested?"
  },
  "links": {
    "Quibi": "https://www.techradar.com/news/quibi-launch",
    "Wall Street Journal": "https://www.wsj.com/articles/roku-nears-deal-to-buy-rights-to-quibis-content-11609725389",
    "Roku": "https://www.techradar.com/news/video/roku-deals-1315966",
    "announced": "https://www.techradar.com/news/quibi-shut-down"
  }
}