{
  "source": "https://www.techradar.com/news/youll-soon-be-able-to-access-blockchain-domains-using-any-web-browser",
  "title": "You can now access blockchain domains using any web browser",
  "category": "computing",
  "updated": "2021-02-16T15:00:18Z",
  "author": "joel-khalili",
  "summary": "Unstoppable Domains’ .crypto web addresses also make it easier to send and receive cryptocurrency",
  "article": [
    "Blockchain domain registry Unstoppable Domains has unveiled a new service that expands access to decentralized websites to anyone with an internet connection.",
    "Courtesy of an integration with Cloudflare’s Distributed Web Resolver, the new set-up allows .crypto web addresses (of which there are roughly 500,000) to be viewed from any web browser and from any location in the world.",
    "Until now, the only way to access these websites was via a plug-in or a browser that already offers native support, such as Opera.",
    "With the new system in place, however, users can enter .crypto addresses into their browser just as they would with any other domain extension (.com, .net, .org etc.).",
    "TechRadar Pro was told that all users need to do for the change to take effect is update their DNS settings.",
    "Blockchain web domains differ from their traditional counterparts in that they are purchased for a one-off fee, as opposed to running on a subscription basis, and are not overseen by any single, centralized authority.",
    "Unlike .com domain names, for example, which are housed on a server and managed by an organization called Verisign, decentralized domains are written onto a public blockchain (which is distributed across all network participants).",
    "According to Unstoppable Domains, this system offers a “new security model”, because domain holders no longer need to worry about a central point of failure that could be exploited by hackers or lead to downtime.",
    "“In a time when data breaches have become commonplace, while privacy and ownership over an individual’s own digital assets is paramount, centralized control has been called into question by many forward-thinking people and companies,” said Matthew Gould, CEO at Unstoppable Domains. “This new system is different. It puts the control back where in should be, in the hands of the user.”",
    "An additional benefit is that owners of cryptocurrency wallets can use their blockchain domain to send and receive cryptocurrency without having to remember a long and complex alphanumeric address. To deliver a crypto payment, the sender would only need to know your human-readable domain name."
  ],
  "headers": {
    "5": "Blockchain web domains"
  },
  "links": {
    "domain registry": "https://www.techradar.com/news/best-domain-registrars",
    "web browser": "https://www.techradar.com/best/browser",
    "cryptocurrency wallets": "https://www.techradar.com/news/best-bitcoin-wallets"
  }
}