{
  "source": "https://www.techradar.com/news/could-an-apple-smart-display-ever-sound-as-good-as-the-homepod",
  "title": "Could an Apple smart display ever sound as good as the HomePod?",
  "category": "audio-visual",
  "updated": "2021-03-28T10:00:11Z",
  "author": "olivia-tambini",
  "summary": "Smart displays don’t have a great reputation for audio",
  "article": [
    "Smart displays offer a fantastic combination of smart home and screen technologies. They provide a visual way to interact with voice assistants, whether that be controlling your smart home devices, watching cooking videos, or making video calls to loved ones.",
    "However, even the very best smart displays have struggled to match the audio performance of screen-less speakers. So, with the news that the next Apple HomePod may come with a display, we’re left wondering how the tech giant could mitigate some of the sonic drawbacks that come with the addition of a screen, and ensure its smart display sounds as good as the now discontinued Apple HomePod.",
    "It could be argued that, if audio performance is such a big concern, you should really buy a regular smart speaker instead of a smart display. However, with Amazon and Google touting improved audio with every new model they launch, it’s clear that sound still matters to those who want a screen accompanying their smart assistant.",
    "While the rumors of an Apple smart display remain just that, rumors, we're excited to see how the company could beat its biggest rivals in the smart home market by ensuring its first speaker with a screen delivers class-leading sound.",
    "The problem with smart displays is that the screen means there’s less room for large, powerful drivers – and that means sound quality can suffer as a result.",
    "This isn't a huge problem if you’re using a smart display as a connected desk buddy or a clever bedside alarm clock, but if you want your display to double up as your main music playback device, you’ll likely be disappointed.",
    "Amazon has recently tried to tackle this problem with the Echo Show 10. It looks like a smart speaker with a screen stuck on its front, with one-inch front-firing tweeters and a three-inch woofer.",
    "While we've found that Amazon’s approach has led to a more powerful sound than most smart displays offer, we found it too bass-heavy to appeal to audiophiles – or to really do your music justice.",
    "However, one benefit of Amazon's approach is that it allows the Echo Show 10’s screen to rotate, following you around the room as you go about your day. Still, it perhaps isn't the most elegant solution, taking up a rather large footprint compared to traditional smart displays.",
    "For that reason, we’re not sure Apple would opt to go down this route if it did release a smart display in the near future. The tech giant is notorious for favoring sleek designs and clean lines, from the Apple AirPods to its MacBook range of laptops.",
    "It’s more likely that Apple would look to devices such as the Google Nest Hub Max for inspiration, which looks a little like an Android tablet affixed to a sloping speaker base. It’s less imposing than the Echo Show 10, but still provides a decent-enough audio performance for casual music listening.",
    "However, if Apple wants to appeal to more discerning ears, it will take more than a carbon copy of the Nest Hub Max.",
    "If Apple chose not to add a large separate speaker such as the Echo Show 10, it would need to find another solution to improve the audio quality of its first smart display – and it could look to the world of TVs for inspiration.",
    "As TV panels have become thinner and thinner, the sound quality you can expect from even the best TVs has taken a nosedive. Of course, you can boost your TV’s audio performance with soundbars and surround sound systems, but manufacturers such as Sony want its televisions to sound great on their own.",
    "For example, Sony OLED screens use Acoustic Surface audio technology to deliver immersive sound (literally) from the surface of the TV screen. We’ve seen several iterations of Acoustic Surface audio since its launch, most recently Acoustic Surface+, but all adopt the same approach.",
    "Rather than utilize conventional speaker drivers, be they forward- or downward-firing, the Sony system relies on actuators that literally vibrate the television’s panel, in turn creating treble and mid-range audio.",
    "However, OLED displays are expensive, and with most smart displays utilizing LED or LCD screens, an OLED smart display would come with a higher price tag than most of the competition. Using a cheaper LED or LCD panel with this technology isn’t an option, since backlighting would prevent the display from vibrating properly.",
    "Of course, high costs haven't stopped Apple before – just look at the AirPods Max.",
    "With so many obstacles to overcome, you may be under the impression that smart displays are unlikely to ever sound as good as regular smart speakers. We certainly wouldn’t expect Apple’s rumored smart display to sound as good as the original HomePod.",
    "And that’s okay – smart displays aren’t designed to be your sole source of listening to music. Still, there's always room for improvement, and in our opinion Apple could well be the brand to transform the current reputation smart displays have of delivering poor-quality audio.",
    "The company has certainly proven that it can provide decent sound from smaller devices such as the Apple HomePod mini – and by looking to the latest TV technologies, it could give Amazon and Google a run for their money."
  ],
  "headers": {
    "4": "Why do some smart displays sound bad?",
    "12": "A better-sounding screen",
    "18": "Why not buy a regular smart speaker?"
  },
  "links": {
    "smart home devices": "https://www.techradar.com/news/smart-home-devices",
    "best smart displays": "https://www.techradar.com/best/best-smart-displays",
    "the next Apple HomePod may come with a display": "https://www.techradar.com/news/next-apple-homepod-could-come-with-a-screen-to-rival-the-amazon-echo-show-10",
    "Apple HomePod": "https://www.techradar.com/reviews/apple-homepod-review",
    "smart speaker": "https://www.techradar.com/news/best-smart-speakers",
    "best TVs": "https://www.techradar.com/news/best-tv",
    "soundbars": "https://www.techradar.com/news/audio/home-cinema-audio/tr-top-10-best-soundbars-1288008",
    "surround sound systems": "https://www.techradar.com/best/surround-sound-systems",
    "OLED": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "Apple HomePod mini": "https://www.techradar.com/reviews/apple-homepod-mini"
  }
}