{
  "source": "https://www.techradar.com/news/peloton-is-reportedly-working-on-a-heart-rate-monitoring-wearable",
  "title": "Peloton is reportedly working on a heart rate-monitoring wearable",
  "category": "wearables",
  "updated": "2021-06-22T23:34:21Z",
  "author": "axel-metz",
  "summary": "Wear your heart on your sleeve",
  "article": [
    "Home fitness giant Peloton is reportedly developing a new wearable.",
    "As per a recent Bloomberg report, the device – which is referenced within the code of the company’s iPad and iPhone apps – looks likely to be a heart rate-monitoring armband that will connect to Peloton bikes and treadmills.",
    "The report also claims the wearable will feature a small, battery-displaying screen, and arrive in two different sizes. Although the company already offers a low-budget heart-rate monitor in its accessories store, this would mark its first fully-fledged wearable product.",
    "As well as pairing with Peloton’s bikes and treadmills, rumors indicate the armband will also wirelessly connect with any device – phones, tablets, TVs etc. – running the company’s app.",
    "These new reports arrive shortly after Peloton acquired Atlas Wearables, a Texas-based company whose devices use movement detection to identify different indoor exercises and count reps.",
    "Whereas companies like Garmin and Polar specialize in GPS devices for use outdoors, Atlas is one of very few names focusing on indoor (read: gym) sessions, which suggests the partnership could be a great fit to establish Peloton in the fitness wearables game.",
    "A Peloton-branded armband would face tough competition, though, from competing brands like Apple – which launched its own on-demand workout service, Apple Fitness Plus, last year.",
    "Still, if Peloton is able to produce a wearable that does more than simply display your heart rate on-screen, it may be able to pull consumers away from flashier competitor products with little functionality.",
    "As well as its low-budget heart-rate accessory and companion app, Peloton has previously ventured into wearables of a different sort, too.",
    "Earlier this year, the company collaborated with apparel titan Adidas on a range of branded sportswear, including leggings, sports bras, t-shirts and shorts.",
    "Unsurprisingly, though, those particularly-exclusive garments are no longer available to buy – so an all-new type of Peloton wearable can’t come soon enough.",
    "Don’t expect this heart rate-monitoring armband to blow away products like the Fitbit and Apple Watch, mind, but it will certainly be intriguing to see how the home fitness behemoth fares in the wearables market.",
    "Via The Verge"
  ],
  "headers": {
    "8": "In vogue"
  },
  "links": {
    "Peloton": "https://www.techradar.com/news/peloton-everything-you-need-to-know-about-the-workout-streaming-service",
    "Bloomberg report": "https://www.bloomberg.com/news/articles/2021-06-22/peloton-plans-armband-heart-rate-monitor-in-push-into-wearables?sref=9hGJlFio",
    "Peloton acquired Atlas Wearables": "https://www.techradar.com/news/peloton-could-soon-launch-its-own-fitness-tracker",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "The Verge": "https://www.theverge.com/2021/6/22/22545560/peloton-wearble-heart-rate-monitor-fitness"
  }
}