{
  "source": "https://www.techradar.com/news/samsung-launches-new-75-inch-outdoor-tv-for-those-sunny-days",
  "title": "Samsung launches new 75-inch outdoor TV for those sunny days",
  "category": "televisions",
  "updated": "2021-03-02T18:00:55Z",
  "author": "becca-caddy",
  "summary": "The Terrace TV is weather-resistant for outdoor viewing",
  "article": [
    "Samsung’s The Terrace is a TV built for the great outdoors. This QLED TV is weather-resistant and designed to be viewed in outside spaces, like balconies, gardens or patios – and Samsung has launched a new 75-inch version, The Terrace Full Sun model 2.",
    "The Terrace TV is a weather-resistant QLED TV, which means it has an IP55 rating in order to protect the high-end tech from rainfall and dust. Whether you put it up near an outdoor dining area to give you and your guests something to watch while enjoying dinner and drinks, or plan on using it to create your own outdoor home cinema experience, it’s designed to weather the elements.",
    "Another big consideration with watching outside is brightness. But The Terrace comes with a 4K HDR screen with an average brightness of 2,000 nits and peak brightness of 4,000 nits, meaning it should be able to showcase HDR objects even in super bright surroundings – there’s also a special film on the screen that will reduce glare.",
    "While already available in 55-inch, 65-inch and 75-inch models, The Terrace is getting a new 75-inch iteration for 'full sun', meaning that it can output visible images even in very bright light.",
    "If you're looking for a TV for an outdoor space and live in an area that gets plenty of sunshine or want to set it up in a spot with very little shade, this might be the option for you.",
    "The Terrace TV is, obviously, not aimed at those with middling budgets and regular homes. This is a luxury TV for those who can afford to deck out their homes with the latest Samsung tech both inside and out.",
    "As you’d expect, the prices are high. You can get the 55-inch model for $3,499 / £3,999 the 65-inch model for $4,999 / £4,999 and $6,499 / £6,499 for the 75-inch. The price for the newest version, The Terrace Full Sun model 2, hasn’t been announced yet, but we expect it to be on a par if not slightly more than the price tag for the existing 75-inch set.",
    "The Terrace TV has been available in the US and Canada since early last year but only became available in the UK in last November."
  ],
  "headers": {
    "5": "Shining bright"
  },
  "links": {
    "The Terrace": "https://www.techradar.com/news/take-your-samsung-tv-outdoors-with-this-weatherproof-qled-display",
    "QLED TV": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "home cinema": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "available in the UK": "https://www.techradar.com/news/samsungs-outdoor-qled-tv-is-coming-to-the-uk-and-europe-whatever-the-weather"
  }
}