{
  "source": "https://www.techradar.com/news/motorola-shows-off-the-moto-edge-x30-but-you-may-not-be-able-to-buy-it",
  "title": "Motorola shows off the Moto Edge X30 – but you may not be able to buy it",
  "category": "phones",
  "updated": "2021-12-05T10:30:50Z",
  "author": "david-nield",
  "summary": "With the Snapdragon 8 Gen 1 on board",
  "article": [
    "A few days ago Motorola promised that it would be launching a flagship-level smartphone sometime this month, and it's now used one of the company's official social media accounts to show off the Moto Edge X30 to the world.",
    "The single, official picture was posted to the Motorola account on the Chinese social network Weibo (via GSMArena), and gives us our first proper look at the Moto Edge X30 device, with slim display bezels and a punch hole camera up at the top of the screen.",
    "Before you get too attached to it though, it's important to note that we're not exactly sure which markets this phone will be coming to. It's definitely launching in China first of all, but it's unclear whether it will eventually find its way to the US, Europe, and other regions.",
    "What makes the Moto Edge X30 particularly notable is that it's set to be one of the first phones running on the Snapdragon 8 Gen 1 chipset that was just unveiled by Qualcomm – a chipset that is likely to be powering a lot of top-end Android phones throughout 2022.",
    "Motorola has made some of the other specs of this phone official too: we know the display is going to come with a 144Hz refresh rate, support for HDR10+ content, and the ability to display more than a billion colors.",
    "Unofficially, we've also heard that the handset is going to come sporting a display that's 6.67 inches from corner to corner. Apparently it will also come with a triple-lens 50MP+50MP+2MP rear camera. It's scheduled to be unveiled in full on December 9.",
    "The Moto Edge X30 will be one of the very first phones that we see running the Qualcomm Snapdragon 8 Gen 1 chipset, but many more handsets will follow. As with any processor launch from Qualcomm, there are a bunch of new features to look forward to.",
    "For a start the chipset is going to enable always-on cameras – not to keep you constantly under surveillance, but to enable functionality like hands-free unlocking (because your phone will be able to recognize who you are while it's doing other tasks).",
    "There are also updates in terms of reducing background noise on phone calls, and in getting up to internet speeds of 10Gbps. If you have access to the latest and greatest 5G connections, then the Snapdragon 8 Gen 1 is going to make sure that you're always hooked up at the fastest speeds possible.",
    "Then there are the performance improvements as well of course: the chipset is going to mean the Android phones of 2022 will be faster and more capable than ever, with a jump of around 20% in terms of speed over the Snapdragon 888."
  ],
  "headers": {
    "3": "Official and rumored specs",
    "6": "Analysis: the Snapdragon 8 Gen 1 future"
  },
  "links": {
    "Motorola promised": "https://www.techradar.com/news/new-motorola-edge-is-coming-in-just-a-few-days-but-it-may-be-a-china-exclusive",
    "GSMArena": "https://www.gsmarena.com/motorola_moto_edge_x30_live_image_display_specs-news-52142.php",
    "Snapdragon 8 Gen 1": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do"
  }
}