{
  "source": "https://www.techradar.com/news/google-io-2021-live-blog",
  "title": "Google IO 2021 event recap: Android 12, Wear OS tweaks and big Google Maps changes",
  "category": "phones",
  "updated": "2021-07-15T14:18:07Z",
  "author": "matt-swider",
  "summary": "Everything from Google's big keynote",
  "article": [
    "Our Google IO 2021 keynote live blog is now over, but we've left everything together below so you can see how the event unfolded as Google revealed new upgrades such as Android 12, tweaks to Wear OS and a variety of other new software reveals.",
    "Android 12 is perhaps the most exciting addition with a whole new look for smartphones, plus the company confirmed a variety of new changes to Google Maps as well.",
    "We were gearing up to see the Google Pixel 5a, Pixel Buds A and Pixel Watch, but there wasn't any hardware at the event. It may be that Google announces this at a later date, but that's currently unclear.",
    "Below you'll find our commentary of what happened at the keynote, but before that we have specific articles on a variety of announcements and details about the upcoming Google IO show that lasts until May 20.",
    "Google's developer conference is taking place from Tuesday, May 18 through Thursday, May 20. The main keynote has already been and gone (that's what the live blog below is about) but there will be more shows going on throughout the next few days.",
    "This is a developer focused show, so a lot of these events will be specialist for developers who want to learn how the new changes to software will impact their work.",
    "All times are in Pacific Standard Time (PST)",
    "11:56am: Our Google IO 2021 live blog is over, mainly because Sundar just closed us out. Like all Google keynotes, things get a little boring at stretches when it goes into non-consumer elements – but that's the point of IO... it's a developer conference.",
    "If you missed below, Google announced Android 12, Android 12 beta 1 (and which devices it'll be on) and some great AR-based Google Maps upgrades in case you're like me and get lost indoor sprawling cities like Las Vegas (during CES). We'll have more Google IO coverage today, as we whip up new content. Stay tuned.",
    "11:43am: Google is going green – more than it already is. And it wants you to know it It's implementing carbon-intelligent load shifting across time and place within data center network. Going beyond wind and solar: geothermal.",
    "10:37am: Google's camera aren't objective, according to the company and it's now addressing racing and changing computational photography algorithms to better capture curly and wavy hairstyles.",
    "10:30am: Remember when Google bought Fitbit? It's now making use of the company with its Wear OS platform. Fitbit's way better health tracking progress and celebrations coming are coming to Wear OS. Fitbit will design new watches based on Wear OS too. This is good news. Leave it to the experts, where Google has been a bit lackluster among recent wearables.",
    "11:25am: The next Samsung Galaxy watch is teased, and it'll be available with the Google Play Store right on the device. This could fix everything we disliked about the Samsung Galaxy Watch series. And with promises like 30% faster app start times, smoother transitions and significantly longer battery life (they mentioned this four times), Apple's watchOS software may finally have a rival after six years.",
    "11:30am: Samsung and Google announcement: Wear OS and Tizen are working together, which is actually good news for both companies (and consumers). Google's battery life and processing have left its smartwatch operating system hobbled. Tizen is used as Samsung's watch operating system, and it doesn't have wide enough adoption (just Samsung devices) to get developers involved in apps – it's just not worth it. This could be a game-changer.",
    "Android 12 beta 1 is coming to a phone near you soon – device makers are allowing you to test drive it on phone from 11 device makers. Hmmm... they couldn't make it 12 just for thematic reasons?",
    "11:25am: The theme of the next slide is Better Together. You can sign into a Chromebook with your nearby phone with one tap. Your TV remote features are being built directly into your phone and works with Android TV OS right out of the box.",
    "11:21am: Google gave its tech a name: Private Compute Core: making your phone safe, private, and local. Now Playing and Smart Reply get personal without having data leave the device. Happens exclusively on the device and isn't going out through the network, according to Google.",
    "11:20am PST: Google is again talking about how to keep your information safe, this time in Android 12. Again, it seems like Apple is pushing this conversation and Google is trying to be part of the narrative.",
    "11:19am: There are 3 billion Android devices around the world, and Google is about to announce Android 12! Finally.",
    "Everything is being overhauled in the design – colors and shapes especially. Color extraction will pull key colors from your phone's wallpaper and create a custom color palette. This is coming to Google Pixel phone first this Fall.",
    "11:10am: Google is thinking outside of the usual palette box with Material You – a way to allow users to change up the UI (mostly with changing colors and shapes) to suit your own style. The very flowery shirt of the present shows that Google is serious about letting people make their own 'tasteful' style choices.",
    "11:05am: There are 4 trillion photos and videos stored on Google photos right now! And yet most are never viewed. Two astounding facts. New features will help you find old photos by resurfacing them.",
    "You'll be able to find shared patterns across photos to create a series – which sounds neat. The example given: maybe identifying an orange hiking backpack on a trip. The object stays the same, but your journey shifts, telling a story on where you've been and how you got there.",
    "10:59am: Google Shopping is getting some upgrades, which is a low bar to begin with. Google wants us to use Google Lens to look at products that it'll find online. You'll be able to start with a search of images, open that image, find a product, and then the proper find retailer. You'll even be able to search within a screenshot.",
    "10:56am: Detailed Street Maps is coming to 50 new cities by the end of the year, so if you're going through New York City's Columbus Circle, you'll know where the sidewalks and crosswalks are for extra safe touristing.",
    "10:54am: This is exactly what I want in life, especially in confusing sprawling places like Las Vegas every year during CES. Bring it on, Google.",
    "10:53am: AI is finally coming to Google Maps to provide game-changing indoor directions for those of us who get confused about where to go in places like airports. Live View in helps you see where to go in AR. Bringing Live View indoors for hard-to-nav buildings - coming this week to some places in Zurich and Tokyo next month.",
    "10:49am: 100+ improvements from AI coming to Maps, and this seems like the first big announcement of today's Google IO liveblog. At least among consumer-facing new features. Small things make a difference, like showing cafes in morning and restaurants after work or landmarks/attractions when you’re somewhere new. It also shows busier AREAS, not just busy restaurants. Coming globally in coming months.",
    "10:46am: Google's MUM tech (multitask unified model) is here to break down multiple barriers. \"Can I use these to hike Mt. Fuiji\" you ask, pointing your Google Lens to hiking boots. It'll know what 'these' refers to, use image recognition to determine what's being seen and find an answer across the 75+ languages it understands – maybe that answer is only available on a Japanese website.",
    "10:43am: Google Photos is going to include a password-protected locked folder so you can hide photos and videos that aren't meant for wandering eyes. The example was hiding surprise new \"puppy\" photos. Oh, how innocent of an example, Google.",
    "10:42am: You'll now be able to delete the last thing you searched. The on-screen illustration shows the ability to delete data from the last 15 minutes (that's at least the default time frame). It seems very easy.",
    "10:40am: Federated learning is Google's Cookies killer. Stuff is learned without ever leaving your device. Android's private computer core is supposed to process and protect data.",
    "10:38am: Google wants to make the web more private and secure, which has always been difficult for the company since many of its finances are based on your data (though not necessarily selling your data). Apple has really pushed this privacy topic to the forefront, and Google is being forced to follow suit.",
    "10:36am: Google will import passwords saved in other password managers. It'll have deeper integration between Chrome and Android so your passwords go with you from sites to apps. Chrome will tell you if your passwords are involved in a security breach. Google Assistant will direct you to your compromised accounts and allow you to change the passwords in seconds.",
    "10:35am: The No. 1 threat? Bad passwords. 2/3rd of people reuse the same password across accounts. Google's solution is phone-based authentication and suggested passwords.",
    "10:35am: 100 million Phishing attempts, Google Photos encrypts four billion photos and Play Protect runs security scans on 100 billion installed apps around the world.",
    "10:34am: Google wants to help people do more with less data, highlighting auto-delete features – it'll auto-delete your past search data after 18 months by default (can of course be done sooner) unless you say otherwise. Everything is private by design, according to Sundar.",
    "10:30am: Michael Pena (I confirmed his name by none other than Google) is now part of the Google IO 2021 presentation and the Ant Man star is trying to do comedy. Clearly not the Marvel script writers on this job.",
    "10:29am: Keep with the theme, it's running these on 90% carbon-free energy. This new version will be available to cloud customers later this year.",
    "10:27am: Earlier than usual in the Google IO presentation, Sundar is talking about the company's machine-learning Tensor Processing Unit, with the latest quantum computer tech being TPU V4. It's more than twice as fast as TPU V3 with 4096 V4 Chips in a pod. TPU V4 pod can deliver more 10^18 flops.",
    "10:24am: Ok, in all seriousness, LaMDA could be a fun and interesting way for people, especially kids, to learn about Pluto (or any topic) by giving it a voice.",
    "10:20am: Important Update: Pluto is not a planet, according to our friends at Space.com. Google should close its doors by the end of the day for being this wrong during a Google IO presentation about the 'knowledge graph.' It's been a fun ride.",
    "10:18am: Is Pluto still a planet these days? Google keeps referring to it as a planet this IO live stream, as I'm unsure if that's right anymore. If it's a planet again, science needs to get its act together and stop confusing kids/me. If it's NOT a planet, Google's entire should go out of business.",
    "10:16am: Natural language breakthrough: Google's LaMDA is designed to converse on any topic and explore novel interactions. It understands a lot about a topic like Pluto, oddly conversing with the former planet. It's very strange.",
    "10:14am: What's behind Google's latest smart tech? Image recognition behind your photo data is helping the company learn. Google Lens can now take photos of math problems and solve them. Google Lens has been used 3 billion times in the last month.",
    "10:12am: Google has set out to translate the web. Usage is up 4x from last year and Google has given us a mega number: 20 billion web pages were translated by the company in the last month.",
    "10:09:am: Google Meet is popping up in more places. It'll be available directly in Docs and Sheets. Google Meet is getting special camera zoom and lighting controls for clearer shots. Live Captions and Translation is coming, too.",
    "10:08am: Google Smart Canvas is a new workspace experience announced. It'll allow you to generate plans and add tasks your team is currently working on. Goes after Asana/Monday.com/Airtable/Trello.",
    "10:05am: Chromebook are the No. 1 device globally in education K-12.",
    "10:03am: Google Maps is seeing updates with eco-friendly routes most fuel-efficient route to reduce car emissions and fuel consumption. There are also 150,000 miles of bike lanes in Google Maps.",
    "10:00am – Alphabet CEO Sundar Pichai is in Mountain View, but in front of a small group of people. Google is keeping this event safe once again. He's talking about building a more helpful Google for everyone.",
    "09:41 - It's almost time for Google IO 2021's main keynote to begin. What are you most excited for? We're hoping there will be new smartphones, wearables and new headphones as well.",
    "With Android 12 likely to take up a bit part of today's show, it may be a while until we hear about this new tech from Google. The company may even decide to just focus on software, only time will tell.",
    "Follow along with us here as we get to the event time itself, and we'll talk you through everything happening on stage while the big show is on.",
    "08:48 - Planning to watch along as Google announces its new tech? You can use the embed just above to follow everything that's happening live and you can read our breakdown of the event here.",
    "08:00 - Then there's the Google Pixel 5a, which could be the star of today's show. That may be the highlight, at least when it comes to hardware as it's always exciting when we get a new smartphone from Google.",
    "07:08 - Everything for Google IO 2021 is virtual, but in previous years the event has been a physical one where you can attend.",
    "Google canceled the May 2020 event in early March 2020, right at the advent of the pandemic when everyone had begun to shelter in place and live events felt increasingly unsafe. It seemed that redeveloping IO as a virtual event on short notice wasn't feasible at the time, though events held later in the year like Apple's WWDC 2020 were rapidly converted to online-only presentations.",
    "Google normally holds the Google IO keynote and subsequent developer sessions in physical gatherings at the Shoreline Amphitheater in Mountain View, California, where COVID-19 restrictions on large events (but not masks) will lift in mid-June.",
    "Even if Google wanted to deal with a fully-masked event or checking attendees' vaccination cards, it wouldn't want to delay the event a month and potentially mess up release schedules for its hardware. Plus, the company has likely been planning it in an online-only format for months.",
    "05:50 - So what actually is Google IO? It's the company's developer conference, so it's partly where we hear about new software updates for platforms like Android and Wear OS, but it's also an experience for third-party developers to attend conferences and learn more about Google's software platforms.",
    "The big focus is always the opening keynote, but the actual event itself is three days long so it'll be spread out from May 18 until May 20.",
    "You can view the official Google IO schedule now, where you'll find keynotes, AMAs, workshops, meetups and developer sessions. Many will be too technical for casual viewers, but you can filter the schedule to only view 'Beginner' events.",
    "We can't predict what you'll find interesting, but we're already intrigued by some of the panels ourselves. One such workshop is 'Create your first tile in Wear', using the 'latest Tiles API release'. This suggests that a big update could be coming to Wear OS or its app store, with Google's team ready to walk developers through the transition.",
    "That one's more for professionals than casual tech nerds. But we think TechRadar readers would enjoy the series of 'What's New with X' keynotes at Google IO. Topics include updates to Android, Google Play, Google Assistant, Machine Learning (AI), Chrome OS, and smart homes. All of these could expand upon the big reveals of the keynote.",
    "Plus, you can attend AMAs on specific topics and directly ask Google developers about new changes, or go to meetups themed around professional development in tech.",
    "05:15 - Will we see the Google Pixel 6 at today's big launch? It's very, very unlikely as often the company unveils its next-gen flagship phone later in the year. That said, we've seen a variety of leaks around the upcoming phone in recent weeks so we're not ruling out the fact we may hear a teaser or something of a hint at the next-gen phone.",
    "04:17 - Olivia Tambini, Audio and Music Editor for TechRadar, says \"We’ve been hearing a lot of rumors that the next Google Pixel Buds will launch at today’s event – and we’re hoping that Google has made some substantial improvements to its wireless earbuds.",
    "\"While we liked the cute, rounded design of the earbuds, the audio quality and battery life left a lot to be desired, and that means the original Pixel Buds couldn’t hold their own against the likes of the Apple AirPods. They were pretty pricey, too.",
    "\"As the next-gen earbuds are rumored to be called the Google Pixel Buds A, we’re thinking that they could be cheaper than their predecessors – Google has previously offered more budget-friendly variants of its Pixel phones with the Pixel 3a and Pixel 4a. If Google can offer better audio, a longer battery life, and a cheaper price, it could really be onto a winner.\"",
    "03:02 - Expecting to tune into the event as it happens later today? If you want to, you can watch along through Google's own livestream on YouTube using the link below. We'd recommend following along on this live blog while you do so though.",
    "02:00 - Welcome to TechRadar's Google IO 2021 live blog, where we'll be talking you through everything happening at today's big tech launch as it happens.",
    "We've heard leaks and rumors around a variety of tech announcements, so we may be seeing new hardware from Google today. We're expecting the Google Pixel 5a, Pixel Buds A and maybe even the long-rumored Google Pixel Watch as well.",
    "Google IO is where the company unveils new software, so it's very likely we'll be hearing about all the new features you can expect in the Android 12 update, and there may be improvements for its Wear OS platform as well.",
    "Stick with this live blog when the event starts, and we'll talk you through everything as it happens on stage."
  ],
  "headers": {
    "4": "What are the Google IO 2021 dates?",
    "6": "Google IO 2021 live blog"
  },
  "links": {
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Wear OS": "https://www.techradar.com/news/best-wear-os-watch",
    "new changes to Google Maps": "https://www.techradar.com/news/major-google-maps-update-includes-useful-pandemic-feature",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel Buds A": "https://www.techradar.com/news/google-pixel-buds-a",
    "Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "Pluto is not a planet": "https://www.space.com/why-pluto-is-not-a-planet.html",
    "May 2020 event": "https://www.techradar.com/news/google-io-2020",
    "WWDC 2020": "https://www.techradar.com/news/everything-announced-at-wwdc-2020",
    "schedule": "https://events.google.com/io/program/schedule?lng=en",
    "suggests": "https://www.techradar.com/news/google-io-2021-schedule-holds-a-promising-secret-for-wear-os-smartwatch-users",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "Apple AirPods": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/headphones/apple-airpods-1328292/review",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a"
  }
}