{
  "source": "https://www.techradar.com/news/star-wars-the-acolyte-prequel-show-has-found-its-star",
  "title": "Star Wars: The Acolyte prequel show has found its star",
  "category": "entertainment",
  "updated": "2021-12-09T15:38:36Z",
  "author": "tom-power",
  "summary": "The Acolyte lands a Dear Evan Hansen star",
  "article": [
    "Star Wars: The Acolyte, the upcoming Disney Plus prequel series, has reportedly found its lead actor.",
    "According to Variety, Dear Evan Hansen and The Hunger Games star Amandla Stenberg has been cast in the main role for the live-action TV show. Details of who Stenberg is portraying is still under wraps, but it's thought that the US-born actress will play a Sith apprentice during the height of the High Republic era.",
    "Representatives from Lucasfilm and Stenberg's team declined to comment on the rumor when asked for a response by Variety. But, given that such a stance is usually a coded way of confirming online speculation, Stenberg is likely to be announced as The Acolyte's lead sooner rather than later.",
    "Star Wars: The Acolyte was announced on Star Wars Day – May 4 – in 2020. The prequel series, which is set 50 years before the end of the High Republic, is billed as a mystery thriller that will explore the emergence of the Dark Side of the Force.",
    "The series is being written and executively produced by Leslye Headland, who helmed critically-acclaimed Netflix series Russian Doll. Star Wars: The Acolyte is believed to be entering production in mid-2022, but no release date has been confirmed yet.",
    "The prequel is another example of how Lucasfilm and Disney are transitioning away from making Star Wars movies to focus on Disney Plus shows instead. Currently, Star Wars TV series including Obi-Wan Kenobi, Cassian Andor, The Mandalorian season 3 and Ahsoka Tano are at varying stages of development. Up next on the Star Wars Disney Plus docket, though, is The Book of Boba Fett, which arrives on the streamer on December 29.",
    "In Star Wars lore, an acolyte is a term that referred to Force-sensitive apprentices who were beginning their Dark Side training under an experienced Sith Lord. Once their training was complete, acolytes would be given a Sith title of their own.",
    "Interestingly, acolytes were taught about the Dark Side of the Force before the Sith's iconic Rule of Two came into force. The Rule of Two, which only allowed for one Sith Master and one apprentice to exist at any on time, was created by Darth Bane in order to prevent clashes between power-hungry Sith Lords.",
    "Given that the Rule of Two wasn't introduced in the Star Wars universe until after the High Republic's collapse, then, it's possible that The Acolyte TV show's cast will contain more than two Dark Side wielders.",
    "Should that be the case – and we're confident it will be – Stenberg will likely portray the main character in The Acolyte, but we'll see other apprentices, Sith Lords and Sith Masters appear throughout its episodic run.",
    "Right now, we can't determine much as to what the show's overarching narrative will be. But, seeing as how Sith Lords used to consistently betray each other in a bid to become the most powerful Sith of all, we may see a Game of Thrones-style story play out, with plenty of politicking and betrayals to be had.",
    "We may also learn more about the ways of the Sith. True, the sheer number of Star Wars novels, lore and other media means this area has been extensively explored already, but examining the Sith in great detail isn't something that we've seen in a live-action capacity before. So Star Wars: The Acolyte has plenty of material to play with or expand upon.",
    "With the series reportedly going into full development in 2022, it's likely that we'll learn more about The Acolyte soon – and we can't wait to see what's cooked up."
  ],
  "headers": {
    "6": "Analysis: what will Star Wars: The Acolyte's plot be about?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Variety": "https://variety.com/2021/tv/news/star-wars-disney-plus-the-acolyte-amandla-stenberg-1235129537/",
    "Russian Doll": "https://www.techradar.com/news/russian-doll-is-the-perfect-netflix-show-for-our-repetitive-times",
    "Star Wars movies": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Cassian Andor": "https://www.techradar.com/news/star-wars-andor-everything-we-know-about-the-rogue-one-prequel",
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Ahsoka Tano": "https://www.techradar.com/news/star-wars-ahsoka-everything-you-need-to-know-about-the-mandalorian-spin-off",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know"
  }
}