{
  "source": "https://www.techradar.com/news/instagram-could-finally-be-fixing-its-biggest-annoyance",
  "title": "Instagram is finally going back to a chronological feed in 2022",
  "category": "computing",
  "updated": "2021-12-09T14:19:40Z",
  "author": "daryl-baxter",
  "summary": "It could arrive in early 2022",
  "article": [
    "After five years, Instagram is looking at bringing back the chronological feed, instead of one that sorts images by your interests in random order.",
    "Instagram head Adam Mosseri was talking to the American Senate committee about child abuse on social media, mainly due to the whistleblower papers that were leaked by Frances Haugen.",
    "Since 2016, users have had to scroll through their feed on Instagram, which shows posts in an order that’s been calculated by an algorithm. This generates a feed based on the content you’ve been looking at, what you’ve been commenting on, and who you’ve been following.",
    "It’s why you will occasionally see a ‘Suggested feed’ of photos and profiles you don’t follow. However, many just want a feed of who they’re following and nothing more.",
    "Mosseri’s confirmation of the chronological feed returning will be of big relief to some users. Many are still annoyed by not having control over what they see when they launch Instagram, instead of being brought to a feed that will show photos and videos from a few days ago.",
    "It’s a feature that’s been long-requested, so now that there’s confirmation, many users wanted to find out when it would be arriving. But it looks as though it won’t be anytime soon.",
    "With no more news about the feature until early next year, we’ll have to make do with the algorithmic feed for now, as we have done for five years.",
    "Instagram has been working on several features requested by its users. Recent examples have been the ability to post from a web browser or switching to a dark mode theme, which have been well-received.",
    "However, not being able to control what you see on your feed has been frustrating for years, ever since it changed in 2016. Many users want to scroll through a feed from newest to oldest, and social media rivals like Twitter gives users the option for this, as does Facebook.",
    "It can be argued that a chronological feed is more important for Instagram users, as photos and videos capture a moment in time. With the run-up to Christmas, you want to see the latest content from who you’re following, not a random photo from Halloween in your feed when you open the app.",
    "It’s a welcome change of mind regardless, but there should have been an option for both in the beginning. However, let’s hope it appears sooner rather than later in 2022.",
    "Via The Verge"
  ],
  "headers": {
    "4": "When will it arrive?",
    "7": "Analysis: Was there any need for it to go in the first place?"
  },
  "links": {
    "leaked by Frances Haugen": "https://www.wsj.com/articles/the-facebook-files-11631713039",
    "post from a web browser": "https://www.techradar.com/news/instagram-will-finally-let-you-post-a-photo-or-video-on-the-web",
    "switching to a dark mode theme": "https://www.techradar.com/how-to/get-instagram-dark-mode",
    "The Verge": "https://www.theverge.com/2021/12/8/22824609/instagram-chronological-feed-adam-mosseri"
  }
}