{
  "source": "https://www.techradar.com/news/the-batman-lego-sets-offer-a-look-at-the-riddler-before-new-trailer-drops",
  "title": "The Batman Lego sets offer a look at the Riddler before new trailer drops",
  "category": "entertainment",
  "updated": "2021-10-16T17:22:33Z",
  "author": "samuel-roberts",
  "summary": "Paul Dano's Riddler gets the minifigure treatment",
  "article": [
    "A new trailer is coming for The Batman as part of the DC FanDome livestream this week on October 16 – but before that, Lego has offered an early look at different characters in the film via its range of sets that'll tie into the Matt Reeves-directed movie.",
    "The sets don't give anything massively spoiler-y away, but they offer our best look yet at Paul Dano's depiction of The Riddler in the film. Before we get to the sets themselves, here's a close up of how Lego has brought the villain to life – next to minifigure versions of Robert Pattison's Batman and Jeffrey Wright's Jim Gordon:",
    "This isn't a leak, mind – you can go look at the set, known as The Riddler Face-Off, on Lego's official website right now. It releases in January, a couple of months before the movie.",
    "The costume tallies with the brief glimpse we got of the character during last year's The Batman trailer, where the costume appeared to be handmade, with glasses, a raincoat and a mask of sorts. The look of the character, combined with The Riddler's use of what appeared to be a cypher code in the film, led to comparisons with the real-life Zodiac Killer.",
    "It tallies with the more realistic vibe of the costumes worn by Batman and Catwoman in the film, which is set during the second year of the Dark Knight's career and is expected to be more of a noir-like detective movie.",
    "Check out the full suite of sets below, which don't reveal much more about the film, but do offer a better glimpse at the Batmobile than we've seen previously.",
    "DC FanDome, streaming this Saturday, will reveal The Batman trailer – stars Robert Pattinson and Zoë Kravitz will be part of the livestream as we finally learn more about the movie. It hits theaters on March 4, 2022.",
    "Everyone always levels the same complaint at Batman stories: how many times can we see the Waynes die in Crime Alley? It's a specific point about how frequently Batman's origin has been repeated across various media, but it also speaks to the wider omnipresence of the Dark Knight in media – and how easy it is for it to feel like you've seen everything before when it comes to the Caped Crusader on the big screen.",
    "If you saw last year's trailer for The Batman, it's hard not to see too much of Nolan's films in what Matt Reeves has come up with – that started with a 'back to basics' approach in giving viewers more of a real-world setting. In fairness, they're simply both drawing from the same well of credible Batman stories in the comics as influences, like The Long Halloween and Year One. These tell more ground-level Batman tales which suit a movie.",
    "The Batman can differentiate itself from the Nolan movies by truly focusing in on the detective elements of the character. That's why The Riddler is a good choice for a villain – he's all about obfuscation and thinking he's smarter than the people trying to catch him. If Dano's villain ends up going down the serial killer route, that would be a perfect MO.",
    "In the comics, The Riddler (or Edward Nygma) is often depicted as a villain who's too readily underestimated. In the comic Hush, for example, one of the best-selling Batman stories of the past two decades, he's the ultimate mastermind behind a massive plot against the Dark Knight – moving pieces on the board like the Joker, Poison Ivy and even Superman while hiding in plain sight.",
    "In the 2013 comic Year Zero, he has Gotham City in his total grasp, turning the city into an overgrown nightmare. In the 2017 comic The War of Jokes and Riddles, he battles with The Joker for supremacy over Gotham's underworld – positioning him as the equal of Batman's most famous villain.",
    "If all you know about this character is from Jim Carrey's appearance in Batman Forever, then, you've only really scratched the surface of what he's about. In the right hands, he could leave the same impact as so many of the Dark Knight's past iconic on-screen opponents."
  ],
  "headers": {
    "7": "Analysis: How The Batman can do things differently"
  },
  "links": {
    "The Batman": "https://www.techradar.com/news/the-batman-movie-release-date-2021-trailer?region-switch=NZ",
    "DC FanDome": "https://www.techradar.com/news/dc-fandome-2021-how-to-watch-date-time-star-guests-and-more",
    "Lego's official website": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1034288234184528100&murl=https%3A%2F%2Fwww.lego.com%2Fen-gb%2Fproduct%2Fbatcave-the-riddler-face-off-76183"
  }
}