{
  "source": "https://www.techradar.com/news/microsoft-says-russia-is-behind-majority-of-state-sponsored-attacks",
  "title": "Microsoft says Russia is behind majority of state-sponsored attacks",
  "category": "computing",
  "updated": "2021-10-08T13:53:23Z",
  "author": "mayank-sharma",
  "summary": "The attacks will get worse, unless countered with serious consequences, warns Microsoft",
  "article": [
    "Russia accounted for a majority (58%) of state-sponsored cybercrime attacks detected by Microsoft’s cybersecurity experts over the past year, mostly targeting government agencies and think tanks in the US, the company has claimed.",
    "The insights come from Microsoft’s annual Digital Defense Report and reveal that the successful SolarWinds campaign helped boost the success-rate of Russian state-backed actors from 21% last year to 32% this year.",
    "According to Microsoft, after the US, the favorite targets of the Russian threat actors were Ukraine, Britain and other European NATO members.",
    "At the receiving end of these campaigns were government agencies, targeted for gathering information, which made up 53% of the targets, up from a mere 3% last year.",
    "The report points out that while Russia leads the field, North Korea, Iran, and China, aren’t far behind in terms of the volume of attacks.",
    "Interestingly, all the state-sponsored actors were found to have been evolving their approaches as well, especially since espionage is no longer the only purpose for nation-state attacks.",
    "“The trends are clear: nation-states are increasingly using, and will continue to use, cyberattacks for whatever their political objectives are, whether those are espionage, disruption or destruction,” says Microsoft.",
    "The company expects more countries to join the list of those engaging in offensive cyber campaigns, and that their attacks will become “more brazen, persistent and damaging” unless there are more serious consequences.",
    "Besides tracking the activity and growth of nation-sponsored actors, the Microsoft report, which covers the period from July 2020 to June 2021, also covers trends across cybercrime, supply chain security, hybrid work, and disinformation."
  ],
  "headers": {
    "4": "Tracking state-sponsored activity"
  },
  "links": {
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "reveal": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3505935419682233000&xs=1&url=https%3A%2F%2Fblogs.microsoft.com%2Fon-the-issues%2F2021%2F10%2F07%2Fdigital-defense-report-2021%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-says-russia-is-behind-majority-of-state-sponsored-attacks",
    "SolarWinds": "https://www.techradar.com/news/solarwinds-suffers-massive-supply-chain-attack",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office"
  }
}