{
  "source": "https://www.techradar.com/news/sony-oled-tvs-are-selling-out-in-prime-day-tv-deals-dont-miss-your-chance",
  "title": "Sony OLED TVs are selling out in Prime Day TV deals – don't miss your chance",
  "category": "televisions",
  "updated": "2021-06-30T03:33:20Z",
  "author": "mackenzie-frazier",
  "summary": "These Prime Day TV deals are great news for those after a Sony OLED TV",
  "article": [
    "Amazon Prime Day deals may be technically over, but some of the best TV deals from the sale are still going on Amazon (and elsewhere), including discounts on some incredibly Sony OLED TVs.",
    "The Sony A8/A8H OLED TV got an astonishing price cut in particular, with $700 of savings on the screen in the US. Both the 55-inch and 65-inch sizes have sold out in the UK already, though there are other Sony TV deals still running which you can find below in this guide.",
    "This 2020 Sony flagship was one of our favorite OLED screens, repackaging many of the technologies that made the Sony A9G OLED so impressive, but at a much more affordable price point, that's only lower in these Prime Day sales.",
    "There are also a host of cheaper Sony LCD TVs, including a $150 discount on a brand-new X80J screen in the US, or a £330 price cut on last year's XH81 in the UK. So whether you're after an affordable mid-range TV, or something a bit more premium, you should get what you want in the Prime Day TV deals still running below...",
    "US",
    "UK",
    "This stunning 65-inch set has everything and more that you'd want in your big-screen dream TV. The A8H Series features a premium OLED panel within an X1 Ultimate processor which provides a life-like viewing experience with crisp images that come to life. The 4K TV features millions of OLED pixels that are supercharged by the Pixel Contrast Booster, which delivers deep blacks and intense colors. The smart TV also features Game Mode for a super smooth experience and works with Amazon Alexa and the Google Assistant for hands-free control. As we've mentioned above, this is the lowest price we've seen for the 65-inch A8H series, and this Prime Day lightning deal ends tonight at Midnight EST. We've included more of the best OLED TVs below and make sure to check out our Prime Day TV deals guide for more offers.",
    "See more offers with our roundup of the best OLED TV deals and if you're looking for a budget set we also have the best cheap TV deals and sales happening now."
  ],
  "headers": {
    "4": "Sony Prime Day TV deals, from OLED to LCD"
  },
  "links": {
    "Amazon Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "$700 of savings on the screen in the US": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB084KQLVKH%2Fref%3Dtwister_B084ZVDQGM%3F_encoding%3DUTF8%26psc%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5876882319980130000-20",
    "$150 discount on a brand-new X80J screen": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1012766337654612400&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsony-50-class-x80j-series-led-4k-uhd-smart-google-tv%2F6453619.p%3FskuId%3D6453619&article_name=Sony%20OLED%20TVs%20are%20selling%20out%20in%20Prime%20Day%20TV%20deals%20%E2%80%93%20don't%20miss%20your%20chance&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fsony-oled-tvs-are-selling-out-in-prime-day-tv-deals-dont-miss-your-chance",
    "£330 price cut on last year's XH81 in the UK": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fdp%2FB0842PSDKR%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-4284601119253099000-21",
    "A8H Series": "https://www.techradar.com/reviews/sony-bravia-a8h-oled-tv",
    "Prime Day TV deals": "https://www.techradar.com/amazon-prime-day/prime-day-tv-deals-2021",
    "OLED TV deals": "https://www.techradar.com/deals/best-oled-tv-prices-deals",
    "best cheap TV deals and sales": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales"
  }
}