{
  "source": "https://www.techradar.com/news/five-new-foldable-phones-leak-including-the-pixel-fold-and-a-giant-xiaomi-phone",
  "title": "Five new foldable phones leak, including the Pixel Fold and a giant Xiaomi phone",
  "category": "phones",
  "updated": "2021-07-14T09:20:57Z",
  "author": "tom-bedford",
  "summary": "Fold me close",
  "article": [
    "If you're a fan of foldable phones then the future looks pretty bright for you, because it sounds like a huge number could be launching towards the end of 2021. A report has detailed some of the lesser-reported ones - by that we mean, not the repeatedly-leaked Galaxy Z Fold 3 or Galaxy Z Flip 3, but we've heard enough about those already.",
    "This report comes from South Korean news site The Elec, and it's primarily about ultra-thin glass, or UTG, the thin material most foldable phones use in their displays (which, contrary to the name, involves a plastic layer).",
    "Lots of upcoming and anticipated foldable phones are name-checked in the report, and we also hear this refers to \"foldable smartphones launching in the second half of this year\", suggesting the following devices could launch soon.",
    "Take that time frame with a pinch of salt, though - if the original Galaxy Fold taught us anything, it's that bending smartphones can take loads of time and plentiful delays to actually come out.",
    "The most intriguing upcoming phone mentioned is a foldable from Google, which previous rumors have referred to as the Pixel Fold. Apparently this will have a 7.6-inch screen when opened up, though unlike other handsets mentioned in the report, we don't have details on its form factor or outer-screen size.",
    "Next up is Xiaomi, with its successor to the Mi Mix Fold - The Elec calls this the Mi Mix Fold 2. It sounds massive, with a 6.52-inch secondary display when folded, and an 8.01-inch main display when unfolded, giving you a tablet-like experience.",
    "That's not the biggest rumored phone, though, as apparently an upcoming Honor foldable will have an 8.03-inch main display (though a 6.45-inch outer one). This will apparently launch as the Honor Magic Fold - there's actually a global Honor launch event happening on August 12, but we're expecting this to be for the Honor 50, not a flexible smartphone.",
    "Coming up a close third in the size race, according to the report, is a Vivo foldable phone. This is said to have an 8-inch inner and 6.5-inch outer display and will apparently launch in the last few months of 2021.",
    "Finally there's an Oppo handset, which sounds small compared to the others with a 7.1-inch main and 5.45-inch secondary display, though those dimensions make it sound handily compact. The Elec notes this phone could actually launch in 2022, so this is the most likely not to land this year.",
    "Four of those five listed brands are Chinese companies, and three of them (Vivo, Xiaomi and Honor) have a long history of launching top-end products in China but not globally. That's what happened with the original Mi Mix Fold, for instance, and sometimes the brands do bring these products to a global market, but only months later.",
    "So even if these phones do get announced before 2021 is up, it's likely you might not be able to buy them until 2022, if at all. Don't get your hopes up to buy one, then, but they'll still be cool to check out either way."
  ],
  "headers": {
    "4": "What phones are coming?"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "The Elec": "http://www.thelec.net/news/articleView.html?idxno=3064",
    "Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "Mi Mix Fold": "https://www.techradar.com/news/xiaomi-mi-mix-fold-release-date-price-features-and-everything-you-need-to-know",
    "Honor 50": "https://www.techradar.com/reviews/honor-50-review"
  }
}