{
  "source": "https://www.techradar.com/news/apple-deal-alert-apple-watch-6-price-cut-amazon",
  "title": "Apple deal alert: the all-new Apple Watch 6 gets a $60 price cut at Amazon",
  "category": "wearables",
  "updated": "2021-01-24T14:54:37Z",
  "author": "mackenzie-frazier",
  "summary": "Get the best-selling smartwatch on sale for $339",
  "article": [
    "If you're looking to score a price cut on the all-new Apple Watch 6, then you're in luck. Amazon's Apple Watch deal includes a $60 discount on the Series 6 smartwatch, which brings the price down to $339. That's the best deal we've found for the Apple watch and only $10 more than the all-time low price. If you're looking for a cheaper price tag, Amazon also has the Series 3 marked down to $169 and the Apple Watch SE on sale for $279.",
    "The all-new Apple Watch 6 tracks activity, workouts, and calories and now includes a sleep app, which helps you establish a regular bedtime routine to get a better night's rest. The smartwatch also has new health features such as a blood oxygen monitor and an ECG app that alerts you when an irregular heart rate is detected. The waterproof watch also helps you stay connected with the ability to take calls and reply to texts directly from your wrist. While the Apple Watch 6 with a Red Sport Band has been at this price for a while, the Black Sport Band model hasn't received a price cut this significant since Black Friday. We don't know how long Amazon will have the smartwatch on sale, so you should take advantage now before it's too late.",
    "Not in the US? See the best Apple Watch 6 deals in your region below.",
    "Shop more offers with our roundup of the best cheap Apple Watch prices and sales that are happening now. You can also shop for TV offers with our roundup of the best Super Bowl TV deals and upcoming Presidents' Day sales."
  ],
  "headers": {
    "1": "Apple Watch 6 deal",
    "2": "More Apple Watch deals"
  },
  "links": {
    "price down to $339": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FNew-Apple-Watch-GPS-40mm-Aluminum%2Fdp%2FB08J5QC43Q%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-7406790380967815000-20",
    "marked down to $169": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-Watch-GPS-38mm-Space-Aluminium%2Fdp%2FB07K39FRSL%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1325911481224612600-20",
    "on sale for $279": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J5QB5QT%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1189313323947284000-20",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "cheap Apple Watch prices and sales": "https://www.techradar.com/news/cheap-apple-watch-deals",
    "best Super Bowl TV deals": "https://www.techradar.com/news/best-super-bowl-tv-deals-201",
    "Presidents' Day sales": "https://www.techradar.com/news/presidents-day-sales-deals-2021"
  }
}