{
  "source": "https://www.techradar.com/news/quick-the-apple-watch-6-is-back-in-stock-and-on-sale-in-early-black-friday-deal",
  "title": "Quick - the Apple Watch 6 is back in stock and on sale in early Black Friday deal",
  "category": "wearables",
  "updated": "2021-10-29T16:44:52Z",
  "author": "mackenzie-frazier",
  "summary": "Score a $50 price cut on the Apple Wath 6 ahead of Black Friday",
  "article": [
    "If you're looking to snag an early Black Friday deal on the best-selling Apple Watch 6, then you're in luck. We've just spotted the Apple Watch Series 6 back in stock and on sale for $349 (was $399) at Amazon. That's a $50 discount and the best deal you can find right now for the 40mm smartwatch. This early Black Friday deal applies to the Navy sport band, which like most colors, has been out of stock as of late. As of right now, the Apple Watch 6 is currently in stock and ready to ship, so we recommend snagging this discount now before it sells out again.",
    "The best-selling Apple Watch 6 tracks activity, workouts, and calories and includes a sleep app that helps you establish a regular bedtime routine to get a better night's rest. The Series 6 also comes with new health features such as blood oxygen monitoring and an ECG app that alerts you when an irregular heart rate is detected. You're also able to take calls, get directions and reply to texts directly from your wrist without your phone.",
    "Shop more offers with our roundup of the best cheap Apple Watch deals and sales, and see more devices on sale with our guide to the best Black Friday Apple deals that are happening right now."
  ],
  "headers": {
    "1": "Early Black Friday Apple Watch deal",
    "2": "More Apple Watch deals"
  },
  "links": {
    "in stock and on sale for $349 (was $399) at Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J5XF5SR%2Fref%3Dfs_a_wt2_us1%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5785414129393551000-20",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "cheap Apple Watch deals and sales": "https://www.techradar.com/news/cheap-apple-watch-deals",
    "Black Friday Apple deals": "https://www.techradar.com/black-friday/apple-black-friday-deals"
  }
}