{
  "source": "https://www.techradar.com/news/xiaomi-teases-the-return-of-its-own-custom-chips-for-future-devices",
  "title": "Xiaomi teases the return of its own custom chips for future devices",
  "category": "phones",
  "updated": "2021-03-28T13:30:11Z",
  "author": "david-nield",
  "summary": "Is the Surge S2 incoming?",
  "article": [
    "There's a major mobile event happening tomorrow, with Xiaomi expected to unveil the Mi 11 Ultra, the Mi 11 Pro, and quite possibly a new Mi Mix phone as well. Now Xiaomi has teased the arrival of something else too: a custom system-on-a-chip (SoC).",
    "Based on posts from Xiaomi and company executives on Chinese social media site Weibo (as per Android Authority and others), a new \"self-developed chip\" is on the way that has something to do with \"surging\" – and Xiaomi's first SoC was called the Surge S1.",
    "That 2017 chip never got a successor, despite various rumors that one was in the pipeline. Now it looks as though Xiaomi is ready to try again, with what we're assuming is going to be called the Surge S2 or something similar.",
    "At the moment it's not clear exactly what devices this new chipset will be appearing in: it might make its way into future Xiaomi smartphones, but it could also be destined for low-powered devices like smart home gadgets.",
    "The March 29 event from Xiaomi is certainly going to be a packed show, and thanks to the wonders of the internet, it's available to everyone who wants to tune in – check out our how to watch guide for details of timings and how to get connected.",
    "Add up all the rumors we've heard and everything that Xiaomi has been teasing, and there's lots to look forward to. Another possible reveal that has been talked about is an electric vehicle made by Xiaomi in partnership with Great Wall Motors.",
    "Xiaomi itself has dropped hints about a new type of liquid-lens camera that the manufacturer is working on, possibly for inclusion in the next Mi Mix phone. It could well pack telephoto and macro capabilities into a single lens.",
    "There have been earlier rumblings of Xiaomi getting back into the SoC game, and all will be revealed tomorrow – as usual, we will of course bring you all the news and announcements as they happen, custom chips and all."
  ],
  "headers": {
    "4": "The Mega Launch"
  },
  "links": {
    "Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Mi 11 Pro": "https://www.techradar.com/news/xiaomi-mi-11-pro-ultra-and-lite-launch-event-teased-coming-soon",
    "a new Mi Mix phone": "https://www.techradar.com/news/next-xiaomi-mi-mix-might-be-a-foldable-phone-with-incredible-charging-speeds",
    "Android Authority": "https://www.androidauthority.com/xiaomi-surge-chipset-1211008/",
    "various rumors": "https://www.techradar.com/news/xiaomi-expected-to-announce-surge-s2-chipset-at-mwc-2018",
    "our how to watch guide": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "an electric vehicle": "https://www.techradar.com/news/xiaomi-could-be-making-an-electric-car-heres-what-we-know",
    "a new type of liquid-lens camera": "https://www.techradar.com/news/xiaomis-foldable-phone-could-be-the-first-smartphone-with-a-liquid-lens-camera",
    "earlier rumblings": "https://www.techradar.com/news/xiaomi-apparently-hasnt-given-up-on-custom-smartphone-chipsets-yet"
  }
}