{
  "source": "https://www.techradar.com/news/oneplus-9-will-come-with-a-charger-in-the-box",
  "title": "OnePlus 9 will come with a charger in the box",
  "category": "phones",
  "updated": "2021-03-09T11:54:08Z",
  "author": "axel-metz",
  "summary": "Back to basics",
  "article": [
    "OnePlus CEO Pete Lau has confirmed that the company's upcoming phones – confirmed as the OnePlus 9, 9 Pro and 9E – will ship with a charger in the box.",
    "A year ago, this probably wouldn’t have been big news, but after both Apple and Samsung decided against shipping their latest flagship devices with chargers in the box (and look to continue the trend for future phone releases), OnePlus’ announcement is a refreshing one.",
    "For those who know their chargers, all phones in the imminent OnePlus 9 line will come equipped with the company’s ultra-fast Warp Charge 65 variety, the same as was included with the OnePlus 8T.",
    "Lau’s comments arrive alongside the first official teaser of the OnePlus 9 Pro, posted to the company’s official Twitter page.",
    "In the short clip, we catch a blink-and-you’ll-miss-it glimpse of the upper rear half of the 9 Pro, which includes four separate cameras and, of course, the Hasselblad logo, following the announcement of OnePlus’ partnership with the camera company.",
    "The teaser also ends with a confirmation of the official OnePlus 9 series launch date.",
    "The company intends to officially unveil its new smartphone range on March 23 via an online event streaming from the OnePlus website at 7AM PT / 10AM ET / 2PM GMT.",
    "Of course, there isn’t all that much to reveal, since we’ve pieced together a pretty clear picture of what to expect from the three upcoming devices.",
    "For all the latest information regarding specs, price, rumors and leaks, head over to our OnePlus 9 round-up page to read everything we think we know about the OnePlus 9 and its siblings.",
    "Come March 23, we expect to learn the official prices of the devices – which is still a point of debate – as well as receive confirmation of a release date, which we anticipate will be a week or two after the announcement.",
    "Via GSMArena"
  ],
  "headers": {
    "5": "March ahead"
  },
  "links": {
    "confirmed": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-1702287010527211000&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Fsomething-new-is-on-the-horizon-what-is-it.1396347%2Fpage-28%23post-22835224",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus 8T": "https://www.techradar.com/reviews/oneplus-8t-review",
    "OnePlus’ partnership": "https://www.techradar.com/news/oneplus-9-phones-launch-march-23-and-its-hasselblad-cameras-are-the-focus",
    "launch date": "https://www.techradar.com/news/oneplus-9-phones-launch-march-23-and-its-hasselblad-cameras-are-the-focus",
    "OnePlus website": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-6894393617434157000&sharedId=trd-us&u=https%3A%2F%2Fwww.oneplus.com%2Fuk",
    "GSMArena": "https://www.gsmarena.com/oneplus_9_pro_will_have_a_charger_in_the_box_video_teaser_reveals_camera_island_design-news-48108.php"
  }
}