{
  "source": "https://www.techradar.com/news/google-forms-is-fast-becoming-a-favorite-tool-for-cybercriminals",
  "title": "Google Forms is fast becoming a favorite tool for cybercriminals",
  "category": "computing",
  "updated": "2021-09-23T15:04:10Z",
  "author": "mayank-sharma",
  "summary": "Experienced attackers use Google Forms to complement their attack infrastructure",
  "article": [
    "Cybersecurity researchers have identified over half a dozen ways in which cyber scammers and malware operators abuse Google Forms, as part of a wide range of attacks.",
    "The researchers at Sophos discovered cybercriminals’ affinity for Google Forms while researching how malware operators were evading detection by increasingly adopting encrypted communication protocols.",
    "“Our analysis shows that while most abuse of Google Forms by cyberattackers remains firmly in the low-skill phishing and fraud spam space, there are increasing signs that adversaries are taking advantage of the platform for more sophisticated attacks,” shared Sean Gallagher, senior threat researcher at Sophos.",
    "Gallagher adds that they have in fact spotted threat actors using Google Forms for everything from helping exfiltrate data to using it to host a malware command and control (C2) server.",
    "Sophos has identified seven malicious ways threat actors use Google Forms to conduct their spiteful activities.",
    "In addition to its use to facilitate traditional phishing campaigns, entry-level scammers use the online survey administration software’s ready-made design templates to craft fake e-commerce pages to steal payment details.",
    "“Google Forms offer cyberattackers an attractive proposition: the forms are easy to implement and trusted by both organizations and consumers; the traffic to and from the service is secured with Transport Layer Security (TLS) encryption so it can’t be easily inspected by defenders; and the whole set up essentially provides a free attack infrastructure,” reasons Gallagher.",
    "The researchers add that it appears the attackers are conscious of Google’s policy of shuttering accounts that abuse its apps, including Google Forms, on a mass scale. The researchers observed that the low-volume, targeted use of the service helps the abuse fly under the radar, and evade detection."
  ],
  "headers": {
    "4": "Use and scoot"
  },
  "links": {
    "Cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "Google Forms": "https://www.techradar.com/reviews/google-forms",
    "Sophos": "https://www.techradar.com/reviews/sophos-2020-antivirus-solutions",
    "evading detection": "https://www.techradar.com/news/malware-smugglers-have-settled-on-a-new-technique-for-evading-detection",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "identified": "https://news.sophos.com/en-us/2021/09/23/phishing-and-malware-actors-abuse-google-forms-for-credentials-data-exfiltration/"
  }
}