{
  "source": "https://www.techradar.com/news/mailchimp-and-shopify-team-up-in-ecommerce-boost",
  "title": "Mailchimp and Shopify team up in ecommerce boost",
  "category": "computing",
  "updated": "2021-10-27T22:00:02Z",
  "author": "anthony-spadafora",
  "summary": "Mailchimp and Shopify users can now connect the two platforms with a direct integration",
  "article": [
    "Mailchimp has announced a new partnership that allows users of its email marketing software to directly integrate with Shopify's ecommerce platform.",
    "Both new and existing users of the two companies will now be able to connect their Mailchimp account with their Shopify storefront through a direct integration which eliminates the need for third-party tools and manual data transfers.",
    "VP of Mailchimp's app marketplace, Joni Deus explained in a press release that this new direct integration will help drive business for both companies' customers ahead of the 2021 holiday shopping season, saying:",
    "“Last year, Mailchimp customers generated 36 percent more orders from Thanksgiving to Giving Tuesday than they did in 2019, showing just how important having an online presence for commerce and retail businesses really is. We’re thrilled to have partnered with Shopify again ahead of our customers’ busiest season to make it easier for merchants to reach their customers, sell more stuff, and be successful.”",
    "By connecting Mailchimp and Shopify directly, merchants will be able to combine the power of both purchasing and marketing data and use these insights to help drive conversions, increase revenue and reach even more customers.",
    "The two companies decided to announce their new direct integration now so that their small business customers will have plenty of time to connect the two platforms and make this one of their most profitable holiday selling seasons yet.",
    "Mailchimp also revealed that it has acquired ShopSync whose app has been used by tens of thousands of its customers to connect their Mailchimp and Shopify accounts over the past two years. ShopSync's work on its app also made it easy for the email marketing firm to bring their technology in house and integrate it into its platform.",
    "Mailchimp and Shopify users can check out this support page to learn more about connecting the two platforms so they can drive additional business to their online stores.",
    "Looking to boost your online business? We've rounded up the best ecommerce platforms and best shopping cart software to help you do so."
  ],
  "headers": {
    "4": "Direct integration"
  },
  "links": {
    "email marketing software": "https://www.techradar.com/best/best-email-marketing-software",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "Mailchimp": "https://www.techradar.com/reviews/mailchimp",
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "press release": "https://mailchimp.com/mailchimp-and-shopify-launch-direct-integration/",
    "holiday shopping season": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "check out this support page": "https://mailchimp.com/help/connect-shopify/",
    "online stores": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "best ecommerce platforms": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "best shopping cart software": "https://www.techradar.com/best/best-shopping-cart-software"
  }
}