{
  "source": "https://www.techradar.com/news/8k-blu-ray-players-are-possible-but-will-they-happen",
  "title": "8K Blu-ray players are possible – but will they happen?",
  "category": "televisions",
  "updated": "2021-05-04T09:34:06Z",
  "author": "henry-st-leger",
  "summary": "A look at the potential of 8K Blu-ray discs",
  "article": [
    "Are 8K Blu-ray movies on the way? With the 8K resolution standard gaining steam and appearing in more televisions every year – Samsung, LG and Sony all supporting the technology to varying degrees – the true cinephiles out there may be wondering whether their 4K Blu-ray player could soon be upgraded with an 8K iteration.",
    "Disc players remain a beloved part of many home theater systems, offering high-quality viewing of TV shows, documentaries and films without buffering or internet connectivity issues found when streaming over Netflix, Disney Plus, Hulu, and the like. Blu-ray players do seem to be on their way out, though, with Samsung leaving the Blu-ray business shortly after industry titan Oppo did the same.",
    "But could 8K Blu-rays revive the hardware, or are the AI processing solutions currently used on 8K TVs going to replace the need for disc-based viewing for good?",
    "There are a lot of factors to consider here, including the increased size of 8K video content, mastering processes for filmmakers, and the business proposition of putting 8K on disc for home use – all meaning that 8K Blu-rays are looking possible, but still somewhat unlikely in the current climate. Here’s why.",
    "8K packs in four times as many pixels as 4K resolution does, with 33 million pixels to the latter’s eight million. There’s a lot more potential detail there, and while there isn’t too much ‘native’ 8K content about – that is, video that’s filmed with an 8K camera – modern upscaling techniques are making even low-quality sources look crisp and detailed with the right screens and processors.",
    "It’s still an awkward situation for anyone with an 8K TV, given the only place really offering 8K streams is YouTube, and not for very much content at all. But the general paucity of 8K screens – compared to their 4K TV counterparts, that is – means that production companies aren’t rushing to offer content mastered for 8K displays.",
    "One could argue that the increased detail of 8K makes an even stronger case for having an offline media player and disc sources, given the massive uptick in internet download speeds and data transfer needed to stream 8K resolution video second by second – around 50mb/s for stable quality.",
    "That’s not to mention the amount of time needed to do a dedicated download of an 8K movie – similarly to the long wait times for downloading massive PC games like Warzone or Red Dead Redemption 2. As 8K content becomes more widespread, this problem will only increase.",
    "There’s definitely a use case for 8K Blu-ray discs, then – but what are the obstacles to this happening?",
    "We spoke to Keith Doughty at QuVIS, a technology company specializing in large-scale data transfer and compression, and which designed the first 2K, 4K, and 3D digital cinema recorders – having collaborated with the likes of Pixar and Sony in the onward march of cinematic technologies over the years.",
    "QuVIS’s own video compression technology is able to discard non-visible wavelengths from 8K video content before compression, bringing down file sizes and meaning that even large 8K films can be fit onto Blu-ray discs. Doughty tells us that “There's a whole lot in the blue wavelength range that is outside of human acuity. So we don't process that, and remove all the noise, and only process what remains, which is visible to us. And that's why we can compress this data down to such low levels.”",
    "Because of this, Doughty is adamant that 8K Blu-rays are possible, and that the technology is already here – even if the industry doesn’t end up pursuing it.",
    "“What we’re trying to determine is if distribution of 8K Blu-rays is worthwhile pursuing,” says Doughty. “And it's a huge challenge. Could you put [an 8K movie] on a Blu-ray disc and send it out? Maybe – but I don’t know that this is going to be the savior of Blu-ray. For us, we’re just saying that we can do it.”",
    "We’re told that QuVIS’s proprietary software could run on a dedicated player supporting 8K – such as the new PS5 and Xbox Series X consoles, which have yet to make much use of their 8K capability – as well as Windows, Mac, and Linux, for those with 8K monitors. There aren’t any firm plans in place as such, but the technology is there if it becomes viable from a market standpoint.",
    "And how much could an 8K Blu-ray disc cost? “It's going to be up to the rights holder as to what they decide that it's worth,” says Doughty. “I’d spend 50 bucks on it. Would I spend more? Maybe.”",
    "Considering the usual $30 / £30 price point of a 4K Blu-ray – already pretty expensive compared to HD DVDs or digital rentals – that’s almost twice as much money being asked of consumers.",
    "Our guide to the best 4K Blu-ray players, too, shows a mix of price points from $350 / £350 to $850 / £850 – and any dedicated 8K hardware to plug into an 8K TV is certainly going to cost more than current 4K models. For a niche market (cinephiles) within another niche market (8K TV owners), the audience may simply not be there.",
    "Writing for Forbes, TV pundit John Archer says as much: “One 8K source that likely won’t happen, though, is 8K Blu-ray. The required data capacities of 8K discs would have to be huge, representing a substantial technical challenge. Also, even if 8K discs were possible, I’m not convinced (sadly, given that I personally remain a fan of physical media) that studios will see sufficient return on any 8K disc investment as more and more people turn to streaming for their movie needs.”",
    "It's worth noting that 8K movies are already being filmed with 8K cameras – they’re just rarely being ‘mastered’ for 8K screens.",
    "Filmmakers will tend to capture high-resolution footage, and then master at a lower resolution to match the screens it’ll likely be viewed on – giving themselves plenty of visual data to work with in recording, and leeway to crop and frame shots effectively, while minimizing the amount of data needed for the mastering process.",
    "Post production specialist Dan Durran cites director David Fincher, saying that \"Fincher reframes every shot. So Mindhunter, House of Cards, he reframes the shot as he wants your eyes going to what he wants you to see. He's able to use the whole 8K frame, cropping whatever he needs, to give a 4K image. He only has that flexibility when working with such high resolution\" (via Home Cinema Choice).",
    "Our Camera Editor Mark Wilson seconds this, saying that, even with 12K cameras, “the majority of producers are downsizing that to 6K, and really mastering at 6K or 4K, primarily because of the amount of data that they're required to move with 8K.\"",
    "We’re also told by QuVIS that “a limited number of media titles exist at quality levels needed to fully exploit and showcase 8K products,” with an estimate of between 100 and 1000 such titles that are largely “made for IMAX” documentaries.",
    "There isn’t much 8K film out there yet, then, but the tools exist for it to increase, especially if the right distribution channels are created.",
    "As ever, 8K may simply be too ahead of the curve. QuVIS admits that the “4K media market” is still “under-addressed,” meaning that a huge push towards 8K Blu-ray players and disc is unlikely to happen in the near future.",
    "By the time there is a solid use case for such dedicated hardware, average streaming speeds and compression technologies may have improved even further, rendering 8K discs somewhat redundant. In a world of capable 8K upscaling, too, we may not even need 8K mastering, if a 4K mastered movie can be transformed into believable 8K quality.",
    "All this means that 8K Blu-ray players are unlikely – but at least now you know why."
  ],
  "headers": {
    "4": "Why do 8K Blu-rays matter?",
    "9": "See you later, data",
    "18": "8K movies already exist"
  },
  "links": {
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "4K Blu-ray player": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "home theater systems": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "Netflix": "https://www.techradar.com/best/best-netflix-shows/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Hulu": "https://www.techradar.com/reviews/hulu",
    "Samsung leaving the Blu-ray business": "https://www.techradar.com/news/samsung-confirms-its-stopping-blu-ray-player-production",
    "industry titan Oppo did the same": "https://www.techradar.com/news/oppo-bows-out-of-the-hi-fi-and-blu-ray-player-business",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K TV": "https://www.techradar.com/best/best-8k-tv",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Red Dead Redemption 2": "https://www.techradar.com/deals/red-dead-redemption-2-prices-deals-rdr2",
    "QuVIS": "https://www.quvis.com/about/",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "best 4K Blu-ray players": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "Forbes": "https://www.forbes.com/sites/johnarcher/2019/06/26/why-8k-tvs-matter/?sh=3c6f9f55a216",
    "Home Cinema Choice": "https://www.homecinemachoice.com/content/why-8k-transforming-movies-and-why-you-probably-haven%E2%80%99t-noticed-yet"
  }
}