{
  "source": "https://www.techradar.com/news/speech-to-text-apps",
  "title": "Speech-to-text apps: what to look for in dictation software",
  "category": "computing",
  "updated": "2021-03-22T10:04:43Z",
  "author": "ritoban-mukherjee",
  "summary": "Save time, go hands-free with these essential speech-to-text apps",
  "article": [
    "You are a professional. Your job requires you to write copious amounts of text each day. Why strain your wrists typing on your keyboard when you could just as easily dictate your content and have a designated speech-to-text software take the notes for you? Over the years, the market has been saturated with apps and software to help you do just that.",
    "While each comes with its own set of pros and cons, they are all similar in that they use an algorithm to translate your voice recordings into written text and store it on your hard drive or in the cloud. Some may boast higher speech-to-text accuracy than others, while some may try to stand out with support for additional accents and languages or additional features like cross-platform integration. Here, we will guide you on what to look for when choosing speech-to-text software to suit your needs.",
    "Before you venture out on this journey, you must first figure out why you need voice dictation software. Are you just looking for something that lets you take notes quickly and easily? Do you need speech-to-text software that doubles as a virtual assistant? How much do you need written on any given day, week, or month? Depending on how you answer these questions, your choice may vary significantly. Other things worth considering include your accent and dialect and whether you will be using complex terminology in your text.",
    "For example, our reviews show that applications like Dragon Professional and Dragon Anywhere have great speech-to-text accuracy out of the box, while Otter and Verbit are great for collaborating with others while you dictate. Speechmatics’ algorithm, however, is the best at detecting a wide range of accents from different parts of the world.",
    "There used to be a time when the majority of speech-to-text applications were available on PC only. However, smartphone apps are now a dime a dozen. One of the best is Dragon Anywhere, which is available on Android and iOS devices. Other great options include Transcribe, Speechnotes, and SpeechTexter.",
    "Some of these apps feature a cross-platform functionality that lets you start working on one device and then pick up where you left off using another. Dragon Anywhere, for instance, is a good companion app for its more powerful desktop counterpart, Dragon Professional.",
    "There’s also a plethora of voice assistants available on smartphone devices, such as Cortana, Siri, and Google Assistant. Each of these smart companions come with a decent speech to text functionality, but they are not your best bet when it comes to long hours of recording and transcribing.",
    "Dragon Professional pulled support for macOS in 2018, and as a result, Macs now lag behind in professional-grade speech-to-text offerings. macOS Dictation, the built-in feature that can be enabled via Keyboard System Preferences on Mac, is not nearly as powerful or accurate, but it does the job. When it comes to voice dictation software for computers, however, Windows is the platform of choice.",
    "A lot of speech-to-text applications claim to have a 99% accuracy rate, but not all of them deliver. Verbit, created by developers from Israel, is a great voice-to-text app that delivers on this promise by using the power of artificial intelligence and machine learning. Dragon Professional is another app that features a 99% accuracy rate. Speechnotes, which is based on the same speech recognition technology used by Google, boasts an actual accuracy rate of 90%.",
    "However, be aware that the advertised accuracy rate alone isn’t the best gauge for actual text-to-speech convertibility. Other factors, like whether or not the user has an accent or uses complex scientific or technological terminology, also play an important role.",
    "A lot of these speech-to-text applications use an AI that becomes increasingly accurate as it trains itself to pick up on the dialect and words you use. Some also enable you to import custom word lists to help them recognize complex or colloquial terms. These features can go a long way towards boosting your software’s accuracy rate.",
    "As opposed to the average human typing speed of 40–45 words per minute, a speech-to-text application can help you write up to 160 words per minute. Most of these apps come with a feature that transcribes your recordings in real-time. However, if you’re not in a hurry, Transcribe offers a slower but more accurate option—you can hire someone from their human pool of audio transcribers to convert your recordings within two hours.",
    "Being able to collaborate with others directly via your speech-to-text app makes it easier to do things like transcribe recorded interviews, brainstorm ideas, and streamline the editing process. Otter, a transcription app that is free for individuals and costs $12.50/month for teams, allows each member to be assigned a Speaker ID, which makes it easier to transcribe recordings with multiple speakers present.",
    "Other useful features include support for additional languages, various export options, and security features like two-factor authentication.",
    "Finally, the price paid for the software is important to consider. Dragon Professional is priced quite high initially at $300 USD, but unlike most of its competitors, there’s no monthly subscription fee, so you might actually end up paying less if you plan to use it for the long term.",
    "Next up, Otter’s premium option is priced reasonably at just $8.83/month for individual plans. It also has an entirely free option available for casual users who don’t mind being restricted to a total of 600 minutes of audio per month.",
    "Speechmatics and Verbit offer a variety of plans based on the size and purpose of your organization and the number of recordings you need transcribed. Meanwhile, Microsoft Azure Speech to Text utilizes an hourly subscription plan that has you paying at least $1 for every hour of recorded audio.",
    "Almost every one of these applications should be able to provide you with decent results in a standard scenario. However, depending on your requirements, you might want to look for unique features like additional languages or support for multiple speakers.",
    "If it feels like too much to take in, just try to concentrate on the features you need and see how much of a dent the software would put in your budget. If you have never taken notes using your voice before, it can be a bit uncomfortable at first, no matter which option you choose. However, if you have to take a lot of notes every day, speech-to-text software is worth investing in."
  ],
  "headers": {
    "2": "1. Requirements and purpose",
    "4": "2. Platform of choice",
    "8": "3. Accuracy and speed",
    "12": "4. Teamwork and other features",
    "14": "5. Pricing",
    "17": "Conclusion"
  },
  "links": {
    "speech-to-text software": "https://www.techradar.com/news/best-speech-to-text-app",
    "Dragon Professional": "https://www.techradar.com/reviews/dragon-professional-v15-speech-to-text-software",
    "Dragon Anywhere": "https://www.techradar.com/reviews/dragon-anywhere-review",
    "Otter": "https://www.techradar.com/reviews/otter-review",
    "Verbit": "https://www.techradar.com/reviews/verbit-review",
    "Speechmatics": "https://www.techradar.com/reviews/speechmatics-review",
    "Transcribe": "https://www.techradar.com/reviews/transcribe-by-wreally",
    "Speechnotes": "https://www.techradar.com/reviews/speechnotes",
    "collaborate": "https://www.techradar.com/best/best-online-collaboration-tools"
  }
}