{
  "source": "https://www.techradar.com/news/blade-movie-lands-its-director-and-its-another-indie-hire-for-the-mcu",
  "title": "Blade movie lands its director – and it's another indie hire for the MCU",
  "category": "entertainment",
  "updated": "2021-07-20T08:55:12Z",
  "author": "tom-power",
  "summary": "Marvel's Blade reboot will be helmed by an indie film director",
  "article": [
    "Marvel's reboot of Blade was the biggest surprise during the studio's San Diego Comic-Con panel in July 2019.",
    "Despite being announced two years ago, though, not much is known about the iconic vampire hunter's next big screen outing.",
    "Until recently, we only knew that Mahershala Ali will star as the titular superhero in the MCU's version of Blade and that filming won't begin until 2022. Now, though, it appears that Marvel has landed its director for the film – and it's an interesting choice.",
    "According to Deadline, Marvel has hired Bassam Tariq, the director behind the Riz Ahmed-starring Mogul Mowgli, to direct Blade's upcoming flick.",
    "Marvel declined to comment on the rumor when asked by Deadline, which usually indicates that there's some truth to its report.",
    "Deadline also claims that Marvel President Kevin Feige and other studio executives met with dozens of candidates for the role, with the hiring process stretching back to Fall 2020.",
    "The studio had initially wanted to press ahead with hiring someone who would fill the writing and directorial roles simultaneously but, after Watchmen's Stacy Osei Kuffour was drafted to pen the script, those plans were dropped.",
    "Providing that Tariq does helm Marvel's Blade, his hiring will continue a recent but welcome trend where Marvel Studios is concerned.",
    "Feige and company have made a habit of bringing in underrated or indie film directors to direct its most recent movies, and Tariq's potential hiring would certainly follow that trend.",
    "Spider-Man's Jon Watts, Thor: Ragnarok's Taika Waititi, Captain Marvel's Anna Boden and Ryan Fleck, and Black Widow's Cate Shortland are just some of Marvel's recent directorial choices who, before their hiring, made their names with indie feature films.",
    "This trend is set to continue well into Marvel's Phase 4 movie slate, too.",
    "Watts and Waititi have returned to helm sequels in Spider-Man: No Way Home and Thor: Love and Thunder respectively.",
    "Meanwhile, Destin Daniel Cretton (Just Mercy) has directed Shang-Chi's upcoming live-action flick, Nomadland's Oscar-winning director Chloe Zhao led Marvel's Eternals, and Nia DaCosta (Little Woods, Candyman) is helming Captain Marvel follow-up called The Marvels.",
    "This recent space of indie directorial hires is in stark contrast to Marvel's earlier movies where established names like Jon Favreau, Kenneth Branagh, Shane Black and Alan Taylor helmed many of the MCU's Phase 1 and 2 films.",
    "Marvel appeared to play it safe with its directorial choices while it began to set up its cinematic universe. With that now firmly established on the global stage, the studio can look further afield for the next generation of creative minds to helm its upcoming slate.",
    "The hiring of upcoming directors, whose roots lie in indie productions, is a refreshing change of pace, too. The likes of Zhao, DeCosta and Tariq can bring new methods, aesthetic styles, camera work and other ideas to the table and allow Marvel's films to be as distinct as possible.",
    "There has been a small vocal minority who believe that superhero movies are starting to become a little stale. Guardians of the Galaxy's James Gunn said as much during the press tour for DC's The Suicide Squad – comments echoed in the past by individuals including Martin Scorcese.",
    "With this new crop of inventive directors, though, Marvel movies are becoming more cinematic and unique from their predecessors and siblings – and that can only be a good thing."
  ],
  "headers": {
    "7": "Analysis: Blade's director follows in the footsteps of other indie hires for MCU movies"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/07/blade-director-bassan-tariq-1234721241/",
    "Black Widow": "https://www.techradar.com/news/black-widow-post-credits-scene-explained",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Thor: Love and Thunder": "https://www.techradar.com/news/thor-love-and-thunder-thor-4",
    "Shang-Chi'": "https://www.techradar.com/news/shang-chi-release-date-trailer-cast-and-what-we-know-about-marvels-new-movie",
    "Marvel's Eternals": "https://www.techradar.com/news/the-eternals-release-date-cast-and-what-we-know",
    "said as much": "https://www.techradar.com/news/superhero-movies-have-become-boring-suicide-squad-director-says"
  }
}