{
  "source": "https://www.techradar.com/news/this-black-friday-deal-sees-the-best-tv-in-the-world-at-the-cheapest-its-ever-been",
  "title": "Quick, this 5-star Samsung QLED 8K TV is somehow still in stock",
  "category": "televisions",
  "updated": "2021-11-17T15:15:04Z",
  "author": "gareth-beavis",
  "summary": "Our best TV in the world is down to the lowest-ever price",
  "article": [
    "If you're thinking about getting a new 8K TV - and want to invest in the purchase - then you should be going for the Samsung 65-inch QN900A QLED 8K TV, which is somehow stillon sale from Samsung for $3,299.99 (was $4,999.99).",
    "We're really surprised that this deal still exists, mostly because it's only been on sale for a few months and usually that kind of thing doesn't get added to the roster of Black Friday deals at the retailer.",
    "Why is this television sitting gloriously on top of our best TV list? Well, it comes with gloriously-rendered 8K resolution and, despite only being out a few months, it's had a massive $1,700 price cut from the RRP (although other retailers have had it as low as $3,499 recently).",
    "Note, if you'd prefer to pick this one up at Amazon you'll find this retailer slightly undercutting Samsung by two dollars right now - huge numbers, we think you'll agree, as both try to take the crown of best Black Friday TV deal before November 26.",
    "Both retailers have finance options, although Samsung has a slightly lower rate, quicker delivery, and also the massive 85-inch model in stock.",
    "Not in the US? Check out our list of the best QN900A deals in your region below - although, sadly, it doesn't look like the UK is getting many good deals at the moment.",
    "OK, so you've decided that you might be interested in the Samsung QLED - but you're still thinking that a few thousand dollars is a little much for you. Fair point.",
    "Well, there are a few reasons we really enjoyed Samsung's QN900A Neo QLED 8K TV and made it our best TV of 2021. The design is what rocked first - the 0.9mm bezel really creates an alluring screen to watch, and the thin profile allows for easy wall mounting.",
    "Samsung's image processing is really what brings the image quality to the fore, using very, very small LEDs (Quantum Mini LEDs if you want the brand name) to give incredible contrast ratio and strong brightness - this is the sort of TV that you'd see in a shop and be wistful for throughout the rest of the day, and it's now on sale.",
    "You can see more of Samsung's early Black Friday TV deals below, and keep in mind, these are limited-time offers, so if you see a price you like, we recommend taking advantage now before it's too late (although they've managed to stay live for quite some time...)",
    "You can also see more of the best Black Friday 75-inch TV deals and the best Black Friday OLED TV deals if you fancy checking out more of the best Black Friday sales right now."
  ],
  "headers": {
    "6": "Today's best Black Friday QLED TV deals",
    "10": "More Black Friday QLED TV deals"
  },
  "links": {
    "on sale from Samsung for $3,299.99 (was $4,999.99)": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-5029971435300339000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Ftelevisions-home-theater%2Ftvs%2Fsamsung-neo-qled-8k%2F65-qn900a-neo-qled-8k-smart-tv-2021-qn65qn900afxza%2F&article_name=Quick%2C%20this%205-star%20Samsung%20QLED%208K%20TV%20is%20somehow%20still%20in%20stock&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-black-friday-deal-sees-the-best-tv-in-the-world-at-the-cheapest-its-ever-been",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "best TV": "https://www.techradar.com/news/best-tv",
    "undercutting Samsung by two dollars": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FSAMSUNG-65-Inch-Class-QN900A-Built%2Fdp%2FB08VJN6ST7%2Fref%3Dsr_1_3%3Fgeniuslink%3Dtrue%26keywords%3Dsamsung%252B65%252Binch%252Bclass%252Bneo%252Bqled%252B8k%252Bqn900a%252Bseries%252B8k%252Buhd%252Bquantum%252Bhdr%252B64x%252Bsmart%252Btv%252Bwith%252Balexa%252Bbuilt%252Bin%26qid%3D1637140867%26refresh%3D1%26sr%3D8-3%26th%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1136104462542902300-20",
    "best Black Friday TV deal": "https://www.techradar.com/black-friday/tv-deals",
    "Samsung's QN900A Neo QLED 8K TV": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals",
    "Black Friday 75-inch TV deals": "https://www.techradar.com/black-friday/black-friday-75-inch-tv-deals",
    "Black Friday OLED TV deals": "https://www.techradar.com/black-friday/black-friday-oled-tv-deals-2021-the-best-early-oled-sales-you-can-find-today"
  }
}