{
  "source": "https://www.techradar.com/news/diy-builder-makes-breathing-rtx-3080-pc-and-its-the-coolest-build-weve-ever-seen",
  "title": "DIY builder makes 'breathing' RTX 3080 PC and it's the coolest build we've ever seen",
  "category": "computing",
  "updated": "2021-07-01T20:42:09Z",
  "author": "john-loeffler",
  "summary": "Fanless cooling thanks to magnets and suction",
  "article": [
    "A DIY builder on YouTube has constructed what he bills as the world's first \"breathing\" PC, and it is honestly one of the most innovative and beautiful PC builds we have ever seen.",
    "YouTuber DIY Perks turned his attention towards high-end gaming PCs to see if he could construct a build running seriously powerful gaming hardware without needing to rely on noisy fans for cooling. Using acrylic bellows, vents, and a water loop to cool one of the best graphics cards and the best gaming CPU on the market, the RTX 3080 and AMD Ryzen 9 5950X, he reproduced an innovation designed by Nature itself.",
    "Using magnets and reinforced acrylic panels that quietly glide back and forth, DIY Perks was able to create a lung-like bellows system that successfully pulled in cooler, ambient air while forcing out the heat produced by the PC hardware, all without a single fan. It's a masterclass in engineering design and is absolutely worth watching in its entirety.",
    "It's no secret that high-end hardware like the RTX 3080 and AMD Ryzen 9 5950X generate a lot of heat, so using powerful – and noisy – fans seem like an absolute necessity if you want to get high-performance gaming.",
    "DIY Perks' build shows that that might not strictly be true, however. It should be noted that the CPU and GPU temperatures he recorded were impressive for a fanless build – 60 and 62 degrees Celsius, respectively. The real question is whether they can maintain those temperatures when cranking up Cyberpunk 2077 to ultra settings with ray tracing turned on.",
    "The benchmark tool DIY Perks used is certainly valid, but as PCGamesN points out, he didn't run any in-game benchmarks, or run any of the more intensive tests like those we use to test GPUs, such as 3DMark's Time Spy or Port Royal, so it's hard to gauge the builds true potential against more traditional, fan-heavy builds.",
    "Still, the build is admittedly the first prototype of the design that DIY Perks has produced, so there is absolutely room for him to improve on the design. We hope that he does and that inspires others to explore this as a cooling mechanism for future builds."
  ],
  "headers": {
    "3": "How well does this cooling work with powerful, high-end components?"
  },
  "links": {
    "DIY Perks": "https://www.youtube.com/channel/UCUQo7nzH1sXVpzL92VesANw",
    "best graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "best gaming CPU": "https://www.techradar.com/news/computing-components/processors/best-gaming-cpu-5-top-processors-reviewed-and-rated-720463",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "AMD Ryzen 9 5950X": "https://www.techradar.com/deals/where-to-buy-amd-ryzen-9-5900x-and-5950x-find-stock-here",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "PCGamesN": "https://www.pcgamesn.com/nvidia/magnet-cooled-gaming-pc"
  }
}