{
  "source": "https://www.techradar.com/news/intel-rocket-lake-leak-hints-at-core-i9-11900k-cpus-gaming-performance",
  "title": "Intel Rocket Lake leak hints at Core i9-11900K CPU’s gaming performance",
  "category": "computing",
  "updated": "2021-03-10T13:07:17Z",
  "author": "darren-allan",
  "summary": "Solid gains could be coming, but there are caveats aplenty here",
  "article": [
    "Intel’s incoming Rocket Lake processors have been the subject of another leak, this time detailing specs of higher-end CPUs, and the gaming performance we can expect from the new 11th-gen flagship.",
    "The most interesting part of this spillage is Intel’s gaming comparisons of the Core i9-11900K against its own current Comet Lake 10900K flagship.",
    "Although do note that this leak, consisting of Intel documents and presentation material, was shared on Weibo, and must be treated with some caution to say the least.",
    "Indeed, VideoCardz, which spotted this on Twitter, points out that the material doesn’t use Intel’s new logo or formatting, but that could be because it was prepared prior to the introduction of those changes.",
    "Anyway, a healthy dose of skepticism firmly in mind, the leak gives us a possible glimpse of the performance of the Core i9-11900K across a small selection of four games, plus the purported final specs. The 8-core (16-thread) chip will supposedly run with a base clock of 3.5GHz and single-core boost up to 5.3GHz (with Thermal Velocity Boost or TVB – as previously rumored), or all-core boost to 4.7GHz.",
    "Bearing in mind that the benchmarks are all at 1080p (with high details), the 11900K shows what are presumably average frame rate gains of up to 14% against the 10900K. That biggest leap is with Microsoft Flight Simulator, and increases in other titles are somewhat more modest, like Gears 5 which is 9% faster.",
    "Naturally, we must be very careful here not just because this is a leak – even if these are genuine benchmark results from Intel, we must bear in mind that internal testing of this kind can often use cherry-picked situations. That can be in terms of the games or settings used (or indeed other components in the test PCs), which can be chosen to show the CPU in question in a more favorable light. As VideoCardz points out, it could even be the case that the spilled benchmark slide refers to some metric other than average frame rate.",
    "While on the face of it – caveats acknowledged – these look to be solid gains, we really need to get the Core i9-11900K (and other Rocket Lake CPUs) in our mitts to perform our own testing before we can be certain how these 11th-gen chips stack up to their predecessors (and indeed AMD Ryzen 5000 rivals).",
    "As for the specs of the Core i7-11700K which are also detailed here (apply more salt), it runs with 8-cores as well, but lacks TVB and as such will only boost to a max speed of 5GHz.That’s still a good speed, but it’s 300MHz shy of the 11900K with TVB kicking in. That said, the all-core boost of the 11700K will be up to 4.6GHz, which is only 100MHz slower than the Rocket Lake flagship – and the base clock will be 3.6GHz, which is actually 100MHz higher.",
    "Recent leaks around the performance of the Core i7-11700K have led to some disappointment online, as you may well have seen, leading to some head-scratching about the performance levels of the 11900K shown here, and exactly how it’ll differentiate itself looking at these relative specs. But we shouldn’t get ahead of ourselves, naturally, and all this comes back to waiting for the final release of Rocket Lake CPUs before jumping to any (even rough) conclusions, or certainly theoretical comparisons.",
    "What we didn’t get with this leak – and what will be a crucial piece of the puzzle – is any pricing details on Rocket Lake."
  ],
  "headers": {
    "6": "Leaky Lake"
  },
  "links": {
    "Rocket Lake processors": "https://www.techradar.com/news/intel-rocket-lake",
    "Comet Lake 10900K flagship": "https://www.techradar.com/reviews/intel-core-i9-10900k",
    "VideoCardz": "https://videocardz.com/newz/intel-11th-gen-core-rocket-lake-full-specifications-allegedly-leaked",
    "as previously rumored": "https://www.techradar.com/news/rocket-lake-leak-reveals-final-specs-of-flagship-intel-core-i9-11900k-desktop-cpu",
    "AMD Ryzen 5000": "https://www.techradar.com/news/amd-ryzen-5000-processor-failures-are-they-really-that-bad",
    "Core i7-11700K": "https://www.techradar.com/news/intel-core-i7-11700k-falls-flat-in-leaked-performance-benchmarks",
    "pricing details": "https://www.techradar.com/news/intel-core-i7-11700k-goes-on-sale-early-and-the-price-might-shock-you"
  }
}