{
  "source": "https://www.techradar.com/news/score-your-summer-with-these-video-game-soundtracks",
  "title": "Score your summer with these video game soundtracks",
  "category": "computing",
  "updated": "2021-04-24T13:00:58.861Z",
  "author": "rosario-blue",
  "summary": "Video games, summer vibes",
  "article": [
    "Summer is almost here (unless you're in the southern hemisphere), and to say we’re excited would be an understatement. For many of us life is finally returning to being semi-normal again. So, with the sun and longer days soon to be in full swing, we put together a list of some of the best video game soundtracks that’ll add an extra dimension to your summer.",
    "Stardew Valley had to make the list. Composed by the game’s lead developer and creator, Eric Barone, AKA ConcernedApe, Stardew Valley’s soundtrack is much like the game: relaxing, light – the type of music you’d expect to hear in a seaside town.",
    "Stardew Valley by design, is a slow-paced RPG farming and life sim that conveys the laidback-ness of the season. Great if you’re wanting to chill or want something that gives you that sun-kissed feeling. It’s also nice to play in the background while working.",
    "The Hades Original Soundtrack, written and composed by Darren Korb and with vocals by Ashley Barrett, is as outstanding as the game.",
    "Its guitar riffs and gorgeous use of wind and percussion instruments feels like you’re baking in the heat of the warm Mediterranean sun.",
    "Korb also made the excellent soundtracks to fellow Supergiant Games titles Transistor and (also featured on this list) Bastion, the crème de la crème of indie games.",
    "The Hades OST really highlights the skill and talent of Korb, who has proven so far to be one of the most exciting video game composers out right now.",
    "We couldn’t make a list like this and not include the legendary GTA: Vice City, whose soundtrack consists of a compilation of classic tunes spanning from the ‘70s through the ‘80s. There’s everything from Toto’s Africa, to vintage MJ.",
    "Rockstar Games always delivers great songs in its games, but GTA has been especially lauded for its musical choices.",
    "For maximum nostalgic summer bliss, listen to Vice City radio channels in their entirety. Flash FM and Fever 105 are our summer picks, but there’s also Emotion 98.3, Wave 103, and V-Rock.",
    "Sega’s classic arcade racing game, Out Run, was released in 1986 and went on to become one of the best-selling video games at the time – has an equally classic soundtrack that's perfect for a summer’s drive.",
    "Composed by Hiroshi Kawaguchi, this soundtrack is most definitely a trip down memory lane for some of our more seasoned gamers.",
    "The Out Run soundtrack is a Synthwave wonder – a musical genre born out of the game’s signature 80’s themes – and has gone on to inspire and influence a whole generation of people.",
    "This is our second helping from Supergiant games, again from composer Darren Korb. Bastion was the studio’s debut title and an innovative one at that.",
    "The soundtrack, written, composed and produced by Darren Korb, is a moody mix of American folk-country and middle-eastern sounding melodies. Sit back and relax to this masterpiece..",
    "If you haven’t played Bastion yet, we highly recommend you do; you won’t regret it.",
    "Basketball sim NBA2K21, published by 2K, has a great soundtrack that definitely deserves a mention. Although it’s not the most popular game on Steam – its reviews add up to “mostly negative” – it does possess an awesome compilation of popular summer party tunes, perfect for a gathering of any size or a summer gym session, and heavily features hip-hop, trap, grime, and a little bit of rock.",
    "Artists including Stormzy, the Strokes, The Weeknd and many more make an appearance. It’s very current, so a lot of these songs may already feature heavily on your personal playlists.",
    "Our second helping from Rockstar Games, Bully, despite its cult following, is still one of the most underrated titles from the award-winning studio. A Sequel was in the works in 2013, but Rockstar canned the idea and appear to not be picking it back up. Bully’s soundtrack was composed by Shawn Lee.",
    "The songs matched the game well, but Bully (Original Soundtrack) is a great standalone album. Its smooth, cool and energetic beats will keep you in a summer mood.",
    "Jet Set radio, the classic 3D-action skating game published by Sega and developed by Smilebit has a renowned original soundtrack, the majority of which was composed by Hideki Naganuma.",
    "Naganuma is credited on many other video game soundtracks including Sonic Rush and as supervisor on the Super Smash Bros soundtrack for the 3DS and Wii U.",
    "The soundtrack mashes up so many different genres, including jazz, J-Pop and hip-hop. A later version released for the European and North American audience included metal tracks, perfect for music lovers with eclectic tastes.",
    "If you don’t know about this gem of a soundtrack, then get to know it, because it’s a feel-good classic.",
    "It’s a mix of upbeat dance, rock, pop and Simlish-filled feel-good tunes. It’s dance-worthy but also straight up weird, great for a summer run, or as non-intrusive music to work to.",
    "The soundtrack was made by none other than Mark Mothersbaugh, the legend responsible for the Rugrats theme (in fact, he composed all the music for the Rugrats cartoon and movies), Jak and Daxter: The Precursor Legacy, Jak II and 3, and many others. He was also a member of ‘80s synth-pop group Devo.",
    "What’s this doing here? A single song instead of a soundtrack? Well, since it’s ended up here it would be remiss of us to not talk about the wonderful world of Zelda music, but Song of Storms is a force on its own.",
    "Written by musical legend Koji Kondo, composer of many of Nintendo’s greatest titles, Song of Storms is easily one of the most beautiful songs in video game history. It feels like a call to summer, rather than one to stir the heavens to open up and rain down.",
    "Sure, it's 'just' one song, but you could always listen to it on loop for ten minutes.",
    "Let’s face it, amongst the many things that video games are successful at doing, music is most certainly one of them, and you can find any soundtrack for any season, mood, or festivity, so take your pick and enjoy!",
    "Check out from 8-bit to Chiptune: the music that changed gaming forever for more video game music reads."
  ],
  "headers": {
    "1": "Stardew Valley",
    "3": "Hades",
    "7": "GTA: Vice City",
    "10": "Out Run",
    "13": "Bastion",
    "16": "NBA2K21",
    "18": "Bully",
    "20": "Jet Set Radio",
    "23": "The Sims 2",
    "26": "The Legend of Zelda - Song of Storms"
  },
  "links": {
    "ConcernedApe": "https://twitter.com/ConcernedApe",
    "Stardew Valley": "https://www.stardewvalley.net/",
    "Supergiant Games": "https://www.supergiantgames.com/",
    "Rockstar Games": "https://www.rockstargames.com/",
    "2K": "https://www.2k.com/en-US/games/",
    "Stormzy": "https://www.stormzy.com/",
    "the Strokes": "https://www.thestrokes.com/",
    "The Weeknd": "https://www.theweeknd.com/",
    "Mark Mothersbaugh": "http://mutato.com/",
    "Rugrats": "https://www.youtube.com/watch?v=jMEj9kQg3F8&ab_channel=NickelodeonCartoonUniverse",
    "Jak and Daxter: The Precursor Legacy": "https://store.playstation.com/en-us/product/UP9000-CUSA02522_00-SCUS971240000001",
    "Jak II": "https://www.playstation.com/en-us/games/jak-ii-renegade/",
    "3": "https://store.playstation.com/en-us/product/UP9000-CUSA07841_00-SCUS973300000001",
    "Devo": "http://www.clubdevo.com/",
    "Koji Kondo": "https://www.imdb.com/name/nm0464848/",
    "Nintendo’s": "https://www.nintendo.com/",
    "8-bit to Chiptune: the music that changed gaming forever": "https://www.techradar.com/news/8-bit-music-the-soundtrack-to-a-gaming-revolution-that-resonates-today"
  }
}