{
  "source": "https://www.techradar.com/news/sony-ps5-game-franchises-could-land-on-iphone-and-android-later-this-year",
  "title": "Sony PS5 game franchises could land on iPhone and Android later this year",
  "category": "phones",
  "updated": "2021-05-27T20:15:27Z",
  "author": "david-lumb",
  "summary": "Sony is planning to bring its big franchises to mobile in 2021",
  "article": [
    "Could God of War's Kratos flex on your smartphone or Ratchet & Clank ham it up on your iPad later this year? That's possible, as Sony is promising to bring its “iconic IP” to mobile in 2021, according to a recent investor relations presentation.",
    "Sony is interested in launching mobile game versions of its key franchises in a move that's meant to replicate the company's success in bringing two big properties – Horizon Zero Dawn and Predator – to the PC last year, which was profitable, according to Sony Interactive Entertainment (SIE) president and CEO Jim Ryan.",
    "“In FY21 we will begin to publish some of our iconic PlayStation IP on mobile and we anticipate that in 2021, that will not provide a significant profit flow, but we do anticipate that as we learn from that experience,” Ryan said, according to Video Games Chronicle. “And as we increase the number of titles that we publish on mobile, the contribution from both PC and mobile will start to become steadily more important as time passes.”",
    "While this could mean mobile games coming in 2021, Sony's fiscal year runs from March 2021 to March 2022, so releases could roll over into next year. Ryan cited the growing mobile gaming market, which produced $121 billion in revenue worldwide in 2020, compared to $62 billion for consoles.",
    "Ryan didn’t indicate which of SIE’s “iconic IP” will be coming to mobile, but given the comparison to last year’s successful PC ports – Horizon Zero Dawn and Predator – we could expect a mix of exclusive and licensed properties. At a prior corporate strategy meeting, Ryan explained the company had some success experimenting with mobile games and apps, and mobile will likely be one area it continues to explore, per Video Games Chronicle:",
    "“PlayStation has a huge catalogue of diverse first-party IP that can transition to smartphone gaming and complement our AAA games or live service games. We are exploring the mobile market with some wonderful PlayStation franchises so please stay tuned.”",
    "We’re left to speculate what SIE believes would make a good transition to mobile, though new PS5 games like Ratchet & Clank: A Rift Apart could suggest popular franchises worth transitioning to mobile – as well as eagerly-anticipated games like Deathloop, God of War: Ragnarok, Horizon Forbidden West, and more. Square Enix already has a mobile game planned this year – Final Fantasy 7: The First Soldier, a battle royale – but we’re eager to see what SIE is cooking up from its library of popular IP.",
    "Via 9to5Mac"
  ],
  "headers": {
    "4": "So which Sony games are coming to mobile?"
  },
  "links": {
    "Video Games Chronicle": "https://www.videogameschronicle.com/news/sony-will-start-bringing-some-iconic-playstation-ip-to-mobile-this-financial-year/",
    "new PS5 games": "https://www.techradar.com/news/new-ps5-games",
    "Deathloop": "https://www.techradar.com/reviews/deathloop-review",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "mobile game planned": "https://www.techradar.com/news/two-ff7-mobile-games-are-coming-include-a-battle-royale-set-in-midgar",
    "9to5Mac": "https://9to5mac.com/2021/05/27/playstation-franchise-games-iphone/"
  }
}