{
  "source": "https://www.techradar.com/news/motorolas-two-new-cheap-phones-bring-a-huge-change-to-the-moto-g-line",
  "title": "Motorola's two new cheap phones bring a huge change to the Moto G line",
  "category": "phones",
  "updated": "2021-02-17T14:38:50Z",
  "author": "tom-bedford",
  "summary": "Fly like a G30",
  "article": [
    "Motorola's next line of Moto G smartphones is here, and as befits the successor to the Moto G9, it's called the Moto G10... But wait, what's that coming with the Moto G10? The Moto G30?",
    "Motorola has two new smartphones, the Moto G10 and Moto G30, and as that naming trend suggests, the company is doing something new with its series. Gone is your parents' Moto G line!",
    "Motorola is rebranding its Moto G line, so the 2021 generation of affordable handsets won't be slapped with the same numerical indicator, but will be arranged on a broad spectrum between 10 and, presumably, 100, though this latter hasn't been confirmed.",
    "So the Moto G10 is the lowest-end of the company's new smartphones, with the G30 a few steps above it in terms of specs and price (though still familiar in many ways). Possibly sometime soon we'll see more handsets, like a Moto G20, and higher numbers like a G50, G80, G100, G-whizz how high could it go?",
    "Phone fans will recognize Samsung took a similar step with its Galaxy A series in 2019, jumping from the A9 to a new spectrum ranging from Galaxy A10 to Galaxy A90. Each generational upgrade added 1 to the title, so the A21 followed the A20, and so on. It's not clear if this is the direction Motorola will go in though, only time will tell.",
    "The Moto G10 and Moto G30 are alike in many ways - it's handy Motorola showed them off together, as it lets us easily compare them. As you can see from the image at the top of this article, they look pretty similar too.",
    "Both of the phones have 6.5-inch HD+ displays with a 1600 x 720 resolution, and a teardrop notch for the front-facing camera. The Moto G10 has a 60Hz refresh rate while it's 90Hz for the Moto G30.",
    "The handsets both have rear-mounted fingerprint scanners, physical Google Assistant buttons, and 5,000mAh batteries, which should keep them ticking a while - there's 10W charging in the Moto G10 and 20W in the G30.",
    "You're getting four rear cameras on both devices, and they share an 8MP ultra-wide, 2MP depth-sensing and 2MP macro snapper in common. The main camera is 48MP on the Moto G10 and 64MP on the G30.",
    "Another key difference between the phones, other than the main camera, is specs - the Moto G10 has a Snapdragon 460 chipset paired with 4GB RAM, and comes with either 64GB or 128GB of storage. The Moto G30 comes with the more powerful Snapdragon 662, paired with either 4GB or 6GB of RAM, and you can choose between 64GB or 128GB of storage. Both phones are 4G, making them some of the few non-5G phones we've seen recently.",
    "We've got prices of both phones, but it's only Euro pricing for now, and we'd expect these to be useful guides but not exact representations of prices in other currencies. The Moto G10 is set to cost £129 (around $180, AU$230), with the Moto G30 coming in at £159 (about $220, AU$280) - both are therefore budget devices, set to rival Moto's previous G-series phones.",
    "The phones are set to come out immediately in a few European countries, with a wider release in the following weeks. We'll be sure to test out the Moto G10 and G30 - as well as any other members of this burgeoning new family - to see if they're worth your money, as soon as we can."
  ],
  "headers": {
    "5": "The Moto G10 and G30"
  },
  "links": {
    "Moto G9": "https://www.techradar.com/news/moto-g9-series"
  }
}