{
  "source": "https://www.techradar.com/news/new-mediatek-dimensity-9000-chipset-could-have-the-iphone-14s-a16-bionic-beat",
  "title": "New MediaTek Dimensity 9000 chipset could have the iPhone 14’s A16 Bionic beat",
  "category": "phones",
  "updated": "2021-11-19T12:17:21Z",
  "author": "james-rogerson",
  "summary": "A better process",
  "article": [
    "The first of a new wave of flagship smartphone chipsets has just been unveiled, as MediaTek has announced the Dimensity 9000 chipset, which could be used in a number of 2022’s flagship phones, and it could also have Apple’s next smartphone chipset beat in at least one way.",
    "That’s because the MediaTek Dimensity 9000 is built on a 4nm process, while some reports suggest the iPhone 14’s chipset (likely to be called the A16 Bionic) will be built on a 5nm process.",
    "Those terms refer to the manufacturing process used to craft the chipset, and a smaller number basically means that the chipset can be condensed, allowing for something that offers more power and efficiency in a similar – or sometimes smaller – space.",
    "Typically, when a chipset moves to a smaller process, you can expect bigger upgrades than when it sticks with the same process, and if the iPhone 14 uses a 5nm process then it won’t just be behind the MediaTek Dimensity 9000, it will also be using the same process as the iPhone 13 did.",
    "Beyond this move to a 4nm process, MediaTek has revealed that the Dimensity 9000 has one high-performance Cortex-X2 core clocked at 3.05GHz, three Cortex-A710 cores running at 2.85GHz, and four Cortex-A510 efficiency cores clocked at 1.8GHz.",
    "Additionally, the chipset offers a 10-core Arm Mali-G710 GPU, and MediaTek claims its AI processing offers four times better performance and efficiency than the Dimensity 1200 (which is the previous generation chipset) was capable of.",
    "The Dimensity 9000 also supports 320MP images – not that we’d expect any phone will be able to shoot those for a long time, and it’s the first chipset to support Bluetooth 5.3. Wi-Fi 6E is supported too, as is 5G – though only sub-6GHz, not the faster mmWave version.",
    "While the MediaTek Dimensity 9000 sounds promising, as we noted above it’s just the first in a wave of new flagship silicon.",
    "The Qualcomm Snapdragon 898 is still to come, with an announcement of that expected on November 30. That’s likely to power the majority of the top Android phones of 2022, such as the OnePlus 10 range and the Samsung Galaxy S22 range (in many regions anyway).",
    "Then there’s Samsung’s Exynos 2200, which could be at the heart of the Galaxy S22 range in other parts of the world – though it’s rumored that production difficulties could mean it’s not used in many places. And then of course there’s the A16 Bionic that will power the iPhone 14 range later in the year.",
    "MediaTek’s chipsets typically aren’t used in many high-profile phones, so despite being the first of the new wave we might not see the Dimensity 9000 used much, but you never know."
  ],
  "headers": {
    "7": "Analysis: a promising chipset that will soon have lots of competition"
  },
  "links": {
    "iPhone 14": "https://www.techradar.com/news/iphone-14",
    "be built on a 5nm process": "https://www.techradar.com/news/iphone-14-might-not-be-that-much-more-powerful-than-the-iphone-13",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Qualcomm Snapdragon 898": "https://www.techradar.com/news/qualcomm-snapdragon-8-gen-1-features-news-compatible-phones-and-what-it-can-do",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "it’s not used in many places": "https://www.techradar.com/news/samsung-galaxy-s22-could-use-the-same-chipset-everywhere"
  }
}