{
  "source": "https://www.techradar.com/news/lenovos-next-gaming-phone-photographed-with-a-built-in-fan",
  "title": "Lenovo’s next gaming phone photographed with a built-in fan",
  "category": "phones",
  "updated": "2021-04-06T09:02:33Z",
  "author": "james-rogerson",
  "summary": "And a strange design",
  "article": [
    "The Lenovo Legion Phone Duel is currently the best gaming phone you can buy, but perhaps not for long, as the Lenovo Legion 2 Pro is expected to land soon, and some leaked pictures suggest it could be an impressive successor.",
    "Shared by Antutu (a benchmark test group) on Weibo (a Chinese social network), the photos show what appears to be the Lenovo Legion 2 Pro from both the front and back, with the rear including a visible fan near the middle.",
    "Many phones have cooling systems of some kind, and gaming phones often support clip-on fans, but a built-in fan on a phone is unusual, and might mean this is able to keep cool better than most.",
    "You can see that the Lenovo Legion 2 Pro as shown here has an unusual design, with its dual-lens camera also housed near the middle of the phone's rear, but that’s in line with the Lenovo Legion Phone Duel.",
    "The back looks as though it’s at least slightly curved, while the front houses a flat screen with no sign of a selfie camera. That snapper, though, pops out of the side (or the top when held in landscape) on the Legion Phone Duel, and it's the same here.",
    "We know this because Lenovo has already revealed as much in a teaser, as well as revealing that the selfie camera is 44MP, while the main rear camera is 64MP, and that the phone will have a top-end Snapdragon 888 chipset (like the OnePlus 9 Pro and others), plus a 6.92-inch 144Hz screen, a 5,500mAh battery, and remarkably fast 90W charging.",
    "All in all, the Lenovo Legion 2 Pro is shaping to be a top gaming phone, and the few remaining details will be revealed soon, as the phone is being unveiled on April 8.",
    "Via GSMArena"
  ],
  "headers": {},
  "links": {
    "Lenovo Legion Phone Duel": "https://www.techradar.com/reviews/lenovo-legion-phone-duel-review",
    "best gaming phone": "https://www.techradar.com/news/best-phone-for-gaming",
    "Weibo": "https://m.weibo.cn/detail/4622920313473303",
    "OnePlus 9 Pro": "https://www.techradar.com/reviews/oneplus-9-pro-review",
    "GSMArena": "https://www.gsmarena.com/lenovo_legion_2_pro_reveals_a_builtin_fan_in_new_live_photos-news-48523.php"
  }
}