{
  "source": "https://www.techradar.com/news/kickstart-a-game-to-life-by-checking-out-our-pick-of-the-best-games-looking-for-crowdfunding",
  "title": "The best PC games looking for crowdfunding that you can support right now",
  "category": "gaming",
  "updated": "2021-09-05T14:00:39Z",
  "author": "rosario-blue",
  "summary": "The best games to pledge to on Kickstarter.",
  "article": [
    "Kickstarter is long past the days when backing a campaign was like tossing your money to a drunk leprechaun.",
    "Shenmue III, Divinity: Original Sin and FTL (Faster Than Light) are just some of the great PC games that have been funded via Kickstarter campaigns.",
    "With that being said, how do you determine which games are worthy of your funds? Below, we reveal the titles we think are worth the punt.",
    "Stormrite is a single-player, third-person, open-world fantasy RPG developed and published by Kelechi Apakama. In the dark and twisted medieval realm of Redreach, you must choose your path as a ranger, mage or warrior, embarking on a journey through unique regions and completing quests to save the realm.",
    "The goal for Stormrite is $27,854 (£20,000/AU$37,600). Pledges range from $7 (£5/AU$10) to $1,740 (£1,250/AU$2,350) and have great incentives.",
    "For those who don’t have any funds to put towards Stormrite, worry not - you can add it to your wishlist on Steam, ready for its late 2022 release. The campaign ends on August 31, 11:59pm BST.",
    "Developed and published by Killsecuregames, 2089 – Space Divided is made by fans of the genre. Build up your base, collect resources, and produce units – what more do you want from an RTS?",
    "Killsecuregames is looking to raise $11,866 (£8,520/AU$13,616) and their campaign ends on August 11, so be sure to get your pledges in quickly. Pledges range from $6-1776 (£5-£1500/AU$8-2397) with early beta access, T-shirts, backpacks and more as pledge incentives.",
    "2089 – Space Divided is currently in Early Access on Steam. Add it to your wishlist and play the demo to take it on a test run.",
    "Developed and published by German studio, Inferno, this turn-based RPG is set in a bustling city comprising five districts through which you must journey to collect names.",
    "Names matter in Memory Lane, because they hold the key to your identity. Losing your name means you’ll be forgotten by all, and if they fall into the hands of another, the recipient will gain your skills and power. To get a name that can’t be lost, you must get to the city center, and deliver your “idea” to it.",
    "Inferno’s goal is $21,359 (£15,336/AU$28,832) and you can pledge anywhere from $1,444 (£1,320/AU$1,599). You can also add it to your Steam wishlist and try out the demo.",
    "Developed and published by Studio Mechka, which is based in Sofia, Bulgaria, Marko: Beyond Brave is a 2D action-adventure game set in a fantasy world called Zagora. The game is based on Slavic myths and Balkan folklore, with you having to solve puzzles, uncover mysteries, master new abilities and survive dastardly traps while exploring the vast map.",
    "Marko: Beyond Brave has actually surpassed its Kickstarter, but you can still pledge money since the campaign is running till August 12, 12:01 PM BST. Pledges start from $15-3,307 (£14-2,380/AU$21-4,465).",
    "Marko: Beyond Brave will eventually be available on Steam and console to follow.",
    "TheHexam! is a 3D puzzle game that focuses on perspective and colors, developed by computer engineer Sergio Garcia Mondaray.",
    "In this brain-training title, you have to solve complex puzzles that change perspective while moving a colorful cube across differently shaped platforms.",
    "Sergio is looking for $35,600 (£25,561/AU$4,855) to complete the game. Pledge from $11-592 (£9-£500/AU$14-799). Among the incentives is access to the source code to the game. The campaign is running until Saturday, August 14, 1:14 pm BST.",
    "TheHexam! will be available on PC and Linux, with a possible summer 2022 release.",
    "Two things we love most about this Metroidvania title are its combat system and cool anime-style art. Developed and published by Imperio Gaming Studio, Esdraz find you playing as Esdraz himself, from fighting bosses to solving puzzles and discovering secret missions.",
    "Your weapons are important since they necessitate different playstyles – and they are many, so you must choose wisely, young warrior.",
    "With a goal of $30,752 (£22,081 / AU$41,513) Imperio Gaming Studio is almost halfway to being fully backed. The incentives are worth a look – the exclusive Esdraz 3D figure certainly caught our eye.",
    "Enjoy a good fright? Well, Cry Out looks like it will give you just that. This 3D horror survival game is developed and published by Swiss studio Divilusion.",
    "In Cry Out, you’re stuck in a nightmare trying to figure out where the hell you are and how you got there. The world of Cry Out is filled with terrifying monstrosities and unnerving interactions.",
    "Finding the answers to your questions is risky, because in this world “every second you spend looking for an answer makes it more dangerous for you.” Charming.",
    "Divilusion’s goal is $16,573 (£11,900/AU$22,372) with great rewards.",
    "This first-person hardcore cooperative tactical shooter is based on a collaborative web-based fictional series, SCP Foundation’s canon, which has been running for almost 15 years, with all the art based on the graphic novel SCP-5000.",
    "Developed and published by Affray LLC, SCP: Pandemic isn’t for the faint of heart. You’re tasked with taking down hordes of unsightly mutations and other challenging encounters that makes this game more than just an “obliterate all zombie” hordes-style game.",
    "Developed and published by Texas-based studio Undying Games, Ethereal: Clash of Souls is a MOBA that promises to “revolutionize” the genre – which has us intrigued.",
    "In Ethereal: Clash of Souls, you play as “myths” split up into eight archetypes such as Duelist or Enchanter. Play 6v6 on the main map, Elysium, and battle it out against your enemies to dominate each lane, defeat the enemy elder and win the game.",
    "Undying Games has a Kickstarter goal of $75,195 (£53,992/AU$101,505) and is almost halfway there.",
    "Developed and published by UK-based studio carrotcake games, this stunning hand-drawn, atmospheric wonder requires you to grow and tend your garden while also exploring the land and attending to visitors such as Bunk, the “tea-brewing macaque”. The Garden Path even has real-time elements, so you can leave your crops overnight and wake to them fully grown.",
    "The goal is to raise $27,854 (£20,000/AU$37,600), and so far the campaign has raised nearly $22,283 (£16,000/AU$30,080).",
    "You can also add The Garden Path to your Steam wishlist.",
    "Whichever game you do decide to back, keep your eyes peeled on Kickstarter for new games and studios that require your support. There’s always something for everyone and you get to be part of the game’s journey from start to completion – which definitely gives you bragging rights.",
    "What’s next? Why not check out our pick of 11 best open-world games on PC today: get out and explore."
  ],
  "headers": {
    "3": "Stormrite",
    "6": "2089 – Space Divided",
    "9": "Memory Lane",
    "12": "Marko: Beyond Brave",
    "15": "TheHexam!",
    "19": "Esdraz The Throne of Darkness",
    "22": "Cry Out",
    "26": "SCP: Pandemic",
    "28": "Ethereal: Clash of Souls",
    "31": "The Garden Path",
    "34": "Keep them peeled"
  },
  "links": {
    "PC games": "https://www.techradar.com/news/best-pc-games",
    "Stormrite": "https://stormrite.com/",
    "Steam": "https://store.steampowered.com/app/1428600/Stormrite/",
    "2089 – Space Divided": "https://www.kickstarter.com/projects/killsecure/2089-space-divided-scifi-rts-game?ref=discovery_ending_soon&term=Video%20games",
    "demo": "https://store.steampowered.com/app/1288390/Memory_Lane/",
    "Memory Lane": "https://www.kickstarter.com/projects/1875015578/memory-lane-2?ref=discovery_ending_soon&term=Video%20games",
    "Kickstarter": "https://www.kickstarter.com/projects/undying-games/ethereal-clash-of-souls-pre-alpha-access?ref=discovery_ending_soon&term=Video%20games",
    "complete the game": "https://www.kickstarter.com/projects/sgmonda/the-hexam-videogame-about-colors-and-perspective?ref=discovery_ending_soon&term=Video%20games",
    "Esdraz": "https://www.kickstarter.com/projects/esdraz/esdraz-the-throne-of-darkness-video-game-metroidvania?ref=discovery_ending_soon&term=Video%20games",
    "Cry Out": "https://www.youtube.com/watch?v=DPKeXfj77i4",
    "SCP Foundation’s": "https://scp-wiki.wikidot.com/scp-5000",
    "SCP-5000": "https://blog.naver.com/byungjin08/221970999602",
    "Affray LLC": "https://affray.gg/",
    "SCP: Pandemic": "https://www.kickstarter.com/projects/affray/scp-pandemic?ref=discovery_ending_soon&term=Video%20games",
    "Undying Games": "https://twitter.com/UG_Ethereal",
    "Ethereal: Clash of Souls": "https://www.youtube.com/channel/UCBuULwnagsHgSZeEKHoodNQ",
    "carrotcake games": "https://carrotcake.games/",
    "Steam wishlist": "https://store.steampowered.com/app/1638500/The_Garden_Path/",
    "our pick of 11 best open-world games on PC today: get out and explore": "https://www.techradar.com/news/gaming/10-best-open-world-games-on-pc-today-1320363"
  }
}