{
  "source": "https://www.techradar.com/news/should-you-buy-a-chromebook-on-amazon-prime-day",
  "title": "Should you buy a Chromebook on Amazon Prime Day?",
  "category": "computing",
  "updated": "2021-06-22T15:00:09Z",
  "author": "john-loeffler",
  "summary": "It really depends on your needs",
  "article": [
    "With Prime Day deals still available for one final day, many may be wondering if now is finally the time to look into the best Chromebooks on sale during the event.",
    "If you’ve never owned a Chromebook before, though, it’s understandable to feel a touch of hesitation before finally going in on one of these laptops. Chrome OS isn’t as functional – at least not directly – as the Windows or Mac laptops you might be used to, so you might be wondering what you’re in for when putting down a couple hundred dollars on one of these Amazon Prime Day Chromebook deals.",
    "While we are definitely bullish on Chromebooks overall, we definitely get that they aren’t for everyone. Despite some major strides in the past few years, there are some things that a Chromebook simply won’t be able to do – or at least not do well. So if you’re debating whether you should buy a Chromebook on Amazon Prime Day, we’re here to help you know what you’re in for and whether a Chromebook is the best device for your needs.",
    "Chromebooks don’t come loaded with a lot of heavy-duty hardware, so they generally tend to be very portable laptops that are easy to toss into a bag and take with you on the go. Some are even as thin as the best Ultrabooks on the market, though that kind of form factor tends to be a bit more premium than you’ll find with most Chromebooks, where the emphasis is really on affordability.",
    "That lack of heavy duty hardware also means that most Chromebooks will look pretty light on the specs side of things. It’s not uncommon to see Chromebooks with 4GB RAM and 64GB, or even 32GB, of eMMC flash storage. Flash storage is pretty much the same tech as you’ll get in a USB thumb drive, so it’s not going to be nearly as fast as the PCIe SSDs you find in most laptops nowadays.",
    "The displays on a lot of Chromebooks – mostly the 11.6-inch models – will be in the neighborhood of 1365 x 768p, which is HD quality, but not the full 1080p that you’ll find on pretty much any Windows laptop. Larger Chromebooks will usually sport 1080p screens, but don’t look for anything sharper than that on anything but the most premium Chromebooks. On 11.6-inch screens though, you really can’t tell the difference between a 768p and a 1080p resolution, so you shouldn’t worry too much over it.",
    "All this lower-spec hardware is still more than enough to run Chrome OS, however. Chrome OS doesn’t have anywhere near the system overhead of either Windows or macOS, so your experience will be more or less the same on a Chromebook for general computing tasks as they would be for a Windows or Mac laptop.",
    "Where this will be a problem, though, is when you start loading up on Chrome tabs. Chrome is very well optimized for Chrome OS, but that can only do so much. With only 4GB RAM, treating your Chrome browser on a Chromebook the way we typically do with a laptop with 16GB RAM is asking for trouble – keep it to a small grove of tabs, not a whole forest.",
    "Chromebooks were designed with cloud computing in mind. Google has massive data centers that do everything from run productivity apps like Google Docs and Sheets to streaming AAA video games like Cyberpunk 2077 through Google Stadia.",
    "With a fast and stable internet connection, you don’t need a high spec machine to run any of these apps locally, which means you can get by with much lower-end hardware. This, in turn, is what allows manufacturers to produce Chromebooks at such a low cost, making them very affordable devices.",
    "The problem is when you don’t have a fast and stable internet connection, which for many people outside of major metropolitan areas like New York City and London simply isn’t a given. There are still plenty of things you can do with a Chromebook without connecting to the internet, but it’s functionality is going to be severely reduced.",
    "When it comes to locally-installed apps on a Chromebook, you really do have way more options than you used to when they were first introduced. Thanks to the Google Play store, you have access to the largest app marketplace in the world, as well as the Chrome App store and even a working Linux kernel and all the software that you can get on a Linux command line.",
    "Unfortunately, when it comes to the Google Play store, these apps weren’t designed with a Chromebook in mind, but rather an Android phone or tablet. Running apps meant for a mobile phone may come across as awkward on a Chromebook, especially if the Chromebook isn’t a 2-in-1 with a touchscreen.",
    "What’s more, because mobile devices typically have less powerful hardware than even a Chromebook, these apps are designed accordingly and won’t be as feature-rich as those you’d typically find on a more conventional computer. That means locally-installed productivity apps won’t have nearly as many bells and whistles as you may be used to, and the overwhelming majority of available apps will be single-function ones, like basic to-do checklists or a PDF reader.",
    "That more focused approach isn’t a bad thing though, since sometimes you really just need a simply checklist app, and that kind of function is typically handled by Windows or macOS’s built in tools. If you don’t like these tools, or find they just aren’t quite what you need, you’re going to have a much harder time tracking down something like that on a more traditional laptop than you will on a Chromebook.",
    "Hopefully, you have a better sense of what Chromebooks are capable of and whether they will do what you need a laptop to do. If you need to run dedicated, fully-featured software like Adobe Photoshop, you certainly have options either through the cloud or on the app marketplaces a Chromebook has access to. These options may or may not be sufficient for your needs though, so you’ll need to really think about what specific software needs you expect to have and whether a Chromebook can meet them.",
    "If you are just looking for light computing work, video streaming and conferencing, productivity tasks, web browsing, and the like, most of today’s mainstream Windows and Mac laptops really are a bit of an overkill. If you’re using your laptop to check email and watch the best Netflix shows and maybe do some blogging, a Windows laptop with 16GB RAM and 512GB of super fast storage will largely be underutilized while costing a lot more than your typical Chromebook.",
    "If a Chromebook looks like it’s just what you’re looking for, then you’re in luck. Amazon Prime Day deals on Chromebooks are some of the best you’re going to find all year, so there’s really no better time to buy.",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {
    "3": "Chromebooks are very lightweight devices, in more ways than one",
    "8": "Chromebooks rely heavily on a good internet connection",
    "11": "Locally installed software will be much more focused",
    "15": "Should you buy a Chromebook on Amazon Prime Day?"
  },
  "links": {
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "Amazon Prime Day Chromebook deals": "https://www.techradar.com/deals/chromebook-deals-amazon-prime-day-has-you-covered",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}