{
  "source": "https://www.techradar.com/news/this-55-inch-4k-tv-on-sale-for-dollar248-is-black-friday-cheap-and-going-fast",
  "title": "This 55-inch 4K TV on sale for $298 is Black Friday cheap and going fast",
  "category": "televisions",
  "updated": "2021-10-21T17:31:46Z",
  "author": "mackenzie-frazier",
  "summary": "Snag this cheap early Black Friday TV deal at Walmart today",
  "article": [
    "If you're looking to score a cheap TV deal, then Walmart's early Black Friday sale has you covered. The retailer is dropping record-low prices, and we've spotted this 55-inch 4K TV from TCL on sale for just $298 (was $448). That's an incredible price for mid-size 4K TV and the best deal we've ever seen for this particular model. During last year's Black Friday deals event, cheap TVs priced this low were hot sellers and didn't stay in stock for long. We're surprised today's deal is still available, so we'd recommend snagging this early Black Friday deal now before it's too late.",
    "The TCL 4-Series TV is feature-packed and delivers a stunning picture thanks to the 4K Ultra HD resolution, which displays four times the number of pixels as a Full HD display. The 50-inch TV also has smart capabilities that allow you to stream your favorite movies and TV shows from your home screen. You're also getting the Google Assistant built-in so you can use your voice to control your TV and compatible smart home devices. If you're looking for more early bargains, you can see our roundup of the best Black Friday TV deals that are happening right now.",
    "See more of the best cheap TV deals that are happening now and the cheapest OLED TV deals and prices."
  ],
  "headers": {
    "1": "Cheap Black Friday TV deal",
    "2": "More TV deals"
  },
  "links": {
    "on sale for just $298 (was $448)": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1181622591537975600&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2Fseort%2F922824850",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals",
    "best cheap TV deals": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "cheapest OLED TV deals and prices": "https://www.techradar.com/deals/best-oled-tv-prices-deals"
  }
}