{
  "source": "https://www.techradar.com/news/huge-deal-apple-airpods-pro-drop-to-lowest-price-of-2021",
  "title": "AirPods deal alert: the AirPods Pro are on sale for $179.99 - the lowest price of 2021",
  "category": "audio-visual",
  "updated": "2021-10-15T13:46:30Z",
  "author": "mackenzie-frazier",
  "summary": "Today's best AirPods deal is a $69 discount on the AirPods Pro",
  "article": [
    "It's a fantastic time to find Apple deals (thanks to yesterday's Apple event), and we've just spotted the best-selling AirPods Pro on sale for $179.99 (was $249) in a fantastic deal at Amazon. That's the lowest price we've seen this year and only $10 more than the record-low Black Friday price.",
    "The AirPods Pro feature Apple's powerful H1 chip, which offers voice control with Siri so you can get directions, skip songs, and make calls completely hands-free. The wireless earbuds now include Active Noise Cancellation to block out unwanted noise, and the Transparency mode allows you to let outside noise in when you need it. The sweat-resistant AirPods also come with new silicon tips in three different sizes to provide a more comfortable and secure fit.",
    "You can also shop for more offers with the best AirPod deals and sales and see the best AirPods Pro deals and sales that are happening now. You can see more of the best Amazon sales that are happening right now and look forward to upcoming bargains at the 2021 Black Friday deals event."
  ],
  "headers": {
    "1": "AirPods Pro deal",
    "2": "More AirPods deals"
  },
  "links": {
    "Apple event": "https://www.techradar.com/news/when-is-the-next-apple-event",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "best AirPod deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "best AirPods Pro deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "Amazon sales": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}