{
  "source": "https://www.techradar.com/news/where-to-watch-veep",
  "title": "Where to watch Veep: Stream every season online",
  "category": "entertainment",
  "updated": "2021-04-02T10:06:05Z",
  "author": "sarah-james",
  "summary": "A darkly comedic look at American politics",
  "article": [
    "Veep is a no-holds-barred satirical look at the ugly and the hilarious power struggles of American politics. Find out where to watch Veep where you are with our guide.",
    "The comedic show follows fictional U.S. Vice President Selina Meyer and her team, including Chief of Staff Amy Brookheimer, Director of Communications Mike McLintock, and Selina’s “bag man” and personal assistant, Gary Walsh. Together, the group tries to scrape together some power and influence for their boss in the cynical world of Washington, D.C.",
    "Veep was a hit among critics and an awards darling, winning 17 Primetime Emmy awards over the course of its seven-season run on HBO. That includes an impressive six consecutive awards for Julia Louis-Dreyfus as Vice President Selina Meyer.",
    "Viewers and critics alike praised the show’s dark political satire, its talented comedic actors, and its famous one-liners. If you’re looking for creative new insults, Veep is certain to provide plenty of inspiration.",
    "In this article, we discuss how to watch Veep in the US, the UK, Australia, and Canada, and we also recommend other shows currently available for streaming on HBO Max.",
    "Unfortunately, Veep is currently not available to stream for free in the UK, so if you want to watch the show, you’ll have to purchase seasons or episodes.",
    "You can purchase all seven seasons of Veep for on-demand streaming in the UK from Amazon from £6.99 a season, iTunes, and Google Play. Veep is also available to purchase from Chili or Sky Store, either by the season or by the episode."
  ],
  "headers": {
    "5": "How to watch Veep online: stream seasons 1-7 in the UK",
    "7": "How to watch Veep: stream every season online in Australia"
  },
  "links": {
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FVeep-Season-1%2Fdp%2FB00G137ZYY%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-2576704816926576600-21",
    "Sky": "https://www.awin1.com/awclick.php?awinmid=11005&awinaffid=103504&clickref=trd-us-2471791142432973300&p=https%3A%2F%2Fwww.sky.com%2F"
  }
}