{
  "source": "https://www.techradar.com/news/sony-sold-10-million-ps5-consoles-analysis",
  "title": "PS5 console sales top 10 million, says Sony. Don't have it yet? Here's what to do",
  "category": "gaming",
  "updated": "2021-08-04T13:29:21Z",
  "author": "matt-swider",
  "summary": "10 million PS5 units have been sold, according to Sony, and we have the answers of how to get a console of your own.",
  "article": [
    "PS5 console sales have officially topped 10 million, according to Sony and its latest sales figures this week. But news of this record-breaking achievement doesn't tell the whole story nor does it answer how to buy the hard-to-find PlayStation 5 during the occasional PS5 restock dates.",
    "If you can't find PS5 in stock, our 24/7 PS5 restock tracker Matt Swider will send you an alert – if you follow his Twitter account and turn on notifications. We also have advice on what's been preventing many of his long-time followers from getting the console in the first place.",
    "Here's the expanded version of our five proven ways to overcome the \"shortage\" of PS5 consoles that are leaving you feeling shorted – even though Sony called the PlayStation 5 its \"fastest-selling console to date.\"",
    "This is an easy one. Matt sends out these console restock alerts every time the PS5 is in stock in the US. His exclusive reporting on the GameStop PS5 restock last week led to around 800 people finally getting the Sony console through his alerts.",
    "Directions: Click on this image of an example of this Best Buy PS5 restock alert from Matt Swider and turn on notifications (that little bell icon) for instant alerts.",
    "Our PS5 restock live streams on YouTube have helped thousands of people check out at various US retailers with real-time PS5 stock updates and exert advice – like we're live coaching you through the process.",
    "And really, that's needed because the checkout process is different at each retailer in the US, especially Best Buy and GameStop. Walmart, meanwhile, is straightforward, but a straight-up mess, so having someone walk you through the purchase is helpful.",
    "Click on the image to subscribe to our YouTube PS5 restock tips and tricks.",
    "With 10 million PS5 consoles sold in the last nearly nine months of availability, this is one lever to pull to help you become part of that 10 million club that Sony is touting.",
    "PS5 Digital Edition is tempting, and we get it. It costs $100 less upfront than PS5 Disc and \"who needs a disc drive in 2021?\", many people will ask. It's a good question.",
    "What Sony hasn't disclosed is how many of the 10 million PS5 consoles were PS5 Digital. Our expert analysis? Not even close to half. Probably a lot less than PS5 Disc. That's a meanginful statistic.",
    "Here's why: when American retail stores like Best Buy, Target and Walmart stock both versions of the PS5 console, they always have more PS5 Disc inventory than Digital; the latter runs out almost instantly.",
    "We've also seen real inventory numbers showing this extreme. Target, right before one recent PS5 restock, had 40 PS5 Disc consoles on hand at several locations in the United States, and one single PS5 Digital. Sure enough, PS5 Digital was a flash of a restock the next day, while many people got PS5 Disc.",
    "It's more than the 40:1 lopsidedness of PS5 Disc vs PS5 Digital. We also offer advice showing that the $499 PS5 Disc will save you more money in the long run than the $399 PS4 Digital. Disc games get far cheaper faster than their digital counterparts where Sony is the gatekeeper of the online PlayStation Store.",
    "Competition and used games are what make PS5 Disc a far better – and cheaper – option in the long run in addition to increased availability.",
    "\"But I don't want those games,\" said a Matt Swider follower when he complained how impossible it was to buy a PS5, noting he's \"been trying for months\". After a five--minute conversation, Matt shot back, \"Well, the PS5 GameStop restocks are bundles and they're easier to get... if you really want it.\"",
    "The follower was aghast, \"Did you just say if I really want it?!\" (Note: the games in the latest GameStop PS5 bundle were Ratchet & Clank: A Rift Apart, Spider-Man: Miles Morales, and Sackboy – not a bad lineup and some employees will let you exchange a bundled game for another game GameStop in stores).",
    "It's true though – and people still don't listen. PS5 bundles are easier to buy than standalone consoles simply because resellers and bots scoop up the inventory before real customers are able to check out. GameStop and Antonline sell bundles, and they sell out in about three minutes (when the retailers don't play funny business with the sometimes working add-to-cart button).",
    "We've seen these resellers in the flesh: in line at Best Buy buying RTX graphics cards, including the coveted RTX 3080, asking us \"Is this the good one?\" No one in that line got the RTX 3080 for gaming. Everyone who did buy it was trying to (and did) turn a sizable profit. That's exactly what's happening online – at Best Buy and Walmart especially – when there are no PS5 bundles.",
    "GameStop has even limited \"early access\" to restocks to its paid PowerUp members in the second half of 2021, and in a way, that's a good thing for gamers who want to actually play the PS5 console for its games.",
    "PlayStation 5 scams are everywhere and it's preventing people from buying a PS5 due to the fact that the victims just sent all of their money to an overseas scammer.",
    "These PS5 scammers are ruthless, too: they'll change their name and profile picture to match the official PlayStation brand and logo, they eagerly reach out to victims only charging $550 for the \"one extra\" that they happen to have, and they'll even go as far as sending the victim a photo or video of \"their console\" right before the purchase – even writing the victim's name on a piece of paper to prove it's not a stock photo.",
    "And people fall for it – daily. Today, August 1, Matt gets 100 messages asking if these accounts, some of which are verified hacked accounts – are legit. About 10 to 15 people message him too late and have already fallen for it. Twitter has done little to stop it. Instagram, Facebook and even YouTube have the same problems.",
    "In all cases, the answer is \"no, it's not legitimate.\" If major stores in the US like Best Buy don't have PS5 stock for more than a few minutes, no one is going to sell you a console through CashApp for just $550. Think about it.",
    "The bottom line on PS5 sales: With 10 million PS5 consoles sold by Sony and more people desperate to make the purchase, people are going to take advantage of that dilemna. Our best advice is to stick with retailers we point you to and not try to get a PlayStation 5 for $50 over MSRP by sending money to someone you don't know."
  ],
  "headers": {
    "2": "Not part of the PS5 10 million sold club? Here's advice",
    "3": "1. Follow PS5 restock Twitter tracker Matt Swider",
    "5": "2. Get our PS5 stock live stream coaching on YouTube",
    "9": "3. Stop trying to buy PS5 Digital – stick with Disc",
    "15": "4. Give in and get a PS5 bundle",
    "20": "5. Don't fall for PS5 scams"
  },
  "links": {
    "sales figures": "https://www.techradar.com/news/what-stock-shortage-ps5-has-sold-10-million-consoles-faster-than-the-ps4",
    "PS5 restock": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock tracker Matt Swider": "https://twitter.com/mattswider",
    "GameStop PS5 restock": "https://www.techradar.com/news/exclusive-gamestop-ps5-restock-july-27",
    "PS5 restock live streams": "https://www.youtube.com/mattswider"
  }
}