{
  "source": "https://www.techradar.com/news/this-android-phone-maker-just-patented-perhaps-the-weirdest-foldable-phone-yet",
  "title": "This Android phone maker just patented perhaps the weirdest foldable phone yet",
  "category": "phones",
  "updated": "2021-04-13T15:13:14Z",
  "author": "tom-bedford",
  "summary": "This phone is long and thin",
  "article": [
    "We've seen plenty of concept foldable phones that bend, flex and roll in different ways, and it looks like Android phone maker Vivo might soon have a new smartphone ready to join that list, at least according to a new patent from the brand.",
    "This patent was spotted by LetsGoDigital, and it shows something that looks like a normal smartphone - that is, until you realize there's extra screen space that wraps around the bottom of the phone onto the other side, and if you want, you can straighten this all out, to make one super-long phone.",
    "While most foldable phones were designed to solve common issues with smartphones - the clamshell form factor makes handsets more compact, and the book-style design lets you get loads of screen space - it's not too clear what the point of this super-long display is. It seems to be far thinner than the 21:9 aspect ratio the most angular smartphones use.",
    "This is just a patent though, not confirmation of an upcoming device, so it's likely Vivo is just testing out how such a flip-screen would work on a phone. Don't hold your breath on seeing such a handset any time soon, though there are hints that this isn't just some pie-in-the-sky type ideal.",
    "Most design patents like this just show the way a foldable phone would work, but the Vivo patent has loads more details than we normally see on such a patent.",
    "Studying the documents, we can see the phone is set to have five rear cameras in a diamond design, and one of them looks set to be a periscope lens due to its shape. There don't seem to be any cameras on the front though.",
    "The images also show a USB-C port for charging, but no 3.5mm headphone jack.",
    "Still, while this patent has a strangely-specific camera array, it would still be a stretch to suggest the phone is definitely coming. We are expecting Vivo to have a foldable phone at some point in the near future though, so when that comes along, we can see if it shares any DNA with this patent."
  ],
  "headers": {
    "4": "So why are there so many details?"
  },
  "links": {
    "concept foldable phones": "https://www.techradar.com/news/concept-foldable-phones-check-out-these-folding-and-rolling-smartphones",
    "LetsGoDigital": "https://nl.letsgodigital.org/opvouwbare-telefoons/vivo-smartphone-zoomcamera/",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones"
  }
}