{
  "source": "https://www.techradar.com/news/ios-14-problems",
  "title": "iOS 14 problems: here's how to fix the most common iPhone glitches in iOS 14.5",
  "category": "phones",
  "updated": "2021-04-26T21:18:16Z",
  "author": "david-lumb",
  "summary": "Updated with new iOS 14.5 fixes for various iPhone problems",
  "article": [
    "iOS 14 problems can spoil Apple's otherwise beautiful iPhone software upgrade, so we're here to help you fix the iOS 14 bugs and glitches that you may run into.",
    "Broken Wi-Fi, poor battery life and spontaneously reset settings are the most talked about iOS 14 problems, according to iPhone users. Luckily, Apple's iOS 14.0.1 update fixed many of these early issues, as we've noted below, and subsequent updates have also addressed problems.",
    "As of today's iOS 14.5 launch, many of the most notorious iOS 14 bugs have been patched. Despite that, some nasty issues have persisted, including iOS 14.2 battery issues for some users that Apple has yet to solve.",
    "Most issues are more annoying than severe, but even then, they can ruin the experience of using an expensive phone. Below you'll find the most widely reported issues along with any fixes for them – which in many cases just means updating your software.",
    "Don't see your iOS 14 problem listed? We're happy to troubleshoot it with you. Please follow us and share your problem, and we'll either reply or direct message you (if it's a long one) with a solution if we find one.",
    "Since the launch of iOS 14.5, we haven't seen any major bugs or issues emerge. We're hopeful that none will, but will happily broadcast any iOS 14.5 problems you encounter in the hopes that Apple or someone else finds a fix.",
    "Below, we’ll explain the top iOS 14 problems along with any fixes that have been figured out so far. Some of the issues are solved by simply updating to the latest version of iOS; when we note that an update addressed the issue, consider it fixed for every later version of iOS unless we say otherwise.",
    "To update to the latest version, head to Settings > General > Software Update > Download and Install, and click Install Now when the option becomes available.",
    "At this point, most iPhone owners have updated to iOS 14. If you haven't, updating to the new OS could provide an easy fix for most of the issues below. The same applies to anyone who has iOS 14 but not the latest version or patch.",
    "To download iOS 14, your iPhone needs to be the iPhone 6S series or newer. You'll also need enough space on your device to download iOS 14 and the battery needs to be charged. It's also preferable to install iOS 14 when your iPhone is plugged in.",
    "If you see a message like 'Unable to check for update' or 'Unable to install update,' it's very likely because you don't have a solid network connection. Make sure you're connected to Wi-Fi, then check your network speeds to make sure there isn't an issue with the provider.",
    "If you find yourself unable to download iOS 14.5 (or the latest version available), it may be because you previously downloaded the beta. Delete that version of the software in Settings > General > Profiles, and that should clear the way. If you haven't downloaded the beta, clearing out storage space and plugging in your phone should solve any other issues.",
    "Still having issues downloading it? Apple Support recommends going to Settings > General > Storage and finding the update in your list of apps. You can delete that update, then return to the Software Update menu and reinstall it. If that fails too, try plugging your iPhone into your computer and connecting it to iTunes, where you'll ideally see an option to update the connected device.",
    "Over ten thousand Apple users hit 'I have this question too' on this iOS 14 user's post complaining about keyboard lag after downloading the new update. When you type, the text and key pop-ups don't appear for several seconds, then all appear at once, fast-forwarded.",
    "iOS 14 problem solved: According to the iOS 14.4 update log, that patch fixed the issue 'Typing may be delayed and word suggestions may not appear in the keyboard.' It took over four months for Apple to fix it, but better late than never!",
    "If you're on an older OS, some users temporarily solved the issue by navigating to Settings > General > Reset > Reset Keyboard Dictionary. But updating to the latest version is the easiest solution.",
    "More and more users are lamenting that text message notifications aren't working properly - specifically, texts are going through, but notification bubbles aren't always popping up. There are reports that even the red bubble may not appear either, even if you have unread texts.",
    "It's annoying, irregular, and means you have to fully open your Messages app to manually check if you have new texts or iMessages.",
    "iOS 14 problem solved: As part of iOS 14.3, Apple fixed a bug causing message notifications not to be received, so updating to iOS 14.3 or later should solve the problem.",
    "Some users are reporting that, after installing iOS 14, their batteries have drained at an alarming rate, like this iPhone owner in Apple's official forums. Apple provided a drastic battery drain fix guide that required you to fully factory reset your iPhone in order to purge the problem.",
    "That issue has seemingly been resolved, but then the update to iOS 14.2 caused similar battery issues, particularly on older phones. The subsequent 14.3 and 14.4 releases apparently fixed the issue for some users but not for others. And 14.5 only fixed faulty battery estimates, not battery drain.",
    "After months of waiting, we've heard nothing definitive from Apple about potential fixes to this problem. But there are some actions you can take to hopefully mitigate the issue.",
    "For starters, this issue regularly happens to some users when they install a new version of iOS. When upgrading to a new version of the operating system, users' iPhones are re-indexing their files and apps so they can find them faster and more efficiently – in other words, this battery drain may just be temporary until your iPhone gets used to the new update.",
    "Another simple trick to try is to reset your iPhone. Start by simply turning your phone fully off and see if that helps at all. Or if you're really desperate, you can back up your iPhone, factory reset it, then restore your iPhone and see if that clears out the problem, as it has for iOS 14 users in the past.",
    "There are other things to look out for if battery loss continues – namely checking if it's lost capacity over time. Head to Settings > Battery > Battery Health to check whether your battery has deteriorated.",
    "If so, or if you want to extend battery life generally, there are plenty of Apple-recommended ways to do so, like turning off auto-brightness on your screen (Settings > General > Accessibility > Display Accommodations) and manually keeping it at a low setting.",
    "You can also turn off apps refreshing in the background (Settings > General > Background App Refresh) and switch off location services within apps (Settings > Privacy > Location Services). Lastly, you can easily toggle off several of the above features just by switching to Low Power Mode (Settings > Battery).",
    "iOS 14 widgets are the star of this iPhone update, yet you may find it difficult to add or edit widgets. That's certainly an iOS 14 problem, if you ask us.",
    "New apps you download may not allow you to add widgets when tapping the + icon in the top right corner (while in jiggle mode).",
    "iOS 14 problem solved: While we're not going to consider this fully solved until Apple issues an update to fix the known widgets glitch, here's a quick fix we've found: if you open up the app and play around with it first, then close it, you may find that it appears within the widget list after hitting the + icon.",
    "One of the big perks to the iOS 14 update is that you can now play videos in a small rectangular corner window even when you exit a video app. It's called picture-in-picture, and apps including FaceTime use it so you can video chat and browse another app, like your email or Safari, without the video pausing.",
    "iOS 14 problem solved: Picture-and-picture does work with YouTube, but the iOS 14 problem arises if you aren't logged into your YouTube Premium account (or don't subscribe to Google's paid ad-free service). The same applies for 4K videos on your iPhone – the iOS 14 feature won't work on this specific app unless you're a paid subscriber.",
    "Plenty of users have complained on social media and forums about losing Wi-Fi after upgrading to iOS 14, as noticed by MacWorld. Some have pointed out that their connection drops when they lock their screen and put their iPhone into sleep mode, like this user on Apple forums, who claimed to need to manually reconnect to Wi-Fi.",
    "iOS 14 problem solved: Apple rushed out an operating system update, iOS 14.0.1, that aims to fix issues preventing iPhones from connecting to Wi-Fi networks. Hopefully this particular problem is included in the fix.",
    "One of the most exciting new features in iOS 14 is the ability to set third-party apps as default mail and internet browsers for your iPhone. But in the initial release, some users found that after resetting their phones, their mail and browser apps defaulted to their factory settings – Mail and Safari, respectively.",
    "iOS 14 problem solved: The first iOS 14 operating system update, iOS 14.0.1, included a fix explicitly for this issue, so hopefully it is resolved for users who have experienced it.",
    "Some users, like this one on the official Apple forums, have set up widgets for Apple News have seen its ‘Top Stories’ section appear blank, while other sections are populated with content. This issue was seen in other widgets, including Weather and Music.",
    "iOS 14 problem solved: Apple expressly added a specific fix to this issue in iOS 14.0.1, which was rushed out a week after iOS 14 was released. It’s unclear if this also fixes issues in other widgets.",
    "iPhone 7 owners like this official Apple forum poster are running into an issue with the camera app viewfinder turning completely dark. The user above reported that opening the viewfinder in Snapchat or Instagram resulted in a similar black screen. It’s unclear if it was only affecting iPhone 7 owners or if other iPhones have been affected.",
    "iOS 14 problem solved: This issue was supposedly fixed in the rushed-out iOS 14.0.1 update, which specifically addressed the problem.",
    "When iOS 14 initially launched, some apps sent a message with an inaccurate warning that your iPhone was jailbroken, because the apps themselves hadn't been updated to recognize the new OS as legitimate.",
    "Once these apps were updated, those messages disappeared. Any app that gives you that message now likely hasn't been updated in half a year and probably shouldn't be used anyway. Now you're likely not to see this issue pop up again until iOS 15 launches."
  ],
  "headers": {
    "8": "iOS 14.5 won't download on your iPhone",
    "13": "iOS 14 typing lag - Solved",
    "16": "iOS 14 text notifications not appearing - Solved",
    "19": "Battery drains faster",
    "27": "Can't add or edit iOS 14 widgets",
    "30": "iOS 14 won't play YouTube in 4K or picture-in-picture - Solved",
    "32": "Disconnecting from Wi-Fi – Solved",
    "34": "Switched mail and browser default apps reverting upon reset – Solved",
    "36": "Apple News widget ‘Top Stories’ appears blank – Solved",
    "38": "iPhone 7 camera viewfinder shows black screen – Solved",
    "40": "'Jailbroken' warning – Solved"
  },
  "links": {
    "iOS 14": "https://www.techradar.com/news/ios-145-full-news",
    "iOS 14.5": "https://www.techradar.com/news/ios-145-full-news",
    "battery issues": "https://www.techradar.com/news/users-are-reporting-severe-battery-drain-while-running-ios-142",
    "follow us and share your problem": "https://twitter.com/mattswider",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "recommends": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3932608958219918000&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT201435",
    "user": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1410139707480830000&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F251822892",
    "update log": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4431750344285865500&sharedId=trd-us&u=https%3A%2F%2Fsupport.apple.com%2Fen-us%2FHT211808%23144",
    "owner": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6972440712779692000&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F251802401",
    "battery drain fix": "https://www.techradar.com/news/ios-14-battery-drain-fix",
    "caused similar battery issues": "https://www.techradar.com/news/users-are-reporting-severe-battery-drain-while-running-ios-142",
    "fixed faulty battery estimates": "https://www.techradar.com/news/ios-145-will-fix-your-iphone-11s-faulty-battery-estimates",
    "reset your iPhone": "https://www.techradar.com/how-to/how-to-factory-reset-an-iphone",
    "back up your iPhone": "https://www.techradar.com/how-to/how-to-back-up-an-iphone",
    "restore your iPhone": "https://www.techradar.com/how-to/how-to-restore-an-iphone",
    "Apple-recommended": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6872221790725438000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fbatteries%2Fmaximizing-performance%2F",
    "MacWorld": "https://www.macworld.co.uk/news/iosapps/ios-14-causes-wi-fi-problems-3795602/",
    "forums": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1389010020009530600&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F251826177",
    "this one": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5721381660521968000&sharedId=trd-us&u=https%3A%2F%2Fdiscussions.apple.com%2Fthread%2F251812936",
    "poster": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-4016271927134531000&sharedId=trd-us&u=https%3A%2F%2Fdeveloper.apple.com%2Fforums%2Fthread%2F660450",
    "iOS 15": "https://www.techradar.com/news/ios-15-update"
  }
}