{
  "source": "https://www.techradar.com/news/this-popular-whatsapp-mod-riddled-with-malicious-code",
  "title": "This popular WhatsApp mod riddled with malicious code",
  "category": "computing",
  "updated": "2021-08-24T20:01:05Z",
  "author": "mayank-sharma",
  "summary": "It’s a growing trend, researchers warn",
  "article": [
    "A malicious version of a popular WhatsApp mod has been detected spreading the Triada mobile Trojan, cybersecurity researchers have found.",
    "The FMWhatsapp mod adds several useful features to the stock messenger app for things like customization, privacy, and security.",
    "Flagged by Kaspersky, the infected malicious mod downloads other Trojans and can launch ads, issue subscriptions, and intercept a user’s SMSs.",
    "“With this app, it is hard for users to recognize the potential threat because the mod application actually does what is proposed – it adds additional features. However, we have observed how cybercriminals have started to spread malicious files through the ad blocks in such apps,” comments Igor Golovin, security expert at Kaspersky.",
    "According to Kaspersky, the threat actors have tainted the FMWhatapp line of mods by stuffing the trojan-laced version (v16.90.0 to be exact) in between official releases.",
    "The researchers note that the trojan-infused version first collates details about the device it’s on, and then pulls in other trojans, which exhibit further malicious behavior.",
    "To avoid falling victim to such tainted apps, Golovin suggests that users only download software from the official app stores, while carefully checking the permissions sought by the apps.",
    "“They may lack some additional functions, but they will not install a bunch of malware on your smartphone,” concludes Golovin."
  ],
  "headers": {
    "4": "Stick to official apps"
  },
  "links": {
    "WhatsApp": "https://www.techradar.com/reviews/whatsapp-encrypted-messaging",
    "Triada": "https://www.techradar.com/news/chinese-smartphone-maker-selling-devices-with-malware-pre-installed",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "Kaspersky": "https://www.techradar.com/reviews/kaspersky-2020-antivirus-solutions",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "smartphone": "https://www.techradar.com/best/best-android-phones"
  }
}