{
  "source": "https://www.techradar.com/news/as-the-gamecube-turns-20-we-look-back-on-nintendos-beloved-maligned-one-of-a-kind-console",
  "title": "Our best GameCube memories, as the beloved games console turns 20",
  "category": "gaming",
  "updated": "2021-10-12T13:33:46Z",
  "author": "techradar-staff",
  "summary": "Cube as a button",
  "article": [
    "Another year, another anniversary for the Nintendo GameCube – but as it reaches it’s 20th year, it’s hard not to look back wistfully on the console that formed so many memories for TechRadar’s staffers, despite its well-known sales woes.",
    "One of the best anecdotes circling on Twitter is of a Nintendo sales meeting attended by its former head of communications, Robert Saunders, who recalls someone’s brief excitement over sales figures of 39,000 consoles in a single week – which turned out to be 39 units instead.",
    "But despite heavy competition from the PS2 and original Xbox consoles around the GameCube’s launch, those of us who were lucky enough to own a purple cube and its tiny, spinning game discs formed some wonderful memories along the way.",
    "It was the console that spawned some of the best games of the era, from Wind Waker and Twilight Princess to Super Mario Sunshine, and it’s only a matter of time before some of the best GameCube games eventually make their way to Nintendo Switch Online (even if the GameBoy gets there first).",
    "With that in mind, we’ve brought together the highlights of TechRadar’s nostalgia for the long-discontinued GameCube – the good, the bad, and the somewhat drunk.",
    "I was one of those people who genuinely did walk around the house with my GameCube like it was a little handbag, but given I was only seven years old when it came out I was likely emulating my childhood hero – Tinky Winky from the Teletubbies. I even had the snazzy Indigo version.",
    "I have my fond memories of playing Mario Kart: Double Dash and Sonic Heroes, but one that really stands out came many years later when an attractive older boy lent me his copy of Resident Evil (2002 remake). I’m a huge coward but desperately wanted him to think I was cool so I forced myself to play through it and gave myself a life-long fear of zombies in the process. Turns out he was gay and I still can’t play horror games so I scared myself for nothing.",
    "It’s no exaggeration to say that the GameCube kick started my love for gaming. I’d toyed with a couple of older consoles – a second-hand N64 from a car boot sale, for one – but it’s the GameCube that pulled me in and started the day-long sessions that marred so much of my teenage years. Not to mention the times I’d buy multiple controllers and invite my friends around to play, before returning within a week to get my pocket money refunded.",
    "The problem was so bad that I packaged up the little purple box in wrapping paper, so I could sneak it into the car ahead of a family holiday to the South-West coast of England. While the rest of the family were celebrating Christmas in a seaside cottage and spending some quality time together – even going for walks and enjoying the countryside, apparently – I brought out my own gift to myself and spent the hours replaying Super Mario Sunshine for the eighth time instead. It did not go down well.",
    "My first experience with a Nintendo Gamecube was also my first experience with excessive amounts of alcohol. My pal’s (very liberal, very understanding) parents had gone out for the day, leaving us with his newly-opened Gamecube and a freshly stocked globe bar. If you want a recipe for disaster, it’s four teenage boys, a seemingly limitless supply of cans of Fosters beer and Malibu rum liqueur, and the idea that every failed Super Monkey Ball run must be followed by a double shot.",
    "We were 13 or 14 years old. The short term memory was lost, but I remember a pal drinking from a dog bowl alongside said pooch, and another falling down the stairs and bashing a radiator off a wall. I think with his head, but more likely his arse.",
    "Take THAT, Nintendo's family-friendly public image!",
    "The GameCube almost made me fail university. In my final year, when I should have been studying and writing essays, instead I was repeatedly playing Resident Evil 4 over and over again with my housemate. We couldn’t stop. As soon as we finished a play through, we’d load the game back up. It actually got quite worrying, but the game was just so good – I still think it’s one of the best games ever made.",
    "Genuinely creepy and camp and schlocky, it’s an absolute hoot to play, and the New Game+ implementation, which allows you to start with guns and in-game currency you’ve acquired from previous playthroughs, keeps on giving you reasons to play. Throw in Mario Kart Double Dash and WarioWare, Inc.: Mega Party Games!, and that cute looking little purple cube actually was a devious time sink that almost cost me my degree. Thankfully though, I am a genius (as well as being incredibly strong) so I managed to pass. But it was close.",
    "I never had a GameCube. In fact, I only ever encountered one in the wild once, when I was about 14 and was invited to my then boyfriend’s friend’s house for what I thought would be an evening of teenage shenanigans. Instead, I watched as my pubescent beau and his menfolk played Smash Bros. Melee all night – not considering I too may want to play – and ignored my very existence.",
    "When I think of GameCube, or Smash, I think of the deep-seated resentment I had that night – and that Pokémon Colosseum commercial that was never off the bloody TV. Thanks Robert.",
    "Despite adoring my GameCube as a kid, I think I only had about three games for it - but that didn’t stop me from burning hundreds of hours into the console as I replayed those discs over and over.",
    "My favorite of them had to be Luigi’s Mansion, the game where he finally stole the spotlight from his famous brother Mario. In Luigi’s first solo outing he traded traditional platforming for hunting ghosts in a spooky mansion using a souped-up vacuum cleaner to suck them away. I must’ve played it hundreds of times, and to this day if I’m ever feeling a little frightened I can’t help but reach for the Dyson while humming the Luigi’s Mansion theme.",
    "There’s one franchise that’s synonymous with the GameCube for me: Mario Party. My university pals and I would spend countless hours battling it out to win stars (and steal them) to be crowned champion.",
    "Our GameCube, controllers and games were pretty much all bought off eBay, as our obsession didn’t start until a good five years into the console’s life – but picking up my purple box for a steal as the auction closed at 2am on an idle Tuesday morning filled me with joy.",
    "And as for Mario Party – we became experts of the mini games in 4, 5, 6 and 7. Sure some of those instalments are better than others, but surrounded by junk food and alcohol in our poorly lit student flat, huddled around a CRT TV as we witnessed Jas steal yet another star he didn’t deserve off one of the rest of us (the least sportsmanlike move in gaming) – it was nothing but good times.",
    "The Nintendo GameCube taught me an important life lesson during my early teenage years: never forget your house keys, especially if you’re rushing out to pick up a new console.",
    "A few days after the GameCube launched, my brother and I dashed off to the nearest bus stop as we went in search of our very own purple little cube. Picking up the console was a no-brainer for us; launch titles such as Luigi’s Mansion and Super Smash Bros. Melee (which is still my favorite in the series to date) meant we were on board from day one, no questions asked.",
    "However, upon returning home on that fateful day – giddy with excitement at what was to come – an unspeakable pain coursed through our bodies. We quickly realized we were locked out of the house, and to make matters worse, it would be hours before our parents returned.",
    "The wait felt like days. We took turns reading and ogling at the GameCube’s box art to pass the time, chatting about who we were going to main in Smash Bros, and fruitlessly tried to jimmy a few windows open in the hope we’d somehow break in. Thankfully, the agonizing wait was all worth it in the end, as the GameCube went on to become one of my favorite consoles of all time.",
    "After many early mornings and weekends saving up the money for a Gamecube through a paper round, the console was finally mine. I remember buying the GameCube for one reason only – to play Super Smash Bros. Melee, the Avengers: Endgame of my childhood, where almost every character I played as in the past would meet up and fight.",
    "It was also the first console that made me realise just how good four-player multiplayer could be, thanks to the four ports included on the console, and the best controller that Nintendo has yet to beat. While three friends and I would huddle together in a bedroom to play Smash Bros. Melee or Mario Kart: Double Dash, it showed just how good Nintendo could be after struggling with the move to 3D with the Nintendo 64."
  ],
  "headers": {
    "5": "Jess Weatherbed, Computing Writer",
    "7": "Henry St Leger, News & Features Editor",
    "9": "Gerald Lynch, Executive Editor",
    "12": "Matt Hanson, Senior Computing Editor",
    "14": "Vic Hood, Gaming Editor",
    "16": "Hamish Hector, Staff Writer",
    "18": "John McCann, Global Managing Editor",
    "21": "Adam Vjestica, Senior Gaming Writer",
    "25": "Daryl Baxter, Software & Downloads Writer"
  },
  "links": {
    "which turned out to be 39 units instead": "https://twitter.com/robsaunders1/status/1438057227915612161",
    "vacuum cleaner": "https://www.techradar.com/news/best-vacuum-cleaners"
  }
}