{
  "source": "https://www.techradar.com/news/the-first-google-pixel-6a-leaks-are-these-unofficial-renders-and-specs",
  "title": "The first Google Pixel 6a leaks are these unofficial renders and specs",
  "category": "phones",
  "updated": "2021-11-21T10:30:43Z",
  "author": "david-nield",
  "summary": "Looks familiar",
  "article": [
    "The noise around the launch of the Google Pixel 6 and the Google Pixel 6 Pro in October may have died down a little, but news of a potential Pixel 6a has been thin on the ground – or at least that was the case until today, when we got some unofficial renders.",
    "These are courtesy of the well-known tipsters @OnLeaks and 91mobiles: we've seen many other leaks from the same sources in recent years, so we're fairly confident that what you're seeing in these renders will bear some passing resemblance to the Google Pixel 6a when it finally sees the light of day.",
    "The renders are based on inside information leaking out from Google and its supply chain partners, so there might be some discrepancies between these pictures and the final product – these aren't promotional renderings that Google itself has put together.",
    "If these particular leaks are correct, the Pixel 6a is going to come rocking a flat 6.2-inch OLED display, so it's going to be smaller than both the Pixel 6 and the Pixel 6 Pro. There's a punch hole selfie camera and an in-screen fingerprint sensor apparently, though it doesn't look as though a headphone jack will be included.",
    "A dual-lens rear camera is said to be on the way with the Pixel 6a, but there doesn't seem to be quite as much confidence around other potential specs: a custom Tensor sensor will of course be a possibility, and 6GB-8GB of RAM and 128GB of storage would sound about right for a mid-range phone like this.",
    "Considering the Google Pixel 4a launched in August 2020 and the Pixel 5a made its debut in August 2021, we would expect the Pixel 6a to show up in August 2022. Expect plenty more in the way of leaks and rumors between now and then.",
    "They haven't been out for very long, but the Pixel 6 and the Pixel 6 Pro phones feel like something of a return to form for Google after the rather lackluster Pixel 5. In retrospect that handset feels like a bit of a placeholder while Google waited for its custom-made Tensor chipset to be ready for production.",
    "The Pixel 5a, like the Pixel 5, didn't really get pulses racing when it launched – it is, after all, only available in the US and Japan – and so Google will be hoping that the Pixel 6a can carry on the good vibes of the Pixel 6 phones, and put it back on top in the mid-range smartphone category.",
    "Remember the Pixel 3a, the Pixel 3a XL, the Pixel 4a, and the Pixel 4a with 5G? It felt like Google cut exactly the right corners to get those devices down to their appealing price points – for a while, they were some of the best mid-range Android phones you could get, especially considering the quality of their cameras.",
    "Now the scene is set for the Pixel 6a to offer something similar: an affordable, versatile Android device with camera capabilities that go way beyond what you would expect for the price. That final retail price will be crucial to the success or failure of the Pixel 6a, so we'll be paying close attention to any potential leaks in this area."
  ],
  "headers": {
    "3": "Display size and more",
    "6": "Analysis: the Pixel 6a could be a return to form for Google's mid-rangers"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "@OnLeaks": "https://twitter.com/OnLeaks/status/1462081715866898437",
    "91mobiles": "https://www.91mobiles.com/hub/google-pixel-6a-renders-exclusive/",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 3a": "https://www.techradar.com/reviews/google-pixel-3a-review",
    "Pixel 3a XL": "https://www.techradar.com/reviews/google-pixel-3a-xl-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Pixel 4a with 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review"
  }
}