{
  "source": "https://www.techradar.com/news/dolby-atmos-is-bringing-the-sound-of-the-cinema-to-your-car",
  "title": "Dolby Atmos is bringing the sound of the cinema to your car",
  "category": "audio-visual",
  "updated": "2021-09-08T14:25:01Z",
  "author": "rhys-wood",
  "summary": "Dolby prepares its sound tech for automobiles",
  "article": [
    "Dolby has partnered with automotive infotainment company Cinemo to bring Dolby Atmos immersive audio to cars. The partnership was announced during Dolby’s panel at the IAA Mobility conference and, according to a Dolby press release, is \"set to drive a revolution for in-car entertainment.\"",
    "Dolby claims that by working with Cinemo, car makers will be able to seamlessly integrate Dolby Atmos immersive audio into their future vehicles, which presumably could act as a selling point for manufacturers going forward.",
    "There’s currently no word on when we can expect the Dolby Atmos experience to be made available to a wider range of vehicles, but we expect we'll start seeing the first integrations of it towards the end of the year and into the next.",
    "It sounds like Dolby Atmos will be coming to more cars down the road, though. Cinemo co-founder Ivan Dimkovic says that the collaboration between the company and Dolby will make it easier for car manufacturers to offer immersive audio experience \"within a short time frame\".",
    "But what is Cinemo exactly? The company has been around since 2008, and primarily provides infotainment solutions for vehicles, including seat and dashboard displays and apps. The company has provided software for car makers including Honda, Chrysler, Bugatti and many more.",
    "Cars aren’t the first place we’d usually think of when it comes to Dolby Atmos integration, but the more we think about it, the more sense it makes. Dolby Atmos and other immersive audio experiences like DTS:X are commonplace in the home now, and we’re sure many of you couldn’t do without them when listening to your favorite tunes or streaming movies and shows.",
    "Cars, due to their build, naturally provide a more closed-off, often intimate listening experience that’s actually perfect for something like Dolby Atmos. The enhanced audio provided by the format should suit the enclosed space of a vehicle, just as it does in our headphones and home theater systems.",
    "Of course, we hope Dolby and Cinemo opt to integrate Dolby Atmos into more than just luxury vehicles. Not everyone can afford a higher-end roadster, but given that Cinemo has worked with manufacturers like Honda in the past, we hope that the tech will be added to more readily available road vehicles.",
    "We can imagine Dolby Atmos making longer car journeys or dreary morning commutes that much more bearable, and could hopefully create a similar feeling of zoning out with a pair of earbuds on public transport."
  ],
  "headers": {
    "5": "Analysis: will Dolby Atmos have a positive impact on car journeys?"
  },
  "links": {
    "Dolby Atmos": "https://www.techradar.com/news/audio/dolby-atmos-a-step-by-step-guide-to-the-premature-speaker-tech-1305066",
    "DTS:X": "https://www.techradar.com/news/dtsx-vs-dolby-atmos-vs-dts-play-fi",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "home theater systems": "https://www.techradar.com/best/best-home-theater-system-the-kit-you-need-for-that-perfect-home-cinema",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925"
  }
}