{
  "source": "https://www.techradar.com/news/apples-black-friday-deals-revealed-with-shopping-event-that-gets-you-a-free-gift-card",
  "title": "Apple's giving away free gift cards in its Black Friday deals, but no actual price cuts",
  "category": "computing",
  "updated": "2021-11-26T06:29:18Z",
  "author": "john-mccann",
  "summary": "No discounts, just gift cards",
  "article": [
    "Apple is taking part in the Black Friday and Cyber Monday sales event... kind of. For four days, the firm will be offering a free gift card when you purchase an eligible item from its website, app or when you visit a physical Apple Store.",
    "While we're seeing other retailers and brands drop prices across a huge range of Black Friday deals, if you're looking for actual product price cuts from Apple, you're going to be disappointed if you go to the brand direct.",
    "Instead it's offering a free gift card against purchases of a selection of its products, but a number of big name items aren't included in this Black Friday offer - including the iPhone 13, Watch 7 and new iMac series.",
    "If you're looking for discounts off the list price of Apple products, we're rounding up all the best sales at other retailers on our Black Friday Apple deals page throughout the week.",
    "The value of your gift card is determined by how much you spend on an eligible product (more on this below). The more cash you part with, the higher the value of the gift card you get bundled with your new tech.",
    "This isn't a Black Friday deal that's necessarily enticing for those who are in the market for a single Apple device, but if you're planning on buying multiple devices you can save yourself money by staggering your purchases as you wait for the gift card to come through to make your next purchase.",
    "This year the Shopping Event runs from November 26 (Black Friday) through November 29 (Cyber Monday).",
    "As we've mentioned, the value of the gift card you'll receive depends on how much you're spending on an eligible product.",
    "All eligible purchases will get you – at minimum – a $50 / £40 / AU$70 Apple Store gift card, but you could get a gift card with a value of $200 / £160 / AU$280 if you splash the cash on a 27-inch iMac 2020 (which itself has a starting price of $1,799 / £1,799 / AU$2,699).",
    "Some of Apple's newest devices aren't included in this Black Friday deal however. The likes of the iPhone 13 series, Apple Watch 7 and M1 chip-powered iMac 2021 series do not qualify for this gift card offer.",
    "The table below shows you eligible devices and the gift card you'll receive if you purchase them between November 26 and November 29."
  ],
  "headers": {
    "4": "Apple's Black Friday Shopping Event",
    "7": "What gift cards can I get in Apple's Black Friday offer?",
    "11": "More Black Friday deals"
  },
  "links": {
    "from its website": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-9206237347527761000&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fshop%2Fgifts%2Fshopping-event",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday Apple deals": "https://www.techradar.com/black-friday/apple-black-friday-deals",
    "iMac 2020": "https://www.techradar.com/reviews/apple-imac-27-inch-2020",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch 7": "https://www.techradar.com/reviews/apple-watch-7",
    "iMac 2021": "https://www.techradar.com/reviews/imac-24-inch-2021"
  }
}