{
  "source": "https://www.techradar.com/news/rtx-3080-prime-day-deals-wont-exist-but-you-can-still-save-big-on-your-pc-build",
  "title": "RTX 3080 Prime Day deals won't exist, but you can still save big on your PC build",
  "category": "computing",
  "updated": "2021-06-20T14:10:42Z",
  "author": "bill-thomas",
  "summary": "There will probably be a lot of Prime Day PC component deals",
  "article": [
    "If you've been paying any amount of attention to the PC hardware scene over the last year or so, you've probably noticed that it's incredibly hard to find an Nvidia GeForce RTX 3080 or, honestly, any other graphics card. However, if your graphics card isn't the part of your PC you're looking to upgrade, or if you saw a GPU and jumped on it in the 2 milliseconds it was available, you can probably save a ton of cash on PC components with Prime Day deals.",
    "Because while a new graphics card might make you get better frame rates in the best PC games, a new SSD can make your whole PC run faster, and more RAM can allow you to leave more Chrome tabs open.",
    "But because the world of PC components is complicated in the best of times, we went ahead and put together some advice of what to look for, and what to avoid.",
    "If you're still rocking a hard drive in 2021, you should probably just suck it up and buy an SSD on Prime Day. At the same time, though, you shouldn't break out too much cash for an older SATA drive.",
    "These drives peak at around 500Mbps, which is way faster than a hard drive, but way slower than the 3,000Mbps that a PCIe 3.0 NVMe drive can hit. And now that all SSDs are becoming more affordable, you shouldn't spend more than $100 / £100 on a SATA SSD – and that's for a full 1TB of storage.",
    "Above that, you can simply get a faster drive for the same cash, because even the nicest SATA SSD isn't going to be faster than the slowest NVMe drive. There are some security benefits to more pro-oriented SATA SSDs, but for most people, that's not going to matter.",
    "When it comes to the best RAM, you're going to see a lot of RAM deals with speeds above 3,600MHz. And, when you look at those deals, you'll probably notice that those RAM kits are way more expensive than something with a reasonable speed.",
    "RAM that exceeds 4,000MHz is only really necessary if you're the type of person that gets their kicks by overclocking their components to their full potential, using exotic cooling, and trying to break Cinebench records. If you're just looking to play some PC games or get some work done, you're going to start running into diminishing returns after 3,600MHz, and arguably 3,200MHz.",
    "Plus, some CPU platforms are better attuned to faster RAM than others. In general you're going to be able to get faster RAM speeds when you pair your sticks with an AMD Ryzen CPU than an Intel Core processor. That's not to say that Intel processors are worse than Ryzen, as AMD's chips are far more dependent on memory speed than Intel's silicon.",
    "Also, when it comes to RAM, do yourself a favor and make sure you're getting at least two sticks of memory. You will lose out on performance if you're running your PC in single-channel mode, so make sure your PC has at least two sticks to take advantage of dual-channel memory that every modern platform has on offer.",
    "One thing we've noticed during previous Prime Day events is that a lot of motherboards will go on sale – but they'll almost exclusively be older motherboards. So, if you already have a processor, you're going to want to make sure the motherboard you spotted that sweet deal on will actually work with that chip.",
    "In general, you should be pretty safe with AMD motherboards, unless you have one of the latest AMD Ryzen 5000 processors in your cart. AMD 300 series motherboards are the oldest boards on the current socket, and they will support all AMD Ryzen processors up through the 3000 series – like the AMD Ryzen 5 3600X.",
    "With a more modern AMD Ryzen 5000 processor, you can only use a 400 series motherboard, like x470 or b450. But ideally, if you are getting something like the AMD Ryzen 9 5900X, you should pair it with an x570 board.",
    "Intel is much more complicated, and usually its chipsets only last a generation or two. If you see a deep discount on a Z390 board, for instance, that will only be compatible with 9th-generation Coffee Lake processors like the Intel Core i9-9900K.",
    "There's a pretty good chance Intel will put its 10th-gen processors on sale, now that the 11th-generation Rocket Lake processors are out and you can still easily find 10th-gen chips in stock. So, if there is a big sale on Comet Lake, don't get tricked into buying a Z390 board – you're going to want a Z490 or H470 board.",
    "In years past we would have never suggested, but considering how hard it is to buy PC components right now, if you spot a good deal on one of the best gaming PCs, you should honestly just go for it.",
    "If you spot, for instance, a prebuilt gaming rig that has an Intel Core i7 and an Nvidia GeForce RTX 3060 Ti for $1000, that's about what you'd pay for the graphics card alone right now. Plus, it'll save you a ton of time in actually building the thing.",
    "There will probably be a lot of PCs from the likes of Dell and HP on sale, and while those will probably do the trick for folks who will probably never tinker with their gaming rigs, if you want something you can salvage for parts, you should find something from a more boutique brand. CyberPowerPC and iBuyPower computers are always featured in these sales, and while they're not the greatest system integrators, they do use off-shelf components, so you can easily pull parts from those rigs to either upgrade your own or build something better.",
    "It's definitely not ideal, especially if you love building PCs as much as we do, but these are desperate times. So if you need a gaming PC now, and you don't want to wait until next year, well, prebuilt PCs aren't going out of stock anywhere on Prime Day.",
    "TechRadar is rounding up all the top deals over the Prime Day sales period, and we’ve put all the best Prime Day deals in an easy-to-navigate article to help you find the bargains you’re looking for."
  ],
  "headers": {
    "3": "Don't spend too much on a SATA SSD",
    "6": "RAM doesn't need to be super fast",
    "10": "Make sure you're getting the right motherboard",
    "15": "If all else fails, consider buying a prebuilt"
  },
  "links": {
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best PC games": "https://www.techradar.com/news/best-pc-games",
    "new SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "best gaming PCs,": "https://www.techradar.com/news/the-best-gaming-pc",
    "best Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals"
  }
}