{
  "source": "https://www.techradar.com/news/nb-embg-greater-1800-gmt-cambridge-quantum-merges-with-honeywell-to-form-quantum-computing-supergiant",
  "title": "Cambridge Quantum merges with Honeywell to form quantum computing supergiant",
  "category": "computing",
  "updated": "2021-11-30T18:22:44Z",
  "author": "mayank-sharma",
  "summary": "New company will be called Quantinuum",
  "article": [
    "Two leading quantum computing companies, Honeywell Quantum Solutions and Cambridge Quantum, have combined to create Quantinuum, which is billed as the first full-stack quantum company.",
    "By leveraging the quantum expertise of both its parents, Quantinuum plans to offer a comprehensive suite of quantum hardware and software, including the industry’s first quantum operating system.",
    "“We are science led and enterprise driven, and our scale and global presence in this most critical of technologies will provide leadership in each of the key areas that constitute the ‘must haves’ for quantum computing to deliver real-world solutions to all our customers and partners,” remarked Ilyas Khan, founder of Cambridge Quantum, who will head Quantinuum as its CEO.",
    "Honeywell explains that Quantinuum’s products and solutions will help support a multitude of high-priority tasks such as cybersecurity and encryption, drug discovery and delivery, and more.",
    "Quantinuum hopes to deliver the solutions in such a manner that they are compatible with a variety of quantum hardware processors, such as the Honeywell-powered system Model H1, as well as IBM’s suite of quantum computers.",
    "To that end Quantinuum has said that it’ll provide all quantum software developers open access to “tket,” an independent quantum software development kit.",
    "“Quantinuum customers will now have access to the world’s first quantum operating system, applications, and hardware-agnostic software, all of which will be used to address extremely challenging business needs with which conventional computing systems struggle,” said Darius Adamczyk, chairman and CEO of Honeywell, who joins Quantinuum as its chairman."
  ],
  "headers": {
    "3": "Quantum reality"
  },
  "links": {
    "quantum computing": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario",
    "Honeywell Quantum Solutions": "https://www.techradar.com/news/honeywell-reveals-next-gen-quantum-computer",
    "Cambridge Quantum": "https://www.techradar.com/news/quantum-computing-as-a-service-is-going-mainstream",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "IBM’s suite of quantum computers": "https://www.techradar.com/news/ibm-becomes-first-to-demonstrate-advantage-of-quantum-computers-in-real-life-scenario"
  }
}