{
  "source": "https://www.techradar.com/news/iphone-13-launch-date-confirmed-for-september-14-heres-all-we-know",
  "title": "iPhone 13 launch date confirmed for September 14 – here's all we know",
  "category": "phones",
  "updated": "2021-09-08T11:09:53Z",
  "author": "tom-bedford",
  "summary": "You haven't got long to wait",
  "article": [
    "After quite a lot of speculation, we now know for sure that Apple is hosting an event on September 14 at 10am PT / 1pm ET / 6pm BST (3am AEST on September 15), and it's very likely to be the iPhone 13's debut.",
    "Apple has confirmed as much via an event poster which it sent to press which very clearly marks the September 14 launch event with just the words 'California streaming.' Apple SVP of Marketing tweeted out this short clip, which didn't hint at any devices but leaned in to the 'streaming' feel:",
    "That may put some minds to rest, as Covid-related delays pushed the iPhone 12 launch from Apple's usual September slot to October last year and some iPhone fans were worried the iPhone 13 would come in October, too. While the event wasn't explicit about devices, the latest rumors including from Bloomberg's Mark Gurman strongly suggest they're coming next week.",
    "We'd also expect to see the Apple Watch Series 7, and there's a small chance we may see a new iPad (2021) at the event. It's also faintly possible the iPad mini 6 and Apple Watch SE 2 will show up, but we're not certain for those.",
    "Apple loves to theme its events around a quippy phrase – WWDC 2021 in June was 'Connect,' the April iPad and Mac launch event was 'Spring Ahead', and so on – so 'California Streaming' is a massive hint at what's to come.",
    "From a cautious perspective, Apple's invitation to its September 14 event doesn't hint at any gadgets whatsoever. Instead, 'California streaming' could simply focus on the Apple TV Plus streaming service, the Apple Fitness Plus workout streaming service, and other parts of the Apple One service bundle.",
    "But Apple's event invite held another clue – an augmented reality (AR) component that let users peer through an Apple-shaped portal and into the presumed Northern California landscape seen in the event teaser. To see it for yourself, head to Apple's event page on mobile and tap the image (likely must be on an iPhone and using Safari, sadly) – or you can see below:",
    "Apple has included AR and mixed-reality (MR) components to its launch presentations, but this feels like a clear hint that the event could have a greater emphasis on AR/MR functionality in its devices – like the iPhone 13 range.",
    "This could be the moment when we finally see the long-rumored Apple Glasses, too, but since we haven't heard much about that device, we'll assume it's still in production. It's more likely that Apple is investing more in AR/MR on its existing mobile lineup, but we'll wait for September 14 to know for sure."
  ],
  "headers": {
    "4": "Analysis: California Streaming on such an iPhone day?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Mark Gurman": "https://twitter.com/markgurman/status/1435277431598845958",
    "Apple Watch Series 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "new iPad (2021)": "https://www.techradar.com/reviews/new-ipad-102-2021",
    "iPad mini 6": "https://www.techradar.com/reviews/ipad-mini-2021",
    "Apple Watch SE 2": "https://www.techradar.com/news/apple-watch-se-2",
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "launch event": "https://www.techradar.com/news/apple-event-april-2021-live-blog",
    "Apple TV Plus": "https://www.techradar.com/reviews/apple-tv-plus",
    "Apple Fitness Plus": "https://www.techradar.com/news/apple-fitness-plus",
    "Apple One": "https://www.techradar.com/news/apple-one-subscription-service-release-date-price-and-news",
    "Apple's event page": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-1167706687119148800&sharedId=trd-us&u=https%3A%2F%2Fwww.apple.com%2Fapple-events%2F",
    "Apple Glasses": "https://www.techradar.com/news/apple-glasses"
  }
}