{
  "source": "https://www.techradar.com/news/spider-mans-debut-in-marvels-avengers-gets-acrobatic-first-trailer",
  "title": "Spider-Man's debut in Marvel's Avengers gets acrobatic first trailer",
  "category": "gaming",
  "updated": "2021-12-02T16:25:12Z",
  "author": "stephen-lambrechts",
  "summary": "See Spidey fight the slowest bad guys imaginable",
  "article": [
    "They took their sweet time, but publisher Square Enix and developer Crystal Dynamics are finally delivering on their promise of bringing Spider-Man to the divisive Marvel's Avengers game.",
    "As revealed last week, ol' Webhead will make his debut in the game in the upcoming Spider-Man: With Great Power Hero Event, which is set to arrive on November 30, 2021, exclusively for PS4 and PS5 players.",
    "You can now get your first look at Spider-Man's team-up with The Avengers in the first trailer for the approaching event, in which Spidey takes out a group of AIM goons right before the rest of The Avengers arrive.",
    "Although the trailer is slickly put-together, it isn't exactly a great representation of the game, in that we're simply watching a heavily mo-capped scenario in which a rather slow moving Spider-Man takes down an even slower group of AIM henchmen.",
    "While we appreciate that the cinematic trailer seems to have been created in-engine, it would have been preferable to see how Spidey's acrobatics look in the context of actual gameplay.",
    "That said, the event is still a couple of weeks away, which means it's very likely that Crystal Dynamics will give us a proper look at Spider-Man's gameplay in the lead-up to the event's arrival."
  ],
  "headers": {
    "3": "Our take: give us some real gameplay footage"
  },
  "links": {
    "Marvel's Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "As revealed last week": "https://www.techradar.com/news/spider-man-will-swing-into-marvels-avengers-on-ps4-and-ps5-this-month",
    "exclusively for PS4 and PS5 players": "https://www.techradar.com/news/marvels-avengers-spider-man-exclusivity-deal-is-bad-for-everyone-including-sony"
  }
}