{
  "source": "https://www.techradar.com/news/xbox-game-studios-finally-reveals-all-about-age-of-empires-4",
  "title": "Xbox Game Studios finally reveals all about Age of Empires 4",
  "category": "computing",
  "updated": "2021-04-11T14:19:21Z",
  "author": "rosario-blue",
  "summary": "All you need to know about Age of Empires 4",
  "article": [
    "Age of Empires 4 is real: Xbox Game Studios, having teased us long enough, has now let us in on the juiciest details of the next title in the Age of Empires series, which for PC gamers of a certain vintage will be one of the most anticipated game releases of the decade.",
    "We have a release date, and all the information on gameplay, civilizations, campaigns, combat, music, and art direction.",
    "We also had the pleasure of sitting down with Adam Isgreen, Creative Director at World’s Edge, Zach Schläppi, art director from Relic Entertainment. and Quinn Duffy and Philippe Boulle, game director and narrative lead respectively at Relic Entertainment. So, let’s get into it!",
    "There are four new historic campaigns in Age of Empires 4, one of them being that of the Normans, first glimpsed in the fan preview which premiered on 10 April 2021, and which starts in 1066 with the Battle of Hastings. Unlike previous Age of Empire games, whose campaigns focused on a single historical character, campaigns in Age 4 are split into chapters and follow family lines down the generations.",
    "In the Norman campaign, for example, we begin with William the Conqueror, and then “bridge to his children,” as Boulle says. \"Henry the 1st and Duke Robert fighting it out for who’s going to be king – and then their children and then their children.",
    "“So, you get the whole story of the Norman Conquest, from the time when this ambitious Duke made his way across the channel and said ‘this is mine’, all the way to the point where you’re signing the Magna Carta and laying the foundations of what England is today.”",
    "There will be eight civs at launch, with the Mongols, Delhi, Chinese, and English, being revealed so far. Traditionally, civs in Age of Empires have played much like each other, in contrast to some other real time strategy games (RTS), whose races can play quite differently from one another. This more “asymmetrical” design has its plusses (different races are like different games) and minuses (balance). A lot of work has been done to make each Age 4’s civs’ more unique in playstyle and feel.",
    "As Duffy says, “the different mechanics the civs have – whether it's unique units or their age-up mechanics, the special bonuses they get for city building, the 'influence system', as we call it, where you can get bonuses driven from your landmark choice – open up a whole bunch of new play and gameplay opportunities in the game.”",
    "You get a small taster of the type of asymmetry in the civs from the short snippets of the Mongols that you see in the preview.",
    "“The thing that we really wanted to push is the civilization diversity,” says Isgreen, “and you saw some of that in the video, with the Mongols being able to pack up all their buildings and move their entire civ somewhere else on the map. They have a very unique mechanic about moving around stone deposits, and how they use stone and leverage stone in order to wage war.”",
    "One of the most often requested additions fans have wanted to see in Age of Empires 4 are better siege options. It appears the team has heard you loud and clear and siege combat is indeed included. Your units can scale walls and defend from them too.",
    "Though great effort has been put into making civilizations more unique, generic units also remain.",
    "“There still will be generic units,” says Isgreen. “We wanted to make sure that there was always the triangle between Pikemen, ranged units, and mounted units that you've pretty much had in all the Age of Empires games. Now, we played with that formula quite a bit across the different civilizations, but we always wanted to make sure that those three categories were represented in a way that people could totally understand because it is kind of the staple of what makes Age of Empires, ‘Age of Empires’”",
    "One of the most exciting reveals in the preview are stealth units and stealth forests. Yes, you heard that right; stealth is finally here! And this could give the underused and oft-neglected scout units a game-changing role.",
    "“Scouts now can see into stealth forests,” Isgreen explains. “So scouts become super-important later in the game, because they're the things that detect if there's a giant murder squad waiting inside of the treeline to kill you.”",
    "Naval units were also teased, so they are definitely included, but we’ll have to wait a little longer for some more details.",
    "The “Age” in Age of Empires is not there for show: moving with your civilization from one age to the next is one of series' defining features.",
    "A special effort this time has been made to convey that growth with the music and art design. All civilizations have unique theme music and their units speak “period-appropriate languages”. So, when playing as the English, you start in the Dark Ages unable to understand your units, until you age up and they start speaking in Ye Olde English.",
    "“Each civilization has its own musical theme,” says Boulle, “[which] increases in complexity and depth as you progress through the ages. And the art team brought the same thing. So, the English go from thatched roofs in the first age all the way to late medieval structures by the end of the game.”",
    "The team wanted to “bring as much care and attention as we could to these things, because … our audience is these cultures. We have people internally on the team – [and] certainly in the audience – who see themselves in the Chinese civ, in the Delhi sultanate civ, in the Mongol civ, the English civ, and all the others, and we take very seriously wanting to elevate these civs and really show them off as the wonderful things they are.”",
    "The team went a step further, and travelled to the various civilization’s countries, as Boulle explains. “We did recording in England, we did recording in Eastern Turkey, in Mongolia. They've been all over the place. I envy their air miles.”",
    "“Artistically, we've added a lot more detail in all the assets, especially the buildings,” says Schläppi. “The houses are different for each age. The modelling actually changes, the textures change. It reflects the narrative of Age 1 - you have very functional, almost primitive-looking buildings and structures, using very basic materials; and as you age up things get richer and richer and more detailed.”",
    "While playing Age of Empires 4, you will encounter golden soldiers that look like what you would imagine the remnants of a ghosts’ soul might look like, and it is a truly breathtaking effect to see and one of the many clever additions to Age of Empires 4. Schläppi explained that they wanted to, “make [the game] a little more compelling by giving it a spirit of AR.”",
    "“So, this idea – this iconography of the molten golden Ink as Light,” says Schläppi. “It's really there to help shed light on the past, and give us a sort of ghost outline of what was there. You'll notice in some of the scenes you'll see the troops on the fields: those are the actual locations, and sometimes you'll see the ghost outlines of these structures. They have castles and walls: and that too, the people would go to the actual location and reconstruct what those outlines looked like. And then we'd do it in a flip in the game where when you're building, you'll see the golden Ink as Light creating those structures. So it's a nice little poetic tie-in.”",
    "Competitive play is most definitely going to be a part of Age of Empires 4, with a promise of improved matchmaking. And mods will also be coming.",
    "“Part of the DNA of Age of Empires is modding and tools,” says Isgreen. \"So, we have a whole road map planned of how they're gonna release and everything like that. You can imagine: new game, new tech – so we wanna make sure they're in a great place for people to be able to engage with. We wanna make sure that it's very easy and people can follow a flow and build things.\"",
    "We can confirm that Age 4 will definitely be released in 'Fall' 2021, so the latter half of this year – and this is a confirmed date, so you can start counting down the days, just like we are.",
    "It will be available for Windows 10 through Steam and Microsoft Xbox Game pass for PC.",
    "The development of Age of Empires 4 and the two Definitive Editions have been unusual in that they’ve been unusually influenced by fan feedback – officially, through the AoE’s community council, which is made up of fans from all over the world.",
    "“We’re building this game for Age players,” says Emma Bridle, director of customer voice at World’s Edge, “so having them be part of the journey with us has been really important. We formed the council back in 2017. Since then we’ve been having regular play sessions with them, getting them hands-on with the game, and getting their feedback. Our teams pore through everything that they’ve sent us, that goes to the game team and we really look at how their feedback can help us make the game better.”",
    "History is at the forefront of Age of Empires – I mean it’s literal history – but World’s Edge and Relic have put in the work to ensure that Age of Empires 4 is not just a game loosely based on historical events, but that it is historically accurate, taking into consideration what the team calls “humanized history”.",
    "“So, we set out to celebrate history – to humanize history, as Adam put it,” says Boulle, “and one of our major tools are these documentary films that serve as a bridge between missions. We have a narrator … giving you the context of the history you're about to play. Our idea is to have you understand what William the Conqueror or Henry the First had to deal with in these historical battles and these historical moments.”",
    "There will also be exciting updates coming to Age of Empires 2 and Age of Empires 3 Definitive Editions.",
    "Age of Empires 2 will be receiving its second expansion, Dawn of the Dukes, which is set in Eastern Europe. There’ll be a bunch of new things to look forward to, including new campaign missions, and will release in a few months.",
    "Also, for the first time in Age of Empires history, coop will be coming to the franchise. In Age of Empires 2 DE you will be able to play specially selected historical battles and campaign missions cooperatively.",
    "As for Age of Empires 3, on 13 April 2021 it’s going to be receiving its first big update, with a new civ; the United States. The US civ will come with a new age-up mechanic, home city, nine new units, a unique explorer, and much more. You’ll be able to buy it on the Windows Store or Steam. Alternatively, you can get it for free by completing a new “50 state” challenge, but it’s only available for a limited time.",
    "An African civs expansion was teased for Age of Empires 3 Definitive Edition, but with very little info, and no confirmed date of release.",
    "Now, before you ask, we did do some snooping around a possible Age of Mythology DE or a new title altogether. We’ve been assured it has not been forgotten. Adam Isgreen says “I have not forgotten about Age of Mythology. None of us here at World's Edge has forgotten about Age of Mythology. I don't think anyone at Relic has even forgotten about Age of Mythology, because it comes up all the time. So I will say the thing I used to say all the time which is... just stay tuned. We have not forgotten about it.”"
  ],
  "headers": {
    "3": "Campaigns",
    "6": "Civilizations",
    "10": "Units and combat",
    "16": "Audio and art direction",
    "24": "Competitive play and mods",
    "26": "Release date",
    "28": "Special mentions",
    "32": "Definitive Editions & Age of Mythology"
  },
  "links": {
    "World’s Edge": "https://www.ageofempires.com/",
    "Relic Entertainment": "https://www.relic.com/",
    "fan preview": "https://www.ageofempires.com/news/announcing-age-fan-preview-2021/",
    "Age 4": "https://www.ageofempires.com/news/announcing-age-fan-preview-2021/",
    "real time strategy games": "https://www.techradar.com/best/best-pc-strategy-games-the-top-15-pc-strategy-games-of-all-time",
    "Microsoft Xbox Game pass": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-9110539139504434000&murl=https%3A%2F%2Fwww.xbox.com%2Fen-US%2Fxbox-game-pass%2Fpc-games",
    "Age of Empires 2 DE": "https://www.ageofempires.com/games/aoeiide/",
    "Steam": "https://store.steampowered.com/app/933110/Age_of_Empires_III_Definitive_Edition/",
    "Age of Mythology DE": "https://www.ageofempires.com/games/aom/"
  }
}