{
  "source": "https://www.techradar.com/news/worst-celebrity-interviews-and-video-game-movies-noise-cancelling-podcast-episode-66",
  "title": "Are video game movies ever good? It's the Noise Cancelling podcast, episode 66",
  "category": "phones",
  "updated": "2021-05-28T08:22:50Z",
  "author": "adam-vjestica",
  "summary": "Episode 66 of our tech podcast is out now",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "The show is presented by Gareth Beavis, Editor in Chief of TechRadar.",
    "This week our guests Sean O'Connell, Managing Editor at Cinema Blend, and Tom Power, Entertainment Reporter at TechRadar, who join us (remotely, of course) to talk about the last seven days in tech.",
    "In this week's episode, we're talking entertainment. The podcast begins with our usual Big Question: Who should play our fathers in our biopic?",
    "We also induct a new device into our Gadget Hall of Fame, the worse celebrities we've ever interviewed, and whether cinemas will survive the pandemic. Next up, we chat about why video game movies suck, and if VR movies are a good idea.",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple Podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 66:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/uk",
    "Tom's Guide": "https://www.tomsguide.com/uk",
    "Cinema Blend": "https://www.cinemablend.com/",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple Podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-5315213347234831000&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}