{
  "source": "https://www.techradar.com/news/major-microsoft-onedrive-update-will-change-the-way-you-share-your-files",
  "title": "Major Microsoft OneDrive update will change the way you share your files",
  "category": "computing",
  "updated": "2021-06-03T03:32:29Z",
  "author": "anthony-spadafora",
  "summary": "OneDrive is getting a significant overhaul later this year",
  "article": [
    "Microsoft is working on a major upgrade for OneDrive that is set to arrive later this year which will give users greater control over how they share files using the company's cloud storage software.",
    "According to four separate posts on the Microsoft 365 Roadmap, the software giant plans to overhaul the sharing experience in OneDrive with new options that will make it easier to share files and manage who has access to them once they've been shared.",
    "The first update to OneDrive's sharing experience will come in the form of new options to the service's Share menu that will provide easy access to additional sharing options including email, copy link, Microsoft Teams chat and more. This feature is currently in development and just like with the rest of the new features coming to OneDrive, it will arrive in November of this year.",
    "Microsoft is also working on a new “Shared with” list at the bottom of the Share dialog which will give users an at-a-glance view of everyone they've given access to a particular file.",
    "In order to make it easier for users to access files that have been shared with them, Microsoft plans on updating the “Manage Access” experience in OneDrive. Once this update rolls out, users will have access to additional controls that will let them decide how recipients can access shared files.",
    "Microsoft will also replace the Copy link button in OneDrive with a footer in its upcoming update. In this footer, users will be able to set permissions for links before copying them to share with recipients.",
    "We'll likely hear more on the company's major update to its cloud storage service once we get closer to its release but in the meantime, you can test out the new 64-bit version of OneDrive that offers improved performance and makes it easier to transfer large files due to the fact that it can utilize all of the RAM in your Windows 10 PC."
  ],
  "headers": {
    "4": "Accessing shared files"
  },
  "links": {
    "OneDrive": "https://www.techradar.com/reviews/microsoft-onedrive-for-office-365",
    "cloud storage": "https://www.techradar.com/news/the-best-cloud-storage",
    "Microsoft 365 Roadmap": "https://www.techradar.com/news/microsoft-exchange-follows-in-gmails-footsteps-with-important-phishing-protection-feature",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "64-bit version of OneDrive": "https://www.techradar.com/news/microsoft-makes-windows-10-64-bit-version-of-onedrive-available-for-more-users",
    "transfer large files": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938"
  }
}