{
  "source": "https://www.techradar.com/news/samsungs-next-affordable-tablet-might-not-be-called-the-tab-s7-lite-after-all",
  "title": "Samsung's next affordable tablet might not be called the Tab S7 Lite after all",
  "category": "tablets",
  "updated": "2021-05-11T10:59:33Z",
  "author": "david-nield",
  "summary": "Throw in an XL",
  "article": [
    "If the rumor mill is to be believed then a more affordable version of the Samsung Galaxy Tab S7 tablet is on the way, though we're now hearing that the previously assumed Galaxy Tab S7 Lite name is incorrect.",
    "According to certification documents spotted by SamMobile, the actual moniker bestowed on the tablet is going to be the Galaxy Tab S7 XL Lite, so there's an additional \"XL\" in there. That may be because it's expected to match the larger 12.4-inch screen size of the Tab S7 Plus (the standard S7 slate settles for an 11-inch display).",
    "Six models have been registered in total, and the assumption is that these could cover Wi-Fi, 4G and 5G versions of the tablet. From these documents at least, there's no indication that there will be a non-XL version of the cheaper device.",
    "Whatever it ends up being called, multiple sources have pointed to June as the launch month for the newest member of the Tab S7 family. We're expecting another big Samsung event in August for the launch of the Galaxy Z Fold 3, the Galaxy Z Flip 3, and the Galaxy S21 FE.",
    "There has previously been talk of both a 5G version and a Plus version of the Tab S7 XL Lite, so Samsung is certain to unveil multiple versions of the tablet when it eventually sees the light of day – some of which we may not have heard about yet.",
    "In terms of price, this Lite tablet is likely to cost substantially less than the $649.99 / £619 / AU$1,149 that the base model of the Tab S7 retails for. Don't forget we did get a Samsung Galaxy Tab S6 Lite last year, which went on sale for $349 / £349 / AU$649.",
    "We have already seen unofficial renders of the affordable tablet, and while there are no real surprises in terms of its design, it sounds as though the device is going to come in a variety of appealing colors – so there should be a shade for everyone.",
    "Another little tidbit that we've heard is that supposedly 44W fast charging will be supported, which is almost as speedy as the main Tab S7. Samsung apparently isn't going to include a fast charger in the box though, so you'll need to source your own to get that 44W rate."
  ],
  "headers": {
    "4": "What we think we know so far"
  },
  "links": {
    "Samsung Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Galaxy Tab S7 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-fe",
    "SamMobile": "https://www.sammobile.com/news/galaxy-tab-s7-lite-not-actual-name-samsung-upcoming-tablet/",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "been talk": "https://www.techradar.com/news/samsung-galaxy-tab-s7-lite-plus-could-be-the-brands-first-cheap-5g-tablet",
    "Samsung Galaxy Tab S6 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-lite-review",
    "seen unofficial renders": "https://www.techradar.com/news/samsung-galaxy-tab-s7-lite-leak-shows-a-surprisingly-good-looking-cheap-tablet",
    "44W fast charging will be supported": "https://www.techradar.com/news/samsung-galaxy-tab-s7-lite-could-have-fast-charging-but-theres-a-catch"
  }
}