{
  "source": "https://www.techradar.com/news/shopify-and-spotify-want-to-help-artists-drive-business-to-their-online-stores",
  "title": "Shopify and Spotify want to help artists drive business to their online stores",
  "category": "computing",
  "updated": "2021-10-21T22:00:49Z",
  "author": "anthony-spadafora",
  "summary": "Artists can now showcase their merch on their Spotify profiles",
  "article": [
    "Shopify has announced a new strategic partnership with Spotify that will allow artists to expand beyond music and merchandise to build fully realized businesses on its ecommerce platform.",
    "Artists that use Spotify to promote and distribute their music can now sell products such as hats, sweatshirts, vinyl records and more using Shopify on the platform where their listeners and fans already engage with their music the most.",
    "By connecting their Spotify for Artists account with their online store on Shopify, artists can sync their product catalog and showcase products of their choosing directly on their Spotify artist profiles which makes it much easier for fans to browse and purchase items. Shopify also gives entrepreneurial artists access to an all-in-one commerce platform from which they can manage their brands across multiple touchpoints including the most popular music streaming service in the world.",
    "Director of product at Shopify, Amir Kabbara explained in a press release how the new partnership between the two companies will provide artists with new ways to monetize their brands, saying:",
    "“Thousands of artists already choose Shopify as their commerce platform, and now we’re bringing fans and artists even closer together with the launch of the Spotify channel. Artists today are entrepreneurial. They’re building multifaceted brands and businesses, and now we’re making it easier for them to meet fans where they are. By bringing entrepreneurship to Spotify, we’re empowering artists to think beyond the traditional merch table with new ways to monetize, and to experiment with their brands through commerce.”",
    "Through its new partnership with Shopify, Spotify is providing artists with an additional resource to help them turn listeners into fans and fans into super fans while also helping them earn more.",
    "For new artists looking to create an online store for the first time, Shopify is an easy-to-use, all-in-one commerce platform that allows them to start, grow and manage their brands. However, artists that already have a large following or pre-existing businesses, can also leverage the ecommerce platform's infrastructure as it can handle high volumes of traffic during highly anticipated product drops or other key sales moments.",
    "The Shopify channel for Spotify is available to artists in all markets that the music streaming service has launched in so far while their fans in the US, UK, Canada, Australia and New Zealand will now be able to see their products while listening to their music.",
    "Both new and existing artists can sign up for Shopify's Spotify channel by using the company's fan development platform, Spotify for Artists."
  ],
  "headers": {
    "5": "Expanding beyond traditional merch"
  },
  "links": {
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "music streaming service": "https://www.techradar.com/best/the-best-music-streaming-services-2021",
    "press release": "https://news.shopify.com/listen-up-shopify-brings-entrepreneurship-to-spotify",
    "online store": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "Spotify for Artists": "https://artists.spotify.com/features"
  }
}