{
  "source": "https://www.techradar.com/news/seems-xiaomis-new-tablet-wont-just-copy-apples-ipad-but-all-its-accessories-too",
  "title": "Seems Xiaomi's new tablet won't just copy Apple's iPad, but all its accessories too",
  "category": "tablets",
  "updated": "2021-12-05T23:35:01Z",
  "author": "tom-bedford",
  "summary": "The X Pen approaches",
  "article": [
    "It's getting undeniable that Xiaomi is gearing up to launch its first tablet in years - while leaks have been telling us about the Mi Pad 5 for a long while, depicting it as a rival to Apple's iPad Pro, even the company is getting in on the fun now.",
    "Via Chinese social media site Weibo, Xiaomi has been sharing teaser images of the accessories the Mi Pad 5 will likely come with - one shows the corner of a keyboard folio which clips onto the tablet, and another has a giant-looking stylus pressing down on the slate's screen.",
    "Like lots of the other leaked specs and details we've heard so far, these new features seem ripped out of Apple's playbook.",
    "The stylus - likely to be called the X Pen (no relation to the superhero gang) if Samsung's S Pen and Huawei Mate's M Pen are any inspiration - looks to have a hard nib, which makes it useful for accurately conveying pressure and sensitivity when sketching.",
    "It also seems to have the Apple Pencil 2's design, of a cylindrical body with one flat edge (that presumably clips to the tablet magnetically).",
    "The keyboard folio likely works similarly to every company's version in that it doubles as a case, and a keyboard stand. It has a small enter and backspace key, unlike Apple's equivalents, but like similar products made by Huawei, which can be a little irritating for typing as it makes it harder to effortlessly hit those vital keys.",
    "Oh, and the fact the keyboard shows the Latin alphabet also suggests the slate won't just be launching in China, which doesn't use that collection of characters.",
    "The stylus and keyboard posters point to an August 10 launch date, so we probably won't have to wait long to hear about the company's new tablet.",
    "Apple is the dominant force in the slate market, with its iPad line interchangeable with ''tablets'' in many households. This isn't something other companies miss, with most big slates positioned in comparison to Apple's iPads.",
    "This is something Samsung's Galaxy Tab line, Huawei's MatePad products and even Lenovo's various devices replicate - it seems that, to have success in the tablet market, you have to rival an iPad.",
    "Xiaomi's Mi Pad 5 has stumbled upon the same destiny, with many calling it an iPad Pro rival from the moment leaks on its specs and design appeared. It's something these new teases don't shy away from, and it's partially the reason there's a fair amount of hype behind the new Mi Pad.",
    "Favorable comparisons to an iPad can do wonders for a product, and if a slate can be a more affordable or powerful take on Apple's hardware it can become popular. But the reverse is also true.",
    "If a new tablet fails to reach the bar set by Apple - an occurrence which happens frequently, given Apple is a massive tech giant - the comparisons the firm invited can end up coming back to biting it. The tablet may get cast off into the depths of history, forgotten almost immediately in favor of the flashiest and newest iPad. We've seen it before, and we'll see it again.",
    "So for all the flashy adverts and accessory teases that Xiaomi is publishing, it also needs to be ready to put out a tablet that really does rival an iPad Pro, either in terms of design, or power, or usefulness, because if it misses the mark it risks falling into an eternal slumber - and there's no Prince Charming to wake it up.",
    "For something a bit different, you might also want to check out the ReMarkable 2 tablet review."
  ],
  "headers": {
    "8": "Analysis: a bite of the poisoned Apple"
  },
  "links": {
    "Mi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Weibo": "https://weibo.com/2202387347/KsjV2EdOc",
    "ReMarkable 2 tablet": "https://www.techradar.com/reviews/remarkable-2-tablet"
  }
}