{
  "source": "https://www.techradar.com/news/surround-sound-made-easy-dts-is-rolling-your-tv-into-your-surround-sound-system",
  "title": "Surround sound made easy: DTS is rolling your TV into your surround sound system",
  "category": "audio-visual",
  "updated": "2021-08-18T18:02:23Z",
  "author": "nick-pino",
  "summary": "DTS is doing for TVs what Sonos did for wireless speakers",
  "article": [
    "DTS is about to make the process of buying a surround sound system easier on your wallet – and more convenient – with the introduction of DTS Play-Fi Home Theater.",
    "The technology, announced on Wednesday, lets you use your TV as the center of your surround sound system by pairing it up with any other DTS Play-Fi-enabled speakers.",
    "The only catch here is that your TV has to support DTS Play-Fi Home Theater – and those won’t be rolling out for another few months.",
    "The benefit is that, once you have a DTS Play-Fi Home Theater TV, you’ll be able to sync it up wirelessly with a Play-Fi enabled soundbar or discrete Play-Fi enabled front speakers as well as up to two Play-Fi enabled subwoofers. The whole system can then be grouped together and synced up to enhance the audio playback of your favorite shows or movies.",
    "The crux of the new technology is the desire to create a surround sound system using a TV and a bunch of DTS speakers – hence, why DTS developed DTS Play-Fi Home Theater.",
    "Once it rolls out everywhere, the tech will enable more folks to start a home theater system by buying one or two speakers at a time instead of a whole system – and remove the need to run any cables from an AV receiver to the speakers, which is something that can scare off any newcomers to the world of high-fidelity home theater setups.",
    "In some ways, it’s very similar to what Sonos does with its lineup of speakers, which allow you to build up a multi-room setup over a number of years and has found real success with that strategy. That said, the difference is that Sonos typically makes its own speakers while DTS licenses out the technology to other manufacturers.",
    "Regardless, DTS’s intent seems to focus on offering consumers a convenient way to dip their toes into surround sound audio without having to worry about wasting any single component. On paper, at least, it all sounds like a great idea."
  ],
  "headers": {
    "4": "Analysis: DTS Play-Fi Home Theater is like Sonos, but built right into your TV"
  },
  "links": {
    "AV receiver": "https://www.techradar.com/news/best-av-receiver-2017-which-home-cinema-av-receiver-should-you-buy"
  }
}