{
  "source": "https://www.techradar.com/news/apple-airtags-might-have-a-major-flaw",
  "title": "Apple AirTags might have a major flaw",
  "category": "phones",
  "updated": "2021-04-30T17:12:05Z",
  "author": "tom-bedford",
  "summary": "A flaw regarding floors",
  "article": [
    "If you're considering buying the new Apple AirTags location trackers, you might first want to consider where you live - reports suggest the tags aren't working too well in buildings with loads of floors.",
    "This was first raised by XDA Developers, in that site's review of the AirTags, which noted issues with the elevation aspect of the product - but this flaw could be wider-reaching than the review notes.",
    "The review states \"If I’ve misplaced my keys with an AirTag key ring on one floor (say, the gym) and I’m on another floor, my iPhone will not be able to use Precision Finding (because the phone is too far away). If I use general tracking, it’ll tell me the AirTag is in my current building - and that’s it.\"",
    "So the AirTags won't accurately recognize which floor of a building you're on - likely because they're designed to be used on Apple's 2D or 2.5D maps. The review goes on to say \"I concede my living situation is unique\" as if to suggest the altitude problem isn't a huge deal for wider audiences. But depending on what you do for a living, or your normal habits, it really could be.",
    "While the XDA Developers report suggests the AirTags don't work well in a multi-story high-rise apartment, based on this problem, there are loads of other situations in which issues could arise.",
    "For example, if you work in an office with multiple floors and rooms, are staying at a large hotel, or are attending (or working at) a hospital, school, government building or similar, you'll also have issues locating your AirTags with your iPhone.",
    "Since these are all places you could get anxious about losing your possessions - losing your bag in a hotel, or misplacing something in your work's office, can be a frequent occurrence for some - they're arguably the times AirTags really need to work right.",
    "The locational issues with Apple's AirTags aren't their only flaws - they're expensive, don't work with Android phones.",
    "But hopefully, if this geographic problem gets fixed, the AirTags will be useful for a few more people."
  ],
  "headers": {
    "4": "Diversity of life"
  },
  "links": {
    "Apple AirTags": "https://www.techradar.com/reviews/apple-airtag-review",
    "XDA Developers": "https://www.xda-developers.com/apple-airtags-review/"
  }
}