{
  "source": "https://www.techradar.com/news/league-of-legends-mobile",
  "title": "League of Legends: Wild Rift release date, beta and everything you need to know",
  "category": "phones",
  "updated": "2021-03-29T15:19:32Z",
  "author": "david-lumb",
  "summary": "League of Legends mobile release date for beta is live in the US",
  "article": [
    "Riot Games is slowly launching a beta for the mobile version of its global blockbuster hit, League of Legends. While this version of the game – called League of Legends: Wild Rift – has some slight changes to work on smartphone touchscreens, it still keeps the core MOBA gameplay intact and playable on the go.",
    "That’s the intention, though not all players have gotten to try the game out yet: after a closed beta launched in Southeast Asian countries in September, an open beta followed that's been slowly rolling out to other regions around the world – including the US, which went live on March 29.",
    "And now we know something else: Wild Rift is coming to consoles, too – though that's far off in the future.",
    "We still don't have a Wild Rift release date for the full game on mobile. When the Wild Rift beta reaches more regions, players will find gameplay that’s a bit abridged from the MOBA that’s dominated desktop gaming and esports leagues for the last decade-plus.",
    "Wild Rift is optimized to make the game work on much smaller smartphone screens – which also means touch controls and slightly shorter 15-20 minute rounds that suits phone gaming better than standard League matches that regularly last twice as long (or longer). Champions from League PC are slowly being added, though some have been tweaked for mobile play, and there’s a new map that revamps the classic Summoner’s Rift.",
    "Thanks to regular developer videos and open betas, we know a lot about Wild Rift. If you aren’t in an open beta region yet, you can pre-register for the game right now on Android (not iOS yet, except very limited testing). Below is everything we’ve heard about the game so far.",
    "We don’t know the League of Legends: Wild Rift release date for the full version of the game, it's far enough along to have open betas in much of the world, which is a good sign. Wild Rift was first introduced in October 2019 as part of Riot Games’ 10th anniversary celebration of League of Legends’ debut, and in mid-2020, we heard the game was being tested in an early alpha in two regions: Brazil and the Philippines.",
    "Wild Rift had a Regional Closed Beta in September 2020 in several Southeast Asian countries including the Philippines and Indonesia, followed by an open beta that's been ongoing in Malaysia, Indonesia, Singapore, South Korea, and Japan. By the beginning of 2021, the open beta had begun to roll out to Europe and the Americas on March 29, but we haven’t heard about Wild Rift a release date.",
    "As for Wild Rift’s price, we doubt it will cost anything to start the game. Like the base League of Legends game, the mobile version will be free-to-play, with in-game microtransactions funneling money for champion unlocks and new cosmetics to the company.",
    "The open betas have some microtransactions integrated in the game: while players will get introductory champions just for playing, other champions and skins can be paid for via in-game currency (Wild Cores) bought with real money – even in the closed betas. After the betas, all accounts will be wiped and microtransaction value will be refunded with a 20% bonus as Riot’s ‘thank you’ for testing the game.",
    "Riot assures that no champions will be microtransaction-only nor will there be pay-to-win stat boosts. For free-to-play players, there’s an in-game currency called Poro Coins to unlock cosmetics like emotes and skins.",
    "It’s always possible that Wild Rift’s monetization plans get affected by the current turmoil around mobile purchases, primarily regarding Epic and Apple’s legal spat around in-app purchases and third-party stores on phones. We’ll have to see how that plays out to know for sure.",
    "Wild Rift launched its first official closed beta in September, which rolled out to players in the Philippines, Indonesia, Singapore, Malaysia, and Thailand, according to a Riot blog post and video (above). The beta launched primarily on Android, though there was a very limited iOS beta, too. This beta was expected to run for a few weeks.",
    "An open beta followed in late October 2020, but again, it was only available in the previous Southeast Asian countries, as well as Japan and South Korea. This beta did allow players in certain regions to link their Wild Rift accounts with existing Riot accounts for extra in-game rewards.",
    "Riot planned to expand the open beta to Europe, Taiwan, Oceania, and Vietnam in the first week of December 2020, as well as select players in Russia, Turkey, the Middle East, and North Africa. The open beta would finally come to the Americas in March 2021 – and to make up for the later launch, Riot will give players in the region a way to rapidly build up their champion pool to compete with those who’ve been able to play for longer.",
    "Keep in mind that the September closed beta had player account progression wiped at some point, so even when you do get access to a beta, you may not be able to keep all you’ve earned when it’s fully launched later. Riot did assure players that any Wild Core (the mobile game’s version of RP) microtransactions would be returned after the reset with a 20% bonus.",
    "Thanks to several official tweets, early gameplay footage, and developer videos, we know a lot about Wild Rift.",
    "We do know minimum specs – or at least what Riot Games speculated back in May 2020 that they would end up being. According to a tweet from the official Wild Rift account, at launch, the studio believes Wild Rift’s minimum specs will be Android phones with 1.5GB of RAM, a Snapdragon 410 chipset, Adreno 306 GPU, and 32-bit Android processor support, as well as iPhone 6 handsets and newer.",
    "That minimum spec has been raised a bit for the closed beta tests (4-core chipset for Android and 1280x720 display resolution, iPhone 7 or above), but optimization could bring this down for the full release.",
    "We got more info about the game when the closed beta launched in September 2020. Per a developer video, the game has a similar Ranked system as base League of Legends: it unlocks at rank 10, after which players are seeded into ranked tiers from Iron to Challenger. The lower tiers below Master will have four divisions, and the new Emerald tier sits between platinum and diamond, for better player distribution.",
    "There are two stages to climbing the Ranked ladder. From the lower Iron to Emerald rank tiers, every win gives players a Ranked Mark, and every loss takes one away. But don’t worry -- as you play, you’ll build a Ranked Fortitude meter that, when filled, protects against one point lost when you lose a game. Gain enough Ranked Marks and you’ll climb higher.",
    "Diamond and above tiers use a Victory Point system, much like League of Legends’ League Point system. You can queue in 1, 2, 3, or 5-person parties, and will be matched with players of similar skill.",
    "Other than Ranked, Wild Rift is slowly introducing other modes, including the All Random, All Mid (ARAM) mode popular on League PC, which is slated to come later in 2021.",
    "As of the September 2020 closed beta and its developer video, champions will be unlocked two ways: earning and microtransactions. Players will start with an introductory set of base champions they earn by playing the game and leveling up. While playing, they’ll also get in-game currency called ‘blue motes’ which can be spent to unlock other champions. Along with the ‘free champion rotation,’ which lets players use a select roster of heroes that periodically rotates, the game should be somewhat playable for free.",
    "Wild Rift looks and plays much like League of Legends: an isometric game following your champion as you control them around the map to fight waves of enemies, destroy towers, and kill the other side’s champions. Of course, as it’s played on mobile, there are myriad buttons on the right side for attacks, abilities, and items; players move around by tapping and holding the left side of the screen.",
    "These controls will almost certainly be tweaked over the course of the beta tests; already, the Wild Rift team added a semi-lock camera function to pan player view around the map – great for checking just beyond line-of-sight when waiting in ambush or scouting territory. There’s also an option to automatically pan the camera down the path of long-ranged skillshots. There are similar options to better aim global ultimate abilities.",
    "Champions may get adjusted, too, if their playstyle doesn’t translate well to so-called ‘twin-stick’ controls. In early January 2021, a developer video explained the tweaks made to Katarina when adapting her to mobile play – specifically to her ultimate, which was easy to cancel out of when adjusting movement, so they changed it to allow slow movement and repositioning. Likewise, Ramus got a brand-new ultimate better suited to twin-stick movement.",
    "As previously mentioned, players will earn champions by playing the game, while others can be bought with in-game currency accumulated over time or bought with microtransactions. No champions will be gated behind real money purchases.",
    "Thanks to developer videos, we have an early champion pool, who are already in the open beta and will likely launch with the game. This champion list already boasts a number of heroes from League PC: Ahri, Akali, Amumu, Ashe, Corki, Darius, Draven, Evelynn, Garen, Jax, Janna, Jarvan, Kai’Sa, K/Da, Katarina, Kennen, Lee Sin, Lulu, Miss Fortune, Dr. Mundo, Ramus, Seraphine, Singed, Sona, Teemo, Tristiana, Varus, Wukong, Yasuo, Zed, and more.",
    "Given Darius, Draven, and Wukong were introduced to the game’s open beta players in a so-called Lore Event (called the Noxian Brotherhood, of course), it’s likely that some future champions will debut this way. Not only did the event offer lore via comic panels and themed accessories, players could complete missions to unlock either champion for free.",
    "Riot plans to introduce two new champions per month, though it’s not clear if they’ll all get events. The first will be the Lunar New Year-themed Lunar Beast event in February, which is planned to crossover with the same event in League PC. One of the heroes added to Wild Rift, Miss Fortune, will get a skin unique to the mobile version."
  ],
  "headers": {
    "6": "Wild Rift price and release date",
    "12": "Wild Rift beta",
    "16": "Wild Rift specs, Ranked,and unlocks",
    "24": "Wild Rift features, gameplay and champion pool"
  },
  "links": {
    "League of Legends": "https://www.techradar.com/how-to/league-of-legends-a-beginners-guide",
    "coming to consoles": "https://www.techradar.com/news/wild-rift-questions-answered-how-league-of-legends-mobile-plays-on-phones",
    "introduced": "https://www.techradar.com/news/league-of-legends-is-coming-to-mobile-phones-heres-how-to-pre-register",
    "heard": "https://www.techradar.com/news/league-of-legends-mobile-game-to-launch-an-alpha-test-in-june",
    "Epic and Apple’s": "https://www.techradar.com/news/apple-vs-epic-games-trial-dates-details-and-what-is-freefortnite",
    "blog post": "https://www.riotgames.com/en/news/lol-wild-rift-regional-closed-beta",
    "video": "https://youtu.be/_0yVXXuF1xk",
    "speculated": "https://www.techradar.com/news/league-of-legends-mobile-game-to-launch-an-alpha-test-in-june",
    "tweet": "https://twitter.com/wildrift/status/1261310370595160064"
  }
}