{
  "source": "https://www.techradar.com/news/check-out-this-rtx-3080-rig-with-absolutely-no-active-cooling",
  "title": "Check out this RTX 3080 rig with absolutely no active cooling",
  "category": "computing",
  "updated": "2021-02-17T22:06:22Z",
  "author": "bill-thomas",
  "summary": "Who needs fans, anyway?",
  "article": [
    "The Nvidia GeForce RTX 3080, no matter how hard it is to find right now, is an incredible graphics card – even if it requires a ton of power and cooling to effectively run. How would it work with absolutely no fans, though?",
    "Quite well, apparently. A completely fanless PC build equipped with an RTX 3090 and an AMD Ryzen 5 5600X has appeared on Twitter, courtesy of Mical Wong of @Turemetal, which specializes in fan-less PC builds and cases.",
    "Fanless PCs are cool, but not especially rare, at least before you start trying to work in high-end PC components. The Nvidia GeForce RTX 3080 has a standard total graphics power (TGP) rating of 320W, but in our experience will regularly use more than that under heavy loads. Even with Nvidia's downright futuristic cooler in its Founder's Edition, temperatures can still peak around 77°C - 80°C.",
    "The video that Mical Wong shared shows that the graphics card being used is the Asus GeForce RTX 3080 TUF Gaming OC. Specifically, that version of the graphics card, with its default 3-fan cooler, peaked at 61°C when we reviewed it in September 2020.",
    "But apparently, even when power spikes up to 410W for the whole system (with 347W for just the RTX 3080 alone) in Furmark, the graphics card still sits at around 87°C. If you don't know what Furmark is, it's often described as a \"power virus\", and graphics cards manufacturers routinely advise people against using it, as it pushes GPUs extremely hard. Basically don't try this at home.",
    "So, while 87°C is certainly a high temperature, it's still below where the graphics card would start to throttle. And, in a program that's built to test the absolute limits of a graphics card's thermal solution, it's impressive that a completely passively cooled card can survive at all.",
    "Via Tom's Hardware"
  ],
  "headers": {},
  "links": {
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "graphics card": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "@Turemetal": "https://twitter.com/turemetal",
    "Asus GeForce RTX 3080 TUF Gaming OC": "https://www.techradar.com/reviews/asus-geforce-rtx-3080-tuf-gaming-oc",
    "Via Tom's Hardware": "https://www.tomshardware.com/news/passive-rtx-3080-build"
  }
}