{
  "source": "https://www.techradar.com/news/tim-cook-states-that-apple-isdefinitely-looking-at-cryptocurrency-and-nfts",
  "title": "Tim Cook says Apple is 'definitely looking at' cryptocurrency and NFTs",
  "category": "computing",
  "updated": "2021-11-10T12:40:49Z",
  "author": "jess-weatherbed",
  "summary": "A tad cryptic, but that's in keeping with the theme",
  "article": [
    "It's pretty hard to avoid talk of cryptocurrency these days, and with all the buzz it looks like even the tech giant Apple wants to get involved.",
    "As reported by TechCrunch+, Tim Cook, CEO of Apple confirmed at the NYT Dealbook Conference, that the company is looking into Cryptocurrency, albeit with no fixed plans or details as to what that would entail. When asked if he personally owns popular currencies like Bitcoin or Ethereum, Cook confirmed that he did, stating that \"I think it’s reasonable to own it as part of a diversified portfolio”, though he was quick to add that he's not giving anyone financial advice.",
    "“I’ve been interested in it for a while. I’ve been researching it and so forth ... I think it’s interesting,” he added. While his curiosity appears to be from a personal perspective rather than that of the business, the idea that Apple itself would develop crypto services wasn't entirely dismissed, though we're a good few years off seeing anything come to fruition.",
    "When journalist Andrew Ross Sorkin asked during the interview if Apple Pay or other Apple applications would accept cryptocurrency in the future, Cook simply stated that crypto is “something that we’re looking at\", but did confirm that there are no plans to allow crypto to be used to buy Apple products.",
    "To further add to the woe or excitement (depending what side of this divisive fence you're on), when Cook was asked for his feelings on NFTs, he replied that he also finds them “interesting” but that “it will take a while to play out in a way that is for the mainstream person.”",
    "Take all this with a grain of salt as it doesn't confirm that Apple has any plans beyond simply investigating if both Cryptocurrency and NFTs will be a worthwhile investment, which is a fairly safe move for a Tech company of this scale.",
    "Given other large companies are getting involved, such as EA claiming that NFTs are part of the future of the games, and Tesla investing in Bitcoin (and previously allowing customers to purchase cars with the digital currency), ignoring the possibility that this really is the future of tech dealings wouldn't be wise.",
    "After all, if Blockbuster had bought Netflix when it had the chance rather than denying that streaming would overtake physical rentals then it might have survived. It pays to be overly cautious and keep adapting with the times.",
    "It might feel like NFTs and new cryptocurrencies are appearing like a flood, which can feel overwhelming but if one of the largest tech companies in the world (and one that prides itself on innovation at that) is playing things safe, then you shouldn't feel pressured to jump on board either. There's a good chance that all of this will have flopped in the next five years and something entirely new will be touted as the 'future of tech'."
  ],
  "headers": {
    "5": "Analysis: Times are moving fast"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "TechCrunch+": "https://techcrunch.com/2021/11/09/apple-is-looking-into-cryptocurrency-says-ceo-tim-cook/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAKEt3-S5jil4lgoowfa2xOwx4dCaHen5e5itCx-Z1HSg6-CwIML4hBvJAUSQE616jjQnIgQNPfLIbOYC6FolKo02Bj0i7oor9BnfTkaSmMZAAJwow_jjyejvK1fLO8fLxIqg7gSxPM85rC1dYzPNQclY5R3eb_eFFe2pFbzGZTe7",
    "NYT Dealbook Conference,": "https://www.nytdealbookconference.com/",
    "Apple Pay": "https://www.techradar.com/reviews/phones/mobile-phone-accessories/apple-pay-1264966/review",
    "NFTs": "https://www.techradar.com/news/what-is-an-nft-non-fungible-tokens-explained-and-why-you-shouldnt-dismiss-this-fad",
    "EA claiming that NFTs are part of the future of the games": "https://www.bbc.co.uk/news/technology-59167668",
    "previously allowing customers to purchase cars with the digital currency": "https://www.bbc.co.uk/news/business-57924354"
  }
}