{
  "source": "https://www.techradar.com/news/star-trek-picard-season-2-trailer-narrows-down-release-date",
  "title": "Star Trek: Picard season 2 trailer narrows down release date",
  "category": "entertainment",
  "updated": "2021-04-06T10:18:04Z",
  "author": "samuel-roberts",
  "summary": "Picard returns in 2022",
  "article": [
    "Star Trek: Picard season 2 will release in 2022, it's been confirmed, and the show is in full production. In addition, a new trailer for the show – which doesn't feature any characters appearing in person – reveals that The Next Generation's fan favorite character Q, again played by John de Lancie, will appear in Picard season 2.",
    "This was confirmed as part of a Paramount Plus presentation on the various Trek series. Star Patrick Stewart wouldn't say much about what's to come in season 2, other than that Jean-Luc would experience some serious trauma in the next set of episodes, but de Lancie was the big reveal.",
    "\"I wish I could sit here and blurt out to you all the new storylines, and situations and times that you're going to be seeing in this second season,\" Stewart says. \"Despite 178 episodes of TNG [The Next Generation] and four feature films, there are events coming up in season 2 that have never been seen before.\"",
    "\"Q's arrival is, as it often was, is unexpected. But it also comes at a shattering moment in the episode. And I do mean a shattering moment. Whether it's directly connected to Q or not, I'm not sure, but there is significant trauma. And in fact at the moment, I'm working on how the trauma of this moment hangs around Picard for quite a substantial part of the episode and then – there [Q] is.\" Certainly, de Lancie sounded delighted to get the call. Q most recently appeared in the animated sitcom Star Trek: Lower Decks, again played by de Lancie.",
    "Here's the teaser, which isn't short on classic Trek iconography:",
    "Hopefully we'll see Picard season 2 land early on in 2022. The show will release on Paramount Plus in the US, and is expected to launch on Amazon Prime Video in the UK.",
    "Season 1 of Picard worked hard to separate itself from the older Trek series in tone and storytelling, which would've worked more effectively if the show had a cast as likeable as TNG did. Unfortunately, not all of the crewmates of the La Sirena clicked for us, and the series struggled to make us as invested in their stories as we were in Picard's.",
    "That said, there's plenty of territory here for a great follow-up, and season 1 was relatively reserved when it came to big cameos from past Trek series – offering brief appearances from Brent Spiner's Data, Jonathan Frakes' Riker and Marina Sirtis' Troy, as well as a longer arc for Jeri Ryan's Seven of Nine.",
    "There's room to push that a bit further next year, for sure, and reintroducing Q seems like a step in the right direction."
  ],
  "headers": {
    "6": "What we want from Picard season 2"
  },
  "links": {
    "Star Trek: Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch"
  }
}