{
  "source": "https://www.techradar.com/news/the-iphone-se-3-tipped-to-get-5g-and-a-spec-bump-but-no-redesign",
  "title": "The iPhone SE 3 tipped to get 5G and a spec bump, but no redesign",
  "category": "phones",
  "updated": "2021-10-09T11:00:34Z",
  "author": "david-nield",
  "summary": "Here's what's coming, probably",
  "article": [
    "With the iPhone 13 now out in the wild, the iPhone SE 3 could be the next Apple handset to launch – and a new leak suggests that it's external design will remain largely unchanged, while a faster processor and 5G get added to the specs.",
    "That's according to sources speaking to Macotakara (via Gizmodo), a Japanese Apple blog that often gets hold of accurate information ahead of time. What makes the speculation even more credible is that we heard a very similar rumor about internal and external changes to the phone back in July.",
    "So the iPhone SE 3 will apparently get the same Apple A15 chip inside the iPhone SE and 5G connectivity, but also keep the existing 4.7-inch screen and the old Touch ID design, with a physical home button embedded in the bottom bezel.",
    "The report also suggests that the iPhone SE 3 will launch in spring in the northern hemisphere, which fits in with what we've seen before: the original iPhone SE appeared in March 2016 and its successor showed up in April 2020.",
    "Apple recently dropped the most expensive 256GB version of the 2020 iPhone SE from the models that it sells directly on its website, which suggests that an update is indeed on the way, even if we're going to have to wait several months for it to appear.",
    "There has been talk that the iPhone SE series is eventually going to get Face ID support and a notch of some description, but it now looks unlikely that the change is going to happen in time for the next refresh of the product.",
    "The future iPhone SE roadmap isn't quite as clear as it could be, because Apple now also makes a miniature version of its flagship phones. Although there were rumors that it would be canceled, the iPhone 13 mini did indeed appear on schedule in September 2021.",
    "That 5.4-inch handset makes us think that the long-rumored iPhone SE Plus – a larger version of the SE – isn't actually going to happen, at least not for a while. It would be one handset too many down at the more compact end of the iPhone range.",
    "The whispers and speculation from the supply chain have been that the iPhone 12 mini didn't sell particularly well, but if Apple follows up the iPhone 13 mini with the iPhone SE 3 then it would seem that there is a strong enough demand for these smaller smartphones for Apple to keep pushing them out.",
    "The next question is whether Apple will decide to put out a mini version of the iPhone 14 next year, or whether the iPhone SE 3 is going to be the only real option for those who want a compact iPhone. Sales figures for the iPhone 13 mini will no doubt play a big role in making Apple's mind up."
  ],
  "headers": {
    "3": "Ready for the spring",
    "6": "Analysis: what's the plan for Apple's smallest phones?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "Macotakara": "http://www.macotakara.jp/blog/rumor/entry-41868.html",
    "Gizmodo": "https://gizmodo.com/the-next-iphone-se-will-get-5g-but-not-a-redesign-1847825405",
    "back in July": "https://www.techradar.com/news/iphone-se-3-could-be-as-powerful-as-the-iphone-13-but-it-might-look-dated",
    "its successor": "https://www.techradar.com/reviews/iphone-se",
    "recently dropped": "https://www.techradar.com/news/iphone-ses-top-model-dropped-by-apple-so-is-the-iphone-se-3-on-its-way",
    "been talk": "https://www.techradar.com/news/iphone-se-3-and-all-new-ipads-could-get-face-id",
    "iPhone 13 mini": "https://www.techradar.com/reviews/iphone-13-mini",
    "iPhone SE Plus": "https://www.techradar.com/news/iphone-se-plus-release-date-might-not-be-for-a-long-time",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone 14": "https://www.techradar.com/news/iphone-14"
  }
}