{
  "source": "https://www.techradar.com/news/labyrinthine-is-the-hidden-co-op-horror-gem-you-need-to-play-this-halloween",
  "title": "Labyrinthine is the hidden co-op horror gem you need to play this Halloween",
  "category": "gaming",
  "updated": "2021-10-29T17:00:44Z",
  "author": "vic-hood",
  "summary": "Opinion: Welcome to the maze of horrors",
  "article": [
    "I should have known better. Everyone knows that nothing good comes from anything that involves a labyrinth - especially at night. This is the exact reason I don’t watch the Labyrinth movie (well that and the puppets). That’s right, this is bloody David Bowie’s fault.",
    "As I cautiously move forwards down the foggy, hedge-lined path ahead, with only a dim torch lighting my way, I ferociously drop pink glowsticks in hope that they’ll lead one of my friends to my location. We got split up some time ago but, due to having the navigational skills of rocks, we hadn’t been able to find each other again. Instead, we’re communicating over Discord - not that it helps. This labyrinth we’re trapped in is full of routes that look the same and our method of dropping glowsticks everywhere we go becomes redundant when half of the maze is covered in the pink glowsticks - we would perish in an apocalypse.",
    "Finally, a light at the end of the tunnel - literally. I see a shrine made of skulls and candles in the middle of a crossroads, beside it sits one of the five Seals we need to secure our escape. “Got one”, I excitedly relay over Discord. But the excitement is cut short. Thump. Thump. Thump. Oh no. “It's coming,” I scratch down the microphone as I bolt down one of the routes off the crossroads. Dead end. “Oh sh**”. The thumping gets louder and I prepare myself for slaughter as the source of the sound corners me: Mean Groot, I call him, a clubfooted creature that stalks the labyrinth. One swipe and I’m down, bleeding out. I call to my friends but all they can do is giggle in glee. I really wish I could find them, after all, they are the ones that convinced me to play Labyrinthine. Plus, it’s hard to wring their necks from so far away.",
    "Labyrinthine is a co-op horror that’s currently in Early Access on Steam. While the game is undoubtedly rough around the edges due to its Early Access status, it’s perfect for those looking for a terrifying thrill this Halloween - and it’ll cost you less than $10/£10.",
    "The point of Labyrinthine is pretty straightforward, you play in teams of between one and four players (I suggest as many as possible), with the aim being to complete puzzles within a labyrinth (surprise, surprise) in order to escape. Oh, and there’s at least one horrific creature patrolling the labyrinth that will happily gut you like a fish if it gets its claws/fangs/whatever into you.",
    "You can choose to team up in a public match with strangers or group up (like we do) in a private match with your friends. There is in-game voice chat but this is based on proximity. So, if you’re too far away from your teammates, you won’t hear them. I’m actually quite a big fan of the in-game chat, it’s similar to Phasmophobia in the isolation it creates when you’re separated (and the game will try and separate you), but we opt for Discord a lot because it stops us feeling too isolated (read: we are scaredy cats). Once you’re in a team you can then choose to play through the game’s chapters, which follow the story of fairground worker Joan, or through case files, which offer one-off procedurally generated maps to play.",
    "There are currently only six chapters available in Labyrinthine, given the game’s Early Access status, but each chapter is suitably terrifying and has creatures that are perhaps a bit smarter than the ones found in case files. The case files, at the time of writing, are limited in their setting and the creatures available, but their procedurally generated nature offers replayability. You gain experience for each labyrinth you complete, raising your experience level and opening up the possibility to take on more difficult cases - though we haven’t got above the easy difficulty yet.",
    "You also have the opportunity to pick up customization items for your characters in the mazes. Again, both the characters and customizations are limited at present, but you could pop a witch hat on your bearded security man so you look extra cute when the deer-headed monstrosity murders you.",
    "Labyrinthine has the staples that I personally look for in a good horror game. Jump scares? Check. Unsettling creatures? Yep. Puzzles? Definitely. The unshakeable fear of isolation? Most certainly.",
    "I’m sure there’s a way to play Labyrinthine more efficiently than myself and my friends do - though we do now have a color-coded system for glow sticks. But most of the fun is in our ineptitude in such a terrifying situation. On one occasion, we weren’t held up by the creature but by our inability to solve a Lights Out puzzle. Yes, we would be the first to die in a horror movie, and we’re not entirely ashamed of that.",
    "If you’re looking for a game to play with friends this Halloween weekend, then I suggest picking up Labyrinthine. Sure, it’s not totally polished right now but it has the potential to become an essential horror title. If you get in now, while it’s in Early Access, you don’t only pick it up for a decent price but can give feedback to the developers about what you want to see. For the love of God, just be careful with the glowsticks, ok?",
    "Labyrinthine is discounted on Steam until November 1."
  ],
  "headers": {
    "3": "What’s it all about?",
    "8": "Perfect Halloween spooktacular"
  },
  "links": {
    "Labyrinthine": "https://store.steampowered.com/app/1302240/Labyrinthine/"
  }
}