{
  "source": "https://www.techradar.com/news/zoom-will-fork-out-millions-to-settle-data-privacy-zoombombing-lawsuit",
  "title": "Zoom will fork out millions to settle data privacy, Zoombombing lawsuit",
  "category": "computing",
  "updated": "2021-08-02T15:53:13Z",
  "author": "anthony-spadafora",
  "summary": "Video conferencing giant has agreed to pay $86m to settle a class action lawsuit",
  "article": [
    "Zoom has agreed to pay $86m to settle a class action privacy lawsuit filled against the video conferencing firm last year.",
    "As reported by the BBC, the lawsuit alleges that the company invaded the privacy of its users by sharing their personal data with Facebook, Google and LinkedIn. At the same time though, it also accuses Zoom of failing to prevent hackers from Zoombombing users on its platform.",
    "While Zoom has denied any wrongdoing, the company has agreed to boost its security practices and according to the preliminary settlement, there is also a provision that it will provide its staff with specialized data handling and privacy training going forward.",
    "A company spokesperson commented on the security improvements Zoom has made to its platform in a statement, saying:",
    "\"The privacy and security of our users are top priorities for Zoom, and we take seriously the trust our users place in us. We are proud of the advancements we have made to our platform, and look forward to continuing to innovate with privacy and security at the forefront.\"",
    "The class action lawsuit was filed back in March of 2020 in the US District Court in the Northern District of California on behalf of both paid and free users of Zoom Meetings across the US.",
    "If the proposed settlement is approved by US District Judge Lucy Koh, subscribers in the class action lawsuit would be eligible for a 15 percent refund on their subscriptions or $25 depending on whichever is larger while free users could receive up to $15.",
    "While Zoom asked to court to dismiss the motion back in March of this year, Judge Koh only allowed for the part of case related to invasion of privacy and negligence to be dismissed.",
    "In addition to the $85m settlement, the lawyers representing the company's users also intend to seek $21.3m in legal fees from Zoom.",
    "Now we'll have to wait and see whether or not Judge Koh decides to approve the preliminary settlement to put this class action lawsuit to an end.",
    "Via BBC"
  ],
  "headers": {
    "5": "Zoom class action lawsuit"
  },
  "links": {
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "reported": "https://www.bbc.com/news/business-58050391",
    "Zoombombing": "https://www.techradar.com/news/zoom-bombing-is-now-a-federal-offense-in-the-us",
    "security improvements": "https://www.techradar.com/news/zoom-could-be-stealing-your-windows-password-hacking-your-webcam",
    "Lucy Koh": "https://www.techradar.com/news/world-of-tech/judge-refuses-to-make-us-apple-samsung-trial-any-longer-or-more-complicated-1090121",
    "BBC": "https://www.bbc.com/news/business-58050391"
  }
}