{
  "source": "https://www.techradar.com/news/official-realme-gt-pictures-have-us-forgetting-the-oneplus-9-is-coming",
  "title": "Official Realme GT pictures have us forgetting the OnePlus 9 is coming",
  "category": "phones",
  "updated": "2021-02-23T13:15:35Z",
  "author": "tom-bedford",
  "summary": "'Vegan Leather', our two favorite words.",
  "article": [
    "The next big launch in the smartphone calendar is the OnePlus 9, the next generation of OnePlus phones from the popular company, but you could consider us the distracted boyfriend in the titular meme, because a different upcoming smartphone has caught our eye - the Realme GT.",
    "As part of Mobile World Congress Shanghai, Realme just shared some pictures and specs of its brand-new flagship phone, the GT (so named after the 'grand tourer' type of sports car). The brand had previously teased it, but this mini-unveiling is the best look we've had at the new smartphone, ahead of its March 4 launch event.",
    "Realme has confirmed its GT smartphone will have the top-end Snapdragon 888 chipset, so it should be fast to use, and it'll also have a bespoke cooling system to stop the phone overheating as easily when you're using it.",
    "The main thing we've seen, though, is images of the phone - it seems it has a back clad in vegan leather (or faux leather, as many call it), and it's bright yellow, with a black racing stripe. Apparently, this stripe is of a different material to the rest of the rear, presumably glass, though that's not specified.",
    "Faux leather lets you enjoy the premium feel of 'standard' leather, without the ethical considerations of the traditional material.",
    "Realme previously showed off a picture of the phone in a different color option and material, and that silver model certainly isn't as distinct as this new version, so it's possibly the faux leather Realme GT is a special edition model or similar.",
    "Realme is a Chinese smartphone company that's still relatively new to the west, and it currently doesn't have a premium phone line, though evidently that's soon to change. The company typically puts out affordable and mid-range smartphones with commendable specs, so its GT line is definitely one to keep an eye on.",
    "The launch of a new smartphone line is always a big event - competition breeds innovation, and companies will only make great devices if they need to prove themselves. A new flagship line can therefore only mean good things for the whole phone market.",
    "While it remains to be seen if the Realme GT will prove a better phone than the OnePlus 9, the fact this smaller phone brand can draw our attention away from the heavyweights is a good sign.",
    "All eyes will be on the brand for the Realme GT launch on March 4, to see if this early hype is justified - we'll be covering the event and bringing you everything you need to know from it, so check back to TechRadar then."
  ],
  "headers": {
    "6": "Racing to keep up"
  },
  "links": {
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus phones": "https://www.techradar.com/news/best-oneplus-phones",
    "previously showed off a picture of the phone in a different color option": "https://www.techradar.com/news/realme-gt-revealed-in-first-official-photos-ahead-of-launch"
  }
}