{
  "source": "https://www.techradar.com/news/slack-set-to-introduce-stories-voicemail-substitute-and-more",
  "title": "Slack set to introduce 'Stories', voicemail substitute, and more",
  "category": "computing",
  "updated": "2021-03-29T13:55:42Z",
  "author": "mike-moore",
  "summary": "CEO details a number of Clubhouse-esque features coming to Slack",
  "article": [
    "Slack is planning to add a number of audio-focused new features as it looks to keep pace with platforms such as Clubhouse.",
    "Company CEO has Stewart Butterfield confirmed several new additions will be coming to the online collaboration platform as it looks to offer users a growing number of ways to stay in touch at work.",
    "Speaking in a Clubhouse discussion with Josh Constine's PressClub, Butterfield noted that the new features will include several additions that compete with other chat and collaboration apps.",
    "Among the new additions coming to Slack revealed by Butterfield is a feature for leaving audio messages for contacts on the service. Apparently already in beta testing, the tool is similar to that used on Telegram, and could be Slack's shot at killing off the traditional voicemail message for good.",
    "Slack will also soon look to offer drop-in conversation rooms where users can quickly enter and exit a chat without needing to schedule an official meeting or even make a call - similar to the increasingly popular Clubhouse app where Butterfield revealed these updates.",
    "Lastly, Butterfield said that Slack could be jumping aboard the video messaging background by adding \"stories\" similar to those seen on Instagram and Facebook. It's not known yet how exactly this will fit into Slack's workplace-themed approach, but the feature is reportedly in development now.",
    "Slack, which is the process of being acquired by CRM giant Salesforce for around $27.7bn, has seen user number surge over the past year due to the increase in remote working and need for greater online collaboration forced by the global pandemic.",
    "The company is now looking to increase its functionalities to users across the world as it aims to become a one-stop shop in helping workers and companies stay in touch.",
    "The news comes shortly after Slack was forced to pull a new direct messaging feature just hours after launch following concerns around its potential for harassment.",
    "The update to Slack Connect would have allowed any paid users of the online collaboration service to send a direct message (DM) to any other Slack user as long as they had their email address.",
    "However users were quick to point out that the feature could be used to message people without their consent, raising issues around harassment.",
    "Via Protocol"
  ],
  "headers": {
    "3": "Stories and more"
  },
  "links": {
    "Slack": "https://www.techradar.com/reviews/slack",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Josh Constine's PressClub": "https://constine.substack.com/p/taming-the-hybrid-work-chimera-tips",
    "CRM giant Salesforce for around $27.7bn": "https://www.techradar.com/news/salesforce-confirms-multi-billion-dollar-slack-takeover",
    "Protocol": "https://www.protocol.com/bulletins/slack-audio-features"
  }
}