{
  "source": "https://www.techradar.com/news/chromebooks-were-more-popular-than-macs-for-the-first-time-last-year",
  "title": "Chromebooks were more popular than Macs for the first time last year",
  "category": "computing",
  "updated": "2021-02-17T17:08:31Z",
  "author": "joel-khalili",
  "summary": "Remote working and e-learning drove a surge in demand for Chromebooks",
  "article": [
    "Devices running Google’s Chrome OS proved more popular than Apple Macs for the first time last year, new figures suggest.",
    "According to data from analyst house IDC, the pair were neck and neck in Q1, but Chromebooks began to pull away from Q2 onwards and ultimately captured 10.8% of PC sales in 2020, as compared with the 7.5% achieved by Apple.",
    "As the pandemic began to take hold in March, shipment data suggests buyer sentiment was skewed in favor of affordable Chromebook ranges, available from the likes of Acer, Asus, Dell, HP and Lenovo.",
    "Although Chrome OS devices outsold their macOS counterparts for the first time, both operating systems actually increased their share of sales last year, by 4.8% and 0.8% respectively. These gains came at the expense of Microsoft, with Windows accounting for 80.5% of device sales, down from 85.4% in 2019.",
    "The rise in popularity of Chromebooks highlights the significant effects of the pandemic on buying habits, especially where big ticket technology items are concerned.",
    "Apple’s computers sit at the very top end of the market, with many costing upwards of $1000 per unit. Meanwhile, with job losses and economic uncertainty placing a greater emphasis on affordability, some Windows devices failed to deliver sufficient bang for their buck.",
    "The transition to remote working and e-learning also played a major role in turning the tide, with Chromebooks benefiting from their status as effective student laptops.",
    "Overall, global PC shipments increased by 13.1% to more than 300 million units, which is a level of growth not seen since 2010. Lenovo was the PC vendor with the greatest market share (24.0%), followed by HP (22.4%) and Dell (16.6%).",
    "“Demand is pushing the PC market forward and all signs indicate this surge still has a way to go,” said IDC analyst Ryan Reith. “The obvious drivers for last year’s growth centered around work from home and remote learning needs, but the strength of the consumer market should not be overlooked.”",
    "“In retrospect, the pandemic not only fueled PC market demand but also created opportunities that resulted in a market expansion.”",
    "Via GeekWire"
  ],
  "headers": {
    "4": "Chromebooks on the rise"
  },
  "links": {
    "Apple Macs": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "affordable Chromebook": "https://www.techradar.com/news/should-i-get-a-chromebook",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "e-learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "student laptops": "https://www.techradar.com/news/mobile-computing/laptops/10-best-laptops-for-students-983385",
    "GeekWire": "https://www.geekwire.com/2021/chromebooks-outsold-macs-worldwide-2020-cutting-windows-market-share/"
  }
}