{
  "source": "https://www.techradar.com/news/how-does-active-noise-cancellation-work-anc-headphones-and-earbuds-explained",
  "title": "How does active noise cancellation work? ANC headphones and earbuds explained",
  "category": "audio-visual",
  "updated": "2021-11-14T09:00:30Z",
  "author": "olivia-tambini",
  "summary": "Here’s the lowdown on noise-cancelling headphones",
  "article": [
    "Noise-cancelling headphones have exploded in popularity in recent years, thanks to advances in audio technology making it easier to silence the world around us.",
    "They’re super handy for a range of situations, allowing you to listen to your music or podcasts in relative peace, whether you’re in a busy office or on a noisy airplane. With so many brands producing their own versions of active noise-cancelling (ANC) headphones, it’s not hard to find one that will suit your taste, from over-ear cans to true wireless earbuds.",
    "But what exactly are you looking for in a pair of ANC headphones? With so many different models on the market, making the right choice to meet your personal needs can be a headache. Price is another consideration, since ANC headphones - generally costlier than their non-noise-cancelling counterparts - vary in price from budget-friendly to near extortionate. This means that it pays to be clued in on how the technology works and what kind of headphones or earbuds you should be considering.",
    "That’s why we’ve put together this guide on everything you need to know about noise-cancelling headphones, from the different methods manufacturers use to give you some peace and quiet, to the best noise-cancelling headphones you should buy.",
    "Noise-cancelling headphones are headphones that either completely or partially block the ambient sound in your environment. So, if you’re walking outside and there’s a gusty breeze, you won’t hear the sound of the wind rushing past your ears quite as intensely as you would with a normal pair of headphones. You might not even hear it at all, depending on what you’re listening to.",
    "These headphones are able to decrease the sound of various noisy things, like traffic, or people talking. Some can even dampen the low rumble in the cabin of an aircraft in flight. The amount of ambient noise these headphones can block depends on a number of factors, including the noise cancellation methods they use, their construction, and the loudness of your environment.",
    "There are two main methods of noise cancellation: passive and active. Most headphones - excluding bone conduction headphones, which don’t touch your ears at all - use the former, but headphones marketed as noise-cancelling use the latter.",
    "In passive noise cancellation - also known as passive noise reduction - a pair of headphones physically blocks environmental sound from reaching your ears. All headphones that sit on, in, or over your ears will do this to some degree.",
    "How successfully a pair of headphones passively block out noise depends on their design. A pair of over-ear headphones with generously padded ear cups will reduce the sound of your surroundings more effectively than a pair of open-back headphones that allow air to pass through the ear cups.",
    "Similarly, a pair of in-ear headphones with silicone or memory foam eartips that sit in your ear canal will block out more noise than in-ear headphones with a more open fit, like the Apple AirPods 3.",
    "Bone conduction headphones won’t give you any passive noise cancellation because they sit on your temples or cheekbones and transmit sound via vibrations, leaving your ears open to hear the world around you.",
    "While passive noise cancellation can be pretty effective, it’s active noise cancellation that you really want if you’re trying to listen to your music without any acoustic interruptions. Active noise-cancelling headphones utilize inbuilt microphones to digitally assess environmental noise and create 'anti-noise' frequencies that are incorporated into your music playback. This cancels out the sound of your surroundings using analog or digital filters.",
    "If that sounds a little confusing, just imagine a sound wave. Noise-cancelling headphones essentially create a mirror image - known as an ‘antiphase’ - of the sound waves generated by the world around you. If there’s a peak in the sound wave, that antiphase will have a trough.",
    "When these mirrored sound waves are played together, they cancel each other out, leading to silence. The more microphones a pair of ANC headphones has - and the more sensitive they are to picking up noise - the more environmental sound can be cancelled out.",
    "More expensive noise-cancelling headphones tend to have a greater number of these microphones, making them better at blocking out the sound of your surroundings - but some sounds will usually leak through anyway.",
    "Continuous sounds like the rumble of a subway car are fairly predictable, and easier for your headphones to cancel out. But very loud noises that happen suddenly, like an alarm, will probably still reach your ears. There’s also usually a bit of a delay in the noise cancellation being applied while your headphones scramble to create an antiphase to block out the sound wave.",
    "Some noise-cancelling headphones, such as the Bose Noise Cancelling Headphones 700, allow you to customize how much environmental sound reaches your ears, either by controls on the headphones themselves, or via an app. Others, like the Sony WH-1000XM4, can identify different types of sound and turn off noise cancellation accordingly - for example, if you speak out loud during a conversation, the XM4 will pause your music and amp up the amount of ambient sound passing into your ears.",
    "The best noise-cancelling headphones use both passive and active noise cancellation together. You can purchase some open-fit noise-cancelling earbuds, like the Samsung Galaxy Buds Live, but the absence of a snug physical barrier between the outside world and your ear canals means such constructions are less effective than models like the Bose QuietComfort Earbuds or the Apple AirPods Pro.",
    "If you value your peace and quiet, noise-cancelling headphones are definitely worth the money. They can be a lifeline for those that work in noisy environments, and if you travel regularly, they can let you grab a little shut eye on a long haul flight or train ride. They can also help make your music feel more immersive.",
    "Some people think that noise-cancelling headphones might be good for your hearing health. Noise-induced hearing loss that results from listening to music at loud volumes - particularly with in-ear models that sit close to the eardrum - is a big problem. According to the World Health Organization, nearly 50% of teenagers and young adults are exposed to unsafe levels of sound from personal audio devices.",
    "Since noise-cancelling headphones don’t allow as much outside sound in, you generally don’t need to turn up your music as high to enjoy it.",
    "As far as cost, you generally get what you pay for. As mentioned earlier, ANC models are usually more expensive than standard headphones and earbuds.",
    "That being said, you can buy budget-friendly noise-cancelling headphones; the JBL 750BTNC offer strong ANC, and cost $130 / £120 / AU$200 at launch (though they’re regularly discounted to much less).",
    "Our favorite noise-cancelling headphones, the Sony WH-1000XM4, are much more expensive, at $349 / £349 / AU$549, but we think they’re absolutely worth the money.",
    "Similarly, our favorite noise-cancelling earbuds are the Bose QuietComfort Earbuds, which cost $279 / £249 / AU$399; however, you can buy the EarFun Air Pro for just $80 / £70 / AU$120.",
    "The main downside to noise-cancelling headphones and earbuds is their biggest benefit: you can’t hear the world around you.",
    "That’s great if you’ve got your head down at work, but it can be dangerous if you’re walking down a busy street and you can’t hear oncoming traffic. Conversely, wearing noise-cancelling headphones while walking alone at night comes with its own pitfalls. We spoke to a number of Londoners about their headphones habits and found that many - mainly women - wouldn’t use noise-cancelling headphones in this environment due to safety concerns.",
    "Charlotte, 35, told us that she has “grown more mindful of the need to be aware of my surroundings, not only late at night, but on public transport, walking through quiet residential streets, and when running in parks”.",
    "“I now use in-ear wireless headphones, and as soon as I’m out onto the street I use one earbud only when listening to music. It’s largely due to fear of being assaulted, but on the milder end of the scale, it’s about being startled when approached. I really miss the immersive quality that noise-cancelling headphones provide, but it’s just not worth the risk”, she explained.",
    "But safety concerns don’t necessarily mean you can’t use noise-cancelling headphones. As we mentioned, some models allow you to adjust how much sound is blocked out, and many come with transparency modes, which use microphones to mix the sound from your environment back in with your music.",
    "Comfort can also be an issue. Some people find noise-cancelling headphones to be physically uncomfortable. Early models of ANC headphones tended to create a closed-off sensation, and a feeling of pressure inside the ears. Since then, many manufacturers have incorporated pressure-relieving air vents into their designs and this fix generally mitigates the sensation of pressure. Of course, there are still those who will never find noise-cancelling headphones completely comfortable, and that comes down to individual anatomies and how the brain interprets changes in frequencies we can hear.",
    "Aside from those issues, the final major downside to noise-cancelling headphones is that they can affect the sound quality of your music. This is particularly true if you’re listening to music in a quiet environment, like at home - you’ll probably prefer to turn off the ANC altogether. However, if you’re on a noisy train, your desire to reduce environmental sound and hear your music will far outweigh the nuisance of any digital disturbance caused by your ANC headphones’ anti-noise frequencies.",
    "We’ve tested lots of noise-cancelling headphones over the years, and they come in all shapes, sizes, and prices. Here are three of our top picks:",
    "The Sony WH-1000XM4 deliver excellent noise-cancellation and surprising sound quality all in a lightweight, comfortable design.",
    "While they don't look significantly different from their predecessors, the Sony WH-1000XM3, a number of new features including multipoint pairing, DSEE Extreme upscaling, conversational awareness and auto-play/pause using a built-in sensor all help the WH-1000XM4 claim the title of best headphones in 2021.",
    "By every possible metric, the Sony WH-1000XM4 is a wonderful pair of wireless noise-cancelling headphones. They deliver exactly what they promise and then some thanks to their exceptional noise cancellation and cutting-edge codec support.",
    "On top of the adjustments listed above, the Sony WH-1000XM4 support Sony’s 360 Reality Audio format that enables spatial audio on stereo headphones plus the LDAC codec that can send a bitrate of up to 990 kbps. The unfortunate bit there, though, is that it no longer supports aptX or aptX HD, so your Hi-Res Audio support mileage may vary.",
    "Read more: Sony WH-1000XM4 Wireless Headphones review",
    "It’s Bose’s second attempt at a set of true wireless headphones, and the QuietComfort Earbuds are leaps and bounds better than the older SoundSport Free. Not only is the design a lot better, but the noise cancellation is also exemplary. Sound quality is also really very good – albeit a touch less bassy as compared to Sony – with superb clarity. They’re incredibly comfortable and well balanced too, despite their bulky form factor.",
    "Read more: Bose QuietComfort Earbuds review",
    "JBL is a popular name in the world of headphones and Bluetooth speakers, and rightly so. Solidly dependable, consumers know what to expect from the brand – decent sound quality for a decent price.",
    "That's what we found with the JBL Live 650BTNC last year – and now, ready to take their place are the JBL Tune 750BTNC, a superior successor to the 650BTNC's as a high-spec and well-priced set of over-ear headphones.",
    "The JBL Tune 750BTNC sound great, look great, and they fit well. Reliable and easy to use, you might miss waterproofing and a few minor features – but at this price, it feels foolish to complain too readily.",
    "Read more: JBL Tune 750BTNC review"
  ],
  "headers": {
    "4": "What are noise-cancelling headphones?",
    "6": "Passive noise cancellation vs active noise cancellation",
    "18": "Are active noise-cancelling headphones worth buying?",
    "25": "Are there any downsides to noise-cancelling headphones and earbuds?",
    "32": "What are the best noise-cancelling headphones?"
  },
  "links": {
    "Noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "podcasts": "https://www.techradar.com/news/best-podcasts",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "best noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "bone conduction headphones": "https://www.techradar.com/news/best-bone-conduction-headphones",
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods 3": "https://www.techradar.com/reviews/apple-airpods-3rd-generation",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "noise-cancelling earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "Samsung Galaxy Buds Live": "https://www.techradar.com/reviews/samsung-galaxy-buds-live",
    "Bose QuietComfort Earbuds": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "noise-cancelling headphones might be good for your hearing health": "https://www.techradar.com/news/how-a-pair-of-noise-cancelling-headphones-could-protect-your-hearing",
    "World Health Organization": "https://apps.who.int/iris/bitstream/handle/10665/154589/9789241508513_eng.pdf",
    "JBL 750BTNC": "https://www.techradar.com/reviews/jbl-tune-750btnc",
    "EarFun Air Pro": "https://www.techradar.com/reviews/earfun-air-pro",
    "We spoke to a number of Londoners about their headphones habits": "https://www.techradar.com/news/walking-alone-at-night-choosing-the-right-headphones-could-help-you-feel-safer",
    "the brain interprets changes in frequencies we can hear": "https://www.howtogeek.com/423960/why-do-noise-canceling-headphones-hurt-my-ears/",
    "Sony WH-1000XM3": "https://www.techradar.com/reviews/hands-on-sony-wh-1000xm3-wireless-headphones-review",
    "Hi-Res Audio": "https://www.techradar.com/news/hi-res-audio-everything-you-need-to-know-about-the-lossless-music-codec",
    "Sony WH-1000XM4 Wireless Headphones review": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Bose QuietComfort Earbuds review": "https://www.techradar.com/reviews/bose-quietcomfort-earbuds",
    "Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "JBL Live 650BTNC": "https://www.techradar.com/reviews/jbl-live-650btnc",
    "JBL Tune 750BTNC review": "https://www.techradar.com/reviews/jbl-tune-750btnc"
  }
}