{
  "source": "https://www.techradar.com/news/clubhouse-data-breach-13-million-users-have-info-leaked-online",
  "title": "Clubhouse data breach: 1.3 million users have info leaked online",
  "category": "computing",
  "updated": "2021-04-12T10:09:29Z",
  "author": "balakumar-k",
  "summary": "But company denies claims it was hacked",
  "article": [
    "Chat app Clubhouse has become the latest tech giant to suffer a major data breach after information on around 1.3 million users was leaked online.",
    "CyberNews revealed that an SQL database containing 1.3 million Clubhouse user records leaked for free on a popular hacker forum.",
    "The info in the SQL database contains the likes of User IDs, name, photo URL, username, Twitter handle, Instagram handle, number of followers, and the number of people followed by the user.",
    "However Clubhouse has hit back at CyberNews' claims, saying that it was, \"misleading and false.\"",
    "\"Clubhouse has not been breached or hacked,\" the company said in a tweet. The data referred to is all public profile information from our app, which anyone can access via the app or our API.\"",
    "This suggests that the breached data doesn't include sensitive information such as a password or an email address, which could be more damaging.",
    "However the information could still be used to target Clubhouse users with phishing attacks or other kinds of social engineering assaults.",
    "This is not the only security scare at Clubhouse, with the app having to upgraded its security recently over concerns threat actors in China could potentially spy on users.",
    "Clubhouse users have been advised to avoid suspicious messages and connection requests from strangers, and have also been told they should reset account passwords immediately.",
    "The news comes shortly after similar leaks in which a collective total of over one billion profiles were hacked.",
    "Recently, a cache of 500 million LinkedIn profiles was published online, and before that it was Facebook that bore the brunt after an incident affected 533 million users across 106 different countries, exposing personally identifiable information (PII) such as names, email addresses, phone numbers and more.",
    "Via CyberNews"
  ],
  "headers": {
    "3": "Clubhouse breach"
  },
  "links": {
    "Clubhouse": "https://www.techradar.com/news/clubhouse-for-pc-isnt-a-thing-that-download-is-actually-malware",
    "tweet": "https://twitter.com/joinClubhouse/status/1381066324105854977",
    "upgraded its security": "https://www.techradar.com/news/clubhouse-ups-security-protection-following-hack-worries",
    "500 million LinkedIn profiles": "https://www.techradar.com/news/half-a-billion-linkedin-users-have-scraped-data-sold-online",
    "Facebook that bore the brunt": "https://www.techradar.comk/news/facebook-says-it-wont-notify-users-caught-up-in-data-breach",
    "CyberNews": "https://cybernews.com/security/clubhouse-data-leak-1-3-million-user-records-leaked-for-free-online/"
  }
}