{
  "source": "https://www.techradar.com/news/jupiters-legacy-season-2-how-season-1s-shock-ending-could-set-up-a-darker-storyline",
  "title": "Jupiter's Legacy season 1's shock ending could set up a darker storyline",
  "category": "entertainment",
  "updated": "2021-05-14T18:36:41Z",
  "author": "tom-power",
  "summary": "Here’s what Jupiter’s Legacy’s big reveal means for Netflix’s superhero show",
  "article": [
    "Spoilers follow for Jupiter’s Legacy season 1.",
    "Jupiter’s Legacy is a superhero TV show that subverts viewers’ expectations on more than one occasion. There are numerous big twists throughout Netflix’s adaptation of Mark Millar and Frank Quitley’s comic books, but the series’ most shocking moment is reserved for the season 1 finale - and it’s an ending that hints at a darker narrative to come.",
    "Ahead of the release of Jupiter’s Legacy on Netflix, TechRadar sat down with Millar to discuss episode 8’s biggest moments, including that villainous turn, and how the finale’s events set up a potential Jupiter's Legacy season 2.",
    "Walter Sampson, aka Brainwave, isn’t the man (or superhero) that audiences thought he was. As the season 1 finale reveals, it’s Walter, and not George Hutchence, aka Sky Fox, who is behind the series' major mystery.",
    "As we find out, it’s Brainwave who cloned the supervillain Blackstar, with the latter killing a bunch of superheroes, including Tectonic, during episode 1’s major battle. That led to Walter’s nephew Brandon Sampson (Paragon) killing the Blackstar clone in order to save his dad - Sheldon Sampson (the Utopian), who is also Walter’s brother - and leads to Brandon breaking the Union’s ‘no killing’ rule. It’s a move that causes Sheldon to lash out at his son and forms a rift in their relationship.",
    "That’s not all. Brainwave is also the individual who frees the original Blackstar from his prison cell in the finale, which results in Sheldon further alienating Brandon after the duo team up to take Blackstar down. Sheldon hesitates when Blackstar, who is holding Brandon captive, baits Sheldon to kill him in order to save his son. Sheldon doesn’t as he wants to uphold the Union’s ‘no killing’ rule, which - after Blackstar is defeated - leaves Brandon feeling even more distant from his father.",
    "Ultimately, Walter’s plan is to destroy Sheldon and Brandon’s relationship until it’s irreparable. In doing so, he hopes to convert Brandon to his cause, overthrow Sheldon and the other superheroes, and install himself as the Union’s new tyrannical leader. This plays out in a similar way to the events of the comics, too, so long time Jupiter's Legacy fans won't feel that there's been a major departure from the source material.",
    "To cause further instability within the Union, Walter claims that Sky Fox, the world’s greatest supervillain, is the one behind Blackstar’s clone and who released the original from his cell. It’s a move that not only disguises his true intentions to those closest to him, but also to audiences.",
    "Why does Walter do this? For one, he's tired of his fellow superheroes doing nothing to actually save the world (more on this later). The main reason, however, is that he's jealous of Sheldon. Despite being the older brother, Walter has lived in Sheldon's shadow for over a century by the time we reach the TV show's present day setting. The constant sniping he received from George back in the 1920s and 1930s, as well as Sky Fox's banishment from the Union, also gives Walter a scapegoat on which to pin all of season 1's modern day events on.",
    "Fans of Millar and Quitley’s comics will know of Walter’s plan, but non-readers may be shocked by his villainous turn - and it’s one that Millar can’t wait for viewers to witness and react to.",
    "“I think it was almost a magician's trick, because there’s a sleight of hand [on Walter’s part], he explains. “You aren't looking at Walter; the whole time you’re thinking about Sky Fox because his name’s getting dropped as an external threat from episode one. Eventually, you realize that the threat is much closer to home, and I think that’s really interesting as a final episode twist.”",
    "Walter’s scheming against Sheldon isn’t the only familial betrayal in season 1’s finale. As we find out, Raikou - a telepath like Brainwave - is Walter’s daughter, and it’s the superpowered mercenary who is the audience’s way into finding out about Walter’s plan.",
    "Raikou is the one who reveals that he created Blackstar’s clone and whose subtle conversations with Brandon have started to turn him against his father. Raikou has no allegiance to the Union, but she knows that her father has turned on his own and plans to remove them by any means necessary.",
    "How does Raikou know this? Well, when Walter is ‘trapped’ inside the mind of Blackstar’s clone, it’s Raikou who uses her powers to stop him from being imprisoned forever. By keeping this psychic doorway open, Raikou determines what Walter’s plan is and tries to use it to blackmail him during a later conversation.",
    "That chat doesn’t end well for Raikou. As it happens, the pair’s tense discussions have occurred inside one of Brainwave’s mind palace scenarios. When the mirage ends, we see that he’s killed Raikou. It’s a grisly end for the telepathic assassin, but it shows how far Walter is willing to go in order to succeed with his plan. Comic book fans will also know there are other major shocking moments still to come, but we’ll refrain from spoiling them here in case Jupiter's Legacy gets a second season.",
    "While Walter is primed to be the TV show’s main antagonist in future seasons, Millar reveals that he does have some sympathy for him. Walter’s intentions, Millar claims, come from a good place, albeit one with extremely questionable methods and ideals.",
    "“Walter has noble intentions, but he's willing to do anything to get there,” Millar says. “Ultimately, like all the best bad guys, he thinks he’s right. He’s like ‘These superheroes have done nothing for 90 years. This planet is as messed up as it was in 1929 with the fiscal cliff we’re on, nationalism is on the rise and it’s a complete nightmare’. He thinks he’s got to stop these superheroes from letting it happen all over again, so he might have to take out a few people [to do so].”",
    "As for what Raikou’s death at her father’s hands means for the series moving forward, Millar stresses that it’s just the start of how dark Jupiter’s Legacy can get from this point on.",
    "“You know that any future story is going to go in a completely unpredictable direction, because nothing’s going to get in Walter’s way,” he says. “His own daughter’s death was actually a good way of showing his ruthlessness and single mindedness. You can also see why his plan would be attractive to the younger superheroes. It’s like Paradise Lost, where he’s like Lucifer whispering in the ears of the younger angels, so it [the TV show] is going to go to interesting places.”",
    "Those “interesting places”, which Millar alludes to, concern Jupiter’s Legacy season 2. Despite Millar’s assertions, in an interview with the Scotland Herald, that development on a second chapter is coming in 2022, the comic writer tells us that future instalments for the TV series would depend on how well it’s received by audiences.",
    "“We do have our little private chats,” Millar says when we ask about a potential season 2. “But the thing is it all depends on what people think. We hope it's as big as we think it's going to be, and we’re quite confident people are going to like it. So, fingers crossed, we get a second season.”",
    "Jupiter’s Legacy is available to stream in its entirety now on Netflix."
  ],
  "headers": {
    "3": "Jupiter’s Legacy season 1 ending explained",
    "11": "A death in the family"
  },
  "links": {
    "Jupiter’s Legacy": "https://www.techradar.com/news/jupiters-legacy-is-the-subversive-superhero-tv-show-netflix-needs-right-now",
    "Jupiter's Legacy season 2": "https://www.techradar.com/news/jupiters-legacy-season-2-release-date-plot-cast-and-more",
    "Scotland Herald": "https://www.heraldscotland.com/news/19271679.mark-millar-netflix-future-plans/"
  }
}