{
  "source": "https://www.techradar.com/news/stark-room-these-are-the-inspiring-winners-of-the-minimalist-photography-awards",
  "title": "Stark room: these are the inspiring winners of the Minimalist Photography Awards",
  "category": "cameras",
  "updated": "2021-08-05T12:03:04Z",
  "author": "mark-wilson",
  "summary": "Less is more, for these stunning photography award winners",
  "article": [
    "Sometimes the key to a great photo is knowing what to leave out of the frame – and the winners of the latest Minimalist Photography Awards 2021 have certainly showcased some inspiring examples of that particular skill.",
    "The awards, which are a non-profit run in association with the black & white Minimalism magazine, received over 3,700 entries from 39 countries for its 12 different categories. These include traditional ones like abstract, architecture and fine art, along with more modern categories like photo-manipulation.",
    "The winning entry, which you can see below, was from Australian fine art photographer Allen Koppe. His 'On Route' photo collection reflects his passion for \"finding ways of adding a level of graphic symmetry to the landscape\" and pocketed him a $2,000 cash prize.",
    "The awards weren't just open to those with traditional cameras either – an 'aerial' category celebrated the minimalist eyes of drone photographers, like the winning 'Pools from above' shots from Brad Walls. He used a DJI Mavic 2 Pro drone to capture his stunning shots of some immaculate swimming spots.",
    "Not all of them involved lots of post-production work either. The winner of the 'Night' category, Mihail Minkov, is a single long exposure shot taken on a Sony A7 III and the Sony 24mm f/1.4 GM lens.",
    "You can see that photo and all of the other category winners in our round-up below. And if you're looking for more inspiration on how to create your own minimalist beauties, check out our guides to the best photography projects you can try and how to take abstract landscape photos.",
    "Allen Koppe's 'On Route' series, which also won the competitions 'Fine art' and 'Conceptual' categories, came from his desire to \"discover a technique that had been sitting in the back of my mind for several years\". The Australian is a cinematographer by trade, you can certainly see that in his ability to create drama from seemingly everyday scenes.",
    "Koppe started on 35mm film cameras as a child, then moved onto the Pentax K1000 at aged 16, which he still has. He then moved from Canon DSLRs to Fujifilm's medium format GFX range, a favorite among landscape photographers, and says he particularly enjoys \"finding ways of adding a level of graphic symmetry to the landscape\".",
    "This means \"the resulting artworks are somewhat ambiguous, leaving room for you – the viewer – to explore and interpret in your own way.\"",
    "These stunning photos of starling murmurations were shot by Daniel Dencescu in a 120-second window in Rome. They capture the movements of over a hundred thousand birds, and weren't the result of a carefully planned shoot. \"I still remember my reaction when I saw it for the first time,\" he said. \"I had to quickly take my camera and start photographing it.\"",
    "The monochrome series, which won the 'Abstract' category of the Minimalist Photography awards 2021, came from Dencescu's desire to \"reveal the hidden beauty of common things, shown from an unusual perspective of an elegant dance.\" They're also a great lesson in removing unnecessary clutter from the frame, including color, if you have a striking subject.",
    "Brad Walls describes himself as a \"fine art aerial photographer\", a relatively new genre that's been boosted by the availability of drones like the DJI Mavic 2 Pro.",
    "His 'Pools from above' series took a year to shoot, and his aim was \"to showcase the unseen beauty of swimming pools via an alternate viewpoint.\" He says that \"each pool has its own geometric profile and as such their own unique personality\", with the color schemes also bringing nods to artists like David Hockney.",
    "A self-described \"avid, amateur photographer\", Sandra Herber works as a librarian in Toronto, Canada by day, but spends \"all my free time (and disposable income) photographing in Canada and around the world\". Her series \"North Dakota Winter\" captures the bleakness of the area's winter months, but also the architectural evidence of current and past lives lived there.",
    "These shots show some old buildings from the ghost town of Arena, North Dakota, along with the grain elevators (which store and stockpile grain) during winter. Herber says here \"love of photography started in my teens when my mother gave me her old Pentax Spotmatic\", but that she \"only got serious (some might say obsessed) with photography around 2011\".",
    "Rosario Civello's 'Tree in a Square' shot is so minimalist he doesn't even reveal where the photo was taken. Still, that is unnecessary information for a shot that, as he says, aims to make sense of \"the space surrounding us that is often composed of numerous elements arranged chaotically.\"",
    "In the photo, he aims to \"visually deconstruct the scene, discarding the superfluous, so that it fits to my natural inclination towards minimalism.\" For Civello, who started to become interested in photography by the late 70s, it's clearly a lifelong passion and long may it continue.",
    "Long exposure photography is a great way to create minimalist frames that isolate the subject on an ethereal backdrop, and Vera Conley's' Signal' photo is a great example. It shows a simple structure on Lake Biwa, a large freshwater lake in Japan's Shiga Prefecture, which monitors the lake to track the effects of seismic and human activity.",
    "Describing her work, Vera Conley says that \"through the use of long exposures, I minimize the complications and distractions in a typical scene to extract the primary components of the story\". She's also a big fan of taking her photos to print, admitting that she \"geek outs on gorgeous textures of fine art paper and how it renders the image on print\".",
    "This winner of the 'Night' category shows that you don't necessarily need to composite several frames to produce a winning shot of the night sky.",
    "The subject is the submerged church Saint Ivan Rilski in Bulgaria and the photographer Mihail Minkov says it's a single shot take on a Sony A7 III with a Sony 24mm f/1.4 GM lens. Want the settings? It was taken at the lens' widest f/1.4 aperture, at ISO 1600 with a 13-second exposure.",
    "One of the inspiring things about minimalist and abstract photography is its ability to extract beauty from seemingly everyday scenes that would otherwise pass us by. That's the theme of Australian photographer Liz Barker's series 'Hidden in plain sight', which won the 'open' category in the Minimalist Photography Awards 2021.",
    "Liz Barker says: \"There are so many visual gems hidden in plain sight in our suburban and urban environments. We walk past them every day and are blind to them. My goal is to reveal them to those who want to see.\" The hidden gems in these photos are a shopping center car park exit, a suburban playground and the entry to a residential car park. Not obvious photographic subjects, but \"they scream to be seen by an appreciative eye\" she says.",
    "Photographer Francisco Riquelme-Montecinos was born in Chile but became a Canadian citizen in 2014, which lead him to take these almost Lego-style shots of Toronto's storefronts.",
    "He says the style of the series was \"actually born out of the pandemic\", because \"as the city shut down we become little islands disconnected from one another\". The same thing happened to the local stores, which \"had to continue navigating this new reality as lonely vessels in the middle of this social storm,\" he added.",
    "No stranger to winning photography contests, George Mayer has previously won the 'Portraiture' category of the Sony World Photography Awards in 2017. His 'Anima' series is inspired by the work of psychoanalyst Carl Gustav Jung, who \"believed that there was a feminine beginning, or female part of the psychic setup, in the subconsciousness of every man\". This was called 'Anima' (Latin for 'soul'), hence the project's name.",
    "The studio portraits show this in tension with the red circle, which is apparently a reference to the planet Mars. He says that \"Mars is associated with the aggressive masculine element\", but that in the photos his anima subject opposes it to help find inner harmony. Well, it sure beats our dog portraits for artistic rationale, though we're sure there are some nods to psychoanalysis in there, too.",
    "A lot of minimalist photography can sometimes sacrifice a human element at the expense of geometric precision, but Swedish photographer Jonas Dahlstrom has tried to combine both in his series titled '07:27:47'.",
    "Taken from a book project with the same name, his photos are \"sorted by the hour, minute and second of their exposure\", which helps them form a sequence that takes place during exactly 12 hours. He says he aimed it to be \"a study not only of the urban environment, but also of the relationship between this environment and the human being\". We'd say he's succeeded, and the judges of the Minimalist Photography Awards' 'Street' category agreed."
  ],
  "headers": {
    "6": "Minimalist Photographer of the Year 2021",
    "9": "Abstract winner"
  },
  "links": {
    "Minimalist Photography Awards 2021": "https://minimalistphotographyawards.com/",
    "best photography projects": "https://www.techradar.com/how-to/52-photography-projects-a-great-technique-to-try-every-week-of-the-year",
    "how to take abstract landscape photos": "https://www.techradar.com/how-to/photography-video-capture/cameras/77-photography-techniques-tips-and-tricks-for-taking-pictures-of-anything-1320768/2",
    "Sony World Photography Awards": "https://www.techradar.com/news/these-are-the-spectacular-winners-of-the-sony-world-photography-awards"
  }
}