{
  "source": "https://www.techradar.com/news/4k-vs-oled",
  "title": "4K vs OLED: which TV tech is more important?",
  "category": "televisions",
  "updated": "2021-09-18T13:00:44Z",
  "author": "jamie-carter",
  "summary": "OLED or 4K? We weigh-up the two most in-demand TV features",
  "article": [
    "If you find yourself asking whether 4K or OLED is the technology of the moment, you’re not alone. Anyone trying to buy a new television will be awash with new TV buzzwords, and of all of them perhaps the two most important to understand are OLED and 4K.",
    "So what’s it to be, OLED or 4K? Actually, you can have both. But you don’t need to. There are OLED TVs that don’t offer 4K (instead going for the far pricier 8K resolution) and there are plenty of 4K TVs available that don't use OLED display technology.",
    "However, most of the best 4K TVs are in fact OLED TVs, so it’s worth running through how the technologies intertwine, what specific models are out there, and why you should think about investing in either OLED and 4K – if not both.",
    "It’s not really a case of OLED versus 4K. The former is a display technology and the other is the resolution of most new TVs. You can find OLED TVs with 4K resolutions, yet there are many 4K TVs that use display technologies such as LCD, LED, Micro LED and QLED, which are nothing like OLED.",
    "Do you need 4K? Yes, probably. To plump for a lower resolution TV would be to ignore one of the most mainstream TV features of all. That’s not true of OLED, which is a flagship step-up TV display technology that requires a significant extra outlay. Yes, it’s becoming more affordable each year, but you should make an active decision to buy an OLED TV only after understanding why it’s the best AV tech out there.",
    "So let’s begin by investigating what’s so good – and bad – about OLED and 4K to help you make the right decision when buying a new TV.",
    "Available for over a decade in consumer TVs, Organic Light-Emitting Diode (OLED) is a display technology that uses a carbon-based film between two conductors that emits its own light when an electric current is passed through. Pixels are self-lit and individually controlled. That enables two pixels alongside each other to simultaneously produce deep black and bright white. The result is unbelievable contrast and colour, while such pixel-level control means high refresh rates, so no judder or motion blur. Once you’ve watched an OLED TV, it’s really hard to go back.",
    "On the downside, OLED TVs can appear a little dimmer than LED or QLED TVs, though new light sensors and new innovations for 2021 are improving how OLED TVs perform in bright environments.",
    "OLED TV panels are exclusively manufactured by LG Display in South Korea, though those panels are used in TVs sold by LG, Sony, Panasonic and Philips.",
    "Read more: What is OLED?",
    "A magnitude sharper than old ‘Full HD’ TVs, 4K resolution – also called Ultra HD – is shorthand for 3840x2160 pixels. That’s an 8-megapixel image as opposed to the 2-megapixel pictures from a Full HD set, making for a lot more detail in your images.",
    "With lots of TV channels now offering 4K feeds and Netflix and Amazon Prime showing 4K content, now is a good time to invest in a 4K TV.",
    "Read more: What is 4K?",
    "Where OLED and 4K compete is on price. You can easily buy a 4K TV – in fact, it’s now incredibly hard not to unless you go for a very small TV indeed – but if you’re going to get an OLED TV then it’s going to cost you.",
    "Most OLED TVs are flagship products of the big TV brands, or thereabouts. In the last couple of years that’s changed slightly, with the most expensive OLED sets on offer from the likes of LG, Sony, Panasonic and Philips boasting an 8K resolution.",
    "8K OLED TVs are out of the price range of almost everyone and, for now, simply loss-leader brand-extension products that we can all dream of having, but absolutely don’t need. That’s certainly not true for 4K OLED. Here’s what you need to know about the 4K OLED TVs currently available from the big brands.",
    "LG’s 4K OLED TVs for 2021",
    "The actual manufacturer of OLED display panels is always the most important brand to watch when it comes to finding an affordable 4K OLED TV. New for 2021 from LG are a clutch of 4K OLED TVs to tempt your wallets, from the affordable A1 4K OLED Series (48, 55, 65 and 77-inch) and LG B1 4K OLED (55, 65 and 77-inch) to the LG C1 OLED TV (48, 55, 65, 77 and an all-new 83-inch) and the flagship LG G1 4K OLED ‘Gallery Series’ (in 55, 65 and 77-inch) that offers all-new brightness-boosting tech called ‘OLED evo’.",
    "Sony’s 4K OLED TVs for 2021",
    "The famous Japanese company’s Bravia-branded 4K OLED TVs for 2021 comprise the A90J Series (83, 65 and 55-inch) – claimed to be the brightest OLED TV of all – and the A80J Series (55, 65 and 77-inch).",
    "Panasonic’s 4K OLED TVs for 2021",
    "New 4K OLED TVs for 2021 from Panasonic include the JZ980 (48, 55 and 65-inch), JZ1000 (48, 55 and 65-inch) with 30W of Dolby Atmos audio, and JZ1500 (48, 55 and 65-inch) built on its custom-made 'Master HDR OLED' panel. The flagship JZ2000 Series (55 and 65-inch) boasts an increase in peak brightness and HDR colour as well as 125W speakers with side-firing and upward-firing audio.",
    "Vizio’s 4K OLED TVs for 2021",
    "Buyers in North America have the best chance of getting hold of a 4K OLED TV for less than in Europe thanks to the huge Vizio brand. In 2021 Vizio is selling the 55-inch OLED55-H1 and 65-inch OLED65-H1. They’re the most affordable, budget-friendly OLED TVs around, with our review indicating that the downsides are limited brightness and poor upscaling.",
    "Philips’ 4K OLED TVs for 2021",
    "The Dutch brand is making available a bevy of 4K OLED TVs for 2021. Its OLED 806 is available in 48, 55, 65, and 77-inch sizes and includes a 50W 2.1 sound system. Its step-up OLED 856 Series in 55 and 65-inch sizes include a T-bar stand.",
    "OLED and 4K are both mature TV technologies, but with each passing year they’re getting better and more affordable – together. Established as the high-end TV display technology for AV enthusiasts, LG Display – the makers of OLED Panels – keeps innovating and in 2021 it presented its new 'OLED evo' brightness-boosting technology on LG’s G1 Gallery Series. Its LG Signature OLED R – a 65-inch 4K rollable display that disappears into a base – has also just become available, albeit for $99,999 / $99,999.",
    "OLED TVs are also on the cusp of going mainstream. Until recently OLED TVs have been expensive largely because they’ve only been available in big screen sizes; 55-inch, 65-inch, 77-inch and 88-inch, to be exact. The last year or so has seen the popularising of a new 48-inch size of OLED TV, which is helping to make this once high-end only display technology more affordable. Production has ramped-up in 2021 so expect to see some tempting deals on 48-inch 4K OLED TVs.",
    "A wallet-busting 83-inch size has also become available for 2021, an innovation that simultaneously has allowed the introduction of 42-inch 4K OLED TVs (you can cut an 83-inch panel into four 42-inch panels, after all). So expect to see even smaller, cheaper 4K OLED TV sizes in the future.",
    "If you buy an OLED TV it will come with 4K resolution. However, you need to want to buy an OLED TV, because there are myriad other TV display technologies out there. So go look at an OLED TV in a store, compare it with the LED and QLED TVs around and you’ll see that while OLED TVs may not be as super-bright as some of the other screens, it’s OLED that looks the best in terms of the 3D-like fluidity, contrast, deep blacks and lack of judder or motion blur.",
    "The TV tech mash-up of choice for anyone after the best picture quality, 4K OLED TVs are only going to get better and more affordable in the years to come."
  ],
  "headers": {
    "3": "Why OLED vs 4K?",
    "6": "What is OLED?",
    "10": "What is 4K?",
    "13": "4K vs OLED pricing: what do they cost?",
    "16": "What 4K OLED TVs are there?",
    "26": "The future of OLED and 4K technologies",
    "29": "Which one should I buy?"
  },
  "links": {
    "buy a new television": "https://www.techradar.com/how-to/buy-a-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "4K": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution#:~:text=8K%20is%20nothing%20short%20of,a%20total%20of%2033%2C177%2C600%20pixels.",
    "4K TVs": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1326405",
    "OLED TVs": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "Micro LED": "https://www.techradar.com/news/micro-led-tv",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "What is OLED?": "https://www.techradar.com/news/what-is-oled",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "What is 4K?": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "8K OLED TVs": "https://www.techradar.com/best/best-8k-tv",
    "New for 2021 from LG are a clutch of 4K OLED TVs": "https://www.techradar.com/news/lg-tv-2021",
    "A1 4K OLED Series": "https://www.techradar.com/news/lg-shakes-up-oled-tvs-with-new-83-inch-screen-size-and-a-budget-oled-range",
    "LG B1 4K OLED": "https://www.techradar.com/news/lg-b1-oled-price-release-date-specs",
    "LG C1 OLED TV": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "Bravia-branded 4K OLED TVs for 2021": "https://www.techradar.com/news/sony-tv-2021-every-master-series-and-bravia-oled-announced-so-far",
    "A90J Series": "https://www.techradar.com/reviews/sony-a90j-oled-tv",
    "4K OLED TVs for 2021 from Panasonic": "https://www.techradar.com/news/panasonic-tv-2021",
    "Vizio is selling the 55-inch OLED55-H1 and 65-inch OLED65-H1": "https://www.techradar.com/reviews/vizio-oled-4k-tv",
    "our review": "https://www.techradar.com/reviews/vizio-oled-4k-tv",
    "4K OLED TVs for 2021": "https://www.techradar.com/news/philips-tv-2021-every-oled-miniled-and-ambilight-tv-coming-this-year",
    "G1 Gallery Series": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "just become available": "https://www.prnewswire.com/news-releases/lgs-highly-anticipated-rollable-oled-tv-now-available-in-united-states-301335623.html",
    "48-inch": "https://www.techradar.com/best/48-inch-oled-tv",
    "42-inch 4K OLED TVs": "https://www.techradar.com/news/new-42-inch-oled-tvs-are-on-the-way-but-which-tv-brands-will-get-them"
  }
}