{
  "source": "https://www.techradar.com/news/tesla-roadster-may-finally-arrive-in-2023-but-will-it-be-the-quickest-car-in-the-world",
  "title": "Tesla Roadster may finally arrive in 2023 – but will it be the 'quickest car in the world'?",
  "category": "car-tech",
  "updated": "2021-09-02T13:17:11Z",
  "author": "axel-metz",
  "summary": "Get your skates on, Elon",
  "article": [
    "In a recent tweet, Tesla CEO Elon Musk has claimed that the new Tesla Roadster should finally start shipping in 2023 – \"assuming 2022 is not [a] mega drama,\" that is.",
    "The second generation Roadster has been a long time coming. Originally the world's first electric sports car, we tested the inaugural model all the way back in 2009, and have followed developments on its much-anticipated successor ever since Musk announced plans for a new version in 2017.",
    "In the years since that iPhone-esque reveal, we've seen the CEO launch a dummy Roadster into space and flirt with the idea of turning it into a hover car, but the new Roadster's arrival has long-been hampered by supply chain roadblocks and, more recently, the global chip shortage.",
    "Even though the electric sports car hasn't been close to mass-production since its announcement in 2017, Tesla has regularly made bold claims regarding the new Roadster's eye-watering credentials.",
    "For instance, the company asserts that the Roadster is \"the quickest car in the world, with record-setting acceleration, range and performance.\"",
    "According to Tesla, it boasts a 0-60mph acceleration of just 1.9 seconds, a top speed of over 250mph and a range of 620 miles – and that's just the Base model.",
    "A 'SpaceX' model will apparently see the car's 0-60mph time drop to just 1.1 seconds thanks to \"cold air rocket thrusters at the rear,\" which Musk claimed earlier this year would be positioned \"behind the license plate that flips down.\" We'll believe it when we see it.",
    "In fairness, even though it's not yet widely available on the road, there are videos aplenty showing the new Base Roadster in action, and it appears absolutely capable of reaching those aforementioned record-breaking speeds.",
    "When it does arrive, then, the Roadster should easily fend off competition from the likes of the Mercedes EQS, Porsche Taycan and Audi e-tron GT to become the most powerful electric car on the market, adding to the company's roster of already-impressive performance EVs (like the Model S Plaid).",
    "But if the second-generation Roadster does indeed launch in 2023, will a $200,000 price tag put off potential buyers? And at that point, will it still be the \"quickest car in the world,\" as Tesla claims?",
    "As for the former, the Roadster's high price is an unlikely deterrent. The company has already begun taking $50,000 deposits for the Base model, and $200,000 for a car that does 0-60mph in 1.9 seconds is not unreasonable considering the far-higher prices of slower (though by no means slow) supercars like the Lamborghini Aventador or McLaren 720S.",
    "The Roadster's status as the fastest road car on the market, though, may not be so assured.",
    "Premium manufacturers including Ferrari and Aston Martin have committed to producing electric supercars in the near future, while Lamborghini's much-lauded Terzo Millennio concept will almost certainly stake a claim to the title of quickest production car when it does eventually hit the road (though that’s looking more like 2030 than 2023).",
    "There's every chance that Musk's long-awaited Roadster successor will deliver on its promise of speed, range and world-beating luxury, but it needs to arrive soon if it hopes to lay down its record-breaking markers."
  ],
  "headers": {
    "9": "Pick up the pace"
  },
  "links": {
    "tweet": "https://twitter.com/elonmusk/status/1433115031940440065",
    "all the way back in 2009": "https://www.techradar.com/news/world-of-tech/techradar-test-drives-the-tesla-roadster-596060",
    "announced plans for a new version in 2017": "https://www.techradar.com/news/tesla-roadster",
    "iPhone-esque reveal": "https://www.youtube.com/watch?v=5RRmepp7i5g",
    "launch a dummy Roadster into space": "https://www.techradar.com/how-to/spacex-falcon-heavy-launch-elon-musk-tesla-roadster",
    "turning it into a hover car": "https://www.techradar.com/news/elon-musk-wants-to-make-the-tesla-roadster-a-hover-car-but-reality-may-get-in-the-way",
    "global chip shortage": "https://www.techradar.com/news/server-chip-shortage-could-drag-on-through-the-rest-of-2021",
    "Tesla": "https://www.tesla.com/en_GB/roadster",
    "drop to just 1.1 seconds": "https://twitter.com/BLKMDL3/status/1395236250588569600",
    "Musk claimed earlier this year": "https://twitter.com/elonmusk/status/1395435679128055808",
    "Mercedes EQS": "https://www.techradar.com/news/mercedes-eqs",
    "Porsche Taycan": "https://www.techradar.com/news/porsche-taycan-4s-review",
    "Model S Plaid": "https://www.techradar.com/news/crazy-fast-tesla-model-s-plaid-is-now-on-roads-and-it-plays-ps5-level-games",
    "Terzo Millennio concept": "https://www.techradar.com/news/yes-even-lamborghini-is-working-on-an-electric-supercar-but-youll-have-to-wait"
  }
}