{
  "source": "https://www.techradar.com/news/dell-xps-13-deals-feature-price-cuts-of-up-to-dollar500-pound299-in-the-us-and-uk-this-weekend",
  "title": "Dell XPS 13 deals feature price cuts of up to 25% in the US and UK this week",
  "category": "computing",
  "updated": "2021-02-09T12:44:00Z",
  "author": "alex-whitelock",
  "summary": "Excellent options on both sides of the pond",
  "article": [
    "Readers in the US and UK hunting for a new premium ultrabook will be well served by this week's Dell XPS 13 deals at the official store in both territories, which currently feature some pretty tasty price cuts of up to $350 / £300.",
    "In the US in particular, the latest Presidents' Day sale has seen Intel Core i7 equipped Dell XPS 13's drop down to just $849.99 right now. That's a total saving of $300 for a machine that's both fast and has a 512GB SSD. If you wanted a little more multitasking capabilities, you can also upgrade to 16GB of RAM for $899.99 - another excellent XPS 13 deal. Alternatively, you can get the very latest model for just $999 currently, which not only rocks that gorgeous near bezel-less display but also an 11th gen Intel Core i7 under the hood.",
    "In the UK, cheap XPS 13 deals are more limited this week, but, those looking for a great price on the very latest model will be pleased to see this £299 saving on a 2021 model for £1,069. Ok, so this is one pricey investment, but trust us - it's a worthwhile one if you're looking for a stunning laptop that packs in plenty of power. With an 11th gen Intel Core i5, 512GB SSD, and a gorgeous design that's unique to the latest model, this one's going to last you a few good years until you need to upgrade.",
    "We've just glossed over a few Dell XPS 13 selections but there's a couple of extra options we've included just down below for your consideration. If you're outside the US and UK, you can also find a selection of today's best prices at the very bottom of the page.",
    "For a more detailed look at the range, see our main Dell XPS 13 deals and Dell XPS 15 deals page. For some cheaper alternatives, we'd also recommend checking in on our roundup of this week's best cheap laptop deals."
  ],
  "headers": {
    "4": "Today's best Dell XPS 13 deals in the UK"
  },
  "links": {
    "Presidents' Day sale": "https://www.techradar.com/news/presidents-day-sales-deals-2021",
    "$849.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1144166445320108000/https://deals.dell.com/en-us/productdetail/7ahj",
    "$899.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9590902510554872000/https://deals.dell.com/en-us/productdetail/7ehn",
    "for just $999": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1221337882736807000/https://deals.dell.com/en-us/productdetail/7ehl",
    "for £1,069": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-1177116344850253300/https://deals.dell.com/en-uk/productdetail/7ebj",
    "Dell XPS 13 deals and Dell XPS 15 deals": "https://www.techradar.com/news/dell-xps-13-deals",
    "best cheap laptop deals": "https://www.techradar.com/news/the-best-laptop-deals"
  }
}