{
  "source": "https://www.techradar.com/news/windows-11-name-confirmed-in-fresh-leak-from-microsoft",
  "title": "Windows 11 name confirmed in fresh leak from Microsoft",
  "category": "computing",
  "updated": "2021-06-21T12:14:25Z",
  "author": "darren-allan",
  "summary": "Microsoft’s Azure documentation clearly mentions Windows 11",
  "article": [
    "Windows 11 has turned up in yet another leak ahead of Microsoft’s big launch in a few days, adding more weight to the evidence that this really will be the name of the successor to Windows 10.",
    "This particular piece of spillage comes direct from Microsoft, as highlighted by Windows Latest which uncovered a support document published via Github. To be precise, this is Microsoft’s Azure documentation, and underneath where Windows 10 is listed, we can clearly see a mention of Windows 11 (seemingly confirming that these two versions will coexist – remember that Microsoft has also made it clear that support will be dropped for Windows 10 in 2025).",
    "This additional leak comes on top of the recent revelation that Microsoft is pursuing websites involved in distributing the leaked build of its incoming refreshed operating system – which of course has the Windows 11 name plastered all over it – with copyright takedown requests issued to Google. These DMCA takedown complaints specifically name the build as Windows 11, and even describe it as a “leaked copy of the unreleased Windows 11”.",
    "A minority of folks out there have previously doubted the authenticity of the leaked build, which emerged last week, or at least that the name will actually be Windows 11 – but the evidence now seems pretty overwhelming.",
    "Particularly when you consider that Microsoft dropped a whole load of 11-based hints before build 21996.1 was even floating around online, including several teaser videos, and there’s also the timing of the event itself which kicks off at 11am on June 24.",
    "We knew something big was coming even before that, of course, with all the talk from Microsoft about how what’s in the pipeline for Windows is going to be revolutionary and the ‘next generation’ of the desktop OS.",
    "There are certainly other commenters online who have argued that what we’ve seen in the leaked build doesn’t live up to these kind of claims, but then we have to bear firmly in mind that this is an early working version of Windows 11, so a lot could change (and doubtless will change) for launch."
  ],
  "headers": {
    "5": "Planning a revolution"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Windows Latest": "https://www.windowslatest.com/2021/06/21/windows-11-confirmed-in-a-new-microsoft-support-document/",
    "support will be dropped for Windows 10 in 2025": "https://www.techradar.com/news/microsoft-is-planning-to-kill-off-windows-10-in-2025-does-this-confirm-windows-11",
    "These DMCA takedown complaints": "https://www.techradar.com/news/microsoft-issues-copyright-takedown-request-over-leaked-windows-11-build",
    "several": "https://www.techradar.com/news/microsoft-drops-biggest-windows-11-hint-yet",
    "videos": "https://www.techradar.com/news/rip-windows-10-windows-11-could-be-unveiled-by-microsoft-in-a-few-weeks",
    "with all the talk from Microsoft": "https://www.techradar.com/news/did-microsoft-just-tease-windows-11-at-build-2021"
  }
}