{
  "source": "https://www.techradar.com/news/disney-plus-creeps-closer-to-netflix-after-hitting-100m-subscriber-milestone",
  "title": "Disney Plus creeps closer to Netflix after hitting 100m subscriber milestone",
  "category": "entertainment",
  "updated": "2021-05-14T15:30:56Z",
  "author": "henry-st-leger",
  "summary": "Can the Disney Plus streaming service finally catch up with Netflix?",
  "article": [
    "Can the Disney Plus streaming service ever catch up with Netflix? As Disney’s platform hits 100 million subscribers, and Netflix’s growth starts to stagnate, it just might be possible.",
    "Disney has reported a 8.7 million increase in its subscriber count since the start of 2021, totalling 103.6 million users around the world. That’s a staggering amount given the 1.5 year lifespan of the platform so far.",
    "That figure was no doubt buoyed by the release of two massive Marvel TV shows, the trippy sitcom experiment of WandaVision and buddy action series The Falcon and the Winter Soldier, on Disney Plus in the past few months. The arrival of a Loki series, Raya and the Last Dragon, and 101 Dalmations prequel Cruella won’t hurt matters either.",
    "There was no doubt worry at Disney after the unceremonious closure of movie theaters worldwide, in response to the ongoing Covid-19 pandemic. Disney relies on ticket sales for its blockbuster releases, such as Avengers: Endgame and its year slate of Marvel movies, Star Wars films, and Disney / Pixar animation flicks.",
    "Given Disney Plus only launched in late 2019, a matter of months before the pandemic erupted across the globe, it looks like the House of Mickey managed to pivot to digital streaming just in time to cushion some of the blow (not that Disney, one of the highest-valued media companies on the planet, needed that cushion as much as some).",
    "Thanks, CNET.",
    "Netflix remains the streaming service to beat, of course, with just over 207 million subscribers at last counting, which is still double Disney’s numbers. However, with Netflix’s online platform having been around for over a decade, and Disney Plus not yet two years old, the rate of growth of the latter will no doubt be giving the head honchos at Netflix pause.",
    "It wouldn’t be accurate to call Disney an underdog here, given its immense cashflow and ownership of some of the world’s biggest movie franchises. Still, at a time when numerous media companies saw fit to launch their own Netflix competitors – Apple TV Plus, Peacock, Paramount Plus, etc – this kind of success wasn’t guaranteed.",
    "Disney first predicted a 60-90 million subscriber count five years after launch, and that forecast has now risen to 230-260 million. That gives a lot of time for Netflix to put some more distance between itself and Disney, but stagnating growth for the former may make that harder. Netflix may be nearing a point of saturation, where the majority of interested viewers with capable internet access are already using the platform – how high can that figure go, after all?",
    "Back in 2017, when Netflix hit the same 100 million subscriber milestone, having earned $300 million over the previous three months, the company called it “a good start” – even as CEO Reed Hasting admitted that “every 10 million subscribers is harder than the last” in its key regions.",
    "We may well see Disney’s growth start to plateau in a similar way as it nears Netflix’s 200m peak. The flurry of new streaming services are all eating up small portions of the market, too, and there are only so many subscriptions the average viewer can juggle. For now, though, neither Netflix nor Disney have to worry too much – even if the fight between them gets closer in the coming few years."
  ],
  "headers": {
    "6": "Disney Plus vs Netflix: the state of affairs"
  },
  "links": {
    "Disney Plus streaming service": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Raya and the Last Dragon": "https://www.techradar.com/reviews/raya-and-the-last-dragon",
    "Marvel movies": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Star Wars films": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "CNET": "https://www.cnet.com/news/disney-plus-hits-103-6-million-subscribers/#ftag=CAD590a51e",
    "stagnating growth for the former": "https://www.techradar.com/news/netflix-tries-out-a-mobile-only-streaming-plan-as-subscriber-growth-slows",
    "the company called it “a good start": "https://www.techradar.com/news/for-netflix-100-million-subscribers-is-just-the-beginning"
  }
}