{
  "source": "https://www.techradar.com/news/which-hair-dryer-settings-should-i-use-to-blow-dry-my-hair",
  "title": "Which hair dryer settings should I use to blow dry my hair?",
  "category": "appliances",
  "updated": "2021-11-28T20:21:51Z",
  "author": "niamh-quinn",
  "summary": "Fastest and hottest isn’t always best",
  "article": [
    "Blow drying your hair at home is a great way to take your hair from drab to fab without stepping foot in a salon. However, for some of us, what should be a relatively simple task can prove a little confusing.",
    "While having one of the best hair dryers is half the battle when it comes to creating ‘just stepped out of a salon’ feeling, knowing which heat and speed setting to use when it comes to creating different styles can be a little confusing. While it's tempting just to whack both the speed and heat settings on maximum, this isn’t always the best course of action and could damage your hair.",
    "We spoke to celebrity hairstylist Jen Atkin (hairdresser to the Kardashians, J-Lo and Chrissy Teigen - to name a few), and she revealed that regardless of how good your hair dryer is, the secret is to cater your routine to your hair.",
    "“There’s no one size fits all method and that’s why you need to study your hair and work out its specific needs,” said Atkin. “You may need more or less airflow and heat depending on your hair type (fine, wavy, coily or coarse).”",
    "Fancy grabbing yourself one of the best hair dryers right now? Check out the best prices on offer right now.",
    "As tempting as it is, putting your hair dryer on full blast and blitzing your mane with the highest heat and power isn’t advisable.",
    "“Unfortunately, most hair dryers do expose your hair to excessive temperatures at rapid speeds which causes unnecessary and unrepairable heat damage and breakage.” Atkin pointed out.",
    "Why? Because, short term, you won’t achieve salon results and long term, you will damage your hair.",
    "That said, Atkin said there are some hair dryers on the market that take steps to ensure they don’t cause extreme heat damage, no matter what heat setting is used, such as the Dyson Supersonic. This hair dryer measures the temperature over 40 times a second, ensuring it never goes above the temperature selected and preserves your hair’s integrity and natural shine.",
    "We’re all about maintaining the integrity of our hair while offering it the bounce and beauty we see on Hollywood screens. That’s not too much to ask, is it?",
    "Especially when blow drying fine, thin hair, it’s better to minimize use of the highest heat setting… or avoid it altogether. Instead, opting for the middle heat setting and the lowest speed will offer you styling flexibility without compromising the condition of your hair.",
    "If your hair is fine but you have a lot of it, you can afford to accelerate the speed setting for body and style. However, if your hair is both fine and there isn’t much of it, we recommend sticking to the lowest speed. This will avoid tangling and frazzled ends which might lead to more brushing and/or styling tools… and ultimately breakage that you just can’t afford.",
    "Another tip when blow drying finer hair is to dry in one direction, using a brush; this will help you avoid wispy flyaways. At the end of your hair drying session, we encourage you to use a final shot of cold air to lock in some shine (still on the lowest speed setting). The sleek and shiny look is fine hair’s USP so don’t miss this final step.",
    "Thick hair is famously difficult to tame, hence why many people in possession of thick locks fall victim to the highest speed, highest heat setting trap. It’s no secret that with an unruly mane comes broken hair ties and hair dryers that have never been able to show off their lower settings. This hair dryer neglect ends today!",
    "Have you ever wondered why your hair seldom seems to cooperate and why, post blow drying session, you’re confronted with frizz galore? This is because you’re overcompensating for your thick hair with the highest heat setting.",
    "In fact, the best heat setting for thick hair is the middle setting, paired with the highest speed. This combination is the ultimate thick hair sweet spot because it minimises heat damage while getting the job done quickly. Top tip: make sure your wet hair has already been partially soaked up by a towel and dried naturally before applying heat.",
    "Knowing which hair dryer settings are best for your curly hair requires you to know what kind of curls you’re working with. The coilier the hair, the higher the heat setting should be. (See next for our go-to afro hair tips.) For more lightweight curls, it’s best to stick to the low and medium heat settings to avoid frizz and breakage.",
    "Beyond the heat setting of your hair dryer, all expert opinions seem to point towards the fact that a diffuser attachment should be your best friend. We’re in the business of celebrating curls and believe that the bigger the better.",
    "A diffuser attachment will revitalise your locks and make your curls bigger and bouncier. Enhancing your natural shape is the ultimate goal when blow drying curly hair so investing in a diffuser and sticking to the lower heat settings and medium speed setting will work a treat.",
    "On the flip side, Atkin explains that afro hair, or Type 4 hair, requires a different approach. Firstly, it’s recommended that you opt for an ionic hair dryer that locks in moisture while drying your hair as dry heat is the enemy of afro hair. Next, it’s important to distinguish between natural afro hair and chemically treated Type 4 hair, such as relaxed or texturized hair.",
    "As a general rule, the best hair dryer setting to use on afro hair is the lowest heat that will allow you to achieve your desired results. With regards to the speed setting, the highest speed will usually be your best bet.",
    "So, if you’re dealing with natural afro hair, it is recommended that you stick to medium heat, occasionally giving your hair a blast of hot air. Alternatively, if you’re working with chemically treated afro hair, the experts suggest that you steer clear of the highest heat and stick to the lowest heat setting only. However, for both types of hair, the highest speed setting will give the best results.",
    "“Depending on what style you’re wanting to achieve, I would use a combination of styling attachments,” said Atkin. She recommended a diffuser, which disperses the air stream to ensure the curl pattern of the hair isn’t disrupted, along with a Wide Tooth Comb, if you’re wanting a blowout look, working from the scalp to lengthen the hair.",
    "“If you want an even sleeker straight look, I would then use hair straighteners, such as the Dyson Corrale, to finish the style.”",
    "With advanced technology and designs, hair dryers today are about more than drying your hair, they also provide ample styling solutions. Knowing which attachments to use is almost as important as mastering the perfect heat/speed setting combination for your hair type.",
    "Making the most of hair dryer attachments can really simplify the hair drying process and even work in place of other hair tools, minimising the time spent styling your hair and the amount of heat you place on it.",
    "The diffuser attachment is the must-have for anyone with curly hair. Shaped like a bowl with comb teeth in the centre, the diffuser is your secret weapon for dispersing air through all of your separate strands to prevent frizz and enhance your natural style.",
    "The pick attachment looks like a wide tooth comb that you attach to the end of your hair dryer for added volume. Choose the length of your pick depending on the length of your hair.",
    "The concentrator nozzle is the standard attachment that comes with (almost) every hair dryer. The importance of this add-on cannot be overstated and it pains us to see people ditching it for a quicker blow dry. Offering control and a targeted airflow, the concentrator should be used with a brush to create tension in the hair and offer the ultimate sleek, shiny blow dry.",
    "If you’re guilty of neglecting the cold air setting on your hair dryer, using time as an excuse to ditch the blue button, that stops today. After speaking to Atkin, we realised that the cold air setting is the finishing touch we’ve been missing… The reason why our locks have been lacking that je ne sais quoi.",
    "“A cold setting closes the hair follicle which seals the style and makes the hair appear shinier. You can use the cold setting at the end of your blowout to finish the look.” Jen concluded. So, it’s official, a final blast of cold air is the secret step to achieving shine and hold.",
    "You might also want to check out our GHD Helios review."
  ],
  "headers": {
    "5": "What’s the harm in blasting your hair with the highest heat setting?",
    "10": "What are the best hair dryer settings for fine hair?",
    "13": "What are the best hair dryer settings for thick hair?",
    "16": "What are the best hair dry settings for curly hair?",
    "19": "What are the best hair dryer settings for afro hair?",
    "24": "What do the different attachments on hair dryers do?",
    "29": "What does the cold air hair dryer setting do?"
  },
  "links": {
    "best hair dryers": "https://www.techradar.com/best/best-hair-dryer-5-hair-dryers-for-smooth-and-shiny-styles",
    "Dyson Supersonic": "https://www.techradar.com/reviews/dyson-supersonic-uk",
    "Dyson Corrale": "https://www.techradar.com/reviews/dyson-corrale-review",
    "GHD Helios": "https://www.techradar.com/reviews/ghd-helios"
  }
}