{
  "source": "https://www.techradar.com/news/ps5-restock-sony-direct-virtual-queue-time",
  "title": "PS5 restock: Sony Direct virtual queue was only for people with email invites",
  "category": "gaming",
  "updated": "2021-08-30T09:12:06Z",
  "author": "matt-swider",
  "summary": "Our PS5 restock Twitter tracker Matt Swider has helped over 50,000 people buy a console with his instant alerts. Sadly, the Sony Direct virtual queue was rather limited today.",
  "article": [
    "Update: The PS5 restock at Target was the latest PS5 restock. Be sure to head to the news story to figure out when and where to buy the console next.",
    "According to our PS5 restock Twitter tracker Matt Swider, this is the first time this has happened – there are usually leftovers. Matt will send you an alert when the Sony console is in stock – if you follow his account and turn on notifications.",
    "Trust and credibility: Matt Swider has helped over 50,000 people buy a next-gen console in recent weeks. How? With his tireless 24/7 tracking, in-stock Twitter alerts and exclusive restock reporting. Sony Direct is a lottery system, so as soon as there's a restock, everyone has an even chance. But you'll need a prompt alert.",
    "Matt did a live stream with tips on how to buy PS5, despite the fact that there was no PS5 Sony Direct virtual queue for the masses at 5pm EDT. He took questions in the live chat.",
    "Click on this example of a Sony Direct PS5 restock tweet (the one from June 17 – last week) to follow Matt Swider and turn on notifications (the little bell icon).",
    "Here's how to we know there will be a Sony Direct restock today, June 23: the official store for the PlayStation brand sent email invites to PSN users (it's done at random, you can't really do anything to increase your chances) for a special 3pm EDT / 12pm PDT virtual queue, and quite a lot of people got the invite this time, according to our exclusive reporting and research (though not as many seemed to have gotten it as last week). And it's definitely next since the GameStop Xbox Series X restock doesn't include PS5 this time around (GameStop had it last week).",
    "Usually, we say: don't despair if you didn't get an email invite from Sony – the Sony Direct virtual queue has previously always opened up to the general public today at 5pm EDT. Technically the virtual queue opens at 5:15pm EDT, while a waiting room fills at 5pm EDT. Turns out, that wasn't the case this on June 23.",
    "Previously the Sony Direct restock time was all over the place, but Sony has recently settled on 5pm EDT / 2pm PDT for launching that waiting room right before the virtual queue's yellow progress bar appears. Again, it didn't happen today, but we're confident Sony Direct will return to form soon.",
    "The Sony Direct PS5 restock for email invitees wasn't the first time we saw the PS5 in stock this week. We got an overnight Amazon PS5 restock at 12am EDT on Wednesday, June 23 – and Matt Swider sent out an alert if you were following him on Twitter, though with Amazon being so popular at the close of Prime Day 2021 deals it was a difficult one.",
    "We thought there'd be a chance at redemption with the Sony Direct virtual queue for everyone at the usual time of 5pm EDT. But it turned out to be limited to those wth that special Sony Direct email invite at the 2pm EDT virtual queue.",
    "Last week was very successful for a lot of PS5 buyers at Walmart, Sam's Club, Target and Antonline. Newegg did have a PS5 Digital bundle in stock this week alongside of its GPU restock, but that was also a lottery system, and a much smaller one.",
    "The Best Buy PS5 restock, originally scheduled for Monday, has been delayed (likely originally meant to compete with Amazon during Prime Day). We don't have a new date from our sources.",
    "Walmart hasn't had the PS5 console yet this week (it's usually on Thursday), but it did make PS5 restock news: a lot of people who bought PS5 Digital last week got a free upgrade to PS5 Disc – without paying for the $100 premium.",
    "The Amazon PS5 restock time overnight this week made perfect sense. Just after 12am ET (technically Wednesday) marked the last three hours of Prime Day. Plenty of Amazon customers had items sitting in their cart, and by offering a PS5, it was the fastest way for Amazon to get people checking out at lightning speed.",
    "The Sony Direct virtual queue is 'fair' compared to, say, Walmart which opens up orders and only sometimes has the add-to-cart or checkout buttons working. Sony has made PS5 sales into a lottery of sorts, and the only thing you need is a PSN account.",
    "No one knows for sure how Sony picks people for the invite email (it's vaguely based on \"PlayStation activity\", but if you get one, you're almost sure to get a console because that earlier virtual queue time is limited to a small group of buyers.",
    "We'll have more advice on the PS5 restock at Sony Direct as the virtual queue opens up next time there's a restock. Make sure to turn on alerts so you know exactly when the restock time is, as it can switch around."
  ],
  "headers": {
    "5": "PS5 restock news: Sony Direct virtual queue time",
    "8": "Sony Direct PS5 restock: ideal if you missed Amazon",
    "14": "Sony Direct restock guide – for when it does happen"
  },
  "links": {
    "PS5 restock at Target": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5 restock Twitter tracker Matt Swider": "https://twitter.com/mattswider",
    "GameStop Xbox Series X restock": "https://www.techradar.com/news/massive-xbox-series-x-restock-at-gamestop-today-but-theres-a-catch",
    "Amazon PS5 restock": "https://www.techradar.com/news/ps5-restock-sony-direct-virtual-queue-email",
    "Prime Day 2021 deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "GPU restock": "https://www.techradar.com/news/rtx-3080-in-stock-today-newegg-shuffle",
    "a free upgrade to PS5 Disc": "https://www.techradar.com/news/ps5-disc-walmart-free-upgrade"
  }
}