{
  "source": "https://www.techradar.com/news/lyperteks-new-wireless-earbuds-boast-unbelievable-80-hour-battery-life",
  "title": "Lypertek's new wireless earbuds boast unbelievable 80-hour battery life",
  "category": "audio-visual",
  "updated": "2021-04-29T10:53:55Z",
  "author": "olivia-tambini",
  "summary": "But they'll cost you",
  "article": [
    "Lypertek has announced its latest true wireless earbuds – and with an incredible claimed battery life of 80 hours, they may be among the longest-lasting wireless earbuds on the planet.",
    "The Lypertek PurePlay Z7 follow in the footsteps of the PurePlay Z3 (formerly known as the Lypertek Tevi), which we awarded a full five stars in our review. According to the company, the new earbuds offer an updated design, improved features, and hybrid driver technology.",
    "However, unlike their predecessors, the Lypertek PurePlay Z7 won't come cheap when they launch in early June. They'll set you back $199 / £199 (about AU$250), which is significantly more expensive than the PurePlay Z3, which cost $79.99 / £99.99 (about AU$100).",
    "So, what do you get for your money? Aside from that 80-hour battery life (that's 10 from the buds themselves and a further 70 from the charging case), Lypertek has furnished the earbuds with the new Qualcomm QC3040 chipset, allowing for Bluetooth 5.2 connectivity and AAC and aptX Adaptive support.",
    "They're the first Lypertek earbuds to feature a triple hybrid driver, with two balanced armature drivers and one titanium-coated driver inside each housing.",
    "According to Lypertek, this driver arrangement provides the dynamic range necessary to deliver \"powerful and well controlled bass, [a] midrange that provides a rich clarity to vocals, and clear and expansive highs\". If they sound anything like the PurePlay Z3 – and we'd expect them to sound better based on the specs – you can expect a well-balanced, audiophile presentation.",
    "The earbuds will also be compatible with the new PureControl app, which allows you adjust the EQ settings and switch through a number of presets. You can also use the app to activate the ambient sound mode, customize the multi-purpose control buttons, upgrade the firmware, and use the 'Find My Earbud' feature.",
    "It's a shame that there's no active noise cancellation on offer – these buds are just as expensive as the Apple AirPods Pro, though they do offer a far superior battery life. If the audio performance lives up to Lypertek's claims, that high price may be justified – and the company does offer a budget alternative with the Lypertek SoundFree S20, which we crowned the best budget wireless earbuds of 2021."
  ],
  "headers": {
    "3": "Triple drivers"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "PurePlay Z3": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "in our review": "https://www.techradar.com/reviews/lypertek-tevi-true-wireless-earbuds-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Lypertek SoundFree S20": "https://www.techradar.com/reviews/lypertek-soundfree-s20",
    "best budget wireless earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds"
  }
}