{
  "source": "https://www.techradar.com/news/xiaomis-black-shark-4-is-the-cheapest-gaming-phone-of-2021",
  "title": "Xiaomi's Black Shark 4 finally has a release date and price",
  "category": "phones",
  "updated": "2021-04-29T14:32:29Z",
  "author": "tom-bedford",
  "summary": "And you can pre-order now",
  "article": [
    "Xiaomi can be relied on to undercut its competition, and it's done just that with its newest gaming phone, the Black Shark 4. First launched in March, this long-awaited device from Xiaomi's gaming-focused sub-brand is now available to pre-order, for a relatively low price.",
    "Black Shark has announced that the fourth-generation device is available to pre-order on its website, and that it will be shipped - and go on sale fully - from May 6. You can order the phone from the US, UK and Australia, though in the latter region you'll have to do so through Xiaomi's website, where it ships from May 3.",
    "We've also got some prices for the standard Black Shark 4 in its two configurations, which we'll list below. There's no word on the Pro model just yet though, so it's not clear when that will go on sale.",
    "At that price the Xiaomi Black Shark 4 closely rivals another gaming phone, the Nubia Red Magic 6, which costs $599 / £509 (roughly AU$850) for 12GB RAM and 128GB storage.",
    "These two lower-cost gaming phones undercut the pricier Lenovo Legion Phone Duel and Asus ROG Phone 5, though could soon themselves be beaten by a new rumored handset.",
    "Another Xiaomi sub-brand, Redmi, is rumored to be working on its own gaming handset - Redmi typically offers budget devices with impressive specs, so we could see a phone which beats out all its competitors in terms of price.",
    "Until that phone gets launched, though, the Black Shark 4 is the most affordable new gaming phone of 2021. Stay tuned for our full review when we get hands-on with the device."
  ],
  "headers": {
    "3": "Healthy competition"
  },
  "links": {
    "gaming phone": "https://www.techradar.com/news/best-phone-for-gaming",
    "Black Shark 4": "https://www.techradar.com/news/xiaomi-black-shark-4-and-4-pro",
    "website": "https://uk.blackshark.com/",
    "Xiaomi's website": "https://www.mi-store.com.au/mi-phones",
    "Nubia Red Magic 6": "https://www.techradar.com/reviews/nubia-red-magic-6",
    "Lenovo Legion Phone Duel": "https://www.techradar.com/reviews/lenovo-legion-phone-duel-review",
    "Asus ROG Phone 5": "https://www.techradar.com/reviews/asus-rog-phone-5"
  }
}