{
  "source": "https://www.techradar.com/news/ahead-of-halo-infinite-the-master-chief-collection-is-heading-to-a-new-platform",
  "title": "Ahead of Halo Infinite, the Master Chief Collection is heading to a new platform",
  "category": "gaming",
  "updated": "2021-02-08T10:27:12.172Z",
  "author": "henry-st-leger",
  "summary": "But which one?",
  "article": [
    "Halo: Master Chief Collection, the collected works of developers Bungie and 343 Industries in the Halo canon, is set to come to a new platform, with speculation rife around a Nintendo Switch or even PS5 (yeah, right) release, after the news was teased in a recent Halo Waypoint blog post (via VG24/7).",
    "In the blog post, 343's Community Support & Engagement Coordinator listed a number of changes coming in the next update (or 'flight') for the MCC:",
    "\"Later this month we are currently planning to kick off our next series of flights. We have quite a bit of new content we are looking to get into your hands, but we are deciding what the right amount is and are still waiting to see what progress is made in the coming weeks.\"",
    "The changes include everything from control customizations to \"Mouse & Keyboard Support for consoles\" – but undoubtedly the most intriguing change is \"maybe a new place and way to play\".",
    "What does this mean? Well, the MCC first launched on Xbox One back in 2014, with support for PC and the Xbox Series X / Xbox Series S consoles coming later (2019 and 2020 respectively).",
    "We also saw the Halo collection come to Microsoft's Cloud Gaming streaming service, meaning you can play it on Android devices. The teased news could refer to Cloud Gaming coming to iOS, and thus bringing the MCC to a \"new place\", but we'd be surprised for an individual title to break the news for such a big platform announcement.",
    "Possibly more likely is a move to Nintendo Switch. Microsoft was certainly in talks to bring Xbox Game Pass to Nintendo Switch at some point, even if nothing came of it in the end. However, bringing Microsoft's most iconic first-party franchise, Halo, to the handheld Switch and Switch Lite consoles would certainly feel like \"a new way to play\".",
    "We can't promise the various remastered Halo games would look great on the Switch's 720p screen, but it's always possible that we'll see a limited version of the MCC with the earlier Xbox and Xbox 360 titles in the franchise (Halo, Halo 2, Halo 3, Halo 3: ODST) which were largely played on HD screens anyway.",
    "Of course, it's impossible to talk about Halo in 2021 without citing Halo Infinite, the next mainline entry in the franchise, which was intended as an Xbox Series X launch title but was delayed to give developers more time to work on the game.",
    "The last Inside Infinity update was in December 2020, revealing that the delayed Halo Infinite will now release in a \"Fall 2021\" release window (sometime between September and November). We expect there'll be more tidbits to come in the months ahead, though possibly not a firm release day until we approach the second half of the year.",
    "The delay was something of a disappointment to fans, and it wouldn't be surprising to see Microsoft try to rustle up some goodwill in the months leading up to release. The MCC coming to a new platform, especially the Nintendo Switch, would certainly give a new player base a chance to walk in Master Chief's bionic boots – and possible incentivise them to think about buying a next-gen Xbox for Halo Infinite too."
  ],
  "headers": {
    "4": "A new way to play...",
    "8": "Halo Infinite"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Halo Waypoint": "https://www.halowaypoint.com/en-us/forums/243780d3b80b4bb6ac7917a8942286db/topics/mcc-development-flighting-updates/3e3252e1-297a-4590-a7ab-67c133b3d37d/posts?page=4#post67",
    "VG24/7": "www.vg247.com/2021/02/07/343-industries-halo-master-chief-collection/",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Cloud Gaming": "https://www.techradar.com/how-to/how-to-stream-xbox-games-on-your-phone-or-tablet",
    "Android devices": "https://www.techradar.com/best/best-android-phones",
    "coming to iOS": "https://www.techradar.com/news/youll-soon-be-able-to-stream-your-xbox-games-to-your-iphone",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Switch Lite": "https://www.techradar.com/reviews/nintendo-switch-lite-review",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "December 2020": "https://www.halowaypoint.com/en-us/news/inside-infinite-december-2020"
  }
}