{
  "source": "https://www.techradar.com/news/google-pixel-6-forget-it-im-only-excited-for-the-google-pixel-5a",
  "title": "Google Pixel 6? Forget it, I’m only excited for the Google Pixel 5a",
  "category": "phones",
  "updated": "2021-05-15T19:00:42Z",
  "author": "david-lumb",
  "summary": "OPINION: The Pixel 5a is expected to shine; the Pixel 6, not so much",
  "article": [
    "We’re a week away from Google IO 2021, and while we’re excited for all the software updates, peeks at Android 12, and hints at what secret projects the company has been working on, I’ve only got eyes for one thing at the event: the Google Pixel 5a. Whatever else Google has in store for us, it’s the only Google phone I'm genuinely excited to see.",
    "Don’t get me wrong, the Google Pixel 6 reportedly has some interesting new features, but last year there was very little reason to buy the Google Pixel 5 given that most of its best qualities arrived in the notably cheaper Google Pixel 4a 5G. And since many of the phone’s top features are software-related, including cameras, the standard Google Pixel 4a was (and remains) an incredible value.",
    "Flagship Google phones are great, sure, but unless something is drastically different this year, we’d expect the Google Pixel 5a to follow suit and lead the way as another great low-cost, high-value handset with great software perks passed down from pricier siblings.",
    "It might not look any different from the Pixel 4a, at least according to the rumors, and heck, it might not even switch out the display or cameras. And yet, my opinion stands: the Google Pixel 5a is still more exciting than the Google Pixel 6, and it should be one of the most exciting pieces of technology we'll see at this year's Google IO event.",
    "Why? The Pixel 4a stands out among the competition at its price point ($349 / £349 / AU$599), while the Google Pixel 4a 5G released later in 2020 offered most of the Pixel 5's specs at a cheaper $499 / £499 / AU$799 pricetag.",
    "The compromises Google made to drive down the Pixel 5’s pricetag ($699 / £599 / AU$999) leave it less competitive in its 'affordable flagship' tier. The latter’s Snapdragon 765 chipset, for instance, is less powerful than the Samsung Galaxy S20 FE’s ($699 / £699 / AU$1,149) Snapdragon 865 silicon – let alone the just-released Asus Zenfone 8’s Snapdragon 888 (expected $599 / £425 / AU$769). And while Google’s camera software is stellar for wide daytime and nighttime shots, its zoom photography isn’t great compared to competitors with dedicated telephoto lenses.",
    "To put it bluntly, the Pixel 5a has more reasonable competition at its price point – even higher-end budget phones in the Moto G Stylus ($299, around £220 / AU$384) struggle to compete with the camera capabilities of the Pixel 4a, and its successor will probably take even better photos. It will be one of the first phones to get Android 12, minimizing the advantage of pricier Pixel phones. And even if the Pixel 5a is 4G LTE-only, it’s not missing much as 5G networks continue their slow rollouts.",
    "Of course, we’re already seeing some intriguing Pixel 6 rumors – most notably, a new render leak that shows a striking redesign with a wide horizontal camera block. It’s a great new look, though since it didn’t come with specs info, it’s hard to tell what changes may come – or if this is just a cosmetic refresh.",
    "The renders do support a prior leak suggesting the phone will get an in-screen fingerprint scanner, which is a long-overdue perk that is such a standard in phones that it’s filtered down to mid-range and budget devices.",
    "Most intriguing, of course, is the mysterious ‘Whitechapel’ silicon Google is rumored to be building to debut in the Google Pixel 6. There’s still a lot of mystery surrounding the chipset, though it could follow Apple’s example in tailoring its silicon to even better use its OS, which could give the device an edge over other Android phones.",
    "Thus, the Google Pixel 6 is full of unknowns, and given the features that Google trimmed back in the Pixel 5 to compete in the more affordable flagship market, it’s less clear whether Google may shift its strategy to produce a more powerful device or keep it a lower-priced, lower-powered handset.",
    "It’s that uncertainty that keeps my eyes focused on the Google Pixel 5a – and what other surprises in store at Google IO 2021."
  ],
  "headers": {
    "4": "All aboard the Pixel 5a hype train",
    "7": "So what will the Google Pixel 6 do better?"
  },
  "links": {
    "Google IO 2021": "https://www.techradar.com/news/google-io-2021-live-blog",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 5": "https://www.techradar.com/reviews/google-pixel-5",
    "Google Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Google Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "look any different": "https://www.techradar.com/news/leaked-google-pixel-5a-renders-show-a-suspiciously-familiar-design",
    "Samsung Galaxy S20 FE": "https://www.techradar.com/reviews/samsung-galaxy-s20-fan-edition-review",
    "Asus Zenfone 8": "https://www.techradar.com/reviews/asus-zenfone-8",
    "Moto G Stylus": "https://www.techradar.com/reviews/moto-g-stylus-2021",
    "redesign": "https://www.techradar.com/news/google-pixel-6-renders-show-the-massive-redesign-the-range-needs",
    "fingerprint scanner": "https://www.techradar.com/news/android-12-beta-hints-at-under-display-fingerprint-scanner-for-google-pixel-6"
  }
}