{
  "source": "https://www.techradar.com/news/pubg-mobile-lite",
  "title": "PUBG Mobile Lite: what it is and how you can play the battle royale spin-off",
  "category": "phones",
  "updated": "2021-01-26T12:15:34Z",
  "author": "tom-bedford",
  "summary": "PUBG Mobile, but for less-powerful smartphones",
  "article": [
    "If you have a weak smartphone, PUBG Mobile Lite might be one of the few complex mobile games you can play. It’s a lightweight version of ‘standard’ PUBG Mobile, and it's designed for smartphones that have limited RAM or weaker chipsets than flagship devices sport.",
    "This makes PUBG Mobile Lite a great choice if you’ve got a budget smartphone with low specs, or an older handset that can’t play the newest and most intensive games. But that doesn’t mean everyone with such a phone can play the game: the availability is a little more convoluted than that.",
    "PUBG Mobile Lite isn’t available in all regions, and while there are workarounds, the game might not work properly depending on where you live. We’ll explore more in our availability section below. It's also worth pointing out it's only available on Android phones - sorry, iPhone owners.",
    "We’ll also run through what PUBG Mobile Lite is like, including the maps, weapons and features available, so you know all there is to know about the game.",
    "PUBG Mobile Lite is available in an odd scattering of countries across the world; since it launched in mid-2019, it’s been in a beta phase, and full rollout has been expected for nearly two years now, but we’re still waiting.",
    "Countries include Russia, many Latin American and Caribbean nations, quite a few south-east Asian countries and over half of Africa. Those in the US, UK and Australia aren’t able to download the game.",
    "The overall list of compatible countries is spotty, so we recommend finding if your country is compatible by heading over to the Google Play Store entry for PUBG Mobile Lite. If you’re unable to download the game, odds are your country isn’t on the list. That doesn’t mean you can’t play the game though…",
    "You don’t have to be in a compatible region to play PUBG Mobile Lite, as long as you’re willing to put in some extra work.",
    "On its website, PUBG Mobile Lite offers a downloadable APK version of its game, which you can download yourself and install on your smartphone. Several other websites also host PUBG Mobile Lite APKs - we’d recommend only downloading it from the official site though so you don’t install something riddled with malware.",
    "To download it, use the phone you want to play on, head over to the PUBG Mobile Lite website here and select ‘APK Download’. This should start the download process - when the file is fully downloaded, find it in your phone’s downloads folder (or via the notification that should pop up) and select it.",
    "You’ll be asked if you want to install the app - follow the processes and soon, you should have the game fully installed.",
    "It’s worth pointing out this might not work for all, and it depends on server availability in your country. We tested the download in the UK, and while we could access the app, we couldn’t log in due to a lack of servers. However, if you live near countries where the game is compatible you may be able to access the game.",
    "PUBG Mobile Lite has a few key differences from the main version of the game, to justify that low install size. The main one is a graphical downgrade, as the game doesn’t exactly have next-gen graphics.",
    "The PUBG Mobile Lite map is quite a bit smaller than PUBG Mobile ones. At 2km by 2km (that's in-game distances) its map is dwarfed by the 8km by 8km options you have in the ‘standard’ version of the mobile game.",
    "There are 60 players per match, but in that relatively small map that should make for intensive and quick games. Vehicles are available in the map, as well as weapons and gear to scavenge.",
    "PUBG Mobile Lite gets regular themed updates, for example with winter-themed additions, which include new guns with particular camos.",
    "There’s also a smaller arena mode in PUBG Mobile Lite, in which two teams of four players engage in firefights in a warehouse. It’s not as thorough a list of modes as in PUBG Mobile but it’s something.",
    "PUBG Mobile Lite also has the occasional limited-time mode, as with standard PUBG Mobile. These have included zombie or winter-themed game modes in the past."
  ],
  "headers": {
    "4": "What regions is PUBG Mobile Lite available in?",
    "7": "How to download PUBG Mobile Lite",
    "12": "PUBG Mobile Lite changes from the original version"
  },
  "links": {
    "PUBG Mobile": "https://www.techradar.com/news/pubg-mobile-season-18",
    "Google Play Store entry for PUBG Mobile Lite": "https://play.google.com/store/apps/details?id=com.tencent.iglite&hl=en_GB&gl=US",
    "PUBG Mobile Lite website here": "https://www.pubgmlite.com/en-US/"
  }
}