{
  "source": "https://www.techradar.com/news/microsoft-says-its-confident-bing-can-do-better-than-google",
  "title": "Microsoft says it's confident Bing can be better than Google",
  "category": "computing",
  "updated": "2021-02-01T14:30:14Z",
  "author": "barclay-ballard",
  "summary": "Google's loss could be Microsoft's gain",
  "article": [
    "Microsoft believes that Bing can take over Google’s position as the number one search engine in Australia, should changing regulations push the tech firm out of the country. Google has threatened to remove its services from the Australian market if new laws force tech firms to negotiate with local media outlets for the use of their content.",
    "Major technology providers have criticized the new legislation as unfair and unworkable. Under the new law, media firms are encouraged to make a commercial deal with Facebook and Google but should no agreement be reached, an arbiter will determine what financial settlement should be paid by the technology firms in order to use content produced by other outlets.",
    "In addition, Australia’s new law also states that digital platforms must inform media outlets at least 14 days before any algorithmic changes are implemented. As well as Google’s threat to leave the country, Facebook has also suggested that Australians may be blocked from sharing news on its platform.",
    "It seems that at least one technology firm is not up in arms regarding the new legislation, however. Australian Prime Minister Scott Morrison has revealed that, following conversations with Microsoft CEO Satya Nadella, the firm is confident that Bing can move up from second-place to become Australia’s most popular search engine.",
    "There are concerns that large technology firms are damaging local news producers by dominating the advertising landscape. The world will be watching to see how the new Australian laws play out, as similar measures could ultimately be employed in other markets.",
    "If Bing is to become the number-one player in Australia, it would represent a significant change for most online users. According to estimates, Google is currently responsible for handling 94% of search traffic in the country.",
    "Via Reuters"
  ],
  "headers": {
    "3": "New rules"
  },
  "links": {
    "Bing": "https://www.techradar.com/news/bing-receives-a-microsoft-flavoured-rebrand",
    "Reuters": "https://www.reuters.com/article/us-australia-media-microsoft/as-google-eyes-australia-exit-microsoft-talks-bing-with-pm-idUSKBN2A118A"
  }
}