{
  "source": "https://www.techradar.com/news/still-cant-buy-an-rtx-3080-new-gaming-laptops-are-here",
  "title": "Still can't buy an RTX 3080? New gaming laptops are here",
  "category": "computing",
  "updated": "2021-05-11T11:00:58Z",
  "author": "bill-thomas",
  "summary": "Intel 11th-gen and Nvidia RTX 3050 Ti powering the new hotness",
  "article": [
    "If you've been looking for a new gaming laptop or trying to build a new gaming PC, it's been kind of hard to get a hold of hardware, especially graphics cards like the RTX 3080. However, both Intel and Nvidia have announced some fresh laptop hardware, which should power the best gaming laptops 2021 will have to offer.",
    "From Intel, we're getting its 11th-generation Tiger Lake-H series of mobile processors, led by the Intel Core i9-11980HK – an 8-core, 16-thread chip with a Max 2-core turbo of 5GHz. Then, from Nvidia, we're getting the long-rumored RTX 3050 Ti – even if Team Green is still frustratingly avoiding launching a desktop version of the new GPU.",
    "These two launches are going to affect gaming laptops at every price point, with the RTX 3050 Ti finally giving a current-generation budget gaming and workstation solution. And, of course, the RTX 3080 itself, along with the rest of the mobile Ampere GPUs will still be widely available on gaming laptops everywhere.",
    "If you want to get your hands on a laptop with some of this new hardware in it, you won't have to wait long. These laptops will start being available for preorder this week, and should be on store shelves by late May, early June 2021.",
    "With Tiger Lake-H, Intel has finally brought its 10nm process to its high-performance mobile processors, where previously it's been exclusively found in the best Ultrabooks.",
    "With these processors, Intel is claiming a pretty massive 19% gen-on-gen performance improvement over its 10th-generation Comet Lake-H parts, even if this new silicon has similar specs. More specifically, in games like War Thunder and Grid 2019, Intel is claiming a 15-21% jump in raw gaming performance.",
    "That's something we'll have to wait and see for ourselves, though, when we get these laptops in-hand for testing later on. A lot of the games Team Blue is using to compare performance aren't exactly the hottest titles on the market, though, so we'd advise waiting to see how these new processors perform in your favorite game before jumping on the pre-order button.",
    "One thing we did notice, though, is that Max Turbo frequencies are lower on the new 11th-generation processors than their 10th-generation predecessors. For instance, the Intel Core i9-11980HK only has a Max Turbo frequency of 5.0GHz, rather than the 5.3GHz of the Core i9-10980HK.",
    "If these processors are indeed up to 19% faster, even with the significantly lower turbo speeds, it would mean that Intel made a significant improvement to IPC (instructions per cycle). But, again, that's something we're going to have to wait until we get it in-hand to see.",
    "While Intel Tiger Lake-H impacts gaming laptops across the entire market, the Nvidia GeForce RTX 3050 and RTX 3050 Ti brings what looks like stunning performance to the budget laptop market.",
    "The RTX 3050 and RTX 3050 Ti have 2,048 and 2,560 CUDA cores, respectively, and are both paired with 4GB of GDDR6 VRAM. Compared to the mobile version of the RTX 3060 with its 3,840 CUDA cores and 6GB of VRAM, it's a pretty big cut down. However, the GPUs they're replacing, namely the GTX 1650 and GTX 1650 Ti are much weaker.",
    "Nvidia didn't give a flat performance increase that we could expect, but it did show us some slides that show comparative performance in a number of popular games. For instance, where the Nvidia GeForce GTX 1650 Ti would typically sit around 50 fps in Call of Duty: Warzone, the RTX 3050 Ti should be able to get around 80 – and up to 100 fps if you enable DLSS.",
    "It also marks the first time that Nvidia's RTX technologies are available to this segment of the laptop market. Laptops with these budget RTX GPUs will start around $799 (about £570, AU$1,020). This is the first time you'll be able to use DLSS on a laptop at this price point, and honestly this is the perfect place for it. You can really stretch out the mileage on these lesser GPUs with this tech, and now more games than ever are supporting it.",
    "With the new Intel Tiger Lake-H line-up of processors, pretty much every one of our favorite gaming laptops are getting refreshed. You're going to see new versions of stars like the Acer Predator Triton 500, the Razer Blade 15 and the MSI GS66 Stealth, but what we're most interested in is what is coming down to the budget segment.",
    "In particular, the MSI Pulse GL66 and the MSI Katana GF66. These laptops start at $949 and $1,049, respectively, but they mark the first time MSI has truly paid attention to the budget market, with all-new designs. The Pulse GL66, in particular, has this beautiful all-black design without any egregious gamer aesthetics that are typically found in this price range. The MSI Katana GF66 is definitely a laptop that you can pull off at work.",
    "If you're looking for something a little more high-end, however, our favorite premium gaming laptop, the Razer Blade 15, is also being updated. It's of course getting the new 11th-generation Intel Tiger Lake-H processors, but Razer has also slimmed the design down even more than the last generation, and it's now just 0.62 inches thick. And it even comes equipped with a 1080p webcam, which is super rare in a laptop, and something that's become even more important with the rise in telecommuting.",
    "Just in general, now that we're all working from home, a gaming laptop is an excellent solution, especially if your workload involves a lot of creative work. Like we already mentioned, laptops like the MSI Katana GF66 and Razer Blade 15 are devices that can easily pass as regular laptops, and you get the bonus performance that a discrete GPU brings to the table.",
    "And even if you don't want to use a gaming laptop, there are a ton of creator laptops that are equipped with this new hardware, too. MSI, for instance, has its creator series on offer, which brings features like Mini LED screens and a sleek and professional aesthetic. Dell is also refreshing its best laptops, including the XPS 15 and 17, along with its Precision 5560 and Precision 5760. So, even if you're after a straight workstation, there's something for you, too.",
    "There are likely to be dozens more gaming laptops hitting the market over the next couple of months, and we can't wait to see what the new hardware is actually capable of doing."
  ],
  "headers": {
    "4": "Intel finally brings 10nm to gaming laptops",
    "9": "A gift for budget laptop buyers",
    "13": "What about the new gaming laptops?"
  },
  "links": {
    "gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "best gaming laptops 2021": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Tiger Lake": "https://www.techradar.com/news/intel-tiger-lake",
    "RTX 3050 Ti": "https://www.techradar.com/news/nvidia-geforce-rtx-3050-release-date-price-and-mobile-version-what-do-we-know",
    "Ampere": "https://www.techradar.com/news/nvidia-ampere",
    "Razer Blade 15": "https://www.techradar.com/reviews/razer-blade-15-2020",
    "MSI GS66 Stealth": "https://www.techradar.com/reviews/msi-gs66-stealth"
  }
}