{
  "source": "https://www.techradar.com/news/microsoft-finally-updates-the-windows-11-health-check-app",
  "title": "Microsoft finally updates the Windows 11 Health Check app",
  "category": "computing",
  "updated": "2021-09-21T13:28:16Z",
  "author": "daryl-baxter",
  "summary": "Ready for your PC’s checkup",
  "article": [
    "Microsoft’s Health Check app, which lets you check if your PC is ready to upgrade to Windows 11, has again been made available to download, ahead of the operating system’s release on October 5.",
    "The system requirements of Windows 11 have been a source of contention for many users, with Microsoft requiring TPM 2.0 in order for PCs to be eligible.",
    "An early version of the Health Check app would sometimes bring up erroneous results that would state a PC wasn’t eligible to upgrade to Windows 11, when in fact it was. Because of this, the app was removed in June, leaving users to wonder when a new version would arrive.",
    "When the app was removed in June, there was an open-sourced app called ‘WhyNotWin11’ that could also check your PC’s requirements for the upgrade. However, now that the official method is available again, Microsoft’s app should hopefully offer an easier way to check if your machine is Windows 11 compatible.",
    "On Microsoft’s page for Windows 11, you can find a new section toward the bottom that states the app is ready to download. The user interface is the same as the previous version, but there should now be more accurate results regarding your PC’s eligibility.",
    "Since the announcement of Windows 11 in June, Microsoft has been trying to justify the system requirements for the new upgrade by explaining the benefits of TPM. However, users are still confused as to whether their PC can upgrade to Windows 11.",
    "While it’s great to see the Health Check app return for users, this wasn’t announced by Microsoft, it was discovered.",
    "This is only adding to the confused messaging that the company created since the announcement of Windows 11 back in June.",
    "It’s only in recent weeks that Microsoft has decided to address the controversy by explaining the requirements and TPM in detail, but with just a few weeks to go until Windows 11 is available to download, it could be too late.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "How to download the new Health Check app",
    "5": "Analysis: A potential PR issue to come?"
  },
  "links": {
    "removed": "https://www.techradar.com/news/windows-11-gets-off-to-embarrassing-start-as-microsoft-removes-its-pc-health-check-app",
    "WhyNotWin11": "https://www.techradar.com/news/want-to-know-why-your-pc-cant-upgrade-to-windows-11-theres-an-app-for-that",
    "Microsoft’s page for Windows 11": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1018496760762208300&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows%2Fwindows-11",
    "was discovered": "https://www.windowslatest.com/2021/09/21/windows-11-compatibility-pc-health-check-returns-for-everyone/",
    "decided to address the controversy": "https://www.techradar.com/news/microsoft-finally-clarifies-windows-11s-tpm-requirements",
    "Windows Latest": "https://www.windowslatest.com/2021/09/21/windows-11-compatibility-pc-health-check-returns-for-everyone/"
  }
}