{
  "source": "https://www.techradar.com/news/spider-man-movies-could-come-to-disney-plus-in-the-us-anyway",
  "title": "Spider-Man movies could come to Disney Plus – in the US, anyway",
  "category": "entertainment",
  "updated": "2021-04-22T09:16:56Z",
  "author": "samuel-roberts",
  "summary": "Disney and Sony make a deal",
  "article": [
    "Sony and Disney have made a deal that could make Spider-Man on the Disney Plus streaming service a reality – though only in the US. Disney and Sony Pictures Entertainment have entered into a multi-year agreement that licenses streaming and TV rights to the studio's new theatrical releases across 2022 to 2026.",
    "It also covers older movies – Disney touts a \"robust\" collection of Spider-Man movies that it can run across its platforms. Hulu will get a number of older Sony movies to stream starting in June, and other older titles that are included in the deal include the Jumanji and Hotel Transylvania series.",
    "It isn't specifically mentioned that Spider-Man is coming to Disney Plus – but since the press release mentions the streaming service and Spider-Man movies separately, the hope is that this is the reality Disney is moving towards. The two Tom Holland Spider-Man movies, along with The Incredible Hulk, are the only MCU movies you can't stream on the service – this means you have to rent or buy the Spidey films if you decide to watch the Marvel movies in order.",
    "Disney will get new Sony movies after Netflix US, which announced its own deal with the movie studio last week. The Tobey Maguire Spider-Man movies have previously been available on Hulu in the US. Other networks owned by Disney that are covered by this new deal include ABC, Disney Channels, Freeform, FX and National Geographic.",
    "This isn't much help if you're a UK viewer, then, but there is some good news if you're a British Spider-Man fan – Spider-Man: Far From Home is coming to Netflix UK on May 25.",
    "In short, while Disney owns Marvel and therefore the Spider-Man character, Sony holds the continuing rights to make movies based on the character – not to mention his villains, like Venom. That means Disney Plus has always had to do without the character's standalone films, which is a minor inconvenience.",
    "It's also why Sony can co-produce the canonical MCU movies with Disney, while also making stuff that's out of canon.",
    "The Incredible Hulk, meanwhile, has its distribution rights owned by Universal – which has surely proved to be lucrative for video on demand sales, in the wake of the MCU's growing popularity.",
    "This basically means you're unlikely to ever see a full roster of Marvel movies on Disney Plus, unless Disney manages to license all of these movies from the different studios at the same time."
  ],
  "headers": {
    "5": "Why aren't Spider-Man movies on Disney Plus?"
  },
  "links": {
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Spider-Man movies": "https://www.techradar.com/best/spider-man-movies-ranked",
    "Hulu": "https://www.techradar.com/reviews/hulu",
    "watch the Marvel movies in order": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "Sony movies after Netflix US": "https://www.techradar.com/news/uncharted-and-other-sony-movies-will-come-to-netflix"
  }
}