{
  "source": "https://www.techradar.com/news/8-paramount-plus-tv-shows-and-movies-worth-checking-out-this-weekend",
  "title": "8 Paramount Plus TV shows and movies worth checking out this weekend",
  "category": "entertainment",
  "updated": "2021-03-06T13:51:50Z",
  "author": "samuel-roberts",
  "summary": "Old and new, here are some highlights of the new streamer",
  "article": [
    "Paramount Plus landed earlier this week in the US – though a lot of the content will seem familiar if you're already a CBS All Access subscriber. This new service will eventually be the home to the Halo TV series, a Frasier reboot and big Paramount movies like Mission: Impossible 7 and A Quiet Place Part 2.",
    "In the meantime, the streamer has landed with a small helping of new originals, and whole bunch of worthwhile content from CBS All Access' library. Below, we've picked out 8 highlights worth checking out at launch on Paramount Plus, particularly if you're a new subscriber. You can sign up here if you're interested in taking a look at what's on offer, and our first impressions of Paramount Plus might help you decide if it's for you.",
    "The biggest CBS All Access originals are now the biggest Paramount Plus originals – and Discovery still feels like a flagship show for this rebranded service. This is the place you'll want to start if you're a new Star Trek fan, though every single Star Trek show is available to watch on Paramount Plus if you're in the mood for a long marathon.",
    "Despite the series firmly living in the shadow of previous entries by connecting its hero, Michael Burnham, to the Spock character, Discovery (at times) manages to capture the inventive sci-fi storytelling of preceding series, helped by an enormous effects budget. This show has a great cast and takes big swings in terms of plot twists, but it's frustratingly inconsistent in quality – hopefully the upcoming Star Trek: Discovery season 4 will impress.",
    "This series sees Patrick Stewart reprising the role of Jean-Luc Picard in a story tied directly to 2002's movie Nemesis – with the retired admiral still mourning the death of Data. He soon learns something about Data that takes him back into the stars, this time on the La Sirena with a grab bag of crewmates. Honestly, this show doesn't quite hit its full potential due to its mostly unlikeable cast and meandering story, despite a number of great cameos from Next Generation and Voyager – but it's still worth a watch, and hopefully Star Trek: Picard season 2 will offer a more satisfying arc.",
    "The recent version of The Stand didn't draw massive acclaim for CBS All Access, but if a big-budget Stephen King adaptation and a sprawling post-apocalypse sounds like your sort of thing, this is definitely one reason to check out Paramount Plus. Alexander Skarsgård leads a massive ensemble cast in this adaptation partly directed by The New Mutants' Josh Boone, which features King's involvement.",
    "Sadly, you only get a selection of classic acoustic performances from MTV's archives on Paramount Plus – nine, in fact, across over three decades, which is probably because of rights factors related to the music. But of the offerings on the service, the classic Nirvana performance from 1993, and Pearl Jam's show from 1994 are absolutely perfect Friday night entertainment if you're missing live music right now. Be prepared for a delightful time warp.",
    "Look, if you've got Netflix in the US, you can already stream these animated classics without spending extra on Paramount Plus. But these are significant series to the streamer – that's because a cornerstone of Paramount Plus will be offering new content set in this fantasy universe, with a new studio set up specifically to do just that. Avatar: The Last Airbender and The Legend of Korra are two of the most gorgeous-looking and inventive animated series in Nickelodeon's canon. Avatar is set in a world where a select few can 'bend' the elements – with protagonist Aang going on a journey to master all four elements and keep peace between the world's nations.",
    "If you're expecting the Jordan Peele-produced and hosted reboot of The Twilight Zone to offer two seasons of episodes as good as his movies Get Out and Us, you'll be disappointed – it's a more pedestrian show than you might think. But that's not to say it doesn't have its own great spins on classic Twilight Zone-style twist ending stories, and some of the guest stars in these episodes (Seth Rogen, Jurnee Smollett and John Cho among them) are extremely impressive. These 20 episodes are well worth a watch, even if the quality varies, as ever is the case with anthology shows.",
    "That said, you've also got the original Rod Serling version of The Twilight Zone to check out on Paramount Plus if you'd prefer.",
    "If there's one big original to check out on launch day for Paramount Plus – and you know you're a SpongeBob Squarepants fiend – then this CG-animated movie is a good place to start. Originally intended for a theatrical release, it actually launched on Netflix around the world last year. In the US, you can stream it on this newer service.",
    "CBS All Access has an okay selection of movies, and the intent is to grow the library with the post-launch period of Paramount Plus. Still, if you want a classic to watch on day one – well, two classics, broken up by a slightly lesser second movie – the three Indiana Jones movies are all streaming on Paramount Plus from day one. They remain extremely enjoyable, classic adventure films – and as long as you avoid the fourth entry, Kingdom of the Crystal Skull, which is also on Paramount Plus, you should be okay."
  ],
  "headers": {
    "2": "Star Trek: Discovery",
    "4": "Star Trek: Picard",
    "5": "The Stand",
    "6": "MTV Unplugged",
    "7": "Avatar: The Last Airbender and The Legend of Korra",
    "8": "The Twilight Zone",
    "10": "The SpongeBob Movie: Sponge on the Run",
    "11": "The Indiana Jones trilogy"
  },
  "links": {
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch",
    "Halo TV series": "https://www.techradar.com/news/the-halo-tv-show-finally-has-a-tentative-release-date-and-a-new-streaming-home",
    "Frasier reboot": "https://www.techradar.com/news/new-frasier-series-will-revive-classic-90s-sitcom-for-new-netflix-rival",
    "You can sign up here": "https://paramountplus.qflm.net/c/221109/175360/3065?subId1=trd-us-1010027712794022400&sharedId=trd-us&u=https%3A%2F%2Fwww.paramountplus.com%2F",
    "first impressions of Paramount Plus": "https://www.techradar.com/news/paramount-plus-is-yet-another-streaming-service-do-you-actually-need-it",
    "Star Trek: Discovery season 4": "https://www.techradar.com/news/star-trek-discovery-season-4",
    "death of Data": "https://www.techradar.com/news/star-trek-picard-data-death-explained",
    "Star Trek: Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2"
  }
}