{
  "source": "https://www.techradar.com/news/microsofts-second-gen-foldable-phone-has-a-bigger-battery-more-cameras-and-5g",
  "title": "Microsoft's second-gen foldable phone has a bigger battery, more cameras and 5G",
  "category": "phones",
  "updated": "2021-09-22T15:50:46Z",
  "author": "tom-bedford",
  "summary": "Meet Microsoft Surface Duo 2",
  "article": [
    "Just over a year on from the launch of the Microsoft Surface Duo, the tech giant has unveiled its second-generation foldable phone called, as you may well have guessed, the Microsoft Surface Duo 2.",
    "The Duo 2 comes with upgrades across the board to make it a more tempting purchase, and a more useful productivity tool, than its predecessor - though one of the upgrades is the price.",
    "In the US, the Surface Duo 2 costs $1,499 (roughly £1,100, AU$2,080), which is a slight bump up from the $1,399 / £1,350 (about AU$1,930) starting price of the original - expect prices elsewhere in a few months time, as the first model launched in the UK five months after its US debut.",
    "While the Microsoft Surface Duo 2 has the same form factor as its predecessor, it's actually got upgrades across the board.",
    "Instead of having a 5.6-inch folded and 8.1-inch unfolded display, the screen size on the new model is 5.8-inch folded and 8.3-inch unfolded, and there's a slight resolution bump for each of them too.",
    "The battery is bigger, clocking in at 4,449mAh instead of 3,577mAh, and the charging speed has seen a boost at 23W instead of 18W. Given the bigger battery, though, charging times might actually be slightly longer.",
    "Perhaps the biggest improvement the Surface Duo 2 sees is in the camera department. Instead of having a single 11MP snapper, there's a 12MP main, 16MP ultra-wide and 12MP telephoto snapper with 2x optical zoom.",
    "A change that'll be super useful for professionals is the ability to connect to 5G networks, something the original lacked, and which will be useful for downloading documents and getting a reliable cellular connection. That's tied to the new chipset, the Snapdragon 888, which should provide top processing power.",
    "Microsoft also announced new Surface Pro 8, Surface Go 3 and Surface Pro X tablets, as well as a brand-new Surface Laptop Studio as well."
  ],
  "headers": {
    "3": "What you need to know about the Microsoft Surface Duo 2"
  },
  "links": {
    "Microsoft Surface Duo": "https://www.techradar.com/news/microsoft-surface-duo-is-the-surface-phone-weve-been-waiting-for?region-switch=US",
    "foldable phone": "https://www.techradar.com/best/best-foldable-phones",
    "Microsoft Surface Duo 2": "https://www.techradar.com/reviews/surface-duo-2",
    "announced new Surface Pro 8, Surface Go 3 and Surface Pro X tablets, as well as a brand-new Surface Laptop Studio": "https://www.techradar.com/news/microsoft-announces-surface-go-3-surface-laptop-studio-surface-pro-8-and-more-ahead-of-windows-11-launch"
  }
}