{
  "source": "https://www.techradar.com/news/iphone-13-notch",
  "title": "iPhone 13 notch: will Apple switch to an under-display camera in 2021?",
  "category": "phones",
  "updated": "2021-07-15T16:03:37Z",
  "author": "michael-hicks",
  "summary": "Four years of iPhone notches and counting",
  "article": [
    "Apple fans and tech nerds have spent months examining every alleged iPhone 13 leak, seeking a sneak peek into Apple's iPhone 12 follow-up. One of the biggest questions on their minds is whether the iPhone 13 will remove Apple's trademark notch.",
    "Since Apple unveiled the notch on the 2017 iPhone X, other Android phones have adopted waterdrop notches, punch hole cut-outs, thick bezels, and other methods to embed or conceal the selfie cam. But Apple iPhone notches have remained consistent across four generations, for better or worse.",
    "The supposed solution? An under-display selfie cam that takes photos through your panel glass without taking up screen space, as found in the ZTE Axon 20 5G. But its selfies underwhelmed our reviewer, and it's unclear whether or not the technology that makes under-display sensors work is truly ready for a flagship phone.",
    "We've seen several iPhone 13 design leaks across 2021, and we think we can safely predict what will happen with the iPhone 13 notch and its selfie camera. Anyone expecting an innovative overhaul should prepare to be disappointed.",
    "If the many iPhone 13 leaks we've spotted prove accurate, its only new in-screen tech will be an in-screen fingerprint sensor that brings Touch ID back to iPhones. Everything we've seen suggests the notch will return.",
    "This isn't necessarily surprising: we've heard from some reputable sources that the 2021 iPhone could actually be called the iPhone 12S, and that Apple's engineers aren't treating it as a full upgrade on the 12. Because of that, it's fair to assume that the new phone – whatever it's called – won't have any major design changes.",
    "Still, we do believe that Apple will make the iPhone 13/ 12S notch smaller than ever before.",
    "As early as December 2020, we learned that Apple had plans to shrink the notch by condensing its selfie-cam chip to take up less room. Several other leakers confirmed this theory, and by April we began to see leaked renders and dummy units showing a shrunk notch.",
    "Admittedly, the iPhone 13 notch is still (supposedly) two-thirds the size of the current notch. But it'll leave more room on either side for notification icons. Apple could let you add the actual battery percentage to the home screen again – something it had to remove from the iPhone X onwards – or just make the icons bigger.",
    "With so many sources backing one another up, we're almost positive Apple's next phone won't have an in-screen camera. But we're less certain whether or not it will even be called the iPhone 13. So, assuming the iPhone 13 comes out in 2022 instead of 2021, will the technology be ready by then?",
    "We've heard different rumors on this score. One from Apple analyst Ming-Chi Kuo suggested that the 2022 iPhone lineup could have a punch-hole cutout. Referring to them as iPhone 14s, Kuo suggested that the 14 Pro and Pro Max could get the cutout, while the base 14 and 14 Mini would retain the shrunken notch.",
    "Apple certainly could go down this route, but it wouldn't exactly play into Apple's brand of 'innovation': Android phones have used punch holes for years now.",
    "Kuo continued on to say that the 2023 iPhone 15 (or whatever its name) would have in-display Face ID that would allow Apple to erase the notch for good. But that's still a good two generations away, and it's likely the technology is still a work in progress.",
    "Another tipster claimed that Apple had made a prototype iPhone 13 with thick bezels on all sides to disguise the selfie camera, removing the need for a notch, and that the design wouldn't be ready until 2022.",
    "Frankly, this prototype sounds like an upgraded iPhone SE, which has thick bezels and no notch; while we like the SE as a budget phone, it's not exactly a looker. We doubt the mainstream iPhones adopt this design.",
    "More and more smartphone companies are working on under-display cameras. The Xiaomi Mi Mix 4 has one and is scheduled to ship out this year. 2021 Oppo and Vivo phones also could feature the technology. Even Samsung and Google are allegedly working on under-display cameras – though they need more time for the technology to work.",
    "A Google patent showed a possible under-display design where a rotating mirror would either reflect the selfie cam sensor or a secondary display through a tiny window in the phone panel. But we know this won't make an appearance on the Pixel 6 and likely won't appear until 2022 at the earliest.",
    "As for Samsung, despite a recent rumor that the Galaxy S22 would have an under-display cam, another subsequent leak suggested that Samsung would have trouble producing this camera design at a large enough scale to match predicted S22 sales. More importantly, Samsung isn't happy with the picture quality according to that same source.",
    "We might see an embedded selfie cam on the Galaxy Z Fold 3, but that will be a much more niche and expensive device. A mainstream Samsung flagship with one might not appear until 2023 at this rate.",
    "We're certain that the under-display camera trend is going to happen. But we're still waiting on evidence that these cameras can produce high-quality photos or video. And compared to Android phone makers, Apple doesn't appear to have progressed as far on the technology.",
    "In other words, iPhone fans should continue to be patient with Apple's pesky notches, and hope that something changes in the next year or two (or three)."
  ],
  "headers": {
    "4": "A narrower notch, but a notch nonetheless",
    "9": "When will Apple release an under-display camera?",
    "15": "Part of an industry trend"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone X": "https://www.techradar.com/reviews/iphone-x-review",
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "ZTE Axon 20 5G": "https://www.techradar.com/reviews/zte-axon-20-5g-review",
    "in-screen fingerprint sensor": "https://www.techradar.com/news/another-iphone-13-leak-points-to-in-screen-touch-id-and-a-smaller-notch",
    "iPhone 12S": "https://www.techradar.com/news/iphone-12s-or-iphone-13",
    "learned": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-even-more-camera-sensors",
    "renders": "https://www.techradar.com/news/iphone-13-and-iphone-13-pro-design-could-look-something-like-this",
    "dummy": "https://www.techradar.com/news/the-smaller-iphone-13-notch-shows-up-again-in-another-image-leak",
    "units": "https://www.techradar.com/news/iphone-13-dummy-unit-shows-off-smaller-notch-larger-cameras",
    "suggested": "https://www.techradar.com/news/heres-why-the-iphone-13-will-quickly-look-dated-next-year-says-top-analyst",
    "claimed": "https://www.techradar.com/news/iphone-13-could-opt-for-thicker-bezels-so-it-can-ditch-the-notch",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "Xiaomi Mi Mix 4": "https://www.techradar.com/news/xiaomi-mi-mix-4-leaks-with-under-display-selfie-camera",
    "feature": "https://www.techradar.com/news/expect-2021s-upcoming-android-phones-to-embrace-under-display-selfie-cameras",
    "patent": "https://www.techradar.com/news/google-pixel-6-might-not-have-under-display-camera-but-pixel-7-might",
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "rumor": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-may-have-a-major-zoom-upgrade-and-an-in-screen-camera",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "leak": "https://www.techradar.com/news/samsung-galaxy-s22-probably-wont-have-an-under-display-camera",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review"
  }
}