{
  "source": "https://www.techradar.com/news/oops-intel-accidentally-promotes-the-apple-macbook-pro",
  "title": "Oops, Intel accidentally promotes the Apple MacBook Pro",
  "category": "computing",
  "updated": "2021-04-08T12:49:11Z",
  "author": "rhys-wood",
  "summary": "Back to the drawing board?",
  "article": [
    "Intel has been giving Apple a hard time with its line of recent ads that highlight what it deems to be shortcomings with the Apple M1 MacBook Pro, while promoting the power of Intel’s 11th-generation processors in Windows laptops.",
    "But, in what appears to be an unfortunate if amusing oversight, an Intel ad spotted on Reddit eschewed a Windows laptop for a MacBook Pro. Intel processors are still used with some Macs, but this blunder (if it is indeed a blunder) seems to go against Intel’s promotion of Windows laptops over Apple’s lineup, and it was quickly shared on social media.",
    "The ad in question is promoting the Intel Core i7-1185G7 CPU, and features a still taken from Getty Images that shows a man working on what appears to be a MacBook Pro, accompanied by the tagline: “The world’s best processor on a thin and light laptop.” While that looks innocent enough to the average web browser, it sticks out as a stark contradiction of Intel’s recent anti-Mac messaging.",
    "A closer look at the Getty Images page for the image reveals an expanded gallery from the same series, which gives us a better look at not only the MacBook Pro, but also at what is very clearly an Apple Magic Mouse being used.",
    "While this is a humorous oversight on the face of it, it’s entirely possible that the mistake could dent the impact of Intel’s recent marketing campaign. The company even went as far as to feature Justin Long – famous for his role in the classic ‘I’m a Mac’ Apple commercials – to positively compare Intel’s processors with Apple’s M1 processors.",
    "What’s even stranger is that MacBooks don’t (and won’t) have Intel’s 11th-generation processors built in, as Apple is itself moving away from third-party CPUs in favor of its own chips. So this is certainly a case where a little more research would have been beneficial before the ad was approved."
  ],
  "headers": {
    "3": "Mixed messaging"
  },
  "links": {
    "Apple M1 MacBook Pro": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Intel Core i7-1185G7 CPU": "https://www.techradar.com/news/intel-11th-gen-core-i7-1185g7-benchmarks-suggests-amd-could-have-a-fight-on-its-hands",
    "Getty Images": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_8786328571539934000&xs=1&url=https%3A%2F%2Fwww.gettyimages.co.uk%2Fdetail%2Fphoto%2Fmillennial-man-playing-computer-game-on-laptop-at-royalty-free-image%2F1222829773%3Firgwc%3D1%26esource%3DAFF_GI_IR_Skimbit%2520Ltd._10078%26asid%3DSkimbit%2520Ltd.%26cid%3DGI%26utm_medium%3Daffiliate%26utm_source%3DSkimbit%2520Ltd.%26utm_content%3D10078&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Foops-intel-accidentally-promotes-the-apple-macbook-pro",
    "expanded gallery": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1078098885517234800&xs=1&url=https%3A%2F%2Fwww.gettyimages.co.uk%2Fsearch%2Fstack%2F798830946%3Fassettype%3Dimage%26family%3Dcreative&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Foops-intel-accidentally-promotes-the-apple-macbook-pro",
    "Apple Magic Mouse": "https://www.techradar.com/reviews/pc-mac/peripherals/input-devices/mice-and-trackballs/apple-magic-mouse-644831/review"
  }
}