{
  "source": "https://www.techradar.com/news/huge-airpods-deal-amazon-has-the-latest-model-airpods-on-sale-for-dollar13998",
  "title": "Huge AirPods deal: Amazon has the latest model AirPods on sale for $139.98",
  "category": "audio-visual",
  "updated": "2021-08-01T18:02:30Z",
  "author": "mackenzie-frazier",
  "summary": "Score a massive $59 price cut on Apple's best-selling earbuds",
  "article": [
    "We're rounding up today's best AirPods deals and we've just spotted a price drop on Apple's latest model AirPods with wireless charging case. Right now, Amazon has the 2019 AirPods on sale for $139.98 (was $199). That's a $59 discount and the best price you can find right now for the wireless earbuds.",
    "The Apple AirPods received an upgraded H1 Chip that results in faster pairing and seamless connectivity. The H1 chip also allows you to use your voice to ask Siri questions. You can adjust the volume, skip songs, and make calls completely hands-free. The earbuds also come with a wireless charging case that offers 24 hours of battery overall, with 5 hours of battery life (three hours of talk time) on a single charge. As we've mentioned above, this is the best price you can find right now and only $10 more than the record-low price. Apple's lastest-model AirPods have been sitting at $159.99 for most of this year, so we'd snap up this new low price while you can.",
    "You can also shop for more offers with the best AirPod deals and sales and see the best AirPods Pro deals and sales that are happening now. You can see more tech bargains with our roundup of the best back to school sales and learn about the upcoming Labor Day sales event."
  ],
  "headers": {
    "1": "AirPods deal",
    "2": "More AirPods deals"
  },
  "links": {
    "on sale for $139.98": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FApple-AirPods-Wireless-Charging-Latest%2Fdp%2FB07PYLT6DN%2F%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1187321822245718500-20",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "best AirPod deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "best AirPods Pro deals and sales": "https://www.techradar.com/deals/cheap-airpods-pro-prices-sales-deals",
    "back to school sales": "https://www.techradar.com/news/best-back-to-school-sales-2020",
    "Labor Day sales": "https://www.techradar.com/news/the-best-labor-day-sales-2020"
  }
}