{
  "source": "https://www.techradar.com/news/nintendo-ramps-up-switch-production-but-what-about-nintendo-switch-pro",
  "title": "Nintendo Switch Pro may be in doubt as Nintendo ramps up Switch production",
  "category": "gaming",
  "updated": "2021-05-04T14:47:51Z",
  "author": "adam-vjestica",
  "summary": "A new Nintendo Switch might not be announced for a while yet",
  "article": [
    "Nintendo is increasing its output of Nintendo Switch consoles to 30 million units this fiscal year in a bid to meet demand, according to Nikkei Asia.",
    "Nintendo has approached multiple suppliers to accelerate production, according to Nikkei’s sources, something which has been difficult due to the global semiconductor shortage, which has also impacted supply of PS5 and Xbox Series X consoles.",
    "Back in February, Nintendo President Shuntaro Furukawa said the company had secured an adequate supply of components, but that didn’t mean Switch production wouldn’t be impacted in the future by the supply shortage.",
    "\"We have experienced higher-than-expected demand this year as well, and there is a possibility that certain products will be in short supply, especially in Japan,\" said Furukawa.",
    "Nintendo's new production target marks an all-time high for the hybrid device, as the company is hoping to take full advantage of the demand that’s been generated during Covid-19 as more people have turned to gaming while staying at home.",
    "If Nintendo is able to shift the 30 million units it's tipped to produce this year, it would mean that the Switch would overtake the Wii as Nintendo’s best-selling console of all time. The Nintendo Switch has sold approximately 80 million units as of the end of 2020, and the Wii reached 110 million units in its lifetime.",
    "It’s strange for a company to increase production of a console that is already in its fifth year on the market, but clearly Nintendo believes that the Switch has plenty of life in it yet. But does the move to increase Nintendo Switch production have the potential to scupper a Nintendo Switch Pro from coming to market? Not really.",
    "Nikkei still thinks that the long-rumored Nintendo Switch Pro will be released at some point in the future, with March 2022 the latest date to be suggested. The Nintendo Switch Pro is tipped to have a 720p OLED screen and will be capable of displaying games in 4K resolution when attached to the dock (presuming it has something similar).",
    "The Nintendo Switch still has some big games on the way, of course, with Breath of Wild 2, Metroid Prime 4 and Bayonetta 3 all scheduled to arrive in the near future. Nintendo recently released New Pokémon Snap, too, which revives the 1999 original N64 game for a brand new audience."
  ],
  "headers": {
    "6": "Super Switch"
  },
  "links": {
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nikkei Asia": "https://asia.nikkei.com/Business/Electronics/Nintendo-raises-Switch-output-to-record-30m-on-stay-at-home-demand",
    "global semiconductor shortage": "https://www.techradar.com/news/ps5-and-xbox-series-x-restock-announced-for-cyber-monday-at-walmart",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Nintendo Switch has sold approximately 80 million units": "https://www.techradar.com/news/nintendo-switch-success-not-a-surprise-says-former-nintendo-president",
    "March 2022": "https://www.techradar.com/news/nintendo-switch-2-could-release-before-march-2022-according-to-new-report",
    "720p OLED screen": "https://www.techradar.com/news/why-the-nintendo-switch-2s-720p-oled-screen-would-make-perfect-sense",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "Breath of Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2",
    "Metroid Prime 4": "https://www.techradar.com/news/metroid-prime-4",
    "Bayonetta 3": "https://www.techradar.com/news/bayonetta-3",
    "New Pokémon Snap": "https://www.techradar.com/reviews/new-pokemon-snap-review"
  }
}