{
  "source": "https://www.techradar.com/news/nothing-ear1-wireless-earbuds-will-come-with-airpods-beating-battery-life",
  "title": "Nothing Ear1 wireless earbuds will come with AirPods-beating battery life",
  "category": "audio-visual",
  "updated": "2021-07-20T14:43:14Z",
  "author": "olivia-tambini",
  "summary": "Plus, new images of the charging case have been revealed",
  "article": [
    "Carl Pei's new company Nothing has revealed more details about the brand's upcoming true wireless earbuds.",
    "The Nothing Ear1, which are expected to launch on July 27, will come with up to 34 hours of battery life with active noise cancellation switched off, which is more than the Apple AirPods offer.",
    "That battery life will fall to 24 hours with ANC switched on – that's the same as the Sony WF-1000XM4, which are the best true wireless earbuds you can buy in 2021.",
    "The 570mAh charging case will support fast charging, too; that means a quick 10-minute charge will give you six hours of playback with ANC on, or eight hours with this feature switched off.",
    "There's also support for wireless charging, which means you'll be able to pop it on a Qi-certified mat instead of plugging it in when you need a top up.",
    "Nothing has also released new images of the charging case, which shows off its transparent design. Previous images released by the company alluded to case made of a see-through material, but this is the clearest look we've had so far.",
    "Judging from these images, it looks like the earbuds themselves will sport rounded oval housings and protruding stems, like the Apple AirPods Pro.",
    "The Nothing Ear 1 will cost just $99 / £99 (around AU$180). That's not only cheaper than Apple's ANC in-ear headphones (which cost $249 / £249 / AU$399 at launch), but also most other noise-cancelling earbuds on the market right now.",
    "For those that aren't able to wait, the earbuds went on sale exclusively on StockX on July 19, allowing customers to bid on the first 100 units. These models will come with a serial number engraving – but with the highest bid set at £576 (about $780 / AU$1,000), you're much better off waiting until the Nothing Ear 1 launch officially on July 27."
  ],
  "headers": {
    "5": "Nothing to see here"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Apple AirPods": "https://www.techradar.com/reviews/apple-airpods-2019-review",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "best true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "in-ear headphones": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "noise-cancelling earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "exclusively on StockX": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-1142803541332084100&url=https%3A%2F%2Fstockx.com%2Fdropx-exclusive-nothing-the100-ear-1-serialized&article_name=Nothing%20Ear1%20wireless%20earbuds%20will%20come%20with%20AirPods-beating%20battery%20life&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fnothing-ear1-wireless-earbuds-will-come-with-airpods-beating-battery-life"
  }
}