{
  "source": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-will-launch-this-year-to-take-on-nvidia-dlss",
  "title": "AMD's FidelityFX Super Resolution will launch this year to take on Nvidia DLSS",
  "category": "computing",
  "updated": "2021-03-18T11:42:32Z",
  "author": "jess-weatherbed",
  "summary": "AMD's AI-powered graphics booster is almost here",
  "article": [
    "AMD has confirmed that FidelityFX Super Resolution, Team Red's AI-powered graphics booster to rival Nvidia's DLSS (Deep Learning Super Sampling), will be coming to RDNA 2-powered gaming PCs this year.",
    "FidelityFX was initially teased when the Radeon 6000 graphics cards were announced, but actual launch information has been kept behind locked doors leading to a lot of rumors about when, or even if, we would be seeing it launch.",
    "The previous murmurs surrounding the release were that we would see AMD's FidelityFX coming to Radeon RX GPUs in March 2021, something that was clearly a tad optimistic. Scott Herkelman (CVP & GM at AMD Radeon) in an interview with PCWorld confirmed that their rival to Nvidia's DLSS program is still on the cards and planned for a launch later in 2021. \"It’s progressing very well internally in our lab, but it’s our commitment to the gaming community that it needs to be open that it needs to work across all things and game developers need to adopt it. Even though it’s progressing well, we still have more work to do and not only internally but with our game developer partners. We want to launch it this year. We believe we can do that this year, but at the same time we a lot more work ahead of us. We need to make sure the image quality is there. We need to make sure it can scale from different resolutions. And at the same time that our game developers are happy with what we are producing.\"",
    "AMD's caution for the launch is understandable. Despite Nvidia getting the jump on AMD with its AI frame-boosting tech all the way back in 2018 for the GeForce 2000 series GPUs, DLSS 1.0 was far from the beast that it is today. There were initially very few games that you could use DLSS on, and the actual results varied massively across players, with some seeing a large drop in graphics quality when using the feature. When DLSS 2.0 was developed, super-sampling managed to earn a deserved reputation for consistently boosting framerates while preserving resolution and graphics. In fact, some people have found that certain titles can be almost impossible to play at advertised graphics without the help of DLSS if you want to use ray tracing, giving the feature further praise in demanding titles such as Cyberpunk 2077 or Watch Dogs: Legion. There's no doubting that the current DLSS 2.0 is a genuine gamechanger for folk looking to really kick up both resolution and framerates, without having to fork out the cash for a more expensive system.",
    "The launch for the Big Navi cards late last year finally introduced ray tracing to the AMD lineup of GPUs, and even though both the Radeon RX 6800 and Radeon RX 6800 XT are fantastic graphics cards, they simply didn't have the appeal of cards such as the GeForce RTX 3080 or RTX 3070 because they lacked similar technology to DLSS.",
    "Since AMD's Big Navi cards didn't have an answer to supersampling, they had to render each frame at higher resolutions, a process that made the cards much slower than its Nvidia equivalents when trying to match graphical output.",
    "With FidelityFX, however, AMD should be able to cut into Nvidia's advantage on this front, making their cards much more competitive against comparable Nvidia RTX 3000-series graphics cards.",
    "Nvidia has long dominated lists like the Steam Hardware Survey likely due to both availability and customer demand. With Radeon GPUs typically being more affordable than GeForce equivalents however, we may finally see AMD fighting back.",
    "Via WCCFTech"
  ],
  "headers": {
    "3": "Long live the king",
    "4": "Can AMD finally knock Nvidia off its throne?"
  },
  "links": {
    "DLSS": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "Radeon 6000 graphics cards": "https://www.techradar.com/news/amd-big-navi",
    "FidelityFX coming to Radeon RX GPUs in March 2021": "https://www.techradar.com/news/amd-fidelityfx-super-resolution-might-launch-in-march-to-challenge-nvidia-dlss",
    "PCWorld": "https://youtu.be/jENqMuHJgow",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Watch Dogs: Legion": "https://www.techradar.com/reviews/watch-dogs-legion",
    "Big Navi": "https://www.techradar.com/news/amd-big-navi",
    "Radeon RX 6800": "https://www.techradar.com/reviews/amd-radeon-rx-6800",
    "Radeon RX 6800 XT": "https://www.techradar.com/reviews/amd-radeon-rx-6800-xt",
    "GeForce RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "WCCFTech": "https://wccftech.com/amd-confirms-fidelityfx-super-resolution-nvidia-dlss-competitor-will-launch-this-year/"
  }
}