{
  "source": "https://www.techradar.com/news/slack-is-getting-a-major-overhaul-for-the-hybrid-working-future",
  "title": "Slack is getting a major overhaul for the hybrid working future",
  "category": "computing",
  "updated": "2021-07-01T05:34:34Z",
  "author": "anthony-spadafora",
  "summary": "Reimagined voice and video capabilities are coming to Slack",
  "article": [
    "As teams and businesses around the world prepare to return to the office, Slack has introduced several new tools aimed at supporting hybrid working so that organizations can adopt a digital-first approach to work.",
    "One of the things that employees miss most when working from home is being able to drop by a coworker's desk or catch up in the hallway for quick casual conversations before starting their day or having a meeting. While most video conferencing software solutions now offer breakout rooms, talking in a small group just can't compare with the spontaneous and informal discussions workers once had at the office.",
    "For this reason, Slack is introducing a lightweight audio-first way to start live conversations called Slack Huddles. In just one click, users of the company's online collaboration software will be able to start a huddle in any channel or direct message including those shared with workers from outside their organization. Just like in the office, anyone is free to come into and out of a huddle as they please almost as if they were walking by your desk. Slack Huddles also help give workers a break from being in front of the camera since they're audio-only.",
    "Whether it's on Zoom or Microsoft Teams, the endless stream of meetings while working remotely has worn employees out. Also finding a time that works for everyone can be difficult which is why Slack is bringing a new way to easily create and share video, voice and screen recordings using its service. When a recording is shared in Slack, anyone can watch it whenever they have time and this can be especially helpful for organizations with remote, distributed workforces.",
    "Figuring out who everyone is can be quite hard when starting out at a new company and working remotely has only made this worse.",
    "To give new employees and even company veterans more context into who they're working with, Slack has created Slack Atlas. This new feature enhances user profiles with rich dynamic information including a company's organizational structure, employee start dates and even custom fields.",
    "Slack is also giving paid teams the ability to schedule when recordings or messages are delivered so that workers can time their online interactions with one another based on everyone's schedules. If you know a co-worker has singed of for the evening, you can schedule a message instead of sending immediately so you don't disrupt their work-life balance.",
    "It's also worth noting that both Slack Huddles and recordings will offer live captioning so that everyone at an organization can feel included from the start.",
    "We'll likely hear more regarding Slack's major overhaul once the company begins rolling out all of the new features it has announced to make hybrid working a bit easier for both employees and their organizations."
  ],
  "headers": {
    "4": "Slack Atlas and scheduling"
  },
  "links": {
    "Slack": "https://www.techradar.com/news/slack-is-finally-adding-this-vital-messaging-feature",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "online collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "being in front of the camera": "https://www.techradar.com/news/academics-have-identified-exactly-why-video-conferencing-has-you-feeling-exhausted",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "distributed workforces": "https://www.techradar.com/news/what-a-decade-of-distributed-work-has-taught-us-about-the-future",
    "schedule a message": "https://www.techradar.com/news/slack-is-finally-adding-this-vital-messaging-feature",
    "live captioning": "https://www.techradar.com/news/googles-excellent-live-captioning-feature-is-now-baked-into-chrome"
  }
}