{
  "source": "https://www.techradar.com/news/where-is-the-google-pixel-5a",
  "title": "Where is the Google Pixel 5a?",
  "category": "phones",
  "updated": "2021-08-03T16:00:29Z",
  "author": "jon-mundy",
  "summary": "When does 6 come before 5? When you’re Google, apparently",
  "article": [
    "Google has surprised us all by announcing the Pixel 6 and the Pixel 6 Pro. Or rather, pre-announcing.",
    "To be clear, this wasn’t a specs-and-all reveal of the company’s next big smartphone line. We have no (officially confirmed) idea how many megapixels, GHz, pixels and nits these phones are capable of spitting out. No YouTubers have been filmed fondling Google’s next flagship phone.",
    "What we did get was a curious press briefing featuring an overview of what the Pixel 6 had to offer, along with a hatful of artfully composed official shots. All very exciting indeed - and also slightly odd.",
    "Quite aside from the novelty of the pre-announcement format itself, something has been left behind here. Where on Earth is the Google Pixel 5a?",
    "First let’s make one thing quite clear: the Google Pixel 5a exists. We’re as certain of that as it’s possible to be without a weird official pre-launch press release.",
    "But that’s largely because of a bunch of weird rumors that popped up suggesting the Pixel 5a had been cancelled. This in turn prompted Google itself to issue a statement dispelling said rumors, and confirming that the Pixel 5a 5G (yes, it explicitly used that title) would launch around the same time as the Pixel 4a launched last year.",
    "“Pixel 5a 5G is not canceled,” a Google spokesperson told 9to5Google. “It will be available later this year in the US and Japan and announced in line with when last year’s a-series phone was introduced.”",
    "To save you taking to the internet, last year’s ‘a-series’ was announced in August (for the 4G model) and September (for the 5G model) of 2020.",
    "However, that confirmation from Google didn’t so much dispel the Pixel 5a weirdness as shift it elsewhere. Note that in confirming the Pixel 5a 5G’s existence, Google only said that it would be releasing the phone in the US and Japan. That’s oddly specific.",
    "Are we to take it, then, that the Pixel 5a won’t be launching in the UK, Australia, and other territories? Or is it just that there will be both a 5G model and a 4G model, and that the two won’t necessarily be available in the same countries?",
    "It’s a mightily strange state of affairs alright. But then, 2021 has been a bit of a weird year for smartphones.",
    "Google isn’t alone in being a bit out there with its approach to smartphone releases. As my colleague James Rogerson pointed out recently, several high profile late–2021 phones are seemingly set to be delayed or canceled.",
    "None other than Samsung itself, the largest smartphone manufacturer in the world, has effectively cancelled its late–2021 flagship line. There will be no Samsung Galaxy Note 21 this year, with the foldable Galaxy Z line set to take its place.",
    "We’ve also heard reports that there has been a delay to the Samsung Galaxy S21 FE, and even that it might not launch at all.",
    "Away from Samsung, there are rumors circling that there will be no OnePlus 9T. The brand’s flagship revisions have become a highlight of the Holiday release schedule in recent years, but that could be a thing of the past.",
    "Let’s not downplay the level of upheaval here. We’re talking about follow-ups to three of the best-loved and most popular phones of the second half of 2020. Four if you count the Pixel 4a and the uncertainty surrounding its successor.",
    "It’s all too easy to find a culprit for all this weirdness. The Covid–19 pandemic has put a major dampener on everything from supply lines to production capacity. Quite simply, less stuff is being produced, which hasn’t been helped by a concurrent global chipset shortage.",
    "Despite these parallels, we’re way more hopeful about the Pixel 5a’s prospects - and not merely because Google has officially confirmed that it’s still coming.",
    "While you’d never catch us making it, there is an argument that the Galaxy S21 FE, the OnePlus 9T, and even the Galaxy Note 21 don’t really need to exist. For all their fancy tweaks, they would essentially be half-year iterations on early-year flagships, which seems a little extravagant in these belt-tightening times.",
    "By contrast, the Pixel 5a will be a true annual update. Despite its reportedly familiar design, it’s going to be a proper follow-up to an impressively affordable phone with a great camera that launched a whole year ago. That’s the natural peak-operating life cycle for any smartphone.",
    "There’s still a clearly defined place for the Google Pixel 5a on this topsy turvy smartphone market, even if Google doesn’t quite seem to know exactly where it is or how it should be communicated."
  ],
  "headers": {
    "4": "Rumor has it",
    "11": "Weirdness pandemic",
    "17": "Hope for the Pixel 5a"
  },
  "links": {
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "9to5Google": "https://9to5google.com/2021/04/09/google-pixel-5a-5g-official/",
    "pointed out recently": "https://www.techradar.com/news/why-do-2021s-smartphones-like-the-galaxy-note-21-keep-being-delayed-or-canceled",
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Samsung Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled"
  }
}