{
  "source": "https://www.techradar.com/news/mfa-could-be-the-future-of-workplace-security",
  "title": "MFA could be the future of workplace security",
  "category": "computing",
  "updated": "2021-04-27T18:00:19.727Z",
  "author": "anthony-spadafora",
  "summary": "MFA adoption is increasing as organizations realize work from home is here to stay",
  "article": [
    "Organizations have increased their spending on multi-factor authentication (MFA) during the pandemic as more employees worked from home than ever before and this trend looks set to continue according to a new report from Yubico and 451 Research.",
    "To compile the new report titled “Work-from-Home Policies Driving MFA Adoption, But Still Work to be Done”, 451 Research surveyed 200 executive management, senior IT management, mid-level management, senior security and risk staff across a number of different industries to reveal that nearly 75 percent of enterprise security and risk managers plan to increase MFA spending going forward.",
    "There are many reasons for this including the fact that most security breaches are the result of stolen credentials and phishing attacks, work from home policies are now becoming the new normal and greater adoption of modern authentication standards such as Fast Identity Online (FIDO) U2F, FIDO2 and WebAuthn.",
    "MFA was the top security technology adopted during the pandemic by organizations that wanted to secure their remote workforces. Of those surveyed by 451 Research, three out of four respondents (74%) said they plan to increase spending on MFA this year as well.",
    "One reason MFA has seen such high adoption recently is because 53 percent of respondents have experienced a security incident or breach in the past year. However, user experience (43%), complexity (41%) and cost (36%) are still the main obstacles to MFA adoption.",
    "Reliance on SMS-based or two-factor authentication (2FA) is still holding organizations back though with only 22 percent of respondents perceiving this kind of security as an issue despite growing evidence of breaches and cyberattacks that exploit mobile or SMS-based authentication methods.",
    "CEO and Founder of Yubico Stina Ehrensvärd provided further insight on the report in a press release, saying:",
    "“The pandemic and the move to cloud-based office applications has been a turning point for enterprises to implement and modernize their multi-factor authentication. What this research shows is that while there is an appetite for strong security with an elegant user experience, many companies stick with less effective old habits and technologies. A user deployment study by Google was the first to highlight the remarkable benefits and return on investment of YubiKeys and security keys. This new research is a great further validation of the authentication technology Yubico invented and the standards work we have spearheaded.”"
  ],
  "headers": {
    "3": "MFA adoption"
  },
  "links": {
    "worked from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Yubico": "https://www.techradar.com/news/making-secure-login-accessible-to-all-qanda-with-yubico",
    "Work-from-Home Policies Driving MFA Adoption, But Still Work to be Done": "https://www.gopjn.com/t/8-12281-101987-191575?sid=trd-us-1085205588540083500&website=194177&url=https%3A%2F%2Fpages.yubico.com%2Fwork-from-home-policies-driving-mfa-adoption",
    "security breaches": "https://www.techradar.com/news/90-percent-of-data-breaches-are-caused-by-human-error",
    "phishing attacks": "https://www.techradar.com/news/just-one-mobile-phishing-attack-could-cost-your-business-hundreds-of-millions",
    "FIDO2": "https://www.techradar.com/news/yubico-and-microsoft-want-to-finally-kill-off-passwords-for-good",
    "MFA adoption": "https://www.techradar.com/news/microsoft-wants-you-to-stop-using-your-phone-as-a-security-device",
    "2FA": "https://www.techradar.com/news/what-is-2fa",
    "press release": "https://www.businesswire.com/news/home/20210427005276/en/Nearly-75-of-Enterprise-Security-and-Risk-Managers-Plan-to-Increase-Multi-Factor-Authentication-Spending-According-to-New-Study-by-Yubico-and-451-Research"
  }
}