{
  "source": "https://www.techradar.com/news/prepare-to-pay-a-god-of-war-2-and-gran-turismo-7-ps5-upgrade-fee",
  "title": "Prepare to pay a God of War 2 and Gran Turismo 7 PS5 upgrade fee",
  "category": "gaming",
  "updated": "2021-09-07T11:03:43Z",
  "author": "gerald-lynch",
  "summary": "BOY! Set aside a few extra notes for next-gen God of War",
  "article": [
    "If you’re a PS4-owning Kratos fan looking forward to the upcoming God of War: Ragnarok sequel, you might want to put that Leviathan axe out of reach – this might not be the news you want to hear. Likewise, Gran Turismo 7 fans might want to hit the brakes.",
    "Following the outcry around Horizon: Forbidden West’s PS4-to-PS5 upgrade path, which has seen Sony backtrack on a paid-for upgrade in favor of its originally-suggested free offer, the company has moved to clarify its future upgrade options.",
    "Admitting that Sony “missed the mark” on its messaging around Horizon, Sony president Jim Ryan did clarify that \"moving forward, PlayStation first-party exclusive cross-gen titles will offer a $10 digital upgrade option from PS4 to PS5.\"",
    "In other words, any Sony-owned game going forward scheduled to land on both PS4 and PS5 will require players on the last generation of consoles to pay a fee to get next-gen features, with Ryan specifically namechecking God of War and Gran Turismo as examples.",
    "Horizon, it seems, has been spared the fee as it was originally slated as a launch window title for the PS5, and games in that bracket were promised a free upgrade, despite Forbidden West now slipping to a 2022 release date.",
    "As for games from third party developers, it will remain their choice as to whether or not to charge an upgrade fee.",
    "Sony finds itself in an unfortunate position here. With previous console generations, if a game was made for two different console eras, say PS3 and PS4, it was the norm to sell both as full-priced titles.",
    "But with the PS5 being backwards compatible with PS4 titles, the lines have been blurred. You can buy a PS4 title and in some cases benefit from a 60fps upgrade for free, raising the question as to how much a PS5 upgrade is worth for what is essentially a souped-up version of the same game.",
    "Things become even more complicated when you look at the competition. PC gamers have always been able to eke out better performance from older titles if they improve their components, and haven’t needed to buy a new version of a game to do so (though remastered re-releases of course exist).",
    "And then there’s the latest Xbox machines, with their Smart Delivery systems – the real competition for Sony in this regard. Xbox has set a consumer-friendly precedent by stating that all its first party games will get free next-gen upgrades, as it’s committed to supporting last-gen gamers well into the future. Smart Delivery will simply download the most appropriate version of a game for your console, be that an Xbox One, Xbox Series X or Xbox Series S.",
    "All platforms are in a predicament – there are huge last-gen install bases to cater to, and still limited stock of the next-gen consoles to sate appetites. There’s no easy way for developers to recoup costs with spiralling development bills but, so far at least, Microsoft’s approach with Xbox seems the most consumer-friendly."
  ],
  "headers": {
    "6": "Analysis: A tale of two systems"
  },
  "links": {
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "Horizon: Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained",
    "Xbox One": "https://www.techradar.com/reviews/xbox-one-x",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s"
  }
}