{
  "source": "https://www.techradar.com/news/2020-was-a-record-year-for-phishing-sites",
  "title": "2020 was a record year for phishing sites",
  "category": "computing",
  "updated": "2021-01-14T18:20:30Z",
  "author": "anthony-spadafora",
  "summary": "Google detected 2.11m phishing sites last year",
  "article": [
    "The number of phishing sites created last year reached a record-high as cybercriminals looked to capitalize on the pandemic as well as the unprecedented number of employees working from home.",
    "According to a new investigation from Atlas VPN, 2.11m phishing sites were detected by Google in 2020 which represents a 25 percent increase compared to 2019 when the search giant discovered 1.69m malicious domains.",
    "Cybercriminals create phishing websites in such a way that they appear to be legitimate and often mimic other popular sites and online services. The end goal though is to trick users into entering their credentials and other private information which is then sold on the dark web or used in subsequent attacks.",
    "At the beginning of the last decade, phishing sites were declining with Google only detecting 69,254 such sites in 2011. However, as the decade progressed, there was a significant increase in phishing sites beginning in 2015 with 272,109 sites created. The number of phishing sites continued to increase in 2016 and 2017 before reaching 1.1m created in 2018.",
    "The uncertainty created by the pandemic and the lockdowns that followed created the perfect environment for cybercrime to thrive in 2020. This led to an increase in coronavirus scams and cyberattacks launched against businesses that were unsure of how to properly secure their remote workforces.",
    "Based on data from Google, cybercriminals were most active during mid-February as well as at the start of may last year. During those times, the search giant detected over 56,000 new malicious sites per week.",
    "In the second half of 2020 though, things became a bit more stable with around 44k phishing sites discovered per week. In total, Google detected an average of over 40k phishing sites each week last year.",
    "In order to avoid falling victim to phishing scams, Atlas VPN recommends that users carefully check the URLs of the sites they visit, make sure every site they visit has an SSL certificate and look out for spelling and grammar mistakes on websites."
  ],
  "headers": {
    "4": "Record year for phishing"
  },
  "links": {
    "phishing sites": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "new investigation": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_3412414742552318000&xs=1&url=https%3A%2F%2Fatlasvpn.com%2Fblog%2Fa-record-2-million-phishing-sites-reported-in-2020-highest-in-a-decade&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2F2020-was-a-record-year-for-phishing-sites",
    "Atlas VPN": "https://www.techradar.com/reviews/atlasvpn/reviews/atlasvpn",
    "dark web": "https://www.techradar.com/news/over-15-billion-stolen-credentials-are-for-sale-on-the-dark-web-now",
    "coronavirus scams": "https://www.techradar.com/news/beware-these-new-coronavirus-email-scams",
    "SSL certificate": "https://www.techradar.com/news/best-ssl-certificate-provider"
  }
}