{
  "source": "https://www.techradar.com/news/gaming-laptop-deals-offer-cheap-rtx-cards-plus-up-to-dollar500-off-razer-blade-15",
  "title": "Gaming laptop deals offer cheap RTX cards plus up to $500 off Razer Blade 15",
  "category": "computing",
  "updated": "2021-05-14T20:55:54Z",
  "author": "alex-whitelock",
  "summary": "Two machines that'll put out serious performance",
  "article": [
    "We've just spotted two excellent mid-week gaming laptop deals that are perfect for gamers on the go who want a machine that'll really push out some serious performance.",
    "First up is this 15.6-inch Evoo at Walmart for $899 - a machine that's not exactly a looker, but does pack a hefty specs sheet. An RTX 2060 graphics card, AMD Ryzen 7-4800H processor, 16GB of RAM, and 512GB SSD easily makes this one of the most powerful laptops you can get for under $1,000 right now and a great buy.",
    "If you value style with your gaming laptop deals, however, then consider this absolutely stunning 4K Razer Blade 15 model for $1,799.99 at the official Razer store. Aside from a $500 price cut and 4K display, this one's also got an RTX 2070, Intel Core i7-10750H, 16GB of RAM, and a 512GB SSD, making it an incredibly powerful machine all around. Of course, it's not cheap, but Razer does make some of the most premium machines money can buy.",
    "While we normally feature cheap gaming laptop deals here at TechRadar - for our readers strictly on a budget - every now and again we spot a great higher-end machine that's definitely worthy of consideration. While slightly pricier, both options here are great if you want something with a little more power and the added benefit of not needing to upgrade for a while.",
    "Outside the US? See the best gaming laptop deals in your region just below.",
    "Stock up on your library with this week's best cheap game deals and see more offers with our roundup of the best Memorial Day sales that are happening now."
  ],
  "headers": {
    "5": "Great gaming laptop deals this week"
  },
  "links": {
    "for $899": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-2661498936382541300&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2FEVOO-Gaming-15-6-Laptop-FHD-120Hz-AMD-Ryzen-7-4800H-Processor-NVIDIA-GeForce-RTX-2060-THX-Spatial-Audio-512GB-SSD-16GB-RAM-RGB-Backlit-Keyboard-HD-Ca%2F233313280",
    "for $1,799.99": "https://razer.a9yw.net/c/221109/642901/10229?subId1=trd-us-5945754837696259000&sharedId=trd-us&u=https%3A%2F%2Fwww.razer.com%2Fgaming-laptops%2FRazer-Blade-15%2FRZ09-03287EM2-R3U1",
    "cheap gaming laptop deals": "https://www.techradar.com/deals/cheap-gaming-laptop-deals-under-1000",
    "cheap game deals": "https://www.techradar.com/news/cheap-game-deals-sales-xbox-one-ps4-pc",
    "Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021"
  }
}