{
  "source": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
  "title": "HBO Max: movies, shows and everything about the streaming service explained",
  "category": "entertainment",
  "updated": "2021-09-27T16:29:46Z",
  "author": "samuel-roberts",
  "summary": "What is HBO Max, and why should you care?",
  "article": [
    "What is HBO Max? The streaming service, which launched in the US back in May 2020 and is currently in the middle of a worldwide rollout, is essentially Warner Bros' attempt to take on Netflix. Unlike previously existing services HBO Now and HBO Go, HBO Max has a broader range of content.",
    "Yes, you get everything HBO was already known for – acclaimed original shows like The Sopranos and The Wire, as well as a selection of great new movies – and a whole lot more stuff. From the entire library of Friends episodes to Cartoon Network shows, and the Studio Ghibli movies, it's a mostly great streaming service with a deep, impressive library.",
    "On top of this, the service has loads of its own originals, like The Flight Attendant, DC series Harley Quinn and Doom Patrol, Raised By Wolves and many more. New HBO shows land on HBO Max as they air, too – so it really is a far-reaching service. And it should be, for the $14.99 per month price.",
    "In 2021, HBO Max has stepped things up a notch by becoming the home for new Warner Bros blockbusters like Godzilla Vs Kong, The Suicide Squad and Mortal Kombat – each of these new movies land on the service simultaneously with a theatrical release, and is available for 30 days before being removed from the service. It's a big incentive to sign up.",
    "On this page, we're going to give you a primer on HBO Max: what it is, what it costs, what's available on the service and whether you should subscribe.",
    "HBO Max costs $14.99 (around £11, AU$22) per month. That puts it on the more expensive end of the streaming service spectrum. However, it's also the same price as HBO Now, and HBO Max offers a lot more entertainment goodness for your hard-earned cash. That said, an ad-supported tier for HBO Max is coming in June 2021, which will take the cost down a bit – though that tier won't get the new blockbuster Warner Bros movies.",
    "By comparison, as of 2021, Disney Plus is $7.99 per month, while Netflix's Standard tier is $13.99. To learn more and compare to the competition, check out our dedicated HBO Max price guide.",
    "All existing direct HBO subscribers will get HBO Max for free. In addition, if you're subscribed to HBO via the following, you get HBO Max for nothing:",
    "If you're subscribed to HBO Now through a third-party app or service, the HBO Max help site says subscribers via the following get HBO Max for free as well: Apple, Google Play, Samsung TV, Hulu, Verizon, Optimum, Consolidated Communications and Liberty.",
    "People subscribed to HBO through AT&T-related services, meanwhile, can watch all the HBO Max content they want for no additional cost, too. If you have HBO via AT&T TV or U-Verse TV, that comes with HBO Max. People subscribed to 'premium' AT&T cell and internet services will apparently have the offer of bundles with HBO Max 'at no extra charge'. AT&T now has a dedicated page on deals that include HBO Max.",
    "Sorry folks – while you could once have tried this service for a few days before committing, that option is not currently available. Take a read of our HBO Max free trial article for more.",
    "That said, you can get a 7-day free trial to HBO Max by subscribing within Hulu – but it doesn't appear to stream some of HBO Max's juicier content, like Zack Snyder's Justice League.",
    "HBO Max is phenomenal when it comes to movie selection. While Netflix's library always has a bunch of highlights from other studios, the base HBO Max is working from here comprises many amazing movies from Warner Bros' history – you get a massive range of DC Comics movies, from Batman (1989) to Joker, The Dark Knight and Aquaman. Genre movies generally are very well-repped on here, with The Lord of the Rings movies, The Matrix trilogy and the two Blade Runner films streaming as of April 2021.",
    "One of HBO Max's bespoke channels is Studio Ghibli movies, which gives you every animated film from the legendary studio behind Spirited Away, minus Grave of the Fireflies. Another channel is TCM (Turner Classic Movies) – the latter might not be as specialist as The Criterion Channel, but you won't be short of classics to enjoy, from Citizen Kane to All The President's Men.",
    "Basically, you'll never run out of things to watch. Then, of course, there are the 2021 blockbusters releasing simultaneously on the service with a theatrical showing. Currently available is Godzilla Vs Kong, with upcoming movies including Mortal Kombat (April 23), Those Who Wish Me Dead with Angelina Jolie (May 14), The Conjuring: The Devil Made Me Do It (June 4), In The Heights (June 11), Space Jam: A New Legacy (July 16), The Suicide Squad (August 6), Reminiscence (September 3), Malignant (September 10), The Many Saints of Newark (September 24), Dune (October 1), Cry Macho (October 22), King Richard (November 19) and Matrix 4 (December 22).",
    "HBO Max also makes original movies – like Zack Snyder's Justice League, for example, or The Witches, Locked Down, documentary Class Action Park or Seth Rogen's An American Pickle.",
    "Check out our best HBO Max shows list for recommendations on the highlights of the platform. Obviously, HBO's original series are at the core of the offering, here. Everything from The Wire to The Sopranos to miniseries like Show Me A Hero and The Night Of. HBO isn't just known for dramas, of course – comedies like Curb Your Enthusiasm and Veep are here, along with many documentaries like McMillions and The Case Against Adnan Sayed. HBO's rich history of stand-up specials is here to enjoy, too, with some of the biggest American comedians represented.",
    "Older shows on the platform from Warner's archive (and beyond) help supplement that. Rick and Morty's first four seasons can be streamed here, and HBO Max has the exclusive rights to show Friends and South Park in the US. The Big Bang Theory, The Middle, Young Sheldon, The Nanny and The Fresh Prince of Bel Air are among the sitcoms you can enjoy on the service.",
    "Then you'll find loads of great animated shows in here. Batman: The Animated Series is a classic from the '90s – and it's joined by the Superman show, as well as the more futuristic Batman Beyond. All look beautifully crisp to stream on the service. If you're craving anime, Crunchyroll has a channel on HBO Max that offers a selection to enjoy. Cartoon Network has a whole channel on the service, too, encompassing shows like Steven Universe and Dexter's Laboratory.",
    "Import shows include the newer seasons of Doctor Who, The Office (UK) and crime drama Gomorrah.",
    "Finally, HBO Max has a suite of original series that's set to grow massively over the coming years. For now, you can enjoy DC shows Doom Patrol and Harley Quinn, as well as mystery drama The Flight Attendant starring Kaley Cuoco, and offbeat Millennial drama Search Party. Sci-fi drama Raised By Wolves is also worth a watch.",
    "HBO has trimmed its streaming options down to just HBO Max and HBO – mostly to avoid confusion. The difference simply comes in the range of programming you have access to. By subscribing to just HBO, you get every original the premium channel is known for, as well as its movies. But HBO Max gets you more than double the content – including the likes of Friends, Adult Swim, kids' entertainment and Max's own range of originals.",
    "Really, there's no reason to get HBO over HBO Max – they cost the same, and you get more stuff with the latter.",
    "Here are officially supported devices you can use with HBO Max. There's no limit to how many devices you can use with the streaming service, but for security reasons, the number of simultaneous streams permitted is capped.",
    "HBO Max lets you download content for offline viewing. It also has a PIN system for parental control, personalized profiles and brand-based content hubs similar to how Disney Plus categorizes Star Wars and Marvel – as mentioned earlier, these include TCM, Studio Ghibli, DC, Crunchyroll, Looney Tunes and Sesame Workshop. You also have the option of 'co-viewing' homepages that represent the tastes of multiple people in your home.",
    "The homepage has themed selections of content to enjoy, too, if you're a little sick of Netflix's algorithmic recommendations.",
    "HBO Max doesn't support 4K streaming with HDR, Dolby Vision and Dolby Atmos as standard, though new movie premieres like Godzilla Vs Kong have been available in this format, assuming you're watching with the following devices:",
    "Over time, hopefully the library will support more 4K content – especially considering the relatively high price of the subscription fee.",
    "HBO is a name synonymous with prestige TV, from shows like Oz and The Sopranos through to Game of Thrones and Chernobyl. With HBO Max, it'll likely come to mean something else entirely – but that association is still a massive asset. In the 'Peak TV' age, HBO has more than held its own, producing the likes of Succession and Watchmen and remaining the center of the TV conversation while a streaming arms race occurred around it.",
    "That is what HBO Max is building upon: the best TV of the last two decades, coupled with every major brand Warner can throw at it. Not all streaming services will survive this content war, but HBO Max has a lot in its corner, especially with its big investment in blockbuster movies throughout 2021.",
    "It's already a great streaming service – the question is whether its originals will make it stand out in an overpopulated US streaming landscape, especially when the price of entry is relatively high."
  ],
  "headers": {
    "5": "HBO Max price explained",
    "10": "HBO Max free trial: is there one?",
    "12": "HBO Max movies: what's worth watching?",
    "16": "HBO Max shows: what's streaming?",
    "21": "HBO Max vs HBO: what's the difference?",
    "23": "HBO Max devices and apps: how can you stream it?",
    "24": "HBO Max app features: downloads and recommendations explained",
    "26": "Does HBO Max support 4K streaming?",
    "28": "HBO Max could win the streaming wars, if price doesn't slow it down"
  },
  "links": {
    "Godzilla Vs Kong": "https://www.techradar.com/news/godzilla-vs-kong-ending-explained-who-won-the-monsterverse-fight",
    "HBO Max costs $14.99": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-9768695699566123000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "HBO Max price": "https://www.techradar.com/deals/hbo-max-price-cost-deals",
    "dedicated page": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-7116102894458504000/https://www.att.com/hbo-max/",
    "HBO Max free trial": "https://www.techradar.com/news/hbo-max-free-trial",
    "Hulu": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1112886008560353200&xs=1&url=http%3A%2F%2Fhulu.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Zack Snyder's Justice League": "https://www.techradar.com/reviews/zack-snyders-justice-league",
    "best HBO Max shows": "https://www.techradar.com/news/best-hbo-max-shows"
  }
}