{
  "source": "https://www.techradar.com/news/picked-up-a-black-friday-kindle-deal-here-are-the-accessories-and-extras-you-need",
  "title": "Picked up a Black Friday Kindle deal? Here are the accessories and extras you need",
  "category": "tablets",
  "updated": "2021-11-27T03:02:39Z",
  "author": "tom-bedford",
  "summary": "Deals on cases and books",
  "article": [
    "With loads of great Black Friday Kindle deals, we wouldn't blame you for picking up a discounted Amazon ereader - but if you've done so, maybe your money-saving adventure isn't over just yet.",
    "You see, not only are Kindles reduced in the Black Friday deals, but so are loads of important extras you should consider buying. These include cases, screen protectors and yes, the books themselves.",
    "We've found some deals for you in the main accessory categories so you can make the most of your shiny new Kindle at little extra cost.",
    "(Not in the US? Scroll down for deals in your region).",
    "Part of Amazon's Black Friday deals include discounts on loads of books in the Kindle store.",
    "You can click here to navigate to Amazon's Kindle estore discount section, including 80% off a few books.",
    "If you want Kindle Unlimited, a subscription service offering you unlimited access to a huge library of books, comics and magazines, there's also an offer on that which you can find out about here.",
    "Well... we haven't actually found any Kindle screen protector deals right now - they're all still selling at full price. You can find the Amazon listings here, but don't expect any price reductions.",
    "A screen protector is important for all tech though, as it can keep the display from getting damaged from drops or scratches.",
    "Did you read this whole article without actually buying a Kindle? Well, check out some discounts below."
  ],
  "headers": {
    "4": "Kindle ebook deals",
    "7": "Kindle screen protector deals",
    "9": "Amazon Kindle deals",
    "10": "More Black Friday deals in the US"
  },
  "links": {
    "Black Friday Kindle deals": "https://www.techradar.com/black-friday/black-friday-kindle-deals",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "click here": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fbrowse.html%3Frw_useCurrentProtocol%3D1%26node%3D11552285011%26ref_%3Damb_link_S2wza73qQSq8Rg97-013DQ_1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-6477052408009896000-20",
    "there's also an offer on that which you can find out about here": "https://www.techradar.com/news/is-this-the-best-black-friday-deal-for-bibliophiles-top-kindle-unlimited-discount",
    "here": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%3Fk%3Dkindle%2Bscreen%2Bprotector%26ref%3Dnb_sb_noss_2%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-8144433411850141000-20"
  }
}