{
  "source": "https://www.techradar.com/news/sonos-headphones-patent-gives-better-look-at-rumored-wireless-cans",
  "title": "Sonos wireless headphones patent gives better look at rumored Sony WH-1000XM4 rivals",
  "category": "audio-visual",
  "updated": "2021-02-18T10:06:57Z",
  "author": "axel-metz",
  "summary": "Could the AirPods Max have competition?",
  "article": [
    "[Update: We've received an invitation for a Sonos event on March 9 at 1PM PST / 9PM GMT. Could we be seeing the first Sonos headphones then? We can't wait to find out.]",
    "New patent images reveal a better look at the rumored Sonos wireless headphones – and they could rival the Apple AirPods Max.",
    "A recent filing at the German Patent and Trademark Office offers a glimpse of what looks to be a close-to-final design for the upcoming headphones, and suggests several changes compared to similar design patents from September 2020, which detailed two different wireless models.",
    "Now, it seems the Sonos wireless headphones won’t have rods protruding from the headband like the Bose Noise Cancelling Headphones 700, as one previous design suggested, but will instead see the rods go straight down into the ear cups like the Sony WH-1000XM4. There’ll also be no additional piece that wraps around the back of each ear cup, which we saw in the other previous design.",
    "These new patent images also reveal a now-visible Sonos wordmark on the earcups of the headphones, whereas previous designs featured no such logo. It’s worth noting that much of the design is rendered in broken lines, meaning the placement of certain features could change, but given the amount of time Sonos’ wireless headphones have been in development, we’ll bet this patent offers something close to a final blueprint.",
    "Details remain few and far between on which audio features the upcoming wireless headphones will come equipped with, but this and previous patents do allude to active noise cancellation, wireless connectivity, and built-in microphones for voice-controlled music playback.",
    "Another notable difference on this patent is what looks to be an earphone adapter, which could suggest replaceable ear cushions for the headphones. A USB-C port, various buttons and a 3.5mm audio port are also visible in the new drawings.",
    "Most interestingly, these patents describe how the Sonos wireless headphones would interact with other Sonos products, allowing them to seamlessly integrate with existing multi-room audio setups – something that the likes of Sony, Sennheiser, and Bose can’t offer.",
    "One of the headline features of the upcoming cans is said to be the ability to seamlessly handoff music from the headphones to your Sonos audio system (and vice versa). Given that this is a feature that even the AirPods Max can’t manage this, this could prove to be what sets Sonos’ wireless effort apart from its competitors.",
    "Little is known about how much the headphones will cost, but Bloomberg says they’re likely to be priced around $300 / £220 / AU$400, putting them in direct competition with the likes of the Sony WH-1000XM4 and the Bose Noise Cancelling Headphones 700. If Sonos could undercut these models, though, it could really shake up the competition – but judging by the expense of the company’s wireless speakers, we aren’t expecting a super budget-friendly price.",
    "In terms of a release date, Sonos CEO Patrick Spence confirmed during the company’s recent earnings call that the next Sonos product will be announced in March. We don’t yet know whether that’ll be the follow-up to the Sonos Move, but Spence did mention that Sonos continues to aim to release “at least” two new products each year – so the wireless headphones could make up that second slot. We'll keep an ear out.",
    "Via The Verge"
  ],
  "headers": {
    "7": "Seamless transition"
  },
  "links": {
    "Sonos wireless headphones": "https://www.techradar.com/news/sonos-wireless-headphones-what-we-know-about-the-rumored-sony-wh-1000xm4-rivals",
    "Apple AirPods Max": "https://www.techradar.com/reviews/airpods-max",
    "recent filing": "https://register.dpma.de/DPMAregister/uebersicht",
    "headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Bose Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "Bloomberg says": "https://www.bloomberg.com/news/articles/2019-01-24/sonos-is-said-to-plan-headphones-in-move-outside-the-home",
    "follow-up": "https://www.techradar.com/reviews/sonos-roam",
    "Sonos Move": "https://www.techradar.com/reviews/sonos-move-review",
    "The Verge": "https://www.theverge.com/2021/2/16/22286147/sonos-headphones-new-design-german-patent-office"
  }
}