{
  "source": "https://www.techradar.com/news/lg-android-phones-may-be-over",
  "title": "LG Android phones may be over",
  "category": "phones",
  "updated": "2021-03-23T09:42:37Z",
  "author": "jitendra-soni",
  "summary": "After sale talks reportedly fell through",
  "article": [
    "LG has been in the news for all the wrong reasons recently. While the company has showcased its innovative LG Rollable phone, the main topic of discussion has been the brand potentially looking to shut down its smartphone business.",
    "Last we heard the company was in talks with Vietnamese company Vingroup and Volkswagen to sell off its mobile business. However, according to a report from South Korean publication dongA, both of these discussions have failed and the only option left for LG is to quit the market.",
    "The publication states that the reason behind the unsuccessful discussions could be LG’s high asking price for the 1% market share it commands. These reports, however, have been contradicting the official comments made by an LG exec, who rubbished rumors around LG winding down its mobile business.",
    "LG had a confident start to the year, riding on the wow factor offered by the LG Wing 5G that debuted late last year. The company was bullish about launching a couple of other interesting devices like the LG Rollable and another flagship-level device codenamed Rainbow.",
    "However, mounting losses may have caused a major dent in LG’s plans. The company - which has a minuscule share in the global smartphone market - had already outsourced the manufacturing of its mid-range and low-end devices to Chinese companies, so it could focus on premium devices.",
    "Incidentally, the LG Rollable recently received Bluetooth certification even though it was rumored that the company had already shelved the project. While Rainbow, the LG Velvet successor, has reportedly been delayed indefinitely. The dongA report states that as things stand now, both of these devices may never see the light of the day.",
    "We wouldn't take any of this as confirmed until we hear it direct from LG, so don't count the company out yet, but based on the available information the situation certainly doesn't sound promising. We've contacted LG for comment, and will update this article if and when we hear back."
  ],
  "headers": {
    "3": "A rapid decline"
  },
  "links": {
    "LG Rollable": "https://www.techradar.com/news/lg-rollable",
    "Vietnamese company Vingroup": "https://www.techradar.com/news/lg-likely-to-sell-off-its-smartphone-plants-to-vietnams-vingroup",
    "dongA": "https://www.donga.com/news/article/all/20210321/106003359/1",
    "rubbished rumors around LG winding down": "https://www.techradar.com/news/lg-has-no-immediate-plans-of-quitting-the-smartphone-business-heres-why",
    "LG Wing 5G": "https://www.techradar.com/reviews/lg-wing-5g-review",
    "codenamed Rainbow": "https://www.techradar.com/news/samsung-galaxy-s21-may-have-one-less-competitor-as-lg-reportedly-delays-its-next-phone",
    "outsourced the manufacturing": "https://www.techradar.com/news/lg-to-focus-on-flagships-only-outsources-budget-phones",
    "received Bluetooth certification": "https://www.techradar.com/news/lg-rollable-smartphone-is-one-step-closer-to-reality",
    "already shelved the project": "https://www.techradar.com/news/lg-rollable-may-be-delayed-or-even-cancelled-suggests-supply-chain-intel",
    "LG Velvet": "https://www.techradar.com/reviews/lg-velvet"
  }
}