{
  "source": "https://www.techradar.com/news/hsbc-launches-mobile-business-banking-service-for-smes",
  "title": "HSBC launches mobile business banking service for SMEs",
  "category": "computing",
  "updated": "2021-03-24T09:01:20Z",
  "author": "rob-clymo",
  "summary": "Bank account comes with plenty of mobile-friendly features",
  "article": [
    "HSBC has launched a new banking service designed to help small business owners tackle all of their financial tasks in one handy place.",
    "The UK-centric business account, dubbed HSBC Kinetic, has been engineered to provide a 'simpler, faster and more intuitive' experience according to the bank. It used feedback from over 3,000 small business owners to help shape the final product, which can be integrated with accounting software such as such as Xero, QuickBooks and Sage.",
    "HSBC Kinetic software will be available for iOS from the Apple App Store and Android via Google Play. Once downloaded, business owners can apply for an account through the app. If the applicant is successful there will be a 'vertical' debit card option, while the app can be used to take care of direct debits, standing orders and forthcoming payments along with other small business finance management tasks.",
    "The business-focused account and app combination has also been tailored to allow users to take control of their finances thanks to its spend categorization, data insights and cash flow tools. Account holders will also have access to a credit card option, same day overdrafts and a savings account, which can also be applied for in-app.",
    "HSBC carried out research when developing the new account which revealed that less than a third (31%) of UK SMEs feel confident about being able to stay on top of their finances.",
    "The report also found many business owners fairly happy with the way they’d been managing their finances during the pandemic. However, its findings also revealed that SME's have several top priorities for the next six months. Continuing to remain in business was perhaps the most critical point raised, with 50% highlighting it was an issue of concern.",
    "A further 40% said they were intent on increasing their customer based, while 39% revealed they were looking at building new revenue streams. All agreed that to do this they would be left with less time to spend on financial administration including accounts and tax filing activities. As a result of the research, HSBC’s Kinetic will allow account holders to easily align their finances with HMRC tax coding and offer monthly breakdowns of cash flow.",
    "It’ll also be able to offer helpful hints on spending patterns, backing everything up with in-app customer service. The HSBC Kinetic app integrates with popular small business finance software too, including accounting tools from the likes of Xero, QuickBooks and Sage. HSBC says that following the early access period customers will have a fee free period of 18 months. After that a monthly fee of £6.50 will apply.",
    "Peter McIntyre, Head of Small Business Banking, HSBC UK, said: “Faced with a constantly evolving market environment, today’s small businesses need a bank that is agile and flexible – that equips them with real-time, easy to understand banking data to help them make quick decisions and pivot their operations.",
    "HSBC Kinetic combines our extensive banking expertise and infrastructure with an innovative approach to offer the best possible business banking experience for customers at a very competitive price point.”"
  ],
  "headers": {
    "4": "HSBC Kinetic"
  },
  "links": {
    "financial tasks": "https://www.techradar.com/reviews/pc-mac/software/business-and-finance-software/page/3",
    "Xero": "https://www.techradar.com/reviews/xero",
    "QuickBooks": "https://www.techradar.com/reviews/quickbooks",
    "Sage": "https://www.techradar.com/reviews/sage-business-cloud-accounting",
    "finance management": "https://www.techradar.com/best/best-expense-trackers",
    "cash flow": "https://www.techradar.com/best/accounting-software-small-business",
    "accounts": "https://www.techradar.com/best/accounting-software-small-business",
    "tax filing": "https://www.techradar.com/best/best-tax-software",
    "HMRC tax coding": "https://www.techradar.com/news/hmrcs-making-tax-digital-vision-pulls-in-over-pound200m-in-extra-revenue",
    "finance software": "https://www.techradar.com/best/best-personal-finance-software"
  }
}