{
  "source": "https://www.techradar.com/news/the-new-oculus-quest-2-boasts-better-vr-value-than-ever",
  "title": "The new Oculus Quest 2 boasts better VR value than ever",
  "category": "gaming",
  "updated": "2021-08-10T13:15:59Z",
  "author": "axel-metz",
  "summary": "Bigger storage, better value",
  "article": [
    "The Oculus Quest 2 is already a pretty damn good VR headset. In fact, for our money, it’s probably the best standalone mixed reality device on the market right now.",
    "It was music to our ears, then, when Facebook announced its new and improved Quest 2 model would come packing 128GB of storage for exactly the same price as the existing base version – making it better value, and an easier recommendation, than ever.",
    "The move comes after Facebook pulled sales of its Oculus Quest 2 headset earlier this month following complaints of skin irritation from a small number of users. In a blog post, the company revealed it would not only correct the issue by implementing a safer silicon cover, but discontinue the 64GB Quest 2 entirely and replace it with a 128GB model.",
    "There’s little doubt that a 128GB Quest 2 headset was already in the works over at Facebook, and there’s no knowing whether the recall affected previous plans to have this bigger-capacity model succeed the 64GB version of the device.",
    "Either way, gamers will be able to pick up a 128GB Quest 2 for the familiar price of $299 / £299 / AU$479 from August 24. Prior to the recall, the only other storage option in addition to the base model was the 256GB variant, which will remain priced at $399 / £399 / AU$639.",
    "Facebook doubling the amount of entry-level storage on its Quest 2 devices is a big deal. Most Quest titles currently take up around 3GB of storage – save for particularly large files, such as The Walking Dead: Saints and Sinners, or Doom3Quest – meaning, with the original 64GB model, gamers could store up to around 20 titles.",
    "A revised capacity of 128GB essentially doubles that figure, but it also better future-proofs the Quest 2 for the inevitably-larger VR games set to arrive later down the line.",
    "That point is particularly important given the lack of expandable storage in the Quest 2. Whichever model you choose, the only way to get more internal storage is to delete existing titles from your hard drive – a familiar trial for any long-time PS4 or Xbox One owners.",
    "That fact remains, since the upcoming 128GB Quest 2 also lacks expandable storage – but it at least gives prospective Quest owners more room for now and in the future."
  ],
  "headers": {
    "5": "No expandable storage, but still a big improvement"
  },
  "links": {
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review",
    "VR headset": "https://www.techradar.com/news/the-best-vr-headset",
    "announced": "https://tech.fb.com/community-letter/",
    "pulled sales": "https://www.techradar.com/news/oculus-quest-2-recall",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review"
  }
}