{
  "source": "https://www.techradar.com/news/has-microsoft-gone-too-far-with-its-latest-edge-feature",
  "title": "Has Microsoft gone too far with its latest Edge feature?",
  "category": "computing",
  "updated": "2021-12-01T11:44:15Z",
  "author": "matt-hanson",
  "summary": "Not a popular move",
  "article": [
    "A new feature in Microsoft Edge that gives users the option to use a ‘buy now, pay later’ (BNPL) service called Zip, has begun appearing in the web browser for some people offering an alternative way to pay for things – and it’s not going down well with people.",
    "A few weeks ago, Microsoft announced the feature in a blog post, saying that it was partnering with “Zip (previously Quadpay) to offer a BNPL payment option at browser level.”",
    "While some retailers offer buy now, pay later options, by integrating Zip into Edge, it means people can use it on any site. Rather than entering their credit card details, they can use Zip instead, and “any purchase between $35 - $1,000 you make through Microsoft Edge can be split into 4 installments over 6 weeks.”",
    "Microsoft claims its aim is to make it easier for Edge users to pay for products using Zip, however, the change has got many users angry and concerned. With the feature rolling out in early versions of Edge Canary, and coming to all users in the US with Edge 96, more people are now seeing this option and voicing their concerns.",
    "In Microsoft’s blog post, the majority of the comments about this new feature appear to be negative, leading us to wonder who this feature really is for.",
    "While Microsoft is pitching this as a consumer-friendly feature that gives users more choice in how to pay for products, and making more expensive purchases more easily available to people, it’s clear that both Microsoft and Zip stand to benefit greatly from people using this.",
    "For a start, while it’s not highlighted in the blog post, although Zip offers interest-free payments, you do need to pay $1 for each installment, which equates to $4 for most transactions. With expensive items, a $4 charge may not seem like much, but for lower-priced items that additional charge will be more noticeable. The fact that Microsoft doesn’t mention this charge in its blog post is also concerning.",
    "With Edge coming with every copy of Windows 10 and Windows 11, with Zip included by default that’s a huge potential customer base, and Microsoft will also likely be getting a share of Zip’s profits from the charge every time it’s used.",
    "The clear financial benefits for the two companies has made some people uneasy. Of course, the Zip integration could allow people to more easily buy things by breaking up the payments into installments without having to apply for credit, but there are concerns here as well.",
    "While BNPL can legitimately help people, there’s also the concern that it could encourage people to buy things they cannot afford. And while there’s no interest or credit checks with paying through Zip, if someone misses a payment, their credit score could be negatively impacted. Paying on time won’t have a positive impact, so you’re facing risks without the accompanying reward. According to Zip’s support website, if you miss a payment you could be charged a late fee of $5, and if a payment is rejected by your banks, “a $10 dishonour fee will be applied to your account.”",
    "For people in financial difficulty, these charges could add up fast, so making access to this feature so easy, and without ample warning about the downsides, people may end up using this when they shouldn’t.",
    "The ‘pay later’ part of Zip isn’t much later either, as you pay the installments over six weeks.",
    "Finally, people have also been complaining about how this is yet another feature that’s been added to Edge, making the web browser feel increasingly bloated. When Microsoft released the new version of Edge, based on the same Chromium engine as Google’s competitor Chrome, the web browser got plenty of praise thanks to its improved performance.",
    "However, since then, Microsoft has been adding divisive features such as this that makes the browser feel not just overcrowded, but also gives the impression that Microsoft cares more about making money than providing a good user experience. That’s probably true – Microsoft didn’t become one of the biggest companies in the world by being altruistic – but it’s not a nice feeling anyway.",
    "Microsoft’s inclusion of Zip offers risk for both the company itself and its customers. Encouraging people to spend beyond their means, and take on what amounts to loans, can be dangerous. While there will be people who may find the Zip integration useful for spreading the cost of expensive items, there will be people who will use it to buy things they can’t afford, and if they can’t pay Zip what they owe, they could end up in more financial trouble.",
    "In the run up to Christmas, this could prove very tempting for people. If you see the Zip option in Edge, we recommend you think very carefully before you use it. If you can’t afford to buy something now, will you really be able to pay for it in six week’s time?",
    "Microsoft also risks its reputation. The negative responses on its own blog make it clear that many people do not like this decision, and while the new Edge browser is an improvement, it still lags way behind Chrome when it comes to popularity. Moves like this, which has got a lot of negative coverage, could impact Edge’s momentum.",
    "We’ve contacted Microsoft for a response.",
    "Via Arstechnica"
  ],
  "headers": {
    "4": "Who is this for?",
    "14": "Analysis: Proceed with caution"
  },
  "links": {
    "in a blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1430890434328963300&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Farticles%2Fintroducing-buy-now-pay-later-in-microsoft-edge%2Fm-p%2F2967030&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fhas-microsoft-gone-too-far-with-its-latest-edge-feature",
    "Zip’s support website": "https://help.zip.co/hc/en-us/articles/360001586815-What-happens-if-I-miss-a-payment-or-don-t-pay-back-on-time-#:~:text=If%20your%20scheduled%20payment%20fails,after%20your%20contractual%20due%20date.",
    "Arstechnica": "https://arstechnica.com/information-technology/2021/11/microsoft-plans-to-integrate-a-buy-now-pay-later-app-into-edge/"
  }
}