{
  "source": "https://www.techradar.com/news/samsung-galaxy-watch-4-gets-an-unusual-feature-from-the-apple-watch",
  "title": "Samsung Galaxy Watch 4 gets an unusual feature from the Apple Watch",
  "category": "wearables",
  "updated": "2021-08-31T09:07:22Z",
  "author": "james-rogerson",
  "summary": "New feature available, over",
  "article": [
    "The Apple Watch 6 might have its biggest rivals yet in the form of the Samsung Galaxy Watch 4 and Samsung Galaxy Watch 4 Classic, and beyond all of them being high-end smartwatches, they also all have an unusual feature in common.",
    "We’re talking about Walkie-Talkie – a feature that the Apple Watch range has had for a while, and which lets you talk to a friend via the watch, in a walkie-talkie style. Now, you can also get an identically named feature for the Samsung Galaxy Watch 4 range.",
    "We say you can get it because it doesn’t appear to come pre-installed, but owners can download it from the Google Play Store.",
    "It works in a similar way to the Apple Watch implementation too. Once you and at least one other person have the app, you can create a channel on your Galaxy Watch and have instant voice conversations (no calling required) as if you were using a real walkie-talkie.",
    "We’re not sure how many people would actually want to talk to their friends and family via their wrist, but it’s there if you want it, and gives the Samsung Galaxy Watch 4 range one more way that it can match the Apple Watch range.",
    "Samsung’s Walkie-Talkie app only works on the Samsung Galaxy Watch 4 and Samsung Galaxy Watch 4 Classic, so owners of older Samsung Galaxy Watch models won’t be able to access it. Beyond that, users also need a Samsung account, though they’re likely to have one of these if they own a Galaxy Watch anyway, and signing up for one isn’t hard.",
    "Still, being limited to two wearables that probably won’t be anywhere near as widespread as the Apple Watch makes what’s already a niche feature even less useful than Apple’s take on it.",
    "That said, it could be worse. As far as we can tell you don’t need a Samsung phone to use Walkie-Talkie, which isn’t something we can say for the likes of the ECG and blood pressure monitor features.",
    "Those are exclusive to Samsung handset owners, but the Walkie-Talkie looks like it should work for owners of any Android phone, especially as it can work independently of the phone (though Samsung suggests that you have your phone connected to the watch the first time you use this feature).",
    "iPhone users will still be out of luck, as the Samsung Galaxy Watch 4 range isn’t compatible with iOS at all, but then they already have access to the Apple Watch range and its near identical feature.",
    "Via GSMArena"
  ],
  "headers": {
    "5": "Analysis: limited availability but it could be worse"
  },
  "links": {
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-classic-review",
    "Google Play Store": "https://play.google.com/store/apps/details?id=com.samsung.android.wear.walkietalkie",
    "GSMArena": "https://www.gsmarena.com/samsung_galaxy_watch4_and_watch4_classic_get_walkietalkie_app-news-50730.php"
  }
}