{
  "source": "https://www.techradar.com/news/apple-store-update-makes-it-easier-to-buy-its-products-online",
  "title": "Apple Store update makes it easier to buy its products online",
  "category": "computing",
  "updated": "2021-08-04T10:59:03.432Z",
  "author": "rob-clymo",
  "summary": "Faster and easier shopping done the Apple way",
  "article": [
    "Apple has given its e-commerce website a refresh that has seen a dedicated 'Store' tab reintroduced, marking the return of a feature that disappeared some six years ago.",
    "The company's site went down briefly earlier today and, as reported by MacRumors, came back up again with a revised page layout featuring the new tab. The \"Store\" tab takes customers directly to a dedicated online purchasing section, which allows customers to buy items from the current product lineup.",
    "In a move that’s clearly designed to make the purchasing journey that little bit easier, online shoppers can select the likes of the iPhone, iPad, Mac, Apple Watch and Apple TV in an instant. It essentially bypasses the need to visit a dedicated product page, or locate the traditional ‘buy’ button.",
    "Visitors to the Apple site are now also presented with a horizontal selection of products, along with any latest additions, relevant promotions and associated accessories. MacRumors likened the styling tweak to the same sort of experience you get during a visit to the Apple Store app. It certainly appears to be a more rounded design with easier options for browsing current smartphone models including the iPhone 12 Pro, iPhone 12, iPhone SE and iPhone XR via a dedicated carousel.",
    "Once a dedicated product is selected, customers can subsequently choose from available colours, storage size and other product variations that are available depending on the model. The improvement means there’s no longer the need to navigate through as much page furniture before arriving at the ‘buy’ button.",
    "It’s an improvement over the original Store tab, which disappeared following a 2015 redesign of the Apple website. That original purchase path took you to an entirely different domain.",
    "And, while it might not be a radical change to the Apple site, the subtle tweaks appear to make buying products much easier.",
    "Via: MacRumors"
  ],
  "headers": {
    "4": "Apple Store"
  },
  "links": {
    "e-commerce website": "https://www.techradar.com/news/best-ecommerce-hosting",
    "online purchasing": "https://www.techradar.com/best/best-shopping-cart-software",
    "online shoppers": "https://www.techradar.com/news/world-of-tech/future-tech/in-store-analytics-tracking-real-world-customers-just-like-online-shoppers-1286293",
    "iPhone": "https://www.techradar.com/news/best-iphone",
    "iPad": "https://www.techradar.com/news/mobile-computing/tablets/best-ipad-2016-how-to-choose-the-right-one-for-you-1322489",
    "Mac": "https://www.techradar.com/news/computing/apple/mac-buyer-s-guide-2015-1295725",
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Apple TV": "https://www.techradar.com/best/best-apple-tv-shows",
    "iPhone 12 Pro": "https://www.techradar.com/reviews/iphone-12-pro-review",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone XR": "https://www.techradar.com/reviews/iphone-xr-review",
    "MacRumors": "https://www.macrumors.com/2021/08/03/apple-website-redesigned-store/"
  }
}