{
  "source": "https://www.techradar.com/news/microsoft-edge-to-offer-a-new-release-cycle-for-less-adventurous-users",
  "title": "Microsoft Edge to offer a new release cycle for less adventurous users",
  "category": "computing",
  "updated": "2021-07-16T21:00:32Z",
  "author": "anthony-spadafora",
  "summary": "8-week release cycle option will be available from Microsoft Edge 94",
  "article": [
    "Testing, deploying and maintaining a new browser version every four weeks can be difficult for organizations which is why Microsoft will soon offer an “Extended Stable” release cycle option for Microsoft Edge.",
    "Back in March, the software giant announced that it would move from a 6-week to a 4-week release cycle just like Google does with Chrome. While being able to test out Microsoft's latest browser innovations may be exciting for regular users, businesses found the faster release cycle added extra complexity.",
    "Now though organizations will be able to opt for an 8-week “Extended Stable” release cycle instead of the 4-week release cycle that is set to become the default beginning with Microsoft Edge 94.",
    "Microsoft's new “Extended Stable” release cycle option will be available to all Edge users beginning in September with the release of version 94 of the company's browser.",
    "Once an organization opts in to the new release cycle, Microsoft Edge Stable will receive cumulative feature updates that align with even-numbered releases of the browser. New features that are added in odd-numbered releases will then be packaged up and delivered as part of the subsequent even-numbered release according to a new blog post from the Microsoft Edge Blog.",
    "IT administrators will be able to opt in to the new 8-week release cycle for Microsoft Edge stable by using the “TargetChannel” Group Policy where they'll select the “Extended Stable” option. If they don't though, Edge will default to the 4-week “Stable” release cycle.",
    "It's worth noting that Microsoft Edge updates automatically by default and Microsoft recommends this as the best method to receive version releases regardless of which release cycle option organizations select."
  ],
  "headers": {
    "3": "Extended Stable"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "4-week release cycle": "https://www.techradar.com/news/microsoft-edge-is-finally-becoming-more-like-chrome",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Microsoft Edge 94": "https://www.techradar.com/news/microsoft-edge-is-getting-a-very-fancy-new-pdf-feature",
    "Microsoft Edge Stable": "https://www.techradar.com/news/microsoft-edge-now-lets-you-sync-tabs-across-all-your-devices",
    "blog post": "https://blogs.windows.com/msedgedev/2021/07/15/opt-in-extended-stable-release-cycle/"
  }
}