{
  "source": "https://www.techradar.com/news/how-to-watch-industry-online-free-stream-new-bbc-hbo-drama",
  "title": "How to watch Industry online: stream BBC and HBO drama from anywhere today",
  "category": "computing",
  "updated": "2021-03-10T12:44:11.218Z",
  "author": "daniel-pateman",
  "summary": "Hedonism and ambition collide on London's trading floors",
  "article": [
    "Your next binge-worthy series has arrived! Industry introduces us to five young graduates who, hungry for success, will do anything to win the favor of their superiors and secure a job at prestigious London financial firm Pierpoint & Co. Follow our guide to find out where to watch Industry online today, including how to stream Industry free in the UK!",
    "After the speculative satire Years and Years, the BBC are delivering another gripping series in collaboration with HBO. Set in the world of international finance, this 8-part drama follows a group of newly hired graduates as they compete to secure their future with the esteemed company, and the romantic entanglements and self-destructive behaviours formed in such a high-pressure work environment.",
    "Making their TV debut, series creators Mickey Down and Konrad Day have written characters hailing from very different backgrounds, but who all share an inflexible will to succeed. Harper (Myha’la Herrold) is the central protagonist, a mixed-race American woman within a more privileged milieu. ]",
    "Yasmin (Marisa Abela), for example, is rich but eager to prove her business savvy; Robert (Harry Lawtey) entitled and charming with a taste for London nightlife, and Gus (David Jonsson) both Eton and Oxford educated. Their supervisors, meanwhile, are played by Skins actor Freya Mavor, Game of Thrones star Will Tudor, and Lost’s Ken Leung as MD Eric Tao.",
    "That Lena Dunham (star and creator of HBO’s Girls) helmed the pilot episode heralds greatness for this BBC drama – an addictive combination of romance, workplace rivalry, sex and bruised egos. So, get ready for your new favorite TV series as we explain how to watch Industry online - including for free."
  ],
  "headers": {
    "5": "How to watch Industry online in Australia"
  },
  "links": {}
}