{
  "source": "https://www.techradar.com/news/logitechs-new-dock-is-designed-for-a-work-from-home-world",
  "title": "Logitech’s new dock is designed for a work from home world",
  "category": "computing",
  "updated": "2021-09-08T17:30:09Z",
  "author": "anthony-spadafora",
  "summary": "Logi Dock eliminates desk clutter while improving your video conferencing experience",
  "article": [
    "Logitech has announced a new all-in-one docking station to make video conferencing easier for those working from home.",
    "The company's new Logi Dock will be certified for Google Meet, Microsoft Teams and Zoom when it launches this winter, the company said.",
    "In addition to giving remote workers and hybrid workers one centralized hub to plug in all of their devices, the Logi Dock also features one-touch meeting controls and a built-in speakerphone for taking video calls.",
    "Scott Wharton, General manager and VP of Logitech Video Collaboration, explained in a press release how the Logi Dock is the end result of the company taking a closer look at the needs of those working from home:",
    "\"When the pandemic hit, we spent an incredible amount of time with our end users to understand their needs and pain points in a work-from-home world. The result was Logi Dock. This is a disruptive, simple, and modern docking solution along with key collaboration features like one-touch-to-join and better mute control. And not insignificantly, it turns our cluttered ‘rats nest’ of cabling into the elegant workspace we all aspire to have.\"",
    "As desk clutter can interfere with workers' day-to-day productivity, Logi Dock is designed to help declutter your desktop by providing a single connection point for all of your devices.",
    "The dock can connect up to five USB peripherals and up to two monitors, all while charging a laptop up to 100W. With just one cable connection from Logi Dock to your laptop, Logitechn's new dock can eliminate excess wires, dongles and unnecessary chargers to give your workspace a cleaner, more organized look.",
    "Logi Dock also integrates with Logitech's Logi Tune app that helps control and customize the experience of using the company's personal collaboration devices. When combined with the app's calendar integration, Logi Dock shows intelligent lighting cues to notify remote workers when a meeting is about to start. Meanwhile, the dock's intuitive buttons allow you to join a call, mute a call, end a call or turn your camera on or off to create an effortless meeting experience.",
    "Sound quality is another advantage with Logi Dock as the devices is built with enterprise-grade audio. Users can take advantage of the noise-cancelling speakerphone for conference calls and then automatically switch to a Zone Wireless headset or Zone True Wireless earbuds for private conversations. The dock's speakers can also be used to play music when not in a meeting.",
    "Logi Dock will be available in graphite and white when it ships this winter and the device will have an MSRP of $399 (around £289)."
  ],
  "headers": {
    "5": "Logi Dock"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Zoom": "https://www.techradar.com/reviews/zoom",
    "hybrid workers": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "press release": "https://logitech-emea.pxf.io/c/221109/857541/11966?subId1=trd-us-6288079898009529000&sharedId=trd-us&u=https%3A%2F%2Fir.logitech.com%2Fpress-releases%2Fpress-release-details%2F2021%2FLogitech-Introduces-All-In-One-Dock-to-Declutter-the-Desktop-and-Make-Joining-Meetings-Easy%2Fdefault.aspx",
    "productivity": "https://www.techradar.com/best/best-productivity-apps",
    "monitors": "https://www.techradar.com/news/computing-components/peripherals/best-monitor-9-reviewed-and-rated-1058662",
    "laptop": "https://www.techradar.com/news/mobile-computing/laptops/best-laptops-1304361",
    "conference calls": "https://www.techradar.com/news/best-business-headphones-and-earphones",
    "Zone Wireless headset or Zone True Wireless earbuds": "https://www.techradar.com/news/new-logitech-wireless-and-wired-earbuds-want-to-make-work-calls-more-stylish"
  }
}