{
  "source": "https://www.techradar.com/news/doctor-strange-2-will-be-scarier-than-we-thought-heres-why",
  "title": "Doctor Strange 2 will be scarier than we thought – here's why",
  "category": "entertainment",
  "updated": "2021-06-18T15:18:26Z",
  "author": "tom-power",
  "summary": "Doctor Strange 2 sounds like it's really leaning into the horror of the multiverse",
  "article": [
    "Doctor Strange in the Multiverse of Madness won't be released for another nine months, but the importance of the upcoming MCU movie isn't lost of its fanbase.",
    "Outside of Loki's Disney Plus series, which is currently airing on Disney Plus, the sequel to 2016's Doctor Strange is shaping up to be the most fundamental piece of Marvel's Phase 4 puzzle, given that it'll explore the Marvel Cinematic Multiverse in (potentially) great detail.",
    "Doctor Strange's first adventure had plenty of trippy and slightly dark moments, but it sounds like its follow-up will be even scarier than we originally thought.",
    "That's according to Doctor Strange 2 head writer Michael Waldron, who was also the lead scribe on Loki's TV show.",
    "Speaking to YouTube channel Friends From Work, Waldron revealed the main reason why the Sorcerer Supreme's next movie would be more frightening than its predecessor. As Waldron says, it's down to Sam Raimi – the Spider-Man and Evil Dead director who replaced ex-director Scott Derrickson in the hotseat in February 2020.",
    "\"This is Sam Raimi's big return to superhero movies,\" Waldron said. \"I think everything you want out of a Sam Raimi movie you're hopefully going to get out of this one.",
    "\"That [horror vibe] is something that Scott Derrickson does so well. You feel that influence even in the first one; it's not a horror movie but you feel this spookiness around it and it's what makes that movie work so well.",
    "\"In this case, [the] Covid[-19 pandemic] just gave me and Sam more time to make it our own thing, and I'm glad that there was the chance to push in a slightly scarier direction, because Sam does that so well.\"",
    "Regarding the movie's horror-inspired vibe, we've heard similar comments to Waldron's in the past.",
    "Back in April, Doctor Strange 2 co-star Elizabeth Olsen (who plays Wanda Maximoff/Scarlet Witch in the sequel) told Glamour Magazine that the film was \"bonkers\" and that \"they're [Marvel] definitely going for that horror show vibe.\"",
    "That all said, we shouldn't expect an R-rated, gory kind of horror flick. Marvel Studios president Kevin Feige has also spoken about Doctor Strange in the Multiverse of Madness before.",
    "Speaking during a panel at the New York Film Academy in December 2019, Feige said: \"I wouldn’t necessarily say that’s a horror film, but it’ll be a big MCU film with scary sequences in it.\"",
    "Of course, that was while Derrickson was still the film's director, and Raimi has replaced him since Feige made those comments. It's possible, then, that Raimi's involvement may have upped the ante, regarding the scary aspect of the film, without straying too far into Evil Dead territory.",
    "The MCU is a family-oriented series, after all (until Deadpool 3's arrival, perhaps?), so don't expect Doctor Strange 2 to be rated R or anything like that.",
    "What we can expect, though, is that Doctor Strange 2 won't be like any other MCU movie from a visual standpoint. Speaking to Vanity Fair earlier in June, Waldron revealed that Doctor Strange 2's Director of Photography John Mathieson (Gladiator, Logan) had shot an \"incredibly visually thrilling\" flick, and that \"it is going to be unlike anything you’ve seen in the MCU before.\"",
    "Given that Doctor Strange was a visual marvel (thanks to its psychedelic teasing of other dimensions), we suspect the sequel will step things up a notch. Hopefully, in visiting different realities and universes, Doctor Strange 2 will be a scary affair, and this isn't a case of Waldron building it up to be something that it's not.",
    "Doctor Strange in the Multiverse of Madness will be released theatrically on March 25, 2022."
  ],
  "headers": {
    "8": "Analysis: Doctor Strange 2 could be the spookiest MCU movie yet"
  },
  "links": {
    "Doctor Strange in the Multiverse of Madness": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Loki's Disney Plus series": "https://www.techradar.com/news/what-time-is-loki-episode-6-released-on-disney-plus",
    "Friends From Work": "https://www.youtube.com/watch?v=MoY6Lkw1zlg",
    "Glamour Magazine": "https://www.glamourmagazine.co.uk/article/elizabeth-olsen-wandavision-digital-cover-star-april-2021-interview",
    "New York Film Academy": "https://www.youtube.com/watch?v=d_P8V6KPnoc",
    "Vanity Fair": "https://www.vanityfair.com/hollywood/2021/06/loki-michael-waldron-doctor-strange-star-wars-rick-and-morty"
  }
}