{
  "source": "https://www.techradar.com/news/tcls-color-e-ink-like-tablet-heads-mobile-push-during-ces-2021",
  "title": "CES 2021: TCL's color electronic ink tablet unveiled, could be a Kindle alternative",
  "category": "tablets",
  "updated": "2021-01-13T12:50:57Z",
  "author": "david-lumb",
  "summary": "TCL's color electronic ink tablet has impressive battery life",
  "article": [
    "At CES 2021, TCL is stepping up its tablet game with two new devices, including a color electronic ink paper display that bridges the gap between monochrome e-readers and expensive tablets.",
    "The TCL NXTPAPER, is something of a middleground between traditional tablets and E Ink ereaders. The ‘paper-like’ 8-inch Full HD display emits no blue light, making it conceivably easier on the eyes.",
    "Otherwise, the TCL NXTPAPER packs a 5MP front-facing camera, 8MP rear camera, a 5,500mAh battery, and an octa-core processor allowing users to watch videos and other media. It isn’t backlit, giving it longer battery life but making users rely on environmental illumination; to offset that, TCL will include a light in the box.",
    "The TCL Tab 10S is also in the lineup, a tablet building off the TCL 10 Tab Max (note the reversed nomenclature), inheriting the latter’s 10.1-inch display and 8,000mAh battery but adding a couple new things, like an included T-Pen stylus and pin connectors for third-party accessories.",
    "The TCL Tab 10S will be globally available in March 2021 with starting prices of €199 (around $245 / £180 / AU$314) for the Wi-Fi only version and €249 (around $306 / £225 / AU$393) for the 4G LTE version.",
    "And finally, TCL teased it's developing a 5G tablet, which isn't ready for market just yet but is coming at a later date this year. Vague, yes, but we hope to see it for sale before the year's end, or some other device will beat it as the first 5G tablet to market.",
    "TCL is presenting even more products at CES 2021 ~ more TVs, of course, but also more mobile phones and other devices.",
    "The TCL 20 5G, a 5G phone at a mid-range cost, and the very affordable TCL 20 SE are being revealed at CES as the first of the brand’s 2021 lineup. Three other handsets will be unveiled in the following weeks. TCL is also introducing the TCL Move PetTracker, a GPS tracker which can be clipped to anything to keep tabs on, though it’s intended for roaming furry companions.",
    "TCL is also teasing two products still in development. The first is a rollable phone, with a screen that unrolls into a wider format – achieving nearly tablet-sized screen real estate using a less intimidating mechanism than foldables, TCL believes. The second is Project Archer, VR glasses that purposely keep peripheral vision open to prevent motion sickness and are designed to be less cumbersome than the encompassing VR headsets – and as a result, will be slim enough to take on public transit.",
    "Neither device is ready for the market, and TCL doesn’t have release dates or prices for either."
  ],
  "headers": {
    "6": "TCL at CES 2021: more, more, more"
  },
  "links": {
    "CES 2021": "https://www.techradar.com/news/ces-2021-highlights",
    "TCL 10 Tab Max": "https://www.techradar.com/news/tcl-takes-the-fight-to-amazons-fire-range-with-its-new-cheap-android-tablets"
  }
}