{
  "source": "https://www.techradar.com/news/huawei-is-still-the-worlds-biggest-telco-equipment-vendor-at-least-by-revenue",
  "title": "Huawei is still the world's biggest telco equipment vendor - at least by revenue",
  "category": "phones",
  "updated": "2021-03-09T14:57:37Z",
  "author": "steve-mccaskill",
  "summary": "5G and capacity investments see revenues rise",
  "article": [
    "The worldwide market for telecoms equipment grew by 7% in 2020 as telcos invested in 5G rollouts and additional capacity to cope with increased demand during the Coronavirus pandemic.",
    "As Covid-19 spread across the globe, lockdown measures meant many people became more reliant on broadband and mobile networks for work, play and entertainment.",
    "These shifting usage patterns differed from country to country and impacted the market differently.",
    "Preliminary estimates from Dell’Oro show that although there weas some supply chain disruption in the early part of 2020, the market for Broadband Access, Microwave & Optical Transport, Mobile Core & Radio Access Network, SP Router & Carrier Ethernet Switch (CES) technologies benefited from the rising importance of connectivity.",
    "Overall, the pace of growth was the fastest since 2011.",
    "Despite well-documented difficulties in certain markets, Huawei actually increased its share of the market thanks to strong demand in its homeland.",
    "The Chinese vendor’s share by revenue rose by 28% to 31%, ahead of Nokia (15%), Ericsson (15%) and ZTE (10%). Cisco (6%), Ciena (3%) and Samsung (2%) made up the rest of the top seven.",
    "Ericsson and Nokia were the main beneficiaries of Huawei’s struggles, increasing their share of the RAN market as operators looked to diversify their supply pool or were required to do so by their governments.",
    "Going forward, analysts are positive about the state of the market as 5G expansion continues and many countries shift towards the idea of long-term flexible working. Dell’Oro predicts there will growth of between 3 and 5% over the coming year."
  ],
  "headers": {
    "3": "Telecoms equipment"
  },
  "links": {
    "5G": "https://www.techradar.com/deals/5g-phone-deals-prices-contracts"
  }
}