{
  "source": "https://www.techradar.com/news/payments-enhancing-the-digital-platform-economy",
  "title": "Payments enhancing the digital platform economy",
  "category": "computing",
  "updated": "2021-06-15T14:07:09Z",
  "author": "paul-simms",
  "summary": "Payments enhancing user experiences for platform",
  "article": [
    "Digital platforms are growing at an exponential rate. Everything today, from shopping and entertainment, to healthcare and wellness, relies on technology platforms to serve customers and keep things running efficiently.",
    "The platform economy, such as online marketplaces (like eBay), SaaS platforms (like Zenotti) and on demand services (like Uber), is forecast to account for more than 30% of all global corporate revenue by 2025. As more customers seek unique, curated experiences, platforms help by connecting them to businesses which, in turn, can reach a broader audience and access powerful technology innovations.",
    "Businesses such as eBay, Amazon and Uber revolutionized the platform model. They took something that was complex and simplified it, often by removing intermediaries. This process has given birth to the term, uberization. And looking at the success of these companies, it’s not surprising that this business model is taking off.",
    "Of the many things these platform pioneers got right, user experience stands out. They've created a slick and friction-less journey for users on either side of the platform. And payments is a central part of that experience. I’m sure we all remember the first time we got out of an Uber: No looking at the meter, no calculating a tip, no fumbling for cash, it felt a bit like stealing. It’s an experience that businesses all over the world are looking to replicate.",
    "Payments is a vital piece of the puzzle for platforms. Despite offering users simplicity, platforms can be complex behind the scenes. They facilitate commerce by connecting customers and their platform users (sub-merchants, suppliers, sellers, contractors etc.) to complete a transaction. It’s like itemizing and splitting a bill at the end of a meal, but turbocharged. Sorting out payments and removing friction is a massive value add. Get it right, and a platform becomes an essential service that users can't do business without.",
    "With simplicity and customer experience central to the success of platforms, how can payments partners create the best user experience for both customer and merchant?",
    "The Revised Payment Services Directive (PSD2) rolled-out in September 2019, is a European Union regulation designed to make payments more secure, boost innovation, and help banking services adapt to new technologies. And it introduced changes that significantly impact multi-sided platforms, or marketplace businesses.",
    "The most significant consideration for platforms is around collecting or distributing payments across multiple parties. Platforms in the food delivery space are a good example; they collect payments from customers and distribute funds to the restaurant and the delivery driver. Previously, platforms that managed payments relied on the “commercial agent” exemption to operate without the need to be a licensed provider of regulated payment services. But under the new rules, all platform businesses collecting and distributing funds will either need to use a licensed payment service provider, or become a financially licensed and regulated business with the Financial Conduct Authority.",
    "This is where payments solutions come in. Innovative payments providers not only take the complexity out of multi-sided transactions, but also carry the payments regulatory burden on behalf of the platform business. Payments platforms like Adyen allow for the transparent movement of money across buyer and seller, while keeping businesses complaint across Europe.",
    "Acquiring new and retaining existing users (be that customers or merchants) is central to platform success. And, for platforms looking to scale to new regions, countries, and markets, a strong payments infrastructure is a must.",
    "Global expansion requires a thorough knowledge of local payment methods and channels, which can quickly become overwhelming. Preferred payment methods and payment practices vary from country to country, as do consumer expectations. It’s critical to simplify the payment tech stack as much as possible and choose a payments partner that can support platform businesses as they grow.",
    "Traditionally, seamless, consumer-centric experiences were associated with digital marketplaces. But now, SaaS platforms are putting personalized customer journeys and next-generation capabilities within reach for all kinds of businesses.",
    "These software companies are solving challenges for an ever-widening set of cases across industries. And many of the small businesses who rely on them (such as medical offices, beauty salons, golf bookings, and many more) also look to them to help solve their payments obstacles.",
    "Increasingly platform businesses need to help their merchants solve challenges at the physical point of sale, as well as online. Innovative payment solutions are bringing unified commerce to platform businesses, helping their merchants to link their online and offline sales channels. This has the benefit of improving user experience, but also streamlining back-end systems to provide faster reconciliation, increased reporting and more customer insights – becoming a vital value add for platform businesses.",
    "Platform businesses exist to connect merchants of all sizes and customers on an international scale. And they do this by simplifying complex processes at scale. Payments is a vital element in this and will be key to unlocking a great user experience. From a payments perspective, ensuring seamless transactions and distribution of funds will help platforms remain competitive while creating a flawless experience for all its users."
  ],
  "headers": {
    "6": "Compliance without compromising CX",
    "9": "Market expansion",
    "11": "Going beyond digital",
    "14": "Final thoughts"
  },
  "links": {
    "customers": "https://www.techradar.com/best/best-customer-feedback-tools",
    "SaaS": "https://www.techradar.com/news/what-is-saas",
    "payments": "https://www.techradar.com/best/best-payment-gateways",
    "customer experience": "https://www.techradar.com/best/cx-tools"
  }
}