{
  "source": "https://www.techradar.com/news/wix-integrates-website-accessibility-tool-with-inclusion-at-its-core",
  "title": "Wix integrates website accessibility tool with inclusion at its core",
  "category": "computing",
  "updated": "2021-05-20T14:29:08Z",
  "author": "abigail-opiah",
  "summary": "Exclusive to Wix website builders",
  "article": [
    "Popular website builder Wix highlighted the importance of inclusion with the recent launch of its Accessibility Wizard.",
    "With today marking the tenth Global Accessibility Awareness Day, Nir Horesh, Head of Accessibility at Wix told TechRadar Pro that website accessibility is all about inclusion as the company continues to place heavy emphasis on making sure no one is left out.",
    "\"When websites are not accessible, some people cannot use them due to their disabilities, therefore, making them accessible has always been the right thing to do. There are four different motivations for accessibility - inclusivity being the most important one,\" he added.",
    "Wix's Accessibility Wizard provides Wix users with a step-by-step interactive solution that detects accessibility content issues on their sites and guides the user to resolve them.",
    "Horesh explained that there is a business motivation behind having a more accessible website as people with disabilities account for around 15% of the population.",
    "\"This is a huge segment of the population that you are losing if your website is not accessible,\" added Horesh.",
    "\"From a legal point of view, in order to push the transition for more accessibility online, a lot of countries have past laws that make it a legal requirement, which pushes people to do the right thing.\"",
    "According to the World Wide Web Consortium (W3C), web accessibility means tools are designed so that people with disabilities can perceive, understand, navigate, and interact on the web.",
    "The website builder's Accessibility Wizard is available to all Wix users globally. The tool scans users' websites for the detection of accessibility issues and then builds a report of guidelines and explanations on how to manually resolve each issue. In the final step, the site is rescanned to make sure the issues are resolved."
  ],
  "headers": {
    "3": "Accessibility Wizard"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "Wix": "https://www.techradar.com/reviews/wix",
    "World Wide Web Consortium": "https://www.w3.org/WAI/fundamentals/accessibility-intro/"
  }
}