{
  "source": "https://www.techradar.com/news/everything-you-can-do-in-the-apple-tv-app",
  "title": "Apple TV app: everything you can do with the surprisingly versatile streaming app",
  "category": "audio-visual",
  "updated": "2021-04-20T18:08:35Z",
  "author": "carrie-ann-skinner",
  "summary": "It’s more than just access to Apple’s streaming service",
  "article": [
    "There's a huge choice in TV and movie streaming services right now, so whether you’re watching on a big screen or a smaller screen like a smartphone or tablet, you’re never short of something to watch. However, each of these streaming services has its own app which can leave you scrolling endlessly trying to find the one you’re after.",
    "What if there was an app that could bring all your favorite streaming services together and create a one-stop-shop, so you can binge-watch till your heart’s content? This is where the Apple TV app comes in.",
    "The app, which replaced the Video app on iPhones and iPads in 2016, is more than just the home of the Apple TV+ streaming service. It brings together a range of different streaming services as well as the ability to buy and rent movies and TV shows from the iTunes store, in one place. Here’s everything you need to know.",
    "UPDATE: There's a new Apple streaming device on its way, with the Apple TV 4K 2021 having been confirmed at the Apple Spring Loaded event on April 20. The new device adds a revamped Siri remote and high frame rate capability, as well as color calibration functionality through compatible iPhones.",
    "As well as Apple TV+, a number of different streaming services are also available through the app too. They’re split into two different types. Apple TV channels are subscription services that have partnered with Apple so they can be watched directly in the TV app. You can also download shows from these channels to watch in the app when there’s no internet access.",
    "These are paid-for services that range in price from $1.99 / £1.99 / AU$2.99 to $9.99 / £10.99 / AU$9.99 per month and you’ll be billed through Apple rather than setting up a direct subscription with the service itself. If you’re unsure whether you want to commit to any of these services, they all offer free trials ranging from seven days to 30 days.",
    "As you’re billed through Apple you can cancel at any time through your iPhone or iPad. Head to Settings and select your name at the top of the screen. Then choose Media and Purchases followed by Subscriptions.",
    "The other streaming services that are available are integrated into the Apple TV app so you can see TV shows and movie suggestions. But if you select a show and press play, you’ll be automatically redirected to the relevant app and then the show will start playing. If you don’t already have the app installed on your device, you’ll be prompted to download it and sign-in if it requires an account.",
    "When you launch the Apple TV app, there are four sections at the bottom. The first section, Watch Now, offers up personalized suggestions based on what you’ve already watched, along with curated recommendations split into sections.",
    "For example, Up Next is filled with shows and movies you either haven’t finished watching, or new episodes of shows that you have been enjoying. What to Watch, meanwhile, provides suggestions of shows that are popular. There are also curated lists based on genre, decade and even award nominees.",
    "There’s a mix of content included with any services you subscribe to, as well as paid-for downloads from the iTunes store. The tabs at the top of the screen; Movies, TV shows, Kids, and in the US, Sports, break this content down even further.",
    "Next up is Apple TV+ Originals, which provides access to all the shows and movies available on Apple’s streaming service. The Library section houses any movies or TV shows you’ve purchased from the iTunes store, while the Search tab lets you search across all the services, rentals and downloads for a specific show or movie.",
    "The services available in the Apple TV app differ depending upon which region you’re in.",
    "In the US you can access several streaming services including Disney+, Prime Video, HBO Max, Hulu, Pluto TV and Peacock through the Apple TV app, while Apple TV Channels include Showtime, Starz, ePix, CBS All Access, Noggin and AMC+. It’s also possible to watch Spectrum and AT&T TV’s cable services in the Apple TV app, too.",
    "In the UK, the free-to-access services BBC iPlayer, ITV Hub, All4, My5 and UKTV Play are integrated into the app, along with Disney+, Prime Video and Mubi (an arthouse movie streaming service). Apple TV channels currently offered include Starzplay, Acorn TV, Crime Investigation Play, H Play, BFI Player, Noggin, Moonbug Kids and Tastemade",
    "In Australia, current integrated streaming services include Binge, 9Now, 10 All Access, SBS On-Demand and ABC iView, while the Apple TV channels which can be billed through the app include Acorn, Tastemade, CBS AA and EROS Now Select.",
    "The notable exception in all regions is Netflix which isn’t currently available.",
    "The Apple TV app comes pre-installed on iPhones, iPads, Mac and Apple TV streaming devices. It’s also available through Roku and Amazon Fire TV streaming devices, PCs, Playstation and Xbox consoles and some Samsung, LG, and Sony smart TVs. Some Vizio TVs in the US also have access to the Apple TV app.",
    "As well as the simplicity of having a one-stop-shop for all your TV and movie services, the Apple TV app also lets you pick up where you left off, no matter which device you’re using. So you can start watching a show on an Apple TV streaming device but carry on, on your iPhone, iPad or Mac.",
    "Also, thanks to the Family Sharing feature, you can share any movies or TV shows that have been purchased as well as access to Apple TV Channels with up to five members of your family, providing they have their own Apple ID, without having to share your passwords."
  ],
  "headers": {
    "4": "What can I watch through the Apple TV app?",
    "8": "Watch Now",
    "12": "What services are available through the Apple TV app?",
    "17": "What devices can I watch Apple TV on?",
    "18": "Anything else?"
  },
  "links": {
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "big screen": "https://www.techradar.com/news/best-65-inch-4k-tvs",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "tablet": "https://www.techradar.com/news/best-tablet",
    "Apple TV app": "https://www.techradar.com/news/the-new-apple-tv-app-is-here-a-step-towards-a-netflix-rival-or-something-else",
    "Apple TV+": "https://www.techradar.com/news/apple-extends-apple-tv-plus-free-trials-until-february",
    "iTunes store": "https://www.techradar.com/news/itunes-greatest-hits-the-apps-greatest-successes-and-failures",
    "Apple TV 4K 2021": "https://www.techradar.com/reviews/apple-tv-4k-2021",
    "Apple Spring Loaded event": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Disney+": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Hulu": "https://www.techradar.com/reviews/hulu",
    "Showtime": "https://www.techradar.com/news/how-to-watch-your-honor-online-stream-showtimes-new-bryan-cranston-drama-anywhere",
    "BBC iPlayer": "https://www.techradar.com/vpn/bbc-iplayer-vpn",
    "ITV Hub": "https://www.techradar.com/news/internet/the-arrival-of-itv-hub-means-we-never-have-to-speak-of-itv-player-again-1309662",
    "All4": "https://www.techradar.com/news/internet/channel-4-relaunches-4od-as-all-4-which-includes-live-mobile-streaming-1289464",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Apple TV streaming device": "https://www.techradar.com/news/television/apple-tv-vs-amazon-fire-tv-vs-roku-vs-chromecast",
    "Family Sharing feature": "https://www.techradar.com/how-to/what-is-apple-family-sharing"
  }
}