{
  "source": "https://www.techradar.com/news/amazfits-new-earbuds-will-help-fix-your-terrible-posture",
  "title": "Amazfit's new earbuds will help fix your terrible posture",
  "category": "fitness",
  "updated": "2021-08-05T09:46:42Z",
  "author": "cat-ellis",
  "summary": "Sit up and listen",
  "article": [
    "Amazfit is about to unveil a new pair of true wireless earbuds that will warn you if you're slouching, prompt you to take regular breaks, and protect your hearing – and play some music too.",
    "The new buds don't yet have an official name, but appear to be a successor to last year's Amazfit PowerBuds. These offered heart rate monitoring when paired with the Zepp mobile app, but it the new set will go several steps further, tracking your health at your desk as well as in the gym.",
    "According to Amazfit, the buds will be able to detect the position of your head relative to your cervical spine (i.e. the vertebrae that make up your neck), and provide feedback to help improve posture. Presumably this will be a sound, but it's also possible that it could involve haptic feedback to avoid interrupting if you're in the middle of a Zoom meeting.",
    "They will also \"play rhythms\" when they detect that you've been inactive too long (a feature also found in most fitness trackers and smartwatches), and \"analyze volume and listening habits\" to help protect your hearing. Volume-limiting headphones aren't new, but it'll be interesting to see how Amazfit intends to use your behavioral patterns to achieve it.",
    "When we reviewed the first PowerBuds, we were impressed by their powerful bass and firm fit (essential for running headphones), but found their microphone quality somewhat disappointing. Amazfit hasn't teased any details about the new earbuds' microphone, but since they appear to be designed for use during desk work, we're hoping it will have received an update that'll make it more suitable for video calls.",
    "Details about the launch are scarce so far, but it seems likely that they will be revealed at an event hosted by Amazfit's parent company Zepp Health. The Next Beat 2021 Conference, which Zepp is calling 'The Future of Health', is due to take place tomorrow (June 13). We'll keep you updated as soon as we know more."
  ],
  "headers": {
    "4": "Future sounds"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "Amazfit PowerBuds": "https://www.techradar.com/reviews/amazfit-powerbuds",
    "heart rate monitoring": "https://www.techradar.com/best/best-heart-rate-monitor",
    "According to Amazfit": "https://www.prnewswire.co.uk/news-releases/amazfit-s-upcoming-product-will-redefine-tws-earbuds-by-bringing-revolutionary-fitness-features-827536069.html",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "smartwatches": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "running headphones": "https://www.techradar.com/best/best-running-headphones"
  }
}