{
  "source": "https://www.techradar.com/news/nvidia-rtx-2080-ti-could-be-modded-to-have-double-the-vram-of-rtx-3080",
  "title": "Nvidia RTX 2080 Ti could be modded to have double the VRAM of RTX 3080",
  "category": "computing",
  "updated": "2021-05-10T15:07:58Z",
  "author": "darren-allan",
  "summary": "Turing flagship could have 22GB of video RAM, at least in theory",
  "article": [
    "Nvidia’s RTX 2080 Ti graphics card could theoretically support 22GB of video RAM, or at least that’s the claim which comes from a well-known Russian hardware modder.",
    "VIK-on recently made a YouTube video in which an RTX 3070 was boosted from 8GB to 16GB of VRAM, and now the last-gen RTX 2080 Ti has been given the same treatment. Well, kind of…",
    "Normally, this card has 11GB of GDDR6 VRAM, but when playing around with a broken model which was in for repair, VIK-on discovered that it (purportedly) will work if loaded up with 22GB of video memory.",
    "The caveat is that VIK-on didn’t actually install the 22GB of RAM on the card, as he couldn’t source the necessary 2GB memory modules to accomplish this (ongoing component shortages are making life difficult for everyone).",
    "As VideoCardz reports, VIK-on used a strap mod – in other words, fooling the GPU BIOS into supporting a larger amount of memory – to verify that this should work fine. As VIK-on’s modded 2080 Ti card stood, though, it didn’t actually run in anything like a stable fashion – unsurprisingly without the necessary physical memory modules in place – but did boot and show 22GB of VRAM is supported.",
    "So, this isn’t a mod as such – rather just a theoretical one – and of course the 2080 Ti is an outdated GPU now, but it’s still interesting to see what could be done in the way of memory boosting for a determined modder armed with the right knowledge and a heat gun.",
    "As mentioned, VIK-on previously worked on doubling up the video RAM of an RTX 3070, replacing 1GB memory modules with 2GB ones, as he would have done here if he’d had access to the latter. The resulting 3070 exhibited much less stuttering with 16GB in Watch Dogs: Legion compared to the vanilla card with its 8GB memory configuration."
  ],
  "headers": {
    "4": "Strap mod"
  },
  "links": {
    "Nvidia’s RTX 2080 Ti": "https://www.techradar.com/news/nvidia-rtx-3060-ti-outperforms-the-rtx-2080-ti-in-leaked-nvidia-benchmarks",
    "ongoing component shortages": "https://www.techradar.com/news/the-global-chip-shortage-has-created-a-shortage-ofchipmaking-machines",
    "VideoCardz": "https://videocardz.com/newz/modded-geforce-rtx-2080-ti-supports-22gb-of-gddr6-memory",
    "The resulting 3070 exhibited much less stuttering": "https://www.techradar.com/news/nvidia-rtx-3070-modded-with-16gb-vram-runs-watch-dogs-legion-more-smoothly"
  }
}