{
  "source": "https://www.techradar.com/news/has-science-gone-too-far-windows-11-spotted-running-on-lumia-950xl-smartphone",
  "title": "Has science gone too far? Windows 11 spotted running on Lumia 950XL smartphone",
  "category": "computing",
  "updated": "2021-06-18T09:54:24Z",
  "author": "matt-hanson",
  "summary": "Someone has already put it on an old phone",
  "article": [
    "You may have noticed that what appears to be Windows 11, the follow up to Windows 10, has leaked online, and some enterprising soul has already put it on the old Lumia 950XL.",
    "The Microsoft Lumia 950XL is a handset first released back in 2015, and long since discontinued. It was powered by a specially configured version of Windows 10 for mobile devices, which meant it was reasonably easy to install the desktop version of Windows 10 on the smartphone.",
    "It also meant that Microsoft’s now-canceled Windows 10X was installed on the smartphone, and now we’ve seen a brief glimpse of Windows 11 running on the handset.",
    "While we don’t know how well Windows 11 will run on the smartphone, it’s an impressive feat, and a testament to the Lumia 950XL, which can run an unreleased operating system launching six years after the phone went on sale.",
    "It’s also a good sign for Windows 11, showing how scalable the operating system will be.",
    "Does this mean we may see Windows 11 phones? Possibly. After Microsoft’s dalliance with Windows 10 handsets a while back, the company lost interest in trying to make a Windows smartphone.",
    "However, it recently released the Surface Duo, which is a dual-screen handset that runs a customized version of Android. Could the rumored Surface Duo 2 stick with Android, or move to Windows 11?",
    "Windows 10X, which Windows 11 is said to take some elements from, was supposed to be a version of Windows designed for mobile and dual-screen devices, so we could see that happen with the new operating system.",
    "However, people using the leaked version of Windows 11 have reported that the tablet mode, which gives Windows 10 a user interface with larger buttons (known as ‘Tiles’), is no longer present in Windows 11.",
    "This may mean that Microsoft is not planning on using it for smaller touch screen devices. However, what has leaked is likely a very early build with many features missing, so a tablet mode could come later.",
    "Hopefully, we won’t have long to find out more about Windows 11, as Microsoft is holding an event regarding the ‘next generation of Windows’ on June 24."
  ],
  "headers": {
    "5": "Windows 11 phones?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Lumia 950XL": "https://www.techradar.com/reviews/phones/mobile-phones/microsoft-lumia-950-xl-1306005/review",
    "Windows 10X": "https://www.techradar.com/news/windows-10x",
    "lost interest in trying to make a Windows smartphone": "https://www.techradar.com/news/end-of-windows-10-mobile-is-natural-conclusion-of-microsofts-shift-in-strategy",
    "Surface Duo": "https://www.techradar.com/reviews/microsoft-surface-duo",
    "Surface Duo 2": "https://www.techradar.com/news/surface-duo-2-could-see-microsoft-making-big-upgrades-to-its-dual-screen-smartphone",
    "June 24": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46194&u1=trd-us-1292842929845203200&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows%2Fevent"
  }
}