{
  "source": "https://www.techradar.com/news/windows-11-updated-with-new-features-and-fixes-heres-how-to-get-it",
  "title": "Windows 11 updated with new features and fixes - here's how to get it",
  "category": "computing",
  "updated": "2021-07-09T11:13:57Z",
  "author": "daryl-baxter",
  "summary": "Search returns to the Start menu",
  "article": [
    "Insider build testers got a surprise in the form of a new update to Windows 11, bringing many bug fixes and some new features as well.",
    "It’s been two weeks since the test build was released to Insiders on the dev channel, enabling many users to test how the latest upgrade from Microsoft runs, and whether there were any improvements to feed back to the company on.",
    "With a rumored release date of October, having updates being brought out almost every fortnight makes sense to see just what has been fixed or improved upon thanks to the early feedback from these users.",
    "The newest build, named 22000.65 (KB5004745), brings a dedicated search bar to the new Start menu. While this was hidden before, and would only show when you would start to type a query, having it appear at all times will make it much easier for others if they can’t find the app or file they need.",
    "The taskbar is now also able to show across multiple monitors at once, so you can easily reach an app or the start menu without having to go to one of the monitors to access it as before.",
    "While there’s numerous fixes in this build thanks to the feedback of users running Windows 11, there are other improvements in this build, such as:",
    "You can update to the latest build of Windows 11 by going to the Start menu and typing in ‘Settings’, select the application, and navigate to ‘Windows Update’. Select ‘Check for Updates’ and the latest build of 22000.65 should appear.",
    "After it downloads and installs, you will be on the latest build, with all the improvements and fixes listed above."
  ],
  "headers": {
    "3": "What’s new in Windows 11?",
    "6": "How can I update to the latest build?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "newest build": "https://blogs.windows.com/windows-insider/2021/07/08/announcing-windows-11-insider-preview-build-22000-65/"
  }
}