{
  "source": "https://www.techradar.com/news/casios-tough-new-g-shock-watches-look-super-slick-and-are-inspired-by-brake-discs",
  "title": "Can't afford a Garmin? Casio's new outdoor-inspired G-Shock could be the answer",
  "category": "fitness",
  "updated": "2021-08-16T11:58:17.338Z",
  "author": "cat-ellis",
  "summary": "The new lineup is much less expensive than you'd expect",
  "article": [
    "Casio has launched three new rugged G-Shock sports watches that are inspired by car components, and cost a lot less than you might expect. If you're keen on the great outdoors but your budget won't stretch to the Garmin Instinct, Amazfit T-Rex or Polar Grit X, they might be just what you're looking for – provided you don't need GPS.",
    "The three new watches (the black G-Shock GA2200BB-1A, the gray and turquoise GA2200M-1A, and the orange GA2200M-4A) are all reinforced with carbon fiber to protect the watch's core, while keeping weight down.",
    "The case of each watch is 12.8mm thick (compared to 15.3mm for the Garmin Instinct and 13mm for the Polar Grit X), which makes them three of the thinnest rugged watches around.",
    "Casio has a long history of adding interesting design quirks to its G-Shock series (whether it's inspired by volcanic lightning or exploring an unknown coast). The three latest watches were inspired by 'the great outdoors' – cars, to be specific. Each watch has a 3D dial, with a small inset dial inspired by an automotive brake disc and coated using a vapor-deposition process.",
    "The GA2200BB-1A costs $120 (about £85 / AU$160), while the GA2200M-1A and GA2200M-4A are both $130 (about £95 / AU$180). All three will be available to buy later this month.",
    "Casio has released a steady flow of new G-Shock watches so far this year, with more on the way soon. The company has been channeling its efforts into developing new designs, including dual-layer displays and extra tough decorative finishes, but one thing is hard to avoid: the majority stick to the company's conventional digital format.",
    "So why pick a G-Shock rather than a device from the likes of Apple, Fitbit, or Garmin? TechRadar put that question to Mike Princiotto, marketing manager of Casio's Timepiece Division. He explained that what sets Casio apart is its history in watchmaking; it's not setting out to sell you a phone, and more importantly, it knows how to make a watch that's seriously tough.",
    "Casio isn't averse to change, either. Many of its sports watches use Bluetooth to send stats including distance, speed and pace to your phone, and earlier this year, the company released its first G-Shock smartwatch: the G-Shock Move Pro GSW-H1000-1ER.",
    "The watch runs Google Wear OS, and has profiles for activities including running, weight lifting, cycling, surfing, and watersports. The latter two, Princiotto explained, were features requested specifically by G-Shock fans.",
    "Workout data is transferred automatically to the G-Shock Move smartphone app, where you can view your activity history, and enter a goal to receive training recommendations. You can also overlay your workout data on top of a video clip, and share it via social media.",
    "It seems unlikely that Casio will ever drop its signature G-Shock digital watches and go entirely smart, but if the GSW-H1000-1ER proves popular, companies like Polar and Suunto, that specialize in super-tough running watches, might want to watch their backs."
  ],
  "headers": {
    "3": "Fresh faced",
    "5": "Analysis: why not smartwatches?"
  },
  "links": {
    "Garmin Instinct": "https://www.techradar.com/reviews/garmin-instinct",
    "Amazfit T-Rex": "https://www.techradar.com/reviews/amazfit-t-rex-review",
    "Polar Grit X": "https://www.techradar.com/reviews/polar-grit-x",
    "volcanic lightning": "https://www.techradar.com/news/casio-launches-retro-cool-g-shock-watch-inspired-by-volcanic-lightning",
    "exploring an unknown coast": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_5311628308453729000&xs=1&url=https%3A%2F%2Fg-shock.co.uk%2Fga-900hc-3aer&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fcasios-tough-new-g-shock-watches-look-super-slick-and-are-inspired-by-brake-discs",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "the company released its first G-Shock smartwatch": "https://www.techradar.com/news/casios-latest-g-shock-smartwatch-is-smart-sporty-and-super-expensive",
    "running watches": "https://www.techradar.com/best/running-watches"
  }
}