{
  "source": "https://www.techradar.com/news/the-jodie-whittaker-era-of-doctor-who-has-been-far-from-vintage-but-the-shows-decline-started-years-ago",
  "title": "The Jodie Whittaker era of Doctor Who has been far from vintage, but the show’s decline started years ago",
  "category": "entertainment",
  "updated": "2021-08-01T16:26:48Z",
  "author": "richard-edwards",
  "summary": "Opinion: Doctor Who now has an opportunity to shake things up",
  "article": [
    "After months of rumors, it was no surprise when the BBC finally confirmed on July 29 that Doctor Who star Jodie Whittaker and showrunner Chris Chibnall would be leaving the show in 2022. Now the speculation about the show’s next incarnation can begin in earnest – and for Who fans, that’s always been part of the equation.",
    "On a show that calls the whole of space and time its playground, it’s perhaps appropriate that Doctor Who’s past and future often seem more important than its present. No other science fiction TV show – not even Star Trek – has nearly six decades of existing lore to live up to. Meanwhile, theorizing about the next resident of the TARDIS is a national sport in the UK, where everybody tends to have an opinion on who’d make a good Time Lord, regardless of when they last watched the show. It’s as big a deal as casting the next James Bond.",
    "Right now, however, the identity of the next Doctor, should be a relatively low priority for the BBC.",
    "Unless the truncated, six-episode series 13 (due later this year) and three subsequent specials lined up for 2022 manage to end Whittaker’s rein in a blaze of glory – and we’ll be delighted if they do – the era of the Thirteenth Doctor will not go down as a vintage one for the show. But that’s as much down to the culmination of several years of decline as it is about any particular failings of the current production team.",
    "If Doctor Who is going to return to the glory days of David Tennant and Russell T Davies – when it regularly went toe-to-toe with the likes of The X-Factor in the ratings and fuelled water-cooler conversations galore – there needs to be a major rethink about what Who is, and what it should be.",
    "As showrunner, Chibnall – who wrote episodes for earlier seasons of Doctor Who, and was also in charge of spin-off series Torchwood – has done an admirable amount to regenerate the show. When he cast the fun, likeable Whittaker (who he’d previously worked with on crime drama Broadchurch), he gave Who its first female Doctor, as well as introducing its most diverse roster of companions (or “friends”, as they’re now known) in Ryan (Tosin Cole), Yaz (Mandip Gill) and Graham (Bradley Walsh) – a policy he repeated on the other side of the camera with an all-new line-up of writers and directors.",
    "Historical episodes also moved into politically relevant time zones, with ‘Rosa’ taking in the US civil rights movement, ‘Demons of the Punjab’ travelling to partition-era India, and ‘The Witchfinders’ visiting 17th century witch trials.",
    "Alongside a move to make the show feel more cinematic with anamorphic lenses, Chibnall has also overseen some brave storytelling decisions, from a talking frog (much better than it sounds), to the Timeless Child arc. Indeed, as divisive as it was, the idea that the Doctor is the source of the Time Lords’ regeneration abilities is arguably the biggest shake-up in the show’s mythology since William Hartnell regenerated into Patrick Troughton over 50 years ago.",
    "And yet, despite the first Whittaker/Chibnall season getting Doctor Who’s best ratings for years – although there was a significant drop-off in their second year, the numbers were still comparable or better than predecessor Peter Capaldi’s final run – the execution hasn’t always matched the ambition. Too many stories have been inoffensively average, with the humor that characterized the Russell T. Davies and Steven Moffat eras largely conspicuous by its absence – how the show has missed the sort of memorable gags that could put a sticking plaster over a misfiring plot.",
    "Aside from classic villains the Master, the Daleks and the Cybermen, few monsters have stuck in the memory, and while that’s no crime in itself – of the New Who pantheon, it’s arguably only the Weeping Angels who’ve earned themselves a place at the bad guy top table – there haven’t been enough of the PG-friendly scares that have traditionally been one of the show’s hallmarks.",
    "Perhaps most importantly, this era of Who has repeatedly suffered from an overly-packed TARDIS, with the Doctor’s travelling companions proving that three’s a crowd; Yaz was particularly underserved by her first season, while Ryan and Graham’s New Year’s Day departure was spectacularly anti-climactic.",
    "Fundamentally, though, Chibnall hasn’t changed much about the Doctor Who formula, and he’s perhaps unfortunate to have inherited the series over a decade into its rebooted run. Even in Matt Smith and Capaldi’s tenures (both under Moffat’s watch), the show was starting to feel less essential – suddenly, a show that many would have moved mountains to watch ‘live’ on TV was relegated to catch-up status.",
    "As much time has now passed since Doctor Who’s triumphant return as it was off air following the BBC pulling the plug in 1989. Where Davies had the luxury of making his early seasons an ‘entry point’ show – knowing that an entire generation had been unable to see the TARDIS on TV – Chibnall is wrestling with 16 years of New Who continuity, and the perception that we've seen it all before. That’s before you’ve even addressed the legacy of the show’s original 26-year run.",
    "In a world where big-budget sci-fi TV has become the norm on Netflix, Amazon, Disney Plus and beyond, Doctor Who has simply started to feel like part of the furniture. So, rather than rushing to find replacements for Whittaker and Chibnall, the BBC needs to work out what adventures through space and time look like in the era of streaming giants – even if it means going away for three or four years to do it.",
    "Doctor Who is among the greatest, most versatile TV formats on planet Earth. It shouldn’t take a Time Lord-size intellect to make it feel like a must-watch once again.",
    "Doctor Who returns to BBC America and BBC One later this year."
  ],
  "headers": {
    "5": "The Chibnall era",
    "10": "Back to the drawing board"
  },
  "links": {
    "James Bond": "https://www.techradar.com/how-to/how-to-watch-the-james-bond-movies-in-order"
  }
}