{
  "source": "https://www.techradar.com/news/netflix-and-the-crown-win-big-at-the-emmys-but-the-competition-grows-stronger",
  "title": "Netflix and The Crown win big at the Emmys – but the competition grows stronger",
  "category": "entertainment",
  "updated": "2021-09-20T10:04:08Z",
  "author": "axel-metz",
  "summary": "Netflix finally claims its crown",
  "article": [
    "It’s been a peculiar year for television, but last night’s Primetime Emmy Awards proved there’s quality programming to be enjoyed on almost all of the major streaming services.",
    "Netflix and The Crown reigned supreme at the 73rd annual ceremony, with the latter scooping a clean sweep of awards in the drama categories, but HBO, Disney and Apple all took home trophies for their original shows, too.",
    "Ted Lasso and The Mandalorian, for instance, each nabbed seven awards, making them joint-third (after The Crown, The Queen’s Gambit and Saturday Night Live) for the series with the most wins (11) on the night.",
    "Ted Lasso’s award for breakout comedy marked the first win for Apple TV Plus in a series category, as the streamer continues its push towards big-budget original programming, while HBO – and its HBO Max platform – scooped 19 wins across the Primetime and Creative Arts ceremonies, with Mare of Easttown scoring four.",
    "But with 44 awards across all categories, Netflix once again proved itself king of the streamers by tying the Emmys record for most wins in a single year. The Crown provided the bulk of those awards, but The Queen’s Gambit also added several limited series wins to ensure the service ended the night top of the pile in two of the top three categories – a feat it has never previously achieved.",
    "There were a few surprises, though, dispelling fears that the Emmys had become something of a vanity ceremony for the industry’s old hands.",
    "Evan Peters, for instance, snagged a supporting actor trophy for Mare of Easttown, while HBO comedy Hacks took home a leading actress award for Jean Smart, as well as writing and directing wins for showrunner Lucia Aniello.",
    "As for the night’s overlooked shows, HBO’s Euphoria and Westworld missed out on deserving technical awards, though both will again be eligible for next year’s ceremony, along with their respective upcoming new seasons. The awards has also been criticized on social media for a lack of diversity in this year's winners.",
    "2022 will mark an exciting year for television across the board, too. Apple will look to build on its momentum with the arrivals of new shows Foundation and The Shrink Next Door, while Netflix and Disney Plus will see the return of Stranger Things and The Mandalorian to their respective libraries.",
    "It’s unclear whether HBO’s Game of Thrones spin-off House of the Dragon will arrive in time for next year, though the slim chance it may coincide with the release of Amazon’s much-anticipated (and uber-expensive) Lord of the Rings show should have fantasy fans chomping at the bit.",
    "Who needs new movies, anyway?"
  ],
  "headers": {},
  "links": {
    "streaming services": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Ted Lasso": "https://www.techradar.com/news/ted-lasso-season-2-release-date-cast-and-everything-else-we-know",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "Apple TV Plus": "https://www.techradar.com/news/apple-tv-plus-cost-review-and-everything-you-need-to-know",
    "continues its push": "https://www.techradar.com/features/apple-tv-plus-is-having-a-moment-and-netflix-should-be-worried",
    "HBO Max": "https://www.techradar.com/news/hbo-max-price-free-trial-movies-the-snyder-cut-and-more-explained",
    "Westworld": "https://www.techradar.com/news/westworld-season-4",
    "Foundation": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained",
    "Stranger Things": "https://www.techradar.com/news/stranger-things-season-4",
    "House of the Dragon": "https://www.techradar.com/news/house-of-the-dragon",
    "Lord of the Rings": "https://www.techradar.com/news/amazons-lord-of-the-rings-show-release-date-set-for-september-2022",
    "new movies": "https://www.techradar.com/news/new-movies-2021"
  }
}