{
  "source": "https://www.techradar.com/news/paypal-will-soon-let-you-pay-with-crypto-at-the-checkout",
  "title": "PayPal will soon let you pay with crypto at the checkout",
  "category": "computing",
  "updated": "2021-03-30T13:24:40Z",
  "author": "rob-clymo",
  "summary": "Cryptocurrencies are taking another step towards wider acceptance",
  "article": [
    "PayPal has plans to start allowing shoppers in the US to spend their cryptocurrency to make payments when buying online. The move echoes recent news from Visa which could power the drive towards using digital currency in everyday commerce transactions.",
    "Customers will be able to convert their bitcoin cash or litecoin held in PayPal digital wallets and convert the funds into fiat currencies, letting them pay for purchases at the checkout.",
    "With over 29 million merchants supporting the PayPal infrastructure around the world the new service could prove pivotal in helping boost the use of cryptocurrency. PayPal’s Checkout with Crypto service was launched back in October and already allows customers to buy, sell and hold cryptocurrencies.",
    "\"As the use of digital payments and digital currencies accelerates, the introduction of Checkout with Crypto continues our focus on driving mainstream adoption of cryptocurrencies, while continuing to offer PayPal customers choice and flexibility in the ways they can pay using the PayPal wallet,\" said Dan Schulman, president and CEO, PayPal. \"Enabling cryptocurrencies to make purchases at businesses around the world is the next chapter in driving the ubiquity and mass acceptance of digital currencies.\"",
    "Other companies are planning on following suit, and Tesla has already got the ball rolling for widening the acceptance of digital currency after announcing it will begin accepting bitcoin payments for its cars. The Tesla business model differs slightly in that the carmaker will hold the bitcoin, rather than turning it into fiat currency.",
    "Interest in Bitcoin is continuing to grow with the digital currency having doubled in value since the beginning of this year, despite its volatile reputation and fairly limited track record. The move by PayPal is likely to increase the fervor, helped by the flexible approach being taken by the payments company. There’s no transaction charge and only one type of coin can be used during purchases it has said."
  ],
  "headers": {
    "4": "Checkout with Crypto"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/best/mining-rigs",
    "news from Visa": "https://www.techradar.com/news/visa-may-soon-let-you-make-payments-using-this-cryptocurrency",
    "commerce transactions": "https://www.techradar.com/best/best-payment-gateways",
    "Checkout with Crypto": "https://www.techradar.com/news/paypal-now-lets-all-us-users-buy-sell-and-store-bitcoin-and-other-cryptocurrencies",
    "bitcoin payments": "https://www.techradar.com/news/you-can-now-pay-with-bitcoin-on-your-iphone",
    "PayPal": "https://www.techradar.com/reviews/paypal-commerce-platform"
  }
}