{
  "source": "https://www.techradar.com/news/exclusive-why-2022-could-be-a-big-year-for-resignations",
  "title": "Why 2022 could be a big year for resignations",
  "category": "computing",
  "updated": "2021-09-14T15:27:38Z",
  "author": "abigail-opiah",
  "summary": "Resignations to peak as 2022 is labeled the year of the startup",
  "article": [
    "More than a quarter of the workforce in the US and in the UK plan to resign to start their own venture, according to data from an exclusive global survey carried out by TechRadar Pro.",
    "The surprising results, found in a study by real-time poll platform OnePulse, means that “2022 could be the year of the startup”, according to Desire Athow, managing editor of TechRadar Pro.",
    "Collating data from 1,050 UK survey participants, the survey found that more than a quarter (27%) plan to quit their jobs to pursue the dream of being their own boss. In the US, the figure was around the same, with 26.6% of respondents planning to leave and follow their dreams.",
    "Among the 1,051 US respondents who said they plan to launch a startup, almost half (47.2%) said that financial freedom is the driving force behind wanting to start their own business.",
    "Retail was the most popular industry for new startups, as 15.9% of US survey participants and 20.3% of US respondents said they would want to launch there. This may be no surprise, as it has been estimated that there will be 2.14 billion global digital buyers in 2021, with e-commerce sales expected to account for 18.1% of all global retail sales this year alone.",
    "At the other end of the scale, agriculture and finance were at the bottom of the pile for both UK and US respondents, as the least desirable industries to launch a startup.",
    "Interestingly, it seems the start-up dream isn’t for everyone, with 58.9% of UK respondents and 52.5% of US respondents expressing their lack of desire to create a business of their own. And among the dreamers, many may be treading carefully to begin with, as nearly three-quarters (72%) of those surveyed in the UK said they plan to run their own business on the sideline of their current employment."
  ],
  "headers": {
    "4": "But what type of startup?"
  },
  "links": {
    "OnePulse": "https://www.onepulse.com/",
    "e-commerce": "https://www.techradar.com/best/ecommerce-tools"
  }
}