{
  "source": "https://www.techradar.com/news/the-best-techradar-reads-you-may-have-missed-feb-15-2020",
  "title": "The best TechRadar reads you may have missed",
  "category": "appliances",
  "updated": "2021-02-15T12:16:58Z",
  "author": "axel-metz",
  "summary": "The very best of TechRadar from the week that was",
  "article": [
    "How did you spend Valentine's Day this year? Curled up in front of Netflix with two bottles of white, we’ll bet, unless you really pushed the boat out and went for the whole projector-in-the-garden gesture. In any case, with lockdowns keeping most of us inside and Covid-19 meaning the doors remain firmly shut on restaurants and cinemas alike, many couples around the world were forced to turn to technology to keep the romance alive (no, not like that).",
    "For the singletons among us, though, we at TechRadar saw fit to alleviate the sting of countless social media posts by bringing you plenty of exciting tech news and features (because what’s love compared to an LG C1 OLED TV?).",
    "Here, we’ve picked out the best TechRadar content of the week, from the latest rumours on the new Sonos speaker to what makes the Alice camera the snapper of the future. We’ve even gone ahead and explained why Malcolm and Marie is the perfect anti-Valentine's Day Netflix movie – rest assured, it’s no rom-com.",
    "There’s also a host of review and opinion content for you to sink your teeth into, but if you’re after something a little easier on the eyes (but maybe not the ears), we’ve parked the latest episode of the TechRadar Noise Cancelling Podcast at the end of this article for your convenient listening pleasure.",
    "While video doorbells have proven a handy way to answer the door when you’re not home, you still need to be on the alert for the phone notification telling you the Amazon driver is waiting outside in the rain.",
    "Now, though, Alexa is on hand to spare you both the inconvenience of a missed delivery. Alexa Greetings sees Amazon’s voice assistant greet the person on your doorstep once the doorbell has been pressed – and she’ll even take a message to pass on once you return. Alexa, thanks.",
    "Read more…",
    "Netflix reportedly paid around $30 million for a movie which essentially features nothing more than two attractive people (Zendaya and John David Washington) arguing about their lives in one location for 106 minutes.",
    "Still, if you’re looking to feel better about your own relationship (or even lack thereof) during lockdown, Malcolm and Marie is worth a watch.",
    "Read more…",
    "Few would dispute that Sonos is king when it comes to home speakers, so it’s big news whenever the company sows the seeds of an announcement for a new device. A recent FCC filing suggests Sonos is on the verge of launching a new wireless speaker, and it’s got us excited to see what’s next for the world of wireless audio.",
    "We’ve rounded up everything we know about the rumored Sonos Move follow-up.",
    "Read more…",
    "It’s no secret that phones are no longer Sony’s forte – nowadays, it’s much more interested in a little thing called the PS5. But with the Sony Xperia 1 III, the Japanese giant could do well to take a leaf out of the Samsung Galaxy S21's book.",
    "Samsung's success with selling lower-cost smartphones should send a message to Sony to keep its prices low and its focus firmly on making a competent mobile device, rather than a movie-watching, game-playing powerhouse. After all, that’s what PlayStations are for.",
    "Read more…",
    "We were lucky enough to see LG’s C1 OLED in person shortly after it was announced at CES 2021 – and boy, does it dazzle the eyes.",
    "With a sharper picture and greater audio processing than its predecessor, LG’s latest OLED model (available in an enormous 83-inches) looks set to be a contender for the best TV of 2021 when it finally launches.",
    "Read more…",
    "For our Senior Computing Editor, Windows 10 laptops are dead. That’s thanks to the surprising success of Apple’s latest M1-powered Macs, which blow Microsoft’s OS out of the water when it comes to speed, accessibility and aesthetic.",
    "But could Intel Evo change all that? Like the Ultrabooks that came before, Intel Evo is a list of specifications that Intel thinks represents the next evolutionary leap in laptops – and it really is some exciting stuff. Watch this space.",
    "Read more…",
    "From the Sony A1 to the Fujifilm GFX100S, this year has got off to a flying start for new mirrorless cameras – but none of them are arguably as innovative or intriguing as the Alice Camera.",
    "We chatted to its makers, who told us more about the AI camera, including why it could prove the snapper of the future.",
    "Read more…",
    "The week's biggest tech news, in podcast form! We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's show is presented by Gareth Beavis, TechRadar's Global Editor-in-Chief, and Sherri L. Smith, Editor-in-Chief of Laptop Mag, with guests Matt Swider, Managing Editor at TechRadar, and James Peckham, Phones Editor at TechRadar, who join us (remotely, of course) to talk about the last seven days in tech.",
    "Catch up on all the latest tech gossip, from our breakdown of Intel's fightback against AMD to our reactions to the Xiaomi Mi 11.",
    "Read more…",
    "You can find every episode of Noise Cancelling here too"
  ],
  "headers": {
    "4": "Greetings from Alexa",
    "7": "Love in lockdown",
    "10": "Is a new Sonos speaker on the horizon?",
    "13": "Learning from Xperiance",
    "16": "Getting cosy with the LG C1 OLED TV",
    "19": "Can Intel put the ‘win’ back in Windows 10?",
    "22": "Is this the camera of the future?",
    "25": "Apple's foldable phone and Xiaomi Mi 11: Noise Cancelling podcast episode 51"
  },
  "links": {
    "Read more…": "https://www.techradar.com/news/apples-foldable-phone-and-xiaomi-mi-11-noise-cancelling-podcast-episode-51",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Intel Evo": "https://www.techradar.com/news/intel-evo-could-be-a-revolutionary-new-lineup-of-processors",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "You can find every episode of Noise Cancelling here too": "https://audioboom.com/channels/5019679"
  }
}