{
  "source": "https://www.techradar.com/news/kefs-new-subwoofer-uses-uni-core-tech-to-hit-some-serious-sub-bass-notes",
  "title": "KEF's new subwoofer uses Uni-Core tech to hit some serious sub-bass notes",
  "category": "audio-visual",
  "updated": "2021-01-22T06:45:22Z",
  "author": "nick-pino",
  "summary": "KEF has a new subwoofer with a frequency response of 11Hz",
  "article": [
    "For 2021, audio brand KEF is going to hit a new low... in terms of frequency.",
    "The company has just announced a new subwoofer model, the KC62, that uses a proprietary technology called Uni-Core that offers unrivaled bass response.",
    "Uni-Core is based off of the dual-opposing drivers you might have seen before on the Sonos Sub, but mixes things up by reducing the size of the voice coil inside the driver. This allows the driver to move more air than a standard sub or dual-sub, producing lower sub frequencies and reducing the overall size of the cabinet.",
    "The result, according to KEF, is a subwoofer that can hit 11Hz – far below what you can hear, but not below what can be felt – while reaching up to 200Hz.",
    "At just 246 x 256 x 248mm, the KC62 is the definition of small-but-mighty – inside the cabinet, the KC62 will use two specially designed Class D amps that pack over 1,000 watts of power in the sub that can output 105db of sound.",
    "To make audio sound its best, the KC62 uses KEF’s Music Integrity Engine, a set of DSP algorithms that amplify and smooth out the signal, which are crucial to prevent the bass from sounding too bloated.",
    "In terms of connections, you’ll have a choice of line-in or four-pin Phoenix Connector (more common in Europe than here in the States), as well as the option to use a wireless connection kit if you want a wire-free setup.",
    "That said, the KC62 isn’t cheap – it’ll set you back $1,500 (£1,400, around AU$1,900), which is definitely on the more expensive side for subwoofers. It's a big investment, but if you're after big bass in a small package, it'll be hard to beat."
  ],
  "headers": {
    "4": "A small but mighty subwoofer"
  },
  "links": {}
}