{
  "source": "https://www.techradar.com/news/marvel-reportedly-has-big-mcu-phase-5-plans-but-what-could-they-be",
  "title": "Marvel reportedly has big MCU Phase 5 plans – but what could they be?",
  "category": "entertainment",
  "updated": "2021-04-29T09:39:09Z",
  "author": "tom-power",
  "summary": "When are the X-Men being introduced, Marvel?",
  "article": [
    "Falcon and the Winter Soldier may have ended on Disney Plus, but there's plenty more content for MCU fans to start getting excited about. The Loki TV series arrives on the streaming platform on June 11, and it'll be closely followed by Black Widow on July 9.",
    "While we wait for those next MCU instalments to arrive, there's one thing that fans can do in the meantime – speculate on what lies in store for the MCU's future.",
    "We already know that there are multiple movies and TV shows in the works. According to the Falcon and the Winter Soldier's head writer, though, we don't actually know all that much about Phase 4 and beyond.",
    "Speaking to Murphy's Multiverse in the wake of the Falcon and Winter Soldier season finale, Malcolm Spellman teased that Marvel had yet to reveal a whole host of upcoming movies.",
    "\"I was surprised about how few of the upcoming Marvel movies have been announced,\" Spellman said when asked about the MCU's future. \"Fans will start to become more and more clear as these projects get announced.\"",
    "The illustrious history of Marvel comics means that we could see any number of movie adaptations. Ordinarily, it would be hard to pinpoint what Marvel Studios has in store but, based on what we've seen and heard about Phase 4, we can hazard some guesses.",
    "First up, we have Captain America 4. Marvel hasn't officially announced it yet, but there's apparently been discussions within Marvel's corridors of power about another movie outing for Cap. Of course, Anthony Mackie's Sam Wilson – and not Chris Evans' Steve Rogers – would be the star of that potential flick, given that he finally adopted the Captain American mantle in Falcon and Winter Soldier episode 6.",
    "Next, it's likely that we'll see a film adaptation of Young Avengers. We've already seen two prominent members in Billy and Tommy Maximoff – aka Wiccan and Speed – in the MCU due to their WandaVision appearances. It's pretty much certain, at this point, that Wanda is searching for them as part of her Doctor Strange 2 story arc, and reports have suggested that Billy and Tommy's actors are part of that movie's cast.",
    "If that's true, we potentially already know of six Young Avengers who exist in the MCU. Kate Bishop, who will be the co-protagonist in Hawkeye's Disney Plus series later this year, is one. We've also met Eli Bradley – the grandson of another Captain America in Isaiah Bradley – in Falcon and the Winter Soldier, who eventually becomes the superhero known as Patriot.",
    "Another Young Avengers we could be introduced to is America Chavez – aka Miss America – who is also part of Doctor Strange 2's cast. Chavez may encounter the Sorcerer Supreme as he attempts to stop the Multiverse from collapsing in on itself. If she ends up relocating to the MCU's current reality, she could join the lineup, too. Lastly, Cassie Lang – Ant-Man's daughter – becomes Stature in the comics, and also accepts an invitation to join Young Avengers.",
    "Finally, we're yet to hear anything about Marvel's X-Men plans. Madripoor, which has big ties to mutant fan favorite Wolverine, was visited by Sam, Bucky Barnes and Helmut Zemo in Falcon and the Winter Soldier. If this iconic location exists in the MCU, it's only a matter of time before the X-Men are officially introduced, right?",
    "In a separate Murphy's Multiverse article, Spellman revealed that Madripoor's MCU addition only came after the idea for a criminal-centric city was developed, which ended up sounding like the fictional island principality. Now that Madripoor is canon in the MCU, though, there's every opportunity for Marvel Studios to begin to bring Wolverine, Magneto, Professor X and other mutants into its cinematic world.",
    "There are other Marvel properties that could be announced. There's been longstanding rumors surrounding the introduction of Nova – another Guardians of the Galaxy member who could make his debut in Volume 3 – while a Dark Avengers, which may include Wyatt Russell's US Agent or Emily VanCamp's Power Broker, is another possible movie.",
    "Much will depend on whether Marvel Studios thinks future projects will work better through the longform medium of its Disney Plus TV show format or a film. For now, we'll continue to speculate on which MCU movies may arrive post-Phase 4."
  ],
  "headers": {
    "5": "What could the unannounced MCU movie projects be?"
  },
  "links": {
    "Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place",
    "Loki TV series": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Murphy's Multiverse": "https://www.murphysmultiverse.com/exclusive-falcon-and-winter-soldiers-malcolm-spellman-reveals-how-little-we-know-about-marvel-studios-future-line-up/",
    "Captain America 4": "https://www.techradar.com/news/ahead-of-captain-america-4-see-the-first-official-images-of-anthony-mackies-cap",
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "reports": "https://www.somersetlive.co.uk/news/somerset-news/doctor-strange-2-marvel-filming-5311221",
    "Hawkeye": "https://www.techradar.com/news/hawkeye-on-disney-plus-release-date-cast-story-and-what-we-know",
    "who is also part": "https://www.marvel.com/articles/movies/doctor-strange-multiverse-of-madness-america-chavez-sam-raimi",
    "Murphy's Multiverse article": "https://www.murphysmultiverse.com/exclusive-falcon-and-winter-soldier-malcolm-spellman-talks-how-madripoor-and-fontaine-were-added-to-the-series/",
    "introduction of Nova": "https://www.syfy.com/syfywire/james-gunn-guardians-vol-3-will-set-up-decades-of-cosmic-stories-could-introduce-nova"
  }
}