{
  "source": "https://www.techradar.com/news/loki-episode-1-recap-under-the-skin-of-a-great-mcu-villain",
  "title": "Loki episode 1 recap: under the skin of a great MCU villain",
  "category": "entertainment",
  "updated": "2021-06-09T16:04:08Z",
  "author": "richard-edwards",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for the first episode of Loki follow. Watch it first before reading this.",
    "Numerous factors have propelled the Marvel Cinematic Universe to its lofty position as the biggest screen franchise in history – such as storytelling prowess, an uncanny instinct for casting, and an expanding stable of memorable characters. But arguably the biggest reason for the MCU’s phenomenal success is a unique mix of familiarity and versatility, where characters you know and love – or, indeed, hate – can leap between genres without ever leaving the safety net of a vast shared universe.",
    "The new Loki TV show is precision-engineered to exploit this unique strength. Tom Hiddleston’s god of mischief has been a mainstay of the franchise since upstaging his brother in the original Thor back in 2011 – and was arguably the MCU’s first great villain. Here, however, he’s in entirely new territory, plucked out of reality by a bureaucratic organization charged with keeping the space-time continuum playing out how it should.",
    "It’s a match made in (an antagonistic version of) heaven, as Loki’s inherent instinct for chaos collides head-on with the Time Variance Authority – although Loki’s never run into the TVA in the comics, it’s hard to think of a more suitable adversary for a self-confessed “mischievous scamp”.",
    "Just as Guardians of the Galaxy brought space into the Marvel mix and Doctor Strange peeled back the magical corners of the MCU, the Loki TV show dives deep into the time travel mechanics introduced in Avengers: Endgame. But more importantly it’s the perfect showcase for a character who’s always got a memorable one-liner up his sleeve – and whose allegiances are constantly, intriguingly shifting.",
    "The show kicks off during the events of Avengers: Endgame, as Loki – the unreconstructed 2012 version from the first Avengers movie – uses the Tesseract to escape captivity. Within seconds of crash-landing in the Gobi desert, portals are opening up around him, with TVA operatives (led by the efficiently named Hunter B-15) arriving to take him into custody.",
    "Loki suddenly finds himself in the beigest environment seen on screen since the ’70s-set Gary Oldman adaptation of Tinker Tailor Soldier Spy, a Brazil-inspired office space powered by paperwork and analogue tape. With his Asgardian leather robes unceremoniously replaced with standard-issue prison overalls, and the prospect of queuing for (probably) the first time in his life, Loki hasn’t looked so out of his depth since his first meeting with the Hulk.",
    "If the inner workings of the TVA are new to Loki, they’re similarly strange to us. Luckily, this excellent first episode gets the potentially troublesome exposition out of the way in an extremely efficient manner, by borrowing a plot device from Jurassic Park.",
    "Animated explainer Miss Minutes is effectively Mr DNA rebranded, her retro cartoon stylings the perfect medium for explaining how a trio of all-knowing beings known as the Time-Keepers established the “Sacred Timeline” in the wake of a multiversal war. The TVA was set up to do their bidding, intercepting miscreants who veer off the path the Time-Keepers created. This all explains why Loki – who created an alternative timeline when he escaped from the Avengers – is on the TVA’s most wanted list.",
    "Loki narrowly avoids being “reset” – not quite as bad as “pruning”, we suspect – when Agent Mobius (Owen Wilson) escorts the Asgardian from court, to ask him some questions of his own…",
    "Loki’s bickering relationship with his adoptive brother has always been one of the best things about the Thor movies, but he may have found an even more entertaining foil in Mobius. The TVA agent knows exactly how to hit the Asgardian’s buttons, goading Loki about his multiple failures – “It’s funny, for someone born to rule, you sure do lose a lot” – and telling him he doesn’t rank among the most dangerous “Variants” the Authority are pursuing: “You’re just a little pussycat.” Aside from a few clever uses of a device known as a “Time-Twister” – “Time moves differently in the TVA,” Mobius frequently reminds us – it’s just two guys talking in a room, and it’s the best stuff in the episode. By turns funny and surprisingly emotional, you know that the next killer line is never far away.",
    "Mobius also does a brilliant job of getting inside Loki’s head, as he repeatedly asks whether the trickster god enjoys hurting people. Loki’s admission that it’s “part of the illusion, the cruel elaborate trick conjured by the weak to inspire fear” is an unexpected display of vulnerability and self-awareness, and Tom Hiddleston plays it perfectly.",
    "The way he shifts from pompous, mock-Shakespearean bravado to genuine emotion (particularly when Mobius’s “greatest hits” reel reveals the life he should have led in the other timeline) shows why Marvel Studios has chosen to build a TV show around him.",
    "So is Loki going to be the hero or the villain in the series that bears his name? This first episode suggests he’ll be a little bit of both, though even more tantalizing is the reveal that the dangerous Variant Mobius is tracking is actually another version of Loki. Perhaps the god of mischief really is about to meet his match…",
    "Verdict:",
    "After the radically different WandaVision and The Falcon and the Winter Soldier, the third Disney Plus/Marvel series shifts gears again – yet still feels 100 per cent part of the MCU.",
    "From his over-the-top threats to the character’s rarely seen tender side, Hiddleston entirely justifies Marvel Studios’ decision to bring the god of mischief back from the dead – especially when he’s sparring with Owen Wilson’s brilliantly laconic Agent Mobius. The Loki TV show is Marvel at its most quotable.",
    "And in an episode that plays out like a textbook for world-building, the introduction of the out-of-time TVA opens the door to an intriguing new branch of the MCU, where the blandest office environment in history is a front for some complex temporal mechanics – not to mention an organization so powerful they use the Infinity Stones as paperweights. We’re still learning the rules of this brave new world, but if the fun tricks of the Time-Twisters are anything to go by, finding out more is going to be a blast.",
    "New episodes of Loki debut on Disney Plus every Wednesday."
  ],
  "headers": {
    "18": "Marvel-ous facts"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-tv-show-on-disney-plus-release-date-trailer-cast-plot-mcu-connections-and-more",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "multiversal war": "https://www.techradar.com/news/loki-episode-1-just-explained-how-the-marvel-cinematic-multiverse-works"
  }
}