{
  "source": "https://www.techradar.com/news/slack-is-down-2021",
  "title": "Slack down: some users still seeing issues on return to work",
  "category": "computing",
  "updated": "2021-01-04T17:44:58Z",
  "author": "matt-swider",
  "summary": "Slack outage sees Server Errors greeting workers returning in 2021",
  "article": [
    "Returning to work in 2021 just got a bit more tricky after top collaboration platform Slack suffered a significant outage across the world.",
    "On the first Monday of 2021, Slack went down in many locations around the world at around 10am ET - but as of 12:30pm ET, many were able to reconnect.",
    "\"While the issue is largely still ongoing, we believe some customers may see improvement in connecting to Slack after a refresh (CTRL/CMD + R)\", The company wrote on its support page.",
    "The company says it is continuing to investigate the outage, which appears to have hit Slack users across the world, but there's no fix in place yet.",
    "\"We’re still investigating the ongoing connectivity issues with Slack. There's no additional information to share just yet, but we’ll follow up in 30 minutes. Thanks for bearing with us,\" the official Slack status page said.",
    "In its latest update, dated 12:29 ET / 17:29 GMT, Slack said that it was still carrying out further investigation into the issue.",
    "\"We're continuing to investigate connection issues for customers, and have upgraded the incident on our side to reflect an outage in service,\" the company said. \"All hands are on deck on our end to further investigate. We'll be back in a half hour to keep you posted.\"",
    "The outages appear to only affect some users of the desktop Slack app, with both the iOS and Android versions still working.",
    "According to Slack's official status page: \"Customers may have trouble loading channels or connecting to Slack at this time. Our team is investigating and we will follow up with more information as soon as we have it. We apologize for any disruption caused.\""
  ],
  "headers": {},
  "links": {
    "Slack": "https://www.techradar.com/reviews/slack",
    "said": "https://status.slack.com/2021-01/9ecc1bc75347b6d1"
  }
}