{
  "source": "https://www.techradar.com/news/marvel-may-have-found-its-new-black-panther-but-are-they-a-good-fit",
  "title": "Marvel may have found its new Black Panther – but are they a good fit?",
  "category": "entertainment",
  "updated": "2021-11-11T13:03:18Z",
  "author": "axel-metz",
  "summary": "M’Baku forever?",
  "article": [
    "It’s no secret that Chadwick Boseman’s tragic and unexpected passing left a T’Challa-sized hole in Marvel’s plans for future Black Panther movies – but fans are still yet to learn who, if anyone, will be taking up the titular hero’s mantle.",
    "For months, the presumption had been that Letitia Wright, who plays T’Challa’s sister, Shuri, in the first movie and upcoming sequel Black Panther: Wakanda Forever, would step into the lead role. Recent reports, though, have suggested that this may not be the case, after all.",
    "Now, we’re hearing rumors (per a story from Giant Freakin’ Robot (GFR)) that Winston Duke’s M’Baku will be inheriting the Black Panther moniker, instead. This news comes by way of the publication’s supposedly “trusted and proven inside sources,” but we’d still advise taking it with a hefty pinch of salt.",
    "It’s worth clarifying Marvel’s official comments regarding the future of the Black Panther universe following Boseman’s death in August 2020. At the time, Marvel confirmed that it wouldn’t recast the role of T’Challa as a tribute to the late actor’s powerful portrayal.",
    "\"Honoring Chadwick Boseman's legacy and portrayal of T'Challa, Marvel Studios will not recast the character, but will explore the world of Wakanda and the rich characters introduced in the first film,\" a company tweet read last year.",
    "Many fans took this to mean that Shuri would likely step into T'Challa’s shoes in Black Panther: Wakanda Forever, which is scheduled for release on November 11, 2022 as part of Marvel’s Phase 4 movie roster.",
    "But, although shooting began on the project earlier this year, Wright sustained an injury which forced her to return home to London.",
    "It seems, then, that Marvel may be considering contingency plans for the future of the franchise. In our opinion, that’s why GFR’s claims about Winston Duke hold water – even if we’re not totally convinced about their authenticity.",
    "So, would Winston Duke actually make a good Black Panther?",
    "Duke’s character, M’Baku, has a rocky relationship with Boseman’s T’Challa in the original Black Panther movie. He is the leader of the Jabari Tribe, a group of Wakandans who have removed themselves from mainstream society, and challenges T'Challa for the crown in ritual combat.",
    "The eponymous hero defeats M'Baku and persuades him to yield rather than die, but he’s clearly less-than-impressed with his new leader. Still, as repayment for his debt, M'Baku and the Jabari tribe arrive to reinforce T'Challa against Michael B. Jordan’s Killmonger during the movie’s final battle.",
    "In the comics, M'Baku remains T'Challa’s domestic foe, though his appearances in both Avengers: Infinity War and Endgame – fighting alongside the Wakandan army against Thanos’ forces – suggest Marvel would be willing to further digress from its source material by appointing him leader of the Wakandans in Black Panther: Wakanda Forever.",
    "It’s plausible, then, but is it likely? We know that Wakanda Forever will be focusing on “the rich characters introduced in the first film,” one of whom is M'Baku, so audiences could be exposed to a more kind-hearted, likeable leader than the gruff warrior we’ve seen so far.",
    "That said, M’Baku has previous form for showcasing his jovial side. We saw as much in Black Panther, when he joked with T’Challa and company after Bosewick’s character is revealed to be alive following his defeat to Killmonger earlier in the movie. So, while M’Baku portrays himself to be a very serious individual, his underlying personality, combined with his clearly imposing physical presence, would make him an ideal replacement for T’Challa.",
    "Still, we’re unsure about anyone assuming the mantle of Black Panther sometime soon. In our view, T’Challa (and Boseman, by extension), is Black Panther. Seeing someone else in his suit with his superpowers, then, would be strange, even if it’s done with the best intentions on Marvel’s part.",
    "It’ll be a while before we find out for sure, anyway. Black Panther: Wakanda Forever won’t arrive in theaters for another 12 months, and we suspect that Marvel will keep this particular card close to its chest until it’s finally released.",
    "Hopefully, the studio makes the right decision in honoring Boseman either way."
  ],
  "headers": {
    "3": "The state of play",
    "9": "Keep your enemies close"
  },
  "links": {
    "Recent": "https://www.hollywoodreporter.com/business/business-news/hollywood-studio-projects-get-stricter-about-covid-19-vaccine-mandates-1235045153/",
    "reports": "https://www.looper.com/657843/why-black-panther-fans-should-be-worried-about-letitia-wrights-mcu-future/",
    "story from Giant Freakin’ Robot": "https://www.giantfreakinrobot.com/ent/exclusive-winston-duke-black-panther.html",
    "Marvel’s Phase 4": "https://www.techradar.com/news/marvel-phase-4"
  }
}