{
  "source": "https://www.techradar.com/news/microsoft-scores-a-bizarre-own-goal-with-latest-teams-update",
  "title": "Microsoft scores a bizarre own goal with latest Teams update",
  "category": "computing",
  "updated": "2021-09-21T12:45:39Z",
  "author": "joel-khalili",
  "summary": "Quoted replies, but only in some chats",
  "article": [
    "Microsoft is preparing to roll out an update for collaboration platform Teams that should make it easier to respond to specific messages. However, some will ask whether the update goes far enough.",
    "Already built into the Microsoft Teams mobile clients, the quoted reply feature is now available in preview on desktop, allowing users to embed original messages in their responses.",
    "“It is a great way to add context and clarity with who you are conversing with, whether it is a recent message or from earlier in the conversation,” Microsoft explained in a blog post.",
    "To utilize the new functionality, Teams users running the latest preview build can simply right-click a message and select “Reply”. And the feature should roll out to regular users in the near future.",
    "Inexplicably, however, quoted replies functionality in Teams applies to one-on-one, group and meeting chats only and so cannot be used in group channels.",
    "In the context of the wider messaging and collaboration market, Microsoft is already late to the party; rival services such as Slack have long offered the ability to nest messages in responses.",
    "Now, the company appears to have squandered an obvious opportunity to close the gap, by limiting its quoted replies feature to a smaller selection of scenarios.",
    "In practice, a feature of this kind is most valuable in a group chat context. The amount of traffic (especially in more populous channels) means messages are easily buried and are more likely to go without a response, which is particularly problematic for remote-first teams.",
    "The comments section of the Microsoft blog post suggests the Teams community shares this view; the entries with the largest number of upvotes almost all raise questions about the application of the feature in channels.",
    "TechRadar Pro has contacted Microsoft to find out whether users can expect the new functionality to be extended to channels any time soon."
  ],
  "headers": {
    "5": "A missed opportunity"
  },
  "links": {
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "blog post": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1160569094791386000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fmicrosoft-teams-public-preview%2Fnow-in-public-preview-quoted-reply-for-desktop-web-coming-soon%2Fm-p%2F2761594&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-scores-a-bizarre-own-goal-with-latest-teams-update",
    "Slack": "https://www.techradar.com/reviews/slack"
  }
}