{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-a-simple-upgrade-that-will-offer-major-improvements",
  "title": "Microsoft Teams is getting a simple upgrade that will offer major improvements",
  "category": "computing",
  "updated": "2021-10-06T18:18:05Z",
  "author": "barclay-ballard",
  "summary": "New Microsoft Teams search feature is likely to be a hit",
  "article": [
    "It’s been well known for a while now that Microsoft Teams is set to receive enhanced search functionality in the coming weeks and months, and now some more details have come to light regarding exactly what this will entail. The Microsoft 365 roadmap has revealed some more information concerning an update called “Top Hits,” which should speed up the search process significantly.",
    "“Top Hits introduces a new section at the top of the autosuggest suggestions where the most relevant results, across domains, for a given query are represented” the Microsoft 365 roadmap explains. “This feature is envisioned to reduce the time taken for a successful search, as well as benefit the user through better task completion, especially for result types situated lower in the suggestions well.”",
    "The new feature is currently in development and is scheduled for a March launch.",
    "Essentially, Top Hits will work by displaying the most relevant results at the top of the autosuggested results. It could prove extremely useful for Teams users that have a lot of similarly named files that they would normally have to sift through even after entering the relevant terms into the search bar.",
    "The addition of “Top Hits” is just the latest new feature to make its way to Microsoft Teams. With user figures surging as a result of the COVID-19 pandemic, Microsoft has been working hard to add regular new features to the platform, with competition rife among the best-known video conferencing and collaboration tools.",
    "Search enhancements have been one of Microsoft Teams' key focus areas for a while now and further updates are expected to be announced in this area in the near future."
  ],
  "headers": {
    "3": "Searching for a competitive edge"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "explains": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1249664940051925800&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D70563"
  }
}