{
  "source": "https://www.techradar.com/news/square-snaps-up-buy-now-pay-later-service-afterpay",
  "title": "Square snaps up buy now, pay later service Afterpay",
  "category": "computing",
  "updated": "2021-08-02T09:34:59Z",
  "author": "rob-clymo",
  "summary": "Largest acquisition yet bolsters Square's fintech offering sector",
  "article": [
    "Payments giant Square could be set to offer more flexible payment options after it revealed a deal to acquire Afterpay, the Australian company that specializes in buy now, pay later services.",
    "In an update, Jack Dorsey, Square CEO highlighted how the $29bn deal would mean the companies could use the combined power of Square’s CashApp and Seller ecosystem to offer better services for merchants and consumers alike.",
    "The purchase will further boost Square’s investment in the financial sector, and wider overall expansion, having recently also unveiled plans for a Bitcoin business unit along with recently purchasing a majority stake in streaming service Tidal.",
    "Buy now, pay later services are proving incredibly popular with consumers thanks to the ability to spread payments for products over a period of time via installments.",
    "The growing appeal of the services has spawned several key players, including Klarna and Affirm alongside Afterpay. Even Apple has plans to enter the buy now, pay later marketplace and is rumoured to be working on its own Apple Pay Later service.",
    "The acquisition will also give Square access to over 16 million of Afterpay’s customers as well as a network of merchants that numbers almost 100,000. Square expects to complete the purchase of Afterpay during the first quarter of 2022 in a move that will see an Afterpay director added to the board of Square.",
    "“Square and Afterpay have a shared purpose. We built our business to make the financial system more fair, accessible, and inclusive, and Afterpay has built a trusted brand aligned with those principles,” said Dorsey. “Together, we can better connect our Cash App and Seller ecosystems to deliver even more compelling products and services for merchants and consumers, putting the power back in their hands.”"
  ],
  "headers": {
    "5": "Buy now, pay later"
  },
  "links": {
    "Square": "https://www.techradar.com/reviews/square-pos-system-review",
    "Square’s CashApp": "https://www.techradar.com/news/square-cash-app-set-to-test-short-term-loans",
    "Bitcoin business": "https://www.techradar.com/news/best-bitcoin-wallets",
    "streaming service": "https://www.techradar.com/best/best-tv-streaming-service-cord-cutting-compare",
    "Klarna": "https://www.techradar.com/news/klarna-launching-into-consumer-bank-accounts",
    "Apple Pay Later": "https://www.techradar.com/news/apple-could-be-launching-its-own-buy-now-pay-later-service",
    "network of merchants": "https://www.techradar.com/best/best-credit-card-processing-service"
  }
}