{
  "source": "https://www.techradar.com/news/microsoft-should-kill-off-windows-10-and-start-again",
  "title": "Microsoft should kill off Windows 10 and start again",
  "category": "computing",
  "updated": "2021-04-24T11:30:11Z",
  "author": "matt-hanson",
  "summary": "Opinion: Reboot Windows",
  "article": [
    "Hi, my name’s Matt Hanson and I like giving Microsoft unwanted advice about how it should run its business. That’s right, a guy who wears 15-year-old t-shirts because he has no money, thinks he knows better than a trillion-dollar company when it comes to their business. Well, I’m back, and I have another corker: kill off Windows 10.",
    "That’s right. Microsoft should bin it, and start again – with a completely rebooted operating system. Microsoft could simply call it ‘Windows’. However, knowing Microsoft and its funky naming conventions, it’d probably go with ‘Windows One’ or ‘Windows Series X Pro’ or something.",
    "OK, so let me explain. I’ve been using Windows since 3.1, and been through the highs and lows. The thrill of adding themes in Windows 98, spending ages waiting for Windows ME to boot up, working on Windows Vista: The Official Magazine, the lot.",
    "And, I have to say, Windows 10 is definitely one of the better releases. While some of its updates have been a bit, well, difficult, on the whole, it’s a solid operating system that does the job well. It now boots in a flash, and features like the Reset this PC, which allows you to factory reset Windows 10 to fix issues, rather than having to do a full re-install, are genuinely great.",
    "However, it’s also a bit of a mess. Undoubtedly, one of the best things about Windows 10 is that it is reasonably easy to run older apps and games on it. It’s also kept many tools and programs that have been a mainstay since Windows 95 – if not older.",
    "For example, the Control Panel in Windows 10 isn’t too far removed from the Control Panel in Windows 95. This is great for anyone who has been using Windows for 30-odd years – but there’s a big problem.",
    "For a start, not everyone has been using Windows for 30 years, so there isn’t that affection for the Control Panel, or any of the older apps or tools. What some of us would think of as iconic and irreplaceable, others will find archaic and unintuitive.",
    "Another issue is that Microsoft has been trying to modernise Windows and ween us off those older apps and features. Its boldest attempt at this was with Windows 8… and it didn’t go down well.",
    "If you can’t remember Windows 8 (oh, how I envy you), Microsoft tried to make an operating system that would work on both traditional laptops and PCs, as well as touch-screen tablets. The result was an ugly hotch-potch of an operating system that pleased neither PC or tablet users. PC users hated the large, over simplified Start screen that replaced the Start menu and looked awful on monitors, while tablet owners were baffled by the finicky legacy apps and menus that Microsoft kept in, and which were obviously designed for use with keyboard and mice.",
    "There’s a reason why Microsoft skipped Windows 9 altogether – it couldn’t get away from Windows 8 fast enough.",
    "But, in my mind, Windows 8’s biggest failing was Microsoft’s indecisiveness. If it has just gone fully in on the ‘Metro’ style of big buttons and simplified menus, while many of us (including me) would have moaned loudly, it would have at least been consistent.",
    "Instead, we got a disappointing compromise.",
    "While Windows 10 has done a lot to right the wrongs of Windows 8, including an interface that is much more like the Windows of old, it’s also kept a lot of Windows 8’s design choices as well. And that can lead to a messy operating system.",
    "It’s led to many menus and settings being duplicated. For example, there’s the Settings app, that gives you access to various… settings. It does the job the Control Panel used to do.",
    "The problem is, Windows 10 still also has the Control Panel – and you don’t need both. And while some of the same settings can be accessed in both, others cannot, and it can mean finding a setting confusing and annoying.",
    "It’s also made what was once quite simple tasks now overly complex. For example, if you wanted to change the configurations of your speakers, you used to be able to right-click the speaker icon in the taskbar, then click on ‘Select Playback devices’ to open the Sound window. From there you could configure and set the properties of your playback and recording devices, including testing out individual speakers.",
    "In Windows 10, however, while that Sounds window still exists, there’s also the Sound window, which does a similar (but not exactly the same) task. You can choose the playback and recording devices, but options are limited. If you want to terst a device, you need to click ‘Manage sound devices’ then choose the device you want to test, and click ‘Test’. You can also get to the old Sounds window from here, but it’s called ‘Sound Control Panel’, which may confuse people who are already in the ‘Sound’ window.",
    "It’s an example of Windows 10’s interface being muddled and filled with redundancies and repeated options. It shows how Windows 10 can be both too simple and overly complicated at the same time.",
    "Much of this is because Microsoft is hesitant to drop older tools and menus, while adding new ones. I can see why – the outcry would be huge from many users. You could also argue that this way gives people choice – if you like the old way of doing things, you can still do that, and if you like the new way of doing things, you’re covered as well. Problems arise, however, when those two methods conflict.",
    "Good user interface design should be as simple and straightforward as possible, and Windows 10’s inability to let go of the past is holding it back.",
    "So, why not just start again. Scrap everything, and build a new Windows with ONE interface and one way of doing things. They’ll be resistance, but in the long run, it’ll mean there’s no longer the feeling that Windows is made up of two (or more) different operating systems.",
    "It also means Microsoft could start from scratch with the code as well. Over the years, Windows 10’s code has become a bit messy as well, as apps and tools from older versions are repurposed, and new tools added on.",
    "When code gets too messy, it can lead to a degradation in performance and all kinds of errors. A blue screen of death can occur if there’s an outdated driver for some ancient hardware, for example.",
    "Giving Windows a fresh start could let Microsoft seriously slim down the operating system’s code to make it faster, more reliable and less resource intensive.",
    "That last bit would be key to making the new Windows run on older or underpowered devices. Microsoft still hasn’t got an answer to Chrome OS, which powers the best Chromebooks and is a real threat to Windows’ dominance in the education sector. Windows 10 S mode, is definitely not the answer – it’s just another compromise.",
    "Ditching everything and starting again isn’t easy. It takes a lot of time, and a lot of courage. But if the future of Windows is just more updates to Windows 10 and more sticking plasters, then it’s not a very bright future.",
    "So, Microsoft. Be brave. Ditch Windows 10 and give us a bold new Windows for the future. It’ll be worth it."
  ],
  "headers": {
    "2": "Wait… what?",
    "12": "A tarnished legacy",
    "20": "Fresh start"
  },
  "links": {
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Windows 8": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-8-1093002/review"
  }
}