{
  "source": "https://www.techradar.com/news/google-is-making-it-easier-to-search-when-shopping-from-home",
  "title": "Google is making it easier to search when shopping from home",
  "category": "computing",
  "updated": "2021-09-30T19:00:28Z",
  "author": "anthony-spadafora",
  "summary": "Google Search is quickly becoming a shopper's delight",
  "article": [
    "Over the past year and a half, consumers have started shopping online more than ever before and many of their searches begin on Google which is why the search giant has announced that it's adding new ways to find shopping inspiration across its products.",
    "Since inspiration can strike at any time from an image you see online to a photo saved on your smartphone or even from something in the real world that catches your eye, the company is adding new features to Google Lens that make products users see instantly shoppable.",
    "Beginning soon, iOS users will see a new button in the Google app that makes all of the images on a page searchable through Google Lens. This will make finding a product you see online in a picture, just a tap away.",
    "Google is also making it easier to shop for products from photos on your computer by bringing Lens to Chrome on your desktop. Users will soon be able to select images, video and text content on a website with Lens to quickly see search results in the same tab without having to leave the page they're currently on.",
    "Beginning today, Google is making it easier to browse for clothing, shoes and accessories on mobile right from its search results.",
    "Now when a user searches for “jean jackets”, the company's search engine will show a visual feed of jackets in various colors and styles alongside other helpful information such as local shops, style guides and videos. Users will also be able to filter their search by style, department, brand and more and when they find something they like, they can check out ratings, reviews and even compare prices to get the best deal. This new experience is powered by Google's Shopping Graph which is a comprehensive, real-time dataset of products, inventory and merchants with more than 24bn listings.",
    "As shoppers are increasingly beginning their in-person shopping experiences online, Google is also adding a new feature that allows them to find local stores that carry the products they want right from Google Search. Beginning today, when users look for products online even from a specific brand, they can select the “in stock” filter to see only the nearby stores that have them on their shelves. This feature will likely benefit small businesses as it can help them attract new local customers.",
    "Google's new shopping features will make it even easier for users to find what they're looking for both online and in-person ahead of Black Friday and Cyber Monday."
  ],
  "headers": {
    "4": "Window shopping and in-store inventory"
  },
  "links": {
    "shopping online": "https://www.techradar.com/best/best-shopping-cart-software",
    "Google": "https://www.techradar.com/news/google-is-making-it-easier-for-retailers-to-promote-their-holiday-deals",
    "Google Lens": "https://www.techradar.com/news/google-lens-how-to-master-googles-super-useful-ai-camera-app",
    "Google app": "https://www.techradar.com/news/googles-ios-apps-havent-been-updated-in-over-a-month",
    "Chrome": "https://www.techradar.com/reviews/google-chrome",
    "Shopping Graph": "https://blog.google/products/shopping/more-ways-to-shop/",
    "Google Search": "https://www.techradar.com/news/google-reveals-more-on-how-it-helps-deliver-speedy-search-results",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}