{
  "source": "https://www.techradar.com/news/pixel-6-could-get-a-new-better-version-of-google-translate",
  "title": "Pixel 6 could get a new, better version of Google Translate",
  "category": "phones",
  "updated": "2021-08-02T09:16:15Z",
  "author": "james-rogerson",
  "summary": "Hopefully other phones will get it too",
  "article": [
    "Most Google Pixel 6 leaks so far have focused on the hardware, but the latest leak is software-focused, and suggests that the upcoming phone could bring a redesign to Google Translate.",
    "XDA Developers has spotted a whole new interface hidden within the latest Google Translate update (version 6.21). The interface, which you can see below, moves most of the buttons down to the bottom of the screen from their current position near the top.",
    "This change should make the app a lot easier to use with one hand, especially on larger phones. It’s a change that was perhaps prompted by the rumored 6.71-inch screen size of the Google Pixel 6 Pro. Beyond that, there are a few other tweaks, such as a ‘More’ option appearing in place of the typical hamburger menu icon – and this too is down at the bottom.",
    "It’s worth noting that there’s no guarantee this new interface will ever launch. It was found in an APK teardown, meaning you aren’t meant to be able to access it yet, and XDA Developers notes that it’s currently unfinished, and may get abandoned in a future build. But it’s something that Google is at least toying with.",
    "If this new look does launch, it will probably do so on the Google Pixel 6 range, as there’s mention of ‘p21’ within the code, which XDA Developers reckons refers to the 2021 Pixel phones.",
    "So there’s a good chance we’ll see this on the Pixel 6 and Pixel 6 Pro when they land, likely in October. However, this might also mean the feature is exclusive to the Pixel 6 range.",
    "Given that the focus of this Google Translate redesign seems to be making it easier to use with one hand, we really don’t think Google should make it exclusive to the Pixel 6 range.",
    "There are all sorts of large phones that would benefit (not to mention people with small hands), and if Google is going to offer its Android operating system to other manufacturers it shouldn’t hold back features that improve the core experience and accessibility for users.",
    "Since this is specifically a Google app, this isn’t even something that manufacturers can mimic in their own UIs without offering a whole new translate app, so it’s not the same as offering, say, a camera feature that another company could develop on its own.",
    "Of course, there’s no guarantee this redesign will be exclusive to Pixels, if it even launches. But given the apparent reference to the Pixel 6 range and the fact that Google has kept some features for Pixels in the past it seems very possible.",
    "On the other hand there’s also mention of Material You in the code. This is the visual overhaul of Android that’s coming with Android 12, so perhaps that means all Android 12 devices will be eligible. We certainly hope so."
  ],
  "headers": {
    "6": "Opinion: Google shouldn’t hold back ease-of-use features"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "XDA Developers": "https://www.xda-developers.com/google-translate-tests-pixel-6-exclusive-material-you-redesign/",
    "rumored 6.71-inch screen size": "https://www.techradar.com/news/huge-google-pixel-6-leak-says-it-may-get-iphone-like-software-support",
    "Android 12": "https://www.techradar.com/news/android-12-news"
  }
}