{
  "source": "https://www.techradar.com/news/this-rtx-3080-powered-sneaker-pc-from-nzxt-is-giving-us-a-real-kick",
  "title": "This RTX 3080 powered Sneaker PC from NZXT is giving us a real kick",
  "category": "computing",
  "updated": "2021-01-21T11:14:30Z",
  "author": "jess-weatherbed",
  "summary": "Threads and Threadrippers",
  "article": [
    "Nvidia GeForce RTX 3080 graphics cards are harder to find than gold dust right now, but a collaboration between computing hardware maker NZXT and virtual sneaker designers Artefact Studios has resulted in a concept gaming PC that's worthy of displaying such a rare piece of tech. Upon inspection, this isn't a wearable piece of gaming hardware, so unfortunately you can't have your toes warmed by overclocking the inbuilt RTX 3080. In fact, a full spec list hasn't been released for the build so it's anyone's guess as to if this will be made available to the public or not.",
    "The product appears to feature two NZXT Kraken Z63 AIO liquid coolers, displaying popular characters from anime such as Yu-Gi-Oh! and Dragon Ball Z: Resurrection 'F', though given the size of the build it's likely that the exterior LCD screen is purely for display. Glimpsing inside of the sneaker case, you can see what appears to be a fully functioning small form factor PC, and the video goes on the show that this bizarre custom build can connect to a display. There are many other questions left unanswered here: what kind of connections does it have, and how many ports are available? Is this intended for actual, practical gaming? What are the rest of the hardware specifications? Regardless of how ridiculous the build or collectible, it certainly got our attention. Weird and wonderful custom PC builds are hardly a new concept so it isn't a stretch to believe that this is a genuine functioning rig (make sure you check out the crazy PC builds seen at Computex for more of that), though we can't feel comfortable putting any kind of shoes on the table, even if it is a fashionable gaming computer in disguise.",
    "Via PC Gamer"
  ],
  "headers": {},
  "links": {
    "Nvidia GeForce RTX 3080": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "NZXT": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1019039540587541000&xs=1&url=https%3A%2F%2Fwww.nzxt.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthis-rtx-3080-powered-sneaker-pc-from-nzxt-is-giving-us-a-real-kick",
    "Artefact Studios": "https://twitter.com/RTFKTstudios",
    "NZXT Kraken Z63": "https://www.techradar.com/news/best-cpu-coolers",
    "crazy PC builds seen at Computex": "https://www.techradar.com/news/the-weird-and-wonderful-pcs-of-computex-2019",
    "PC Gamer": "https://www.pcgamer.com/these-shoes-are-an-rtx-3080-powered-pc/"
  }
}