{
  "source": "https://www.techradar.com/news/wandavision-episode-5-recap-review",
  "title": "WandaVision episode 5 recap: that jaw-dropping ending explained",
  "category": "entertainment",
  "updated": "2021-02-05T17:12:10Z",
  "author": "richard-edwards",
  "summary": "Huge spoilers ahead",
  "article": [
    "Spoilers for the latest episode of WandaVision follow. Watch it first before reading this.",
    "We begin with an ’80s-style piano sting, the sort of massive suburban house that everyone in ’80s sitcoms seemed to own…",
    "Wanda tries to get baby Tommy to sleep, telling him he’ll be her favorite twin if he does. Vision comes down the stairs with Billy, who’s also restless. Wanda sends Vision to grab the boys’ binkies (pacifiers), and decides to try a “short cut” – using her magic to put them to sleep. It doesn’t work – instead the babies just laugh.",
    "Vision returns with the pacifiers in his ears, quickly realizing that “noise cancellation is not their primary function”. Wanda puts the pacifiers in the boys’ mouths, but they spit them out. Wanda wonders where they’re going wrong, but Vision says they’ll figure it out.",
    "The doorbell rings. Vision turns into human form as Agnes walks through the door. She was on her way to Jazzercise when she heard the babies were on a sleep strike. She offers a couple of tricks to help, as Vision does the whole worried dad thing.",
    "Agnes pauses. “Do you want me to take that again?” she asks Wanda. “Should we just take it from the top?” It’s as if she’s an actor asking their director if they want another take. Wanda looks confused – but nowhere near as confused as Vision. “Oh, don’t be silly,” Wanda jokes, and tells Vision to let Agnes give it a try. The women laugh but Vision looks uneasy. He calls Wanda over to ask, “What was that about?” She dodges the subject and they’re soon distracted by Agnes spraying lavender over the children. “Wanda, did you really not see what I saw?”",
    "Agnes goes to the kitchen to get some dark liquor – “not for me, for the twins. What kind of babysitter do you think I am?” – and Wanda tells Vision to accept her help. They realize that the twins have gone quiet, but when they look at their cots, they’re empty. “Mommy? Daddy?” come two voices from the stairs. They’re now five years old.",
    "“Kids, you can’t control ’em, no matter hard you try,” says Agnes.",
    "The ’80s-themed opening credits show an idyllic family life in Westview: “You wander the world with a vision, of what life could be…”",
    "Back in the real world, SWORD director Hayward asks Captain Monica Rambeau about the first thing she remembers. “Pain,” she replies. “And then, Wanda’s voice in my head.” Did she try to resist? She says there was a feeling keeping her down, a hopeless feeling like drowning – “it was grief”.",
    "Monica asks the doctor if she’s cleared to leave sick bay – the doc says she is when she’s looked at her scans. She also says her uniform is in analysis. Jimmy Woo introduces Dr Darcy Lewis to Monica – Darcy says she’s a big fan. The doctor says they’re going to need to take the scans again because the images are blank. Monica laughs and says they’re done, getting up to leave.",
    "Hayward leads the briefing. He explains that Wanda was originally assumed to be one of the many victims but they now know she’s the “principal victimizer”. Woo gives a quick bio, explaining Wanda’s childhood and powers, as Hayward tries to emphasize her connections to HYDRA, the times she was an enemy of the Avengers, and incidents in Lagos and Germany.",
    "Monica says Wanda isn’t a terrorist. Hayward counters that Rambeau described the experience of being under her mind control as “excruciating, terrifying, a violation”. Monica says the point she was trying to make is that she doesn’t think Wanda has any political agenda, or an inclination towards destruction – she says she survived being blasted out of Westview because Wanda chose to protect her. She doesn’t believe it’s a pre-meditated act of aggression.",
    "Hayward shares top secret surveillance video footage from nine days earlier, showing Wanda storming a maximum security SWORD facility to recover Vision’s body. Woo says that’s in violation of Section 36B of the Sokovia Accords – and also against Vision’s living will, adds Hayward.",
    "Woo asks how she managed to bring Vision back without the Mind Stone. Darcy doesn’t know, but points out she has the world’s only vibranium Synthezoid playing ‘father knows best’ in suburbia. “What happens when he learns the truth?”",
    "Back in the sitcom, Tommy and Billy are washing a dog in the kitchen sink, hoping that if he’s clean, their mom will let them keep him. They try to hide the dog, but she moves them out of the way. “Can we keep him, mommy?” they ask, as the dog gives maximum cute. She notes that the dog has no collar, but reminds the boys that dogs need a lot of looking after.",
    "Vision comes downstairs. He’s in human form, because he had the feeling someone might pop over… “with exactly the item we require”.",
    "At that moment, Agnes walks in carrying a kennel. “My kitchen window told me someone got a new pooch,” she says. The dog makes an electrical socket spark, so they decide to call him Sparky. Wanda magics up a collar to make it official. Vision questions her using her powers in front of Agnes, but she says Agnes didn’t even notice when the babies turned from babies to five-year-olds. Vision reminds her they agreed to keep their powers hidden. She says that maybe he shouldn’t hide his powers either.",
    "The boys ask again if they can keep the dog. Wanda says they don’t think they’re old enough to take responsibility for an animal until they’re at least 10. The boys look at each other and instantly morph into 10-year-olds.",
    "In the SWORD base, Rambeau says she needs a fallout shelter on wheels. With that, she believes she’d be able to safely re-enter Westview. “Yes, theoretically,” agrees Darcy. Monica says she knows an aerospace engineer who’d be up for the challenge and sends a message on her phone. Darcy points out that she can’t guarantee the Hex – her name for the anomaly, thanks to its hexagonal shape – won’t just wipe her mind when she goes in.",
    "Jimmy asks if they’ve identified the kids yet, but Monica explains that everything in there is real – “everything might look fake in the TV but everything in there is real.” Darcy says that if all the sets and wardrobes are solid matter, Wanda is wielding an insane amount of power – beyond anything she’s displayed before. But, as Monica points out, she did come close to taking out Thanos on her own. “Nobody else came close.”",
    "“I’d argue that Captain Marvel came close,” says Jimmy, but Monica says, “We are not talking about her. We are talking about Wanda.”",
    "Monica makes a breakthrough and heads to the lab. She fires bullets at the clothes she was wearing in Westview. They’re completely unaffected. “You had a bulletproof vest on when you entered Westview, didn’t you?” asks Jimmy. Monica says the pants were 87% Kevlar – “it’s not an illusion, Wanda is rewriting reality.” What happens if they send something in that requires no change?",
    "Back in the sitcom, Vision turns on his new computer at Computational Services, Inc. He asks Norm if he wants to surf the internet. “Cowabunga, dude,” he replies. They’ve received an email, a top secret communique from SWORD. All of the office staff start reciting the message about Dr Darcy Lewis’s findings on the ‘Maximoff Anomaly’ – there are high levels of radiation at the perimeter, and its effect on Westview residents is unknown. They all burst out laughing.",
    "Vision touches Norm’s head and his personality instantly changes. He asks for help, wondering how long he’s been trapped, and looking for his phone so he can call his sister about their sick father. “You have to stop her,” he tells Vision, saying she’s in his head and it hurts. Vision touches Norm’s head again and he’s back to normal.",
    "Billy and Tommy play with Sparky. They want to show Vision the dog’s new tricks, but Wanda says he’s at work. When they point out it’s Saturday, she says it’s actually Monday. When they assure her it’s Saturday, she changes the story to say there’s an emergency at work and he had to go in. Then she says he needed a distraction – the kids wonder if he needs a distraction from them. She explains that sometimes she and Vision aren’t quite on the same page – the same way that brothers argue. They ask if she has a brother – she says she does but he’s very far away.",
    "Sparky notices a disturbance outside. Monica is piloting a vintage ’80s drone that has successfully made it inside Westview – it’s invisible on the sitcom feed because Wanda decides what makes it into the show and what doesn’t. The drone moves in on Wanda and Vision’s house. Monica speaks on the radio, telling Wanda she wants to talk. Wanda’s eyes start glowing red, so Hayward instantly orders them to take the shot. Monica doesn’t believe the drone to be armed, so asks what he’s up to. The video feed from the drone goes blank, as an alarm signals a breach in the energy field.",
    "Everyone rushes outside to see a hole form in the energy field. Wanda – wearing her usual Avengers attire – walks out, carrying the wrecked drone. “Is this yours?” she asks, flinging it back. Hayward says the missile was just a precaution, but Wanda tells him this is their only warning to stay out of her home – if they don’t bother her, she won’t bother them. Hayward reminds her that she’s taken a town hostage. Wanda says she’s not the one with the guns, but Monica says Wanda is the one in control.",
    "Monica says she didn’t know the drones were armed, but reminds Wanda that she, a telepath, must have known she was inviting a SWORD agent into her home – and that she trusted her to deliver her babies. On some level, Rambeau says, Wanda must know she’s an ally – and that she wants to help. “How?” asks Wanda. “What could you possibly have to offer me? I have what I want and no one will ever take it from me again.”",
    "Wanda turns all of the soldiers’ guns on Hayward and walks away, back into the sitcom world. A red power surge flows through the energy field.",
    "COMMERCIAL BREAK!",
    "A kid spills bright red drink on the table. “You’ve got a mess. And you’re still using the next leading brand? You need Lagos brand paper towels, the most absorbent paper towel available. Husbands can use it too, you know. Lagos: for when you make a mess you didn’t need to.”",
    "Back in the sitcom, Wanda and the boys are looking for Sparky. A postman says they’ll find him, making a pointed reference to the fact their mom won’t let him get far. Agnes emerges from a bush holding Sparky wrapped in a blanket. He’s been eating poisonous azalea leaves. The boys look at each other the way they did when they turned themselves into 10-year-olds. Wanda stops them ageing themselves up, acknowledging that the urge to run from grief is powerful, but that they have to face it.",
    "They say she can fix anything, so she should fix the dead. “You can do that?” asks Agnes. Wanda says there are rules in life – we can’t rush ageing because it’s convenient, and we can’t reverse death, no matter how much it hurts us.",
    "In the kitchen that evening, Vision asks how the boys are. Wanda says they’re heartbroken. “It’s not often you get a dog and bury them the same day,” says Vision. “Well life moves pretty fast out in the suburbs,” she says.",
    "Vision tells her he unearthed Norm’s personality and spoke to him free of her oversight. He tells her Norm was in pain. She tries to dodge the subject but Vision doesn’t just want to watch TV or turn in for the night so Wanda can change everything over again. He says she can’t control him the way she does them. “Can’t I?” she asks.",
    "The end credits roll but Vision refuses to leave it. He asks her what the Maximoff Anomaly is, and says he has to believe that the sitcom world was unconscious at first and she only recently became aware of it. Switching back to his Synthezoid form, he reminds Wanda that Norm has a family who he can’t reach – because she won’t let him.",
    "She says she doesn’t know what he’s talking about. “Stop lying to me,” he yells, launching into the air. Wanda does the same, her hands glowing red, telling him, “This, all of this is for us. So let me handle it.”",
    "He asks what’s outside Westview, but she tells him he doesn’t want to know. “You don’t get to make that choice for me, Wanda!” he shouts. She says he’s never talked to her like this before. He says he doesn’t know who he is and he’s scared. She tells him he’s her husband, and Tommy and Billy’s father. He asks why there are no other children in Westview…",
    "Wanda wonders if Vision really believes she’s in charge of everything in Westview, saying she doesn’t know how any of this started. He tells her that what she’s doing here is wrong.",
    "The doorbell rings – she says she didn’t make it happen. She doesn’t think he believes her – he wants to “but at this point I’m ignoring statistics entirely”.",
    "She answers the door.",
    "Darcy tunes into the transmission.",
    "Wanda’s brother, Pietro, is revealed, to loud audience cheers. “Long lost bro get to squeeze his stinkin’ sister to death or what?” he says.",
    "“She recast Pietro?” asks Darcy, acknowledging the fact it’s the X-Men version of the character, rather than the Avengers Pietro.",
    "They hug. “Who’s the popsicle?” Pietro asks as the audience applauds.",
    "PLEASE STAND BY.",
    "Verdict:",
    "Up to now, WandaVision has mostly kept its sitcom and ‘real’ worlds separate. That all changes in this middle episode of the season – also WandaVision’s longest outing to date – as the show’s two storylines interweave like never before. There's so much other stuff going on that the typically brilliant, fun ’80s sitcom pastiche almost feels like an afterthought – it's starting to look more and more like a traditional Marvel assignment.",
    "After the previous episode’s big revelation that “it’s all Wanda”, the extent of her influence on sitcom world becomes more and more pronounced, to the point Vision can no longer pretend there isn’t something very, very odd going on.",
    "We’d already seen several jump cuts and instances of Wanda rewinding the show, but Agnes’s offer to take a scene “from the top” suggests that the imprisoned residents of Westview have rather more awareness than we suspected. Some of the hints are subtle – a postman saying Wanda won’t let a missing dog get far, for example – but when Vision temporarily frees Norm from Wanda’s influence, we see how much pain and distress their televisual prison is causing.",
    "It’s a real game-changer – is Wanda truly the antagonist, or is there something (or someone) else involved? While we all sympathize with her grief over Vision’s death, can that justify her actions? There’s also a question over how much control she wields over Westview. Does anyone have free will?",
    "SWORD director Hayward clearly sees Wanda as the villain, and turns into the sort of stereotypical, ‘attack first, ask questions later’ military boss we’ve seen in countless other movies and TV shows. But is there more to him than initially seems? Could there be an ulterior motive to his desire to take Wanda down? In the MCU, few characters are entirely as they seem.",
    "With Vision starting to piece the mystery together – it can only be a matter of time before he encounters his ‘dead’ self – it’s anyone’s guess where WandaVision goes next. Especially now that Wanda’s late twin brother, Pietro (aka Quicksilver), has turned up on the doorstep. The biggest talking point, perhaps, is that he’s played by the X-Men franchise’s Evan Peters, rather than Age of Ultron’s Aaron Taylor-Johnson.",
    "This has long been rumored – and the big question is whether this Fox version of the character is here to stay, bleeding between the two realities, or if this is just a reference designed to make fans lose their minds. Clearly, Peters' version of the character was very well-liked by fans – and we know that Deadpool 3 will be an MCU film, suggesting that Marvel Studios will retain some of the X-Men movies' best elements, rather than rendering all of them non-canonical.",
    "Is this just the start for Peters in the MCU? We’ll hopefully be getting an on-screen explanation for the ‘recasting’ imminently…",
    "New episodes of WandaVision are available every Friday on Disney Plus."
  ],
  "headers": {
    "56": "Marvel-ous facts"
  },
  "links": {
    "Captain Monica Rambeau": "https://www.techradar.com/news/wandavision-who-is-monica-rambeau",
    "Deadpool 3 will be an MCU film": "https://www.techradar.com/news/deadpool-3-will-be-part-of-the-marvel-cinematic-universe-and-r-rated"
  }
}