{
  "source": "https://www.techradar.com/news/apple-watch-is-getting-new-spotify-features-including-offline-music",
  "title": "The Apple Watch is finally getting offline Spotify playback",
  "category": "audio-visual",
  "updated": "2021-05-24T08:48:16Z",
  "author": "hamish-hector",
  "summary": "Your favorite tracks on your Apple Watch no longer need a phone",
  "article": [
    "If you're an Apple Watch user, one of the most frustrating omissions is finally remedied: Spotify users can now save offline music to their wrist.",
    "You'll need to be a Spotify Premium user to download the music to your smartwatch, but now Spotift subscribers wanting to be truly set free from taking their phone with them on a hike or run will be able to do so. While Deezer has just added the same functionality to the Watch, up to this point you've only been able to play Apple Music tracks offline.",
    "In terms of playing Spotify tracks, you could go out without your iPhone but would need an Apple Watch 3 or above with a data connection enabled to stream music on the go - that's a pretty pricey add-on for an already-expensive device, so this move is welcome.",
    "This new feature is already rolling out to Apple Watches running the latest version of Spotify. If you’re a Premium user that’s been holding out on updating the app for some reason, we'd firmly recommend you do so right now to make use of these extra features.",
    "Free Spotify users aren’t missing out on all the new features though, as everyone will be able to use Siri commands to control the app on their Apple Watch.",
    "All you have to do is say “Hey Siri” followed by a command to play a song, album, playlist or podcast. You can also ask Siri to pause, play and skip to a different track – just make sure to add “on Spotify” to the end of your commands.",
    "The download feature is rolling out now for all Premium Spotify users, and it’s a really easy to use once you know how. So here’s what you need to do:",
    "It’s that simple. All you have to do after that is connect some headphones to your Apple Watch via Bluetooth and you can enjoy listening to your favorite music and podcasts from anywhere, whether you have your phone with you or not."
  ],
  "headers": {
    "6": "How to download music to your Apple Watch"
  },
  "links": {
    "Apple Watch": "https://www.techradar.com/news/best-apple-watch",
    "Spotify": "https://www.techradar.com/reviews/spotify",
    "Apple Watch 3": "https://www.techradar.com/reviews/apple-watch-3-review",
    "This new feature is already rolling out to Apple Watches": "https://newsroom.spotify.com/2021-05-21/enjoy-more-ways-than-ever-to-use-spotify-on-your-apple-watch-now-with-downloads/"
  }
}