{
  "source": "https://www.techradar.com/news/cant-buy-a-new-gpu-blame-cryptominers-who-bought-25-of-them",
  "title": "Can’t buy a new GPU? Blame cryptominers, who bought 25% of them",
  "category": "computing",
  "updated": "2021-06-16T10:23:00Z",
  "author": "matt-hanson",
  "summary": "700,000 GPUs bought by miners in the first quarter of the year",
  "article": [
    "Trying to buy a new graphics card in 2021 has proved to be an extremely frustrating experience, and a new report suggests the main reason for this is that cryptocurrency miners are buying up huge swathes of GPUs.",
    "According to a new report by Jon Peddie Research, 25% of GPUs sold in the first quarter of 2021 were bought up by cryptocurrency miners and scalpers.",
    "That’s a huge percentage of in-demand products that were already experiencing supply constraints due to the global chip shortage and Covid-19 pandemic. This explains why it’s been so hard to buy a GPU, even with Nvidia releasing a steady stream of new products throughout the year, such as the recent RTX 3080 Ti and RTX 3070 Ti cards.",
    "The way Jon Peddie Research has come up with this number is that it has tracked AIB (add-in board) sales since 1985, and noticed an attach rate drop of 25% earlier this year. This assumed that 25% of people who bought GPUs used them for mining.",
    "“We calculate the mining use of AIBs as the difference between the trending normal attach rate and the current rate,” the report states. “The assumption being that miners have dedicated rigs and do not buy a PC to build a mining system.”",
    "This methodology isn’t that precise, but going by what we’ve seen in the GPU market for the past year, along with the boom in cryptocurrency, it does sound about right.",
    "So, what can be done about the GPU shortage? While Nvidia has added a hash rate limiter to its newer GPUs in a bid to reduce their appeal to miners by lowering their mining capabilities without impacting game performance, it hasn’t been that successful, and its new GPUs still sold out extremely quickly.",
    "AMD, meanwhile, has done even less to dissuade miners from buying GPUs. In a way, you can see why. If, as Tom’s Hardware estimates, the sales figures are around 700,000 GPUs bought up by miners in the first quarter of this year, which equates to around $500 million in sales, then AMD and Nvidia may be pretty happy no matter who buys their GPUs.",
    "That’s no use for the rest of us though. With Prime Day deals starting to ramp up, it’s very unlikely we’ll see any price cuts on GPUs, which when they are on sale, often go for well over their usual asking price.",
    "Buying a new PC with a GPU included is one option to get a current GPU. Either that, or hold on until the cryptocurrency bubble bursts, and the global chip shortage ends. None of those are ideal choices, however, if you just want to get your hands on one of the best GPUs."
  ],
  "headers": {
    "6": "What can be done?"
  },
  "links": {
    "Jon Peddie Research": "https://www.jonpeddie.com/blog/crypto-minings-half-a-billion-dollar-impact-on-aib-sales",
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "a hash rate limiter": "https://www.techradar.com/news/the-light-hash-rate-nvidia-rtx-3080-is-real-heres-what-you-need-to-know",
    "Tom’s Hardware estimates": "https://www.tomshardware.com/news/700000-gpus-shipped-to-miners-first-three-months-2021",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "best GPUs": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"
  }
}