{
  "source": "https://www.techradar.com/news/verizon-offers-5g-business-internet-in-21-more-us-cities",
  "title": "Verizon offers 5G Business Internet in 21 more US cities",
  "category": "computing",
  "updated": "2021-04-19T13:30:10Z",
  "author": "steve-mccaskill",
  "summary": "Verizon Business offers fixed wireless access (FWA) broadband over 5G",
  "article": [
    "Verizon Business has expanded its 5G business broadband service to 21 more major cities in the US.",
    "The operator became the first in the world to launch 5G back in 2018, offering Fixed Wireless Access (FWA) services using high range ‘Ultra Wideband’ spectrum that delivers a similar experience to fixed connectivity.",
    "5G-based FWA has particular appeal in the US because many cities are served by a single cable operator, a situation that leaves businesses with few, if any, alternatives should they be dissatisfied.",
    "Verizon is offering 100Mbps, 200Mbps and 400Mbps packages without the need to sign a long-term contract and with price lock guarantees.",
    "Having already launched in Chicago, Houston and Los Angeles, 5G Business Internet is now being made available in Anaheim, Atlanta, Cincinnati, Cleveland, Dallas, Denver, Detroit, Indianapolis, Kansas City (MO), Las Vegas, Miami, Minneapolis, Phoenix, Riverside-Corona, Sacramento, Salt Lake City, San Diego, San Francisco, San Jose, St. Louis, and St. Paul. More cities will be added on a rolling basis.",
    "“As 5G Business Internet scales into new cities, businesses of all sizes can gain access to the superfast speeds, low latency and next-gen applications enabled by 5G Ultra Wideband, with no throttling or data limits,\" said Tami Erwin, CEO of Verizon Business. \"We’ll continue to expand the 5G Business Internet footprint and bring the competitive pricing, capability, and flexibility of our full suite of products and services to more and more businesses all over the country.”",
    "Verizon views 5G is a huge opportunity, claiming its research shows 8/10 organizations believe the technology will transform both their organization and their industry. In addition to providing 5G broadband service for businesses and consumers in the US, Verizon is also working to build private networks around the world. Its first such deployment in Europe is at the Port of Southampton.",
    "Competition between fixed broadband providers in the UK reduces the immediate need for 5G FWA, but wider coverage means it will be of interest in rural areas and to businesses that require flexibility."
  ],
  "headers": {
    "3": "5G business"
  },
  "links": {
    "Verizon": "https://www.techradar.com/deals/the-best-verizon-deals-sales-discounts",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know"
  }
}