{
  "source": "https://www.techradar.com/news/resident-evil-movie-reboot-finally-gets-a-release-date",
  "title": "Resident Evil movie reboot finally gets a release date",
  "category": "gaming",
  "updated": "2021-03-10T16:05:06Z",
  "author": "rhys-wood",
  "summary": "Alice who?",
  "article": [
    "The Resident Evil movie reboot has had fans clamoring for a release date since its announcement last October. We now know this latest movie based on Capcom's horror series will release on September 3 2021, as revealed by a promotional image tweeted out by Chad Rook, one of the movie’s actors.",
    "The image is, refreshingly, aimed squarely at fans of the series, with the names of iconic Resident Evil characters shown in the background. It looks like it’ll be a busy movie, with characters like Jill Valentine, Albert Wesker, Brian Irons, Ada Wong and Leon S. Kennedy all being represented.",
    "The Resident Evil reboot is being directed by Johannes Roberts, best known for horror movies like 47 Meters Down. The reboot also features a pretty impressive cast, with the likes of Tom Hopper (The Umbrella Academy) as Albert Wesker, Hannan-John Kamen (Ant-Man and the Wasp) as Jill Valentine and Kaya Scodelario (Maze Runner) as Claire Redfield.",
    "The Resident Evil movie is set to explore the roots of the video game series, taking place in 1998 during the original game’s Spencer Mansion incident, as well as Resident Evil 2 and Resident Evil 3’s Raccoon City.",
    "Resident Evil as a franchise has a pretty busy year ahead of it. This movie reboot isn’t the only project in the works for a 2021 release, as Capcom itself is hard at work on Resident Evil Village due out on May 7. A Netflix series, Resident Evil: Infinite Darkness, is also releasing later this year.",
    "Hopefully, the Resident Evil movie reboot will be a clean slate of sorts, after the Milla Jovovich-led Resident Evil movie series directed by Paul W.S. Anderson failed to impress many fans, with completely misplaced characters and nonsensical plot threads that went nowhere. That said, the goofy six-movie saga definitely had its own audience.",
    "Here’s hoping the Resident Evil movie reboot can successfully address these complaints and deliver something that Resident Evil fans would be more than happy to watch. Tying the movie more closely to the iconic settings of the original games is definitely a promising start."
  ],
  "headers": {
    "3": "Where it all began"
  },
  "links": {
    "The Umbrella Academy": "https://www.techradar.com/news/the-umbrella-academy-season-3",
    "Resident Evil 2": "https://www.techradar.com/reviews/resident-evil-2-remake-review",
    "Resident Evil 3’s": "https://www.techradar.com/reviews/resident-evil-3",
    "Resident Evil Village": "https://www.techradar.com/reviews/resident-evil-village",
    "Resident Evil: Infinite Darkness": "https://www.techradar.com/news/netflixs-resident-evil-infinite-darkness-tv-series-will-be-part-of-the-games-canon"
  }
}