{
  "source": "https://www.techradar.com/news/street-fighter-could-collide-with-fortnite-in-the-next-crossover-event",
  "title": "Street Fighter could collide with Fortnite in the next crossover event",
  "category": "gaming",
  "updated": "2021-02-19T16:09:39Z",
  "author": "vikki-blake",
  "summary": "Leaked assets show a famed SF2 backdrop, plus Ryu's music theme",
  "article": [
    "Dataminers have discovered clues that hint that Street Fighter could be Fortnite's next big crossover event.",
    "Fresh leaks from the good boat Fortnite suggest the next batch of crossover characters hail from Street Fighter's roster.",
    "Noted dataminer ShiinaBR reportedly found assets from this season's next in-game portal – codenamed Skirmish – that give us a peek at a familiar background from Street Fighter 2, Suzaku Castle.",
    "Better yet, Shiina's clip also shares Skirmish's audio, too, which should be recognizable to some as Ryu's theme.",
    "Eurogamer reports that two \"encrypted characters relating to this portal\" are scheduled to pop up on the Fortnite store over the next few days, too.",
    "It's the latest in a long line of high-profile Fortnite crossover events, which most recently featured God of War's Kratos and Halo's Master Chief.",
    "ICYMI, Fortnite is continuing its efforts to create a new metaverse for entertainment, this time by hosting ‘Short Nite’, its own virtual short film festival.",
    "The festival will take place over 24 hours, starting at 2PM ET / 7PM GMT on February 20 and ending at 2PM ET / 7PM GMT on February 21.",
    "The screenings will take place inside Fortnite’s peaceful Party Royale mode, which has previously hosted multiple music concerts, including ones from Diplo and J Balvin. This won’t be the first time the battle royale game has screened films either, previously showing feature-length hits like Batman Begins and Inception in-game."
  ],
  "headers": {
    "6": "Fortnite's film festival"
  },
  "links": {
    "ShiinaBR": "https://twitter.com/ShiinaBR/status/1362720022397911042",
    "Eurogamer": "https://www.eurogamer.net/articles/2021-02-19-looks-like-street-fighter-is-coming-to-fortnite",
    "Kratos": "https://www.techradar.com/news/kratos-in-fortnite-is-a-step-too-far-heres-why",
    "Master Chief": "https://www.techradar.com/news/master-chiefs-next-game-isnt-halo-infinite-its-fortnite",
    "‘Short Nite’, its own virtual short film festival": "https://www.techradar.com/news/fortnite-will-host-its-own-short-film-festival-short-nite-but-why-is-it-doing-this",
    "Party Royale mode": "https://www.techradar.com/news/fornites-party-royale-mode-ditches-the-guns-for-some-chilled-out-fun"
  }
}