{
  "source": "https://www.techradar.com/news/the-best-prime-day-gaming-deals-weve-seen-so-far",
  "title": "The best Prime Day gaming deals still available right now",
  "category": "gaming",
  "updated": "2021-06-23T08:40:41Z",
  "author": "vic-hood",
  "summary": "Big discounts are still available - but you better act fast",
  "article": [
    "Prime Day may officially be over but we're still seeing some excellent gaming deals lingering in both the UK and US. From mice, keyboards, and headsets all the way through to Nintendo Switch bundles and the latest PS5 games and accessories, there's something for everyone in these Prime Day gaming deals.",
    "We've combed through the web and rounded up the best Prime Day gaming deals that are still available for you below - we've even highlighted some standout offers. But you better act fast, as we're not expecting these deals to last much longer.",
    "Just some of the key discounts on offer are 15% off a Nintendo Switch + Ring Fit Adventure bundle in the UK and $10 off the newly released Returnal in the US. Want to save on your next gaming experience? Read on for the best Prime gaming deals around.",
    "(Not in the US or UK? Scroll down for deals in your region.)",
    "No matter where you live, you'll find all the lowest prices for games, consoles and accessories from around the web right here, with offers available in your region."
  ],
  "headers": {
    "4": "More Prime Day gaming deals",
    "5": "More Amazon Prime Day deals"
  },
  "links": {
    "Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "PS5 games": "https://www.techradar.com/best/best-ps5-games",
    "accessories": "https://www.techradar.com/best/ps5-accessories",
    "Nintendo Switch + Ring Fit Adventure bundle": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2FNintendo-Switch-Neon-blue-Adventure%2Fdp%2FB07YM512SR%3Ftag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-8275588227435346000-21",
    "$10 off the newly released Returnal": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FReturnal-PlayStation-5%2Fdp%2FB08QFPS48J%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1858786942397771500-20"
  }
}