{
  "source": "https://www.techradar.com/news/a-new-line-of-xiaomi-phones-is-about-to-debut",
  "title": "A new line of Xiaomi phones is about to debut",
  "category": "phones",
  "updated": "2021-09-22T08:49:15Z",
  "author": "tom-bedford",
  "summary": "The Xiaomi Civi line",
  "article": [
    "In the west, there are three lines of Xiaomi phones: the Mi, Poco and Redmi devices. In China the brand sells a few more though, and a new one is about to debut called the Civi line. While this is a China-only launch, there may be a reason to pay attention.",
    "A teaser poster shared by Xiaomi on Chinese social media platform Weibo reveals the name of the Civi line, as well the time and date of a launch event on September 27.",
    "The text along with the poster translates to say it's \"a new series of Xiaomi phones [...] to explore the inherent excitement of self\" and other marketing guff. The event will likely be Chinese-only, streamed on the company's Weibo page, so there's probably not much point in tuning in.",
    "However it may be worth checking out coverage of the new Xiaomi Civi phones after the fact, as there's a possibility we'll see them come to other regions.",
    "Xiaomi used to have lots of devices it only sold in China, but it's getting better at releasing some of its lines globally, like the recent Xiaomi Pad 5.",
    "It's possible that the Xiaomi Civi phones will launch in China but also come to other regions later. And there's also a big reason to hope for this.",
    "Some commenters under the Weibo post have speculated that the Xiaomi Civi line will replace the company's CC line, an upper-mid-range family which hasn't seen an entry since late 2019. We've been hearing rumors of a new model but one hasn't surfaced yet.",
    "That's important because the Xiaomi CC9 launched globally as the Mi Note 10, a fantastic mid-range device that spent time in our list of the best smartphones. We've been waiting for a Mi Note 11 for some time, but it's yet to appear.",
    "If the Chinese Civi line does replace its CC line, we could see them come out globally as the Mi Note devices, if Xiaomi continues to operate this way. That's a big 'if', but with Xiaomi getting better at launching its products globally, it's possible."
  ],
  "headers": {
    "4": "Analysis: why you should pay attention"
  },
  "links": {
    "Xiaomi phones": "https://www.techradar.com/news/best-xiaomi-phones",
    "Weibo": "https://weibo.com/2202387347/KzjzUk21v",
    "Xiaomi Pad 5": "https://www.techradar.com/reviews/xiaomi-pad-5-review",
    "Mi Note 10": "https://www.techradar.com/reviews/xiaomi-mi-note-10-review",
    "Mi Note 11": "https://www.techradar.com/news/xiaomi-mi-note-11"
  }
}