{
  "source": "https://www.techradar.com/news/ariana-grande-fortnite-leaks-confirmed-with-in-game-concert-reveal",
  "title": "Ariana Grande Fortnite leaks confirmed with in-game concert reveal",
  "category": "gaming",
  "updated": "2021-08-02T09:49:01Z",
  "author": "hamish-hector",
  "summary": "Will the Rift Tour be better than Travis Scott?",
  "article": [
    "Fortnite’s next big concert event is on its way, and Ariana Grande will headline it. Leakers for the game have been teasing a Fortnite concert from the superstar for some time now, and finally we've got official confirmation that the Rift Tour show will take place from August 6 to August 8.",
    "If leaks are to be believed, then fans of Grande will also be able to dress up as their favorite popstar in-game, thanks to cosmetics headed to the Fortnite Item Shop. An Ariana Grande Fortnite skin would certainly make a lot of sense, after both Marshmello and Travis Scott were given skins following their respective concerts. On top of that, Fortnite Crew subscribers will be able to earn exclusive rewards like an umbrella glider and unique loading screens.",
    "What's more, given that the promotional material for the Rift Tour concert says “featuring Ariana Grande”, some fans believe other artists could make an appearance at the event, too. This could include Fortnite concert veterans like Travis Scott and J Balvin, or could be teasing the arrival of other new faces to the Island. We’ll just have to wait and see.",
    "Much like previous Fortnite concerts, the Rift Tour spectacle will take place at specific times depending on your region.",
    "In the Americas, a concert will happen at 6PM ET (11PM BST / 8AM AEST) on August 6, while those in Asia and Oceania can attend a concert on August 8 at 12AM ET (5AM BST / 2PM on August 7 AEST). Players in Europe and the Middle East can attend a concert on August 8 at 10AM (3PM BST / 12AM AEST) before the Americas get an August 8 6PM ET (11PM BST / 8AM AEST) encore.",
    "All players will be able to attend a global concert at 2PM ET (7PM BST / 4AM AEST) on August 7.",
    "Fortnite has given fans a lot to both love and hate recently. Its growing number of collaborations allows players to run around as an astounding array of pop culture icons, and each season has introduced exciting new gameplay mechanics like Inflate-A-Bulls and Sand Tunneling.",
    "Though the story has become even more of an unfollowable mess, and Chapter 2’s approach to seasons (where almost everything new is taken away after the season is over) has made the game lose a lot of the charming chaos from its Chapter 1 days, these concerts and ‘non-canon’ events are exactly what Fortnite needs.",
    "That’s because these kinds of events play into what the game is becoming; a space to play and party, and not ask any questions about how the world works. If the Ariana Grande concert can live up to the Travis Scott event from last year, it’s sure to be a wild ride where lore doesn’t matter and players can enjoy taking part in a spectacular digital music video.",
    "Even as real-life concerts start up again, we hope to see Fortnite’s digital events continue. They’re easily the best events the game has put on, and are so much more fun than the meaningless story dumps we’ve seen recently. Let’s just hope that Ariana Grande can live up to the hype."
  ],
  "headers": {
    "3": "Ariana Grande Fortnite: dates and times",
    "6": "Analysis: Pump up the music"
  },
  "links": {
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "Fortnite skin": "https://www.techradar.com/news/fortnite-skins-april-2021-all-the-skins-coming-to-fortnite-and-how-to-get-them"
  }
}