{
  "source": "https://www.techradar.com/news/e-bikes-are-amazing-but-they-make-me-love-my-old-bike-even-more",
  "title": "E-bikes are amazing, but they make me love my old daily rider even more",
  "category": "fitness",
  "updated": "2021-05-12T16:02:56Z",
  "author": "cat-ellis",
  "summary": "Opinion: nothing beats my trusty push-bike (yet)",
  "article": [
    "Electric bikes are fantastic – they make cycling accessible to people who were unable to ride before, or struggled to do so comfortably. They're certainly not cheating, and they open up a whole world of possibilities for people who were previously unable to enjoy the freedom two wheels can give you.",
    "I'm fortunate enough to be able to test and review some of the best electric bikes around, and it's always a joy to take one out and discover its character on the road, but it also makes me appreciate my faithful push-bike that much more.",
    "It's not just the simple things like price (naturally my old bike cost a lot less, and is cheap to maintain), but there are certain things most electric bikes just haven't quite nailed yet, and my trusty steed does.",
    "My bike (which I named Iestyn back in 2013) is a maroon Fuji Absolute 1.3 - a dependable, fairly inexpensive hybrid that was pretty well rated at the time. Unable to afford him outright, I bought him on the cycle-to-work scheme and paid for him a few pounds at a time directly through my salary. One of the best investments I’ve ever made.",
    "Back then, electric bikes were a real novelty, and (dare I say it) rather uncool. They’ve come a tremendous way in the intervening years, and have well and truly shed that somewhat dorky image. Some are even indistinguishable from a regular bicycle; there’s no way you’d realise the lovely Ribble Hybrid AL e has a motor without fairly close inspection.",
    "It's not Iestyn's looks that make him special. In fact, quite the opposite. Many modern electric bikes are so stylish, they attract a lot of attention. The gorgeous Cowboy 3 got a lot of looks when I took it for a test a few months back, partly because of its almost complete absence of branding, and partly because of its smart carbon belt. It proved a real talking point, but I’d never have left it unattended for a moment.",
    "By contrast, Iestyn’s nothing special to look at, and I feel comfortable leaving him outside the office for eight hours. When he’s decked out with Kryptonite locks, stealing him would be more trouble than it’s worth.",
    "The situation with electric bikes changing, though. An increasing number of high-end models now have their own anti-theft systems, so you don’t have to worry about someone running off with your stunning new steed.",
    "The aforementioned Cowboy 3, for example, is only activated when the 'digital key' on your phone is within range, and its location can be tracked using its built-in GPS transmitter. If you have Cowboy's Easy Rider insurance, you can also receive notifications if your bike is moved while you're outside Bluetooth range. The similarly sleek VanMoof S3 is equipped with a rear-wheel immobilizer, plus anti-theft tracking.",
    "One thing does make Iestyn an easier target, though: his weight. At around 10.4kg, he's lighter than any e-bike, and a would-be thief would be able to heft him over a fence without too much effort.",
    "That low weight does make my life easier, though. Unlike many electric bikes, he's easily hoisted onto a wall mount or carried up a flight of stairs. It also means that if I fall off him (as I have done, many times) he’s not going to do me any damage. I recently checked out an elephantine e-bike that tipped the scales at around 30kg, and I certainly don’t fancy that landing on me.",
    "Iestyn is also nicely balanced. The positioning of the battery in some e-bikes means they’re very difficult to lift on their tails for vertical storage, or carry on your shoulder without removing the power pack first.",
    "Of course, that's not an issue with a folding e-bike like the MiRider One or Gocycle GX, both of which are a pleasure to ride and can be packed down in less than a minute with a little practice.",
    "Iestyn has the advantage of being cheap and easy to maintain. Most problems can be remedied on the road with a spare innertube and a set of Allen keys, and anything more troublesome can be handled by a local bike shop. A couple of weeks ago I treated him to a full service (a nice spa day) and he rides like a dream.",
    "Electric bikes need a little more care, as Shimano's head of training Julian Thrasher explained to me earlier this year. Many of the same rules apply (check the tire pressure and brakes before heading out, test the gears and make sure everthing looks and sounds as it should), but you also need to take care of the delicate data cables and be aware of electrical faults.",
    "E-bikes can also conceal some common problems like brake pads rubbing on the wheel rims. That's something you'd soon feel with a conventional bike, but an e-bike's motor can hide the effect by working a little harder so it feels the same to ride. Iestyn has no such secrets - when his brakes are out of alignment, I know about it.",
    "I like that feeling of being fully in control of the bike - though e-bikes are coming along on that front. When I recently had the pleasure of testing the MiRider One folding e-bike, which has five different power settings.",
    "All the e-bikes I’d tested previously had between one and three options, the lowest of which was sometimes too much, so it was great to be able to just add a little extra juice if all I needed was a small boost. In fact, the MiRider is so well designed all-round, if I was looking for a bike purely for commuting, it'd be a no-brainer.",
    "Perhaps it won't be long before I'm able to test an electric bike that puts Iestyn in the corner. Until then, though, he'll remain my trusty daily rider."
  ],
  "headers": {
    "4": "More than looks",
    "9": "Weighty matters",
    "13": "Care and control"
  },
  "links": {
    "certainly not cheating": "https://www.techradar.com/news/no-of-course-electric-bikes-arent-cheating",
    "best electric bikes": "https://www.techradar.com/best/electric-bike",
    "Ribble Hybrid AL e": "https://www.techradar.com/reviews/ribble-hybrid-al-e",
    "Cowboy 3": "https://www.techradar.com/reviews/cowboy-3",
    "Cowboy's Easy Rider insurance": "https://uk.cowboy.com/pages/services",
    "VanMoof S3": "https://www.techradar.com/reviews/vanmoof-s3",
    "MiRider One": "https://www.techradar.com/reviews/mirider-one",
    "Gocycle GX": "https://www.techradar.com/reviews/gocycle-gx-2020",
    "as Shimano's head of training Julian Thrasher explained to me earlier this year": "https://www.techradar.com/news/e-bike-maintenance"
  }
}