{
  "source": "https://www.techradar.com/news/mwc-2021-ibm-expands-5g-portfolio-with-edge-and-automation-capabilities",
  "title": "MWC 2021: IBM expands 5G portfolio with edge and automation capabilities",
  "category": "computing",
  "updated": "2021-06-28T15:42:31Z",
  "author": "steve-mccaskill",
  "summary": "IBM strengthens telco play with partnerships and services",
  "article": [
    "IBM wants to make it easier for mobile operators to automate their networks and simplify the deployment of 5G services, announcing new products and partnerships at MWC 2021 in Barcelona.",
    "5G will deliver superior consumer services, but the real potential is in the business market. Ultrafast speeds, enhanced capacity and ultra-low latency will allow mobile networks to power mission-critical applications for the first time and allow for the creation of entirely new use cases.",
    "However, this requires operators to rearchitect networks away from centralized, legacy core infrastructure and towards the cloud.",
    "By virtualizing network functions, operators can roll out new services more rapidly, dynamically allocate resources to where they are most needed, and bring processing capabilities closer to the point of collection.",
    "These needs has seen significant convergence between the telecoms and technologies industries in recent years as vendors from both spheres collaborate to create joint-offerings that mix and match various IT and network technologies. IBM, along with rivals Google and Microsoft, have all invested heavily in telco capabilities for their respective cloud platforms.",
    "The headline announcement is IBM Cloud Park for Network Automation, a hybrid cloud software platform that provides AI-powered automation capabilities for 5G and edge services.",
    "It runs on RedHat OpenShift and uses advanced analytics, machine learning and AIOps to discover patterns and trends in network operations to automatically make adjustments that optimize infrastructure and maintain uptime.",
    "Thanks to the wider cloudification and virtualization of network infrastructure that has been needed to support 5G applications, network resources can be dynamically allocated where they are most needed, and problems can be resolved without human intervention.",
    "The platform can create models of all network functions, automatically create workflows, automate service design and testing, and offer a real-time view of network performance.",
    "IBM claims that a network engineer responsible for the design, configuration and implementation of a network site can condense 2-6 months of manual processes into just 4-5 days.",
    "\"As the telco industry races to capture new value from 5G and Edge computing, many are transforming their networks to software-defined platforms that can deliver on this promise. Yet limited automation and the lack of real- time visibility across networks have hindered the ability to deliver innovative services to customers fast enough,” said Andrew Coward, General Manager, Software Defined Networking, IBM.",
    "“To help address these growing demands, IBM’s new Cloud Pak for Network Automation software uses AI-powered automation to enable zero-touch provisioning of new services and simplifies the management of network functions from the cloud to the edge.”",
    "IBM has previously launched IBM for Telecommunications – a cloud platform and ecosystem of third-party vendors – to help operators and businesses take advantage.",
    "Now, to help telcos and enterprise customers manage the ever-increasing volume of data and devices at the network edge, the IBM Edge Application Manager partner ecosystem has expanded to more than 30 partners and can now manage up to 40,000 devices. These include smart cameras, sensors, drones, and industrial robots.",
    "The company has expanded its partnerships with Telefonica and Verizon, with the former using IBM’s AI and Blockchain capabilities to assist with customer care and supply chain optimization, and the latter building a 5G core built on OpenShift.",
    "Verizon hopes to be able to benefit from open innovations while still retaining the architectural control necessary to accelerate new features, offerings and services like network slicing and edge computing to market. Verizon hopes to become a leader in the network-as-a-service market, providing enterprise customers with the network tools to drive innovation in their businesses."
  ],
  "headers": {
    "3": "IBM cloud for telcos"
  },
  "links": {
    "MWC 2021": "https://www.techradar.com/news/mwc-2021-news",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "analytics": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}