{
  "source": "https://www.techradar.com/news/amazon-fire-tv-stick-4k-max-gets-first-ever-discount-in-early-black-friday-deals",
  "title": "Amazon Fire TV Stick 4K Max gets first-ever discount in early Black Friday deals",
  "category": "televisions",
  "updated": "2021-11-19T19:26:20Z",
  "author": "alex-whitelock",
  "summary": "The cheapest ever price on this powerful streaming stick",
  "article": [
    "The Amazon Fire TV Stick 4K Max is now just $34.99 thanks to Amazon's early Black Friday deals - featuring a fantastic $20 discount and the cheapest price yet on the latest Alexa streamer.",
    "This is the first discount on Amazon's most powerful streaming stick since its launch back in September. If you were waiting for a discount all this time, then now's your chance, be aware, though - there are probably quite a few people eying this rare Black Friday deal.",
    "While still $10 more expensive than the standard Fire TV Stick 4K, the Max is definitely worth the upcharge in our eyes. Not only does it have 40% more power (useful for zipping through those menus), but its recent addition of hardware AV1 support and WiFi 6 make it the stick of choice if you're looking to future-proof your streaming setup.",
    "As always, you'll have easy access to all your favorite streaming services with the Amazon Fire TV Stick 4K Max - Hulu, Amazon Video, Netflix, to name a few, as well as games and those handy Alexa voice commands.",
    "As a recent addition to the Amazon Fire device roster, we'd be surprised if the Fire TV Stick 4K Max gets any other discounts in next week's Amazon Black Friday deals event. In short, this one seems like a safe buy if you're looking to up your streaming game.",
    "Outside the US? See the best Black Friday Fire TV Stick deals in your region just below."
  ],
  "headers": {
    "6": "Black Friday Amazon Fire TV Stick 4K Max deal"
  },
  "links": {
    "is now just $34.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Ffire-tv-stick-4k-max-with-alexa-voice-remote%2Fdp%2FB08MQZXN1X%3Fref%3Ddlx_early_gd_dcl_img_3_8a7b0b44_dt_sl5_46%26th%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-4363255986705301000-20",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Amazon Black Friday deals": "https://www.techradar.com/black-friday/amazon-black-friday-deals"
  }
}