{
  "source": "https://www.techradar.com/news/tiktok-teams-up-with-shopify-to-offer-in-app-purchases",
  "title": "TikTok teams up with Shopify to offer in-app purchases",
  "category": "computing",
  "updated": "2021-08-24T19:14:52Z",
  "author": "anthony-spadafora",
  "summary": "New partnership will allow Shopify merchants to create mini-storefronts on TikTok",
  "article": [
    "As social commerce is one of the fastest growing channels for Shopify merchants, the ecommerce platform has announced a new partnership with TikTok that will make it easier for entrepreneurs to reach new customers.",
    "Shopify merchants with a TikTok For Business account will soon be able to add a shopping tab to their TikTok profiles, sync their product catalogs and create a mini-storefront which links directly to their online store for checkout.",
    "Kylie Jenner will be one of the first entrepreneurs to test out this new integration as she built her Kylie Cosmetics business on social media and also enjoys creating short-form videos for her fans on TikTok.",
    "President of Shopify, Harley Finkelstein provided further insight on the two companies' new partnership in a press release, saying:",
    "\"Creators are paving the way for a new kind of entrepreneurship where content, community, and commerce are key. By enabling new in-app shopping experiences and product discovery on TikTok for the first time, Shopify is powering the creator economy on one of the fastest-growing social and entertainment platforms in the world. We are excited to help this next generation of entrepreneurs connect with their audiences in more ways—and with TikTok as a visionary partner.\"",
    "Shopify and TikTok have also partnered to bring product links to Shopify merchants which can be used to tag products in organic TikTok posts.",
    "With this feature, TikTok users can choose to shop directly from a merchant's storefront or click a tagged product in a merchant's TikTok video that will take them to the merchant's online store for checkout.",
    "The TikTok Shopping pilot is currently available to Shopify merchants located in the US and UK. A select group of merchants in Canada will participate in the pilot in the coming weeks and from there, the feature will roll out to additional regions in the coming months.",
    "Shopify merchants interested in selling their products on TikTok can request early access to the TikTok Shopping pilot by heading to Shopify's TikTok channel."
  ],
  "headers": {
    "5": "Tagging products in TikTok posts"
  },
  "links": {
    "Shopify": "https://www.techradar.com/reviews/shopify",
    "ecommerce platform": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "TikTok": "https://www.techradar.com/news/tiktok-is-set-to-start-collecting-biometric-data-from-its-users",
    "TikTok For Business": "https://www.techradar.com/news/what-do-you-get-when-you-cross-vimeo-tiktok-a-potential-business-hit",
    "online store": "https://www.techradar.com/how-to/start-an-online-store-from-scratch-and-drive-sales",
    "Kylie Cosmetics": "https://www.techradar.com/news/shopify-data-breach-hits-kylie-jenner-make-up-firm",
    "press release": "https://news.shopify.com/scaling-social-commerce-shopify-introduces-new-in-app-shopping-experiences-on-tiktok",
    "tag products": "https://www.techradar.com/news/youtubes-new-feature-allows-users-to-buy-products-shown-in-video",
    "TikTok video": "https://www.techradar.com/news/tiktok-comes-to-fire-tv-sticks-along-with-a-few-changes",
    "Shopify's TikTok channel": "https://www.tiktok.com/@shopify?lang=en"
  }
}