{
  "source": "https://www.techradar.com/news/microsoft-teams-is-getting-a-major-storage-update",
  "title": "Microsoft Teams is getting a major storage update",
  "category": "computing",
  "updated": "2021-01-11T13:04:53Z",
  "author": "barclay-ballard",
  "summary": "Teams recordings will no longer be saved with Streams",
  "article": [
    "In the coming months, Microsoft Teams will be changing how video recordings are stored for all its users.",
    "The company has announced that from March 1, meeting recordings will be saved to OneDrive for Business and SharePoint, with Stream, Microsoft’s own enterprise video service, no longer an option.",
    "The transition from Stream to OneDrive will be a gradual process, with Government Community Cloud customers currently able to adjust their settings so that video recordings continue to be stored via Stream. This will only be the case up until March, however, at which time, all recordings will be saved to OneDrive and SharePoint.",
    "“Starting on March 1, 2021, no new meeting recordings will be saved to Microsoft Stream (Classic), instead all customers will automatically have their meeting recordings saved to OneDrive for Business and SharePoint even if they’ve changed their Teams meeting policies to Stream,” Morné Pretorius, Principal Program Manager at Microsoft, explained.",
    "Microsoft has quickly identified a number of advantages to Teams users of transitioning recordings away from Stream. Using OneDrive for Business and SharePoint will make it easier for firms to set permissions, share recordings quicker and adopt BYOD policies.",
    "However, fans of Stream are likely to be unhappy about a number of features that will no longer be available to them. Meeting transcriptions will not be available for GCC users, for example, who will have to make do with English-only closed captions. Recording owners, meanwhile, will not be able to prevent users with whom they’ve shared recordings from downloading them.",
    "Microsoft has also reiterated that Stream is not set to be deprecated any time soon and all recordings saved with the platform will remain in place until the Redmond-based firm looks to migrate them to OneDrive and SharePoint at some point in the future.",
    "Via Neowin"
  ],
  "headers": {
    "4": "A new way to save"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "explained": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_7320378110026004000&xs=1&url=https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fpublic-sector-blog%2Fmicrosoft-teams-recorded-meeting-storage-in-onedrive-for%2Fba-p%2F2030120&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-teams-is-getting-a-major-storage-update",
    "Neowin": "https://www.neowin.net/news/microsoft-teams-recordings-to-be-stored-on-onedrive-for-business-and-sharepoint-after-march-1/"
  }
}