{
  "source": "https://www.techradar.com/news/samsung-galaxy-s20-vs-galaxy-s10-comparing-samsungs-new-and-old-flagships",
  "title": "Samsung Galaxy S20 vs Galaxy S10: comparing Samsung’s new and old flagships",
  "category": "phones",
  "updated": "2021-04-12T10:17:22Z",
  "author": "tom-bedford",
  "summary": "Doubling the numbers",
  "article": [
    "If you're considering buying a new Samsung phone, the Galaxy S20 and Galaxy S10 are probably two of your top picks, being the company's flagships from 2020 and 2019 respectively.",
    "Even though the Samsung Galaxy S21 series is now out, deals and discounts ensure older phones are available for lower prices, so it's totally feasible and understandable that you'd be looking at older Galaxy phones instead of the newer ones.",
    "Both the Samsung Galaxy S20 and S10 series topped our list of the best smartphones in their times, though the ceaseless march of time eventually booted them off the list - this means they're both top picks though.",
    "So how does the base Samsung Galaxy S20 compare to the Galaxy S10 from the year before? We’ve put them head-to-head to find out.",
    "You can pick up the Samsung Galaxy S20 5G for $999 in the US, £899 in the UK and AU$1,499 in Australia, with price increasing for more storage. There's a 4G version available in the UK and Australia for £799 or AU$1,349.",
    "In comparison, the Samsung Galaxy S10 cost $899 / £799 / AU$1,349 for its 128GB model and $1,149 / £999 / AU$1,699 for the 512GB model, and over the first year of its life it saw prices drop by around 25%, with a roughly 30% drop during sales periods.",
    "It’s worth pointing out that while the Samsung Galaxy S20 is the lowest end device of its series, the S10 actually sat in the middle, so there are naturally going to be some differences between the phones as a result.",
    "Both phones were unveiled in mid-February of their respective years, as Samsung has an annual launch schedule with most of its devices. You can see current prices for both phones in your region below:",
    "The Samsung Galaxy S20’s screen is slightly bigger than the S10’s, at 6.2 inches to 6.1 inches respectively, but that’s not a huge difference when you consider that the Galaxy S20 Ultra has a whopping 6.9-inch display.",
    "You can start to see the difference between the screens when you look at the quality of each. The Galaxy S10 has a QHD+ display with a 3040 x 1440 resolution, but the Galaxy S20’s display is WQHD+ and has a 3200 x 1440 resolution.",
    "However, because the S20 is slightly larger the pixel density is almost identical, coming in at 563 pixels per inch on the Galaxy S20, and 550 on the Galaxy S10.",
    "One big difference between the two phones is in refresh rate, as while the Samsung Galaxy S10 has a ‘standard’ 60Hz screen, the Galaxy S20 doubles that to 120Hz. This means the screen updates twice as fast, making motion look smoother whether you’re scrolling through TechRadar.com, watching a movie or playing games.",
    "The touch input rate is also double on the Galaxy S20, at 240Hz rather than 120Hz, which means when you press the screen the Galaxy S20 picks it up faster. This is mainly useful for gaming.",
    "In terms of body size, the two phones aren’t too different, with the Samsung Galaxy S20 measuring 151.7 x 69.1 x 7.9mm and the Galaxy S10 taking up 149.9 x 70.4 x 7.8mm. They’re only 6g different in terms of weight too, at 163g and 157g respectively.",
    "The Samsung Galaxy S20 and S10 don’t look hugely different either, at least on the front, with curved displays on the front broken by punch-hole cameras (albeit in different places in the screen).",
    "There are more differences on the back, as while the Samsung Galaxy S10 has a horizontal camera block, the Galaxy S20 has its snappers housed in a bland-looking rectangle in the top-left corner.",
    "Both phones have glass screens and backs with an aluminum frame, and there are a range of color versions to pick up. They’re also both IP68 certified for water and dust resistance.",
    "You’re getting three rear cameras on both the Samsung Galaxy S20 and S10, and the lenses are similar in function: main, telephoto for zoomed-in shots, and ultra-wide-angle for an increased field-of-view. We’ve put a table below detailing the resolutions of these cameras.",
    "As you can see, the Samsung Galaxy S20’s telephoto lens is a stand-out with a 64MP sensor, and this supports a 3x optical and 30x digital zoom to take long-reaching distance shots, compared to the S10’s 2x optical zoom.",
    "There are also a range of camera features present in the Samsung Galaxy S20, like Live Focus and Live Focus Video, which let you alter the background of a photo or video (such as turning it black-and-white, or increasing the background blur), along with various scene optimization modes, slow-motion shooting, and more.",
    "The Samsung Galaxy S10 has its share of camera modes too though, and it’s worth pointing out that the few Galaxy S20 camera modes that aren’t in the S10 may find their way there in the near future.",
    "When we tested the Galaxy S20 series we were fans of the Single Take mode, which lets you take pictures with all the lenses at once to try and get the best snap possible of your subject. It’s possible that this mode will find its way to the S10 too, though.",
    "If you’re a fan of recording video, it’s worth knowing that the Samsung Galaxy S20 can record 8K video, a jump up from the 4K of the Galaxy S10.",
    "The cameras on the front of the Samsung Galaxy S20 and Galaxy S10 are both 10MP, so their photographic capabilities will likely be largely similar.",
    "In the Samsung Galaxy S20 you’ll find a 4,000mAh battery, which is a big step over the 3,400mAh power pack in the Galaxy S10. As a result, and also because the newer phone isn’t much bigger in terms of screen space, the S20 will probably last a bit longer before it needs powering up.",
    "The charging speed is faster on the Galaxy S20 too, with 25W fast charging, up on the 15W of the Galaxy S10. Since other companies have revealed charging tech that powers up at 100W, neither of these speeds are breathtaking, but faster is still better.",
    "There’s also wireless charging and Wireless Power Share (using the phone as a wireless charger for other devices) in both handsets, which will be useful for certain users.",
    "The Samsung Galaxy S10 launched with Android 9, although if you buy that phone now you can easily upgrade it to Android 10, which the Samsung Galaxy S20 launched with. These phones both have Samsung’s One UI laid over the top, which has a faintly pastel aesthetic and makes icons big and rounded.",
    "The chipset powering the Galaxy S10 is either the Snapdragon 855 or Exynos 9820 (depending on where in the world you are), while the Galaxy S20 has either the Snapdragon 865 or Exynos 990. Both pairs of chipsets were the top-end processors when the phones came out, and while the latter two will naturally offer more processing power, all of them should be more than sufficient for most uses.",
    "Unlike the Galaxy S10, the Samsung Galaxy S20 is also a 5G phone – in most regions. In some places you can buy a 4G-only version of the phone, but this device is less future-proofed.",
    "One difference between the devices that some people might really care about is in the RAM department. The Samsung Galaxy S20 has 12GB of RAM, but the older Galaxy S10 launched with only 8GB, so if you need the maximum memory for your handset, the newer phone is the one for you.",
    "There’s no real difference in storage though, with both phones coming with 128GB - though there is also a 256GB version of the S10. For more storage on the S20 you either need to use a microSD card or move up to the S20 Plus or Ultra models.",
    "It seems the differences between the Samsung Galaxy S20 and Galaxy S10 are mainly spec increases for the newer device, like the upgraded chipset, battery and RAM.",
    "Sure, there are a few big steps up, particularly in the telephoto lens with its 64MP sensor, and the 120Hz screen, so some people might find these valid reasons to upgrade, but others might not deem them enough to justify a higher cost.",
    "If you want a new phone that will last you as long as possible though, the Samsung Galaxy S20 with its 5G and premium chipset should see you through a good few years."
  ],
  "headers": {
    "4": "Samsung Galaxy S20 vs Galaxy S10 price and release date",
    "8": "Samsung Galaxy S20 vs Galaxy S10 design and display",
    "17": "Samsung Galaxy S20 vs Galaxy S10 cameras",
    "24": "Samsung Galaxy S20 vs Galaxy S10 battery life",
    "27": "Samsung Galaxy S20 vs Galaxy S10 features",
    "32": "Takeaway"
  },
  "links": {
    "new Samsung phone": "https://www.techradar.com/news/best-samsung-phones",
    "Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "best smartphones": "https://www.techradar.com/news/best-phone"
  }
}