{
  "source": "https://www.techradar.com/news/sony-backtracks-horizon-forbidden-west-ps5-upgrade-which-will-now-be-free",
  "title": "Sony backtracks Horizon Forbidden West PS5 upgrade, which will now be free",
  "category": "gaming",
  "updated": "2021-09-06T09:12:09Z",
  "author": "rhys-wood",
  "summary": "Skirting controversy, or just making more?",
  "article": [
    "Sony sparked controversy last week when it announced that the Standard and Special editions of Horizon Forbidden West wouldn't feature a free upgrade to the PS5 version for consumers who bought the game on PS4.",
    "Thankfully, Sony has now walked back on that decision following fan backlash, and announced it will offer a free upgrade path to players who purchased Horizon Forbidden West on PS4 to the digital PS5 version of the game.",
    "Originally, if players wanted access to both generations' version of Horizon Forbidden West, they'd have to buy either the Digital Deluxe or Collector's edition of the game, the former being the most affordable option at $79.99 / £79.99.",
    "PlayStation boss Jim Ryan clarified the decision in a statement to the Washington Post, saying: \"No one should be disappointed. The PS5 versions of those games are built from the ground up to take advantage of the PS5 feature set, and we have an upgrade path for PS4 users to get the PS5 versions for free. It’s about people having choice. I’m really quite pleased about the situation.\"",
    "Ryan also announced, via the official PlayStation blog, that future cross-gen titles will have an affordable upgrade path available: \"Moving forward, PlayStation first-party exclusive cross-gen titles (newly releasing on PS4 & PS5) – both digital and physical – will offer a $10 USD digital upgrade option from PS4 to PS5. This will apply to the next God of War and Gran Turismo 7, and any other exclusive cross-gen PS4 & PS5 title published by Sony Interactive Entertainment.\"",
    "We're obviously over the moon that Horizon Forbidden West players on PS4 will now have the chance to upgrade to the PS5 version for free when they're ready and/or able to own the ever-elusive PS5 console.",
    "The relatively low-cost upgrade option for future titles like God of War: Ragnarok and Gran Turismo 7 is welcome, but still leaves us feeling let down, especially when you look at the PS5's competition.",
    "Whether you love or hate the Xbox Series X/S, it's hard to deny that Microsoft's approach to current-gen upgrades has been much more agreeable for consumers.",
    "Whether you own an Xbox One or a Series X, your version of a game will update accordingly thanks to Xbox's Smart Delivery feature. This means that whenever you buy an Xbox game physically or digitally, your console will install the correct version for you at no extra cost. Plus, Series X/S Enhanced titles update automatically, meaning your console will always update to the best version of any game for you.",
    "We don't expect Sony to upend its entire business model, though. What Microsoft is doing with features like Game Pass and Smart Delivery is unprecedented. It would just be nice to not have to worry about forking over extra hard-earned cash to play the best version of a game possible on PS5.",
    "Sony is clearly aware that PS5s are a nightmare to get hold of. So when they do become more readily available, having to hand over an extra $10 / £10 for a PS5 upgrade is sure to sting a bit, especially if players are planning on updating multiple titles for their new machine."
  ],
  "headers": {
    "5": "Analysis: Good, but Sony can do better"
  },
  "links": {
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "free upgrade": "https://www.techradar.com/news/horizon-forbidden-west-lack-of-free-ps5-upgrade-isnt-a-surprise-but-its-still-sad-to-see",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Washington Post": "https://www.washingtonpost.com/video-games/2020/09/16/ps5-retail-units/",
    "official PlayStation blog": "https://blog.playstation.com/2021/09/04/pre-order-horizon-forbidden-west-now-collectors-and-digital-deluxe-editions-detailed/",
    "God of War: Ragnarok": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Gran Turismo 7": "https://www.techradar.com/news/gran-turismo-7-release-date-news-cars-trailers",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Smart Delivery": "https://www.techradar.com/news/xbox-smart-delivery-explained"
  }
}