{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-chromebook-2-is-now-available-to-pre-order-with-up-to-dollar50-in-savings",
  "title": "The Samsung Galaxy Chromebook 2 is now available to pre-order with up to $50 in savings",
  "category": "computing",
  "updated": "2021-02-17T17:10:30Z",
  "author": "michelle-rae-uy",
  "summary": "Samsung brings its flagship back down to Earth, in a good way",
  "article": [
    "The Samsung Galaxy Chromebook 2 might be the bat-signal that luxurious Chromebooks need. The anticipated follow-up to Samsung’s flagship is now available to pre-order for almost half the cost of its predecessor.",
    "Chromebook users can now pre-order the Samsung Galaxy Chromebook 2 beginning February 16 in the US at both the Samsung Online Shop and Best Buy, and for much less. Starting at $550 (about £400, AU$720), which gets you an Intel Celeron, 4GB RAM and 64GB storage configuration, this 2021 refresh of the original $999 Galaxy Chromebook comes at a much cheaper price, bringing it down to a more palatable level.",
    "Both Samsung and Best Buy are offering up to $50 credit when you pre-order, which you can then use towards other purchases at the same store. Pre-orders will only last through the end of the month. However, if you’d rather wait after its official release, both will also offer up to $30 off your next purchase when you buy it from March 1 through 14.",
    "Samsung Galaxy Chromebook 2 pre-orders will start shipping out on March 1.",
    "While we have yet to properly test the Samsung Galaxy Chromebook 2 to see how it fares next to its predecessor, our hands-on of the device reveals a few key updates, namely its new 13.3-inch FHD QLED panel and its much-improved battery life.",
    "While the original came with an impressive 4K AMOLED display, Samsung decided to bring it back down to Earth with a more grounded 1080p QLED panel, perhaps in its effort to make it more affordable. That isn’t to say that you’re viewing experience will be downgraded. On the contrary, it’s still one of the best displays we've ever seen on a Chromebook.",
    "The Samsung Galaxy Chromebook 2 also now comes with up to 14 hours of battery life on a single charge, certainly an upgrade from the original and something that’s more in line with what we have come to expect from Chromebooks.",
    "Other notable features worth mentioning here are the cinematic Smart Amp sound that’s Samsung claims to be up to 178% louder than the average amplifier, that signature Galaxy Chromebook aluminum frame that comes in Mercury Gray and for those who are tired of the same gray or silver aesthetic), Fiesta Red."
  ],
  "headers": {
    "4": "Some other key updates for the Chromebook flagship"
  },
  "links": {
    "Chromebooks": "https://www.techradar.com/news/best-chromebook",
    "predecessor": "https://www.techradar.com/reviews/samsung-galaxy-chromebook",
    "Samsung Online Shop": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-5630195715585931000&url=https%3A%2F%2Fwww.samsung.com%2Fus%2Fcomputing%2Fchromebooks%2Fgalaxy-chromebook2%2F%3Fcid%3Dsem-mktg-pfs-pc-us-google-na-01072021-169947-%26ds_e%3DGOOGLE-cr%3A%2525ecid%21-pl%3A%2525epid%21-%26ds_c%3DFF~Galaxy%2BChromebook2%2B-%2BGalaxy%2BChromebook2_CN~pc_PH~on_MK~usnat_BS~im_PR~pcl_SB~chrmb2_PK~ROAS_FS~lo_CA~kew_MD~h_KS~ba_MT~exa-%26ds_ag%3DAG~Laptop_MK~us_AT~ta_MD~h_AI~no-%26ds_k%3Dsamsung%2Bgalaxy%2Bchromebook%2B2%26gclsrc%3Daw.ds%26%26gclid%3DCj0KCQiA962BBhCzARIsAIpWEL1U3dZ3hUBbRdGfgOoXUrLEL1WbcWfj8sdpP1GbMywLr-ii6BLZ8XwaAniXEALw_wcB&article_name=The%20Samsung%20Galaxy%20Chromebook%202%20is%20now%20available%20to%20pre-order%20with%20up%20to%20%2450%20in%20savings&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-samsung-galaxy-chromebook-2-is-now-available-to-pre-order-with-up-to-dollar50-in-savings",
    "Best Buy": "https://shop-links.co/link?publisher_slug=future&exclusive=1&u1=trd-us-8004945964246114000&url=https%3A%2F%2Fwww.bestbuy.com%2Fsite%2Fsamsung-galaxy-chromebook-2-13-3-qled-touch-screen-intel-core-i3-8gb-memory-128gb-emmc-mercury-gray%2F6448526.p%3FskuId%3D6448526&article_name=The%20Samsung%20Galaxy%20Chromebook%202%20is%20now%20available%20to%20pre-order%20with%20up%20to%20%2450%20in%20savings&article_url=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fthe-samsung-galaxy-chromebook-2-is-now-available-to-pre-order-with-up-to-dollar50-in-savings",
    "hands-on of the device": "https://www.techradar.com/reviews/samsung-galaxy-chromebook-2"
  }
}