{
  "source": "https://www.techradar.com/news/how-to-watch-lopez-vs-kambosos-and-live-stream-boxing-free-and-from-anywhere",
  "title": "How to watch Lopez vs Kambosos and live stream boxing free and from anywhere",
  "category": "computing",
  "updated": "2021-11-27T22:34:46Z",
  "author": "kevin-lynch",
  "summary": "Delayed lightweight title fight finally takes place tonight",
  "article": [
    "After multiple delays, Aussie challenger George Kambosos will finally take on American unified lightweight champ Teofimo Lopez in what looks set to be an unmissable showdown in New York.",
    "If you want to know how to get a Lopez vs Kambosos live stream - including ways to watch absolutely FREE - we have all the details you need on how to watch the boxing. Hint: it's a TKO for streaming service DAZN in pretty much all countries.",
    "Originally planned for June 5, the fight has been bounced from the schedule multiple times thanks to Lopez contracting Covid-19, clashes with NFL Monday Night football, and contract issues with the card's original promoter Triller.",
    "Now at last taking place after Eddie Hearn's Matchroom stepped in to promote, the clash sees Lopez return to the ring for his first defence after over a year on the missing list.",
    "A few weeks after Lopez's title winning victory over Vasily Lomachenko in October 2020, Kambosos claimed mandatory challenger status by beating former world featherweight champ Lee Selby via a split decision, with the Sydney-born star now finally getting his chance at claiming his opponent's WBA, WBO and IBF lightweight belts.",
    "Here's how to watch George Kambosos vs Teofimo Lopez online and get a live stream, no matter where you are in the world.",
    "The exclusive way to watch a Lopez vs Kambosos live stream in almost every region of the world (except for China) is via DAZN, which is offering the fight to customers as part of its subscription.",
    "Boxing fans in Canada are amongst the luckiest, as while it costs 20 bucks in the Great White North, you can get a FREE trial of DAZN in Canada - making one of a select few countries where the service is still offering a trial on the house.",
    "As we say, DAZN has this wrapped up pretty much everywhere. But if you're abroad and discover that your coverage is geo-blocked, then the only alternative that we know is to use a VPN to dial in to a country that is showing the fight.",
    "The software is perfect for this as it allows you to change your IP address and appear to be in a completely different location - and all through a safe, encrypted connection. Here's how to get started.",
    "Use a VPN to live stream Lopez vs Kambosos anywhere",
    "The main card for tonight's event is scheduled to start at 8pm EST / 5pm PST / 12pm AEDT, while Lopez and Kambosos are set to enter the ring anytime after 11pm EST / 8pm PST / 3pm AEDT.",
    "Launched in 2016, DAZN is a dedicated sports streaming service that is now available in over 200 countries all around the world including the US, Canada, UK, Australia and New Zealand.",
    "Pronounced 'Da Zone', depending on what region you find yourself in and the broadcast rights it holds in that the country, a DAZN subscription can get you access to live Premier League and Champions League football, NFL, cricket, snooker, rugby union and more.",
    "It's also seeking to challenge the pay-per-view boxing hierarchy, and is landing an increasing number of coups.",
    "The price of DAZN also varies depending on where you are in the world but is generally competitive - new subscribers in Australia and New Zealand can currently take advantage of an introductory offer for just $2.99 a month, while in more established markets like Canada it costs CAD$20 a month. There's also a free DAZN trial in some areas and works with pretty much any modern device imaginable."
  ],
  "headers": {
    "6": "Can I watch a free Lopez vs Kambosos live stream?",
    "8": "How to watch Lopez vs Kambosos from outside your country",
    "11": "Lopez vs Kambosos time",
    "12": "What is DAZN? All about the sports streaming service"
  },
  "links": {
    "streaming service DAZN in pretty much all countries": "https://www.prf.hn/click/camref:1101l4vjL/pubref:trd-us-9144448578496111000/destination:https%3A%2F%2Fwww.dazn.com%2F",
    "DAZN": "https://www.techradar.com/news/what-is-dazn-price-subscriptions-live-stream",
    "FREE trial of DAZN in Canada": "https://www.prf.hn/click/camref:1101l4vjL/pubref:trd-us-1265065802480063500/destination:https%3A%2F%2Fwww.dazn.com%2Fen-CA%2Fl%2Fsports",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "DAZN is a dedicated sports streaming service": "https://www.prf.hn/click/camref:1101l4vjL/pubref:trd-us-7831993089156525000/destination:https%3A%2F%2Fwww.dazn.com%2F",
    "free DAZN trial": "https://www.techradar.com/news/dazn-free-trial-sign-up"
  }
}