{
  "source": "https://www.techradar.com/news/dji-mavic-3-leak-reveals-the-drones-intriguing-design-and-dual-cameras",
  "title": "DJI Mavic 3 leak reveals the drone's intriguing design and dual cameras",
  "category": "cameras",
  "updated": "2021-10-25T12:56:51Z",
  "author": "mark-wilson",
  "summary": "A full look at the DJI Mavic 3 reveals big changes",
  "article": [
    "The DJI Mavic 3 drone appears to be very close to take-off, with some new leaked photos revealing the Mavic 2 Pro successor's full design and dual cameras.",
    "The first hands-on Mavic 3 images we've seen, picked up by DroneDJ, have apparently come from a Chinese warehouse, and show the incoming drone with its arms both folded and unfolded. We also get a close look at its dual camera module, which is rumored to include a 20MP Four Thirds sensor and a 12MP telephoto with an equivalent of 7x optical zoom.",
    "One of the most striking things about these new photos is how comparatively slim the Mavic 3's arms appear to be. If the leaked photos are accurate, the arms could be almost half the width of those on the Mavic 2 Pro. This is presumably to keep the drone's weight down, though DJI has presumably subjected those arms to some tough wind tunnel tests to make sure they can withstand similar gusts.",
    "The Mavic 3's propellors also look to have been extended and flattened, although it's not clear whether this is simply to maintain flight stability or reduce the drone's noise at lower altitudes. We hope it's the latter, because the slightly intimidating sound of most drones is one of our main issues with the flying cameras.",
    "Based on the leaked image of a hand holding the Mavic 3 (below), the drone's overall size of doesn't appear to have increased significantly from the Mavic 2 Pro. This backs up a previous leak of the drone's manual, which claims that the Mavic 3's take-off weight will only be 920g – just 13g more than the Mavic 2 Pro.",
    "This would be pretty impressive if DJI's new drone does, as now looks likely, have a main Four Thirds camera, beneath a telephoto lens with a 1/2in sensor. Four Thirds sensors have almost twice the surface area of 1-inch chips, so that would a huge upgrade for a drone that's only marginally heavier and lighter than before.",
    "The final detail revealed by the new leaked photos is that the Mavic 3 appears to have a darker paint job that previous DJI drones. Although it's not yet clear whether or not this will be the case for both versions of DJI's new Mavic.",
    "According to a filing in the FCC database, which is the USA's licensing body for new tech, a base model of the Mavic 3 will be joined by a Mavic 3 Cine version, with the latter bringing a larger 1TB internal SSD and a new DJI RC Pro controller, based on the DJI Smart Controller from 2019. Judging by the number of Mavic 3 leaks we're now seeing, we won't have to wait long to find out for sure.",
    "The sheer number of DJI Mavic 3 leaks we're seeing suggests that the new drone will arrive in one of DJI's two upcoming launch events, with the smart money on that November 5 date revealed on social media. These new leaked photos only back up the rumors that it's going to be a powerful new upgrade – and perhaps the most capable folding drone in the skies.",
    "Those spindly arms do look slightly odd compared to the rest of the drone's body, but DJI drones are renowned for their reliability and flying chops – so it'd be a surprise to see the Mavic 3 compromise on this simply to get a larger camera on board. We're also hopeful that those new propellors might reduce its noise at lower altitudes, to make it less distracting and conspicuous in the air.",
    "There's no doubt that smaller drones like the DJI Air 2S (which weighs only 595g) are going to be the choice for travelers, or photographers who want a drone to slot in neatly next to some lenses in their camera bags. But the Mavic 3 is promising to bring two big upgrades to help justify that near-1kg weight – a powerful dual-camera system and a much longer battery life.",
    "The leaked photos give us a close look at those two cameras, which are rumored to be a 20MP Four Thirds main option (with a 24mm f/2.8-f/11 lens) and a 12MP telephoto camera with a 160mm equivalent focal length. Like your smartphone's telephoto lens, it looks like the latter will simply offer you one fixed focal length rather than a true optical zoom, but it'd still be a very handy backup for picking out details or shooting aerial B-roll.",
    "With previous leaks also suggesting that the Mavic 3's body will hold a battery that'll give it a 46-minute flight time (a 48% increase over the Mavic 2 Pro), the signs are looking good for a launch that will live up to its considerable hype."
  ],
  "headers": {
    "8": "Analysis: An aerial beast, despite those spindly arms"
  },
  "links": {
    "DJI Mavic 3": "https://www.techradar.com/reviews/dji-mavic-3",
    "DroneDJ": "https://dronedj.com/2021/10/21/dji-mavic-3-slimmer-arms-props-new-leaked-pictures/",
    "filing in the FCC database": "https://www.techradar.com/news/dji-mavic-3-leak-confirms-one-key-upgrade-that-could-help-it-soar-above-rivals",
    "DJI Air 2S": "https://www.techradar.com/reviews/dji-air-2s"
  }
}