{
  "source": "https://www.techradar.com/news/atandt-is-now-offering-an-incredible-iphone-13-pro-deal-for-free-with-trade-in",
  "title": "AT&T is now offering an incredible iPhone 13 Pro deal for free with trade-in",
  "category": "phones",
  "updated": "2021-09-17T19:25:47Z",
  "author": "claudia-watkins",
  "summary": "Save $1000 on Apple’s newest device",
  "article": [
    "Pre-orders for Apple’s latest devices are now live and some tempting iPhone 13 Pro deals have already emerged. Right now, AT&T is giving customers the opportunity to bag the iPhone 13 Pro for free with an eligible trade-in.",
    "Currently, AT&T’s iPhone 13 Pro deal allows you to trade-in your old device (T&C’s apply) and receive up to $1000 credit, whilst the iPhone 13 Pro is currently retailing for $999. As it stands, this AT&T offer is one of the best deals we've seen so far for the iPhone 13 range, giving new and existing customers significant savings off Apple's newest generation.",
    "You’ll need to purchase your device via a monthly AT&T installment plan and sign up for an unlimited data plan in order to claim this offer. After receiving your new iPhone, store credit will be applied to your account within three bill cycles after AT&T processes your trade-in. It is important to note that the credit will be applied in instalments throughout the course of your plan.",
    "We're also rounding up all the best iPhone 13 Pro Max deals available today. If you're unsure whether or not to upgrade, below you'll find all of the latest information on Apple's newest iPhone generation."
  ],
  "headers": {
    "3": "Today's best iPhone 13 Pro deal at AT&T"
  },
  "links": {
    "iPhone 13 Pro deals": "https://www.techradar.com/deals/apple-iphone-13-pro-deals",
    "iPhone 13 Pro for free": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-8395884414533153000/https://www.att.com/buy/phones/apple-iphone-13-pro-128gb-sierra-blue.html",
    "iPhone 13 Pro Max deals": "https://www.techradar.com/deals/apple-iphone-13-pro-max-deals"
  }
}