{
  "source": "https://www.techradar.com/news/where-is-the-nintendo-switch-pro",
  "title": "Where is the Nintendo Switch Pro?",
  "category": "gaming",
  "updated": "2021-06-07T16:47:44Z",
  "author": "adam-vjestica",
  "summary": "The rumored Switch upgrade still hasn’t been announced",
  "article": [
    "Nintendo was supposed to announce the Nintendo Switch Pro last week – at least that’s what various rumors and reports seemed to suggest. As it turned out, that wasn’t the case, which ultimately begs the question: when will the Nintendo Switch Pro be revealed?",
    "Nintendo had been tipped to show off the new Nintendo Switch before this year’s E3 2021 event, which takes place on June 12 to June 15. The reason being, as reported by Bloomberg, was so that publishers and developers could freely show off their Nintendo Switch projects – many of which may have been developed with the Nintendo Switch Pro in mind.",
    "A reveal date was then suggested by Nick Baker, one of the hosts of the Xbox Era podcast, who believed that Nintendo’s new hardware was set to be shown in all its glory on June 3. However, he did note that the date could be pushed back, which has apparently happened in the past.",
    "What made Baker’s tip more believable, however, was that the rumored Switch upgrade – which will reportedly include a 7-inch 720p OLED screen and be capable of displaying at 4K resolution when hooked up to a TV – was rumored to be available for preorder on June 4 according to a prominent Pokémon leaker. Again, this never occurred.",
    "As of today, June 7, Nintendo still hasn’t given any indication that a Nintendo Switch Pro reveal will take place anytime soon. It’s also worth clarifying that we still have no concrete confirmation that the company is even planning a Nintendo Switch upgrade, but there are numerous reports that strongly suggest a new Switch is indeed on the way.",
    "Two of the most compelling pieces of information that point to the existence of a Nintendo Switch Pro come from the OLED firm Universal Display Corp, who made mention of \"a new Switch Pro\" in an investors call. Bloomberg’s most recent report was also pretty compelling, and was ratified by other industry insiders who confirmed the Switch Pro is aiming for a September to October 2021 release.",
    "With E3 fast approaching, then, we’ll have to wait and see if Nintendo does announce a Nintendo Switch Pro before the event takes place or not. Of course, Nintendo is holding its own conference at E3 on June 15 at 5pm BST / 9am PT / 12pm ET (or June 16 at 2am AEST), which will last for 40 minutes. The event will focus exclusively on Nintendo Switch software, with a hardware announcement not deemed to be likely."
  ],
  "headers": {
    "4": "Is the Nintendo Switch Pro even real?"
  },
  "links": {
    "Nintendo Switch Pro": "https://www.techradar.com/news/nintendo-switch-2",
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-05-27/nintendo-plans-upgraded-switch-replacement-as-soon-as-september",
    "on June 3": "https://www.techradar.com/news/nintendo-switch-pro-announcement-could-take-place-this-week",
    "7-inch 720p OLED screen": "https://www.techradar.com/news/why-the-nintendo-switch-2s-720p-oled-screen-would-make-perfect-sense",
    "4K resolution": "https://www.techradar.com/news/what-is-4k-resolution-ultra-hd",
    "rumored to be available for preorder on June 4": "https://www.techradar.com/news/nintendo-switch-pro-preorders-could-begin-on-june-4-rumors-suggest",
    "a new Switch Pro": "https://www.techradar.com/news/nintendo-switch-pro-may-have-accidentally-been-confirmed"
  }
}