{
  "source": "https://www.techradar.com/news/sustainability-its-all-about-the-details",
  "title": "Sustainability: It’s all about the details",
  "category": "computing",
  "updated": "2021-09-09T06:50:36Z",
  "author": "andy-tomkins",
  "summary": "Business sustainability starts with a series of small steps",
  "article": [
    "Sustainability can’t be delayed any longer and every business has its role to play in fixing the issue. The change in working practices brought around by the pandemic has presented us with the perfect opportunity to re-assess and adjust our approach to sustainability.",
    "It can seem daunting, but change doesn’t have to be extreme. It can start with a range of small but effective actions. From embracing recycling and reusable materials, to switching to more eco-friendly modes of manufacturing - and reviewing transport or packaging best practice. Smaller wins across a wide range of areas can add up to create a truly significant impact.",
    "Prior to the pandemic, a select number of companies had already started to introduce more flexible working policies, allowing people to work from home or cultivate a co-working space in an agile environment. Today, a higher number of companies support a mixture of remote and office working, which improves wellbeing through offering a positive work life balance for employees. An added benefit of spending less time in the office is a reduction in carbon emissions through limited travel needs.",
    "For instance, the average co-working space, or a communal office closer to home can help generate carbon emission savings of 118 metric tons annually between now and 2029.",
    "Of course, technology is making this all possible. With the right solutions and printing capabilities, workers can seamlessly transition between the office and their remote working environment. There is a very obvious example here. Before 2020, video conferencing had already become a staple in workplace communication, connecting colleagues around the world, but under pandemic working conditions, its usage increased dramatically to facilitate everyday meetings that could no longer be held face-to-face.",
    "As the title anticipates, sustainability initiatives can often start with the little details first. You can start by separating the paper, plastic and cardboard used in the office, and by reducing the use of disposable cutlery. But the details also include technology decisions and the equipment used.",
    "The reason for this is fairly obvious. Technology, including PCs, laptops and smartphones, represented just 1% of the world’s carbon footprint in 2007. Fast forward to today, and technology accounts for 3.7% of global greenhouse emissions. While technology is at the core of the modern business, there are still small but hugely beneficial steps all organizations can take to address one of the most serious environmental problems.",
    "Here’s a simple example: keeping a business phone for three years instead of two, or a laptop for six years instead of five can be very impactful on a company’s use of materials.",
    "If enterprises were to do this on a national, or international scale, there would be less demand to create as many new devices each year. This would reduce the overall amount of raw materials mined to match the demand. And when new products are needed, companies can opt for remanufactured or refurbished equipment.",
    "This would not only be better for the environment, but for finances too. Companies can save on average 30-50 per cent of the selling price compared to the same equipment that has been made new. Additionally, thanks to ratings programs and awards schemes, customers have greater visibility of brands and products that are less harmful to the environment.",
    "Sustainability doesn’t only benefit the environment; it can benefit the bottom line too. Overall, green consumerism is on the rise – 60% of UK and US consumers will pay more for products that are eco-friendly. This suggests that businesses who strive to make a truly positive difference can attract customers willing to spend more, whereas those who don’t may well lose them altogether.",
    "Additionally, taking action on sustainability can also increase the chances of attracting and retaining talent. In the UK, 26 per cent of workers said they would be willing to take a lower salary to work for a sustainable organization. That’s not all – half of those surveyed said they would actually consider declining a job offer from a company with harmful practices.",
    "There is a lot of research on the topic. A 2020 survey on the opinions of millennials across 43 countries revealed that the percentage of those who thought ‘reducing its impact on the environment is something their employer is doing well’ (61 per cent) was 22 per cent higher among those who intend to stay in their jobs for five or more years, compared to those expecting to move on fairly soon.",
    "Luckily, today sustainability for organizations across the world is less about ‘if’ and more about ‘how’. The positive news is that by making small changes and focusing on the details, businesses across all sectors can make a massive impact on the environment. All they have to do is take that first step forward, and the rest will follow."
  ],
  "headers": {
    "2": "The benefits of remote working",
    "5": "Recycle your tech",
    "10": "The benefits to be reaped"
  },
  "links": {
    "business": "https://www.techradar.com/best/best-small-business-software",
    "work from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "employees": "https://www.techradar.com/best/best-hr-software",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "smartphones": "https://www.techradar.com/news/best-business-smartphone",
    "business phone": "https://www.techradar.com/best/best-business-phone-system"
  }
}