{
  "source": "https://www.techradar.com/news/hps-two-day-flash-sale-is-offering-up-some-awesome-pre-prime-day-laptop-deals",
  "title": "HP's two-day flash sale is offering up some awesome pre-Prime Day laptop deals",
  "category": "computing",
  "updated": "2021-06-11T17:37:22Z",
  "author": "alex-whitelock",
  "summary": "Here are four particularly strong laptop deals",
  "article": [
    "While Amazon's Prime Day laptop deals are barely getting started in the leadup to the big day itself, HP is one of the many retailers looking to beat them to the punch with a quick-fire two-day flash sale.",
    "As of writing, there are currently 40 hours left to check out these discounted machines - and we recommend you do so because there are great options for both those on a budget and those with a little more cash to spend.",
    "So far, we think the strongest sale is probably on this 15.6-inch HP 15T for $679.99 (was $819.99). Now, we know that's pricey for a non-Spectre machine (more on that later), but this is a fantastic price for a laptop with a new 11th gen Intel Core i7 processor, 16GB of RAM, and a 256GB SSD. HP has always been known for solid workhorse machines, and this one's definitely delivering a huge amount of power for the money.",
    "We've picked out a few more of the strongest laptop deals in this pre-Amazon Prime Day sale just down below - including stunning sales on premium HP Spectre machines starting at just $899.99. If you'd like to read a bit more about the upcoming Amazon Prime Day event, then please feel free to check in and bookmark our main Prime Day deals page.",
    "Outside the US? See the best laptop deals in your region just below.",
    "Not found a machine to your liking? Get prepped for the upcoming Prime Day laptop deals coming later this month."
  ],
  "headers": {
    "5": "The best laptop deals in HP's two-day flash sale"
  },
  "links": {
    "two-day flash sale": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-6895152720966287000&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fslp%2Fweekly-deals%3Fjumpid%3Dma_weekly-deals_vp_na_1_210611",
    "for $679.99 (was $819.99)": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-8455968268600792000&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fhp-laptop-15t-dy200-2j130av-1",
    "starting at just $899.99": "https://www.awin1.com/awclick.php?awinmid=7168&awinaffid=103504&clickref=trd-us-5530512513918055000&p=https%3A%2F%2Fwww.hp.com%2Fus-en%2Fshop%2Fpdp%2Fhp-spectre-x360-laptop-13t-aw200-touch-9aj99av-1%3Fjumpid%3Dma_weekly-deals_product-tile_top-deals_19_9aj99av-1_hp-spectre-x360-conv",
    "Prime Day deals": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "Prime Day laptop deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-laptop-deals"
  }
}