{
  "source": "https://www.techradar.com/news/google-updates-website-builder-migration-tool-for-classic-sites-transition",
  "title": "Google updates website builder migration tool for Classic sites transition",
  "category": "computing",
  "updated": "2021-05-12T10:17:21Z",
  "author": "abigail-opiah",
  "summary": "Classic Sites Manager tool gets an upgrade",
  "article": [
    "As Google's website builder users spend the last four months transitioning to the new Sites experience, the tech giant has made a few tweaks to its Classic Sites Manager tool.",
    "In August last year, Google launched its Classic Sites Manager tool to help users with their migration process.",
    "Yesterday, the company added several new options to the Classic Sites Manager to help users manage the transition from classic Sites to the new Sites experience.",
    "With the new options, Classic Sites users with super admin status will have the ability to delegate admin-level Classic Sites Manager access to other users in their organization through a new assignable privilege. This update will allow users to do things like assign site owners or convert websites to the new Google Sites experience on behalf of their end users.",
    "Admins and site owners will have the ability to bulk delete and restore sites within the Classic Sites Manager, and they will also be allowed to bulk update ownership of sites from within the Classic Sites Manager.",
    "Google’s updated Classic Sites Manager will also allow admins to remove any sites that are no longer relevant within their domain.",
    "In a blog post, Google unveiled that for sites that have no owners, admins or delegated admins can now use the update owners action to assign ownership of sites to a point of contact in an organization who can make a decision on whether the website should be deleted or converted."
  ],
  "headers": {
    "3": "Google Sites Manager upgrade"
  },
  "links": {
    "website builder": "https://www.techradar.com/news/the-best-website-builder",
    "the last four months": "https://www.techradar.com/news/google-sets-hard-deadline-for-classic-sites-migration",
    "Google launched": "https://www.techradar.com/news/google-vault-to-support-website-builders-transition-from-google-sites",
    "blog post": "https://workspaceupdates.googleblog.com/2021/05/delegate-admin-level-access-to-the-classic-sites-manager.html"
  }
}