{
  "source": "https://www.techradar.com/news/this-tiny-fitness-tracker-slips-into-your-t-shirt-and-helps-prevent-running-injuries",
  "title": "This tiny fitness tracker slips into your T-shirt and helps prevent running injuries",
  "category": "fitness",
  "updated": "2021-07-29T15:05:59Z",
  "author": "cat-ellis",
  "summary": "The Incus Nova measures stats that your running watch can't",
  "article": [
    "If you've been thinking of picking up a new running watch, there's an alternative that you might want to consider first. The Incus Nova is a small device that, unlike most fitness trackers, is worn at the top of your spine, which allows it to track a different range of motion.",
    "The Incus Nova is designed for triathletes (Olympic gold medallist Alistair Brownlee is an advisor) and was first released as a swim tracker in November 2020. It's now received a major firmware update that turns it into an advanced run tracker as well, and cycling features are on the way in 2022.",
    "The new update not only lets the device measure distance, pace and session duration like a typical running watch, but also run/walk/rest breakdowns and elevation profile. More interestingly, the Incus Nova also tracks your running mechanics in a way that's not possible with a wrist-worn device, giving you detailed information on take-off acceleration, landing deceleration, flight time, ground contact time.",
    "Those stats are measurable with a running pod that attaches to your shoe, but the Incus Nova can also track metrics for both sides of your body so you can compare them in the mobile app, and is suitable for use with more than one sport.",
    "You're not just given raw numbers to interpret either; the Incus smartphone app processes the data, presents it in a way that helps you understand the strengths and weaknesses of your running form, and gives you guidance so you can take steps to improve it and reduce your risk of injury.",
    "You'll also be prompted to enter a pain score in the Incus app, so you can see how any ongoing injuries are affected by your training efforts and running style.",
    "There's no on-board GPS (instead the Incus Nova syncs via your phone), and the position of the device at the top of your spine means there's no heart rate monitoring, so you'll likely want to use either a running watch or a chest strap heart rate monitor as well. Smartwatch connectivity is coming to the Incus Nova soon, so you'll be able to connect all your running tech together.",
    "Prices start at £199.99 (about $280 / AU$380) for the tracker itself, together with accessories for either running or swimming. Dual-sport and tri-sport packs are also available. We're testing the Incus Nova's new running features right now, and will publish a full review soon.",
    "There's a wide range of running trackers out there, and choosing the right one can make a world of difference to your training. It's not just about budget – your goals and level of experience should determine your choice as well.",
    "Even if you're just starting out, it's a good idea to pick up a running tracker with GPS. Many cheap fitness trackers can track your runs, but do so via your phone's GPS receiver. It's acceptable for walks, but when you're getting into running (particularly if you're training for your first event) you'll want something more accurate. A watch with on-board GPS also means you can leave your phone at home while running (though it's a good idea to carry it anyway in case you need to contact someone in an emergency).",
    "The recently released Garmin Forerunner 55 is a particularly good choice for new runners. It's not the absolute cheapest watch around, but it's at the more affordable end of the market, and has a thoughtfully designed set of tools for beginners, including workout suggestions to help you mix up your training and avoid falling into a rut.",
    "More experienced runners will benefit from more advanced tools like navigation (many middle and higher end watches will allow you to download routes to your watch, with turn-by-turn directions that you can follow as you run), advanced training plans, and recovery guidance to help you optimize your workouts. Watches like the Polar Grit X also help you plan your nutrition and hydration strategy for longer events, helping you avoid 'bonking' mid-run.",
    "The Incus Nova fits into an interesting gap, and its practical tips could be useful to runners of any level. Not only is its guidance relevant to experienced athletes, beginners can use it to glean useful advice that could help them avoid developing injuries early on. Stay tuned to TechRadar to learn more about its features in our forthcoming review."
  ],
  "headers": {
    "6": "Understanding your form",
    "8": "Analysis: why the right running tracker matters"
  },
  "links": {
    "running watch": "https://www.techradar.com/best/running-watches",
    "Incus Nova": "https://www.incusperformance.com/",
    "fitness trackers": "https://www.techradar.com/best/best-fitness-trackers",
    "triathletes": "https://www.techradar.com/news/olympics-live-stream-how-to-watch-tokyo-2020-olympic-games-free-2021-dates-schedule-events",
    "heart rate monitor": "https://www.techradar.com/best/best-heart-rate-monitor",
    "Prices start at £199.99": "https://www.incusperformance.com/",
    "cheap fitness trackers": "https://www.techradar.com/best/best-cheap-fitness-trackers",
    "Garmin Forerunner 55": "https://www.techradar.com/reviews/garmin-forerunner-55",
    "Polar Grit X": "https://www.techradar.com/reviews/polar-grit-x"
  }
}