{
  "source": "https://www.techradar.com/news/why-alien-5-from-neill-blomkamp-didnt-happen-despite-sigourney-weavers-backing",
  "title": "Why Alien 5 from Neill Blomkamp didn't happen, despite Sigourney Weaver's backing",
  "category": "entertainment",
  "updated": "2021-09-02T09:50:58Z",
  "author": "samuel-roberts",
  "summary": "The studio ultimately didn't want it",
  "article": [
    "Director Neill Blomkamp (District 9, Chappie) has revealed the reason why his long-touted Alien movie, that was supposed to star Sigourney Weaver and a returning Michael Biehn, never went ahead. According to him, the movie studio's lack of interest killed the projects.",
    "In 2015, the director was reportedly making a proposed fifth Alien entry that would've featured Ellen Ripley and Hicks battling new forms of the creature – a sequel to Aliens, more than the other movies, which went in strange creative directions. Instead, Ridley Scott's flawed, nihilistic but somewhat interesting Alien Covenant would hit cinemas in 2017, which was more a sequel to messy prequel Prometheus.",
    "\"It was a case of both projects were moving forward at Fox simultaneously, and one of them was picked,\" Blomkamp told The Independent. \"Sigourney was unbelievably supportive and amazing.\"",
    "Indeed, while he had the backing of his potential star, it was Fox that didn't want to make it. \"She was always into the project, but Fox just clearly doesn’t want it. I haven’t had anything to do with that for years.\"",
    "Concept art from 'Alien 5' has still been filtering out on the project in recent months, suggesting a lot of pre-production work was done to prepare for the movie. It's clear from Blomkamp's tone, though, that he considers the project completely dead.",
    "Blomkamp's most recent project is the low-budget Demonic, which he shot during the pandemic last year.",
    "Next up in the Alien franchise is a TV show from Fargo creator Noah Hawley, which will focus on class warfare in that universe, and be set on Earth. It sounds promising – and since it's coming to the cable network FX, which has an amazing track record with shows like Legion, Devs, Mrs America, Atlanta and many more, we're optimistic that will give the series a shot in the arm.",
    "Alien is a film franchise that's always suffered from an identity crisis. This was written into the DNA of the movies as soon as James Cameron made Aliens in 1986: you had a first movie that was essentially a monster film in space, and a follow-up that was a large-scale action movie swapping scares for thrills.",
    "Both are among the best movies ever made in their respective genres – but they proved a tough act to follow, and subsequent movies tried to put their own spin on what an Alien film looks like. Not being tied to one single genre arguably resulted in some muddled installments over the years.",
    "Hence the pseudo-religious themes and prison setting in Alien 3, or the weird vibes of the 'new' cloned Ripley in Alien Resurrection. Is Ripley the point of a story set in this universe? Does it matter what the film is as long as there are xenomorphs present? It's always been a push and pull between bits of the movie iconography, and the directors' intent. Prometheus and Alien Covenant have their own specific flavor, too, which is somewhat compatible with Ridley Scott's Alien, but also dense with their own pointless mythology.",
    "A back-to-basics approach is needed – and perhaps a change of medium, too. You wonder what more exciting, fresher directors could do with an Alien movie, but they simply haven't had their chance. For now, a TV show from a creator with a solid track record is a good starting point for its long-term health."
  ],
  "headers": {
    "6": "Analysis: Alien's future belongs on the small screen...for now"
  },
  "links": {
    "The Independent": "https://www.independent.co.uk/arts-entertainment/films/features/neill-blomkamp-alien-5-interview-demonic-b1905227.html",
    "TV show from Fargo creator Noah Hawley": "https://www.techradar.com/news/alien-tv-show-in-the-works-from-fargo-creator-noah-hawley"
  }
}