{
  "source": "https://www.techradar.com/news/samsung-teaser-suggests-galaxy-z-fold-3-will-be-the-star-announcement-on-august-11",
  "title": "Samsung teaser suggests Galaxy Z Fold 3 will be the star announcement on August 11",
  "category": "phones",
  "updated": "2021-07-20T08:44:45Z",
  "author": "james-rogerson",
  "summary": "Are you ready to unfold?",
  "article": [
    "We’re getting very close to August 11 – the date when Samsung is expected to unveil the Samsung Galaxy Z Fold 3, the Galaxy Z Flip 3, the Galaxy S21 FE, the Samsung Galaxy Watch 4 range, and the Samsung Galaxy Buds 2. Of those though it looks as if the foldables will be what Samsung is most focused on, if a leaked teaser is anything to go by.",
    "Ishan Agarwal (a leaker with a good track record) shared a GIF with MySmartPrice, which is apparently an official teaser for the event. The teaser appears to show light emerging from a phone as its screen opens out, so if there was still any doubt that we’d see foldable phones at the event, that should reassure you.",
    "Based on the way the phone is opening it looks like this is probably the Samsung Galaxy Z Fold 3, though as mentioned we’re also expecting to see the Samsung Galaxy Z Flip 3.",
    "While the teaser itself contains no text, Agarwal claims that the tagline for the event is “Get Ready to Unfold”, so assuming this is genuine it’s clear not only that foldable phones will be present, but that they’ll likely be the focus for Samsung.",
    "Agarwal also states that the date and time of the launch will be 7am PT / 10am ET / 3pm BST on August 11 (which is midnight AEST on August 12), but that was already expected, as previously a promo image had leaked with the same details.",
    "As with many launches though there might not be many surprises, as all of the expected gadgets have been extensively leaked already, and you can click the links above for each device to read everything we’ve heard so far.",
    "With a few weeks left until launch we’d imagine plenty more will leak as well, so stick with TechRadar for all the news and rumors, and head back on the big day for our full coverage of the announcements."
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy S21 FE": "https://www.techradar.com/news/samsung-galaxy-s21-fan-edition",
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Samsung Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Ishan Agarwal": "https://twitter.com/ishanagarwal24/status/1417327892208373762",
    "MySmartPrice": "https://www.mysmartprice.com/gear/exclusive-samsung-galaxy-unpacked-2021-august-11-leaked-official-invite/",
    "a promo image": "https://www.techradar.com/news/heres-more-evidence-samsung-is-unveiling-its-new-foldables-and-watches-on-august-11"
  }
}