{
  "source": "https://www.techradar.com/news/the-software-developer-is-changing-and-so-is-their-workflow",
  "title": "The software developer is changing – and so is their workflow",
  "category": "computing",
  "updated": "2021-08-08T10:25:24Z",
  "author": "malcolm-ross",
  "summary": "The evolving role of the software developer in the era of low-code",
  "article": [
    "What does a software developer do? That’s easy: they develop apps and software, right? It’s no longer that simple. Whereas before developers were reserved to handle writing software - a specialist skill - now they are expected to collaborate more with the business. And that requires communicating and better understanding various aspects of the business in which they operate.",
    "The business / IT landscape is changing. Developers now need to communicate projects in a clear and easily digestible way, and they need to collaborate with people far beyond the boundaries of the IT function. Fortunately, there are tools that facilitate that collaboration, and they’re changing the face of coding forever.",
    "But why is this change happening? Firstly, there is widespread disillusionment among companies who have invested heavily into custom software that either takes too long to come to fruition or takes too long to deliver value. I know of companies that spent hundreds of millions of dollars on projects that took years to build, only to be underwhelmed when they were finally completed.",
    "Businesses are right to be unhappy when such a major investment doesn’t deliver in the way it’s promised. The worst part is that it’s often too late to right the ship when the software is ready because the company stakeholders didn’t have enough visibility of the development journey as it happened.",
    "It’s true that the ability to deliver software projects faster is increasing all the time. Look at agile, for example. The use of agile development techniques over the past decade has brought software to users more quickly by working in shorter sprints and driving iterative improvements. However, agile doesn’t do enough to tackle the fundamental problem at the heart of successful software delivery, which is expressing logic.",
    "Profitable software isn’t just about time to market, it’s also vital that the business is able to express what it wants and the developer is able to express how they are delivering against it. And, with companies relying increasingly on software to run their business, a developer’s ability to speak the language of business, rather than just technology, is important.",
    "A traditional software developer needed to master the art of creating IT solutions through in-depth knowledge of .NET or Java. A modern software developer also needs to know how the business works, the latest regulations and compliance mandates in their country, region and industry, and so much more. This makes software development more complex and a team sport that requires multiple inputs. Fortunately, all parties involved in the delivery of a project can now sing from the same hymn sheet that everyone understands.",
    "Developers and even business analysts with little programming experience can now use low-code automation to create and implement software without being an expert in the programming language.",
    "Low-code is a visual approach to software development. It abstracts and automates the application development lifecycle, and reduces the reliance on traditional coding by developers. Now, tools to create applications are even more accessible to non-coders to create high impact business software applications.",
    "But if low-code has helped the entire business to see under the magician’s cloak, is the role of a software developer becoming obsolete? The role of the developer will evolve, as opposed to disappearing altogether. Whereas before, they would be isolated and largely involved in the tactical work of developing products for the business, developers can now be better integrated and more strategic.",
    "And while .NET and Java will continue to run software applications, a low-code automation platform will increasingly become the preferred tool. This will make coding faster and more collaborative, which is good news for everyone.",
    "Low-code isn’t a new approach, but the massive drive towards digital transformation proved to be a catalyst in recent years. According to Gartner, 75% of large enterprises will be using at least four low-code development tools for both IT application development and citizen development initiatives by the end of 2025. Adoption of low-code automation is increasing and the people responsible for developing the software will evolve just as quickly.",
    "The change in software development and the increased reliance on digital tools across many businesses contributes to the rise of the business technologist. This is significant because technology decisions will now be better understood during development, not just after deployment. Meanwhile, developers will focus more on delivering business outcomes via technology, instead of being bogged down with the heavy responsibility of arduous line-by-line coding.",
    "This is a collision or harmonization of worlds that used to exist in parallel. Now, the application development procedure has the synergies it needs to put the outcomes first without being hindered by logistics. Low-code means the code itself won’t get in the way and so the entire business can understand the process and be involved with improving the software and making it fit the objectives from the outset. The IT management team is now very much a part of the business. Now that everyone can speak the same language, nothing gets lost in translation, and everyone has clear visibility of the project at every stage.",
    "With everything changing so quickly, where should a developer start? Well, a vital part of seeing the benefits of low-code automation is to experience it first-hand. Some will be skeptical initially, but this isn’t just a change to coding; it’s a change to how technology relates to the rest of the business. This change is inevitable; we’ve known for years about the inefficiency of developing software in isolation. Everyone wins in a world where applications get to market faster.",
    "Low-code is expected to go from a niche delivery method to the development mode of choice in enterprise this year. The ability to work in this new way will position developers and IT teams to gain relevance in key company functions. It’s time for the wider business to get involved in developing applications. That’s a win-win all round."
  ],
  "headers": {
    "2": "The appetite for change",
    "6": "All hands on deck",
    "9": "New tools, new possibilities",
    "12": "Getting a seat at the table",
    "14": "Experimenting with change"
  },
  "links": {
    "develop apps": "https://www.techradar.com/best/best-mobile-app-development-software",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "business": "https://www.techradar.com/best/best-small-business-software",
    "coding": "https://www.techradar.com/best/best-school-coding-platform",
    "digital transformation": "https://www.techradar.com/how-to/what-is-digital-transformation",
    "IT management": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}