{
  "source": "https://www.techradar.com/news/many-it-workers-would-take-a-pay-cut-to-wfh-permanently",
  "title": "Many IT workers would take a pay cut to WFH permanently",
  "category": "computing",
  "updated": "2021-09-06T12:22:44Z",
  "author": "sead-fadilpasic",
  "summary": "On average, they'd accept an 8% pay cut",
  "article": [
    "Many IT professionals would happily take a pay cut to indefinitely remain in a remote working setup, a new report has claimed.",
    "Research from financial solutions provider Hitachi Capital UK found that being able to spend more time with their families, as well as being able to balance household and family responsibilities with work are the key motivators for most employees, while office socialization seems to be one of the rare things they’d miss about office life.",
    "That is also why a flexible arrangement, in which the employees choose which days of the week they’d spend in the office, seems to be the most popular choice overall.",
    "The company polled 1,000 office workers in the UK and found that 27% would accept a pay cut to permanently stay working from home. On average, workers would be happy to accept an 8% cut, while some would even accept up to 20%.",
    "Across the full range of different industries, those working in media and leisure were most willing to take a pay cut in order to remain remote, while those working in finance and legal were least happy to do so.",
    "Perhaps surprisingly, the workers most interested in this arrangement also appear to be the lowest-earning ones (a third of those bringing in less than $55,000 a year, compared to 20% of those earning $55,000 and more).",
    "What’s more, the younger the workforce, the more popular the home working arrangement is. Almost two in five (39%) of Gen Z-ers want a permanent full-time position, compared to 16% of millennials. But it’s the millennials who would mostly consider a pay cut (35%), followed by over 55s (25%).",
    "Almost a third (31%) would miss office socialization.",
    "Location plays a major role in employee sentiment towards remote working, the report further claims, stating that for those in Scotland, socializing is the biggest factor for returning to the office (32%). On the other end, 50% of workers in the North East would love to remain remote, as it offers greater productivity.",
    "“The pandemic has led to a seismic shift in the way people want to work in order to effectively manage their work and home life commitments. It’s clear that the majority of employees have adapted very well to remote working whilst actually enhancing productivity,\" noted Theresa Lindsay, Group Marketing Director at Hitachi Capital UK.",
    "“Moving forward, our research clearly shows that the clamour for flexible working is so pronounced that many employees are even prepared to sacrifice their salary to achieve a better work-life balance in the long term...it’s clear that employers can also seize the opportunity to tap into the wider talent pool which has transpired through greater flexibility- not only to realise their own growth ambitions but which also supports workplace diversity and inclusion.”"
  ],
  "headers": {
    "5": "Missing water cooler chat"
  },
  "links": {}
}