{
  "source": "https://www.techradar.com/news/theres-a-new-ps5-model-for-sale-so-whats-different",
  "title": "There's a new PS5 model for sale – so what's different?",
  "category": "gaming",
  "updated": "2021-08-30T01:51:22Z",
  "author": "gerald-lynch",
  "summary": "Sony’s put the PlayStation 5 on a diet",
  "article": [
    "It’s not even a year old yet, but already Sony appears to have released a new PS5 model with some revised specifications.",
    "Following our earlier report on a Japanese retailer listing that revealed the potential existence of a tweaked PS5, Australia’s Press Start has tracked down the console on shelves.",
    "And though earlier reports suggested changes were only going to affect the Digital Edition of the console, it now seems the PS5 Disc Edition has seen similar changes.",
    "The new PS5 comes with a new serial number, so if you’re looking to pick one up, you’re going to need to look for the CFI-1102A designation, rather than the original’s CFI-1000.",
    "While we’re yet to confirm all the changes to the revised PS5 ourselves, here’s what we know so far about the new PlayStation 5 from the reports we’ve seen.",
    "The most useful change comes to the base plate screw for the consoles – the removable tie that lets you move the stand to orientate the console in horizontal or vertical positions. Where the original console’s screw required a screwdriver to remove, the newer machines instead have a screw you can adjust by hand, making for a much easier adjustment.",
    "Also, fascinatingly, the revised models have seen a reduction in weight by up to 300g according to reports. That’s a significant chunk, and where exactly the saving has been made remains to be seen. But it’s a promising improvement so early in the console’s lifecycle for anyone holding out hope for a PS5 Slim edition at some point in the future.",
    "A revised model also should give hope to those still trying to buy a PS5. It suggests manufacturing efficiencies have been made by Sony, perhaps leading to a more consistent supply of stock moving forward.",
    "We’ve contacted Sony’s representative’s to see if we can get the exact details of what’s changed with the new PS5 machines, and will update this story if and when they reply."
  ],
  "headers": {
    "4": "Analysis: What’s different in the new PS5? And how can it help those still looking for the console?"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "a Japanese retailer listing": "https://www.techradar.com/news/a-lighter-ps5-is-coming-according-to-a-japanese-retailer-listing",
    "Press Start": "https://press-start.com.au/news/playstation/2021/08/21/new-ps5-model-cfi-1102a-australia/"
  }
}