{
  "source": "https://www.techradar.com/news/photoshop-finally-gets-invite-to-edit-button-for-easy-remote-collaboration",
  "title": "Photoshop finally gets 'invite to edit' button for easier remote collaborations",
  "category": "cameras",
  "updated": "2021-02-10T11:30:29Z",
  "author": "mark-wilson",
  "summary": "Get a remote helping hand with your edits",
  "article": [
    "Photoshop has finally been updated with a new 'invite to edit' function that lets you remotely edit the files of co-workers and friends – whether they're on desktop, iPad or iPhone.",
    "The new feature has arrived as part of a wave of Adobe updates to its main Creative Cloud apps, including Photoshop, Illustrator and Fresco. All three of those apps now have the new 'invite to edit' feature, but its long-awaited arrival on Photoshop is the biggest news for photographers.",
    "There are a couple of limitations – the new function is technically called 'asynchronous editing', which means you can't edit a file at the same time as someone else. All collaborators will also need to be signed up to Creative Cloud, as this is where the files are saved.",
    "Still, it's a potentially very handy new feature for teams who have been dispersed far and wide by the pandemic, or photographers who simply want a remote helping hand from a friend.",
    "Because Photoshop cloud files support 'version history', you'll also be able to roll back any remote edits that are made. On desktop, you can see this in either File > Version History, or Window > Version History, where you'll find the option to 'revert to this version'.",
    "So how do you get the new 'invite to edit' function and how does it work? Once you've updated Photoshop to the latest version 22.2, the option will appear in the top right-hand corner of the app next to the search magnifying glass.",
    "If you want someone to make tweaks to your file, click that button and type in the email addresses of everyone you want to invite to the file. This will only work with cloud-based files – if you have a non-cloud document, you'll need to save it as a cloud by going to 'save as cloud document'.",
    "Like Google Docs, you can also add an extra note to the recipients at this stage – once you're done, just click the 'invite to edit' button to send the invitation.",
    "This new 'asynchronous editing' feature is part of a wider push from Adobe to boost the cloud functionality of its apps – and while it feels a little late in the day, given long we've been used to remote collaborative editing in the likes of Drive and Dropbox, it is a very welcome first step towards more powerful remote editing tools."
  ],
  "headers": {
    "5": "How to use 'invite to edit'"
  },
  "links": {
    "Photoshop": "https://www.techradar.com/reviews/adobe-photoshop-cc-2019"
  }
}