{
  "source": "https://www.techradar.com/news/ipad-pro-11-2022-could-get-a-major-screen-upgrade",
  "title": "iPad Pro 11 (2022) could get a major screen upgrade",
  "category": "tablets",
  "updated": "2021-07-09T10:33:01Z",
  "author": "james-rogerson",
  "summary": "No change to the 12.9",
  "article": [
    "This year Apple did an unusual thing with its iPad Pro range, as it equipped the iPad Pro 12.9 (2021) with a fancy new Mini LED screen, but left the iPad Pro 11 (2021) with just an LCD one like its predecessors. Next year though, it sounds like the 11-inch model could get this upgrade too.",
    "That’s according to a research note from Ming-Chi Kuo (an analyst with a great track record for Apple information), seen by iMore, in which Kuo claims that the next models of both the iPad Pro 11 and the iPad Pro 12.9 will have a Mini LED display.",
    "Mini LED allows for better contrast and darker blacks than a typical LCD screen, so it’s a definite upgrade, but it’s also a pricey one. Kuo says that Apple is investing in more Mini LED suppliers, which could bring the cost of this screen type down, and make it more viable for Apple to use Mini LED in a greater range of products.",
    "Given that this report also mentions 11-inch and 12.9-inch screen sizes, it sounds like the rumored bigger iPad Pro models probably won’t land before 2023.",
    "In fact, 2023 could be a big year for the iPad Pro range, as it’s also possible that Apple will switch to OLED for its premium slates, though there’s some disagreement over when that will actually happen.",
    "For now though it sounds like next year’s models might not be too much of an upgrade – other than this possible change of screen type for the 2022 iPad Pro 11. Of course, it’s very early for information about these slates, and anything could happen between now and launch."
  ],
  "headers": {
    "3": "No change in size"
  },
  "links": {
    "iPad Pro 12.9 (2021)": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "iMore": "https://www.imore.com/11-inch-ipad-pro-get-mini-led-display-next-year-says-kuo",
    "bigger iPad Pro models": "https://www.techradar.com/news/future-ipad-pro-tablets-could-be-even-bigger-than-they-currently-are",
    "Apple will switch to OLED": "https://www.techradar.com/news/apples-2022-ipad-could-bring-a-major-screen-improvement",
    "when that will actually happen": "https://www.techradar.com/news/first-oled-ipad-might-not-arrive-until-2023",
    "2022 iPad Pro 11": "https://www.techradar.com/news/new-ipad-pro-2022"
  }
}