{
  "source": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
  "title": "Apple Watch 7 release date, price, features, specs and news",
  "category": "wearables",
  "updated": "2021-10-13T20:44:20Z",
  "author": "james-rogerson",
  "summary": "The Apple Watch 7 is official, and you can buy it soon",
  "article": [
    "The Apple Watch 7 launched on September 14 at the Apple event alongside the iPhone 13, bringing the first redesign to Apple's smartwatch line. The Apple Watch 7 release date is set for October 15 and you can now pre-order the watch too.",
    "What's more we've been testing this model for over a week now, and you can read all about it in our Apple Watch 7 review.",
    "The Apple Watch 7 has a refined look that retains the rounded edges but with thinner bezels for 20% more screen area than the Apple Watch 6 – and new sizes of 41mm and 45mm.",
    "Technically, this is the first big redesign since the Apple Watch 4 expanded to the 40mm and 44mm sizes, but it's not as drastic a redesign as we were expecting.",
    "While rumors had us expecting a more radical redesign to a flat-edged look like the iPhone 13, we're still in round-edge territory, albeit it with even curvier glass.",
    "There also aren't any new health tracking features – it looks like we'll have to wait for next year's Apple Watch 8 for the rumored blood pressure and glucometer sensors. And while the Apple Watch 7 reportedly has a new chipset, it seems this isn't really an upgrade on the one in the Apple Watch 6.",
    "The Apple Watch 7 does get a 70% brighter always-on display while indoors, IP6X dust resistance, the same WR50 water resistance as prior models, and more durability. The battery is the same (18 hours expected, but we found around 26 hours in regular use), but recharges 33% faster.",
    "Ultimately, the Apple Watch 7 has incremental improvements rather than revolutionary changes, but it's still the best Apple Watch you can buy.",
    "The Apple Watch 7 debuted on September 14, and it'll be on sale on October 15. That's a long wait between reveal and on sale, but we've yet to hear why the company delayed its release.",
    "Pre-orders are now live around the world, if you want to snap up the new smartwatch. One analyst has told TechRadar that they expect low supply for watches, so you'll want to act quickly if you plan to snap up the new smartwatch.",
    "It comes in the expected small and large sizes, though they've been slightly expanded to 41mm and 45mm.",
    "The Apple Watch 7 price starts at $399 / £369 / AU$599 for the 41mm variant and rises to $429 / £399 / AU$649 for the 45mm. If you want a cellular version, the 41mm costs $499 / £469 / AU$749 and the 45mm costs $529 / £499 / AU$799.",
    "There are also Apple Watch Nike Edition and Hermes variants of the Series 7, and that'll see the price go up quite dramatically.",
    "It's offered in five new aluminum finishes: midnight (black), starlight (gray), green, blue, and (PRODUCT)RED. There are also three new Nike Sport Loop colors, as well as new Apple Watch Hermès bands.",
    "While rumors suggested the Apple Watch 7 would have a flat-edged design much like the iPhone 13, Apple stuck with the round-edged look. However, with thinner 1.7mm bezels than the Apple Watch 6, the new smartwatch has 20% more screen area.",
    "That larger screen size also comes with slight size increases in this year's Apple Watches – up to 41mm and 45mm, though the smaller bezels mean the actual size isn't too much bigger. There are slight improvements to the display, too, which is up to 70% brighter indoors in always-on mode than the screen on its predecessor.",
    "The screen is also big enough to feature a full QWERTY keyboard, which can be typed or tapped-and-dragged to form words with a technology called QuickPath. While third party apps have done keyboard typing before, this is the first time it's included by Apple itself - and in our testing, it seemed to work pretty well indeed (which was rather surprising, given how small it is).",
    "Apple also claims its new smartwatch is more durable, packing a display with 'robust geometry' and 'over 50 percent thicker' front glass than that on the Apple Watch 6. It also has an IP6X dust resistance rating to add to the WR50 water resistance rating featured in prior Apple Watches - meaning it can be submerged up to 50 meters deep.",
    "Apple didn't have anything to announce about the Apple Watch 7's specs, which made us think it had the same Apple S6 chipset and 1GB of RAM with 32GB storage that debuted in the Apple Watch 6.",
    "However, it packs the 'new' S7 chipset inside, although it brings no more power, and is merely redesigned to fit into the new chassis, with 32GB of onboard storage too.",
    "Apple went out of its way to say the new watch has the same 18-hour battery life as its predecessor, suggesting it likely has the same 304mAh battery as in the Apple Watch 6.",
    "But the watch does come with a more advanced charger for 33% faster charging, juicing up from 0% to 80% in 45 minutes - and we actually clocked it running up the charge quicker than that.",
    "An eight-minute charge meanwhile can supposedly provide eight hours of sleep tracking - although we couldn't mimic that in our testing, with more like 15 minutes needed to get a really safe night's slumber.",
    "Frustratingly, the new faster-charging cable (which does come in the box) doesn't have a charging block in with it - and the fact it's USB-C means most of you won't have the relevant charger kicking around.",
    "So it's a trip to the Apple Store (or Amazon) to get another... so bake that into the cost of purchase.",
    "The Apple Watch 7 has the same sensor suite as its predecessor, meaning those rumors about glucometers and blood pressure sensors didn't turn out to be true.",
    "But the smartwatch still has an impressive array of health monitoring features to track ECG, blood oxygen levels, heart rate, and plenty of other metrics.",
    "The Apple Watch 7 also launches with watchOS 8, which comes with the new Mindfulness app (and overhauled and updated Breathe app from years gone by), standalone software that also includes meditation sessions from Fitness Plus in audio-only form.",
    "On the software side there are improvements for cyclists too, with cycling fall detection being offered, along with improved calorie calculations for e-bikes.",
    "The Apple Watch 7 launches with watchOS 8, which is already available on older smartwatches. This will come with watchOS 8 already ready and waiting, and we'd expect Apple to update it for many years to come with future software upgrades.",
    "Highlights include a new Mindfulness app (which will incorporate the Breathe app), the addition of Tai Chi and Pilates to the Workout app, the ability to track respiratory rate while you sleep, and a redesigned Photos app.",
    "That sits on top of an already-excellent operating watchOS system that brings things like noise monitoring, automatic handwash timers and more. We'll be digging more into what the new Watch 7 brings in an imminent update to this article - but if you can't wait that long, another reminder to check out our Apple Watch Series 7 review. It's good, we promise..."
  ],
  "headers": {
    "8": "Apple Watch 7 release date and price",
    "14": "Design and display",
    "18": "Specs and battery",
    "25": "Health and fitness",
    "29": "Software: watchOS 8"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Apple Watch 7 review": "https://www.techradar.com/reviews/apple-watch-7",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch 4": "https://www.techradar.com/reviews/apple-watch-4-review",
    "has told TechRadar": "https://www.techradar.com/news/pre-order-an-apple-watch-7-tomorrow-or-risk-waiting-until-next-year-analyst-says",
    "watchOS 8": "https://www.techradar.com/news/watchos-8-update",
    "improvements for cyclists": "https://www.techradar.com/news/the-apple-watch-7-finally-gets-cycling-right",
    "Apple Watch Series 7 review": "https://www.techradar.com/reviews/apple-watch-7"
  }
}