{
  "source": "https://www.techradar.com/news/evidence-mounts-the-samsung-galaxy-watch-4-will-run-wear-os",
  "title": "Samsung Galaxy Watch 4 looks almost certain to run Wear OS",
  "category": "wearables",
  "updated": "2021-03-31T10:04:33Z",
  "author": "axel-metz",
  "summary": "Internal affairs",
  "article": [
    "Hidden code buried in the latest version of the Galaxy Wear app has given the best hint yet that the Samsung Galaxy Watch 4 will run Google's Wear OS watch software, rather than Samsung's Tizen.",
    "While we reported on similar leaks back in February, this latest revelation further substantiates the expectation that Samsung’s next wearable will arrive running Google's Android operating system.",
    "The code was spotted by tech writer Max Weinbach, who shared a tweet detailing various codenames including “water”, which he believes to be a reference to the Wear OS compatibility of Samsung’s upcoming watches.",
    "In the same tweet, Weinbach refers to further codenames “fresh” and “wise”, which he suggests each represent the new watches that Samsung could release between April and June.",
    "Those watches are expected to be the Galaxy Watch Active 4 and Galaxy Watch 4, successors to the Galaxy Watch Active 2 and Galaxy Watch 3, respectively, which both run Tizen. We’ve already heard mutterings that the Active model would skip a numeric generation in 2021, so this latest rumor adds more fuel to that fire.",
    "Despite the success of using Tizen in its existing wearables range, Samsung may be opting to switch to Wear OS given its potentially superior app support and wider choice of watch faces. Even so, there aren’t a whole lot of top-tier Wear OS smartwatches on the market right now – save for the likes of the Fossil Gen 5 and the TicWatch Pro 3 – so it’ll be interesting to see whether the next Galaxy wearables truly benefit from the change.",
    "A new OS isn’t the only change expected of the new Galaxy smartwatches watches, though.",
    "In the same tweet, Weinbach makes reference to a \"merlot\" codename, which he believes could be a nod to the chipset used to power both devices.",
    "The Galaxy Watch 3 didn’t make leaps and bounds with its chipset, using the same internals as the original Galaxy Watch, so it seems high time for Samsung to improve both the chipset and RAM capacity of its next offerings.",
    "While there might be big changes on the way when it comes to software and hardware, we also know, thanks to Twitter leaker @chunvn8888, that there’ll be relatively few design changes with Samsung’s next wearables. According to the leak, the Galaxy Watch 4 will have the rotating bezel of its predecessors, while the Galaxy Watch Active 4 will go without.",
    "You can’t have it all, I guess.",
    "Via PhoneArena"
  ],
  "headers": {
    "6": "Not just a pretty face"
  },
  "links": {
    "Samsung Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "reported on": "https://www.techradar.com/news/samsung-galaxy-watch-4-could-switch-back-to-wear-os",
    "Max Weinbach": "https://twitter.com/MaxWinebach/status/1376655829458280448",
    "Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch Active 2": "https://www.techradar.com/reviews/samsung-galaxy-watch-active-2-review",
    "Galaxy Watch 3": "https://www.techradar.com/reviews/samsung-galaxy-watch-3-review",
    "Fossil Gen 5": "https://www.techradar.com/reviews/fossil-gen-5-smartwatch",
    "TicWatch Pro 3": "https://www.techradar.com/reviews/ticwatch-pro-3",
    "@chunvn8888": "https://twitter.com/chunvn8888/status/1371836296881131531",
    "PhoneArena": "https://www.phonearena.com/news/samsung-will-reportedly-replace-tizen-with-wear-os-on-new-watches_id131140"
  }
}