{
  "source": "https://www.techradar.com/news/the-elder-scrolls-6-release-date-could-be-years-away",
  "title": "The Elder Scrolls 6 release date could be years away",
  "category": "gaming",
  "updated": "2021-06-30T09:26:47Z",
  "author": "rhys-wood",
  "summary": "You’ll have to stick to Skyrim for now",
  "article": [
    "The Elder Scrolls 6 could still be a few years away, according to Bethesda Games Studios director Todd Howard, who has confirmed that the next chapter in the open-world fantasy saga is still in the early stages of development.",
    "Howard told the Telegraph that: \"It’s good to think of The Elder Scrolls 6 as still being in a design [phase]… but we’re checking the tech: 'Is this going to handle the things we want to do in that game?' Every game will have some new suites of technology so Elder Scrolls 6 will have some additions on to Creation Engine 2 that that game is going to require.”",
    "It’s likely that we won’t get to play The Elder Scrolls 6 for at least a few more years, then, if Howard’s statement is to be taken at face value, with the game still being in the conceptual stages, and the team at Bethesda Game Studios still getting to grips with the new Creation Engine 2, the same engine powering Starfield which is due to release late next year.",
    "The Elder Scrolls 6 was first announced all the way back in 2018, during Bethesda’s E3 press conference that year. Outside of the sparse announcement trailer, little to nothing has been revealed about the game since. We now know why: The Elder Scrolls 6’s development cycle is still very much in some of its earliest stages.",
    "Don’t expect any substantial info on The Elder Scrolls 6 – such as CG trailers or gameplay showcases – to be revealed before the launch of Bethesda’s next big adventure, Starfield, which releases on November 11, 2022. Fun fact: that’s 11 years to the day since The Elder Scrolls 5: Skyrim originally launched.",
    "At the very least, it’s pleasing to hear that Bethesda is seemingly taking its time with The Elder Scrolls 6. While that initial teaser trailer for the game may have been a touch premature, we’re happy to wait as long as is needed for Bethesda to ensure its high quality – and hopefully stomp out the litany of bugs that plagued the likes of Skyrim and Fallout 76 before it."
  ],
  "headers": {
    "3": "The Eldest Scrolls"
  },
  "links": {
    "The Elder Scrolls 6": "https://www.techradar.com/news/elder-scrolls-6-release-date-news-and-rumors",
    "Telegraph": "https://www.telegraph.co.uk/gaming/news/first-pitched-game-lucas-2009-todd-howard-talks-indiana-jones/",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news"
  }
}