{
  "source": "https://www.techradar.com/news/will-dune-and-foundation-give-space-opera-its-lord-of-the-rings-moment",
  "title": "Will Dune and Foundation give space opera its Lord of the Rings moment?",
  "category": "entertainment",
  "updated": "2021-08-21T13:00:09Z",
  "author": "richard-edwards",
  "summary": "Opinion: a pair of big-budget adaptations are about to propel classic sci-fi literature into the mainstream",
  "article": [
    "Thanks to its once-every-four-years status, there’s always been something a little odd about February 29. The 2004 vintage was even more unconventional than usual, however, because of what happened at that year’s Academy Awards.",
    "The Return of the King, the third and final movie in Peter Jackson’s epic adaptation of JRR Tolkien’s The Lord of the Rings, took home a whopping 11 Oscars, equalling a record previously set by Ben-Hur and Titanic. As well as being just the second sequel in history (after The Godfather Part II) to claim Best Picture, it was particularly notable because the Academy – traditionally rather conservative in its tastes – had wholeheartedly embraced epic fantasy for the first time.",
    "While the Oscars haven’t jumped on the high-fantasy wagon train since – the closest Best Picture voters have come is Guillermo del Toro’s fishy love story, The Shape of Water – Peter Jackson’s victory was something of a game-changer. Nearly two decades on, big-budget screen versions of epic fantasy novels are commonplace, from the all-conquering Game of Thrones, through to Netflix’s The Witcher, Shadow and Bone, and the short-lived Cursed. Amazon’s also taking a new shot at Tolkien with an implausibly big-budgeted adventure set during the Second Age of Middle-earth.",
    "Things are rather different, however, in the many worlds of space opera, where fantasy’s planet-hopping cousin is still waiting for the sort of Lord of the Rings-type moment that can turn classic novels into big players on screen.",
    "There’s clearly a huge appetite for space-set action in movies and TV, whether it’s Star Wars, Guardians of the Galaxy, or one of the numerous Star Trek TV shows – whether you want cute green alien sidekicks, bunches of a-holes, or copious amounts of boldly going, you’re very well covered.",
    "But when it comes to adaptations of classic science fiction authors – SF’s answers to JRR Tolkien and George RR Martin – Hollywood has a massive blind spot. In fact, at present, The Expanse is the highest profile take on a series of space-set novels.",
    "Amazon’s take on James SA Corey’s book series is brilliant – the closest thing to a new Battlestar Galactica – yet its appeal is way too cult to follow Game of Thrones into zeitgeist-grabbing crossover territory. Indeed, The Expanse was cancelled after three seasons by original network Syfy when it didn’t attract a big enough audience, leaving Amazon Prime Video to step in and continue the story – it doesn’t hurt when Jeff Bezos, a man rich enough to take a trip into orbit, is reportedly a fan.",
    "Change may be afoot, however, now that a pair of prestige adaptations of classic sci-fi novels are poised to catapult book-inspired space opera into the mainstream.",
    "Frank Herbert’s Dune is allegedly the best-selling science fiction novel of all time, and undoubtedly one of the most influential. Featuring a desert world, a chosen one and an evil dynasty in need of overthrowing, it shares plenty of DNA with Star Wars, yet Dune’s association with the screen is rather less glorious. David Lynch (who was once in contention to direct Return of the Jedi) famously disowned his 1984 adaptation, and though it’s nowhere near as bad as some make out, you do have to look past some rushed storytelling and the fact that the effects of the era can’t match the ambition of the epic novel. There was also a mini-series made for the Sci-Fi Channel (now Syfy) in the early 21st century.",
    "Dune 2021, however, should see the story given the sort of loving treatment The Lord of the Rings trilogy received under Peter Jackson’s watch. At the helm is Denis Villeneuve, a director with undeniable sci-fi credibility from his work on Arrival and Blade Runner 2049, and he’s brought on board a truly A-list cast including Timothée Chalamet, Rebecca Ferguson, Oscar Isaac, Zendaya, Josh Brolin and Stellan Skarsgård.",
    "Crucially, Warner Bros is throwing serious quantities of cash at the movie, and splitting the book across two films to give the story the chance to breathe. This all adds up to one of the big-hitters of science fiction literature being given the respect it deserves. There’s also an HBO Max TV series spin-off, The Sisterhood, in the works.",
    "By the time Dune lands in cinemas (and HBO Max in the US), we’ll already be several episodes into Foundation on Apple TV Plus. From Servant to The Morning Show and For All Mankind, Apple has established itself as a destination for big-budget, prestige TV, and it’s clearly pulling out all the stops to bring Isaac Asimov, one of the godfathers of science fiction, to the screen.",
    "While Foundation’s cast isn’t as high-profile as Dune’s – the biggest names are Chernobyl’s Jared Harris and The Hobbit’s Lee Pace – this millennium-spanning tale of a Galactic Empire looks extremely ambitious, with showrunner David S Goyer (Batman Begins, FlashForward) telling The Hollywood Reporter that: “It’s a 1,000-year chess game between [Harris’s character] Hari Seldon and the Empire, and all the characters in between are the pawns, but some of the pawns over the course of this saga end up becoming kings and queens.”",
    "In other words, Warner and Apple are giving their high-profile SF adaptations every chance to succeed, taking them as seriously as the BBC would a slice of Charles Dickens or Jane Austen. If they’re a success Hollywood will surely take notice the way they have of fantasy since The Lord of the Rings. This could be the start of an exciting new age for movies and TV, if creatives start to plunder the rich back catalogue of science fiction literature – a source of ideas potentially as rich as Marvel and DC Comics.",
    "Now that technology has caught up with imagination, making even the grandest of interstellar action possible on screen, everything is theoretically filmable – especially now that television budgets are as big as their movie counterparts. Perhaps we’re finally entering an era when Iain M Banks’s Culture (which was, until 2020, in development at Amazon), Peter F Hamilton’s Commonwealth Saga, Larry Niven’s Ringworld, Joe Haldeman’s The Forever War (not to be confused with The Tomorrow War) or Alfred Bester’s The Stars My Destination could realistically make it to the screen.",
    "Of course, if either Dune or Foundation disappoints, then Hollywood could just as easily decide there’s no market in adapting science fiction novels, and go back to the tried-and-tested safety net of comic-book action. But at least they’ll have given it a go.",
    "Foundation debuts on Apple TV Plus on September 24. Dune is in cinemas (and on HBO Max in the US) from October 22."
  ],
  "headers": {
    "6": "No Expanse spared",
    "11": "A solid Foundation"
  },
  "links": {
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Shadow and Bone": "https://www.techradar.com/news/shadow-and-bone-season-2",
    "Cursed": "https://www.techradar.com/news/netflix-canceled-another-tv-show-last-week-but-you-might-not-have-noticed",
    "a new shot at Tolkien": "https://www.techradar.com/news/lord-of-the-rings-on-amazon",
    "Star Wars": "https://www.techradar.com/how-to/how-to-watch-the-star-wars-movies-in-order",
    "Dune": "https://www.techradar.com/news/dune-cast-release-date-trailer",
    "The Sisterhood": "https://variety.com/2021/tv/news/dune-tv-series-hbo-max-showrunner-diane-ademu-john-1235024854/",
    "Foundation": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
    "The Hollywood Reporter": "https://www.hollywoodreporter.com/tv/tv-news/apple-tv-david-s-goyer-foundation-1234985520/",
    "which was, until 2020, in development at Amazon": "https://www.theguardian.com/books/2020/aug/26/amazon-tv-adaptation-of-iain-banks-culture-series-is-cancelled",
    "The Tomorrow War": "https://www.techradar.com/news/the-tomorrow-war-on-amazon-prime-video-isnt-as-fun-as-it-should-be"
  }
}