{
  "source": "https://www.techradar.com/news/6-things-wed-like-to-see-from-the-rumored-sony-a7-iv",
  "title": "6 things we'd like to see from the rumored Sony A7 IV",
  "category": "cameras",
  "updated": "2021-10-16T08:00:00Z",
  "author": "andrew-williams",
  "summary": "All we want is the perfect full-frame camera for hobbyists",
  "article": [
    "When we reviewed the Sony A7 III in March 2018, we gave the full-frame camera five stars and remarked that \"for the price, there's nothing that can touch it.\" So now the rumor mill is predicting the arrival of a Sony A7 IV, we've been thinking – what exactly would that camera need to create similar shockwaves to the A7 III?",
    "If the Sony A7 IV does arrive soon, as Sony Alpha Rumors has predicted, then it'd certainly have a job on its hands to match its predecessor. The A7 III was an aggressive elbow into the ribs of Sony's main rivals, Canon and Nikon, when it landed three-and-a-half years ago – and a very successful one at that.",
    "Despite being the 'basic' model in Sony's full-frame mirrorless camera lineup, sitting below the Sony A7R III and Sony A9, the A7 III inherited similar features to the latter, including the same 693-point AF system with Eye AF powers. And all for an impressive body-only price of $1,999 / £2,000 / AU$3,099.",
    "In short, the A7 III's aim was to redefine what we should expect from an entry-level full-frame camera, and it succeeded in doing that. But could the rumored Sony A7 IV really aim to achieve the same thing, almost four years on? And if so, what features would it need to re-establish the Sony as the default home for anyone who needs a great value full-frame all-rounder?",
    "To get ourselves prepped, we’ve had a little thought exercise to work out what we'd actually want from the camera. Having chopped down our long-list of priorities, here are the six Sony A7 IV features we'd really like to see from the rumored full-frame camera.",
    "Adding 4K/60p video would be such an obvious upgrade to the rumored Sony A7 IV that we almost chose not to include it in this list. But then we remembered that the higher-end Sony A7R IV doesn't actually have a 4K/60p mode. And we're not expecting to see a new camera in that “R” range until 2022.",
    "This would mean Sony’s entry-level full-frame mirrorless camera would actually have a higher-end video capture mode than its top-end stills one, at least for several months. This wasn't the case back in 2018, when the Sony A7R III matched the A7 III's 4K/30p mode (even if, in practice, the A7 III's 4K quality was superior).",
    "There’s also the question of how the Sony A7 IV’S 4K/60 mode would work. In an ideal world, we'd be able to shoot at 4K/60p using the full width of the frame, just as you do on a high-end phone (minus the stabilization crop) or the Sony A7S III.",
    "However, one of the benefits of the Sony A7S III’s lower resolution 12MP sensor is that it's more-or-less made for 4K video. You can shoot at 120fps at UHD resolution with only a minor crop, because no supersampling is required.",
    "We reckon Sony would include a 4K/60p video on an A7 IV, only with the potential compromise of a crop. This would ensure it sits perfectly in the range, too – leaving clear space between it and the 4K/120p Sony A7S III, without needing to explain to buyers about the benefits of the latter's giant sensor pixels.",
    "While the Sony A7 III remains an excellent camera today, one feature that does show its age is its electronic viewfinder (EVF). The A7 III and its two predecessors have 2.36-million dot EVFs, equivalent to 1024 x 768 pixel resolutions. If Sony is planning to release an A7 IV, then an improved EVF would be a must.",
    "The next step up is a 3.69-million dot EVF, equivalent to 1280 x 960 pixels. This would get us closer to the level where long-term DSLR users might not even miss the clarity of optical viewfinders. Speculation from Sony Alpha Rumors back in November 2020 suggested that a Sony A7 IV would have a 3.69-million dot EVF, so this is perhaps the most likely scenario.",
    "Why not higher? The Sony A7R IV has a 5.76-million dot EVF, the Sony A7S III a positively luxurious 9.44-million dot one (2048×1536 in pixel terms). However, all entry-level models in the Sony A7 range need to have one eye on their moderately affordable pricing.",
    "Also, the Nikon Z6 II and Canon EOS R6 both have 3.69-million dot EVFs, which has established a standard for this level of camera.",
    "The Sony A7 III’s flip screen has its charms. You can lift it out from its 'flat' position very quickly for shooting above or below your head. For pure stills use, we probably prefer it to the fully articulated kind.",
    "However, in 2021, we'd imagine a Sony A7 IV would likely have a fully articulating screen. The 'content creator' market, or folks who need mixed photo and video use, is bigger than ever. And they'd likely want the flexibility of a screen that can be used for video composition even when shooting solo to camera.",
    "Sony did not use such a screen in the top-end Sony Alpha A1. But that makes sense, too. At that level, there’s a good argument that sticking with a stills-friendly tilt screen is the better choice. The A1's $6,500 / £6,500 price tag marks it out as the kind of camera that might be used with a separate monitor/recorder like the Atomos Ninja V when used for video.",
    "While such an accessory is only a fraction of the cost of a Sony A1, it would likely seem prohibitively expensive, or bulky, for the Sony A7 line. Therefore, an articulating screen would likely fit better on a Sony A7 IV.",
    "In addition, we’d like to see a Sony A7 III successor that adopts the interface improvements made in the Sony A7S III. The latter has truly touch-friendly software, and a more intuitive layout. Unless there has been more backlash to this change than we’ve noticed, we can’t think why Sony would not switch to this more touch-led UI on its next entry-level full-frame camera.",
    "If a Sony A7 IV does indeed land soon, as Sony Alpha Rumors predicts, it seems reasonable to expect improved burst shooting performance. But we also shouldn't expect miracles in this area, particularly if its sensor turns out to be higher resolution than the Sony A7 III's 24MP chip.",
    "The Sony A7 III is already no slouch in this area, with burst speeds of up to 10fps. Sony could really do with an improved buffer, though. This is what determines how long you can press the shutter down and burst-shoot before the camera needs to flush out its memory to the SD card. The Sony A7 III can shoot for around 7-8 seconds when capturing 12-bit RAW images, or only around 3-4 seconds with uncompressed 14-bit RAWs.",
    "This is significantly less than the Nikon Z6 II’s 10-plus seconds for both 12-bit and 14-bit RAWs. This is helped by support for lossless compression, which reduces the amount of data involved. The Sony A7 III does not have lossless raw compression.",
    "Is a big change likely in the rumored Sony A7 IV? Sony did not ramp-up the buffer of the Sony A7R IV, which taps out after 68 raws or 30 uncompressed raws. This isn't a positive sign for other cameras in the A7 series, although let’s not that forget the 'R' camera has ridiculously high 61MP resolution. This means that Sony, hopefully, may take a different tack with its A7 range. Fingers crossed.",
    "Mirrorless cameras and DSLRs still hold plenty of advantages over smartphones like the iPhone 13 Pro and Samsung Galaxy S21 Ultra, but that doesn't mean they can't learn from their pocketable rivals.",
    "A phone-like approach to HDR is what we’d be most interested in seeing. All decent phone cameras create most of their images out of a composite of shots, mitigating the small sensors they use.",
    "They do this with the help of image signal processors that are designed for the job. Unfortunately, this isn't really the case with mirrorless cameras processors. However, a camera like the Sony A7 IV would need to do much less work to get the same kind of result.",
    "While a computational model might be the eventual goal, it could start with an intelligent 'Auto HDR' mode that performs the kind of shadow detail excavation you might do in Photoshop using its Camera Raw Filter controls. Or by simply adjusting the shadows or levels.",
    "The Sony A7 III does have an HDR mode, but it is based around bracketing. This takes successive frames with lower and higher exposure, and generally requires a tripod for good results. In this sense, it's pretty old-school.",
    "Many serious photographers might hate this idea, and would see it is as a dumbing down of mirrorless photography. But wouldn’t it be nice to be able to switch to a casual mode sometimes, so you don’t have to bring your images into a photo editor to work out if they are winners or not?",
    "Sony could take the same approach with time-lapse video. While you can shoot time-lapse photography using the A7 III’s intervalometer feature, Sony should look to package up these abilities in a friendlier, more easy-to-use form. Not every prospective Sony A7 IV buyer would be a semi-pro or ultra-experienced photographer, or someone who wants to explore a load of technical terms. So why should the camera treat them as such? Phone-style modes like this could help broaden the Sony A7 range's appeal even more.",
    "The Sony A7 III's price tag was one of the crucial elements behind its success. Sure, $1,999 / £2,000 / AU$3,099 (its body-only price at launch) isn't exactly small change, but it was impressively low for such a capable camera – and it did change the landscape of what we could expect from something at that price.",
    "Still, if the rumored Sony A7 IV successor does arrive, there are reasons to be believe that it might struggle to match that figure. It would certainly be cheaper than the $3,499/£3,499 Sony A7R IV or similarly-priced A7S III. But could it again stay below the magic $2,000 mark?",
    "That would see it match the Nikon Z6 II ($2,000 / £1,999 / AU$3,399), and remain much more affordable than the Canon EOS R6 ($2,499 / £2,499 / AU$4,499). But given inflation and a likely leap in features, a price tag somewhere between those two latter rivals is perhaps more realistic."
  ],
  "headers": {
    "5": "1. A 4K/60p video mode",
    "10": "2. A higher-resolution EVF",
    "14": "3. A fully articulating screen (with new menus)",
    "19": "4. A bigger burst mode buffer",
    "23": "5. A phone-style HDR mode",
    "30": "6. A sub-$2,000 price tag"
  },
  "links": {
    "Sony A7 III": "https://www.techradar.com/reviews/sony-alpha-a7-iii-review",
    "Sony A7 IV": "https://www.techradar.com/reviews/sony-a7-iv",
    "Sony Alpha Rumors": "https://www.sonyalpharumors.com/a7iv-and-also-two-new-flashes-coming-on-october-21/",
    "Sony A7R III": "https://www.techradar.com/reviews/sony-alpha-a7r-iii-review",
    "Sony A9": "https://www.techradar.com/reviews/sony-alpha-a9",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Nikon Z6 II": "https://www.techradar.com/reviews/nikon-z6-ii",
    "Canon EOS R6": "https://www.techradar.com/reviews/canon-eos-r6-review",
    "iPhone 13 Pro": "https://www.techradar.com/reviews/iphone-13-pro-review",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review"
  }
}