{
  "source": "https://www.techradar.com/news/oneplus-9-psvr-2-and-gifting-on-tinder-noise-cancelling-podcast-episode-57",
  "title": "OnePlus 9, PSVR 2 and gifting on Tinder: Noise Cancelling podcast episode 57",
  "category": "phones",
  "updated": "2021-03-26T10:08:07Z",
  "author": "adam-vjestica",
  "summary": "Episode 57 of our tech podcast is here",
  "article": [
    "Can't find the time to keep up with tech news? Looking for some awesome lockdown listening? We have you covered with the Noise Cancelling podcast, which is brought to you by TechRadar and our sister sites Laptop Mag and Tom's Guide.",
    "This week's episode is presented by Gareth Beavis, Global Editor-in-Chief of TechRadar, and Sherri L. Smith, Editor-in-Chief of Laptop Mag.",
    "Our guests are James Peckham, Phones Editor at TechRadar, and Chris Barraclough, from the YouTube Channel TechSpurt, who join us (remotely, of course) to talk about the last seven days in tech.",
    "As usual, we're talking about a variety of topics from the world of tech. We begin the show with this week's Big Question: Tinder is going to allow users to gift Lyft rides to their dates, so which app would you like to having a gifting feature?",
    "In the news section, we induct another gadget into our Hall of Fame, share our thoughts on the OnePlus 9 and OnePlus Watch, as well as discuss the new PSVR 2 controllers. Finally, we round things off with the News Blast, where we try to get through as many headlines as possible.",
    "For all this and more, tune into the all-new Noise Cancelling podcast – you can subscribe on Spotify, grab it on Apple Podcasts, or find us wherever you get your pods. New episodes land every Friday."
  ],
  "headers": {
    "3": "Week 57:"
  },
  "links": {
    "Laptop Mag": "https://www.laptopmag.com/",
    "Tom's Guide": "https://www.tomsguide.com/",
    "YouTube Channel TechSpurt": "https://www.youtube.com/channel/UCVLN0tY51ewH44wUtx3YZTA",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "OnePlus Watch": "https://www.techradar.com/reviews/oneplus-watch-review",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "subscribe on Spotify": "https://open.spotify.com/show/4NLPDxcBncn7KU7EF3q8t4",
    "grab it on Apple Podcasts": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-6519171748912401000&sharedId=trd-us&u=https%3A%2F%2Fpodcasts.apple.com%2Fus%2Fpodcast%2Fnoise-cancelling%2Fid1500948027%3Fign-mpt%3Duo%253D4"
  }
}