{
  "source": "https://www.techradar.com/news/far-cry-6-on-ps5-and-xbox-series-x-wont-feature-ray-tracing",
  "title": "Far Cry 6 on PS5 and Xbox Series X won't feature ray tracing [updated]",
  "category": "gaming",
  "updated": "2021-09-22T15:25:35Z",
  "author": "jamel-smith",
  "summary": "Update: Ubisoft has released a statement to TechRadar",
  "article": [
    "Update: Ubisoft has released the following statement to TechRadar:",
    "\"Ray Tracing is a PC-only feature. On console our objective has been to take advantage of new hardware capabilities, optimizing performance targeting 4K and achieving 60 FPS for instance, all while ensuring that the experience on the previous generation of console would remain consistent.\" Original story follows:",
    "Far Cry 6 won’t have ray-tracing on PS5 and Xbox Series X, a Ubisoft developer has confirmed.",
    "In an interview with Wccftech, Ubisoft 3D Team Lead Programmer Stephanie Brenham confirmed that Far Cry 6’s ray tracing will be a “PC only feature.” In conjunction with ray tracing, AMD’s FidelityFX Super Resolution will also only be featured on the PC version of Far Cry 6, allowing PC gamers to enable ray tracing with higher resolutions without taking a dramatic hit on framerates.",
    "Ray tracing being exclusive to PC is quite surprising, considering the feature has been implemented on the PS5 and Xbox Series X before. Ubisoft hasn’t confirmed why ray tracing will be absent from the PS5 and Xbox Series X versions of the game, but TechRadar has contacted the publisher for comment.",
    "While Far Cry 6 will only have ray tracing on PC, Brenham did detail that Ubisoft will be leveraging the power of the next-gen consoles, “optimizing performance targeting 4K and achieving 60fps”. Plus the PS5 and Xbox Series X/S versions will include better LODs (level of details), draw distances and HD textures over the PS4/Pro and Xbox One/One X versions of Far Cry 6.",
    "Ray tracing on next-gen consoles arguably hasn’t lived up to its hype, with few games actually utilizing the feature.",
    "It’s possible that this is because of the drain ray tracing has on game performance. Achieving both 60fps (which Far Cry 6 is targetting) while utilizing ray tracing in a game isn’t exactly an easy task for console hardware.",
    "“There is a cost [to implement raytracing],” Gavin Moore, Creative Director of Demon Souls on PS5 said in October 2020. “If we had implemented ray tracing in the game, that would mean that we would have had to leave something out.” Interestingly looking at the Demon Souls Remake, I don’t know how ray-tracing would’ve improved the already stunning visuals of the title. The beauty of Stonefang Tunnel helped soothe the pain every time I died to those fat officials.",
    "So far, Sony’s Insomniac Games seem to be one of the few developers to implement ray-tracing well on their next-gen games. Both Spider-Man Miles Morales and Ratchet and Clank: Rift Apart featured ray-traced performance graphic modes, allowing their games to run at an upscaled 4K resolution, with ray-tracing, at a smooth 60fps. Maybe Insomniac should share their ray tracing secrets with other triple-a developers."
  ],
  "headers": {
    "6": "Opinion: Ray tracing being a common feature on next-gen consoles was a dream"
  },
  "links": {
    "Far Cry 6": "https://www.techradar.com/reviews/far-cry-6#:~:text=Initially%20due%20to%20release%20on,gameplay%20reveal%20on%20May%2028.",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Wccftech": "https://wccftech.com/far-cry-6-tech-q-ssds-are-the-most-impressive-next-gen-feature/",
    "Demon Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "Spider-Man Miles Morales": "https://www.techradar.com/reviews/marvels-spider-man-miles-morales-review",
    "Ratchet and Clank: Rift Apart": "https://www.techradar.com/reviews/ratchet-and-clank-rift-apart"
  }
}