{
  "source": "https://www.techradar.com/news/steam-decks-nintendo-switch-like-gyro-controls-could-be-a-game-changer-promises-valve",
  "title": "Steam Deck’s Nintendo Switch-like gyro controls are a game-changer, promises Valve",
  "category": "computing",
  "updated": "2021-12-01T17:33:46Z",
  "author": "jamel-smith",
  "summary": "Better controls for the win",
  "article": [
    "Valve is recommending future Steam Deck developers try out gyro controls for their games.",
    "In a Steam Deck FAQ post, the Half-Life publisher also said that “when combined with the joystick or the trackpad, [gyro controls] are ideal for a large class of games and something many players will want to use.”",
    "Valve went on to explain that gyro controls offer finer precision for gamers who are used to using gamepad inputs; it recommends developers try out this style of input when shipping a game that has players controlling a camera or mouse cursor.",
    "In recent years there’s been a small, but influential movement towards gyro controls in gaming - specifically in shooters. Console gamers on the Nintendo Switch have particularly found benefits from using gyro controls over the traditional twin thumbsticks, with plenty of games on the console supporting this different style of input like Splatoon, Zelda Breath of the Wild, Apex Legends and Doom Eternal.",
    "Gamers have found that gyro controls offer better precision plus quicker and snappier movements compared to thumbsticks. This style of input is now often heralded as the console alternative to PC’s mouse and keyboard controls. The video below explores how players can benefit from gyroscopic controls.",
    "As more gamers are finding success using gyro controls in games, they’ve been requesting their favorite game developers support the style of input. Just last year, due to a barrage of requests, Naughty Dog added gyro aiming to its critically acclaimed game The Last of Us Part II. And again we saw gamers finding their aim drastically improved over thumbsticks.",
    "It seems as if Valve is making the right move encouraging developers to use gyro controls in their games - it could see a migration of gamers from the Nintendo Switch to the Steam Deck due to a large adoption of gyro controls.",
    "But, we’ll have to wait until February, when the first Steam Deck devices start arriving, to see how many games support the different style of input.",
    "Via GamesRadar"
  ],
  "headers": {
    "3": "Analysis: A new movement"
  },
  "links": {
    "Steam Deck": "https://www.techradar.com/news/steam-deck",
    "Steam Deck FAQ post": "https://partner.steamgames.com/doc/steamdeck/faq#5",
    "Nintendo Switch": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Splatoon": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "Zelda Breath of the Wild": "https://www.techradar.com/news/breath-of-the-wild-2",
    "The Last of Us Part II": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "gamers finding their aim drastically improved over thumbsticks": "https://www.youtube.com/watch?v=nKXzEZSiSPA",
    "Via GamesRadar": "https://www.gamesradar.com/valve-says-steam-deck-gyro-controls-will-be-ideal-for-a-large-class-of-games/"
  }
}