{
  "source": "https://www.techradar.com/news/netflix-names-kong-skull-island-director-to-helm-live-action-gundam-movie",
  "title": "Netflix names Kong: Skull Island director to helm live-action Gundam movie",
  "category": "televisions",
  "updated": "2021-04-12T20:51:10Z",
  "author": "david-lumb",
  "summary": "Netflix’s Gundam movie will be directed and produced by Jordan Vogt-Roberts",
  "article": [
    "The Netflix Gundam movie finally has a director: the company announced that Jordan Vogt-Roberts, known for helming Kong: Skull Island, will take on a live-action adaptation of the popular military mecha anime series.",
    "Vogt-Roberts, who also directed indie film The Kings of Summer and episodes of the lauded FX TV series You’re The Worst, will direct and produce the Gundam film. (He's also been in talks with Sony to helm a Metal Gear Solid film). Comics titan Brian K. Vaughan remains the writer of the Gundam film as well as executive producer alongside Cale Boyter representing the film's co-producing studio Legendary, per Netflix’s official press release.",
    "While Netflix is still keeping mum about the adaptation’s plot, the release did imply it could be set in the era of the original Gundam series that debuted in 1979: the blog post described that show’s setting, the Universal Century, of humanity expanding to orbital space colonies and eventually launching a war of independence to liberate themselves from Earth governments.",
    "Of course, veteran Gundam fans know that many series and films followed the original Gundam anime, expanding the characters and conflicts of the Universal Century timeline, so it’s not too clear which plotlines will inspire or be adapted outright into the live-action film.",
    "Gundam: the legacy",
    "Fans have been apprehensive of Netflix’s Gundam project given prior efforts by Western studios to adapt beloved anime series into live-action films. The infamous Ghost In The Shell cast Scarlett Johansson as the original’s protagonist, the Japanese cybernetically-enhanced Major Motoko Kusanagi, a casting choice met with outrage that was bafflingly addressed in the film.",
    "Likewise, fans are divided over the upcoming Netflix live-action Cowboy Bebop show, which wrapped filming in March. While we still don’t have a release date for that series, it has taken over three years since that project was announced for its first season to finish filming, so hopefully we won’t have to wait as long for Netflix’s Gundam movie to wrap.",
    "Until then, at least Gundam fans have the newly-opened Gundam Factory Yokohama featuring a life-size version of the iconic RX-79 Gundam made famous in the original Gundam 1979 series:"
  ],
  "headers": {},
  "links": {
    "Metal Gear Solid film": "https://www.techradar.com/news/metal-gear-solid-movie-will-star-oscar-isaac-as-solid-snake",
    "press release": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-3825044154282832000/https://about.netflix.com/en/news/jordan-vogt-roberts-to-direct-live-action-film-adaptation-based-on-iconic",
    "wrapped": "https://www.techradar.com/news/finally-cowboy-bebops-live-action-netflix-adaptation-has-wrapped-filming"
  }
}