{
  "source": "https://www.techradar.com/news/wandavision-stars-mcu-return-cant-come-soon-enough-but-when-could-that-be",
  "title": "WandaVision star's MCU return 'can't come soon enough' – but when could that be?",
  "category": "entertainment",
  "updated": "2021-07-13T09:07:20Z",
  "author": "tom-power",
  "summary": "We might see this WandaVision character again in the near future",
  "article": [
    "It's been four months since WandaVision's season finale graced our screens.",
    "Marvel's first Disney Plus TV series generated plenty of debate and online speculation, and while most of it didn't come to pass, some viewers did get one or two things right ahead of official reveals on the show.",
    "Some fans had speculated that Kathryn Hahn's nosy neighbor was Agatha Harkness in disguise long before her real identity was confirmed. Hahn went on to be one of the highlights of WandaVision, so it isn't surprising that fans have held out hope that Agatha would return in the future.",
    "Now, Marvel Studios President Kevin Feige has dropped the biggest hint yet that we'll see Agatha again.",
    "Speaking to RottenTomatoes.com about Marvel's Phase 4 plans for the MCU thus far, Feige teased the possibility that the return of Hahn's Agatha Harkness \"can't come soon enough\", which suggests that we'll be seeing her again at some point.",
    "\"By the first few episodes of WandaVision, people are asking 'Where is Agnes going to show up again? What else is she going to do?',\" Feige explained. \"Within the MCU, [Kathryn Hahn's return] can't come soon enough.\"",
    "Spoilers follow for WandaVision.",
    "It's an interesting question, and there are a couple of upcoming productions that seem perfect for Agatha to return.",
    "First, let's briefly recap where WandaVision's season finale left Agatha. After she was defeated in episode 9, Agatha was stripped of her magical powers, trapped in her 'Agnes' persona and left to live out her days in Westview by Wanda.",
    "For the time being, then, Agatha doesn't know who she is and doesn't possess her powers. However, that could change very soon, depending on where she pops up next.",
    "Bear in mind that this is all speculation on our part. Nothing below has been confirmed by Marvel, but we think these are the most likely places where Agatha could appear.",
    "The first (and most obvious) project for Hahn's MCU return is Doctor Strange and the Multiverse of Madness.",
    "As Marvel fans will already know, Elizabeth Olsen's Wanda/Scarlet Witch will co-star in this Phase 4 film alongside Benedict Cumberbatch's titular character.",
    "Given that Wanda will have a major part to play in Doctor Strange 2 (and that the Darkhold might be key to the movie's plot), it's the most logical production to reintroduce Agatha to audiences.",
    "If Strange and Wanda need some help with understanding the Darkhold, or how the multiverse came about, Agatha could be the only individual who can help, seeing as she was in possession of it at one stage. Wanda, then, could return Agatha's powers to her in exchange for her help.",
    "Another possibility is WandaVision season 2. Again, Marvel hasn't confirmed if a second instalment is coming. If it did, however, Wanda could request Agatha's help in order to understand her Scarlet Witch powers or to defeat an even more powerful foe.",
    "Finally, Marvel's upcoming animated show What If...? may see Hahn reprise her role as Agatha Harkness.",
    "We know that Wanda and Doctor Strange are making appearances in the Disney Plus series. That means that there will be some magic elements throughout the 10-episode series. It isn't a stretch, then, to think that Agatha may show up in some capacity, even though Hahn hasn't been confirmed as voicing her character in the show.",
    "Of course, Feige's \"can't come soon enough\" comments doesn't necessarily mean that Agatha's return will happen between now and Doctor Strange 2's March 2022 release.",
    "The above projects are the most likely places for Hahn to return, though, and Hahn has express serious interest in reprising the role if she's ever asked. We wouldn't be surprised if she does make a cameo (or two) over the next nine months. If Hahn does return, it would certainly be a welcome one."
  ],
  "headers": {
    "6": "Analysis: where could Agatha Harkness appear next in the MCU?"
  },
  "links": {
    "WandaVision": "https://www.techradar.com/news/wandavision-explained",
    "RottenTomatoes.com": "https://editorial.rottentomatoes.com/article/kevin-feige-breaks-down-the-mcus-phase-4-so-far-wandavision-falcon-loki-and-black-widow/",
    "has express serious interest": "https://comicbook.com/tv-shows/news/wandavision-kathryn-hahn-agatha-harkness-return-marvel-cinematic-universe-movies/"
  }
}