{
  "source": "https://www.techradar.com/news/samsung-galaxy-note-21-has-been-cancelled",
  "title": "Samsung Galaxy Note 21 likely cancelled, according to CEO",
  "category": "phones",
  "updated": "2021-03-17T11:20:25Z",
  "author": "aakash-jhaveri",
  "summary": "But it's Note the end",
  "article": [
    "The Samsung Galaxy Note 21 has been hitting headlines for all the wrong reasons over the last few months, with many thinking the Note line is being discontinued. A new development sees Samsung's CEO allude to the fact there won't be a new Note phone in 2021.",
    "At the 52nd regular shareholder's meeting in South Korea, Samsung co-CEO DJ Koh talked about the imbalance between the demand and supply of semiconductors globally. Samsung is now the largest consumer tech company to publicly talk about an ongoing shortage (as reported by Digital Daily).",
    "Samsung, which is also a chipset manufacturer itself, expects the disparity to affect its business in the next quarter. And that will impact the Galaxy Note series too.",
    "Koh explains that it will be difficult to release the S-Pen-toting Galaxy Note 21 in the second half of this year, as developing and offering two high-end devices can be a 'burden', referring to the Samsung Galaxy S21 and Galaxy S21 Ultra from earlier in the year as the other high-end handset.",
    "Koh said, “It is not that we do not release new products. The timing may vary, but next year we are preparing to continue to do so.\"",
    "A spokesperson went on record to mention that the Note series has not been discontinued, but only delayed for now, and expects the new flagship to return for next year. That'll likely be the Galaxy Note 22 after the Samsung Galaxy S22.",
    "Koh also told Bloomberg, “Note series is positioned as a high-end model in our business portfolio. It could be a burden to unveil two flagship models in a year so it might be difficult to release Note model in 2H.",
    "\"The timing of Note model launch can be changed but we seek to release a Note model next year.”",
    "Koh specifically references chipset shortages in the quotes from Digital Daily. \"The disparity between the supply of parts and demand in the information technology (IT) side is severe\" he said.",
    "\"We are checking the parts supply problem every morning. It is difficult to say that it is 100% resolved. It is a bit of a problem in the second quarter. We will report as a result so that there is no business disruption.”",
    "While chipset supply usually stabilizes within a few months, higher-end chipsets are likely to take longer to stabilize owing to the complexity of their design and a lack of prior experience and expertise.",
    "In the worst case scenario, we will see a surge in the prices of products across the consumer electronics.",
    "The iPhone 12 series was hit by a supply shortage for various types of chip, and as a result that range was hard to come by in some markets for its first few months of existence. Perhaps Samsung doesn't want to put out a phone that only a few could buy.",
    "It remains to be seen how this decision will affect the launch of Samsung’s upcoming range of foldables, such as the Galaxy Z Fold 3 and Galaxy Z Flip 3, which is rumored to be unveiled in the middle of 2021 with a similar flagship processor inside. A delay would not be far-fetched, though as a less mainstream device, Samsung might be able to more easily meet demand for it."
  ],
  "headers": {
    "8": "Wait until 2022"
  },
  "links": {
    "Samsung Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "Digital Daily": "http://m.ddaily.co.kr/m/m_article/?no=210823",
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-03-17/samsung-warns-of-serious-imbalance-in-the-chips-industry",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review"
  }
}