{
  "source": "https://www.techradar.com/news/battlefield-6-could-skip-ps4-and-xbox-one-rumor-suggests",
  "title": "Battlefield 6 could skip PS4 and Xbox One, rumor suggests",
  "category": "gaming",
  "updated": "2021-06-11T17:00:43Z",
  "author": "vic-hood",
  "summary": "Will Battlefield 6 only release on PS5, Xbox Series X and PC?",
  "article": [
    "Battlefield 6 (now confirmed to be Battlefield 2042) might skip PS4 and Xbox One, releasing solely on PS5, Xbox Series X/S and PC instead, a recent rumor suggests.",
    "The rumor comes via notable Battlefield leaker Tom Henderson, who has been 'leaking' news on the new Battlefield for some time now. According to Henderson, his sources haven't shared anything \"concrete\" about whether Battlefield 6 (which he claims will simply be called 'Battlefield') will be coming to PS4 and Xbox One, leading him to speculate that the latest entry in the franchise won't release on these platforms at all.",
    "The tweet also speculates that rumors of Battlefield 6 coming to Xbox Game Pass on day one are true and that this move will be made \"to boost up player numbers\".",
    "It's worth noting that Henderson hasn't shared any concrete details that say the new Battlefield isn't coming to PS4 and Xbox One, instead this rumor is based on a lack of information about the game's release on last-gen platforms. So it's worth treating this rumor with a lot of skepticism – remember the Halo Infinite Xbox One rumor?",
    "However, Henderson's previous leaks on Battlefield 6's alleged \"modern\" setting were corroborated by VentureBeat journalist Jeff Grubb. Following these leaks, Henderson had his Twitter account suspended earlier this year, and much of his Battlefield YouTube content deleted, suggesting that EA may have intervened – though this isn't confirmed.",
    "Battlefield 6 has been confirmed to release \"Holiday 2021\" (between October and December) for PS5, Xbox Series X/S and PC, with EA calling the game a \"true next-gen vision\".",
    "The lack of confirmation about the game's release on PS4 and Xbox One – and the emphasis on \"next-gen\" – makes Henderson's comments somewhat more believable, however it's possible that we could see Battlefield 6 arriving on PS5, Xbox Series X and PC first, with a last-gen release coming after. Though, this could be wishful thinking.",
    "With EA claiming it will reveal more on Battlefield 6 in \"Spring\" 2021, it's likely we will get further details – and confirmation on PS4 and Xbox One releases – in the coming weeks."
  ],
  "headers": {
    "5": "What we know"
  },
  "links": {
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Tom Henderson": "https://twitter.com/_Tom_Henderson_",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/gaming/games-consoles/xbox-one-s-1323399/review",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Halo Infinite Xbox One rumor": "https://www.techradar.com/news/no-halo-infinite-hasnt-been-delayed-again-and-its-still-coming-to-xbox-one",
    "corroborated": "https://www.resetera.com/threads/insider-teases-battlefield-6-being-set-in-modern-day.223303/#post-36347584",
    "Twitter account suspended": "https://twitter.com/_Tom_Henderson_/status/1363564768100036613?s=20"
  }
}