{
  "source": "https://www.techradar.com/news/this-new-usb-flash-drive-self-destructs-on-command",
  "title": "This new USB flash drive self-destructs on command",
  "category": "computing",
  "updated": "2021-11-29T15:00:14Z",
  "author": "mayank-sharma",
  "summary": "Drives can be customized as per your requirements, says vendor",
  "article": [
    "Technodynamika, a subsidiary of Russian high-tech conglomerate Rostec, is reportedly prototyping a USB flash drive that looks like a standard USB thumb drive, but encases a built-in detonator that can destroy the NAND memory chips inside.",
    "Reporting on the development, Tom’s Hardware shares that the destruction process only fries the disk’s internals and is completely safe for the operator.",
    "\"We have created a new device that is able to reliably protect information from unauthorized access: the impossibility of data recovery has been proven by the expertise. In the future, the device will be tested for safety during long-term storage, resistance to mechanical impact, and climatic factors. We are also going to work on various design options for the case,” Igor Nasenkov, chief executive of Technodynamika, told Tom’s Hardware.",
    "According to a machine translation of Rostec’s Russian-language post, the detonation mechanism can be activated by the press of a button, which in turn triggers a cumulative charge that burns down the printed circuit board.",
    "In all fairness though, although it sounds very cinematic, the mechanism seems to be a bit crude. Destroying the data seems to be an overkill especially given the fact that modern day computers can’t crack the popular encryption standards.",
    "Sure, password-protected data can be obtained either through cyberattacks, or by coaxing the password through several means. However, Rostec’s self-destructible drives will ensure that sensitive data becomes inaccessible for good.",
    "Rostec says that once it has perfected them, the company will take custom orders for the drives and configure both its performance and capacity as requested by the customer. The company however hasn’t explained how it intends to prevent accidental activation of the self-destruct button.",
    "Meanwhile, if you are concerned about data security, take a look at these best secure USB drives, and use these best security keys to add another layer to safeguard your accounts"
  ],
  "headers": {
    "3": "Crude, but effective"
  },
  "links": {
    "Rostec": "https://www.techradar.com/news/mysterious-new-cpu-from-russia-wont-threaten-domination-of-intel-and-amd-yet",
    "USB flash drive": "https://www.techradar.com/news/best-usb-flash-drives",
    "Tom’s Hardware": "https://www.tomshardware.com/news/self-destructible-usb-drive-announced",
    "Russian-language post": "https://rostec.ru/news/rostekh-razrabotal-samounichtozhayushchuyusya-fleshku/",
    "encryption": "https://www.techradar.com/best/best-encryption-software",
    "password-protected": "https://www.techradar.com/best/password-manager",
    "best secure USB drives": "https://www.techradar.com/news/best-secure-drives",
    "best security keys": "https://www.techradar.com/best-security-key"
  }
}