{
  "source": "https://www.techradar.com/news/black-friday-scammers-are-turning-to-low-tech-phone-scams",
  "title": "Black Friday scammers are turning to low-tech phone scams",
  "category": "computing",
  "updated": "2021-11-24T04:00:40Z",
  "author": "anthony-spadafora",
  "summary": "Don't remember ordering that big ticket item online? You probably didn't",
  "article": [
    "Scammers have adopted new tactics to ensure the success of their phishing campaigns ahead of Black Friday and this year's holiday shopping season at a time when consumers have eschewed retail stores in favor of online shopping.",
    "According to a new report from the email security company Inky, scammers have stopped including malicious links and attachments in their phishing emails as anti-phishing technology has become much more effective at warding off even the most sophisticated attacks. Instead, they've begun crafting emails designed to impersonate big brands like Amazon, Target and Walmart.",
    "These emails which resemble an order confirmation from an online retailer are harmless when opened and don't contain any malware whatsoever. However, they do include a phone number that potential victims are instructed to call if they believe the order or shipping confirmation was sent to them by mistake. Receiving an email for items you didn't buy can be troubling especially if you believe you've fallen victim to identity theft. This creates a sense of urgency and victims often end up calling scammers on their own accord.",
    "If a user does call the number included in one of these emails, someone working for the scammer on the other end of the call will try to extract their payment details and other financial information.",
    "Over the summer, Inky saw so many of these emails impersonating retail brands that its engineers created a new threat model called Phone Scam. In the four months since this new threat model was rolled out, the firm detected 24,275 of these attacks targeting its customers and this number has steadily increased with Black Friday and Cyber Monday just around the corner.",
    "At the same time, these messages are sent using free email services like Gmail and Hotmail which makes it much easier for them to pass email authentication protocols like DMARC. So far Inky has seen scammers use this threat model to impersonate Amazon, PayPal, Target, eBay and other popular online retailers and mobile payment apps.",
    "To avoid falling victim to these Phone Scam email threats, Inky recommends that potential victims carefully inspect the email address, writing and content of these emails to see if they are legitimate. Alternatively, you can also open your browser and head to Amazon, Target or the website of any retailer mentioned in these scams and check your order history to see if you or someone else in your household might have ordered the item you've received an order or shipping confirmation for.",
    "Other ways to protect yourself online during this year's holiday shopping season include installing antivirus software on all your devices, using a VPN service when shopping especially when connected to public Wi-Fi and using a password manager to generate and store strong, unique passwords for all of your online accounts.",
    "We've also highlighted the best malware removal software, best endpoint protection software and best firewall"
  ],
  "headers": {
    "4": "Phone scam threats"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "online shopping": "https://www.techradar.com/news/microsoft-edge-thinks-it-can-dramatically-improving-online-shopping",
    "new report": "https://www.inky.com/blog/fresh-phish-adapting-to-high-tech-defenses-black-friday-phishers-switch-to-low-tech-phone-scams",
    "Inky": "https://www.techradar.com/news/chipotle-email-marketing-hacked-to-send-phishing-emails",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "identity theft": "https://www.techradar.com/best/best-identity-theft-protection",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "email services": "https://www.techradar.com/news/best-email-provider",
    "DMARC": "https://www.techradar.com/news/protect-your-digital-marketing-toolbox-with-email-security",
    "mobile payment apps": "https://www.techradar.com/news/best-mobile-payment-app",
    "browser": "https://www.techradar.com/best/browser",
    "antivirus software": "https://www.techradar.com/best/best-antivirus",
    "VPN": "https://www.techradar.com/vpn/best-vpn",
    "public Wi-Fi": "https://www.techradar.com/news/public-wi-fi-and-why-you-need-a-vpn",
    "password manager": "https://www.techradar.com/best/password-manager",
    "best malware removal software": "https://www.techradar.com/best/best-malware-removal",
    "best endpoint protection software": "https://www.techradar.com/news/best-endpoint-security-software",
    "best firewall": "https://www.techradar.com/best/firewall"
  }
}