{
  "source": "https://www.techradar.com/news/submit-your-story-to-techradar-pro",
  "title": "Submit your story to TechRadar Pro",
  "category": "computing",
  "updated": "2021-01-31T13:36:48Z",
  "author": "mike-moore",
  "summary": "Got a story or opinion for us? Here’s how to get in touch.",
  "article": [
    "TechRadar Pro is looking to hear from the best and brightest minds in the technology industry.",
    "Our readers come from all around the world, meaning that your opinions and views can reach a global dedicated, well-read B2C and B2B audience.",
    "We're only going to be able to feature a select number of pieces each week, so our focus needs to be towards the top themes and subjects concerning the business technology world today.",
    "You can check out our news page here for a quick overview of the subjects we cover on a day-to-day basis, but we'll especially look to feature content on the following areas.",
    "You can submit a piece to TechRadar Pro by contacting the editorial team here with your idea or pitch.",
    "If approved, we'll ask you to complete our submissions form, which contains all the details you need to know.",
    "We ask for all our content to be around 800 words in length, and have a clear business technology focus. Companies are not allowed to mention their own names or products within the piece, (including the title) - however there will be an opportunity to do so at the foot of the article.",
    "The articles will need to be unique and exclusive to us - the copyright of the article will be the author’s, which means that they can republish it elsewhere but must link to TechRadar Pro as the source.",
    "All bylines will be subbed and sense-checked by TechRadar Pro, and titles may be reworked if not fit for purpose.",
    "Unfortunately, given the number of pieces we receive, it is hard for us to follow-up everything and we would advise you to set up a Google Alert in order to know instantly when your content has been pushed on TechRadar Pro."
  ],
  "headers": {
    "4": "How can I get my story on TechRadar Pro?"
  },
  "links": {
    "here": "emailto:mikemoore@futurenet.com",
    "our submissions form": "https://www.surveymonkey.co.uk/r/itproportaltechproarticlesubmission"
  }
}