{
  "source": "https://www.techradar.com/news/iphone-12s-or-iphone-13",
  "title": "iPhone 12S or iPhone 13: what will Apple call its next iPhone?",
  "category": "phones",
  "updated": "2021-09-13T15:22:49Z",
  "author": "james-rogerson",
  "summary": "There's some debate over the name of the next iPhone",
  "article": [
    "We’ve mostly been referring to Apple’s next numbered iPhone as the iPhone 13, but is that actually what it will launch as? Given that it follows the iPhone 12, it would make sense for it to, but there are a couple of reasons why it might not.",
    "Below, we’ll look at what those reasons are, what Apple might call the next major iPhone instead (with iPhone 12S being the most likely alternative option but not the only one), and what the rumors say so far.",
    "We’ll also consider how likely an alternative name actually is, and as soon as we hear anything else about the name, we’ll be sure to update this piece.",
    "So why might Apple not call its next major phone the iPhone 13? One reason is that it sometimes follows up a numbered model with an ‘S’ version. For example, the iPhone 6 was followed by the iPhone 6S.",
    "But that’s not a pattern Apple always sticks to, and in fact the last ‘S’ model was the iPhone XS – so the iPhone 12 followed the iPhone 11, with no iPhone 11S in between.",
    "So if Apple continues with what it’s been doing for the last couple of years then we can expect the iPhone 13, but if it goes back to using an ‘S’ then we’ll likely get the iPhone 12S.",
    "Another reason Apple might not go for the number 13 is that it’s seen as an unlucky number in many parts of the world, including Apple’s home market of the US.",
    "Of course, calling the next phone the iPhone 12S wouldn’t entirely solve this problem because Apple would still then be up to 13 the following year.",
    "The earliest rumors about the next main iPhone largely referred to it as the iPhone 13, but it’s not clear whether the sources had heard that would be the name or were just assuming it would be, and a few sources have now specifically said it will be called the iPhone 12S.",
    "For example, Bloomberg reports that engineers inside Apple consider the upcoming model to be an ‘S’ version, though that doesn’t necessarily mean it would launch with ‘S’ in the name.",
    "Jon Prosser, a leaker with a reasonable track record, has also suggested that the next model will be called the iPhone 12S, as have GizChina and DigiTimes.",
    "Ross Young – a display industry expert who’s accurately leaked things in the past – also referred to the upcoming phones as the iPhone 12S range, though noted that he’s “not sure” whether that will be the final name.",
    "That said, as we've got closer to launch we've seen growing evidence for the iPhone 13 name. Most notably images supposedly showing official packaging stickers for the range, and video showing MagSafe cases, both shared on Twitter, both refer to the phones as the iPhone 13 range.",
    "Taiwanese site United Daily News also reports that iPhone 13 will be the name.",
    "So it remains slightly unclear which name Apple will use, but with recent leaks and rumors leaning towards the iPhone 13 name, that now seems the most likely.",
    "It’s worth noting that if Apple does choose to call its next iPhone the iPhone 12S, this won’t have been done at random, and could in fact signal that the next model will be a relatively minor update that’s not worthy of a new number.",
    "That’s speculation for now, but it’s something to bear in mind, especially as rumors do suggest the design might be similar to the iPhone 12’s, and that even most of the specs might only get a small upgrade.",
    "It’s possible. As noted above, calling the next model the iPhone 12S doesn’t solve the problem of 13 being unlucky, it just delays the issue by a year. So Apple might skip straight to iPhone 14, or use some new naming convention, but so far there’s no suggestion that it will, so we’d say this is unlikely."
  ],
  "headers": {
    "3": "An inconsistent pattern",
    "6": "Unlucky number",
    "8": "What do the rumors say?",
    "15": "What’s in a name?",
    "17": "Could Apple pick a completely different name?"
  },
  "links": {
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPhone 12": "https://www.techradar.com/reviews/iphone-12",
    "iPhone 6": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-1264565/review",
    "iPhone 6S": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6s-1303758/review",
    "iPhone XS": "https://www.techradar.com/reviews/iphone-xs-review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "Bloomberg": "https://www.bloomberg.com/news/articles/2021-01-15/apple-considers-foldable-iphone-minor-changes-planned-for-2021-models",
    "also suggested": "https://twitter.com/jon_prosser/status/1348797040072007682",
    "GizChina": "https://www.gizchina.com/2021/01/15/apple-to-name-next-handset-iphone-12s-instead-of-iphone-13/",
    "DigiTimes": "https://www.techradar.com/news/iphone-13-could-have-a-smaller-notch-and-better-cameras",
    "Ross Young": "https://twitter.com/DSCCRoss/status/1352622559372697602",
    "official packaging stickers": "https://twitter.com/duanrui1205/status/1430766395562725384",
    "showing MagSafe cases": "https://twitter.com/MajinBuOfficial/status/1434270075222171650",
    "United Daily News": "https://money.udn.com/money/story/5612/5578271"
  }
}