{
  "source": "https://www.techradar.com/news/gta-5-on-ps5-and-xbox-series-x-is-more-than-a-simple-port",
  "title": "GTA 5 on PS5 and Xbox Series X is more than a 'simple port'",
  "category": "gaming",
  "updated": "2021-03-04T12:57:10Z",
  "author": "vic-hood",
  "summary": "Take-Two Interactive has no interest in straightforward remasters",
  "article": [
    "A remastered version of GTA 5 is set to hit PS5 and Xbox Series X consoles later this year, but Rockstar Games' parent company, Take-Two Interactive, has no interest in making it - or any other potential remasters - merely a \"simple port\".",
    "Speaking during the Morgan Stanley Technology, Media & Telecom Conference, earlier this week (via VGC), Take-Two's CEO, Strauss Zelnick, explained that the company doesn't necessarily see remasters becoming a bigger part of the company's strategy going forward, and it plans to approach any potential remasters differently from its competitors.",
    "\"Remastering has always been a part of the strategy,\" Zelnik said. \"We’ve done differently than the competition – we don’t just port titles over, we actually take the time to do the very best job we can making the title different for the new release, for the new technology that we’re launching it on.\"",
    "\"So, we improve the technology, we upgrade the visuals, and we make performance enhancements,\" Zelnik continued. \"And that’s why I think our remastered titles typically do so well.”",
    "GTA 5 will have released on three generations of consoles after it arrives, 'expanded and enhanced', on PS5 and Xbox Series X later this year.",
    "The remaster aims to take full advantage of the power of these new consoles, bringing with it technical improvements, visual upgrades and performance enhancements. Currently, we don't know exactly when GTA 5 will land on PS5 and Xbox Series X, or exactly what enhancements we can look forward to, but with the release window sometime in Q3/Q4 of 2021, it shouldn't be long until we find out.",
    "“We’ve done great with the Mafia series, for example, and Grand Theft Auto [V] is now heading into its third generation which is incredible\", Zelnik said of the upcoming GTA 5 remaster. “It was a standard-bearer when it was launched, it continued to be the standard-bearer in the second generation, we’ll see how Grand Theft Auto does in the next generation. Obviously, I’m confident that Rockstar is going to deliver just a great experience, but you can’t do that if you’re just doing a simple port.”"
  ],
  "headers": {
    "4": "Enhancement excitement"
  },
  "links": {
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "VGC": "https://www.videogameschronicle.com/news/rockstar-owner-discusses-remasters-strategy-says-its-not-interested-in-simple-ports/"
  }
}