{
  "source": "https://www.techradar.com/news/sony-could-ban-inappropriate-gestures-on-psvr-2",
  "title": "Sony could ban ‘inappropriate gestures’ on PSVR 2",
  "category": "wearables",
  "updated": "2021-05-10T13:17:56Z",
  "author": "rhys-wood",
  "summary": "And we’re not talking about dabbing",
  "article": [
    "A recently revealed Sony patent could allow the PlayStation maker to shadow ban (or limit the actions of) users who make use of ‘inappropriate’ gestures, language and movements in PSVR social-themed titles in future.",
    "Revealed earlier in May 2021 and reported on by UploadVR, the patent titled “Shadow Banning in Social VR Setting” was originally filed in late 2017. It won’t necessarily be used to ban players outright, but instead prevent their actions from being visible to others, similar to ‘block’ or ‘mute’ functions found on social media apps like Twitter.",
    "According to the patent, the system works by identifying possible ‘griefers’ (in layman’s terms, a user that’s playing to deliberately worsen the experience of others). If the tracked user exceeds the safety rating threshold, then the system will initiate the shadow ban.",
    "It’s interesting that Sony’s shadow banning patent has come to light now, given that we’re now getting official details for PSVR 2, expected to release sometime in 2022. Sony could be interested in implementing the system for any games or apps with social components that might release on its second-generation VR hardware.",
    "One such possibility is the revival of PlayStation Home, an ill-fated PS3 social media platform that recently saw its trademark renewed. While a trademark renewal doesn’t necessarily mean PlayStation Home will see a refresh on PSVR 2, it’s certainly the kind of experience that’s open to abuse by griefing users.",
    "While some checks and balances will surely have to be implemented as Sony continues to push virtual reality into the mainstream, monitoring systems like this could be a cause for concern for privacy-minded users.",
    "However, the patent looks to be squarely focused on multiplayer social VR apps, where actions like inappropriate hand gestures and strong language will have to be observed to curb toxicity. Hopefully, if the patent goes into full operation, Sony will be able to strike a balance between keeping users safe without encroaching on their personal privacy and security."
  ],
  "headers": {
    "3": "Sent to the shadow realm"
  },
  "links": {
    "PlayStation": "https://www.techradar.com/reviews/ps5",
    "PSVR": "https://www.techradar.com/reviews/gaming/playstation-vr-1235379/review",
    "UploadVR": "https://uploadvr.com/sony-shadow-banning-in-social-vr/",
    "Shadow Banning in Social VR Setting": "https://pdfpiw.uspto.gov/.piw?PageNum=0&docid=10994209&IDKey=44FEA206720D%0D%0A&HomeUrl=http%3A%2F%2Fpatft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D2%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPTXT%2526s1%3Dgriefers%2526OS%3Dgriefers%2526RS%3Dgriefers",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "trademark renewed": "https://www.techradar.com/news/an-upcoming-ps5-exclusive-could-be-a-weird-defunct-ps3-app"
  }
}