{
  "source": "https://www.techradar.com/news/godaddy-led-dollar50m-funding-round-for-tailor-brands",
  "title": "GoDaddy led $50m funding round for Tailor Brands",
  "category": "computing",
  "updated": "2021-07-23T19:30:42Z",
  "author": "anthony-spadafora",
  "summary": "Series C round will allow Tailor Brands to further expand its platform",
  "article": [
    "Strategic investor GoDaddy has led a $50m Series C funding round for the Israel-based logo design and branding company Tailor Brands.",
    "In addition to the web hosting giant, Israeli investment firm OurCrowd also participated in the round along with Tailor Brand's existing investors Pitango Growth, Mangrove Capital Partners, Armat Group, Disruptive VC and serial entrepreneur Richard Rosenblatt according to a new report from No Camels.",
    "Founded back in 2015, Tailor Brands was created to help streamline the brand design process and business setup for entrepreneurs looking to launch and grow their businesses. The company's platform even guides them through the process of designing a logo, building a website and creating social media content and printing merchandise.",
    "As the global appetite for website building and the rapid growth of small businesses reached new highs during the pandemic, Tailor Brands decided to move beyond simply offering an AI-powered logo maker.",
    "Now the company has built a software platform that provides small businesses and freelancers with the tools needed to launch their businesses and improve their branding. Tailor Brands now helps more than 700k new businesses launch each month with triple-digit annual growth.",
    "Tailor Brands plans to use the funds from its Series C funding round to expand its platform with a broader range of capabilities to better help small businesses.",
    "One of the company's co-founders and now CEO, Yali Saar explained in a statement how small business growth during the pandemic led it to expand its services, saying:",
    "“Once we started to really track the explosive growth of small businesses as a result of Covid, we knew that Tailor Brands could provide real value for these business owners in a fun and engaging way by removing many of the hurdles that come with establishing and marketing a new business, including consolidating all of the needed services in one place, enabling business owners to free up valuable time to focus on other important aspects of growing their companies.”",
    "Via No Camels"
  ],
  "headers": {
    "3": "From logo maker to software platform"
  },
  "links": {
    "GoDaddy": "https://www.techradar.com/reviews/godaddy",
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "new report": "https://nocamels.com/2021/07/godaddy-50m-investment-israel-tailor-brands/",
    "building a website": "https://www.techradar.com/news/the-best-website-builder",
    "global appetite for website building": "https://www.techradar.com/news/global-appetite-for-website-building-reaches-new-highs-during-pandemic",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "logo maker": "https://www.techradar.com/best/best-logo-designer",
    "No Camels": "https://nocamels.com/2021/07/godaddy-50m-investment-israel-tailor-brands/"
  }
}