{
  "source": "https://www.techradar.com/news/ant-man-3-could-see-the-return-of-an-old-mcu-villain",
  "title": "Ant-Man 3 could see the return of an old MCU villain",
  "category": "entertainment",
  "updated": "2021-05-21T14:27:13Z",
  "author": "tom-power",
  "summary": "Ant-Man and the Wasp: Quantamania may see this antagonist's return",
  "article": [
    "It sounds like production on Ant-Man and the Wasp: Quantamania is almost ready to begin. The third movie in the Ant-Man series isn't set to be released until February 2023, but filming on the superhero flick is moving closer to its start point.",
    "Michael Douglas, who has portrayed Hank Pym in the previous two Ant-Man films, told Deadline that principal photography would begin in London in July. Director Peyton Reed, meanwhile, recently tweeted that Ant-Man would utilize The Mandalorian's Volume technology, at London's Pinewood Studios, to build upon the impressive Quantum Realm visuals in the previous film.",
    "As interesting as those developments are, though, more interesting is the potential return of an Ant-Man villain. According to star Evangeline Lilly, Yellowjacket could be set for a reunion with the movie's heroes.",
    "Taking to Instagram on Friday, Lilly - who plays Hope Van Dyne/the Wasp - uploaded an image of the movie's script. The actress only showed off the front cover of the script, so any plot details or other spoilers weren't revealed.",
    "So far, so good, then, right? Wrong. In the image's caption, Lilly (or whoever runs her social media channels) posted various actors' names in a hashtag format. Those stars include the likes of Douglas, Ant-Man/Scott Lang actor Paul Rudd, and even newcomer Kathryn Newton, who will play Lang's grown up daughter Cassie in the sequel.",
    "Cast your eye to the name next to Rudd's, though, and you'll see another name mentioned that's associated with the Ant-Man movies series. Yep, it's Corey Stoll, who portrayed the villainous Darren Cross (aka Yellowjacket) in the 2015 movie, and hasn't been seen in the MCU since.",
    "Check out Lilly's photo below:",
    "Spoilers follow for Ant-Man, and Ant-Man and the Wasp.",
    "There's been no confirmation from Marvel Studios about Stoll's involvement in Ant-Man and the Wasp: Quantamania, and it's possible Lilly accidentally tagged the actor in the post.",
    "The only actors that have announced their involvement, or had it announced for them, thus far are Rudd, Lilly, Douglas, Newton, Michelle Pfeiffer (Janet Van Dyne) and Lovecraft Country's Jonathan Majors, so this is the first we've heard of Stoll's potential return.",
    "For those who may need a reminder, Cross forced Pym out of his own company in Ant-Man and had even developed a shrinking suit of his own (the Yellowjacket), which he hoped to sell to interested parties as the latest technology in modern warfare.",
    "In the film's finale, Cross takes Cassie hostage and, in order to save his daughter, Lang decides to go subatomic. He overrides his Ant-Man suit's regulator to shrink down and penetrate Cross' Yellowjacket suit, which the latter was wearing during their battle. Lang destroys Cross' suit from within, which causes it to collapse in on itself and seemingly kill Cross.",
    "Now, though, it appears that Cross might have survived - and, judging by the 'Quantamania' part of Ant-Man 3's title, we may have an idea of how he did so.",
    "Now, the below is all just speculation based on what we know about Quantumania so far - so stay with us.",
    "As Ant-Man and the Wasp revealed, Janet Van Dyne was able to survive in the Quantum Realm even though she ended up going subatomic decades earlier. If Cross' suit wasn't actually destroyed with him inside it, and was simply shrunk down to a subatomic level, he could be residing somewhere in the Quantum Realm himself. Given its tiny size, this dimension is massive, so he wouldn't even have necessarily bumped into Janet, Hank or Scott in it during their various escapades in the Quantum Realm.",
    "If Cross is still alive, he could potentially escape via one of two methods. First, if Scott, Hank, Hope and Janet continue to extract Quantum energy from this realm - as seen in Ant-Man and the Wasp's post-credits scene - he could find a way out through their expeditions into this dimension.",
    "Alternatively, he could find a way to escape that involves the movie's confirmed villain. During Disney's 2020 Investor Day (per ScreenDaily), Marvel revealed that Kang the Conqueror, who will be played by Jonathan Majors, would appear in the movie.",
    "In the comics, this time-traveling, scientific genius has all manner of technology available at his fingertips, so he wouldn't have a problem traveling to and from the Quantum Realm via other dimensions.",
    "Kang could make a pact with Cross if the latter is trapped in the Quantum Realm. If Cross helps him to infiltrate Earth to achieve whatever ambitions he has, Kang could free Cross from his Quantum Realm nightmare. That would spell bad news for Lang and company; not only because their main adversary would have returned, but because another Thanos-sized foe will have emerged.",
    "It'll be a while before we get any official news on Ant-Man and the Wasp: Quantamania, but we may get some leaked information or on-set photos once filming commences in July."
  ],
  "headers": {
    "7": "Analysis: how could Yellowjacket return in Ant-Man 3?"
  },
  "links": {
    "Deadline": "https://deadline.com/2021/05/on-my-screen-michael-douglas-the-kominsky-method-emmy-1234760410/",
    "recently tweeted": "https://twitter.com/MrPeytonReed/status/1394347827241922560",
    "The Mandalorian": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "ScreenDaily": "https://www.screendaily.com/news/disney-investor-day-2020-all-the-films-and-series-announced/5155632.article"
  }
}