{
  "source": "https://www.techradar.com/news/samsung-galaxy-tab-s7-lite-and-a7-lite-tipped-for-a-june-launch",
  "title": "Samsung Galaxy Tab S7 Lite and A7 Lite tipped for a June launch",
  "category": "tablets",
  "updated": "2021-02-21T14:30:28Z",
  "author": "david-nield",
  "summary": "More Android slates on the way",
  "article": [
    "New Samsung tablets are coming, and they're sure to be of interest to anyone after a budget Android slate: a new leak suggests the Samsung Galaxy Tab S7 Lite and the Samsung Galaxy Tab A7 Lite are getting an official unveiling in June.",
    "That's according to WalkingCat on Twitter, usually a reliable source of information, but we don't get much information about the tablets except that June 2021 launch window and the screen sizes – 12.4 inches for the S7 Lite and 8.7 inches for the A7 Lite.",
    "It does appear that the S7 Lite will come with 5G on board, or at least the option of 5G, which is something that we've heard previously too. It looks as though it might be one of the best tablet options for getting 5G at an affordable price this year.",
    "If you've got a good memory you'll recall that the Samsung Galaxy Tab S6 Lite launched in April last year, though in some markets it took a while for the slate to actually go on sale. In 2021 it would seem that Samsung is taking its time a bit more.",
    "We got the unveiling of the Samsung Galaxy Tab S7 and S7 Plus back in August, and the Lite edition will no doubt be a less powerful, more affordable version of these tablets – we already know that the screen size and design look to be the same, for example.",
    "For the S6 Lite, Samsung knocked down the display resolution, lowered the available RAM and storage options, cut down on the number of on-board speakers and made a few other minor tweaks. Expect something similar this time around.",
    "The appearance of the A7 Lite is a bit more of a surprise, because the Samsung Galaxy Tab A7 is already at the budget end of the market. It would seem in this case that the display size is getting reduced for the Lite version, from 10.4 inches to 8.7 inches.",
    "We'll no doubt hear more about these affordable tablets as we get towards June. In the meantime we're expecting the Samsung Galaxy Tab S8 later on in the year, although up to this point there's been hardly anything in the way of rumors about the device.",
    "Via Android Police"
  ],
  "headers": {},
  "links": {
    "Samsung Galaxy Tab S7 Lite": "https://www.techradar.com/news/samsung-galaxy-tab-s7-lite-and-tab-s7-lite-plus-may-be-on-the-way",
    "WalkingCat on Twitter": "https://twitter.com/_h0x0d_/status/1362336000387637252",
    "we've heard previously": "https://twitter.com/_h0x0d_/status/1362336000387637252",
    "Samsung Galaxy Tab S6 Lite": "https://www.techradar.com/reviews/samsung-galaxy-tab-s6-lite-review",
    "Samsung Galaxy Tab S7": "https://www.techradar.com/reviews/samsung-galaxy-tab-s7-and-galaxy-tab-s7-plus-review",
    "Samsung Galaxy Tab A7": "https://www.techradar.com/news/samsung-galaxy-tab-a7-with-7040-mah-battery-launched-in-india",
    "Samsung Galaxy Tab S8": "https://www.techradar.com/news/samsung-galaxy-tab-s8",
    "rumors about the device": "https://www.techradar.com/news/samsung-galaxy-tab-s8-gets-a-very-early-leak-from-samsungs-own-website",
    "Android Police": "https://www.androidpolice.com/2021/02/19/samsung-could-launch-two-new-lite-branded-tablets-this-summer/"
  }
}