{
  "source": "https://www.techradar.com/news/star-trek-picard-what-you-need-to-know-about-q-jean-lucs-omnipotent-sparring-partner",
  "title": "Star Trek: Picard: what you need to know about Q, Jean-Luc’s omnipotent sparring partner",
  "category": "entertainment",
  "updated": "2021-09-21T15:00:02Z",
  "author": "richard-edwards",
  "summary": "Q, the immortal trickster, is back to cause more mischief in Picard",
  "article": [
    "Over the past five-and-a-bit decades, Star Trek crews have repeatedly faced off against warmongering Klingons, calculating Romulans, and the technological might of the Borg. On all their voyages, however, they’ve never met a recurring foe quite like Q.",
    "An omnipotent member of the Q Continuum, this mischievous superbeing likes nothing more than tormenting Captain Picard and the crew of the USS Enterprise-D. And he’s all set to make a nuisance of himself once again, as it’s been confirmed he’s returning to resume hostilities (in the most charismatic way possible) in the upcoming Star Trek: Picard season 2.",
    "But who is Q? What are his powers, and is he a hero or a villain? And why is he so obsessed with Jean-Luc Picard? Answers to all these questions and more can be found below…",
    "Along with the assimilation-obsessed Borg, Q is the most enduring antagonist introduced by Star Trek: The Next Generation. In fact, he was a thorn in the side of Captain Jean-Luc Picard and the crew of the USS Enterprise-D from day one, cropping up in pilot episode ‘Encounter at Farpoint’ to put humanity on trial.",
    "A member of the omnipotent Q Continuum (every one of its members is also known as Q), he considered the human race warlike and barbaric, and told Picard that his crew’s actions on their mission to Deneb IV would determine the fate of the entire species. Although the Enterprise passed this particular test, Q vowed to keep his eye on them – a promise he’d go on to keep throughout The Next Generation, and beyond.",
    "American actor John de Lancie played Q in eight episodes of Star Trek: The Next Generation – episode titles often featured a shameless pun on the letter Q – and also reprised the role in Deep Space Nine and Voyager. More recently, he had a voice cameo in Lower Decks: season 1, and will soon be seen sparring with Jean-Luc once again in Star Trek: Picard season 2 when it drops in February.",
    "Away from the final frontier, de Lancie has also had significant roles in Stargate SG-1, Torchwood: Miracle Day, and Breaking Bad, where he played the air traffic controller father of Jessie’s late girlfriend, Jane Margolis (Krysten Ritter).",
    "Like all members of the Q Continuum, Q is effectively a god. As an extra-dimensional being, he is ageless, and could manipulate time and matter with a mere snap of his fingers decades before Thanos dreamed of pulling on an Infinity Gauntlet.",
    "That’s the billion-dollar question.",
    "While Q is undeniably an antagonist in the eyes of Captain Jean-Luc Picard, his actual motives are a little harder to pin down. The best way to describe him is as a mischievous agent of chaos, in the same mould as Loki. As such, his whims are driven as much by personal amusement – or selfishness – as the pursuit of some higher purpose.",
    "He largely sees the Enterprise and its crew as a play thing, notably when he decides (in The Next Generation season 1 episode ‘Hide and Q’) to put First Officer Will Riker through a series of tests to decide if he’s worthy of membership of the Q Continuum. It’s of no consequence to Q that Worf and Wesley Crusher are killed in the process – particularly as Riker is able to magic them back to life instantly.",
    "In season 4 episode ‘Qpid’, meanwhile, Q transports the Enterprise crew to Sherwood Forest for a romantic Robin Hood-themed adventure. It’s important to note that Worf is not a merry man.",
    "Despite the tomfoolery, some positives do occasionally arise from Q’s actions. In The Next Generation season 2 episode ‘Q Who’, for example, Q offers to act as the Enterprise’s guide through uncharted regions of space. When Picard rebuffs his offer – under the somewhat arrogant assumption that his crew are ready for anything – Q transports the Enterprise light years across the galaxy for their first encounter with the Borg. While Q’s behavior is rather petulant, there’s no denying that he gave Starfleet a crucial heads-up about the Collective’s existence.",
    "And Q sometimes takes on a management role within the Q Continuum, notably in season 6 episode ‘True Q’, when he arrives on the Enterprise to assess whether a Starfleet intern is actually another Q. (It turns out her parents were a pair of Qs disguised in human form.)",
    "Aside from the hubris and his obsession with taunting humans and other “lesser beings”? Not really – Q is pretty much impervious to conventional weapons. He is, however, at the mercy of other members of the Q Continuum.",
    "In season 4 episode ‘Deja Q’, he’s stripped of his powers as punishment for his repeated misbehavior, and arrives on the Enterprise looking for asylum. He finds himself at the mercy of creatures he’s wronged in the past, including bartender Guinan (who stabs him with a fork), and a gaseous species called the Calamarain who do what they can to eliminate him. When his presence puts the ship in danger (Data is almost killed by Q’s assailants), Q leaves on a shuttlecraft to protect the crew – a selfless act that prompts the Continuum to reluctantly welcome him back for a second chance.",
    "While Q’s relationship with The Next Generation crew is his defining experience with Starfleet, he also crossed paths with the crews of both Deep Space Nine and Voyager.",
    "DS9 episode ‘Q-Less’ picks up the story of Vash, the former love interest of Picard who left with Q to explore the Gamma Quadrant at the end of ‘Qpid’.",
    "In Voyager episode ‘Death Wish’, Q turns up when a Q imprisoned in a comet asks Captain Janeway for asylum. In ‘The Q and the Grey’, Q returns to Voyager asking Janeway to be the mother of his child. She declines the request but, when he has a baby with another Q, she agrees to be the child’s godmother. Q and his godson subsequently returned in ‘Q2’, with the undisciplined kid played by John de Lancie’s real-life son, Keegan.",
    "As well as his recent cameo in Lower Decks episode ‘Veritas’, Q has appeared in several novels (I,Q was co-written by de Lancie himself), and videogames.",
    "Both trailers so far hint Q will be pivotal to the new season. All the clues suggest that some serious damage has been done to the space-time continuum, with Picard seemingly finding himself in a world he doesn’t quite recognize. Indeed, we're shown a vision of a totalitarian future that Picard has to undo by traveling back to the past – it's strongly suggested that much of this is Q's doing.",
    "When Q arrives on Jean-Luc’s doorstep, telling him “you’re a bit older than I imagined” and welcoming him “to the very end of the road not taken”, it’s not entirely clear whether he’s the cause of the former Enterprise captain’s predicament – or the solution.",
    "Either is plausible.",
    "Over the years of The Next Generation, Q became somewhat obsessed with Picard – even more than he was with the Enterprise as a whole. In season 6 episode ‘Tapestry’, Q showed Picard an alternative version of his life where he hadn’t been critically injured in a bar brawl. In last-ever episode ‘All Good Things’, meanwhile – one of the all-time great series finales – he helped Picard leap back-and-forth through time on a mission to save the whole of existence.",
    "There’s clearly affection there and – while Picard has always shown a degree of ambivalence towards his omnipotent sparring partner – the duo are undoubtedly a great double act. The Picard production team will undoubtedly be hoping for sparks to fly once again.",
    "Star Trek: PIcard will air on Paramount Plus (US) and Amazon Prime Video (internationally) in February 2022.",
    "Episodes of The Next Generation, Deep Space Nine and Voyager are available to stream on Paramount Plus (US), and Netflix (US and UK)."
  ],
  "headers": {
    "3": "Who is Q?",
    "5": "Who plays Q?",
    "7": "What are Q’s powers?",
    "8": "Is Q good or bad?",
    "14": "Does Q have any weaknesses?",
    "16": "What about Q’s other Star Trek appearances?",
    "20": "How will Q fit into Star Trek: Picard season 2?"
  },
  "links": {
    "Star Trek: Picard season 2": "https://www.techradar.com/news/star-trek-picard-season-2",
    "Loki": "https://www.techradar.com/news/loki-season-2"
  }
}