{
  "source": "https://www.techradar.com/news/new-htc-vive-vr-hardware-could-be-on-the-way-according-to-this-teaser",
  "title": "New HTC Vive VR hardware could be on the way, according to this teaser",
  "category": "gaming",
  "updated": "2021-03-05T10:36:01Z",
  "author": "gerald-lynch",
  "summary": "A new headset, or a new tracking peripheral?",
  "article": [
    "Could a new HTC Vive headset be on the way? Something fresh is certainly being teased over at the official HTC Vive Twitter account, after a few quiet months for the virtual reality brand.",
    "The company has sent at a single image of a black plastic surface in close up, along with the HTC Vive logo, along with the words \"It's your move\":",
    "There's little to go on, but the hidden nature of the complete picture suggests some sort of fresh hardware is on the way.",
    "HTC has been keeping a low profile since the launch of its HTC Vive Cosmos and Vive Cosmos Elite early last year. The Vive team showed off an entry-level Cosmos build called the Cosmos Play, but it never saw a consumer release.",
    "More likely for this tease, given the \"move\" mention, is a new tracking extension peripheral, improving movement tracking beyond the wand-style controllers that come with the headset.",
    "What we'd love to see though is more from HTC's 'Project Proton' idea. It was looking like HTC's rival to the Oculus Quest 2 – two headsets, one a battery powered standalone, and the other a device powered by a phone or even a 5G stream. We're hoping to see some more from that concept in 2021, too."
  ],
  "headers": {
    "3": "What could it HTC-be?"
  },
  "links": {
    "HTC Vive": "https://www.techradar.com/reviews/htc-vive-pro",
    "HTC Vive Twitter account": "https://twitter.com/htcvive/status/1367520221372833794",
    "HTC Vive Cosmos and Vive Cosmos Elite": "https://www.techradar.com/reviews/htc-vive-cosmos-and-cosmos-elite",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}