{
  "source": "https://www.techradar.com/news/galaxy-s22-ultra-could-have-samsungs-best-camera-yet",
  "title": "Samsung Galaxy S22 Ultra leak says it may be one of the best camera phones ever",
  "category": "phones",
  "updated": "2021-04-27T09:57:54Z",
  "author": "hamish-hector",
  "summary": "The most megapixels yet",
  "article": [
    "Samsung’s next flagship handset, the Galaxy S22 Ultra, could come with a 200MP smartphone camera, according to new leaks. This would be the highest count seen on a phone from the South Korean company, though Xiaomi might just beat it in releasing the first 200MP camera phone of any brand.",
    "The latest reports come from Chinese site IT Home which cites popular leakers Ice Universe and Digital Chat Station as sources. The news follows a teaser from March where Samsung Exynos, the company’s chipmaking division, shared a tweet showing off a 200MP phone camera.",
    "Given that the Samsung Galaxy S21 Ultra is already one of the best smartphones for photographers, the rumored Galaxy S22 Ultra currently looks set to cement the brand at the top of the list for 2022. Unfortunately, we’ll likely have to wait until then to know for sure as the Galaxy S22 series isn’t expected to launch until next year.",
    "This answer is very much a subjective one, but if you’re constantly taking snaps with your phone the answer probably leans more towards yes. More megapixels from a camera will often lead to much better picture quality.",
    "In simple terms, when you snap a shot your phone creates an image made up of pixels to match what it sees. High megapixel cameras create images using more pixels, making colors clearer and objects more defined.",
    "That isn't strictly true of all smartphone cameras, but it generally means a better image than a low megapixel count.",
    "On the flip side, your phone will need a pretty powerful processor to be able to handle the size of the image, and your storage might fill up way faster than with smaller pictures. That said, previous Samsung flagship phones have been well equipped to handle these elements.",
    "With more power and memory than the non-Ultra versions, it makes sense that the Galaxy S22 Ultra would be able to make such big improvements to its camera setup, though we wonder what upgrades the regular Galaxy S22 could see to its camera. We’ll just have to wait a little longer to find out."
  ],
  "headers": {
    "3": "Do I need a 200MP smartphone camera?"
  },
  "links": {
    "Galaxy S22 Ultra": "https://www.techradar.com/news/samsung-galaxy-s22",
    "IT Home": "https://www.ithome.com/0/548/365.htm",
    "200MP phone camera": "https://twitter.com/SamsungExynos/status/1373915251855491072?s=20",
    "Samsung Galaxy S21 Ultra": "https://www.techradar.com/reviews/samsung-galaxy-s21-ultra-review",
    "best smartphones for photographers": "https://www.techradar.com/news/best-cameraphone",
    "Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22"
  }
}