{
  "source": "https://www.techradar.com/news/amazons-smart-thermostat-is-down-to-its-lowest-price-ever-just-two-months-after-launching",
  "title": "Amazon’s smart thermostat is down to its lowest price ever - just two months after launching",
  "category": "smart-home",
  "updated": "2021-12-08T10:45:00Z",
  "author": "carrie-ann-skinner",
  "summary": "Act now to get the Amazon Smart Thermostat for less",
  "article": [
    "Amazon has slashed 20% off the price of its new smart thermostat in the US, reducing it from $69.99 to just $47.99. This is a new record-low price for the Amazon Smart Thermostat, which was only launched in September this year. (Not in the US? Scroll down for the best smart thermostat deals in your region.)",
    "The best smart thermostats ensure that you can save energy as well as money by enabling you to control your heating even when you’re not at home. However, they can be a costly purchase, so a good deal is always welcome.",
    "Smart home devices have been around for almost a decade, but when it comes to uptake consumers are proving slow to embrace an automated home. According to Statista, only around 43% percent of US households own at least one smart home device, up from 33% in 2019.",
    "However, it appears that Amazon is looking to ramp up adoption, in part by increasing its range of smart home products, which started with smart speakers and smart displays and has since expanded to include video doorbells and home security cameras (through the Ring and Blink brands it acquired) as well as smart plugs and now smart thermostats. We’re sure it won’t be long before Amazon-branded smart lights appear.",
    "However, Amazon is also offering substantial price cuts across its smart home device range to make them more attractive to consumers. The Amazon Smart Thermostat has only been available for two months, and wasn’t discounted in the Black Friday sales, but has now been reduced by 20%.",
    "This is certainly a savvy move by Amazon when consumers across the globe are seeing energy prices rising and are looking for simple ways to reduce their consumption – something a smart thermostat can help with – and it’ll help to get more of the company’s devices into more of our homes, with Alexa ruling the roost",
    "So how long before our households are filled with Amazon smart home devices and Alexa rules the roost? It may be sooner than you think.",
    "No matter where you live, you'll find all the lowest prices for smart thermostats from around the web right here, with offers available in your region."
  ],
  "headers": {
    "2": "Opinion: Slashing prices is part of Amazon's plan to take over your home",
    "7": "More smart thermostat deals"
  },
  "links": {
    "$69.99 to just $47.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J4C8871%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9910763392322402000-20",
    "Amazon Smart Thermostat": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB08J4C8871%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-3770472916108296000-20",
    "best smart thermostats": "https://www.techradar.com/news/best-smart-thermostat"
  }
}