{
  "source": "https://www.techradar.com/news/cyberpunk-2077-has-a-pc-mod-that-lets-you-play-in-third-person-but-there-are-bugs",
  "title": "Cyberpunk 2077 has a PC mod that lets you play in third-person – but there are bugs",
  "category": "gaming",
  "updated": "2021-01-05T10:08:41Z",
  "author": "darren-allan",
  "summary": "The mod is still a work in progress, and rather buggy in its current incarnation",
  "article": [
    "Cyberpunk 2077 now has a mod that allows PC gamers to experience the open world RPG from a third-person viewpoint.",
    "As you’re no doubt aware, the game is normally played in first-person – aside from when driving, which allows you to select from a couple of perspectives from behind the vehicle – but some folks have expressed the desire to play in third-person all the time (or at least dip into that view).",
    "Now that’s a reality with the ‘JB – TPP’ mod, made by Jelle Bakker, which gives you a third-person perspective (in fact, there’s a choice of four camera views to cycle through) albeit with caveats, as the mod is clearly labelled as a work in progress.",
    "As Tom’s Hardware points out having tested the mod, it works well enough in more open areas – with some glitches – but can seemingly fail quite badly indoors, particularly in more confined spaces like an elevator, where there’s little room to maneuver.",
    "There are some serious camera issues to iron out, in short, and the big problem here is that engaging in aiming and firing weapons results in some very weird animations. Even so, those flaws might be cured as the mod is worked on further, so this would seem to be one to watch for those who would prefer to ditch Cyberpunk 2077’s first-person perspective.",
    "You can download it from Nexus Mods, with installation instructions provided there (check out the video clip below to see the mod in action, too). There’s already a list of bugs which are being fixed, such as the main character’s head disappearing (that has apparently already been resolved, with the fix applied in version 4 of the mod which is incoming).",
    "There’s a whole host of mods out for Cyberpunk 2077, and they allow you to tweak the game in all sorts of ways, including things like the addition of a zoom function for the mini-map, better vehicle handling – let’s face it, driving a car is pretty twitchy – and much more besides."
  ],
  "headers": {
    "4": "Misfiring animations"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "Tom’s Hardware": "https://www.tomshardware.com/uk/news/cyberpunk-2077-pc-mod-enables-third-person-view",
    "Nexus Mods": "https://www.nexusmods.com/cyberpunk2077/mods/669"
  }
}