{
  "source": "https://www.techradar.com/news/alexa-turns-security-guard-to-monitor-your-home-and-call-emergency-services-for-you",
  "title": "Alexa turns security guard to monitor your home and call emergency services for you",
  "category": "smart-home",
  "updated": "2021-02-01T09:48:58Z",
  "author": "carrie-ann-skinner",
  "summary": "Guard Plus feature works with Amazon Echo smart speakers and Ring and Blink security cameras",
  "article": [
    "Alexa is great at setting timers, updating you on your daily appointments and controlling your smart home gadgets, but now the voice assistant has a new trick up its sleeve; acting as a security guard and monitoring your home when you’re not there.",
    "As part of the new Guard Plus Feature, which is currently only available in the US, you’ll get an alert to your smartphone if Alexa identifies an unusual sound such as glass breaking or footsteps when you’re not at home.",
    "In response to the unusual sounds, Alexa can also activate a siren on your Amazon Echo smart speaker, or if a compatible home security camera detects motion outside your home, Alexa can play the sound of dogs barking, in a bid to scare any intruders off.",
    "The smartphone alert will also allow you to play back the sound Alexa heard, or listen in live to your home, so you can hear for yourself what’s going on – just as you might do with a home security camera.",
    "The service will also automatically control any compatible smart lights you have, turning them on and off to appear as if someone is at home.",
    "Alexa can also call the emergency services for you too. If you say “Alexa, call for help” you’ll be put through to the Guard Plus call center, which can dispatch the necessary emergency service to your home.",
    "The Guard Plus feature, which is currently only available in the US, costs $4.99 (about £3.50 / AU$6.50) per month or $49.99 (about £35 / AU$65 ) for a year, although a 30-day free trial is also available.",
    "It comes as standard as part of the Ring Protect Plus service for Ring Video Doorbells and security cameras, which is priced at $10 per month (£7 / AU$13) or $100 (£70 / AU$130) a year. You will need to link your Ring and Amazon accounts together in the Ring App to access the Guard Plus features. The service only works with the Amazon Echo (4th generation) Amazon Echo Dot (both 3rd and 4th generation versions), Echo Show (2nd generation and above) and the Amazon Echo Studio."
  ],
  "headers": {
    "3": "Listen in live"
  },
  "links": {
    "Alexa": "https://www.techradar.com/how-to/the-best-amazon-echo-alexa-skills-and-how-to-install-them",
    "smart home gadgets": "https://www.techradar.com/news/smart-home-devices",
    "Guard Plus Feature": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fb%3Fie%3DUTF8%26node%3D18021383011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1248210644973869000-20",
    "smartphone": "https://www.techradar.com/news/best-phone",
    "Amazon Echo smart speaker": "https://www.techradar.com/news/best-amazon-echo-speaker-the-lineups-dots-spots-shows-and-pluses-compared",
    "home security camera": "https://www.techradar.com/news/best-home-security-camera",
    "smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "Ring Video Doorbells": "https://www.techradar.com/reviews/ring-video-doorbell-3-plus-review",
    "Amazon Echo Dot": "https://www.techradar.com/reviews/audio-visual/hi-fi-and-audio/audio-systems/amazon-echo-dot-1328595/review",
    "Echo Show": "https://www.techradar.com/reviews/amazon-echo-show-review",
    "Amazon Echo Studio": "https://www.techradar.com/reviews/amazon-echo-studio-review"
  }
}