{
  "source": "https://www.techradar.com/news/twinkly-flex-brings-neon-sign-style-lighting-to-your-smart-home",
  "title": "Twinkly Flex brings neon-sign style lighting to your smart home",
  "category": "smart-home",
  "updated": "2021-06-15T13:51:56Z",
  "author": "jess-weatherbed",
  "summary": "Ambient app-controlled lights",
  "article": [
    "Twinkly is already well known for offering some of the best smart lights on the market, especially with its range of full RGB app-controlled string lights. While string and net lights are typically seen as holiday lighting, Twinkly has now made its dramatic entrance into the world of light strips with two new products - the Twinkly Line and the Twinkly Flex.",
    "Line and Flex are both integrated within the existing Twinkly ecosystem, allowing you to fully control effects, colors and even create custom animations using the official Twinkly mobile app. This also means that multiple products can be connected and easily configured via Wi-Fi and Bluetooth, creating a full thematic experience for your home, regardless of the placement or location of the lights.",
    "Smart lighting isn't something new on the scene, but the customizable Twinkly ecosystem creates more market choices for people outside of other products like the Phillips Hue range of bulbs and lightstrips. Colorful room lighting has been booming in popularity in recent years with products like Nanoleaf creating a buzz within online communities, often featuring in the backdrop of many popular content creators. In this market, we're sure the new additions to the Twinkly family will prove extremely popular given the spectrum of creative possibilities. Twinkly Line is a self-adhesive and magnetic strip of exposed LED lights that can be physically manipulated into patterns and shapes to create wall art, or placed around items like TV back panels and furniture, while the Twinkly Flex is a diffused, flexible LED Light tube that can be adapted into different shapes to emulate retro neon-style signs and designs. Similarly, websites like Neon Beach offer nostalgic lighting using LEDs to emulate more expensive glass-blown genuine neon, which has made the 'night club' chic more accessible to the public.",
    "Twinkly Line will be available in two sizes, a powered 1.5 metre 'starter kit' for around $115 / £80 / €88 , and an 1.5 meter unpowered extension available for around $55 / £39 / €45. Twinkly Flex is currently available in one size and will cost you $120 / £85 / €98. Both products are available to buy from June 15 2021 and can be purchased through the following retailers, though Twinkly has also historically sold across sites like Amazon:",
    "Luminal Park for EU customers",
    "Esbenshade for US customers",
    "Festive Lights for the UK market",
    "Power Scandinavian countries"
  ],
  "headers": {
    "2": "Take ambience to another level",
    "3": "Where to buy"
  },
  "links": {
    "best smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "full RGB app-controlled string lights": "https://www.techradar.com/news/razer-rgb-christmas-lights-are-a-thing-now-so-i-created-a-monster",
    "Phillips Hue": "https://www.techradar.com/reviews/gadgets/appliances/philips-hue-1124842/review",
    "Nanoleaf": "https://www.techradar.com/reviews/nanoleaf-light-panels",
    "Neon Beach": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1331055557982406100&xs=1&url=https%3A%2F%2Fneonbeach.com%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Ftwinkly-flex-brings-neon-sign-style-lighting-to-your-smart-home",
    "Luminal Park": "https://www.luminalpark.com/",
    "Esbenshade": "https://www.esbenshades.com/",
    "Festive Lights": "https://www.festive-lights.com/",
    "Power": "https://www.power.no/"
  }
}