{
  "source": "https://www.techradar.com/news/how-does-a-pos-system-work",
  "title": "How does a POS system work?",
  "category": "pro",
  "updated": "2021-07-29T08:42:56Z",
  "author": "francesca-nicasio",
  "summary": "Curious about how point of sale systems work? This guide walks you through the entire process.",
  "article": [
    "Ringing up sales looks simple enough to the casual observer: customer hands over their item, cashier scans the barcode, the total amount due is presented and payment is taken promptly before the purchase is complete.",
    "It’s a straightforward enough process, but many don’t realize is that there’s more to accepting a payment and processing a transaction at the point of sale. If you’re curious to learn about how the best (POS) systems work, keep reading.",
    "This post covers the ins and outs of modern POS hardware, POS software and how the two work together to create a seamless customer payment experience.",
    "Let’s get started.",
    "A POS system — sometimes referred to as an ePOS system — enables customers to successfully buy their chosen products from your store at the point of purchase. When we say POS system we’re referring to the hardware and software that allow cashiers to ring up sales.",
    "Popular POS brand, Square, encapsulate the complexity and simplicity of a POS system with this excellent definition: \"A POS system allows your business to accept payments from customers and keep track of sales. It sounds simple enough, but the setup can work in different ways, depending on whether you sell online, have a physical storefront, or both.\"",
    "mPOS vs. POS vs. ePOS: what's the difference?",
    "While many consider POS and ePOS as the same thing, in some countries like the UK, the two terms have an important distinction: POS systems are traditional cash registers while ePOS systems are their electronic counterparts.",
    "An mPOS system is a mobile point of sale system that is easily portable to help you accept payments with total flexibility. mPOS systems are especially popular with mobile business such as food trucks.",
    "You may also hear POS systems referred to as soft POS. Soft POS systems allow merchants to process secure, contactless payments from NFC-enabled mobile and tablet devices using a POS software application only, no hardware needed. With soft POS systems, customers can use a digital wallet such as Google Pay or Apple Pay to purchase items.",
    "Soft POS systems are the next wave of transaction processing, steadily growing in demand. They eliminate hardware costs, saving your business money on card terminals and receipt printers. As by-product of this, they're also much more environmentally friendly than traditional POS systems.",
    "The standalone term POS seems to be more popular in countries like the US and Australia, while “ePOS” or an an electronic POS system, is more widely used in the UK.",
    "Which brings us to our next point...",
    "Think of cash registers as the analog version of modern POS systems (or ePOS systems if you’re in the UK). The former is a device whose main purpose is to ring up sales, while the latter is an integrated system that not only facilitates the checkout process, but also helps you manage your inventory, market to your customers, and run your business as a whole.",
    "Cash registers focus on just sales. They don’t sync with your inventory system, provide you with any reports, or “talk” to your other business apps.",
    "Sometimes a POS system is referred to as a POS cash register, but the two are distinctly different. A POS system has more business and employee management capabilities, and can also connect with other platforms that you’re using in your business.",
    "Get a quote for a POS system today.",
    "We can’t talk about how POS systems work without first discussing its components. Generally, POS systems are composed of two tightly connected parts: POS hardware and POS software.",
    "The hardware covers the equipment or devices used to carry out the checkout process. They include:",
    "Not all POS systems will have every single device above. If you send out email receipts for example, then you don’t need a receipt printer. If you only accept credit card payments or do business on-the-go, then a cash drawer isn’t necessary.",
    "The two must-haves in any POS system are the display and payment terminal.",
    "The software is the program that’s running your POS. The look, feel, and functionality of your POS software will vary from one provider to another, but most modern systems will have the following features:",
    "On-premise vs. cloud-based",
    "POS software can also be classified as either being cloud-based or on-premise (on-site). The former can be accessed over the internet, while the latter is hosted locally on your own server or computer.",
    "Cloud-based point of sale systems usually work through a SaaS (Software as a Service) model, and providers charge a subscription fee for the software. On-premise POS systems are installed on your computer, and you typically have to pay for the software upfront or pay a licensing fee.",
    "Many are opting for cloud-based software because they’re more accessible and scalable. With cloud-based solutions, you can access the software from any device as long as you have an internet connection, making it easy to check in on business.",
    "Updates happen automatically, and you simply have to download the latest version of the software.",
    "With on-premise software, the solution “lives” in your device or server, so you’re in charge of maintaining and updating the software. Businesses that prefer to have their data on-site are usually the ones that choose on-premises software.",
    "The best POS systems work when the components mentioned above function seamlessly together to enable the transaction. Think of it this way: the hardware and software of your POS solution “talk” to each other to make the sale happen.",
    "Here’s how:",
    "Things kick off when a sale is initiated by the cashier. That is, when they scan a product or enter it into the sale screen. At this stage, the POS software populates the sale screen with each line item. It displays the product along with the price, and the total amount owed.",
    "On the backend, the software is syncing with its inventory management and adjusts the stock levels based on the quantities purchased by the customer.",
    "While all that is happening, the cashier tells the customer the amount due and the shopper selects a payment method. If the customer pays electronically via credit card or their mobile device, it triggers the payment terminal to come into play. The customer follows the prompts on the terminal and goes through with the sale. If they’re paying cash, they can just hand the amount to the cashier.",
    "The cashier confirms the amount on their end. Then, the receipt printer is triggered and prints the receipt. For cash transactions, the printer sends a signal to the cash drawer to open when necessary.",
    "Note: Other things can take place, depending on the store. For instance, some stores have a loyalty program, in which case the customer gives the cashier their member details. Other times, the merchant may ask the shopper to enter their contact information. These things can happen before or after the payment step, depending on the store’s setup.",
    "Behind the scenes, the software is also working to keep everything in check. Stock levels are updated and data is fed into the system’s reporting and analytics. If customer details or loyalty data are captured, the system also stores that in its database.",
    "The work of your POS or ePOS system doesn’t end when the transaction is over. As mentioned previously, newer point of sale systems can help you run multiple components of your business, including inventory and customer management, finances, analytics, and more.",
    "Consider the following:",
    "Whenever you make a sale, your POS software logs the transaction and updates your stock level. Let’s say you’re a clothing boutique, and at the beginning of the day, you had 50 large maxi skirts in stock. Throughout the day, you sold 25 of those dresses. If everything is working correctly, your POS system would’ve recorded those 25 transactions and modified your stock levels accordingly.",
    "A POS system that tracks your inventory becomes particularly handy if it’s able to connect with your other sales channels. Going back to the maxi dresses example, if you sold an additional 10 dresses online, then your system should take those sales into account and update your overall inventory levels.",
    "Your POS system and payment processor work hand in hand. For best results, opt for an integrated payment solution, wherein your restaurant POS system or retail POS software interfaces directly with your payment processor. That way, when a customer makes a payment via credit card, their payment data directly feeds into your POS and you can ring up sales faster.",
    "While it is possible to opt for non-integrated payments, this setup will require cashiers to manually key in payment data into the POS, which makes the experience more cumbersome.",
    "POS integrated payments also make end of day reconciliation easier. Instead of manually checking receipts against all your transactions, an integrated payment solution automates the process, thus saving time and minimizing errors.",
    "One of the great things about a modern POS or ePOS system is having easier access to data and insights. Unlike traditional cash registers, which only record transactions, POS systems can track and analyze sales, inventory, and customer data, which then leads to powerful reporting and analytics.",
    "The best POS systems in the market make it easy to track important metrics in your business and many allow you to filter data so you can easily find the information you need.",
    "For instance, if you’d like to generate sales reports for a given time period, product category, or even customer group, a solid POS system will help you do that. Want to figure out what your top sellers are or how fast stock is moving? There are plenty of POS solutions that can crunch the numbers at the drop of a hat.",
    "These things simply aren’t possible with a clunky cash register, and it’s one of the many reasons why more and more businesses are switching to new and trusty POS systems."
  ],
  "headers": {
    "4": "What is a POS system?",
    "13": "POS systems vs. cash registers",
    "17": "Key components of a POS system",
    "28": "How POS systems work: different components coming into play",
    "36": "It doesn’t stop there: POS systems play an important role after the transaction",
    "40": "Integrated POS systems provide the best POS solution"
  },
  "links": {
    "best (POS) systems": "https://www.techradar.com/news/the-best-pos-system",
    "POS hardware": "https://www.techradar.com/news/pos-hardware-how-to-find-the-best-retail-equipment-for-your-business",
    "Square": "https://squareup.com/us/en/townsquare/what-pos-system",
    "food trucks": "https://www.techradar.com/news/best-pos-system-for-food-trucks",
    "Get a quote for a POS system today.": "https://www.techradar.com/news/get-a-quote-for-a-pos-system-today",
    "cloud-based or on-premise (on-site)": "https://www.techradar.com/news/cloud-vs-a-new-on-premises",
    "integrated payment solution": "https://www.techradar.com/news/why-integrated-pos-systems-are-a-must-for-your-business"
  }
}