{
  "source": "https://www.techradar.com/news/full-galaxy-z-fold-3-and-galaxy-z-flip-3-leaks-reveal-all-about-samsungs-foldables",
  "title": "Full Galaxy Z Fold 3 and Galaxy Z Flip 3 leaks reveal all about Samsung's foldables",
  "category": "phones",
  "updated": "2021-08-10T12:14:26Z",
  "author": "david-nield",
  "summary": "Just about every detail revealed",
  "article": [
    "We haven't exactly been short of leaks around the Samsung Galaxy Z Fold 3 and the Samsung Galaxy Z Flip 3 up to this point – but if you wanted another huge one before the official unveiling on August 11, you're in luck.",
    "WinFuture has the scoops, posting full specs lists for both the Galaxy Z Fold 3 and the Galaxy Z Flip 3, together with some renders that match up with the leaked images we've already seen published.",
    "While there are no real surprises in this new batch of information, it's the most comprehensive summary of everything that's on the way that has surfaced to date. The foldables are expected to launch alongside the Galaxy Watch 4, the Galaxy Watch 4 Classic, and the Galaxy Buds 2.",
    "The Galaxy Z Fold 3 is said to be coming with a 7.6-inch, 2208 x 1768 pixel, 120Hz main screen, with a Snapdragon 888, 12GB of RAM and either 256GB or 512GB of storage inside. There's a triple-lens 12MP+12MP+12MP rear camera too.",
    "The battery capacity is listed as 4,400mAh and we've got IPX8 water resistance here too apparently. Phantom Green, Phantom Black and Phantom Silver are listed as the colors, and the starting price is down as €1,899 (about $2,235 / £1,610 / AU$3,035).",
    "As for the Galaxy Z Flip 3, WinFuture's sources say it'll have a 6.7-inch, 2640 x 1080 pixel, 120Hz main screen, and again be powered by the Snapdragon 888. It's also going to have 8GB of RAM and either 128GB or 256GB of internal storage. There's a dual-lens 12MP+12MP rear camera, apparently.",
    "The battery capacity is smaller at 3,300mAh, but there is the same IPX8 water resistance, and you'll be able to get it in Phantom Black, Cream or Lavender if these leaks are right. Pricing is said to start at €1,099 (about $1,290 / £930 / AU$1,755).",
    "As with any leak, it's worth remembering that these specs are by no means official yet – though WinFuture is one of the most reliable sources around, and this information does match what we've previously heard about these foldable phones.",
    "You don't have to be a mobile industry analyst to see how Samsung is positioning these handsets, based on these specs: the Galaxy Z Fold 3 is the premium, ultra-flagship for those who can afford it. It's rumored to have S Pen support as well, emphasizing its place as the Galaxy Note 21 replacement for 2021.",
    "The Galaxy Z Flip 3 is hardly cheap – and it still packs a top-tier Snapdragon 888 processor – but Samsung has clearly cut some corners to make it as affordable as possible, and to tempt more users into going for a foldable phone for their next upgrade."
  ],
  "headers": {
    "3": "Those specs in full",
    "7": "Analysis: a two-tier foldable approach"
  },
  "links": {
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "WinFuture": "https://winfuture.de/",
    "Galaxy Z Fold 3": "https://winfuture.de/news,124471.html",
    "Galaxy Z Flip 3": "https://winfuture.de/news,124474.html",
    "already seen published": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-flip-3-image-and-specs-leak-online-ahead-of-unpacked",
    "Galaxy Watch 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Watch 4 Classic": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Galaxy Buds 2": "https://www.techradar.com/reviews/samsung-galaxy-buds-2",
    "Galaxy Note 21": "https://www.techradar.com/news/samsung-galaxy-note-21",
    "as affordable as possible": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-be-surprisingly-affordable"
  }
}