{
  "source": "https://www.techradar.com/news/nvidia-gpus-continue-to-dominate-amd-in-the-steam-hardware-survey",
  "title": "Nvidia GPUs continue to dominate AMD in the Steam Hardware Survey",
  "category": "computing",
  "updated": "2021-06-03T10:28:29Z",
  "author": "matt-hanson",
  "summary": "Nvidia RTX 3060 and RTX 3070 see some big wins",
  "article": [
    "Nvidia GPUs continue to be the most popular choices for PC gamers, if May’s Steam Hardware Survey is correct.",
    "The Survey asks Steam users to share the hardware they are using, and thanks to the sheer number of people who use Steam to buy and play games, it usually gives us a pretty good idea of what’s hot – and what’s not – when it comes to the gear PC gamers are using.",
    "May’s results, then, will be pleasant reading for Nvidia. Not only does it dominate the top 20 of most-used GPUs (with only two aging AMD cards getting a look in), but its new RTX 3000 series cards are gaining traction.",
    "The biggest growth is seen by the RTX 3060 and RTX 3070, which both grew by 0.10% from the month before. This is particularly impressive considering how hard it’s been to actually get hold of one of these cards.",
    "Meanwhile, AMD’s new Radeon 6000 GPUs are still not on the list, a rather worrying state of affairs for Team Red. Overall, Nvidia accounts for 75.63% of GPUs in Steam user’s PCs, with AMD on just 16.18%.",
    "Nvidia’s numbers could continue to grow with the imminent launches of the RTX 3080 Ti and RTX 3070 Ti, especially if it produces enough stock of these cards to get into the hands of gamers.",
    "While the GPU situation may not be good for AMD, the CPU situation is better, as it continues to chip away market share from Intel.",
    "According to the latest results, AMD processors now account for 30% of CPUs used in the survey for the first time. That still leaves Intel on 70%, but there definitely feels like a continued shift towards AMD, which will make Intel uncomfortable.",
    "The other results show that Windows 10 is by far the most popular operating system, 16GB the most popular amount of RAM, and the Nvidia GeForce GTX 1060 is the most popular GPU.",
    "The popularity of that aging card may come as a surprise, however the most used resolution remains 1080p, which explains why ultra high-end cards like the RTX 3090 are just not that popular – for many people, that level of power (and high price tag) is just not worth it. AMD could use that to its advantage and better target the budget and mid-range (traditionally its strongest markets) to put pressure on Nvidia.",
    "If it doesn’t do something, then PC gamers look likely to continue to shun AMD GPUs, at least according to Steam Hardware Surveys.",
    "Via TechSpot"
  ],
  "headers": {
    "6": "Better CPU news"
  },
  "links": {
    "May’s results": "https://store.steampowered.com/hwsurvey/",
    "RTX 3060": "https://www.techradar.com/reviews/evga-geforce-rtx-3060-black-xc",
    "RTX 3070": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070",
    "Radeon 6000 GPUs": "https://www.techradar.com/news/amd-big-navi",
    "RTX 3080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080-ti",
    "RTX 3070 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3070-ti",
    "Windows 10": "https://www.techradar.com/reviews/pc-mac/software/operating-systems/windows-10-1267364/review",
    "Nvidia GeForce GTX 1060": "https://www.techradar.com/reviews/pc-mac/pc-components/graphics-cards/nvidia-geforce-gtx-1060-1325075/review",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "TechSpot": "https://www.techspot.com/news/89904-rtx-3060-rtx-3070-biggest-winners-may-steam.html"
  }
}