{
  "source": "https://www.techradar.com/news/moto-g60-leaks-suggest-it-will-be-another-impressive-motorola-mid-ranger",
  "title": "Moto G60 leaks suggest it will be another impressive Motorola mid-ranger",
  "category": "phones",
  "updated": "2021-03-20T12:30:22Z",
  "author": "david-nield",
  "summary": "More details drop",
  "article": [
    "There's already lots to look forward to when it comes to Moto phones this year, and now there's another value-for-money handset we can add to the list of ones that we're already anticipating: the Moto G60.",
    "As revealed by sources speaking to XDA Developers, the phone will apparently come with a 6.78-inch AMOLED or LCD screen running at a resolution of 1080 x 2460 pixels. Significantly, the refresh rate will go all the way up to 120Hz.",
    "We can also look forward to a triple-lens rear camera led by a 108MP primary sensor, and a 32MP selfie camera on the front. Some new camera app tricks are apparently in the pipeline too, including dual capture video and a document capture mode.",
    "As for the internal specs, it seems as though we're looking at 4GB or 6GB of RAM and 64GB or 128GB of internal storage. XDA Developers hasn't discovered the CPU that the phone will be running, but TecknikNews thinks that it's the Qualcomm Snapdragon 732G.",
    "Motorola phones often impress in terms of battery capacity, and it would seem that the Moto G60 is going to be no different: the upcoming handset is tipped to be arriving with a capacious 6,000 mAh battery on board.",
    "While there's no exact release date for the phone in these leaks, it shouldn't be too long before the handset arrives on the scene. It's already passed through the necessary regulatory bodies in India and the US.",
    "We've already seen the likes of the Moto G10 this year, but there's plenty more to come: we're expecting the powerful Snapdragon 870-powered Moto G100 to be unveiled in the near future, which is actually going to be a tweaked version of the Moto Edge S.",
    "We've also heard talk about new entries in the Moto E series of handsets, so it looks as though Motorola will have you covered across multiple price points once again this year. We will of course bring you details of all these handsets as they launch."
  ],
  "headers": {
    "4": "What happens next?"
  },
  "links": {
    "Moto phones": "https://www.techradar.com/news/best-moto-phones",
    "XDA Developers": "https://www.xda-developers.com/motorola-moto-g60-specs-leak/",
    "TecknikNews": "https://www.techniknews.net/news/motorola-g100-hanoip-und-g50-neue-smartphones-kommen-exklusiv/",
    "Moto G10": "https://www.techradar.com/reviews/moto-g10-review",
    "Moto G100": "https://www.techradar.com/news/motorola-leak-suggests-its-new-affordable-flagship-phone-may-launch-soon",
    "Moto Edge S": "https://www.techradar.com/news/moto-edge-s-with-snapdragon-870-goes-official",
    "heard talk": "https://www.techradar.com/news/moto-g10-g30-and-g100-could-land-soon-alongside-three-other-cheap-phones"
  }
}