{
  "source": "https://www.techradar.com/news/what-are-lg-nanocell-tvs",
  "title": "Should I buy an LG NanoCell TV?",
  "category": "televisions",
  "updated": "2021-11-05T18:37:13Z",
  "author": "andrew-williams",
  "summary": "LG NanoCell TVs explained",
  "article": [
    "What are LG NanoCell TVs? You might be familiar with LG’s OLED TV range – the LG C1, LG G1, and more. But the NanoCell televisions that sit alongside them often get less headline attention, and we want to fix that.",
    "These so-called ‘NanoCell’ screens make up LG’s mid-range and upper entry-level LCD TVs – the best LG TVs that don’t feature OLED panels, basically. The unspoken aim here is to offer an alternative to Samsung’s excellent QLED TVs, while designating the top tier of LG’s LCD panel televisions.",
    "Recently, LG’s Mini LED TV range of 'QNED' screens has started to roll out worldwide. This brings the company's exciting new combination of NanoCell LCD and Mini LED backlighting to the world for the first time.",
    "But what is LG NanoCell TV tech? How does it compare to Samsung QLED? And should you consider buying an LG NanoCell TV? Read on for everything you need to know below.",
    "Fewer local dimming zones mean you’ll see blooming around bright objects. It will be particularly noticeable if you watch a film with subtitles, to the extent you’ll probably want to turn the feature off when watching foreign language movies.",
    "These contrast issues are why the most attractive LG TVs with NanoCell are not its ‘NANO’ TVs at all, but its new-for-2021 QNED screens. This range combines a NanoCell layer with a Quantum Dot color enhancer and miniLED panel.",
    "Mini LED panel tech is the most interesting thing to happen to LCD TVs in some time. It sees the LEDs in the backlight shrink, so that many, many more can fit into the display.",
    "LG says the top-end 86-inch QNED set will have around 30,000 backlight LEDs, split into a little under 2500 zones. That’s close to 80 times more zones than the LG NANO90.",
    "However, don’t name your TV fund ‘QNED’ just yet. These sets are likely to use IPS panels still, and we don’t know quite how effective a massively increased number of dimming zones will be at improving this panel technology’s limited contrast.",
    "LG NANO99 (2020)",
    "LG NANO96 / NANO95 (2021)",
    "LG NANO90 / LG NANO91 (2020)",
    "LG NANO88 (2021)",
    "LG NANO86 (2020)",
    "LG NANO816 / NANO806 (2020)"
  ],
  "headers": {},
  "links": {
    "OLED TV": "https://www.techradar.com/news/best-oled-tvs-our-pick-of-the-best-oled-televisions-you-can-buy-today",
    "LG C1": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "LG G1": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "best LG TVs": "https://www.techradar.com/best/best-lg-tv",
    "OLED": "https://www.techradar.com/news/what-is-oled",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "Mini LED": "https://www.techradar.com/news/mini-led-tv",
    "'QNED' screens": "https://www.techradar.com/news/lg-mini-led-tvs-are-rolling-out-but-can-they-take-on-oled",
    "NanoCell": "https://www.techradar.com/news/what-are-lg-nanocell-tvs",
    "subtitles": "https://www.techradar.com/news/subtitles-tv-streaming-service-netflix-amazon-hulu-disney-plus",
    "QNED": "https://www.techradar.com/news/what-is-qned"
  }
}