{
  "source": "https://www.techradar.com/news/we-almost-cant-believe-these-lipstick-inspired-wireless-earbuds-exist",
  "title": "We almost can't believe these lipstick-inspired wireless earbuds exist",
  "category": "audio-visual",
  "updated": "2021-10-25T16:00:10Z",
  "author": "rhys-wood",
  "summary": "Is this a case of form over function?",
  "article": [
    "The latest iteration of the Huawei FreeBuds lineup of true wireless earbuds is almost here, but they might be a bit more of a novelty than we're used to from the brand. Coming in the form of the Huawei FreeBuds Lipstick, the product looks to very much wear its design inspirations on its sleeve.",
    "As reported by What Hi-Fi?, the Huawei FreeBuds Lipstick succeed the FreeBuds Studio earbuds released earlier in the year. This new pair launches on November 10, 2021, and will set you back £200 (around $275 / AU$368). That's not quite as pricey as the best-in-class Sony WF-1000XM4 wireless earbuds, but are on par with the NuraTrue, meaning the FreeBuds Lipstick has some work to do to impress serious audiophiles.",
    "The earbuds themselves, along with the charging case, certainly look fantastic. But they're not just made to be pretty. While the buds feature an eye-catching red aesthetic, the charging case is built from stainless steel to be resistant to wear and corrosion. If nothing else, at least you're getting a premium build for the price.",
    "Thankfully, the Huawei FreeBuds Lipstick could be more than just an expensive gimmick. We're already liking the sound of their robust noise cancellation suite, which makes use of Huawei's AEM tech. Supposedly, the buds can automatically set the level of noise cancellation based on your surroundings from over ten presets.",
    "Huawei's AEM tech extends to EQ adjustment. The buds can automatically determine the best EQ settings based on the shape of your ear canal. This can be further adjusted in the Huawei AI Life app, meaning that (if you have the budget) the FreeBuds Lipstick could actually be the pair for you if you own a Huawei smartphone.",
    "This integration with Huawei devices extends to playback, too. The buds can record playback with a sample rate of up to 48 kHz when paired with the best Huawei smartphones like the Mate 40, Mate 40 Pro and Mate 40 Pro Plus.",
    "We're usually impressed with Huawei's true wireless earbuds efforts. We've rated buds like the FreeBuds Pro and FreeBuds 3 quite highly in the past, recommending them for their solid noise cancelling, comfy fit and effective touch controls. Sadly, the one thing holding them back from being among the best earbuds you can buy is sound quality, something we hope the FreeBuds Lipstick can change.",
    "Compared to its biggest competitors like the AirPods Pro, we've never found sound quality with the FreeBuds lineup to be all that impressive. It's serviceable, of course, but nothing close to class-leading.",
    "Battery life is also something of a concern. The FreeBuds Lipstick boast 22 hours of battery life with noise cancelling switched on, and that's including the extra hours provided by the charging case. This is far from the best battery life we've seen for a pair of wireless earbuds, and falls short of even the FreeBuds Pro, which offered up to 30 hours of battery life before needing to charge the case.",
    "Throw in the fact that the Huawei FreeBuds Lipstick cost considerably more than its predecessors, and that seems to come down solely to the perceived high build quality over anything else. While their noise cancelling and Huawei device integration sound very promising, we're left to wonder if overall sound quality will see a marked improvement."
  ],
  "headers": {
    "6": "Analysis: will the Huawei FreeBuds Lipstick have the function to back up the form?"
  },
  "links": {
    "Huawei FreeBuds": "https://www.techradar.com/reviews/huawei-freebuds-pro/reviews/huawei-freebuds-studio/reviews/huawei-freebuds-studio/reviews/huawei-freebuds-pro",
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "What Hi-Fi?": "https://www.whathifi.com/news/huawei-freebuds-lipstick-boast-hi-fi-sound-with-high-end-cosmetic-appeal",
    "FreeBuds Studio": "https://www.techradar.com/reviews/huawei-freebuds-studio",
    "Sony WF-1000XM4": "https://www.techradar.com/reviews/sony-wf-1000xm4-wireless-earbuds",
    "NuraTrue": "https://www.techradar.com/reviews/nuratrue",
    "best Huawei smartphones": "https://www.techradar.com/news/best-huawei-phones",
    "Mate 40 Pro": "https://www.techradar.com/reviews/huawei-mate-40-pro-review",
    "FreeBuds 3": "https://www.techradar.com/reviews/huawei-freebuds-3-review",
    "best earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review"
  }
}