{
  "source": "https://www.techradar.com/news/dark-web-marketplace-bites-the-dust-after-colossal-ddos-attack",
  "title": "Dark web marketplace bites the dust after colossal DDoS attack",
  "category": "computing",
  "updated": "2021-11-30T13:12:06Z",
  "author": "sead-fadilpasic",
  "summary": "Cannazon officially retires",
  "article": [
    "One of the world’s largest dark web marketplaces for all things cannabis has been permanently shut down after a major distributed denial of service (DDoS) attack kept the site offline for a prolonged period of time.",
    "In an official announcement, the operators of the Cannazon marketplace said the DDoS attack wasn’t the reason for the shutdown, but it presented an opportunity to close the website down, as was always the plan.",
    "“No market will be here forever,” the announcement reads. “We are officially retiring. The massive DDoS attack was a very good chance to lower the number of orders and we decided to keep the market partially offline afterwards. This is the reason why the market was not reachable and not fully functional in the last days. By this, we could ensure that the number of orders was minimized and all paid orders were shipped.”",
    "The site’s poor performance in its final moments led to the community being abuzz with the talks of exit scamming. Cannazon’s operators addressed this issue in the announcement as well, saying all sellers have been accounted for (or will be in the coming days).",
    "“All open orders have been finalized now, disputes have been settled and refunded eventually. All vendors are able to withdraw their money. If your most recent order is delayed, you can still contact your vendor on the market regarding this.”",
    "Those who failed to get all of their signed Bitcoin multisig transactions should look out for an encrypted message posted on Dread later in the week, the operators said.",
    "Cannabis is still illegal in most parts of the world, and Cannazon’s operators served only non-US customers. Users that wanted to purchase cannabis-related products were required to register an account first, and were able to pay for the goods either in Bitcoin or Monero cryptocurrencies.",
    "When a major dark web marketplace shuts down, new entrants often emerge as a replacement. Some malicious actors try to take advantage of this power vacuum, creating fake websites that only phish for data and distribute malware.",
    "Via Bleeping Computer"
  ],
  "headers": {
    "3": "Cannabis marketplace"
  },
  "links": {
    "marketplaces": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "DDoS": "https://www.techradar.com/news/best-ddos-protection",
    "website": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "malware": "https://www.techradar.com/best/best-malware-removal",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/security/dark-web-market-cannazon-shuts-down-after-massive-ddos-attack/"
  }
}