{
  "source": "https://www.techradar.com/news/ringcentral-wants-to-make-hybrid-work-less-painful-for-everyone",
  "title": "RingCentral wants to make hybrid work less painful for everyone",
  "category": "computing",
  "updated": "2021-08-26T19:42:07Z",
  "author": "anthony-spadafora",
  "summary": "New features make it easier to work together from anywhere",
  "article": [
    "Staying connected is essential for teams whether they're working from home or if their organizations have already implemented hybrid work policies which is why RingCentral has announced a number of new features for its collaboration software.",
    "As video calls have become the preferred communication method during the pandemic, the UcaaS provider has added new Dynamic End-to-End Encryption (E2EE) to its video conferencing software to provide its users with an extra layer of security. With Dynamic E2EE enabled, data traveling from senders to receivers is encrypted to ensure the content of meetings is completely inaccessible to third parties.",
    "Dynamic E2EE will be available on RingCentral for mobile, desktop and web browsers and the new feature will launch in open beta next month with general availability planned for October.",
    "Another improvement on the security front is the fact that a number of RingCentral's products are now compliant with C5:2020 from the Federal Office for Information Security in Germany. This government-backed verification framework rigorously assesses the levels of security of cloud computing services based on the German government's security requirements.",
    "As one of RingCentral's goals with RingCentral MVP is to reduce the number of apps and screens users have to toggle between, the company has also announced the launch of RingCentral Add-ins.",
    "With RingCentral Add-ins, organizations can bring their third-party business apps directly into the RingCentral app interface. In addition to the more than 250 apps already available in RingCentral's App Gallery, new Add-in apps will also be available from Akazio, Asana, BugSnag, DocuSign, GitHub, HubSpot, Jira, Trello and other software providers.",
    "RingCentral has also announced users of its products and Microsoft Teams can now use them both in the same application. The RingCentral dial pad is now embedded into Teams to allow users to make calls to contacts or extensions in their RingCentral contact list as well to any external phone numbers.",
    "Finally, RingCentral MVP is getting several new AI-based and immersive capabilities including presentation modes, touch up appearance, auto-framing and breakout rooms. Of these, touch-up appearance will likely be the most interesting for end users as it allow them to add filters to put on virtual makeup, whiten their teeth and more.",
    "As some employees won't be returning to the office any time soon, these new features will help improve their remote working experience while ensuring they can remain productive from anywhere."
  ],
  "headers": {
    "4": "Supercharging enterprise communications"
  },
  "links": {
    "working from home": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid work": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "collaboration software": "https://www.techradar.com/best/best-online-collaboration-tools",
    "UcaaS": "https://www.techradar.com/best/best-ucaas",
    "video conferencing software": "https://www.techradar.com/best/best-video-conferencing-software",
    "cloud computing": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "business apps": "https://www.techradar.com/best/best-apps-for-small-business",
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "AI": "https://www.techradar.com/news/what-is-ai-everything-you-need-to-know",
    "remain productive": "https://www.techradar.com/best/best-productivity-apps"
  }
}