{
  "source": "https://www.techradar.com/news/the-samsung-galaxy-z-flip-3-could-cost-less-than-we-thought",
  "title": "The Samsung Galaxy Z Flip 3 could cost less than we thought",
  "category": "phones",
  "updated": "2021-05-09T12:01:51Z",
  "author": "david-nield",
  "summary": "A price drop is rumored",
  "article": [
    "Most cutting edge technology starts off expensive and then gets cheaper over time, and that's likely to be the case for foldable phones as well – and a new leak suggests that the Samsung Galaxy Z Flip 3 might not cost quite as much as its predecessor.",
    "The 5G-ready Galaxy Z Flip that launched in July 2020 originally retailed for $1,449 / £1,399 / AU$2,599, but a new leak from tipster @FrontTron on Twitter suggests that the next clamshell-style foldable from Samsung is going to sell for $999-$1,199.",
    "A straight currency conversion puts that at £715-£860 / AU$1,275-AU$1,530 but that's not how Samsung will set the prices. Perhaps a better way to think about the rumored cost of the Galaxy Z Flip 3 is that it's going to cost a third less than the model that came before it.",
    "That's a hefty drop, and considering we haven't heard much from this particular source before, it's wise to treat this as very much unconfirmed for the time being – even though we'd be very happy to see the foldable device on sale for a cheaper price.",
    "Putting together a device with a foldable screen remains an expensive business, but it's possible that Samsung's years of experience in the field means it can now start reducing costs on materials and production processes. It would be interesting if the Z Flip 3 is positioned as the more affordable phone and the Galaxy Z Fold 3 as the premium option.",
    "Both foldable phones are tipped to launch at the same time, and @FrontTron has something to say about that too: the big day is apparently August 3, which fits in with what we've heard before about a mid-to-late 2021 appearance.",
    "You haven't missed the Z Flip 2 by the way – it looks as though Samsung is going to skip a number and treat the 5G update to the original Flip as the second version. That will allow it to get the Fold and the Flip on the same numbering for the years ahead.",
    "The most recent rumors swirling around the Samsung Galaxy Z Flip 3 suggest that it may well come with stylus support and perhaps even act as a replacement for the Galaxy Note 21. We're expecting the handset to come in up to eight colors, and it may well come with a stronger frame too."
  ],
  "headers": {
    "4": "On the Flip side"
  },
  "links": {
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy Z Flip 3": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-3-review",
    "Galaxy Z Flip": "https://www.techradar.com/reviews/samsung-galaxy-z-flip-review",
    "@FrontTron": "https://twitter.com/FrontTron/status/1390085840487944201",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "heard before": "https://www.techradar.com/news/samsungs-2021-foldables-get-their-screen-specs-and-schedules-leaked",
    "it looks as though": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-looks-likely-to-launch-instead-of-z-flip-2",
    "with stylus support": "https://www.techradar.com/news/evidence-mounts-the-samsung-galaxy-z-flip-3-is-really-the-note-21s-replacement",
    "up to eight colors": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-foldable-tipped-to-come-in-a-total-of-8-colors",
    "with a stronger frame too": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-galaxy-z-flip-3-in-line-for-a-key-design-upgrade"
  }
}