{
  "source": "https://www.techradar.com/news/upcoming-phones",
  "title": "Upcoming phones 2021 and beyond: the 7 new phones we're most excited to see next",
  "category": "phones",
  "updated": "2021-10-21T14:16:02Z",
  "author": "james-rogerson",
  "summary": "Foldables, flagships and lots of other new smartphones",
  "article": [
    "2021 is almost over and we've seen lots of great phones. The year kicked off with the Samsung Galaxy S21 range - three phones that are so far among the best and most popular of the year.",
    "They were followed by the OnePlus 9 range, while the impressive Xiaomi Mi 11 range has also launched, as has the Oppo Find X3 Pro, and the ambitious Samsung Galaxy Z Fold 3. Then in September we got the long-awaited iPhone 13 range, with the Google Pixel 6 trailing in October.",
    "Now our attention is mostly turning to 2022, as we're not expecting much more this year, but the likes of the Samsung Galaxy S22 are already on the horizon, with an early 2022 launch likely.",
    "Below, we’ve highlighted the most interesting options that we’re expecting to see throughout the rest of 2021 and beyond. These are phones that in most cases are likely to be great, and at the very least should be interesting, unusual, or innovative.",
    "The Samsung Galaxy S22 is a bit further out than some phones on this list, but it’s still coming fairly soon, with a January 2022 launch looking likely.",
    "Whenever it does land, rumors suggest that the range – likely to include the S22, Samsung Galaxy S22 Plus and Samsung Galaxy S22 Ultra – will have similar screens and designs to the Galaxy S21 range, but with next-generation chipsets. On that front, it’s reported that most of the world could get a Snapdragon chipset, due to production issues with Samsung’s next Exynos one.",
    "Where we could see bigger changes is in the cameras, especially on the Samsung Galaxy S22 Ultra, with one source suggesting that it could have a 200MP main snapper – though others say it will stick with 108MP.",
    "Either way, the telephoto camera could get a useful upgrade, with continuous optical zoom possibly being offered, meaning you’d be able to optically zoom from 2x up to whatever its maximum is – probably 10x. On the current model you can only zoom to 3x or 10x - any in between number will be a digital or hybrid zoom instead.",
    "Details about these upcoming phones are still light overall, but we expect to hear plenty more in the run up to their launch, and going by Samsung’s track record they’re likely to be among the best and most exciting phones of 2022.",
    "The OnePlus 9T isn't happening, so instead we're looking towards the OnePlus 10 as the company's next big phone.",
    "This upcoming model isn't something that we know much about yet, but expect it to be a significant upgrade on the OnePlus 9, since there will likely be a year's gap between the two - where usually OnePlus launches a flagship every six months.",
    "We know that it will feature brand new software, and we'd expect the camera to get some big upgrades to make the most of the company's Hasselblad partnership. Beyond that, a new, more powerful chipset is almost certain to be included, with the Snapdragon 898 being the likely candidate.",
    "We're likely to see the OnePlus 10 in March or April based on the company's past form, so there's a while to wait yet.",
    "The Xiaomi Mi 11 impressed us a lot and while the Xiaomi Mi 11 Ultra was rather more flawed, it was certainly interesting, so we're keen to see what Xiaomi cooks up for the Xiaomi 12 range (having ditched 'Mi' from the name).",
    "Rumors so far suggest that the Xiaomi 12 or Xiaomi 12 Ultra could have a quad-lens camera, possibly with a 192MP or 200MP main sensor, which would be the most megapixels we've seen on a smartphone.",
    "It's also likely to have a top-end Snapdragon 895 chipset, and might even have incredibly fast 200W charging.",
    "We might not have long to wait for it either, with leaks suggesting the Xiaomi 12 range could be unveiled before the end of 2021. That said, this unveiling would probably just be for China, with a global launch likely happening around February 2022.",
    "The Huawei P50 range has actually already been announced, but it's initially only available in China, so we're still waiting for a global launch.",
    "It could be worth the wait though, as the top model - the Huawei P50 Pro - has a 6.6-inch 1228 x 2700 OLED screen with a 120Hz refresh rate, a Snapdragon 888 chipset, up to 12GB of RAM, and a quad-lens camera, with a 50MP main sensor, a 64MP telephoto one (with 3.5x optical and 200x digital zoom), a 13MP ultra-wide, and a 40MP monochrome camera.",
    "It also has a 4,360mAh battery with 66W fast charging, but due to the ongoing Huawei ban it runs the company's new HarmonyOS 2 rather than Android, and is also stuck without 5G.",
    "The standard Huawei P50 is a similar phone in a lot of ways, but with a slightly smaller screen, a 90Hz refresh rate, a 4,100mAh battery, and a different camera arrangement, consisting of a 50MP main, 13MP ultra-wide, and 12MP telephoto camera, with 5x optical zoom.",
    "While the iPhone 14 range is clearly the most anticipated of Apple’s upcoming phones, the company might first launch a successor to the iPhone SE (2020).",
    "We’ve heard very little about the iPhone SE 3 so far and there’s every chance we won’t see it for a while, but if it does launch anytime soon it will probably have an A14 Bionic or A15 Bionic chipset (the same as the iPhone 12 or iPhone 13 range).",
    "There’s also talk of an iPhone SE Plus, which might end up being the iPhone SE 3 in all but name. This is thought to have a larger 5.5 or 6.1-inch screen, but to retain the general affordability of the iPhone SE range. What’s not clear is whether the iPhone SE 3 will keep the physical home button and big bezels – a design that’s becoming increasingly dated.",
    "The Google Pixel Fold is a phone that we've been hearing about for years, and more recently we've heard that it might land in either late 2021 or early 2022.",
    "We wouldn't count on seeing it in 2021, as we'd expect more details of the phone to have leaked by now in that case, but it's certainly possible.",
    "From what we've heard so far, the Google Pixel Fold might have a 7.6-inch foldable OLED screen and the same Tensor chipset as the Pixel 6 range. We'd take all of this with a pinch of salt for now, but this could end up being one of the few non-Samsung foldable phones that's worth getting excited about.",
    "We’ve been waiting for the Nokia 10 for a long time, so much so that it’s gone through a few names since it started being rumored – originally it was thought to be launching as the Nokia 9.1, but as time went on that changed to Nokia 9.2, 9.3, and then Nokia 10. We've even now heard that it could land as the Nokia X60, given the brand's new naming scheme for its phones.",
    "But while its name remains unclear, we now have a better idea of when it might launch, with a company exec reportedly saying it will land sometime before November 11.",
    "And it could be worth waiting for, as rumors point to an in-screen selfie camera, a sapphire glass display, a penta-lens camera, a 108MP or 200MP main sensor, a 6,000mAh battery, a 144Hz refresh rate for the screen, and a top-end Snapdragon 888 chipset. So this could be a very premium phone."
  ],
  "headers": {
    "4": "Samsung Galaxy S22 range",
    "9": "OnePlus 10",
    "13": "Xiaomi 12 range",
    "17": "Huawei P50 range",
    "21": "iPhone SE 3",
    "24": "Google Pixel Fold",
    "27": "Nokia 10"
  },
  "links": {
    "Samsung Galaxy S21": "https://www.techradar.com/reviews/samsung-galaxy-s21-review",
    "OnePlus 9": "https://www.techradar.com/reviews/oneplus-9-review",
    "Xiaomi Mi 11": "https://www.techradar.com/reviews/xiaomi-mi-11-review",
    "Oppo Find X3 Pro": "https://www.techradar.com/reviews/oppo-find-x3-pro",
    "Samsung Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Samsung Galaxy S22": "https://www.techradar.com/news/samsung-galaxy-s22",
    "similar screens and designs": "https://www.techradar.com/news/samsung-galaxy-s22-sounds-a-lot-like-the-galaxy-s21-in-latest-leak",
    "most of the world could get a Snapdragon chipset": "https://www.techradar.com/news/samsung-galaxy-s22-specs-leak-is-bad-for-samsung-but-good-for-buyers",
    "could have a 200MP main snapper": "https://www.techradar.com/news/galaxy-s22-ultra-could-have-samsungs-best-camera-yet",
    "continuous optical zoom possibly being offered": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-may-have-a-major-zoom-upgrade-and-an-in-screen-camera",
    "OnePlus 9T": "https://www.techradar.com/news/oneplus-9t-canceled",
    "OnePlus 10": "https://www.techradar.com/news/oneplus-10",
    "feature brand new software": "https://www.techradar.com/news/oneplus-9t-is-canceled-and-oneplus-10-will-feature-brand-new-software",
    "Xiaomi Mi 11 Ultra": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra-review",
    "Xiaomi 12": "https://www.techradar.com/news/xiaomi-mi-12",
    "Huawei P50": "https://www.techradar.com/news/huawei-p50-series",
    "iPhone 14": "https://www.techradar.com/news/iphone-14",
    "iPhone SE (2020)": "https://www.techradar.com/reviews/iphone-se",
    "iPhone SE 3": "https://www.techradar.com/news/iphone-se-3",
    "iPhone SE Plus": "https://www.techradar.com/news/iphone-se-plus",
    "Google Pixel Fold": "https://www.techradar.com/news/google-pixel-foldable-phone",
    "in either late 2021 or early 2022": "https://www.techradar.com/news/the-google-pixel-fold-could-be-real-and-coming-this-year",
    "Nokia 10": "https://www.techradar.com/news/nokia-10",
    "before November 11": "https://www.techradar.com/news/new-flagship-nokia-phone-could-before-november-11",
    "an in-screen selfie camera": "https://www.techradar.com/news/nokias-next-flagship-could-get-an-under-display-selfie-camera",
    "penta-lens camera": "https://www.techradar.com/news/nokias-next-premium-phone-could-have-a-108mp-camera-and-launch-on-april-8"
  }
}