{
  "source": "https://www.techradar.com/news/bose-quietcomfort-45-headphones-leak-reveals-tried-and-tested-design",
  "title": "Bose QuietComfort 45 headphones leak reveals tried and tested design",
  "category": "audio-visual",
  "updated": "2021-08-19T08:18:21Z",
  "author": "axel-metz",
  "summary": "But will it be enough to rival the Sony WH-1000XM4?",
  "article": [
    "Audio giant Bose is struggling to keep a lid on its upcoming noise cancelling headphones, the QuietComfort 45.",
    "After last month’s now-deleted FCC filing revealed a preliminary look at the headphones’ design, we’ve now got an even better peek at the brand’s latest cans, courtesy of promotional material obtained by German tech site WinFuture.",
    "Most notably, the new images corroborate the suggestion that the QuietComfort 45 will sport a USB-C port, replacing the dated micro-USB port of their predecessors, the Bose QuietComfort 35 II headphones.",
    "Beyond that, though, the design of the QuietComfort 45 looks set to remain almost identical to that of the 35 II. That’s not necessarily a bad thing, since the 35 II were perfectly designed for commuters who crave comfort over striking design, but a similar plastic build could see the QuietComfort 45 lose out to more luxury offerings like the Master & Dynamic MW50.",
    "Still, as far as audio features go, we expect the QuietComfort 45 to make as big an impression as their predecessors. According to WinFuture, the 45s will offer active noise cancellation, an Aware Mode (similar to the AirPods Pro’s Transparency Mode) and will be tuned with Bose’s signature Active EQ.",
    "Other improvements include a better battery life than the QC35 II, which will see the 45s deliver up to 24 hours of continuous playback, with 2.5 hours of listening time gained from just a 15-minute charge. The QC35 II offered 20 hours of battery life – which by today’s standards is pretty low – so that extra four hours will definitely be appreciated, even if the Bose headphones won’t match rivals like the Sony WH-1000XM4 in terms of endurance.",
    "The German publication gives a hint at pricing, too, claiming that the QuietComfort 45 will retail for $330 in the US (as per a now-deleted Staples product listing). If accurate, that makes Bose’s upcoming headphones slightly cheaper than the model they’re set to succeed, which launched at $350 / £330 / AU$500.",
    "Despite the impressive audio features set to arrive on the QuietComfort 45, Bose’s last flagship headphones, the Noise Cancelling Headphones 700, proved the company can marry impressive sound with bold design.",
    "With the 45s, though, Bose seems to be re-treading the familiar ground of the 35s and 35 IIs by opting for quality of life features like ANC in place of a striking, sturdy design.",
    "That being said, the 700s suffered from a lack of foldability, and the 35 IIs boasted better comfort for the user, too – a positive trade-off for their boring design – so if the QuietComfort 45 can replicate the weightless feel of their predecessors, Bose could be on to a winner.",
    "What’s more, it’s likely that the upcoming 45s will improve on the company’s already-competent active noise-cancelling (ANC) tech – meaning they might even give the excellent Sony WH-1000XM4 a run for their money in the sound department.",
    "We don’t have a release date for the QuietComfort 45s just yet, but with this latest image leak coming just weeks after Bose’s now-withdrawn FCC filing, a launch could be just around the corner."
  ],
  "headers": {
    "7": "Analysis: Style vs. substance"
  },
  "links": {
    "noise cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "now-deleted FCC filing": "https://www.techradar.com/news/bose-quietcomfort-45-headphones-revealed-in-fcc-filing",
    "WinFuture": "https://winfuture.de/news,124669.html",
    "Bose QuietComfort 35 II": "https://www.techradar.com/reviews/bose-quietcomfort-35-ii",
    "Master & Dynamic MW50": "https://www.techradar.com/reviews/master-dynamic-mw50-wireless",
    "AirPods Pro’s": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "Noise Cancelling Headphones 700": "https://www.techradar.com/reviews/bose-noise-cancelling-headphones-700-review"
  }
}