{
  "source": "https://www.techradar.com/news/nothing-ear-1-wireless-earbuds-will-come-with-anc-and-theyre-cheaper-than-the-airpods-pro",
  "title": "Nothing Ear 1 wireless earbuds will come with ANC – and they're cheaper than the AirPods Pro",
  "category": "audio-visual",
  "updated": "2021-07-06T13:08:18Z",
  "author": "olivia-tambini",
  "summary": "They're set to launch on July 27",
  "article": [
    "The Nothing Ear 1 are among the most hotly anticipated true wireless earbuds expected to launch this year – and the company has just revealed that they'll come with active noise cancellation and a relatively low price tag.",
    "The new company, which was founded by OnePus co-founder Carl Pei, has confirmed that the wireless earbuds will cost $99 / £99, which works out at around AU$180, with global pricing to be confirmed.",
    "That's cheaper than many noise-cancelling earbuds on the market, including the Apple AirPods Pro, which cost $249 / £249 / AU$399 at launch.",
    "While cheaper ANC earbuds are available – the EarFun Air Pro are priced at $80 / £70 / AU120, for example – they are few and far between, and the quality of cheaper buds rarely matches their more expensive rivals.",
    "The Nothing Ear 1 launch will take place on July 27, with the event kicking off at 4am PDT / 9am EDT / 2pm BST / 11pm AEST.",
    "We expect the Ear 1 launch event will be an online-only affair with a live stream available to watch – but we're awaiting confirmation from Nothing on this. For now, you can sign up for notifications via the Nothing website.",
    "Aside from the fact that they'll come with noise cancellation, we know very little about the Nothing Ear 1. The company recently posted an intriguing image to Instagram, which it says is a close up of the earbuds – though we're finding it hard to make head or tails of it:",
    "It looks like the earbuds will be made from a transparent material, which isn't something we've seen before – and maybe for good reason. After all, would you want everybody to be able to see directly into your ear canal?",
    "The use of transparent materials does play into Nothing's mission statement, which is \"to remove barriers between people and technology to create a seamless digital future that looks, lives, and feels like nothing\".",
    "However, those hoping to see that vision fulfilled by the Nothing Ear 1may be left disappointed. In a blog post Carl Pei admitted that, \"for those hoping for a disappearing act overnight, Ear 1 falls short.\" It's all very cryptic.",
    "Still, we're excited to see the first release from Nothing, with the earbuds expected to be part of an ecosystem of products, including smart home devices. And, if they're cheaper than much of the competition in the true wireless space, the Ear 1 could become very popular indeed."
  ],
  "headers": {
    "4": "Transparency is key"
  },
  "links": {
    "true wireless earbuds": "https://www.techradar.com/news/best-true-wireless-earbuds-the-best-airpod-alternatives-around",
    "wireless earbuds": "https://www.techradar.com/news/audio/the-best-wireless-earbuds-available-today-1327335",
    "noise-cancelling earbuds": "https://www.techradar.com/best/best-noise-cancelling-earbuds",
    "Apple AirPods Pro": "https://www.techradar.com/reviews/apple-airpods-pro-review",
    "earbuds": "https://www.techradar.com/news/audio/best-in-ear-headphones-1276925",
    "EarFun Air Pro": "https://www.techradar.com/reviews/earfun-air-pro",
    "via the Nothing website": "https://nothing.tech/",
    "blog post": "https://nothing.tech/blogs/news/ear-1-coming-this-june",
    "smart home devices": "https://www.techradar.com/news/smart-home-devices"
  }
}