{
  "source": "https://www.techradar.com/news/how-to-watch-godfather-of-harlem-season-2-stream-episodes-online-from-anywhere",
  "title": "How to watch Godfather of Harlem season 2: stream episodes online from anywhere",
  "category": "computing",
  "updated": "2021-04-17T22:57:35Z",
  "author": "daniel-pateman",
  "summary": "It’s 1964 and notorious gangster Bumpy Johnson is back",
  "article": [
    "Three months after the Italians put a hit out on Bumpy Johnson, he’s back and determined “to fight tooth and nail for every inch of Harlem”. As the Italian mob, the police, and the Black mafia come to blows, we’re here to tell you how to watch Godfather of Harlem season 2 online and enjoy this explosive drama from anywhere.",
    "Godfather of Harlem provides an intoxicating look at Harlem during the 1960s, then an area rife with violence and civil unrest. Written and produced by Narcos creators Chris Brancato and Paul Eckstein, it concerns the release of crime boss Bumpy from Alcatraz Prison after 11 years, who returns home to find the Italian mob have muscled in on his turf.",
    "Season 1 ended with Vincent “The Chin” Gigante given permission to take Bumpy’s life, and season 2 picks up with Bumpy appealing for this decision to be reversed. Meanwhile, Malcolm X (Nigél Thatch) urges Black economic nationalism, and conflict erupts as Bumpy takes control of a heroin trafficking pipeline dubbed the “French Connection”, which runs all the way from Marseilles to New York Harbor. The series incorporates key historical events too, such as Muhammad Ali’s World Heavyweight Boxing Championship win, and his friendship with civil rights activist Malcom X.",
    "Academy Award-winner Forest Whitaker returns, as does Breaking Bad’s Giancarlo Esposito, Goodfella’s Paul Sorvino, and Ilfenesh Hadera as Mayme. Meanwhile, new cast members include Annabella Sciorra as Fay Bonanno, Justin Bartha as Robert Morgenthau, and Isaach De Bankolé as Monsieur 98, a soft-spoken chemist who makes high-class heroin.",
    "So, get ready for another round of this impeccably acted crime drama as we explain how to watch Godfather of Harlem season 2 online, no matter where you’re located.",
    "If you’re out of the country as season 2 episodes of Godfather of Harlem drop, then unfortunately geo-blocks will prevent you from connecting to your usual streaming service and enjoying this acclaimed show.",
    "There is, however, an easy solution. Downloading a VPN will let you to stream Godfather of Harlem online no matter where you are. It's a simple bit of software that changes your IP address, meaning that you can access on-demand content or live TV just as if you were at home.",
    "Use a VPN to watch Godfather of Harlem from abroad"
  ],
  "headers": {
    "5": "How to watch Godfather of Harlem season 2 online from outside your country",
    "8": "Can I watch Godfather of Harlem season 2 online in the UK?"
  },
  "links": {
    "VPN": "https://www.techradar.com/vpn/best-vpn"
  }
}