{
  "source": "https://www.techradar.com/news/amazon-wants-to-hire-55000-more-workers",
  "title": "Amazon is going on a massive hiring spree",
  "category": "computing",
  "updated": "2021-09-02T13:20:41Z",
  "author": "sead-fadilpasic",
  "summary": "Plenty of new opportunities across tech and corporate roles",
  "article": [
    "Amazon is looking to recruit anywhere between 40,000 and 55,000 new employees across a range of positions and offices.",
    "The tech giant said its upcoming Career Day, which will take place on September 15, will be the perfect opportunity for people looking to turn the page in their corporate and tech roles. There will be more than 220 Amazon locations accepting new workers.",
    "Speaking to Reuters, company CEO, Andy Jassy, said the goal of Amazon's hiring spree was to bolster its forces and “keep up with the demand in retail”, cloud and advertising, as well as the new Project Kuiper, which should launch satellites into orbit and provide more people with broadband access.",
    "Jassy added that after the pandemic is the perfect time to hire new people, as polls are showing people are eager to shake up their everyday.",
    "“There are so many jobs during the pandemic that have been displaced or have been altered, and there are so many people who are thinking about different and new jobs,” Jassy said.",
    "Amazon currently has around 1.3 million workers, 275,000 of which are employed in tech and corporate roles. With an additional 55,000 headcount, that would represent a spike of 20%. Just last year, Amazon hired 500,000 people in the US, Reuters claims, most of which work in warehouse and delivery operations, an area with \"significant turnover\".",
    "To put things into perspective, Google as a whole has 135,301 full-time employees, while Facebook counts 58,604.",
    "“We’re working hard every day to be the best place for people to have satisfying and fulfilling long-term careers,” Jassy said in a company press release.",
    "“Amazon continues to grow quickly and relentlessly invent across many areas, and we’re hoping that Career Day gives both job seekers and current Amazon employees the support they need to learn new skills or reimagine their careers at Amazon or elsewhere.”"
  ],
  "headers": {
    "5": "Amazon growth"
  },
  "links": {}
}