{
  "source": "https://www.techradar.com/news/nvidia-in-2021-amperes-continued-domination",
  "title": "Nvidia in 2021: Ampere's continued domination",
  "category": "computing",
  "updated": "2021-01-03T15:00:23Z",
  "author": "bill-thomas",
  "summary": "Will Nvidia keep winning in 2021?",
  "article": [
    "In 2020, Nvidia had an absolutely amazing year, finally launching its Ampere graphics architecture, both for data centers and for PC gaming. It was a massive improvement over what older cards like the Nvidia GeForce RTX 2080 Ti could offer, even hinting at what an 8K graphics card can look like with the RTX 3090.",
    "In a lot of ways, Nvidia is only getting started with Ampere, especially when you consider we still don't have mobile graphics or budget-friendly graphics cards with the new architecture. And, we can't forget about the ARM deal that's on the horizon. If that goes through, it would solidify Nvidia as one of the most important tech companies in the game.",
    "So while Nvidia's 2020 was a massive list of successes, 2021 is going to be louder and more ray traced.",
    "Right now if you want to get a card that supports all of the technologies that Nvidia is always making noise about – namely ray tracing, DLSS and Nvidia Broadcast – you have to get an RTX-branded card. The only problem is that Nvidia has only produced cards from the mid-tier up, so you have to drop at least $349 (£319, AU$499) for the Nvidia GeForce RTX 2060.",
    "And, because that graphics card has been seemingly discontinued, it's more like $399 (£419, AU$799) for the Nvidia GeForce RTX 3060 Ti.",
    "With Nvidia Turing, Nvidia cut off everyone with a budget below $349 (£319, AU$499) from seeing its ray traced future, with graphics cards like the GTX 1660 and GTX 1650 Super eschewing RT and Tensor Cores and focusing solely on rasterization performance.",
    "It could be argued that the main reason for doing this is that the Nvidia RTX 2060 was basically the bare minimum when it came to horsepower for this new tech, which begs the question: will we get an Nvidia GeForce RTX 3050 for $199 or less in 2021?",
    "From a performance perspective, we don't see why not. Just looking at the RTX 3060 Ti, that card is around 38-40% faster than the RTX 2060 Super, so we don't see why Nvidia couldn't make a budget option that can enable all the RT features we've come to love over the last couple of years.",
    "Nvidia could keep its RTX branding as a premium thing, and while we can totally see Nvidia taking that route, we really hope it doesn't. Take it from us: having a card that's able to use Nvidia Broadcast is a godsend when telecommuting, and opening that up to students or people without a lot of cash to spare can only be a good thing. We hope Nvidia does the right thing in 2021 and makes budget-friendly RTX graphics cards.",
    "Right now, even the best gaming laptops on the market are still using Nvidia's RTX 20-series GPUs – but we don't think those will be along much longer.",
    "Looking back at Turing as an example, the 20-series of graphics cards launched in September 2018 for desktops, and we didn't get laptop versions of the cards until January 29, 2019 after they were revealed at CES a few weeks prior.",
    "This time around, the Ampere lineup was led by the Nvidia RTX 3080 which launched in 2020, so if Nvidia follows the same schedule it's likely that we'll see laptops sporting the mobile GPU at CES this year. And, hell, we've already started to see leaked laptops sporting the GPU, so it seems pretty likely that they're right around the corner.",
    "It's important to keep in mind the thermal and power constraints that a laptop brings, though. The Nvidia GeForce RTX 3080, for instance, has a total graphics power (TGP) rating of 350W on desktop. The RTX 2080 Super for laptops, on the other hand, is limited to a 200W TGP for a full-fat mobile GPU, and just 90W for the Max-Q variant that is much more prevalent.",
    "So while we should be getting much more powerful mobile graphics relatively soon, don't expect a laptop to be able to max out Cyberpunk 2077 with ray tracing at 4K any time soon.",
    "So if you've been looking for a graphics card lately, you've probably noticed they're sold out pretty much everywhere all the time. And it's not even just Nvidia's new cards – the AMD Big Navi cards are nowhere to be found either.",
    "This will likely continue in the early months of 2021, but there should be relief coming soon. We heard news of a manufacturing deal between Nvidia and Samsung worth billions of dollars. Samsung already manufactured a good number of the initial Ampere cards, so it would only make sense for Team Green to lean on Samsung to help fill the massive demand for its new graphics cards.",
    "However, it might still be a few months before consumers are able to reliably buy an Nvidia 30-series graphics card without furiously mashing F5 to grab one before a bot can.",
    "In a lot of ways, the current stock crisis looks a lot like it did when crypto miners were buying up all the graphics cards back in 2017. Luckily most miners are using dedicated ASIC cards these days, so it's genuinely a question of supply and demand. Hopefully we start seeing wider RTX 3080 availability in the first half of 2021, so more people can get their hands on these fantastic graphics cards.",
    "Back in September 2020, Nvidia put forth a deal to buy ARM for $40 billion, though it has not yet gone through. The latest we've heard is that the FTC may be launching an anti-competition investigation into the absolutely massive deal.",
    "We don't think a resolution is going to happen immediately, and we're going to have to wait to see how this plays out. But, if it does go through, Nvidia will be one of the biggest tech companies in the world.",
    "While Nvidia is best known for its gaming products, the company is actually way bigger, involved in everything from exascale computing, AI, data science and self-driving cars. Bringing ARM into the fold would expand their reach even further, and given that we've started seeing companies like Microsoft and Apple abandoning traditional x86 processors for ARM processors, Nvidia could be in for an absolutely massive year in 2021."
  ],
  "headers": {
    "3": "RTX for everyone?",
    "9": "PS5? Xbox Series X? What about badass gaming laptops?",
    "14": "When will people actually be able to buy graphics cards?",
    "18": "Don't forget about ARM"
  },
  "links": {
    "Ampere graphics architecture": "https://www.techradar.com/news/nvidia-ampere",
    "Nvidia GeForce RTX 2080 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-ti-review",
    "RTX 3090": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3090",
    "graphics cards": "https://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458",
    "ray traced": "https://www.techradar.com/news/ray-tracing",
    "Nvidia GeForce RTX 2060": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060",
    "Nvidia GeForce RTX 3060 Ti": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3060-ti",
    "Nvidia Turing": "https://www.techradar.com/news/nvidia-turing",
    "GTX 1660": "https://www.techradar.com/reviews/nvidia-geforce-gtx-1660-super",
    "RTX 2060 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2060-super",
    "best gaming laptops": "https://www.techradar.com/news/mobile-computing/laptops/best-gaming-laptops-top-5-gaming-notebooks-reviewed-1258471",
    "Nvidia RTX 3080": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "RTX 2080 Super": "https://www.techradar.com/reviews/nvidia-geforce-rtx-2080-super",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "you've": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3080-the-best-deals-and-prices-live-now",
    "probably": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3070-find-stock-here",
    "noticed": "https://www.techradar.com/deals/where-to-buy-nvidia-rtx-3060-ti-find-stock-here",
    "buying up all the graphics cards back in 2017": "https://www.techradar.com/news/nvidia-struggles-to-meet-gpu-demand-from-gamers-due-to-cryptocurrency-rush",
    "Nvidia put forth a deal to buy ARM for $40 billion": "https://www.techradar.com/news/nvidia-buys-arm-in-dollar40-billion-deal",
    "FTC may be launching an anti-competition investigation into the absolutely massive deal": "https://www.techradar.com/news/nvidias-dollar40-billion-arm-acquisition-has-hit-a-speedbump"
  }
}