{
  "source": "https://www.techradar.com/news/russia-has-banned-a-whole-load-more-vpn-services",
  "title": "Russia has banned a whole load more VPN services",
  "category": "computing",
  "updated": "2021-12-03T16:17:08Z",
  "author": "mayank-sharma",
  "summary": "Russia wants to defeat the purpose of using a VPN, FoS advocates allege",
  "article": [
    "Russia continues to wage war against virtual private network (VPN) services, adding half a dozen more to its list of banned services, which already contained nine such services.",
    "According to reports, the Russian federal agency responsible for the supervision of communications, Roskomnadzor, has added Betternet, Lantern, X-VPN, Cloudflare WARP, Tachyon VPN, and PrivateTunnel, to bring the total number of banned VPN services to 15.",
    "According to a machine-translated version of a request sent by Roskomnadzor, the agency asked the Center for Monitoring and Control of the Public Communications Network to facilitate the removal of the clients of the banned VPN services from the systems of all registered Russian companies and public organizations.",
    "Roskomnadzor contends that it’s blacklisting these VPN services because they have failed to comply with its demands that they link up to the Russian State Information System (FGIS) database in order to prevent users from accessing blocked websites.",
    "While the agency claims the database is designed to prevent users from using the VPN services to access objectionable content such as child pornography, and narcotic drugs, freedom of speech advocates say these are mere excuses to prevent users from escaping the state's supervision and control.",
    "Bleeping Computer claims that, besides Moscow-based Kaspersky Secure Connection, all other VPN vendors had refused to connect to the database. Some worked around the notification by moving their servers just outside the Russian borders, while others used traffic masking techniques that have worked against China’s Great Firewall. However, the Russian authorities are gradually catching up to them."
  ],
  "headers": {
    "3": "Cat and mouse"
  },
  "links": {
    "VPN": "https://www.techradar.com/pro/vpn/best-vpn",
    "Betternet": "https://www.techradar.com/reviews/betternet-premium-vpn",
    "Lantern": "https://www.techradar.com/reviews/lantern",
    "X-VPN": "https://www.techradar.com/reviews/x-vpn",
    "Cloudflare WARP": "https://www.techradar.com/news/cloudflare-has-launched-its-new-vpn-warp",
    "Tachyon VPN": "https://www.techradar.com/news/this-vpn-could-change-everything-with-its-decentralized-approach",
    "PrivateTunnel": "https://www.techradar.com/reviews/privatetunnel-vpn",
    "request": "https://rkn.gov.ru/news/rsoc/news73968.htm",
    "Bleeping Computer": "https://www.bleepingcomputer.com/news/legal/russian-internet-watchdog-announces-ban-of-six-more-vpn-products/",
    "Kaspersky Secure Connection": "https://www.techradar.com/reviews/kaspersky-secure-connection-vpn"
  }
}