{
  "source": "https://www.techradar.com/news/yes-please-dyson-might-finally-be-building-a-stair-climbing-robovac",
  "title": "Yes please: Dyson might finally be building a stair-climbing robovac",
  "category": "appliances",
  "updated": "2021-09-06T03:18:14Z",
  "author": "harry-domanski",
  "summary": "New patent hints at an especially mobile vacuum bot",
  "article": [
    "Dyson is known for being an innovative company, with its developments in vacuum cleaners, air conditioners and even hair dryers making a big impact on their respective markets (and commanding a premium price in doing so).",
    "If one of the latest patents filed by the pioneering brand is anything to go off, we could soon see a Dyson robot vacuum with the ability to climb stairs and clean them in the process.",
    "As can be seen in the figures from the patent application, the conceptual device is formed from a mechanical arm with a powered hinge and a pair of 'tri-star wheels' on one of its ends – the critical component that allows for stair-climbing.",
    "The other end of the arm is used as leverage to help push the wheeled end up the stairs, as well as do the actual cleaning (at least, according to one proposition in the patent documents).",
    "As is the case with any patent application, there's no guarantee we'll see this concept make it to a product that's commercially available – companies frequently file patents that don't make it to market, with the intention of securing the intellectual property just in case.",
    "When reaching out to Dyson, a spokesperson told TechRadar, \"we file a lot of patents, but we never comment on technologies we may or may not launch in the future\", so we're unlikely to see any official word on the likelihood of this (or any) Dyson patent seeing the light of day.",
    "Once a rather novel and futuristic idea, robot vacuum cleaners have become considerably more ubiquitous in recent years, allowing more people to have their home cleaned (and even mopped) on a regular schedule without any input needed.",
    "Mobility has always been an issue for these typically squat robots, with some earlier models struggling to even make it up onto a rug or over the lip of a carpet, or conversely being too brave and careening over balconies.",
    "For people living in homes with stairs – an increasing reality as growing population density calls for more vertical living – it may not have made sense to own a robot vacuum due to its inability to get itself from one floor to another, making the job significantly less 'autonomous'.",
    "A robovac with this extra mobility could open it up to a much wider market and go a long way in standardizing autonomous cleaners more broadly.",
    "We can't help feel that Dyson's patented designs make for a fairly bulky unit, especially when considering the compact charm of most products on the market at the moment, but if the concept can be refined, we expect new altitudinal capabilities would make quite an impact on the popularity of robot vacuums overall."
  ],
  "headers": {
    "6": "Analysis: Do we need more agile vacuums?"
  },
  "links": {
    "vacuum cleaners": "https://www.techradar.com/reviews/dyson-v15-detect-absolute",
    "air conditioners": "https://www.techradar.com/reviews/dyson-purifier-hotcool-formaldehyde-hp09",
    "hair dryers": "https://www.techradar.com/reviews/dyson-supersonic-uk",
    "patents": "https://www.ipo.gov.uk/p-ipsum/Case/ApplicationNumber/GB2002772.8"
  }
}