{
  "source": "https://www.techradar.com/news/this-helpful-feature-will-keep-your-windows-11-pc-in-check",
  "title": "This helpful feature will keep your Windows 11 PC in check",
  "category": "computing",
  "updated": "2021-07-13T12:12:23Z",
  "author": "daryl-baxter",
  "summary": "A checkup for 11",
  "article": [
    "In the latest Insider build for Windows 11, a new health check feature has appeared, which can advise you on how to best maintain your PC through a variety of options.",
    "Sometimes you may be puzzled as to why your battery is running down faster than it should, or why your storage device is running slower than expected. Instead of having to try different methods to uncover the cause of the issue yourself, this Microsoft health check tool, built into Windows 11, should help to identify the source for you - and offer ways to fix it.",
    "This health check features a variety of recommendations that are clear and concise, suggesting the steps you can take to alleviate any potential issues.",
    "Using the latest build of Windows 11 and going to the Settings > System > Power & battery, you will see some recommendations such as changing the brightness of your display, changing the power mode for your battery, and much more.",
    "When selecting ‘detailed info’, you’ll see a breakdown of the apps using the battery from high to low, with an option to change the background settings for each app individually.",
    "Microsoft has also detailed another aspect of this for hardware. If a storage device such as an SSD is running slower than expected, this tool will be able to let you know if it needs to be looked at in further detail.",
    "There are also new system alerts that take advantage of the new look of Windows 11. Easy-to-read prompts will let you know throughout the day if the battery needs to be further optimized, or if an app is using more power than usual.",
    "While we had a basic overview of this in Windows 10, it’s welcome to see these troubleshooting improvements arrive in Windows 11. As more machines become increasingly sophisticated and reliant on certain processors and form factors, users will want to know how they can prolong the battery life of their device, for example, especially if they are about to resume a long commute.",
    "It’s further proof of Microsoft helping out the casual user. Even now, some are hesitant to upgrade their machine, in fear of an application looking too different, from the user interface to just the look of the icon.",
    "It’s features like this that will help the company going forward. Windows 11 is a great opportunity to attract more users who may still be running Windows 8.1, and helpful prompts to keep their PC running well will only help encourage more people to upgrade.",
    "Via Windows Latest"
  ],
  "headers": {
    "3": "A healthier check",
    "7": "Analysis: About time for casual users"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Windows 10": "https://www.techradar.com/news/windows-10-21h2-update",
    "Windows Latest": "https://www.windowslatest.com/2021/07/13/windows-11-comes-with-a-new-recommendation-feature-for-settings-services/"
  }
}