{
  "source": "https://www.techradar.com/news/apples-ipad-mini-hits-lowest-sale-price-ever-ahead-of-prime-day",
  "title": "Walmart sale slashes the iPad Mini to $329.99 – the lowest price ever",
  "category": "tablets",
  "updated": "2021-06-21T00:37:24Z",
  "author": "mackenzie-frazier",
  "summary": "Score a $70 price cut on Apple's small but mighty iPad Mini",
  "article": [
    "Just ahead of the highly anticipated Amazon Prime Day sale, Walmart has launched its own rival Deal for Day's sale - which includes a really great offer on the Apple iPad Mini.",
    "For a limited time, you can get the 2019 iPad Mini on sale for $329.99 (was $369). That's the lowest price we've found for the hand-held tablet and $40 less than Amazon's current deal. Not in the US? See today's best iPad deals in your region below.",
    "The small but might iPad Mini packs Apple's A12 Bionic chip, a 7.9-inch display, and 64GB of storage, which allows you to store plenty of movies and download apps and games. The ultra-lightweight tablet also includes a 7MP FaceTime HD front-facing camera, Touch ID, and an impressive 10-hour battery life. As we've mentioned above, this is the lowest price we've seen for the 2019 iPad Mini and an incredible bargain to snag before Prime Day iPad deals have officially begun. We predict this hot bargain won't stay around for long, so you should take advantage now before it's too late.",
    "If you're looking for more Apple offers you can see the best Prime Day Apple Watch deals and the best Prime Day AirPods deals."
  ],
  "headers": {
    "2": "iPad deal",
    "3": "More iPad deals"
  },
  "links": {
    "on sale for $329.99": "https://goto.walmart.com/c/1943169/565706/9383?subId1=trd-us-1423320250809769500&sharedId=trd-us&u=https%3A%2F%2Fwww.walmart.com%2Fip%2Fseort%2F207104625",
    "iPad Mini": "https://www.techradar.com/reviews/ipad-mini-2019",
    "Prime Day iPad deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-ipad-deals-sales-2020",
    "Prime Day Apple Watch deals": "https://www.techradar.com/amazon-prime-day/best-prime-day-apple-watch-deals-2020",
    "Prime Day AirPods deals": "https://www.techradar.com/amazon-prime-day/amazon-prime-day-airpods-deals-all-the-best-sales-in-one-place"
  }
}