{
  "source": "https://www.techradar.com/news/sony-takes-on-rode-with-new-wireless-microphone-for-vlogging-cameras",
  "title": "Sony takes on Rode with new wireless microphone for vlogging cameras",
  "category": "cameras",
  "updated": "2021-03-10T01:17:26Z",
  "author": "mark-wilson",
  "summary": "Upgrade your streaming or vlogging setup",
  "article": [
    "Sony has announced a new vlogging-friendly wireless microphone that could be a compelling alternative to the Rode Wireless Go 2 for owners of Sony mirrorless cameras.",
    "The snazzily-named Sony ECM-W2BT consists of a transmitter and receiver, which communicate wirelessly via Bluetooth to give you cable-free audio recording that apparently works from up to 200m away from the camera.",
    "Unlike the Rode Wireless Go 2, Sony's solution doesn't include two separate receivers for capturing audio from two different people, but it does bring other potential benefits – particularly if you own a recent Sony mirrorless camera with the latest Multi-Interface (MI) shoe.",
    "On some cameras, like the Sony A7S III, this MI shoe supports digital audio sources –which means the Sony ECM-W2BT can send its digital signal straight into your camera, rather than relying on cables or requiring your camera to handle the analogue-to-digital conversion.",
    "Sony reckons this process reduces noise and interference compared to the usual process of plugging a receiver into your camera via a cable. But this setup is only available on the four Sony cameras whose Multi Interface hot shoe has support for the digital audio interface: the Sony A9 II, Sony A7R IV, Sony A7S III and Sony A7C.",
    "Other cameras, like the Sony A6000 series, can still power the Sony ECM-W2BT via their MI shoes, but instead receive an analog signal from the transmitter (to be converted in the camera). And non-Sony cameras are compatible with the Sony ECM-W2BT too, but they'll need to be plugged in via their external mic output – which means losing most of the system's claimed audio quality benefits.",
    "So what else is interesting about Sony's wireless microphone system? You get a wind screen included with the microphone to help reduce wind noise, and there's also an attenuator switch (which lowers the level of an audio signal) on the side to help you reduce distortion.",
    "There are also three patterns of sound pickup: in 'MIC' mode the system will pick up audio from the microphone only (handy if you're doing live streaming), in 'MIX' mode it'll record audio from both the mic and receiver (for interviews), and in 'RCVR' mode only the receiver will record audio, which could be useful for anyone who likes recording a running commentary on what they're shooting.",
    "While you can clip the Sony ECM-W2BT's microphone onto your clothing, it does also have a 3.5mm input for lavalier (or lapel) mics, if you want something a little more inconspicuous.",
    "For this reason, Sony has also made a new lav mic called the ECM-LV1 (above), which comes with its own wind screen and a 360-degree rotation clip for attaching it to pockets and ties.",
    "You'll be able to buy both the new wireless microphone system and lav mic from April. The Sony ECM-W2BT will cost $230 / £210 / AU$399, while the ECM-LV1 will set you back a fairly reasonable $30 / £32 / AU$59."
  ],
  "headers": {
    "6": "Sound effects"
  },
  "links": {
    "Rode Wireless Go 2": "https://www.techradar.com/news/rode-launches-successor-to-one-of-the-best-wireless-microphones-for-youtube",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Sony A9 II": "https://www.techradar.com/reviews/sony-alpha-a9-ii",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A7C": "https://www.techradar.com/news/the-sony-a7c-is-a-tiny-full-frame-vlogging-camera-with-a-big-price-tag"
  }
}