{
  "source": "https://www.techradar.com/news/billcom-snaps-up-invoice2go-to-simplify-business-payments",
  "title": "Bill.com snaps up Invoice2go to simplify business payments",
  "category": "computing",
  "updated": "2021-07-23T04:55:04Z",
  "author": "anthony-spadafora",
  "summary": "Acquisition will help accelerate Bill.com's accounts receivable offering",
  "article": [
    "The cloud-based software company Bill.com has announced that it has signed a definitive agreement to acquire Invoice2go in a stock and cash transaction value at $625m.",
    "While Bill.com provides SMBs with a way to simplify, digitize and automate complex back-office financial operations, Invoice2go is a mobile-first accounts receivable (AR) software provider that helps SMBs and freelancers grow their client base, manage invoices and payments, build their brand and more.",
    "Bill.com's CEO and founder René Lacerte explained in a press release how the acquisition will allow the company to help SMBs adopt e-payments as part of their digital transformation efforts, saying:",
    "“Most small business transactions today are made with paper checks. Yet we know from our customers that there is strong momentum to digitally transform and adopt e-payments. Our payments expertise and go-to-market capabilities combined with Invoice2go’s product capabilities can make it even easier for businesses to get paid quickly and electronically. Between Bill.com and Invoice2go, there are billions of dollars of invoices being sent annually that can be enabled for electronic payments.”",
    "As a result of the acquisition, Bill.com will be able to enhance its current accounts receivable offering as part of its efforts to make it simpler to connect and do business.",
    "Invoice2go's AR solution on the other hand makes it easy for businesses to engage and interact with their customers, generate invoices and simplify their AR operations through both mobile and desktop solutions. By combining its capabilities with Bill.com, businesses will be able to get paid faster and more conveniently when using electronic payments.",
    "The transaction has already been approved by the board of directors of both companies and the deal is expect to close by the end of this calendar year pending regulatory approval and customary closing conditions.",
    "Of the $625m that Bill.com is paying to acquire Invoice2go, 75 percent will be in Bill.com common stock and 25 percent will be in cash."
  ],
  "headers": {
    "4": "Transact from anywhere"
  },
  "links": {
    "Bill.com": "https://www.techradar.com/reviews/billcom",
    "invoices": "https://www.techradar.com/best/best-billing-and-invoicing-software",
    "press release": "https://www.businesswire.com/news/home/20210719005226/en/Bill.com-to-Acquire-Invoice2go-a-Leader-in-Accounts-Receivable-Software-for-Small-Businesses",
    "accounts receivable": "https://www.techradar.com/news/uk-businesses-urged-to-embrace-digital-payment-systems",
    "electronic payments": "https://www.techradar.com/best/best-payment-gateways"
  }
}