{
  "source": "https://www.techradar.com/news/microsoft-teams-gets-a-handy-feature-to-stop-people-disrupting-your-next-meeting",
  "title": "Microsoft Teams gets a handy feature to stop people disrupting your next meeting",
  "category": "computing",
  "updated": "2021-02-19T04:08:18Z",
  "author": "anthony-spadafora",
  "summary": "Meeting organizers can now disable chat in Teams",
  "article": [
    "Microsoft has updated its video conferencing service Teams with a new feature that will hopefully help meeting participants stay more engaged while in video calls.",
    "According to a post in the Microsoft Teams User Feedback Forum from one of the company's engineers, Teams now includes the ability to disable or enable chat during a meeting.",
    "This feature has been highly requested from both meeting organizers at companies as well as teachers who are using Teams for distance learning. In fact, back in March of last year, a meeting organizer posted on the service's User Feedback Forum requesting it, saying:",
    "“Please allow meeting organizer to temporarily disable chat during a meeting. We often have people so focused on the chat, they don't pay any attention to the actual meeting. We'd love to be able to turn off chat at the beginning of the meeting, and then turn it back on at an appropriate point.”",
    "Up until now, only a domain admin could create a policy to ban chat in all meetings in Teams while those who initiated a meeting were unable to disable chat both on a per-meeting basis or only during part of a meeting.",
    "According to a support note from Microsoft, there are now three different options for how chat works in Teams meetings. With the feature enabled attendees can chat before, during and after a meeting while with it disabled no one including the organizer can send chat messages. The third option only allows attendees to chat during the meeting but the meeting's organizer can send messages at any time.",
    "If a meeting organizer such as a team leader at an organization or a teacher in an online class wants to disable chat, they can find this feature under settings by selecting an option next to 'Allow meeting chat'.",
    "The ability to disable chat in Teams is now live for all users and hopefully it can bring a bit more focus to your next meeting.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "Disabling chat in Teams"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "a post": "https://microsoftteams.uservoice.com/forums/555103-public/suggestions/40010275-disable-chat-temporarily-during-meetings",
    "distance learning": "https://www.techradar.com/best/best-online-learning-platforms",
    "support note": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-6827883322461239000&murl=https%3A%2F%2Fsupport.microsoft.com%2Fen-gb%2Foffice%2Fchange-participant-settings-for-a-teams-meeting-53261366-dbd5-45f9-aae9-a70e6354f88e%3Fui%3Den-US%26rs%3Den-GB%26ad%3DGB",
    "ZDNet": "https://www.zdnet.com/article/microsoft-teams-now-you-can-turn-off-chat-to-stop-people-talking-through-your-meeting/"
  }
}