{
  "source": "https://www.techradar.com/news/google-says-its-no-longer-interested-in-tracking-users",
  "title": "Google says it’s no longer interested in tracking users",
  "category": "computing",
  "updated": "2021-03-03T16:33:37Z",
  "author": "mayank-sharma",
  "summary": "Google claims preserving user privacy is now a top priority",
  "article": [
    "Google’s plans to phase out tracking cookies last year were met with skepticism. However, the company has once again reiterated its intentions to help protect user privacy.",
    "Tracking cookies were initially pitched as a means of creating a more personalized web experience. Over time, however, they were subverted for unscrupulous uses and these days are mostly seen as a threat to online privacy.",
    "“Today, we’re making explicit that once third-party cookies are phased out, we will not build alternate identifiers to track individuals as they browse across the web, nor will we use them in our products,” said David Temkin, Google’s Director of Product Management for Ads Privacy and Trust.",
    "Back when Google, which was one of the pioneers of the tracking cookie, announced plans to slowly discontinue the use of cookies, many privacy advocates agreed that Google probably had another trick up its sleeve.",
    "Even the launch of the Privacy Sandbox initiative, which supposedly designed to develop a set of open standards for enhancing privacy on the web, didn’t help matters. Google was accused of abusing its dominant market position and the project is now under investigation by the UK competition watchdog.",
    "Temkin acknowledges this and says the company regularly gets asked if it’s joining the ad tech industry in coming up with another means of tracking individuals on the internet. Now, however, he has made Google’s position explicitly clear.",
    "\"Keeping the internet open and accessible for everyone requires all of us to do more to protect privacy—and that means an end to not only third-party cookies, but also any technology used for tracking individual people as they browse the web,\" said Temkin.",
    "Via The Verge"
  ],
  "headers": {
    "3": "On our side"
  },
  "links": {
    "Google’s": "https://www.techradar.com/best/browser",
    "phase out tracking cookies": "https://www.techradar.com/news/google-is-phasing-out-third-party-cookies-in-chrome-to-protect-your-privacy",
    "privacy": "https://www.techradar.com/best/best-privacy-apps-for-android",
    "Privacy Sandbox": "https://www.techradar.com/news/chromes-next-big-update-could-keep-your-browsing-private-without-incognito-mode",
    "under investigation": "https://www.techradar.com/news/uk-investigating-google-chrome-privacy-plan",
    "The Verge": "https://www.theverge.com/2021/3/3/22310332/google-privacy-replacing-third-party-cookies-privacy-sandbox"
  }
}