{
  "source": "https://www.techradar.com/news/blackview-will-launch-its-first-5g-rugged-outdoor-smartphone-this-year",
  "title": "Blackview will launch its first 5G rugged outdoor smartphone this year",
  "category": "phones",
  "updated": "2021-01-26T01:22:12Z",
  "author": "anthony-spadafora",
  "summary": "MediaTek Dimensity 1200 SoC will power Blackview's next 5G smartphone",
  "article": [
    "When 5G first came out back in 2019, the new global wireless standard first appeared in flagship phones such as the Samsung Galaxy S10 5G. Now though, even rugged smartphones from Blackview, Ulefone and Oukitel are shipping with 5G connectivity.",
    "So far all three major rugged smartphone vendors have released a device equipped with 5G in the form of the Ulefone Armor 10, Oukitel WP10 and Blackview BL6000 Pro.",
    "However, while the BL6000 Pro which we recently reviewed, may be Blackview's first smartphone with 5G it lacks some of the features such as a flap covering the USB-C port that would make the device a rugged outdoor smartphone.",
    "For this reason Blackview has announced that it will soon release its flagship rugged smartphone, the BL8000.",
    "Blackview's next rugged smartphone will use the recently launched MediaTek Dimensity 1200 SoC and the BL8000 will ship this year.",
    "The 6nm 5G chipset from MediaTek will enable users to connect to 5G networks and the inclusion of WiFi 6, Bluetooth 5.2 and dual-band GNSS (L1+L5) will boost connectivity. The chipset also supports fast charging of up to 65W and the BL8000 can be charged in just a few minutes.",
    "In terms of performance, the MediaTek Dimensity 1200 SoC features a single Cortex-A78 core clocked at 3GHz, three Cortex A78 cores at 2.6GHz and four A-55 cores at 2GHz to handle low-power tasks. The BL8000's display supports up to a 168hz display refresh rate while the Hyper Engine 3.0 will improve gaming and the device's 12GB of RAM will further improve multitasking.",
    "We'll likely hear more about Blackview's new flagship smartphone once the device is ready to launch later this year."
  ],
  "headers": {
    "4": "BlackView BL8000"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "rugged smartphones": "https://www.techradar.com/best/best-rugged-smartphones",
    "Ulefone Armor 10": "https://www.techradar.com/reviews/ulefone-armor-10-5g-rugged-smartphone",
    "Oukitel WP10": "https://www.techradar.com/reviews/oukitel-wp10-5g-rugged-smartphone",
    "Blackview BL6000 Pro": "https://www.techradar.com/reviews/blackview-bl6000-pro-5g-rugged-smartphone",
    "WiFi 6": "https://www.techradar.com/news/wi-fi-6-release-date-news-and-rumors",
    "MediaTek Dimensity 1200 SoC": "https://www.techradar.com/news/redmis-first-gaming-smartphone-will-feature-the-dimensity-1200-soc"
  }
}