{
  "source": "https://www.techradar.com/news/best-horror-movies-and-shows-on-amazon-prime-video",
  "title": "10 best horror movies and shows on Amazon Prime Video for Halloween",
  "category": "audio-visual",
  "updated": "2021-10-29T16:18:05Z",
  "author": "daniel-pateman",
  "summary": "Amazon has dozens of terrifying titles - but these are our faves",
  "article": [
    "For subscribers of Amazon Prime Video, there's no shortage of scary movies that you can watch just in time for Halloween. In its roster of great TV shows and movies there are plenty of spine-chilling classics and modern masterpieces to choose from, as well as heaps of enjoyable B-movie filler, and some movies that are so bad they're g-... No, they're just plain bad.",
    "To help whittle down your search of blood-curdling entertainment, we've curated a terrifically terrifying list of the 10 best horror movies and shows on Amazon Prime Video for you to watch this Halloween.",
    "Editor's note: We advise checking the Amazon Prime Video site in your region before signing to ensure that your movies of choice are available where you live",
    "“They’re coming to get you Barbra!” George A. Romero cemented his place in the Horror Hall of Fame with this low-budget picture about the recently deceased coming back to life to feast on the living. It gave birth to the modern zombie film – although the “Z” word isn't uttered here – and led to five Romero-directed sequels, including 1978’s Dawn of the Dead.",
    "Opening with siblings Johnny and Barbra ambushed by a graveyard ghoul, Barbra breaks free to seek refuge with a terrified rabble of survivalists in an abandoned farmhouse. As tensions grow among the group, they find themselves besieged by the growing ranks of the living dead, with little chance of escape.",
    "Romero’s film is pretty tame by modern standards. But it shocked contemporary viewers, being described by Variety as “an unrelieved orgy of sadism.” It's a fair assessment, given our heroes return to life as cannibals, are dismembered – or worse – while one woman is brutalised with a masonry trowel by her reanimated daughter. Yikes! Its nihilistic vision reflects a time in which images of racial conflict and violence in Vietnam were rife, broadcast daily into American homes.",
    "The slasher film was back in vogue after the success of Scream, and people lined up around the block to see writer Kevin Williamson’s latest about a hook-wielding psycho fisherman.",
    "Based on Lois Duncan’s 1973 novel, it follows a group of friends whose lives veer off track when they’re involved in a hit and run, killing a man and agreeing to dump the body in the ocean. They swear to take the secret to their graves. But a year later they’re contacted by someone who claims to know… Well, y’know. What they did? Last summer?",
    "Featuring an attractive cast of 90s TV stars, a hip soundtrack, and packed with no-nonsense frights, this fast-paced thriller lit up the box-office, taking $125 million dollars and becoming the seventh highest grossing slasher movie of all time. Proof of its popularity? It was mercilessly parodied in the so-so spoof Scary Movie, spawned a number of pale imitations, and has even been adapted into an Amazon Original TV series for Generation Z.",
    "Not long after Johnny Depp hit the Hollywood stratosphere post-Pirates, he landed the lead role of depressed writer Mort Rainey in an adaptation of Stephen King’s ‘Secret Window, Secret Garden’ - a creepy head-scratcher taken from the author’s Four Past Midnight collection.",
    "Having discovered his wife’s infidelity, Mort retreats to his isolated cabin in upstate New York and falls into a writing funk. Six idle months pass when, out of nowhere, a Mississippian stranger by the name of John Shooter (John Turturro) arrives and accuses him of plagiarism. Mort refutes the heated claim, noting that his short story ‘Secret Window’ was published over two years ago. That is, until he discovers the two stories are virtually identical except for the ending. And in Shooter’s version, the protagonist kills his wife.",
    "Depp is giddily entertaining in the kind of quirky role he excels at, and this slow-burn psychodrama keeps things weird and unpredictable until the very end. It ultimately opts for a bolder ending than the one King used, concluding events on a much darker note.",
    "The feature film debut of Emmanuel Osei-Kuffour Jr. delivers a troubling yet moving meditation on identity and trauma with a technological slant, coming across like Black Mirror meets Jacob's Ladder. It’s part of the Welcome to the Blumhouse stable, an anthology of eight films produced by modern horror virtuoso Jason Blum (Get Out, Us, the 2018 Halloween reboot) for the Amazon Prime Video platform.",
    "When Nolan Wright (Mamoudou Athie) becomes the sole survivor of a car accident, he’s left to raise his 10-year-old daughter Ava by himself while struggling with severe amnesia. Anxious of being judged unfit to care for Ava, he opts for an experimental procedure offered by Dr. Lilian Brooks (Phylicia Rashad). The titular “black box” provides a virtual pathway into Wright’s memories, allowing him to rebuild the shattered fragments of his psyche. But to his terror, his reminiscences are populated by faceless figures and the contorted Backwards Man, whom he must confront to recover the reality of who he really is.",
    "An A-list Hollywood cast and the director of Call Me By Your Name come together to “reimagine” Dario Argento’s classic giallo of the same name, one of the most iconic horror movies ever made. Luca Guadagnino kept the basic premise about American dancer Susie Bannion arriving in Germany to audition for a prestigious dance academy, only to find out it's being run by a coven of nasty witches. Other than that, it’s almost an entirely different beast.",
    "While Argento’s 1977 original evoked the sturm und drang of evil occurrences with expressionistic lighting, bold primary colours and a prog-rock score, Guadagnino’s Suspiria provides an atmosphere of chilly malevolence and a languorous, art-house aesthetic. It’s more of a cerebral experience than a bloodily visceral one, although the film is punctuated by some truly spectacular moments – in particular the enchanted death of a student trapped in a room full of mirrors. Plus, it has an incredible ensemble of actors, led by Tilda Swinton as Madame Blanc and Dakota Johnson as her enigmatic protégé.",
    "High school can be hell. That was the premise of Joss Whedon’s highly influential TV series, a pop-culture landmark in which “chosen one” Buffy Summers and her gang of “scoobies” exchanged witticisms while fighting the forces of darkness. They battled blood-suckers, wayward scientists, mutants, demons from hell dimensions – all the evils. But the gothic horror elements were often perfectly blended with the anxieties of adolescence.",
    "Led by Sarah Michelle Gellar as a teen slayer with ‘tude, the show ran for seven near-perfect seasons. Each episode would focus on a unique threat or monster, but the romantic and emotional storylines of the characters could extend over whole seasons, making the fantasy world of Buffy, Giles, Willow and Zander feel incredibly grounded.",
    "It got dark at times. Buffy had a tumultuous love affair with a vampire with an on-off soul; there was always an apocalypse to prevent; and the show wasn’t afraid to portray complex experience like grief, sexual assault and depression. But the show never lost its heart…even when someone was putting a stake through it.",
    "Japanese horror movie Ju-On: The Grudge helped popularise the figure of the “vengeful ghost” (or onryō) in the Western world. At the turn of the millennium therefore, the image of lank-haired, bug-eyed ghost girls was regularly projected on cinema screens.",
    "Although the Ju-On franchise began with two straight-to-video entries, director Takashi Shimizu was encouraged by the international success of 1998's Ring to produce a theatrically released sequel. Told in a non-linear fashion, his tale begins with the brutal murder of a family by a jealous husband. This tragedy engenders a terrible curse that affects anyone who enters the family’s home, resulting in their terrifying death and causing them to become a vengeful spectre, too.",
    "What The Grudge may lack in narrative sense it makes up for in scares and a barrage of haunting, grotesque images. A hand emerging from one woman’s wet hair, or pale-faced ghosts appearing underneath the victim's bedsheets. And, leaving a hauntingly macabre final impression, a bloodied corpse crawling downstairs to enrol school teacher Mariko on this undying cycle of terror.",
    "Not to be confused with the sci-fi film about giant ants or that 2006 home-invasion shocker, this Them is an Amazon Original series about the Emorys: a family from North Carolina confronting both the real and supernatural incarnations of racism in 1950s Los Angeles.",
    "Them stars Deborah Ayorinde and Ashley Thomas as a young couple who’ve recently moved to the LA suburbs in search of a better life. They’re overjoyed with their new abode. But their arrival makes their Caucasian neighbors anxious, and housewife Betty (Alison Pill) quickly launches a campaign of intimidation to drive them away. Meanwhile, the Emorys' youngest daughter Gracie perceives evil forces at home, one of which is a demonic minstrel in blackface.",
    "It’s a grippingly acted and full-throttle series, potently revealing the psychological toll of prejudice in addition to more gruesome horrors.",
    "Director Neil Marshall followed up Dog Soldiers – his squaddies versus werewolves debut – with a brutal, bracing story about things that go spelunk in the night.",
    "A year after her husband and daughter’s deaths in a car accident, Sarah and her thrill-seeking friends set off for an all-girls caving weekend. They’re in high spirits - initially, at least - until they get trapped in an unexplored network of tunnels. Tempers fray and tensions start to emerge. But, once that panic has subsided, they realize that something else is down there with them. And it's very hungry.",
    "Inspired by survival horror films like Deliverance and The Texas Chainsaw Massacre, The Descent engenders a feeling of breathless claustrophobia as characters squirm in the dark between immovable walls of rock, after which the film switches gears into a frenzy of caving carnage. Worse than the ravenous ferocity of the “crawlers” is the gradual irruption of resentments and betrayals between the women, which threatens any remaining hope of escape.",
    "One of the best horror films of the noughties, The Descent is a work of blunt, brutal trauma.",
    "Funnily enough, The Wicker Man is the sole British folk horror musical on this list, and it’s an utterly unique experience. The film weaves captivating songs through a bizarre narrative about a priggish police officer contacted to help find a girl missing on the Hebridean island of Summerisle. The problem is, once he gets there, all of the inhabitants deny that she ever existed.",
    "Edward Woodward plays “Christian copper” Sergeant Howie, whose conservative beliefs jar with the Celtic Paganism of the locals and their practices of public fornication and jumping naked over fires to encourage fertility. Horror veteran Ingrid Pitt features alongside Swedish actress Britt Ekland, while Christopher Lee (Count Dracula himself!) hams it up as the debonair Lord Summerisle.",
    "It’s a genre-bending film, which Cinefantastique dubbed “the Citizen Kane of horror movies\". Rightly so too. Because when you finally meet the Wicker Man, every one of your hairs will be standing on end.",
    "Discover more:"
  ],
  "headers": {
    "3": "Night of the Living Dead (1968)",
    "6": "I Know What You Did Last Summer (1997)",
    "9": "Secret Window (2004)",
    "12": "Black Box (2020)",
    "14": "Suspiria (2018)",
    "16": "Buffy the Vampire Slayer (1997 – 2003)",
    "19": "Ju-On: The Grudge (2002)",
    "22": "Them (2021)",
    "25": "The Descent (2005)",
    "29": "The Wicker Man (1973)"
  },
  "links": {
    "Amazon Prime Video": "https://www.techradar.com/reviews/amazon-prime-review",
    "checking the Amazon Prime Video site in your region": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fgp%2Fvideo%2Fstorefront%2Fref%3Dsv_atv_logo%3Fnode%3D2858778011%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1200836523215399700-20"
  }
}