{
  "source": "https://www.techradar.com/news/microsoft-is-offering-big-money-if-you-can-hack-teams",
  "title": "Microsoft is offering big money if you can hack Teams",
  "category": "computing",
  "updated": "2021-03-26T11:09:08Z",
  "author": "mayank-sharma",
  "summary": "Bounty program will soon extend to other apps as well",
  "article": [
    "Microsoft’s Security Response Center (MSRC) has announced a new bounty program for any ethical hackers able to unearth vulnerabilities in Microsoft Teams.",
    "Like all major software vendors, Microsoft operates a number of bug bounty programs that offer rewards to external developers for highlighting shortcomings in its apps. Th enew Microsoft Applications Bounty program is specifically designed to identify security gaffes in the apps such as the Team desktop client.",
    "Microsoft Teams has rapidly grown over the past year to become one of the most important online collaboration platforms around as remote working grew in response to the Covid-19 pandemic.",
    "“Microsoft and security researchers across the planet continue to partner to help secure customers and the technologies we use for remote collaboration,” says Lynn Miyashita, Program Manager, MSRC.",
    "Miyashita adds that the new bounty program is an extension of the existing efforts to ensure the security of the app.",
    "The program’s goal is to uncover significant technical vulnerabilities that Microsoft says should have a demonstrable and direct impact on the security of the users of the Teams desktop client. The program offers bounties ranging from $500 to $30,000.",
    "MSRC has identified five critical scenarios that do the maximum damage, and vulnerabilities affecting those start at $6000. Vulnerabilities outside the purview of these five scenarios pay between $500 and $15000.",
    "While the Teams desktop client is currently the only application that’s listed under the new Applications Bounty program, Miyashita says that they’ll soon expand the scope of the program to include other apps as well.",
    "The news comes shortly after Microsoft announced a host of new security features for Teams, including limited end-to-end encryption (E2EE) functionality. This additional protection will be available to paying users and will initially apply to one-on-one meetings only, although Microsoft has hinted that E2EE will be extended to other meeting types further down the line.",
    "Rival video conferencing service Zoom found itself in hot water at the start of pandemic, when it emerged that claims its meeting participants were protected by full end-to-end encryption were unfounded."
  ],
  "headers": {
    "4": "Bounties up to $30,000"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "Microsoft Applications Bounty program": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_1440196452601604600&xs=1&url=https%3A%2F%2Fmsrc-blog.microsoft.com%2F2021%2F03%2F24%2Fintroducing-bounty-awards-for-teams-desktop-client-security-research%2F&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmicrosoft-is-offering-big-money-if-you-can-hack-teams",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "full end-to-end encryption": "https://www.techradar.com/news/zoom-calls-are-not-end-to-end-encrypted-even-though-it-says-they-are"
  }
}