{
  "source": "https://www.techradar.com/news/your-coros-sports-watch-is-about-to-get-a-huge-update",
  "title": "Your Coros sports watch is about to get a huge update",
  "category": "fitness",
  "updated": "2021-10-19T14:50:09Z",
  "author": "jamel-smith",
  "summary": "Climbers rejoice",
  "article": [
    "Coros has released new features for three of its most popular fitness watches, including several new tools specifically for climbers.",
    "Multi-pitch climbing mode is a new update for the Coros Vertix 2. It will use GPS to track your climbing technique. The new mode will record the pitches and gradients along your climb, and it’ll provide you with real-time information including pitch count, elevation gain, heart rate and training load. The new mode will also create a difficulty column chart that’ll be displayed in the Coros app after a workout.",
    "Users of the Coros Apex (both 42mm and 46mm models), Apex Pro, Vertix and Vertix 2 will all get Strava Route Syncing, which will sync your routes from Strava to the Coros app.",
    "Coros has also added a shortcut functionality, which is only available for Vertix 2 users at this time. By long-pressing the ‘light’ button, you can quickly gain access to one of your favorite features like the compass, map and sun movement.",
    "For serious climbers, Coros has also released a new hardware accessory, the Vertix 2 Carabiner, which replaces your watch strap and allows you to attach the body to your belt.",
    "Black Friday is a great time to upgrade your smartwatch, and we’re expecting to see some great deals from the biggest brands. There could be some big savings on a range of Garmin and Fitbit devices, plus older smartwatches from the likes of Samsung. Apple Watch deals are usually fairly modest, but the Apple Watch 6 might be an exception, as it's just been superseded by the new Apple Watch 7.",
    "If you own a Coros watch though (especially if you're a serious climber), you might decide to keep your wallet closed this year, as you're about to receive a big upgrade completely free."
  ],
  "headers": {
    "5": "Analysis: should you upgrade your smartwatch on Black Friday?"
  },
  "links": {
    "Coros Vertix 2": "https://www.techradar.com/reviews/coros-vertix-2",
    "Coros Apex": "https://www.techradar.com/reviews/coros-apex",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "smartwatch": "https://www.techradar.com/news/wearables/best-smart-watches-what-s-the-best-wearable-tech-for-you-1154074",
    "Garmin": "https://www.techradar.com/best/garmin-watch",
    "Fitbit": "https://www.techradar.com/best/the-best-fitbit",
    "Apple Watch deals": "https://www.techradar.com/black-friday/black-friday-apple-watch-deals-sales",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Apple Watch 7": "https://www.techradar.com/reviews/apple-watch-7"
  }
}