{
  "source": "https://www.techradar.com/news/heres-another-reason-why-you-no-longer-need-a-laptop-to-make-a-zoom-call",
  "title": "Here's another reason why you no longer need a laptop to make a Zoom call",
  "category": "computing",
  "updated": "2021-04-07T08:43:41Z",
  "author": "mike-moore",
  "summary": "Zoom comes to Amazon Echo Show 10 devices - but only in the US",
  "article": [
    "Taking your video conferencing calls when working from home has got a bit easier for some consumers after Amazon revealed more of its devices will now support Zoom.",
    "Namely, the Amazon Echo Show 10 will now be compatible with Zoom calls, with users who have their calendars synced to the devices can start meetings automatically using Alexa.",
    "To enter a Zoom meeting or call, users just have to give the command, “Alexa, join my meeting” or “Alexa, join my Zoom meeting”. Details will be taken from your calendar marker, meaning you may still need to enter a passcode to begin.",
    "The feature is only available in users in the US to begin with, but marks a significant step forward for Amazon's smart video devices, which could prove a valuable ally for those employees looking to work from home more regularly.",
    "The Amazon Echo Show 8 also already supports Zoom, with US users able to take meetings using the device since December 2020.",
    "However the Echo Show 10 is a far more interactive device, featuring a microphone array along the top, so Alexa can pick up your voice anywhere in the room. The Echo Show 10 also offers a better quality camera quality, which as well as making calls look clear and sharper, features a rotating screen that also pans and tilts during a call to ensure you're always in the center of the frame.",
    "The news also puts Amazon's device on a par with some competitors which already support Zoom calls. Facebook Portal announced in March 2021 that users were now able join Zoom meetings directly from their Portal device, and iPad users have been able to enjoy a dedicated Zoom app for some time.",
    "Recent research from Zoom found that remote working has been so successful for many businesses during the past year that many say they won't go back to a traditional way of working.",
    "Nearly three-quarters of organisations said the success of technologies such as video conferencing mean that their company is now considering a flexible remote working model for good.",
    "Via The Verge"
  ],
  "headers": {
    "3": "Alexa-powered"
  },
  "links": {
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Amazon Echo Show 10": "https://www.techradar.com/reviews/amazon-echo-show-10-review",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Facebook Portal": "https://www.techradar.com/reviews/facebook-portal-tv",
    "The Verge": "https://www.theverge.com/2021/4/5/22368216/amazon-echo-show-10-zoom-compatible-update"
  }
}