{
  "source": "https://www.techradar.com/news/is-the-force-strong-enough-with-quantic-dream-to-handle-star-wars-eclipse",
  "title": "Is the Force strong enough with Quantic Dream to handle Star Wars: Eclipse?",
  "category": "gaming",
  "updated": "2021-12-10T14:39:21Z",
  "author": "gerald-lynch",
  "summary": "From Heavy Rain to heavy blasters",
  "article": [
    "It's official – Star Wars Eclipse is a new game set in that most popular of galaxies far, far away, coming from Quantic Dream, the French studio responsible for games like Heavy Rain, Beyond: Two Souls and Detroit: Become Human.",
    "But is the Force strong enough with Quantic Dream to handle this mega-license?",
    "What began as a rumor originating from YouTuber Gautoz was finally unvieled at the 2021 Game Awards showcase. We were treated to an incredibly evocative cinematic that, while not necessarily indicative of gameplay, certainly set the tone for Quantic Dream's ambitions. Intrigue, aliens and drama seem set to be high on the agenda, if the above trailer is anything to go by.",
    "As it stands, there's no release date from the \"early in development\" title, and no release platforms set. But you can assume that it'll be a multi platform game taking advantage of the power of the PS5, Xbox Series X and high-end PCs, based on the scale of what's being established in the trailer.",
    "According to the official website, the game is \"a new action-adventure, multiple-character branching narrative game set in the High Republic era.\"",
    "\"Star Wars Eclipse lets you play as a diverse cast of charismatic characters, each with their own story, abilities, and role to play in the tapestry of events that could alter the carefully balanced peace of the Outer Rim.",
    "\"Choices have consequences: every decision you make can have dramatic repercussions on your journey. The way of life in the Outer Rim is being threatened and you must define your path.\"",
    "It’s not much to go on at the moment, but with the Star Wars license now free from the clutches of exclusivity at EA, and Quantic Dream cut loose from its Sony ties, the studios' involvement with such a rich universe opens up intriguing gaming possibilities.",
    "So, what could the Quantic Dream Star Wars game look like?",
    "From Farenheit (Indigo Prophecy) up to the impressive recent effort of Detroit: Become Human, Quantic Dream has always worked on narrative-focused games rather than action-oriented titles. You’d imagine that commitment to storytelling is what would have attracted Disney to the studio and could lead to a different take on Star Wars in games, focusing less on lightsabers and blasters and more on mystery, intrigue and branching dialogue. And certainly while the trailer has plenty of action, there's an unsettling creepiness in the presentation, and a sense of foreboding quite unlike what we usually see from the family-friendly Star Wars universe.",
    "The studio has always paired its cinematic ambitions with visual flair, too. Under the Sony partnership, the studio become something of a showpiece for the graphical capabilities of the last two PlayStation consoles. You’d imagine its eye for detail would continue into the rich Star Wars universe.",
    "It’s worth noting that Quantic Dream has been able to attract familiar Hollywood stars to its work previously. Beyond: Two Souls, for all its faults, offered two stellar performances from Elliot Page and Willem Defoe. The late David Bowie played two characters in the studio’s first game, The Nomad Soul, and offered ten original songs for its soundtrack. Could the stars of stage and screen be coaxed towards Quantic Dream’s cinematic storytelling style, or even some actors already seen popping up elsewhere in the Star Wars franchise?",
    "Having the restrictions of the Lucasfilm quality control team behind Quantic Dream could be beneficial too. Its titles, under the directorship of David Cage, are often conceptually magnificent, and rarely like anything else you find on consoles. But they can become a bit overblown, and buckle under the weight of their own ambition. Being tied into the stricter rules of the Star Wars universe could help deliver a more concise, direct game than the developer has managed before."
  ],
  "headers": {
    "8": "Analysis: a Quantic Dream Star Wars game blueprint"
  },
  "links": {
    "Star Wars Eclipse": "https://www.techradar.com/news/star-wars-eclipse-trailer-setting-news-and-rumors",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}