{
  "source": "https://www.techradar.com/news/heres-why-sony-just-postponed-the-launch-of-its-new-vlogging-camera",
  "title": "Here's why Sony just postponed the launch of its new vlogging camera",
  "category": "cameras",
  "updated": "2021-07-05T17:21:31Z",
  "author": "mark-wilson",
  "summary": "And no, it isn't because of the Nikon Zfc",
  "article": [
    "Sony has postponed the launch of its new vlogging camera just two days before its global announcement – and now the tech giant has told us the reason why it's pulled the plug.",
    "A teaser for the incoming camera appeared last week on Sony Alpha Universe and YouTube, promising a live launch on July 7 at 10am EDT / 3pm BST, or 12am AEST on July 8 for those in Australia.",
    "But now the placeholder simply reads that the \"new camera announcement has been postponed\". The reason? Sony Europe told us that it is \"due to the availability status for certain parts\".",
    "Sony didn't specify exactly which parts are the culprits, but it's fair to assume that the ongoing global chip shortage – which has affected everything from laptops to cars – could be at least partly to blame for the delay.",
    "Whatever the exact cause, Sony's statement echoes another one it made back in December 2020, when it said it was \"facing a severe shortage of key parts\" for its compact cameras and video cameras, following a factory fire in Japan.",
    "It's not clear how long Sony's new camera, whose teaser had the same visual styling as its Sony ZV-1 vlogging camera launch, will be delayed for. What's unusual about this postponement is how late in the day it is – after all, Sony only announced the launch four days ago, so something major has happened between now and then.",
    "Still, the signs are that the wait might not be too long – Sony told us that while \"the new date of the camera announcement is not yet determined\", it \"will set the new date as soon as possible\". The placeholder below also promises that \"a new date will be announced soon\".",
    "If it wasn't clear already, this year is going to be rife with delays to big product launches – and Sony's abrupt postponement of its next announcement shows that cameras will be no different.",
    "Analysts have said that a worldwide shortage of semiconductors will last for the rest of this year, and possibly much of 2022, leading to delays in the production and shipping of a huge array of electronics products, as anyone who's tried to buy an Nvidia graphics card or PS5 has experienced already.",
    "But given these issues are widely known, the last-minute postponement of Sony's new camera is slightly strange. This had led some to speculate that the reason might be anything from the recent arrival of the Nikon Zfc to a political clash with China over the launch date of July 7.",
    "Sony has now dismissed those rumors with its latest statement, as it presumably either waits for the shortages to resolve themselves or sources new components for its incoming camera.",
    "Following eighteen months that has seen the arrival of video-focused cameras like the Sony ZV-1, Sony A7S III, Sony FX3 and Sony A7C, Sony's new camera is expected to follow in that vein – as the teaser showing a microphone windshield confirms. But it sadly looks like we'll have to wait just a little longer to see it in the flesh."
  ],
  "headers": {
    "7": "Analysis: a sign of delays to come"
  },
  "links": {
    "global chip shortage": "https://www.techradar.com/news/another-top-source-says-global-chip-shortage-could-drag-on",
    "another one it made back in December 2020": "https://www.techradar.com/news/sony-acknowledges-severe-shortage-of-key-parts-for-its-compacts-and-video-cameras%20",
    "Sony ZV-1": "https://www.techradar.com/reviews/sony-zv-1",
    "Analysts have said": "https://www.techradar.com/news/another-top-source-says-global-chip-shortage-could-drag-on",
    "Nvidia graphics card": "https://www.techradar.com/news/nvidia-could-sacrifice-this-popular-gpu-to-make-more-rtx-3000-cards",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Nikon Zfc": "https://www.techradar.com/news/nikon-zfc-release-date-price-specs-and-features",
    "Sony A7S III": "https://www.techradar.com/reviews/sony-a7s-iii",
    "Sony FX3": "https://www.techradar.com/news/sony-fx3-is-officially-its-smallest-cheapest-cinema-camera-for-pro-filmmakers",
    "Sony A7C": "https://www.techradar.com/news/the-sony-a7c-is-a-tiny-full-frame-vlogging-camera-with-a-big-price-tag"
  }
}