{
  "source": "https://www.techradar.com/news/google-says-the-most-searched-for-term-on-bing-isgoogle",
  "title": "Google says the most searched-for term on Bing is....Google",
  "category": "computing",
  "updated": "2021-10-01T20:30:35Z",
  "author": "anthony-spadafora",
  "summary": "Using one search engine to find another",
  "article": [
    "Users of Microsoft's search engine Bing are searching for “Google” more than any other search term according to a lawyer representing Google's parent company Alphabet in an EU antitrust case.",
    "As first reported by Bloomberg, lawyer and partner at the Brussels-based law firm Garrigues, Alfonso Lamadrid revealed that “Google” is the most common search term on Bing when trying to get Google's $5bn antitrust fine overturned.",
    "In a recent statement to an EU court, Lamadrid made the case that people use Google due to the convenience of its search engine and not because they're forced to, saying:",
    "“We have submitted evidence showing that the most common search query on Bing is by far Google. People use Google because they choose to, not because they are forced to. Google’s market share in general search is consistent with consumer surveys showing that 95% of users prefer Google to rival search engines.”",
    "Back in 2018, Google was fined a record $5.1bn for abusing Android's dominant market position to drive more users to its search engine according to EU competition chief Margrethe Vestager.",
    "According to a blog post from the popular SEO tool maker Ahrefs, “Google” took the top spot with over 40m searches on Bing worldwide in 2021 alone followed by “YouTube”, “Facebook”, “Gmail” and “Amazon”. Meanwhile in the US, “Google” was the third most searched for term on Bing so far this year.",
    "The most likely reason that Google is the most searched for term is due to the fact that Bing is the default search engine on both Windows 10 and Microsoft Edge. Windows users setting up a new laptop or desktop PC often use Microsoft's browser first before installing Google Chrome using their search engine of choice, Google Search.",
    "As to whether or not Lamadrid's argument will help Google get its $5bn EU fine overturned, that will be up to the case's judge to decide.",
    "Via The Verge"
  ],
  "headers": {
    "4": "Google vs Bing"
  },
  "links": {
    "Bing": "https://www.techradar.com/reviews/bing-search-engine",
    "Alphabet": "https://www.techradar.com/news/alphabet-is-now-a-trillion-dollar-company",
    "first reported": "https://www.bloomberg.com/news/articles/2021-09-28/google-tells-judges-it-s-so-popular-it-s-bing-s-top-search-term?sref=ExbtjcSG",
    "fined a record $5.1bn": "https://www.techradar.com/news/google-faces-record-dollar5-billion-fine-in-eu-ordered-to-remove-chrome-from-android",
    "Margrethe Vestager": "https://www.techradar.com/news/google-data-collection-set-to-be-investigated-by-eu",
    "blog post": "https://ahrefs.com/blog/top-bing-searches/",
    "SEO tool": "https://www.techradar.com/news/best-seo-tool",
    "Ahrefs": "https://www.techradar.com/reviews/ahrefs",
    "Windows 10": "https://www.techradar.com/news/software/operating-systems/best-windows-10-deals-2015-1300938",
    "Microsoft Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "browser": "https://www.techradar.com/best/browser",
    "Google Chrome": "https://www.techradar.com/reviews/google-chrome",
    "The Verge": "https://www.theverge.com/2021/10/1/22703263/google-lawyer-argues-bing-used-find-google-top-search-defaults"
  }
}