{
  "source": "https://www.techradar.com/news/a-cheap-smartwatch-could-be-one-of-three-new-motorola-wearables-coming-in-2021",
  "title": "A cheap smartwatch could be one of three new Motorola wearables coming in 2021",
  "category": "wearables",
  "updated": "2021-02-26T15:29:02Z",
  "author": "tom-bedford",
  "summary": "A big year for Moto-themed watches",
  "article": [
    "Motorola doesn't make smartwatches any more, but a company called eBuyNow has the license to produce and market smartwatches under the Moto name. It's only put out one such device, the Moto 360 (2019), but through 2021 we could see many more similar devices.",
    "A Twitter user (and big Motorola fan, judging the profile) named Felipe Berhau acquired some leaked Motorola smartwatch marketing material, purportedly from a sales presentation. There are images of three as-yet-unannounced smartwatches: the Moto Watch, Moto One, and Moto G Smartwatch. Apparently the first two are coming out in July, and the last is coming in June.",
    "These pictures don't tell us much about the upcoming Moto smartwatches, as while we can see the designs, we don't know specs or what software they run. They'll likely be Wear OS though, like the Moto 360.",
    "Click 'See more' to view images of the three Moto smartwatches",
    "The Moto One and Moto G Smartwatch are both circular devices, while the Moto Watch is a 'squircle', or a square with rounded edges. They all look pretty sleek, as though a suave appearance is one of the key selling points.",
    "Both the Moto One and Moto Watch are paired together in the presentation - it's possible they're actually the same smartwatch, just with a different-shaped display, though the former has two crowns and the latter has just one, so this could be incorrect.",
    "Judging by the name, the Moto G Smartwatch could be an affordable model - we say this because Moto G smartphones are one of Motorola's lines of affordable devices, with low-end specs, and the name therefore denotes affordability.",
    "We'll wait to hear more about these smartwatches in the coming months (assuming they exist), and will bring you more information, and finally reviews, when we get them."
  ],
  "headers": {
    "3": "Motorola's new smartwatches"
  },
  "links": {
    "Moto 360 (2019)": "https://www.techradar.com/reviews/moto-360-2019",
    "Felipe Berhau": "https://twitter.com/FelipeBerhau/status/1365148948692877313"
  }
}