{
  "source": "https://www.techradar.com/news/new-amazon-kindle-paperwhite",
  "title": "New Amazon Kindle Paperwhite release date, price, specs and features",
  "category": "tablets",
  "updated": "2021-09-21T13:00:31Z",
  "author": "david-lumb",
  "summary": "The new Kindle Paperwhite brings long-desired upgrades",
  "article": [
    "Amazon has announced its newest ereader tablet, the Kindle Paperwhite 2021, with updated features and a bigger display.",
    "The Kindle Paperwhite 2021 remains Amazon’s mid-entry e-reader between the basic Kindle and the Kindle Oasis. With a starting price tag of $139 (around £100 / AU$190), it costs a bit more than its predecessor, the Kindle Paperwhite 2019, which started at $129.99 / £119.99 / AU$199.",
    "The new Kindle Paperwhite includes some long-awaited improvements on the old model, like swapping the micro-USB for a USB-C port and expanding the display from 6 inches to 6.8 inches. It still only has 8GB of onboard storage, though.",
    "Even more intriguing is Amazon’s move to split its e-reader between the Kindle Paperwhite standard model and a noticeably more expensive Kindle Paperwhite Signature Edition. While it’s effectively taking the place of the prior Paperwhite’s 32GB model, it has several more bells and whistles, including wireless charging.",
    "Both models are WiFi-only, and it’s unclear if there will be a 4G LTE version (let alone 5G) of any Paperwhite e-reader.",
    "There’s also a new Kindle Paperwhite Kids Edition, which is...essentially the same model, but priced a bit higher with a bundled kid-appealing device cover and a full year subscription to Amazon Kids Plus, which includes access to thousands of books (both to be read and listened to via Audible).",
    "The Kindle Paperwhite 2021 is available for preorder, and goes on sale October 27. The new Paperwhite is priced at $139 (around £100 / AU$190), a noticeable increase on the Paperwhite 2019’s starting price of / $129 / £119 / AU$199.",
    "The Kindle Paperwhite Signature Edition is also able to be preordered now and will be available to buy starting October 27. It costs $189 (around £139 / AU$259), which is likewise pricier than the Paperwhite 2019’s 32GB model, which the Signature Edition effectively replaces.",
    "The Kindle Paperwhite for Kids costs $159 (around £115 / AU$219) and includes a ‘kid-friendly cover,’ according to Amazon. All three models only come in black.",
    "The Kindle Paperwhite 2021 packs several improvements on the 2019 model, some more substantial than others.",
    "The big upgrades are the expansion from a 6-inch to a 6.8-inch display, with smaller bezels surrounding the screen but the same 300 pixels per inch density. Amazon claims the display is 10% brighter at maximum brightness, and there’s also an adjustable warm light and the returning white-on-black dark mode.",
    "The Kindle Paperwhite Signature Edition has an extra perk for its display – an auto-adjusting front light that tweaks the display brightness based on environmental light levels.",
    "Amazon claims both the Paperwhite and Paperwhite Signature Edition have up to 10 weeks of battery life, and even if that’s an exaggeration or not representative of normal use, it would still likely be an improvement over the estimated three weeks of battery life we found on the 2019 model.",
    "The other big upgrade is a switch from a Micro USB to USB-C port on both models, which enables either new model to recharge in 2.5 hours at 9W charging speeds (presumably the maximum). The Paperwhite Signature Edition also supports wireless charging.",
    "Both models also get a redesigned Kindle interface, with more filters and sorting options in the library app. And by the end of the year, Paperwhite owners will have an easier time setting up their devices through iOS and Android Kindle apps, which are getting updates later in 2021.",
    "Specs-wise, not much has changed from the 2019 models: the standard Kindle Paperwhite has 8GB of storage space, while the Paperwhite Signature Edition has 32GB.",
    "Amazon also introduced the Kindle Paperwhite for Kids, an e-reader purposely designed for younger readers who might want something a bit more mature and reading-focused than the Amazon Kindle for Kids.",
    "The Paperwhite for Kids is priced at $159 (around £115 / AU$219), which is notably higher than the Kindle for Kids’ price tag of $109 / £99 / (about AU$185). The new e-reader comes with the same two-year guarantee as the Kindle for Kids, as well as a one-year subscription to the Amazon Kids Plus content service. It’s also available for preorder now and will go on sale on October 27.",
    "The Paperwhite for Kids inherits a lot from its adult-oriented siblings, including their 6.8-inch glare-free display, IPX8 water resistance, and up to 10-week battery life.",
    "So what sets the Paperwhite for Kids apart from the other Paperwhite models (and justifies its higher pricetag than the new Paperwhite 2021)? Two things: a kid-friendly device cover included in the box, and that one-year subscription to Amazon Kids Plus.",
    "Given that Amazon Kids Plus retails for $36 / £24 (around $49) for Prime members or $60 / £48 (around AU$82) for non-members, it’s a slight value to get the Paperwhite For Kids if you’re intending to subscribe anyway, especially if you’re not paying for Prime already.",
    "Amazon Kids Plus gives subscribers access to thousands of books, including new releases as well as Audible audiobooks. It also has reading comprehension tools that give instant definitions, and a vocabulary builder that collects all the definitions looked up into a flash card-style review game. There are reading-related achievement badges and parental controls, too.",
    "What sets the Paperwhite for Kids apart from the Kindle for Kids? Mostly the benefits of using an e-reader over a tablet: no games, ads, or other distractions (including most apps), enabling a purer reading experience."
  ],
  "headers": {
    "6": "Kindle Paperwhite 2021 price and release date",
    "9": "Kindle Paperwhite 2021: what’s new?",
    "16": "Kindle Paperwhite for Kids: an e-reader for young readers"
  },
  "links": {
    "Amazon Kindle for Kids": "https://www.techradar.com/reviews/amazon-kindle-for-kids-review"
  }
}