{
  "source": "https://www.techradar.com/news/microsoft-wants-imessage-on-the-windows-11-store",
  "title": "Microsoft's Nadella issues iMessage Windows challenge to Apple",
  "category": "computing",
  "updated": "2021-06-25T10:36:44Z",
  "author": "daryl-baxter",
  "summary": "Could hell freeze over again?",
  "article": [
    "Now that Windows 11 is finally official, Microsoft was on the PR offensive, showcasing just how big of an update it is to the operating system. Alongside this, Satya Nadella expressed hope that iMessage could appear on the redesigned Microsoft Store.",
    "Apple applications on Windows have been few and far between, with iTunes being the big addition in 2003, followed by a brief stint of Safari in 2007, before it shut down in 2012. However, with the new Microsoft Store and the features it brings, there’s an opportunity for more applications from Apple to appear on Windows 11.",
    "With a refreshed new look, a focus on gaming, and even widgets making a return, it looks as though Microsoft wants to refine every aspect of Windows for the future, and apps look to be the main objective here.",
    "Apple’s messaging platform has grown in leaps and bounds since its debut in iOS 5 almost ten years ago. With Animoji, message effects, and soon in iOS 15, a way of creating a status for yourself to focus on other tasks so your contacts are aware, it’s another example of being part of the walled-garden of Apple.",
    "In an interview with Joanna Stern at the Wall Street Journal, Microsoft CEO Satya Nadella was asked if the new rules for the redesigned Microsoft Store in Windows 11 could open up the gates for even Apple to have apps available there.",
    "“We’d love to make sure that the iPhone works better (with Windows), we do everything we can. Like, anything Apple wants to do with Windows rather it’s iTunes, iMessage, or whatever, we welcome that. But, overall, we want to make sure our software runs great on Apple devices.” Satya added.",
    "While iMessage is still only available on Apple products, there’s always a chance that we may see it appear on other platforms. The FaceTime improvements showcased at WWDC have better positioned it to be a great Zoom alternative, especially as you can join a call from a Windows or Android device.",
    "However, with Windows 11 trying to appeal to many more developers to make sure that the new Microsoft Store is an alluring playing field, we may see Teams become the focus of a messaging app for the company instead, way before we see an alternative arrive in the operating system for now."
  ],
  "headers": {
    "3": "iMessage on Windows 11?"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Safari in 2007": "https://www.techradar.com/news/operating-systems/software/applications/internet/web/wwdc-07-apple-shocks-with-safari-for-windows-141792",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog"
  }
}