{
  "source": "https://www.techradar.com/news/even-highly-skilled-it-professionals-fall-prey-to-phishing-attacks",
  "title": "Even highly skilled IT professionals fall prey to phishing attacks",
  "category": "computing",
  "updated": "2021-07-20T14:02:17Z",
  "author": "mayank-sharma",
  "summary": "Remote working led to a steep rise in the number of successful phishing attacks, finds survey",
  "article": [
    "The global shift to remote working has further aggravated the onslaught, sophistication, and impact of phishing attacks, a new survey has suggested.",
    "Security vendor Ivanti quizzed over a thousand enterprise IT professionals across the US, UK, France, Germany, Australia and Japan, finding nearly three-quarters (74%) of organizations claimed to have fallen victim to a phishing attack in the last year.",
    "As many as 40% confirming they were victimized in the last month alone.",
    "Ivanti builds on a recent research by Aberdeen, which discovered that attackers have a higher success rate on mobile endpoints than on servers.",
    "“Reducing the risk of phishing attacks is a race against time, in more than one dimension. Enterprise IT pros must stay ahead not only of the attackers who are constantly crafting new attacks, but also of their own users — who are shockingly quick to click on malicious links,” said Derek E. Brink, vice president and research fellow at Aberdeen Strategy & Research.",
    "With threat actors constantly on the lookout for exploiting enterprise security gaps, combining the results of the survey Ivanti and Aberdeen’s, Ivanti believes that fatigued IT teams and ill-prepared employees are making businesses lose the war on phishing.",
    "It builds its case by relying on the fact that 73% of respondents said that their IT staff had been targeted by phishing attempts, and 47% of those attempts were successful.",
    "“Anyone, regardless of experience or cybersecurity savvy, is susceptible to a phishing attack. After all, the survey found that nearly half of IT professionals have been duped,” said Chris Goettl, senior director of product management at Ivanti.",
    "Ivanti is using the survey to suggest businesses to implement a zero-trust security strategy to combat phishing attacks.",
    "“Organizations should also consider getting rid of passwords by leveraging mobile device authentication with biometric-based access to eliminate the primary point of compromise in phishing attacks,” suggests Goettl."
  ],
  "headers": {
    "5": "Exploiting gaps"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "phishing": "https://www.techradar.com/news/what-is-phishing-and-how-dangerous-is-it",
    "endpoints": "https://www.techradar.com/news/best-endpoint-security-software",
    "servers": "https://www.techradar.com/news/best-small-business-servers",
    "cybersecurity": "https://www.techradar.com/best/best-online-cyber-security-courses"
  }
}