{
  "source": "https://www.techradar.com/news/the-sims-4-is-finally-giving-you-some-free-content",
  "title": "The Sims 4 is finally giving you some free content",
  "category": "gaming",
  "updated": "2021-09-06T10:06:05Z",
  "author": "jess-weatherbed",
  "summary": "If you own the Spa Day DLC that is",
  "article": [
    "EA has confirmed that the Spa Day content pack for The Sims 4 is getting a large update to provide new features. As reported by PC Gamer, the DLC update is completely free, so if you already own the pack you won't have to drop any cash to enjoy the new content.",
    "The Spa Day pack was originally released back in 2015, and while it received generally positive reviews, its value was criticized due to the additional content being smaller than comparatively priced expansions. In this refresh, Sims can now get new Wellness aspirations: Zen Guru, Self-Care Specialist, and Inner Peace.",
    "Face masks, manicures and pedicures have also been added to the activities list, which means The Sims 4 finally has native support for nails, allowing you to change the shape, design and color. Nails have long been something that the modding community has made available, but the Spa Day refresh is the first time that a Sims game has given users the ability to make adjustments to the default nails.",
    "The Sims is a series of life simulation games that are known for their many expansions packs, some of which have been criticized for being too expensive for what you're getting. The Sims 4 base game received backlash when it was released in 2014 due to content that had previously been included as standard being omitted, such as swimming pools (later added in patch 7) and the 'toddler' life stage (added via patch in 2017), so this refresh to the Spa Day pack at no extra cost to the consumer is a welcome update.",
    "The Sims has a large modding community, with many dedicated designers on websites such as The Sims Resource and Mod The Sims creating new hairstyles, clothing and furniture for the games. While some sites request you make a donation to the creators sign up for a subscription to increase a download limit, many of these mods are available for free.",
    "With so much content available at no extra cost, is there any need for lackluster DLC packs such as Spa Day to get a free update?",
    "Yes. Not every gamer will want to use mods to improve the game experience, so native content is always welcome. But with features like painted nails having been readily available for many years now (if you were willing to source out the required mods), the development time could have been better spent working on fresh DLC, or even the highly anticipated Sims 5.",
    "Free content is always a good thing – after all, what do you have to lose? That said, as a big fan of The Sims myself, an overpriced DLC pack from 2015 wasn't keeping me up at night. This could have easily served as a lesson learned for when a similar content pack is released for The Sims 5, but with EA stripping more and more core features from each version of The Sims, there's a possibility that more features will be packaged behind a purchasable DLC pack."
  ],
  "headers": {
    "4": "Opinion: Should The Sims get more free updates?"
  },
  "links": {
    "PC Gamer": "https://www.pcgamer.com/ea-confirms-the-sims-4-spa-day-is-getting-a-big-free-update/",
    "The Sims": "https://www.techradar.com/news/with-a-little-help-from-their-friends-how-the-sims-4s-community-has-helped-shape-the-game",
    "The Sims Resource": "https://www.thesimsresource.com/downloads/browse/category/sims4-mods/",
    "Mod The Sims": "https://modthesims.info/browse/ts4/",
    "Sims 5": "https://www.techradar.com/news/the-sims-5-news-multiplayer-rumors-and-everything-we-know"
  }
}