{
  "source": "https://www.techradar.com/news/intel-alder-lake-cpu-rumored-specs-could-mean-amd-has-a-serious-fight-on-its-hands",
  "title": "Intel Alder Lake CPU rumored specs could mean AMD has a serious fight on its hands",
  "category": "computing",
  "updated": "2021-07-15T09:37:11Z",
  "author": "darren-allan",
  "summary": "Leaked Core i9, Core i7 and Core i5 specs could give AMD some sleepless nights",
  "article": [
    "Alder Lake is seeing more and more leakage as the release of Intel’s 12th-gen processors draws nearer, and the latest spillage fills in the purported details of the specs of some of the key Core i9, Core i7 and Core i5 offerings.",
    "This is another leak from a Chinese source, specifically the Zhihu website as highlighted by VideoCardz, and given its nature, we’re more skeptical than normal around this rumor – so tread very carefully here – but it does at least partly back up speculation from elsewhere.",
    "Namely that the flagship Core i9-12900K will offer a top single-core Turbo speed of 5.3GHz with the standard full-power cores, and 5GHz across all-cores, while the low-power cores will run at 3.9GHz and 3.7GHz all-core boost.",
    "This chip will have 8 cores of each (making 16 in total), with these different cores being referred to as ‘P-Cores’ and ‘E-Cores’, meaning performance (full-power, or normal) cores and efficient (low-power) cores respectively. The leak also shows that 30MB of L3 Cache is on-board, and the CPU has a TDP of 125W (base power consumption), with a ‘PL2’ – the maximum power draw when the chip is running flat-out – pegged at 228W. If true, the latter would represent a close to 10% improvement compared to Rocket Lake, which hit 250W when it came to PL2 draw.",
    "If you’ve been following the news on Alder Lake, you’ll be aware that it’s a whole different way of operating for Intel, adopting a new model very similar to ARM’s big.LITTLE tech.",
    "The leak also revealed the supposed spec of the Core i7-12700K and Core i5-12600K, with all these details reportedly based on qualification samples – pre-release models of the CPUs – which have been sent out by Intel to partners. These chips used by hardware and software makers for testing out incoming CPUs with their products should in theory carry the same spec as the final silicon.",
    "The Core i7-12700K will apparently run with 8 full-power cores plus 4 low-power, with the P-Core Turbo hitting 5GHz on a single-core or 4.7GHz across all-cores, and the E-Cores reaching 3.8GHz and 3.6GHz respectively. It’ll have 25MB of L3 Cache.",
    "Finally, the Core i5-12600K will go with 6 full-power cores plus 4 low-power, with Turbo on the former hitting 4.9GHz flat-out or 4.5GHz all-core. The power-efficient cores will run at a top speed of 3.6GHz and 3.4GHz all-core, with 20MB of L3 Cache present. All these chips are listed with the same power consumption values as the Core i9 flagship.",
    "These CPUs look to be shaping up nicely, then, in terms of clocks and those improved TDPs – bettering Rocket Lake as we mentioned – going by this leak. And with the low-power cores expected to make a sizeable impact on overall performance, along with Windows 11 applying tweaks under the hood to better accommodate the 12th-gen silicon, Alder Lake is starting to look like it might be Intel’s big chance to get back into the game in the desktop CPU sphere.",
    "The prospects of the 12th-gen processors certainly aren’t hurt by the fact that AMD doesn’t appear to have a timely response in terms of its own next-gen Ryzen CPUs, with no Zen 3+ overhaul in sight, and Zen 4 models anticipated to not be arriving until late in 2022 – almost a year after Alder Lake, by which time Intel should have Raptor Lake out.",
    "Of course, AMD won’t offer no response at all in the intervening time, with the rumor mill currently theorizing that some kind of refresh will fill the potentially sizeable gap between Ryzen 5000 and Ryzen 6000 processors. That stopgap could come in the form of revamped Ryzen 5000 XT models at the start of 2022, which might be made more tempting by making use of the 3D Chiplet tech that was unveiled back at Computex."
  ],
  "headers": {
    "8": "All coming together?"
  },
  "links": {
    "Alder Lake": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "draws nearer": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "VideoCardz": "https://videocardz.com/newz/specifications-of-intel-core-i9-12900k-i7-12700k-and-i5-12600k-alder-lake-cpus-leak-out",
    "partly back up speculation from elsewhere": "https://www.techradar.com/news/intel-alder-lake-flagship-cpu-may-not-boost-as-fast-as-rumor-mill-hoped",
    "Rocket Lake": "https://www.techradar.com/reviews/intel-core-i9-11900k",
    "news on Alder Lake": "https://www.techradar.com/news/intel-alder-lake-cpu-spotted-in-first-game-benchmark",
    "expected to make a sizeable impact on overall performance": "https://www.techradar.com/news/intel-alder-lake-cpus-could-be-more-powerful-than-we-thought",
    "Windows 11": "https://www.techradar.com/news/how-to-download-windows-11",
    "better accommodate the 12th-gen silicon": "https://www.techradar.com/news/intel-alder-lake-cpus-now-rumored-to-launch-in-october-alongside-the-next-generation-of-windows",
    "processors": "https://www.techradar.com/news/best-processors",
    "Raptor Lake": "https://www.techradar.com/news/intels-raptor-lake-with-24-core-cpu-could-take-on-amd-zen-4-in-2022",
    "rumor mill currently theorizing": "https://www.techradar.com/news/intels-raptor-lake-with-24-core-cpu-could-take-on-amd-zen-4-in-2022",
    "3D Chiplet tech that was unveiled back at Computex": "https://www.techradar.com/news/amd-3d-chiplet-technology-meet-the-future-of-processors"
  }
}