{
  "source": "https://www.techradar.com/news/cyberpunk-2077-patch-12-delayed-with-cd-projekt-red-cyber-attack-to-blame",
  "title": "Cyberpunk 2077 patch 1.2 delayed (with CD Projekt Red cyber attack to blame)",
  "category": "gaming",
  "updated": "2021-12-02T11:26:35Z",
  "author": "hamish-hector",
  "summary": "More patience needed",
  "article": [
    "Patch 1.2 for Cyberpunk 2077 has been delayed. Originally slated to release this month, the update for the beleaguered sci-fi RPG is now expected sometime in the “second half of March” according to CD Projekt Red.",
    "In a tweet, the official Cyberpunk 2077 account explained that the delay was thanks to the recent cyber attack the studio experienced stating that it would \"need some additional time.” The patch is meant to be a large one that will not only provide many quality of life improvements but multiple fixes for the original release's many bugs.",
    "Delays are something the studio has become known for after Cyberpunk 2077 was pushed back multiple times, but this latest one is perhaps the most unfortunate so far, due to the problematic state the game launched in on consoles. Thankfully the delay is only a month or so if the developer's estimate proves accurate.",
    "A cyber attack on the game's developers resulted in source code for CD Projekt Red’s Witcher 3, Gwent and Cyberpunk 2077 being stolen alongside \"documents relating to accounting, administration, legal, HR, investor relations and more.\"",
    "CD Projekt Red was issued a ransom note but refused to give in to the hacker’s demands. Following this, the files reportedly sold on the dark web fetching around $7 million.",
    "The delay to patch 1.2 has likely been caused due to CD Projekt Red analyzing what data was stolen, particularly any personal data of its current and former employees or business partners, as well as tightening the security of its systems."
  ],
  "headers": {
    "3": "What happened in the cyber attack?"
  },
  "links": {
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "official Cyberpunk 2077 account": "https://twitter.com/CyberpunkGame/status/1364607741680115717?s=20",
    "cyber attack": "https://www.techradar.com/news/cyberpunk-2077-developer-has-become-the-victim-of-a-targeted-cyber-attack",
    "pushed back multiple times,": "https://www.techradar.com/news/cyberpunk-2077-has-been-delayed-again",
    "reportedly": "https://twitter.com/Intel_by_KELA/status/1359856145205239812?s=20"
  }
}