{
  "source": "https://www.techradar.com/news/this-stunning-dell-xps-17-black-friday-deal-will-save-you-a-huge-dollar650",
  "title": "This stunning Dell XPS 17 Black Friday deal will save you a huge $650",
  "category": "computing",
  "updated": "2021-11-26T14:50:25Z",
  "author": "matt-hanson",
  "summary": "Dell XPS 17 is big, beautiful, and more affordable than ever",
  "article": [
    "Dell has just given a major Black Friday price cut to its excellent Dell XPS 17 laptops. This thin and light 17-inch laptop combines a large screen that's brilliant for working on with a slimline design that you'd often see on smaller laptops, making it a great portable notebook for anyone who'd like to use a large screen.",
    "As part of the Dell Black Friday deals, the retailer has cut the price of the Dell XPS 17 with an Intel Core i7 processor, Nvidia RTX 2060 GPU and 16GB of RAM by $650 to just $1,649.99. That's a brilliant price for such a powerful laptop.",
    "It's also cut the price of a range of Dell XPS 17 configurations, and we've picked the best below.",
    "If you're in the UK, then Dell has some great XPS 17 offers for Black Friday as well, with the model with an Intel Core i7, 16GB RAM and Nvidia RTX 3060 graphics card for £650 off, now just £2,049.",
    "Not in the US or UK? Scroll down for deals in your region.",
    "The Dell XPS 17 is one of the best 17-inch laptops in the world, offering you an incredibly stylish design and a large, high-resolution, screen which makes working on a joy.",
    "Of course, it's also great as a media playing machine, and there are certain Dell XPS 17 configurations that come with Nvidia RTX 3060 GPUs, which means it can even play games as well. Combine that with some hefty discounts, and it's one of the best laptops you can buy on Black Friday.",
    "No matter where you live, you'll find all the lowest prices for the Dell XPS 17 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "5": "Today's best Dell XPS 17 UK deals",
    "7": "More Dell XPS 17 deals",
    "8": "More Black Friday deals"
  },
  "links": {
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Dell Black Friday deals": "https://www.techradar.com/black-friday/dell-black-friday-deals",
    "to just $1,649.99": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-4987240872168035000/https://www.dell.com/en-us/shop/dell-laptops/xps-17-laptop/spd/xps-17-9700-laptop/xn9700ezmbs",
    "now just £2,049": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-9323922574784130000/https://deals.dell.com/en-uk/productdetail/bm9r",
    "best 17-inch laptops": "https://www.techradar.com/news/best-17-inch-laptop"
  }
}