{
  "source": "https://www.techradar.com/news/poor-storage-infrastructure-prevents-businesses-from-making-sense-of-their-data",
  "title": "Poor storage infrastructure prevents businesses from making sense of their data",
  "category": "computing",
  "updated": "2021-06-14T10:05:34Z",
  "author": "sead-fadilpasic",
  "summary": "A needle in a data haystack is impossible to find",
  "article": [
    "Businesses are generating vast amounts of data, but instead of putting it to good use, they’re letting it sit and rot, never using it to realize various business benefits, new research has said.",
    "A report from storage and information management services provider Iron Mountain claims that 200 Exabytes of data are generated every day (1.1 Gigabytes per person, per hour), with enterprises accounting for almost half (42.2%) of that.",
    "The Covid-19 pandemic has played a major role in the growth of data generated, it added, as many businesses accelerated their digital transformation projects last year in a bid to stay operational in what was a highly disruptive period.",
    "However, these businesses often don’t have the infrastructure necessary to support this data and make use of it. They’re unable to properly analyze, protect or streamline the data coming into their digital sandpit. As a result, instead of indexing the data, using what’s useful and removing the rest, they just send most of it to storage.",
    "What they end up, Iron Mountain claims, is a “data haystack”, in which the useful “needles” are impossible to find. Not only does that make them miss crucial business opportunities, but also makes them more vulnerable to cyberattacks.",
    "“In short, most organizations don’t even know they are sitting on a potential data goldmine, making that data worthless. Even worse, storing that data costs them money,” it said.",
    "Despite the seemingly hopeless outlook, there is a way for businesses to turn things around, Iron Mountain says, claiming that it takes six steps for organizations to start making better use of their data.",
    "Those six steps are being proactive (investing in consulting services and digital solutions), developing a robust data tiering system (identifying the most important and least important data bit), automating (investing in data lifecycle automation), improving storage payment (only paying for the storage space that’s actually needed), leveraging AI and ML (AI and ML can reveal previously unseen relationships between disparate information assets), and evading cyber attacks (by establishing cybersecurity best practices organization-wide)."
  ],
  "headers": {
    "4": "Data haystack"
  },
  "links": {
    "data": "https://www.techradar.com/news/the-best-cloud-storage",
    "storage": "https://www.techradar.com/news/the-best-cloud-storage"
  }
}