{
  "source": "https://www.techradar.com/news/apple-wants-to-make-everything-haptic-including-beds",
  "title": "Apple wants to make everything haptic, including beds",
  "category": "wearables",
  "updated": "2021-03-25T17:00:46Z",
  "author": "hamish-hector",
  "summary": "For those who want to feel asleep",
  "article": [
    "Apple’s quest to make everything haptic continues, this time with designs for a haptic bed. Following in the wake of news that Apple might be making haptic socks, the tech giant may be looking to produce a sort of haptic mattress that can monitor and help control your sleeping patterns.",
    "The potential new product was spotted in a patent published on Thursday that details a “pneumatic haptic device” that is for use on top of a bed mattress. Images of the haptic bed show off different cells that can be inflated or deflated using a fluid – either a gas or liquid – to produce impulses the user would be able to feel.",
    "This patent is yet another example of Apple’s desire to dominate the world of sleeping, following their acquisition of Beddit in 2017 and adding sleep tracking to Apple Watches last year. As with all patents though, we have to remember that this haptic mattress may never be more than a dream.",
    "Unlike most other haptic peripherals we’ve seen, we can’t think of many ways Apple’s mattress device could tie into virtual reality, so we doubt that Apple’s VR headset and Apple Glass will come with any specific integration.",
    "Instead, we imagine that the haptic bed would predominantly be used to track sleep. Combined with other sensors, the haptic mattress could detect what sleeping positions you snore loudest in and gently nudge you towards quieter ones.",
    "If you’re someone that hates hearing your alarm in the morning, the haptic bed could silently wake you up – and might make it a little harder for you to doze off again. Alternatively, it could offer you a relaxing massage to help you drift off in the evening.",
    "For now, we’ll have to wait and see what this haptic bed turns into – if it becomes reality at all. We imagine Apple might want to sleep on the idea a little more before anything is finalized.",
    "Via AppleInsider"
  ],
  "headers": {
    "3": "Why would you want a haptic mattress?"
  },
  "links": {
    "haptic socks": "https://www.techradar.com/news/apple-ar-and-vr-might-use-haptic-socks",
    "Apple’s VR headset": "https://www.techradar.com/news/apple-vr-headset",
    "Apple Glass": "https://www.techradar.com/news/apple-glasses",
    "AppleInsider": "https://appleinsider.com/articles/21/03/25/apple-researching-mattress-haptic-system-to-wake-relax-users"
  }
}