{
  "source": "https://www.techradar.com/news/many-workers-were-stuck-with-barely-functional-laptops-during-the-pandemic",
  "title": "Many workers were stuck with barely functional laptops during the pandemic",
  "category": "computing",
  "updated": "2021-11-30T15:13:46Z",
  "author": "sead-fadilpasic",
  "summary": "Transitioning to hybrid working was a pain for many",
  "article": [
    "Poorly performing laptops and an often unresponsive IT department were some of the toughest challenges facing remote and hybrid workers during the pandemic, new research has found.",
    "Polling more than 2,000 office workers on how well today’s technology supports the flexible workplace of the future, Apogee Corporation found almost half (45%) of UK employees were frustrated with malfunctioning laptops and other hardware.",
    "Overall, over a third (35%) of workers said they struggled to transition into remote and hybrid working as a result.",
    "IT departments weren’t of much help either, as they were often slow to respond, or unresponsive altogether. Almost a fifth (19%) of the respondents didn’t know who to turn to with their IT issues, while 14% described their IT department as unreliable.",
    "It’s not just the employees that are missing out, as a result. Companies are hurting, as well, the report states, as hindered productivity means less revenue. In fact, UK workers lost an average of 85 hours due to tech woes, costing their businesses around $150 million a week.",
    "“Businesses cannot afford to keep losing money with downtime and poor solutions”, said Aurelio Maruggi, CEO of Apogee. “As hybrid working models continue to define the future of work, organizations should outsource their workplace service supplier to ensure the coming months and years are productive and profitable.”",
    "To make things better, the IT department needs to change and to become more responsive, the report further found. A vast majority of the younger workforce (87% of the 16-24s) said they’d change their company’s IT (much more than 46% of those aged 55 and above), while 25% would like to see a more responsive IT department.",
    "Another quarter (24%) would like better facilities and more advanced computer hardware, as well, while the younger generation would prefer quicker software updates and improved sustainability."
  ],
  "headers": {
    "3": "Losing precious hours"
  },
  "links": {
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "hardware": "https://www.techradar.com/news/best-business-tablets",
    "advanced computer hardware": "https://www.techradar.com/news/best-business-desktop-pcs"
  }
}