{
  "source": "https://www.techradar.com/news/call-of-duty-vanguard-ps5-dualsense-support-is-coming-but-we-have-concerns",
  "title": "Call of Duty: Vanguard PS5 DualSense support is coming... but we have concerns",
  "category": "gaming",
  "updated": "2021-11-12T03:01:52Z",
  "author": "jamel-smith",
  "summary": "Opinion: Multiplayer may not need this immersive experience",
  "article": [
    "Activision’s Sledgehammer Games has outlined how the upcoming Call of Duty: Vanguard will use the adaptive triggers and haptic feedback of the PS5 DualSense controller.",
    "It’s exciting news for PS5 owners, as the adaptive triggers bring a greatly enhanced sense of immersion to first-person shooters, by simulating the trigger weight of real-world weapons, while haptic feedback will make you feel vibrations that mimic explosions going off around you and the recoil from firing a gun.",
    "However, while playing last year’s Call of Duty: Black Ops Cold War, we found the controller functions to be a nuisance in the multiplayer and zombies mode, and it looks like Vanguard will contain the same issues.",
    "In a blog post, Sledgehammer Games says that when pressing the adaptive triggers, players will feel varying degrees of feedback depending on the weight of weapons they’re using.",
    "The blog post says that, for example “if you’re running around with a 1911 sidearm [pistol] you’ll feel a moderate amount of tension” when pressing R2, so a sidearm won’t hold the same weight as a marksman rifle or light machine gun.",
    "Attachments on your weapons will also affect the feedback of the adaptive trigger, as adding more attachments increases the weight of a weapon, so this will be something players will need to be mindful of.",
    "Call of Duty: Black Ops Cold War leveraged the features of the DualSense in similar ways as Vanguard will, and we were impressed by how the triggers behaved when we used different weapons; for example, you could feel an immense amount of recoil with a shotgun, while the trigger would almost rattle back and forth when using a sub-machine gun, as you can see below.",
    "However, while playing Cold War, we found the controller functions to be a nuisance in the multiplayer and zombies mode, and it looks like Vanguard will contain the same issues.",
    "The adaptive triggers worked well in the campaign, as having a steady and near-perfect aim isn’t essential when you’re trying to kill unchallenging NPCs (non-player characters). NPCs tend to have poor aim, and they’re unlikely to kill you in a split second, compared to playing against real-life players in multiplayer.",
    "But, in the multiplayer and Zombies modes, the adaptive triggers became an inconvenience. Having a steady aim in multiplayer is crucial, as you need to quickly kill enemy players before they kill you.",
    "To steady your aim while shooting you need to fight against weapon recoil, which will otherwise throw off your aim. But having to apply additional finger pressure when pressing R2 can also throw off your aim, something that’s especially an issue when using machine guns that rattle the trigger back and forth.",
    "All we want in multiplayer is to be able to easily pull the trigger to quickly kill an enemy, and because the adaptive triggers make that more difficult, the feature has to be turned off. And we weren’t the only ones who found we needed to turn off the feature in multiplayer, as this Reddit thread shows:",
    "After playing multiple rounds in zombies mode, and shooting hundreds of zombies, we found that the adaptive triggers caused some soreness in the fingers. Again, the triggers are rattling, and the pressure can be fatiguing on your fingers when you’ve been playing zombies for 50 minutes straight. Because of this, we had to turn off the adaptive triggers in zombies mode.",
    "This suggests that Call of Duty: Vanguard players may want to turn off adaptive triggers in Multiplayer and zombies mode if these issues persist.",
    "Players who have problems with the triggers, but who still want an immersive experience, can adjust the settings via the PS5 settings menu at the top-right corner of the screen. Scroll down to Accessibility, and then to Controllers. Here you’ll find a range of settings that let you adjust or disable Trigger Effect Intensity. You can also turn off the PS5 adaptive triggers and haptic feedback altogether."
  ],
  "headers": {
    "6": "The adaptive triggers have been a problem"
  },
  "links": {
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "DualSense": "https://www.techradar.com/how-to/how-to-use-the-ps5-dualsense-controller-on-a-pc",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "Call of Duty: Black Ops Cold War": "https://www.techradar.com/reviews/call-of-duty-black-ops-cold-war",
    "In a blog post": "https://blog.playstation.com/2021/10/25/the-tactile-experience-of-playing-call-of-duty-vanguard-on-ps5/",
    "turn off the PS5 adaptive triggers and haptic feedback": "https://www.techradar.com/how-to/how-to-turn-off-ps5-adaptive-triggers-and-haptic-feedback"
  }
}