{
  "source": "https://www.techradar.com/news/lgs-88-inch-8k-oled-tv-is-expensive-but-its-still-cheaper-than-the-zx-was",
  "title": "LG’s 88-inch 8K OLED TV is expensive, but it's still cheaper than the ZX was",
  "category": "televisions",
  "updated": "2021-03-29T13:02:11Z",
  "author": "henry-st-leger",
  "summary": "LG brings down its launch price for its 88-inch 8K OLED",
  "article": [
    "The LG Z1 8K OLED TV has had its pricing confirmed, and those of you after a high-spec, big-screen television that truly impresses will be glad to know it's a bit cheaper than we might have expected based off last year's model.",
    "The LG Z1's pricing has only been unveiled in the UK, but its £24,999 price for an 88-inch size makes it clear that prices are slowly dropping for LG's most coveted technology – OLED with 8K resolution – and make it pretty certain that we'll see similar gains in the US and elsewhere.",
    "Last year's 88-inch LG ZX OLED originally retailed for $29,999 / £29,999 / AU$71,999 at launch, only recently dropping to £19,999 in the UK after a hefty discount, and kept its lofty launch price in North America. We expect, then, that the LG Z1 will retail for $24,999 in the US, and possibly cheaper than that AU$71,999 price tag in Australia.",
    "The somewhat-lower launch price of the LG Z1, though, means its not as simple as opting for the cheaper, older model – and those of you with cash to spend may well wish to opt for its newer iteration, or wait for a good Black Friday deal later in the year.",
    "It's only the 88-inch model that has seen some incremental savings, though. The smaller 77-inch size starts at £19,999, and we expect it to cost $19,999 in the US, and around AU$36,999 in Australia in line with last year's model. By comparison, last year's 77-inch LG ZX is now retailing for a reduced £11,999.",
    "The 77-inch and 88-inch sizes for the LG Z1 OLED will release in the UK on May 1, 2021. US availability is yet to be confirmed, but it'll likely be around the same time, with Australia getting the set a bit later in the year.",
    "The LG Z1 OLED gives you the benefits of 8K resolution detail, at a size where the step up from 4K really makes a difference. It's one of the few 8K OLED TVs, too, with only LG really pursuing the overlap of these two high-spec panel technologies, meaning you don't have to choose between 8K and OLED when picking your next TV upgrade.",
    "That means you're getting the exceptionally deep blacks and infinite contrast ratio of an OLED TV, as well as the a9 Gen 4 AI processor also being used in this year's LG C1 OLED and LG G1 OLED.",
    "It's a good way to futureproof for 8K gaming, too, especially with HDMI 2.1 and VRR support, though keep in mind that 4K games are still catching on, so it might be a while before you get the full benefits of this screen, if at all."
  ],
  "headers": {
    "6": "Why the LG Z1 OLED?"
  },
  "links": {
    "recently dropping to £19,999 in the UK after a hefty discount": "https://www.techradar.com/news/lgs-massive-8k-oled-tv-just-got-a-pound10000-discount",
    "Black Friday deal": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "is now retailing for a reduced £11,999": "https://www.techradar.com/news/lgs-massive-8k-oled-tv-just-got-a-pound10000-discount",
    "8K resolution": "https://www.techradar.com/news/8k-tv-everything-you-need-to-know-about-the-futuristic-resolution",
    "8K OLED TV": "https://www.techradar.com/best/best-8k-tv",
    "8K and OLED": "https://www.techradar.com/news/oled-vs-8k",
    "LG C1 OLED": "https://www.techradar.com/reviews/lg-c1-oled-tv-oled65c1",
    "LG G1 OLED": "https://www.techradar.com/reviews/lg-g1-oled-tv",
    "8K gaming": "https://www.techradar.com/news/8k-tvs-and-gaming-how-gaming-is-going-to-get-better-in-ultra-ultra-hd",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "VRR": "https://www.techradar.com/news/what-is-vrr-variable-refresh-rate-explained",
    "4K games": "https://www.techradar.com/news/gaming/5-best-4k-games-the-best-looking-titles-to-play-in-4k-1296513"
  }
}