{
  "source": "https://www.techradar.com/news/psvr-2-needs-a-social-space-and-a-playstation-home-return-could-be-it",
  "title": "PSVR 2 needs a social space – and a PlayStation Home return could be it",
  "category": "gaming",
  "updated": "2021-07-26T09:49:00Z",
  "author": "gerald-lynch",
  "summary": "A Sims-like in VR? Count us in.",
  "article": [
    "Remember PlayStation Home? The ill-fated social hangout space that was on the PlayStation 3? It could be making a return for the PS5 generation.",
    "Part chatroom, part Sims-like design app, PlayStation Home was closed in 2015 and never saw a resurgence on the PlayStation 4. But a new trademark application, submitted on July 21, 2021, suggests Sony is seriously considering bringing back the service – it’s the third time in three months that Sony’s made applications regarding PlayStation Home.",
    "Sony’s latest trademark application has seen it secure the name until October 2028, categorising PlayStation Home as “goods and services” within “computer game software” – suggestive of a free-to-play model, much like the first incarnation of Home.",
    "At present, Sony’s made no official announcement that PlayStation Home could be returning – but it may prove better timed in the present day than it ever did in the PS3 era.",
    "It’s been a world-changing two years since the Covid-19 pandemic reared its ugly head, changing many of the daily activities we used to take for granted. Not least among these are social norms – who thought we’d all be wearing masks every day, actively maintaining distance from our peers and avoiding any social gatherings with anyone other than our household members?",
    "As such, the rise in digital hangout options has surged – whether you’re on a WhatsApp call with your mum, or taking a business meeting on Zoom, face-to-face interaction has been largely replaced by digital chats in the past two years. With broadband and mobile connectivity as good as it has ever been, we’ve been able to relatively painlessly jump from text-based messaging services to video calls en-masse.",
    "But there’s another wave of interactive social apps that Sony is looking to capitalize on here – not just those like Second Life, which let you create a digital avatar to explore an idealised world with (though the original PlayStation Home did most closely resemble that). The real money is in the likes of Fortnite, which is able now to host huge in-game concert events with real-world stars, and generate a fortune in the process. PlayStation Home could be the perfect intersection point for Sony to tap into a generation reared on digital interaction, and monetise them at the same time, with the power of the PS5 and its quick loading times making it a friction-free portal.",
    "But one step beyond that still is Sony’s virtual reality ambitions. We already know that Sony has a PSVR 2 headset in the works, expected to release in time for the end of 2022. As seen with the success of Oculus Quest 2, virtual reality is quickly approaching mainstream status, and PS5 could offer the power to make social experiences on a PlayStation VR 2 device more fulfilling than ever before. As we’re now getting used to staying at home in order to speak to distant friends, PlayStation Home on PSVR 2 could let us invite pals to our virtual living spaces, and still have a sense of presence alongside them too."
  ],
  "headers": {
    "4": "Analysis: A post-Covid PSVR 2 social space?"
  },
  "links": {
    "PlayStation Home": "https://www.techradar.com/news/gaming/the-messy-doomed-journey-of-playstation-home-as-told-by-its-architect-1275149",
    "PlayStation 3": "https://www.techradar.com/news/gaming/consoles/how-the-playstation-3-won-the-console-war-1196215",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "PlayStation 4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "a new trademark application": "https://i.imgur.com/wpJiFxH.jpg",
    "Fortnite": "https://www.techradar.com/reviews/fortnite-battle-royale-review",
    "PSVR 2": "https://www.techradar.com/news/playstation-vr-2-release-date-price-news-and-rumors",
    "Oculus Quest 2": "https://www.techradar.com/reviews/oculus-quest-2-review"
  }
}