{
  "source": "https://www.techradar.com/news/screw-the-chip-shortage-everyones-playing-pc-building-simulator-instead-and-its-free",
  "title": "Screw the chip shortage – everyone’s playing PC Building Simulator instead (and it’s free)",
  "category": "computing",
  "updated": "2021-10-08T15:43:04Z",
  "author": "darren-allan",
  "summary": "Latest Epic Games Store freebie is going down a storm",
  "article": [
    "PC Building Simulator is the latest freebie from the Epic Games Store, and it’s proving seriously popular, having been grabbed by over 2.5 million gamers on the store since it first became available for free yesterday, Thursday October 7.",
    "In fact, it only took the sim three hours to hit the million mark, with a huge amount of folks following through and actually playing after snagging the title. Apparently the top number of concurrent users for PC Building Simulator has shot up by 1,500% compared to the previous all-time high, which is impressive to say the least.",
    "Of course, the simulation isn’t a new game, and has actually been around for a few years now. A new career mode expansion is about to debut, though, and making the original game free is naturally tied in to ramping up towards that fresh content drop.",
    "Right now, you can get substantial chunks off the game’s DLC too, with the Esports Expansion career pack selling at half-price, and there’s 10% off all the ‘workshop’ content (featuring brands like Asus ROG, EVGA, Razer and so forth).",
    "PC Building Simulator will remain free until October 14.",
    "It’s not really surprising to see PC Building Simulator rocket to a huge amount of downloads and new highs in terms of the player count. With the component shortage definitely still making its presence felt in terms of availability and pricing – particularly with graphics cards – a free outlet for frustrations that allows gamers to put together virtual rigs was always going to do well for itself.",
    "We wouldn’t have guessed that it would do quite this well, mind; but then, for the princely sum of nothing, it’s obviously easy to take a chance on this. Also, it’s the kind of game that the curious will grab just to see what on earth the gameplay experience is actually like.",
    "The other attraction here, of course, is not just being able to build a virtual PC, but a really tricked-out and cool looking one that you couldn’t afford in real-life even if there wasn’t a scarcity of some components."
  ],
  "headers": {
    "5": "Analysis: A welcome outlet for frustrations"
  },
  "links": {
    "latest freebie from the Epic Games Store": "https://www.techradar.com/news/free-epic-games-store-games-this-weeks-giveaways-revealed",
    "PC Building Simulator": "https://www.epicgames.com/store/en-US/p/pc-building-simulator",
    "component shortage": "https://www.techradar.com/news/global-chip-shortage-could-drag-on-until-2023",
    "particularly with graphics cards": "https://www.techradar.com/news/nvidia-could-combat-gpu-shortages-by-again-turning-to-rtx-2060-but-with-an-upgrade"
  }
}