{
  "source": "https://www.techradar.com/news/m1-pro-vs-m1-max",
  "title": "Apple M1 Pro vs M1 Max: which one should be in your next MacBook?",
  "category": "computing",
  "updated": "2021-10-22T11:28:16Z",
  "author": "matt-hanson",
  "summary": "Apple has unveiled two new chips, the M1 Pro and the M1 Max, but which one is right for you?",
  "article": [
    "At Apple's recent 'Unleashed' event, the company surprised us all by announcing two new chips, the M1 Pro and M1 Max, which will feature in the new MacBook Pro 16-inch (2021) and MacBook Pro 14-inch (2021), which were also announced at the event.",
    "Most of us were expecting Apple to reveal a follow-up to its M1 chip, which debuted with the MacBook Air (M1, 2020), MacBook Pro 13-inch (M1, 2020) and Mac mini (M1, 2020) last year, but the fact that Apple came out with two chips was a genuine surprise for many.",
    "This makes choosing which new MacBook to buy slightly trickier, as there is a noticeable difference in specs (and price) between the two new chips. So, to make things easier, we'll compare the Apple M1 Pro vs M1 Max to help you decide which one to go for.",
    "One thing is instantly clear; both the M1 Pro and M1 Max are big leaps over the existing M1 chip.",
    "This is exciting, as the M1 chip was no slouch, and was a mightily impressive bit of silicon for Apple's first attempt at a chip for laptops and desktop computers. While the M1 chip is great for day-to-day tasks and even intensive video editing at 8K, for serious creative tasks, something more powerful was needed, hence the M1 Pro and M1 Max, which are both squarely aimed at creative professionals.",
    "So, what do the specs tell us about the chips? Let's start with the M1 Pro. It has a dual-chip architecture, as with the M1, that consists of a processor (CPU) and graphics (GPU). It also supports up to 32GB of unified memory, which Apple claims is 'high bandwidth, low latency. The memory bandwidth is 200GB/s, which is almost three times the bandwidth of the M1.",
    "This should allow data to be moved to and from the memory extremely quickly, leading to overall faster performance. The M1 Pro also has 33.7 billion transistors, more than double the M1 chip.",
    "When it comes to the processor, the M1 Pro has eight high-performance cores and two high-efficiency cores. The M1 Pro will switch between these depending on what you're doing. If you're doing something intensive, the high-performance cores are used for increased speed.",
    "However, for less intensive tasks, such as browsing the web, the high-efficiency cores can be used, helping to preserve battery life.",
    "The high-performance cores have a 192KB instruction cache, 128KB data cache and 24MB L2 cache.",
    "Meanwhile, the high-efficiency cores of the M1 Pro have 128KB instruction cache, 64KB data cache and 4MB L2 cache. Apple claims this gives the M1 Pro a 70% increase in CPU performance against the M1 chip.",
    "When it comes to graphics, the M1 Pro comes with a 16-core GPU with 2,048 execution units, and a performance of 5.2 teraflops. According to Apple, this gives the chip two times faster graphics performance compared to the M1.",
    "When it comes to the M1 Max, there seems to be a big leap in specifications, when it comes to memory in particular.",
    "The M1 Max supports up to twice the amount of memory as the M1 Pro, with support for 64GB of unified memory. While the M1 Pro has a 256-bit LPDDR5 interface, the M1 Max doubles this to 512-bit, and the memory bandwidth also gets doubled to 400GB/s.",
    "This means, the M1 Max not only supports more memory, but it's also drastically faster as well.",
    "The M1 Max is also made up of 57 billion transistors, almost twice that of the M1 Pro's already impressive number - and the largest chip Apple has ever made.",
    "When it comes to the CPU, the M1 Max has the same 10-core processor as the M1 Pro. This may come as a disappointment to anyone who was hoping for a big leap in CPU performance when it came to the M1 Pro vs M1 Max, but it could be a testament to just how good the CPU in the M1 Pro is if Apple didn't see fit to improve it.",
    "The improvements in other aspects should be more than enough to ensure that the M1 Max's performance is a fair bit ahead of the M1 Pro.",
    "When it comes to graphical performance, the M1 Max should offer a big step up from the M1 Pro, as it comes with 32 cores, double that of the M1 Pro.",
    "The GPU also comes with twice the execution units (4,096 vs 2,048) and twice the maximum concurrent threads (98,304 vs 49,512) compared to the M1 Pro.",
    "According to Apple, this translates to 10.4 teraflops of performance, compared to 5.2 teraflops of the M1 Pro.",
    "Overall, then the M1 Max should be able to provide twice the encoding performance of the M1 Pro, and four times the GPU performance of the M1. Going by the specs Apple provided, it looks like there will be a big performance gap between the M1 Pro and M1 Max.",
    "We won't be able to compare Apple M1 Pro vs M1 Max on performance until we get products with the two chips in ourselves and run some benchmarks.",
    "However, going by the specs above, it does look like the M1 Max will be noticeably faster, especially when it comes to video transcoding. For video editors, then, this may be the chip to get.",
    "Apple did talk about the performance of the M1 Pro and M1 Max at the Unleashed event, but what it did say was a bit vague. According to Apple's own figures (which should always be taken with a pinch of salt), the M1 Pro and M1 Max offer industry-leading performance per watt, with 1.7 times the CPU performance vs power compared to an 8-core Windows laptop.",
    "Apple also says that the 10-core CPU in the M1 Pro and M1 Max allows for 3.7 times faster project builds using Xcode, and up to three times more Amp Designer plug-ins in Logic Pro compared to the M1-powered MacBook Pro 13-inch.",
    "When it comes to graphical performance, the 16-core M1 Pro GPU offers 9.2 times faster 4K render in Final Cut Pro compared to the M1. Meanwhile, the M1 Max's 32-core GPU offers 13.4 times the render speeds.",
    "The M1 Pro also offers 5.6 times faster-combined vector and raster GPU performance in Affinity Photo, and up to 8.5 times faster with M1 Max (again, compared to the M1).",
    "In these tests, it appears that the M1 Max doesn't quite hit twice the performance of the M1 Pro, but there is still a clear boost in performance for the M1 Max.",
    "Another big difference between the Apple M1 Pro vs M1 Max is when it comes to price, so you should think carefully about whether the performance benefits the M1 Max brings is worth the leap in price, as this chip makes some already very expensive laptops even more pricey.",
    "The MacBook Pro 14-inch (2021) with the M1 Pro starts at $1,999 / £1,899 / AU$2,999.",
    "Adding the M1 Max with a 24-core GPU adds $500/£500/AU$750 to the price, while the M1 Max with a 32-core GPU adds $700/£700/AU$1,050.",
    "Meanwhile, the starting price for the Apple MacBook Pro 16-inch (2021) M1 Pro model is $2,499 (£2,399, AU$3,749), with the M1 Max model starting at $3,499 (£3,299, AU$5,249).",
    "In both cases, picking the M1 Max chip over the M1 Pro adds a hefty amount to the price tag. For many people, the M1 Pro will offer plenty of power, and won't be so expensive.",
    "So, when buying the new MacBook Pro 14-inch or MacBook Pro 16-inch, should you get the M1 Pro or M1 Max version?",
    "This all depends on what you need the devices for. If you are going to be doing mainly CPU-intensive work, then the M1 Pro and M1 Max offer similar performance, so the M1 Pro may be a better value choice.",
    "However, for graphically-intensive tasks, or anything that requires super-fast memory management, the M1 Max's performance gains could mean it's a wise investment, even considering the large price jump.",
    "For day-to-day use, both the M1 Pro and M1 Max are pretty much overkill. If you want a MacBook for browsing the web and just doing a spot of video or photo editing, then the M1 chip is still a great option, so consider the MacBook Air or MacBook Pro 13-inch instead."
  ],
  "headers": {
    "3": "Apple M1 Pro vs M1 Max: specs",
    "22": "Apple M1 Pro vs M1 Max: performance",
    "29": "Apple M1 Pro vs M1 Max: price",
    "34": "Apple M1 Pro vs M1 Max: which one should I get?"
  },
  "links": {
    "M1 Pro and M1 Max": "https://www.techradar.com/news/apple-m1x-chip-performance-specs-and-release-date",
    "MacBook Pro 16-inch (2021)": "https://www.techradar.com/reviews/apple-macbook-pro-16-inch-2021",
    "MacBook Pro 14-inch (2021)": "https://www.techradar.com/reviews/macbook-pro-14-inch-2021",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip",
    "MacBook Air (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-air-m12020",
    "MacBook Pro 13-inch (M1, 2020)": "https://www.techradar.com/reviews/apple-macbook-pro-13-inch-m1-2020",
    "Mac mini (M1, 2020)": "https://www.techradar.com/reviews/apple-mac-mini-m1-2020"
  }
}