{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-has-a-final-release-date-on-hbo-max",
  "title": "Zack Snyder's Justice League has a final release date on HBO Max",
  "category": "entertainment",
  "updated": "2021-01-29T14:32:26Z",
  "author": "samuel-roberts",
  "summary": "The Snyder Cut is almost here",
  "article": [
    "Zack Snyder's Justice League has a release date of March 18, 2021 on HBO Max, it's been announced. Some European release dates have also been set for the film – but seemingly not the UK.",
    "Releasing as a full-length movie and not as individual episodes as had originally been floated by Snyder, the new cut will also launch simultaneously in territories across Europe that already have HBO services, including Sweden, Denmark, Norway and Finland. A soundtrack will also be available for the film. HBO Max says information on further international releases is coming as soon as it's available.",
    "Three new posters have been released for the movie. The best one is the below, which deliberately evokes the Death of Superman comic book cover for Superman 75 back in 1993:",
    "Zack Snyder's Justice League – commonly referred to as the Snyder cut – is the Batman Vs Superman director's version of the 2017 DC Comics movie. While Snyder was the movie's original director, he had to drop out due to a family tragedy, leading the studio to complete the project with replacement director Joss Whedon.",
    "The finished film wasn't very good, and didn't really feel like it tonally fit Snyder's previous efforts in the DC Universe, which arguably weren't all that good either (though many of his fans would disagree).",
    "Here's an official synopsis for Zack Snyder's Justice League, per HBO Max:",
    "\"In ZACK SNYDER’S JUSTICE LEAGUE, determined to ensure Superman’s (Henry Cavill) ultimate sacrifice was not in vain, Bruce Wayne (Ben Affleck) aligns forces with Diana Prince (Gal Gadot) with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions. The task proves more difficult than Bruce imagined, as each of the recruits must face the demons of their own pasts to transcend that which has held them back, allowing them to come together, finally forming an unprecedented league of heroes. Now united, Batman (Affleck), Wonder Woman (Gadot), Aquaman (Jason Momoa), Cyborg (Ray Fisher) and The Flash (Ezra Miller) may be too late to save the planet from Steppenwolf, DeSaad and Darkseid and their dreadful intentions.\"",
    "We've reached out to Warner Bros UK to ask if it has a release date, yet, and will update if we hear back. It's previously been indicated that the film will be around four hours long.",
    "The road to the Snyder cut's release has taken almost four years, and is perhaps the most successful fan movement in history. HBO Max has bankrolled new effects work to finish the film – and even a few reshoots featuring actors reprising their roles.",
    "Now, the hype has to be worth it. We sense Snyder's fans will probably like the finished result no matter what, but how about everyone else? It'll be curious to see if this edition reverses course on the critical consensus towards the movie, which stands at a not-very-good 40% positive on Rotten Tomatoes."
  ],
  "headers": {
    "8": "The hype must be justified"
  },
  "links": {
    "Zack Snyder's Justice League": "https://www.techradar.com/news/zack-snyders-justice-league-cut-has-a-release-date-and-its-very-soon/news/justice-league-snyder-cut-release-date-darkseid-trailer-and-everything-we-know",
    "40% positive on Rotten Tomatoes": "https://www.rottentomatoes.com/m/justice_league_2017"
  }
}