{
  "source": "https://www.techradar.com/news/kia-ev6-interior-rivals-the-likes-of-audi-and-mercedes",
  "title": "Kia EV6 interior rivals the likes of Audi and Mercedes",
  "category": "car-tech",
  "updated": "2021-10-13T13:54:15Z",
  "author": "axel-metz",
  "summary": "Can Kia compete with the Germans?",
  "article": [
    "Kia has revealed the interior tech set to arrive with its upcoming EV6 electric car – and it more than competes with its pricier SUV competitors.",
    "We've previously reported on the futuristic aesthetic of the EV6's interior and exterior design, but we didn't have any specifics regarding what sort of gadgetry would be found inside.",
    "Now, though, Kia has published details as to exactly how its latest car will rival the likes of Audi, BMW and Mercedes – and for a fraction of the price.",
    "Set to become the first of the South Korean manufacturer's cars to be made available exclusively as an EV (rather than alongside a hybrid model), the EV6 boasts several gadgets and gizmos that Kia says will \"embrace interactions between humans and machines.\"",
    "The most eye-catching feature of its interior proves to be two 12.3-inch widescreen displays, of the sort we've seen in the BMW iX and Mercedes EQB.",
    "Directly in front of the driver sits the customizable 'cluster screen', which Kia says displays information such as speed, range and state of charge.",
    "The second screen, adjacent to the first, is a central display combining the navigation, infotainment and menu systems. Both are made of \"chemically strengthened glass\" – just in case you were thinking of taking a hammer to the sat-nav.",
    "Throughout the EV6, touch-sensitive buttons control programmable driver profiles and relaxation seats, with the former presumably referring to custom temperature settings bespoke to different passengers.",
    "As with the likes of the Audi Q4 e-Tron, the Kia will also sport an augmented reality (AR) heads-up-display (HUD), for a \"next level navigation experience and distraction-minimized driving\" which, admittedly, is a feature usually reserved for more premium vehicles.",
    "As well as the tech found inside the Kia EV6, its physical design is also intended to further improve the interior riding experience for the occupants.",
    "It's the first car to be designed using Kia's new Electric-Global Modular Platform (E-GMP), which allows for a flat cabin floor and class-leading internal dimensions. We don't yet have the exact details as to the amount of wiggle room available inside the EV6, there'll almost certainly be a lot more than most SUVs have to offer.",
    "And as for the audible experience inside the car, sound absorption materials have been built into the floor, wheel arches, doors, boot lid and tyres to reduce road and wind noise – you might as well sleep in it, by the sound of things.",
    "But all this wouldn't be as impressive if the Kia EV6 was an expensive, German-built, high-performance SUV – it might as well be, though, save for the price tag.",
    "Starting at £40,895 (around $55,000 / AU$75,000), Kia's gadget-packed EV is cheaper than Mercedes' entry-level equivalent, the EQB – which starts at £44,000 (around $60,000 / AU$75,000) – and much cheaper than the comparable BMW iX xDrive40 (in terms of interior design, at least), which will go on sale for £69,000 (around $95,000 / AU$120,000).",
    "Don't assume its lesser price equates to poor on-the-road performance, either. The GT model of the EV6 (which is, admittedly, more expensive) recently beat cars from Porsche, Ferrari and Lamborghini in a drag race.",
    "With all that said, then, Kia's forthcoming electric SUV – which will become available for orders in select regions from 18 May – should have the premium automakers quaking in their boots. Expensive boots, too."
  ],
  "headers": {
    "9": "Smart ergonomics"
  },
  "links": {
    "EV6": "https://www.techradar.com/news/kia-ev6-first-drive",
    "previously reported": "https://www.techradar.com/news/first-look-at-kias-new-electric-car-reveals-an-interior-built-for-the-future",
    "BMW iX": "https://www.techradar.com/news/all-electric-bmw-ix-has-the-range-to-worry-audi",
    "Mercedes EQB": "https://www.techradar.com/news/mercedes-eqb-is-a-family-sized-answer-to-the-electric-car-question",
    "Audi Q4 e-Tron": "https://www.techradar.com/news/audis-new-fully-electric-car-is-its-cheapest-yet",
    "augmented reality": "https://www.techradar.com/how-to/what-is-augmented-reality",
    "Porsche, Ferrari and Lamborghini in a drag race": "https://www.techradar.com/news/kia-ev6-electric-car-beats-porsche-ferrari-and-lamborghini-in-drag-race"
  }
}