{
  "source": "https://www.techradar.com/news/microsoft-teams-is-finally-fixing-one-of-its-most-annoying-flaws",
  "title": "Microsoft Teams is finally fixing one of its most annoying flaws",
  "category": "computing",
  "updated": "2021-07-20T13:00:46Z",
  "author": "mike-moore",
  "summary": "Track down lost Microsoft Teams messages easily",
  "article": [
    "Hunting for vital messages or contacts in Microsoft Teams is about to get easier than ever thanks to a new update coming to the service.",
    "The video conferencing platform has revealed it is working on an update that should greatly improve the usefulness of search within Microsoft Teams.",
    "The platform says it will soon be introducing a completely redesigned search page that uses AI tools to track down exactly the results you need for your business or family work.",
    "The news was revealed in a Microsoft 365 roadmap entry, which details the feature as simply \"Search results page in Teams.\"",
    "The entry notes that, \"a new search experience in Teams will make finding messages, people, answers, and files faster and more intuitive.\"",
    "It goes on to say that, \"a redesigned search results page provides better context and faster results,\" and that the tool will use \"AI-powered relevance\" based on the people and content users engage with most in Teams and other Microsoft 365 services in order to bring you the best results.",
    "Microsoft notes that the feature is currently in development, with a target release date of November 2021. When ready, the tool will be generally available, meaning desktop and mobile Microsoft Teams alike will be able to benefit.",
    "The update is the latest from the company as it looks to ensure Microsoft Teams remains relevant and useful as workers increasingly head back to an office environment.",
    "The app itself is set for a major redesign to align with the launch of Windows 11 later this year, with the new Microsoft Teams 2.0 client built around Microsoft Teams for the web.",
    "Reports have claimed that \"Teams 2.0\" no longer has an address bar, is significantly faster on desktop and runs better on low-end devices, thanks to using less memory.",
    "Via MSPowerUser"
  ],
  "headers": {
    "3": "Microsoft Teams search"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/microsoft-teams-vs-zoom-which-video-conferencing-and-collaboration-service-is-best",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Microsoft 365 roadmap entry": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1535407236620493000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26searchterms%3D66583",
    "a major redesign": "https://www.techradar.com/news/microsoft-teams-is-getting-a-whole-new-look-for-windows-11",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "MSPowerUser": "https://mspoweruser.com/microsoft-teams-ios-and-android-apps-update/"
  }
}