{
  "source": "https://www.techradar.com/news/the-mandalorian-season-3-may-not-arrive-until-late-2022-heres-why",
  "title": "The Mandalorian reportedly won't arrive until 2022 – here's why",
  "category": "entertainment",
  "updated": "2021-06-10T13:38:22Z",
  "author": "tom-power",
  "summary": "The Mandalorian season 3 on Disney Plus is far, far away",
  "article": [
    "The Mandalorian season 3 is still some way off from landing on Disney Plus – and it appears that it won't be launching for a long time, if recent rumors are to be believed.",
    "Earlier this week, we reported that season 3 had not begun filming yet (courtesy of the series' star Pedro Pascal). Now, according to sources close to the TV show, The Mandalorian season 3 won't start shooting until late 2021 at the earliest.",
    "Per Collider, production on season 3 won't begin until the end of the year. However, Collider's sources have also reportedly said that filming may not even start on Mando's next outing until early 2022.",
    "If either of those speculative dates are true, we might not even see Din Djarin return to our screens until late 2022. That's a long time to wait for the next instalment in his adventures, but there are understandable reasons behind this decision.",
    "There are two major reasons behind season 3's delay: The Book of Boba Fett and the Obi-Wan Kenobi Star Wars spin-off series.",
    "According to Collider, filming has wrapped on The Book of Boba Fett. However, the Disney Plus show, which stars Temeura Morrison's titular bounty hunter, is in post-production ahead of its December 2021 release date.",
    "With the likes of Jon Favreau, Dave Filoni and Kathleen Kennedy (among others) busy with that project, attentions won't be turning to The Mandalorian season 3 any time soon.",
    "Ewan McGregor's Obi-Wan Kenobi series, too, is taking precedence over The Mandalorian season 3. During a recent chat with Pascal for Variety's Actors on Actors series, McGregor revealed most of The Mandalorian's backstage crew are working on his Obi-Wan Kenobi TV show.",
    "With Obi-Wan's series also utilizing 'The Volume' technology, which has been used to great effect, on The Mandalorian, there's clearly no chance of The Mandalorian season 3 beginning production for the foreseeable future.",
    "Add in the fact that Pascal will be starting to film HBO's live-action adaptation of The Last of Us (Naughty Dog's critically-acclaimed video game) in Canada in July, and none of the puzzle pieces for The Mandalorian season 3 are falling into place.",
    "Hopefully, season 3 will enter production once The Book of Boba Fett and Obi-Wan TV shows have finished filming, and we don't have to wait 18 months for Din Djarin's next adventure to take place."
  ],
  "headers": {
    "4": "Analysis: The Mandalorian season 3 won't arrive before other Star Wars Disney Plus shows"
  },
  "links": {
    "The Mandalorian season 3": "https://www.techradar.com/news/the-mandalorian-season-3-everything-we-know-so-far",
    "had not begun filming": "https://www.techradar.com/news/the-mandalorian-season-3-isnt-coming-any-time-soon-heres-why",
    "Collider": "https://collider.com/the-mandalorian-season-3-the-book-of-boba-fett-production-filming/",
    "The Book of Boba Fett": "https://www.techradar.com/news/the-book-of-boba-fett-everything-we-know",
    "Obi-Wan Kenobi": "https://www.techradar.com/news/obi-wan-kenobi-series",
    "Variety's Actors on Actors series": "https://variety.com/2021/tv/actors/actors-on-actors-pedro-pascal-ewan-mcgregor-mandalorian-halston-1234991717/",
    "The Last of Us": "https://www.techradar.com/news/the-last-of-us-hbo-tv-show"
  }
}