{
  "source": "https://www.techradar.com/news/e3-2021-proved-one-thing-there-are-way-too-many-co-op-shooters",
  "title": "E3 2021 proved one thing – there are way too many co-op shooters",
  "category": "gaming",
  "updated": "2021-06-26T16:02:30Z",
  "author": "rhys-wood",
  "summary": "Opinion: Developers need to cool it on the abundance of co-op shooters",
  "article": [
    "E3 2021 was pretty crazy, with a shockingly large number of companies throwing their hats into the ring with their own tailor-made showcases as the show once again embraced an all-digital approach. Most of the big players were there, naturally, like Xbox and Nintendo. But we also saw smaller presentations from Bandai Namco, Capcom and even US mobile network operators Verizon.",
    "While it was a fairly humdrum E3 overall, with little outside of the Xbox & Bethesda presentation and Nintendo Direct really sticking out, if you’re the kind of person who loves playing co-op shooters with your friends, then this was definitely your year. And even then, you might have thought – as I did – that there might have been just one too many at E3 2021.",
    "Co-op focused shooters were in abundance at E3 2021, to the point where the sub-genre is becoming something of a trend among publishers right now. This year and the next, we can expect to see a litany of co-op shooters being released across all platforms, most of which are big budget affairs like Redfall, Contraband, Rainbow Six Extraction and Back 4 Blood.",
    "Individually, games such as the above could turn out to be fantastic and well worth your time. But collectively they represent a sub-genre that is starting to become far too bloated, and I worry that, while each may be thematically unique, they run the risk of being too similar mechanically.",
    "The co-op shooter was arguably popularized by 2008’s Left 4 Dead. At the time, Valve and Turtle Rock Studios’ 4-player zombie romp felt like a shot in the arm for the first-person shooter genre, especially as bold and ambitious shooters were few and far between since Half-Life 2 was released in 2004.",
    "Of course, Left 4 Dead wasn’t the first co-op shooter out of the blocks, with games like Perfect Dark and the Halo series spearheading co-operative play as a campaign option. Left 4 Dead was, however, one of the first to seamlessly integrate co-op into its core design. Where the campaigns of Halo are arguably best played solo, Left 4 Dead was objectively better when played with your buddies.",
    "But what made Left 4 Dead so good in the first place, that more recent titles would want to take inspiration from it? The fact of the matter is that Left 4 Dead was just extremely well designed. The series featured fantastic weapons that were a blast to use against relentlessly large zombie hordes. It also didn’t take itself seriously at all, with the games’ characters constantly bantering, but also looking out for each other and calling out items in a pinch.",
    "Left 4 Dead’s level design was linear, but packed to the gills with variety. No two areas felt the same, and the big set pieces featured in each stage never failed to disappoint, and provided the pinnacle of challenge in each and every map.",
    "Since the late 2000s, then, the gaming industry has had a tendency to push co-op into a variety of experiences. This is evidenced perhaps most successfully in the Borderlands and Destiny franchises. These brilliant series of co-op focused shooters put an emphasis on RPG elements, with players constantly looting new guns and gadgets all while leveling up and acquiring new skills in their respective sci-fi universes.",
    "Borderlands’ take on the co-op shooter has definitely stuck out as a winning formula. The ‘looter shooter’ trend has since been bolstered by games like The Division, its sequel and the more recent Outriders. As such, games of the like show no signs of disappearing soon, and this was largely apparent during E3 2021.",
    "E3 2021 and the accompanying Summer Game Fest had co-op shooters coming out of the woodwork, and unfortunately, most of them were unable to represent what kind of gameplay experience players will be in for when they release, thanks in no small part to an overt focus on CG trailers and scripted vertical slices.",
    "And that’s a shame, as I really dig the aesthetic of some of these co-op shooters, particularly Redfall. This Arkane Studios-developed shooter closed out the Xbox & Bethesda showcase at E3 2021, and I really loved the retro horror vibe shown off in the trailer. The problem is, without accompanying gameplay, I can’t get too excited when all I know is that it’s a character-driven co-op shooter, and those are simply a dime a dozen right now.",
    "I was even less enthused with Rainbow Six Extraction. The gameplay segment released for the game was heavily scripted, featuring an ultra-generic alien threat that doesn’t seem to mesh well with the series’ more grounded squad-based tactics at all. Extraction represented the biggest instance, in my mind, of a popular franchise trying to ape the flavor of the month without even trying to do anything unique with it.",
    "And therein lies my biggest concern with this deluge of upcoming co-op shooters. It’s difficult to get excited about games that feature the number of players as a selling point. While I obviously can’t speak for the quality of these upcoming releases yet, it seems like many of them are just using co-op as a crutch to make up for unexciting game design, especially in Rainbow Six Extraction’s case.",
    "Despite my complaints so far, there is one upcoming co-op shooter out there that genuinely does have me thrilled. That’s Back 4 Blood, a spiritual successor to Left 4 Dead in pretty much every way. It’s even being developed by the same team, and if anyone knows how to properly make a co-op shooter, it’s Turtle Rock Studios. Let’s just forget Evolve ever existed.",
    "Turtle Rock itself has even learned lessons from its long history with co-op shooters. The company previously developed Evolve, a genuinely cool asymmetrical multiplayer title that pitted a team of hunters against a monolithic alien creature. The twist? An opposing player actually controls that creature.",
    "Evolve had a great premise, but unfortunately never landed a solid audience. It quietly and sadly faded into obscurity, which may have been what prompted Turtle Rock to return to its roots with a back-to-basics co-op shooter like Back 4 Blood. It Left 4 Dead on steroids, essentially, which is a much safer bet for an audience that might prefer something simpler to just pick up and play.",
    "Back 4 Blood’s marketing so far has been genuinely exciting to watch. Each gameplay showcase has been bursting with confidence and polish. It hasn’t opted to hide behind CG trailers, instead showing us exactly what to expect through visceral, action-packed gameplay. Back 4 Blood could well be the game to lift me out of my co-op shooter cynicism and I welcome it to do so.",
    "While I may be coming across as pretty harsh on co-op shooters as a subgenre, then, I’m not entirely opposed to cooperative play as a concept. Some of my most played games include Sea of Thieves and Final Fantasy 14, two games that thrive on cooperation with other players and are all the better for it.",
    "Ultimately, I do genuinely hope that games like Redfall, Contraband and the like can prove me wrong and turn out to be great. Both of these games in particular will be available on Xbox Game Pass on day one, so there’s no reason to at least give them a look for those with a subscription. And fingers crossed, they become games that I’ll be happy to return to time and again."
  ],
  "headers": {
    "4": "From humble beginnings",
    "10": "Trying too hard?",
    "14": "The silver lining"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/best-games-of-e3-2021",
    "Redfall": "https://www.techradar.com/news/redfall-trailer-gameplay-release-date-and-more",
    "Rainbow Six Extraction": "https://www.techradar.com/news/rainbow-six-extraction",
    "Back 4 Blood": "https://www.techradar.com/news/back-4-blood-release-date-cross-play-beta-trailers-and-characters"
  }
}