{
  "source": "https://www.techradar.com/news/why-enterprise-mobility-will-be-essential-in-a-hybrid-working-model",
  "title": "Why enterprise mobility will be essential in a hybrid working model",
  "category": "computing",
  "updated": "2021-03-24T11:36:46Z",
  "author": "joe-walsh",
  "summary": "Businesses are rolling out fleets of new devices to support remote workers",
  "article": [
    "It has now been over a year since I last packed my bag at our office to head home for the day. At the time, me, my colleagues, and millions of professionals across the UK anticipated that the hiatus from our familiar work surroundings would be a matter of weeks, maybe months at a push. Fast forward twelve months, and the concept of remote working is far from temporary.",
    "According to Deloitte, it is now projected that a quarter of people in the UK will work from home full-time by 2025 – a significant rise from just 5% in 2019 – as businesses prepare to manage a workforce that will be compiled of those working remotely, those in the office, and those that balance their time between the two; the hybrid approach.",
    "Mobility must lie at the heart of any remote or hybrid working model. Mobile devices have become more critical than ever for productivity and staying connected to our colleagues. Yet, the acceleration of remote working has made the management and protection of large mobility fleets even more challenging – particularly for those who have not previously considered it.",
    "Many of those reading this article may not have access to a work device. At Samsung – in a research survey conducted to understand challenges our customers are facing in a remote working environment – we found that 70% of workers currently use a personal device for work in some capacity, potentially due to the fact that 30% of organizations didn’t have enough devices to give to remote employees.",
    "Aside from the obvious security concerns about using a personal device for work, we must not under-state the value of having a device that is fit for purpose. A third of organizations suffered a drop in employee productivity as a result of the transition to remote working, an issue that must be addressed if we are to adopt hybrid working permanently. Those using their personal devices often limit themselves from accessing the latest applications, features, and technology that their IT team could install onto a business-ready device. If we want to boost productivity, we must use the right tools for the job.",
    "For those that will be returning to the office – either permanently or as part of a hybrid approach – the ability to access work apps and functions on-the-go will be vitally important for productivity. Ofcom revealed that the number of adults making video-calls doubled during the first lockdown last year, and people now need the relevant video-conferencing tools on compatible devices to connect and collaborate with their colleagues.",
    "The current proportion of people using personal devices for work presents a huge risk factor in adopting a remote or hybrid workforce. Whether it be file sharing over an unprotected network or downloading malicious apps, the increase in opportunities for a security breach cannot be ignored. This uncertainty is reflected in employee data, which shows that 18% of those using a personal device for work had no confidence in its security over the last 12 months. This is hugely concerning.",
    "For organizations to successfully deploy a hybrid working model, they must regain control of the devices being used on their network. By enrolling devices that come encrypted with a security platform built from the chip up, IT teams can stay one step ahead of the security risks and keep company data safe. Those using our own Knox platform, for example, can now forecast future threats by learning from current device and network usage to produce automated configurators, incident reports, and thread remediation.",
    "Above all, businesses must continue to educate their employees around best security practices and how to reduce the risk of attack. When asked about the key security concerns in a remote working environment, a significant proportion of decision-makers selected password sharing (48%) and phishing attacks (45%). While employee education around security risks is improving, the level of caution around these two practices highlights that there is still work to be done.",
    "As more businesses roll out fleets of new devices to support remote workers, the popularity of Enterprise Mobility Management (EMM) has taken a sharp upturn. Three quarters of decision-makers said that the pivot to remote working has accelerated their use of EMM solutions, and 88% planned on investing more in 2021.",
    "Having seen that every surveyed EMM user reported tangible benefits since adoption – and hearing the positive customer feedback we receive from those using Enterprise Edition, our EMM solution – further growth seems inevitable as we pivot towards a hybrid future.",
    "Over half of adopters (55%) selected enhanced security as a key benefit, thanks to the ability to remotely upgrade device software and install new security patches as soon as they’re available. EMM also enables IT teams to distribute essential content to employee devices while restricting access from unauthorised devices and users. As a result, nine in ten who currently use EMM feel confident in the security of their company’s devices – significantly higher than those who don’t (78%).",
    "The advantages of deploying EMM are also noticeable in employee output, with over a third of organizations reporting improved levels of collaboration (34%), productivity (35%), and quality of work (36%) as direct results from deploying the solution. The ability to work on a device that is ready-made for our individual role – without worrying about a complicated out-of-the-box setup, technical issues, or security threats – cannot be under-stated for our productivity when working remotely.",
    "With 35% businesses planning on upgrading their hardware in 2021 – a third of which looking to integrate 5G-ready devices into their operations – investing in EMM is a sensible way for IT teams to enjoy more choice, more control and more protection when managing their mobile fleets, so they can enable their colleagues to do less work and more business."
  ],
  "headers": {
    "3": "Enabling productivity",
    "6": "Prioritizing security",
    "9": "Turning to Enterprise Mobility Management"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}