{
  "source": "https://www.techradar.com/news/cyberpunk-2077-mods-could-be-a-security-risk-to-pc-players",
  "title": "Cyberpunk 2077 mod security risk hotfix released",
  "category": "gaming",
  "updated": "2021-02-05T12:25:45Z",
  "author": "hamish-hector",
  "summary": "CD Projekt Red has pushed the update live",
  "article": [
    "Update: CD Projekt Red has released hotfix 1.12 to address the security issues surrounding mods and custom saves in Cyberpunk 2077 on PC. Installing the update should patch the vulnerabilities and make it safe to use these features again. The original story continues below.",
    "Watch out Cyberpunk 2077 PC players – installing mods could put your computer at a security risk! Mods could install and run code that will impact your PC outside of Cyberpunk, potentially harming your computer or opening it up to attack.",
    "Developer CD Projekt Red has issued a statement saying they are investigating the issue, but for now, they advise fans to be careful installing mods or custom saves until it can be fixed.",
    "According to CD Projekt Red, the issues stem from a “vulnerability in external DLL files”. The developers warn that mods could potentially install files and code which would have an effect outside of Cyberpunk 2077. They advise players not to install mods from unknown sources, but we’d advise you don’t install any just be extra safe.",
    "All of this comes after barely a week of the official mod tools being made available to the public. The Cyberpunk 2077 developers have been under considerable pressure since their game launched to much criticism last year, and this, unfortunately, won’t help that.",
    "This will be particularly hard-hitting as mods can offer some positive press around a game, letting players show off and share their in-game creations. For Cyberpunk 2077, mods could also have been a way for players to fix any smaller issues for themselves while they await official patches.",
    "This also isn’t Cyberpunk 2077’s first issue when it comes to mods, with the team already having to release a statement via PC Gamer asking players not to use character models based on real people in “any situation that might be found offensive if you don’t have their explicit permission.” This was in reference to a now shut down mod that let players have sex with Keanu Reeves’ Johnny Silverhand character.",
    "Hopefully, this new security issue will soon be fixed so that Cyberpunk 2077 can start generating some much needed positive press. Mods are a great way to get players excited, giving them an opportunity to go wild with their creativity, like when players became Iron Man in GTA V, or to introduce minor UI tweaks to make the game more like they want it to look."
  ],
  "headers": {
    "4": "Watch Out For Malicious Mods",
    "6": "Mo Mods, Mo Problems"
  },
  "links": {
    "hotfix 1.12": "https://twitter.com/CyberpunkGame/status/1357647227808841728?s=20",
    "Cyberpunk 2077": "https://www.techradar.com/reviews/cyberpunk-2077",
    "issued a statement saying": "https://twitter.com/CDPRED_Support/status/1356604047671898112?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1356604047671898112%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fpublish.twitter.com%2F%3Fquery%3Dhttps3A2F2Ftwitter.com2FCDPRED_Support2Fstatus2F1356604047671898112widget%3DTweet",
    "mod tools": "https://www.techradar.com/news/cyberpunk-2077-gets-official-mod-support-so-gamers-can-fix-it-themselves",
    "via PC Gamer": "https://www.pcgamer.com/cdpr-shuts-down-cyberpunk-mod-that-let-players-have-sex-with-keanu-reeves/",
    "Iron Man in GTA V": "https://www.gta5-mods.com/all/tags/iron-man/most-downloaded?__cf_chl_jschl_tk__=452ba4423a3738097a962cbfaae76db45fa35d72-1612348436-0-AeHjS8bBV3Q8eZeFW3US7uP7esj1iQQVfPdtyLc_RnvTx9OvVvbyGYO1IchGOpILygMzgYYtzyT6FQVIpczEbpodr3Jf8xNgN0I1cu2mskcdDNLhDlbEhOjoWN2J6a4NAwIZSNWT9zh_cy4L2uuqSsHJLkqoPEqkLSqDdRrHyHYPxOURHDd9E4OaXFrAyWCorA6xxdK-9_Lhlng87nGyoWeTgzzhysqSkeWZQwnsHXoQHPrdHPbCEwy0RwwrB_XdD_CrraFdnszNxU1wqnpkHkGlHqQkhsrblYYIN2Gcs9GJ9sU43LKOaXvxBVU5fpBr1d87sccUX8WGB8BkwUn7zYyuUpozOC_w-bp5lAMku3x9"
  }
}