{
  "source": "https://www.techradar.com/news/weve-all-forgotten-to-ask-what-hybrid-working-really-means",
  "title": "We’ve all forgotten to ask what hybrid working really means",
  "category": "computing",
  "updated": "2021-05-16T12:07:11Z",
  "author": "joel-khalili",
  "summary": "Our way of working is set for another major overhaul",
  "article": [
    "In recent months, as vaccine rollouts have gathered pace and frustrations with lockdown measures have deepened, there has been a distinct switch in the narrative around work.",
    "No longer is remote working discussed in romantic terms, as a revelatory solution to problems that have dogged office workers for decades. Instead, it has been decided that “all things in moderation” is a maxim that applies in this context too, and that hybrid working is the ultimate ideal.",
    "However, according to Anand Eswaran, President and COO at RingCentral, a variety of pitfalls await businesses as staff begin to return to the office. One of the main problems is that no one quite knows what \"hybrid working\" really means.",
    "“Since the start of the pandemic, ‘hybrid working’ has overtaken ‘digital transformation’ as the most cliched phrase in business,” Eswaran told TechRadar Pro. “Every company is going to be on a journey to figure it out.”",
    "“It’s important to draw a clear distinction between remote and hybrid working and to put in place a carefully considered plan for the way people will cycle through the office in the months to come.”",
    "The remote working system has been able to function as well as it has done over the past 14 months largely due to necessity and a willingness to acknowledge that the best was being made of a regrettable situation.",
    "IT teams turned on the afterburners in a bid to equip staff with the tools they needed to do their jobs from afar, and workers themselves tried their best to maintain usual levels of productivity and support colleagues during a tough period.",
    "However, now that some societies are beginning to unlock, Eswaran believes this unspoken agreement may begin to crumble.",
    "“What the pandemic has shown us is that things can get done in a different mode, in a way that gives all of us a better work-life balance,” he said.",
    "“However, I do not subscribe to the philosophy that people can stay remote forever. What’s making things work right now is the social capital that has been built up over time, but we’re running very low at this point in the pandemic.”",
    "At this crossroads, says Eswaran, businesses need to ask themselves which hybrid working configurations will allow them to remain productive and innovate at the same pace, but also provide the social capital that knits the whole project together.",
    "Before this delicate balance is achieved, there will likely be various stages of acclimatization, as businesses begin to feel out different hybrid systems. And what works best may also differ at a granular level, from department to department.",
    "“It will be important for organizations to think closely about how to guide employees through the change in a slow but deliberate way,” Eswaran told us.",
    "“Even more so, it’s vital to set the right balance across functions; a team focused on innovation will likely benefit from closer collaboration than one focused, for example, on finance and accounting.”",
    "In a world in which employees switch frequently between the office, home and any other workspace, Eswaran believes technology that smoothes these transitions will play a fundamental role moving forward.",
    "Logic dictates that the best collaboration services will need to support multiple platforms, but also multiple mediums of communication - from SMS and email to audio and video calling.",
    "“There will have to be a wholesale cultural renaissance in terms of how we communicate and conduct meetings in this world of hybrid work, where people are in different locations and different modalities,” Eswaran affirmed.",
    "“It’s going to be about a mix of culture and technology, but it’s the responsibility of companies like RingCentral to make sure that the technology-led approach is considerate of how new ways of working will need to evolve.”",
    "This means building in functionality that supports meetings whose attendees are split between the office and home, in a way that creates equitability between all participants. It also means supporting both synchronous and asynchronous working, catering to all scenarios and preferences.",
    "Asked whether collaboration services that focus on just a single medium of communication (such as Zoom) will struggle in this new market, Eswaran stopped short of predicting their demise but intimated that versatility will bestow an advantage.",
    "“The whole concept of cloud-based communications has become a priority for every company, whether it has two employees or two hundred thousand.”",
    "“The opportunity space is so big that everybody will find a niche, but if you want to succeed sustainably, at scale, you’ll need to be able to serve the different modes in which people will work.”"
  ],
  "headers": {
    "5": "End of the road for remote working",
    "14": "Multi-modal working"
  },
  "links": {
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "best collaboration services": "https://www.techradar.com/best/best-online-collaboration-tools",
    "email": "https://www.techradar.com/news/best-email-provider",
    "video calling": "https://www.techradar.com/best/best-video-conferencing-software",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives"
  }
}