{
  "source": "https://www.techradar.com/news/windows-11-finally-redesigns-its-photos-app-next-heres-what-it-looks-like",
  "title": "Windows 11 finally redesigns its Photos app next, here's what it looks like",
  "category": "computing",
  "updated": "2021-09-14T16:18:13Z",
  "author": "daryl-baxter",
  "summary": "Photos gets a new angle",
  "article": [
    "In a new Insider Build update for Windows 11, Microsoft has unveiled another new Fluent Design focus for the Photos app, matching it with the other apps that have also seen the same refresh in appearance.",
    "There’s a good chance that you’ve used the Photos app in Windows to either view an image, or to quickly crop and resize one to send in an email or to upload to a newsletter. While the app has its uses, it’s been light on updates in recent years, but that’s about to change in Windows 11.",
    "With Microsoft pushing a major new look for Windows 11 to make it more modern across the operating system, this is now being applied to Photos, while making sure that it’s also touch-friendly for swiping between images and albums.",
    "Chief Product Officer at Microsoft Pinos Panay first announced the redesign in a tweet, showcasing the new look and feel of the app in Windows 11.",
    "Every menu and icon looks as though it has a gradient, giving off a pop-out visual feel compared to the flat design that’s been present in the app since its first showing in Windows 8.",
    "But the big feature here is that you can edit a photo and crop it by highlighting an image and selecting the desired icon, without having to select the Edit and Create dropdown menu. Every option is now at the top, including the Save a Copy feature once you finish editing, so there’s more space for the altered photo to display in the app.",
    "There’s also a new Info button, so you can discover the metadata of an image, from the date it was taken, to the device that the image was captured on.",
    "With Windows 11 releasing on October 5, it looks like it’s only a matter of time before we see this new look for Photos to appear in the other Insider channels soon.",
    "While Paint and the Snipping Tool are welcome additions to see a redesign for Windows 11, it’s the Photos app that’s needed the biggest priority for an update, mainly due to the growing needs of users to manage and edit our images on the fly, without using a more powerful suite from companies such as Adobe.",
    "But its user interface barely changed since its debut in Windows 8, with its font and icons being updated for the Windows 10 appearance. However, it’s a promising start for Photos in Windows 11, making it even easier for the most casual user to edit a batch of images at once.",
    "Photos has always been a simple but reliable app, regardless of its outdated appearance. With this new look, it could make it even more accessible to new users who just want to manage their folders of Simpsons memes with even more ease, once Windows 11 arrives later this year."
  ],
  "headers": {
    "3": "What does it look like?",
    "8": "Analysis: an app that’s needed a visual update the most"
  },
  "links": {
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "other apps": "https://www.techradar.com/news/snipping-tool-is-now-snipping-tool-in-windows-11-as-it-merges-with-snip-and-sketch",
    "Paint": "https://www.techradar.com/news/rejoice-paint-has-a-new-look-for-windows-11"
  }
}