{
  "source": "https://www.techradar.com/news/e-bike-maintenance",
  "title": "E-bike maintenance: how to keep your new electric bike running like a dream",
  "category": "fitness",
  "updated": "2021-02-17T17:18:04Z",
  "author": "cat-ellis",
  "summary": "Expert advice from Shimano's head of training Julian Thrasher",
  "article": [
    "Maintaining even the best electric bikes isn't difficult, but there are some important things to know if you're going to keep it in top condition and get the best performance every time you head out on a ride.",
    "To find out exactly what you need to know to keep your e-bike in perfect shape, TechRadar spoke to Julian Thrasher, Head of Training at Shimano. Buy your Shimano products and support local bike shops at www.freewheel.co.uk.",
    "Before heading out on your electric bike, a few quick checks will help make sure you're getting the best, safest ride possible.",
    "\"Mechanical and electrical checks are the key thing,\" says Thrasher, \"so from a mechanical point of view, tire pressures and if you’ve got any mountain bike suspension settings as well. Mainly because if you’re riding an e-bike with deflated tires then you may not get the range out of the bike that you want.\"",
    "You'd normally notice if you're riding a bike with deflated tires or worn gears – you'll have to work harder than usual – but an e-bike will compensate, effectively masking the problem and draining the battery faster than necessary,",
    "\"It’s also really important that your brakes are working properly because the e-bikes are slightly heavier,\" says Thrasher. \"I’d have a check of the brakes and gears before you go on a ride. Just a spin around the car park or just down the side of your house, just to make sure everything’s operating mechanically as it should.",
    "\"From an electrical point of view, making sure that the battery’s got a full state of charge,\" he says. \"You’d ideally do this with enough time to make sure that you can put charge into it. There’s nothing worse than rocking up to a ride and finding that you’ve got one bar of battery. It’ll either be a very difficult ride, or the ride won’t happen.",
    "\"And a quick check of the cables as well. Speaking from a Shimano Steps point of view, the cables are quite delicate and they carry all the data through the system, so if they’re slightly damaged or you’ve managed to hook it on a car when you’re taking the bike off a rack, they can get damaged and that can cause an error to occur. So it’s definitely worthwhile checking.\"",
    "You should also check that the cables are correctly plugged in. Shimano has a special wire tool (catchily named the TL-EW02), which makes sure that you're pushing on the correct part of the wire and not damaging it.",
    "Also take a look at the magnet for the speed sensor. \"It’s a bit like the old school cycle computers that you had where the magnet went round and it told you how fast you were going,\" Thrasher explains. \"The e-bike has a drive unit that knows how much pressure you’re putting through the pedals – there’s an in-built power meter – but it also has a speed sensor to work out how fast you’re going. With those two metrics it can work out the right amount of power delivery, but if the magnet gets knocked then it can’t see that, and then the drive unit won’t work.\"",
    "It's quite common for that magnet to get knocked out of place, either in transit or being out on the trails. Just make sure that the magnet is in line with the sensor, with the correct distance between it.\"",
    "If your bike has a Shimano Steps drive system, also watch out for an error code called WA13. Thrasher explains that this is a torque sensor error, and is easily fixed.",
    "\"This happens when someone hops on the bike, they start pedalling it off down the road or down the trail, and then they think ‘Oh no, I haven’t turned it on!’ So they turn it on, and then the system sees that there’s pressure going through it, which it doesn’t expect. What it then does is say ‘Well, that must be a problem’. So then it beeps and comes up with a WA13 error code.",
    "\"The easiest way to clear this is to stop the bike, get off the bike, turn the battery off, ideally if it’s a downtube-mounted battery remove it – that clears everything from the system – put the battery back in, turn the system on again without any pressure on the pedals. Nine times out of 10, that clears the WA13 error code.\"",
    "Finally, make sure that the battery is secure in its mounting. That's not easy to do for an internal battery, but for an external one, make sure that there's no play between the battery and its mount. Any movement can cause intermittent faults.",
    "There are lots of ways to eke greater mileage out of your e-bike's battery, some of which are more obvious than others. \"We always think about marginal gains in cycling, but they’re all things you can do to improve the life of the battery, and certainly the range of the battery,\" says Thrasher.",
    "\"We spoke before about the tires being correctly inflated and things like your brakes rubbing. You notice all these if you’re a human being pedalling a bicycle, but with an e-bike they’re quite good at masking those little things.\"",
    "Also think about which of your bike's modes you're going to be using. Most e-bikes have a set of different options that give varying degrees of assistance. \"On Steps we have three modes – we have Eco, Trail and Boost modes – and there are two factory preset modes for these of Dynamic and Explore, but you can also customize it, Thrasher explains. \"We have an app on the phone called E-Tube, and through this E-Tube app you can customize Eco, Trail and Boost from a low, medium and high setting.",
    "\"So if you went out on your bike and you wanted the best life out of the battery then you’d ride it in Eco with Eco set to low, because you’re just going to receive a small amount of power through the system. So you’re not going to go as fast as going up a hill in Boost, but you are going to get a lot of life out of the battery, or range out of the battery.\"",
    "There's really no substitute for knowing your route. If you're planning a whole day out with lots of good hills, don't hit them all in Boost mode or you'll end up riding without any assistance at the end.",
    "If you just want to go for a blast in Boost mode, you won't be able to go nearly as far, but it'll be a lot of fun.",
    "\"The last thing I’d add to that is that lithium-ion batteries do like to be charged, so don’t let your battery run all the way out and then leave it run out,\" Thrasher says. \"The battery can enter a sort of hibernation mode, and then it can be very difficult to wake that battery. What we recommend is that even if you’ve just used a bar of battery, put it on charge. It likes that. You’ll increase the life of it if you charge it often.",
    "If your bike has an electrical fault, never try to disassemble your bike's battery or drive system. You might void your warranty, cause more damage, or even give yourself a bad electric shock.",
    "\"The first thing I’d say is visit a professional bike shop, or we prefer a Shimano Service Center,\" says Thrasher. \"They’ve got a tool called an SM-PCE02, and this is a linkage device that checks the electrical internals of each component that’s on the bike. So the motor, the display and so on, and that’s something that’s very difficult to do at home.\"",
    "You might occasionally see error codes on your e-bike's display, which an expert at a bike shop or service center can interpret into a solution. \"So to give you an example, we’ll have an E010 error code, which will appear on the display in combination with an E013, says Thrasher.",
    "\"What the first error code means is a general system error code. The second error code is a torque sensor error code. So from a bike shop’s point of view, you look at both of those and you go ‘I’m pretty sure I know where that problem is.’",
    "\"And they also need to look at well, has that been caused through a mechanical issue, and they’re much better equipped to do that. They look at your bike as a whole and then offer you a solution, whereas when you’re at home, you can really only make the problem worse.\"",
    "\"Definitely don’t disassemble the battery or the drive unit because you’ll give yourself a big shock,\" Thrasher says. \"The other thing is don’t poke things into the terminals of the battery, because that could also give you a huge shock.\"",
    "Poking and prodding is a bad idea, but you should make sure that the male terminals on the battery are nice and clean. \"Those are fine once you’ve got the battery out and off the bike it’s not going to hurt you, so you can clean the other parts.\"",
    "Thrasher gives the example of one of Shimano's sponsored riders who was having an error code in his bike. It turned out the problem was down to the dust he'd been riding in; once he cleaned out the dusk, the error code went away.",
    "\"Don’t spray any lubricant into the wire ports – that’s really a no-no – and treat the cables with care,\" Thrasher adds. \"If at any point you don’t think it’s going in, don’t use more force because that generally ends up with something breaking. Don’t force them into the components, and if you can, do use the wire tool that I spoke about.",
    "\"Don’t try to get into the motor or the battery, but you should ensure that the bolts that are mounted to the frame are tight, and there’s generally only six bolts that do that, and there’ll generally be a torque setting from the manufacturer. That’s really good because that can lead to creaks coming from the bike, but they’re quite easy to solve. Do make sure those bolts are tight.",
    "\"If you’re cleaning the e-bike, don’t point a high-pressure hose directly at the electrical components – they don’t really like that – but do keep it clean. We say use a clean cloth and then a clean T-shirt afterwards just to dry it down.\"",
    "When storing your electric bike, the most important thing is to keep it clean, dry, and fully charged. \"Really the best way is to make sure the e-bike’s ready for the next ride,\" says Thrasher. \"Make sure it’s ready when you get back from the last ride. Keep it clean, inspect it for damage.",
    "\"These are all things that are really stressful when you’re about to go out for a ride, but actually if you spend five minutes just looking over the bike when you get back, it’s nice to know that you’ve put that bike away in a state that you can just pick it up, turn it on and go for a blast on it on the next ride. It relieves some of the stress.\"",
    "You don't have to take the battery off the bike when you're storing it, Thrasher explains. \"A lot of people to take the battery off the bike to charge it, which is fine, you can do that, but some e-bikes have remote on switches on the top tube, and they also have a cell inside them that needs a little bit of the power of the battery to make them operable. So we say every four times, just put the battery into the bike to charge it on the bike. They do benefit from that.\"",
    "Storing your e-bike somewhere damp or humid might cause corrosion of the electrical parts, which can cause issues down the line,",
    "\"Don’t hang your oily rags over the charger or the battery because they get warm and that can lead to fire,\" Thrasher adds. \"Definitely don’t cover anything up – don’t cover the charger up, don’t cover the battery up. Make sure you’ve got lots of free space around where you’re charging the bike.\"",
    "Finally, don't let the battery run out of charge completely and leave it that way.",
    "Getting an ordinary bike serviced once or twice a year helps nip any potential problems in the bud and keep it running smoothly. It's very similar for an electric bike, and provided you care for it properly, as described above, taking to the professionals every six to 12 months is fine.",
    "\"A lot of the things you need to consider are like a regular bike,\" says Julian Thrasher. \"We’re lucky in that Shimano Steps is a pretty robust e-bike system, so if you do take care of the bike in terms of keeping the chain oiled, keeping the pads replaced, the need to take it in for a professional service isn’t all that often.\"",
    "Your bike will be thoroughly examined for mechanical issues, but for an e-bike it's also your opportunity to get any new firmware updates. Thrasher explains that i's very much like updating your phone, but can only be done professionally.",
    "\"This is something that you would need to visit a professional bike shop or a Shimano service centre for,\" he says. \"They ensure that any bugs in the system that [the developers] have found are taken out, that all the components speak effectively together, and sometimes there can be little upgrades. \"Basically there’ll be features that come out that the new firmware accommodates. So it’s a really good virtual upgrade.\"",
    "\"People don’t need to be scared that you need to be taking the bike in every five days to be looked at,\" he says. \"They’re pretty robust, so the main thing is the firmware, to take it in and to just get it checked over to make sure there’s nothing that you may not have seen that a professional bike shop could see.\"",
    "If you live in the UK, you can apply for a £50 voucher towards maintaining your e-bike through the government's new Fix Your Bike scheme. Vouchers cover essential repairs and services, and are available through retailer including Halfords and Evans Cycles, plus smaller bike shops."
  ],
  "headers": {
    "2": "What checks should you do before riding?",
    "15": "How can you make the battery last longer?",
    "22": "What if your bike has an electrical fault?",
    "27": "Are there any other things you shouldn't do?",
    "33": "How should you store your e-bike after a ride?",
    "39": "How often does your e-bike need servicing?",
    "44": "Fix Your Bike scheme"
  },
  "links": {
    "best electric bikes": "https://www.techradar.com/best/electric-bike",
    "www.freewheel.co.uk": "https://www.awin1.com/awclick.php?awinmid=20283&awinaffid=103504&clickref=trd-us-7034399819661025000&p=https%3A%2F%2Fwww.freewheel.co.uk%2F",
    "Fix Your Bike": "https://fixyourbikevoucherscheme.est.org.uk/",
    "Halfords": "https://www.prf.hn/click/camref:1101ldACx/pubref:trd-us-8424668690892174000/destination:https%3A%2F%2Fwww.halfords.com%2Fcycling%2Fbike-maintenance%2Ffix-your-bike-scheme-439790.html",
    "Evans Cycles": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=45658&u1=trd-us-1000804525104002000&murl=https%3A%2F%2Fwww.evanscycles.com%2Ffixyourbike"
  }
}