{
  "source": "https://www.techradar.com/news/okta-finalizes-dollar65bn-auth0-deal",
  "title": "Okta finalizes $6.5bn Auth0 deal",
  "category": "computing",
  "updated": "2021-05-04T11:10:23Z",
  "author": "sead-fadilpasic",
  "summary": "Okta closes deal on competitor",
  "article": [
    "Identity provider Okta has announced its acquisition of competitor Auth0 has been successfully completed. The deal, valued at roughly $6.5 billion, was first announced some earlier this year, being described as a “major shakeup” in the identity management space.",
    "Now that the deal has been closed, Okta said Auth0 will continue working as an independent business within Okta, led by Auth0 CEO and co-founder, Eugenio Pace, who will report directly to Todd McKinnon, Okta’s co-founder and CEO.",
    "Both companies will be “supported, invested in and integrated over time”, the company said in a press release, adding that it expects the deal to further accelerate innovation and making Okta Identity cloud “even more compelling” for the full spectrum of customers and users.",
    "Following the merger, the all-stock deal will net Auth0 a fixed number of Okta shares at a predetermined price of $276.21 each, it was established earlier.",
    "Okta said it would share more details about the deal, as well as a combined financial outlook for fiscal 2022, at the same time when it releases its Q1 2022 financial results, on Wednesday, May 26. It will host a web conference at 2 PM Pacific time.",
    "“A single, unified identity platform has the power to transform an organization by providing seamless and secure access for both customers and employees,” said McKinnon.",
    "“Okta and Auth0 have always shared a vision for the identity market. We’re also both cloud-first, customer-first companies. By joining forces, we’ll give our customers more choice and flexibility, driving tremendous value and enabling them to accelerate innovation. Together, we will shape the future of identity on the internet, empowering developers to build with identity at the foundation.”",
    "Okta provides identity solutions for the enterprise, and currently boasts more than 10,000 clients, including JetBlue, Slack, T-Mobile, and Twilio."
  ],
  "headers": {
    "4": "Shared vision"
  },
  "links": {
    "earlier this year": "https://www.techradar.com/news/okta-buys-auth0-to-create-verification-giant",
    "identity management space": "https://www.techradar.com/best/best-identity-management-software",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting"
  }
}