{
  "source": "https://www.techradar.com/news/us-cracks-down-further-on-huawei-and-zte",
  "title": "US cracks down further on Huawei and ZTE",
  "category": "phones",
  "updated": "2021-10-29T19:00:14Z",
  "author": "anthony-spadafora",
  "summary": "New legislation will prevent Chinese tech firms from receiving new equipment licenses",
  "article": [
    "The US government is continuing its efforts to limit technology from Huawei, ZTE and other Chinese tech firms from being used in its telecommunications network.",
    "As part of these efforts, the Secure Equipment Act will prevent Huawei, ZTE and other companies, that have been designated as security threats, from receiving new equipment licenses from US regulators according to a new report from Reuters.",
    "After being approved by the US House on a 420-4 vote, the US Senate voted unanimously to approve the legislation. Now all that's left for it to become law is a signature from US President Joe Biden.",
    "Under the Secure Equipment Act, the Federal Communications Commission (FCC) would be prohibited from reviewing or issuing new equipment licenses to companies on its “Covered Equipment or Services List”.",
    "Back in March, the FCC designated Huawei, ZTE, Hytera Communications Corp, Hangzhou Hikvision Digital Technology and Zhejian Dahua Technology Co as posing a threat to national security under a 2019 law designed to protect communications networks in the US. Then in June, the FCC voted unanimously to advance a plan that would ban all approvals for equipment in US telecommunications networks from these five Chinese companies.",
    "While new equipment licenses would be banned, the proposed rules that received initial approval in June would also allow the FCC to revoke prior equipment authorizations issued to Chinese companies.",
    "According to FCC Commissioner Brendan Carr, the Secure Equipment Act will prevent and help ensure that “insecure gear from companies like Huawei and ZTE can no longer be inserted into America's communications networks”.",
    "As President Biden is currently on a European tour in which he will meet with world leaders at a G7 summit in the UK, he will likely sign the Secure Equipment Act into law once he returns to the US.",
    "Protect your privacy online with one of the best VPN services",
    "Via Reuters"
  ],
  "headers": {
    "3": "Equipment licenses"
  },
  "links": {
    "Chinese tech firms": "https://www.techradar.com/news/us-bans-major-chinese-apps-including-alipay-and-wechat-pay",
    "new report": "https://www.reuters.com/technology/us-lawmakers-vote-tighten-restrictions-huawei-zte-2021-10-28/",
    "FCC": "https://www.techradar.com/news/fcc-unveils-its-method-to-stop-sim-swapping-scams-and-robocalls",
    "Covered Equipment or Services List": "https://www.techradar.com/news/fcc-continues-bid-to-remove-huawei-gear-from-us-networks",
    "best VPN": "https://www.techradar.com/vpn/best-vpn",
    "Reuters": "https://www.reuters.com/technology/us-lawmakers-vote-tighten-restrictions-huawei-zte-2021-10-28/"
  }
}