{
  "source": "https://www.techradar.com/news/grab-this-bose-quietcomfort-cyber-monday-deal-while-you-still-can",
  "title": "Grab this Bose QuietComfort Cyber Monday deal while you still can",
  "category": "audio-visual",
  "updated": "2021-11-30T14:30:52Z",
  "author": "olivia-tambini",
  "summary": "Don't miss this brilliant Cyber Monday headphones deal",
  "article": [
    "Cyber Monday is drawing to a close, but there are still some fantastic headphones deals to take advantage of - and this excellent Bose discount has caught our eye in particular.",
    "The Bose QuietComfort 45 noise-cancelling headphones may have only just launched, but Amazon already has already discounted them in an excellent late Cyber Monday headphones deal, bringing them down from $329 to $279 and saving you $50. (Not in the US? Scroll down for the best deals in your region.)",
    "This discount first appeared before Black Friday, but it's the first time we've seen the price of the wireless headphones drop since they were released in late September. The deal also brings the Bose QuietComfort 45 down to their lowest price so far.",
    "The Bose QuietComfort 45 are a rock-solid pair of noise-cancelling headphones, thanks to their simple controls and lightweight, comfortable design.",
    "Excellent noise cancellation technology that's more responsive than ever before ensures these headphones are perfect for when you want to block out the world around you, while a new Ambient Aware mode allows you to tap into your surroundings at the touch of a button.",
    "On top of that you’ve got a good-but-not-great battery life of 25 hours and a beam-forming microphone array that is, well, not quite as good as we had hoped. Neither of these are deal-breakers, but they do make the Bose QuietComfort 45 slightly less appealing than some of its competitors, like the Sony WH-1000XM4.",
    "They also aren't the best-sounding headphones we've ever tested, but we liked their neutral presentation that doesn't lean too heavily towards the bass or the higher frequencies in your music.",
    "This deal - while not super low - is worth snapping up if you want a pair of brand-new wireless headphones without needing to pay full price. And, now that retailers are winding down or stopping their Cyber Monday sales, you should snap it up right away so you don't miss out.",
    "No matter where you live, you'll find all the lowest prices for the Bose QuietComfort 45 from around the web right here, with offers available in your region."
  ],
  "headers": {
    "3": "Today's best Cyber Monday Bose headphones deal",
    "8": "More Bose QuietComfort 45 deals",
    "9": "More late Cyber Monday deals"
  },
  "links": {
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021",
    "Cyber Monday headphones deal": "https://www.techradar.com/cyber-monday/cyber-monday-headphones-deals",
    "$329 to $279": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FBose-QuietComfort-Bluetooth-Cancelling-Headphones%2Fdp%2FB098FKXT8L%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1669152622201214000-20",
    "Bose QuietComfort 45": "https://www.techradar.com/reviews/bose-quietcomfort-45",
    "noise-cancelling headphones": "https://www.techradar.com/news/audio/portable-audio/best-noise-cancelling-headphones-1280490",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones"
  }
}