{
  "source": "https://www.techradar.com/news/amazon-primes-next-big-sci-fi-movie-gets-a-summer-blockbuster-style-trailer",
  "title": "Amazon Prime's next big sci-fi movie gets a summer blockbuster-style trailer",
  "category": "entertainment",
  "updated": "2021-05-26T14:50:56Z",
  "author": "tom-power",
  "summary": "The Tomorrow War's official trailer has arrived",
  "article": [
    "The Tomorrow War is shaping up to be the summer blockbuster movie that Amazon Prime needs.",
    "The streamer recently acquired the exclusive rights to Paramount's upcoming sci-fi movie but, apart from a brief synopsis, a teaser trailer and a couple of press images, little was known about the Chris Pratt-starring film until today (May 26).",
    "Now, Amazon has released the official trailer for The Tomorrow War, and it looks like it'll put a unique spin on the tried-and-tested 'aliens are invading Earth' storyline that we've seen in similar movies, such as Independence Day.",
    "Pratt stars Dan Forrester, a teacher and father who's recruited to fight in a war against a deadly alien species.",
    "The problem? The war takes place 30 years in the future and mankind is losing it. Soldiers from the year 2051, then, have been sent back in time to call up civilians and armed forces personnel, including Forrester, from the present to bolster their ranks and finally eradicate the invading alien forces.",
    "Check out the official trailer for The Tomorrow War below:",
    "Amazon will be hoping that The Tomorrow War can earn it a slice of the summer blockbuster pie when it arrives in early July.",
    "With Covid pandemic restrictions easing in nations where vaccine rollouts have been largely successful, theaters and have begun to reopen their doors after their quietest (and leanest) spell in decades. As film fans start to head back to the cinema to watch movies on the big screen, streaming services like Amazon Prime may experience a downturn in viewership as a result.",
    "The Tomorrow War, then, represents Amazon Prime's best hopes of retaining some of the movie market share. The sci-fi film lands on the streamer a week after the US release of F9, the ninth Fast & Furious movie, and seven days before Marvel's Black Widow launches in theaters worldwide.",
    "With little in the way of competition between those two flicks, and the arrival of other potentially big summer films including Space Jam 2 and The Suicide Squad, The Tomorrow War seems perfectly placed to launch on one of the quieter movie release weekends this summer.",
    "That, coupled with its fresh take on the alien invasion story, should give it enough to join Amazon Prime's other recent successes, such as Sound of Metal, Coming 2 America and Borat 2.",
    "The Tomorrow War will launch exclusively on Amazon Prime Video on July 2."
  ],
  "headers": {
    "6": "Analysis: The Tomorrow War is Amazon Prime's big summer blockbuster hope"
  },
  "links": {
    "Black Widow": "https://www.techradar.com/news/black-widow-movie-trailer-release-date",
    "Space Jam 2": "https://www.techradar.com/news/space-jam-a-new-legacy-release-date-cast-plot-cameos-and-more"
  }
}