{
  "source": "https://www.techradar.com/news/netflixs-shadow-and-bone-is-a-faithful-fantasy-tv-adaptation-to-rival-the-witcher",
  "title": "Netflix’s Shadow and Bone is a faithful fantasy TV adaptation to rival The Witcher",
  "category": "entertainment",
  "updated": "2021-04-27T10:23:54Z",
  "author": "tom-power",
  "summary": "Shadow and Bone will entertain new and established fans alike",
  "article": [
    "Netflix has become the go-to streaming service for fantasy fans. Shows like The Witcher, Cursed and Fate: The Winx Saga have varied in terms of critical reception, but there’s clearly a big appetite for these series that are high on escapism for subscribers.",
    "Shadow and Bone, Netflix’s adaptation of Leigh Bardugo’s book series, is the latest fantasy series to arrive on the streamer - and it’s an exciting adventure-filled drama that will capture the hearts and minds of young adults alike. Shadow and Bone toes the line between faithfully recreating Bardugo’s Grishaverse for TV while putting a fresh spin on its plot and key players, and the series is stronger for it.",
    "Based on Bardugo’s Grisha trilogy and Six of Crows duology, Shadow and Bone simultaneously tells two stories across its eight episodes. The first follows Alina Starkov (Jessie Mei Li), a mapmaker who’s anointed as the very first Sun Summoner, a powerful warrior with the ability to create sunlight at will, after an unexpected event.",
    "During a routine supply run through the Shadow Fold - a giant wall of darkness that splits the world’s main continent in two - Alina unleashes her powers for the first time in a desperate act to save lifelong friend and First Army tracker Mal (Archie Renaux) from the Fold’s bloodthirsty monsters.",
    "Whisked away from everything she knows by General Kirigan (Ben Barnes), Alina is trained to hone her abilities as a Grisha, magical humans that can manipulate matter, to destroy the Shadow Fold. Doing so will free the royal kingdom of Ravka and Alina’s Shu Han homeland and reunite them with the rest of the Grishaverse - Bardugo’s self-contained world that houses her various novel series - for the first time in centuries.",
    "Initially burdened by the weight of this colossal undertaking, Alina eventually embraces her powers and faces up to it. Soon, though, revelations come to light about the Fold’s true nature and origins, and Alina realizes that she must destroy it not only to free her country, but to prevent the entire world from being consumed by darkness.",
    "Meanwhile, the Dregs - a criminal gang consisting of leader Kaz Brekker (Freddy Carter), Jesper Fahey (Kit Young) and Inej Ghafa (Anita Suman) - are tasked by a wealthy benefactor with traveling across the Shadow Fold and completing a mysterious mission. Unbeknownst to them, however, this will put them on a collision course with dangerous foes.",
    "Without entering spoiler territory, Shadow and Bone’s two concurrent plots eventually converge, and it’s a novel approach for Netflix to take with its adaptation. Bardugo’s two book series exist in the same universe, but some key characters in each actually never cross paths. They do here, though, so it leads to a slight deviation from the source material.",
    "That said, Shadow and Bone's main issue is its overload of characters spread across different locations – at least at first.",
    "The opening couple of episodes are a bit hard to follow, not because they’re rushed, but because so many characters and world regions are introduced in quick succession. Cities and locales are given the ‘name on screen’ treatment in an effort to help viewers, but it’s difficult to discern where events play out when so many of these locations look alike. Another issue is that some characters mumble key lines of dialogue early on, and this makes it even harder to determine who’s who and what’s happening.",
    "Once those issues are ironed out in later episodes, it’s easier to keep track of key characters - and focus on the stellar work of the show’s actors. Mei Li, Renaux and Barnes all shine in their respective roles, and the chemistry between the trio makes their varying relationships feel authentic to their book counterparts.",
    "On-screen chemistry is also a notable upside for the Dregs. Carter, Young and Suman bounce well off one another, and their characters’ personality clashes set up some of the funnier moments in the show, which is a welcome change of pace from Alina’s more serious story arc. Add in the solid foils of the supporting cast, including Danielle Gilligan’s Nina Zenik and Calahan Skogman’s Matthias Helvar, and the series’ cast is a strong one.",
    "Praise must go to Bardugo and showrunner Eric Heisserer for diversifying Shadow and Bone’s cast, too. By the author’s own admission, the Grisha trilogy’s “very white and straight” characters needed addressing in her Six of Crows duology follow-up and the Netflix series, and it’s reassuring to see the duo follow through on this for the TV adaptation.",
    "While Shadow and Bone is a fantasy drama at its heart, there are action sequences that change the tempo throughout. It’s disappointing to report, then, that this is the area where Netflix’s adaptation feels slightly lacking.",
    "In truth, there are only three standout set pieces to speak of, and two can be found across the first and final episodes. It means that the series starts and ends on high notes where the action is concerned, but its middle episodes suffer through the absence of grand spectacles. Sure, there are skirmishes dotted throughout the series, but they’re over as quickly as they begin.",
    "It’s a shame, because when the action gets going, it looks really good. The close quarters action is well choreographed and the ranged combat, complete with plenty of Grisha magic visual effects, look authentic for this fantasy world. Overall, though, a little more in the way of fighting would have helped to break up some of the show’s lengthier conversational scenes.",
    "Speaking of the visual effects, the world of this show is spectacular to look at. The Shadow Fold has been brought to life in imposing fashion, while the beasts that inhabit the world move and act like their real world counterparts would. The utilization of green screen technology is noticeable on occasion but, for the most part, CGI backgrounds have been blended well enough to appear as if they’re actually there.",
    "Netflix’s Shadow and Bone is an entertaining ride that fans of the fantasy genre will love. It’s not perfect, but issues like the relative lack of action and confusing character introductions can be ironed out in future seasons if Netflix moves forward with them.",
    "Comparisons between Shadow and Bone and other fantasy TV shows, including The Witcher, are inevitable, especially with both adaptations being Netflix productions. Shadow and Bone, though, stands on its own two feet thanks to its rich world, engaging characters and faithful retelling of Bardugo’s critically acclaimed novels.",
    "Based on its first season, Shadow and Bone feels like a surefire hit for Netflix, and established fans and series newcomers alike should enjoy it equally.",
    "Shadow and Bone season 1 launches exclusively on Netflix on Friday, April 23."
  ],
  "headers": {
    "2": "Switching up the story",
    "10": "Casting a spell",
    "13": "Battling the elements",
    "17": "What we think"
  },
  "links": {
    "Netflix": "https://www.anrdoezrs.net/links/6361382/type/dlg/sid/trd-us-6221522597191420000/http://netflix.com/",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Shadow and Bone": "https://www.techradar.com/news/shadow-and-bone-is-netflixs-new-fantasy-series-that-borrows-from-doctor-strange"
  }
}