{
  "source": "https://www.techradar.com/news/microsoft-edge-just-left-a-serious-rival-in-its-dust",
  "title": "Microsoft Edge just left a serious rival in its dust",
  "category": "computing",
  "updated": "2021-07-06T12:51:48Z",
  "author": "joel-khalili",
  "summary": "Microsoft Edge puts daylight between itself and Mozilla Firefox",
  "article": [
    "Microsoft has reached a major milestone in its quest to regain a foothold in the web browser market.",
    "New data from Statcounter shows that Edge has now overtaken established rival Firefox in the rankings. In recent months, the pair have been neck-and-neck, but Microsoft's browser has now put daylight between itself and Firefox.",
    "Figures for June suggest Microsoft Edge now holds 3.4% of the browser market, while Firefox has slipped to 3.29%, continuing a downward trajectory that has seen the browser either lose or maintain market share in ten of the last twelve months.",
    "The change pushes Edge into third position in the browser rankings, behind only Chrome (65.27%) and Safari (18.34%).",
    "Launched in January 2020, the new Chromium-based Edge got off to a slow start, but began to gather momentum as the year progressed. Since last summer, the browser's market share has more than tripled.",
    "The increase in adoption can be attributed in part to renewed marketing efforts, but also to improvements that brought the experience in line with other modern web browsers.",
    "Since the start of the pandemic, Microsoft has delivered a host of upgrades for the browser, including a secure password generator, in-built price comparison tool, vertical tab bar and more.",
    "Under the hood, the company worked hard to improve the speed and responsiveness of the browser too with features such as sleeping tabs and start-up boost, both of which are designed to optimize resource consumption.",
    "Another contributing factor to the success of Edge is Microsoft’s ability to leverage its wider ecosystem of products; in particular, Windows.",
    "With the retirement of Edge Legacy and Internet Explorer, Edge Chromium has become the company’s undisputed flagship. And in June, Microsoft began to roll out its new browser to all PCs via Windows 10 updates, expanding the install base by millions almost overnight.",
    "Now, Microsoft is doing everything in its power to encourage users to abandon Internet Explorer in favor of Edge, such as removing support for Microsoft 365 web apps and automatically launching certain web pages in the new browser.",
    "Although the growth of Edge has been fueled in large part by the demise of defunct browsers, Microsoft will be encouraged by its performance nonetheless. Previously, we’ve said that Edge will need to snatch users from the largest players in the market (Chrome, Safari and Firefox) in order to maintain momentum - and the latest figures suggest it’s doing just that."
  ],
  "headers": {
    "4": "Microsoft Edge improvements"
  },
  "links": {
    "web browser": "https://www.techradar.com/best/browser",
    "data from Statcounter": "https://gs.statcounter.com/",
    "Edge": "https://www.techradar.com/reviews/pc-mac/software/utilities/other-software/microsoft-edge-1292485/review",
    "password generator": "https://www.techradar.com/best/password-generator",
    "price comparison tool": "https://www.techradar.com/news/microsoft-edge-gets-this-great-new-shopping-feature-in-time-for-amazon-prime-day",
    "vertical tab bar": "https://www.techradar.com/news/you-can-now-access-vertical-tabs-in-microsoft-edge-heres-how",
    "sleeping tabs": "https://www.techradar.com/news/windows-10-brings-a-game-changing-feature-to-edge-to-beat-chrome",
    "start-up boost": "https://www.techradar.com/news/windows-10-update-could-make-your-browser-lightning-fast",
    "Microsoft 365": "https://www.techradar.com/reviews/microsoft-365-review"
  }
}