{
  "source": "https://www.techradar.com/news/the-new-kirby-switch-game-could-be-the-return-to-form-the-series-desperately-needs",
  "title": "The new Kirby Switch game could be the return to form the series desperately needs",
  "category": "gaming",
  "updated": "2021-09-26T13:00:00Z",
  "author": "rhys-wood",
  "summary": "Opinion: The Switch title could be a watershed moment for Kirby",
  "article": [
    "It's always a delight to see Kirby. The friendly, loveable, huggable, cosmic god-destroying pink blob is one of Nintendo and HAL Laboratories' most iconic creations. For a character with such a simple, rounded design, Kirby has nonetheless remained extremely relevant and recognizable in the modern gaming era.",
    "The same, unfortunately, can't be said of his most recent games. Kirby's always been brilliantly fun to play as in Smash Bros. of course, but when it comes to his own series, Kirby's sadly settled for mediocrity for far too long.",
    "But that looks like it's about to change when Kirby and the Forgotten Land launches in early 2022 on Nintendo Switch. Officially announced during September 2021's Nintendo Direct presentation (and leaked shortly before it), Kirby and the Forgotten Land represents a huge shakeup for the series in terms of gameplay, setting and potentially story, too.",
    "Kirby and the Forgotten Land is set in a strange, Earth-like post-apocalyptic world. Kirby finds himself exploring some very human areas like a shopping mall and fairground, for example. These locales are a far cry from Kirby's whimsical home planet Popstar, with the overgrown abandoned cityscapes looking like they've taken a leaf from Nier: Automata.",
    "So that must mean that Forgotten Land is the Nier of Kirby games, right? Well, no, not quite. The game is still replete with familiar Kirby characters, enemies and obstacles, and his trademark copy ability makes a return, too. As such, we can see that the game is as lighthearted and charming as Kirby has always been... or is it?",
    "I can't quite shake the feeling that something is very weirdly off about Kirby and the Forgotten Land, and by no means in a bad way. This forgotten land Kirby finds himself in is overrun with the familiar critters of games' past, but the setting is so distinctly human that it makes me wonder just where our pink friend really is, and what caused the place to be abandoned for such a long time?",
    "If it was any other similarly-whimsical series, I'd likely pay this no mind. After all, it's common for platformers to experiment with unique locales every now and then. Just look at the uncanny New Donk City from Super Mario Odyssey.",
    "But we're talking about Kirby, and if you're unaware, that \"cosmic god-destroying\" comment was no joke, as the loveable character has duelled with some of the freakiest and outright unsettling bosses ever to feature in a Nintendo game. Whatever's brought Forgotten Land's world to ruination, I'm fully expecting it to be just as eldritch and incomprehensible as Kirby final bosses usually are.",
    "I don't think Kirby's had the most stellar track record when it comes to his titles over the last few years. Multiplayer-focused titles like Kirby Battle Royale and Kirby Fighters 2 failed to hit the mark with fans. 2018's Kirby Star Allies was a step in the right direction, but ultimately couldn't shake the feeling of being just another side-scrolling Kirby platformer.",
    "Long gone were the hay days of classics like Kirby: Canvas Curse (known as Power Paintbrush in Europe), Kirby 64 and Kirby's Air Ride, back when the series wasn't afraid to experiment. It's games like these that made Kirby so special and ultimately unpredictable.",
    "Now, though, Kirby and the Forgotten Land looks like it could be reigniting that experimental magic that made the series so special. It's worth noting that the upcoming Switch title marks the first time that Kirby's been on a fully 3D adventure, and I can't wait to see what that extra dimension means for exploration, level design and boss fights.",
    "Finally, I can't help but touch on just how fantastic Kirby and the Forgotten Land looks as a game. Despite the post-apocalyptic setting, the game is awash with vibrant colors much in the same way other Switch classics like Super Mario Odyssey and the upcoming Splatoon 3.",
    "Even looking at the game through a pre-recorded presentation, where the bitrate did the showcase no favors, it's easy to tell that Kirby and the Forgotten Land is simply one of the most stunning looking Switch games to date. That's hugely impressive for a game playing on such aging and outdated hardware.",
    "Not only will Forgotten Land look superb on a HDR-capable display by really emphasizing the colors of the game, you have to imagine that the Nintendo Switch OLED's sharp portable screen will seriously do the game justice... so long as it can maintain a smooth framerate at 720p, of course.",
    "As Super Smash Bros. Ultimate is wrapping up its content plan with the final DLC character on October 5, 2021, it's nice to see Nintendo is still interested in a new wave of projects for its iconic roster of mascots after Smash gave them so much love.",
    "Not only is Kirby and the Forgotten Land ushering that series into a new world of 3D, but Splatoon 3, Metroid Dread (and Prime 4, eventually!), and The Legend of Zelda: Breath of the Wild 2 show us that our favorite Nintendo mainstays aren't going anywhere, and that they could all be heading into a better place than ever before."
  ],
  "headers": {
    "3": "The devil's in the details",
    "8": "Waddling to glory",
    "11": "A sight to behold",
    "14": "A sign of things to come?"
  },
  "links": {
    "Kirby and the Forgotten Land": "https://www.techradar.com/news/kirby-and-the-forgotten-land",
    "Nintendo Switch": "https://www.techradar.com/reviews/nintendo-switch",
    "Nintendo Direct presentation": "https://www.techradar.com/news/nintendo-direct-september-2021-all-the-biggest-announcements-you-need-to-know",
    "Nier": "https://www.techradar.com/reviews/nier-replicant",
    "freakiest": "https://www.youtube.com/watch?v=GH9A5A8A79Y",
    "outright unsettling": "https://www.youtube.com/watch?v=kXtBglmJoZA",
    "Splatoon 3": "https://www.techradar.com/news/splatoon-3-release-date-trailer-news",
    "HDR": "https://www.techradar.com/news/television/hdr-welcome-to-the-next-big-shift-in-home-entertainment-1280990",
    "Nintendo Switch OLED": "https://www.techradar.com/reviews/nintendo-switch-oled-review",
    "Super Smash Bros. Ultimate": "https://www.techradar.com/news/super-smash-bros-ultimate-review?region-switch=NZ",
    "final DLC character": "https://www.techradar.com/news/super-smash-bros-ultimates-final-dlc-character-is-coming-soon-and-i-couldnt-be-happier",
    "Metroid Dread": "https://www.techradar.com/news/its-not-metroid-prime-4-but-metroid-dread-is-the-first-new-2d-entry-in-20-years",
    "Prime 4": "https://www.techradar.com/news/metroid-prime-4",
    "The Legend of Zelda: Breath of the Wild 2": "https://www.techradar.com/news/breath-of-the-wild-2"
  }
}