{
  "source": "https://www.techradar.com/news/could-this-modular-device-be-the-future-of-laptops",
  "title": "Could this modular device be the future of laptops?",
  "category": "computing",
  "updated": "2021-03-01T11:07:05Z",
  "author": "hamish-hector",
  "summary": "Switch it up",
  "article": [
    "Modularity isn’t something new in computing, but the Framework Laptop hopes to bring the upgradability of desktops to more portable devices. With an emphasis on a do-it-yourself approach, the team behind this modular laptop wants to give you the control to fix and improve your own device.",
    "The Framework Laptop comes with a 13.5-inch display boasting a rather unusual 2,256 x 1,504 resolution (due to its 3:2 aspect ratio), a full HD 60 FPS webcam, and is powered by an 11th gen Intel Core processor - with three options to choose from - and up to 64 GB of DDR4 RAM.",
    "If the parts are available, you’ll be able to swap in and out whichever of these you want, and you can even change the laptop’s ports to fit your needs. Every aspect of the device is modular, but based on product descriptions it doesn’t look like the Framework Laptop has a dedicated graphics card and it isn’t clear if one can be installed.",
    "In concept, the Framework Laptop seems like an exciting idea, and the company’s vision to help reduce computing waste and give people more control over their devices is one we can certainly get behind. However, we can’t help but be a little skeptical until we see it in action.",
    "This is because Framework’s promises for its laptop aren’t too dissimilar to products like the Google Ara - Google’s now-defunct modular phone. While desktop PCs are essentially modular devices, which let you add and upgrade components, laptops are more compact, so there are more restrictions on what upgrades can be made.",
    "We’ll just have to wait until the middle of 2021, when the Framework Laptop is set to ship, to see if it can swap out our fears for a bit more optimism.",
    "Via BGR"
  ],
  "headers": {
    "3": "Will it come together?"
  },
  "links": {
    "Framework Laptop": "https://frame.work/",
    "now-defunct modular phone": "https://www.techradar.com/news/phone-and-communications/mobile-phones/google-looks-set-to-dismantle-project-ara-modular-smartphone-plans-1327712",
    "BGR": "https://bgr.com/2021/02/28/framework-laptop-modular-design-specs-price-release-date/"
  }
}