{
  "source": "https://www.techradar.com/news/amds-dlss-rival-could-arrive-in-june-and-might-seriously-worry-nvidia",
  "title": "AMD’s DLSS rival could arrive in June – and might seriously worry Nvidia",
  "category": "computing",
  "updated": "2021-05-10T10:35:18Z",
  "author": "darren-allan",
  "summary": "AMD’s FidelityFX Super Resolution tech might just be imminent",
  "article": [
    "AMD’s FidelityFX Super Resolution, the frame rate boosting tech which will rival Nvidia’s DLSS feature, could arrive as soon as June, at least if the latest from the rumor mill is correct.",
    "As with any speculation like this, we should exercise a serious dose of skepticism – particularly as a previous rumor insisted that FidelityFX Super Resolution (FSR for short) would arrive back in March, and that clearly didn’t pan out. The only official word from AMD has been that the tech will turn up at some point in 2021, a vague timeframe that could potentially mean that we could still have half a year to wait.",
    "However, this new rumor, which comes courtesy of Coreteks on YouTube, reckons that AMD is about to spring FSR, and it will arrive next month – and indeed game developers are already working to implement the tech (not just major dev studios either, but smaller operations by all accounts).",
    "We should obviously be cautious about a possible imminent launch because even if that is AMD’s current intention, those plans could always slide. Date aside, though, there are some really interesting nuggets of rumored info dropped with this leak.",
    "Supposedly FSR won’t require a huge amount of work from developers to implement, which would be great news in terms of getting it adopted. Coreteks asserts that AMD is using algorithmic supersampling to achieve upscaling with minimal overhead (with no machine learning needed, as we’ve previously heard).",
    "In terms of performance, FSR is shaping up to be ‘good’ on this front according to Coreteks, although no actual comparisons are drawn to Nvidia’s DLSS (Deep Learning Super Sampling). Furthermore, FSR might be compatible with Nvidia’s graphics cards – in other words, keeping the standard open in direct contrast to Team Green’s proprietary DLSS.",
    "With DLSS being very strong these days – since the launch of version 2.0 of the tech from Nvidia – it does make sense that AMD would want to come up with something special. And indeed if all this proves to be correct, from the ease of implementation for devs – which could stoke swift adoption across a number of games – to the open nature of the tech, then Team Red might just deliver in that respect.",
    "That said, if AMD is going to make sure things are bang-on out of the gate – remember they certainly weren’t with Nvidia’s first incarnation of DLSS – that runs somewhat against the idea of an imminent launch. From what we’ve heard previously, we certainly weren’t expecting FSR to pitch up as soon as next month, but hey, who knows; and we can certainly keep our fingers crossed.",
    "Via Wccftech"
  ],
  "headers": {
    "4": "Minimal intervention"
  },
  "links": {
    "previous rumor": "https://www.techradar.com/news/amd-fidelityfx-super-resolution-might-launch-in-march-to-challenge-nvidia-dlss",
    "will turn up at some point in 2021": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-will-launch-this-year-to-take-on-nvidia-dlss",
    "no machine learning needed": "https://www.techradar.com/news/amds-fidelityfx-super-resolution-wont-require-machine-learning-unlike-nvidia-dlss",
    "Nvidia’s DLSS": "https://www.techradar.com/news/nvidia-dlss-could-soon-make-loads-of-games-look-and-run-much-better",
    "launch of version 2.0 of the tech": "https://www.techradar.com/news/nvidia-dlss-20-is-here-making-nvidia-geforce-rtx-cards-an-easy-sell",
    "Wccftech": "https://wccftech.com/amds-dlss-competitor-fidelityfx-super-resolution-launching-june/"
  }
}