{
  "source": "https://www.techradar.com/news/audio-technica-launches-cheap-headphones-with-a-huge-battery-life",
  "title": "Audio-Technica launches cheap headphones with a huge battery life",
  "category": "audio-visual",
  "updated": "2021-08-26T13:44:27Z",
  "author": "olivia-tambini",
  "summary": "A 60-hour battery life without a huge price tag",
  "article": [
    "If you're after long-lasting headphones and don't want to pay a premium for them, the latest pair from Audio-Technica could be right up your street.",
    "The new ATH-S220BT over-ear headphones boast a 60-hour battery life, which is longer than most wireless headphones on the market – for comparison, the best headphones of 2021, the Sony WH-1000XM4, have a maximum playback time of 38 hours (and that's with noise cancellation switched off).",
    "In spite of that longer battery life, the Audio-Technica headphones are much cheaper than Sony's finest, coming in at just $59 / £60. While global pricing is yet to be confirmed, that works out at around AU$80. Meanwhile, the WH-1000XM4 will set you back $349 / £349 / AU$549.",
    "Of course, you're not getting more premium features like active noise cancellation, but Audio-Technica does have a great reputation for making excellent-sounding headphones at reasonable prices.",
    "The new ATH-S220BT come with Bluetooth 5 connectivity and, according to the company, support low latency streaming, so you should get any lag between your audio and what's on screen if you're using the headphones for gaming or watching videos. You can also connect them to two different devices at once, or use the included 3.5mm cable for wired listening.",
    "Google Fast Pair means connecting to Android devices should be super quick, and there's support for Siri and Google Assistant.",
    "40mm drivers should provide a powerful sound, and with a lightweight build, they should be comfortable to wear for long listening sessions.",
    "As you might imagine, these headphones aren't the most luxurious looking, but they do look sleek and well-built, coming in navy/beige, black/dark gray, and white/black color combinations.",
    "For anyone that wants to listen to music casually or tune into podcasts during a commute, there's absolutely nothing wrong with buying a pair of cheap headphones – and the sound quality can be surprisingly good.",
    "Audio-Technica has a good track record in this area – its ATH-M20x over-ear headphones sound incredibly clear, well-balanced, and powerful for their low price.",
    "Even budget wireless earbuds (a form factor that used to always command a high price) can sound really good. Models like the Cambridge Audio Melomania 1 Plus and the Lypertek PurePlay Z3 2.0 are proof of this.",
    "Still, you do generally get what you pay for with headphones. For the ultimate audiophile sound quality, you're generally looking at paying upwards of $300 / £300 / AU$400 – and those prices can go into the thousands.",
    "In fact, one of our favorite pairs of headphones cost $3,000 / £2,799 (about AU$4,100). The Focal Stellia combine high-quality craftsmanship with a stunning open soundstage, and they sound mind-blowingly good – but they'll certainly put a dent in your bank account.",
    "Via Engadget"
  ],
  "headers": {
    "8": "Analysis: do cheap headphones ever sound good?"
  },
  "links": {
    "over-ear headphones": "https://www.techradar.com/news/audio/portable-audio/best-over-ear-headphones-1280342",
    "wireless headphones": "https://www.techradar.com/news/audio/portable-audio/best-wireless-headphones-1280344",
    "best headphones": "https://www.techradar.com/news/audio/portable-audio/best-headphones-1280340",
    "Sony WH-1000XM4": "https://www.techradar.com/reviews/sony-wh-1000xm4-wireless-headphones",
    "cheap headphones": "https://www.techradar.com/news/best-cheap-headphones",
    "budget wireless earbuds": "https://www.techradar.com/best/the-best-budget-wireless-earbuds",
    "Cambridge Audio Melomania 1 Plus": "https://www.techradar.com/reviews/cambridge-audio-melomania-1-plus",
    "Lypertek PurePlay Z3 2.0": "https://www.techradar.com/reviews/lypertek-pureplay-z3-20-review",
    "Focal Stellia": "https://www.techradar.com/reviews/focal-stellia-review",
    "Engadget": "https://www.engadget.com/audio-technica-ath-s220bt-headphones-budget-multipoint-pairing-voice-assistant-215046389.html"
  }
}