{
  "source": "https://www.techradar.com/news/ea-play-games-list-here-are-all-the-ea-play-2021-game-trailers",
  "title": "EA Play Live games list: here are all the EA Play 2021 game trailers",
  "category": "gaming",
  "updated": "2021-07-22T18:31:07Z",
  "author": "nick-pino",
  "summary": "Every new game and trailer announced at EA Play Live 2021",
  "article": [
    "Debuting over a month after E3 2021, EA Play Live was our chance to get a look at what games one of the world’s biggest publishers has in store for the rest of this year and beyond.",
    "In its nearly hour-long presentation, EA showed us new trailers for Battlefield 2042, Apex Legends Emergence, GRID Legends and FIFA 22. Also shown off at the event were smaller titles like Lost in Random, Knockout City Season 2 and F1 2021.",
    "Last but not at all least, we got a teaser trailer for a new Dead Space remake that’s coming to PS5, Xbox Series X and PC at some point in the future.",
    "Missed the event? Here are all the games shown off at EA Play 2021.",
    "Kicking off the show was EA’s newest acquisition, Codemasters, and its next upcoming game, GRID Legends. GRID has always been more realistic than, say, the Need for Speed series and Legends will crank that up to the next level as it throws you engine-first into the Champions League race. Expect some fierce competition both on and off the track when GRID Legends arrives in 2022, complete with live-action acted story mode.",
    "The next expansion for Apex Legends will introduce a new character (Seer, that can summon killer drones from his chest) and a larger, ever-changing map. Emergence will kick off the next season of the Apex Legends Global Series (ALGS) that will finally bring Xbox and PlayStation gamers into the fray against PC players to see who’s the best. The expansion launches August 3 and expect to see more of the game when another trailer drops on July 26.",
    "The next indie game from EA’s publishing arm, Lost in Random follows two sisters torn apart in a strange, Tim Burton-esque landscape and thrown up against the queen. Its claymation art style is definitely charming but beneath it lies a fairly deep strategy game that has you building a deck of companions to summon in battle. It will be available on September 10, 2021 on PC, console and Nintendo Switch.",
    "Knockout City’s second season is going to take place on the silver screen. Well, OK, it’s still on consoles but the theme for the second season is all about the movies. This time around we’ll get a new ball to play with as we explore what’s coming next in what is genuinely one of the best multiplayer games released this year.",
    "If the hype for Battlefield 2042 wasn’t high enough already, EA and DICE dropped a new trailer for the game at EA Play that showed off a new feature called Battlefield Portal. Battlefield Portal contains content from Battlefield 2042, Battlefield 1942, Bad Company 2 and Battlefield 3, which can be remixed as unique, user-generated game modes. That means that players have some classic fan-favorite maps to play with, with a total of 13 maps across the Battlefield franchise available at launch. All these maps have been reimagined and revamped to run in 4K at 60fps - with EA Ripple Effect Studios explaining that the latest tech has allowed it to “overcome the limitations of the past”.",
    "The biggest surprise of the day was the announcement of Dead Space, a remaster of the 2008 horror masterpiece. The game has been rebuilt on EA’s Frostbite Engine by MotiveStudio and will be available on PS5, Xbox Series S/X and PC. If you didn’t play the original trilogy, it’s basically Resident Evil in space but instead of slow, shambling zombies or cultists, your main occupational hazards are reanimated space corpses that use their limbs to eviscerate you any chance they get. The only way to stop them is to chop off said limbs and stomp on their heads. Is it graphic? Oh yeah. Is it scary? Absolutely. Are we excited as hell to see it return? You better believe it."
  ],
  "headers": {
    "4": "GRID Legends",
    "5": "Apex Legends Emergence",
    "6": "Lost in Random",
    "7": "Knockout City Season 2 – Fight at the Movies",
    "8": "Battlefield 2042",
    "9": "Dead Space",
    "10": "Watch the complete show, including the pre-show with short clips for FIFA 22, F1 2021 and more"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Battlefield 2042": "https://www.techradar.com/reviews/battlefield-2042",
    "FIFA 22": "https://www.techradar.com/reviews/fifa-22",
    "Dead Space remake": "https://www.techradar.com/news/dead-space-remake",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x"
  }
}