{
  "source": "https://www.techradar.com/news/microsoft-teams-update-will-make-using-the-mobile-app-less-of-a-chore",
  "title": "Microsoft Teams update will make using the mobile app less of a chore",
  "category": "computing",
  "updated": "2021-03-05T10:25:32Z",
  "author": "joel-khalili",
  "summary": "Microsoft Teams for mobile is getting a few handy new features",
  "article": [
    "Microsoft is working on a range of new features for the Teams mobile client, which together should make locating information much easier and better optimize the experience for smaller screen real estate.",
    "As per new entries to the company’s product roadmap, Microsoft is expanding upon the Teams for mobile search function, which will soon offer up predictive suggestions as the user types. The app will also let you “scroll to past and future dates in the calendar using a date picker”, presumably to locate conversations that took place on a specific day.",
    "Microsoft will also introduce new options for organizing chats in the Teams mobile app. Users will soon be able to pin specific chats to the menu bar, as well as filter the chat list, although it’s unclear what filter parameters will be available.",
    "In case users aren’t inspired by search and chat optimizations, Microsoft is also developing a new emoji library and GIF-editing feature for the smartphone app, which should streamline the process of locating and inserting multimedia content into messages.",
    "Each of these new features is still under development, but scheduled to land as part of a full public release by the end of next month.",
    "Information on upgrades to the Teams mobile app comes hot on the heels of a big week for the collaboration platform, which was one of the main focal points of this week’s Microsoft Ignite conference.",
    "At the virtual show, Microsoft revealed that Teams will finally receive limited end-to-end encryption (E2EE) functionality. This additional security protection will initially apply to one-on-one meetings only, although Microsoft hinted that E2EE will be extended to other meeting types in future.",
    "The company also revealed a host of features for presenters, including new settings that allow users to reconfigure the video feed to best suit the style of presentation. For example, the new Standout mode pushes the presenter’s video feed in front of the slide deck, while Reporter mode positions content above the speaker’s shoulder.",
    "In a similar vein to the upcoming Teams for mobile upgrades, Microsoft promised a new dynamic view that automatically optimizes the layout of different meeting elements, which should make for a less cluttered view.",
    "In short, although the vaccine rollout has provided a light at the end of the remote working tunnel, Microsoft is doubling down on its remote collaboration platform, which it hopes will play a fundamental role in the workplace of the future."
  ],
  "headers": {
    "5": "Microsoft Teams updates"
  },
  "links": {
    "Teams": "https://www.techradar.com/reviews/microsoft-teams",
    "product roadmap": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=46128&u1=trd-us-1326201254740275000&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-gb%2Fmicrosoft-365%2Froadmap%3Ffilters%3D",
    "smartphone": "https://www.techradar.com/news/best-business-smartphone",
    "collaboration platform": "https://www.techradar.com/best/best-online-collaboration-tools",
    "end-to-end encryption (E2EE) functionality": "https://www.techradar.com/news/microsoft-teams-is-finally-getting-end-to-end-encryption-and-bunch-of-other-security-upgrades",
    "features for presenters": "https://www.techradar.com/news/microsoft-teams-will-soon-allow-you-to-share-channels-with-external-contacts",
    "remote working": "https://www.techradar.com/news/working-from-home-everything-you-need-to-set-up-your-new-home-office"
  }
}