{
  "source": "https://www.techradar.com/news/apple-tvs-foundation-was-made-after-a-one-line-pitch-creator-says",
  "title": "Apple TV's Foundation was made after a one line pitch, creator says",
  "category": "entertainment",
  "updated": "2021-07-23T09:02:32Z",
  "author": "tom-power",
  "summary": "Foundation arrives on Apple TV Plus in September",
  "article": [
    "David S. Goyer has revealed that Apple agreed to make his live-action Foundation TV show after a one sentence pitch.",
    "Speaking to THR about his upcoming sci-fi epic, the Man of Steel and Terminator: Dark Fate writer explained that his simple explanation of author Isaac Asimov's convoluted source material was enough to get the series made for Apple TV Plus.",
    "So what convinced Apple executives that Foundation was worthy of being sanctioned? The fact that Goyer likened it to HBO's pop culture phenomenon Game of Thrones.",
    "\"Apple asked me if I could pitch it in one sentence,\" Goyer revealed. \"They sort of asked it laughingly. I said: ‘It’s a 1,000-year chess game between Hari Seldon and the Empire, and all the characters in between are the pawns, but some of the pawns over the course of this saga end up becoming kings and queens.\"",
    "Foundation follows Seldon (Jared Harris), a brilliant mathematician who discovers that, unless the Galactic Empire changes its ways, it universe-spanning colony will fall and its people will endure 30,000 years of hardship before a second Empire emerges from the ashes.",
    "After he convinces the Empire's rules that he can cut that period down to just 1,000 years, though, Seldon leads a party to the far reaches of the universe to ensure humanity's survival.",
    "Unbeknownst to the Empire's current overlord Brother Day (Lee Pace), though, Seldon sends a second party to the other side of the universe to conduct a secret project – one that could have huge ramifications not only for the future, but for the present, too.",
    "Apple TV Plus has quietly positioned itself as one of the most underrated streaming services available right now.",
    "While the likes of Netflix, Disney Plus and Amazon Prime fight it out for top spot among streaming platforms, Apple's own service has built up an impressive back catalog that includes Ted Lasso, Lisey's Story and For All Mankind. Not only that, but it's attracted top-name talent such as Chris Evans, Justin Timberlake and Rose Byrne for its myriad of TV shows.",
    "The company's streaming division, then, will hope that Foundation will be another big hitter for it in the same way that Ted Lasso was in 2020.",
    "All of the pieces are there for Foundation to be a success, too.",
    "The series' cast is full of big names including Lee Pace (The Hobbit, Guardians of the Galaxy) and Jared Harris (Sherlock Holmes, Chernobyl), while Goyer's involvement means that fans of the director-producer will surely check Foundation out when it arrives.",
    "Combine those with Foundation's mysterious millennia-spanning plot, impressive visuals and likeness to other big sci-fi properties – Asimov's novels inspired the likes of Star Wars and The Hitchhiker's Guide to the Galaxy, after all – and Foundation has, well, laid the foundations for its own potential success.",
    "Of course, none of this is to say that Foundation will be a major hit.",
    "As Goyer told THR: \"No one knows if it will work, but I can say there's definitely never been a show like it\", so it'll be up to Apple TV Plus' global audience to decide if Foundation is as good as it looks and whether we'll get more than a single season.",
    "Foundation season 1 will launch exclusively on Apple TV Plus on Friday, September 24."
  ],
  "headers": {
    "7": "Analysis: Foundation represents a giant leap for Apple TV Plus in the streaming battle"
  },
  "links": {
    "Foundation TV show": "https://www.techradar.com/news/foundation-on-apple-tv-plus-release-date-plot-cast-and-what-we-know-so-far",
    "THR": "https://www.hollywoodreporter.com/tv/tv-news/apple-tv-david-s-goyer-foundation-1234985520/",
    "impressive back catalog": "https://www.techradar.com/best/best-apple-tv-shows",
    "Ted Lasso": "https://www.techradar.com/news/what-time-is-ted-lasso-season-2-released-on-apple-tv-plus"
  }
}