{
  "source": "https://www.techradar.com/news/loki-episode-1-ending-explained-whos-the-cloaked-figure",
  "title": "Loki episode 1 ending explained: who's the cloaked figure?",
  "category": "entertainment",
  "updated": "2021-06-10T10:32:17.774Z",
  "author": "samuel-roberts",
  "summary": "There are three possible answers – spoilers ahead",
  "article": [
    "Spoilers for this week's episode of Loki follow.",
    "Who's the cloaked figure at the end of Loki episode 1? Well, if you were paying attention to the first episode of the latest Marvel Cinematic Universe show, you'll know the answer: it's Loki! But which one? That's the key question at the heart of this first episode. And thanks to casting news we've seen for the show, we think there are a few possibilities of who this might be.",
    "Loki episode 2 is largely expected to follow our displaced god of mischief as he assists the TVA in tracking another version of himself down. We think there are two main possibilities as to who's under the cloak at the end of this episode – below, we'll talk you through those.",
    "Spoilers follow for Loki episode 1 – but we'll also discuss arguably spoiler-y things like set photos from the show, so if you want to go in to episode 2 clean, we'd advise skipping and just watching the episode.",
    "Here's the key background information you need to know about this other Loki. When we're introduced to Owen Wilson's Mobius, we're in Aix-En-Provenance in France in 1549. We learn that the murder of this TVA Minutemen squad is the sixth in a week – at the end of the episode, we witness a seventh.",
    "When Mobius asks a surviving child who committed the killing, they gesture towards a stained-glass image of the devil, wearing green – our first hint this is Loki. We also learn this version of Loki handed some gum to the child, with the brand 'Kablooie' written on it.",
    "At the end of the episode, Mobius pitches a job to Loki: this fugitive 'variant' – that is, someone who has diverged from their proper path on the 'sacred timeline' of the MCU – has been killing the TVA's Minutemen. Mobius reveals that the variant they're hunting is Loki.",
    "At the end of the episode, another TVA squad arrives in Salina, Oklahoma in 1858 and scans a futuristic-looking sword, explaining that it's from the early third millennium. The group finds oil on the ground, and assumes it's a time traveler looking to get rich.",
    "Except, it isn't – a figure in a cloak drops a torch and sets fire to the oil, burning the TVA agents alive. The episode ends.",
    "There are two cast members who are confirmed to be part of Loki whose characters have not been revealed yet – Richard E. Grant and Sophia Di Martino. These offer our two main possibilities for the mysterious cloaked Loki, other than the fact that it could be Hiddleston playing a different version of his character.",
    "We think Lady Loki is the most obvious option for the identity of the cloaked figure. For one, Di Martino was spotted on-set last year dressed in a dark costume that could feasibly belong to Loki – she was on-set at the same time as Owen Wilson and Tom Hiddleston in an exterior setting. We won't post the image here in case you want to keep the costume reveal for future weeks.",
    "In the comics, Lady Loki has a long history, but the modern incarnation was introduced just over a decade ago, and is a fairly familiar element of modern Marvel iconography.",
    "Another big clue: a teaser for the show that included Loki's TVA file listed the god of mischief's gender as 'fluid'.",
    "We think the set photos, combined with this detail, mean that Lady Loki is likely the villain of the series – or at least, the antagonist of these early episodes, as our Loki and Mobius track this figure down.",
    "The other obvious option for this Loki is an older version, played by Richard E. Grant. While it's entirely possible that Tom Hiddleston will pull double duty as both antiheroic and villainous versions of himself in this series, the more dramatically interesting possibility here is that the series' villain is a warped, aged version of the Loki we know so well. Some have floated that Grant could be playing King Loki from the comics.",
    "It's suggested that this rogue Loki has a long history, that they've been traveling across time wreaking havoc, and that they're so accomplished a killer that they could murder entire squads of TVA agents at a time. Surely an older Loki would be a deadlier one?",
    "If it doesn't happen here, we wouldn't be surprised to see Grant turn up in later episodes as an older Loki. The cheekbones and voice would make him a perfect older version of Hiddleston's character.",
    "This one's more remote. In the comics' recent history, Loki was de-aged to a mischievous brat for a series of storylines – and became something of a fan favorite. Kid Loki would be an interesting element to toss into this series, assuming we're going to see many Loki 'variants' throughout this show.",
    "But we think this one can be ruled out by the fact that the cloaked figure looked tall enough to be an adult – if it was a kid setting fire to the TVA Minutemen, we think it would've been slightly more obvious."
  ],
  "headers": {
    "4": "What do we know about the fugitive Loki variant?",
    "9": "Possibility 1: It's Lady Loki",
    "14": "Possibility 2: It's old Loki",
    "17": "Possibility 3: It's kid Loki"
  },
  "links": {
    "Loki": "https://www.techradar.com/news/loki-episode-1-just-explained-how-the-marvel-cinematic-multiverse-works",
    "Marvel Cinematic Universe": "https://www.techradar.com/how-to/how-to-watch-the-marvel-movies-in-order",
    "King Loki": "https://marvel.fandom.com/wiki/Loki_Laufeyson_(Ikol)_(Earth-14412)"
  }
}