{
  "source": "https://www.techradar.com/news/google-pixel-6-might-have-a-disappointing-chipset-and-an-upgraded-camera",
  "title": "Google Pixel 6 might have a disappointing chipset and an upgraded camera",
  "category": "phones",
  "updated": "2021-05-24T09:01:40Z",
  "author": "james-rogerson",
  "summary": "Plus a 120Hz screen",
  "article": [
    "One of the most exciting rumored aspects of the Google Pixel 6 range so far has been the apparent use of an in-house chipset codenamed Whitechapel, but we’ve now heard a bit more about this, and it doesn’t sound quite as exciting anymore.",
    "According to leaker Max Weinbach, speaking to Myriam Joire on her Mobile Tech Podcast, the Whitechapel chipset will fall between the top-end Snapdragon 888 and the Snapdragon 865, which was a flagship Android chipset in 2020.",
    "That perhaps puts it in line with the Snapdragon 870, but Weinbach didn’t specify this. In any case, it sounds like Whitechapel isn’t quite a top-end chipset if this information is right. It may have the edge in some areas though, with the focus apparently being on AI and machine learning, which could among other things benefit photography.",
    "The chipset is apparently being made by Samsung using a 5nm process (the same process as the Snapdragon 888 and Samsung’s own Exynos 2100), and it’s not the only aspect of the Pixel 6 range that Weinbach detailed.",
    "The Google Pixel 6 Pro will apparently have a 120Hz QHD screen, plus a 5,000mAh battery, an in-screen fingerprint scanner, and mmWave 5G (presumably in addition to sub-6GHz, meaning it would support most 5G bands).",
    "The standard Pixel 6 meanwhile is said to have a smaller flat screen with a 120Hz refresh rate, and a smaller battery. The two phones are also said to have a new, larger main camera sensor.",
    "Weinbach didn’t go into any other spec details, but previous leaks suggest a 6.67-inch curved AMOLED screen on the Pixel 6 Pro and a 6.4-inch flat screen on the Pixel 6, with the Pro model apparently also having a 50MP main camera, an 8MP periscope one with 5x optical zoom, and an ultra-wide one.",
    "On the design front, the Google Pixel 6 will apparently come in a peach, sand and pink three-tone color scheme, as well as a silver and black model, and a green option. These colors are at odds with ones we’ve seen in unofficial renders though.",
    "Apparently the Pixel 6 range will probably land in October, but it could get pushed to November if there’s a chipset shortage.",
    "That’s all on the Pixel 6, but Weinbach also had a bit to say about some other upcoming Google products. For one thing, the Pixel Watch will apparently land alongside the phones, and is likely to use the same 5nm chipset as is rumored for the Samsung Galaxy Watch Active 4.",
    "The Google Pixel 5a meanwhile will apparently land in August and will probably cost more than the Pixel 4a – a phone which launched for $349 / £349 / AU$599. That said, the source didn’t specify whether the Pixel 5a will also be more expensive than the $499 / £499 / AU$799 Pixel 4a 5G. We’d take all of this with a pinch of salt for now anyway, but Weinbach is a fairly solid source.",
    "Via Phone Arena"
  ],
  "headers": {
    "3": "Other specs and other Pixel products"
  },
  "links": {
    "Google Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "codenamed Whitechapel": "https://www.techradar.com/news/google-pixel-6-rumor-hints-at-a-very-apple-like-move",
    "Mobile Tech Podcast": "https://worldpodcasts.com/google-i-o-2021-recap-poco-m3-pro-5g-plus-apple-m1-imac-and-ipad-pro-reviews-with-max-weinbach-of-android-police/",
    "Snapdragon 888": "https://www.techradar.com/news/qualcomm-snapdragon-888",
    "unofficial renders": "https://www.techradar.com/news/google-pixel-6-renders-show-the-massive-redesign-the-range-needs",
    "Pixel Watch": "https://www.techradar.com/news/google-pixel-watch",
    "Samsung Galaxy Watch Active 4": "https://www.techradar.com/reviews/samsung-galaxy-watch-4-review",
    "Google Pixel 5a": "https://www.techradar.com/reviews/google-pixel-5a-review",
    "Pixel 4a": "https://www.techradar.com/reviews/google-pixel-4a",
    "Pixel 4a 5G": "https://www.techradar.com/reviews/google-pixel-4a-5g-review",
    "Phone Arena": "https://www.phonearena.com/news/google-pixel-6-whitechapel-performance-camera-sensor_id132299"
  }
}