{
  "source": "https://www.techradar.com/news/the-feature-googles-new-nest-cam-is-missing-but-desperately-needs",
  "title": "The feature Google’s new Nest Cam is missing but desperately needs",
  "category": "smart-home",
  "updated": "2021-08-06T09:26:52Z",
  "author": "carrie-ann-skinner",
  "summary": "Opinion: color video at night should have been a given",
  "article": [
    "The newest Google Nest Cam has finally been unveiled following months of anticipation after Google admitted stock of its Nest IQ camera were dwindling but a new model would be launched in 2021.",
    "The Google Nest Cam (battery) is unsurprisingly powered by a rechargeable battery, although it can also be hard wired if you prefer. It also builds on Google’s previous home security cameras by being able to recognize vehicles and animals as well as people, which can also be found on the Google Nest Doorbell (battery) that was announced at the same time.",
    "While we’re thrilled that the Nest Cam can now be battery-operated as well as mains powered, making it far more flexible in terms of where the weather-proof home security camera can be installed, there is one feature we think the camera desperately needs: color video at night.",
    "Footage captured by home security cameras, including Google’s new Nest Cam, is recorded in color during the day, which means you can easily identify small details in the video. However, at night, many home security cameras rely on night vision when it’s dark, which can only record footage in black and white. This means it’s not possible to gain an accurate picture, particularly if the recording was triggered by an intruder to your property.",
    "Initially, this may not seem like an issue but, if the worst does happen, it can render the footage useless in helping track down the perpetrator, as my own parents discovered.",
    "While away on holiday, they suffered an attempted break in of their property at 4am in the morning. Fortunately, the intruders weren’t successful in entering their home, and the whole incident was captured on their home security camera. However, the UK police declined to review the footage because it was in black and white, saying it couldn’t offer useful information when it came to identifying the suspects. Had that footage been in color, it may well have been a different story.",
    "Some home security camera manufacturers, including Arlo and Ring are tackling this issue by including LED spotlights in their devices, which trigger automatically when motion is detected. The additional light means the camera can record footage in color even at night rather than relying on black and white night vision.",
    "Cost can be a factor when it comes to including LED spotlights in home security cameras, and it’s not often seen in entry-level devices. However, at $179.99 / £179.99 /AU$329, the Google Nest Cam (battery) is a mid-range device and the same price point as Ring’s Spotlight Cam, which is also a battery-operated weatherproof security camera but includes a built-in light.",
    "Similarly, Arlo manages to get an LED in its Arlo Essential Spotlight Cam, which is priced at $129.99 / £129.99 / AU$229.99, so we’d be surprised if the omission of color video at night is down to the price of the device.",
    "The Google Nest Cam (battery) wasn’t the only home security camera the brand debuted at the launch. It will also offer the Nest Cam Floodlight, which sees two flood lights nestled either side of the camera, arriving later this year for $279.99 / £269.99 (around AU$370). This means the camera will offer color night vision, but this is only available as a mains-powered camera and can’t be battery operated - so it still can’t compete with Arlo and Ring’s battery-powered cameras.",
    "In our opinion, unless Google can rectify this issue, they’re in danger of losing out to competitors such as Arlo and Ring."
  ],
  "headers": {
    "3": "Seeing in color",
    "7": "Keeping up with the competition"
  },
  "links": {
    "Google Nest Cam": "https://www.techradar.com/reviews/google-nest-cam-battery-review",
    "Google Nest Doorbell (battery)": "https://www.techradar.com/news/google-nest-doorbell-battery",
    "Ring’s Spotlight Cam": "https://www.techradar.com/reviews/ring-spotlight-cam",
    "Arlo Essential Spotlight Cam": "https://www.techradar.com/reviews/arlo-essential-spotlight-review"
  }
}