{
  "source": "https://www.techradar.com/news/2020-ipad-pro-199-slashed-off-price-fantastic-deal-amazon",
  "title": "The 2020 iPad Pro gets $199 slashed off price in fantastic deal from Amazon",
  "category": "computing",
  "updated": "2021-05-12T15:07:59Z",
  "author": "mackenzie-frazier",
  "summary": "The Apple iPad Pro hits record-low price at Amazon",
  "article": [
    "Thanks to the release of the 2021 Apple iPad Pro, you can now find fantastic deals on last year's model, and we've spotted the lowest price we've seen yet at Amazon. For a limited time, you can get the 256GB iPad Pro on sale for $900 (was $1,099) when you apply the additional $99 savings at checkout. That's the best deal we've found for the powerful tablet and $50 less than the record-low Black Friday price.",
    "Apple's feature-rich iPad Pro features a stunning 12.9-inch edge-to-edge Liquid Retina display and an impressive camera and speaker system. Perfect for students, the lightweight iPad Pro delivers more power than most laptops by offering an A12Z Bionic chip and 256GB of storage. You're also getting Face ID for secure authentication and Apple Pay, and a 10-hour battery life. As we've mentioned above, this the lowest price we've found for the 2020 iPad Pro and a fantastic deal for a powerful tablet with plenty of storage. The additional savings from Amazon is a limited-time promotion, so you should snag this bargain now before it's too late.",
    "You can see more of the best cheap iPad deals and if you're looking for something with less power you can also see the best cheap Amazon Fire tablet deals and sales.",
    "You can also see more offers with our roundup of the best Memorial Day sales: deals from Home Depot, Best Buy, and more."
  ],
  "headers": {
    "1": "iPad Pro deal",
    "2": "More iPad deals"
  },
  "links": {
    "on sale for $900": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fdp%2FB0862HNWGK%3Fth%3D1%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-1119937612888671000-20",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2018",
    "best cheap iPad deals": "https://www.techradar.com/deals/best-cheap-ipad-deals-sales-prices",
    "best cheap Amazon Fire tablet deals and sales": "https://www.techradar.com/deals/the-best-cheap-amazon-fire-tablet-deals",
    "best Memorial Day sales": "https://www.techradar.com/news/Memorial-day-sales-deals-2021"
  }
}