{
  "source": "https://www.techradar.com/news/witcher-season-2-teaser-shows-off-brand-new-monster-as-release-date-nears",
  "title": "Witcher season 2 teaser shows off brand new monster as release date nears",
  "category": "entertainment",
  "updated": "2021-12-02T15:49:58Z",
  "author": "tom-power",
  "summary": "More monsters, more slow-mo",
  "article": [
    "A new teaser has dropped for The Witcher season 2, and it's got our hearts a-flutter. Henry Cavill once again heroically faces down a monstrous beast – and it's nothing like you've seen in the show before.",
    "\"Meet. The. Myriapod.\" says @witchernetflix, with a brief 18-second tease that shows Cavill – well, Geralt – facing off against a towering skeleton centipede creature with an exposed rub cage what looks like a ram's skull on its head. Part Pan's Labyrinth, part oversized insect, the Myriapod looks to raise the stakes for Geralt – shown using the Quen sign to block the creature's strikes.",
    "There are certainly some interesting tidbits even in this short video, though. Geralt's sword appears to be glowing red, suggesting some kind of magical augmentation – and some Twitter users are already suggesting we'll see the Runewright (from Witcher 3's DLC Hearts of Stone) or a similar character make an appearance in the series.",
    "Thanks, GamesRadar.",
    "The official trailer for The Witcher season 2 landed in late October, packed full of the kind of fantasy-horror infused action we loved in the first season.",
    "But until the long-anticipated, much-delayed TV series returns – on December 17 – we'll have to survive on these little scraps and reveals to sustain our excitement. Given the somewhat tepid reception of Netflix's live-action Cowboy Bebop adaptation, we're keen to see Netflix regain some face – thought the staggering success of its South Korean dramas such as Squid Game and Hellbound means even flop shows shouldn't be too much of an issue.",
    "The Witcher's second season will see Geralt of Rivia (Henry Cavill) watch over Princess Ciri (Freya Allen) following the fallout from the season 1 finale. The titular character brings Ciri to his childhood home of the Witcher training fortress Kaer Morhen but, unsurprisingly, it seems that the duo won't be as safe in this hideout as Geralt initially thinks.",
    "Not only must he keep Ciri safe from the world's numerous monsters and other antagonists, Geralt must also protect her from something else entirely: the mysterious power that Ciri possesses.",
    "Check out the trailer below:",
    "And if you're looking for a decent TV screen to binge The Witcher and your other Netflix shows, head to our Black Friday TV deals guide to see what's going in today's ongoing sales."
  ],
  "headers": {
    "4": "A tease of what's to come"
  },
  "links": {
    "The Witcher season 2": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "already suggesting": "https://twitter.com/xathrya/status/1463902079219474447",
    "GamesRadar": "https://www.gamesradar.com/the-witcher-season-2-clip-sees-geralt-going-up-against-a-terrifying-new-monster/",
    "much-delayed TV series": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "staggering success of its South Korean dramas": "https://www.techradar.com/news/after-squid-game-netflix-is-changing-how-it-measures-a-shows-popularity",
    "Netflix shows": "https://www.techradar.com/best/best-netflix-shows",
    "Black Friday TV deals": "https://www.techradar.com/black-friday/tv-deals"
  }
}