{
  "source": "https://www.techradar.com/news/the-best-ps4-pro-games-push-your-console-to-its-4k-hdr-limits",
  "title": "The best PS4 Pro games: push your console to its 4K HDR limits",
  "category": "gaming",
  "updated": "2021-12-06T16:12:28Z",
  "author": "gerald-lynch",
  "summary": "The dazzling titles that make the most of 4K HDR on the PS4 Pro",
  "article": [
    "When it launched, Sony's PS4 Pro was the best way to see the PS4’s fantastic library of games looking its best in 4K. That’s changed now that the more powerful PS5 has launched but that’s not to say that the PS4 Pro isn’t a great system and a step up from the standard PS4.",
    "But when it comes to stocking up on new PS4 Pro games, it's worth doing your research. There are a lot of PS4 Pro games on offer and some will take advantage of the console's 4K HDR tech more than others. Not all PS4 Pro games are created equal.",
    "The thing is, even calling them PS4 Pro games isn’t entirely accurate. Sony mandated, well into the PS4 Pro's life cycle, that all PlayStation 4 games should be able to work on both the oldest and newest PS4 consoles.",
    "What that means is that developers have had to get creative in order to make a great experience that'll scale to both machines. This endeavor is something that some seem to have been able to manage better than others – some developers merely use it to firm up the performance of titles that stutter on the less powerful, older hardware.",
    "However, let's not focus on the missteps. Instead, if you'd like to take advantage of the PS4 Pro's power to get resolutions as sharp as Nathan Drake's rapier wit or your frame rates as swift and smooth as Sypro's glide then these are the games that will serve you best.",
    "The PS4's swan-song, Ghost of Tsushima is a fitting end for the PS4 generation – and proof that there's still loads of life left in the PS4 Pro despite the PS5 upstart now looming over the horizon.",
    "Taking on the role of wandering samurai Jin Sakai, you're going to have to use your blades and your wits to force back an invading mongol horde from the shores of your home, Tsushima island. It's a truly beautiful game, with developers Sucker Punch taking its cues from samurai cinema maestro Akira Kurosawa to build a superbly-realised feudal Japanese setting.",
    "When played on a PS4 Pro using the \"Better Frame Rate\" mode, the newer console and the base PS4 both render at a native resolution of 1920x1080, with a locked 30fps frame rate. The PS4 Pro in \"Higher Resolution\" mode pushes out a resolution of 3200x1800 using the Pro's checkerboard rendering, while also offering downsampling when outputting at 1080p, improving performance on older screens.",
    "However you decide to play though, Tsushima is a real treat on the eyes, with lush forests and golden sunsets to enjoy. Oh, and a good smattering of blood, too.",
    "Death Stranding had us worried for a bit. When Kojima Productions' first title was announced back at E3 2016, it did so to a confused and excited crowd. And the path to launch didn't see these feelings change much – they just swayed more into the confusion side.",
    "We seen bottled babies, sea otter costumes and even the appearance of Conan O'Brien, and every new trailer filled us more with fear than hype. But it was all worth it.",
    "Death Stranding is an incredible title that is equally beautiful and unique - especially when played on the Pro. Without giving away too much, the premise is that you step into the shoes of deliveryman Sam Bridges (played by Norman Reedus) who delivers special cargo in the wake of the Death Stranding - a mysterious phenomenon that wiped out many innocent lives. But obviously, it's not all that simple.",
    "Death Stranding is something to be experienced. It's definitely an essential PS4 Pro game - if not the essential PS4 Pro game.",
    "Check out our full Death Stranding review.",
    "This was the most hotly-anticipated (and probably the best) games of 2018. Proving that Rockstar has once again pulled it out of the bag with Red Dead Redemption 2.",
    "A giant western open world epic, it lets you live the cowboy life, riding horses into the sunset, saddling up with a posse and brawling your way through every bar in the old West. It has Rockstar's signature attention to detail, with the 4K capabilities of Sony's PS4 Pro console bringing the era to life.",
    "However, there's still some work to be done on Red Dead 2's HDR offering, which seems to be using a system that doesn't use the high dynamic range setting to its full potential. While its 4K detail is stunning, an update to improve the HDR tech would make this a real stand-out, eye-candy showcase for all PS4 Pro owners. Either way, it's a monumental game that should not be missed.",
    "Check out our Red Dead Redemption 2 Easter Egg guide.",
    "Assassin's Creed Odyssey is stunning as it is, but add in PS4 Pro enhancements and it's truly a magnificent looking game.",
    "Assassin's Creed Odyssey is the most recent edition to the epic Assassin's Creed RPG franchise. Odyssey is set during the Peloponnesian War and sees you stepping into the sandals of either Alexios or Kassandra as they try to uncover the truth about their history while navigating the turbulent world of Ancient Greece as a mercenary.",
    "Odyssey is a graphically stunning PS4 game which will take you to the heart of Ancient Greece – easily securing it a place in our collection of the best PlayStation 4 games. Just make sure you have the time to play it because there's over 100 hours of content to enjoy here.",
    "Check out our Assassin's Creed Odyssey review diary for more.",
    "Spider-Man on PS4 Pro is absolutely gorgeous - even if it's not native 4K. When played on Sony's ultra powerful console, Spider-Man is able to achieve a native resolution of 1440p at a rock-solid 30fps framerate, which is then upscaled to 4K. This impressive feat is possible thanks to dynamic resolution scaling that will raise or lower the level of detail depending on how frantic the action is.",
    "That said, before you go and bemoan the fact that it's 30 frames per second - the game looks absolutely gorgeous and plays beautifully on the console. In our time with the game, we barely noticed the lower framerate and the uprezzed visuals more than made up for it in the long run.",
    "If you need a colorful, HDR-ready showcase for the system, this is it.",
    "Need more info? Don't miss our full Spider-Man review.",
    "No Man's Sky is a love-it-or-hate-it kind of game. It serves up a near-infinite, procedurally-generated universe to explore, with unique biomes and aliens to discover. For some that's ridiculously exciting. For others it's a bore-fest.",
    "Since its underwhelming launch, though, Hello Games has created plenty of updates for the game which have seen it expand way beyond what it first was. Many have found their opinions changing and player numbers have continued to grow. It's not a new game, but it now offers a lot more compared to when it was first released, including character customization, a long-awaited multiplayer mode, VR support and story-driven events for players to take part in.",
    "Read our guide to everything new to No Man's Sky Next and why now is the perfect time to begin your space odyssey.",
    "Easily one of the most visually stunning games on the PlayStation 4 (or on any console for that matter), the new God of War takes the series to epic new levels when it comes to presentation. The game looks incredible when played on a standard PS4 console, demonstrating just how absurdly talented the team at SIE Santa Monica Studio when it comes to optimisation. However, when played on a PS4 Pro, the game kicks things up a notch.",
    "In the game's settings, you'll find two graphics modes: favor resolution and favor performance. Naturally, the former makes the game look especially crisp and clean, bringing the resolution up to checkerboard 4K and holding steady at around 30fps, while the latter displays at 1080p and sticks close to around 60fps for the majority of the time.",
    "As cinematic as it is, we had no problem playing God of War on the favor resolution setting, as we were able to enjoy the incredible detail put forth by the game — utilizing the additional resolution to see pores and lines on characters' faces, and the insane level of artistry in their costumes and armor, just makes the whole game even more impressive (if you ask us). It also helps to makes the game's HDR presentation even more eye-popping.",
    "Check out our full God of War review.",
    "Considered one of the greatest video games of all time, Shadow of the Colossus is back and better than ever on PS4, with its Pro update giving the game some big enhancements when it comes to visuals and performance.",
    "Shadow of the Colossus offers two graphical settings: 'Performance Mode' offers smooth gameplay targeting 60 FPS at 1080p, while the 'Cinematic Mode' plays at a higher 'Dynamic 4K' resolution with enhanced textures, all while holding a solid 30 FPS.",
    "Regardless of the mode you choose, the team at Bluepoint have brought some other tasty visual treats to their remake of the Japanese classic, including a beautiful new lighting engine (which looks incredible when combined with the game's HDR support) and some advanced rendering techniques, which make things like fur on the Colossi look especially realistic.",
    "Simply put, the enhancements offered by the PS4 Pro version make this the definitive presentation of Shadow of the Colossus, offering a visual experience unlike any other.",
    "Check out our full Shadow of the Colossus review.",
    "Though the first Destiny game did not end up receiving a PS4 Pro update, much to the chagrin of its fan base, its sequel has come roaring out of the gate with some terrific graphical improvements.",
    "Using checkerboard rendering to achieve a resolution of 2160p, Destiny 2 looks astonishing on PS4 Pro. Admittedly, developer Bungie employs a few tricks to display its game at 4K, including dynamic resolution scaling on the horizontal axis, meaning that the game will dynamically shift its horizontal pixel count from 3840 to 3072 (but seriously though, you won't even notice).",
    "At launch, Destiny 2 did take advantage of the PS4 Pro's high-dynamic-range (HDR) capabilities, though that has since been rectified, with the game sporting a colour palette that makes its predecessor look black and white by comparison.",
    "One thing in Destiny 2 that doesn't get enhanced when played on the PS4 Pro is its framerate, with the game locked to 30fps across all consoles. While we would've liked to have seen an optional high framerate mode included, Destiny 2 is still a must own title for those who want to push their PS4 Pro to its limit.",
    "Check out our guide to the tips and tricks you need to know for Destiny 2.",
    "If you’re looking for a PS4 Pro showstopper, Ratchet and Clank is a great place to start. It’s like playing a Pixar movie, with its colorful visuals, loveable characters and world-hopping sci-fi plot.",
    "And, it’s actually a great case for the merits of not-quite native UHD 4K on the PS4 Pro. Rather than pumping up the resolution count to its maximum, Ratchet and Clank makes clever use of a technique called Temporal Injection. It’s essentially a very efficient and fancy upscaler, pushing the image quality up to a 2160p standard and removing jaggies without the strain of a native resolution push. At a capped, consistent 30fps and with HDR support switched on, you’re left with a blisteringly beautiful shooter that looks out of this world.",
    "Sure, it’s an older title getting a PS4 makeover, but Rez was always made for a silky visual set-up. Running at a native 4K / 60fps on Sony’s latest console, it’s an astonishing, trance-inducing, Tron-like shooter that’s never looked better than on the PS4 Pro. That it’s one of the best music-focused games of all time is a bonus, too, we suppose...",
    "And, if you’re one of the lucky few to have that ultimate PS4 Pro / PS VR combo, then you’d do right by your eyes, your gear and your endorphin levels by firing up Rez Infinite on Sony’s virtual reality headset too, where it’s a subtly smoother experience.",
    "Now here’s an interesting one. While it doesn’t offer native 4K throughout nor HDR, Diablo 3 shows Blizzard cleverly taking advantage of the PS4 Pro’s additional horsepower. It’s using a dynamic resolution scaler to allow the dungeon crawler better fidelity on consoles and improved lighting techniques, while maintaining a solid 60fps framerate.",
    "When you’re in simple interior sections like the tavern in New Tristram or Deckard Cain’s house, you’re hitting that native 4K resolution, but when you’re more chaotic locales it can fall anywhere between 1080p and that top-end 3840 x 2160 wonder. For the most part it’s dramatically better than 1080p, scaling imperceptibly in motions and maintaining a high framerate to boot. It’s slick, and advanced bloom effects and ambient occlusion seal the deal to make it onto this list.",
    "Here's everything we know about Diablo 4.",
    "Sony’s smash hit conclusion to Nathan Drake’s globe-trotting adventures makes good use of the PS4 Pro, though don’t expect it to massively alter the already sumptuous feel of the original.",
    "The PS4 Pro update for Uncharted 4: A Thief’s End pushes the resolution up to 1440p, which is a marked improvement over the original’s full HD limits, even if the intense action makes a 30fps target the goal. What is appreciated though is the HDR implementation - traipsing through old tombs by lamplight, or seeing the sun filter through dilapidated shanty town and jungle trees looks astonishing on the PS4 Pro.",
    "Another resolution scaler, and another great way to show off the fidelity of your UHD screen thanks to its HDR features, too. Deus Ex Mankind Divided sits somewhere between 1800p and 2160p, using checkerboard upscaling to dynamically tweak the resolution depending on what’s happening on screen.",
    "For the most part, it’s a wonderful experience, with the stealth-cyborg ‘em up looking gloriously futuristic - particularly in its Blade Runner esque slums where the HDR lighting effects come into full force. However, some stuttering and a recent revert to an adaptive v-sync in an attempt to ease the stuttering mar an otherwise smooth upgrade.",
    "This one’s been a bit of a poster boy for the PS4 Pro hardware, and it’s easy to see why - with First Light previously a PS Plus giveaway, many prospective Pro owners will already have a high-quality test-subject to put their new machines through its paces.",
    "Both Infamous Second Son and spin-off First Light are using a checkerboard effect rather than native resolution jumps, but you’d be hard pressed to notice the difference in the way it’s implemented here. Pushed to a not-quite-but-pretty-much UHD resolution of 1800p, the open world superhero title shimmers with HDR lighting effects, bringing fingertip flames and neon powers to life on premium displays.",
    "Rise of the Tomb Raider was a good-looking game on PS4 Pro but 2018's Shadow of the Tomb Raider is even better. In the final instalment of the reboot trilogy, PS4 Pro players have the choice to prioritize either resolution or framerate.",
    "Choosing the former displays the game in eye-popping 4K at 30FPS while the latter drops the resolution to a (still admirable) 1080p so that you can get a smooth 60FPS. With its stunning set pieces and fast-moving action, there isn't really a wrong choice when it comes to Shadow of the Tomb Raider.",
    "Check out our full Shadow of the Tomb Raider review.",
    "The Outer Worlds is a space romp from Obsidian Entertainment, creators of the Fallout series, that looks great on the PS4 Pro.",
    "Garnering rave reviews, this RPG is a fantastic adventure that gets out from under the shadow of the Fallout games and stands all on its own with a distinctive humor and plot. And if you're going to go all the way to space, you might as well see it looking its very best.",
    "Although it doesn't run native 4K, the PS4 Pro does upscale this title so you'll still get to see the all of the game's worlds looking their bright and colorful best on your console.",
    "Check out our tips for surviving your first few days in The Outer Worlds.",
    "A full-on enhancement for the most ambitious Final Fantasy game yet, Square-Enix has yet to finish tinkering with PS4 Pro performance here, but it’s still looking a treat. Provided you can stomach a slightly jittery frame-rate (nowhere near game-breaking, we assure you), Final Fantasy 15 uses a checkerboard 1800p upscale, along with improved shadows and texture filtering. It’s a feast for the eyes.",
    "And, if you’ve access to a HDR TV, it gets even better. Square-Enix makes full use of the high dynamic range afforded the PS4 Pro, making for blisteringly bright desert sun lights and deep dark cavernous dungeon blacks.",
    "Think Jurassic Park, but with robot dinosaurs, and you're on your way to the breathtaking action that Horizon: Zero Dawn offers.",
    "From the minds behind the Killzone series, the open world action adventure was a revelation when it launched in early 2017, being one of the most sophisticated sandbox titles available to PS4 owners. From sneaky stealth sections to gigantic face-offs with hulking mecha-rexes it got the heart pumping.",
    "But perhaps most impressive was its visuals. It particularly shone on the PS4 Pro, where its 4K HDR visuals brought the flora and fauna of for a post-human future dazzlingly to life. It's a PS4 Pro showstopper, and a great way to show off the machine's capabilities.",
    "Strangely enough, there wasn’t a huge amount of hype about Hitman 2 before its official release. However, much like Agent 47 himself, the game sneaked up on us and quickly became our favorite action game of 2018.",
    "Admittedly, Hitman 2 doesn’t do much to drastically change the series’ formula (except for the introduction of multiplayer Ghost mode), but we found that’s what we love about it - plus, assassinating drug lords in Colombia with poison is always a recipe for a good time.",
    "Which games look best on PS4 Pro? It's much easier to find the best PS4 Pro games these days, because many PS4 titles are now optimised for Sony's higher-end console. Our list of games showcase the PS4 Pro must-haves all of which really offer up the best of what the powerful console and your 4K HDR TV were made for.",
    "Which PS4 games are 4K? Most on this list are, but to give you a quick rundown of our favorites, there's all the latest Assassin's Creed games, all the latest Call of Duty games, Detroit: Become Human, The Elder Scrolls V: Skyrim, Farcry 5, FIFA 19, God of War, Hitman, Horizon Zero Dawn, Mass Effect: Andromeda, Spider-Man, The Last Guardian, The Last of Us and Unchartered 4: A Thief's End. Phew. There are some more, but they're most of the big names.",
    "Can you play PS4 games on PS4 Pro? Yes. It's just if the game has been optimized for the Pro, you'll get much better visuals.",
    "Do I need a 4K TV for PS4 Pro? Yes. You just won't get the 4K TV output. So if you want a new console soon and plan on upgrading your TV soon too, it's worth it."
  ],
  "headers": {
    "5": "Ghost of Tsushima",
    "9": "Death Stranding",
    "14": "Red Dead Redemption 2",
    "18": "Assassin's Creed Odyssey",
    "22": "Marvel's Spider-Man",
    "26": "No Man's Sky",
    "29": "God of War",
    "33": "Shadow of the Colossus",
    "38": "Destiny 2",
    "43": "Ratchet and Clank",
    "45": "Rez Infinite",
    "47": "Diablo 3",
    "50": "Uncharted 4: A Thief's End",
    "52": "Deus Ex Mankind Divided",
    "54": "Infamous Second Son",
    "56": "Shadow of the Tomb Raider",
    "59": "The Outer Worlds",
    "63": "Final Fantasy 15",
    "65": "Horizon: Zero Dawn",
    "68": "Hitman 2",
    "70": "PS4 Pro games FAQ: quick questions answered"
  },
  "links": {
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "Death Stranding review": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-release-date-news-and-rumors",
    "Red Dead Redemption 2 Easter Egg guide": "https://www.techradar.com/how-to/red-dead-redemption-2-easter-egg-guide-where-to-find-the-best-secrets",
    "Assassin's Creed Odyssey": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "Assassin's Creed Odyssey review diary": "https://www.techradar.com/news/assassins-creed-odyssey-review",
    "Spider-Man review": "https://www.techradar.com/news/spider-man-review",
    "everything new to No Man's Sky Next": "https://www.techradar.com/news/no-mans-sky-next-8-reasons-why-now-is-the-time-to-continue-your-space-odyssey",
    "God of War": "https://www.techradar.com/news/god-of-war-review",
    "Shadow of the Colossus": "https://www.techradar.com/news/shadow-of-the-colossus-review",
    "the tips and tricks you need to know for Destiny 2.": "https://www.techradar.com/news/destiny-2-tips-and-tricks-everything-you-need-to-get-started",
    "Diablo 4": "https://www.techradar.com/news/diablo-4-news-release-date-trailers-rumors",
    "Uncharted 4: A Thief’s End": "https://www.techradar.com/news/gaming/uncharted-4-a-thief-s-end-review-1320412",
    "Shadow of the Tomb Raider review": "https://www.techradar.com/news/shadow-of-the-tomb-raider-review-a-fitting-end-to-lara-crofts-redemptive-reboot",
    "our tips for surviving your first few days in The Outer Worlds": "https://www.techradar.com/news/the-outer-worlds-gameplay-guide-5-tips-for-surviving-your-trip-to-halcyon",
    "Horizon: Zero Dawn": "https://www.techradar.com/news/horizon-zero-dawn-review",
    "Hitman 2": "https://www.techradar.com/news/hitman-2-hands-on-dropping-drug-lords-in-colombia",
    "favorite action game of 2018": "https://www.techradar.com/news/games-of-the-year-2018-techradars-favorite-xbox-one-ps4-nintendo-switch-and-pc-titles"
  }
}