{
  "source": "https://www.techradar.com/news/intel-unveils-multi-billion-dollar-european-tech-expansion",
  "title": "Intel unveils multi-billion dollar European tech expansion",
  "category": "computing",
  "updated": "2021-07-12T13:11:15Z",
  "author": "mayank-sharma",
  "summary": "Semiconductor giant wants to help EU double its semiconductor production by 2030",
  "article": [
    "Intel has said its investment in a planned $20 billion-worth semiconductor fabrication units could be spread across several EU member states, as the chip giant continues to lobby to win the substantial financial support on tap from the EU.",
    "The financial support is part of the EU’s efforts to help its member states double semiconductor production to 20% of the global market by 2030, the Financial Times reports.",
    "The details of Intel’s spending emerged soon after its CEO Pat Gelsinger met with French president Emmanuel Macron and Italian prime minister Mario Draghi to discuss the global chip shortage.",
    "In addition to financial support, Intel is also reportedly on the hunt for a site of roughly 1000 acres with developed infrastructure that can support the fabrication units.",
    "Speaking to FT, Greg Slater, Intel vice-president of global regulatory affairs suggested that Intel could spread the fabrication facilities and services to support the chip production process across several member states.",
    "“We are well placed to make this an ecosystem-wide project, not just a couple of isolated paths in one member state. We do believe that this is a project that will benefit Europe at large,” Slater told FT.",
    "Expanding on the idea, Slater said that the company could perhaps fabricate the chips on one site and use another for packaging, while research and development could be shared across the EU.",
    "Intel plans to kick things off with a couple of fabrication units at a total cost of some $20 billion, Slater confirmed. Intel has made a similar commitment in the US as part of revamped IDM 2.0 strategy.",
    "Via Financial Times"
  ],
  "headers": {
    "4": "Lifting all boats"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "global chip shortage": "https://www.techradar.com/news/even-intel-thinks-the-global-chip-shortage-could-last-years",
    "similar commitment in the US": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "IDM 2.0 strategy": "https://www.techradar.com/news/intel-investing-billions-in-us-manufacturing-plant",
    "Financial Times": "https://www.ft.com/content/40eda20e-17d8-4368-bdeb-a2d1b151bc34"
  }
}