{
  "source": "https://www.techradar.com/news/western-digital-unveils-new-sandisk-professional-line-up",
  "title": "Western Digital unveils new SanDisk professional line-up",
  "category": "computing",
  "updated": "2021-05-27T13:03:36Z",
  "author": "mayank-sharma",
  "summary": "SanDisk Professional series will retain the G-Drive moniker",
  "article": [
    "Western Digital (WD) has unveiled its SanDisk Professional brand of premium disk drives and storage solutions designed for professional content creators.",
    "The SanDisk Professional line kicks off with 16 products, which the company claims deliver professional-grade performance while offering enterprise-class reliability.",
    "“Our customers trust their life’s work to our products. We design and create solutions for every stage of the creative process, harmonizing our customers’ experience so they can save time and focus more on creating,” said WD’s senior VP and GM of the Consumer Solutions business, Jim Welsh.",
    "Significantly, WD has revealed that its G-Technology line of products will be brought under the SanDisk Professional umbrella.",
    "G-Technology is WD’s professional-grade brand that is widely used by cinematographers. The company hasn’t shared its reasoning behind handing over one of its most iconic brands.",
    "That said, WD did share that while the main brand name will change, the drives will still retain the G-Drive moniker. Also staying are the existing G-Drive range of products.",
    "WD highlights four products that will make their debut in the new SanDisk Professional brand.",
    "The first of these is the PRO-CINEMA CFexpress VPG400 card with minimum consistent video recording speeds of 400MB/s.",
    "Then there’s the PRO-READER series of devices that supports the USB-C interface, and are capable of SuperSpeed USB 10Gbs speeds. These readers will work with virtually all kinds of media from CFast and CFexpress to microSD and SD.",
    "You can integrate up to four of these readers into the four-bay docking station called PRO-DOCK 4 that includes Thunderbolt along with USB-C and USB-A interfaces.",
    "The last of the new products is a 4TB G-DRIVE ArmorLock Encrypted NVMe SSD. The drive comes out early in June, while the other products will roll out later in the summer.",
    "Via AnandTech"
  ],
  "headers": {
    "6": "New products"
  },
  "links": {
    "disk drives": "https://www.techradar.com/reviews/pc-mac/pc-components/storage/disk-drives-hdd-ssd",
    "microSD": "https://www.techradar.com/news/best-sd-and-microsd-memory-cards",
    "SD": "https://www.techradar.com/best/best-sd-cards",
    "SSD": "https://www.techradar.com/news/best-solid-state-drives-ssds",
    "AnandTech": "https://www.anandtech.com/show/16706/western-digital-unveils-multimediafocused-sandisk-professional-portfolio"
  }
}