{
  "source": "https://www.techradar.com/news/archived-chats-in-whatsapp-now-finally-stay-archived",
  "title": "Archived chats in WhatsApp now finally stay archived",
  "category": "phones",
  "updated": "2021-07-28T10:20:47Z",
  "author": "daryl-baxter",
  "summary": "Archived now means archived",
  "article": [
    "Another week has brought another new feature for WhatsApp, this time finally allowing archived chats to stay in the archived folder, without having to see them in the main chat section ever again.",
    "With multi-device support in heavy testing and high-resolution photos also being available to a set number of users, WhatsApp is looking to be the messaging app to better rival Signal, iMessage and more, making it easier for existing users and tempting new users to switch over.",
    "There’s always that moment where you’re in a group chat and you want to silently archive it without leaving the group - however, you will find the chat rearing its unread head in the main screen, bringing further irritation.",
    "Soon though, you’ll be able to hide these forever, being part of the group but in the shadows for the foreseeable.",
    "For years now, you would swipe a chat and select Archive, moving it to another section, but as soon as a new message would arrive, it would be in your main chat, most likely reminding you of work during your week off or an event that’s yet to occur for a few months.",
    "With this feature now rolling out to everyone, a new setting will now keep these chats in the Archived section. However, if you want it to revert back to how it’s been for years, you can do the following:",
    "Check for updates on the App Store or the Google Play Store, and version number 2.21.141 should soon appear with the new Archived setting ready to use.",
    "Throughout the years of using our smart devices, we’ve all had that moment where we’ve used an app or a feature and gone, ‘If only it could do this.’ Archived chats staying archived has definitely been one of those for me.",
    "Archived chats reappearing has been an annoyance to many, myself included, where previous jobs have had group chats on WhatsApp, and when you’re on holiday, they would reappear with the daily tasks while I would be sending an image of myself to friends going down a water slide.",
    "This is yet another example of WhatsApp finally bringing out features that alleviate those small annoyances, and there’s even more to come - from multi-device support where you don’t need to rely on your phone, to using high-quality images without having the app to compress them and be rid of the detail.",
    "After the PR muddle they experienced last year regarding notifying users of privacy changes, updates like these are a great way of maintaining goodwill with their users again, to reduce those small irritations and bring out features that many have been asking for."
  ],
  "headers": {
    "4": "Archive like Keyser Soze",
    "7": "Analysis: Another ‘finally’ feature from WhatsApp"
  },
  "links": {
    "archived chats": "https://faq.whatsapp.com/android/chats/how-to-archive-or-unarchive-a-chat-or-group/?lang=en"
  }
}