{
  "source": "https://www.techradar.com/news/you-can-now-run-ios-4-as-an-app-on-your-iphone-how-to-install",
  "title": "You can now run iOS 4 as an app on your iPhone - how to install",
  "category": "computing",
  "updated": "2021-06-10T13:20:30Z",
  "author": "daryl-baxter",
  "summary": "Skeuomorphism returns",
  "article": [
    "It’s been 11 years since the debut of iOS 4 at a March event, while the iPhone 4 was announced at WWDC in the same year. Since then we’ve seen huge changes to iOS, with a flat redesign from iOS 7 and also seeing it on bigger iPhone devices.",
    "But there’s a growing nostalgia for software, as many remember what their first device was or the applications they used that inspired them to start a career out of them.",
    "iOS is in the same vein, and with this innovative app you can try out iOS 4 on your iPhone 12 Pro right now.",
    "A developer by the name of Zane has lovingly re-created a previous version of Apple’s iPhoneOS into a single app, available to be tested right now on your iPhone.",
    "Far from just being the home screen of iOS 4, everything about the old operating system has been remade into a single app called OldOS, where you can switch between Maps, Settings, Safari, Game Center and much more.",
    "It’s very surreal to use it on an iPhone 12 with a bigger screen than the 3.5 inch display that the iPhone 4 had, but it works well regardless.",
    "It’s been fully coded in Apple’s new SwiftUI language, which is a way of building and distributing apps, something that the company has been showcasing across WWDC 2021.",
    "It’s a great effort from Zane, and it does make one wonder as to whether an iPad version is on its way too, especially as he has touted it as open source, which means other developers can add even more features to OldOS if they wish.",
    "You can install the app using app testing site TestFlight, although at present the enrollment list looks to be full, so it depends on whether Zane opens up even more places to the beta program.",
    "But if you’re feeling daring, he has also posted the full source code for OldOS onto GitHub, so you can open it up in Xcode, compile it and have it run on your iPhone. Although this is really only for developer territory, unless you like a challenge for the weekend."
  ],
  "headers": {
    "4": "It’s Skeuomorphin’ Time",
    "8": "How to install OldOS"
  },
  "links": {
    "WWDC 2021": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "using app testing site TestFlight": "https://apple.sjv.io/c/221109/473657/7613?subId1=trd-us-3721265411625073000&sharedId=trd-us&u=https%3A%2F%2Ftestflight.apple.com%2Fjoin%2F67C9v9VB",
    "GitHub": "https://github.com/zzanehip/The-OldOS-Project"
  }
}