{
  "source": "https://www.techradar.com/news/iphone-12-mini-vs-iphone-se-2020",
  "title": "iPhone 12 mini vs iPhone SE (2020): Small phones, big differences",
  "category": "phones",
  "updated": "2021-12-02T11:02:05Z",
  "author": "jon-mundy",
  "summary": "Cheaper or smaller? Which is for you",
  "article": [
    "Apple may have released its largest phone ever with the iPhone 12 Pro Max, but 2020 also saw the launch of two compact crackers in the iPhone 12 mini and the iPhone SE.",
    "These two devices offer speedy components in pocket-friendly proportions, both at prices that are considerably lower than their larger siblings.",
    "However, despite these apparent similarities, the iPhone 12 mini and the iPhone SE (2020) are different in just about every way that counts. So which is the best compact smartphone for you?",
    "Apple made its second iPhone SE model available to buy on April 24, 2020, and it continues to be offered as new. Prices start from $399 / £399 / AU$679 for the 64GB model. There’s also a 128GB option for $449 / £449 / AU$759 and a 256GB option for $549 / £549 / AU$929.",
    "The iPhone 12 mini landed in shops on November 13, 2020. Prices for Apple’s smallest phone for quite some time start at $699 / £699 / AU$1,199 for the 64GB model, moving up to $749 / £749 / AU$1,279 for 128GB and $849 / £849 / AU$1,449 for 256GB.",
    "Considering both devices are available in the exact same storage options, it’s simple to make a direct price comparison. Across the options, the iPhone 12 mini comes in at $300 / £300 more expensive than the iPhone SE (2020).",
    "Hold the two phones, one in each hand, and it’s really quite remarkable to consider that they hit the market in the same calendar year, let alone six months apart.",
    "To understand the enormity of this design gap, you have to examine Apple’s distinct approach for both phones. The iPhone SE was a result of the company deliberately setting out to create an affordable phone for only the third time in its history.",
    "That explains the decision to recycle the design of the iPhone 8 from 2017. Now consider that the iPhone 8 itself launched at the end of one of Apple’s three-year design cycles, with its basic shape traceable to the iPhone 6 in 2014.",
    "The result is a deeply familiar, compact yet rounded phone, with a flabby 65.4% screen-to-body ratio. The SE sports a sizable forehead and chin, the latter of which houses Apple’s classic Touch ID home button. There’s no Face ID notch here.",
    "As small as the iPhone SE is (138.4 x 67.3 x 7.3mm and 148g), it’s actually a little larger than the iPhone 12 mini. They’re about the same thickness, but the mini is 7mm shorter, 3mm narrower, and 13g lighter.",
    "Despite this, the iPhone 12 mini display is actually larger, owing to the fact that it stretches out much closer to the edges of the phone for an 85.1% screen-to-body ratio. Talking of edges, the iPhone 12 mini’s flat rim and sharp 90-degree angles are what really sets it apart from the iPhone SE.",
    "In a sense, the iPhone 12 mini’s angular aesthetic harks back to the original iPhone SE, and the iPhone 4 before that. But Apple has greatly refined its classic industrial design language for the 2020s.",
    "This includes implementing a toughened nano-crystalline Ceramic Shield screen technology that lays on four times the drop protection of previous generations. It also involves an improved IP68 rating that enables immersion in six metres of water for up to 30 minutes. The iPhone SE comes with only an IP67 rating, which enables a dunk in one metre of water for 30 minutes.",
    "We’ve already touched upon the differences in display size between these two phones, but let’s spell things out. While the iPhone SE (2020) has a tiddly 4.7-inch display, the iPhone 12 mini has a 5.4-inch screen – which is still considered small by modern standards.",
    "Apple has managed to present more screen space on a smaller canvas by lengthening the aspect ratio (19.5:9 for the mini, 16:9 for the SE) and drastically reducing the bezel size.",
    "But the differences go way beyond the dimensions of these displays. While both phones achieve a typical brightness of around 600 nits (which isn’t particularly bright), the iPhone SE uses dated Retina IPS LCD panel technology. The iPhone 12 mini, on the other hand, utilizes a Super Retina XDR OLED panel.",
    "You’re getting a good example of the LCD format with the iPhone SE, but it still has its limitations. OLED packs much bolder, more vibrant colors, higher contrast, and deeper blacks.",
    "The iPhone 12 mini screen is also much sharper, with a resolution of 1,080 x 2,340 for a pixel density of 476ppi. With the iPhone SE you’re getting a mere 750 x 1,334 and 326ppi.",
    "Both phones are stuck with a 60Hz refresh rate – but we can let that pass in the cheaper, older iPhone SE. We had rather hoped to see a 120Hz refresh rate in the mini, so it’s something of a missed opportunity.",
    "We were very fond of the iPhone SE’s camera in our review. This singular 12-megapixel f/1.8 sensor offers the kind of reliably crisp and balanced point-and-shoot experience that has become Apple’s stock and trade – and for a knock-down price.",
    "Even with its ostensibly limited hardware (most affordable Android phones have multiple image sensors), Apple’s advanced computational photography algorithms help the SE take better shots than its 2017 heritage would suggest. We’re talking improved sharpness and more accurate color reproduction in a variety of lighting conditions compared to the pre-iPhone 11 class, although it does manifest a tendency towards overexposing in some scenarios.",
    "As good as the iPhone SE camera is for the money, the iPhone 12 mini trounces it in every respect. You’re getting two 12-megapixel sensors here, with an f/2.4 ultra-wide assisting a brighter f/1.6 wide sensor. The quality of the shots captured here is quite staggering in a phone of this size, facilitated by Apple’s A14 Bionic CPU more than any great camera hardware improvements.",
    "It’s a more flexible camera than the iPhone SE’s, too. Yes, there’s that 120-degree ultra-wide sensor to call upon, but the iPhone 12 mini also gains Night mode for all three of its cameras. While this may not appear to make much difference in good lighting, the newer phone produces far superior results when the lights dim.",
    "On the video front, both phones can shoot 4K at 60fps. However, only the iPhone 12 mini can shoot in Dolby Vision HDR, which makes footage look brighter, better exposed, and more professional.",
    "They might have only been separated by half a year, but the iPhone 12 mini and iPhone SE (2020) are a full generation apart when it comes to power.",
    "While the iPhone SE shares its A13 Bionic CPU with the iPhone 11 family, the iPhone 12 mini runs on the all-new A14 Bionic. It’s difficult to pin these things down, but the newer chip enjoys a roughly 20% advantage in the CPU department, and around a 10% advantage with the GPU.",
    "Elsewhere, the A14 packs a 16-core Neural Engine for a significant 80% boost to AI performance compared to its predecessor. It’s also worth mentioning that the iPhone 12 mini comes with 4GB of RAM, while the iPhone SE runs on 3GB.",
    "There’s plenty more performance headroom in the iPhone 12 mini, but that’s unlikely to become evident for a year or two. Everything sails along effortlessly on both phones, from 3D games to intensive image processing apps.",
    "Apple’s phones continue to be so fast relative to the kind of applications we subject them to, that you’ll have to look to future use cases to really stretch either. Looking forward, the iPhone 12 mini will without doubt perform better for longer.",
    "The iPhone SE still offers outstanding performance for the price, though. We defy you to find another $400 / £400 phone on the market that runs as smoothly.",
    "Both phones are available in the same storage options: 64GB, 128GB, and 256GB. While that seems fine in the iPhone SE, we feel it’s a little miserly in the more expensive iPhone 12 mini; 128GB should really be the new normal.",
    "One other spec advantage that the iPhone 12 mini enjoys over the SE is 5G connectivity. Coverage is still a little spotty in most countries, but where available you’ll be able to access download speeds that make your fibre broadband connection seem like a 56k dial-up modem. Until you move two metres down the road and lose your 5G signal, that is.",
    "Still, give it six months to a year and we predict that the picture will look a whole lot rosier for 5G – and for the iPhone 12 mini’s connectivity advantage.",
    "Neither phone is what you’d call blessed with outstanding stamina. A large part of that comes down to their compact size, with a mere 2,227mAh battery crammed into the iPhone 12 mini and a piddling 1,821mAh unit serving the iPhone SE.",
    "Sure enough, we noted mediocre battery life as a key flaw for both phones in our review summaries. It isn’t much of a competition, in truth – but for what it’s worth, the iPhone 12 mini comes out on top again.",
    "With the iPhone SE, we often found ourselves reaching for the charger come the evening. With the iPhone 12 mini we could typically get to our usual bedtime charge.",
    "Both phones handle low use and standby time very well. It might sound counter-intuitive, but Apple’s smartphones excel at not being used. Neither much likes being hit hard with excessive media usage, though.",
    "One additional battery-draining component with the iPhone 12 mini is its 5G antenna. When we were out and about, flitting between networks and actively using the phone a fair amount, we found ourselves needing to recharge part way through the day. Basically, you shouldn’t buy either of these phones if you’re a heavy or power user.",
    "Both phones support wireless charging, but the iPhone 12 mini also benefits from Apple’s repurposed MagSafe standard. However, you’ll need to pay extra for this magnetized charger (or one of the related cases and wallets), and it remains to be seen if it’s anything more than a gimmick.",
    "Apple turned its attention back to the compact phone market in 2020, and we’re delighted with its double effort. But despite fitting similar form factors, the iPhone 12 mini and iPhone SE are actually two very different phones.",
    "The iPhone 12 mini is far more advanced in terms of display quality, performance, and camera capabilities, and it looks much fresher too. It’s also a little tougher, and has the benefit of being able to take advantage of the fledgling 5G network.",
    "You’ll pay for those forward-thinking components, however. The iPhone SE still feels like good value to this day, offering a loosely equivalent iOS experience for $300 / £300 less.",
    "If you’re shopping for a genuinely small phone, these two handsets are all you really need to consider at present. If ‘very good’ is good enough for you, then the iPhone SE will serve you brilliantly for an affordable price. But if you demand a nigh-on compromise-free experience, then the iPhone 12 mini gives you close to the full modern iPhone experience in the daintiest of form factors"
  ],
  "headers": {
    "3": "iPhone 12 mini vs iPhone SE (2020) price and availability",
    "6": "Design",
    "14": "Display",
    "20": "Camera",
    "25": "Specs and performance",
    "34": "Battery life",
    "40": "Takeaway"
  },
  "links": {
    "iPhone 12 Pro Max": "https://www.techradar.com/reviews/iphone-12-pro-max-review",
    "iPhone 12 mini": "https://www.techradar.com/reviews/iphone-12-mini-review",
    "iPhone SE": "https://www.techradar.com/reviews/iphone-se",
    "iPhone 8": "https://www.techradar.com/reviews/iphone-8-review",
    "iPhone 6": "https://www.techradar.com/reviews/phones/mobile-phones/iphone-6-1264565/review",
    "iPhone 11": "https://www.techradar.com/reviews/iphone-11-review",
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "MagSafe": "https://www.techradar.com/best/best-magsafe-accessories"
  }
}