{
  "source": "https://www.techradar.com/news/here-are-the-top-christmas-lego-sets-we-hope-are-in-the-black-friday-sales",
  "title": "Here are the top Christmas Lego sets we hope are in the Black Friday sales",
  "category": "appliances",
  "updated": "2021-10-23T17:00:35Z",
  "author": "tom-bedford",
  "summary": "Get some festive bricks",
  "article": [
    "It's a little ominous to think about, but we're only two months out from Christmas, and once Black Friday 2021 it's the next big thing in most people's calendars. But for some, the two late-year events might tie together.",
    "We're expecting loads of Black Friday Lego deals to start cropping up... well, soon, and keep going with some Lego Cyber Monday discounts too we'll likely see reductions of about 20% to 25%, but some retailers might do bigger reductions.",
    "That means it might be the perfect time to pick up one of the many Lego Christmas sets that exist. That's right, the Danish toy company doesn't just make kits themed around popular entertainment franchises, and has loads of original sets, like some Christmas-themed ones.",
    "Some of these festive decorations are small sets that only cost you a little bit; others are pricey and gigantic builds that'll have you putting bricks together for the entirety of the holiday season.",
    "To give you ideas for the list you're going to send to Santa, we've hunted down some of the best Christmas-themed Lego sets. Hopefully, these will be discounted enough over Black Friday to bring them into our price range (or to silence that voice repeatedly saying \"no, you don't need to buy Lego\").",
    "Though this little Brick Head set doesn't seem to be able to actually crack nuts (apart from maybe weak ones), it's a cute little blocky recreation of the traditional festive icon.",
    "This is a really affordable set, perfect as a stocking-filler or if you need to buy an extra decoration for your home. It's quite small, so should be easily buildable by people of all ages, and also has a moving part (the mouth).",
    "You can check out the Lego Nutcracker listing here.",
    "Are penguins Christmassy? This one definitely is though, because it's peering curiously at a Christmas tree and presents. We can only assume the flippy mammal is at least 10 feet tall, judging by its proportions according to the tree.",
    "This is another festive decoration like the Nutcracker, and it only costs a tiny bit more, so you'd pick it up as an alternative (or extra) for that other kit. We prefer it, because penguins are great, but that's pretty subjective.",
    "You can check out the Lego Penguin listing here.",
    "This wreath is technically a 2-in-1 set, which means you can rebuild it to change it. It's your traditional door-hanging ivy wreath, but you can change it so you can lay it flat and put (Lego) candles in it too.",
    "This isn't just a green-brick circle either, because there are Lego plants adorning it, as well as a big bow - it won't be confused for a real wreath, but it looks pretty good. Plus, you can re-use it between years without worrying about it getting nasty.",
    "The set is a little bit more expensive than the ones we've mentioned previously in this guide - in fact, it's pricier than the others put together - but it's a bigger build too.",
    "You can check out the Lego Christmas Wreath listing here.",
    "Now we're onto the big builds! This is a little wintery house, complete with snow on the roof and a Christmas tree, with a little family that's presumably inspired by late-20th-century sit-coms judging by the hairstyles.",
    "As the set name suggests, there's also a Santa Minifigure - the only one from all the sets in this article, we should add - along with loads of presents. There are 1400 pieces in total, which justifies the kit's fairly high price.",
    "You can check out the Lego Santa's Visit listing here",
    "If the previous kit looked good but had too many Santas and too few elves, this is the kit for you - perhaps Santa could deliver you Santa's Workshop as a Lego set.",
    "This has four elves, the workshop itself and loads of teenie-tiny toys. Presumably, this is a set for adults, as we can't imagine younger children building that miniature ship or airplane.",
    "The building looks tasty, like it's made of gingerbread almost, and actually lights up too.",
    "You can check out the Lego Elf Club listing here",
    "The most recent Lego set announced is a replica of the house from Home Alone, complete with a little Kevin McCalister and all the traps he used in the movie.",
    "Is this a Christmas set? We'd argue so, but perhaps in a looser sense of the word than the aforementioned kits. Either way, the house is kitted up with Christmas decorations (and it's based on a festive film too).",
    "This is a pretty pricey pack, so not everyone is going to choose this as their go-to Christmas kit, but some people - especially if there are deals on it - might go for it.",
    "You can check out the Lego Home Alone listing here"
  ],
  "headers": {
    "5": "Lego Nutcracker",
    "8": "Lego Penguin",
    "11": "Lego Christmas Wreath",
    "15": "Lego Santa's Visit",
    "18": "Lego Elf Club",
    "22": "Lego Home Alone"
  },
  "links": {
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Black Friday Lego deals": "https://www.techradar.com/black-friday/black-friday-lego-deals",
    "Lego Cyber Monday": "https://www.techradar.com/cyber-monday/best-cyber-monday-lego-sets",
    "Lego Nutcracker listing here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1148410696120834700&murl=https%3A%2F%2Fwww.lego.com%2Fproduct%2Fnutcracker-40425",
    "Lego Penguin listing here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1099965638466760000&murl=https%3A%2F%2Fwww.lego.com%2Fproduct%2Fchristmas-penguin-40498",
    "Lego Christmas Wreath listing here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1006896903174343200&murl=https%3A%2F%2Fwww.lego.com%2Fproduct%2Fchristmas-wreath-2-in-1-40426",
    "Lego Santa's Visit listing here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-1165939211484429800&murl=https%3A%2F%2Fwww.lego.com%2Fproduct%2Fsanta-s-visit-10293",
    "Lego Elf Club listing here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-4987535189062726000&murl=https%3A%2F%2Fwww.lego.com%2Fproduct%2Felf-club-house-10275",
    "Lego Home Alone listing here": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24340&u1=trd-us-5841929790890741000&murl=https%3A%2F%2Fwww.lego.com%2Fproduct%2Flego-ideas-home-alone-21330"
  }
}