{
  "source": "https://www.techradar.com/news/these-new-wireless-headphones-offer-portability-and-battery-life-for-cheap",
  "title": "These new wireless headphones offer portability and battery life for cheap",
  "category": "audio-visual",
  "updated": "2021-09-16T16:55:15Z",
  "author": "darren-allan",
  "summary": "SoundMAGIC P23BT headphones look like a good value proposition",
  "article": [
    "If you’re after an affordable set of wireless headphones which boast plenty of battery life for listening to music on lengthy travels, then check out the new SoundMAGIC P23BT.",
    "These Bluetooth headphones offer an impressive claimed battery life of 54 to 60 hours of playback on a full charge of the 400mAh power pack. Along with Bluetooth 5.0 support, you can alternatively opt for a wired connection, as the P23BT comes with a bundled wired boom mic which can be used for business calls, or indeed a bit of gaming chat.",
    "Another bonus comes in terms of portability, as these headphones can be folded up so they’re flat and take up a suitably small amount of space in your backpack or other luggage (it comes bundled with a carry case, too, as well as the aforementioned wired boom mic).",
    "But all this wouldn’t mean much without good audio, of course, and in the quest for that, the SoundMAGIC P23BT benefits from 40mm neodymium drivers and high-definition sound. To make them comfortable while they're on, SoundMAGIC says they boast leatherette earpads with memory foam are designed to mould to the ear and give a good level of comfort (hopefully without any sweatiness creeping in).",
    "The P23BT also has a built-in mic with noise reduction, and it sports some intuitive controls which are triggered via simple taps or swipes on the earcups.",
    "If you fancy grabbing the SoundMAGIC P23BT, these headphones won’t make much of a dent in your bank balance given that they retail at a few pennies under £50 (around $70, AU$95).",
    "We'll reserve our judgment until we hear them for ourselves, but based on their specs this looks like a solid set of affordable headphones, and that battery life is seriously impressive, particularly given the asking price.",
    "Reaching up to 60 hours of playback is great, and what’s also cool is that should you ever get up in the morning to find the battery is run down, there’s a quick charge mode to give you enough to tide you over – just a 10-minute juice-up grants five hours of playtime. There’s also 50 days on standby with these headphones.",
    "Obviously we can’t get too carried away without actually trying the P23BT and listening to them, but for the money, the rest of the spec and materials sound pretty smart. Our main concern would be slight question marks over those earcup-based controls and whether the necessary taps and swipes (to adjust volume, skip tracks, or mute and so forth) will be responsive and accurate enough – hopefully no frustrations will be introduced on this front."
  ],
  "headers": {
    "6": "Analysis: Battery on a budget"
  },
  "links": {
    "headphones": "https://www.techradar.com/how-to/how-to-choose-the-right-headphones-for-you"
  }
}