{
  "source": "https://www.techradar.com/news/netflix-cancelled-4-more-tv-shows-last-week-but-none-of-our-favorites",
  "title": "Netflix cancelled 4 more TV shows last week – but none of our favorites",
  "category": "entertainment",
  "updated": "2021-07-05T17:34:00Z",
  "author": "samuel-roberts",
  "summary": "Four sitcoms hit the scrapheap",
  "article": [
    "Netflix cancelled four more of its original shows last week, just as the long weekend kicked in. They were all comedies, rather than dramas: Country Comfort, Mr Iglesias, Bonding and The Crew.",
    "Of those, The Crew was perhaps the most high-profile, since it featured The King of Queens' Kevin James, an Adam Sandler movie regular. That one was about a guy who runs a NASCAR garage, and it ran for just a single season earlier this year. Country Comfort also only lasted for one season, while Mr Iglesias and Bonding each got two before being axed.",
    "The cancellations were all revealed at once in a Variety report, which says Netflix is making another show with Kevin James for the actor to produce and star in.",
    "Netflix has cancelled a few bigger budget series this year so far, too, including superhero drama Jupiter's Legacy and Sherlock Holmes-themed series The Irregulars, but confirmed that Shadow and Bone season 2 is in the works. Another Netflix comedy, Dad Stop Embarrassing Me! starring Jamie Foxx, was also axed last month.",
    "One Netflix show we're still waiting to hear about is Sweet Tooth, which launched a month ago. Hopefully that one will get a second season.",
    "No offense to these shows, which definitely had their fans, but none of them made our best Netflix series list. Comedy must be a tricky thing for Netflix to figure out – on the surface, they're harder to make work for a global audience. Many of its big TV hits are dramas like Stranger Things and The Witcher, which transfer pretty well wherever you're watching the streamer.",
    "The Crew, by contrast, was themed around NASCAR, which is arguably a very American phenomenon. Sometimes cultural references don't carry in the same way internationally – and Netflix has a massive footprint outside the US.",
    "Still, when a comedy hits it off like Sex Education does, its origin doesn't matter so much. Sometimes the themes or characters are so universal that they carry over.",
    "Whatever the reason behind their cancellation, these four Netflix shows seemingly didn't have the fanbases needed to keep them going."
  ],
  "headers": {
    "5": "Analysis: Some cancellations hurt more than others"
  },
  "links": {
    "Variety": "https://variety.com/2021/tv/news/the-crew-mr-iglesias-bonding-country-comfort-canceled-netflix-1235010988/",
    "Netflix": "https://www.techradar.com/reviews/audio-visual/av-accessories/netflix-1065801/review",
    "Shadow and Bone season 2": "https://www.techradar.com/news/shadow-and-bone-season-2",
    "Sweet Tooth": "https://www.techradar.com/news/sweet-tooth-season-2",
    "best Netflix series": "https://www.techradar.com/best/best-netflix-shows",
    "Stranger Things": "https://www.techradar.com/news/stranger-things-season-4",
    "The Witcher": "https://www.techradar.com/news/the-witcher-season-2-release-date-netflix",
    "Sex Education": "https://www.techradar.com/news/sex-education-season-3-release-date-cast-trailer-and-what-we-know"
  }
}