{
  "source": "https://www.techradar.com/news/china-now-has-half-a-billion-5g-customers",
  "title": "China now has half a billion 5G customers",
  "category": "phones",
  "updated": "2021-08-20T10:03:50Z",
  "author": "mike-moore",
  "summary": "Landmark figure passed as numbers continue to grow",
  "article": [
    "The number of 5G customers in China is now more than half a billion as demand for the technology continues to grow worldwide.",
    "Analysis by The Register of the latest figures from China's largest three carriers shows that the landmark figure has been passed recently, with the country leading the way in 5G subscriptions.",
    "However the rise could be set for a slowdown, as network infrastructure consolidation could mean new 5G subscriber numbers begin to ease in the next few months.",
    "The Register's analysis examined figures from China Mobile, China Unicom and China Telecom up to June 30, which together can boast 495 million 5G subscribers across the country - up from around 322 million in March 2021.",
    "China Mobile leads the way overall with 946 million total subscribers, with China Telecom on 362 million and China Unicom on 310 million for a grand sum of 1.618 billion overall.",
    "The figures also show that China can now boast over a million 5G base stations, however this number may be affected by the fact that China Unicom and China Telecom have multiple infrastructure-sharing arrangements in place, so base stations could be co-owned by both companies.",
    "The rise of 5G networks has greatly accelerated across the globe as the technology becomes more and more embedded in our everyday lives, with remote healthcare and mobile gaming due to see particularly high growth.",
    "A recent report from Juniper Research predicted the total number of 5G connections is set to rise from the current estimated 310 million users to reach 3.2 billion by 2026.",
    "Another report from the same company noted that 5G-compatible smartphones will account for more than half of all handset revenue by 2025 as smartphone sales increase due to a combination of 5G and pent-up demand after the pandemic, rising from $108 billion this year to $337 billion over the next four years.",
    "Via The Register"
  ],
  "headers": {
    "3": "China 5G"
  },
  "links": {
    "5G": "https://www.techradar.com/news/what-is-5g-everything-you-need-to-know",
    "China": "https://www.techradar.com/news/best-vpn-for-china-our-5-top-choices",
    "The Register": "https://www.theregister.com/2021/08/20/china_5g_progress/"
  }
}