{
  "source": "https://www.techradar.com/news/these-true-wireless-earbuds-have-a-kevlar-charging-case-and-no-were-not-joking",
  "title": "These true wireless earbuds have a Kevlar charging case – and no, we're not joking",
  "category": "audio-visual",
  "updated": "2021-09-21T11:42:54Z",
  "author": "rhys-wood",
  "summary": "Rock-solid protection... for your earbuds?",
  "article": [
    "Master & Dynamic has announced the MW08 Sport true wireless earbuds, the latest in the company's lineup of products that have many of the premium features you'd expect. They also come with a charging case made from Kevlar, the ultra-durable material typically found in bulletproof vests.",
    "Announced via a Master & Dynamic press release, the MW08 Sport true wireless earbuds will certainly set you back, costing $349 / £329. That's a good deal more expensive than the base MW08 model which released earlier in 2021.",
    "The MW08 Sport true wireless earbuds are available in four different colors, and seem to boast impressive battery life, lasting up to 12 hours on a single charge, with the charging case providing an additional 30 hours when needed.",
    "Much like the original MW08 earbuds, hybrid active noise cancellation is featured with the MW08 Sport, as well as Bluetooth 5.2 support. Numerous audio codecs are also supported, including Qualcomm aptX, AAC and SBC.",
    "On the durability front, the Kevlar-built charging case obviously steals the show, but it's worth noting the earbuds themselves have an IPX4 water resistance rating, adequately protecting them from water and sweat.",
    "It also looks like the MW08 sport true wireless earbuds aren't skimping on comfort, either, as the package includes five sizes of silicone fit tips as well as two sizes of foam ear tips that could be ideal for workout sessions.",
    "We'd be tempted to say the Kevlar charging case included with the MW08 Sport true wireless earbuds was just a gimmick, if it wasn't for Master & Dynamic's excellent track record when it comes to manufacturing high-quality products.",
    "While undoubtedly pricey, the company's range of wireless earbuds have so far been able to back up the high costs with a luxury listening experience. The MW08 true wireless earbuds were a particular standout, featuring great sound and superb build quality.",
    "In terms of the earbuds themselves, the MW08 Sport don't seem to be all that much of a leap from their predecessors. As such, it's difficult to recommend them over the cheaper and equally excellent MW08 true wireless earbuds.",
    "That said, the improved build quality alone could justify the higher price for some, and that Kevlar charging case is certainly something of an icebreaker if brought up in conversation."
  ],
  "headers": {
    "6": "Analysis: all style, no substance?"
  },
  "links": {
    "MW08 Sport true wireless earbuds": "https://www.techradar.com/reviews/master-and-dynamic-mw08-sport",
    "base MW08 model": "https://www.techradar.com/reviews/master-and-dynamic-mw08"
  }
}