{
  "source": "https://www.techradar.com/news/tiktok-in-serious-trouble-over-data-collection-again",
  "title": "TikTok in serious trouble over data collection, again",
  "category": "computing",
  "updated": "2021-04-21T23:05:49Z",
  "author": "anthony-spadafora",
  "summary": "New UK legal claim alleges TikTok collects unnecessary data on children",
  "article": [
    "The popular social media platform TikTok has come under scrutiny in the UK once again as former children's commissioner Anne Longfield has filed a legal claim against the company over how it collects and uses data from children.",
    "The claim was filed by Longfield on behalf of millions of children in both the UK and EU who have used the video-sharing app and if successful, the affected children could receive thousands of pounds from its parent company ByteDance.",
    "According to a new report from the BBC, lawyers from the law firm Scott and Scott will allege that TikTok collects the personal information of children including their phone numbers, videos, exact location and biometric data without proper warnings or the necessary consent required by law.",
    "A spokesperson from TikTok has since responded to the claim, saying:",
    "\"Privacy and safety are top priorities for TikTok and we have robust policies, processes and technologies in place to help protect all users, and our teenage users in particular. We believe the claims lack merit and intend to vigorously defend the action.\"",
    "Since its launch in 2016, TikTok has amassed over 800m users worldwide and as a result the video-sharing app has been quite profitable for ByteDance with a majority of its revenue coming from advertisers.",
    "The legal claim against TikTok has been filed on behalf of all children who used the social network since May of 2018 regardless of their privacy settings or whether they have opened their own accounts on the platform.",
    "While all social media platforms collect some data on their users, Longfield told the BBC that she is focused on TikTok specifically due to its “excessive' data collection policies. She also believes that TikTok is “a data collection service that is thinly veiled as a social network” which has been able to deceive parents regarding its true motives.",
    "Longfield's claim isn't without merit though as back in 2019, the company was fined $5.7m by the US Federal Trade Commission (FTC) for mishandling children's data. TikTok was also fined last year for the same reason in South Korea by the Korea Communications Commission (KCC).",
    "We'll have to wait and see regarding the results of the lawsuit but if Longfield's claim is successful, there will likely be new warnings and information on how TikTok collects data when signing up for an account.",
    "Via BBC"
  ],
  "headers": {
    "5": "Excessive data collection policies"
  },
  "links": {
    "TikTok": "https://www.techradar.com/news/tiktok-launches-range-of-new-e-commerce-tools",
    "once again": "https://www.techradar.com/news/tiktok-could-be-facing-some-serious-gdpr-charges",
    "video-sharing": "https://www.techradar.com/best/best-ways-to-share-big-files",
    "ByteDance": "https://www.techradar.com/news/tiktok-parent-company-is-hiring-for-a-push-into-semiconductors",
    "new report": "https://www.bbc.com/news/technology-56815480",
    "own accounts": "https://www.techradar.com/how-to/how-to-change-your-tiktok-password",
    "FTC": "https://www.techradar.com/news/voip-carrier-fined-millions-by-ftc-for-client-robocalls",
    "how TikTok collects data": "https://www.techradar.com/news/us-senators-call-for-a-probe-into-tiktok-citing-national-security-concerns",
    "BBC": "https://www.bbc.com/news/technology-56815480"
  }
}