{
  "source": "https://www.techradar.com/news/cloudera-signs-multi-billion-dollar-deal-to-go-private",
  "title": "Cloudera signs multi-billion dollar deal to go private",
  "category": "computing",
  "updated": "2021-06-01T14:55:55Z",
  "author": "abigail-opiah",
  "summary": "Transaction is valued at $5.3bn",
  "article": [
    "US-based data cloud hosting company Cloudera has been bought by affiliates of Clayton, Dubilier & Rice and KKR in a transaction valued at $5.3 billion.",
    "The acquisition will see Cloudera become a private company, with the deal scheduled to close in the second half of 2021.",
    "Cloudera’s board of directors all approved the acquisition and have recommended that the company's shareholders also approve the transaction and adopt the merger agreement.",
    "The deal is set to deliver a huge amount of value to shareholders, who will receive $16.00 in cash per share, representing a 24% premium to the closing price as of May 28, 2021.",
    "Rob Bearden, CEO of Cloudera echoed that by stating the transaction provides substantial and certain value to the firm’s shareholders while also accelerating its long-term path to hybrid cloud leadership for analytics that span the complete data lifecycle - from the Edge to AI.",
    "“We believe that as a private company with the expertise and support of experienced investors such as CD&R and KKR, Cloudera will have the resources and flexibility to drive product-led growth and expand our addressable market opportunity,” he added.",
    "KKR will make the investment from its North American private equity funds, which will add to the company’s experience of helping to grow top global technology businesses, including GoDaddy, Internet Brands, Epicor, BMC, Optiv, Calabrio, Corel and 1-800 Contacts.",
    "For the deal to close without a hitch, the company awaits the approval of Cloudera shareholders and antitrust approval. The agreement includes a 30-day “go-shop” period expiring on July 1, 2021, which allows the Board and its advisors to solicit and consider alternative acquisition proposals from third parties.",
    "Jeff Hawn, CD&R Operating Partner who will serve as Chairman of the company upon the close of the transaction, said: “The company has made significant progress establishing the Cloudera Data Platform (CDP) as a leader in hybrid and multi-cloud analytics, and we believe that our experience and capabilities can offer valuable support to accelerate expansion into new products and markets.”"
  ],
  "headers": {
    "3": "Cloudera acquisition"
  },
  "links": {
    "cloud hosting": "https://www.techradar.com/news/best-cloud-hosting-providers",
    "Edge to AI": "https://www.techradar.com/news/how-to-get-ai-to-the-edge",
    "GoDaddy": "https://www.techradar.com/reviews/godaddy"
  }
}