{
  "source": "https://www.techradar.com/news/apple-watch-7-has-more-in-common-with-the-iphone-13-than-you-might-expect",
  "title": "Apple Watch 7 has more in common with the iPhone 13 than you might expect",
  "category": "wearables",
  "updated": "2021-10-22T08:59:10Z",
  "author": "james-rogerson",
  "summary": "A new screen and a bigger battery",
  "article": [
    "The Apple Watch 7 and iPhone 13 are very different devices, despite both being made by Apple, but a recent teardown of the former shows a key similarity between the two which Apple itself hasn’t highlighted.",
    "iFixit found that the Apple Watch 7 has a touch-integrated OLED screen, also known as an on-cell touch display. This means that the screen’s touch sensor is built into the main display panel, rather than being a separate layer as it conventionally would be.",
    "The upshot of that is that the screen can be thinner, leaving Apple more space to play with for other components. That’s especially important in something as tiny as a smartwatch, though despite this change the Apple Watch 7 is actually marginally thicker than the Apple Watch 6. So maybe it would have been thicker still if not for this screen type.",
    "In any case, the iPhone 13 also has a touch-integrated OLED screen, and iFixit notes that this is slightly unusual as Apple would usually test out new tech on the Apple Watch first, as it doesn’t need to produce as many units. But this year the iPhone 13 technically launched first – though Apple would have been working on displays for the two in tandem.",
    "The report also found that the batteries in the Apple Watch 7 range are slightly higher capacity than in the Apple Watch 6, but the difference is negligible. You get 6.8% more capacity in the 41mm Apple Watch 7 than the 40mm Apple Watch 6, and 1.6% more in the 45mm Apple Watch 7 than in the 44mm Apple Watch 6.",
    "Given how small those differences are though, and that the screens are bigger on the Apple Watch 7 range, the actual life is much the same. Finally, iFixit awarded the Apple Watch 7 a repairability score of 6/10, feeling generally positive about it but noting that replacement parts are expensive, and that having to unglue and re-glue the screen during repairs is an issue.",
    "While the iPhone 13 went on sale before the Apple Watch 7, this seemingly wasn’t Apple’s plan, with reports suggesting that the wearable had hit production snags leading to delays.",
    "That makes sense given that it felt odd when Apple announced the Watch 7 alongside the iPhone 13, but didn’t initially provide a release date for it.",
    "Thanks to this teardown we now have a clearer idea of what caused those delays, as the on-cell touch display was the biggest change that the teardown found, and as screens are typically more complex to assemble than most other components.",
    "It doesn’t seem like this change has had much impact on the watch overall, but arguably a slight improvement was worth the slight delay.",
    "Via Engadget"
  ],
  "headers": {
    "6": "Analysis: a new screen meant a longer wait"
  },
  "links": {
    "Apple Watch 7": "https://www.techradar.com/news/apple-watch-7-release-date-price-specs-and-news",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iFixit": "https://www.ifixit.com/News/53688/three-former-apple-engineers-helped-us-tear-down-apple-watch-series-7",
    "Apple Watch 6": "https://www.techradar.com/reviews/apple-watch-6-review",
    "Engadget": "https://www.engadget.com/apple-watch-series-7-teardown-ifixit-055346543.html"
  }
}