{
  "source": "https://www.techradar.com/news/the-division-2-devs-aim-to-bring-a-meaningful-change-to-the-game-in-next-major-update",
  "title": "The Division 2 devs aim to bring 'a meaningful change to the game' in next major update",
  "category": "gaming",
  "updated": "2021-03-06T14:17:20Z",
  "author": "emma-boyle",
  "summary": "Coming late 2021",
  "article": [
    "Ubisoft has announced that The Division 2’s next major update is slated to launch later this year and will include the introduction of an entirely new game mode.",
    "In a recent blog post on the Ubisoft website, The Division 2’s development team thanked fans for their continued support of the game, which reached 40 million players last year, and outlined its long and short-term plans for the game’s future.",
    "The post confirmed that Ubisoft Massive will continue development, with Adrian Trasca and Yannick Banchereau staying in their respective roles as producer and associate creative director, while there will be additional support from “a talented group of developers at Ubisoft Bucharest”.",
    "In the long-term, the team is planning a “major update” which it hopes will bring “a meaningful change to the game.” At the moment the team has confirmed that the update will include a game mode that’s “entirely new to the franchise” and, potentially, some new means of agent progression as the team also said it’s investigating this, “with an emphasis on increasing build variety and viability.”",
    "It’s possible this won’t be the extent of the plans as the team noted that it will be “revealing more about what lies ahead as the update gets closer.”",
    "While it was confirmed that work on the next big update is underway, it’s also still “in its early stages and will take several months to complete.” As a result, players shouldn’t expect to see it launched until “late 2021 at the earliest”.",
    "In the meantime, players can expect to see “new Apparel Events and some minor Title Updates focused on game health” as well as re-runs of previous seasons. So the game’s next season, which is technically Season 5, will actually be a re-run of Season 1 and Ubisoft says that it hopes this will give players the chance to gather rewards and collectibles they might have missed out on the first time they played.",
    "This outline has come after Ubisoft surprised players last month by announcing its intention to extend the life of The Division 2 beyond its fourth season, End of Watch, which was assumed to be the end for the game.",
    "First released on PS4, Xbox One and PC back in 2019, The Division 2 is also now available on Google Stadia as well as PS5 and Xbox Series X/S, with a recent next-gen upgrade introducing support for 4K visuals and 60 fps."
  ],
  "headers": {
    "6": "What about right now?"
  },
  "links": {
    "recent blog post": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-3127346008143708700&sharedId=trd-us&u=https%3A%2F%2Fwww.ubisoft.com%2Fen-gb%2Fgame%2Fthe-division%2Fthe-division-2%2Fnews-updates%2F3TEZgBvercmUmsJvTv3KBG%2Fthe-division-2-the-road-ahead",
    "announcing": "https://twitter.com/TheDivisionGame/status/1360272533031944195?s=20",
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "S": "https://www.techradar.com/reviews/xbox-series-s",
    "recent next-gen upgrade": "https://ubisoft.pxf.io/c/221109/864200/12050?subId1=trd-us-1020080034790234900&sharedId=trd-us&u=https%3A%2F%2Fforums.ubisoft.com%2Fshowthread.php%2F2316782-Title-Update-12-1-Patch-Notes"
  }
}