{
  "source": "https://www.techradar.com/news/android-q",
  "title": "Android 10 features, release date, Easter eggs and everything you need to know",
  "category": "phones",
  "updated": "2021-04-12T09:48:56Z",
  "author": "david-lumb",
  "summary": "Android 10 is out for more and more phones",
  "article": [
    "Many Android phones still use Android 10, even though Android 11 is out and Android 12 is just around the corner, so this guide will be helpful to lots of you out there.",
    "That's because not all phones are eligible for updates to newer versions of Google's operating system, and even if your handset is, the roll-out is staggered. So depending on where you live and what kind of phone you have, you might still be waiting on Android 10.",
    "Android 10 was announced in mid-2019 and released at the end of the year, but it takes time to roll out to all eligible smartphones. As of that date, new phones started being released that had the OS version pre-installed too.",
    "There are plenty of Android 10 features that may change the way you use your Android device which have topped wish lists for years, and some of which are also available in Apple's iOS 13 for iPhone users.",
    "Among all the new Android 10 improvements, 'Dark Theme' (a system-wide dark mode) is arguably the most anticipated, along with Gesture Navigation (which some Android 'forks' had anyway) and Focus Mode for shutting off notifications when you want to get things done. There are more improvements, of course, and we've detailed them all below.",
    "Android 10 has been officially released, and it's available on most smartphones. Each individual company needs to tailor Android 10 for all its different phones, so recent devices have the update, but older ones might take a while to receive it.",
    "At this point, though, with Android 11 growing long in the tooth, if your smartphone hasn't received Android 10 it very likely won't ever.",
    "Some smartphones come with Android 10 already pre-loaded like the OnePlus 8, Samsung Galaxy S20 and more, but as newer Android updates become the norm, we'll see fewer and fewer handsets come with Android 10.",
    "If your smartphone isn't too old for Android 10, but doesn't have it already, you can expect it to come soon.",
    "There's a nonogram puzzle hidden within Android 10, if you know where to look. Firstly, you're going to have to be on Android 10 to access the easter egg. Once you're on Android 10, go to phone Settings, select 'About Phone', then press 'Android version' repeatedly. Now you'll be faced with a giant 'Android 10' logo.",
    "Tap repeatedly on the '1' of 'Android 10' and it'll rotate – you can also drag it around the screen. What you need to do now is rotate it and drag it, until it's positioned through the '0' to make a 'Q'.",
    "(This is something of an in-joke, as Android 10 was supposed to be called Android Q as part of the traditional Google naming ceremony, but was switched to be named 10 to fit in with the search giant's plans to make the new operating system versions a little easier to understand.)",
    "Now press the Android logo once more, and the nonogram game will launch. It's a game that starts on quite high difficulty, but when you work out how to play, it becomes incredibly logical – even more so that the visual answers to the puzzles are all Android-related images.",
    "There is a bug in the game, and it's that while traditionally nonograms have clues along the top and left side of the grid, the Android 10 game is too big, so you can only actually see either the top or left clues at once. Rotate the screen to see the other batch.",
    "However, it's an intriguing game to get as part of the main operating system - so go forth and find it.",
    "Thanks to Google providing most of the information, as well as our playing around with Android 10, we've got a good idea of all the features in this version of Google's operating system.",
    "There's a system-wide dark mode coming to Android 10 and it's called Dark Theme. So far it's limited to a few specific menus and apps, but more and more apps are becoming available in a dark mode all the time.",
    "You'll be able to trigger Dark Theme in two different ways, and both are in the notification shade. The first way is with a dedication Dark Theme quick settings button that switches between the default Light Theme and new Dark Theme.",
    "The second way is to turn on a Battery Saver mode, which automatically turns on Android 10 Dark Theme. This is a boon for phones with OLED screens, which will burn fewer pixels by essentially turning off pixels in regions of the display that are intentionally black.",
    "In iOS 12 Apple introduced Screen Time to monitor device use, and Android 10 has its own version called Digital Wellbeing, except it doesn't just apply to your own handset. Digital Wellbeing gives you a range of ways to manage your screen time in a healthy way.",
    "One of the Digital Wellbeing tools is Focus mode, that lets you silence apps for a select amount of time to help you concentrate on something else.",
    "Then there's Family Link, so you can monitor how much time your dependents are spending on games or other apps, and how long they're spending on their phone in general.",
    "Fans of Google's various tools might like Smart Reply, which suggests responses to your emails on Gmail, using machine learning to work out a few appropriate replies. All you have to do is select them, instead of typing out an answer yourself.",
    "This is now available on Android 10, so you can quickly respond to texts or other messages without opening the app itself. The feature also suggests other actions, like opening Maps if an address is sent, or Calendar if it recognizes a date.",
    "One feature Android 10 doesn't have is Android Beam, the NFC peer-to-peer sharing method when two devices are nearby. Placing phones back-to-back will do nothing in the beta and final software, we confirmed at Google IO.",
    "Will Google replace Android Beam with another peer-to-peer sharing method? That remains to be seen, but it seems unlikely.",
    "A report from the International Computer Science Institute found that over 1,300 apps on the US Google Play Store routinely scraped personal data from users even if explicitly denied by relevant permissions settings.",
    "Appmakers have been using multiple clever workarounds to get the info they wanted: if a user set their permissions to not share location data, the apps took their MAC address from routers connected to the phone. They stored the device-identifying IMEI number accessed by one app and shared it with others. They even determined user locations with image metadata.",
    "Google reportedly fixied these issues with the full release of Android 10, though not in any planned beta beforehand.",
    "Android 10 is preparing for foldable phones in the future, or \"foldables and innovative new screens,\" according to the Android Developers Blog post.",
    "The Samsung Galaxy Fold seamlessly switched between the folded and unfolded screen states. By Google natively supporting this type of UI continuity in the backend, it'll likely come to more foldable phones when they launch with Android 10 onboard.",
    "Android is the only operating system that supports foldables, so it's likely all foldable phones will run Android 10 upon release.",
    "You've seen the bubbles UI before if you've used Facebook Messenger chat heads. It's an easy way to keep active conversations on-screen as small floating profile pics, while going about your normal tasks in the rest of the interface. You can tap the pic when you want to switch back to the conversation.",
    "Google is supporting this idea throughout Android 10 and calling it a new way to multitask. So far, its examples are coming to Messages and Hangouts. But Google is reducing development time, interactivity consistency, and user privacy safeguards, so expect to see it in additional apps outside of Google's ecosystem.",
    "The Android Developer Blog post announcing the developer beta confirmed a heavy emphasis on boosting privacy in Android 10, a focus that was reaffirmed in the Google IO 2019 keynote.",
    "Users will have more control over app access to location info, shared files and repositories like Photos and Videos. Another helpful change: instead of apps automatically switching focus when they have an Activity in the background (like an alarm or call), appmakers can opt to send high-priority notifications first.",
    "Android 10 beta 3 also introduced a new feature – Scoped Storage – which allows users to control how apps access external storage (say, in a MicroSD card). It will also better protect users from being identified by restricting access to non-resettable device identifiers, like your phone's serial number and/or IMEI, and randomizing its MAC address when connected to different Wi-Fi networks.",
    "These might be some of the most onerous changes for developers in Android 10, which is why, as the Android Developers Blog post reads: \"We are bringing these changes to you early, so you can have as much time as possible to prepare.\"",
    "Another new endeavor announced at Google IO 2019 is Project Mainline, which enables Android devs to update critical parts of Android (so-called 'modules') without a full software package – and critically, without a full update from OEMs.",
    "These surgical upgrades download in the background from Google Play and load them up whenever the phone next reboots. They will mainly be used to improve privacy and security, though the Android Developers Blog post also mentions game developers will use it to update modules for consistent platform implementation.",
    "All devices that can run Android 10 will be able to get Project Mainline.",
    "Android 10 has some particular tricks up its sleeve for 5G. New APIs will enable apps to detect user connection rate and latency, as well as detect if the connection is metered.",
    "This will give developers more refined control over how much data to send to users, especially when they have poorer connections or have data-downloading limits.",
    "One of several accessibility features announced at Google IO 2019, Live Caption does what it says on the tin – captioning video and audio in real-time. The feature doesn't require an internet connection, transcribing text from the device's own speech recognition and NLP.",
    "On the Google IO 2019 stage, we saw Live Caption used in combination with Live Transcribe to input incoming audio to text, then have a user text a response which was spoken. In the demonstration, the combo – called Live Relay – allows a texting user to interact on a phone call without ever speaking a word.",
    "The last accessibility feature coming to Android 10 is Project Euphonia, which aims to improve Android's verbal recognition to better process words spoken by users with speech impediments.",
    "Developers will be able to show contextually-important system settings within their apps, which harnesses the 'Slices' feature that came in Android 9 Pie. So instead of having to navigate to Settings to switch on Airplane Mode or toggle Wi-Fi or Mobile Data on/off, say, you'll be able to do that right within your mobile browser.",
    "There are also tweaks to connectivity, including 'adaptive Wi-Fi' that enables high performance/low latency modes, which would be useful for things like online gaming or voice calls.",
    "Like all the depth and blur in Pixel camera software? In Android 10, apps can request depth data (JPEG + XMP metadata + depth and confidence map) to, say, offer \"specialized blurs and bokeh options in your app,\" as the Android post suggests. \"You can even use the data to create 3D images or support AR photography use-cases in the future.\"",
    "Android 10 will also support more multimedia codecs: AV1 to let media providers stream high-quality video, Opus for audio encoding, and HDR10+ for high dynamic range video \"on devices that support it\" – like, say, the Samsung Galaxy S10 family.",
    "As for gaming, the Android 10 beta enhances support for OpenGL along with bug fixes and more functionality.",
    "Android 10 will revamp permissions, from the general to specific, and we've heard that users will be able to better view what info they've shared.",
    "Here's what we don't know for sure, but have heard about: per the aforementioned XDA Developers leak, users will be able to look at a broad overview of which apps they've given permission for certain things, like location or microphone access. There's a search function that lets you filter by permission item, allowing you to quickly see which apps you've given access to your camera, contacts, location and so on.",
    "You can also look at permissions each app has been granted and toggle them individually to set whether access is off, on, or only on while the app is open.",
    "There are plenty of new developer tools described by the XDA leak, but it's not clear how all of them will function.",
    "Freeform windows return, which lets you enable them after pressing and holding an app icon in the recent apps overview. On the other hand, XDA also found a feature called \"Game Updates Package Preference\" whose purpose is a bit of a mystery. Another, titled \"force desktop mode,\" seems like it would push Android to an external display, Samsung DeX-style.",
    "Not all of the UI is finished, either, making some features – like screen recording – not totally comprehensible.",
    "Android 10 gets a feature iOS users have bragged about for awhile: Face ID. The next version of Android supports phones packing the hardware to use facial scans for authentication.",
    "It's unclear just how it will work, or if it would combine sensor readings for a comprehensive scan of facial features. But we did get hints via error codes in one of the OS' APK, which variably tell the user to move the phone in different directions for the device to get a better look at their face.",
    "Whether phones will be able to use Face ID is another story: they need to have the hardware installed – whether that's sensors or the right specs – for the feature to work.",
    "While recent Android phones from different brands have tried to push their own gesture controls for years, the OS has always kept its static three-button navigation as an option.",
    "From the looks of it, users may only be able to use the navigation system present in the Google Pixel 3: a small pill at the bottom of the screen that you can swipe in the cardinal directions to get around.",
    "It's key to note that Android allows brands to develop their own navigation methods and systems to go along with their overlays, so it's very unlikely that this will be the only way to navigate."
  ],
  "headers": {
    "5": "Android 10 release date",
    "9": "Android 10 Easter Egg game",
    "15": "Android 10 features and changes",
    "16": "Dark Theme, the system-wide dark mode",
    "19": "Digital Wellbeing",
    "22": "Smart reply",
    "24": "Android Q doesn't have Android Beam",
    "26": "Closing privacy loopholes",
    "29": "Foldable support",
    "32": "Android Q 'bubbles' multitasking",
    "34": "New Android 10 privacy features",
    "38": "Project Mainline: security updates in the background",
    "41": "5G",
    "43": "Live Caption, and more",
    "46": "Developer tools for apps: system settings, connectivity, media and more",
    "51": "More permissions to preserve privacy",
    "54": "Developer tools",
    "57": "Face ID-style authentication for logins and purchases",
    "60": "Goodbye back button, hello (only to) gesture controls"
  },
  "links": {
    "Android phones": "https://www.techradar.com/best/best-android-phones",
    "Android 11": "https://www.techradar.com/news/android-11",
    "Android 12": "https://www.techradar.com/news/android-12-news",
    "iOS 13": "https://www.techradar.com/news/ios-13-release-date-features-and-everything-you-need-to-know",
    "OnePlus 8": "https://www.techradar.com/reviews/oneplus-8",
    "Samsung Galaxy S20": "https://www.techradar.com/reviews/samsung-galaxy-s20-full-review",
    "doesn't have is Android Beam": "https://www.techradar.com/news/android-q-wont-have-android-beam",
    "report": "https://www.techradar.com/news/android-app-permissions-loophole",
    "foldable phones": "https://www.techradar.com/best/best-foldable-phones",
    "Samsung Galaxy Fold": "https://www.techradar.com/reviews/samsung-galaxy-fold",
    "Android Developer Blog post": "https://android-developers.googleblog.com/2019/05/whats-new-in-android-q-beta-3-more.html",
    "Scoped Storage": "https://developer.android.com/preview/privacy/scoped-storage",
    "Samsung Galaxy S10": "https://www.techradar.com/reviews/samsung-galaxy-s10",
    "Samsung DeX": "https://www.techradar.com/reviews/samsung-dex",
    "Google Pixel 3": "https://www.techradar.com/reviews/google-pixel-3-review"
  }
}