{
  "source": "https://www.techradar.com/news/wordpress-is-launching-its-own-website-builder",
  "title": "WordPress.com is launching its own premium website builder",
  "category": "computing",
  "updated": "2021-01-16T10:39:57.168Z",
  "author": "barclay-ballard",
  "summary": "Built By WordPress.com offers expert web design, at a price",
  "article": [
    "WordPress.com is launching its own website building service, promising professional, custom web design starting from $4,900.",
    "The new Built By WordPress.com service offers three distinct plans, one for Online Stores, one for Educational Sites and another for Professional Services. A dedicated engagement manager will work with the website owner throughout the duration of a project, helping to make sure that the final site matches up with the customer’s initial vision.",
    "Space is currently limited but interested customers can fill in an application form online that WordPress.com will review within two to three business days.",
    "When Built By WordPress.com was initially announced as a beta last year, some members of the WordPress community were slightly aggrieved, believing it to be a betrayal of the company’s open values and commitment to offering free services.",
    "However, although the WordPress.org CMS remains free-of-charge, WordPress.com is actually owned by an organization called Automattic, which has the slogan: “We don’t make software for free, we make it for freedom.”",
    "These are early days for WordPress.com’s website builder service, so it’s impossible to say yet what the long-term effects on the web development community will be. In any case, WordPress.com has said that its new service is aimed at taking on the major web building platforms like Squarespace and Wix, rather than individual web developers.",
    "“Launched in beta in the fall of 2020, our premium website building service was developed with your needs in mind,” Marjorie Asturias, Product Marketing & Partnerships Director for WordPress.com at Automattic, explained.",
    "“Whether you need a fast and performant eCommerce store for your products and/or services, a polished website for your professional services firm, or an educational website for your online courses, our experts can build it for you on WordPress.com, the most powerful platform for businesses and enterprises large and small.”"
  ],
  "headers": {
    "3": "Fresh competition"
  },
  "links": {
    "WordPress.com": "https://www.techradar.com/reviews/wordpresscom",
    "Built By WordPress.com": "https://wordpress.com/built-by-wordpress-com/"
  }
}