{
  "source": "https://www.techradar.com/news/hostpapa-acquires-us-based-web-hosting-firm-ihost-networks",
  "title": "HostPapa acquires US-based web hosting firm iHost Networks",
  "category": "computing",
  "updated": "2021-06-02T16:36:49Z",
  "author": "abigail-opiah",
  "summary": "The transaction is part of HostPapa's US expansion strategy",
  "article": [
    "In a bid to expand its reach in the US, Canadian web hosting and cloud service provider HostPapa has acquired iHost Networks for an undisclosed sum.",
    "Based in Seattle, Washington, iHost was founded in 1996 and focuses on providing web hosting, email services, domains, and on-demand web applications to small business owners, with an emphasis on human-based customer support.",
    "HostPapa, too, provides web hosting services for SMBs worldwide, and has been doing so since 2006.",
    "iHost reassured its customers that their servers will remain hosted on the west coast of the United States, and as an addition, those businesses will get a server upgrade as HostPapa has made a significant investment in infrastructure.",
    "The company is also promising faster loading times and greater reliability for the SMBs running their websites on their services.",
    "Current iHost customers will not be required to do anything as the firm work on updating its server performance post-acquisition, which is set to be in line with that of servers provided by HostPapa.",
    "When asked about the acquisition, Jamie Opalchuk, HostPapa founder & CEO said: \"We'd like to give a warm welcome to iHost customers as they join the HostPapa family.",
    "\"Customers from recent acquisitions, including Silicon Valley Web Hosting and Canvas Host, have experienced a seamless transition to HostPapa. We're certain that iHost customers, too, will see immediate improvements in website performance and customer support availability.\"",
    "The deal came shortly after HostPapa announced a $1.1 million in financing deal with managed WordPress hosting provider Rocket.net two weeks ago."
  ],
  "headers": {
    "3": "iHost is now HostPapa"
  },
  "links": {
    "web hosting": "https://www.techradar.com/web-hosting/best-web-hosting-service-websites",
    "cloud service": "https://www.techradar.com/news/the-best-cloud-storage",
    "web hosting services for SMBs": "https://www.techradar.com/web-hosting/best-small-business-web-hosting",
    "customers": "https://www.techradar.com/news/hostpapa-ushers-rocketnet-into-growth-program-with-dollar11m-financing",
    "$1.1 million in financing deal": "https://www.techradar.com/news/hostpapa-ushers-rocketnet-into-growth-program-with-dollar11m-financing",
    "managed WordPress hosting": "https://www.techradar.com/news/best-managed-wordpress-hosting"
  }
}