{
  "source": "https://www.techradar.com/news/is-the-forza-horizon-5-controller-the-best-looking-xbox-pad-ever",
  "title": "Is the Forza Horizon 5 controller the best looking Xbox pad ever?",
  "category": "gaming",
  "updated": "2021-08-24T18:24:14Z",
  "author": "adam-vjestica",
  "summary": "A Mexican celebration",
  "article": [
    "Forza Horizon 5 is getting its very own custom Xbox Series X controller to celebrate the launch of Playground Games' next entry in the open world racing series. The controller's vibrant color scheme is inspired by the game's gorgeous new setting, Mexico, and it makes it look as though it's been plucked straight out of the game's own Horizon Festival. The translucent design lets you see all the inner workings of the Xbox Series X controller, like the rumble motors, which are sure to kick into gear when you're careering down a mountain and through the lush jungles the game provides.",
    "The rear of the controller features a pink Horizon logo, and what looks to be an extremely comfy and tactile grip on the back of the pad, almost akin to what you'd find on a steering wheel.",
    "Of course, the controller is also compatible with Xbox One, as well as PC and mobile devices via Bluetooth, so if you're in the market for a new pad, this could be the one.",
    "If you pick up the Forza Horizon 5 controller, you also get some exclusive DLC for a Forza edition car, cosmetic item and a victory emote. You can pre-order the limited edition controller today for $74.99 / £59.99 and it will launch alongside the game on November 9.",
    "Microsoft also recently announced the Aqua Shift Special Edition controller, which features a color-shifting blue shimmer and rubberized side grips that come with a unique dual-color swirl on every unit.",
    "The Forza Horizon 5 controller marks the eighth custom pad we've seen so far for Xbox Series X|S, giving players plenty of choice. Of course, you can also design your very own custom controller at Xbox Design Lab, if you want to make things really personal.",
    "If you're interested in a pro gaming option, Scuf has also got in on the action. Two new controllers in the form of the Instinct and Instinct Pro are now available to purchase, and they give the Xbox Elite Wireless Controller Series 2 a run for its money."
  ],
  "headers": {},
  "links": {
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5",
    "Xbox Series X controller": "https://www.techradar.com/reviews/xbox-wireless-controller-2020",
    "pre-order": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1361327003685531400&murl=https%3A%2F%2Fwww.xbox.com%2Fen-US%2Faccessories",
    "Aqua Shift Special Edition controller": "https://www.techradar.com/news/new-xbox-wireless-controller-aqua-shift-special-edition-is-sleek-and-shimmery",
    "Xbox Design Lab": "https://www.techradar.com/news/xbox-design-lab-has-reopened-for-custom-xbox-series-x-controllers",
    "Scuf": "https://www.techradar.com/news/scufs-instinct-controller-gives-pro-gamers-even-more-choice-on-xbox-series-x",
    "Xbox Elite Wireless Controller Series 2": "https://www.techradar.com/reviews/xbox-elite-wireless-controller-series-2-review"
  }
}