{
  "source": "https://www.techradar.com/news/get-out-and-minari-stars-team-up-in-jordan-peeles-next-horror-flick",
  "title": "Get Out and Minari stars team up in Jordan Peele's next horror flick",
  "category": "entertainment",
  "updated": "2021-07-23T09:47:28Z",
  "author": "henry-st-leger",
  "summary": "Nope nope nope nope nope",
  "article": [
    "Comedian and horror auteur Jordan Peele has dropped an intriguing teaser for Nope, an upcoming horror flick starring Get out star Daniel Kaluuya and Minari's Steven Yeun.",
    "Peele announced the film over on Twitter, posting a curious movie poster of a cloud hanging over a small, brightly-lit town, with the film's release date and three of the film's starring cast (scroll down to see the poster in full).",
    "Nope is slated for release on July 22, 2022, meaning we have a full year to wait until the twisted mind behind 2019's Us and 2017's Get Out hit cinemas.",
    "The film will mark a reunion of Jordan Peele and Daniel Kaluuya, the lead actor in get Out, with Keke Palmer (Hustlers) and Steven Yeun (Minari, Invincible) also set to appear. It's an impressive cast, but wholly unsurprising given Peele's draw as a director.",
    "Nope will, it seems, be landing \"only in theaters,\" though we have seen film distribution plans change quite regularly amidst the uncertainty of the ongoing Covid-19 pandemic.",
    "Speculation is predictably rife around the meaning of the film's poster, which shows an ominous, dark cloud hanging over a brightly-lit town. It seems to be in a secluded area, likely rural America, with mountains and fields surrounding the small patch of civilisation.",
    "The cloud also has a long string of decorative flags hanging out from its underside – the kind of thing you'd find at a birthday party, or even a carnival or circus. Something is almost certainly within the cloud – and, we expect, about to descend on the unsuspecting people below – though we'll likely have to wait until a proper teaser trailer to see more. Haunted circus? Death itself riding into town on a cloud? A poisonous rain that reveals someone's inner (and violent) nature?",
    "With Peele's previous flicks having tackled the dark underside of seemingly 'liberal' white America, and the horrors of facing your own doppelgänger, the only thing we're confident in is his ability to make us deeply uncomfortable, terrified, and amused all at once – we just hope it's not a send-up of It, because we're all scared-out of clowns right now."
  ],
  "headers": {
    "5": "Analysis: If anyone can make clouds scary, it's Jordan Peele"
  },
  "links": {
    "Invincible": "https://www.techradar.com/news/invincible-season-2"
  }
}