{
  "source": "https://www.techradar.com/news/after-vampires-werewolves-may-be-the-mcus-next-big-surprise",
  "title": "After vampires, werewolves may be the MCU's next big surprise",
  "category": "entertainment",
  "updated": "2021-07-20T15:08:19Z",
  "author": "tom-power",
  "summary": "Is Marvel preparing to introduce werewolves to the MCU?",
  "article": [
    "The evolution of the MCU into the Marvel Cinematic Multiverse (MCM) in Loki episode 6 presents Marvel Studios with numerous options for its forthcoming movies and TV shows.",
    "We already know that productions like Spider-Man: No Way Home and Doctor Strange in the Multiverse of Madness will be affected, but what about other upcoming projects in Phase 4 and beyond?",
    "If recent rumors are to be believed, Marvel executives might be about to take the MCM in some surprising directions – including the introduction of werewolves.",
    "Yes, you read that right: werewolves. We already know that vampires will arrive in the MCM in Marvel's Blade reboot, but werewolves?",
    "That's according to Kevin Smith, who recently revealed that he wasn't allowed to introduce werewolves as part of a previous pitch for a Howard the Duck TV show, which was supposed to be developed for Hulu before Disney and Marvel cancelled the project.",
    "Speaking on the latest episode of his Fatman Beyond podcast, Smith explained that Marvel Studios prevented him from using its werewolf-infused characters because they had plans to use them in the future.",
    "\"In my head, as I started building my season, I was like, 'Alright. Episode 5. Werewolf by Night,'\" Smith said. \"The idea of our story was that Howard was trapped here and he was trying to get pages of the Darkhold, which would allow him to go back.",
    "\"As I'm laying it out... I go into Jeph [Loeb, ex-Marvel Television Vice President] and told him what I wanted to do, and that's when they said 'You can't use Werewolf by Night,' and I asked why. They said the movie division was using him.\"",
    "Without taking a deep dive into comics history, The Werewolf by Night is the pseudonym of two Marvel characters who mutate into lycans (under a Full Moon) and are granted superhuman strength, agility, speed and increased healing factor among other abilities.",
    "Jack Russell was the first Werewolf by Night, and made his comic debut in Marvel Spotlight #2 in February 1972. He was the only werewolf in Marvel comics until Jake Gomez was introduced in Werewolf by Night Volume 3 in October 2020.",
    "Russell and Gomez are the two major lycanthropes who exist in the Marvel comic universe, and both reside in the comics' prime universe, which is designated as Earth-616.",
    "If Smith was denied the opportunity to introduce Russell and Gomez as part of his now-defunct Howard the Duck TV show, because Marvel wanted to use them in their in-house projects, where could either werewolf appear?",
    "The smart money is during an upcoming Disney Plus TV series Moon Knight.",
    "In the comics, Moon Knight (who will be played by Oscar Isaac in Marvel's TV show) has a long history with Jack Russell's werewolf, so you would expect Russell to crop up in Moon Knight's forthcoming series if Marvel has plans to introduce werewolves in the near future.",
    "Of course, this is speculation on our part based on Smith's comments. However, it can't be a coincidence that Smith revealed he couldn't use werewolves in his Marvel project and a Moon Knight series being in active development at this moment in time. Russell's werewolf may only appear in a cameo appearance in Moon Knight, but it would be enough to prove that werewolves exist in the MCM.",
    "If Russell or Gomez aren't cast in Moon Knight, they could appear in Marvel's Blade reboot. That movie is preparing to introduce vampires to the MCM, so adding in one or two werewolves wouldn't be a stretch, given its supernatural angling.",
    "Finally, Doctor Strange 2 would be an outsider for a werewolf's MCU debut. That film will explore the multiverse in more detail and, given that Russell's lycanthropy has ties to the Darkhold – the book we saw in WandaVision that may also play a part in Doctor Strange's sequel – the Sorcerer Supreme may bump into Russell on his travels.",
    "Curiously, a Werewolf by Night film adaptation was in the works back in 2005, but that project clearly wasn't taken forward. Add in Smith's failed Howard the Duck series, and werewolves haven't had a very good time of it in live-action terms.",
    "It's unclear if Marvel Studios will introduce werewolves in the future. The fact that they refused to let Smith use them, though, means that Marvel might have plans to establish them in the MCM at some point – and we'd certainly like to see it happen."
  ],
  "headers": {
    "8": "Analysis: who are Marvel's werewolves and where could they appear?"
  },
  "links": {
    "Loki episode 6": "https://www.techradar.com/news/loki-episode-6-ending-explained",
    "Spider-Man: No Way Home": "https://www.techradar.com/news/spider-man-no-way-home-release-date-cast-plot-and-what-we-know",
    "Doctor Strange in the Multiverse of Madness": "https://www.techradar.com/news/doctor-strange-in-the-multiverse-of-madness-release-date-cast-plot-and-more",
    "Fatman Beyond podcast": "https://www.youtube.com/watch?v=py4bKPoj9fA",
    "Marvel's Blade reboot": "https://www.techradar.com/news/blade-movie-lands-its-director-and-its-another-indie-hire-for-the-mcu"
  }
}