{
  "source": "https://www.techradar.com/news/halo-infinite-could-be-getting-a-battle-royale-mode-after-all",
  "title": "Halo Infinite could be getting a battle royale mode after all",
  "category": "gaming",
  "updated": "2021-08-02T11:54:44Z",
  "author": "adam-vjestica",
  "summary": "Listen to this, Spartans",
  "article": [
    "It’s been heavily rumored that Halo Infinite could get its own battle royale mode when the game releases sometime during Holiday 2021, but so far, developer 343 Industries has repeatedly poured cold water on any speculation that has arisen.",
    "However, new evidence has surfaced that gives us the strongest indication yet that a last-man standing style game type could be included in Halo Infinite in the future.",
    "As spotted by PCGamesN, dataminers have already found spoilers relating to Halo Infinite’s campaign in the game’s technical preview, but now a voice recording performed by the game’s legendary multiplayer announcer, Jeff Stitzer, has also been discovered.",
    "In the voice clip, Stitzer can clearly be heard saying \"Battle Royale.\" As Halo fans will be all too aware, the game’s announcer always calls out the multiplayer mode you’re playing before a match begins, such as \"Slayer\" or \"Oddball,\" so the presence of a dedicated battle royale callout is interesting to say the least.",
    "But does this voice recording confirm that Halo Infinite will definitely get a battle royale mode, then? Not necessarily. As commenters on Resetera have rightly pointed out, the developers could have had Stitzer record this clip for any number of reasons. It could be for a future update or even a custom game mode, but there’s no doubt that 343 Industries has at least thought about the possibility.",
    "While it’s fair to say that the battle royale genre has long past its honeymoon phase, PUBG, Apex Legends and Call of Duty: Warzone continue to be some of the most played online multiplayer games around. Having an established franchise like Halo would immediately make it appealing to those who enjoy the battle royale format as a whole, and it helps that the game’s multiplayer will be free-to-play.",
    "However, adding a battle royale mode to Halo Infinite would be a huge undertaking for the team. Not only would new maps need to be created to support a battle royale style experience, but balancing and technical considerations would also be a concern. We’ve seen Halo build upon its Big Team Battle mode with Warzone in Halo 5, but even then the maps would need to be significantly larger.",
    "If a battle royale mode does come to Halo Infinite, we’d expect it to be a more refined and tailored experience that works in the framework of Halo, as opposed to trying to replicate something on the scale of Call of Duty: Warzone or even Apex Legends.",
    "The good news is that impressions of Halo Infinite’s multiplayer have been almost overwhelmingly positive during the game’s technical preview event, so even if a battle royale mode doesn’t arrive, Halo purists can at least look forward to potentially one of the best Halo multiplayer experiences to date.",
    "Halo Infinite is scheduled to release sometime during Holiday 2021 (between November and December) for Xbox One, Xbox Series X/S and PC. It will also be available to Xbox Game Pass subscribers on day one."
  ],
  "headers": {
    "5": "Analysis: A battle royale mode for Halo Infinite makes sense"
  },
  "links": {
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "PCGamesN": "https://www.pcgamesn.com/halo-infinite/battle-royale-mode",
    "Halo Infinite’s campaign in the game’s technical preview": "https://www.techradar.com/news/halo-infinite-campaign-spoilers-leak-from-technical-preview",
    "voice clip": "https://vocaroo.com/1m0yeBkrd0ni",
    "Resetera": "https://www.resetera.com/threads/halo-infinite-technical-preview-datamine-uncovers-sound-clip-for-possible-battle-royale-mode.464754/",
    "PUBG": "https://www.techradar.com/news/pubg-news-and-updates-whats-new-in-playerunknowns-battlegrounds",
    "Apex Legends": "https://www.techradar.com/reviews/apex-legends-review",
    "Call of Duty: Warzone": "https://www.techradar.com/reviews/call-of-duty-warzone",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass"
  }
}