{
  "source": "https://www.techradar.com/news/intel-records-mixed-q1-but-pc-sales-offer-a-silver-lining",
  "title": "Intel records mixed Q1, but PC sales offer a silver lining",
  "category": "computing",
  "updated": "2021-04-23T16:02:49Z",
  "author": "mayank-sharma",
  "summary": "New Intel CEO calls 2021 a 'pivotal year' for the company",
  "article": [
    "Intel has beaten analyst revenue expectations for the first quarter of 2021, riding primarily on strong growth in PC sales.",
    "While overall Q1 revenue was down year-on-year due to lethargic sales in the Data Center Group (down 20%), this was more than offset by PC sales. As compared with Q1 2020, PC shipments were up 38 percent, while notebook volumes recorded a jump of 54%, a new record for the company.",
    "In terms of absolute revenue, Intel's PC business (recorded under the Client Computing Group) brought in Q1 2021 revenues of $10.6 billion, which represents growth of eight percent.",
    "Q1 2021 was also significant for the company as it experienced a change in leadership with the arrival of a new CEO, Pat Gelsinger, in January 2021.",
    "Soon after taking over, Gelsinger unveiled Intel’s new integrated device manufacturing (IDM) strategy, with plans to invest $20 billion in two new chip making factories, as part of his plans to improve the company’s fortunes.",
    "\"The response to our new IDM 2.0 strategy has been extraordinary, our product roadmap is gaining momentum, and we're rapidly progressing our plans with re-invigorated focus on innovation and execution,\" said Gelsinger in a statement.",
    "Besides desktops and laptops, Intel also sells high-performance chips for data centers. Intel experienced elevated sales from this group last year as companies ramped up their data centers in order to better support remote workers.",
    "However, with increased competition in the data center segment from its peers, Intel’s Data Center group experienced a decline in Q1 2021. The segment took in $5.6 billion in revenue, down 20% on the same quarter last year.",
    "On the plus side, though, Intel noted that it's already seeing an initial pickup in Enterprise and Government sales after the lull in the previous quarter.",
    "Gelsinger refers to 2021 as a “pivotal year” for the company.",
    "“We are setting our strategic foundation and investing to accelerate our trajectory and capitalize on the explosive growth in semiconductors that power our increasingly digital world,\" he added.",
    "For Q2 2021, the company expects $17.8 billion in revenue, which is a touch higher than analyst expectations, at $17.55 billion.",
    "Via ZDNet"
  ],
  "headers": {
    "4": "New direction",
    "7": "Pivotal year"
  },
  "links": {
    "Intel": "https://www.techradar.com/news/best-intel-processors-2019-the-best-cpus-from-team-blue",
    "PC": "https://www.techradar.com/news/computing/pc/10-of-the-best-desktop-pcs-of-2015-1304391",
    "notebook": "https://www.techradar.com/news/the-best-laptop-deals",
    "new CEO": "https://www.techradar.com/news/intel-chooses-vmwares-pat-gelsinger-to-replace-bob-swan-as-ceo",
    "(IDM) strategy": "https://www.techradar.com/news/intel-set-to-spend-billions-on-new-chip-factories",
    "ZDNet": "https://www.zdnet.com/article/intel-beats-q1-expectations-with-strong-pc-sales/"
  }
}