{
  "source": "https://www.techradar.com/news/motorola-edge-20-announced-including-a-surprisingly-top-tier-cheap-5g-phone",
  "title": "Motorola Edge 20 announced, including a surprisingly top-tier cheap 5G phone",
  "category": "phones",
  "updated": "2021-07-29T15:39:46Z",
  "author": "tom-bedford",
  "summary": "Three new Android phones",
  "article": [
    "We were expecting the Motorola Edge 20 series to launch at some point, but it still came as quite a surprise when the popular phone company launched its new flagship handset line without any pomp or circumstance, instead dropping it rather out of the blue.",
    "There are three handsets in the range - the base Motorola Edge 20, the more premium Edge 20 Pro, and an affordable Edge 20 Lite - these are successors to the Edge and Edge Plus from 2020, though the Motorola One 5G could be considered the 'Lite' member of that family.",
    "Curiously, none of these three new phones have curved-edge screens, despite that being what the original Edges were named after. Who knows why - we'll run you through these handsets below, but all the phones provide access to the Ready For system debuted on the Moto G100.",
    "The phones have lots of specs in common, but the Motorola Edge 20 Lite sounds like the real winner, with a super-low price but lots of the top-tier specs of its siblings.",
    "These phones have been confirmed to launch soon, and we've got definite UK pricing for them all - when we hear the cost or launch plans in other regions, we'll let you know. We'll also make sure to review these handsets as soon as we're able.",
    "The 'vanilla' phone in the series has the same 108MP main and ultra-wide camera as its Pro sibling, which we'll detail below, but the third snapper is a telephoto for 3x optical and 30x digital zoom, not the periscope of the Pro.",
    "The OLED screen is also the same at 6.7 inches across with a 144Hz refresh rate, and notably it doesn't curve at the edges.",
    "The phone doesn't sound super powerful, with the mid-range Snapdragon 778G processor, though that fits the price. It has 8GB of RAM and 256GB of storage.",
    "We're dubious about the 4,000mAh battery, as that sounds a little on the small side, but the 30W charging is about standard for a device at this price.",
    "The UK price of the phone is £429.99, which converts to about $600 or AU$810, making it a fair mid-ranger. There's a gray, white or green model of the device.",
    "This budget phone has a price that positions it more like a Moto G phone than an Edge one.",
    "It has the same 6.7-inch OLED screen as its siblings, and it also has the same 108MP camera, which is pretty surprising at this price. There's also an ultra-wide camera but it's not clear if there are other lenses.",
    "The phone uses an unspecified MediaTek chipset with 8GB of RAM and it's 5G-enabled. The battery is 5,000mAh, which is nice and big, and the 30W charging from its siblings is here too.",
    "The top-end phone in the new Edge line has a 108MP main camera as well as an ulta-wide and periscope camera, the latter of which supports 5x optical or 50x digital zoom. The handset also records 8K video.",
    "You'll find the phone has a 6.7-inch OLED screen that supports HDR10+, and has a 144Hz refresh rate, which is rare for non-gaming phones - though matched by cheaper models in the range.",
    "The phone has the Snapdragon 870 chipset - notably not the top Snapdragon 888, though it's not that much weaker - as well as 12GB of RAM and 256GB of storage.",
    "Charging is 30W, though we don't know the actual battery capacity - Motorola says it'll last 30 hours between charges but that doesn't tell us much.",
    "In the UK, the Edge 20 Pro will cost £649.99 (roughly $910, AU$1,230) and it comes in blue or white, though there's a third option that's also blue but coated in faux leather."
  ],
  "headers": {
    "5": "Motorola Edge 20",
    "10": "Motorola Edge 20 Lite",
    "13": "Motorola Edge 20 Pro"
  },
  "links": {
    "Motorola Edge 20": "https://www.techradar.com/news/motorola-edge-20",
    "Edge": "https://www.techradar.com/reviews/motorola-edge-review",
    "Edge Plus": "https://www.techradar.com/reviews/motorola-edge-plus-full-review",
    "Motorola One 5G": "https://www.techradar.com/reviews/moto-g-5g-plus-review",
    "Moto G100": "https://www.techradar.com/reviews/moto-g100-review"
  }
}