{
  "source": "https://www.techradar.com/news/zack-snyders-justice-league-trailer-drops-and-shows-batman-meeting-the-joker",
  "title": "Zack Snyder's Justice League trailer drops – and shows Batman meeting the Joker",
  "category": "entertainment",
  "updated": "2021-02-14T17:52:33Z",
  "author": "samuel-roberts",
  "summary": "Get a first full look at Snyder's version of the 2017 movie, coming next month",
  "article": [
    "The trailer for Zack Snyder's Justice League has finally dropped. Featuring glimpses of Superman in his black costume, the DC villain Darkseid and a never-before-seen sequence with Jeremy Irons' Alfred, the trailer definitely looks more like what we'd expect from Snyder's version of the film than the 2017 theatrical cut (that is to say, it has fewer jokes).",
    "We also get a first look at Jared Leto's Joker as he appears in the film, opposite Ben Affleck's Batman. Snyder shot new scenes to include the Dark Knight's ultimate villain in his cut of the movie, set against the backdrop of an Earth conquered by Darkseid – as previously depicted in Batman Vs Superman.",
    "Take a look at the trailer for yourself below. Zack Snyder's Justice League launches as one four-hour epic on March 18 for HBO Max in the US.",
    "HBO Max will stream the film in 4K with HDR10 if you've got a compatible device. If you live in the UK, it's unclear when you'll get a chance to see the film – we previously reached out to Warner Bros UK for clarity but didn't get an answer.",
    "While we'll do a more direct comparison when the movie releases, the tone is the big change here – the original version of Justice League was rife with gags, some of which landed, and others of which felt out of place. This trailer doesn't really have any of those: it's trying to sell an epic-scale battle film, one that some fans felt they were denied by the 2017 theatrical cut.",
    "We're fully expecting a film that hews closer in style and mood to Snyder's previous DC projects, Man of Steel and Batman Vs Superman: Dawn of Justice, and that's no doubt what the fans who made this happen want too.",
    "The official synopsis for the Snyder Cut hints at something more psychological than we saw in the version that reached theater screens. While the basic shell of the story is the same – Bruce Wayne is trying to bring together a team of \"metahumans\" to save the world from an incoming alien threat, following the death of Superman – it sounds like the different members of the team have more of their own baggage to deal with.",
    "\"The task proves more difficult than Bruce imagined, as each of the recruits must face the demons of their own pasts to transcend that which has held them back, allowing them to come together, finally forming an unprecedented league of heroes,\" says the synopsis.",
    "Considering the original cut ran at 120 minutes and this is expected to be four hours long, you'd hope to see a little more focus placed on the characterization of the different heroes this time.",
    "But will it be good? We'll have to wait and see – like Snyder's past DC films, however, we expect something that's contentious, but loved by at least one passionate corner of the internet.",
    "At least it'll be nice to have one new(ish) superhero movie to watch next month before The Falcon and the Winter Soldier eats all our attention on March 19."
  ],
  "headers": {
    "4": "What's different in the trailer for Zack Snyder's Justice League?"
  },
  "links": {
    "Zack Snyder's Justice League": "https://www.techradar.com/news/zack-snyders-justice-league-has-a-final-release-date-on-hbo-max",
    "The Falcon and the Winter Soldier": "https://www.techradar.com/news/the-falcon-and-the-winter-soldier-explained-everything-in-one-place"
  }
}