{
  "source": "https://www.techradar.com/news/mortal-kombat-ending-explained-who-is-cole-young",
  "title": "Mortal Kombat ending explained: who is Cole Young?",
  "category": "entertainment",
  "updated": "2021-04-23T11:56:02Z",
  "author": "tom-power",
  "summary": "Will there be a Mortal Kombat sequel?",
  "article": [
    "Spoilers follow for Mortal Kombat.",
    "Mortal Kombat has finally landed in the US. Warner Bros.' R-rated movie, based on the iconic video game fighting series, is out now on HBO Max and, while it's a visceral feast for the eyes, it's a pretty clunky film overall.",
    "Still, you're reading this explainer article to find out more about Mortal Kombat's ending. There are a few things to digest once the credits roll and you may have questions about where the movie series could go from here, if there's a Mortal Kombat sequel.",
    "With that in mind, on this page we'll explain who Cole Young is and his ties to Scorpion, how the movie ends and whether there'll be a sequel or four based on what the final scene teases.",
    "Fair warning, though: we're about to enter spoiler territory from this point on. If you've accidentally clicked on this article and haven't watched the movie yet, turn back now or it'll be ruined for you.",
    "Cole Young is an original character who was created specifically for the 2021 Mortal Kombat movie. As such, he hasn't appeared in any video game, but that doesn't mean that he isn't tied to one of the series' most iconic characters.",
    "It turns out that Cole is a descendant of Hanzo Hasashi, who is one of the greatest ninjas who ever lived and the person who ends up becoming Scorpion.",
    "After Hanzo's wife and eldest son are killed by Bi-Han - aka Sub-Zero - in the movie's opening scene, Hanzo and Bi-Han fight in a battle to the death. Sub-Zero ends up defeating Hanzo and, thinking he's finally ended the Hasashi bloodline, leaves Hanzo to die.",
    "Awakened by the cries of his youngest child, who Hanzo's wife had hidden in a secret area of the house before Sub-Zero's attack, a half-dead Hanzo tries desperately to reach them but dies in the process. Consumed by revenge, his soul becomes trapped in Hell, biding its time until someone releases him as Scorpion to seek justice for his family's death.",
    "Moments after Hanzo's death, Lord Raiden - the Thunder God - arrives and rescues Hanzo's infant daughter. In doing so, Raiden ensures the survival of the Hasashi bloodline, which is vital if an ancient prophecy about the Hasashi family is to come true. This prediction foreshadows the arrival of a new Hasashi champion, who will unite Earthworld's greatest warriors to prevent the villainous Outworld from conquering the planet.",
    "Centuries later, Cole is born bearing a dragon mark, which identifies him as one of Earthworld's champions. He's a descendant of the Hasashi bloodline, but he isn't Scorpion's son.",
    "Hanzo and his family were killed in the year 1617, and Mortal Kombat takes place in the present day. Cole's ancestors, then, include Hanzo and his Shirai Ryu clan, but he can't be Hanzo's son due to the time jump.",
    "Mortal Kombat's ending sees Lord Raiden and his Earthworld champions pitted against Shang Tsung's Outworld invaders for the future of Earth.",
    "After Kung Lao is killed by the soul-eating Shang Tsung during a previous bout - one which Raiden's champions easily lose - Cole proposes a plan to split Shang Tsung's forces up, engage them in one-on-one fights and kill them. The group agrees to carry out Cole's plan but, before they do, Raiden gifts Cole with Hanzo's kunai to use in the final showdown with Sub-Zero. Raiden secured the kunai when he saved Hanzo's daughter in 1617, knowing full well that it would come in handy one day.",
    "Liu Kang and Jax kill Kabal and Reiko respectively, while Sonya Blade takes out Kano. The latter's dragon mark transfers to Sonya, as per the rules of Mortal Kombat, and she uses her newfound abilities to help Cole defeat Mileena.",
    "With Shang Tsung's other warriors dead, Sub-Zero shows up and Earth's champions prepare to defeat him together. However, Sub-Zero has captured Cole's wife and daughter - mirroring his fight with Hanzo at the beginning of the movie - and lures an enraged Cole into a one-on-one battle at Cole's cage fighting dojo.",
    "Cole is no match for Sub-Zero's prowess and, in a last-ditch bid, unknowingly combines his blood with Hanzo's kunai to release Scorpion from Hell. Scorpion recognizes Cole as his descendant, and the duo team up to subdue Sub-Zero and rescue Cole's family. Scorpion seemingly kills Sub-Zero with hellfire breath and, before departing, asks Cole to look after the Hasashi bloodline.",
    "Raiden and the other champions reunite with Cole, but their joy is short lived when Shang Tsung appears. He tells Raiden that he'll return to Earth with an army, and sends Sub-Zero's and Goro's seemingly dead bodies back to Outworld before Raiden banishes Shang Tsung from Earth. Raiden tells Cole and the others that they'll need to prepare for Shang Tsung's return and sends them off to find new champions.",
    "In the final scene, Cole clears out his cage fighting locker and tells his former employer that he's heading out to Los Angeles to find someone. The camera pans to a poster on the wall as Cole leaves, which confirms he's going west to find and potentially recruit another famous Mortal Kombat fighter - Johnny Cage.",
    "Mortal Kombat's final moments certainly suggest as much. While Johnny Cage is Cole's first assignment, there are other fan favorite characters that didn't appear in the movie. Cole, Sonya and the other champions will need to find more and convince them to join Raiden's cause, which is what Mortal Kombat 2 would likely entail.",
    "Joe Taslim, who portrays Bi-Han/Sub-Zero, has already revealed that he's signed on for another four movies if the first film proves to be a success. So far, the film has pulled in less than $20 million at the global box office, but its earnings will have been hampered by how many cinemas are open internationally due to the Covid-19 pandemic.",
    "A sequel, then, will ultimately depend on how well Mortal Kombat does in US theaters and on HBO Max. Currently, the movie has a 55% approval rating on Rotten Tomatoes. While it hasn't been critically well-received, its HBO Max viewing figures and domestic box office haul might convince Warner Bros. to greenlight a follow-up. It's unclear at this point if the studio will grant director Simon McQuoid another entry in the series, but fans will certainly hope for one, if nothing more than to see Johnny Cage in action."
  ],
  "headers": {
    "5": "Mortal Kombat ending explained: is Cole Young Scorpion's son?",
    "12": "Mortal Kombat ending explained: searching for Johnny Cage",
    "19": "Mortal Kombat ending explained: will there be a sequel?"
  },
  "links": {
    "Mortal Kombat": "https://www.techradar.com/news/how-to-watch-mortal-kombat-online-see-where-to-stream-new-movie",
    "HBO Max": "https://trk.hbomax.com/aff_c?offer_id=5&aff_id=1026&source=trd&aff_click_id=trd-us-4984896680573673000&url=https%3A%2F%2Fwww.hbomax.com%2F%3Foffer_id%3D%7Boffer_id%7D%26transaction_id%3D%7Btransaction_id%7D%26affiliate_id%3D%7Baffiliate_id%7D%26aff_click_id%3D%7Baff_click_id%7D%26utm_source%3D%7Baffiliate_name%7D%26utm_medium%3Daffiliate&aff_sub2=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fmortal-kombat-ending-explained-who-is-cole-young",
    "Mortal Kombat sequel": "https://www.techradar.com/news/mortal-kombat-may-get-a-sequel-but-what-does-it-depend-on",
    "another four movies": "https://variety.com/2021/film/news/chanel-oscars-mortal-kombat-joe-taslim-shamier-anderson-twilight-stowaway-1234956412/",
    "Rotten Tomatoes": "https://www.rottentomatoes.com/m/mortal_kombat_2021"
  }
}