{
  "source": "https://www.techradar.com/news/samsung-reckons-the-galaxy-z-fold-3-is-perfect-for-video-calls-but-were-not-so-sure",
  "title": "Samsung reckons the Galaxy Z Fold 3 is perfect for video calls, but we're not so sure",
  "category": "phones",
  "updated": "2021-08-12T12:06:19Z",
  "author": "joel-khalili",
  "summary": "Samsung wants you to rely on the Galaxy Z Fold 3 for video conferencing and collaboration",
  "article": [
    "Samsung has made confident claims about its latest foldable smartphone, the Galaxy Z Fold 3, which has been pitched as an ideal tool for work as well as play.",
    "At yesterday’s Galaxy Unpacked event, Samsung argued that the various opportunities to divide up screen real estate make its new foldable perfectly suited to collaboration and video conferencing use cases.",
    "For example, users could prop the device up on a table or in their lap, with their coworkers displayed on the bottom half of the folding screen and presentation material above.",
    "However, while the Galaxy Z Fold 3 is broadly impressive from a design standpoint and the under-screen camera is certainly nifty, not everything about Samsung’s video conferencing proposition makes sense.",
    "The main question revolves around why, given the 4MP f/1.8 camera on the inner screen is the lowest quality of any camera on the device, people would opt to use it for video calls.",
    "In our hands-on analysis, we noted that the inner camera performs notably less well than the camera on the front screen, producing images that are far less sharp. Others have reported a measure of distortion caused by light sources in the background and when the subject of the video is in motion.",
    "These issues are likely caused by the technology that makes the under-screen camera possible. The pixels that sit on top of the lens, although much less densely packed than in the main screen, appear to have a sort of warping effect when the camera underneath is active.",
    "Admittedly, a level of compression is applied by video conferencing services in any case, limiting the quality of everyone’s video feed, but the inner screen camera is likely to be a step down nonetheless - especially if you’re used to a 4K webcam.",
    "The second question has to do with the likelihood of a scenario whereby someone would want to use the Galaxy Z Fold 3 in a standing orientation.",
    "Although the 7.3-inch inner screen is fairly large, when it’s divided up into segments content will appear relatively small on-screen, especially if the user is sitting upright at a table or desk. This is one of the obvious reasons people usually video call on mobile with their device in their hand, close to the face.",
    "Further, while the rise of hybrid working will admittedly require people to work from new locations and while on the move, in a scenario in which someone has space available to set up at a desk, isn’t their laptop or tablet also likely to be to hand?",
    "Beyond a desire to show off its new under-display technology, Samsung has offered little justification for the existence of the inner screen camera, other than its usefulness in video conferencing scenarios. But with everything taken into account, it’s unlikely to come in handy all that often."
  ],
  "headers": {
    "4": "Samsung Galaxy Z Fold 3 video calls"
  },
  "links": {
    "foldable smartphone": "https://www.techradar.com/best/best-foldable-phones",
    "Galaxy Z Fold 3": "https://www.techradar.com/reviews/samsung-galaxy-z-fold-3-review",
    "collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "webcam": "https://www.techradar.com/best/best-business-webcams",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "laptop": "https://www.techradar.com/news/best-business-laptops",
    "tablet": "https://www.techradar.com/news/best-business-tablets"
  }
}