{
  "source": "https://www.techradar.com/news/xbox-and-bethesda-at-e3-2021-five-huge-announcements-you-need-to-see",
  "title": "Xbox and Bethesda at E3 2021: five huge announcements you need to see",
  "category": "gaming",
  "updated": "2021-06-13T19:26:33Z",
  "author": "jordan-oloman",
  "summary": "The biggest announcements from the Xbox E3 2021 event",
  "article": [
    "Xbox and Bethesda combined forces to deliver their first joint E3 conference since Microsoft acquired ZeniMax Media in September last year.",
    "It was a blockbuster show full of exciting reveals and updates, but if you want to trim the fat, we’ve got all of the details on the five biggest announcements from the show right here.",
    "From Starfield to Redfall, and everything in between, here are the biggest announcements from the Xbox and Bethesda games showcase at E3 2021.",
    "Todd Howard kicked things off with one of the biggest reveals of the show. 25 years in the making, Starfield is described as a next-generation role-playing epic about hope and our shared humanity, and it finally has a release date.",
    "During the Xbox conference, we got our first look at in-engine visuals from the game, which was first teased back in 2018. The video introduced us to one of Starfield’s characters, who is part of a spacefaring movement called “Constellation”, described as “the last group of space explorers”. Players will take part in “the beginning of humanity’s final journey,” and explore many worlds.",
    "The other big piece of Starfield news is that it’s coming out on November 11, 2022. And if you were wondering if future Bethesda games would be Xbox-exclusive after Microsoft’s landmark 2020 acquisition, then we got a compelling answer here, one that was echoed throughout the show. As well as coming to PC, Starfield will be an Xbox console exclusive. Xbox Game Pass subscribers will also be able to access it on launch day.",
    "Xbox revealed a wholly new game during the opening of its E3 conference, soundtracked by Steely Dan’s ‘Do It Again’. Contraband is a co-op open-world game in development from Avalanche Studios, the developers behind Just Cause and Mad Max.",
    "It looks like you’ll play as treasure hunters, as the video showed a master plan for stealing loot from a fireproof safe. The footage also gave us a tiny glimpse at some of Contraband’s characters. Stuck in time, they were spotted reclining, likely discussing the next big score and fixing up a mucky truck. The game has a distinct 1970s theme, judging by the decor.",
    "Sadly we didn’t get any indication of a release date for Contraband, but it’s coming to Xbox Game Pass day one, and it will be an Xbox console exclusive. It sounds promising, especially for fans of the chaotic action and brilliant movement tech featured in Avalanche’s earlier games.",
    "Thanks to a wonderfully irreverent trailer from Obsidian, we learned that the studio is currently hard at work on a sequel to 2019’s The Outer Worlds. The Outer Worlds 2 is exclusive to Xbox, so that means it’s coming to Xbox Series X and Xbox Series S, Windows 10 and Xbox Cloud Gaming. Xbox Game Pass subscribers will also be able to play it on launch day, the trailer revealed.",
    "But uh, as for the trailer’s contents, the narrator made it clear that nothing is finished just yet, except for the game’s title. The CGI visuals were striking though, and there’s definitely scope to expand The Outer Worlds IP into a series of space-faring role-playing games. It’s just a shame that hulking trailer monster won’t be in the game, apparently. Sadly there was no gameplay to show just yet, but we’ll surely see it in time. Naturally, there’s also no word on a release date either, but at least we know it’s on the way!",
    "Playground Games revealed Forza Horizon 5 during the Xbox conference, and it’s set in Mexico. The sequel to 2018’s Forza Horizon 4 has some serious biodiversity, as the gameplay showed cars racing through detailed small towns and across volcanic mountain ranges.",
    "The wider preview showed that real players can link up and play together with very few strings attached thanks to upgraded server technology and the ‘Forza Link’ artificial intelligence system. One clip showed players seamlessly jumping into an event where they had to pop pinatas to win. Another more arcade-focused event had cars smashing into bowling pins in a manmade arena.",
    "The end of the trailer revealed that Forza Horizon 5 is coming to Xbox Series X and S, Xbox One, PC and Xbox Cloud Gaming. Xbox Game Pass subscribers will also be able to check out Forza Horizon 5 on launch day, which is November 9, later this year.",
    "Xbox closed the show with a huge reveal. Redfall is the next game from Arkane Austin (Prey, Dishonored) and it’s an open-world co-op shooter coming in Summer 2022 (so sometime between June and August). Redfall is named after the game’s setting, a town in Massachusetts where vampires have blocked out the sun.",
    "Redfall stars four characters, Devinder Crousley, Layla Ellison, Jacob Boyle and Remi De La Rosa. The trailer showed the four vampire hunters fighting hordes of bloodsuckers with robots and supernatural powers. The game’s website claims that Redfall is going to blend single and multiplayer options seamlessly, which means that you can have fun solo or with a group of four friends in co-op. There will also be “different hero loadouts” available to fine-tune your hunter and up the variety.",
    "Redfall is an Xbox console exclusive, which means it’s launching on Xbox and PC, and not PlayStation. It will also be available to Xbox Game Pass subscribers on launch day, which is sometime in Summer 2022."
  ],
  "headers": {
    "3": "Starfield is an Xbox exclusive and is coming in 2022",
    "6": "Contraband is a new co-op open-world game from Just Cause creators Avalanche Studios",
    "9": "Obsidian is making The Outer Worlds 2 and it’s an Xbox exclusive",
    "11": "Forza Horizon 5 is set in Mexico and coming on November 9",
    "14": "Arkane Austin’s next game is Redfall, an Xbox-exclusive open-world co-op shooter"
  },
  "links": {
    "E3 2021": "https://www.techradar.com/news/e3-2021",
    "Starfield": "https://www.techradar.com/news/starfield-release-date-trailers-and-news",
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "The Outer Worlds": "https://www.techradar.com/news/how-the-outer-worlds-escaped-the-shadow-of-fallout-according-to-its-creators",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Forza Horizon 5": "https://www.techradar.com/reviews/forza-horizon-5"
  }
}