{
  "source": "https://www.techradar.com/news/microsoft-teams-has-become-so-popular-it-may-actually-be-illegal",
  "title": "Microsoft Teams has become so popular it may actually be illegal",
  "category": "computing",
  "updated": "2021-10-13T10:50:02Z",
  "author": "mike-moore",
  "summary": "EU investigating Slack complaint about Teams Office integration",
  "article": [
    "For many of us, it has been one of the most important apps of the lockdown and remote working world, but Microsoft Teams could be in hot water following complaints from some of its rivals.",
    "The video conferencing tool is facing an investigation from European Union antitrust regulators after a protest from Slack.",
    "The online collaboration platform has complained that having the Microsoft Teams app so firmly integrated into the company's Office suite gives it an unfair advantage.",
    "According to Reuters, the European Commission has sent out a questionnaire to several Microsoft Teams rivals focusing on the period covering 2016 to 2021.",
    "The form covers a range of areas, including asking for a list of customers who have switched to Microsoft Teams or its bundled Office, as well as how much the pandemic has boosted demand for remote working tools such as video conferencing.",
    "Rivals will also be quizzed on any revenue losses seen since the launch of Teams, as well as any effect on research and development, and how it has affected the quality and price of their products.",
    "It's not known exactly which rivals are being consulted as part of the research, but it should be expected that Slack is involved, with other online collaboration giants such as Zoom, Google Meet and Cisco WebEx also likely to have been asked.",
    "Slack says that the bundling of Microsoft Teams with Office gives the tool a boost by suggesting it is the most suitable option for users. It also says that uninstalling Teams is unnecessarily complex, and Microsoft was refusing to provide guidance on how it would allow its service to work with rival platforms such as Slack.",
    "The company has asked the EU to split Teams and Office to make sure rival services such as itself are given a fair chance.",
    "Microsoft Teams has grown rapidly over the past 18 months due to the huge number of workers forced to work from home during the pandemic. The software is also set to play a central role in Windows 11, where it will be placed front and centre in the taskbar, with Microsoft apparently looking to make Teams 2.0 the one central communications hub for users.",
    "Via Reuters"
  ],
  "headers": {
    "3": "Teams dominance?"
  },
  "links": {
    "Microsoft Teams": "https://www.techradar.com/news/what-is-microsoft-teams-how-it-works-tips-and-tricks-and-best-alternatives",
    "video conferencing": "https://www.techradar.com/best/best-video-conferencing-software",
    "Slack": "https://www.techradar.com/reviews/slack",
    "online collaboration": "https://www.techradar.com/best/best-online-collaboration-tools",
    "Office": "https://www.techradar.com/news/microsoft-office-2021-release-date-pricing-features-and-everything-else-you-need-to-know",
    "Zoom": "https://www.techradar.com/news/what-is-zoom-how-does-it-work-tips-and-tricks-plus-best-alternatives",
    "Google Meet": "https://www.techradar.com/reviews/google-hangouts-meet",
    "Windows 11": "https://www.techradar.com/news/windows-11-home-and-pro",
    "Teams 2.0": "https://www.techradar.com/news/weve-had-a-clearer-look-at-microsoft-teams-20",
    "Reuters": "https://www.reuters.com/technology/eu-questions-microsoft-rivals-over-teams-integration-office-2021-10-08/"
  }
}