{
  "source": "https://www.techradar.com/news/youll-struggle-to-get-the-google-pixel-6-pro-anytime-soon",
  "title": "You'll struggle to get the Google Pixel 6 Pro anytime soon",
  "category": "phones",
  "updated": "2021-10-29T10:44:41Z",
  "author": "hamish-hector",
  "summary": "Can't get your hands on a Pixel 6 Pro? Join the club",
  "article": [
    "Google's new Pixel 6 and Pixel 6 Pro handsets are the best smartphones the company has released to date, and with an attractive price point to boot, they're a popular buy right now.",
    "It looks like they may be too popular though, as the Pixel 6 Pro now comes with a huge delivery delay thanks to \"high demand\".",
    "This has meant some people who preordered their Pixel 6 Pro will have to wait for their order to be fulfilled and new buyers will be put on a waiting list when looking to buy a Pixel 6 Pro from the official Google store - with delays extending into early next year.",
    "If you find yourself in this situation, Google recommends you first check out authorized third-party vendors - a recommendation we echo.",
    "In the UK we found stock at Currys and Carphone Warehouse - but were shown a low stock warning. The same was true at sites like Best Buy in the US, however the situation does look a little more dire - we found only a couple of packages were still available amongst a sea of 'unavailable' notices.",
    "So far the base Pixel 6 model hasn't been hit with the same widespread delays, though certain color variants have been briefly out of stock in different regions - one of our writers was unable to pre-order the green Pixel 6 they so desperately wanted, but it is now showing as in stock again.",
    "If you're desperate for a new phone you could opt for this cheaper alternative to the Pro, but you'll also miss out on some of the upgrades such as a telephoto camera and better quality display.",
    "Out-of-stock signs have been an all too familiar occurrence this past year with PS5 consoles, RTX 3080 GPUs, and smartphones just a few of the gadgets we've had to wait longer to get our hands-on.",
    "And the reason remains the same - it's because we're facing a global shortage of important components used in the tech we love.",
    "Even if stock hasn't quite run dry, consumers have seen the effects of the shortage. Audiophiles were hit earlier this year when Sonos increased the asking price of its speaker range despite not providing an improved service or any added bonuses.",
    "For companies the shortage has meant lower profits and revenue - Apple recently bemoaned the lack of computer chips and supply constraints when it announced its fourth-quarter revenues were over $1 billion short of its $84.85 billion target.",
    "Unfortunately, the problem is likely to persist through the holiday season too. Phil Spencer, the head of Xbox, recently announced that Xbox Series X shortages were set to continue into 2022 and the Apple iPhone 13 will continue to face bottlenecks too.",
    "This means you'll need to be extra vigilant if you want to snap up certain tech items in time for the holidays - otherwise there may be some disappointed faces when they don't unwrap the one gadget they really wanted.",
    "For the more budget-conscious consumer, the stock shortage likely means this year's Black Friday deals might be less amazing than we've seen before.",
    "Companies may be wary to sell off what little stock they have at a bargain - especially as huge sales could exacerbate any supply chain issues they are trying to deal with.",
    "Adding insult to injury is the fact we don't have a predicted end date. Supply chain woes should eventually ease but the constant threat of renewed Covid-19 related restrictions across the globe means that we could very easily be sent back to square one.",
    "So unless the threat of Covid-19 disappears overnight we may have to wait for Christmas 2022 to finally get the tech we want from Santa."
  ],
  "headers": {
    "7": "Analysis: all I want for Christmas is no stock shortages"
  },
  "links": {
    "Pixel 6": "https://www.techradar.com/reviews/google-pixel-6",
    "Pixel 6 Pro": "https://www.techradar.com/reviews/google-pixel-6-pro-review",
    "best smartphones": "https://www.techradar.com/news/best-phone",
    "official Google store": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-1131928146492833200/https://store.google.com/product/pixel_6_pro",
    "PS5": "https://www.techradar.com/news/why-ps5-shortage",
    "RTX 3080 GPUs": "https://www.techradar.com/reviews/nvidia-geforce-rtx-3080",
    "Sonos increased the asking price of its speaker range": "https://www.techradar.com/news/sonos-speakers-are-getting-more-expensive-for-no-real-reason",
    "Xbox Series X shortages were set to continue into 2022": "https://www.techradar.com/news/xbox-series-x-restock-issues-will-continue-to-be-a-challenge-for-quite-a-while",
    "Apple iPhone 13": "https://www.techradar.com/news/iphone-13-likely-more-scarce-through-december-as-shortages-continue",
    "Black Friday deals": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}