{
  "source": "https://www.techradar.com/news/nokia-restructure-sees-up-to-10000-jobs-at-risk",
  "title": "Nokia restructure sees up to 10,000 jobs at risk",
  "category": "computing",
  "updated": "2021-03-16T10:13:43Z",
  "author": "steve-mccaskill",
  "summary": "Nokia continues attempts to win 5G race",
  "article": [
    "Nokia has confirmed that as many as 10,000 jobs could be cut in the latest phase of its wide-ranging restructure.",
    "The Finnish networking giant is locked in a fiercely contested battle with other Network Equipment Providers (NEPs) such as Ericsson and Huawei. However, the company was surprised by the earlier-than-expected shift to 5G and has struggled with the high cost of developing 5G technologies.",
    "Pekka Lundmark was appointed as CEO last summer to remedy the situation and he initiated a major internal restructure that saw the company organised into four main business divisions - Mobile Networks, IP and Fixed Networks, Cloud and Network Services, and Nokia Technologies.",
    "Nokia now wants to “reset its cost base” so each division can redirect funds into R&D, future capabilities, and costs related to salary inflation. The company currently has 90,000 employees but expects to have between 80,000 and 85,000 by the end of 2023.",
    "The exact number of job losses will depend on market conditions over the next two years.",
    "Nokia has said it plans to do “whatever it takes” to be the market leader in 5G, even if that means sacrificing short-term profitability. Despite better than expected Q4 results, the company has warned 2021 will be transitional year.",
    "“Nokia now has four fully accountable business groups. Each of them has identified a clear path to sustainable, profitable growth and they are resetting their cost bases to invest in their future,” said Lundmark.",
    "“Each business group will aim for technology leadership. In those areas where we choose to compete, we will play to win. We are therefore enhancing product quality and cost competitiveness, and investing in the right skills and capabilities.",
    "“Decisions that may have a potential impact on our employees are never taken lightly. Ensuring we have the right setup and capabilities is a necessary step to deliver sustainable long-term performance. My priority is to ensure that everyone impacted is supported through this process.”"
  ],
  "headers": {
    "3": "Nokia job cuts"
  },
  "links": {
    "5G": "https://www.techradar.com/best/best-5g-phones"
  }
}