{
  "source": "https://www.techradar.com/news/oneplus-nord-2-launch-date-briefly-mentioned",
  "title": "OnePlus Nord 2 is coming on July 22",
  "category": "phones",
  "updated": "2021-07-08T13:16:09Z",
  "author": "srivatsa-ramesh",
  "summary": "It's now confirmed to be coming on July 22",
  "article": [
    "Update: OnePlus has now confirmed it will be revealing the OnePlus Nord 2 on July 22. Pete Lau - CEO of OnePlus - confirmed the news in a blog post after the earlier leak, and it also states that the phone will be coming to Europe and India.",
    "Original story: The OnePlus Nord 2 is one of the most anticipated smartphone launches of July. The phone is expected to be landing in Europe and India, and it's thought the launch date may be quite near.",
    "For a brief period of time, the landing page on the India OnePlus website mentioned a July 22 launch date of the OnePlus Nord 2.",
    "As you’d probably expect, the launch date of the OnePlus Nord 2 has since been taken down and replaced with the phrase “coming soon”. The listing wasn't spotted on any other regions of the OnePlus website.",
    "Since the launch date was mentioned on the official website, we’d expect the phone to launch on July 22 itself. When will you be able to buy the phone? That wasn't made clear in the listing.",
    "OnePlus is also hosting a competition to win the OnePlus Nord 2 smartphone which starts on July 7 and ends on July 22 一 usually these competitions end on the launch date or a day before. This further gives us hope that OnePlus Nord 2 will launch on July 22.",
    "The official launch page on Amazon and OnePlus.in are currently live with some teasers and images of the OnePlus Nord 2. The image on the site looks similar to the OnePlus Nord with similar placements of the power button, volume rockers, speaker grill, and alert slider. However, the image doesn’t offer us anything related to the front camera.",
    "OnePlus started the Nord 2 social media campaign yesterday and also confirmed the Nord 2 will be powered by Dimensity 1200 AI chipset. This will be OnePlus’ first smartphone with a MediaTek chipset.",
    "While we have seen the Dimensity 1200 chipset on Realme X7 Max and Redmi K40 Gaming phone, this is the first time we have seen AI appended to the processor name 一 which leads us to believe that this might be an upgraded version of the chipset from the house of MediaTek."
  ],
  "headers": {
    "4": "OnePlus Nord 2 launch date",
    "6": "OnePlus Nord 2 specs: what we know so far"
  },
  "links": {
    "the news in a blog post": "https://onepluscom.pxf.io/c/221109/916678/12532?subId1=trd-us-1096610375263437400&sharedId=trd-us&u=https%3A%2F%2Fforums.oneplus.com%2Fthreads%2Foneplus-nord-2-5g-pushing-the-limits-of-a-great-everyday-phone.1464678%2F",
    "OnePlus Nord 2": "https://www.techradar.com/reviews/oneplus-nord-2-review",
    "confirmed": "https://www.techradar.com/news/oneplus-nord-2-is-real-company-confirms-in-a-surprise-announcement",
    "Dimensity 1200 AI chipset": "https://www.techradar.com/news/mediatek-dimensity-1200-dimensity-1100",
    "Realme X7 Max": "https://www.techradar.com/reviews/realme-x7-max",
    "Redmi K40 Gaming phone": "https://www.techradar.com/reviews/poco-f3-gt-india"
  }
}