{
  "source": "https://www.techradar.com/news/i-drove-a-car-with-the-windows-blacked-out-using-only-its-cameras",
  "title": "I drove a car with the windows blacked out using only its cameras",
  "category": "car-tech",
  "updated": "2021-10-13T13:51:31Z",
  "author": "john-mccann",
  "summary": "Driving without windows",
  "article": [
    "Getting into a car with all the windows blacked out is surreal. Being asked to then drive it is a little bit terrifying.",
    "However, with the advancement of in-car technology and the increasing number of cameras we’re seeing fitted to new vehicles, it is possible to drive a car without being able to see out of the windows.",
    "I got the chance to experience precisely this with the Kia EV6 – the South Korean firm's latest electric car.",
    "The EV6 is stuffed full of cameras, from the wing mirrors to the windshield to the bumpers. This means it can give you a full 360-degree bird's eye view around the car, as well as front- and rear-facing shots.",
    "The camera on the wing mirrors even gives you views down each side of the vehicle, all of which came in handy when driving without window visibility.",
    "As the door closed, the interior EV6 darkened considerably. The black vinyl stickers Kia had placed over the windows did allow some ambient light through, but there was zero visibility.",
    "It felt a little eerie, but as I flicked through the selection of different camera views available to me on the main 12.3-inch display I began to feel a little more confident.",
    "You'll be pleased to learn this test wasn't taking place on a public road, but rather in a closed car park with a course of cones laid out for me to navigate through.",
    "I started tentatively as I worked out exactly where the cameras on the car lay and thus where exactly the car was sitting in the maze of cones.",
    "The first bend, a relatively gentle left hander, went by easily, but then the course narrowed to just wider than the EV6 and pin-point precision was required.",
    "I was able to navigate into a parking bay and reverse out without issue, but I then got carried away on a tight left-hander, which saw me eat a cone.",
    "It was a little disappointing, but I had now got a handle on the size and spacing of the car and was able to complete the rest of course at a decent place without fault.",
    "So, it is possible to drive a car solely with its inbuilt cameras. Would I recommend it? Well, no. It's obviously nowhere near safe enough to attempt anything like this on the road, but it was a fun demonstration of just how far technology has come.",
    "What this does show is the kind of data available to our cars. Add these live views to the various other sensors and radar systems found in modern EVs and you begin to understand how we're edging ever closer to full autonomy."
  ],
  "headers": {
    "5": "A new perspective"
  },
  "links": {
    "Kia EV6": "https://www.techradar.com/news/kia-ev6-first-drive"
  }
}