{
  "source": "https://www.techradar.com/news/windows-365-release-date-features-and-everything-else-you-need-to-know",
  "title": "Windows 365 release date, pricing, features and everything else you need to know",
  "category": "computing",
  "updated": "2021-08-03T11:14:18Z",
  "author": "joel-khalili",
  "summary": "Windows 365 is now available - here's all you need to know",
  "article": [
    "Microsoft has finally unveiled Windows 365, its new PC-as-a-service offering that allows users to stream a Windows desktop to any of their devices and from any location.",
    "Billed as “a new way to experience Windows 10 or Windows 11”, the virtualization service could open up a host of new opportunities for businesses, from a cost, administration and productivity perspective.",
    "Instead of hosting the operating system and applications locally, using up both storage and computing resources, Windows 365 lets users stream their apps, data and settings to any of their devices - including those that run on macOS, Linux or Android.",
    "From the perspective of IT managers, Windows 365 makes provisioning and patch management simple, while cutting hardware performance requirements.",
    "Whispers of a new Windows virtualization service first emerged last summer, when Microsoft accidentally put out a public job description that contained details about the project. A number of leaks added to speculation over the course of the year, until Microsoft officially unveiled Windows 365 at its annual Inspire conference in July.",
    "Codenamed Deschutes, Windows 365 is built on top of Azure Virtual Desktop, but is said to simplify the virtualization experience by handling all the nitty gritty.",
    "Underneath the umbrella of Windows 365 sits Cloud PC, a business-focused service that lets employees use their devices as thin clients, with Windows 10 or 11 streamed in via the cloud. The quantity of storage and computing resources are assigned to each user by the IT department, on a case-by-case basis.",
    "The implications for businesses could be significant, allowing companies to cut down on both hardware costs (and exchange CapEX for OpEX) and IT administration, while still providing employees with the tools they need.",
    "Windows 365 is split into two subscription branches: Windows 365 Business and Windows 365 Enterprise. The former is designed for companies with 300 employees or fewer, while the latter is aimed at larger organizations, but both share the same range of features.",
    "In total, there are twelve Windows 365 cloud PC configurations to choose between, each offering a different level of performance and storage.",
    "The cheapest subscription available has one vCPU, 2GB RAM and 64GB storage, and costs $20/£17 per user per month. This package is built for frontline and call center workers, or employees who only require access to lightweight CRM software and the like.",
    "At the other end of the scale, users who frequently perform compute-heavy tasks (say, creatives or software engineers) will have access to a configuration powered by 8 vCPUs, with 32GB RAM and 512GB storage. This option will cost businesses $158/£138 per user per month.",
    "The pricing and configuration options are consistent across both Windows 365 Business and Enterprise. However, larger companies that qualify for the Enterprise branch will automatically benefit from a discount of $4.00/£3.40 per cloud PC.",
    "Windows 365 Business customers can also benefit from the discount, but must already subscribe to Windows 10 Pro, the business-centric version of Microsoft's current operating system.",
    "It's possible to try three of the different configurations (the most powerful of which has 4 vCPUs, 16GB RAM and 256GB storage) for free for a period of 60 days. However, the trial license is only available to one user per organization.",
    "Drawing comparisons with other services on the market isn't straightforward, because many are charged on a per usage basis, whereas Windows 365 factors everything into a flat rate. But Microsoft’s pricing appears to be competitive across the full spectrum of configuration options.",
    "For context, Amazon offers a virtual Windows PC with a specification similar to the most affordable Windows 365 configuration for $28 per month.",
    "According to Microsoft, there will be a number of benefits to using Cloud PCs versus traditional Windows devices, flexibility chief among them.",
    "Built with hybrid working in mind, Windows 365 makes device switching simple, maintaining a consistent state across all computers, laptops and tablets to let workers pick up precisely where they left off.",
    "“The ability to work whenever, however, and wherever it’s needed has become the new normal. All employees want technology that is familiar, easy to use, and available across devices,” said Wangui McKelvey, GM Microsoft 365, when the service was first announced.",
    "“In the most complex cybersecurity environment we’ve ever seen, businesses need a solution that helps their employees collaborate, share and create while also keeping their data secure. We have an opportunity to design the tools that will empower this new world of hybrid work with a new perspective - and the power and security of the cloud.”",
    "From a security perspective, Microsoft says Windows 365 will help businesses navigate a number of the issues that have presented themselves both during the pandemic and before.",
    "Integrations with the company’s various security and identity management services (such as Azure Active Directory and Microsoft Defender for Endpoint) make setting up multi-factor authentication and conditional access simple. And encryption is applied across the board, from data at rest to network traffic running to and from Cloud PCs.",
    "Microsoft has also been careful to keep the needs of IT managers top of mind when developing the service. Not only will ramping storage and computing resources up or down for individual users be made much easier, but Cloud PCs will also appear alongside physical devices in Microsoft Endpoint Manager, making provisioning and patch management a breeze.",
    "Understandably, Microsoft's announcement has left some people wondering about the difference between Windows 365 and Cloud PC.",
    "From what we can glean, Cloud PC is currently the one and only use case for Windows 365, but Microsoft has left the door open for further use cases to be unveiled in future - potentially even for consumers.",
    "Here's what a Microsoft spokesperson told us when we asked for clarification:",
    "\"Windows 365 creates a new hybrid personal computing category called Cloud PC, which uses both the power of the cloud and the capabilities of the device to provide a full, personalized Windows experience.\"",
    "\"A Cloud PC is Windows 10 or Windows 11 streamed from the cloud. For example, IT can provision a Cloud PC powered by Windows 365 using familiar management tools like Microsoft Endpoint Manger and manage them just like they manage their traditional physical PCs today.\"",
    "TechRadar Pro will update this hub as more details emerge."
  ],
  "headers": {
    "4": "What is it?",
    "8": "Pricing and availability",
    "17": "Windows 365 Cloud PC features",
    "24": "Windows 365 vs. Cloud PC: What's the difference?"
  },
  "links": {
    "Windows 365": "https://www.techradar.com/news/microsoft-launches-windows-365-a-new-way-to-experience-windows-10-and-windows-11",
    "virtualization service": "https://www.techradar.com/best/best-virtual-machine-software",
    "thin clients": "https://www.techradar.com/best/best-thin-client",
    "Windows 365 Business": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-1674458151669724200&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows-365%2Fbusiness%2Fcompare-plans-pricing",
    "Windows 365 Enterprise": "https://click.linksynergy.com/deeplink?id=kXQk6%2AivFEQ&mid=24542&u1=trd-us-3241716626303997400&murl=https%3A%2F%2Fwww.microsoft.com%2Fen-us%2Fwindows-365%2Fenterprise%2Fcompare-plans-pricing",
    "CRM software": "https://www.techradar.com/best/the-best-crm-software",
    "Amazon offers a virtual Windows PC": "https://go.redirectingat.com/?id=92X363&xcust=trd_us_4944158591322357000&xs=1&url=https%3A%2F%2Faws.amazon.com%2Fworkspaces%2Fpricing%2F%3Fnc%3Dsn%26loc%3D3&sref=https%3A%2F%2Fwww.techradar.com%2Fnews%2Fwindows-365-release-date-features-and-everything-else-you-need-to-know",
    "hybrid working": "https://www.techradar.com/news/best-hybrid-working-tech-for-2021-everything-you-need-for-the-return-to-the-office",
    "computers": "https://www.techradar.com/news/best-business-desktop-pcs",
    "laptops": "https://www.techradar.com/news/best-business-laptops",
    "tablets": "https://www.techradar.com/news/best-business-tablets",
    "identity management": "https://www.techradar.com/best/best-identity-management-software",
    "patch management": "https://www.techradar.com/best/best-patch-management-tools"
  }
}