{
  "source": "https://www.techradar.com/news/a-new-kindle-paperwhite-is-coming-soon-heres-the-previous-model-for-cheap",
  "title": "A new Kindle Paperwhite is coming soon – here's the previous model for cheap",
  "category": "tablets",
  "updated": "2021-09-25T12:00:00Z",
  "author": "james-pickard",
  "summary": "Get a big saving ahead of the new Paperwhite launch",
  "article": [
    "There's nothing better to do in the cold winter months than snuggle up indoors with a good book. A Kindle Paperwhite allows you to store thousands of books at once on a single device, which should be more than enough to see you through until Spring. Now that a new version is coming, the Amazon ereader is the cheapest it's ever been so you can save a huge chunk of cash.",
    "The good news is that this Kindle Paperwhite deal applies to both the US and the UK, so you can pick it up no matter which side of the Atlantic you reside in. For those in the US, the Kindle Paperwhite is down to $79.99 (was $129.99). However, for whatever reason, this price only applies to the Twilight Blue version. In the UK, you can save £40 and pick up a Kindle Paperwhite for £79.99 – and that's in any colour you wish.",
    "These prices match the all-time low we saw on the Kindle Paperwhite over Amazon Prime Day earlier this year. The timing is very fitting as well, considering this latest discount comes just as a new Kindle Paperwhite is scheduled to launch next month. It's clearly being featured in this week's Amazon deals as a way to encourage sales of the older devices before the brand new ereader arrives on the scene.",
    "That ultimately depends on how much reading you expect to do and whether your budget stretches to the cost of the new devices. The Kindle Paperwhite 2021 will cost $139.99/£129.99, while the Kindle Paperwhite Signature Edition will set you back $189.99/£179.99. Both will be available from October 27.",
    "Naturally, they provide a number of significant upgrades over the older model to justify that increased cost. Most notably, the screen has increased in size from a 6-inch to a 6.8-inch display and is slightly brighter. On the more expensive Signature Edition, the front light has a useful feature that auto-adjusts depending on the brightness of your surroundings. Another key change is the move to a USB-C connection over micro-USB, plus the promise of a 10-week battery life versus the current model's three weeks. The Signature Edition also supports wireless charging.",
    "Overall, these are definitely more than just small incremental upgrades, but shouldn't be too dramatic for the casual reader. And when you can save $50/£40 with this Kindle Paperwhite deal right now, it's tempting to go ahead without them.",
    "The current Kindle Paperwhite is still one of the best ereaders you can buy and terrific value for money at this low price. Snap up one of the offers above while you can, or check in with us regularly for all the best Kindle deals. We'll also be here throughout the year's biggest sales event, checking if the new model gets a small discount during Black Friday 2021!"
  ],
  "headers": {
    "2": "Today's best Kindle Paperwhite deal",
    "3": "Should I wait for the new Kindle Paperwhite instead?",
    "7": "More of today's best Kindle deals"
  },
  "links": {
    "Kindle Paperwhite is down to $79.99 (was $129.99)": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2FKindle-Paperwhite-Waterproof-Storage-Special%2Fdp%2FB07PS737QQ%3Ftag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-5696803519226928000-20",
    "Kindle Paperwhite for £79.99": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.co.uk%2Fkindle-paperwhite-waterproof-6-inch-high-resolution-display-8gb-twilight-blue%2Fdp%2FB07S3844V8%2Fref%3Dsr_1_3%3Fdchild%3D1%26geniuslink%3Dtrue%26keywords%3Dkindle%2Bpaperwhite%2Bnow%2Bwaterproof%2Bwith%2B2x%2Bthe%2Bstorage%2Bad%2Bsupported%26qid%3D1632495064%26sr%3D8-3%26tag%3Dhawk-future-21%26ascsubtag%3Dtrd-us-1015326069757305300-21",
    "Amazon Prime Day": "https://www.techradar.com/amazon-prime-day/new-prime-day-deals",
    "new Kindle Paperwhite": "https://www.techradar.com/news/new-amazon-kindle-paperwhite",
    "Amazon deals": "https://www.techradar.com/deals/best-amazon-sales-deals-discounts",
    "best ereaders": "https://www.techradar.com/best/best-ereader",
    "best Kindle deals": "https://www.techradar.com/news/portable-devices/portable-media/kindle-deals-1296345",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales"
  }
}