{
  "source": "https://www.techradar.com/news/battlefield-6-is-cross-gen-and-will-feature-128-player-maps-according-to-leak",
  "title": "Battlefield 6 is cross-gen and will feature 128-player maps, according to leak",
  "category": "gaming",
  "updated": "2021-01-19T18:51:01Z",
  "author": "vic-hood",
  "summary": "Battlefield Battle Royale, anyone?",
  "article": [
    "Update: EA declined to comment on this story when contacted by TechRadar.",
    "We haven't heard much about Battlefield 6 in some time, but a new report by leaker TheLongSensation (AKA Tom Henderson) may give us some idea of what to expect from the next Battlefield game.",
    "According to a recent video by Henderson (via VGC), Battlefield 6 will be a \"soft reboot\" of Battlefield 3, set in the modern era. The new Battlefield is allegedly also set to come to PS4 and Xbox One, in addition to the already confirmed release on Xbox Series X and PS5.",
    "What's more, Henderson claims that developer Dice has designed some maps with 128 players in mind - made possible by the power of current-gen consoles. The leaker claims that while these 128-player maps will be available, his sources have clarified that Battlefield's 32 v 32 standard game modes (64 players) will still be available to play - with players having the option to partake in game modes with a higher player count.",
    "Unfortunately, according to Henderson, these 128-player maps won't be available on last-gen consoles. In addition, PS4 and Xbox One players will also see visual downgrades from the PS5 and Xbox Series X versions, and limited destruction.",
    "Despite this, Henderson claims that his sources have said that there's a separate part of the studio working on these last-gen versions and players \"shouldn't be worried\".",
    "The leaker also says that EA Dice has had a Battlefield Battle Royale in the works at some stage, with the studio wanting to create their own version of Activision's successful Call of Duty Warzone. However, it remains unclear as to whether it is still developing this.",
    "The Battlefield franchise previously dipped its toes in the Battle Royale pool, with Battlefield Firestorm in Battlefield 5, however, players had to purchase the full game in order to play.",
    "It's always worth taking leaks with a pinch of salt, but Henderson has previously been accurate, with his claim that Battlefield 6 will be set in the modern era corroborated by VentureBeat reporter Jeff Grubb.",
    "Battlefield 3, which apparently is a major influence on Battlefield 6, was set during the fictional War of 2014 - so we're expecting, if Dice is aiming for a modern era, that we'll be looking at something a bit more up to date.",
    "Henderson also claims that plans are \"subject to change\" ahead of the game's release. EA previously revealed is expected to be sometime between 2021 and early 2022.",
    "It's likely we'll get more concrete information on Battlefield 6 in the coming months leading up to the game's release.",
    "TechRadar has contacted EA for comment."
  ],
  "headers": {
    "8": "A source you can trust?"
  },
  "links": {
    "VGC": "https://www.videogameschronicle.com/news/battlefield-6-is-a-cross-gen-reboot-targeting-128-players-latest-leaker-report-claims/",
    "PS4": "https://www.techradar.com/reviews/gaming/games-consoles/sony-ps4-1202432/review",
    "Xbox One": "https://www.techradar.com/reviews/original-2013-xbox-one",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Battlefield 5": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "corroborated by VentureBeat reporter Jeff Grubb": "https://www.resetera.com/threads/insider-teases-battlefield-6-being-set-in-modern-day.223303/#post-36347584",
    "EA previously revealed": "https://www.techradar.com/reviews/battlefield-2042"
  }
}