{
  "source": "https://www.techradar.com/news/should-you-cancel-disney-plus-in-2021",
  "title": "Should you cancel Disney Plus in 2021?",
  "category": "entertainment",
  "updated": "2021-07-11T14:49:43Z",
  "author": "samuel-roberts",
  "summary": "",
  "article": [
    "This is the latest in our ongoing look at which streamers are worth keeping in 2021. We've previously asked whether you should cancel Netflix or cancel Amazon Prime Video this year – and today, it's the turn of Disney Plus.",
    "Of all the non-Netflix and Amazon Prime streaming services to join the content arms race over the past few years, Disney Plus feels like it's best positioned to succeed. Assuming interest in Marvel, Star Wars, Pixar and Disney movies remains evergreen in the near future, Disney Plus is all about big silos of recognizable stuff – and it's built a platform off the back of an enviable library of iconic movies.",
    "That said, the service only feels like it has started hitting its true potential over the past few months. Since October, it has rolled out massive releases The Mandalorian season 2, Pixar's Soul, WandaVision and The Falcon and the Winter Soldier. It's fair to say that these were each the biggest pop culture events of their moment, enhancing the value of the service significantly after a fallow period following its 2019 launch. Next up is Loki, with many more Marvel and Star Wars shows coming down the pipe.",
    "Disney is top-heavy on franchises and family content, then – it isn’t the service you use to check out the latest adult prestige drama. Yet the company has given that some thought, which is the reason it offers Disney Plus in a bundle with the more generalist Hulu in the US. Outside the US, Disney Plus added a channel called Star and parental controls earlier this year, transforming the service into a broader Netflix competitor.",
    "Still, if you're anything like us, you're probably eyeing your increasing bill for streaming with disdain. Watching everything is now genuinely expensive – so trimming a service or two from the list would alleviate the weight on your wallet. Below, we explore whether Disney Plus is the streaming service you should cancel in 2021, or whether it's still worth the money.",
    "The first year of Disney Plus required a little patience on the viewer’s part. Once The Mandalorian came and went, Covid-19 delays hit some of the service's tastiest content – pushing WandaVision and The Falcon and the Winter Soldier back to 2021 from their original 2020 release dates.",
    "Disney Plus compensated for a slow 2020 for original content by furnishing it with fast releases of big movies. Pixar's Onward arrived just weeks after theaters that were showing the movie closed around the world, at least in some countries. It was a clever pandemic-motivated decision, as was the later paid release of Mulan on the platform, even if that film ended up being disappointing.",
    "In December 2020, the decision to move Soul straight to Disney Plus made it a must-have service for the holiday period. In 2021, Pixar's launches on the service will continue, with the release of Luca directly onto the platform. It's clearly as important a pillar of the service as Star Wars or Marvel are to Disney.",
    "In the US, Disney Plus is available as part of a $13.99 monthly bundle with Hulu and ESPN+ – this price-matches Netflix's standard plan, and is cheaper than HBO Max's $14.99 monthly cost. If Netflix's original programming doesn't float your boat, and you're big into sports, it's absolutely a viable alternative. You have to add a further $6 onto the price to remove Hulu's ads, though, which starts to highlight what good value Netflix offers.",
    "Outside the US, Disney Plus has received a larger price bump. That's to mark the addition of Star, a new channel that permits adult-friendly content to be viewed on the service. In the UK, Star has brought a massive backlog of classic TV shows and movies onto the service, which is most welcome. The price increase isn't ideal – £7.99 per month requires more consideration than £5.99 – but Disney Plus was in danger of being a little too boutique-y long-term without something more generalized. Star essentially solves that issue.",
    "Wherever you live, then, the cost isn't too unreasonable.",
    "The originals on Star – including shows such as Big Sky and the Rick and Morty-esque animated series Solar Opposites – are more nice-to-have than essential so far. Nevertheless, there are a solid number of them, and the total is set to grow over time. They also mean the service feels like it's getting new stuff every week, which wasn't necessarily the case before. Star has turned Disney Plus into a well-rounded streamer outside the US; American users, meanwhile, have Hulu to plug that gap.",
    "With Star, you can couple your marathon of The Simpsons with one for Futurama, American Dad or Bob's Burgers. That's ace. In terms of adult animation, it puts Disney Plus well ahead of Netflix. Side note: Star has also turned Disney Plus into a weirdly good service for fans of M Night Shyamalan movies, simply because he made so many for Disney over the years. Anecdotally, most of TechRadar's UK team has found some use for Star, whether it's watching Oscar winner Nomadland, or simply binge-watching old episodes of Grey's Anatomy.",
    "The key thing Disney Plus is starting to get right is the regularity with which it releases original content. This is where the value of the service truly lies. The rough cornerstone of Disney's plan, we're guessing, is to have something Marvel or Star Wars-related content releasing all the time. It's a smart strategy to keep adults engaged with the service – and since they're paying the bills, that's a wise approach.",
    "If you're not interested in such content, Disney Plus might prove a harder sell to keep every month, especially if you don't have kids. For most viewers, though, it offers a strong library of content (particularly if you get Star), with the promise of many rich years of originals ahead.",
    "Disney Plus is proving its worth this year, and with a price increase now rolled out around the world, that's reassuring. The Marvel and Star Wars shows have proved to be a must-watch, dominating the pop culture conversation in the way that the movies have – only this time, it's for weeks on end.",
    "Not only are they unmissable for fans who need to keep up with the goings-on in each universe, but they're critically acclaimed, too. The Mandalorian has arguably created a new type of sub-genre on TV: blockbuster movies and prestige TV dramas rolled into one. That's made the ‘fear of missing out’ factor high with Disney Plus.",
    "However, in our opinion, if you only want one streaming service in your life in 2021, then Netflix is still king. Broadly speaking, Disney Plus is unlikely to be your main streaming option unless you have children – but the addition of Star outside the US means that the service is becoming more and more well-rounded all the time.",
    "That said, in terms of big originals, you could still watch all of the key ones released to date in a single month if you want to keep the cost down. The originals here might be splashy, but there still aren't that many of them compared to the older streamers, and that might be a factor you consider when thinking about paying for the service every month.",
    "If you can afford it, though, we think Disney Plus is worth keeping in 2021 – especially since the second half of the year will be bringing The Book of Boba Fett, Ms Marvel and Hawkeye. Disney is treating the service like it's the future of everything it does in entertainment – if you're even vaguely engaged with what the House of Mouse makes, it’s probably producing a bunch of things now that you'll actually want to watch in a year or two."
  ],
  "headers": {
    "5": "Is Disney Plus good value in 2021?",
    "11": "Disney Plus originals are getting there",
    "15": "Should you cancel Disney Plus in 2021?"
  },
  "links": {
    "cancel Netflix": "https://www.techradar.com/news/should-you-cancel-netflix-in-2021",
    "cancel Amazon Prime Video": "https://www.techradar.com/news/should-you-cancel-amazon-prime-video-in-2021",
    "Disney Plus": "https://www.techradar.com/news/disney-plus-movies-shows-free-trial-hamilton-and-more-explained"
  }
}