{
  "source": "https://www.techradar.com/news/the-pixii-camera-has-ideas-that-other-mirrorless-cameras-could-learn-from",
  "title": "The Pixii Camera has ideas that other mirrorless cameras could learn from",
  "category": "cameras",
  "updated": "2021-09-28T15:39:46Z",
  "author": "mark-wilson",
  "summary": "The new Pixii is still niche, but brings fresh ideas",
  "article": [
    "The original Pixii Camera was a fresh take on the digital rangefinder camera when it arrived in 2018, and now its French maker has announced an intriguing successor.",
    "Also called the Pixii Camera, the second-generation version brings a new 26MP APS-C sensor (up from the slightly paltry 11MP sensor in its predecessor) and a new 'interactive viewfinder'.",
    "The latter isn't a modern EVF, instead combining a traditional optical viewfinder with projected electronic info like your settings, which you can tweak from within the viewfinder. We've seen hybrid viewfinders before on cameras like the Fujifilm X-Pro 3, but none quite like this one.",
    "The Pixii Camera is a slightly odd mix of old and new in others ways, too. It's compatible with Leica M-mount lenses, which date back to the 1950s and are generally small, lightweight and very expensive. Focusing and aperture control are also still manual-only.",
    "But it also brings a few features that we'd like to see embraced by the traditional camera giants like Canon, Nikon and Sony. The Pixii offers internal storage – you can choose between 32GB, 64GB and 128GB versions, with the latter being enough for 3,650 DNG files.",
    "Like its predecessor, the camera also instantly sends a preview of the photo you've just taken to your iOS or Android phone, via Bluetooth 5. You then get the option of importing the full DNG raw file and editing it before sharing on social media.",
    "Some more standard upgrades include USB-C connectivity and an expanded ISO range, which has moved up from the modest ISO100-6400 of the first version to 160-12,800.",
    "You'll be able to pre-order the Pixii Camera from September 30 from $2,999 (around £2,590 / AU$4,840) for the basic version without internal storage, with orders expected to ship from October 11. There's quite a markup for the 128GB version, though, which will cost $3,540 (around £3,055 / AU$5,715).",
    "The Pixii Camera's price tag and Leica M-mount make it a pretty niche camera, but it also packs some fresh, mainstream-friendly ideas that we'd like to see on other cameras.",
    "Like smartphones, you can buy it with a generous amount of internal storage (up to 128GB). An even better scenario would be the combination of an internal SSD with a memory card slot, so you could upgrade it and spread the risk across cards. But the inclusion of built-in storage certainly feels very modern and streamlined compared to most of today's mirrorless cameras.",
    "We also like the sound of its instant photo previews for smartphones, which pop up immediately after you've pressed the shutter. The companion apps from traditional manufacturers vary greatly in quality, with Fujifilm's being particularly dated, so we certainly like the look of the Pixii Camera's app.",
    "That said, the camera's lack of any rear screen means the app is doing some pretty heavy lifting, and the 'interactive optical viewfinder' – while certainly unique – is still a lot more niche than a standard EVF, which gives you a full preview of the shot you're about to take.",
    "We're all for bolshy new players in the somewhat staid camera market, though, and the Pixii Camera joins the Alice Camera in being another intriguing take on the screen-less mirrorless camera."
  ],
  "headers": {
    "8": "Analysis: A stylish mix of old and new"
  },
  "links": {
    "original Pixii Camera": "https://www.techradar.com/news/meet-the-pixii-a-connected-digital-rangefinder-with-a-leica-mount",
    "Fujifilm X-Pro 3": "https://www.techradar.com/reviews/fujifilm-x-pro3",
    "Alice Camera": "https://www.techradar.com/news/inside-the-alice-camera-why-its-maker-thinks-its-the-future-of-mirrorless-cameras"
  }
}