{
  "source": "https://www.techradar.com/news/microsoft-edges-pdf-reader-now-lets-you-look-up-dictionary-definitions-heres-how",
  "title": "Microsoft Edge's PDF reader now lets you look up dictionary definitions – here's how",
  "category": "computing",
  "updated": "2021-02-24T11:53:14Z",
  "author": "sofia-wycislik-wilson",
  "summary": "Check definitions using a built-in dictionary",
  "article": [
    "Microsoft Edge has a new dictionary feature for its PDF reader, which allows you to look up definitions in the browser.",
    "The days of using a dedicated PDF reader are pretty much over now that just about every web browser in existence can open the popular file format. With so many PDF encountered online, this makes complete sense, but it is only in recent times that browser-based readers are starting to catch up in terms of features.",
    "Continuing the development of its Chromium-based version of Edge, Microsoft is currently working on improving the overall PDF experience in its browser. One of the latest features to be added gives you the ability to look up word definitions as you browse a document.",
    "Integrating a dictionary-look-up option into Edge's PDF reader helps to reduce the friction of encountering a word you don't know the meaning of. With the new feature, there is no need to highlight and copy a word, paste it into a new browser tab and then search for a definition; everything can be taken care of from with the PDF itself.",
    "If this sound familiar, it is because a very similar option was available in the legacy version of Edge. But in the switch to Chromium-based Edge, Microsoft initial stripped numerous features and functions from the PDF reader as it started to rebuild the experience largely from scratch. Now the company is gradually adding options back, and the dictionary is one of the latest appearances in preview builds of the browser.",
    "The dictionary look-up tool can be found in the Canary build of Edge. You can download this version of the browser here, or update your current build to at least version 90.0.806.0. The definition feature relies on Bing, but it's not enabled by default. Assuming you have the latest version of Edge Canary installed, use the following steps to enable the dictionary definition option:",
    "With this done, you can right click a word in a PDF document and select the define option. You will initially see a definition in a popup, and more detail is available if you click See more in sidebar.",
    "Via On MSFT"
  ],
  "headers": {
    "5": "Look it up"
  },
  "links": {
    "PDF reader": "https://www.techradar.com/news/the-best-free-pdf-reader",
    "here": "https://www.microsoftedgeinsider.com/en-us/download",
    "On MSFT": "https://www.onmsft.com/news/microsoft-edge-pdf-reader-gets-a-new-built-in-dictionary-feature-in-the-canary-channel"
  }
}