{
  "source": "https://www.techradar.com/news/steam-deck-game-streaming-offers-8-hours-of-battery-life-and-loads-of-flexibility",
  "title": "Steam Deck game streaming offers 8 hours of battery life – and loads of flexibility",
  "category": "gaming",
  "updated": "2021-08-09T08:48:34Z",
  "author": "darren-allan",
  "summary": "The dream stream?",
  "article": [
    "Valve’s Steam Deck will offer the ability to last for around eight hours of battery longevity when playing a demanding game and streaming it from your PC.",
    "In case you weren’t aware, the handheld can not only play games locally, running on the Steam Deck itself, but also stream them over your local network, with your gaming PC doing the grunt work and actually running the game – with obvious benefits for the battery life of the 40WHr power pack.",
    "As PC Gamer reports, Greg Coomer, a product designer at Valve, observed that it’s possible to “play for something like eight hours of Death Stranding, or a high-performance game, on this unit if you’re streaming it rather than playing it locally.”",
    "That battery longevity compares to Valve’s claimed two to eight hours when running a game on the Steam Deck as normal (locally), rather than streaming, with the former figure of a couple of hours being expected for more taxing games, naturally. Valve has previously given an example of Portal 2 running locally for about five to six hours when playing at 30 frames per second.",
    "For those with a PC at home, being able to stream games from that computer is obviously a nifty feature in terms of allowing demanding titles to get far more out of the Steam Deck’s battery.",
    "What’s more, if you have a powerful gaming PC, remember that with those games being played at the relatively low resolution of the Deck’s compact display (1280 x 800), they’re going to run extremely slickly (the only potential caveat being possible input lag flakiness depending on your network setup – but most folks should be fine on that front).",
    "Having game streaming as an option with the Steam Deck gives the device a good deal more flexibility. It means that aside from the aforementioned benefits, if you own an entry-level (64GB) Deck and storage space is thin on the ground, you can still enjoy games (the ones that chomp through drive space) installed on your PC via streaming.",
    "Also, if the Steam Deck does end up having any issues running certain titles from your Steam library – though Valve has promised it’ll resolve existing problems (like anti-cheat software) with Proton, the compatibility layer used to run Windows games on the Steam Deck – again, an alternative option would be to just run that specific game on your PC and stream it. All this versatility just adds to the value proposition of the Steam Deck considerably."
  ],
  "headers": {
    "4": "Analysis: Your flexible gaming friend"
  },
  "links": {
    "Valve’s Steam Deck": "https://www.techradar.com/news/steam-deck",
    "PC Gamer": "https://www.pcgamer.com/steam-deck-can-stream-games-for-up-to-8-hours/",
    "powerful gaming PC": "https://www.techradar.com/news/the-best-gaming-pc",
    "entry-level (64GB) Deck and storage space is thin on the ground": "https://www.techradar.com/news/dont-buy-the-base-model-steam-deck"
  }
}