{
  "source": "https://www.techradar.com/news/call-of-duty-vanguard-wont-eat-up-as-much-hard-drive-space-as-previous-games",
  "title": "Call of Duty: Vanguard won’t eat up as much hard drive space as previous games",
  "category": "gaming",
  "updated": "2021-10-27T18:29:00Z",
  "author": "emma-boyle",
  "summary": "Saving major disk space",
  "article": [
    "Call of Duty: Vanguard won’t take up nearly as much room on console and PC hard drives as previous releases in the series, Activision has revealed.",
    "Activision made the announcement on Twitter via the official Call of Duty account, calling it “good news for hard drives everywhere”. The tweet doesn't go into a huge amount of detail, simply explaining that “new on-demand texture streaming tech” will see Call of Duty Vanguard’s “install size at launch” come in “significantly below previous Call of Duty releases.”",
    "In fact, this tech will apparently “save up to 30%-50% on next-gen console and PC hard drive disk space”.",
    "Since making this announcement, Activision has confirmed the estimated file sizes and disk space needed to play the game on various consoles. As promised the numbers are notably reduced when compared to Call of Duty: Black Ops Cold War's launch in November last year and fall into that 30% to 50% reduction window, though PlayStation consoles require significantly more disk space than Xbox.",
    "In the post, Activision also notes that players can \"choose to manage storage space and reduce the game’s overall file size during or after the pre-load\". Information for PC is marked as \"coming soon\".",
    "This follows a reduction in the file size of Call of Duty: Modern Warfare and Warzone earlier this year after an update which took advantage of \"enhancements to the overall content management system[...]made possible through data optimization and streamlining content packs needed for individual game modes.\"",
    "Call of Duty games have long been notorious for the amount of hard drive space they take up. We've already mentioned Call of Duty: Black Ops Cold War's launch last year, when the game took up a sizeable 133GB of space on PlayStation 5 and an even larger 136GB on Xbox Series X.",
    "It was also only earlier this year that 500GB PS4 owners who had Call of Duty: Black Ops Cold War, Call of Duty: Modern Warfare and Warzone installed were warned by Activision that they “may need to make room” and “delete some unused Game Content”.",
    "Suffice it to say, then, that this is surely welcome news for Call of Duty fans on PS5, Xbox Series X/S and PC who might have been looking anxiously at their hard drive in the run up to the game’s November 5 release date.",
    "While expanding available storage is at least now an option on PS5 and Xbox Series X, it’s not exactly cheap at the moment and for those without it, space is still at a premium. Visions of having to tell visitors “no, no, that’s not my Xbox, that’s my Call of Duty machine” dispelled. For now, at least."
  ],
  "headers": {
    "6": "Analysis: Thanks for the memory"
  },
  "links": {
    "Call of Duty: Vanguard": "https://www.techradar.com/reviews/call-of-duty-vanguard-review",
    "confirmed": "https://www.callofduty.com/blog/2021/10/vanguard-console-preloading-launch-file-size",
    "Call of Duty: Black Ops Cold War's launch": "https://www.techradar.com/news/call-of-duty-black-ops-cold-wars-file-size-is-out-of-control-on-ps5-and-xbox-series-x",
    "earlier this year": "https://www.callofduty.com/blog/2021/03/Season-Two-Reloaded-Warzone-File-Size-Reduction#MWandWarzoneFileSize",
    "launch last year": "https://www.techradar.com/news/call-of-duty-black-ops-cold-wars-file-size-is-out-of-control-on-ps5-and-xbox-series-x",
    "were warned": "https://www.techradar.com/news/call-of-duty-ps4-players-may-need-to-make-room-for-the-new-update-activision-warns",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "Xbox Series X": "https://www.techradar.com/news/xbox-series-x-storage-everything-you-need-to-know",
    "on PS5": "https://www.techradar.com/how-to/how-to-upgrade-ps5-internal-ssd-storage",
    "at the moment": "https://www.techradar.com/news/xbox-series-x-storage-could-become-more-affordable-soon"
  }
}