{
  "source": "https://www.techradar.com/news/verified-twitter-accounts-have-been-hacked-by-crypto-scammers-again",
  "title": "Verified Twitter accounts have been hacked by crypto scammers, again",
  "category": "computing",
  "updated": "2021-01-15T19:05:23Z",
  "author": "anthony-spadafora",
  "summary": "Latest Elon Musk-themed cryptocurrency scam has already raked in $587,000",
  "article": [
    "A new cryptocurrency giveaway scam is making the rounds on Twitter that uses verified accounts and Elon Musk's cult of personality to trick users into giving up their bitcoin.",
    "The social network is often used to promote cryptocurrency scams involving Elon Musk and back in 2018, scammers brought in $180,000 using the same tactics were seeing now.",
    "Security researcher MalwareHunterTeam recently observed an uptick in verified Twitter accounts being hacked in order to promote the latest fake Elon Musk-themed cyptocurrency scam. All of these hacked accounts will then reply to tweets promoting the scam to help make it more popular online.",
    "Additionally, the tweets contain links that redirect to an article on Medium promoting the fake cryptocurrency giveaway. This article contains instructions on how to send Elon Musk bitcoin with the promise that he'll then send twice the amount back to each user.",
    "According to MalwareHunterTeam who spoke with BleepingComputer, most of the accounts that have been hacked for this latest scam have been dormant for some time now.",
    "However, these accounts are considered credible by users due to the fact that they have been verified and there is a blue check mark next to each user's name. Back in July, the social network disabled the ability to verify an account following a previous cryptocurrency scam which saw Twitter hacked as well. For this reason, verified Twitter accounts have been in high demand among cybercriminals.",
    "Based on the cryptocurrency addresses collected from landing pages used in this latest campaign, the scammers behind it have already earned $587,000 in bitcoin.",
    "Sending bitcoin and other cryptocurrencies to random people online is always a bad idea, especially when they say they will pay you back double your initial investment. This likely won't be the last cryptocurrency scam on Twitter but hopefully more users are waking up to the tactics used by scammers on the social network.",
    "Via BleepingComputer"
  ],
  "headers": {
    "4": "Targeting dormant accounts"
  },
  "links": {
    "cryptocurrency": "https://www.techradar.com/news/what-is-bitcoin",
    "Twitter": "https://www.techradar.com/how-to/twitter-dark-mode",
    "Elon Musk": "https://www.techradar.com/news/elon-musk-says-tesla-will-make-ventilators-if-supplies-run-low",
    "MalwareHunterTeam": "https://www.techradar.com/news/snake-ransomware-looks-to-encrypt-an-entire-business-network",
    "blue check mark": "https://www.techradar.com/news/how-to-get-blue-tick-on-twitter-new-guidelines-in-place",
    "Twitter hacked": "https://www.techradar.com/news/massive-twitter-hack-was-caused-by-spear-phishing-attack",
    "BleepingComputer": "https://www.bleepingcomputer.com/news/security/verified-twitter-accounts-hacked-in-580k-elon-musk-crypto-scam/"
  }
}