{
  "source": "https://www.techradar.com/news/google-stadias-direct-touch-is-coming-to-ios-but-that-certainly-wont-save-it",
  "title": "Google Stadia's Direct Touch is coming to iOS - but that certainly won't save it",
  "category": "gaming",
  "updated": "2021-10-13T09:08:40Z",
  "author": "rhys-wood",
  "summary": "Google loosens the reins on Direct Touch",
  "article": [
    "Google Stadia was the tech giant's big push into the gaming world with a cloud-based solution. Gamers could instantly stream a litany of titles - big and small - on compatible devices you already own, such as TVs, laptops and your phone. At least, that was the sales pitch.",
    "Unfortunately, Google Stadia was slow off the blocks with a lack of compelling games or exclusives, a muddled pricing model that essentially made users pay twice to even use the service, and the limitations of being a cloud-only platform generally holding the service back - with no option to simply download titles.",
    "Plus, Google didn't really do itself any favors by shuttering several key Stadia developers, which could have greatly hampered the company's ability to host exclusive games on its streaming platform.",
    "Back in August, though, Google added a genuinely useful feature to Stadia called Direct Touch. Available only on Android at the time, Direct Touch brought a bespoke touch control method to phones and tablets, eschewing the need to use Google Stadia's (admittedly nice) controller.",
    "The Direct Touch option, thankfully, is now also available on iOS devices like iPhone 13 and iPad Pro, as announced on Stadia's community blog. In short, this brings the bespoke touch control method to Apple's devices, but there's a huge caveat. Only one game (yes, one) currently supports Direct Touch, and it's the 4X strategy title Humankind.",
    "But how does Direct Touch even work? Well, often when you're playing games on a touch screen, you'll be met with a bloated and intrusive controller interface, indicating where on the screen you need to drag and tap in order to perform actions. It's almost always far less effective and intuitive than just using a regular controller.",
    "However, there will be some edge cases where playing with a controller will be antithetical to the experience, and a grand strategy game like Humankind is one of those. Largely played on enormous maps with a somewhat complex UI, Humankind and games like it benefit from a mouse and keyboard setup, or even bespoke touch controls, where tapping and swiping on the screen feel much more natural.",
    "The issue here, then, is not the Direct Touch feature itself, which is genuinely great addition to Stadia. The big problem is that only one game currently supports it, and that's just not good enough, especially given the ailing position Stadia finds itself in.",
    "The addition of Direct Touch is nice, but Stadia's going to need to do a lot more if it wants to save itself from the pit of obscurity it continues to stare down. Reports have shown that sales figures have been paltry at best, and a general lack of interest from developers when it comes to creating Stadia exclusives should give Google cause for concern.",
    "Right now, we think Stadia's silver bullet could come in the form of its VR interest, as Google has recently been seen hiring VR experts to work within the Stadia sphere. A VR-ready cloud-based device is a novelty that raises our eyebrows, but Google would have to nail the execution given cloud gaming's dependence on stable internet connections.",
    "In fairness, Stadia isn't completely lost, and does attract some rather big-name titles to its service including Borderlands 3, Cyberpunk 2077 and Ark: Survival Evolved, alongside a swathe of smaller titles that generally feel good to play instantly through the cloud.",
    "However, Stadia is clearly lagging behind competitors like Microsoft, whose Xbox Cloud Gaming service is bundled for free with Xbox Game Pass Ultimate, and benefits from Microsoft's industry-leading server infrastructure.",
    "Stadia's got some catching up to do, then, and novel features like Direct Touch, while nice additions, simply won't cut it with such niche appeal and with so few games currently supporting it."
  ],
  "headers": {
    "5": "One giant leap for Humankind?",
    "8": "A blip on the radar"
  },
  "links": {
    "Google Stadia": "https://www.techradar.com/reviews/google-stadia",
    "shuttering several key Stadia developers": "https://www.techradar.com/news/google-closes-game-development-studios-but-promises-stadia-will-go-on",
    "iPhone 13": "https://www.techradar.com/reviews/iphone-13",
    "iPad Pro": "https://www.techradar.com/reviews/ipad-pro-129-2021-review",
    "Stadia's community blog": "https://community.stadia.com/t5/Stadia-Community-Blog/This-Week-on-Stadia-Destiny-2-Ben-10-Power-Trip-and-Free-Play/ba-p/69468",
    "Reports have shown": "https://www.bloomberg.com/news/articles/2021-02-26/google-video-game-unit-stadia-struggled-to-be-googley-enough",
    "hiring VR experts": "https://www.techradar.com/news/google-stadia-better-not-blow-its-vr-plans-if-it-wants-to-survive-any-longer",
    "Xbox Cloud Gaming": "https://www.techradar.com/news/xbox-cloud-gaming-gets-a-monumental-upgrade-and-is-now-available-on-ios-and-pc",
    "Xbox Game Pass Ultimate": "https://www.techradar.com/reviews/xbox-game-pass-ultimate"
  }
}