{
  "source": "https://www.techradar.com/news/xbox-game-pass-might-get-6-more-square-enix-games-soon",
  "title": "Xbox Game Pass might get 6 more Square Enix games soon",
  "category": "gaming",
  "updated": "2021-03-26T09:53:48Z",
  "author": "adam-vjestica",
  "summary": "Be there, be Square",
  "article": [
    "Xbox Game Pass could get six more Square Enix games in the near future, according to IGN Korea.",
    "The subscription service has secured some notable titles from the Japanese publisher in recent weeks, and it appears that Microsoft might be partnering with Square Enix to bring even more of its titles to Xbox Series X and Xbox Series S soon.",
    "In a tweet, IGN Korea claimed “it’s an open secret in the industry that more than six Square Enix games have already been confirmed” for Xbox Game Pass, but didn’t divulge which titles those would be.",
    "We already know that Xbox Game Pass is set to get the upcoming co-op looter shooter Outriders on day one, April 1, and that one of the best Nintendo Switch games, Octopath Traveler, has just hit the service. Square Enix also previously revealed that the rest of its Final Fantasy catalog would be coming to Xbox Game Pass – but as that’s already been publicly announced, we can rule those titles out.",
    "With Xbox Game Pass often acting as a much-needed shot in the arm for online games, many are tipping Marvel's Avengers to be the next big acquisition. The game recently received a free next-gen upgrade, so the timing would make sense.",
    "However, Xbox fans will surely be hoping that one of the six games will be the critically acclaimed Final Fantasy 7 Remake. The game’s timed exclusivity agreement with PlayStation ends in April 2021, so there’s a definite possibility that it could come to Xbox consoles sooner rather than later.",
    "Microsoft’s Netflix-style subscription service continues to grow in size and appeal with each and every big game it secures. Xbox Game Pass recently welcomed 20 Bethesda games to its library after Microsoft officially completed the acquisition of its parent company, ZeniMax Media, and subscribers can look forward to all of Microsoft’s first-party titles coming to the service on day one, like Halo Infinite, Everwild and Perfect Dark.",
    "Head of Xbox Phil Spencer has been working hard to address the lack of Japanese titles on Xbox, which was a criticism many leveled at Microsoft during the Xbox One generation. So far, it seems like that work is paying off. Every Yakuza game is now available on Xbox consoles, and partnerships with Square Enix will only help ensure more Japanese games come to the platform."
  ],
  "headers": {
    "5": "Cloud nine",
    "7": "Lost in translation"
  },
  "links": {
    "Xbox Game Pass": "https://www.techradar.com/reviews/xbox-games-pass",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "Xbox Series S": "https://www.techradar.com/reviews/xbox-series-s",
    "Outriders on day one": "https://www.techradar.com/news/outriders-might-be-coming-to-xbox-game-pass-heres-why",
    "best Nintendo Switch games": "https://www.techradar.com/best/best-nintendo-switch-games",
    "Octopath Traveler": "https://www.techradar.com/news/one-of-the-best-nintendo-switch-games-is-coming-to-xbox-game-pass",
    "Marvel's Avengers": "https://www.techradar.com/reviews/marvels-avengers-review",
    "Final Fantasy 7 Remake": "https://www.techradar.com/reviews/final-fantasy-7-remake",
    "20 Bethesda games": "https://www.techradar.com/news/skyrim-comes-to-xbox-game-pass",
    "ZeniMax Media": "https://www.techradar.com/news/xbox-is-buying-bethesda-will-elder-scrolls-6-be-an-xbox-series-x-exclusive",
    "Halo Infinite": "https://www.techradar.com/reviews/halo-infinite",
    "Everwild": "https://www.techradar.com/news/everwild-release-date-trailers-news-rumors",
    "Perfect Dark": "https://www.techradar.com/news/perfect-dark-trailer-at-game-show-awards-shows-joanna-dark-is-back",
    "Xbox One": "https://www.techradar.com/news/xbox-one-deals-bundles-cheap-prices-sales",
    "Yakuza game": "https://www.techradar.com/news/yakuza-games-in-order-by-release-date-in-chronological-order-and-ranked"
  }
}