{
  "source": "https://www.techradar.com/news/apples-imac-pro-is-officially-done-you-can-no-longer-buy-the-pc",
  "title": "Say goodbye to the Apple iMac Pro – you can no longer buy the PC",
  "category": "computing",
  "updated": "2021-03-22T08:28:56Z",
  "author": "darren-allan",
  "summary": "Get yourself a top-end iMac instead, Apple advises",
  "article": [
    "The iMac Pro has officially come to the end of the line, and you can no longer purchase one of the high-end all-in-one computers from Apple.",
    "A couple of weeks back, Apple confirmed that there was limited stock of the iMac Pro left, and that it would soon be discontinued, which is exactly what has happened now.",
    "The machine has sold out over the past fortnight, and is no longer listed or available to purchase on Apple’s website.",
    "Should you wish to buy an iMac Pro, your only options now are to pick one up as a refurbished model from Apple (there are still a number left at the time of writing, starting from just over $3,800 in the US), or you could go for a second-hand model from an auction site.",
    "The iMac Pro used to fit between the vanilla iMac and the Mac Pro, and as MacRumors points out, Apple suggests that those who would’ve bought the Pro version of the all-in-one should instead look to the top configuration of the 27-inch iMac (with a 10-core CPU, and up to 128GB of system RAM and 8TB storage). The latter works out as a more wallet-friendly proposition, of course.",
    "The rumors about the iMac getting revamped with Apple’s own ARM-based silicon are widespread, so these machines, when (or indeed if) they arrive – potentially in October, or that’s the latest word from the grapevine – could make a better buy. Particularly if they have the sequel to the M1 chip, which seems highly likely if the all-in-ones are coming later in 2021.",
    "The top-end model of that rumored iMac with an M1X processor (or whatever the sequel to the M1 ends up being called) might just make the iMac Pro effectively redundant (although some folks would argue that it was already unnecessary)."
  ],
  "headers": {
    "4": "iMac alternative"
  },
  "links": {
    "iMac Pro": "https://www.techradar.com/reviews/imac-pro",
    "Apple confirmed that there was limited stock of the iMac Pro left": "https://www.techradar.com/news/apple-discontinues-the-imac-pro-with-new-imac-rumored-to-be-imminent",
    "MacRumors": "https://www.macrumors.com/2021/03/19/imac-pro-officially-discontinued/",
    "that’s the latest word from the grapevine": "https://www.techradar.com/news/apple-silicon-powered-imac-rumoured-to-have-been-delayed-until-october-2021",
    "M1 chip": "https://www.techradar.com/news/apple-m1-chip"
  }
}