{
  "source": "https://www.techradar.com/news/duckduckgo-will-block-googles-next-gen-cookie-replacement",
  "title": "DuckDuckGo will block Google's next-gen cookie replacement",
  "category": "computing",
  "updated": "2021-04-12T10:31:09Z",
  "author": "joel-khalili",
  "summary": "FLoC? More like flop, says DuckDuckGo",
  "article": [
    "Privacy-centric search engine DuckDuckGo has denounced Google’s plans to implement an alternative to third-party browser cookies, which for years have allowed advertisers to track the activity of web users.",
    "The company has revealed it will block Federated Learning of Cohorts (FLoC), the proposed replacement, via both its search engine and Chrome browser extension.",
    "The DuckDuckGo search engine will disable FLoC functionality with immediate effect, while an update to the browser extension will give users the chance to opt out manually. However, the extension update is currently under review by Google, which vets all new additions to the Chrome Web Store.",
    "According to Google, the introduction of FLoC will allow people to benefit from greater levels of online privacy, but without destroying the underlying economics of the web.",
    "The FLoC system is said to achieve this goal by grouping together thousands of users with similar browsing habits, thereby preserving both the anonymity of individuals and the ability for advertisers to execute targeted campaigns.",
    "However, a number of different privacy advocates have voiced concerns about the new technology. Some have questioned the purity of Google’s motives, in the context of the many billions of dollars the company makes on online advertising each year. Others believe the improvement in privacy standards will be minimal and that FLoC simply provides advertisers with a different set of tools to play with.",
    "As per a recent blog post, DuckDuckGo’s opposition is founded in large part on Google’s failure to request the permission of Chrome users before deploying the new technology.",
    "“We’re disappointed that, despite the many publicly voiced concerns with FLoC that have not yet been addressed, Google is already forcing FLoC upon users without explicitly asking them to opt in,” said DuckDuckGo in a statement.",
    "“We’re nevertheless committed and will continue to do our part to deliver on our vision of raising the standard of trust online.”",
    "FLoC is currently undergoing a trial period, exclusively on Chrome. Although Google hopes to expand the technology beyond the confines of its own web browser, DuckDuckGo and other opponents look set to stand in its way."
  ],
  "headers": {
    "3": "Google FLoC opposition"
  },
  "links": {
    "browser": "https://www.techradar.com/best/browser",
    "blog post": "https://spreadprivacy.com/block-floc-with-duckduckgo/"
  }
}