{
  "source": "https://www.techradar.com/news/heres-how-slim-the-new-samsung-one-connect-box-actually-is",
  "title": "Here's how slim the new Samsung One Connect box actually is",
  "category": "televisions",
  "updated": "2021-07-08T08:17:13Z",
  "author": "henry-st-leger",
  "summary": "A lot slimmer than before",
  "article": [
    "The Samsung One Connect Box has long been one of the best parts of Samsung's TV range, offering a neat cabling solution to help hide away wires and keep HDMI inputs out of view.",
    "We heard as far back as January 2021 that a new, slimmed-down model was coming – the Slim One Connect Box, as it's known – and we finally have official measurements from Samsung to help us compare with the original.",
    "We're told the new model measures in at just 41.2 x 330 x 295 mm – with 330mm being the longest edge, along which the ports and inputs are housed.",
    "By comparison, the 2019/2020 model measures at 390 x 130 x 70mm for 4K TVs, with slightly larger 394 x 177 x 80mm dimensions for 8K TVs.",
    "That's a big shake-up of the previous One Connect Box's shape, then, opting for a much more square profile and almost halving the model's height (from 70mm to 41.2mm).",
    "This is pretty apparent from any promo images of the box, showing a flattened shape and curved edges – like a smooth pebble – at a size that can be attached to the TV stand of one of Samsung's high-end QLED TVs, rather than taking up space on the counter. (We've also reviewed a couple of models with the new box, such as the QN95A and QN900A QLEDs).",
    "The great benefit of the One Connect box is that it minimizes the impact of cabling multiple devices together, drawing wires and connections away from the screen you have to stare at, and ensuring the mess is both out of sight and out of mind. The existing model makes use of a single, translucent cable that somehow carries power from the mains as well as signals from anything plugged into your HDMI ports and the like.",
    "A more compact shape really doubles down on this, reducing the amount of space needed for the box – no small feat given a whole TV’s worth of connections will be packed in. In a world of massive next-gen gaming consoles too (cough, PS5, cough), being able to save some room in your media cabinet is more urgent than ever.",
    "With HDMI 2.1 specification and eARC (enhanced audio return channel) support, the Samsung One Connect box is able to compete with the built-in inputs of any premium TV, so it's a shame that it continues to be available for only a handful of premium models. Samsung usually only bundles it in with flagship 8K and 4K screens each year, and it's yet to be available to buy as a standalone accessory.",
    "In mid-2020 we even wrote a piece on why so few Samsung TVs were able to ship with the box, with Samsung telling us that the “quite expensive” hardware meant the company was reluctant to manufacture en masse or expect customers to pay the additional cost.",
    "For those who have it, it should be an even more discrete cabling solution. Now if only we could get it on the rest of the Samsung range..."
  ],
  "headers": {
    "6": "Not for everyone"
  },
  "links": {
    "Samsung One Connect Box": "https://www.techradar.com/news/samsung-one-connect-box",
    "4K TVs": "https://www.techradar.com/deals/cheap-4k-tv-deals-sales",
    "8K TVs": "https://www.techradar.com/best/best-8k-tv",
    "TV stand": "https://www.techradar.com/deals/tv-stands-finding-the-best-tv-stand-to-suit-your-living-room-home-cinema-needs",
    "QLED": "https://www.techradar.com/news/samsung-qled-samsungs-latest-television-acronym-explained",
    "QN95A": "https://www.techradar.com/reviews/samsung-qn95a-neo-qled-4k-tv",
    "QN900A": "https://www.techradar.com/reviews/samsung-qn900a-neo-qled-8k-tv",
    "PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "HDMI 2.1": "https://www.techradar.com/news/new-faster-hdmi-21-cables-are-on-the-way-heres-what-you-need-to-know",
    "eARC": "https://www.techradar.com/news/hdmi-arc-vs-earc",
    "why so few Samsung TVs were able to ship with the box": "https://www.techradar.com/news/samsung-oneconnect-box-is-still-a-marvel-so-why-do-so-few-samsung-tvs-get-it"
  }
}