{
  "source": "https://www.techradar.com/news/the-earths-core-just-got-a-lot-more-interesting-heres-why",
  "title": "The Earth's core just got a lot more interesting – here's why",
  "category": "appliances",
  "updated": "2021-10-27T22:37:53Z",
  "author": "john-loeffler",
  "summary": "The Earth's solid iron-alloy core is actually kinda smushy",
  "article": [
    "Even though it is hotter than anything else on or in the planet, the Earth's inner core of iron and nickel has long thought to be entirely solid because of the intense pressure pressing in on it – but if new research is right, that isn't entirely the case.",
    "The Earth's core can only be seen indirectly through data, particularly though seismic waves. When an earthquake occurs someplace in the world, the vibrations travel through the entire planet like ripples from a stone thrown in a pond.",
    "But just like those ripples spread smoothly and concentrically across the pond's surface until they smack into a pier pylon, a boat, or even other ripples from another stone, the same thing happens with seismic waves in the Earth's interior.",
    "As the waves travel through different material – or even through different phases of the same material, like liquid and solid iron – the seismic waves from an earthquake bend as they move through the Earth in ways that we are able to see in the data from those waves.",
    "These data from seismic waves are how we are able to identify the different layers of the Earth, and how we're able to tell that there is an inner core of iron-nickel surrounded by an outer core of iron-nickel in liquid form.",
    "But for a long time, the inner core of the Earth has been thought to be entirely solid. A new study in the journal Physics of the Earth and Planetary Interiors calls this assumption into question, at least in part.",
    "\"The more that we look at it, the more we realize it's not one boring blob of iron,\" Jessica Irving, a University of Bristol, England, seismologist who didn't take part in the study, told our colleagues over at Live Science. \"We're finding a whole new hidden world.\"",
    "Rhett Butler, a geophysicist at the Hawai'i Institute of Geophysics and Planetology, was studying earthquake data from the other side of the world when the numbers didn't seem to quite add up the way the math said they should.",
    "\"When you're in this business, you've got to match the data,\" Butler said.",
    "Butler argues that it's the assumptions we've been making about the Earth's core that are wrong, and that the seismic math makes sense if the inner iron-alloy core isn't entirely solid.",
    "\"We've seen evidence that not only is it not soft everywhere; it's really hard in some places,\" Butler said. \"It's got hard surfaces right up against melted or mushy iron. So we're seeing a lot of detail within the inner core that we didn't see before.\"",
    "The biggest implication of a not-entirely-solid inner core is for Earth's magnetic field, and changes in the inner core's composition and can have a big impact on the planet's protective bubble.",
    "Earth's magnetic field is a product of the rotation of the Eath's liquid outer core, with the solid inner core influencing the strength, shape, and other characteristics.",
    "If the inner core isn't entirely solid or at least inconsistently so, than this should have an effect on the magnetic field as well.",
    "What effects those are isn't know, or even if it has an effect at all, but it's new data that sheds light on the protective shell around our planet that helps protect us from the ravages of charged particles in the solar winds produced by the sun."
  ],
  "headers": {
    "11": "Analysis: what does a smushy core mean for Earth's magnetic field?"
  },
  "links": {
    "Physics of the Earth and Planetary Interiors": "https://doi.org/10.1016/j.pepi.2021.106802",
    "Live Science": "https://www.livescience.com/earth-inner-core-mushy"
  }
}