{
  "source": "https://www.techradar.com/news/want-to-try-out-windows-365-forget-it",
  "title": "Want to try out Windows 365? Forget it",
  "category": "computing",
  "updated": "2021-08-04T12:03:20Z",
  "author": "joel-khalili",
  "summary": "Windows 365 trial suspended after issues",
  "article": [
    "Microsoft has been forced to suspend the free trial for its new Windows 365 service, which lets users stream a desktop to any of their devices via the cloud.",
    "The virtualization service went live earlier this week, but it has now become apparent Microsoft had drastically underestimated the level of demand.",
    "On Twitter, the company announced it has suspended the trial for an indefinite period while it spins up additional capacity. In the meantime, interested parties can register to be notified when the trial resumes.",
    "Although the free trial is no longer available, businesses can still purchase paid Windows 365 cloud PC subscriptions, which range from $20-$162 per user per month. This suggests that only infrastructure set aside to support trial deployments was overloaded.",
    "In total, there are twelve Windows 365 cloud PC configurations to choose between, each offering a different level of performance and storage.",
    "At launch, three of these configurations (the most powerful of which offers 4 vCPUs, 16GB RAM and 256GB storage) were available for users to sample for a period of 60 days. The idea was to provide businesses with a sense of the performance of the new cloud PCs, as well as a taste of the new provisioning process.",
    "While a high level of demand for Windows 365 will have pleased Microsoft, the need to pull the trial after just two days can be considered at least a minor embarrassment. The move has also led to speculation as to whether the issue is an early indication of more serious capacity problems to come.",
    "Microsoft declined to comment on the extent to which demand was underestimated and whether issues may later crop up for paying customers as a result of capacity limitations."
  ],
  "headers": {
    "4": "Windows 365 trial"
  },
  "links": {
    "Windows 365": "https://www.techradar.com/news/windows-365-release-date-features-and-everything-else-you-need-to-know",
    "cloud": "https://www.techradar.com/web-hosting/best-bare-metal-hosting",
    "virtualization": "https://www.techradar.com/best/best-virtual-machine-software",
    "announced": "https://twitter.com/Microsoft365/status/1422610113408364544"
  }
}