{
  "source": "https://www.techradar.com/news/improving-video-capture-and-sharing-is-a-priority-for-xbox",
  "title": "Improving video capture and sharing is a ‘priority’ for Xbox",
  "category": "gaming",
  "updated": "2021-11-27T19:38:21Z",
  "author": "emma-boyle",
  "summary": "“We definitely hear the feedback”",
  "article": [
    "When it comes to making improvements to Xbox Series X/S, the team at Xbox is placing video capture quality and sharing high on its priority list.",
    "As reported by VGC, the director of program management at Xbox, Jason Ronald, recently appeared on the Iron Lords podcast, where he was asked about the company’s plans for Game DVR on the consoles. Ronald replied that Game DVR “is definitely a priority” for the team and that it’s “the one area – the capture and share experience – that I wish we were able to make more progress [on] this year than we were able to.”",
    "That’s not to say that the team hasn’t made any headway at all with planned improvements. Ronald explains in the interview that the team “have made some changes” and “some improvements to the reliability and the quality of the captures” but adds that they “definitely hear the feedback” and “know we still have work to do here.”",
    "Ronald goes on to recommend that Xbox users join the Xbox Insider program as it’s a good way to get access to new features and improvements and offer feedback on them. “Get on the Insider rings,” he says, “so that as we bring new capabilities and improvements, we want that feedback to know where we’re meeting the bar, and where we’re not meeting the bar.",
    "“But definitely, message heard, and like I said, it’s definitely an area that I wish were able to make more progress this year than we did but it will definitely be a priority for 2022.”",
    "This isn’t the first time that Ronald has acknowledged player feedback around share and capture. Back in January of this year, not too long after the Xbox Series X launch, Ronald responded to a tweet to say that the team is “working on a number of improvements to the capture and share experience” and that while there was nothing to share at the time, it was “a priority for the team”.",
    "Making improvements to the console is, however, a long-term project and Ronald tells the Iron Lords podcast that capture and share is something they will “continue to iterate on.”",
    "Back in February, when speaking to Larry Hryb on the official Xbox podcast, Ronald explained that when it comes to the Xbox platform, there’s “a lot of really exciting things that are coming down the pipeline over the coming months and over the coming years”, adding that “At launch, we say it all the time internally, this is really just the beginning.”",
    "If you’re less concerned about game capture and sharing on the Xbox Series X and more concerned with just trying to get your hands on one amidst ongoing shortages, we’re regularly tracking retailer stock to help you out. We’re also tracking the best Xbox Series X/S Black Friday deals over the course of the Black Friday and Cyber Monday sale period."
  ],
  "headers": {
    "5": "Analysis: It’s a journey"
  },
  "links": {
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "S": "https://www.techradar.com/reviews/xbox-series-s",
    "VGC": "https://www.videogameschronicle.com/news/xbox-says-improving-video-capture-quality-and-sharing-is-a-priority/",
    "Iron Lords podcast": "https://www.youtube.com/watch?v=sqTyO042Qe0",
    "responded to a tweet": "https://twitter.com/jronald/status/1353860028877262849?s=20",
    "Back in February": "https://www.techradar.com/news/xbox-hints-at-exciting-platform-updates-coming-to-series-x-and-series-s-in-future",
    "amidst ongoing shortages": "https://www.techradar.com/news/xbox-series-x-restock-issues-will-continue-to-be-a-challenge-for-quite-a-while",
    "tracking retailer stock": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Xbox Series X/S Black Friday": "https://www.techradar.com/black-friday/xbox-series-x-black-friday-deals-2021",
    "Black Friday": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Cyber Monday": "https://www.techradar.com/cyber-monday/cyber-monday-deals-2021"
  }
}