{
  "source": "https://www.techradar.com/news/wordpress-powered-websites-to-get-new-makeover-via-frontity-acquisition",
  "title": "WordPress-powered websites to get new makeover via Frontity acquisition",
  "category": "computing",
  "updated": "2021-08-31T10:18:21Z",
  "author": "abigail-opiah",
  "summary": "Automattic continues investing into its WordPress portfolio",
  "article": [
    "WordPress parent company Automattic has added yet another company to its roster with the acquisition of open source software firm Frontity.",
    "The firm says it hopes to contribute to the WordPress open source project to help improve the full website editing developer experience.",
    "Frontity first arrived on the scene in 2017 following a project launched with big Spanish WordPress publishers who wanted to improve the performance of their mobile sites.",
    "By 2019, Frontity decided to launch an open source framework for those who wanted to use WordPress as a headless CMS with a React frontend.",
    "Automattic then invested in Frontity in 2020, which sparked discussions about a possible acquisition.",
    "In a written blog post, Frontity founders Pablo Postigo and Luis Herranz said Automattic offered to sponsor the Frontity team to work directly on the WordPress open source project.",
    "\"In particular, to contribute our expertise in developer experience, frontend tooling, performance, and UX to the WordPress core itself, instead of doing so only for an external tool,\" they added.",
    "\"The impact our team could make working directly on WordPress is much more significant than continuing on our own, so we decided to go for it! Now we have the chance to improve the experience of all WordPress developers, not just those who want to use it as a decoupled CMS.\"",
    "Frontity will not be pushing React to the WordPress frontend, despite being a React framework company.",
    "The company plans to look at Gutenberg and full site editing space to identify the areas where its work has the most impact, in order to make improvements on the WordPress website building experience.",
    "Post acquisition, Frontity will continue as an open source software project, and will be free to use.",
    "A member of the developer experience team at Automattic and lead architect of the WordPress Gutenberg project, said: \"I’m really impressed with the effort and care the Frontity team has put into their work over the past few years.",
    "\"We are at the cusp of exciting new opportunities with Gutenberg, and I cannot wait to start collaborating together on making the experience of developing with it a joy to behold.\""
  ],
  "headers": {
    "4": "WordPress websites win"
  },
  "links": {
    "WordPress": "https://www.techradar.com/news/best-wordpress-hosting-providers",
    "open source software": "https://www.techradar.com/best/best-open-source-software",
    "website editing": "https://www.techradar.com/news/building-your-dream-website-just-got-a-whole-lot-quicker-and-simpler",
    "website building": "https://www.techradar.com/news/the-best-website-builder"
  }
}