{
  "source": "https://www.techradar.com/news/new-25th-anniversary-alienware-aurora-pc-will-turn-heads-while-offering-better-performance",
  "title": "New 25th anniversary Alienware Aurora PC will turn heads while offering better performance",
  "category": "computing",
  "updated": "2021-10-15T13:24:00Z",
  "author": "darren-allan",
  "summary": "Improved airflow and cooling should be good news for pushing the CPU and GPU",
  "article": [
    "Alienware’s Aurora desktop gaming PC has been redesigned to celebrate the gaming brand’s 25th anniversary.",
    "Yes, Alienware really has been around since the days when Quake was released (1996), and to celebrate, the Aurora – the firm’s gaming PC which was first introduced a little more recently, in 2004 – has been graced with an (optional) transparent panel on one side that lets you see through and admire the innards of the mid-tower case.",
    "Accompanying this window to the internals is more customizable lighting, as the PC now has eight lighting zones (twice as many), to make the view inside prettier now that you can actually see in there.",
    "The shape of the case has been changed somewhat, so it’s now curvier, and angled upwards – plus it has that optional see-through panel – but it still keeps the same basic design themes as the existing Aurora. It also still comes in white and black color options (or Lunar Light and Dark Side of the Moon, as Alienware bills them).",
    "Another big design change comes not with the external appearance, but with the internal layout and what Alienware describes as a new ‘open air’ design.",
    "Essentially, we are talking about better airflow (and neater cable management), with improvements in thermal performance therein. Alienware reckons that the revamped Aurora has 50% more space inside to allow for more room to breathe, without increasing the actual chassis size by much. Cooling is facilitated by up to four 120mm fans, and the base configurations of the Aurora will have two of these, with higher-end models upping the ante (with liquid cooling options also).",
    "There’s a claimed noise reduction, too, with the new Aurora managing to be 16% quieter than the old model when idling (and 15% less noisy when overclocked).",
    "A final design touch worth noting is that there’s now an optional (magnetically-attached) cover that slips over the rear of the case to hide all those ports and cables, for a smarter appearance around back.",
    "While Alienware waxed enthusiastic at great length concerning the new case design, nothing about the actual spec of the next-gen Aurora was mentioned. The smart money is on Alder Lake processors, though, given that these are imminent from Intel (and theoretically will be here in just a few weeks). If running with Intel’s 12th-gen CPUs, then we can expect DDR5 RAM too (just like the Predator gaming PC which Acer just revealed – it seems like the time is ripe for Alder Lake-toting machines to be announced).",
    "As for the new design, it’s a definite improvement in our books. We still aren’t fully sold on the overall aesthetic of the Aurora, even with this new incarnation, but it certainly looks a step up from the current model, which is, well, okay, but we’ve always felt it’s a little yawn-inducing. (Although we’re aware that others have a different take on that, finding the existing Aurora stylish and unique, which is fair enough; it’s certainly the latter). As ever, appearance is a subjective thing, but we feel this new design is a positive development for sure.",
    "The transparent side panel is a plus point to be in the mix as an option, although that said, hardly an innovation, as gaming PCs have had these forever. It’s the apparent steps forward with thermal performance that’ll really count, of course, and if the new Aurora does indeed have Alder Lake chips, it’ll be very interesting to see how that cooling works in tandem with Intel’s purportedly promising 12th-gen silicon."
  ],
  "headers": {
    "8": "Analysis: Alder Lake inside, maybe – plus thoughts on that redesign"
  },
  "links": {
    "Alienware’s Aurora desktop gaming PC": "https://www.techradar.com/reviews/alienware-aurora-r10-ryzen-edition",
    "Quake": "https://www.techradar.com/news/quake-could-be-coming-back-and-theres-really-no-better-time-for-it",
    "Alder Lake processors": "https://www.techradar.com/news/intel-alder-lake-release-date-specs-and-price-everything-we-know",
    "theoretically will be here in just a few weeks": "https://www.techradar.com/news/the-biggest-intel-alder-lake-leak-suggests-core-i9-12900k-is-coming-november-4",
    "PC which Acer just revealed": "https://www.techradar.com/news/acer-reveals-glasses-free-3d-laptop-and-a-weird-but-beastly-gaming-pc",
    "others have a different take on that": "https://www.techradar.com/reviews/alienware-aurora-r11",
    "Intel’s purportedly promising 12th-gen silicon": "https://www.techradar.com/news/intel-core-i5-12400-leak-could-be-amds-worst-nightmare"
  }
}