{
  "source": "https://www.techradar.com/news/the-frasier-revival-on-paramount-plus-has-a-tentative-release-date",
  "title": "The Frasier revival on Paramount Plus has a tentative release date",
  "category": "entertainment",
  "updated": "2021-06-30T09:25:58Z",
  "author": "samuel-roberts",
  "summary": "You'll see it early next year, according to actor Kelsey Grammer",
  "article": [
    "The streaming service revival of popular sitcom Frasier might be coming sooner than you think. According to actor Kelsey Grammer, we'll \"probably\" see the show return in the first three months of next year.",
    "\"When will we see a Frasier? Probably in the first quarter of next year,\" the actor told Collider in a recent interview.",
    "The show still sounds relatively early on in the scripting phase, based on other details offered up by Grammer. \"Well, we don’t actually have a date when we’re going to start filming. We’re still kind of breaking the story a little bit, we’re doing a polish now.\"",
    "Still, next year is a long time away. Grammer also mentions that they think they're going to get most of the actors back on-board for this revival, adding that he was \"fairly confident\" this would be the case. The story of this new series is designed to be told with or without them, though, in case they don't return.",
    "Original cast members David Hyde Pierce (Niles Crane), Jane Leeves (Daphne Moon) and Peri Gilpin (Roz Doyle) are likely who Grammer is referring to. It's hard to envision the show feeling anywhere near the same without them.",
    "The show's revival is happening on the streaming service Paramount Plus in the US. It's unclear if and when the service will launch in the UK, but it's coming to Australia on August 11. Hopefully, British viewers will know what the deal is before Frasier comes back next year.",
    "Frasier ended after 11 seasons back in 2004.",
    "With Friends' overhyped and tepid reunion episode, we saw that there's still enormous investment in these shows that are decades old. What's motivating the return of these sitcoms now? The streaming wars.",
    "The money is being thrown around to generate interest in an overcrowded market, and the easiest way to do that is to bring back something that people loved. We live in an age of splintered viewing habits. Frasier's finale in 2004 was watched by 33 million people just in the US, a number you'd only see matched by the Super Bowl on live television these days.",
    "Paramount Plus rightly sees this as an opportunity to create a major moment around its streaming service. And it's far from the first to attempt this – Netflix famously revived Arrested Development for two more seasons back when it started making originals in 2013.",
    "Hey, both seasons were pretty bad, but at least it tried. Hopefully Frasier will be a little stronger."
  ],
  "headers": {
    "7": "Analysis: Why are these sitcoms returning now?"
  },
  "links": {
    "Frasier": "https://www.techradar.com/news/new-frasier-series-will-revive-classic-90s-sitcom-for-new-netflix-rival",
    "Collider": "https://collider.com/frasier-revival-release-date-cast-kelsey-grammer/",
    "Paramount Plus": "https://www.techradar.com/news/paramount-plus-launch-time-free-trial-apps-movies-shows-and-everything-we-know-at-launch"
  }
}