{
  "source": "https://www.techradar.com/news/a-week-with-the-fujifilm-gfx100s-why-ill-be-buying-it-over-the-sony-a1",
  "title": "A week with the Fujifilm GFX100S: why I'll be buying it over the Sony A1",
  "category": "cameras",
  "updated": "2021-05-22T10:00:00Z",
  "author": "james-abbott",
  "summary": "Opinion: For landscape shooting, specialist tools are still king",
  "article": [
    "This year photographers have been treated to some of the most exciting cameras ever made – and top of that list are the Fujifilm GFX100S and Sony A1. But if you were handed a small suitcase full of money, which one should you go for?",
    "These cameras are very different propositions with different target audiences. But it's a fun question to answer all the same – and after a week of shooting with the Fujifilm GFX100S, I've now been fortunate enough to use both cameras extensively in the real world.",
    "Before I reveal my findings, let's introduce the two contenders. The GFX100S is Fujifilm's latest medium format camera, which means it has a sensor that's 1.7x larger than full-frame. In other words, its light-gathering powers are off the scale, and this brings all sorts of benefits like huge dynamic range.",
    "But the full-frame Sony A1 isn't exactly in its shadow either. When I reviewed the A1 in March, I called it \"probably the most versatile professional camera ever made\". It's an amazing technical accomplishment, albeit one that costs $6,500 / £6,499 / AU$10,499 (body only).",
    "What's interesting about both the Fujifilm GFX100S and Sony A1 is that they break boundaries in different ways. Medium format cameras are traditionally expensive, slow and cumbersome, but not the GFX100S. It's a fair chunk cheaper than the Sony A1 ($5,999 / £5,499 / AU$9,499) and has similar handling to the Fujifilm X-T4, making it extremely responsive and easy to use. The Sony A1, meanwhile, is simply more versatile than any 50.1MP full-frame camera has any right to be.",
    "This is the first time since photography’s digital revolution where a medium format camera has been priced lower than a rival full-frame camera at launch – and to say that's an exciting proposition for a landscape photographer is something of an understatement.",
    "And that's the crux of the Fujifilm GFX100S vs Sony A1 debate. Like most photographers, I specialize in certain genres – and being predominantly a landscape and portrait photographer, I have no real need for the incredible shooting speed or extensive video powers of the Sony A1. After spending a week with the GFX100S, I'm completely smitten with it.",
    "When it comes to landscape photography, the bells and whistles that come with most mirrorless cameras don't really matter. This is because the vast majority of shots are taken in either manual or aperture priority mode, with focus performed using either manual or autofocus, depending on the scene.",
    "A 30fps burst mode or rhinoceros AF isn't really top of the priority list. Instead, for this type of photography, it all comes down to the camera's handling and the core features: sensor size, resolution, dynamic range and the bit depth of raw files for color reproduction.",
    "The Fujifilm GFX100S and Sony A1 do both offer big benefits for landscape shooters. They can both easily autofocus when a 10-stop ND (Neutral Density) filter is attached to the lens, which is great because it makes techniques like focus stacking easy. The two cameras also provide a live histogram in the electronic viewfinder and on the LCD screen for checking exposure while shooting, although the GFX100S’s top-plate OLED can also handily be set to display a histogram.",
    "But one area where the GFX100S and also many Fujifilm cameras are head-and-shoulders above Sony cameras is that they provide exposure times that are way longer than 30 seconds. This means you can shoot long exposure photos without needing to use a remote to hold the shutter open in Bulb mode, all while trying to manually time the exposure.",
    "The Sony A1's shutter speeds range from 30 seconds to 1/8000 sec, and it also offers a Bulb mode (which lets you keep the shutter open for as long as you want). The GFX100S, on the other hand, offers shutter speeds ranging from 60 minutes to 1/4000 sec, as well as Bulb up to a maximum of 60 minutes.",
    "After 30 seconds, exposure times double as normal so you only need to shoot in Bulb mode when you need an exposure time between two stops. Also, when shooting in Bulb mode, the GFX100S shows an on-screen timer to help you with timing the exposure – the A1, meanwhile, shows you a blank screen, so you need to use a watch or phone.",
    "Aside from specific talents like this, both cameras are surprisingly similar, considering they're very different takes on the flagship camera. Both are excellent performers at high ISO settings, both feature dual SD card slots, and both have articulating screens.",
    "Another difference here, though, is that the Sony A1 only flips out on the horizontal axis for shooting on landscape format, whereas the GFX100S' screen flips out on both the horizontal and vertical axis for shooting in both orientations.",
    "I also found the GFX100S much easier to set up and use, thanks to its overall control layout, top-plate OLED screen for displaying a range of handy information, and its more intuitive menu system. Still, the A1 does at least offer an incredible level of customization to help you get it set up for your needs.",
    "But what about the million dollar (or rather $6,000) question: how does the actual photo quality between the GFX100s and A1 compare? It's a close battle, but for landscape shooting the GFX100S has the edge, with a few caveats...",
    "The Fujifilm GFX100S may only have a 14-stop dynamic range compared to the Sony A1's 15 stops, but the medium format camera has the edge when it comes to image quality. But it's not quite as cut-and-dried as that sounds, as the GFX100S' high-resolution sensor puts a much heavier demand on lenses.",
    "As you probably know, the higher a camera's resolution, the better the lenses have to be to resolve all that captured detail. And the problem with the Fuji's 102MP sensor, compared to the Sony A1’s 50.1MP chip, is that the lenses you use must be absolutely flawless to give it a genuine real-world advantage.",
    "Some of the older Fujifilm GFX lenses, such as the 23mm, show a much greater loss of edge sharpness when compared to Sony's 20mm, for instance. But to be honest, to notice this you have to really pixel peep, and in reality the results from the camera and lens paring are absolutely fine in both print and digital display.",
    "In terms of color, the GFX100S beats the Sony A1 with the option of 14- or 16-bit raw files, compared to just 14-bit with the A1. While that may not sound like much, this lets you push raw files harder during processing if necessary, as well as being able to capture many more colors for smoother graduations from one color to the next. If you shoot landscapes, that's a big deal.",
    "In any discussion about buying one of these cameras, you have to factor in the price of lenses. And this is where the real-world cost of the GFX100S starts to add up. It might be a slightly cheaper camera body, but generally speaking its medium format lenses are slightly larger, heavier and, to varying degrees, more expensive.",
    "Let's do some slightly painful financial sums. When you compile a kit consisting of a camera body and three comparable lenses, the price difference between a Sony A1 and a Fujifilm GFX100S suddenly evens out.",
    "For landscape photography with the GFX100S, the ideal combo is probably the Fujifilm GF 23mm F/4 R LM WR lens (equivalent to an 18mm full-frame lens), GF 32-64mm f/4 R LM WR (a 25-51mm equivalent) and GF 80mm F1.7 R WR Lens (like a 60mm prime on the A1). The total cost of that lot with the camera body? A mere $13,196 / £12,146 / AU$20,396.",
    "With Sony's system, the equivalent lenses are the Sony FE 20mm f/1.8 G, Sony FE 50mm f/1.2 GM and Sony FE 24-70mm f/2.8 GM. If you buy those with a Sony A1, your bank account would be relieved of $11,595 / £11,346 / AU$17,956.",
    "This particular example makes the Sony A1 a fair bit cheaper than its Fujifilm rival, but not by a huge amount. And being able to buy a medium format kit for practically the same price as a full-frame kit is truly amazing and completely changes the way photographers view this larger format; something that once seemed unaffordable suddenly becomes a more attainable dream.",
    "The Sony A1 is, without doubt, an incredible camera. But its rounded feature set suggests that it's more a proof-of-concept to show off Sony's technological prowess, rather than a real-world camera that will take the photographic market by storm.",
    "Saying that, the camera is undoubtedly ideal for press and sports photographers working across a range of subjects, where such a universal camera can replace the need for carrying two different types of camera bodies, such as the Sony A7R IV and Sony A9 II (£4922). The A1 is more than capable of shooting professional video, too.",
    "But the problem with the Sony A1, for photographic specialists at least, is that it provides so many features and functions that simply aren’t relevant to your needs, despite its universal abilities.",
    "For photographers who mainly focus in one or two genres of photography where detail is key, such as product, portrait or landscape shooting, a specialist camera like the Fujifilm GFX100S is a much smarter buy.",
    "In fact, a 102MP medium format camera that doesn’t weigh a tonne and produces incredibly detailed images is really the ultimate landscape photography tool – albeit one that commands a price tag that's as epic as the scenes you'd hope to capture with it."
  ],
  "headers": {
    "7": "Nailing the fundamentals",
    "17": "Glass ceiling",
    "21": "Counting the cost",
    "26": "Master of one"
  },
  "links": {
    "Fujifilm GFX100S": "https://www.techradar.com/reviews/fujifilm-gfx100s",
    "Sony A1": "https://www.techradar.com/reviews/sony-a1",
    "Fujifilm X-T4": "https://www.techradar.com/reviews/fujifilm-x-t4",
    "Fujifilm GFX100S vs Sony A1": "https://www.techradar.com/news/fujifilm-gfx100s-vs-sony-a1-which-is-the-best-mirrorless-powerhouse",
    "Sony A7R IV": "https://www.techradar.com/reviews/sony-alpha-a7r-iv-review",
    "Sony A9 II": "https://www.techradar.com/reviews/sony-alpha-a9-ii"
  }
}