{
  "source": "https://www.techradar.com/news/russian-cosmonauts-find-new-cracks-in-international-space-station-module",
  "title": "Russian cosmonauts find new cracks in International Space Station module",
  "category": "appliances",
  "updated": "2021-08-30T20:08:46Z",
  "author": "john-loeffler",
  "summary": "No reported air leaks, thankfully",
  "article": [
    "Russian space officials say that cosmonauts on the International Space Station (ISS) found fresh cracks in one of its modules, presenting another challenge for the aging space station.",
    "\"Superficial fissures have been found in some places on the Zarya module,\" Reuters reported Vladimir Solovyov, chief engineer of rocket and space corporation Energia, as telling the Russia-based RIA news agency. \"This is bad and suggests that the fissures will begin to spread over time.\"",
    "Solovyov did not say whether the fissures had caused any air to leak from the ISS.",
    "News of the fissures comes after last month's incident at the ISS where a Russian module that was docked with the station accidentally fired its thrusters, knocking the station briefly off course.",
    "Though engineers back in mission control were able to course correct, there is concern that the unexpected stress on the structure might have damaged it in ways and places engineers have not yet identified.",
    "There have also been other recent problems, like last month's report of a drop in air pressure in the ISS's Zvezda module which was found to be caused by an air leak.",
    "Though construction of its main section continued until 2011, the ISS has been continuously inhabited since November 2000.",
    "In space terms, 20-plus years is a long time to be exposed to the various hazards of a vacuum, especially considering the ISS' orbital routine: each trip around the earth (which is every 90 minutes), the station transitions between the extreme cold of space and unshielded heat of solar radiation when it passes from the night side and the day side of its orbit.",
    "All that wear and tear is going to leave a mark, so the fact that there are superficial fissures on the ISS isn't unexpected, but it's a reminder that nothing is permanent and that the incredible mission of the ISS is soon nearing its end. Hopefully, these new fissures won't hurry that end along too quickly though, as the ISS is slated to operate at least until 2024, with a possible extension to 2028."
  ],
  "headers": {
    "6": "Analysis: ISS is starting to show its age"
  },
  "links": {
    "Reuters": "https://www.reuters.com/lifestyle/science/russian-cosmonauts-find-new-cracks-iss-module-2021-08-30/?taid=612cdb0664e3e400018ffa0c&utm_campaign=trueAnthem:+Trending+Content&utm_medium=trueAnthem&utm_source=twitter",
    "ISS has been continuously inhabited": "https://www.space.com/16748-international-space-station.html"
  }
}