{
  "source": "https://www.techradar.com/news/online-payment-fraud-is-costing-business-owners-billions",
  "title": "Online payment fraud is costing business owners billions",
  "category": "computing",
  "updated": "2021-07-05T10:29:24Z",
  "author": "rob-clymo",
  "summary": "Merchants are facing growing tide of online fraud attacks",
  "article": [
    "Businesses are set to suffer over $206 billion in losses from identity fraud in the period between 2021 and 2025, according to new figures.",
    "A study from Juniper Research has highlighted growing issues for merchants, especially since the arrival of the global coronavirus pandemic. To put the huge figure into perspective; Juniper’s number is equivalent to nearly 10 times Amazon’s net income for the 2020 financial year.",
    "There has been a surge in synthentic identity and account takeover fraud, which can compromise entire accounts and the payment data of customers. However, the research indicates that merchants do have the potential for fighting back, by enlisting the help of machine-learning-based fraud prevention platforms to combat the wave of increasingly sophisticated criminal attacks.",
    "Central to the problem is the sale of physical goods that have been purchased remotely through e-commerce outlets, with the fallout of resulting online payment fraud accounting for over 47% of fraud losses so far this year.",
    "However, business owners are fighting back and attempting to counter the growing threat of identity fraud by improving their fraud detection and prevention systems. Spending on boosting these is expected to be over $11.8 billion globally by 2025, up from $9.3 billion in 2021.",
    "The Juniper Research findings show that businesses will increasingly need the help of fraud protection and prevention vendors who can help them tackle the growing range of online payment options available through e-commerce channels.",
    "Business owners are also having to reshape their online shopping outlets to work in tandem with developing payment trends, such as open banking. Along with creating more robust e-commerce payment solutions, business are also being advised to invest in additional measures, including identity theft software and password managers.",
    "Research co-author Nick Maynard explains: “Given the large amounts of online payment transactions globally, it is essential that this transactional data is leveraged to continually detect fraudulent transactions. Payment providers who can use this data to identify new fraud sources and tactics will be those who prove to be the most resilient to this significant market loss.”"
  ],
  "headers": {
    "4": "Payment fraud"
  },
  "links": {
    "identity fraud": "https://www.techradar.com/best/best-identity-theft-protection",
    "synthentic identity": "https://www.techradar.com/news/how-do-digital-id-tools-combat-identity-theft",
    "account takeover": "https://www.techradar.com/news/from-account-takeover-to-identity-theft-what-can-be-done",
    "payment data": "https://www.techradar.com/news/online-shoppers-are-being-put-at-risk-from-lack-of-payment-security-compliance",
    "fraud prevention": "https://www.techradar.com/news/world-of-tech/roundup/the-small-business-guide-to-preventing-online-fraud-1101869",
    "e-commerce outlets": "https://www.techradar.com/news/the-best-ecommerce-platform",
    "fraud detection": "https://www.techradar.com/news/e-commerce-fraud-cost-tops-dollar20-billion-a-year",
    "online payment": "https://www.techradar.com/best/best-payment-gateways",
    "e-commerce channels": "https://www.techradar.com/news/computing/servers/how-to-choose-the-right-server-for-your-e-commerce-site-1176935",
    "open banking": "https://www.techradar.com/news/open-banking-gets-its-very-own-app-store",
    "identity theft software": "https://www.techradar.com/best/best-identity-theft-protection",
    "password managers": "https://www.techradar.com/best/password-manager"
  }
}