{
  "source": "https://www.techradar.com/news/ps5-vs-ps4-pro",
  "title": "PS5 vs PS4 Pro: should you upgrade?",
  "category": "gaming",
  "updated": "2021-12-02T14:53:39Z",
  "author": "gerald-lynch",
  "summary": "The PS5 is here – but is Sony's new console right for you?",
  "article": [
    "In the PS5 vs PS4 Pro battle, which console should you buy? If you're buying new should you go for the latest release? And if you're already a PS4 Pro owner, are the differences between the two consoles significant enough to justify an upgrade? We can help you figure all of that out.",
    "The most important thing to know is that the PS5 is Sony’s newest console and has replaced the PS4 Pro as its most powerful offering. With better CPU, GPU and an internal NVMe SSD, the PS5 is, overall, a faster and more capable console. The PS5 also comes with the new DualSense controller, which has new and exclusive features like haptic feedback and adaptive triggers to truly immerse you in your games.",
    "That’s not to say, though, that if you currently have a PS4 Pro you should just push it aside. While the PS5’s exclusive library is growing with titles like Returnal and Demon’s Souls, there are still plenty of cross-generation releases to enjoy and it has a huge library of existing games that shouldn’t be missed.",
    "It's also worth noting for those considering upgrading that finding where to buy the PS5 is still somewhat challenging, though we’re hoping stock levels will continue to improve as we approach Christmas 2021. For those buying new, though, it's double trouble as the PS4 Pro actually isn’t easy to get either given it’s been discontinued.",
    "We've reviewed both the PS5 and PS4 Pro, so we're more than familiar with the strengths and weaknesses of both consoles. The PS5 is the latest and greatest Sony has to offer but that doesn’t mean the PS4 Pro is totally outdated yet. Read on so that we can help you decide which is right for you or whether it’s time for an upgrade.",
    "Sony's top-tier PS5 costs $499.99 / £449.99 / AU$749.95, while the PlayStation 5 Digital Edition (identical, except without a disc drive) comes in at $399.99 / £349.99 / AU$599.95.",
    "The PS5 cost $100 more than the PS4 Pro launch cost of $399 (£349, AU$559) – but that's to be expected. It's a brand new machine using cutting edge technology, whereas the PS4 Pro was built upon the foundations of the existing PS4, and was considered a mid-gen upgrade.",
    "You can sometimes do better than that RRP of the PS4 Pro during sales— it plunged to just £299 in the 2020 Black Friday PS4 sales when bundled with Death Stranding—but now that it’s been discontinued you’re likely to see it’s increasingly hard to find in stock. If your heart is set on a PS4 Pro, getting it second hand could present good value (though there have been price hikes even in that area thanks to recent shortages). But if you're really looking for your console to be brand new, the PS5 and its all-digital counterpart are backwards compatible and as such, while they’re more expensive, they're probably the better value option in the long run.",
    "The PS5 is armed with impressive specs for a console, offering an AMD Zen 2-based CPU and a custom RDNA 2 GPU with over 10.28 TFLOPs of computing power. What that equates is that most games will run at 4K/60, with some games able to achieve 4K/120fps - there's even support for 8K resolution in the future.",
    "The PS5 is also capable of the graphically intensive technique known as ray tracing. Found in some of the prettiest PC games around, like Control, Metro Exodus, and Battlefield V, ray tracing is an innovative means of rendering light and shadows realistically.",
    "But since every 'ray' of light has its own simulated source, only now has the power required been viable in a console. In other words, ray tracing is going to make games like Horizon Forbidden West look more realistic than ever before.",
    "And if that wasn't treat enough for your corneas, there's word of 8K support, too. But when it comes to whether you should choose between the 4K vs 8K consoles, know that 8K won't be a mainstream prospect for some years yet. In fact, the option to select 8K on the PS5 doesn't exist yet and will be added via a firmware update in the future.",
    "Ray tracing aside, another huge generational leap the PS5 boasts over the PS4 Pro is its solid state drive (SSD) – a long overdue upgrade that PC players have enjoyed for years. Games can load up to 19-times faster. And, although the SSD in the PS5 is only 825GB (with only 667.2GB available), it's a welcome change over the slow, mechanical drives of old.",
    "Meanwhile, the PS4 Pro is still held back by its ageing HDD. While the PS4's UI design felt seamless as you could easily pick up a game where you left off from standby or after visiting other apps, you'll eventually be envious of the lack of loading screens PS5 players enjoy. Even if you upgrade the PS4 Pro with an SSD, it won't be able to offer the same bandwidth available in the PS5.",
    "The PS4 Pro also doesn't have the 4K Blu Ray player that the PS5 thankfully does, nor does it have the option to go disc-drive free like the all-digital PS5 offers.",
    "PS5 also features an entirely new audio engine known as Tempest 3D audio. It's a form of spatial audio, and is capable of handling hundreds of sound sources. You'll want to grab one of the very best gaming headsets to experience it, though Sony also added added 3D audio support for TV speakers on the PS5 and PS5 Digital Edition on September 15 2021.",
    "Meanwhile, here are the PS4 Pro's specs:",
    "The refreshed mid-gen model proved a decent jump on the base PS4: it supports 4K streaming from Amazon and Netflix, but native 4K gaming isn't possible on all titles, and only then you're usually capped to 30fps.",
    "Naturally the PS5 is a healthy power jump over the PS4 Pro, but if you're all about the best graphics, can't get your head around gaming on PC, and are platform agnostic, it's also worth considering the most powerful console on the market today, the Xbox Series X.",
    "When the PS5 design was revealed it proved divisive. Even on the TechRadar team there were those who loved it and those who hated it. This is partly because the PS5 design is just such a departure from Sony's usual approach with its two-tone color scheme and its curved futuristic shape.",
    "The PS5 is also the biggest console Sony has ever made. The PS4 Pro, on the other hand, looks more like a traditional console and is sits unobtrusively within any entertainment set up. It's slim, light at 3.3 kg and not in the least controversial. The same can't be said about the PlayStation 5.",
    "The PS5's gargantuan size does give it one significant advantage over the PS4 Pro, though: it's practically silent, and produces a minimal amount of heat, too. The PS4 Pro, meanwhile, can kick up a fuss when playing certain games, and it's also guilty of spitting out a lot of heat.",
    "If you buy a PS4 Pro now, we hope you've got some time off sorted: Bloodborne, God of War, Uncharted 4, The Last of Us and its The Last of Us 2, The Last Guardian, and Marvel's Spider-Man are exclusive to Sony's box, alongside killer multi-platform experiences like Red Dead Redemption 2 and Control.",
    "The good news? Nearly all of those games are backward-compatible on PS5. Some, like GTA 5, Madden 21 and Destiny are even getting big PS5 overhauls. Better still, Sony's new PS Plus subscriber perk, PlayStation Plus Collection, offers PS5 owners free access to 20 of the best-ever PS4 games to download to their new consoles from the get-go, including titles like God of War, Uncharted 4, Ratchet and Clank and Bloodborne, provided they remain subscribers to the service. It's something that the PS4 Pro, even with a PS Plus subscription, can't match. That's a lot of gaming for your money.",
    "On top of that, the PS5 has a number of games that will be exclusive to next-gen. While Marvel's Spider-Man: Miles Morales and Horizon Forbidden West are also available on PS4 Pro, God of War 2 and Final Fantasy 16 will be PS5 only. So if you're all about access to the latest and greatest, it's worth noting that the PS5 will have the lead on that front for some games.",
    "It's also worth noting that some of the next-gen games are more expensive. 2K Games announced that NBA 2K21 on PS5 and Xbox Series X costs $10 more than its PS4 and Xbox One counterparts, bringing the standard version of the game on next-gen consoles up to $70 (or £60). It's not a small price increase and in an interview with GamesIndustry.biz, research company IDG revealed that other publishers are also considering raising the base price of next-gen games, meaning PS5 games will likely cost you more.",
    "\"While the cost of development and publishing have gone up, and pricing in other entertainment verticals has also gone up substantially, next-gen software pricing has not reflected these increases. $59.99 to $69.99 does not even cover these other cost increases completely, but does move it more in the proper direction.\"",
    "In all honestly, there's little reason to buy a PS4 Pro right now unless your budget is very strict. Not only is the PS5 a more powerful, faster box, but Sony's efforts to enable backwards compatibility means that even if you buy a PS5, you won't miss out on the PS4's finest experiences, and probably those older than that, too. Most also run better than ever before, with games like Ghost of Tsushima now able to run at 60fps on PlayStation 5.",
    "If you've been waiting this long to buy your first PS4, you’re probably better off going straight to the PS5 for future-proofing purposes as much as anything.",
    "That said, upgrading from a Pro is another matter and a tougher dilemma. The Pro already supports 4K for many games at decent performance, and you'll need deep pockets for an 4K TV with HDMI 2.1 support to fully benefit from the PS5's power and higher frame rates. With that in mind, don’t feel like you need to push your PS4 Pro to the side and get a PS5 right now. There’s still a lot your Pro can do for you and while stock for the PS5 is hard to come by it’s still a strong console to have.",
    "Not going with Sony at all? Here's how you can buy Xbox Series X and our predictions for the best Xbox Series X bundle deals."
  ],
  "headers": {},
  "links": {
    "PS4 Pro": "https://www.techradar.com/reviews/ps4-pro",
    "PS5": "https://www.techradar.com/reviews/ps5",
    "DualSense": "https://www.techradar.com/reviews/dualsense-wireless-controller",
    "Returnal": "https://www.techradar.com/reviews/returnal-review",
    "Demon’s Souls": "https://www.techradar.com/reviews/demons-souls-review",
    "where to buy the PS5": "https://www.techradar.com/news/where-to-buy-ps5",
    "been discontinued": "https://www.techradar.com/news/playstation-4-consoles-begin-to-be-discontinued-as-ps5-generation-arrives",
    "PlayStation 5 Digital Edition": "https://www.techradar.com/news/sony-isnt-ready-for-a-ps5-digital-edition",
    "Black Friday PS4 sales": "https://www.techradar.com/cyber-monday/ps4-and-ps4-pro-cyber-monday-deals-bundles-2020",
    "Death Stranding": "https://www.techradar.com/reviews/death-stranding-directors-cut-review",
    "ray tracing": "https://www.techradar.com/news/ray-tracing",
    "Control": "https://www.techradar.com/reviews/control-review",
    "Metro Exodus": "https://www.techradar.com/reviews/metro-exodus-review",
    "Battlefield V": "https://www.techradar.com/news/battlefield-v-review-an-improved-yet-incomplete-multiplayer-shooter",
    "Horizon Forbidden West": "https://www.techradar.com/news/horizon-2-forbidden-west-ps5-release-date-trailer",
    "4K vs 8K": "https://www.techradar.com/news/4k-vs-8k-is-it-worth-upgrading-to-full-uhd",
    "4K Blu Ray player": "https://www.techradar.com/news/video/the-best-4k-blu-ray-players-you-can-buy-right-now-1321481",
    "best gaming headsets": "https://www.techradar.com/news/best-ps4-headsets",
    "Xbox Series X": "https://www.techradar.com/reviews/xbox-series-x",
    "loved": "https://www.techradar.com/news/why-i-love-the-design-of-the-ps5",
    "hated": "https://www.techradar.com/news/why-i-hate-the-design-of-the-ps5",
    "The Last of Us 2": "https://www.techradar.com/reviews/the-last-of-us-2-review",
    "The Last Guardian": "https://www.techradar.com/news/the-last-guardian-review",
    "Marvel's Spider-Man": "https://www.techradar.com/news/spider-man-review",
    "Red Dead Redemption 2": "https://www.techradar.com/news/red-dead-redemption-2-reviews",
    "PlayStation Plus Collection": "https://www.techradar.com/news/ps-plus-collection-for-ps5-gives-you-16-top-ps4-games-for-free-with-your-subscription",
    "Marvel's Spider-Man: Miles Morales": "https://www.techradar.com/news/spider-man-miles-morales-ps5/reviews/marvels-spider-man-miles-morales-review",
    "God of War 2": "https://www.techradar.com/news/god-of-war-2-ps4-everything-we-know-about-the-rumored-god-of-war-sequel",
    "Final Fantasy 16": "https://www.techradar.com/news/final-fantasy-16-confirmed-for-next-gen-but-its-a-ps5-exclusive",
    "NBA 2K21 on PS5 and Xbox Series X costs $10 more": "https://www.techradar.com/news/cross-gen-ps5-and-xbox-series-x-gaming-is-getting-very-confusing-and-expensive",
    "GamesIndustry.biz": "https://www.gamesindustry.biz/articles/2020-07-02-idg-other-publishers-are-considering-raising-game-prices-for-ps5-and-xbox-series-x",
    "Ghost of Tsushima": "https://www.techradar.com/reviews/ghost-of-tsushima-review",
    "4K TV": "https://www.techradar.com/news/television/10-best-ultra-hd-4k-tvs-in-the-world-today-1198304",
    "buy Xbox Series X": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft",
    "Xbox Series X bundle deals": "https://www.techradar.com/news/where-to-buy-xbox-series-x-right-now-new-console-available-ahead-of-launch-at-microsoft"
  }
}