{
  "source": "https://www.techradar.com/news/how-without-remorse-reinvents-tom-clancy-movies-for-the-modern-age",
  "title": "How Without Remorse reinvents Tom Clancy movies for the modern age",
  "category": "entertainment",
  "updated": "2021-05-01T13:00:00Z",
  "author": "tom-power",
  "summary": "Bringing the Ryanverse into the 21st century",
  "article": [
    "Spoilers follow for Without Remorse.",
    "The team charged with developing Without Remorse wants audiences to associate Tom Clancy with movies again. Recently, the acclaimed author’s name has become synonymous with video games based on his works, but that wasn’t always the case.",
    "Throughout the 1990s, Clancy’s hugely successful novels were adapted into blockbuster films, including Patriot Games and The Hunt for Red October. Interest in such action thrillers, though, seemingly cooled around the turn of the century, with only two middling Clancy-based movies – and a Jack Ryan TV series – being produced since.",
    "The makers of Without Remorse, then, hope to reinvent Clancy’s Cold War-set novels for today’s film fans. Ahead of its April 30 launch on Amazon Prime Video, TechRadar spoke to the movie’s cast and crew to find out how it updates Clancy’s novel of the same name for modern audiences. We also hear how the actors prepared for the movie’s demanding action sequences, and discuss plans for the already-confirmed sequel.",
    "Without Remorse tells the tale of John Clark (Michael B. Jordan), a former US Navy SEAL out for revenge after his wife Pam (Lauren London) is murdered. Following a hostage rescue mission in war-torn Syria, during which Clark and his team kill a number of ex-Russian special forces personnel, Clark – who’s since left the military – and his wife are attacked in their home by Russian mercenaries.",
    "The group kill Pam and leave John for dead, and after recovering from his injuries, a rage-filled Clark seeks retribution against those responsible. Teaming up with Navy SEAL Karen Greer (Jodie Turner-Smith) and shady CIA agent Robert Ritter (Jamie Bell), and aided by US Secretary of Defense Thomas Clay (Guy Pearce), Clark hunts down his wife’s killers. As he does so, however, Clark becomes embroiled in a wider conspiracy that threatens the fragile peace between the US and Russia.",
    "While Clancy’s book is set during the height of the Cold War - Clark’s rescue mission taking place in Vietnam - and the events of the movie take place in the present day, there are parallels between the two. Relations between the US and Russia remain as frosty now as they did before the dissolution of the Soviet Union in 1991, which aided the process of translating the novel’s plot from page to screen. The carrying over of specific characters, namely Clark, Ritter and Greer, also maintains some links between the two mediums.",
    "That, though, is where the similarities end. Despite wanting to retain the “soul and spirit” of the source material, director Stefano Sollima was eager to bring Clark’s story into the present day, which meant swapping out one US-Russia proxy conflict for another.",
    "“We didn’t want to make a period movie,” Sollima explains. “The book was written in 1993, but was set during the Vietnam War. We wanted to tell that story, which gels politics with the technicality of warfare, but we changed the geopolitical setup from Vietnam to Syria. The political idea is still the same, but we wanted to reflect the current society that we live in.”",
    "The modernization process also extends to character ethnicities and genders. In contrast to their white male book counterparts, Clark and Greer are Black, and Greer is female. These changes, Sollima says, were necessary to distinguish the movie from the source material and other John Clark cinematic portrayals, and to better represent the diversity of our society.",
    "It’s a move that both Jordan and Turner-Smith, who play Clark and Greer respectively, agree with. The duo, though, are keen to stress that changing Greer’s gender was about illustrating male and female camaraderie in the armed forces, rather than anything romantic.",
    "“We had to make sure that the audience understood that,” Jordan says. “We didn’t want anybody to be misunderstood by the relationship. It’s more like ‘I’ve got your back through thick and thin, and I won’t leave you behind’. It was about defining that dynamic while also being respectful of John’s relationship with Pam, and honoring John’s motivation throughout the movie.”",
    "“It’s really about platonic love,” Turner-Smith adds. “We tried to infuse that in our scenes even when we’re butting heads. Even if my character doesn’t understand what Michael’s is going through, it’s about being there for him and taking action to help him.”",
    "The action that Turner-Smith alludes to required plenty of heavy lifting, from a physical standpoint, for the movie’s key players. Under the supervision of ex-Marines, the cast trained for months to ensure they could portray Navy SEALs – the US Navy’s primary special forces outfit – authentically, particularly during the movie’s opening rescue mission sequence.",
    "\"They made sure we had integrity with the way we moved in combat, used our weapons and commanded each other in groups,” Turner-Smith reveals. “These men work together all of the time to the point where they become a unit, so we needed to emulate this idea that we’d been working together for years.”",
    "Without Remorse’s biggest set-pieces, though, are reserved for Jordan’s Clark. The film’s protagonist endures plenty of physical pain, alongside the emotional turmoil of losing his wife, as he heads from one encounter to the next.",
    "Jordan’s training, though, didn’t just require him to learn some lengthy and brutal close-quarters combat sequences. Clark also battles the elements in his pursuit of his wife’s killers, and two particular set-pieces required Jordan to master holding his breath underwater – something the actor was capable of doing for three minutes by the time filming began.",
    "“We had military divers who put me through some stressful situations in water tanks,” Jordan says. “I had to work through gear malfunctions and rebreathers, which suppress any bubbles so soldiers can breathe underwater without leaving any physical trace. The training was very detailed but, if you’re calm and sitting still, you can hold your breath for longer. We created an environment for us to relax and be at peace underwater, which was necessary for one of those scenes.”",
    "While most film studios wait to greenlight sequels to potentially popular movies, that isn’t the case here. Paramount Pictures has already signed off on a follow-up film and, as Without Remorse’s post-credits scene teases, it’ll follow Clark – now known as John Kelly – as he sets up the multinational counter-terrorism unit known as Rainbow Six.",
    "Little is known about the Without Remorse sequel outside of Jordan reprising his role as Clark/Kelly. Sollima, though, is keen to be reunited with the Black Panther and Creed actor for the next instalment. It’s a film that could even lead into a full-blown live-action adaptation of Clancy’s MCU-esque Ryanverse, although Sollima didn’t elaborate on which other Clancy-created characters may appear.",
    "“Of course,” Sollima says when asked if he’d like to direct the sequel. “Rainbow Six is the next [novel] that primarily follows John, so he’ll be the main character. It was challenging and bizarre to complete post-production on Without Remorse due to the pandemic, but it was also a beautiful experience. I would love to return.”",
    "Without Remorse is available to stream now on Amazon Prime Video."
  ],
  "headers": {
    "4": "Old age hero, new world order",
    "13": "Fight to survive",
    "18": "Calling in reinforcements"
  },
  "links": {
    "Without Remorse": "https://www.techradar.com/reviews/without-remorse-review",
    "already signed off": "https://www.ign.com/articles/michael-b-jordan-explains-why-without-remorse-is-ignoring-the-rainbow-six-games-for-now",
    "reprising his role": "https://variety.com/2018/film/news/michael-b-jordan-john-clark-tom-clancy-movies-1202896241/"
  }
}