{
  "source": "https://www.techradar.com/news/google-home-prices-deals",
  "title": "The cheapest Google Home sales for December 2021: the best Home Mini, Hub, and Max deals",
  "category": "audio-visual",
  "updated": "2021-12-01T08:06:52Z",
  "author": "tabitha-baker",
  "summary": "See the best deals on the best-selling Google Home speaker",
  "article": [
    "Your guide to the best Google Home sales that are happening online. We're rounding up the best deals on Google's smart home speaker lineup, including the Google Home, Google Home Mini, Google Nest Hub (previously known as the Google Home Hub), and the Google Home Max. We've also added the latest sales for the new Google Nest Hub Max and Google Nest Mini devices.",
    "The Google Home family of smart speakers are amongst the most popular smart speakers on the market that tap into the convenience of voice control. And don't tell Alexa, but Google Assistant has proved to be considerably smarter at answering our requests. The Google Home and Google Home Mini are roughly on a par with the Amazon Echo range in terms of audio quality for music, but the newer Google Home Max frankly thrashes any of Amazon's Echo speakers for music fans that want to feel every beat.",
    "After you save on your new smart speaker, getting going with it is as simple as a voice command. All you need to do is say 'Ok Google' and ask your Google Home any question you like. Google Assistant uses the enormously powerful Google search engine to bring you the answer.",
    "More features and apps are being added all the time, but right now, you can stream music from Google Play, Spotify, Tunein, or your phone. There are smart home tech features to pair it with too, so watch in awe as your smart lights and thermostats are told what to do. Even the basic features prove incredibly handy, such as adding items to shopping and to-do lists or setting alarms – finally, no more burnt pizza!",
    "The Google Home Mini is a smaller cheaper version of Google Home, first unveiled in 2017. Instead of a pricey £129/$129, like its bigger older brother, you pay $49 in the US and £49 in the UK for the Home Mini but you can get it for much less at regular intervals throughout the year.",
    "Naturally, the Google Home Mini comes with Google Assistant, meaning you ask it questions by simply starting with, \"Ok, Google.\" And with the power of Google search engine behind it and now a super low price to match, Alexa's time may be up.",
    "Color options include chalk (grey), charcoal (black) coral (pink) and the newest entry is mint (light green). At such a cheap price point, you may be tempted to get more than one, especially for family homes as a new Broadcast app allows you to talk to any Google Home device in the house.",
    "Google Home Mini deals have been strong of late as Google is keen to catch up to the Amazon Echo Dot sales, so you'll rarely have to pay the full RRP. Check out our full Google Home Mini review for the full rundown on the diminutive smart speaker.",
    "There are some modest upgrades found in the Google Nest Mini - the long-awaited follow up to the Google Home Mini. As far as the visual design goes, nothing has changed though, which is a little disappointing in all honesty and certainly won't have many people trading in their older model an immediate upgrade.",
    "The Nest Mini has slightly improved capacitive control features for volume and playback, with sensor-activated LEDs guiding your hand to the correct control spots. While the Google Nest Mini is still powered by Google Assistant, it now utilizes onboard machine learning to fine-tune your queries and speed up response times over the Home Mini. There's also a new slot on the underside of the device that will let you hang the speaker on a wall.",
    "The speaker is supported by an improved bass, and an overall larger speaker system housed in the same chassis. We found the original version to be surprisingly loud for a cheap music player and the extra bass is appreciated here. The Nest Mini has the same starting price as the Home Mini but the older device is often on sale for much less and we expect the Nest Mini to follow suit to keep up the pace on Amazon's Echo Dot series.",
    "The standard Google Home was the first smart speaker Google released. It costs a fair bit more than the Home Mini, but the more powerful speaker can be worth it if you want to play louder music. It's a great middle option between the choice of three speakers and considerably cheaper than the high-end Google Home Max.",
    "So, how much is the original Google Home? Prices started around the $129 / £129 mark, but retailers are slowly getting more competitive nowadays. We're seeing more discounts to keep the price well below this. Need to know more? Then check out our full Google Home review.",
    "The Google Home Hub has now been renamed Google Nest Hub. It's taking a while for retailers to update their listings though. The two items are actually exactly the same, it's just a name change. So don't be alarmed if the retail box simply has a sticker over the old name.",
    "We've been waiting a while for a screen on one of Google's smart speakers and late in 2018 we finally got one with the Google Home Hub. With a RRP of just $149 / £139 / AU$219, the Nest Hub is much cheaper than the similarly-sized Amazon Echo Show.",
    "The Google Nest Hub naturally supports a huge range of smart home products like Hue bulbs, Nest thermostats and so on. Unlike the Amazon Echo Show, you're getting full YouTube support, which is great for watching music video, trailers, cooking videos, how-to content and so on - a huge advantage over the rival device. We frequently find the voice-activated Google Assistant outperforms Amazon's Alexa at pretty much every turn too.",
    "The Nest Hub doesn't have a camera built-in, so you can't use it for video calls. If that's something you really want, we've rounded up the latest Amazon Echo Show prices for you too or take a look at the Google Home Hub Max below. For more details on this one though, take a look at our Google Nest Hub review.",
    "Want something a bit larger than the Google Nest Hub (aka Google Home Hub)? Then you might want to take a look at the newest member of Google smart speaker family as it comes with a 10-inch display.",
    "Unlike the smaller version, there is a camera on this version too giving you the option of video calls via the free Google Duo app which is also available on smartphones and PCs. There's also a switch on the device to turn the camera and mic off for added privacy.",
    "A built-in Chromecast allows you to stream content directly to the screen too if you're able to place the Nest Hub Max close enough to enjoy watching on its 10-inch screen as it's not exactly designed to be held in your hands. The new gesture controls are a handy extra option for controlling media playback without raising your voice or touching the screen too.",
    "If the camera features, gesture controls and larger display aren't key points for you, then the smaller version is seriously cheaper than this one and might be your better option.",
    "Ok, so you're after some serious boom for the tunes? Then you'll want to take a look at the monster-sized Google Home Max. This large-speaker houses two 4.5-inch woofers for high-fidelity music playback along with the Google Assistant tech that's proved so popular in the Google Home range of smart speakers. Technically, this speaker is what we'd call super smart as it'll adjust its music playback automatically depending on room-size and placement. The microphone has been improved too and is more than capable of picking up your requests from the other side of the room even with music blaring out at significant volume.",
    "The Google Home Max prices tend to match the name to with a $399/£399 pricetag. That being said, prices have started to drop more recently, so you should be able to get a better deal as seen above. If you'd like to see the full rundown, be sure to take a quick look at our Google Home Max review.",
    "The bottom part of the original Google Home speaker can be swapped out for different 'bases' to replace the default grey one. They're not cheap though and the official ones are only available from the Google Store at the time of writing.",
    "Fabric bases are the cheapest at $20/£18 and come in Mango (orange), Marine (green) and Violet. Metal bases are $40/£36 and come in Carbon (black), Copper and Snow (slightly grey). We might just have to splash out for that Violet one though.",
    "We've seen some third-party sales and knock-offs, mainly leather-style ones, at Amazon and eBay, but nothing particularly tempting so far and the prices aren't that much cheaper either."
  ],
  "headers": {
    "23": "What are Google Home bases?"
  },
  "links": {
    "Google Assistant": "https://www.techradar.com/how-to/google-assistant-how-to-make-your-google-home-speaker-work-for-you",
    "smart lights": "https://www.techradar.com/news/best-smart-lighting",
    "Google Home Mini review": "https://www.techradar.com/reviews/google-home-mini",
    "Google Home review": "https://www.techradar.com/reviews/google-home",
    "Amazon Echo Show prices": "https://www.techradar.com/news/the-best-amazon-echo-and-amazon-echo-dot-deals",
    "Google Nest Hub": "techradar.com/uk/reviews/google-home-hub",
    "Google Home Max": "https://www.techradar.com/reviews/google-home-max",
    "Google Store": "https://www.anrdoezrs.net/links/8904327/type/dlg/sid/trd-us-1003914351149539200/https://store.google.com/config/google_home_base",
    "Amazon": "https://target.georiot.com/Proxy.ashx?tsid=8428&GR_URL=https%3A%2F%2Famazon.com%2Fs%2Fref%3Dnb_sb_noss_2%3Furl%3Dsearch-alias%253Daps%26field-keywords%3Dgoogle%2Bhome%2Bbase%26tag%3Dhawk-future-20%26ascsubtag%3Dtrd-us-9573293411013482000-20",
    "eBay": "http://www.ebay.com/sch/i.html?_odkw=google+home+base&_osacat=0&_from=R40&_trksid=p2045573.m570.l1313.TR2.TRC1.A0.H0.Xgoogle+home+bases.TRS0&_nkw=google+home+bases&_sacat=0&mkevt=1&mkcid=1&mkrid=711-53200-19255-0&campid=5337827784&customid=trd-us-1372650239927177700"
  }
}