{
  "source": "https://www.techradar.com/news/jbl-flip-5-vs-jbl-charge-5-the-waterproof-bluetooth-speakers-go-head-to-head",
  "title": "JBL Flip 5 vs JBL Charge 5: the waterproof Bluetooth speakers go head to head",
  "category": "audio-visual",
  "updated": "2021-09-18T15:00:20Z",
  "author": "olivia-tambini",
  "summary": "Which JBL Bluetooth speaker is best for you?",
  "article": [
    "JBL makes some of the best Bluetooth speakers on the planet, and the Flip 5 and Charge 5 are no exceptions – and that makes choosing between them very difficult indeed.",
    "The JBL Flip 5 is one of the brand’s most simple waterproof speakers, eschewing some of the more complex features such as multi-room audio or built-in voice assistants that you’ll see from the likes of the Sonos Roam and the Bose Portable Home Speaker 500.",
    "It’s a similar story with the JBL Charge 5, although it has a larger footprint, can charge your phone on the move, and uses a more modern Bluetooth version than the Flip 5. It’s more expensive, too.",
    "So, should you save some cash and go for the JBL Flip 5? Or splurge on the more powerful JBL Charge 5? We’ve tested both portable speakers extensively to help you make the right choice.",
    "The JBL Flip 5 launched back in August 2019 for $119.95 / £119.99 / AU$149.95 as the successor to the Flip 4. However, now that it’s a little older, it’s possible to pick up the Flip 5 at a discount, with the model selling in the region of $100 / £90 / AU$130 these days.",
    "The JBL Charge 5 is more recent, having launched in 2021 for $179 / £159 / AU$229 – that’s relatively pricey for a Bluetooth speaker, and the same price as our favorite model, the Sonos Roam.",
    "In spite of its youth, we’ve already seen some JBL Charge 5 deals, with prices dropping to around £150 / AU$200. Unfortunately, we haven’t seen similar discounts in the US just yet.",
    "Both portable speakers are likely to be discounted over Black Friday 2021, when Bluetooth speaker deals are usually easy to find.",
    "Both the JBL Flip 5 and the JBL Charge 5 feature cylindrical builds, with rugged rubberized end caps to protect them from falls, and physical buttons situated on the top of each speaker to control music playback.",
    "The Flip 5 is the smaller of the two, weighing 0.54kg /1.2lb. It’s the size of a small flask, which means you can easily carry it around in one hand, pop it in a bag, or hang it from a door handle thanks to its shoelace strap.",
    "The Charge is about twice the size of its sibling, at 0.96kg / 2.1lb. It’s designed to sit horizontally, on its longest side, while the Flip 5 can be oriented horizontally or vertically.",
    "At each end of both speakers is an exposed passive bass radiator, which is designed to displace lots of air to create a powerful low-end. You might be able to see them move back and forth, but these radiators are slightly recessed into the main body of the speakers, protecting them from bumps and scrapes.",
    "Both speakers are waterproof, with an IPX7 rating, which means they can be submerged in one meter of water for up to 30 minutes. However, the JBL Charge 5 takes this one step further by introducing an IP6X dust-proof rating, which should prevent sand or grit from breaking its inner mechanisms.",
    "Both speakers are available in a range of colors, although you have more choice with the Flip 5. You can even customize the design of the Flip 5 to suit your taste exactly.",
    "Of the two speakers, the JBL Charge 5 delivers the most powerful sound, with deep bass frequencies, clear mids, and nicely rolled-off trebles for a warm soundstage. It does distort at higher volumes, though, so we’d recommend keeping the volume at about 50-60% to avoid harshness.",
    "Like the previous Charge speakers, the Charge 5 is directional, with its tweeters and woofers sitting behind the front of the speaker.",
    "While you might have expected 360-degree sound as a result of its cylindrical shape, the Charge 5 is directional, with its tweeters and woofers positioned at the front of the speaker.",
    "It’s the same story with the JBL Flip 5, although it does deliver a surprisingly wide soundstage – and impressive audio power – in spite of its small stature. It doesn’t suffer from distortion at high volumes in the same way as the Charge 5, and delivers enough clarity to extract all the detail you’d want from your songs if you’re listening casually.",
    "The JBL Flip 5 offers 12 hours of playback, with a full charge taking about two-and-a-half hours. Meanwhile, the Charge 5 comes with an impressive 20-hour battery life – if you’re playing music at 50% volume. Push those volume levels up, and you can expect the battery life to drop. Both speakers are charged via USB-C.",
    "Alongside Bluetooth connectivity, both speakers come with JBL’s PartyBoost feature via the JBL Connect app. This allows you to pair the units with another JBL speaker in stereo, or with up to 100 – yes, you read that correctly – speakers in mono for a wall of sound.",
    "Weirdly, the JBL Flip 5 comes with Bluetooth 4.2, compared to the Charge 5’s Bluetooth 5.2. It’s not the end of the world, but it does mean missing out on faster data speeds and a staggering wireless range of 780ft / 240m (4.2 offers a range around four times shorter).",
    "Neither speaker has a 3.5mm aux input, so you won’t be able to hook them up to other audio devices, such as a turntable.",
    "The Charge 5 comes with another trick up its sleeve: a USB-A port that lets you use the speaker to charge your phone as you listen to music – pretty handy if you’re using the Charge 5 in the great outdoors.",
    "If you’re deciding between the JBL Flip 5 and the JBL Charge 5, then your biggest consideration will probably be price. In that respect, the Flip 5 is your best bet, although both speakers are likely to be discounted in the run up to Black Friday 2021.",
    "Spend a little more money, however, and you could pick up a more powerful, louder Bluetooth speaker in the Charge 5. Not only does this speaker double as a portable charger for your phone, it comes with a much longer wireless range, too – handy, if you want to use the Charge 5 for outdoor parties.",
    "Still, both speakers sound excellent, are water-resistant, and offer great value for your money, while also standing out from the crowd with their cool, brightly colored designs. You can’t go wrong with either. But if you’re looking for a higher-spec alternative that can handle Wi-Fi connectivity, multi-room audio, and comes with a voice assistant, then check out the Sonos Roam – our pick for the best Bluetooth speaker you can buy today."
  ],
  "headers": {
    "4": "JBL Flip 5 vs JBL Charge 5: price and availability",
    "8": "Design",
    "14": "Audio performance",
    "18": "Battery life and connectivity",
    "23": "Takeaway"
  },
  "links": {
    "best Bluetooth speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "JBL Flip 5": "https://www.techradar.com/reviews/jbl-flip-5",
    "waterproof speakers": "https://www.techradar.com/news/best-waterproof-speaker",
    "Sonos Roam": "https://www.techradar.com/reviews/sonos-roam",
    "Bose Portable Home Speaker 500": "https://www.techradar.com/reviews/bose-home-speaker-500",
    "JBL Charge 5": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "portable speakers": "https://www.techradar.com/news/audio/portable-audio/10-best-portable-speakers-1069079",
    "Flip 4": "https://www.techradar.com/reviews/jbl-flip-4",
    "Black Friday 2021": "https://www.techradar.com/black-friday/black-friday-deals-sales",
    "Bluetooth speaker deals": "https://www.techradar.com/news/best-cheap-bluetooth-speaker"
  }
}