{
  "source": "https://www.techradar.com/news/apples-new-macos-monterey-brings-features-to-m1-macs-only",
  "title": "Apple's new macOS Monterey brings features to M1 Macs only",
  "category": "computing",
  "updated": "2021-06-22T15:06:19Z",
  "author": "daryl-baxter",
  "summary": "For M1 members only",
  "article": [
    "With Apple Silicon now available in most of the consumer Macs, it only made sense to see exclusive features arrive to the M1 line for macOS, which is happening sooner than you may think.",
    "It looks like macOS Monterey, which was recently announced at WWDC, is more of a refinement this year, bringing many useful features that almost makes it seem that it’s preparing for the rumored prosumer Macs, such as the MacBook Pro and iMac Pro lines, which could come with an updated M1X/M2 chip.",
    "This could be why we’re already seeing exclusive features on Monterey that will only appear on M1 Macs and not on your Intel Mac.",
    "There’s already a few exclusive features that may tempt you to upgrade to an M1 Mac earlier than you were planning to, especially where FaceTime and Spatial Audio is concerned:",
    "Apple’s next version of macOS is scheduled to release towards the end of this year. There’s currently a developer beta available, but that requires a developer account. However, there will be a public beta in July if you wish to try it out.",
    "As past releases have gone, there’s going to be updates to the beta versions as we near the final release, so some features may change or even disappear. While the above features aren’t likely to change for M1 Macs, we may see new features appear if new Macs with M1X/M2 chips are indeed on the way.",
    "Via 9to5Mac"
  ],
  "headers": {
    "3": "Which features are exclusive to M1 Macs?",
    "4": "When does macOS Monterey come out?"
  },
  "links": {
    "macOS Monterey": "https://www.techradar.com/news/macos-12",
    "WWDC": "https://www.techradar.com/news/live/apple-wwdc-2021-live-blog",
    "9to5Mac": "https://9to5mac.com/2021/06/08/macos-monterey-here-are-the-features-exclusive-to-m1-macs/#more-728589"
  }
}